{
  "title":"How to Build a Tournament Worthy Frog Deck",
  "url":"https://www.wikihow.com/Build-a-Tournament-Worthy-Frog-Deck",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "parts":[
    {
      "name":"Following General Guidelines",
      "steps":[
        {
          "headline":"Consider the Metagame.",
          "description":"This means doing a bit of research, if possible, and trying to get a feel for what types of decks are played most often, as well as the strategies, combos, and power cards used, in your area. This will help you decide what type of Frog deck to use. From this point up to the day you bring your Frog deck to it’s first Tournament you need to be going to tournaments regularly so you can get the best idea possible on the Metagame. Keep current on your metagame."
        },
        {
          "headline":"Research the Frog Decks and Cards.",
          "description":"There are multiple types of Frog decks out there; some are more successful than others. Here is a list of Frog Deck types for you to consider:\nDES Frog –  When you have 3 “DES Frog” on the field you can use the spell card “DES Croaking” to destroy all cards your opponent controls on their side of the field. Weenie Frog  – By using the field spell “Wetlands” you can give most frogs a 1200 atk bonus. This is perfect when using cards like Unifrog, whose boosted 1600 ATK can attack directly, or Submarine Frog, whose boosted 2400 ATK deals damage when attacking defense position monsters. Stall Frog – This deck is similar to the Weenie Frog deck, but takes a more conservative approach by using cards like Level Limit – Area B, and Gravity Bind, and even Messenger of Peace to make it harder for the opponent to attack. A good way to research card effects and rulings is to visit the website www.netrep.net . This website is a widely used, and well known card search database that helps you to identify potentially helpful cards. By doing a search for Frog in the Keywords tab, under “Name Contains” you can look up your frog monsters. By doing a search for Frog in the “Text Contains” box you can find many cards that will be able to help your frogs in a way. Also, keep in mind that there are a few more Frog cards that have been released recently that have not yet been uploaded to the Netrep Database, that are essential to any Frog Deck."
        },
        {
          "headline":"Update yourself on the current Limited  & Forbidden list.",
          "description":""
        },
        {
          "headline":"Build a Skeleton.",
          "description":"This means building a deck that serves as a starting point, so that you can see what you’re working with. It’s good to start with your “Staples”."
        }
      ]
    },
    {
      "name":"Building a Conservative Deck",
      "steps":[
        {
          "headline":"Use an example.",
          "description":"Here is an example deck list of a Conservative Weenie Frog deck that you can use as a Skeleton. If you play on Beyonds Duel Monster’s Unlimited, you can copy and paste this into the deck editor's “Add by Name” feature: \n20 monsters, 13 spells, 7 traps\nConservative Weenie Frog Deck\n\nMonsters: 20\n\nSpells: 13\n\nTraps: 7\n\nDupe Frog\n\nScapegoat\n\nTorrential Tribute\n\nDupe Frog\n\nHeavy Storm\n\nMirror Force\n\nDupe Frog\n\nGiant Trunade\n\nFroggy Force field\n\nSubstitoad\n\nMystical Space Typhoon\n\nNeedle Ceiling\n\nSubstitoad\n\nMonster Reborn\n\nNeedle Ceiling\n\nSubstitoad\n\nSalvage\n\nLimit Reverse\n\nTreeborn Frog\n\nSalvage\n\nLimit Reverse\n\nSangan\n\nTerraforming\n\n\n\nFlip Flop Frog\n\nWetlands\n\n\n\nFlip Flop Frog\n\nWetlands\n\n\n\nAbyss Soldier\n\nWetlands\n\n\n\nAbyss Soldier\n\nThe Flute of Summoning Kuriboh\n\n\n\nAbyss Soldier\n\nThe Flute of Summoning Kuriboh\n\n\n\nUnifrog\n\n\n\n\n\nUnifrog\n\n\n\n\n\nSubmarine Frog\n\n\n\n\n\nSubmarine Frog\n\n\n\n\n\nPoison Draw Frog\n\n\n\n\n\nWinged Kuriboh\n\n\n\n\n\nWinged Kuriboh"
        },
        {
          "headline":"Reconsider the Metagame.",
          "description":"By using the tips and warnings at the end of this article you can prepare for your Metagame easier."
        },
        {
          "headline":"Flesh out your Deck / Fix your Deck.",
          "description":"Change your skeleton so that it resembles something you feel could handle your Metagame."
        },
        {
          "headline":"Play the Deck.",
          "description":"If you have never played a frog deck before, now is a good time to see how it runs, before you get too far into it. Don’t take it to a tournament just yet; one of the greatest parts of running the frog deck is that people won’t expect it. Make sure you’re 100% happy with it before you play it at a tournament."
        },
        {
          "headline":"Fix your Deck.",
          "description":"Repeat step 6 – 7 with trusted friends in a play setting until you feel comfortable with the cards rules, effects, and combos."
        },
        {
          "headline":"Bring your Deck to the Tournament.",
          "description":"It probably took anywhere from a few weeks, to a couple of months to get there, but you’re there. If you don’t win the tournament, then take your loss and learn from it."
        }
      ]
    },
    {
      "name":"Suggestions for an Effective Frog Deck",
      "steps":[
        {
          "headline":"Start with staples (Cards that are good in just about any deck):",
          "description":"Treeborn Frog (Formerly limited to 1, now semi-limited to 2) Sangan (Limited to 1) Heavy Storm (Limited to 1) Giant Trunade (Currently banned in advanced play) Torrential Tribute (Limited to 1) Mystical Space Typhoon (Limited to 1) Monster Reborn (Limited to 1)"
        },
        {
          "headline":"Consider Frog staples:",
          "description":"Dupe Frog (Use 3) Substitoad (Currently banned in advanced play) Limit Reverse – Great to use with Sangan, or any low attack Frog monster, as well as Substitoad. Graceful Revival – Similar to Limit Reverse, but also works with Submarine Frog, but not Sangan. Salvage – Helps to give you more cards to use for Abyss Soldier’s effect (will be covered later), or to reuse a lost substitoad, Dupe frog, etc. Froggy Force field – The Frog version of Mirror Force; only use as filler if you are already using Mirror Force, otherwise it is not recommended that this card is used at all due to it’s requirement, and it’s non-chainability."
        },
        {
          "headline":"Add some deck dependent cards:",
          "description":"Wetlands – A key card to use in any deck that uses Submarine Frog and Unifrog as the main sources of dealing damage. T.A.D.P.O.L.E. – The effect of Tadpole is difficult to pull off so some people may only use 2, or 1 and a Foolish Burial (Which also works well with Treeborn Frog)\nDES Frog – When Tribute summoned you can special summon up to 2 more DES Frogs from your deck. You can only special summon as many DES Frogs as you have TADPOLE in your graveyard, however. DES Croaking – When you have 3 DES Frog on the field, you can use this card to destroy all cards your opponent has on the field. You can also use Dupe Frog to help pull this card off, because it’s name is treated as DES Frog when it’s on the field (Face up). Beelze Frog – It misses the requirements of Wetlands, but it can gain 300 atk for each TADPOLE in the graveyard. This effect turns it into 2400 at max. Unifrog – It can attack directly, and if you have another frog on the field that is not named Unifrog when it deals battle damage this way, you can destroy an opposing spell or trap card. Poison Draw Frog – Most people skip this card entirely, but it combos well with cards like Torrential Tribute, Needle Ceiling, and Froggy Force field. Flip Flop Frog – This card has the ability to return any monster card on the field to the opponent’s hand, up to the amount of frogs you control. So if the opponent attacks it while face down, and you have other frog monsters on the field, its effect will still activate. You can also use his effect to flip itself face down. D.3.S. Frog – The current only Frog Fusion. Requires 3 DES Frog – not recommended for use out of a fun deck."
        },
        {
          "headline":"Include good combo cards:",
          "description":"Scapegoat (Limited to 1) - Combos well with Substitoad. Creature Swap – Combos well with Scapegoat and an ATK position Dupe Frog or Sangan\nNeedle Ceiling – Combos well with Flip Flop Frog, and Treeborn Frog, as well as Sangan, Dupe Frog, and Poison Draw Frog. Abyss Soldier – Being able to discard unwanted monsters, like treeborn frog TADPOLE, or others that make it to your hand can be a plus. Also, most players are using Synchro monsters now, and Abyss Solder takes care of them (Including Stardust Dragon), as well as back row Spell or Trap cards that could be scaring you. Card Destruction – With so many cards that return cards to your opponent’s hand, Card Destruction can help rid you of some you had trouble with (Such as Neospacian Grand Mole), as well as get you closer to other key cards, like Abyss Solder, and Needle Ceiling, or Salvage, and even Monster Reborn. Hand Destruction – Similar to Card Destruction, use with caution. Combos well with Salvage. Terraforming – Searches for Wetlands. Level Limit – Area B & Gravity Bind – Prevents monsters over the Level of 3 from attacking. Most Frogs are LV 2 or 3. (DES Frog being the exception)\nMessenger of Peace – Similar to LLAB and Gravity Bind, this card prevents monsters from attacking, but it only affects monsters whose ATK is 1500 or higher. During each of your standby phases you can choose to pay 100 LP, if you do not, Messenger of Peace is destroyed. This is beneficial, because if you are using Wetlands, you can allow your Unifrog to attack directly each turn without a big fear of anything coming at you afterwards, and then when you draw Terraforming or Wetlands, you can drop Messenger of Peace and boost up your monsters. Winged Kuriboh, Kuriboh, and The Flute of Summoning Kuriboh – These cards can bail you out of a bad situation, or help to combo with Substitoad, and Needle Ceiling."
        }
      ]
    }
  ],
  "text":" Following General Guidelines Consider the Metagame. This means doing a bit of research, if possible, and trying to get a feel for what types of decks are played most often, as well as the strategies, combos, and power cards used, in your area. This will help you decide what type of Frog deck to use. From this point up to the day you bring your Frog deck to it’s first Tournament you need to be going to tournaments regularly so you can get the best idea possible on the Metagame. Keep current on your metagame. Research the Frog Decks and Cards. There are multiple types of Frog decks out there; some are more successful than others. Here is a list of Frog Deck types for you to consider:\nDES Frog –  When you have 3 “DES Frog” on the field you can use the spell card “DES Croaking” to destroy all cards your opponent controls on their side of the field. Weenie Frog  – By using the field spell “Wetlands” you can give most frogs a 1200 atk bonus. This is perfect when using cards like Unifrog, whose boosted 1600 ATK can attack directly, or Submarine Frog, whose boosted 2400 ATK deals damage when attacking defense position monsters. Stall Frog – This deck is similar to the Weenie Frog deck, but takes a more conservative approach by using cards like Level Limit – Area B, and Gravity Bind, and even Messenger of Peace to make it harder for the opponent to attack. A good way to research card effects and rulings is to visit the website www.netrep.net . This website is a widely used, and well known card search database that helps you to identify potentially helpful cards. By doing a search for Frog in the Keywords tab, under “Name Contains” you can look up your frog monsters. By doing a search for Frog in the “Text Contains” box you can find many cards that will be able to help your frogs in a way. Also, keep in mind that there are a few more Frog cards that have been released recently that have not yet been uploaded to the Netrep Database, that are essential to any Frog Deck. Update yourself on the current Limited  & Forbidden list.  Build a Skeleton. This means building a deck that serves as a starting point, so that you can see what you’re working with. It’s good to start with your “Staples”. Building a Conservative Deck Use an example. Here is an example deck list of a Conservative Weenie Frog deck that you can use as a Skeleton. If you play on Beyonds Duel Monster’s Unlimited, you can copy and paste this into the deck editor's “Add by Name” feature: \n20 monsters, 13 spells, 7 traps\nConservative Weenie Frog Deck\n\nMonsters: 20\n\nSpells: 13\n\nTraps: 7\n\nDupe Frog\n\nScapegoat\n\nTorrential Tribute\n\nDupe Frog\n\nHeavy Storm\n\nMirror Force\n\nDupe Frog\n\nGiant Trunade\n\nFroggy Force field\n\nSubstitoad\n\nMystical Space Typhoon\n\nNeedle Ceiling\n\nSubstitoad\n\nMonster Reborn\n\nNeedle Ceiling\n\nSubstitoad\n\nSalvage\n\nLimit Reverse\n\nTreeborn Frog\n\nSalvage\n\nLimit Reverse\n\nSangan\n\nTerraforming\n\n\n\nFlip Flop Frog\n\nWetlands\n\n\n\nFlip Flop Frog\n\nWetlands\n\n\n\nAbyss Soldier\n\nWetlands\n\n\n\nAbyss Soldier\n\nThe Flute of Summoning Kuriboh\n\n\n\nAbyss Soldier\n\nThe Flute of Summoning Kuriboh\n\n\n\nUnifrog\n\n\n\n\n\nUnifrog\n\n\n\n\n\nSubmarine Frog\n\n\n\n\n\nSubmarine Frog\n\n\n\n\n\nPoison Draw Frog\n\n\n\n\n\nWinged Kuriboh\n\n\n\n\n\nWinged Kuriboh Reconsider the Metagame. By using the tips and warnings at the end of this article you can prepare for your Metagame easier. Flesh out your Deck / Fix your Deck. Change your skeleton so that it resembles something you feel could handle your Metagame. Play the Deck. If you have never played a frog deck before, now is a good time to see how it runs, before you get too far into it. Don’t take it to a tournament just yet; one of the greatest parts of running the frog deck is that people won’t expect it. Make sure you’re 100% happy with it before you play it at a tournament. Fix your Deck. Repeat step 6 – 7 with trusted friends in a play setting until you feel comfortable with the cards rules, effects, and combos. Bring your Deck to the Tournament. It probably took anywhere from a few weeks, to a couple of months to get there, but you’re there. If you don’t win the tournament, then take your loss and learn from it. Suggestions for an Effective Frog Deck Start with staples (Cards that are good in just about any deck): Treeborn Frog (Formerly limited to 1, now semi-limited to 2) Sangan (Limited to 1) Heavy Storm (Limited to 1) Giant Trunade (Currently banned in advanced play) Torrential Tribute (Limited to 1) Mystical Space Typhoon (Limited to 1) Monster Reborn (Limited to 1) Consider Frog staples: Dupe Frog (Use 3) Substitoad (Currently banned in advanced play) Limit Reverse – Great to use with Sangan, or any low attack Frog monster, as well as Substitoad. Graceful Revival – Similar to Limit Reverse, but also works with Submarine Frog, but not Sangan. Salvage – Helps to give you more cards to use for Abyss Soldier’s effect (will be covered later), or to reuse a lost substitoad, Dupe frog, etc. Froggy Force field – The Frog version of Mirror Force; only use as filler if you are already using Mirror Force, otherwise it is not recommended that this card is used at all due to it’s requirement, and it’s non-chainability. Add some deck dependent cards: Wetlands – A key card to use in any deck that uses Submarine Frog and Unifrog as the main sources of dealing damage. T.A.D.P.O.L.E. – The effect of Tadpole is difficult to pull off so some people may only use 2, or 1 and a Foolish Burial (Which also works well with Treeborn Frog)\nDES Frog – When Tribute summoned you can special summon up to 2 more DES Frogs from your deck. You can only special summon as many DES Frogs as you have TADPOLE in your graveyard, however. DES Croaking – When you have 3 DES Frog on the field, you can use this card to destroy all cards your opponent has on the field. You can also use Dupe Frog to help pull this card off, because it’s name is treated as DES Frog when it’s on the field (Face up). Beelze Frog – It misses the requirements of Wetlands, but it can gain 300 atk for each TADPOLE in the graveyard. This effect turns it into 2400 at max. Unifrog – It can attack directly, and if you have another frog on the field that is not named Unifrog when it deals battle damage this way, you can destroy an opposing spell or trap card. Poison Draw Frog – Most people skip this card entirely, but it combos well with cards like Torrential Tribute, Needle Ceiling, and Froggy Force field. Flip Flop Frog – This card has the ability to return any monster card on the field to the opponent’s hand, up to the amount of frogs you control. So if the opponent attacks it while face down, and you have other frog monsters on the field, its effect will still activate. You can also use his effect to flip itself face down. D.3.S. Frog – The current only Frog Fusion. Requires 3 DES Frog – not recommended for use out of a fun deck. Include good combo cards: Scapegoat (Limited to 1) - Combos well with Substitoad. Creature Swap – Combos well with Scapegoat and an ATK position Dupe Frog or Sangan\nNeedle Ceiling – Combos well with Flip Flop Frog, and Treeborn Frog, as well as Sangan, Dupe Frog, and Poison Draw Frog. Abyss Soldier – Being able to discard unwanted monsters, like treeborn frog TADPOLE, or others that make it to your hand can be a plus. Also, most players are using Synchro monsters now, and Abyss Solder takes care of them (Including Stardust Dragon), as well as back row Spell or Trap cards that could be scaring you. Card Destruction – With so many cards that return cards to your opponent’s hand, Card Destruction can help rid you of some you had trouble with (Such as Neospacian Grand Mole), as well as get you closer to other key cards, like Abyss Solder, and Needle Ceiling, or Salvage, and even Monster Reborn. Hand Destruction – Similar to Card Destruction, use with caution. Combos well with Salvage. Terraforming – Searches for Wetlands. Level Limit – Area B & Gravity Bind – Prevents monsters over the Level of 3 from attacking. Most Frogs are LV 2 or 3. (DES Frog being the exception)\nMessenger of Peace – Similar to LLAB and Gravity Bind, this card prevents monsters from attacking, but it only affects monsters whose ATK is 1500 or higher. During each of your standby phases you can choose to pay 100 LP, if you do not, Messenger of Peace is destroyed. This is beneficial, because if you are using Wetlands, you can allow your Unifrog to attack directly each turn without a big fear of anything coming at you afterwards, and then when you draw Terraforming or Wetlands, you can drop Messenger of Peace and boost up your monsters. Winged Kuriboh, Kuriboh, and The Flute of Summoning Kuriboh – These cards can bail you out of a bad situation, or help to combo with Substitoad, and Needle Ceiling.",
  "tyn_model":[
    "frog",
    "salvage",
    "sangan",
    "– similar",
    "– the",
    "“des",
    "” you",
    "– this",
    "– area",
    "skeleton",
    "kuriboh",
    "unifrog",
    "– when",
    "des frogs",
    "dupe frog",
    "– it",
    "poison draw frog",
    "– combos",
    "needle ceiling",
    "wetlands",
    "–  ",
    "” on",
    "” to",
    "– by",
    "“wetlands",
    "“name",
    "“text",
    "” box",
    "“staples",
    "”.",
    "“add",
    "” feature",
    "monsters",
    "spells",
    "– 7",
    "staples",
    "treeborn frog",
    "heavy storm",
    "substitoad",
    "– great",
    "– helps",
    "– a",
    "tadpole",
    "– most",
    "flip flop frog",
    "frogs",
    "– not",
    "scapegoat",
    "abyss soldier",
    "– being",
    "– with",
    "abyss solder",
    "– searches",
    "– prevents",
    "– these"
  ],
  "tyn_section":[

  ]
}