{
  "title":"How to Defeat Gleeok in the Legend of Zelda",
  "url":"https://www.wikihow.com/Defeat-Gleeok-in-the-Legend-of-Zelda",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "The Legend of Zelda Series"
  ],
  "methods":[
    {
      "name":"Defeating Gleeok as a Mini Boss",
      "steps":[
        {
          "headline":"Find Gleeok.",
          "description":"In levels 4 and 6 of the First Quest (the first half of the game), and levels 2, 5, and 6 of the Second Quest (second half), Gleeok appears only as a mini boss. You can find him inside the Mini Boss rooms of these levels."
        },
        {
          "headline":"Avoid the dragon’s attacks.",
          "description":"As a mini boss, Gleeok will only have two to three heads. Once you enter the Mini Boss room, it will pop out the wall and begin attacking you. Gleeok will start weaving its two to three heads through half of the floor. Its heads will also start shooting fireballs in random directions. Try to dodge these attacks by constantly moving around the floor."
        },
        {
          "headline":"Attack its head.",
          "description":"While avoiding its attack, slowly move towards its head. Once you get close enough, slash one of its head with your sword. It takes ten blows of your wooden sword to destroy just one head. Do this to each of Gleeok’s heads to defeat the monster."
        }
      ]
    },
    {
      "name":"Defeating Gleeok as a Main Boss",
      "steps":[
        {
          "headline":"Find Gleeok.",
          "description":"The dragon will be the main boss in level 8 of the First Quest and level 7 of the Second Quest. Once you get the Boss Key, use it to open the Boss Room—the last accessible room of the mentioned levels—to find Gleeok."
        },
        {
          "headline":"Avoid the dragon’s attacks.",
          "description":"Once you enter the Boss room, it will pop out the wall and begin attacking you. As the main boss, Gleeok will have four heads instead of just two or three. Gleeok will start weaving its four heads through half of the floor. Its heads will also start shooting fireballs in random directions. Apart from that, every head you sever will start flying around the room and will damage you if you come in contact with it. Just like with the mini boss version, simply keep moving around the room to avoid these attacks."
        },
        {
          "headline":"Attack its head.",
          "description":"While avoiding its attack, slowly inch closer towards its head. Once you get close enough, slash one of its head with your sword. It takes ten blows of your wooden sword to destroy just one head. Do this to each of Gleeok’s four heads to defeat the monster."
        }
      ]
    }
  ],
  "text":" Defeating Gleeok as a Mini Boss Find Gleeok. In levels 4 and 6 of the First Quest (the first half of the game), and levels 2, 5, and 6 of the Second Quest (second half), Gleeok appears only as a mini boss. You can find him inside the Mini Boss rooms of these levels. Avoid the dragon’s attacks. As a mini boss, Gleeok will only have two to three heads. Once you enter the Mini Boss room, it will pop out the wall and begin attacking you. Gleeok will start weaving its two to three heads through half of the floor. Its heads will also start shooting fireballs in random directions. Try to dodge these attacks by constantly moving around the floor. Attack its head. While avoiding its attack, slowly move towards its head. Once you get close enough, slash one of its head with your sword. It takes ten blows of your wooden sword to destroy just one head. Do this to each of Gleeok’s heads to defeat the monster. Defeating Gleeok as a Main Boss Find Gleeok. The dragon will be the main boss in level 8 of the First Quest and level 7 of the Second Quest. Once you get the Boss Key, use it to open the Boss Room—the last accessible room of the mentioned levels—to find Gleeok. Avoid the dragon’s attacks. Once you enter the Boss room, it will pop out the wall and begin attacking you. As the main boss, Gleeok will have four heads instead of just two or three. Gleeok will start weaving its four heads through half of the floor. Its heads will also start shooting fireballs in random directions. Apart from that, every head you sever will start flying around the room and will damage you if you come in contact with it. Just like with the mini boss version, simply keep moving around the room to avoid these attacks. Attack its head. While avoiding its attack, slowly inch closer towards its head. Once you get close enough, slash one of its head with your sword. It takes ten blows of your wooden sword to destroy just one head. Do this to each of Gleeok’s four heads to defeat the monster.",
  "tyn_model":[
    "dragon",
    "sword",
    "wooden sword",
    "—the",
    "—to"
  ],
  "tyn_section":[

  ]
}