{
  "title":"How to Draw a Cartoon Child",
  "url":"https://www.wikihow.com/Draw-a-Cartoon-Child",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing People",
    "Drawing Children"
  ],
  "methods":[
    {
      "name":"Front View",
      "steps":[
        {
          "headline":"Draw the outline of the face and its guidelines.",
          "description":"Most children have a round/oval face shape, with a slightly pointed chin. The guidelines should split the face equally into fourths. Sketch lightly, and don't worry about getting the lines perfect on the first try."
        },
        {
          "headline":"Draw a U-shaped nose.",
          "description":"The nose should be 1/3 of the way down the bottom half of the face. Children tend to have small noses, without much nose bridge definition, so a simple nose will do for most kids. The child in the above illustration is a white girl, so the nose will be narrow."
        },
        {
          "headline":"Add a mouth.",
          "description":"The mouth should be placed approximately 2/3 of the way down. You may choose a simple curve for a smile, or an open mouth, or whatever you feel like."
        },
        {
          "headline":"Draw the child's eyes.",
          "description":"The eyes should be big and rounded, with a large iris (the colored part). This will make the child look cute and young. Thicken the top eyelid to draw attention to the eyes and make them appear alert. Add raised eyebrows."
        },
        {
          "headline":"Sketch the child's neck and shoulders.",
          "description":"A thin neck and narrow shoulders will give the character a sense of childlike vulnerability. You may choose to refine the face shape a little bit as you get a sense of how it will look."
        },
        {
          "headline":"Draw the child's hair.",
          "description":"Many children with straight or wavy hair wear bangs. Children tend to have large foreheads, so be sure to add plenty of volume to the hair. This little girl's hair is straight, but that does not mean your lines will be. Gentle curves will give a sense of movement and make it more interesting. Notice how the bangs curve outward like a sphere to show volume."
        },
        {
          "headline":"Outline your image in pen.",
          "description":"Take your time. Thicken the outline where there are shadows, or where you want to draw attention. In this image, the artist used a darker outline on the upper eyelids, the shadows on the chin, the corners of the mouth, and a few other places. If you are drawing digitally, lower the opacity of your sketch and draw your outline on a new layer."
        },
        {
          "headline":"Color the face as desired.",
          "description":"For a cheerful image, use bright colors and/or pastel colors. Shade as desired and fine-tune your final image. In this image, the artist chose to use pastel colors for everything except the bright blue eyes, making them stand out. Don't forget to sign your name!"
        }
      ]
    },
    {
      "name":"Profile View",
      "steps":[
        {
          "headline":"Sketch another rough circle.",
          "description":"Then draw a line coming down from one side of the face, and a curved line connecting the bottom of the line to the bottom of the circle. This will be the chin. This picture will show a boy looking to the left."
        },
        {
          "headline":"Clean up your sketch and add a horizontal guideline for the eyes.",
          "description":"You only need one guideline for profile view, because the vertical guideline is on the side of the face."
        },
        {
          "headline":"Sketch out the nose and the forehead.",
          "description":"The nose should be rounded, with a gentle slope. Notice how the forehead curves inwards at the top of the nose bridge, and then back out. The bottom of the nose, just like before, should be around 1/3 of the way down from the horizontal guideline. Younger children tend to have larger foreheads. The boy in the above image is quite young, so his forehead will be very big."
        },
        {
          "headline":"Add the child's mouth.",
          "description":"Some cartoonists prefer to leave this area flat, while others prefer to draw more realistic lips. If you add lips, make them pointy and thin, because children's lips tend not to be very full yet. It should look roughly like an M-shape coming from the side of their face. White people tend to have the thinnest lips, while black people's lips are usually the fullest. This boy is Asian, so his lips are somewhere in the middle. Little girls' lips aren't usually fuller than boys' lips yet. Children look pretty androgynous."
        },
        {
          "headline":"Add eyes.",
          "description":"Notice that eyes are not oval-shaped in profile view—they are more like a rounded triangle, with one corner pointing to the center of the head while the largest flat side is on the outside. Since this boy is Asian, his eye has a gentle (and subtle!) upward slant at the corner."
        },
        {
          "headline":"Add a jawline and ears.",
          "description":"The jawline will be around halfway across the head. The top of the ear lines up with the eyebrows, and the bottom of the ear lines up with the bottom of the nose."
        },
        {
          "headline":"Draw the child's hair, neck, and shirt.",
          "description":"Notice how the hair curves outwards like stripes on a beach ball, showing that the child's head is round. The back of the neck attaches near the base of the ear."
        },
        {
          "headline":"Go over your sketch with pen, refining details as needed.",
          "description":"Notice how the upper eyelid has a darker line."
        },
        {
          "headline":"Color your lineart if desired.",
          "description":"Notice how the light and shadows hint at the roundness of the cheek, and the blue-gray highlights make the hair look shiny and clean."
        }
      ]
    },
    {
      "name":"3\\/4 View",
      "steps":[
        {
          "headline":"Draw another circle, this time placing the vertical line off to one side.",
          "description":"This shows that the head is partially turned towards the viewer. Notice how the head is slightly tilted this time. This will make the picture look dynamic and be more interesting. The artist used a squashed oval to give this girl a wide face. Feel free to experiment with rectangles, triangles, hearts, and other face shapes."
        },
        {
          "headline":"Add a nose where the lines intersect.",
          "description":"Start with an oval, and refine the shape from there. This girl is black, so her nose is wide with a shallower bridge."
        },
        {
          "headline":"Draw the child's mouth.",
          "description":"This smile started out as a crooked trapezoid, and then teeth were added. One corner of her mouth is farther away from the others, giving her an impudent smile."
        },
        {
          "headline":"Sketch the child's eyes.",
          "description":"This girl's eyes are almond-shaped. Notice how the bottom lids slant upwards—this is what eyes do when a person smiles. The big eyes make her look cute and friendly."
        },
        {
          "headline":"Add a little body.",
          "description":"Children have big heads, especially cartoon children. Shape the body like a rectangle, with arms coming out from either side. The bottom of her sleeve is simply a random squiggly line. Lace does not have to be even in order to look cute."
        },
        {
          "headline":"Draw your child's hair.",
          "description":"This girl's hair is curly and thick, so it is represented by random squiggles in a general oval-like shape. Curly hair is wild, so use loose scribbles and don't worry about the exact shape. This is one way that art can send a positive social message—by showing that black girls can embrace their natural hair texture and feel good about it. You can send a message about diversity by drawing cute children of color, disabled children, and children of all shapes and sizes."
        },
        {
          "headline":"Trace over your sketch with pen.",
          "description":"Here you can add any extra details (like her gap teeth) and refine the shapes more. This artist added a few wrinkles to the clothes and worked on the shape of the hair more carefully."
        },
        {
          "headline":"Color your image if desired.",
          "description":"Take note of where the shadows fall—under her nose, her neck, her eyelids, and the back of her hair. Curly hair can be shaded with squiggles of different colors. The hair is the same color as the eyes and the freckles to give unity to the picture. The girl's shirt has a purple texture. Digital artists can use screentones with layer modes such as Multiply or Screen to add interest to clothes."
        }
      ]
    }
  ],
  "text":" Front View Draw the outline of the face and its guidelines. Most children have a round/oval face shape, with a slightly pointed chin. The guidelines should split the face equally into fourths. Sketch lightly, and don't worry about getting the lines perfect on the first try. Draw a U-shaped nose. The nose should be 1/3 of the way down the bottom half of the face. Children tend to have small noses, without much nose bridge definition, so a simple nose will do for most kids. The child in the above illustration is a white girl, so the nose will be narrow. Add a mouth. The mouth should be placed approximately 2/3 of the way down. You may choose a simple curve for a smile, or an open mouth, or whatever you feel like. Draw the child's eyes. The eyes should be big and rounded, with a large iris (the colored part). This will make the child look cute and young. Thicken the top eyelid to draw attention to the eyes and make them appear alert. Add raised eyebrows. Sketch the child's neck and shoulders. A thin neck and narrow shoulders will give the character a sense of childlike vulnerability. You may choose to refine the face shape a little bit as you get a sense of how it will look. Draw the child's hair. Many children with straight or wavy hair wear bangs. Children tend to have large foreheads, so be sure to add plenty of volume to the hair. This little girl's hair is straight, but that does not mean your lines will be. Gentle curves will give a sense of movement and make it more interesting. Notice how the bangs curve outward like a sphere to show volume. Outline your image in pen. Take your time. Thicken the outline where there are shadows, or where you want to draw attention. In this image, the artist used a darker outline on the upper eyelids, the shadows on the chin, the corners of the mouth, and a few other places. If you are drawing digitally, lower the opacity of your sketch and draw your outline on a new layer. Color the face as desired. For a cheerful image, use bright colors and/or pastel colors. Shade as desired and fine-tune your final image. In this image, the artist chose to use pastel colors for everything except the bright blue eyes, making them stand out. Don't forget to sign your name! Profile View Sketch another rough circle. Then draw a line coming down from one side of the face, and a curved line connecting the bottom of the line to the bottom of the circle. This will be the chin. This picture will show a boy looking to the left. Clean up your sketch and add a horizontal guideline for the eyes. You only need one guideline for profile view, because the vertical guideline is on the side of the face. Sketch out the nose and the forehead. The nose should be rounded, with a gentle slope. Notice how the forehead curves inwards at the top of the nose bridge, and then back out. The bottom of the nose, just like before, should be around 1/3 of the way down from the horizontal guideline. Younger children tend to have larger foreheads. The boy in the above image is quite young, so his forehead will be very big. Add the child's mouth. Some cartoonists prefer to leave this area flat, while others prefer to draw more realistic lips. If you add lips, make them pointy and thin, because children's lips tend not to be very full yet. It should look roughly like an M-shape coming from the side of their face. White people tend to have the thinnest lips, while black people's lips are usually the fullest. This boy is Asian, so his lips are somewhere in the middle. Little girls' lips aren't usually fuller than boys' lips yet. Children look pretty androgynous. Add eyes. Notice that eyes are not oval-shaped in profile view—they are more like a rounded triangle, with one corner pointing to the center of the head while the largest flat side is on the outside. Since this boy is Asian, his eye has a gentle (and subtle!) upward slant at the corner. Add a jawline and ears. The jawline will be around halfway across the head. The top of the ear lines up with the eyebrows, and the bottom of the ear lines up with the bottom of the nose. Draw the child's hair, neck, and shirt. Notice how the hair curves outwards like stripes on a beach ball, showing that the child's head is round. The back of the neck attaches near the base of the ear. Go over your sketch with pen, refining details as needed. Notice how the upper eyelid has a darker line. Color your lineart if desired. Notice how the light and shadows hint at the roundness of the cheek, and the blue-gray highlights make the hair look shiny and clean. 3\\/4 View Draw another circle, this time placing the vertical line off to one side. This shows that the head is partially turned towards the viewer. Notice how the head is slightly tilted this time. This will make the picture look dynamic and be more interesting. The artist used a squashed oval to give this girl a wide face. Feel free to experiment with rectangles, triangles, hearts, and other face shapes. Add a nose where the lines intersect. Start with an oval, and refine the shape from there. This girl is black, so her nose is wide with a shallower bridge. Draw the child's mouth. This smile started out as a crooked trapezoid, and then teeth were added. One corner of her mouth is farther away from the others, giving her an impudent smile. Sketch the child's eyes. This girl's eyes are almond-shaped. Notice how the bottom lids slant upwards—this is what eyes do when a person smiles. The big eyes make her look cute and friendly. Add a little body. Children have big heads, especially cartoon children. Shape the body like a rectangle, with arms coming out from either side. The bottom of her sleeve is simply a random squiggly line. Lace does not have to be even in order to look cute. Draw your child's hair. This girl's hair is curly and thick, so it is represented by random squiggles in a general oval-like shape. Curly hair is wild, so use loose scribbles and don't worry about the exact shape. This is one way that art can send a positive social message—by showing that black girls can embrace their natural hair texture and feel good about it. You can send a message about diversity by drawing cute children of color, disabled children, and children of all shapes and sizes. Trace over your sketch with pen. Here you can add any extra details (like her gap teeth) and refine the shapes more. This artist added a few wrinkles to the clothes and worked on the shape of the hair more carefully. Color your image if desired. Take note of where the shadows fall—under her nose, her neck, her eyelids, and the back of her hair. Curly hair can be shaded with squiggles of different colors. The hair is the same color as the eyes and the freckles to give unity to the picture. The girl's shirt has a purple texture. Digital artists can use screentones with layer modes such as Multiply or Screen to add interest to clothes.",
  "tyn_model":[
    "pen",
    "sketch",
    "lips",
    "—they",
    "eyebrows",
    "—this",
    "lace",
    "art",
    "—by",
    "—under"
  ],
  "tyn_section":[

  ]
}