{
  "title":"How to Get Free SpeedBoost in Need for Speed",
  "url":"https://www.wikihow.com/Get-Free-SpeedBoost-in-Need-for-Speed",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Need for Speed"
  ],
  "methods":[
    {
      "name":"Getting Free SpeedBoost by Inviting Friends",
      "steps":[
        {
          "headline":"Visit NFSW.",
          "description":"Using any web browser on your computer, go to the official Need for Speed World website."
        },
        {
          "headline":"Log into your account.",
          "description":"Click the Login link at the top of the page. Log into the website by typing in your NFSW username and password in the fields provided, and clicking “Login.”"
        },
        {
          "headline":"Click on the “Invite your Friends” banner.",
          "description":"It is located on the right-hand pane of the page."
        },
        {
          "headline":"Connect to Facebook.",
          "description":"On the next page that appears, click on the “Invite your Friends” button that has the Facebook logo on it. This will open a pop-up page where you can log into your Facebook account. Type in your Facebook username and password and click “Log in.” On the next page, click “Play” now to confirm granting NFSW access to your Facebook account. This will bring up your Facebook friends' list."
        },
        {
          "headline":"Invite Facebook friends.",
          "description":"Click the “Invite” button next to each Friend's name to invite them to NFS World. Each time a friend accepts the invitation and joins, you will be notified via email (the same email address you use as your NFSW username), and you will earn 5% of all the SpeedBoost they buy for their accounts henceforth, and for free!"
        }
      ]
    },
    {
      "name":"Getting Free SpeedBoost Using SpeedBoost Codes",
      "steps":[
        {
          "headline":"Keep checking your email for promotional codes from EA Games.",
          "description":"These alphanumeric codes are sent to all NFSW account holders via the email addresses they used to sign up for the game, and  most often during special EA Games events or when the NFSW community reaches a certain milestone. If you find such a code, go to the official Need for Speed World website: https://world.needforspeed.com/"
        },
        {
          "headline":"Log into your account.",
          "description":"Click the Login link at the top of the page. Log into the website by typing in your NFSW username and password in the fields provided, and clicking “Login.”"
        },
        {
          "headline":"Copy the code you received in the email and paste it into the Redeem a Game Code box.",
          "description":"The Redeem a Game Code box is found on the righthand pane of the website."
        },
        {
          "headline":"Click “Redeem Code.” The amount of SpeedBoost specified in the email you received will be awarded to the first Driver (Driver profile) you created in your NFS World account.",
          "description":"You can confirm this by launching the game, logging in, and entering NFS World using your account's first Driver."
        }
      ]
    },
    {
      "name":"Getting Free SpeedBoost by Creating an Account",
      "steps":[
        {
          "headline":"Visit NFSW.",
          "description":"Using any web browser on your computer, go to the official Need for Speed World website."
        },
        {
          "headline":"Click the “Register” link at the top of the page.",
          "description":"This will take you to the NFSW sign-up form where you can fill in your personal details."
        },
        {
          "headline":"Fill in the form and click “Create Account.” You will receive an email in the email address you used to sign up confirming that your account has been successfully created.",
          "description":""
        },
        {
          "headline":"Launch the game and log in.",
          "description":"Launch the game from the Start menu (Start button  >> All Programs >> EA Games >> Need for Speed World) or the desktop, if you have it there. Log in using the information you created during the registration, and you will be taken to the Select a Driver page."
        },
        {
          "headline":"Create a new driver.",
          "description":"Click “Create a Driver” and enter the name you would like to use for your driver in the “Enter a Driver Name” field. On the Select a Driver Picture pane of the same screen, choose a picture for your Driver from the ones provided."
        },
        {
          "headline":"Get your SpeedBoost.",
          "description":"Click “Next” at the bottom of the page when you're done. This will create your Driver and take you to the SafeHouse screen. At the very top of the SafeHouse screen, you will see that you have been granted a 200,000 SpeedBoost balance. This SpeedBoost can be used to purchase a new car that you can start life with in NFS World."
        }
      ]
    }
  ],
  "text":" Getting Free SpeedBoost by Inviting Friends Visit NFSW. Using any web browser on your computer, go to the official Need for Speed World website. Log into your account. Click the Login link at the top of the page. Log into the website by typing in your NFSW username and password in the fields provided, and clicking “Login.” Click on the “Invite your Friends” banner. It is located on the right-hand pane of the page. Connect to Facebook. On the next page that appears, click on the “Invite your Friends” button that has the Facebook logo on it. This will open a pop-up page where you can log into your Facebook account. Type in your Facebook username and password and click “Log in.” On the next page, click “Play” now to confirm granting NFSW access to your Facebook account. This will bring up your Facebook friends' list. Invite Facebook friends. Click the “Invite” button next to each Friend's name to invite them to NFS World. Each time a friend accepts the invitation and joins, you will be notified via email (the same email address you use as your NFSW username), and you will earn 5% of all the SpeedBoost they buy for their accounts henceforth, and for free! Getting Free SpeedBoost Using SpeedBoost Codes Keep checking your email for promotional codes from EA Games. These alphanumeric codes are sent to all NFSW account holders via the email addresses they used to sign up for the game, and  most often during special EA Games events or when the NFSW community reaches a certain milestone. If you find such a code, go to the official Need for Speed World website: https://world.needforspeed.com/ Log into your account. Click the Login link at the top of the page. Log into the website by typing in your NFSW username and password in the fields provided, and clicking “Login.” Copy the code you received in the email and paste it into the Redeem a Game Code box. The Redeem a Game Code box is found on the righthand pane of the website. Click “Redeem Code.” The amount of SpeedBoost specified in the email you received will be awarded to the first Driver (Driver profile) you created in your NFS World account. You can confirm this by launching the game, logging in, and entering NFS World using your account's first Driver. Getting Free SpeedBoost by Creating an Account Visit NFSW. Using any web browser on your computer, go to the official Need for Speed World website. Click the “Register” link at the top of the page. This will take you to the NFSW sign-up form where you can fill in your personal details. Fill in the form and click “Create Account.” You will receive an email in the email address you used to sign up confirming that your account has been successfully created.  Launch the game and log in. Launch the game from the Start menu (Start button  >> All Programs >> EA Games >> Need for Speed World) or the desktop, if you have it there. Log in using the information you created during the registration, and you will be taken to the Select a Driver page. Create a new driver. Click “Create a Driver” and enter the name you would like to use for your driver in the “Enter a Driver Name” field. On the Select a Driver Picture pane of the same screen, choose a picture for your Driver from the ones provided. Get your SpeedBoost. Click “Next” at the bottom of the page when you're done. This will create your Driver and take you to the SafeHouse screen. At the very top of the SafeHouse screen, you will see that you have been granted a 200,000 SpeedBoost balance. This SpeedBoost can be used to purchase a new car that you can start life with in NFS World.",
  "tyn_model":[
    "“invite",
    "nfs world",
    "need for speed world",
    "“login",
    "” button",
    "“create",
    "” click",
    "” banner",
    "“log",
    "” on",
    "“play",
    "” now",
    "speedboost codes",
    "ea games",
    "” copy",
    "“redeem",
    "” the",
    "“register",
    "” link",
    "” you",
    "” and",
    "“enter",
    "” field",
    "“next",
    "” at"
  ],
  "tyn_section":[

  ]
}