{
  "title":"How to Download Game Anarchy (Combat Arms)",
  "url":"https://www.wikihow.com/Download-Game-Anarchy-(Combat-Arms)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC First Person Shooter",
    "Combat Arms"
  ],
  "steps":[
    {
      "headline":"Go to the GA website and click on the 'Buy VIP' tab.",
      "description":""
    },
    {
      "headline":"Scroll through the list of games and select the game you would like to hack.",
      "description":""
    },
    {
      "headline":"Follow the onscreen instructions (purchase uses PayPal).",
      "description":""
    },
    {
      "headline":"Once the hack is purchased download WinRar from this link: download.com",
      "description":""
    },
    {
      "headline":"At the link, type in WinRar and proceed to download.",
      "description":""
    },
    {
      "headline":"Once you have acquired WinRar, got to your 'Subscriptions' tab.",
      "description":"Click the download option. Click save (make a new folder so the hack runs more smoothly)."
    },
    {
      "headline":"Once saved, go to that file, right click, and select 'Extract Here.'",
      "description":""
    },
    {
      "headline":"When extracted, you will have a set of new folders.",
      "description":"Select the one labeled 'Game Anarchy.'"
    },
    {
      "headline":"A window will open and you have to type your GA username and password.",
      "description":"Click 'Login.'"
    },
    {
      "headline":"A series of games will then be showed.",
      "description":"Click the game you subscribed to (we will be using Combat Arms)."
    },
    {
      "headline":"Three options will appear.",
      "description":"For this how to, we will select the far right one."
    },
    {
      "headline":"Your hack will be streaming and when it says 'START GAME,' start Combat Arms.",
      "description":""
    },
    {
      "headline":"At the Combat Arms login screen, press delete and you hack window will appear.",
      "description":"Pick what hacks you want to use and which ones you want disabled. Start the game and use your hacks at your will."
    }
  ],
  "text":" Go to the GA website and click on the 'Buy VIP' tab.  Scroll through the list of games and select the game you would like to hack.  Follow the onscreen instructions (purchase uses PayPal).  Once the hack is purchased download WinRar from this link: download.com  At the link, type in WinRar and proceed to download.  Once you have acquired WinRar, got to your 'Subscriptions' tab. Click the download option. Click save (make a new folder so the hack runs more smoothly). Once saved, go to that file, right click, and select 'Extract Here.'  When extracted, you will have a set of new folders. Select the one labeled 'Game Anarchy.' A window will open and you have to type your GA username and password. Click 'Login.' A series of games will then be showed. Click the game you subscribed to (we will be using Combat Arms). Three options will appear. For this how to, we will select the far right one. Your hack will be streaming and when it says 'START GAME,' start Combat Arms.  At the Combat Arms login screen, press delete and you hack window will appear. Pick what hacks you want to use and which ones you want disabled. Start the game and use your hacks at your will.",
  "tyn_model":[
    "winrar",
    "combat arms",
    "hacks"
  ],
  "tyn_section":[

  ]
}