{
  "title":"How to Clean a Scorched Pot",
  "url":"https://www.wikihow.com/Clean-a-Scorched-Pot",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Cookware"
  ],
  "methods":[
    {
      "name":"Soaking the Pot",
      "steps":[
        {
          "headline":"Soak the pot overnight in hot water and soap for an easy clean.",
          "description":"Add a dash of soap to the pot and place it in the sink. Run the water in the sink until you get hot water and then fill the pot up completely. Let it sit overnight before attempting to scrub it out in the morning with fresh water and a sponge. If you have a tea kettle, you can use boiling water instead of just hot tap water for extra scrubbing power."
        },
        {
          "headline":"Use a dryer sheet to increase the scour-fighting effects of soaking.",
          "description":"Squirt dish soap into the pot and set it in the sink to fill it with hot tap water. Submerge a dryer sheet in the pot and leave it to soak for at least an hour. When you get back, remove the dryer sheet and scrub the pot as you normally would. You can also leave the dryer sheet in overnight if you prefer, and it will have an even greater effect on the pot. Alternatively, try a few dashes of fabric softener in the pan overnight."
        },
        {
          "headline":"Try bleach cleansing powder for a quick 30-minute soak.",
          "description":"When you take the pan off the stove from cooking, rinse it out and then sprinkle in the cleansing powder. Pour in enough hot water to cover the scorched area and leave it alone to soak for 30 minutes. Scrub it down thoroughly with soap and hot water to remove the soap and gunk after 30 minutes. Comet and Ajax fall into this category."
        }
      ]
    },
    {
      "name":"Trying Abrasives and Cleaners",
      "steps":[
        {
          "headline":"Use baking soda, salt, and vinegar to scrub the pot clean.",
          "description":"Sprinkle baking soda in the bottom of the pan, enough to mostly coat it. Add a layer of salt on top of that. Finally, sprinkle on white, distilled vinegar and scrub down the pan with steel wool or a sponge to remove tough burned-on spots. Bigger salt flakes work better, so use sea salt or kosher salt. Don't use this method on nonstick pans."
        },
        {
          "headline":"Try oxalic acid with aluminum foil for stubborn gunk.",
          "description":"Once you rinse the pan, add a sprinkle of oxalic acid. Use a wadded-up piece of aluminum foil to scrub the bottom of the pan thoroughly. Rinse it out and then wash it with dishwashing soap and water. Don't leave the cleaner on the pan for more than 1 minute or so, as it can damage the pan. Don't use this cleaner on coated pans. This cleaner could remove the coating on nonstick pans so use with caution."
        },
        {
          "headline":"Scrub the pan down with a melamine sponge for a non-chemical approach.",
          "description":"These sponges work on a microscopic level to scrub away gunk. All you need is the sponge and water, though it wouldn't hurt to add some baking soda. Scrub the pan in circles, moving all around it as you go, and the eraser will take up most or all of the burnt-on gunk. These sponges will harm nonstick pans, so only use them on your other pots."
        }
      ]
    },
    {
      "name":"Using Boiling and Deglazing Methods",
      "steps":[
        {
          "headline":"Boil plain water in the pot if you don't have special cleaners.",
          "description":"Add enough water to cover the scorched area and set the pot on the stove. Bring the pot to a boil and let it boil for 5-10 minutes. Once it's done, take it off the stove and pour out the water. Scrub the pot down with steel wool and soap to take off the burned areas."
        },
        {
          "headline":"Deglaze the pan with water or vinegar to help with large bits.",
          "description":"To deglaze the pan, heat it up without anything in it over high heat. It's ready when you drop a small amount of water in it and the water sizzles. Once it's done, pour in enough water or vinegar to coat the bottom of the pan and leave it to cook for a minute or two. Use a plastic spatula to scrape off the burned-on bits, then wash the pan as you normally do. This method will produce a lot of steam, so stay back! Don't use this method on nonstick pans, as you shouldn't heat them up without anything in them."
        },
        {
          "headline":"Slice lemons in the pan and boil the water for a gentle acid cleaner.",
          "description":"Use enough water to cover the 2-3 lemons you cut up in the pan. Place the pot over high heat and let it come to boil. When it boils, let it continue for about 5 minutes, then take the pan off the heat. Scrub the pan down with soap and a scrubbing pad to remove the burnt-on bits. You can use any citrus with this method, such as limes, grapefruits, or oranges. You don't have the cut the citrus up very much. Slices or quarters is fine."
        }
      ]
    },
    {
      "name":"Using Vinegar and Baking Soda Together",
      "steps":[
        {
          "headline":"Add enough water and white vinegar to the pot to cover the bottom.",
          "description":"Fill the bottom of the pan with just enough water to cover it. Add 1 cup (240 mL) of vinegar to the water in the pot. Don't use the good stuff. Just stick to good old white distilled vinegar. It will do the trick."
        },
        {
          "headline":"Bring the water and vinegar to a boil.",
          "description":"Set the pan on the stove and turn the burner on high. Let the solution heat up until you see a rolling boil. Let it boil for a few minutes, as you keep an eye on it. Once you see the burnt-on bits starting to come up, take it off the stove. This step will get pretty smelly, so be prepared!"
        },
        {
          "headline":"Sprinkle in baking soda after pouring out the vinegar.",
          "description":"Pour the vinegar/water mixture down the sink. Add enough baking soda into the pan that you lightly coat the bottom of the pan. You'll get a good fizz from this combination so watch out!"
        },
        {
          "headline":"Scrub the pan thoroughly with a steel wool pad.",
          "description":"Use small circles to scrub the pan, applying elbow grease as you do. Go around the pan several times to remove as much of the crud as you can. If you need to, you can rinse it out and add a bit more baking soda. In fact, if some areas don't come clean, just mix a little baking soda with water and leave it on the pan for 30 minutes to an hour. When you come back, the stubborn spots should be easy to remove."
        },
        {
          "headline":"Wash the pan with soap and a regular sponge.",
          "description":"Once the scoured bits are mostly gone, clean the pot as you usually do. Scrub down the inside with dishwashing detergent and a normal sponge, then rinse it out."
        }
      ]
    }
  ],
  "text":" Soaking the Pot Soak the pot overnight in hot water and soap for an easy clean. Add a dash of soap to the pot and place it in the sink. Run the water in the sink until you get hot water and then fill the pot up completely. Let it sit overnight before attempting to scrub it out in the morning with fresh water and a sponge. If you have a tea kettle, you can use boiling water instead of just hot tap water for extra scrubbing power. Use a dryer sheet to increase the scour-fighting effects of soaking. Squirt dish soap into the pot and set it in the sink to fill it with hot tap water. Submerge a dryer sheet in the pot and leave it to soak for at least an hour. When you get back, remove the dryer sheet and scrub the pot as you normally would. You can also leave the dryer sheet in overnight if you prefer, and it will have an even greater effect on the pot. Alternatively, try a few dashes of fabric softener in the pan overnight. Try bleach cleansing powder for a quick 30-minute soak. When you take the pan off the stove from cooking, rinse it out and then sprinkle in the cleansing powder. Pour in enough hot water to cover the scorched area and leave it alone to soak for 30 minutes. Scrub it down thoroughly with soap and hot water to remove the soap and gunk after 30 minutes. Comet and Ajax fall into this category. Trying Abrasives and Cleaners Use baking soda, salt, and vinegar to scrub the pot clean. Sprinkle baking soda in the bottom of the pan, enough to mostly coat it. Add a layer of salt on top of that. Finally, sprinkle on white, distilled vinegar and scrub down the pan with steel wool or a sponge to remove tough burned-on spots. Bigger salt flakes work better, so use sea salt or kosher salt. Don't use this method on nonstick pans. Try oxalic acid with aluminum foil for stubborn gunk. Once you rinse the pan, add a sprinkle of oxalic acid. Use a wadded-up piece of aluminum foil to scrub the bottom of the pan thoroughly. Rinse it out and then wash it with dishwashing soap and water. Don't leave the cleaner on the pan for more than 1 minute or so, as it can damage the pan. Don't use this cleaner on coated pans. This cleaner could remove the coating on nonstick pans so use with caution. Scrub the pan down with a melamine sponge for a non-chemical approach. These sponges work on a microscopic level to scrub away gunk. All you need is the sponge and water, though it wouldn't hurt to add some baking soda. Scrub the pan in circles, moving all around it as you go, and the eraser will take up most or all of the burnt-on gunk. These sponges will harm nonstick pans, so only use them on your other pots. Using Boiling and Deglazing Methods Boil plain water in the pot if you don't have special cleaners. Add enough water to cover the scorched area and set the pot on the stove. Bring the pot to a boil and let it boil for 5-10 minutes. Once it's done, take it off the stove and pour out the water. Scrub the pot down with steel wool and soap to take off the burned areas. Deglaze the pan with water or vinegar to help with large bits. To deglaze the pan, heat it up without anything in it over high heat. It's ready when you drop a small amount of water in it and the water sizzles. Once it's done, pour in enough water or vinegar to coat the bottom of the pan and leave it to cook for a minute or two. Use a plastic spatula to scrape off the burned-on bits, then wash the pan as you normally do. This method will produce a lot of steam, so stay back! Don't use this method on nonstick pans, as you shouldn't heat them up without anything in them. Slice lemons in the pan and boil the water for a gentle acid cleaner. Use enough water to cover the 2-3 lemons you cut up in the pan. Place the pot over high heat and let it come to boil. When it boils, let it continue for about 5 minutes, then take the pan off the heat. Scrub the pan down with soap and a scrubbing pad to remove the burnt-on bits. You can use any citrus with this method, such as limes, grapefruits, or oranges. You don't have the cut the citrus up very much. Slices or quarters is fine. Using Vinegar and Baking Soda Together Add enough water and white vinegar to the pot to cover the bottom. Fill the bottom of the pan with just enough water to cover it. Add 1 cup (240 mL) of vinegar to the water in the pot. Don't use the good stuff. Just stick to good old white distilled vinegar. It will do the trick. Bring the water and vinegar to a boil. Set the pan on the stove and turn the burner on high. Let the solution heat up until you see a rolling boil. Let it boil for a few minutes, as you keep an eye on it. Once you see the burnt-on bits starting to come up, take it off the stove. This step will get pretty smelly, so be prepared! Sprinkle in baking soda after pouring out the vinegar. Pour the vinegar/water mixture down the sink. Add enough baking soda into the pan that you lightly coat the bottom of the pan. You'll get a good fizz from this combination so watch out! Scrub the pan thoroughly with a steel wool pad. Use small circles to scrub the pan, applying elbow grease as you do. Go around the pan several times to remove as much of the crud as you can. If you need to, you can rinse it out and add a bit more baking soda. In fact, if some areas don't come clean, just mix a little baking soda with water and leave it on the pan for 30 minutes to an hour. When you come back, the stubborn spots should be easy to remove. Wash the pan with soap and a regular sponge. Once the scoured bits are mostly gone, clean the pot as you usually do. Scrub down the inside with dishwashing detergent and a normal sponge, then rinse it out.",
  "tyn_model":[
    "water",
    "baking soda",
    "vinegar",
    "soap",
    "pot",
    "sponge",
    "dryer sheet",
    "salt",
    "stove",
    "hot water",
    "steel wool",
    "oxalic acid",
    "aluminum foil",
    "tea kettle",
    "dish soap",
    "tap water",
    "fabric softener",
    "bleach cleansing powder",
    "comet",
    "white, distilled vinegar",
    "sea salt",
    "kosher salt",
    "dishwashing soap",
    "melamine sponge",
    "eraser",
    "plastic spatula",
    "lemons",
    "pan",
    "scrubbing pad",
    "oranges",
    "white vinegar",
    "white distilled vinegar",
    "steel wool pad",
    "regular sponge",
    "dishwashing detergent"
  ],
  "tyn_section":[

  ]
}