{
  "title":"How to Die in Minecraft",
  "url":"https://www.wikihow.com/Die-in-Minecraft",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft"
  ],
  "methods":[
    {
      "name":"Dying without Losing Items",
      "steps":[
        {
          "headline":"Choose your death.",
          "description":"Death is always close at hand in Minecraft. Read about how to die in the section below. But if you don't want to lose all your items, read this section first."
        },
        {
          "headline":"Store your items in a chest.",
          "description":"Make a chest out of eight wooden planks. Place the chest on the ground, then move all valuable items from your inventory into the chest. In single player, place the chest somewhere obvious, such as on the top of a hill. In multiplayer, hide the chest underground to hide it from other players. Mark the land above it with a torch so you know where to dig later. If you have OP rights (Cheats), you can also use the command /gamerule keepInventory true to protect your inventory."
        },
        {
          "headline":"Check your coordinates.",
          "description":"These coordinates will tell you exactly where you are in the world. Check them while standing next to your chest:\nIn Minecraft for Windows or Mac, press F3. (If that doesn't work, press Fn+F3.) In Minecraft for Xbox or PlayStation, make a map, equip it and use it. There is a way to find coordinates in Minecraft Pocket Edition. Go into game settings and scroll down until you find the 'Show Coordinates' button. Slide the button across and there should be 3 sets of numbers at the top of your screen when you return back."
        },
        {
          "headline":"Write down your coordinates.",
          "description":"Write down the X, Y, and Z values that appear as text at the top of the screen, or on the map. Use a real piece of paper, not just the chat box."
        },
        {
          "headline":"Kill yourself.",
          "description":"Kill yourself any way you like. There are many methods listed in the next section below."
        },
        {
          "headline":"Check your coordinates.",
          "description":"When you respawn, you'll be back at the last bed you slept in, or your original spawn point. Use the method described above to display your coordinates. Write down these as well, so you don't get lost again."
        },
        {
          "headline":"Use the coordinates to find your item chest.",
          "description":"With the coordinates open, walk around and watch the X, Y, and Z values change. Find the direction that causes these values to approach the coordinates you wrote down earlier. When you reach them, look around for your chest. Pick up your items, and walk back to your spawn point using the same method. X and Z are the North/South and East/West coordinates. Get these right first. The Y value tells you how far you are above or below sea level. You can usually ignore this unless you died underground or on a steep mountain slope."
        },
        {
          "headline":"Retain your items.",
          "description":"If you have commands on, you could type the command \"/gamerule keepInventory true\" into the chat. This makes it so that your items are with you, even after you die."
        }
      ]
    },
    {
      "name":"Dying in Survival or Adventure Mode",
      "steps":[
        {
          "headline":"Fall a long distance.",
          "description":"Leap off a tall cliff and you'll take a large amount of damage. You may need to repeat this a couple times if there are only small hills available. If you have a large amount of dirt or other worthless blocks, you can build a tower to leap from. Face the ground at your feet and jump repeatedly, clicking to place the block as you do."
        },
        {
          "headline":"Suffocate under sand or gravel.",
          "description":"Dig a pit three blocks deep. Jump inside and place two blocks of sand or gravel above your head. These will fall onto you and cover your head, causing you to take damage until you die."
        },
        {
          "headline":"Drown.",
          "description":"Any water two blocks deep can drown you. Step underneath and wait until all of your air bubbles are gone. These should be located next to your hearts. If you want to die an honorable, wet death at any moment, carry around a bucket of water. Dig a pit two blocks deep, empty the bucket to fill it, and jump into your private death sauna."
        },
        {
          "headline":"Die by cactus.",
          "description":"Walk into a cactus repeatedly for the death by a thousand spines. If you're playing multiplayer, the chat will tell everyone that you were \"pricked to death.\""
        },
        {
          "headline":"Dig down to find lava.",
          "description":"Lava is most commonly found far beneath the surface. Explore a cave or simply dig straight down and hope for a fiery doom."
        },
        {
          "headline":"Set yourself on fire in survival mode.",
          "description":"If you're lost in the wilderness, you can take your revenge on the wilderness by starting a forest fire. Note that this will not work on adventure mode. Here's a step by step guide for your funeral pyre:\nBreak gravel with a shovel until a piece of flint drops. Mine iron with a stone pickaxe. Iron can be found at ground level, but is much more common lower down. Make a furnace and use it to smelt the iron ore into iron ingots. Craft the iron and flint together to make flint and steel. Use the flint and steel to set fire to the top of any solid block, or the side of flammable blocks such as wood. Walk into the fire to kill yourself."
        },
        {
          "headline":"Seek out monsters.",
          "description":"Enemy mobs spawn at night or deep underground. Run up to the first one you see and it will be happy to kill you. If you're playing single player, use the settings menu to raise the difficulty to hard\nThe black, tentacled \"Endermen\" won't turn hostile until you look directly at their heads."
        },
        {
          "headline":"Show off with a flashy death.",
          "description":"Try the following if you want a flashy way to die:\n\nCreate a monster trap and stand at its base. Build a cannon with the controls sitting in the path of a fire. Craft TNT from 5 gunpowder and 4 sand, then blow it up with fire. Find gunpowder by killing creepers, ghasts, or witches."
        }
      ]
    },
    {
      "name":"Dying in Creative Mode",
      "steps":[
        {
          "headline":"Dig below the world in Minecraft for PC.",
          "description":"Dig straight down until you break through the bedrock. Float down through it and stay in the Void outside the world until you die. You cannot destroy bedrock in Minecraft for consoles or mobile devices (Survival Mode only), so this is only possible if you are on a computer."
        },
        {
          "headline":"Use the kill command in Minecraft for PC.",
          "description":"This is not possible in Pocket Edition or Console edition. Follow these instructions:\nOpen the chat window with T or /. Type kill and press enter. If nothing happens, you need to temporarily enable cheats and try again. In single player, press Esc to open the menu, then select Open to LAN → Allow Cheats → Start LAN World."
        },
        {
          "headline":"Enter the void in other versions.",
          "description":"If you are playing Minecraft on a phone, tablet, or gaming console, there's only one way to kill yourself. Here it is:\nSelect End Portal Frames in the \"Decoration Blocks\" section. Place them in a 4x4 square, without any corners. Create an End Portal by placing an Eye of Ender in each of the twelve portal frames. You can find this item in the \"Miscellaneous\" section. Wait for the black portal to appear in the square, then go through it. Once in the end region, walk off the edge of the land and sink downward. Once you reach 65 blocks below sea level, you'll start to take damage, then die."
        }
      ]
    }
  ],
  "text":" Dying without Losing Items Choose your death. Death is always close at hand in Minecraft. Read about how to die in the section below. But if you don't want to lose all your items, read this section first. Store your items in a chest. Make a chest out of eight wooden planks. Place the chest on the ground, then move all valuable items from your inventory into the chest. In single player, place the chest somewhere obvious, such as on the top of a hill. In multiplayer, hide the chest underground to hide it from other players. Mark the land above it with a torch so you know where to dig later. If you have OP rights (Cheats), you can also use the command /gamerule keepInventory true to protect your inventory. Check your coordinates. These coordinates will tell you exactly where you are in the world. Check them while standing next to your chest:\nIn Minecraft for Windows or Mac, press F3. (If that doesn't work, press Fn+F3.) In Minecraft for Xbox or PlayStation, make a map, equip it and use it. There is a way to find coordinates in Minecraft Pocket Edition. Go into game settings and scroll down until you find the 'Show Coordinates' button. Slide the button across and there should be 3 sets of numbers at the top of your screen when you return back. Write down your coordinates. Write down the X, Y, and Z values that appear as text at the top of the screen, or on the map. Use a real piece of paper, not just the chat box. Kill yourself. Kill yourself any way you like. There are many methods listed in the next section below. Check your coordinates. When you respawn, you'll be back at the last bed you slept in, or your original spawn point. Use the method described above to display your coordinates. Write down these as well, so you don't get lost again. Use the coordinates to find your item chest. With the coordinates open, walk around and watch the X, Y, and Z values change. Find the direction that causes these values to approach the coordinates you wrote down earlier. When you reach them, look around for your chest. Pick up your items, and walk back to your spawn point using the same method. X and Z are the North/South and East/West coordinates. Get these right first. The Y value tells you how far you are above or below sea level. You can usually ignore this unless you died underground or on a steep mountain slope. Retain your items. If you have commands on, you could type the command \"/gamerule keepInventory true\" into the chat. This makes it so that your items are with you, even after you die. Dying in Survival or Adventure Mode Fall a long distance. Leap off a tall cliff and you'll take a large amount of damage. You may need to repeat this a couple times if there are only small hills available. If you have a large amount of dirt or other worthless blocks, you can build a tower to leap from. Face the ground at your feet and jump repeatedly, clicking to place the block as you do. Suffocate under sand or gravel. Dig a pit three blocks deep. Jump inside and place two blocks of sand or gravel above your head. These will fall onto you and cover your head, causing you to take damage until you die. Drown. Any water two blocks deep can drown you. Step underneath and wait until all of your air bubbles are gone. These should be located next to your hearts. If you want to die an honorable, wet death at any moment, carry around a bucket of water. Dig a pit two blocks deep, empty the bucket to fill it, and jump into your private death sauna. Die by cactus. Walk into a cactus repeatedly for the death by a thousand spines. If you're playing multiplayer, the chat will tell everyone that you were \"pricked to death.\" Dig down to find lava. Lava is most commonly found far beneath the surface. Explore a cave or simply dig straight down and hope for a fiery doom. Set yourself on fire in survival mode. If you're lost in the wilderness, you can take your revenge on the wilderness by starting a forest fire. Note that this will not work on adventure mode. Here's a step by step guide for your funeral pyre:\nBreak gravel with a shovel until a piece of flint drops. Mine iron with a stone pickaxe. Iron can be found at ground level, but is much more common lower down. Make a furnace and use it to smelt the iron ore into iron ingots. Craft the iron and flint together to make flint and steel. Use the flint and steel to set fire to the top of any solid block, or the side of flammable blocks such as wood. Walk into the fire to kill yourself. Seek out monsters. Enemy mobs spawn at night or deep underground. Run up to the first one you see and it will be happy to kill you. If you're playing single player, use the settings menu to raise the difficulty to hard\nThe black, tentacled \"Endermen\" won't turn hostile until you look directly at their heads. Show off with a flashy death. Try the following if you want a flashy way to die:\n\nCreate a monster trap and stand at its base. Build a cannon with the controls sitting in the path of a fire. Craft TNT from 5 gunpowder and 4 sand, then blow it up with fire. Find gunpowder by killing creepers, ghasts, or witches. Dying in Creative Mode Dig below the world in Minecraft for PC. Dig straight down until you break through the bedrock. Float down through it and stay in the Void outside the world until you die. You cannot destroy bedrock in Minecraft for consoles or mobile devices (Survival Mode only), so this is only possible if you are on a computer. Use the kill command in Minecraft for PC. This is not possible in Pocket Edition or Console edition. Follow these instructions:\nOpen the chat window with T or /. Type kill and press enter. If nothing happens, you need to temporarily enable cheats and try again. In single player, press Esc to open the menu, then select Open to LAN → Allow Cheats → Start LAN World. Enter the void in other versions. If you are playing Minecraft on a phone, tablet, or gaming console, there's only one way to kill yourself. Here it is:\nSelect End Portal Frames in the \"Decoration Blocks\" section. Place them in a 4x4 square, without any corners. Create an End Portal by placing an Eye of Ender in each of the twelve portal frames. You can find this item in the \"Miscellaneous\" section. Wait for the black portal to appear in the square, then go through it. Once in the end region, walk off the edge of the land and sink downward. Once you reach 65 blocks below sea level, you'll start to take damage, then die.",
  "tyn_model":[
    "minecraft",
    "gravel",
    "iron",
    "flint",
    "items",
    "sand",
    "water",
    "bucket",
    "lava",
    "bedrock",
    "chest",
    "torch",
    "map",
    "paper",
    "shovel",
    "stone pickaxe",
    "furnace",
    "iron ore",
    "iron ingots",
    "cannon",
    "tnt",
    "→ allow",
    "→ start",
    "ender"
  ],
  "tyn_section":[

  ]
}