{
  "title":"How to Create a Hot Pastrami Sandwich",
  "url":"https://www.wikihow.com/Create-a-Hot-Pastrami-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Meat and Poultry Sandwiches"
  ],
  "steps":[
    {
      "headline":"Lightly butter bread slices.",
      "description":""
    },
    {
      "headline":"Heat skillet over medium heat.",
      "description":"Add butter and melt in skillet, if you are not using a nonstick skillet. Or spray the pan with nonstick cooking spray before heating."
    },
    {
      "headline":"Place 2 bread slices, butter side down, in skillet.",
      "description":""
    },
    {
      "headline":"Top each bread slice with 2 slices cheese, 1 tablespoon dressing, 3 ounces Pastrami and ¼ of the coleslaw.",
      "description":""
    },
    {
      "headline":"Top sandwich with buttered bread slice.",
      "description":"Make sure the buttered bread slices are on the outside of the sandwich."
    },
    {
      "headline":"Cook sandwiches 4 to 6 minutes or until bread is golden brown and cheese is melted, turning once.",
      "description":""
    },
    {
      "headline":"Repeat with remaining sandwiches.",
      "description":""
    },
    {
      "headline":"Serve with additional Thousand Island dressing, if desired.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Lightly butter bread slices.  Heat skillet over medium heat. Add butter and melt in skillet, if you are not using a nonstick skillet. Or spray the pan with nonstick cooking spray before heating. Place 2 bread slices, butter side down, in skillet.  Top each bread slice with 2 slices cheese, 1 tablespoon dressing, 3 ounces Pastrami and ¼ of the coleslaw.  Top sandwich with buttered bread slice. Make sure the buttered bread slices are on the outside of the sandwich. Cook sandwiches 4 to 6 minutes or until bread is golden brown and cheese is melted, turning once.  Repeat with remaining sandwiches.  Serve with additional Thousand Island dressing, if desired.  Finished. ",
  "tyn_model":[
    "skillet",
    "butter",
    "nonstick skillet",
    "nonstick cooking spray",
    "dressing",
    "pastrami",
    "coleslaw",
    "thousand island dressing"
  ],
  "tyn_section":[

  ]
}