{
  "title":"How to Make Dinosaur Goody Bags",
  "url":"https://www.wikihow.com/Make-Dinosaur-Goody-Bags",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Decorations",
    "Party Favors"
  ],
  "parts":[
    {
      "name":"Making the dinosaur goody bags",
      "steps":[
        {
          "headline":"Skip this section if you're using pre-made bags.",
          "description":""
        },
        {
          "headline":"Choose the method for decorating the plain goody bags.",
          "description":"You can make them in any of the following ways:\nStamped dinosaur goody bags\nAttaching dinosaur images\nHand drawn dinosaur goody bag\nCardboard cut-out dinosaur goody bag. Each of these types is explained in the following steps. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f3\\/Make-Dinosaur-Goody-Bags-Step-4.jpg\\/v4-459px-Make-Dinosaur-Goody-Bags-Step-4.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f3\\/Make-Dinosaur-Goody-Bags-Step-4.jpg\\/v4-759px-Make-Dinosaur-Goody-Bags-Step-4.jpg\",\"smallWidth\":460,\"smallHeight\":334,\"bigWidth\":760,\"bigHeight\":552.2527472527472,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Make a stamped dinosaur goody bag.",
          "description":"Use your own dinosaur stamps or purchase some. These stamps can be found in the dollar store, through retailers who sell stamping equipment (hobby, craft and toy stores) and from online sellers. Decide on the design. Either stamp the dinosaurs onto the goody bag randomly, or design a pattern on a piece of plain paper first and use that as a guide. Stamp the dinosaurs in place. It's easier to do this as a production line if there are lots to do––set the goody bags out in a row and work your way down the row methodically. Write, print or stick on the words \"Dino Goody Bag\" if wished."
        },
        {
          "headline":"Make an attached image dinosaur goody bag.",
          "description":"Find suitable pictures of dinosaurs in magazines, old books, online pictures printed off or stickers. Decide on the design. Either glue or stick the dinosaurs onto the goody bag randomly, or design a pattern on a piece of plain paper first and use that as a guide. Glue or stick the dinosaur images or stickers in place. It's easier to do this as a production line if there are lots to do––set the goody bags out in a row and work your way down the row methodically. Write, print or stick on the words \"Dino Goody Bag\" if wished."
        },
        {
          "headline":"Make a hand drawn dinosaur goody bag.",
          "description":"This is best done by young children, allowing them the freedom to draw any dinosaurs they like. Don't make this too involved, especially not if there are lots of goody bags to make, as it can be time consuming and the bags are never kept for long anyway. Set out the goody bags. Give your child plenty of coloring tools (markers, pencil, paint). Ask your child to draw at least one dinosaur on each bag. They're allowed to add a tree or more than one dinosaur if they like but not too much, as they need to finish all of the bags needed."
        },
        {
          "headline":"Make a cardboard cut-out dinosaur goody bag.",
          "description":"Draw or find an image of a dinosaur that is the size of the goody bag. It can be slightly bigger if wished, as having some of the image hang over the top or sides of the bag is fine. Make a template of this design for tracing around. Another alternative is to purchase or make a stencil. Transfer the image to thin cardboard by tracing around the template (or stencil). Use any colors you like, perhaps match the cardboard to a party color theme if relevant. Make as many as you have goody bags. Cut the dinosaur images out. Be as neat as possible. Glue the image onto the front of each goody bag. Do not allow any of the image to go under the base of the bag but sticking out of the sides and top is fine. The base needs to be able to stand up properly. Allow to dry. Done. The cut-outs can be written on, such as a child's name, if wished."
        }
      ]
    },
    {
      "name":"Filling the dinosaur goody bags",
      "steps":[
        {
          "headline":"Find suitable filers for the goody bags.",
          "description":"Head on down to the dollar store or other cheap toy or party supplies store to find some dinosaur related goodies. Here are some ideas for fillers:\nToy dinosaurs\nDinosaur stickers or temporary tattoos\nDinosaur candies\nDinosaur play sets\nDinosaur coloring books\nDinosaur mini games\nDinosaur poster or postcards\nDinosaur wallets or purses, and so forth."
        },
        {
          "headline":"Finish up.",
          "description":"Consider tying a helium-filled balloon on the handles to keep the bag tied together. All the better if you can find a dinosaur-designed balloon."
        },
        {
          "headline":"Put the finished bags somewhere safe during the party, such as on a table or on the floor but out of the way.",
          "description":"When the kids are leaving, hand out the goody bags as they go."
        }
      ]
    }
  ],
  "text":" Making the dinosaur goody bags Skip this section if you're using pre-made bags.  Choose the method for decorating the plain goody bags. You can make them in any of the following ways:\nStamped dinosaur goody bags\nAttaching dinosaur images\nHand drawn dinosaur goody bag\nCardboard cut-out dinosaur goody bag. Each of these types is explained in the following steps. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f3\\/Make-Dinosaur-Goody-Bags-Step-4.jpg\\/v4-459px-Make-Dinosaur-Goody-Bags-Step-4.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f3\\/Make-Dinosaur-Goody-Bags-Step-4.jpg\\/v4-759px-Make-Dinosaur-Goody-Bags-Step-4.jpg\",\"smallWidth\":460,\"smallHeight\":334,\"bigWidth\":760,\"bigHeight\":552.2527472527472,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Make a stamped dinosaur goody bag. Use your own dinosaur stamps or purchase some. These stamps can be found in the dollar store, through retailers who sell stamping equipment (hobby, craft and toy stores) and from online sellers. Decide on the design. Either stamp the dinosaurs onto the goody bag randomly, or design a pattern on a piece of plain paper first and use that as a guide. Stamp the dinosaurs in place. It's easier to do this as a production line if there are lots to do––set the goody bags out in a row and work your way down the row methodically. Write, print or stick on the words \"Dino Goody Bag\" if wished. Make an attached image dinosaur goody bag. Find suitable pictures of dinosaurs in magazines, old books, online pictures printed off or stickers. Decide on the design. Either glue or stick the dinosaurs onto the goody bag randomly, or design a pattern on a piece of plain paper first and use that as a guide. Glue or stick the dinosaur images or stickers in place. It's easier to do this as a production line if there are lots to do––set the goody bags out in a row and work your way down the row methodically. Write, print or stick on the words \"Dino Goody Bag\" if wished. Make a hand drawn dinosaur goody bag. This is best done by young children, allowing them the freedom to draw any dinosaurs they like. Don't make this too involved, especially not if there are lots of goody bags to make, as it can be time consuming and the bags are never kept for long anyway. Set out the goody bags. Give your child plenty of coloring tools (markers, pencil, paint). Ask your child to draw at least one dinosaur on each bag. They're allowed to add a tree or more than one dinosaur if they like but not too much, as they need to finish all of the bags needed. Make a cardboard cut-out dinosaur goody bag. Draw or find an image of a dinosaur that is the size of the goody bag. It can be slightly bigger if wished, as having some of the image hang over the top or sides of the bag is fine. Make a template of this design for tracing around. Another alternative is to purchase or make a stencil. Transfer the image to thin cardboard by tracing around the template (or stencil). Use any colors you like, perhaps match the cardboard to a party color theme if relevant. Make as many as you have goody bags. Cut the dinosaur images out. Be as neat as possible. Glue the image onto the front of each goody bag. Do not allow any of the image to go under the base of the bag but sticking out of the sides and top is fine. The base needs to be able to stand up properly. Allow to dry. Done. The cut-outs can be written on, such as a child's name, if wished. Filling the dinosaur goody bags Find suitable filers for the goody bags. Head on down to the dollar store or other cheap toy or party supplies store to find some dinosaur related goodies. Here are some ideas for fillers:\nToy dinosaurs\nDinosaur stickers or temporary tattoos\nDinosaur candies\nDinosaur play sets\nDinosaur coloring books\nDinosaur mini games\nDinosaur poster or postcards\nDinosaur wallets or purses, and so forth. Finish up. Consider tying a helium-filled balloon on the handles to keep the bag tied together. All the better if you can find a dinosaur-designed balloon. Put the finished bags somewhere safe during the party, such as on a table or on the floor but out of the way. When the kids are leaving, hand out the goody bags as they go.",
  "tyn_model":[
    "goody bags",
    "glue",
    "cardboard",
    "goody bag",
    "cardboard cut-out dinosaur goody bag",
    "stamps",
    "dino goody bag",
    "stickers",
    "coloring tools",
    "markers",
    "pencil",
    "paint",
    "helium-filled balloon"
  ],
  "tyn_section":[

  ]
}