{
  "title":"How to Run an 18V Ryobi Tool Using a Car Battery",
  "url":"https://www.wikihow.com/Run-an-18V-Ryobi-Tool-Using-a-Car-Battery",
  "category_hierarchy":[
    "Home and Garden",
    "Tools"
  ],
  "steps":[
    {
      "headline":"Cut 7 or 8 inches (17.8 or 20.3 cm) off a length of 1.125\" (1 1/8\") diameter dowel rod.",
      "description":"The extra length gives you something to grab when inserting and removing this replacement for the battery pack."
    },
    {
      "headline":"Cut about 4 inches (10.2 cm) from a piece of 3/4\"x1/8\" rectangular aluminum stock.",
      "description":""
    },
    {
      "headline":"Drill two holes in the aluminum stock, at about 1/2\" and 1\" from one end, at about the center.",
      "description":"See where the screws are in the photo; that's where the holes were drilled."
    },
    {
      "headline":"Holding the other end (that which you didn't drill) of the aluminum piece flush with the end of the dowel, screw the aluminum to the dowel with small wood screws.",
      "description":"Drill pilot holes first if necessary."
    },
    {
      "headline":"Cut half-moon shaped notches into the end of the dowel at about 2 and 10 o-clock, with the center of the aluminum as 6 o'clock.",
      "description":"See the notches in the photo for clarification."
    },
    {
      "headline":"Push the dowel into the tool, aligning the aluminum with the flat side of the battery compartment, making sure the notches are big enough to enable the dowel to seat completely.",
      "description":"Adjust until it fits. Don't force it and bend the metal connectors at the base of the battery compartment; this carving is to ensure it goes over them."
    },
    {
      "headline":"Connect the two wires, using wood screws, to the end of the dowel, such that the stripped and twisted wires stay in the notches.",
      "description":"Make sure the positive (red) wire is on the left with it held upright as seen here; it will be on the right when you invert it and push it into the battery slot."
    },
    {
      "headline":"Clip the battery leads, red to positive (+) and black to negative (-), to your car battery or 12 V solar setup.",
      "description":""
    },
    {
      "headline":"Plug the dowel into the tool, seating it completely, and making sure the wires stayed put as you pushed it in.",
      "description":""
    },
    {
      "headline":"Safely turn on the tool and make sure it works.",
      "description":""
    }
  ],
  "text":" Cut 7 or 8 inches (17.8 or 20.3 cm) off a length of 1.125\" (1 1/8\") diameter dowel rod. The extra length gives you something to grab when inserting and removing this replacement for the battery pack. Cut about 4 inches (10.2 cm) from a piece of 3/4\"x1/8\" rectangular aluminum stock.  Drill two holes in the aluminum stock, at about 1/2\" and 1\" from one end, at about the center. See where the screws are in the photo; that's where the holes were drilled. Holding the other end (that which you didn't drill) of the aluminum piece flush with the end of the dowel, screw the aluminum to the dowel with small wood screws. Drill pilot holes first if necessary. Cut half-moon shaped notches into the end of the dowel at about 2 and 10 o-clock, with the center of the aluminum as 6 o'clock. See the notches in the photo for clarification. Push the dowel into the tool, aligning the aluminum with the flat side of the battery compartment, making sure the notches are big enough to enable the dowel to seat completely. Adjust until it fits. Don't force it and bend the metal connectors at the base of the battery compartment; this carving is to ensure it goes over them. Connect the two wires, using wood screws, to the end of the dowel, such that the stripped and twisted wires stay in the notches. Make sure the positive (red) wire is on the left with it held upright as seen here; it will be on the right when you invert it and push it into the battery slot. Clip the battery leads, red to positive (+) and black to negative (-), to your car battery or 12 V solar setup.  Plug the dowel into the tool, seating it completely, and making sure the wires stayed put as you pushed it in.  Safely turn on the tool and make sure it works. ",
  "tyn_model":[
    "aluminum",
    "dowel",
    "tool",
    "dowel rod",
    "screws",
    "small wood screws",
    "wood screws",
    "car battery",
    "12 v solar"
  ],
  "tyn_section":[

  ]
}