{
  "title":"How to Make Ham and Green Beans",
  "url":"https://www.wikihow.com/Make-Ham-and-Green-Beans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "steps":[
    {
      "headline":"Bring the ham end and  water to a boil then simmer for about 2 1/2 hours.",
      "description":""
    },
    {
      "headline":"Remove Dutch oven from the stove, cool ham and broth completely.",
      "description":""
    },
    {
      "headline":"Remove the ham to  bowl, cover, chill overnight.",
      "description":""
    },
    {
      "headline":"Skim off the fat and discard.",
      "description":""
    },
    {
      "headline":"Add 1/2 cup of the broth into a Dutch oven over and add the chopped onion.",
      "description":"Brown onion over medium heat."
    },
    {
      "headline":"Measure out 6 cups ham broth into a measuring cup.",
      "description":"Add water to the broth, to make 6 cups, if you do not have enough broth to make 6 cups of liquid."
    },
    {
      "headline":"Add the broth/water to the browned onions.",
      "description":""
    },
    {
      "headline":"Add the frozen green beans, diced potatoes and pepper to the Dutch oven.",
      "description":""
    },
    {
      "headline":"Cook on medium heat until potatoes are tender.",
      "description":"Add salt to taste, if needed."
    },
    {
      "headline":"Chop the cooked ham into bite sized pieces and add to the mixture.",
      "description":""
    },
    {
      "headline":"Cook over medium heat until potatoes are tender.",
      "description":"Add broth or water to keep the ingredients from sticking. You may also need to remove broth from the pot, if the vegetables are tender, and there is too much liquid."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Bring the ham end and  water to a boil then simmer for about 2 1/2 hours.  Remove Dutch oven from the stove, cool ham and broth completely.  Remove the ham to  bowl, cover, chill overnight.  Skim off the fat and discard.  Add 1/2 cup of the broth into a Dutch oven over and add the chopped onion. Brown onion over medium heat. Measure out 6 cups ham broth into a measuring cup. Add water to the broth, to make 6 cups, if you do not have enough broth to make 6 cups of liquid. Add the broth/water to the browned onions.  Add the frozen green beans, diced potatoes and pepper to the Dutch oven.  Cook on medium heat until potatoes are tender. Add salt to taste, if needed. Chop the cooked ham into bite sized pieces and add to the mixture.  Cook over medium heat until potatoes are tender. Add broth or water to keep the ingredients from sticking. You may also need to remove broth from the pot, if the vegetables are tender, and there is too much liquid. Finished. ",
  "tyn_model":[
    "broth",
    "water",
    "dutch oven",
    "ham",
    "potatoes",
    "onion",
    "bowl",
    "ham broth",
    "measuring cup",
    "green beans",
    "pepper",
    "salt",
    "pot"
  ],
  "tyn_section":[

  ]
}