{
  "title":"How to Make \"Branded\" Pancakes",
  "url":"https://www.wikihow.com/Make-%22Branded%22-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "steps":[
    {
      "headline":"Stir up your favorite pancake batter.",
      "description":"You can use a pancake or biscuit mix to speed things along, if you like."
    },
    {
      "headline":"Preheat and grease the griddle.",
      "description":"(Grease the griddle if necessary but most modern griddles don't need this step)."
    },
    {
      "headline":"Draw out the initials on a piece of paper to help visualize the pattern you would like to use.",
      "description":""
    },
    {
      "headline":"Drop the batter in a backwards initial onto the griddle.",
      "description":""
    },
    {
      "headline":"Cook until the initial starts to brown.",
      "description":""
    },
    {
      "headline":"Pour a spoonful of pancake batter over partially cooked initial.",
      "description":""
    },
    {
      "headline":"Bake the pancake until the edges look dry and bubbles appear around the pancake edge.",
      "description":""
    },
    {
      "headline":"Flip the pancake and cook until golden.",
      "description":""
    },
    {
      "headline":"Remove from griddle and serve hot.",
      "description":""
    }
  ],
  "text":" Stir up your favorite pancake batter. You can use a pancake or biscuit mix to speed things along, if you like. Preheat and grease the griddle. (Grease the griddle if necessary but most modern griddles don't need this step). Draw out the initials on a piece of paper to help visualize the pattern you would like to use.  Drop the batter in a backwards initial onto the griddle.  Cook until the initial starts to brown.  Pour a spoonful of pancake batter over partially cooked initial.  Bake the pancake until the edges look dry and bubbles appear around the pancake edge.  Flip the pancake and cook until golden.  Remove from griddle and serve hot. ",
  "tyn_model":[
    "griddle",
    "pancake or biscuit mix",
    "pancake batter"
  ],
  "tyn_section":[

  ]
}