{
  "title":"How to Make Buffalo Wing Dip",
  "url":"https://www.wikihow.com/Make-Buffalo-Wing-Dip",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Dips"
  ],
  "steps":[
    {
      "headline":"Rinse each chicken breast in the sink with cold water.",
      "description":"If the chicken is still frozen, then make sure to fully defrost before boiling. (Be sure that you disinfect the sink after chicken is placed into the boiling water)."
    },
    {
      "headline":"Fill a pot with enough water so each chicken is fully covered and wait for the water to come to a boil.",
      "description":""
    },
    {
      "headline":"Place both chicken breasts into the boiled water and reduce to a simmer.",
      "description":"Cover the pot and allow the chicken to cook until the insides of the chicken breasts are no longer pink. The amount of time that you need to allow it to cook can vary depending on the thickness of the chicken. However, it should take no longer than 25 minutes."
    },
    {
      "headline":"Remove both chicken breasts from water and drain the liquid down the sink.",
      "description":""
    },
    {
      "headline":"Place the cooked chicken on a clean plate.",
      "description":"Use a fork and knife to shred the chicken until you get two full cups of meat, and place the shredded chicken into a large mixing bowl."
    },
    {
      "headline":"Set the oven timer at 350 degrees Fahrenheit, or about 175 degrees Celsius.",
      "description":""
    },
    {
      "headline":"Take the 8 oz of cream cheese.",
      "description":"The cream cheese works best if it is at room temperature. If you are in a rush, then you can take the cream cheese out of the foil, place it onto a paper plate, and warm it up for 10 seconds in the microwave. The cream cheese should not be fully melted, but easy enough to mix and place it in the same bowl with the chicken."
    },
    {
      "headline":"Measure one cup of ranch dressing and place it in the large mixing bowl.",
      "description":"If you would like, blue cheese can be used in place of ranch dressing, to really make the dip \"Buffalo style.\""
    },
    {
      "headline":"Portion a 1/2 cup of hot sauce into the large bowl.",
      "description":"Depending on the spice preference of the people who will be eating this dip, you can add more or less to the mixture."
    },
    {
      "headline":"Shake the whole bag of shredded cheddar cheese into the bowl.",
      "description":""
    },
    {
      "headline":"Fold together all the ingredients using the spatula.",
      "description":"Make sure there are no visible signs of clumps."
    },
    {
      "headline":"Smooth the mixture into a greased casserole dish and bake it for 20 minutes, or until it is bubbly and browning on the side.",
      "description":""
    },
    {
      "headline":"Allow the dip to sit for 10-15 minutes.",
      "description":"After that, serve with various dipping foods such as tortilla chips, carrots, and celery."
    },
    {
      "headline":"Place the dip into the refrigerator if there are any leftovers left.",
      "description":"It is best to use the dip 2-5 days after making. When reheating, use a microwave safe plate and reheat for 30-40 seconds."
    }
  ],
  "text":" Rinse each chicken breast in the sink with cold water. If the chicken is still frozen, then make sure to fully defrost before boiling. (Be sure that you disinfect the sink after chicken is placed into the boiling water). Fill a pot with enough water so each chicken is fully covered and wait for the water to come to a boil.  Place both chicken breasts into the boiled water and reduce to a simmer. Cover the pot and allow the chicken to cook until the insides of the chicken breasts are no longer pink. The amount of time that you need to allow it to cook can vary depending on the thickness of the chicken. However, it should take no longer than 25 minutes. Remove both chicken breasts from water and drain the liquid down the sink.  Place the cooked chicken on a clean plate. Use a fork and knife to shred the chicken until you get two full cups of meat, and place the shredded chicken into a large mixing bowl. Set the oven timer at 350 degrees Fahrenheit, or about 175 degrees Celsius.  Take the 8 oz of cream cheese. The cream cheese works best if it is at room temperature. If you are in a rush, then you can take the cream cheese out of the foil, place it onto a paper plate, and warm it up for 10 seconds in the microwave. The cream cheese should not be fully melted, but easy enough to mix and place it in the same bowl with the chicken. Measure one cup of ranch dressing and place it in the large mixing bowl. If you would like, blue cheese can be used in place of ranch dressing, to really make the dip \"Buffalo style.\" Portion a 1/2 cup of hot sauce into the large bowl. Depending on the spice preference of the people who will be eating this dip, you can add more or less to the mixture. Shake the whole bag of shredded cheddar cheese into the bowl.  Fold together all the ingredients using the spatula. Make sure there are no visible signs of clumps. Smooth the mixture into a greased casserole dish and bake it for 20 minutes, or until it is bubbly and browning on the side.  Allow the dip to sit for 10-15 minutes. After that, serve with various dipping foods such as tortilla chips, carrots, and celery. Place the dip into the refrigerator if there are any leftovers left. It is best to use the dip 2-5 days after making. When reheating, use a microwave safe plate and reheat for 30-40 seconds.",
  "tyn_model":[
    "water",
    "cream cheese",
    "pot",
    "large mixing bowl",
    "ranch dressing",
    "plate",
    "fork",
    "knife",
    "oven timer",
    "foil",
    "microwave",
    "chicken",
    "blue cheese",
    "hot sauce",
    "large bowl",
    "cheddar cheese",
    "bowl",
    "spatula",
    "casserole dish",
    "tortilla chips",
    "carrots",
    "celery",
    "microwave safe plate"
  ],
  "tyn_section":[

  ]
}