{
  "title":"How to Send an Evite on Facebook",
  "url":"https://www.wikihow.com/Send-an-Evite-on-Facebook",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Planning",
    "Invitations"
  ],
  "methods":[
    {
      "name":"Sending an Evite on Facebook's Website",
      "steps":[
        {
          "headline":"Go to Facebook.",
          "description":"Visit the Facebook home page from any web browser."
        },
        {
          "headline":"Log in.",
          "description":"Use your Facebook account and password to log in. The login fields are found on the upper right corner of the page. Click the “Log in” button to proceed."
        },
        {
          "headline":"Click the Events link.",
          "description":"It is right under your name and profile picture on the upper left panel. You will be brought to your Events page. You can see all your events from here."
        },
        {
          "headline":"Create a new event.",
          "description":"Click the “Create” button on the rightmost part of the header tabs of the Events page. A small window for “Create new event” will appear. Type in the name of your event in the first field. Are you celebrating a birthday, a baptism, a wedding? Put it in and make it interesting. You can put some additional info for your guests, such as attire, gift registries, and directions in the second field. Clearly indicate where your event will take place in the third field. Make it very specific so that your guests can easily find it. Clearly indicate the date and time of your event in the next field. Select from the drop-down list the privacy level of your event. You can set it to Public (makes your event open to public and anyone can join), Open Invitation (allows your existing invitees to invite others as well), Guests and Friends (restricts your event to your invitees and friends only), or Invitation Only (makes your event closed with only you being able to invite others)."
        },
        {
          "headline":"Click the “Create” button to save and create your event.",
          "description":"You will be brought to the event's Facebook page."
        },
        {
          "headline":"Click the “Invite” button on the upper right corner of the page.",
          "description":"It is right under the event's cover photo. This will bring up the Invite window."
        },
        {
          "headline":"Select the friends you're inviting to your event.",
          "description":"Do this by ticking the checkboxes beside their names. You can also use the search box at the top of the window to quickly filter your friends. The list of invitees will be displayed on the right panel."
        },
        {
          "headline":"Click “Send Invitations” at the bottom right corner of the window.",
          "description":"Your invitees will receive a Facebook notification telling them about the event you've created. You've now sent your evites on Facebook."
        }
      ]
    },
    {
      "name":"Sending an Evite via the Facebook App",
      "steps":[
        {
          "headline":"Launch Facebook.",
          "description":"Look for the Facebook app on your mobile device and tap on it."
        },
        {
          "headline":"Log in.",
          "description":"If you logged out of your previous Facebook session, you will be asked to log in. Enter your registered email address and password into the fields provided, and then tap “Log in” to access your account."
        },
        {
          "headline":"Go to Events.",
          "description":"Tap on the button with three horizontal bars on the upper left corner to see the main menu. Tap “Events” from here. You will be brought to your Events screen. You can see all your events from here."
        },
        {
          "headline":"Create an event.",
          "description":"Tap the “Create” button on the rightmost part of the header tabs of the Events screen. A small window for “Create Event” will appear. Type in the name of your event in the first field. Are you celebrating a birthday, a baptism, a wedding? Put it in and make it interesting. You can put some additional info for your guests, such as attire, gift registries, and directions in the second field. Clearly indicate where your event will take place in the next field. Make it very specific so that your guests can easily find it. Clearly indicate the date and time of your event in the Date and Time field. Select from the drop-down list the privacy level of your event. You can set it to Public (makes your event open to public and anyone can join), Open Invitation (allows your existing invitees to invite others as well), Guests and Friends (restricts your event to your invitees and friends only), or Invitation Only (makes your event closed with only you being able to invite others)."
        },
        {
          "headline":"Tap “Done” to save and create your event.",
          "description":"You will be brought to the event's Facebook page."
        },
        {
          "headline":"Tap the “Invite” button from the header menu.",
          "description":"It's right under the event's cover photo. This will bring up the Invite window."
        },
        {
          "headline":"Select the friends you're inviting to your event.",
          "description":"Do this by tapping the checkboxes beside their names. You can also use the search box at the top of the window to quickly filter your friends."
        },
        {
          "headline":"Tap “Send” at the top right corner of the window.",
          "description":"Your invitees will receive a Facebook notification telling them about the event you've created. You've now sent your evites on Facebook."
        }
      ]
    }
  ],
  "text":" Sending an Evite on Facebook's Website Go to Facebook. Visit the Facebook home page from any web browser. Log in. Use your Facebook account and password to log in. The login fields are found on the upper right corner of the page. Click the “Log in” button to proceed. Click the Events link. It is right under your name and profile picture on the upper left panel. You will be brought to your Events page. You can see all your events from here. Create a new event. Click the “Create” button on the rightmost part of the header tabs of the Events page. A small window for “Create new event” will appear. Type in the name of your event in the first field. Are you celebrating a birthday, a baptism, a wedding? Put it in and make it interesting. You can put some additional info for your guests, such as attire, gift registries, and directions in the second field. Clearly indicate where your event will take place in the third field. Make it very specific so that your guests can easily find it. Clearly indicate the date and time of your event in the next field. Select from the drop-down list the privacy level of your event. You can set it to Public (makes your event open to public and anyone can join), Open Invitation (allows your existing invitees to invite others as well), Guests and Friends (restricts your event to your invitees and friends only), or Invitation Only (makes your event closed with only you being able to invite others). Click the “Create” button to save and create your event. You will be brought to the event's Facebook page. Click the “Invite” button on the upper right corner of the page. It is right under the event's cover photo. This will bring up the Invite window. Select the friends you're inviting to your event. Do this by ticking the checkboxes beside their names. You can also use the search box at the top of the window to quickly filter your friends. The list of invitees will be displayed on the right panel. Click “Send Invitations” at the bottom right corner of the window. Your invitees will receive a Facebook notification telling them about the event you've created. You've now sent your evites on Facebook. Sending an Evite via the Facebook App Launch Facebook. Look for the Facebook app on your mobile device and tap on it. Log in. If you logged out of your previous Facebook session, you will be asked to log in. Enter your registered email address and password into the fields provided, and then tap “Log in” to access your account. Go to Events. Tap on the button with three horizontal bars on the upper left corner to see the main menu. Tap “Events” from here. You will be brought to your Events screen. You can see all your events from here. Create an event. Tap the “Create” button on the rightmost part of the header tabs of the Events screen. A small window for “Create Event” will appear. Type in the name of your event in the first field. Are you celebrating a birthday, a baptism, a wedding? Put it in and make it interesting. You can put some additional info for your guests, such as attire, gift registries, and directions in the second field. Clearly indicate where your event will take place in the next field. Make it very specific so that your guests can easily find it. Clearly indicate the date and time of your event in the Date and Time field. Select from the drop-down list the privacy level of your event. You can set it to Public (makes your event open to public and anyone can join), Open Invitation (allows your existing invitees to invite others as well), Guests and Friends (restricts your event to your invitees and friends only), or Invitation Only (makes your event closed with only you being able to invite others). Tap “Done” to save and create your event. You will be brought to the event's Facebook page. Tap the “Invite” button from the header menu. It's right under the event's cover photo. This will bring up the Invite window. Select the friends you're inviting to your event. Do this by tapping the checkboxes beside their names. You can also use the search box at the top of the window to quickly filter your friends. Tap “Send” at the top right corner of the window. Your invitees will receive a Facebook notification telling them about the event you've created. You've now sent your evites on Facebook.",
  "tyn_model":[
    "” button",
    "“create",
    "facebook",
    "“log",
    "” will",
    "“invite",
    "“send",
    "” at",
    "” to",
    "“events",
    "” from",
    "“done"
  ],
  "tyn_section":[

  ]
}