{
  "title":"How to Make Afghan Firnee (Phirnee)",
  "url":"https://www.wikihow.com/Make-Afghan-Firnee-(Phirnee)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine"
  ],
  "parts":[
    {
      "name":"Making the firnee",
      "steps":[
        {
          "headline":"Combine the cornstarch and half cup of milk in a saucepan.",
          "description":""
        },
        {
          "headline":"Stir constantly until cornstarch and milk are like syrup.",
          "description":""
        },
        {
          "headline":"Pour the remaining milk in the saucepan and heat over medium heat.",
          "description":""
        },
        {
          "headline":"Add white sugar in the saucepan and stir generously or else it will have clumps.",
          "description":""
        },
        {
          "headline":"Boil the paste, mix continuously for 3 to 5 minutes until the mixture is like thick custard.",
          "description":""
        },
        {
          "headline":"Sprinkle chopped and washed-out almonds into the saucepan and mix well for 2 minutes.",
          "description":""
        },
        {
          "headline":"Spread the firnee with ground cardamom and saffron and stir a last time until the mixture is consistent.",
          "description":""
        },
        {
          "headline":"Check if the firnee is ready, to do so, take a spoonful of custard and see if the silky afghan pudding is sitting firmly on a plate.",
          "description":""
        },
        {
          "headline":"If ready, remove from oven and put in the refrigerator for about two hours for cooling.",
          "description":""
        }
      ]
    },
    {
      "name":"Serving the firnee",
      "steps":[
        {
          "headline":"Transfer the firnee in 5 to 7 glass bowls equally.",
          "description":""
        },
        {
          "headline":"Sprinkle some pistachio nuts over every glass bowl.",
          "description":""
        },
        {
          "headline":"To decorate the firnee, use a slice of kiwi or banana and serve in quarters.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the firnee Combine the cornstarch and half cup of milk in a saucepan.  Stir constantly until cornstarch and milk are like syrup.  Pour the remaining milk in the saucepan and heat over medium heat.  Add white sugar in the saucepan and stir generously or else it will have clumps.  Boil the paste, mix continuously for 3 to 5 minutes until the mixture is like thick custard.  Sprinkle chopped and washed-out almonds into the saucepan and mix well for 2 minutes.  Spread the firnee with ground cardamom and saffron and stir a last time until the mixture is consistent.  Check if the firnee is ready, to do so, take a spoonful of custard and see if the silky afghan pudding is sitting firmly on a plate.  If ready, remove from oven and put in the refrigerator for about two hours for cooling.  Serving the firnee Transfer the firnee in 5 to 7 glass bowls equally.  Sprinkle some pistachio nuts over every glass bowl.  To decorate the firnee, use a slice of kiwi or banana and serve in quarters.  Finished. ",
  "tyn_model":[
    "saucepan",
    "milk",
    "cornstarch",
    "white sugar",
    "almonds",
    "ground cardamom",
    "saffron",
    "custard",
    "afghan pudding",
    "plate",
    "oven",
    "refrigerator",
    "pistachio nuts",
    "banana"
  ],
  "tyn_section":[

  ]
}