{
  "title":"How to Dunk in 2K13",
  "url":"https://www.wikihow.com/Dunk-in-2K13",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "methods":[
    {
      "name":"Dunking on the Xbox 360",
      "steps":[
        {
          "headline":"Run your player up to the basket.",
          "description":""
        },
        {
          "headline":"Press the right trigger on your Xbox 360 controller, followed by the X button.",
          "description":"Your player will instantly dunk the ball into the basket. Alternately, press the right trigger, followed by the left trigger, and press down on the right control stick as your player nears the basket."
        }
      ]
    },
    {
      "name":"Dunking on the Playstation 3",
      "steps":[
        {
          "headline":"Run your player up to the basket.",
          "description":""
        },
        {
          "headline":"Press the R2 button on your Playstation 3 controller, followed by the square button.",
          "description":"Your player will instantly dunk the ball into the basket. Alternately, press L2, then press R2, and press down on the right control stick as your player nears the basket."
        }
      ]
    }
  ],
  "text":" Dunking on the Xbox 360 Run your player up to the basket.  Press the right trigger on your Xbox 360 controller, followed by the X button. Your player will instantly dunk the ball into the basket. Alternately, press the right trigger, followed by the left trigger, and press down on the right control stick as your player nears the basket. Dunking on the Playstation 3 Run your player up to the basket.  Press the R2 button on your Playstation 3 controller, followed by the square button. Your player will instantly dunk the ball into the basket. Alternately, press L2, then press R2, and press down on the right control stick as your player nears the basket.",
  "tyn_model":[
    "xbox 360",
    "playstation 3 run",
    "playstation 3 controller"
  ],
  "tyn_section":[

  ]
}