{
  "title":"How to Take Different Types of Selfies",
  "url":"https://www.wikihow.com/Take-Different-Types-of-Selfies",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Genres",
    "People and Portrait Photography",
    "Self Portrait Photographs"
  ],
  "methods":[
    {
      "name":"Choosing Your Selfie Type",
      "steps":[
        {
          "headline":"Take a two-handed selfie to create a frame.",
          "description":"If you're using both hands to take a selfie, your arms will show up in the shot. That's okay! Your arms will create a frame in the photo, balancing it out and making it look more professional. Just make sure you don't cover the lens with either of your hands -- hold your phone as close to edge as possible."
        },
        {
          "headline":"Choose a bathroom selfie if you're looking for good light.",
          "description":"Did you ever notice that your hair and makeup look better in a bathroom than out? That's because the light is great! Take a selfie in the bathroom to really up your light game. Stand as close to the light as possible and experiment with different angles."
        },
        {
          "headline":"Focus on your feet.",
          "description":"A lot of people think that selfies are all about your face. But consider focusing on your feet. Feet selfies can help you show off new shoes or get a new perspective on things. For example, kick your feet up on the seat in front of you (as long as no one's sitting there!) at a ball game, and use the field as a background."
        },
        {
          "headline":"Consider a gym selfie to show off your hard work.",
          "description":"If you've been hitting the gym, working hard on getting healthy, there's no reason not to show off what you've been doing! Gyms have tons of mirrors, so use it to take your selfie. Make sure you're wearing good workout clothes - not just baggy sweats and a t-shirt with a bunch of holes in it. Stand under good lighting, especially since this will show off new muscles you've developed because they create shadow. Decide if you want to take your selfie before your workout -- when you look fresh -- or after when it's clear how much you've been sweating."
        },
        {
          "headline":"Try a water selfie.",
          "description":"You'll obviously need to be careful when you take a water selfie, because you don't want to drop your phone in the water. Float on your back in the water, with your camera pointed directly down. You can keep your eyes open or close them, but keep your face natural. Pose in whatever way feels natural while you're in the water."
        }
      ]
    },
    {
      "name":"Setting Up Your Selfie",
      "steps":[
        {
          "headline":"Turn toward natural light.",
          "description":"Lighting is one of the most important components of a good selfie. If you’re taking the selfie outside, the sun shouldn't be behind you. Aim for having the sun in front of you, to the left or right. If it's straight in front of you, you'll be squinting in your photo. If you’re inside, face a window. You can also hold a plain, white piece of paper under your face while you take the selfie. The natural light will bounce off the white paper and illuminate your face, which can help reduce the look of a double chin. Aim for taking your selfie at sunrise or sunset. The light isn’t direct and is much warmer and much softer. It also reduces the likelihood you’ll end up with shadows on your face."
        },
        {
          "headline":"Use the flash when it’s dark.",
          "description":"If you’re really feeling the need for a selfie and it’s dark, use the flash on your phone. If you have an iPhone, you might not have a front-facing flash (the newest iPhones do have that capability), so try an app like Snapchat that has one. Then save the pic to the camera roll and edit it on your phone."
        },
        {
          "headline":"Smile naturally.",
          "description":"Smile the way you would when you see a friend. If the smile in your selfie looks forced, it could ruin your whole selfie. The trick is to smile and snap the selfie almost right away. This prevents your selfie from looking false."
        },
        {
          "headline":"Keep your chin down.",
          "description":"Hold your camera slightly above your face, but angle it down. Keep your chin down, too, and it will make the angles in your face look stellar."
        },
        {
          "headline":"Tilt your head at an angle.",
          "description":"Instead of looking straight on at the camera, tilt your head slightly down to one side. This accentuates those important angles. Don’t tilt your head all the way over, though. Keep your head at a 45 degree angle to your shoulder."
        },
        {
          "headline":"Keep your eyes closed until the moment you take the selfie.",
          "description":"This will make your eyes look open and relaxed. It can also help relax your face."
        },
        {
          "headline":"Inhale slightly as you hit the shutter.",
          "description":"Inhaling just as you take your photo will part your lips and relax your body. This helps your selfie look more natural."
        }
      ]
    },
    {
      "name":"Taking a Group Selfie",
      "steps":[
        {
          "headline":"Use the timer on your phone.",
          "description":"You don’t want to take a selfie with a huge group of friends only to find out one person wasn’t ready. Instead, set the timer on your phone and let your friends know how much time they have to get in position."
        },
        {
          "headline":"Angle the camera way up.",
          "description":"To get more than one or two people in a shot, you’ll need to get your phone as far away from your face as possible. Hold your phone with your arm extended all the way out, holding it above you and your group of friends. If you have a selfie stick, use it the same way."
        },
        {
          "headline":"Make sure everyone is facing the light.",
          "description":"If you’re in a big group, it’s going to be hard for everyone to find their light. If you’re outside, make sure everyone is facing the sun (although not directly). If you’re indoors, get as close to natural light as possible, or light the area with soft, warm light."
        },
        {
          "headline":"Stand in front of a white wall if possible.",
          "description":"Any light colored wall will brighten the look of everyone’s skin. This will make everyone look great, and reduce the chance of someone nixes the photo because of the way they look in it. A white wall also gives you a guide when you’re editing the photo in any way. As long as the wall still looks white, you don’t have to worry about anyone’s skin looking too red or too blue."
        },
        {
          "headline":"Direct the selfie and take a few options.",
          "description":"Make sure you count down for your friends so they know when the photo is being taken. Tell them you’ll take a few different pictures, and shout out the poses you should go for: silly, serious, sexy, whatever you like!"
        }
      ]
    }
  ],
  "text":" Choosing Your Selfie Type Take a two-handed selfie to create a frame. If you're using both hands to take a selfie, your arms will show up in the shot. That's okay! Your arms will create a frame in the photo, balancing it out and making it look more professional. Just make sure you don't cover the lens with either of your hands -- hold your phone as close to edge as possible. Choose a bathroom selfie if you're looking for good light. Did you ever notice that your hair and makeup look better in a bathroom than out? That's because the light is great! Take a selfie in the bathroom to really up your light game. Stand as close to the light as possible and experiment with different angles. Focus on your feet. A lot of people think that selfies are all about your face. But consider focusing on your feet. Feet selfies can help you show off new shoes or get a new perspective on things. For example, kick your feet up on the seat in front of you (as long as no one's sitting there!) at a ball game, and use the field as a background. Consider a gym selfie to show off your hard work. If you've been hitting the gym, working hard on getting healthy, there's no reason not to show off what you've been doing! Gyms have tons of mirrors, so use it to take your selfie. Make sure you're wearing good workout clothes - not just baggy sweats and a t-shirt with a bunch of holes in it. Stand under good lighting, especially since this will show off new muscles you've developed because they create shadow. Decide if you want to take your selfie before your workout -- when you look fresh -- or after when it's clear how much you've been sweating. Try a water selfie. You'll obviously need to be careful when you take a water selfie, because you don't want to drop your phone in the water. Float on your back in the water, with your camera pointed directly down. You can keep your eyes open or close them, but keep your face natural. Pose in whatever way feels natural while you're in the water. Setting Up Your Selfie Turn toward natural light. Lighting is one of the most important components of a good selfie. If you’re taking the selfie outside, the sun shouldn't be behind you. Aim for having the sun in front of you, to the left or right. If it's straight in front of you, you'll be squinting in your photo. If you’re inside, face a window. You can also hold a plain, white piece of paper under your face while you take the selfie. The natural light will bounce off the white paper and illuminate your face, which can help reduce the look of a double chin. Aim for taking your selfie at sunrise or sunset. The light isn’t direct and is much warmer and much softer. It also reduces the likelihood you’ll end up with shadows on your face. Use the flash when it’s dark. If you’re really feeling the need for a selfie and it’s dark, use the flash on your phone. If you have an iPhone, you might not have a front-facing flash (the newest iPhones do have that capability), so try an app like Snapchat that has one. Then save the pic to the camera roll and edit it on your phone. Smile naturally. Smile the way you would when you see a friend. If the smile in your selfie looks forced, it could ruin your whole selfie. The trick is to smile and snap the selfie almost right away. This prevents your selfie from looking false. Keep your chin down. Hold your camera slightly above your face, but angle it down. Keep your chin down, too, and it will make the angles in your face look stellar. Tilt your head at an angle. Instead of looking straight on at the camera, tilt your head slightly down to one side. This accentuates those important angles. Don’t tilt your head all the way over, though. Keep your head at a 45 degree angle to your shoulder. Keep your eyes closed until the moment you take the selfie. This will make your eyes look open and relaxed. It can also help relax your face. Inhale slightly as you hit the shutter. Inhaling just as you take your photo will part your lips and relax your body. This helps your selfie look more natural. Taking a Group Selfie Use the timer on your phone. You don’t want to take a selfie with a huge group of friends only to find out one person wasn’t ready. Instead, set the timer on your phone and let your friends know how much time they have to get in position. Angle the camera way up. To get more than one or two people in a shot, you’ll need to get your phone as far away from your face as possible. Hold your phone with your arm extended all the way out, holding it above you and your group of friends. If you have a selfie stick, use it the same way. Make sure everyone is facing the light. If you’re in a big group, it’s going to be hard for everyone to find their light. If you’re outside, make sure everyone is facing the sun (although not directly). If you’re indoors, get as close to natural light as possible, or light the area with soft, warm light. Stand in front of a white wall if possible. Any light colored wall will brighten the look of everyone’s skin. This will make everyone look great, and reduce the chance of someone nixes the photo because of the way they look in it. A white wall also gives you a guide when you’re editing the photo in any way. As long as the wall still looks white, you don’t have to worry about anyone’s skin looking too red or too blue. Direct the selfie and take a few options. Make sure you count down for your friends so they know when the photo is being taken. Tell them you’ll take a few different pictures, and shout out the poses you should go for: silly, serious, sexy, whatever you like!",
  "tyn_model":[
    "phone",
    "water",
    "camera",
    "mirrors",
    "sun",
    "paper",
    "natural light",
    "white paper",
    "flash",
    "iphone",
    "snapchat",
    "timer",
    "selfie stick"
  ],
  "tyn_section":[

  ]
}