{
  "title":"How to Use Kitchen Scissors",
  "url":"https://www.wikihow.com/Use-Kitchen-Scissors",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Cutting Tools"
  ],
  "methods":[
    {
      "name":"Trimming Food with Kitchen Scissors",
      "steps":[
        {
          "headline":"Break down meat by cutting it apart.",
          "description":"Scissors cut into slippery meats, including fish, and small spaces with less difficulty than knives. Stick the scissor tips into the belly of the fish near the tail. Cut along the belly to the head. Use the scissors to snip off the head along with the fins. You can then cleanly cut out the meat you want without dirtying a cutting board. For poultry, cut out the backbone or rib cage to open up the bird. Cut off the wings and thighs where they connect to the body. These joints are small, so it’s easier to clip them with scissors instead of a knife. It’s also easier to trim bacon into pieces with scissors."
        },
        {
          "headline":"Shred fresh herbs and spices.",
          "description":"With kitchen scissors, there’s little risk of slipping and cutting yourself. Leafy herbs such as basil and oregano are easily harvested by snipping the leaves off at the stems. To break down the leaves, place them in a bowl and cut away until they’re as small as you want them. You’ll get clean cuts without bruising the leaves. Solid herbs and spices like garlic and ginger are also very easy to cut into pieces with scissors."
        },
        {
          "headline":"Clip roots and stems off fruits and vegetables.",
          "description":"Leafy tops, such as on carrots and strawberries, can be clipped off without much of a struggle. Scissors also help in removing roots or woody stems on scallions and mushrooms. For broccoli, cut the florets off at the stem. The sharper blade can also be used to scrape off dark spots and other blemishes."
        },
        {
          "headline":"Trim dough after rolling it out.",
          "description":"Scissors are a handy tool in baking. After laying phyllo or puff pastry flat, trim it to size. The scissors make clean, even cuts. For pie dough, lay the dough in the pie tin and snip around the edges to remove the excess. Scissors are also a great way to form a lattice by cutting dough into a strip and laying it over the pie. Scissors also aid in precision cutting for pasta dough, such as when forming ravioli."
        },
        {
          "headline":"Cut food inside a can to avoid making a mess.",
          "description":"This is particularly useful for canned tomatoes, which are very messy when taken out of the can. Leave them in there and snip at them with the scissors until they’re broken down into smaller pieces. Then you can pour them into a pan without losing any of the juice. This also works with other canned food, such as pineapple rings and peppers."
        },
        {
          "headline":"Trim bread into smaller pieces.",
          "description":"Scissors are perfect for making any food bite-sized, but they work especially well for bread. Trim around the crust to remove it cleanly, leaving the rest of the bread whole. Leftover bread can be clipped evenly into cubes for stuffing, bread pudding, croutons, or other recipes. Scissors also allow you to cut pitas into evenly-sized wedges. Scissors can even cut pizzas and quesadillas after they’ve been cooked."
        },
        {
          "headline":"Use scissors to cut dried fruits and vegetables.",
          "description":"These dried products are small and slippery, making them difficult to cut with a knife. Place them between the scissor blades and cut them in half. It’s a no-hassle way to break down foods such as raisins or sun-dried tomatoes."
        },
        {
          "headline":"Cut open shellfish for quick cleaning.",
          "description":"Scissors and shears have grips between the handles, which are strong enough to crack open crab claws and lobster shells. The scissor blades are useful for cutting neatly through thinner shells, such as the ones on shrimp. With knives, this is difficult and you’d also need a shell cracker. For shrimp, push the scissor blades under the shell. Cut along the vein, then peel off the shell by hand. The vein will also pop right out."
        }
      ]
    },
    {
      "name":"Using Scissors on Non-Food Items",
      "steps":[
        {
          "headline":"Snip open sealed packages.",
          "description":"Although kitchen scissors are meant for food, they open packaging just as well as normal scissors. This is very helpful in the kitchen when your hands are slippery or a package doesn’t tear properly. You can also cut off ties without stopping to undo them. Kitchen scissors are handy for vacuum-sealed packaging that can’t be torn apart by hand."
        },
        {
          "headline":"Twist off plastic bottle lids with scissor grips.",
          "description":"Kitchen shears have plier-like teeth between the handle grips. Place a plastic cap, such as the one on your bottle of hot sauce, between the handles. Set the bottle on the table so you don’t drop it. Hold the scissors level with the table, then twist until the seal breaks. To remove large lids, angle the scissors upwards and away from your body. Then grip the lid between the handles and twist."
        },
        {
          "headline":"Pop off metal bottle caps with the scissor handles.",
          "description":"You don’t need to fish around for a bottle opener. Place the bottle cap between the handles and squeeze them closed. The scissors should point upwards and away from your body. Lift them until the cap pops off."
        },
        {
          "headline":"Cut twine for wrapping food.",
          "description":"Scissors make snipping off a piece of string or twine easy. Tie the twine around a bag or container to secure its contents. Twine is also used for trussing chickens and turkeys, which makes them cook evenly."
        }
      ]
    },
    {
      "name":"Washing Kitchen Scissors",
      "steps":[
        {
          "headline":"Wash the scissors after using them on food.",
          "description":"Treat them like any other kitchen utensil. Every time you use the scissors, bacteria gets on the blades, which is transferred to the next food you cut. At the very least, they need to be washed after working with raw meat. To stay safe, wash the scissors off every time you use them. After cutting meat, make sure you wash the scissors before using them on any other food."
        },
        {
          "headline":"Separate the scissor blades.",
          "description":"Look where the blades meet each other. If they are fastened together with a screw, don’t try to separate the blades. Other shears can be pulled apart. They may slide off each other or have an unlocking knob in the handle. Consult the owner’s manual for exact details on how to separate the blades. If you can’t separate the blades, you can still wash them. Separating them only makes cleaning easier."
        },
        {
          "headline":"Wash the blades with soap and water.",
          "description":"The scissors need to be washed like any other kitchen utensil. Use your normal dish detergent along with hot water. Make sure the soap reaches the spots where the blades cross or meet the handles. A lot of bacteria can grow there, especially if your scissors don’t come apart. Some kitchen scissors are designed to be washed in the dishwasher. Check the packaging or instructions to make sure this is okay."
        },
        {
          "headline":"Dry the scissors by hand.",
          "description":"Get a clean cloth and wipe down the blades. Remove all the water, including in those hard-to-reach areas like near the handles. Water rusts metal, and it’s a shame to see a costly, quality pair of scissors turn brown and fragile. Even if you wash the scissors in the dishwasher, it’s a good idea to dry them by hand to avoid rusting."
        },
        {
          "headline":"Dry the blades in open air.",
          "description":"Lay them on a drying rack, if you have one. You can also lay a paper towel or piece of newspaper on your counter. Spread the scissor blades out on the surface you chose. Leave the scissors there for a few minutes so any remaining moisture dries."
        },
        {
          "headline":"Store the blades away from metal.",
          "description":"Contact with other metal dulls the blades, so don’t throw them in your utensil drawer. A knife block is a perfect place to store the scissors. If they don’t fit in the block, keep them in a separate drawer away from the other utensils."
        }
      ]
    }
  ],
  "text":" Trimming Food with Kitchen Scissors Break down meat by cutting it apart. Scissors cut into slippery meats, including fish, and small spaces with less difficulty than knives. Stick the scissor tips into the belly of the fish near the tail. Cut along the belly to the head. Use the scissors to snip off the head along with the fins. You can then cleanly cut out the meat you want without dirtying a cutting board. For poultry, cut out the backbone or rib cage to open up the bird. Cut off the wings and thighs where they connect to the body. These joints are small, so it’s easier to clip them with scissors instead of a knife. It’s also easier to trim bacon into pieces with scissors. Shred fresh herbs and spices. With kitchen scissors, there’s little risk of slipping and cutting yourself. Leafy herbs such as basil and oregano are easily harvested by snipping the leaves off at the stems. To break down the leaves, place them in a bowl and cut away until they’re as small as you want them. You’ll get clean cuts without bruising the leaves. Solid herbs and spices like garlic and ginger are also very easy to cut into pieces with scissors. Clip roots and stems off fruits and vegetables. Leafy tops, such as on carrots and strawberries, can be clipped off without much of a struggle. Scissors also help in removing roots or woody stems on scallions and mushrooms. For broccoli, cut the florets off at the stem. The sharper blade can also be used to scrape off dark spots and other blemishes. Trim dough after rolling it out. Scissors are a handy tool in baking. After laying phyllo or puff pastry flat, trim it to size. The scissors make clean, even cuts. For pie dough, lay the dough in the pie tin and snip around the edges to remove the excess. Scissors are also a great way to form a lattice by cutting dough into a strip and laying it over the pie. Scissors also aid in precision cutting for pasta dough, such as when forming ravioli. Cut food inside a can to avoid making a mess. This is particularly useful for canned tomatoes, which are very messy when taken out of the can. Leave them in there and snip at them with the scissors until they’re broken down into smaller pieces. Then you can pour them into a pan without losing any of the juice. This also works with other canned food, such as pineapple rings and peppers. Trim bread into smaller pieces. Scissors are perfect for making any food bite-sized, but they work especially well for bread. Trim around the crust to remove it cleanly, leaving the rest of the bread whole. Leftover bread can be clipped evenly into cubes for stuffing, bread pudding, croutons, or other recipes. Scissors also allow you to cut pitas into evenly-sized wedges. Scissors can even cut pizzas and quesadillas after they’ve been cooked. Use scissors to cut dried fruits and vegetables. These dried products are small and slippery, making them difficult to cut with a knife. Place them between the scissor blades and cut them in half. It’s a no-hassle way to break down foods such as raisins or sun-dried tomatoes. Cut open shellfish for quick cleaning. Scissors and shears have grips between the handles, which are strong enough to crack open crab claws and lobster shells. The scissor blades are useful for cutting neatly through thinner shells, such as the ones on shrimp. With knives, this is difficult and you’d also need a shell cracker. For shrimp, push the scissor blades under the shell. Cut along the vein, then peel off the shell by hand. The vein will also pop right out. Using Scissors on Non-Food Items Snip open sealed packages. Although kitchen scissors are meant for food, they open packaging just as well as normal scissors. This is very helpful in the kitchen when your hands are slippery or a package doesn’t tear properly. You can also cut off ties without stopping to undo them. Kitchen scissors are handy for vacuum-sealed packaging that can’t be torn apart by hand. Twist off plastic bottle lids with scissor grips. Kitchen shears have plier-like teeth between the handle grips. Place a plastic cap, such as the one on your bottle of hot sauce, between the handles. Set the bottle on the table so you don’t drop it. Hold the scissors level with the table, then twist until the seal breaks. To remove large lids, angle the scissors upwards and away from your body. Then grip the lid between the handles and twist. Pop off metal bottle caps with the scissor handles. You don’t need to fish around for a bottle opener. Place the bottle cap between the handles and squeeze them closed. The scissors should point upwards and away from your body. Lift them until the cap pops off. Cut twine for wrapping food. Scissors make snipping off a piece of string or twine easy. Tie the twine around a bag or container to secure its contents. Twine is also used for trussing chickens and turkeys, which makes them cook evenly. Washing Kitchen Scissors Wash the scissors after using them on food. Treat them like any other kitchen utensil. Every time you use the scissors, bacteria gets on the blades, which is transferred to the next food you cut. At the very least, they need to be washed after working with raw meat. To stay safe, wash the scissors off every time you use them. After cutting meat, make sure you wash the scissors before using them on any other food. Separate the scissor blades. Look where the blades meet each other. If they are fastened together with a screw, don’t try to separate the blades. Other shears can be pulled apart. They may slide off each other or have an unlocking knob in the handle. Consult the owner’s manual for exact details on how to separate the blades. If you can’t separate the blades, you can still wash them. Separating them only makes cleaning easier. Wash the blades with soap and water. The scissors need to be washed like any other kitchen utensil. Use your normal dish detergent along with hot water. Make sure the soap reaches the spots where the blades cross or meet the handles. A lot of bacteria can grow there, especially if your scissors don’t come apart. Some kitchen scissors are designed to be washed in the dishwasher. Check the packaging or instructions to make sure this is okay. Dry the scissors by hand. Get a clean cloth and wipe down the blades. Remove all the water, including in those hard-to-reach areas like near the handles. Water rusts metal, and it’s a shame to see a costly, quality pair of scissors turn brown and fragile. Even if you wash the scissors in the dishwasher, it’s a good idea to dry them by hand to avoid rusting. Dry the blades in open air. Lay them on a drying rack, if you have one. You can also lay a paper towel or piece of newspaper on your counter. Spread the scissor blades out on the surface you chose. Leave the scissors there for a few minutes so any remaining moisture dries. Store the blades away from metal. Contact with other metal dulls the blades, so don’t throw them in your utensil drawer. A knife block is a perfect place to store the scissors. If they don’t fit in the block, keep them in a separate drawer away from the other utensils.",
  "tyn_model":[
    "scissors",
    "scissor",
    "kitchen scissors",
    "twine",
    "knife",
    "water",
    "fish",
    "knives",
    "herbs",
    "bread",
    "shrimp",
    "soap",
    "cutting board",
    "poultry",
    "bacon",
    "spices",
    "basil",
    "oregano",
    "bowl",
    "garlic",
    "ginger",
    "vegetables",
    "carrots",
    "strawberries",
    "scallions",
    "mushrooms",
    "broccoli",
    "phyllo or",
    "puff pastry",
    "pie tin",
    "tomatoes",
    "pan",
    "pineapple rings",
    "peppers",
    "bread pudding",
    "sun-dried tomatoes",
    "shellfish",
    "shears",
    "shell cracker",
    "scissor grips",
    "kitchen shears",
    "hot sauce",
    "bottle caps",
    "bottle opener",
    "bottle cap",
    "string",
    "kitchen utensil",
    "dish detergent",
    "hot water"
  ],
  "tyn_section":[

  ]
}