{
  "title":"How to Make a Ladder Golf Game",
  "url":"https://www.wikihow.com/Make-a-Ladder-Golf-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Tossing Games"
  ],
  "methods":[
    {
      "name":"Making the Ladder",
      "steps":[
        {
          "headline":"Purchase 1-inch (2.5 cm) PVC pipe, fittings, golf balls and nylon rope.",
          "description":"How much PVC pipe you'll need depends on how big you want your ladder to be - see the sample measurements below. You can find 1-inch PVC pipe at a hardware store, as well as nylon rope. Buy 2 elbow fittings, 6 T fittings, and 4 stoppers. Make sure the golf balls you choose are solid all the way through, and buy them at a sporting goods store or big-box store. Buy PVC cement (optional). You can fit your PVC pipe together without glue, but your ladder will be a lot less stable."
        },
        {
          "headline":"Cut all of your PVC pieces to size.",
          "description":"Use a hacksaw, a miter saw or a plastic pipe cutter. You can size your ladder however you want, but here's a sample to work from. For this ladder, you'll need 19 feet (5.8 m) of 1-inch PVC pipe. Cut 6 18-inch (0.45 m) pieces. Cut 4 12-inch (30.5 cm) pieces. Cut 3 24-inch (0.61 m) pieces."
        },
        {
          "headline":"Fit the pipes together.",
          "description":"Build the ladder from the base upward. You can use PVC cement as you do this, or you can just rely on the fittings. Or just use cement for the ladder and the base, but leave the ladder to base connection \"dry\" so that the game can be collapsed for storage. Put 3 18-inch (.045 m) pipes into each opening of a T fitting. Repeat with another T fitting and 3 more 18-inch pipes. Hold them so that the \"bottom\" leg of the T is pointing straight up, and put the stoppers on the ends of the pipe parallel to the ground. These will make up your base. Put T fittings on top of each 18-inch (0.45 m) pipe that's pointing up. Do it such that the \"leg\" of each T is horizontal and pointing toward the other T fitting. Add a rung. Put one of the 24-inch (0.61 m) pipes between the T fittings you just added. Put a 12-inch (30.5 cm) pipe into each of the remaining T openings. These should be vertical. Add another rung. Put another T fitting on top of the 12-inch (30.5 cm) pipes, again so that the legs are vertical and pointing inward. Place another 24-inch (0.61 m) pipe into the T fittings for your second rung. Put another 12-inch (30.5 cm) pipe into each of the remaining T openings. Top the 12-inch (30.5 cm) pipes with the elbow fittings. Add your last rung. In the remaining spots in the elbow fittings, add your last 24-inch (0.61 m) pipe. If you used PVC cement,  make the ladder first and allow the glue to dry while you make the bolos."
        }
      ]
    },
    {
      "name":"Making the Bolas",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"For a standard game of ladder golf, buy 24 solid golf balls (ideally, 12 of one color and 12 of another) and about 28 feet (8.5 m) of thin nylon rope. You'll also need a drill with a 3/8- or 1/2-inch bit (1 to 1.3 cm)"
        },
        {
          "headline":"Drill holes in the golf balls.",
          "description":"Place the golf balls in a vise grip, or create one of your own by jamming it between two heavy objects (such as a dresser and a wall). Drill all the way through each golf ball with the 3/8- or 1/2-inch (1 to 1.3 cm) bit in a straight line."
        },
        {
          "headline":"String the golf balls onto the nylon cord.",
          "description":"Once each golf ball has been drilled, string it onto the 28-foot nylon cord. Order them in colored pairs, i.e., 2 pink, 2 orange, 2 orange, 2 pink, etc."
        },
        {
          "headline":"Tie knots.",
          "description":"Tie an overhand knot at one end of the cord, and move a golf ball down to it. Tie another knot on the other side of the golf ball. Measure about 12 inches (30.5 cm) away from that knot, and tie another one. String a second golf ball of the same color down to that knot. Tie a fourth knot on the other side of the second golf ball."
        },
        {
          "headline":"Cut the bola.",
          "description":"Cut the nylon rope after the fourth knot. You should have your first bola, with a golf ball on each end and about a foot of nylon rope in between."
        },
        {
          "headline":"Continue knotting the rope around the golf balls and cutting bolas.",
          "description":"Tie a knot on each side of a golf ball, and leave about a foot of rope between them. Cut off bolas when they're finished."
        },
        {
          "headline":"Burn the ends of the bolas.",
          "description":"Use a match or a lighter to slightly melt the knots at the ends of each bola. This will help keep the knots secure."
        }
      ]
    },
    {
      "name":"Playing the Game",
      "steps":[
        {
          "headline":"Pick a color.",
          "description":"For 2 teams or players, each should get 6 bolas to throw (if you bought 24 golf balls) and each should use a different-colored bola."
        },
        {
          "headline":"Stand at the toss line.",
          "description":"This can be as far away as you'd like. For official ladder golf, it's 15 feet (4.6 m)."
        },
        {
          "headline":"Throw bolas in groups of three.",
          "description":"That is, Team 1 will throw 3 bolas, then Team 2 will throw 3 bolas."
        },
        {
          "headline":"Try to get the bolas to stay on a rung.",
          "description":"The usual ladder golf scoring is as follows, though you can adjust it however you want:\nTop rung = 3 points\nMiddle rung = 2 points\nBottom rung = 1 points"
        },
        {
          "headline":"Knock down other bolas.",
          "description":"If you can unseat the other team's bola from a rung, then their points are deducted for that throw."
        },
        {
          "headline":"Play up to 21.",
          "description":"The first team to score 21 points without going over wins."
        },
        {
          "headline":"Play with a scoring variation (optional).",
          "description":"To make the game move more quickly for younger players, bump up the point value of each rung by 1 point. You could also move the throw line closer to the ladder."
        }
      ]
    }
  ],
  "text":" Making the Ladder Purchase 1-inch (2.5 cm) PVC pipe, fittings, golf balls and nylon rope. How much PVC pipe you'll need depends on how big you want your ladder to be - see the sample measurements below. You can find 1-inch PVC pipe at a hardware store, as well as nylon rope. Buy 2 elbow fittings, 6 T fittings, and 4 stoppers. Make sure the golf balls you choose are solid all the way through, and buy them at a sporting goods store or big-box store. Buy PVC cement (optional). You can fit your PVC pipe together without glue, but your ladder will be a lot less stable. Cut all of your PVC pieces to size. Use a hacksaw, a miter saw or a plastic pipe cutter. You can size your ladder however you want, but here's a sample to work from. For this ladder, you'll need 19 feet (5.8 m) of 1-inch PVC pipe. Cut 6 18-inch (0.45 m) pieces. Cut 4 12-inch (30.5 cm) pieces. Cut 3 24-inch (0.61 m) pieces. Fit the pipes together. Build the ladder from the base upward. You can use PVC cement as you do this, or you can just rely on the fittings. Or just use cement for the ladder and the base, but leave the ladder to base connection \"dry\" so that the game can be collapsed for storage. Put 3 18-inch (.045 m) pipes into each opening of a T fitting. Repeat with another T fitting and 3 more 18-inch pipes. Hold them so that the \"bottom\" leg of the T is pointing straight up, and put the stoppers on the ends of the pipe parallel to the ground. These will make up your base. Put T fittings on top of each 18-inch (0.45 m) pipe that's pointing up. Do it such that the \"leg\" of each T is horizontal and pointing toward the other T fitting. Add a rung. Put one of the 24-inch (0.61 m) pipes between the T fittings you just added. Put a 12-inch (30.5 cm) pipe into each of the remaining T openings. These should be vertical. Add another rung. Put another T fitting on top of the 12-inch (30.5 cm) pipes, again so that the legs are vertical and pointing inward. Place another 24-inch (0.61 m) pipe into the T fittings for your second rung. Put another 12-inch (30.5 cm) pipe into each of the remaining T openings. Top the 12-inch (30.5 cm) pipes with the elbow fittings. Add your last rung. In the remaining spots in the elbow fittings, add your last 24-inch (0.61 m) pipe. If you used PVC cement,  make the ladder first and allow the glue to dry while you make the bolos. Making the Bolas Gather your materials. For a standard game of ladder golf, buy 24 solid golf balls (ideally, 12 of one color and 12 of another) and about 28 feet (8.5 m) of thin nylon rope. You'll also need a drill with a 3/8- or 1/2-inch bit (1 to 1.3 cm) Drill holes in the golf balls. Place the golf balls in a vise grip, or create one of your own by jamming it between two heavy objects (such as a dresser and a wall). Drill all the way through each golf ball with the 3/8- or 1/2-inch (1 to 1.3 cm) bit in a straight line. String the golf balls onto the nylon cord. Once each golf ball has been drilled, string it onto the 28-foot nylon cord. Order them in colored pairs, i.e., 2 pink, 2 orange, 2 orange, 2 pink, etc. Tie knots. Tie an overhand knot at one end of the cord, and move a golf ball down to it. Tie another knot on the other side of the golf ball. Measure about 12 inches (30.5 cm) away from that knot, and tie another one. String a second golf ball of the same color down to that knot. Tie a fourth knot on the other side of the second golf ball. Cut the bola. Cut the nylon rope after the fourth knot. You should have your first bola, with a golf ball on each end and about a foot of nylon rope in between. Continue knotting the rope around the golf balls and cutting bolas. Tie a knot on each side of a golf ball, and leave about a foot of rope between them. Cut off bolas when they're finished. Burn the ends of the bolas. Use a match or a lighter to slightly melt the knots at the ends of each bola. This will help keep the knots secure. Playing the Game Pick a color. For 2 teams or players, each should get 6 bolas to throw (if you bought 24 golf balls) and each should use a different-colored bola. Stand at the toss line. This can be as far away as you'd like. For official ladder golf, it's 15 feet (4.6 m). Throw bolas in groups of three. That is, Team 1 will throw 3 bolas, then Team 2 will throw 3 bolas. Try to get the bolas to stay on a rung. The usual ladder golf scoring is as follows, though you can adjust it however you want:\nTop rung = 3 points\nMiddle rung = 2 points\nBottom rung = 1 points Knock down other bolas. If you can unseat the other team's bola from a rung, then their points are deducted for that throw. Play up to 21. The first team to score 21 points without going over wins. Play with a scoring variation (optional). To make the game move more quickly for younger players, bump up the point value of each rung by 1 point. You could also move the throw line closer to the ladder.",
  "tyn_model":[
    "ladder",
    "golf balls",
    "golf ball",
    "pvc pipe",
    "nylon rope",
    "pvc cement",
    "bola",
    "bolas",
    "nylon cord",
    "rope",
    "hacksaw",
    "miter saw",
    "plastic pipe cutter",
    "pipes",
    "cement",
    "stoppers",
    "t fittings",
    "glue",
    "drill",
    "match",
    "lighter",
    "ladder golf"
  ],
  "tyn_section":[

  ]
}