{
  "title":"How to Make a Gingerbread Cookie Milkshake",
  "url":"https://www.wikihow.com/Make-a-Gingerbread-Cookie-Milkshake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk"
  ],
  "parts":[
    {
      "name":"Making the Cookies",
      "steps":[
        {
          "headline":"Combine your dry ingredients.",
          "description":"In the medium-sized bowl, whisk together the ginger, cinnamon, nutmeg, cloves, allspice, baking soda, salt, and 2 cups flour until these dry ingredients appear evenly mixed together. Once done whisking, set aside for now."
        },
        {
          "headline":"With the hand mixer, beat butter and brown sugar until smooth in the other bowl.",
          "description":"You will know you are done mixing when the butter/sugar mixture is a well-mixed, viscous substance with no clear distinctions. If you are using an electric mixer, use the lowest setting to mix the ingredients."
        },
        {
          "headline":"Mix in egg and molasses.",
          "description":"Crack the egg and empty its content into the bowl from the previous step, discarding the eggshell. Add the molasses into this bowl. Beat the contents of this bowl until smooth like previously, again with the mixer on the lowest setting."
        },
        {
          "headline":"Mix together dry and wet ingredients.",
          "description":"Add the contents of the bowl mentioned in the previous two steps to the dry ingredients in the medium-sized bowl from Step 3. With the mixer again set on low, mix the ingredients together until they are thoroughly mixed and a dough forms."
        },
        {
          "headline":"Wrap and chill the dough.",
          "description":"Set out some plastic wrap about 10 inches (25 cm) in length. Lightly cover the top of the plastic wrap with flour. Then place the dough on the floured plastic wrap. Pat the dough into an approximately 8-inch square. Wrap the dough with more plastic wrap and place the dough in the refrigerator to chill for about 1 to 2 hours."
        },
        {
          "headline":"Roll the dough.",
          "description":"With the dough sufficiently firm, preheat oven to 350°. Separate the dough into two halves. Set out waxed paper long enough to hold one half of the dough. Lightly cover the top of the waxed paper with flour. Lightly cover the rolling area of the rolling pin with flour. Place one half of the dough onto the floured waxed paper. With the rolling pin, roll out the dough until it is an eighth of an inch thick, turning, lifting, and flouring dough as necessary. You may also need to apply more flour to the rolling pin to prevent the dough from sticking to the rolling pin. When that is complete, repeat this step for the other half of the dough."
        },
        {
          "headline":"Cut the dough into shapes if you desire.",
          "description":"This step is optional as you will crush the gingerbread cookies into the milkshake later. Place the dough on waxed paper into the freezer to firm for about 20 minutes. Once the 20 minutes is up, remove the dough from the paper. You can then use cookie cutters to cut out shapes of your desire from the dough."
        },
        {
          "headline":"Bake the cookies.",
          "description":"Transfer the dough to a baking sheet, separating the dough into small portions that will become the cookies, and place the baking sheet on the baking tray. Bake until firm and edges just begin to darken for 10 to 18 minutes. The baking time will depend on the size of cookies and how efficiently your oven heats. Once done, remove the baking tray from the oven and take baking sheet off of the tray. Set the baking sheet with the cookies on it somewhere to cool. Repeat this step until you have baked all of your cookies. Alternatively, you could save your unused cookie dough by wrapping it up and placing it in the refrigerator."
        }
      ]
    },
    {
      "name":"Making the Milkshake",
      "steps":[
        {
          "headline":"Combine ice cream and milk, then blend until smooth.",
          "description":"Once the cookies are cool, you can begin work on the milkshake. Combine the ice cream and milk in your blender. Blend until smooth. Add more milk to achieve your desired thickness."
        },
        {
          "headline":"Add the gingerbread syrup into blend and blend it into the milkshake.",
          "description":""
        },
        {
          "headline":"Crush 5 gingerbread cookies into the milkshake and blend.",
          "description":"You might want to add more ingredients depending on your tastes. If you would like more crunch, then add more crushed cookies to the milkshake. If you want more flavor without additional cookie crunch, add some more ginger, cinnamon, nutmeg, cloves, and allspice. If the flavor is too strong, add milk or water."
        },
        {
          "headline":"Serve the milkshakes.",
          "description":"Once you are satisfied with the taste and consistency of the milkshake, you are ready to serve your milkshakes by pouring the beverage into glasses. Depending on just how long you have been blending, you may desire to place the milkshakes in the refrigerator or freezer to chill to your taste."
        },
        {
          "headline":"Drink up!",
          "description":"You're ready to enjoy your gingerbread cookie milkshake with a friend or simply have a second milkshake waiting for you for later with a nice side of gingerbread cookies. Bon appétite!"
        }
      ]
    }
  ],
  "text":" Making the Cookies Combine your dry ingredients. In the medium-sized bowl, whisk together the ginger, cinnamon, nutmeg, cloves, allspice, baking soda, salt, and 2 cups flour until these dry ingredients appear evenly mixed together. Once done whisking, set aside for now. With the hand mixer, beat butter and brown sugar until smooth in the other bowl. You will know you are done mixing when the butter/sugar mixture is a well-mixed, viscous substance with no clear distinctions. If you are using an electric mixer, use the lowest setting to mix the ingredients. Mix in egg and molasses. Crack the egg and empty its content into the bowl from the previous step, discarding the eggshell. Add the molasses into this bowl. Beat the contents of this bowl until smooth like previously, again with the mixer on the lowest setting. Mix together dry and wet ingredients. Add the contents of the bowl mentioned in the previous two steps to the dry ingredients in the medium-sized bowl from Step 3. With the mixer again set on low, mix the ingredients together until they are thoroughly mixed and a dough forms. Wrap and chill the dough. Set out some plastic wrap about 10 inches (25 cm) in length. Lightly cover the top of the plastic wrap with flour. Then place the dough on the floured plastic wrap. Pat the dough into an approximately 8-inch square. Wrap the dough with more plastic wrap and place the dough in the refrigerator to chill for about 1 to 2 hours. Roll the dough. With the dough sufficiently firm, preheat oven to 350°. Separate the dough into two halves. Set out waxed paper long enough to hold one half of the dough. Lightly cover the top of the waxed paper with flour. Lightly cover the rolling area of the rolling pin with flour. Place one half of the dough onto the floured waxed paper. With the rolling pin, roll out the dough until it is an eighth of an inch thick, turning, lifting, and flouring dough as necessary. You may also need to apply more flour to the rolling pin to prevent the dough from sticking to the rolling pin. When that is complete, repeat this step for the other half of the dough. Cut the dough into shapes if you desire. This step is optional as you will crush the gingerbread cookies into the milkshake later. Place the dough on waxed paper into the freezer to firm for about 20 minutes. Once the 20 minutes is up, remove the dough from the paper. You can then use cookie cutters to cut out shapes of your desire from the dough. Bake the cookies. Transfer the dough to a baking sheet, separating the dough into small portions that will become the cookies, and place the baking sheet on the baking tray. Bake until firm and edges just begin to darken for 10 to 18 minutes. The baking time will depend on the size of cookies and how efficiently your oven heats. Once done, remove the baking tray from the oven and take baking sheet off of the tray. Set the baking sheet with the cookies on it somewhere to cool. Repeat this step until you have baked all of your cookies. Alternatively, you could save your unused cookie dough by wrapping it up and placing it in the refrigerator. Making the Milkshake Combine ice cream and milk, then blend until smooth. Once the cookies are cool, you can begin work on the milkshake. Combine the ice cream and milk in your blender. Blend until smooth. Add more milk to achieve your desired thickness. Add the gingerbread syrup into blend and blend it into the milkshake.  Crush 5 gingerbread cookies into the milkshake and blend. You might want to add more ingredients depending on your tastes. If you would like more crunch, then add more crushed cookies to the milkshake. If you want more flavor without additional cookie crunch, add some more ginger, cinnamon, nutmeg, cloves, and allspice. If the flavor is too strong, add milk or water. Serve the milkshakes. Once you are satisfied with the taste and consistency of the milkshake, you are ready to serve your milkshakes by pouring the beverage into glasses. Depending on just how long you have been blending, you may desire to place the milkshakes in the refrigerator or freezer to chill to your taste. Drink up! You're ready to enjoy your gingerbread cookie milkshake with a friend or simply have a second milkshake waiting for you for later with a nice side of gingerbread cookies. Bon appétite!",
  "tyn_model":[
    "flour",
    "bowl",
    "plastic wrap",
    "rolling pin",
    "baking sheet",
    "milk",
    "refrigerator",
    "oven",
    "waxed paper",
    "gingerbread cookies",
    "ginger",
    "cinnamon",
    "nutmeg",
    "cloves",
    "allspice",
    "butter",
    "molasses",
    "mixer",
    "baking tray",
    "ice cream",
    "baking soda",
    "salt",
    "hand mixer",
    "brown sugar",
    "sugar",
    "electric mixer",
    "medium-sized bowl",
    "floured waxed paper",
    "freezer",
    "cookie cutters",
    "blender",
    "gingerbread syrup",
    "cookies",
    "water",
    "gingerbread cookie"
  ],
  "tyn_section":[

  ]
}