{
  "title":"How to Make Vegetable Salad",
  "url":"https://www.wikihow.com/Make-Vegetable-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads"
  ],
  "methods":[
    {
      "name":"Making a Classic Leafy Green Salad",
      "steps":[
        {
          "headline":"Choose your main greens.",
          "description":"The base of a green salad is crunchy leaves that can stand on their own or stay firm when dressed. Romaine or red leaf lettuce are great choices if you prefer mild flavors, while dinosaur kale offers a hearty, earthy alternative. Wash thoroughly, then chop and add to a large bowl. For an appetizer, plan on serving about 2–3 oz (55–85g) of (total) greens per person. Avoid the more common curly kale, which is tough to eat raw."
        },
        {
          "headline":"Chop the greens.",
          "description":"If you're not sure how to chop the leaves, take a bite to test the texture. Crisp lettuces are easy to eat torn, or cut into bite-sized pieces across the stem. For greens with a fibrous stem such as kale, cut out the stems then slice the leaves into thin pieces. Kale also benefits from \"massaging\" to break down the fibers. Place it in a bowl of acidic dressing and squeeze handfuls of leaves with moderate pressure. Let sit for 5–15 minutes before serving."
        },
        {
          "headline":"Add softer greens.",
          "description":"A variety of textures is key to a good salad. Add a roughly equal amount of arugula, spinach, butter leaf lettuce, or another soft, leafy green to your salad. Handle these gently while washing and chopping, as soft leaves tend to bruise more easily."
        },
        {
          "headline":"Mix in peppery greens (optional).",
          "description":"If you like some zing in your salad, throw in a large handful of radicchio, water cress, dandelion, or frisée. These add strong peppery flavors."
        },
        {
          "headline":"Add extra ingredients (optional).",
          "description":"You can stop here, or use your mixed greens as a base for all sort of ingredients. Here are a few examples:\nA little feta or blue cheese, crumbled on top\nWalnut halves\nCherry tomatoes\nAvocado cubes"
        },
        {
          "headline":"Toss with dressing.",
          "description":"Serve with French salad dressing, Vinaigrette, or just shake together balsamic vinegar and olive oil."
        }
      ]
    },
    {
      "name":"Making a Vegetable Salad Appetizer",
      "steps":[
        {
          "headline":"Serve cold tomato salad for a summer appetizer.",
          "description":"These salads demand high-quality, fresh ingredients, so shop at a local market the same day if possible. Tomatoes combine well with many other vegetables; here are a few popular examples:\nGreek salad: 2–4 tomatoes (in eighths), 1 large cucumber (sliced thickly), 1 small red onion (sliced thinly). Toss with generous amounts of garlic salad dressing, or a Greek vinaigrette with garlic, oregano, and black pepper. Caprese: thick slices of tomato, each topped with a slice of fresh mozzarella and a basil leaf or three. Drizzle on extra-virgin olive oil just before serving. For an extra-refreshing salad, combine equally sized cubes of tomato and watermelon. Top with black pepper, a little salt, and vinaigrette. Let stand a few minutes before serving. Note — If storing tomatoes for more than a day, a cellar or air-conditioned room around 55-70ºF (13–21ºC) preserves flavor better than the fridge or a warm room."
        },
        {
          "headline":"Chop up a coleslaw.",
          "description":"Coleslaw is another summer appetizer, that pairs well with barbecue and other strong flavors. The heart of a coleslaw is a finely chopped cabbage, usually paired with other crunchy vegetables (shredded carrot is especially popular), sweet flavors (apple, golden raisins), and a binding dressing made from vinegar and mayonnaise or sour cream. Here's a recipe to get you started."
        },
        {
          "headline":"Serve a roasted vegetable appetizer.",
          "description":"If the weather's cold and you need a hearty dinner appetizer, roast a tray of vegetables with olive oil, salt, and pepper. Season with lemon juice and herbs and serve hot. Include a few vegetables that don't normally go into a raw salad, such as potatoes, eggplant, or cauliflower. Remember that different vegetables require different cooking times. This example tells you how to combine potatoes, eggplant, bell peppers, red onion, and cherry tomatoes."
        },
        {
          "headline":"Put together an Asian salad.",
          "description":"Asian and Asian-inspired salads bring many new techniques to the table. The vegetables are often marinated for an hour or more to add an acidic tang, while spicy, salty, and sweet add a great deal of complexity. Here a couple examples:\nSlice cucumbers and sweet onions very thinly, preferably with a mandoline. Marinate in a homemade Asian dressing, or this sesame lemon dressing. Fumi salad roasts sesame seeds and almonds to add flavor to cabbage and ramen noodles. You can easily turn this into a main course by adding chicken. Add Asian flavors to any vegetable salad with soy ginger dressing or miso dressing. Go easy on these if you aren't used to them. They tend to be more concentrated than Western dressings."
        }
      ]
    },
    {
      "name":"Making a Vegetable Salad Main Course",
      "steps":[
        {
          "headline":"Choose your approach.",
          "description":"If you feel like inventing your own salad, move on to the next step to begin the step-by-step instructions. If you're looking for something faster, here are a few well-tested ideas that can stand at the center of your meal:\nChef's salad: sliced ham, cheese, hard-boiled egg, cucumber, and tomato on a bed of lettuce. This can stand up to thicker, stronger-flavored dressings such as Caesar salad dressing, ranch, or Thousand Island. Salad Nicoise: a French salad of potatoes, tomatoes, egg, olives, and fish (usually anchovies or tuna), among other ingredients. Southwest salad: Combine cooked corn and black beans with red peppers, spring onions, and plenty of avocado and/or grilled chicken. Season with cilantro and lime."
        },
        {
          "headline":"Start with a base ingredient.",
          "description":"You can start with lettuce or mixed greens, if you're prepared to amp it up with plenty of protein and starchy ingredients. Another approach is to use a bed of grains, especially something with plenty of texture like brown rice or quinoa. A bed of rice noodles works well for Asian salads."
        },
        {
          "headline":"Add colourful veggies.",
          "description":"This isn't just for show; a variety of colours means a variety of vitamins. Strips of red, orange, or yellow bell pepper are a great choice. Also try shredded carrot; shredded beets (raw, pickled or cooked); or sliced tomatoes. You can even add edible flowers."
        },
        {
          "headline":"Mix in veggies with strong flavours.",
          "description":"Add intensity with roasted garlic, pitted olives, or diced hot peppers. Use avocado for a creamy texture. Keep it tasty but more casual with chopped asparagus, any kind of onion, or flavorful mushrooms."
        },
        {
          "headline":"Add extra texture.",
          "description":"These little nibbles make a salad much more interesting. There are all kinds of options:\nAny nuts or seeds – walnuts, sunflower seeds, pumpkin seeds, etc. Breads or grains – croutons, tortilla chips, popcorn, cooked quinoa\nAny type of fresh or dried fruit, especially berries\nSnap peas, corn niblets, or other small veggies"
        },
        {
          "headline":"Add your protein.",
          "description":"A salad requires protein to become an entreé. Choose just one or two of the following, chopped into bite-size pieces. Cooked beans – chickpeas, lentils\nCheese – Parmesan Swiss, or feta for more subtle flavor; cheddar or blue cheese for strong flavor\nOther vegetarian options – soft- or hard-boiled egg, tofu\nMeat – tuna, chicken breast, ham, grilled fish or steak, shrimp, squid"
        },
        {
          "headline":"Toss with dressing.",
          "description":"Salad dressing can be purchased or made at home. Whichever you choose, drizzle over the salad and toss until thoroughly coated. If you made the salad in advance, wait until just before serving to add the dressing. Combine one part Balsamic vinegar with three parts olive oil and add salt & pepper for a classic dressing. This is best on lettuce or tomato salads. You can easily add crushed garlic or any savory herb. Mix Greek yogurt with lemon juice, garlic, oregano and hot sauce for a strong dressing, best on strong-flavored leaves such as arugula or radicchio. Mix freshly squeezed fruit juice, olive oil, salt and pepper for a fresh fruity dressing\n\nCheck out this article for more ideas."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Classic Leafy Green Salad Choose your main greens. The base of a green salad is crunchy leaves that can stand on their own or stay firm when dressed. Romaine or red leaf lettuce are great choices if you prefer mild flavors, while dinosaur kale offers a hearty, earthy alternative. Wash thoroughly, then chop and add to a large bowl. For an appetizer, plan on serving about 2–3 oz (55–85g) of (total) greens per person. Avoid the more common curly kale, which is tough to eat raw. Chop the greens. If you're not sure how to chop the leaves, take a bite to test the texture. Crisp lettuces are easy to eat torn, or cut into bite-sized pieces across the stem. For greens with a fibrous stem such as kale, cut out the stems then slice the leaves into thin pieces. Kale also benefits from \"massaging\" to break down the fibers. Place it in a bowl of acidic dressing and squeeze handfuls of leaves with moderate pressure. Let sit for 5–15 minutes before serving. Add softer greens. A variety of textures is key to a good salad. Add a roughly equal amount of arugula, spinach, butter leaf lettuce, or another soft, leafy green to your salad. Handle these gently while washing and chopping, as soft leaves tend to bruise more easily. Mix in peppery greens (optional). If you like some zing in your salad, throw in a large handful of radicchio, water cress, dandelion, or frisée. These add strong peppery flavors. Add extra ingredients (optional). You can stop here, or use your mixed greens as a base for all sort of ingredients. Here are a few examples:\nA little feta or blue cheese, crumbled on top\nWalnut halves\nCherry tomatoes\nAvocado cubes Toss with dressing. Serve with French salad dressing, Vinaigrette, or just shake together balsamic vinegar and olive oil. Making a Vegetable Salad Appetizer Serve cold tomato salad for a summer appetizer. These salads demand high-quality, fresh ingredients, so shop at a local market the same day if possible. Tomatoes combine well with many other vegetables; here are a few popular examples:\nGreek salad: 2–4 tomatoes (in eighths), 1 large cucumber (sliced thickly), 1 small red onion (sliced thinly). Toss with generous amounts of garlic salad dressing, or a Greek vinaigrette with garlic, oregano, and black pepper. Caprese: thick slices of tomato, each topped with a slice of fresh mozzarella and a basil leaf or three. Drizzle on extra-virgin olive oil just before serving. For an extra-refreshing salad, combine equally sized cubes of tomato and watermelon. Top with black pepper, a little salt, and vinaigrette. Let stand a few minutes before serving. Note — If storing tomatoes for more than a day, a cellar or air-conditioned room around 55-70ºF (13–21ºC) preserves flavor better than the fridge or a warm room. Chop up a coleslaw. Coleslaw is another summer appetizer, that pairs well with barbecue and other strong flavors. The heart of a coleslaw is a finely chopped cabbage, usually paired with other crunchy vegetables (shredded carrot is especially popular), sweet flavors (apple, golden raisins), and a binding dressing made from vinegar and mayonnaise or sour cream. Here's a recipe to get you started. Serve a roasted vegetable appetizer. If the weather's cold and you need a hearty dinner appetizer, roast a tray of vegetables with olive oil, salt, and pepper. Season with lemon juice and herbs and serve hot. Include a few vegetables that don't normally go into a raw salad, such as potatoes, eggplant, or cauliflower. Remember that different vegetables require different cooking times. This example tells you how to combine potatoes, eggplant, bell peppers, red onion, and cherry tomatoes. Put together an Asian salad. Asian and Asian-inspired salads bring many new techniques to the table. The vegetables are often marinated for an hour or more to add an acidic tang, while spicy, salty, and sweet add a great deal of complexity. Here a couple examples:\nSlice cucumbers and sweet onions very thinly, preferably with a mandoline. Marinate in a homemade Asian dressing, or this sesame lemon dressing. Fumi salad roasts sesame seeds and almonds to add flavor to cabbage and ramen noodles. You can easily turn this into a main course by adding chicken. Add Asian flavors to any vegetable salad with soy ginger dressing or miso dressing. Go easy on these if you aren't used to them. They tend to be more concentrated than Western dressings. Making a Vegetable Salad Main Course Choose your approach. If you feel like inventing your own salad, move on to the next step to begin the step-by-step instructions. If you're looking for something faster, here are a few well-tested ideas that can stand at the center of your meal:\nChef's salad: sliced ham, cheese, hard-boiled egg, cucumber, and tomato on a bed of lettuce. This can stand up to thicker, stronger-flavored dressings such as Caesar salad dressing, ranch, or Thousand Island. Salad Nicoise: a French salad of potatoes, tomatoes, egg, olives, and fish (usually anchovies or tuna), among other ingredients. Southwest salad: Combine cooked corn and black beans with red peppers, spring onions, and plenty of avocado and/or grilled chicken. Season with cilantro and lime. Start with a base ingredient. You can start with lettuce or mixed greens, if you're prepared to amp it up with plenty of protein and starchy ingredients. Another approach is to use a bed of grains, especially something with plenty of texture like brown rice or quinoa. A bed of rice noodles works well for Asian salads. Add colourful veggies. This isn't just for show; a variety of colours means a variety of vitamins. Strips of red, orange, or yellow bell pepper are a great choice. Also try shredded carrot; shredded beets (raw, pickled or cooked); or sliced tomatoes. You can even add edible flowers. Mix in veggies with strong flavours. Add intensity with roasted garlic, pitted olives, or diced hot peppers. Use avocado for a creamy texture. Keep it tasty but more casual with chopped asparagus, any kind of onion, or flavorful mushrooms. Add extra texture. These little nibbles make a salad much more interesting. There are all kinds of options:\nAny nuts or seeds – walnuts, sunflower seeds, pumpkin seeds, etc. Breads or grains – croutons, tortilla chips, popcorn, cooked quinoa\nAny type of fresh or dried fruit, especially berries\nSnap peas, corn niblets, or other small veggies Add your protein. A salad requires protein to become an entreé. Choose just one or two of the following, chopped into bite-size pieces. Cooked beans – chickpeas, lentils\nCheese – Parmesan Swiss, or feta for more subtle flavor; cheddar or blue cheese for strong flavor\nOther vegetarian options – soft- or hard-boiled egg, tofu\nMeat – tuna, chicken breast, ham, grilled fish or steak, shrimp, squid Toss with dressing. Salad dressing can be purchased or made at home. Whichever you choose, drizzle over the salad and toss until thoroughly coated. If you made the salad in advance, wait until just before serving to add the dressing. Combine one part Balsamic vinegar with three parts olive oil and add salt & pepper for a classic dressing. This is best on lettuce or tomato salads. You can easily add crushed garlic or any savory herb. Mix Greek yogurt with lemon juice, garlic, oregano and hot sauce for a strong dressing, best on strong-flavored leaves such as arugula or radicchio. Mix freshly squeezed fruit juice, olive oil, salt and pepper for a fresh fruity dressing\n\nCheck out this article for more ideas. Finished. ",
  "tyn_model":[
    "tomatoes",
    "salad",
    "olive oil",
    "tomato",
    "vegetables",
    "kale",
    "avocado",
    "garlic",
    "coleslaw",
    "potatoes",
    "blue cheese",
    "dressing",
    "balsamic vinegar",
    "cucumber",
    "red onion",
    "oregano",
    "black pepper",
    "salt",
    "lemon juice",
    "ham",
    "lettuce",
    "olives",
    "green salad",
    "red leaf lettuce",
    "large bowl",
    "greens",
    "curly kale",
    "lettuces",
    "bowl",
    "acidic dressing",
    "arugula",
    "spinach",
    "butter leaf lettuce",
    "radicchio",
    "water cress",
    "dandelion",
    "frisée",
    "mixed greens",
    "walnut",
    "french salad dressing",
    "greek salad",
    "garlic salad dressing",
    "greek vinaigrette",
    "mozzarella",
    "basil",
    "extra-virgin olive oil",
    "watermelon",
    "— if",
    "cabbage",
    "apple",
    "vinegar",
    "mayonnaise or",
    "sour cream",
    "pepper",
    "herbs",
    "cauliflower",
    "eggplant",
    "bell peppers",
    "cherry tomatoes",
    "cucumbers",
    "sweet onions",
    "mandoline",
    "sesame lemon dressing",
    "almonds",
    "ramen noodles",
    "chicken",
    "vegetable salad",
    "soy ginger dressing",
    "miso dressing",
    "chef's salad",
    "cheese",
    "hard-boiled egg",
    "caesar salad dressing",
    "thousand island.",
    "nicoise",
    "egg",
    "fish",
    "tuna",
    "red peppers",
    "onions",
    "grilled chicken",
    "cilantro",
    "lime",
    "brown rice",
    "quinoa",
    "rice noodles",
    "veggies",
    "carrot",
    "beets",
    "roasted garlic",
    "hot peppers",
    "asparagus",
    "onion",
    "mushrooms",
    "– walnuts",
    "sunflower seeds",
    "pumpkin seeds",
    "– croutons",
    "tortilla chips",
    "popcorn",
    "berries",
    "peas",
    "– chickpeas",
    "lentils",
    "– parmesan",
    "feta",
    "– soft-",
    "tofu",
    "– tuna",
    "chicken breast",
    "grilled fish",
    "shrimp",
    "salad dressing",
    "salt & pepper",
    "greek yogurt",
    "hot sauce",
    "fruit juice",
    "salt and pepper"
  ],
  "tyn_section":[

  ]
}