{
  "title":"How to Arrange Your Bedroom Mirrors",
  "url":"https://www.wikihow.com/Arrange-Your-Bedroom-Mirrors",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "parts":[
    {
      "name":"Using Mirrors as Decorations",
      "steps":[
        {
          "headline":"Place a small mirror on your nightstand or dresser.",
          "description":"This allows you to have close access to a mirror for cosmetic purposes, like doing your makeup, combing your hair, styling your hair, straightening your tie, and putting on jewelry."
        },
        {
          "headline":"Repurpose an old mirror.",
          "description":"Repainting, staining, or decorating an old mirror can add a fun and personal element to your room. You can decorate the mirror itself with stickers, fabric, or other craft items that inspire you. Recycling old mirrors makes a sustainable and cost-effective decorating choice. You can also contract a local craftsman to make a unique, beautiful frame from recycled materials."
        },
        {
          "headline":"Create a focal point with your mirror.",
          "description":"Purchase a stand-alone mirror in an elegant style. Placing it where there is natural light is best, but not necessary. A large, interesting mirror can create a focal point in your bedroom."
        },
        {
          "headline":"Install multiple mirrors on the same wall.",
          "description":"Experiment with mirrors of different size and shapes. You can install some of them close to each other and some further away. Also try placing the mirrors around other art or pictures in your bedroom. The number of mirrors you hang up is a personal choice, though too many may make your room look cluttered. Don't be afraid to play around with your mirror locations. Experiment with your space based on what you think looks good. Reposition your mirror if its reflection isn’t a pleasant view or if the mirror is not reflecting enough natural light."
        }
      ]
    },
    {
      "name":"Making a Small Room Appear Larger",
      "steps":[
        {
          "headline":"Hang your mirrors on opposing walls.",
          "description":"This increases the appearance of your room's size. by creating the illusion of depth in your room. The larger the mirrors, the more potential for added depth."
        },
        {
          "headline":"Add a full-length mirror opposite your doorway.",
          "description":"Place your mirror directly across from your doorway. Hanging a larger mirror across from the doorway will reflect the outside hallway, making your room appear longer. Longer mirrors will reflect the most, but a small mirror will also offer more depth."
        },
        {
          "headline":"Select a focal point and angle your mirror towards it.",
          "description":"This will give the illusion of depth, especially when natural or artificial light is in the picture. Light is bounced around the room to make the room appear larger."
        },
        {
          "headline":"Put your mirror on a glass tabletop.",
          "description":"Adding a mirror to your tabletop will reflect the light from above, making your space feel larger. You can place a mirror on an existing table or purchase one with a mirror already installed. Use a mirror about the same size as your table and adhere it to your table. You can also have a mirror custom made to fit your table size."
        },
        {
          "headline":"Place your mirror behind your door.",
          "description":"Putting your mirror here will help you save space without adding extra bulk to your room. The mirror will be neatly tucked away, and you can still easily access it."
        },
        {
          "headline":"Hang multiple mirrors to experiment with depth.",
          "description":"You can try out any combination of suggestions above to create an open space that is right for you and your space. Placing different sized mirrors in narrow areas can create an open effect by multiple mirrors reflecting multiple angles. Try to balance having enough mirrors to open up your space and make the room feel bigger without adding so many mirrors that your room looks messy or cluttered. If your budget and space only calls for one mirror, select the full size mirror so you can view your entire look. If you only have small mirrors to work with, place them at eye-level or above in a row on your wall, spaced evenly, a few feet apart."
        }
      ]
    },
    {
      "name":"Making a Dark Room Look Lighter",
      "steps":[
        {
          "headline":"Hang a full-size mirror across the room from your largest window.",
          "description":"Positioning the mirror here will brighten your space by reflecting the natural light that shines in from your window. Ensure your window is clean to reflect as much light possible."
        },
        {
          "headline":"Angle mirrors to reflect as much light as possible.",
          "description":"After you hang your first mirror, follow the angles of the mirror and position your next mirror based on how much light is reflected in each. Placing mirrors in locations where you can play with the angles to reflect light helps you harness as much light as possible--both the natural light from the windows and the lighting in your bedroom."
        },
        {
          "headline":"Place your mirror directly next to a window to reflect the outside.",
          "description":"Putting it here helps reflect the additional sunlight that comes in from the window. Larger mirrors will reflect the most light, though smaller mirrors can still achieve this effect. Depending on your mirror and window size, experiment with leaving a few inches between the window and the wall in order to reflect as much light possible. If you have another mirror across from your window, try using this step to maximize potential natural light."
        },
        {
          "headline":"Use mirrored cabinet doors to reflect extra light.",
          "description":"This will not only make your space look larger but also provide more opportunity to reflect both natural and artificial light."
        }
      ]
    }
  ],
  "text":" Using Mirrors as Decorations Place a small mirror on your nightstand or dresser. This allows you to have close access to a mirror for cosmetic purposes, like doing your makeup, combing your hair, styling your hair, straightening your tie, and putting on jewelry. Repurpose an old mirror. Repainting, staining, or decorating an old mirror can add a fun and personal element to your room. You can decorate the mirror itself with stickers, fabric, or other craft items that inspire you. Recycling old mirrors makes a sustainable and cost-effective decorating choice. You can also contract a local craftsman to make a unique, beautiful frame from recycled materials. Create a focal point with your mirror. Purchase a stand-alone mirror in an elegant style. Placing it where there is natural light is best, but not necessary. A large, interesting mirror can create a focal point in your bedroom. Install multiple mirrors on the same wall. Experiment with mirrors of different size and shapes. You can install some of them close to each other and some further away. Also try placing the mirrors around other art or pictures in your bedroom. The number of mirrors you hang up is a personal choice, though too many may make your room look cluttered. Don't be afraid to play around with your mirror locations. Experiment with your space based on what you think looks good. Reposition your mirror if its reflection isn’t a pleasant view or if the mirror is not reflecting enough natural light. Making a Small Room Appear Larger Hang your mirrors on opposing walls. This increases the appearance of your room's size. by creating the illusion of depth in your room. The larger the mirrors, the more potential for added depth. Add a full-length mirror opposite your doorway. Place your mirror directly across from your doorway. Hanging a larger mirror across from the doorway will reflect the outside hallway, making your room appear longer. Longer mirrors will reflect the most, but a small mirror will also offer more depth. Select a focal point and angle your mirror towards it. This will give the illusion of depth, especially when natural or artificial light is in the picture. Light is bounced around the room to make the room appear larger. Put your mirror on a glass tabletop. Adding a mirror to your tabletop will reflect the light from above, making your space feel larger. You can place a mirror on an existing table or purchase one with a mirror already installed. Use a mirror about the same size as your table and adhere it to your table. You can also have a mirror custom made to fit your table size. Place your mirror behind your door. Putting your mirror here will help you save space without adding extra bulk to your room. The mirror will be neatly tucked away, and you can still easily access it. Hang multiple mirrors to experiment with depth. You can try out any combination of suggestions above to create an open space that is right for you and your space. Placing different sized mirrors in narrow areas can create an open effect by multiple mirrors reflecting multiple angles. Try to balance having enough mirrors to open up your space and make the room feel bigger without adding so many mirrors that your room looks messy or cluttered. If your budget and space only calls for one mirror, select the full size mirror so you can view your entire look. If you only have small mirrors to work with, place them at eye-level or above in a row on your wall, spaced evenly, a few feet apart. Making a Dark Room Look Lighter Hang a full-size mirror across the room from your largest window. Positioning the mirror here will brighten your space by reflecting the natural light that shines in from your window. Ensure your window is clean to reflect as much light possible. Angle mirrors to reflect as much light as possible. After you hang your first mirror, follow the angles of the mirror and position your next mirror based on how much light is reflected in each. Placing mirrors in locations where you can play with the angles to reflect light helps you harness as much light as possible--both the natural light from the windows and the lighting in your bedroom. Place your mirror directly next to a window to reflect the outside. Putting it here helps reflect the additional sunlight that comes in from the window. Larger mirrors will reflect the most light, though smaller mirrors can still achieve this effect. Depending on your mirror and window size, experiment with leaving a few inches between the window and the wall in order to reflect as much light possible. If you have another mirror across from your window, try using this step to maximize potential natural light. Use mirrored cabinet doors to reflect extra light. This will not only make your space look larger but also provide more opportunity to reflect both natural and artificial light.",
  "tyn_model":[
    "mirror",
    "mirrors",
    "fabric"
  ],
  "tyn_section":[

  ]
}