{
  "title":"How to Make Japanese Style Turkey Kabobs",
  "url":"https://www.wikihow.com/Make-Japanese-Style-Turkey-Kabobs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes"
  ],
  "steps":[
    {
      "headline":"Add sugar, sherry and soy sauce to a saucepan.",
      "description":"Mix to combine."
    },
    {
      "headline":"Cook over medium-high heat until the sugar dissolves.",
      "description":"Stir constantly during the heating process."
    },
    {
      "headline":"Allow the soy sauce mixture to cool.",
      "description":""
    },
    {
      "headline":"Cut turkey meat into 4 pieces.",
      "description":""
    },
    {
      "headline":"Place turkey pieces in a shallow dish or resealable food storage bag.",
      "description":""
    },
    {
      "headline":"Pour marinade over turkey and cover, if using a shallow dish, or seal the bag.",
      "description":""
    },
    {
      "headline":"Chill for at least 3 hours to allow the turkey to marinate.",
      "description":"Turn the turkey meat occasionally while marinating."
    },
    {
      "headline":"Prepare the grill or broiler, as needed.",
      "description":""
    },
    {
      "headline":"Drain the marinade from the turkey; reserve the marinade.",
      "description":""
    },
    {
      "headline":"Insert turkey strips crosswise onto metal skewers alternating with the fruits and vegetables.",
      "description":""
    },
    {
      "headline":"Grill or broil, basting often with marinade during the last 10 minutes of cook time, until turkey tests done.",
      "description":"This should take about 10 minutes."
    },
    {
      "headline":"Serves 4.",
      "description":""
    }
  ],
  "text":" Add sugar, sherry and soy sauce to a saucepan. Mix to combine. Cook over medium-high heat until the sugar dissolves. Stir constantly during the heating process. Allow the soy sauce mixture to cool.  Cut turkey meat into 4 pieces.  Place turkey pieces in a shallow dish or resealable food storage bag.  Pour marinade over turkey and cover, if using a shallow dish, or seal the bag.  Chill for at least 3 hours to allow the turkey to marinate. Turn the turkey meat occasionally while marinating. Prepare the grill or broiler, as needed.  Drain the marinade from the turkey; reserve the marinade.  Insert turkey strips crosswise onto metal skewers alternating with the fruits and vegetables.  Grill or broil, basting often with marinade during the last 10 minutes of cook time, until turkey tests done. This should take about 10 minutes. Serves 4. ",
  "tyn_model":[
    "turkey",
    "sugar",
    "soy sauce",
    "shallow dish",
    "sherry",
    "saucepan",
    "resealable food storage bag",
    "grill",
    "broiler"
  ],
  "tyn_section":[

  ]
}