{
  "title":"How to Make Bone Broth",
  "url":"https://www.wikihow.com/Make-Bone-Broth",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Soups"
  ],
  "steps":[
    {
      "headline":"Use cartilaginous bones.",
      "description":"Collagen, which is found in cartilaginous bones like the joints, neck, head and feet, renders gelatin. For chicken broth, use 2 chicken feet in addition to the other bones. For beef broth, use sections of a calf's foot. You can find these things at your local butcher, or you can ask your local farmer to bring you some. They freeze well."
    },
    {
      "headline":"Use bones with some meat on them.",
      "description":"This will not affect the gelatin content of your broth, but will increase its flavor immensely."
    },
    {
      "headline":"Add vegetable scraps (if you have them) or even whole vegetables.",
      "description":"Bone broth is a great way to make use of kitchen “waste”–onion skins, garlic skins, ends of carrots, potato peelings. If you’re making broth weekly, you can store these in the fridge. Otherwise, freeze them for later use. Whole cloves of garlic, halved onions, halved potatoes all add flavor to your broth."
    },
    {
      "headline":"Fill a large stockpot with cold water and add the bones and the apple cider vinegar.",
      "description":"Let sit for an hour. The vinegar helps to draw out the minerals from the bones."
    },
    {
      "headline":"Place on stove and turn heat to medium-high.",
      "description":"When the liquid starts to roll, turn down heat immediately to low. At this point, there will be a good amount of foam on the surface of your broth. Skim, skim, skim. This foam contains surface impurities and will negatively affect the flavor of your broth."
    },
    {
      "headline":"Simmer the broth.",
      "description":"Cook broth for 12 hours. A slow-cooker is a wonderful tool for broth-making!"
    },
    {
      "headline":"Toss in a few sprigs of fresh parsley during the last 15 minutes of your simmer.",
      "description":"This will add minerals to your broth and complexity to its flavor."
    },
    {
      "headline":"Let cool in pot, then strain into sterilized glass jars.",
      "description":"These keep in the fridge for 4-5 days. A layer of fat will form at the top of your cooled broth. This helps preserve your broth and can also be used to, say, fry an onion, or cook an egg."
    }
  ],
  "text":" Use cartilaginous bones. Collagen, which is found in cartilaginous bones like the joints, neck, head and feet, renders gelatin. For chicken broth, use 2 chicken feet in addition to the other bones. For beef broth, use sections of a calf's foot. You can find these things at your local butcher, or you can ask your local farmer to bring you some. They freeze well. Use bones with some meat on them. This will not affect the gelatin content of your broth, but will increase its flavor immensely. Add vegetable scraps (if you have them) or even whole vegetables. Bone broth is a great way to make use of kitchen “waste”–onion skins, garlic skins, ends of carrots, potato peelings. If you’re making broth weekly, you can store these in the fridge. Otherwise, freeze them for later use. Whole cloves of garlic, halved onions, halved potatoes all add flavor to your broth. Fill a large stockpot with cold water and add the bones and the apple cider vinegar. Let sit for an hour. The vinegar helps to draw out the minerals from the bones. Place on stove and turn heat to medium-high. When the liquid starts to roll, turn down heat immediately to low. At this point, there will be a good amount of foam on the surface of your broth. Skim, skim, skim. This foam contains surface impurities and will negatively affect the flavor of your broth. Simmer the broth. Cook broth for 12 hours. A slow-cooker is a wonderful tool for broth-making! Toss in a few sprigs of fresh parsley during the last 15 minutes of your simmer. This will add minerals to your broth and complexity to its flavor. Let cool in pot, then strain into sterilized glass jars. These keep in the fridge for 4-5 days. A layer of fat will form at the top of your cooled broth. This helps preserve your broth and can also be used to, say, fry an onion, or cook an egg.",
  "tyn_model":[
    "broth",
    "gelatin",
    "garlic",
    "collagen",
    "chicken broth",
    "beef broth",
    "vegetables",
    "bone broth",
    "“waste”–onion",
    "carrots",
    "onions",
    "potatoes",
    "stockpot",
    "cold water",
    "apple cider vinegar",
    "vinegar",
    "stove",
    "slow-cooker",
    "parsley",
    "pot",
    "glass jars",
    "onion"
  ],
  "tyn_section":[

  ]
}