{
  "title":"How to Get Lots of Money on Lego Star Wars 2 (Gba)",
  "url":"https://www.wikihow.com/Get-Lots-of-Money-on-Lego-Star-Wars-2-(Gba)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games"
  ],
  "steps":[
    {
      "headline":"Unlock \"Emperor Fight\".",
      "description":"This is the level you need to get the money. You can find this in the door labeled VI. (Ep. 6)"
    },
    {
      "headline":"Unlock Darth Vader.",
      "description":"To get the money, you need him."
    },
    {
      "headline":"Choose Free Play in the game menu on Emperor Fight.",
      "description":"In story mode, you're forced to use Luke skywalker. After choosing Darth Vader, continue."
    },
    {
      "headline":"Go around the level and collect money by breaking all the items.",
      "description":"To get true Jedi status, you need to build the panels, too."
    },
    {
      "headline":"After you break everything but the throne and statue, stand on the steps, around the middle step.",
      "description":"Do force choke on the real Darth Vader without activating him."
    },
    {
      "headline":"Proceed to go up the steps.",
      "description":"Break the throne, but not the statue. Go in the corner between the statue and the wall, then jump towards the statue. You should be in the ceiling!"
    },
    {
      "headline":"Jump down.",
      "description":"You now should have a cool looking blue and white lightsaber! This works with any character. Everyone has a different color."
    },
    {
      "headline":"Break the statue now, then kill Darth Vader.",
      "description":"He shouldn't fight back."
    },
    {
      "headline":"Repeat steps 4-8 for the Emperor.",
      "description":"You won't get as much money though."
    },
    {
      "headline":"Do this over and over to get tons of money!",
      "description":""
    }
  ],
  "text":" Unlock \"Emperor Fight\". This is the level you need to get the money. You can find this in the door labeled VI. (Ep. 6) Unlock Darth Vader. To get the money, you need him. Choose Free Play in the game menu on Emperor Fight. In story mode, you're forced to use Luke skywalker. After choosing Darth Vader, continue. Go around the level and collect money by breaking all the items. To get true Jedi status, you need to build the panels, too. After you break everything but the throne and statue, stand on the steps, around the middle step. Do force choke on the real Darth Vader without activating him. Proceed to go up the steps. Break the throne, but not the statue. Go in the corner between the statue and the wall, then jump towards the statue. You should be in the ceiling! Jump down. You now should have a cool looking blue and white lightsaber! This works with any character. Everyone has a different color. Break the statue now, then kill Darth Vader. He shouldn't fight back. Repeat steps 4-8 for the Emperor. You won't get as much money though. Do this over and over to get tons of money! ",
  "tyn_model":[
    "throne",
    "lightsaber"
  ],
  "tyn_section":[

  ]
}