{
  "title":"How to Kill the Moldorm in the Legend of Zelda",
  "url":"https://www.wikihow.com/Kill-the-Moldorm-in-the-Legend-of-Zelda",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "The Legend of Zelda Series"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Find a Moldorm.",
          "description":"These monsters can be found on the specific locations of the following game versions of The Legend of Zelda:\nThe Legend of Zelda – Can be found in any dungeons within the game. A Link to the Past – Inside the boss room of “Tower of Hera,” the third level of the game. Four Swords – Inside the boss room of “Tail Cave,” the first level of the game. The Wind Waker – After defeating the “Puppet Ganon” boss inside the Tower of Ganon. It will transform into a Moldorm. The Minish Cap – Can be found anywhere inside the “Fortress of Wind” level. Phantom Hourglass – Can be found anywhere inside the “Temple of Courage” level. Skyward Sword – Can be found in any dungeons within the game. A Link Between Worlds – Inside the boss room of Tower of Hera, just like in a Link to the Past version."
        },
        {
          "headline":"Dodge its attacks.",
          "description":"Moldorms do not have any special techniques. Once these creatures spot you, they will move linearly towards you and try to ram your character. Just make a short sidestep off the monster’s path to avoid its attack."
        },
        {
          "headline":"Strike its tail.",
          "description":"To kill Moldorms, all you need to do is to strike its tail three times with your sword. After you’ve dodged its attack, you should eventually end up behind the monster, giving you full access to its defenseless tail. Press the “Attack” button on your controller quickly to slash at the tail. One other weapon you could use to kill Moldorms aside from your sword is your bow and arrow. After dodging its ram attack, or standing from a safe distance, aim your bow at its tail and fire an arrow at it. Unlike your sword, it only takes one shot of an arrow to the tail to kill Moldorms."
        }
      ]
    },
    {
      "name":"Killing Modorms in Twilight Princess",
      "steps":[
        {
          "headline":"Find a Moldorm.",
          "description":"Only in the Twilight Princess version do Moldorms take a different approach to kill. These creatures can be found swimming in the sands of the Gerudo Desert. Once you get in the desert, you’ll see these creatures roaming around the area, just like how sharks move around the surface of the water."
        },
        {
          "headline":"Dodge its attack.",
          "description":"Moldorms do not have any special techniques in this version either. Once these creatures spot you, they will slither through the sand towards you. Once they’re close enough, they’ll jump out of the sand and dive at you. Just make a short sidestep off the monster’s path to avoid its attack."
        },
        {
          "headline":"Attack Moldorms while in its in mid-air.",
          "description":"You can’t kill these monsters while they are in the sands. That’s why as these monsters jump out of the sand to attack you, they’ll be exposing their defenseless bodies. Press the “Attack” button on your controller quickly to slash at the Moldorm’s body while it’s in mid-air. It takes three hits of your sword to the tail before a Moldorm can be killed. Just like in other versions of the game, one other weapon you can use to kill Moldorms is your bow and arrow. While the worm is in mid-air, shoot an arrow at its body to kill it. Unlike your sword, it only takes one shot of an arrow to the body to kill Moldorms."
        },
        {
          "headline":"Force Moldorms out of the sand.",
          "description":"If the monster won’t come out of the sand to attack you, you can use your Clawshot (which you will acquire before you even reach Gerudo Desert) to draw out the monster by force. Simply aim your Clawshot on the moving part of the sand where the worm is swimming and press the Action button on your controller to launch it. The Clawshot will pull the Moldorm out of the sand and it will flop on the ground like a fish out of water. Use your sword or bow and arrow just like in step 3 to kill it while it’s jumping around the ground."
        }
      ]
    }
  ],
  "text":" Steps Find a Moldorm. These monsters can be found on the specific locations of the following game versions of The Legend of Zelda:\nThe Legend of Zelda – Can be found in any dungeons within the game. A Link to the Past – Inside the boss room of “Tower of Hera,” the third level of the game. Four Swords – Inside the boss room of “Tail Cave,” the first level of the game. The Wind Waker – After defeating the “Puppet Ganon” boss inside the Tower of Ganon. It will transform into a Moldorm. The Minish Cap – Can be found anywhere inside the “Fortress of Wind” level. Phantom Hourglass – Can be found anywhere inside the “Temple of Courage” level. Skyward Sword – Can be found in any dungeons within the game. A Link Between Worlds – Inside the boss room of Tower of Hera, just like in a Link to the Past version. Dodge its attacks. Moldorms do not have any special techniques. Once these creatures spot you, they will move linearly towards you and try to ram your character. Just make a short sidestep off the monster’s path to avoid its attack. Strike its tail. To kill Moldorms, all you need to do is to strike its tail three times with your sword. After you’ve dodged its attack, you should eventually end up behind the monster, giving you full access to its defenseless tail. Press the “Attack” button on your controller quickly to slash at the tail. One other weapon you could use to kill Moldorms aside from your sword is your bow and arrow. After dodging its ram attack, or standing from a safe distance, aim your bow at its tail and fire an arrow at it. Unlike your sword, it only takes one shot of an arrow to the tail to kill Moldorms. Killing Modorms in Twilight Princess Find a Moldorm. Only in the Twilight Princess version do Moldorms take a different approach to kill. These creatures can be found swimming in the sands of the Gerudo Desert. Once you get in the desert, you’ll see these creatures roaming around the area, just like how sharks move around the surface of the water. Dodge its attack. Moldorms do not have any special techniques in this version either. Once these creatures spot you, they will slither through the sand towards you. Once they’re close enough, they’ll jump out of the sand and dive at you. Just make a short sidestep off the monster’s path to avoid its attack. Attack Moldorms while in its in mid-air. You can’t kill these monsters while they are in the sands. That’s why as these monsters jump out of the sand to attack you, they’ll be exposing their defenseless bodies. Press the “Attack” button on your controller quickly to slash at the Moldorm’s body while it’s in mid-air. It takes three hits of your sword to the tail before a Moldorm can be killed. Just like in other versions of the game, one other weapon you can use to kill Moldorms is your bow and arrow. While the worm is in mid-air, shoot an arrow at its body to kill it. Unlike your sword, it only takes one shot of an arrow to the body to kill Moldorms. Force Moldorms out of the sand. If the monster won’t come out of the sand to attack you, you can use your Clawshot (which you will acquire before you even reach Gerudo Desert) to draw out the monster by force. Simply aim your Clawshot on the moving part of the sand where the worm is swimming and press the Action button on your controller to launch it. The Clawshot will pull the Moldorm out of the sand and it will flop on the ground like a fish out of water. Use your sword or bow and arrow just like in step 3 to kill it while it’s jumping around the ground.",
  "tyn_model":[
    "sand",
    "sword",
    "moldorm",
    "– can",
    "– inside",
    "moldorms",
    "controller",
    "arrow",
    "” the",
    "” level",
    "“attack",
    "” button",
    "bow",
    "“tower",
    "“tail",
    "wind waker",
    "– after",
    "“puppet",
    "” boss",
    "“fortress",
    "“temple",
    "skyward sword",
    "bow and arrow",
    "water"
  ],
  "tyn_section":[

  ]
}