{
  "title":"How to Make Mixed Fruit Cobbler",
  "url":"https://www.wikihow.com/Make-Mixed-Fruit-Cobbler",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "steps":[
    {
      "headline":"Pre-heat the oven to 350 degrees F, 180 degrees C, or on gas mark 4.",
      "description":""
    },
    {
      "headline":"Mix the fruit.",
      "description":"In a bowl combine the nectarines, plums, sugar, lemon juice, vanilla essence, a tablespoon of flour and mix thoroughly."
    },
    {
      "headline":"Make the pastry.",
      "description":"In a separate bowl combine the flour, baking powder, salt and cinnamon. Stir in the milk and add the butter. Using your hands, incorporate the butter into the other ingredients and begin shaping the pastry. When a pastry ball has formed leave it to one side."
    },
    {
      "headline":"Prepare the fruit.",
      "description":"Loosely arrange the fruit in a baking dish and pour over the juices."
    },
    {
      "headline":"Roll the pastry.",
      "description":"Dust a flat surface with flour and place the pastry ball in the centre. Begin rolling it out, turning the pastry every now again to flatten it evenly. It needs to be big enough to generously cover the fruit. When it's ready, gently ease the pastry off the surface and roll it up onto the rolling pin."
    },
    {
      "headline":"Lie the pastry on the fruit.",
      "description":"Carefully unravel the pastry down onto the fruit. Tuck it down around the sides to seal the fruit in and remove any excess pastry."
    },
    {
      "headline":"Bake.",
      "description":"Place the dish in the centre of the oven and bake for 35 minutes."
    },
    {
      "headline":"Remove and serve.",
      "description":"When the pastry is golden brown and crisp, remove the cobbler from the oven and serve while hot with ice cream or cream."
    }
  ],
  "text":" Pre-heat the oven to 350 degrees F, 180 degrees C, or on gas mark 4.  Mix the fruit. In a bowl combine the nectarines, plums, sugar, lemon juice, vanilla essence, a tablespoon of flour and mix thoroughly. Make the pastry. In a separate bowl combine the flour, baking powder, salt and cinnamon. Stir in the milk and add the butter. Using your hands, incorporate the butter into the other ingredients and begin shaping the pastry. When a pastry ball has formed leave it to one side. Prepare the fruit. Loosely arrange the fruit in a baking dish and pour over the juices. Roll the pastry. Dust a flat surface with flour and place the pastry ball in the centre. Begin rolling it out, turning the pastry every now again to flatten it evenly. It needs to be big enough to generously cover the fruit. When it's ready, gently ease the pastry off the surface and roll it up onto the rolling pin. Lie the pastry on the fruit. Carefully unravel the pastry down onto the fruit. Tuck it down around the sides to seal the fruit in and remove any excess pastry. Bake. Place the dish in the centre of the oven and bake for 35 minutes. Remove and serve. When the pastry is golden brown and crisp, remove the cobbler from the oven and serve while hot with ice cream or cream.",
  "tyn_model":[
    "pastry",
    "oven",
    "flour",
    "butter",
    "pastry ball",
    "nectarines",
    "plums",
    "sugar",
    "lemon juice",
    "vanilla",
    "baking powder",
    "salt",
    "cinnamon",
    "milk",
    "baking dish",
    "rolling pin",
    "cobbler",
    "ice cream",
    "cream"
  ],
  "tyn_section":[

  ]
}