{
  "title":"How to Make a Video Game Gun Sync Video",
  "url":"https://www.wikihow.com/Make-a-Video-Game-Gun-Sync-Video",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Choose the song you will be syncing.",
      "description":"Preferably something fast-paced or exciting. A lot of gun sync videos are of dance, electronic, or dubstep compositions, but you can do whatever you want. Download the song you've chosen onto your computer."
    },
    {
      "headline":"Choose the game you will be using.",
      "description":"You usually use a shooting game (hence \"gun sync\"), but you can theoretically sync just about any kind of weapon effect from any game."
    },
    {
      "headline":"Listen to the song repeatedly.",
      "description":"Memorize it. You need to be able to recognize each and every musical note that composes the song."
    },
    {
      "headline":"Decide which weapons will be matching which musical chord.",
      "description":"Identify the beat, the harmony, the melody, everything. You need to be precise. Match the part with a weapon that closely resembles that harmonic frequency."
    },
    {
      "headline":"Get ready to record yourself.",
      "description":"Prepare yourself, and start."
    },
    {
      "headline":"Fire!",
      "description":"Blast away with each of the weapons. Technically, you only need one shot for each weapon (you can recycle the same shot while editing the video), but if you want to impress your audience, shoot out the whole thing."
    },
    {
      "headline":"Start editing the video.",
      "description":"Align the shots in perfect sync with the music. Once you are satisfied, upload it to YouTube."
    }
  ],
  "text":" Choose the song you will be syncing. Preferably something fast-paced or exciting. A lot of gun sync videos are of dance, electronic, or dubstep compositions, but you can do whatever you want. Download the song you've chosen onto your computer. Choose the game you will be using. You usually use a shooting game (hence \"gun sync\"), but you can theoretically sync just about any kind of weapon effect from any game. Listen to the song repeatedly. Memorize it. You need to be able to recognize each and every musical note that composes the song. Decide which weapons will be matching which musical chord. Identify the beat, the harmony, the melody, everything. You need to be precise. Match the part with a weapon that closely resembles that harmonic frequency. Get ready to record yourself. Prepare yourself, and start. Fire! Blast away with each of the weapons. Technically, you only need one shot for each weapon (you can recycle the same shot while editing the video), but if you want to impress your audience, shoot out the whole thing. Start editing the video. Align the shots in perfect sync with the music. Once you are satisfied, upload it to YouTube.",
  "tyn_model":[
    "weapons",
    "weapon"
  ],
  "tyn_section":[

  ]
}