{
  "title":"How to Unlock Mods for Cars in Need for Speed",
  "url":"https://www.wikihow.com/Unlock-Mods-for-Cars-in-Need-for-Speed",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Need for Speed"
  ],
  "methods":[
    {
      "name":"Need for Speed Most Wanted 2012 (PC)",
      "steps":[
        {
          "headline":"Start NFSMW 2012.",
          "description":"You can do this using the following Start menu sequence: Start button  >> All Programs >> EA Games >> Need for Speed Most Wanted, or by double-clicking its desktop icon if one is there."
        },
        {
          "headline":"Launch into the game’s Free Roam mode.",
          "description":"To do this, simply press any key when the prompt appears after the pre-game cinematics. The game will take you directly into the racing world without first displaying a Main Menu."
        },
        {
          "headline":"Start a race—any race— and finish in the top two spots.",
          "description":"To do this, press Num 6 to open the EasyDrive menu. EasyDrive is a system in NFSMW that allows you to easily pick out races to enter or upgrade your vehicle. Scroll downwards using Num 2 to activate the Races option and then press Num 6 to display available races. Use Num 2 and Num 8 to scroll up and down, respectively, and highlight the race you want. When it is highlighted, press Num 6 twice to set the venue of the race on the game’s GPS system. This will highlight your route to the race’s starting point on the minimap (displayed at the bottom left corner of your screen). Press Num 4 to quit EasyDrive, and drive to the race (use the Up, Down, Left and Right Arrow keys to navigate). Use the minimap to help you get there. When you are near the race’s venue, you will see a banner in the middle of the road displaying the name of the race and possible Mods you will win if you finish the race in 1st or 2nd place (if you finish outside the top 2, you will get SpeedPoint bonuses but no Mods). To start the race, spin your wheels on the spot by pressing the Up and Down arrow keys together."
        },
        {
          "headline":"Apply the unlocked Mods to your car.",
          "description":"At the end of the race, if you finished first or second, a message will show up on the screen informing you of the Mods you’ve unlocked. To apply them:\nPress Num 6 to open the EasyDrive menu. Scroll downwards using Num 2 to activate the Customize Car option and then press Num 6 to display available Mods. Use Num 2 and Num 8 to scroll up and down, respectively, till the Mod you unlocked is highlighted. Press Num 6 to install the Mod. Press Num 4 to quit EasyDrive and return to Free Roam."
        }
      ]
    },
    {
      "name":"Need for Speed Underground 2 (PC)",
      "steps":[
        {
          "headline":"Start NFSU2.",
          "description":"You can do this using the following Start menu sequence: Start button  >> All Programs >> EA Games >> Need for Speed Underground 2, or by double clicking its Desktop icon if one is added there."
        },
        {
          "headline":"Wait for the “Press Enter Key” screen.",
          "description":"After the pre-game cinematics have played, the game will display the message “Press Enter Key” message. DO NOT press Enter."
        },
        {
          "headline":"Type in the the Mod unlocker cheat code.",
          "description":"While still at the “Press Enter Key” screen, key in one or all of these cheat codes:\n“needperformance1” to unlock all Level 1 car performance mods. “needperformance2” to unlock all Level 2 car performance mods. “gimmevisual1” to unlock all Level 1 car visual mods. “gimmevisual2” to unlock all Level 2 car visual mods. After keying in any of the cheat codes, DO NOT press Enter if you wish to type in an additional code. If you wish to type in a second code, just go on typing the next code. For instance, to activate both the Level 1 car performance and Level 1 car visual mods cheat codes, you’d need to type in: needperformance1gimmevisual1."
        },
        {
          "headline":"Confirm by proceeding to the Main Menu.",
          "description":"After you have typed in the codes for all the Mods you want, press Enter to go to the game’s Main Menu. You will thus have unlocked your Mods!"
        }
      ]
    }
  ],
  "text":" Need for Speed Most Wanted 2012 (PC) Start NFSMW 2012. You can do this using the following Start menu sequence: Start button  >> All Programs >> EA Games >> Need for Speed Most Wanted, or by double-clicking its desktop icon if one is there. Launch into the game’s Free Roam mode. To do this, simply press any key when the prompt appears after the pre-game cinematics. The game will take you directly into the racing world without first displaying a Main Menu. Start a race—any race— and finish in the top two spots. To do this, press Num 6 to open the EasyDrive menu. EasyDrive is a system in NFSMW that allows you to easily pick out races to enter or upgrade your vehicle. Scroll downwards using Num 2 to activate the Races option and then press Num 6 to display available races. Use Num 2 and Num 8 to scroll up and down, respectively, and highlight the race you want. When it is highlighted, press Num 6 twice to set the venue of the race on the game’s GPS system. This will highlight your route to the race’s starting point on the minimap (displayed at the bottom left corner of your screen). Press Num 4 to quit EasyDrive, and drive to the race (use the Up, Down, Left and Right Arrow keys to navigate). Use the minimap to help you get there. When you are near the race’s venue, you will see a banner in the middle of the road displaying the name of the race and possible Mods you will win if you finish the race in 1st or 2nd place (if you finish outside the top 2, you will get SpeedPoint bonuses but no Mods). To start the race, spin your wheels on the spot by pressing the Up and Down arrow keys together. Apply the unlocked Mods to your car. At the end of the race, if you finished first or second, a message will show up on the screen informing you of the Mods you’ve unlocked. To apply them:\nPress Num 6 to open the EasyDrive menu. Scroll downwards using Num 2 to activate the Customize Car option and then press Num 6 to display available Mods. Use Num 2 and Num 8 to scroll up and down, respectively, till the Mod you unlocked is highlighted. Press Num 6 to install the Mod. Press Num 4 to quit EasyDrive and return to Free Roam. Need for Speed Underground 2 (PC) Start NFSU2. You can do this using the following Start menu sequence: Start button  >> All Programs >> EA Games >> Need for Speed Underground 2, or by double clicking its Desktop icon if one is added there. Wait for the “Press Enter Key” screen. After the pre-game cinematics have played, the game will display the message “Press Enter Key” message. DO NOT press Enter. Type in the the Mod unlocker cheat code. While still at the “Press Enter Key” screen, key in one or all of these cheat codes:\n“needperformance1” to unlock all Level 1 car performance mods. “needperformance2” to unlock all Level 2 car performance mods. “gimmevisual1” to unlock all Level 1 car visual mods. “gimmevisual2” to unlock all Level 2 car visual mods. After keying in any of the cheat codes, DO NOT press Enter if you wish to type in an additional code. If you wish to type in a second code, just go on typing the next code. For instance, to activate both the Level 1 car performance and Level 1 car visual mods cheat codes, you’d need to type in: needperformance1gimmevisual1. Confirm by proceeding to the Main Menu. After you have typed in the codes for all the Mods you want, press Enter to go to the game’s Main Menu. You will thus have unlocked your Mods!",
  "tyn_model":[
    "mods",
    "” to",
    "“press",
    "” screen",
    "need for speed most wanted 2012",
    "need for speed most wanted,",
    "—any",
    "— and",
    "free roam",
    "” message",
    "“needperformance1",
    "“needperformance2",
    "“gimmevisual1",
    "“gimmevisual2"
  ],
  "tyn_section":[

  ]
}