{
  "title":"How to Play Kerby",
  "url":"https://www.wikihow.com/Play-Kerby",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Backyard Ball Games"
  ],
  "steps":[
    {
      "headline":"Get a very bouncy basketball or soccer ball (football).",
      "description":""
    },
    {
      "headline":"Find a road with two opposite pavements (sidewalks) in a quiet street; you don’t want to be stopping every 30 seconds for a car coming past.",
      "description":""
    },
    {
      "headline":"Stand on opposite pavements facing each other.",
      "description":""
    },
    {
      "headline":"Have Player 1 throw the ball to the opposing kerb, attempting to make the ball bounce back off of it.",
      "description":"If Player 1 catches the ball on the rebound, 50 points is awarded. If he does not, only 10 will be given then player one moves into the middle of the road and tries to hit the kerb if player 1 hits the kerb they get 10 points and go again if they miss they return to there side. If the ball doesn’t hit the kerb, no points are given. Player 2 is given the ball and attempts to do the same."
    },
    {
      "headline":"The game ends when a player reaches 1000 points.",
      "description":""
    }
  ],
  "text":" Get a very bouncy basketball or soccer ball (football).  Find a road with two opposite pavements (sidewalks) in a quiet street; you don’t want to be stopping every 30 seconds for a car coming past.  Stand on opposite pavements facing each other.  Have Player 1 throw the ball to the opposing kerb, attempting to make the ball bounce back off of it. If Player 1 catches the ball on the rebound, 50 points is awarded. If he does not, only 10 will be given then player one moves into the middle of the road and tries to hit the kerb if player 1 hits the kerb they get 10 points and go again if they miss they return to there side. If the ball doesn’t hit the kerb, no points are given. Player 2 is given the ball and attempts to do the same. The game ends when a player reaches 1000 points. ",
  "tyn_model":[
    "ball"
  ],
  "tyn_section":[

  ]
}