{
  "title":"How to Trade for Cards You Need in Star Wars: Card Trader",
  "url":"https://www.wikihow.com/Trade-for-Cards-You-Need-in-Star-Wars:-Card-Trader",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting",
    "Collecting Cards and Postcards"
  ],
  "steps":[
    {
      "headline":"Launch Star Wars Card Trader.",
      "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. The landing screen of the app will be the fan feeds."
    },
    {
      "headline":"View Fan Feeds.",
      "description":"The easiest way to find a trading partner is to look at the current fan feeds. These are the posts made by the players or traders, and they get updated real-time. This means you can find an active trader by reading the posts here. Scroll through the fan feeds, and find a trading partner. You can read through the posts to see if the cards you’re looking for are being offered or traded, but this is optional."
    },
    {
      "headline":"Select a trading partner.",
      "description":"All the fan feeds are headlined by the trader’s user name. The trader’s ratings are indicated right below it. You can use this as a gauge to check if the trader is reliable or not. Tap the trader’s username to begin trading with him."
    },
    {
      "headline":"Offer a trade.",
      "description":"A menu will appear; tap “Offer Trade” from here. The trading screen will appear, with your partner’s cards displayed first."
    },
    {
      "headline":"View your partner’s cards.",
      "description":"If the selected trader’s cards are just a few, you can just swipe up and down on them to see them. If the trader owns a ton of cards, making it difficult to search for cards you need, it would be best to filter his cards (next step)."
    },
    {
      "headline":"Filter for the cards you need.",
      "description":"There’s a toolbar right below the topmost panel where the cards being trade go. On the rightmost part of that toolbar is a button with reversing arrows. Tap on it. A menu will appear with sorting and filtering options. Under the Filter section, tap “Cards I Need.”"
    },
    {
      "headline":"View filtered cards.",
      "description":"The display of cards will update, showing you only the cards you don’t have. It will now be easier to sort through the cards and find what you need. You can also use the search field on the toolbar if you know the exact name of the card you’re looking for."
    },
    {
      "headline":"Select cards to get.",
      "description":"The topmost panel is where you put the cards you want to get. Swipe up and down on your partner’s filtered cards to view them, and find the cards you want to get. Tap, hold, and drag the cards you want to the topmost panel. You can also just double-tap on the cards to select them. Tap “Next” at the top right corner of the screen to continue. You can select up to 9 cards per trade."
    },
    {
      "headline":"Select cards to trade.",
      "description":"The next trading screen will appear, with your cards now displayed. Swipe up and down on your cards to view all of them, and find the cards you want to trade. Tap, hold, and drag the cards you want to give to the topmost panel. You can also double-tap on the cards to select them. Tap “Next” at the top right corner of the screen to continue. You can select up to 9 cards per trade."
    },
    {
      "headline":"Go over the selected cards.",
      "description":"A summary screen of your trade will be displayed for your review. Carefully check if this is the trade you want to offer. The partner’s username is on the top left corner, the cards you’re getting are on the left box, and the cards you’re giving are on the right box."
    },
    {
      "headline":"Send the trade offer.",
      "description":"Tap the “Send” button at the bottom to proceed with the trade. The trade will be sent to your partner. It’s now up to him to decide if he likes your offer."
    }
  ],
  "text":" Launch Star Wars Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. The landing screen of the app will be the fan feeds. View Fan Feeds. The easiest way to find a trading partner is to look at the current fan feeds. These are the posts made by the players or traders, and they get updated real-time. This means you can find an active trader by reading the posts here. Scroll through the fan feeds, and find a trading partner. You can read through the posts to see if the cards you’re looking for are being offered or traded, but this is optional. Select a trading partner. All the fan feeds are headlined by the trader’s user name. The trader’s ratings are indicated right below it. You can use this as a gauge to check if the trader is reliable or not. Tap the trader’s username to begin trading with him. Offer a trade. A menu will appear; tap “Offer Trade” from here. The trading screen will appear, with your partner’s cards displayed first. View your partner’s cards. If the selected trader’s cards are just a few, you can just swipe up and down on them to see them. If the trader owns a ton of cards, making it difficult to search for cards you need, it would be best to filter his cards (next step). Filter for the cards you need. There’s a toolbar right below the topmost panel where the cards being trade go. On the rightmost part of that toolbar is a button with reversing arrows. Tap on it. A menu will appear with sorting and filtering options. Under the Filter section, tap “Cards I Need.” View filtered cards. The display of cards will update, showing you only the cards you don’t have. It will now be easier to sort through the cards and find what you need. You can also use the search field on the toolbar if you know the exact name of the card you’re looking for. Select cards to get. The topmost panel is where you put the cards you want to get. Swipe up and down on your partner’s filtered cards to view them, and find the cards you want to get. Tap, hold, and drag the cards you want to the topmost panel. You can also just double-tap on the cards to select them. Tap “Next” at the top right corner of the screen to continue. You can select up to 9 cards per trade. Select cards to trade. The next trading screen will appear, with your cards now displayed. Swipe up and down on your cards to view all of them, and find the cards you want to trade. Tap, hold, and drag the cards you want to give to the topmost panel. You can also double-tap on the cards to select them. Tap “Next” at the top right corner of the screen to continue. You can select up to 9 cards per trade. Go over the selected cards. A summary screen of your trade will be displayed for your review. Carefully check if this is the trade you want to offer. The partner’s username is on the top left corner, the cards you’re getting are on the left box, and the cards you’re giving are on the right box. Send the trade offer. Tap the “Send” button at the bottom to proceed with the trade. The trade will be sent to your partner. It’s now up to him to decide if he likes your offer.",
  "tyn_model":[
    "cards",
    "“next",
    "” at",
    "star wars card trader",
    "star wars logo",
    "“offer",
    "” from",
    "“cards",
    "” view",
    "“send",
    "” button"
  ],
  "tyn_section":[

  ]
}