{
  "title":"How to Eat Stinging Nettles",
  "url":"https://www.wikihow.com/Eat-Stinging-Nettles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "parts":[
    {
      "name":"Blanching Nettles",
      "steps":[
        {
          "headline":"Chop the nettles into medium-sized pieces.",
          "description":"Use a kitchen knife or a set of shears to divide the stalks into sections that include roughly one leaf plus part of the stem. Both the leaves and the stem are safe for eating. Don't forget your gloves while you work — the nettles can still sting you. While you do this, set a pot of salted water on the stove over high heat. This will save time when you're waiting for it to boil in the next step."
        },
        {
          "headline":"Blanch the nettles in boiling water.",
          "description":"When the salted water reaches a steady boil, transfer the nettle pieces into the pot. Your goal here is to \"blanch\" the nettles — boil them for a short time — so that their stingers are inactivated. This does not take very long — usually less than a minute. However, since the consequences for failure can be painful, some sources recommend blanching for up to five minutes. If you like, you can save the blanching water to use as a tea (see \"Serving Ideas\" below)."
        },
        {
          "headline":"\"Shock\" the nettles with an ice bath.",
          "description":"Pour the blanched nettles into a pasta strainer. As soon as the hot water drains, use a set of tongs or a serving spoon to transfer them into a bowl filled with very cold ice water (ideally mostly ice). This technique (known as \"shocking\") stops the cooking process immediately. This is important to prevent the nettles from over-cooking, which can give them a texture that's a little too soft."
        },
        {
          "headline":"Drain the nettles and allow them to dry.",
          "description":"As soon as the nettles are cold, you can transfer them out of the ice bath and back into the strainer. Toss them gently to drain the water, then let them sit for five minutes to dry somewhat."
        },
        {
          "headline":"Use the nettles immediately or freeze to store.",
          "description":"At this point, your vegetables are completely ready to eat. You can enjoy them as-is or use them in your favorite recipe the same way you'd use greens like spinach, arugula, and so on. If you want to store them, pack them in an airtight container before tossing them in the freezer. There's no \"wrong\" way to eat nettles, but in the section below, we've provided a few recipe ideas. Feel free to get creative and make your own!"
        }
      ]
    },
    {
      "name":"Serving Ideas",
      "steps":[
        {
          "headline":"Serve pan-sauteed.",
          "description":"Just like spinach and collard greens, nettles can be simply prepared in a pan to make a nutritious side dish. See below:\nHeat butter in a frying pan. Toss in a few cloves of garlic and fry them for a few minutes. When the garlic aroma is strong and the cloves are starting to brown, toss in a heaping handful of (chopped but unblanched) nettles. Use tongs or gloves to avoid stings! Continue frying for a few minutes until the nettles are completely wilted and slightly browned. Season with salt and pepper to taste. Voila! A world-class, dinner-ready dish."
        },
        {
          "headline":"Use as garnish or salad for your main course.",
          "description":"Nettles are great on their own, but they're also good for adding roughage and texture to other dishes. For instance, try this easy garnish recipe that's great for steaks or other pieces of meat:\nBlanch or sauté nettles (as above) to remove the stings. Season warm nettles with butter, salt, and pepper. Toss the wilted nettles on top of a steak for a new spin on a classic dish. Alternatively, serve the nettles on the side tossed with other sweet, soft, cooked vegetables like carrot for a vegetarian side salad."
        },
        {
          "headline":"Add to doughs for nutrition and flavor.",
          "description":"If you've ever seen green pasta or tortillas, you've seen foods that have had spinach or kale added to the dough. You can do the same thing with nettles:\nPulse a handful of blanched nettles in a food processor to make a smooth paste. Add the nettles to the dough with the other wet ingredients (egg, milk, etc.). Continue the recipe as normal — you can add a small amount of extra flour if the dough is too moist. You can do this for basically any bread product — pasta, tortillas, bread, crackers, and much more."
        },
        {
          "headline":"Make a nettle pesto.",
          "description":"Though it's most famously made with basil, you can make pesto with virtually any greens. See below for an easy nettle recipe:\nPulse blanched nettles, walnuts (or pine nuts), olive oil, garlic, and parmesan cheese in food processor. Continue until you reach a smooth, even consistency. Use the pesto as a creamy, decadent sauce that's great for pastas or dipping. One great recipe is available here. You can also substitute blanched nettles for basil in WikiHow's pesto recipe. Pesto will turn brown when exposed to air, but this doesn't make it unsafe to eat as long as you store it in the fridge. To avoid this, cover the pesto with a layer of olive oil to prevent air from touching it."
        },
        {
          "headline":"Keep the blanching water for nettle tea.",
          "description":"As noted above, the water from blanching the nettles can be kept as a tea. You may drink it immediately or filter it through a sieve to remove any lingering nettle bits. Sweeten with cream and sugar or drink plain for a zero-calorie treat. This tea won't provide any caffeine, but it's great as a relaxing drink later in the day."
        }
      ]
    },
    {
      "name":"Picking Nettles in the Wild",
      "steps":[
        {
          "headline":"Know when and where to look for nettles.",
          "description":"Nettles tend to grow in temperate areas where they can get plenty of sunlight. They are common along riverbanks and at the edge of woods. They also grow well near manmade features like ditches, train tracks, old farmland, and empty lots. They can be picked as soon as they appear in early spring (sometimes as early as January) until when they flower in the mid to late summer (June-September). This page contains a map showing the approximate habitat of nettles around the world."
        },
        {
          "headline":"Learn how to identify nettles in the wild.",
          "description":"Nettles start out as small, green, leafy sprouts in the spring with a \"fuzzy\" or \"hairy\" texture — at this point, they may not be able to sting, but hand coverings are still a good idea. As the plant grows, it will reach three to six feet high within a few months. Look for the following telltale features:\nA thick covering of small, hollow needle-like stingers (careful — you don't want to touch these). Large, heart-shaped leaves with a serrated (jagged) edge. The leaves are attached to the central stem with small stalks. The narrow ends of the hearts point outward from the central stem. A \"twin\" pattern to the leaves. In other words, one leaf points to 12 o'clock and another at the same level points to 6 o'clock. The next set points to 3 o'clock and 9 o'clock. The next points to 12 and 6 again, and so on. Leaves that get bigger as they get closer to the ground."
        },
        {
          "headline":"Wear protective clothing as you pick.",
          "description":"As their name suggests, stinging nettles can be rather painful if you try to pick them unprepared. Their small, hollow stingers are quite sharp and work by injecting painful chemicals like formic acid into the skin, so you do not want to touch them. The stingers can even penetrate light fabrics, so wear a thick pair of jeans, close-toed shoes (boots are better), and multiple layers on your upper body to protect yourself. Gloves are also a must. Thick, sturdy gardening gloves are best, but even these don't always offer perfect protection, so handle the nettles gently."
        },
        {
          "headline":"Cut the stem and leaves.",
          "description":"Find a plant that is a healthy, vibrant green color. Use a set of scissors or garden clippers to cut off a section the plant at the stem. Put the severed section carefully into a sturdy canvas or plastic sack. Some experts recommend the top leaves for their more tender texture. If you grab the plant, know that the stingers point from the base of the leaves to the tip, so you're most likely to get stung if you rub against the grain. Some people use the roots for homeopathy/natural medicine, but, for the purposes of this article, we'll focus on the stem and leaves, which are eaten as food."
        },
        {
          "headline":"If you get stung, use topical pain relief.",
          "description":"Sooner or later, you're practically bound to get stung while picking nettles. Don't worry — the sting causes moderate pain and sometimes itching, but it's not excruciating. While you may be comfortable simply waiting for the sting to subside on its own after a few hours, you can also apply a topical ointment or take a few over-the-counter painkillers to dull the pain. See our article on nettle stings for a variety of DIY sting remedies. If you're in the wilderness without any pain-relieving supplies, you can try making a poultice from jewelweed, which also works well for poison ivy. See this page for more info."
        },
        {
          "headline":"Use ethical harvesting practices.",
          "description":"It's important to show respect for mother nature whenever you're picking plants for your own consumption. Use the following easy tips to minimize your environmental impact and ensure that plenty of nettles will remain for other organisms. Only harvest as much as you need. Keep in mind that nettles wilt and shrink when cooked (like spinach), but they tend to be quite filling. Make a clean cut and only harvest about 1/3 of each plant so that they may heal and recover. Try to harvest only about 1/20 of each nettle patch. Harvest from the \"middle\" of the patch. Leave the biggest, best plants and the smallest, weakest ones."
        }
      ]
    }
  ],
  "text":" Blanching Nettles Chop the nettles into medium-sized pieces. Use a kitchen knife or a set of shears to divide the stalks into sections that include roughly one leaf plus part of the stem. Both the leaves and the stem are safe for eating. Don't forget your gloves while you work — the nettles can still sting you. While you do this, set a pot of salted water on the stove over high heat. This will save time when you're waiting for it to boil in the next step. Blanch the nettles in boiling water. When the salted water reaches a steady boil, transfer the nettle pieces into the pot. Your goal here is to \"blanch\" the nettles — boil them for a short time — so that their stingers are inactivated. This does not take very long — usually less than a minute. However, since the consequences for failure can be painful, some sources recommend blanching for up to five minutes. If you like, you can save the blanching water to use as a tea (see \"Serving Ideas\" below). \"Shock\" the nettles with an ice bath. Pour the blanched nettles into a pasta strainer. As soon as the hot water drains, use a set of tongs or a serving spoon to transfer them into a bowl filled with very cold ice water (ideally mostly ice). This technique (known as \"shocking\") stops the cooking process immediately. This is important to prevent the nettles from over-cooking, which can give them a texture that's a little too soft. Drain the nettles and allow them to dry. As soon as the nettles are cold, you can transfer them out of the ice bath and back into the strainer. Toss them gently to drain the water, then let them sit for five minutes to dry somewhat. Use the nettles immediately or freeze to store. At this point, your vegetables are completely ready to eat. You can enjoy them as-is or use them in your favorite recipe the same way you'd use greens like spinach, arugula, and so on. If you want to store them, pack them in an airtight container before tossing them in the freezer. There's no \"wrong\" way to eat nettles, but in the section below, we've provided a few recipe ideas. Feel free to get creative and make your own! Serving Ideas Serve pan-sauteed. Just like spinach and collard greens, nettles can be simply prepared in a pan to make a nutritious side dish. See below:\nHeat butter in a frying pan. Toss in a few cloves of garlic and fry them for a few minutes. When the garlic aroma is strong and the cloves are starting to brown, toss in a heaping handful of (chopped but unblanched) nettles. Use tongs or gloves to avoid stings! Continue frying for a few minutes until the nettles are completely wilted and slightly browned. Season with salt and pepper to taste. Voila! A world-class, dinner-ready dish. Use as garnish or salad for your main course. Nettles are great on their own, but they're also good for adding roughage and texture to other dishes. For instance, try this easy garnish recipe that's great for steaks or other pieces of meat:\nBlanch or sauté nettles (as above) to remove the stings. Season warm nettles with butter, salt, and pepper. Toss the wilted nettles on top of a steak for a new spin on a classic dish. Alternatively, serve the nettles on the side tossed with other sweet, soft, cooked vegetables like carrot for a vegetarian side salad. Add to doughs for nutrition and flavor. If you've ever seen green pasta or tortillas, you've seen foods that have had spinach or kale added to the dough. You can do the same thing with nettles:\nPulse a handful of blanched nettles in a food processor to make a smooth paste. Add the nettles to the dough with the other wet ingredients (egg, milk, etc.). Continue the recipe as normal — you can add a small amount of extra flour if the dough is too moist. You can do this for basically any bread product — pasta, tortillas, bread, crackers, and much more. Make a nettle pesto. Though it's most famously made with basil, you can make pesto with virtually any greens. See below for an easy nettle recipe:\nPulse blanched nettles, walnuts (or pine nuts), olive oil, garlic, and parmesan cheese in food processor. Continue until you reach a smooth, even consistency. Use the pesto as a creamy, decadent sauce that's great for pastas or dipping. One great recipe is available here. You can also substitute blanched nettles for basil in WikiHow's pesto recipe. Pesto will turn brown when exposed to air, but this doesn't make it unsafe to eat as long as you store it in the fridge. To avoid this, cover the pesto with a layer of olive oil to prevent air from touching it. Keep the blanching water for nettle tea. As noted above, the water from blanching the nettles can be kept as a tea. You may drink it immediately or filter it through a sieve to remove any lingering nettle bits. Sweeten with cream and sugar or drink plain for a zero-calorie treat. This tea won't provide any caffeine, but it's great as a relaxing drink later in the day. Picking Nettles in the Wild Know when and where to look for nettles. Nettles tend to grow in temperate areas where they can get plenty of sunlight. They are common along riverbanks and at the edge of woods. They also grow well near manmade features like ditches, train tracks, old farmland, and empty lots. They can be picked as soon as they appear in early spring (sometimes as early as January) until when they flower in the mid to late summer (June-September). This page contains a map showing the approximate habitat of nettles around the world. Learn how to identify nettles in the wild. Nettles start out as small, green, leafy sprouts in the spring with a \"fuzzy\" or \"hairy\" texture — at this point, they may not be able to sting, but hand coverings are still a good idea. As the plant grows, it will reach three to six feet high within a few months. Look for the following telltale features:\nA thick covering of small, hollow needle-like stingers (careful — you don't want to touch these). Large, heart-shaped leaves with a serrated (jagged) edge. The leaves are attached to the central stem with small stalks. The narrow ends of the hearts point outward from the central stem. A \"twin\" pattern to the leaves. In other words, one leaf points to 12 o'clock and another at the same level points to 6 o'clock. The next set points to 3 o'clock and 9 o'clock. The next points to 12 and 6 again, and so on. Leaves that get bigger as they get closer to the ground. Wear protective clothing as you pick. As their name suggests, stinging nettles can be rather painful if you try to pick them unprepared. Their small, hollow stingers are quite sharp and work by injecting painful chemicals like formic acid into the skin, so you do not want to touch them. The stingers can even penetrate light fabrics, so wear a thick pair of jeans, close-toed shoes (boots are better), and multiple layers on your upper body to protect yourself. Gloves are also a must. Thick, sturdy gardening gloves are best, but even these don't always offer perfect protection, so handle the nettles gently. Cut the stem and leaves. Find a plant that is a healthy, vibrant green color. Use a set of scissors or garden clippers to cut off a section the plant at the stem. Put the severed section carefully into a sturdy canvas or plastic sack. Some experts recommend the top leaves for their more tender texture. If you grab the plant, know that the stingers point from the base of the leaves to the tip, so you're most likely to get stung if you rub against the grain. Some people use the roots for homeopathy/natural medicine, but, for the purposes of this article, we'll focus on the stem and leaves, which are eaten as food. If you get stung, use topical pain relief. Sooner or later, you're practically bound to get stung while picking nettles. Don't worry — the sting causes moderate pain and sometimes itching, but it's not excruciating. While you may be comfortable simply waiting for the sting to subside on its own after a few hours, you can also apply a topical ointment or take a few over-the-counter painkillers to dull the pain. See our article on nettle stings for a variety of DIY sting remedies. If you're in the wilderness without any pain-relieving supplies, you can try making a poultice from jewelweed, which also works well for poison ivy. See this page for more info. Use ethical harvesting practices. It's important to show respect for mother nature whenever you're picking plants for your own consumption. Use the following easy tips to minimize your environmental impact and ensure that plenty of nettles will remain for other organisms. Only harvest as much as you need. Keep in mind that nettles wilt and shrink when cooked (like spinach), but they tend to be quite filling. Make a clean cut and only harvest about 1/3 of each plant so that they may heal and recover. Try to harvest only about 1/20 of each nettle patch. Harvest from the \"middle\" of the patch. Leave the biggest, best plants and the smallest, weakest ones.",
  "tyn_model":[
    "nettles",
    "water",
    "garlic",
    "— the",
    "pot",
    "salted water",
    "nettle",
    "ice bath",
    "butter",
    "food processor",
    "— you",
    "basil",
    "olive oil",
    "kitchen knife",
    "shears",
    "stove",
    "— boil",
    "— so",
    "— usually",
    "blanching water",
    "serving spoon",
    "bowl",
    "ice water",
    "strainer",
    "vegetables",
    "arugula",
    "airtight container",
    "pan",
    "frying pan",
    "salt and pepper",
    "salt",
    "pepper",
    "steak",
    "carrot",
    "tortillas",
    "egg",
    "milk",
    "flour",
    "— pasta",
    "nettle pesto",
    "pesto",
    "walnuts",
    "pine nuts",
    "parmesan cheese",
    "nettle tea",
    "sieve",
    "cream",
    "sugar",
    "— at",
    "stinging nettles",
    "formic acid",
    "gloves",
    "gardening gloves",
    "scissors",
    "garden clippers",
    "natural medicine",
    "topical ointment",
    "nettle stings",
    "poison ivy",
    "plants",
    "spinach"
  ],
  "tyn_section":[

  ]
}