{
  "title":"How to Play the Card Game Called Mau",
  "url":"https://www.wikihow.com/Play-the-Card-Game-Called-Mau",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games",
    "Shedding Card Games"
  ],
  "methods":[
    {
      "name":"Rules",
      "steps":[
        {
          "headline":"Find at least three people to play.",
          "description":"You can play with two people but the game is more interesting the more people who participate. The object of the game is to get rid of all your cards."
        },
        {
          "headline":"Pick one person to deal the cards, this person will be known as the chairman.",
          "description":"During this time, you are not allowed to touch your cards until the chairman calls \"Mau\" if you touch the cards will get an extra card."
        },
        {
          "headline":"Once the dealer deals all the card and calls \"Mau\" they will flip the first card and the game will proceed clockwise.",
          "description":""
        }
      ]
    },
    {
      "name":"Game Play",
      "steps":[
        {
          "headline":"Though out the game the dealer or \"the Chairman\" is in charge.",
          "description":"They can penalize you for not addressing them as Chairman, not saying thank you when you receive a card, talking, etc. However they must do the same things for each person."
        },
        {
          "headline":"During the course of the game, if a 7 is played, the player of the card must say, \"Have a Nice Day.\"",
          "description":"If a person wants to pause the game, they must call out \"Point of Order\", or \"PofO (Pevo)\". If anyone touches their cards before the person who called the PofO says, \"End PofO\", then that person or person(s) get a penalty for touching their cards during a Point of Order."
        },
        {
          "headline":"No one is allowed to talk during the game.",
          "description":"If they do, they will get a penalty for talking. Only during point of order(S)and you MUST end the point of order."
        },
        {
          "headline":"All penalties are worth one card per penalty.",
          "description":"Penalties can be repeated."
        },
        {
          "headline":"The winner of each game may create a new rule that the other players must figure out.",
          "description":""
        },
        {
          "headline":"If an ace is played, it skips the next person.",
          "description":"If two eights are played on top of each other you must slap the deck. When a two is played, it is a reverse. When a queen is played, bow your head. When a king is played say \"All hail the great chairman of mau.\""
        }
      ]
    }
  ],
  "text":" Rules Find at least three people to play. You can play with two people but the game is more interesting the more people who participate. The object of the game is to get rid of all your cards. Pick one person to deal the cards, this person will be known as the chairman. During this time, you are not allowed to touch your cards until the chairman calls \"Mau\" if you touch the cards will get an extra card. Once the dealer deals all the card and calls \"Mau\" they will flip the first card and the game will proceed clockwise.  Game Play Though out the game the dealer or \"the Chairman\" is in charge. They can penalize you for not addressing them as Chairman, not saying thank you when you receive a card, talking, etc. However they must do the same things for each person. During the course of the game, if a 7 is played, the player of the card must say, \"Have a Nice Day.\" If a person wants to pause the game, they must call out \"Point of Order\", or \"PofO (Pevo)\". If anyone touches their cards before the person who called the PofO says, \"End PofO\", then that person or person(s) get a penalty for touching their cards during a Point of Order. No one is allowed to talk during the game. If they do, they will get a penalty for talking. Only during point of order(S)and you MUST end the point of order. All penalties are worth one card per penalty. Penalties can be repeated. The winner of each game may create a new rule that the other players must figure out.  If an ace is played, it skips the next person. If two eights are played on top of each other you must slap the deck. When a two is played, it is a reverse. When a queen is played, bow your head. When a king is played say \"All hail the great chairman of mau.\"",
  "tyn_model":[
    "cards",
    "dealer",
    "deck"
  ],
  "tyn_section":[

  ]
}