{
  "title":"How to Bake Pink Lemonade Cupcakes",
  "url":"https://www.wikihow.com/Bake-Pink-Lemonade-Cupcakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Cupcakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350 °F (177 °C).",
      "description":""
    },
    {
      "headline":"Line a  12-cup cupcake/muffin pan, place twelve paper cups for the cupcakes.",
      "description":""
    },
    {
      "headline":"Sift dry ingredients into a large bowl.",
      "description":""
    },
    {
      "headline":"Add the canola oil, rice milk, and vanilla extract and mix thoroughly.",
      "description":""
    },
    {
      "headline":"Add the red food coloring and mix thoroughly so the color is evenly mixed into the batter.",
      "description":""
    },
    {
      "headline":"Add the lemon juice and zest and mix together until just combined.",
      "description":"The batter will bubble and fluff up while you mix."
    },
    {
      "headline":"Divide the batter into the cups - aim to fill them about 2/3 to 3/4 full.",
      "description":""
    },
    {
      "headline":"Bake in the preheated oven 15 to 20 minutes until a toothpick inserted in center comes out clean.",
      "description":""
    },
    {
      "headline":"Let cupcakes cool before frosting them.",
      "description":""
    },
    {
      "headline":"Frosting: Mix together the lemon juice and powdered sugar until you have the desired consistency for your frosting.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350 °F (177 °C).  Line a  12-cup cupcake/muffin pan, place twelve paper cups for the cupcakes.  Sift dry ingredients into a large bowl.  Add the canola oil, rice milk, and vanilla extract and mix thoroughly.  Add the red food coloring and mix thoroughly so the color is evenly mixed into the batter.  Add the lemon juice and zest and mix together until just combined. The batter will bubble and fluff up while you mix. Divide the batter into the cups - aim to fill them about 2/3 to 3/4 full.  Bake in the preheated oven 15 to 20 minutes until a toothpick inserted in center comes out clean.  Let cupcakes cool before frosting them.  Frosting: Mix together the lemon juice and powdered sugar until you have the desired consistency for your frosting. ",
  "tyn_model":[
    "oven",
    "cupcake/muffin pan",
    "large bowl",
    "canola oil",
    "rice milk",
    "vanilla extract",
    "red food coloring",
    "lemon",
    "cupcakes",
    "lemon juice",
    "powdered sugar"
  ],
  "tyn_section":[

  ]
}