{
  "title":"How to Put Raked Leaves Into a Yard Bag by Yourself",
  "url":"https://www.wikihow.com/Put-Raked-Leaves-Into-a-Yard-Bag-by-Yourself",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "steps":[
    {
      "headline":"Fill the bag with air and hold it with both hands BEHIND your legs.",
      "description":"It will look silly."
    },
    {
      "headline":"Walk up to the pile of leaves and stand with both feet on the edge of the pile, facing the pile.",
      "description":""
    },
    {
      "headline":"Step on the inside lip of the bag with one foot.",
      "description":"The bag will be trailing out behind you."
    },
    {
      "headline":"Step on the inside lip of the bag with the other foot, about 12\" (.3meters) apart.",
      "description":"Lift up on the top edge of the bag so it opens it up."
    },
    {
      "headline":"Use your other hand to stuff leaves from the pile into the bag, between your legs.",
      "description":"It will look kind of like a dog digging a hole."
    },
    {
      "headline":"Use a rake to bring more leaves to you if you run out.",
      "description":"Best to keep that rake beside you as you work."
    },
    {
      "headline":"Tie the bag.",
      "description":""
    }
  ],
  "text":" Fill the bag with air and hold it with both hands BEHIND your legs. It will look silly. Walk up to the pile of leaves and stand with both feet on the edge of the pile, facing the pile.  Step on the inside lip of the bag with one foot. The bag will be trailing out behind you. Step on the inside lip of the bag with the other foot, about 12\" (.3meters) apart. Lift up on the top edge of the bag so it opens it up. Use your other hand to stuff leaves from the pile into the bag, between your legs. It will look kind of like a dog digging a hole. Use a rake to bring more leaves to you if you run out. Best to keep that rake beside you as you work. Tie the bag. ",
  "tyn_model":[
    "bag",
    "leaves",
    "rake"
  ],
  "tyn_section":[

  ]
}