{
  "title":"How to Advertise Effectively on eBay",
  "url":"https://www.wikihow.com/Advertise-Effectively-on-eBay",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "steps":[
    {
      "headline":"Put yourself in the buyer's shoes.",
      "description":"Ask yourself: What would I want to see in that ad? What would make or break the sale for me, as a customer? Make sure you provide that information, every bit of it."
    },
    {
      "headline":"Be honest, be accurate.",
      "description":"Don't call a Used item Brand New or Mint."
    },
    {
      "headline":"Provide all necessary information, including condition, age, brand names and all relevant info.",
      "description":"But keep it tight. Don't go on and on. You are writing an ad, not a novel."
    },
    {
      "headline":"Provide photos.",
      "description":"You don't have to be a pro, just take decent, clear photos. Photos do sell products. Some bidders will only look at the photos."
    },
    {
      "headline":"Consider adding voice and video to your listings.",
      "description":"You can develop trust and rapport with a simple webcam and voice -- just keep it personal and real. Highlight what YOU want the prospective buyer to see. Share details about the product that would otherwise go unnoticed in a flat photograph."
    },
    {
      "headline":"Do your research.",
      "description":"Know what you are selling. Know comparable prices. Start your opening bid with a price you can live with and if you know your price is below other comparable models in similar condition, say so."
    },
    {
      "headline":"Never assume the buyer is an expert and will \"automatically find\" your item.",
      "description":"Explain what makes it special. Is it one of a kind? Is it rare? Is it priced below market value? Whatever sets your item apart should be mentioned."
    },
    {
      "headline":"Use the right keywords.",
      "description":"Be specific. People look for specific items and get frustrated by looking at a ton of unrelated items. Help the right bidder find your item."
    },
    {
      "headline":"Look at completed auctions for similar items and see what titles and keywords caught bidders' eyes and got the highest bids.",
      "description":"Learn from them. Use the same or similar keywords. Again, help direct the bidders who want your item (or ones like it) to your ad."
    },
    {
      "headline":"Group ads for similar items in the same week and stagger the starting times by a day or two.",
      "description":"Tell bidders that you have related items on auction. This will encourage them to look at your other items and up your chances of multiple sales this way. Every related ad you have is just one more chance for a bidder to see all your items."
    }
  ],
  "text":" Put yourself in the buyer's shoes. Ask yourself: What would I want to see in that ad? What would make or break the sale for me, as a customer? Make sure you provide that information, every bit of it. Be honest, be accurate. Don't call a Used item Brand New or Mint. Provide all necessary information, including condition, age, brand names and all relevant info. But keep it tight. Don't go on and on. You are writing an ad, not a novel. Provide photos. You don't have to be a pro, just take decent, clear photos. Photos do sell products. Some bidders will only look at the photos. Consider adding voice and video to your listings. You can develop trust and rapport with a simple webcam and voice -- just keep it personal and real. Highlight what YOU want the prospective buyer to see. Share details about the product that would otherwise go unnoticed in a flat photograph. Do your research. Know what you are selling. Know comparable prices. Start your opening bid with a price you can live with and if you know your price is below other comparable models in similar condition, say so. Never assume the buyer is an expert and will \"automatically find\" your item. Explain what makes it special. Is it one of a kind? Is it rare? Is it priced below market value? Whatever sets your item apart should be mentioned. Use the right keywords. Be specific. People look for specific items and get frustrated by looking at a ton of unrelated items. Help the right bidder find your item. Look at completed auctions for similar items and see what titles and keywords caught bidders' eyes and got the highest bids. Learn from them. Use the same or similar keywords. Again, help direct the bidders who want your item (or ones like it) to your ad. Group ads for similar items in the same week and stagger the starting times by a day or two. Tell bidders that you have related items on auction. This will encourage them to look at your other items and up your chances of multiple sales this way. Every related ad you have is just one more chance for a bidder to see all your items.",
  "tyn_model":[
    "photos",
    "webcam"
  ],
  "tyn_section":[

  ]
}