{
  "title":"How to Make Peanut Butter Chocolate Oatmeal Bars",
  "url":"https://www.wikihow.com/Make-Peanut-Butter-Chocolate-Oatmeal-Bars",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Bars and Slices"
  ],
  "steps":[
    {
      "headline":"Spray a 10 x 6 or 11 x 7-inch baking pan with nonstick cooking spray.",
      "description":""
    },
    {
      "headline":"Add quick oats and margarine to a 1-quart microwave-safe bowl.",
      "description":""
    },
    {
      "headline":"Microwave at 80%, uncovered, 3 to 4 minutes or until oat mixture is heated through.",
      "description":""
    },
    {
      "headline":"Add corn syrup and brown sugar to oat mixture.",
      "description":"Stir to combine."
    },
    {
      "headline":"Microwave oats and brown sugar at 80% for 1 1/2 to 2 1/2 minutes or until heated through.",
      "description":"Stir once during cooking to make sure the sugar is combined into the oat mixture."
    },
    {
      "headline":"Press oat mixture into prepared pan.",
      "description":""
    },
    {
      "headline":"Add chocolate chips to a microwave-safe 1 cup measuring cup.",
      "description":"Microwave at 80% until chocolate is softened. Stir once during heating."
    },
    {
      "headline":"Remove chocolate chips from microwave oven and stir until smooth.",
      "description":""
    },
    {
      "headline":"Add peanut butter and stir until smooth.",
      "description":""
    },
    {
      "headline":"Spread chocolate mixture over oat mixture.",
      "description":""
    },
    {
      "headline":"Cut into bars.",
      "description":"Chill."
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Spray a 10 x 6 or 11 x 7-inch baking pan with nonstick cooking spray.  Add quick oats and margarine to a 1-quart microwave-safe bowl.  Microwave at 80%, uncovered, 3 to 4 minutes or until oat mixture is heated through.  Add corn syrup and brown sugar to oat mixture. Stir to combine. Microwave oats and brown sugar at 80% for 1 1/2 to 2 1/2 minutes or until heated through. Stir once during cooking to make sure the sugar is combined into the oat mixture. Press oat mixture into prepared pan.  Add chocolate chips to a microwave-safe 1 cup measuring cup. Microwave at 80% until chocolate is softened. Stir once during heating. Remove chocolate chips from microwave oven and stir until smooth.  Add peanut butter and stir until smooth.  Spread chocolate mixture over oat mixture.  Cut into bars. Chill. Enjoy! ",
  "tyn_model":[
    "brown sugar",
    "chocolate chips",
    "baking pan",
    "nonstick cooking spray",
    "quick oats",
    "margarine",
    "1-quart microwave-safe bowl",
    "corn syrup",
    "oats",
    "sugar",
    "microwave-safe 1 cup measuring cup",
    "microwave oven",
    "peanut butter",
    "chocolate",
    "oat"
  ],
  "tyn_section":[

  ]
}