{
  "title":"How to Make Greek Whole Grain Olive Bread",
  "url":"https://www.wikihow.com/Make-Greek-Whole-Grain-Olive-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Vegetable Bread"
  ],
  "steps":[
    {
      "headline":"Add the yeast to the warm water.",
      "description":"Make sure the water is not too hot or it will kill the yeast. Wait ten minutes and then stir in half the flour, add a cup every few minutes, until smooth and blended."
    },
    {
      "headline":"Wait a half hour.",
      "description":""
    },
    {
      "headline":"Then blend in the olive oil and olives.",
      "description":""
    },
    {
      "headline":"Add remaining flour slowly a little at a time.",
      "description":"Add the almond meal to the mixture."
    },
    {
      "headline":"Put the dough on a floured surface and knead until elastic (about 15 minutes).",
      "description":""
    },
    {
      "headline":"Put the dough into a bowl coated with olive oil.",
      "description":"Turn the dough to rub olive oil on all sides."
    },
    {
      "headline":"You can add the olives now, drained, and any optional herbs or spices if you wish.",
      "description":""
    },
    {
      "headline":"For variety, you can add crushed herbs such as fennel, sage, oregano, or minced garlic...adding anything herbal or spicy is optional.",
      "description":"Most popular would be the minced dried garlic, black pepper, or saffron."
    },
    {
      "headline":"Cover and let rise.",
      "description":"The dough will double in size."
    },
    {
      "headline":"Preheat your oven to 450 °F (232 °C).",
      "description":""
    },
    {
      "headline":"Divide the dough into equal-size balls and flatten each piece to look like a pancake.",
      "description":"You're making flat, round pita bread."
    },
    {
      "headline":"Bake on a flat pan or cookie sheet in your oven for 5 to 10 minutes or until the bread puffs up like a balloon.",
      "description":"Look at a supermarket-bought round of pita bread to get an idea of what the puffed up balloon-like bread looks like when it's baked."
    },
    {
      "headline":"Remove from oven and serve warm with a dip made of two tablespoons of mayonnaise and 2 table spoons of lemon juice whipped into a cup of nonfat yogurt to which 1/2 cup of chopped cucumber, 1 tablespoon of chopped mint, and a table#  You also can toast triangles of pita bread in the oven until light brown and eat like chips or use like a spoon to pick up any type of dip.",
      "description":""
    }
  ],
  "text":" Add the yeast to the warm water. Make sure the water is not too hot or it will kill the yeast. Wait ten minutes and then stir in half the flour, add a cup every few minutes, until smooth and blended. Wait a half hour.  Then blend in the olive oil and olives.  Add remaining flour slowly a little at a time. Add the almond meal to the mixture. Put the dough on a floured surface and knead until elastic (about 15 minutes).  Put the dough into a bowl coated with olive oil. Turn the dough to rub olive oil on all sides. You can add the olives now, drained, and any optional herbs or spices if you wish.  For variety, you can add crushed herbs such as fennel, sage, oregano, or minced garlic...adding anything herbal or spicy is optional. Most popular would be the minced dried garlic, black pepper, or saffron. Cover and let rise. The dough will double in size. Preheat your oven to 450 °F (232 °C).  Divide the dough into equal-size balls and flatten each piece to look like a pancake. You're making flat, round pita bread. Bake on a flat pan or cookie sheet in your oven for 5 to 10 minutes or until the bread puffs up like a balloon. Look at a supermarket-bought round of pita bread to get an idea of what the puffed up balloon-like bread looks like when it's baked. Remove from oven and serve warm with a dip made of two tablespoons of mayonnaise and 2 table spoons of lemon juice whipped into a cup of nonfat yogurt to which 1/2 cup of chopped cucumber, 1 tablespoon of chopped mint, and a table#  You also can toast triangles of pita bread in the oven until light brown and eat like chips or use like a spoon to pick up any type of dip. ",
  "tyn_model":[
    "olive oil",
    "oven",
    "pita bread",
    "water",
    "flour",
    "olives",
    "garlic",
    "almond meal",
    "bowl",
    "herbs",
    "sage",
    "oregano",
    "black pepper",
    "saffron",
    "flat pan",
    "cookie sheet",
    "mayonnaise",
    "lemon juice",
    "nonfat yogurt",
    "cucumber",
    "mint",
    "spoon"
  ],
  "tyn_section":[

  ]
}