{
  "title":"How to Make Homemade Peeps",
  "url":"https://www.wikihow.com/Make-Homemade-Peeps",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Marshmallow Treats"
  ],
  "steps":[
    {
      "headline":"Whisk together only 1/2 of the cold water with the 2 packets of unflavored gelatin powder.",
      "description":"After 2-3 minutes of whisking, set the bowl aside."
    },
    {
      "headline":"Before you start to mix anything else, spray your peeps mold pan and set that aside as well.",
      "description":"Find a medium-sized bowl and mix the rest of the 1/4 cup of water, 1/2 cup of light corn syrup, 1 pinch of salt, and the 3/4 cup of white sugar."
    },
    {
      "headline":"Heat the mixture over medium heat until it reaches 240° F.  Then remove it from the heat.",
      "description":"Put it back into the medium-sized bowl and continue to mix (use a mixer)this time you're going to add the mixture of cold water and the 2 packets of gelatin powder together, set the mixer on high and mix for 10-12 minutes, make sure to mix until the mixture is lukewarm and fluffy. take a spoon and fill up the peep molds. (Or if it's easier, use a piping bag if you're going to use a piping bag make sure to scrape the mixture into the piping bag immediately, then fill the molds)."
    },
    {
      "headline":"Let the peeps sit for 10-15 minutes.",
      "description":"After letting them sit, gently and carefully remove the peeps. Use the 1/2 cup of colored sanding sugar to roll the peeps in. To add faces use and melt the 1 tablespoon of chocolate chips, after melting the chocolate chips put the melted chocolate into a small plastic bag, use scissors and cut a small piece off the corner of the bag, (Use the corner of the bag to make the peep's face)."
    },
    {
      "headline":"Serve and enjoy!",
      "description":"A batch of homemade peeps make great Easter/Christmas gifts! Give a thumbs up if it helped!"
    }
  ],
  "text":" Whisk together only 1/2 of the cold water with the 2 packets of unflavored gelatin powder. After 2-3 minutes of whisking, set the bowl aside. Before you start to mix anything else, spray your peeps mold pan and set that aside as well. Find a medium-sized bowl and mix the rest of the 1/4 cup of water, 1/2 cup of light corn syrup, 1 pinch of salt, and the 3/4 cup of white sugar. Heat the mixture over medium heat until it reaches 240° F.  Then remove it from the heat. Put it back into the medium-sized bowl and continue to mix (use a mixer)this time you're going to add the mixture of cold water and the 2 packets of gelatin powder together, set the mixer on high and mix for 10-12 minutes, make sure to mix until the mixture is lukewarm and fluffy. take a spoon and fill up the peep molds. (Or if it's easier, use a piping bag if you're going to use a piping bag make sure to scrape the mixture into the piping bag immediately, then fill the molds). Let the peeps sit for 10-15 minutes. After letting them sit, gently and carefully remove the peeps. Use the 1/2 cup of colored sanding sugar to roll the peeps in. To add faces use and melt the 1 tablespoon of chocolate chips, after melting the chocolate chips put the melted chocolate into a small plastic bag, use scissors and cut a small piece off the corner of the bag, (Use the corner of the bag to make the peep's face). Serve and enjoy! A batch of homemade peeps make great Easter/Christmas gifts! Give a thumbs up if it helped!",
  "tyn_model":[
    "piping bag",
    "gelatin powder",
    "bowl",
    "water",
    "chocolate chips",
    "cold water",
    "peeps mold pan",
    "light corn syrup",
    "salt",
    "white sugar",
    "medium-sized bowl",
    "mixer",
    "spoon",
    "peep molds",
    "colored sanding sugar",
    "chocolate",
    "small plastic bag",
    "scissors"
  ],
  "tyn_section":[

  ]
}