{
  "title":"How to Grill Salmon Fillets",
  "url":"https://www.wikihow.com/Grill-Salmon-Fillets",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Salmon"
  ],
  "methods":[
    {
      "name":"Basic Grilled Salmon",
      "steps":[
        {
          "headline":"Start your grill.",
          "description":"You'll want a medium-hot fire to grill your salmon."
        },
        {
          "headline":"Wash the salmon in cold water and pat it dry.",
          "description":"Cut the fish into meal-sized portions."
        },
        {
          "headline":"Lay the salmon pieces skin side down in the center of a sheet of foil.",
          "description":"Leave plenty of room around the perimeter of each piece of salmon."
        },
        {
          "headline":"Combine the olive oil, lemon juice, pepper and salt in a small bowl.",
          "description":"Brush the mixture over the salmon"
        },
        {
          "headline":"Drizzle the salmon with maple syrup.",
          "description":""
        },
        {
          "headline":"Oil the surface of your grill.",
          "description":"Lay the foil containing the salmon pieces on top of the grill rack."
        },
        {
          "headline":"Cook the salmon for 10 minutes per inch of thickness.",
          "description":"Check the salmon with a fork to see if it flakes. Cut into the thickest portion of the salmon with a sharp knife. The flesh should be medium rare but not overcooked."
        },
        {
          "headline":"Remove the foil pieces containing your salmon from the grill and place them on a cutting board.",
          "description":"Allow the fish to rest for 10 minutes before removing the pieces from the foil."
        },
        {
          "headline":"Serve your salmon with lemon wedges for extra flavor.",
          "description":""
        }
      ]
    },
    {
      "name":"Cedar Plank Salmon",
      "steps":[
        {
          "headline":"Soak a cedar plank in water for 30 minutes to 2 hours.",
          "description":"You can also use a plank made of alder or oak."
        },
        {
          "headline":"Preheat the grill to medium-high.",
          "description":""
        },
        {
          "headline":"Pat the plank dry with paper towels.",
          "description":"Spray the top side of the plank with cooking spray."
        },
        {
          "headline":"Sprinkle your salmon fillets with salt and pepper.",
          "description":"You want to keep the seasonings simple so that you don't overwhelm the flavor from the cedar plank."
        },
        {
          "headline":"Lay the whole salmon fillet on the plank.",
          "description":"Make sure that the skin of the salmon comes into contact with the side of the plank that you sprayed with cooking spray."
        },
        {
          "headline":"Place the plank on a portion of your grill that is not directly over the flames.",
          "description":"Close the lid of your grill and turn the heat down to medium."
        },
        {
          "headline":"Check the salmon after 10 minutes.",
          "description":"Continue to check the fillet every 2 minutes or so until the fish flakes easily with a fork."
        },
        {
          "headline":"Remove the plank from the grill.",
          "description":"Use the plank as a serving platter for your salmon."
        }
      ]
    }
  ],
  "text":" Basic Grilled Salmon Start your grill. You'll want a medium-hot fire to grill your salmon. Wash the salmon in cold water and pat it dry. Cut the fish into meal-sized portions. Lay the salmon pieces skin side down in the center of a sheet of foil. Leave plenty of room around the perimeter of each piece of salmon. Combine the olive oil, lemon juice, pepper and salt in a small bowl. Brush the mixture over the salmon Drizzle the salmon with maple syrup.  Oil the surface of your grill. Lay the foil containing the salmon pieces on top of the grill rack. Cook the salmon for 10 minutes per inch of thickness. Check the salmon with a fork to see if it flakes. Cut into the thickest portion of the salmon with a sharp knife. The flesh should be medium rare but not overcooked. Remove the foil pieces containing your salmon from the grill and place them on a cutting board. Allow the fish to rest for 10 minutes before removing the pieces from the foil. Serve your salmon with lemon wedges for extra flavor.  Cedar Plank Salmon Soak a cedar plank in water for 30 minutes to 2 hours. You can also use a plank made of alder or oak. Preheat the grill to medium-high.  Pat the plank dry with paper towels. Spray the top side of the plank with cooking spray. Sprinkle your salmon fillets with salt and pepper. You want to keep the seasonings simple so that you don't overwhelm the flavor from the cedar plank. Lay the whole salmon fillet on the plank. Make sure that the skin of the salmon comes into contact with the side of the plank that you sprayed with cooking spray. Place the plank on a portion of your grill that is not directly over the flames. Close the lid of your grill and turn the heat down to medium. Check the salmon after 10 minutes. Continue to check the fillet every 2 minutes or so until the fish flakes easily with a fork. Remove the plank from the grill. Use the plank as a serving platter for your salmon.",
  "tyn_model":[
    "grill",
    "salmon",
    "foil",
    "water",
    "fork",
    "cedar plank",
    "cooking spray",
    "olive oil",
    "lemon juice",
    "pepper",
    "salt",
    "maple syrup",
    "grill rack",
    "sharp knife",
    "lemon wedges",
    "cedar plank salmon",
    "paper towels",
    "salt and pepper"
  ],
  "tyn_section":[

  ]
}