{
  "title":"How to Make a Chunky Moo Smoothie",
  "url":"https://www.wikihow.com/Make-a-Chunky-Moo-Smoothie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Chocolate Based Shakes"
  ],
  "steps":[
    {
      "headline":"Place a coffee mug in the freezer.",
      "description":"Keep it there for half an hour."
    },
    {
      "headline":"Shake a can of whipped cream, and spray into the mug until full.",
      "description":""
    },
    {
      "headline":"Put an ice cube into the mug.",
      "description":"You can add more if desired."
    },
    {
      "headline":"Add in two teaspoons of chocolate syrup.",
      "description":""
    },
    {
      "headline":"(Optional) Add one teaspoon of  caramel syrup.",
      "description":""
    },
    {
      "headline":"Chop the bananas.",
      "description":"Try to make them as even as possible. Add them to the mug."
    },
    {
      "headline":"Place the finished treat into a freezer or fridge for about 25 minutes.",
      "description":"This will make it to taste as it should."
    },
    {
      "headline":"Take the treat out of the freezer, and eat with a spoon.",
      "description":"This treat is high-caloried, so please do not eat this if you are trying to watch your weight."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Place a coffee mug in the freezer. Keep it there for half an hour. Shake a can of whipped cream, and spray into the mug until full.  Put an ice cube into the mug. You can add more if desired. Add in two teaspoons of chocolate syrup.  (Optional) Add one teaspoon of  caramel syrup.  Chop the bananas. Try to make them as even as possible. Add them to the mug. Place the finished treat into a freezer or fridge for about 25 minutes. This will make it to taste as it should. Take the treat out of the freezer, and eat with a spoon. This treat is high-caloried, so please do not eat this if you are trying to watch your weight. Finished. ",
  "tyn_model":[
    "coffee mug",
    "whipped cream",
    "ice cube",
    "chocolate syrup",
    "caramel syrup",
    "bananas",
    "mug",
    "freezer or fridge",
    "freezer",
    "spoon"
  ],
  "tyn_section":[

  ]
}