{
  "title":"How to Make Char Siu (Cha Shao)",
  "url":"https://www.wikihow.com/Make-Char-Siu-(Cha-Shao)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Chinese Dishes"
  ],
  "steps":[
    {
      "headline":"Remove the skin from the pork belly",
      "description":""
    },
    {
      "headline":"Use a tenderizer to tenderize the pork all over.",
      "description":"Set aside."
    },
    {
      "headline":"Grind the ginger and shallots, separate the juice out",
      "description":""
    },
    {
      "headline":"Create a marinade.",
      "description":"In a bowl, combine the ginger & shallot juice, the oyster sauce, light and dark soy sauce, hoisin sauce, the Rose Wine \"Mui Fa Lo Chau\", the cubes of Lam Yues (fermented bean curd), 1/4 cup honey, 5 spice, Cinnamon, . Mix until well blended."
    },
    {
      "headline":"Marinate the pork in the refrigerator overnight.",
      "description":""
    },
    {
      "headline":"Pre-heat the oven to 250 °C (482 °F).",
      "description":"(If you have a grill set, use it)"
    },
    {
      "headline":"Lay the pork on a greased rack and spread foil on the bottom for easier cleaning.",
      "description":""
    },
    {
      "headline":"Grill the pork for 5 minutes max on both sides (10 minutes total), take it out, glaze it with a mixture of 1/4 cup of honey mix with 1 tablespoon of dark soy sauce and 1/2 teaspoon of light soy sauce.",
      "description":"Put it back to the oven of grill set for another 10 minutes, take it out and glaze it again with the honey/dark soy sauce mixture, put it back again. Repeat this until 30 minutes max."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Remove the skin from the pork belly  Use a tenderizer to tenderize the pork all over. Set aside. Grind the ginger and shallots, separate the juice out  Create a marinade. In a bowl, combine the ginger & shallot juice, the oyster sauce, light and dark soy sauce, hoisin sauce, the Rose Wine \"Mui Fa Lo Chau\", the cubes of Lam Yues (fermented bean curd), 1/4 cup honey, 5 spice, Cinnamon, . Mix until well blended. Marinate the pork in the refrigerator overnight.  Pre-heat the oven to 250 °C (482 °F). (If you have a grill set, use it) Lay the pork on a greased rack and spread foil on the bottom for easier cleaning.  Grill the pork for 5 minutes max on both sides (10 minutes total), take it out, glaze it with a mixture of 1/4 cup of honey mix with 1 tablespoon of dark soy sauce and 1/2 teaspoon of light soy sauce. Put it back to the oven of grill set for another 10 minutes, take it out and glaze it again with the honey/dark soy sauce mixture, put it back again. Repeat this until 30 minutes max. Finished. ",
  "tyn_model":[
    "honey",
    "ginger",
    "soy sauce",
    "oven",
    "grill",
    "dark soy sauce",
    "shallots",
    "shallot",
    "oyster sauce",
    "hoisin sauce",
    "rose wine",
    "fermented bean curd",
    "5 spice",
    "cinnamon",
    "refrigerator",
    "foil"
  ],
  "tyn_section":[

  ]
}