{
  "title":"How to Make Pesto Tortellini",
  "url":"https://www.wikihow.com/Make-Pesto-Tortellini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Pasta Salads"
  ],
  "steps":[
    {
      "headline":"Chop up the bacon to small pieces and fry them in a small pan until crisp.",
      "description":"Transfer them on paper towels and blot off the fat. Set the bacon pieces on the side."
    },
    {
      "headline":"Boil the tortellini as directed (on the package or box) and drain in a colander.",
      "description":""
    },
    {
      "headline":"Dice the onion and sweat it in a pan with the olive oil until the onion slices are translucent in color.",
      "description":""
    },
    {
      "headline":"Add the bacon, tortellini, pesto, and heavy cream in the pan.",
      "description":"Stir well until the pesto covers the tortellini evenly. If you work fast, all of the ingredients should still be warm, which helps spread the pesto paste."
    },
    {
      "headline":"Add the avocado pieces and tomatoes.",
      "description":"Mix carefully so that you don't destroy the avocados."
    },
    {
      "headline":"Serve the dish hot.",
      "description":""
    }
  ],
  "text":" Chop up the bacon to small pieces and fry them in a small pan until crisp. Transfer them on paper towels and blot off the fat. Set the bacon pieces on the side. Boil the tortellini as directed (on the package or box) and drain in a colander.  Dice the onion and sweat it in a pan with the olive oil until the onion slices are translucent in color.  Add the bacon, tortellini, pesto, and heavy cream in the pan. Stir well until the pesto covers the tortellini evenly. If you work fast, all of the ingredients should still be warm, which helps spread the pesto paste. Add the avocado pieces and tomatoes. Mix carefully so that you don't destroy the avocados. Serve the dish hot. ",
  "tyn_model":[
    "bacon",
    "tortellini",
    "pesto",
    "small pan",
    "paper towels",
    "colander",
    "onion",
    "pan",
    "olive oil",
    "heavy cream",
    "avocado",
    "tomatoes",
    "avocados"
  ],
  "tyn_section":[

  ]
}