{
  "title":"How to Put Out Electrical Fires",
  "url":"https://www.wikihow.com/Put-Out-Electrical-Fires",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Staying Safe",
      "steps":[
        {
          "headline":"Call emergency services.",
          "description":"If a fire is developing and you cannot get the electricity turned off or it is growing rapidly, call the fire department. Even after you call you may be able to get it out yourself, but it is better to be safe than sorry when it comes to a fire. In general, firefighters will be better equipped to fight a fire that has live electricity in the mix than you will be. Tell the person you talk to that you are dealing with an electrical fire, so that the firefighters know what they are getting into. Even if a fire is small, calling the fire department will ensure that if the fire grows, you will have help on the way."
        },
        {
          "headline":"Make sure you can safely evacuate.",
          "description":"Before attempting to put out an electrical fire yourself, it's important to know you can get out of the area safely. If you can see 2 paths to safety from where you would be located to fight the fire, then it's reasonable to stay and fight the fire. If you can only see 1 escape route, you should take it and let the fire department fight the fire. It is better to stay safe than risk getting trapped in a fire. Having 2 escape routes allows you to fight the fire until it is out or until 1 of the escape routes is blocked by fire or debris. Once 1 of the 2 is blocked, it is time to evacuate. Escape routes typically include doors and windows that you can easily pass through to the outside. A window that is many stories above the ground would not be a great escape route, while a first-floor window would."
        },
        {
          "headline":"Evacuate, if necessary.",
          "description":"If at any time you begin to feel unsafe, an exit gets blocked, you get burned, you start to breathe in smoke, or your fire-fighting techniques are not working, abandon your efforts and get out of the building. Your safety is more important than belongings or buildings. Close doors behind you as you leave. This will help keep the fire as contained as possible."
        }
      ]
    },
    {
      "name":"Disconnecting the Electricity",
      "steps":[
        {
          "headline":"Unplug appliances that are on fire.",
          "description":"If you have an electrical fire that has started in an appliance that plugs in, such as a toaster, you should immediately unplug it. Make sure that you can get to the wall socket or extension cord safely and then disconnect it from the outlet. Unplugging an appliance that is on fire will reduce the risk of the fire spreading beyond the appliance. Many electrical fires start at overloaded appliances. For instance, if there is a short in your toaster, it can produce enough heat to start a fire. Another example is when too many Christmas lights are plugged into each other, it can create enough heat to start a fire."
        },
        {
          "headline":"Turn off the electricity.",
          "description":"If you have an electrical fire that is in a wall or in an appliance that you can't get to to unplug, focus on getting the power turned off. If you can safely get to the electrical switch or the electrical panel, go there and kill the power. Disconnecting the power will eliminate the risk of electrocution, will eliminate the heat source that started the fire, and will allow you to fight the fire with a wider array of fire-fighting techniques. If you cannot get to a location to shut off the power safely, don't attempt it. It is better to stay safe and fight the fire with the power on than to risk getting burned or electrocuted trying to turn the power off."
        },
        {
          "headline":"Be certain that the electrical disconnect is out of reach.",
          "description":"Once a fire has started, electricity can continue to create heat that will encourage the fire to continue. Electricity will also make the fire harder to fight, because you have to be careful not to get shocked, in addition to avoiding getting burned. With this in mind, make sure there is no safe way to get to the electrical disconnect before giving up and fighting the fire while it is still electrified. If you have an appliance fire where the appliance can't be unplugged, go turn off the power at the breaker box. Whatever you can do safely to remove the electricity from the situation, do it."
        }
      ]
    },
    {
      "name":"Putting Out an Electrical Fire With the Power Still On",
      "steps":[
        {
          "headline":"Never use water on an electrical fire.",
          "description":"If you cannot turn off the electricity and the area that is on fire is still energized, the last thing you want to do it pour water on it. Water will conduct the electricity that caused the fire, creating an electrocution hazard in addition to the fire hazard. If you are unsure whether a fire has been caused by live electricity or something else, err on the side of caution and don't use water."
        },
        {
          "headline":"Smother a small fire with baking soda.",
          "description":"If you can't disconnect an appliance or cord that is smoldering, cover the whole area in baking soda. This will block the oxygen that the fire needs to keep burning while not creating an electrocution hazard like water would. Do not use flammable items to smother an electrical fire, such as a blanket. With live electricity involved, flammable items you use could easily start burning."
        },
        {
          "headline":"Use only a class C or ABC fire extinguisher.",
          "description":"The type of fire extinguisher you can use on a live electrical fire is very specific. An electrical fire is known as a Class C fire, and so requires a Class C fire extinguisher. A fire extinguisher marked ABC is also acceptable, as it's capable of stopping fires caused by wood/trash, liquids, and electrical equipment. Many fire extinguishers made for home use are ABC extinguishers. Other types of extinguishers could create an electrocution hazard if used on an electrical fire because they contain liquids or chemicals that conduct electricity."
        },
        {
          "headline":"Use the fire extinguisher properly.",
          "description":"In the moment of an emergency, it can be hard to remember how to operate a fire extinguisher. To make that easier, remember the term PASS and what each letter stands for:\nP - PULL the silver safety pin on the handle of the extinguisher. A - AIM the hose and nozzle of the extinguisher at the fire. S - SQUEEZE the handle of the fire extinguisher slowly. S - SWEEP from left to right, making sure to get every part of the fire."
        },
        {
          "headline":"Disconnect the electricity when possible.",
          "description":"Once the fire is under control enough to safely get to the electrical panel or the outlet, disconnect the power. This will help ensure that the fire is not reignited by electricity and that the risk of electrocution is eliminated."
        }
      ]
    },
    {
      "name":"Putting Out an Electrical Fire Once the Power is Off",
      "steps":[
        {
          "headline":"Use a fire extinguisher if you have one available.",
          "description":"If you have turned off the electricity and there is a fire extinguisher nearby, spray it on the fire. It doesn't matter what kind of extinguisher you use on a fire that has no live electricity around it."
        },
        {
          "headline":"Use a fire blanket or other thick blanket to smother the fire.",
          "description":"If you don't have an extinguisher but you do have a fire blanket, use it to smother the fire. By covering a small fire you are eliminating much of the oxygen the fire needs to keep going. With quick action, a fire blanket or other thick blanket can be used to put a small fire out completely."
        },
        {
          "headline":"Douse the fire with water.",
          "description":"You need to be absolutely sure that the electricity is turned off before putting water on a fire. If you are sure, spray or dump water on the fire and nearby areas that are likely to become ignited. The moisture will put out active flames and will reduce the risk of the fire growing. Water on an electrified fire can create an electrocution hazard, in addition to the fire hazard. If the fuel for the fire you are fighting is kerosene, oil, or another liquid fuel, be careful putting water on it. The water can pick up the fuel and move it to another area where it can then ignite and spread the fire."
        }
      ]
    }
  ],
  "text":" Staying Safe Call emergency services. If a fire is developing and you cannot get the electricity turned off or it is growing rapidly, call the fire department. Even after you call you may be able to get it out yourself, but it is better to be safe than sorry when it comes to a fire. In general, firefighters will be better equipped to fight a fire that has live electricity in the mix than you will be. Tell the person you talk to that you are dealing with an electrical fire, so that the firefighters know what they are getting into. Even if a fire is small, calling the fire department will ensure that if the fire grows, you will have help on the way. Make sure you can safely evacuate. Before attempting to put out an electrical fire yourself, it's important to know you can get out of the area safely. If you can see 2 paths to safety from where you would be located to fight the fire, then it's reasonable to stay and fight the fire. If you can only see 1 escape route, you should take it and let the fire department fight the fire. It is better to stay safe than risk getting trapped in a fire. Having 2 escape routes allows you to fight the fire until it is out or until 1 of the escape routes is blocked by fire or debris. Once 1 of the 2 is blocked, it is time to evacuate. Escape routes typically include doors and windows that you can easily pass through to the outside. A window that is many stories above the ground would not be a great escape route, while a first-floor window would. Evacuate, if necessary. If at any time you begin to feel unsafe, an exit gets blocked, you get burned, you start to breathe in smoke, or your fire-fighting techniques are not working, abandon your efforts and get out of the building. Your safety is more important than belongings or buildings. Close doors behind you as you leave. This will help keep the fire as contained as possible. Disconnecting the Electricity Unplug appliances that are on fire. If you have an electrical fire that has started in an appliance that plugs in, such as a toaster, you should immediately unplug it. Make sure that you can get to the wall socket or extension cord safely and then disconnect it from the outlet. Unplugging an appliance that is on fire will reduce the risk of the fire spreading beyond the appliance. Many electrical fires start at overloaded appliances. For instance, if there is a short in your toaster, it can produce enough heat to start a fire. Another example is when too many Christmas lights are plugged into each other, it can create enough heat to start a fire. Turn off the electricity. If you have an electrical fire that is in a wall or in an appliance that you can't get to to unplug, focus on getting the power turned off. If you can safely get to the electrical switch or the electrical panel, go there and kill the power. Disconnecting the power will eliminate the risk of electrocution, will eliminate the heat source that started the fire, and will allow you to fight the fire with a wider array of fire-fighting techniques. If you cannot get to a location to shut off the power safely, don't attempt it. It is better to stay safe and fight the fire with the power on than to risk getting burned or electrocuted trying to turn the power off. Be certain that the electrical disconnect is out of reach. Once a fire has started, electricity can continue to create heat that will encourage the fire to continue. Electricity will also make the fire harder to fight, because you have to be careful not to get shocked, in addition to avoiding getting burned. With this in mind, make sure there is no safe way to get to the electrical disconnect before giving up and fighting the fire while it is still electrified. If you have an appliance fire where the appliance can't be unplugged, go turn off the power at the breaker box. Whatever you can do safely to remove the electricity from the situation, do it. Putting Out an Electrical Fire With the Power Still On Never use water on an electrical fire. If you cannot turn off the electricity and the area that is on fire is still energized, the last thing you want to do it pour water on it. Water will conduct the electricity that caused the fire, creating an electrocution hazard in addition to the fire hazard. If you are unsure whether a fire has been caused by live electricity or something else, err on the side of caution and don't use water. Smother a small fire with baking soda. If you can't disconnect an appliance or cord that is smoldering, cover the whole area in baking soda. This will block the oxygen that the fire needs to keep burning while not creating an electrocution hazard like water would. Do not use flammable items to smother an electrical fire, such as a blanket. With live electricity involved, flammable items you use could easily start burning. Use only a class C or ABC fire extinguisher. The type of fire extinguisher you can use on a live electrical fire is very specific. An electrical fire is known as a Class C fire, and so requires a Class C fire extinguisher. A fire extinguisher marked ABC is also acceptable, as it's capable of stopping fires caused by wood/trash, liquids, and electrical equipment. Many fire extinguishers made for home use are ABC extinguishers. Other types of extinguishers could create an electrocution hazard if used on an electrical fire because they contain liquids or chemicals that conduct electricity. Use the fire extinguisher properly. In the moment of an emergency, it can be hard to remember how to operate a fire extinguisher. To make that easier, remember the term PASS and what each letter stands for:\nP - PULL the silver safety pin on the handle of the extinguisher. A - AIM the hose and nozzle of the extinguisher at the fire. S - SQUEEZE the handle of the fire extinguisher slowly. S - SWEEP from left to right, making sure to get every part of the fire. Disconnect the electricity when possible. Once the fire is under control enough to safely get to the electrical panel or the outlet, disconnect the power. This will help ensure that the fire is not reignited by electricity and that the risk of electrocution is eliminated. Putting Out an Electrical Fire Once the Power is Off Use a fire extinguisher if you have one available. If you have turned off the electricity and there is a fire extinguisher nearby, spray it on the fire. It doesn't matter what kind of extinguisher you use on a fire that has no live electricity around it. Use a fire blanket or other thick blanket to smother the fire. If you don't have an extinguisher but you do have a fire blanket, use it to smother the fire. By covering a small fire you are eliminating much of the oxygen the fire needs to keep going. With quick action, a fire blanket or other thick blanket can be used to put a small fire out completely. Douse the fire with water. You need to be absolutely sure that the electricity is turned off before putting water on a fire. If you are sure, spray or dump water on the fire and nearby areas that are likely to become ignited. The moisture will put out active flames and will reduce the risk of the fire growing. Water on an electrified fire can create an electrocution hazard, in addition to the fire hazard. If the fuel for the fire you are fighting is kerosene, oil, or another liquid fuel, be careful putting water on it. The water can pick up the fuel and move it to another area where it can then ignite and spread the fire.",
  "tyn_model":[
    "water",
    "fire extinguisher",
    "electricity",
    "extinguisher",
    "fire department",
    "fire blanket",
    "electrical fire",
    "toaster",
    "electrical disconnect",
    "baking soda",
    "extinguishers",
    "fire-fighting techniques",
    "extension cord",
    "electrical fires",
    "electrical switch",
    "blanket",
    "fire extinguishers",
    "electrical panel",
    "moisture"
  ],
  "tyn_section":[

  ]
}