{
  "title":"How to Play Bejeweled 2 Deluxe",
  "url":"https://www.wikihow.com/Play-Bejeweled-2-Deluxe",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "parts":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Open Bejeweled.",
          "description":"You should hear the music begin to play and the loading progress bar on the bottom of the screen. This will turn to a \"Click here to play\" button for you to enter the main screen."
        },
        {
          "headline":"Enter a new username/name if you have not already.",
          "description":"This will be used to track your personal profile and scores."
        },
        {
          "headline":"Enter the main menu.",
          "description":"You will be presented with four gameplay options: Classic, Action, Puzzle, and Endless."
        },
        {
          "headline":"Choose a game.",
          "description":"Each of these will be described in detail."
        }
      ]
    },
    {
      "name":"Classic",
      "steps":[
        {
          "headline":"Look to see that by swapping a gem, more options for other gems will fall into place.",
          "description":"It is a better strategy here to find chains closer to the bottom than the top so more cascade for more points."
        },
        {
          "headline":"Try to get to the highest level possible by doing this.",
          "description":"If you reach level 18, a game mode called \"Twilight\" is unlocked. In this mode, gravity changes with each move, alternating from gems falling from the top and bottom."
        }
      ]
    },
    {
      "name":"Action",
      "steps":[
        {
          "headline":"Think fast.",
          "description":"This is the most important skill you'll need in this mode. If you have not yet learned to recognize gem patterns quickly, you can do so by practicing in other modes such as Endless."
        },
        {
          "headline":"Look for other gem chains as soon as you make the move to swap one.",
          "description":"Try to leave as little time gaps as possible by thinking of your moves in advance."
        }
      ]
    },
    {
      "name":"Puzzle",
      "steps":[
        {
          "headline":"Click undo if you wish to undo a move you made.",
          "description":"This will allow you to try several combinations of move patterns to clear each level."
        },
        {
          "headline":"Use the Hint button if you need to reset the board to the last usable state.",
          "description":"If you click it again it will suggest a move to make for you."
        }
      ]
    },
    {
      "name":"Endless",
      "steps":[
        {
          "headline":"Find chains of gems closer to the bottom of the game field.",
          "description":"This will allow more gems at the top to cascade or fall into place."
        },
        {
          "headline":"Swap to form a chain of five when possible.",
          "description":"Hypercubes will allow you to gain more points to get to the next level."
        }
      ]
    }
  ],
  "text":" Steps Open Bejeweled. You should hear the music begin to play and the loading progress bar on the bottom of the screen. This will turn to a \"Click here to play\" button for you to enter the main screen. Enter a new username/name if you have not already. This will be used to track your personal profile and scores. Enter the main menu. You will be presented with four gameplay options: Classic, Action, Puzzle, and Endless. Choose a game. Each of these will be described in detail. Classic Look to see that by swapping a gem, more options for other gems will fall into place. It is a better strategy here to find chains closer to the bottom than the top so more cascade for more points. Try to get to the highest level possible by doing this. If you reach level 18, a game mode called \"Twilight\" is unlocked. In this mode, gravity changes with each move, alternating from gems falling from the top and bottom. Action Think fast. This is the most important skill you'll need in this mode. If you have not yet learned to recognize gem patterns quickly, you can do so by practicing in other modes such as Endless. Look for other gem chains as soon as you make the move to swap one. Try to leave as little time gaps as possible by thinking of your moves in advance. Puzzle Click undo if you wish to undo a move you made. This will allow you to try several combinations of move patterns to clear each level. Use the Hint button if you need to reset the board to the last usable state. If you click it again it will suggest a move to make for you. Endless Find chains of gems closer to the bottom of the game field. This will allow more gems at the top to cascade or fall into place. Swap to form a chain of five when possible. Hypercubes will allow you to gain more points to get to the next level.",
  "tyn_model":[
    "gems",
    "bejeweled",
    "gem",
    "hypercubes"
  ],
  "tyn_section":[

  ]
}