{
  "title":"How to Make a Grilled Chicken Sandwich",
  "url":"https://www.wikihow.com/Make-a-Grilled-Chicken-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Meat and Poultry Sandwiches"
  ],
  "steps":[
    {
      "headline":"Get chicken breast.",
      "description":"Slice it into a big circle, a little larger than the bun's size. Prepare the chicken and cook it until it is warm enough ( 10- 12 mins on each side)."
    },
    {
      "headline":"Be careful handling this as it will be hot.",
      "description":"Wait until it cools off a little, but don't wait too long or it will be too cold."
    },
    {
      "headline":"Take out a bun and slice it in half with a knife.",
      "description":"Be careful while doing this. Then, place the bottom half of the bun on a clean surface. If you want it to be breaded, roll it around in a lot of bread crumbs. Then when you are ready, place the chicken on the bun' bottom half."
    },
    {
      "headline":"Add toppings on the patty.",
      "description":"You may want ketchup, mustard, mayo, pickles, lettuce, tomato, cheese, or others. Pick the toppings you want and then put it on the \"half chicken sandwich\". You don't have to put toppings in if you don't want any. Look for some ideas in the \"Tips\" section."
    },
    {
      "headline":"Place on the top bun.",
      "description":"Serve on a plate with a drink, french fries or another side. Enjoy!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Get chicken breast. Slice it into a big circle, a little larger than the bun's size. Prepare the chicken and cook it until it is warm enough ( 10- 12 mins on each side). Be careful handling this as it will be hot. Wait until it cools off a little, but don't wait too long or it will be too cold. Take out a bun and slice it in half with a knife. Be careful while doing this. Then, place the bottom half of the bun on a clean surface. If you want it to be breaded, roll it around in a lot of bread crumbs. Then when you are ready, place the chicken on the bun' bottom half. Add toppings on the patty. You may want ketchup, mustard, mayo, pickles, lettuce, tomato, cheese, or others. Pick the toppings you want and then put it on the \"half chicken sandwich\". You don't have to put toppings in if you don't want any. Look for some ideas in the \"Tips\" section. Place on the top bun. Serve on a plate with a drink, french fries or another side. Enjoy! Finished. ",
  "tyn_model":[
    "chicken",
    "chicken breast",
    "knife",
    "bread crumbs",
    "mustard",
    "pickles",
    "lettuce",
    "plate",
    "french fries"
  ],
  "tyn_section":[

  ]
}