{
  "title":"How to Retrieve a Fallen Objective in Lord of the Rings Conquest",
  "url":"https://www.wikihow.com/Retrieve-a-Fallen-Objective-in-Lord-of-the-Rings-Conquest",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "The Lord of the Rings: Conquest"
  ],
  "steps":[
    {
      "headline":"Play the mission in co-op mode.",
      "description":"Start the mission."
    },
    {
      "headline":"Locate where the person carrying the objective has died.",
      "description":""
    },
    {
      "headline":"Determine if the object has indeed fallen down a pit.",
      "description":"An arrow will point to it."
    },
    {
      "headline":"One player pinpoint the exact location the object is in the pit.",
      "description":"It can be found by looking for the silver glow around it."
    },
    {
      "headline":"Jump.",
      "description":"One player dive into the pit, directly on top of the point the object is."
    },
    {
      "headline":"Wait to die.",
      "description":"If you land on or directly over the object, you will pick it up right before you die."
    },
    {
      "headline":"Respawn.",
      "description":"If the second player is still alive while the first player jumps, the object will also respawn nearby."
    },
    {
      "headline":"Pick up the object and advance to the next objective.",
      "description":""
    }
  ],
  "text":" Play the mission in co-op mode. Start the mission. Locate where the person carrying the objective has died.  Determine if the object has indeed fallen down a pit. An arrow will point to it. One player pinpoint the exact location the object is in the pit. It can be found by looking for the silver glow around it. Jump. One player dive into the pit, directly on top of the point the object is. Wait to die. If you land on or directly over the object, you will pick it up right before you die. Respawn. If the second player is still alive while the first player jumps, the object will also respawn nearby. Pick up the object and advance to the next objective. ",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}