{
  "title":"How to Make Butter Without a Butter Churner",
  "url":"https://www.wikihow.com/Make-Butter-Without-a-Butter-Churner",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Butter and Ghee"
  ],
  "steps":[
    {
      "headline":"Pour your milk and heavy whipping into your small container together.",
      "description":""
    },
    {
      "headline":"Put the lid on the container and wrap the container in a paper towel to prevent the mix from splashing on you if the container leaks.",
      "description":""
    },
    {
      "headline":"Shake for about 10-30 min.",
      "description":"and check to see if there is a big glop of butter on the side, if not, keep shaking until this is seen. If you get tired of shaking yourself, pass it around to your other family members so you can take a rest."
    },
    {
      "headline":"Once you have your butter, take your bigger container and tape a filter (or put a cheesecloth) to the top of it.",
      "description":""
    },
    {
      "headline":"Pour your butter and your mixture into the filter so all the liquid drains to the bottom of the container and your butter is left on the top.",
      "description":""
    },
    {
      "headline":"The liquid on the bottom is great for coffee cream and the butter left over tastes great.",
      "description":""
    },
    {
      "headline":"If you want, you can add salt to the butter so the butter can have more flavor.",
      "description":""
    },
    {
      "headline":"Put the lids on your smaller and bigger containers, then store them in the fridge.",
      "description":""
    }
  ],
  "text":" Pour your milk and heavy whipping into your small container together.  Put the lid on the container and wrap the container in a paper towel to prevent the mix from splashing on you if the container leaks.  Shake for about 10-30 min. and check to see if there is a big glop of butter on the side, if not, keep shaking until this is seen. If you get tired of shaking yourself, pass it around to your other family members so you can take a rest. Once you have your butter, take your bigger container and tape a filter (or put a cheesecloth) to the top of it.  Pour your butter and your mixture into the filter so all the liquid drains to the bottom of the container and your butter is left on the top.  The liquid on the bottom is great for coffee cream and the butter left over tastes great.  If you want, you can add salt to the butter so the butter can have more flavor.  Put the lids on your smaller and bigger containers, then store them in the fridge. ",
  "tyn_model":[
    "butter",
    "milk",
    "paper towel",
    "cheesecloth",
    "salt",
    "fridge"
  ],
  "tyn_section":[

  ]
}