{
  "title":"How to Get New Cards in Star Wars: Card Trader",
  "url":"https://www.wikihow.com/Get-New-Cards-in-Star-Wars:-Card-Trader",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "methods":[
    {
      "name":"Buying Card Packs from the Cantina",
      "steps":[
        {
          "headline":"Launch Star Wars: Card Trader.",
          "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it."
        },
        {
          "headline":"Go to the Cantina.",
          "description":"The Cantina is the app’s store. Tap the Cantina icon on the bottom toolbar to access it. The Main Cantina is where you can see the available card packs for purchase. Visit the Cantina regularly as new packs come and go."
        },
        {
          "headline":"View card packs.",
          "description":"The list of card packs available and their corresponding costs in credits are displayed on your screen. Card packs vary in number and contents. There are some Base Packs, which contain the basic cards with some inserts, and there are some Master Packs, which contain more valuable cards with inserts. Master Packs are more expensive than Base Packs."
        },
        {
          "headline":"Buy a card pack.",
          "description":"From the list of available card packs, select the one you’d like to buy. Tap the corresponding button with the cost in credits to buy the pack."
        },
        {
          "headline":"View your new cards.",
          "description":"Since this is a digital or virtual card pack, you don’t need to physically open the pack. Immediately after buying a pack, it will be opened in full screen, with each card inside being displayed one by one. Swipe left or right to go through all the cards in the pack you’ve bought. “A NEW CARD” text will appear on the bottom of your screen when you get a new card you don’t have yet. The contents of the card pack will be added to your card decks."
        }
      ]
    },
    {
      "name":"Trading for New Cards",
      "steps":[
        {
          "headline":"Launch Star Wars: Card Trader.",
          "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it to access the fan feed."
        },
        {
          "headline":"View the Fan Feed.",
          "description":"The easiest way to find a trading partner is to look at the current fan feeds. These are the posts made by the players or traders, and they get updated in real-time. This means you can find an active trader by reading the posts here. To access the Fan Feed, tap the Stormtroopers icon on the bottom toolbar. Scroll through the feeds and find a trading partner."
        },
        {
          "headline":"Select a trading partner.",
          "description":"All the Fan Feeds are headlined by the trader’s codename. The trader’s ratings are indicated right below it. You can use this as a gauge to check if the trader is reliable or not. Tap on the trader’s codename to begin trading with him."
        },
        {
          "headline":"Offer a trade.",
          "description":"A menu will appear after selecting a trader. Tap “Offer Trade” from here, and the trading screen will appear."
        },
        {
          "headline":"View your partner’s cards.",
          "description":"On the trading screen, your partner’s cards will be displayed first. Swipe up and down on them to see his cards."
        },
        {
          "headline":"Select the cards to get.",
          "description":"The topmost panel is where you put the cards you want to get. Swipe up and down on your partner’s cards to view them, and find the cards you want to get. Put the cards you want to get at the topmost panel by dragging them there or by just double-tapping on them. You can select a maximum of nine cards per trade. Tap the “Next” button at the top right corner of the screen."
        },
        {
          "headline":"Select the cards to give.",
          "description":"The next trading screen will appear with your cards now displayed. Swipe up and down on your cards to view all of them, and find the cards you want to give. Tap, hold, and drag the cards you want to give to the panel at the top. You can also double-tap on them. You can select a maximum of nine cards per trade. Tap the “Next” button at the top right corner of the screen to proceed."
        },
        {
          "headline":"Go over the selected cards.",
          "description":"A summary screen of your trade will be displayed for your review. Carefully check if this is the trade you want to offer. The partner’s codename is on the top left corner, the cards you’re getting are on the left box, and the cards you’re giving are on the right box. Double-check and make sure the correct cards are being traded, because once you’ve sent the trade offer and your partner has accepted it right away, you will not be able to recover the cards."
        },
        {
          "headline":"Send trade offer.",
          "description":"Tap the “Send” button at the bottom to proceed with the trade. The trade will be sent to your partner. It’s now up to him to decide if he likes your offer. If he accepts, the cards you’re getting will be added to your card decks and the cards you’ve offered will be moved to his."
        }
      ]
    }
  ],
  "text":" Buying Card Packs from the Cantina Launch Star Wars: Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. Go to the Cantina. The Cantina is the app’s store. Tap the Cantina icon on the bottom toolbar to access it. The Main Cantina is where you can see the available card packs for purchase. Visit the Cantina regularly as new packs come and go. View card packs. The list of card packs available and their corresponding costs in credits are displayed on your screen. Card packs vary in number and contents. There are some Base Packs, which contain the basic cards with some inserts, and there are some Master Packs, which contain more valuable cards with inserts. Master Packs are more expensive than Base Packs. Buy a card pack. From the list of available card packs, select the one you’d like to buy. Tap the corresponding button with the cost in credits to buy the pack. View your new cards. Since this is a digital or virtual card pack, you don’t need to physically open the pack. Immediately after buying a pack, it will be opened in full screen, with each card inside being displayed one by one. Swipe left or right to go through all the cards in the pack you’ve bought. “A NEW CARD” text will appear on the bottom of your screen when you get a new card you don’t have yet. The contents of the card pack will be added to your card decks. Trading for New Cards Launch Star Wars: Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it to access the fan feed. View the Fan Feed. The easiest way to find a trading partner is to look at the current fan feeds. These are the posts made by the players or traders, and they get updated in real-time. This means you can find an active trader by reading the posts here. To access the Fan Feed, tap the Stormtroopers icon on the bottom toolbar. Scroll through the feeds and find a trading partner. Select a trading partner. All the Fan Feeds are headlined by the trader’s codename. The trader’s ratings are indicated right below it. You can use this as a gauge to check if the trader is reliable or not. Tap on the trader’s codename to begin trading with him. Offer a trade. A menu will appear after selecting a trader. Tap “Offer Trade” from here, and the trading screen will appear. View your partner’s cards. On the trading screen, your partner’s cards will be displayed first. Swipe up and down on them to see his cards. Select the cards to get. The topmost panel is where you put the cards you want to get. Swipe up and down on your partner’s cards to view them, and find the cards you want to get. Put the cards you want to get at the topmost panel by dragging them there or by just double-tapping on them. You can select a maximum of nine cards per trade. Tap the “Next” button at the top right corner of the screen. Select the cards to give. The next trading screen will appear with your cards now displayed. Swipe up and down on your cards to view all of them, and find the cards you want to give. Tap, hold, and drag the cards you want to give to the panel at the top. You can also double-tap on them. You can select a maximum of nine cards per trade. Tap the “Next” button at the top right corner of the screen to proceed. Go over the selected cards. A summary screen of your trade will be displayed for your review. Carefully check if this is the trade you want to offer. The partner’s codename is on the top left corner, the cards you’re getting are on the left box, and the cards you’re giving are on the right box. Double-check and make sure the correct cards are being traded, because once you’ve sent the trade offer and your partner has accepted it right away, you will not be able to recover the cards. Send trade offer. Tap the “Send” button at the bottom to proceed with the trade. The trade will be sent to your partner. It’s now up to him to decide if he likes your offer. If he accepts, the cards you’re getting will be added to your card decks and the cards you’ve offered will be moved to his.",
  "tyn_model":[
    "” button",
    "star wars logo",
    "“next",
    "star wars",
    "card trader",
    "card pack",
    "card packs",
    "“a",
    "” text",
    "star wars: card trader",
    "“offer",
    "” from",
    "“send"
  ],
  "tyn_section":[

  ]
}