{
  "title":"How to View Your Cards in Star Wars: Card Trader",
  "url":"https://www.wikihow.com/View-Your-Cards-in-Star-Wars:-Card-Trader",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "methods":[
    {
      "name":"Viewing Cards by Category",
      "steps":[
        {
          "headline":"Launch Star Wars Card Trader.",
          "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it."
        },
        {
          "headline":"View your cards.",
          "description":"Tap the cards icon on the rightmost part of the bottom toolbar. You will be brought to the screen with your current inventory of cards. By default, the initial view will be “My Cards.” You can see this title at the header toolbar. Swipe up and down to see all your cards."
        },
        {
          "headline":"View your locked cards.",
          "description":"Tap the “My Cards” title to drop down a list. Tap “My Locked Cards” from here. The app will then filter your cards to display all the cards you’ve currently locked. These cards cannot be traded by others until you’ve unlocked them."
        },
        {
          "headline":"View all cards.",
          "description":"If you want to see all cards currently released and available in the game, tap “All Cards” from the drop-down list on the header toolbar. All the cards will be displayed for you to see. Swipe up and down to see everything there is."
        },
        {
          "headline":"View the checklist.",
          "description":"If you don’t want to see all the cards, you can just view the checklist. Tap “Checklist” from the drop-down list on the header toolbar. All the cards currently released and available, sold out, and coming soon are grouped together by the different card types. The checklist contains only the names of the cards, not the actual cards themselves. All the cards you currently have are selected here, so you can easily see where you stand in your overall collection."
        }
      ]
    },
    {
      "name":"Viewing Cards by Sorting Them",
      "steps":[
        {
          "headline":"Launch Star Wars Card Trader.",
          "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it."
        },
        {
          "headline":"View cards decks.",
          "description":"Tap the cards icon on the rightmost part of the bottom toolbar. You will be brought to the screen with your current inventory of cards."
        },
        {
          "headline":"View by Faction.",
          "description":"You can view your cards sorted differently. If you want to see them by their Star Wars affiliations, you can sort by Faction. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap on “Faction” and your cards will be sorted in decks based on the characters factions. You will see your cards in groups: Star Wars: The Force Awakens, Galactic Empire, Galactic Republic, Independent, Rebel Alliance, and Separatists."
        },
        {
          "headline":"View by Parallel.",
          "description":"If you want to see your cards by their rarity in the game, you can sort by Parallel. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap “Parallel” and your cards will be sorted in decks based on their rarity. You will see your cards in groups: Episode VII, Insert, Gold, Yellow, Red, Blue, White, and Award. Golds are more valuable than yellows, yellows are more valuable than reds, reds are more valuable than blues, and blues are more valuable than whites."
        },
        {
          "headline":"View by Duplicates.",
          "description":"If you want to see your cards with the most number of duplicates at the top, you can sort by Duplicates. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap “Duplicates” and your cards will be sorted with the most number of duplicates at the top. This sorting option will help you view which cards you have a lot of to be traded with others."
        },
        {
          "headline":"View by Date Acquired.",
          "description":"If you want to see your cards with the most recently acquired ones at the top, you can sort by Date Acquired. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap “Date Acquired” and  your cards will be sorted with the ones you’ve most recently acquired at the top."
        }
      ]
    }
  ],
  "text":" Viewing Cards by Category Launch Star Wars Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. View your cards. Tap the cards icon on the rightmost part of the bottom toolbar. You will be brought to the screen with your current inventory of cards. By default, the initial view will be “My Cards.” You can see this title at the header toolbar. Swipe up and down to see all your cards. View your locked cards. Tap the “My Cards” title to drop down a list. Tap “My Locked Cards” from here. The app will then filter your cards to display all the cards you’ve currently locked. These cards cannot be traded by others until you’ve unlocked them. View all cards. If you want to see all cards currently released and available in the game, tap “All Cards” from the drop-down list on the header toolbar. All the cards will be displayed for you to see. Swipe up and down to see everything there is. View the checklist. If you don’t want to see all the cards, you can just view the checklist. Tap “Checklist” from the drop-down list on the header toolbar. All the cards currently released and available, sold out, and coming soon are grouped together by the different card types. The checklist contains only the names of the cards, not the actual cards themselves. All the cards you currently have are selected here, so you can easily see where you stand in your overall collection. Viewing Cards by Sorting Them Launch Star Wars Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. View cards decks. Tap the cards icon on the rightmost part of the bottom toolbar. You will be brought to the screen with your current inventory of cards. View by Faction. You can view your cards sorted differently. If you want to see them by their Star Wars affiliations, you can sort by Faction. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap on “Faction” and your cards will be sorted in decks based on the characters factions. You will see your cards in groups: Star Wars: The Force Awakens, Galactic Empire, Galactic Republic, Independent, Rebel Alliance, and Separatists. View by Parallel. If you want to see your cards by their rarity in the game, you can sort by Parallel. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap “Parallel” and your cards will be sorted in decks based on their rarity. You will see your cards in groups: Episode VII, Insert, Gold, Yellow, Red, Blue, White, and Award. Golds are more valuable than yellows, yellows are more valuable than reds, reds are more valuable than blues, and blues are more valuable than whites. View by Duplicates. If you want to see your cards with the most number of duplicates at the top, you can sort by Duplicates. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap “Duplicates” and your cards will be sorted with the most number of duplicates at the top. This sorting option will help you view which cards you have a lot of to be traded with others. View by Date Acquired. If you want to see your cards with the most recently acquired ones at the top, you can sort by Date Acquired. Tap the up and down arrows beside the search box on the top right corner. This will bring down the list of sorting options. Tap “Date Acquired” and  your cards will be sorted with the ones you’ve most recently acquired at the top.",
  "tyn_model":[
    "cards",
    "” and",
    "“my",
    "” from",
    "star wars card trader",
    "star wars logo",
    "blues",
    "” you",
    "” title",
    "“all",
    "“checklist",
    "checklist",
    "“faction",
    "“parallel",
    "gold",
    "“duplicates",
    "“date"
  ],
  "tyn_section":[

  ]
}