{
  "title":"How to Report Users in Star Wars: Card Trader",
  "url":"https://www.wikihow.com/Report-Users-in-Star-Wars:-Card-Trader",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "methods":[
    {
      "name":"Reporting a Fan from the Fan Feed",
      "steps":[
        {
          "headline":"Launch Star Wars: Card Trader.",
          "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it."
        },
        {
          "headline":"Tap on the Stormtroopers icon on the bottom toolbar.",
          "description":"You will be brought to the fan feeds. These are the posts made by the players or traders, and they get updated in real-time."
        },
        {
          "headline":"Scroll through the posts.",
          "description":"If you see something inappropriate, like bullying, spamming, scamming, fighting, implying sexists or racists jokes, you should stop at that post and take a moment to report it. Be sure that what you’re reporting is true and accurate. You just don’t report someone because you don’t like them or because they rejected your trade offer."
        },
        {
          "headline":"Access the “Report Fan” screen.",
          "description":"Tap on the username of the fan who made the inappropriate post, and a menu will appear. Tap the “Report Fan” button from here, and the “Report Fan” window will appear, with the fan’s username on the top."
        },
        {
          "headline":"Identify what was inappropriate.",
          "description":"The “Report Fan” window is a form you need to complete and submit in order for Topps, the company that developed the game, to review. A list of common violations is displayed. You can choose from Hate Speech, Scam Talk, Spam, Bullying, Fan Image, and Other. Tap on the violation related to your report."
        },
        {
          "headline":"Provide additional info.",
          "description":"There’s a bottom section on the window for Additional Info. Type in further details related to the violation being reported. Be true and accurate in your report."
        },
        {
          "headline":"Send.",
          "description":"When you’re done, tap the “Send” button on the top right corner of the window. The window will close, and your report will be sent to Topps."
        }
      ]
    },
    {
      "name":"Reporting a Fan from a Trade",
      "steps":[
        {
          "headline":"Launch Star Wars Card Trader.",
          "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it."
        },
        {
          "headline":"View all trades.",
          "description":"Tap the exchanging cards icon on the middle part of the bottom toolbar. You will be brought to the screen with your trades. Tap on the title on the header toolbar to see a drop-down list of filters. Tap on “All Trades” from here. All your trades, with the most recent ones at the top, will be displayed. Swipe down to see more trades."
        },
        {
          "headline":"Find a specific trade.",
          "description":"On each trade, you can see your trade partner’s username, the current status of the trade, any messages left, the cards being traded, and some action buttons at the bottom. Browse through the trades and find the ones coming from traders or fans you want to report. These may be fans who have scammed or bullied you through trades."
        },
        {
          "headline":"Access the “Report Fan” screen.",
          "description":"Tap on the username of the fan who made the inappropriate post, and a menu will appear. Tap the “Report Fan” button from here, and the “Report Fan” window will appear, with the fan’s username on the top."
        },
        {
          "headline":"Identify what was inappropriate.",
          "description":"The “Report Fan” window is a form you need to complete and submit in order for Topps to review. A list of common violations is displayed. You can choose from Hate Speech, Scam Talk, Spam, Bullying, Fan Image, and Other. Tap on the violation related to your report."
        },
        {
          "headline":"Provide additional info.",
          "description":"There’s a bottom section on the window for Additional Info. Type in further details related to the violation being reported. Be true and accurate in your report."
        },
        {
          "headline":"Send.",
          "description":"When you’re done, tap the “Send” button on the top right corner of the window. The window will close, and your report will be sent to Topps."
        }
      ]
    }
  ],
  "text":" Reporting a Fan from the Fan Feed Launch Star Wars: Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. Tap on the Stormtroopers icon on the bottom toolbar. You will be brought to the fan feeds. These are the posts made by the players or traders, and they get updated in real-time. Scroll through the posts. If you see something inappropriate, like bullying, spamming, scamming, fighting, implying sexists or racists jokes, you should stop at that post and take a moment to report it. Be sure that what you’re reporting is true and accurate. You just don’t report someone because you don’t like them or because they rejected your trade offer. Access the “Report Fan” screen. Tap on the username of the fan who made the inappropriate post, and a menu will appear. Tap the “Report Fan” button from here, and the “Report Fan” window will appear, with the fan’s username on the top. Identify what was inappropriate. The “Report Fan” window is a form you need to complete and submit in order for Topps, the company that developed the game, to review. A list of common violations is displayed. You can choose from Hate Speech, Scam Talk, Spam, Bullying, Fan Image, and Other. Tap on the violation related to your report. Provide additional info. There’s a bottom section on the window for Additional Info. Type in further details related to the violation being reported. Be true and accurate in your report. Send. When you’re done, tap the “Send” button on the top right corner of the window. The window will close, and your report will be sent to Topps. Reporting a Fan from a Trade Launch Star Wars Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. View all trades. Tap the exchanging cards icon on the middle part of the bottom toolbar. You will be brought to the screen with your trades. Tap on the title on the header toolbar to see a drop-down list of filters. Tap on “All Trades” from here. All your trades, with the most recent ones at the top, will be displayed. Swipe down to see more trades. Find a specific trade. On each trade, you can see your trade partner’s username, the current status of the trade, any messages left, the cards being traded, and some action buttons at the bottom. Browse through the trades and find the ones coming from traders or fans you want to report. These may be fans who have scammed or bullied you through trades. Access the “Report Fan” screen. Tap on the username of the fan who made the inappropriate post, and a menu will appear. Tap the “Report Fan” button from here, and the “Report Fan” window will appear, with the fan’s username on the top. Identify what was inappropriate. The “Report Fan” window is a form you need to complete and submit in order for Topps to review. A list of common violations is displayed. You can choose from Hate Speech, Scam Talk, Spam, Bullying, Fan Image, and Other. Tap on the violation related to your report. Provide additional info. There’s a bottom section on the window for Additional Info. Type in further details related to the violation being reported. Be true and accurate in your report. Send. When you’re done, tap the “Send” button on the top right corner of the window. The window will close, and your report will be sent to Topps.",
  "tyn_model":[
    "“report",
    "” button",
    "” window",
    "star wars logo",
    "” screen",
    "“send",
    "star wars: card trader",
    "star wars card trader",
    "“all",
    "” from",
    "cards",
    "topps"
  ],
  "tyn_section":[

  ]
}