{
  "title":"How to Make Grilled Strawberries and Bananas with Ice Cream",
  "url":"https://www.wikihow.com/Make-Grilled-Strawberries-and-Bananas-with-Ice-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "steps":[
    {
      "headline":"Let the grill settle to a medium heat.",
      "description":""
    },
    {
      "headline":"Combine the honey, lime juice, canola oil, cinnamon, and salt in a medium bowl.",
      "description":""
    },
    {
      "headline":"Add the banana and strawberry slices to the bowl.",
      "description":""
    },
    {
      "headline":"Mix everything gently so that you coat the fruit pieces with the mixture.",
      "description":""
    },
    {
      "headline":"Build the fruit on skewers, by alternating the fruit.",
      "description":"Save the glaze on the side."
    },
    {
      "headline":"Place the skewers on the grill for about 2 to 3 minutes or until you see light \"grill marks\" on the fruit.",
      "description":""
    },
    {
      "headline":"Brush the glaze on the fruit and turn the skewers over for another 2 to 3 minutes.",
      "description":""
    },
    {
      "headline":"Scoop the ice cream and give each bowl a few generous scoops.",
      "description":""
    },
    {
      "headline":"Scoop on or spray whipped cream on top of the ice cream.",
      "description":""
    },
    {
      "headline":"Remove the grilled fruit and use it as a topping on the whipped cream.",
      "description":""
    }
  ],
  "text":" Let the grill settle to a medium heat.  Combine the honey, lime juice, canola oil, cinnamon, and salt in a medium bowl.  Add the banana and strawberry slices to the bowl.  Mix everything gently so that you coat the fruit pieces with the mixture.  Build the fruit on skewers, by alternating the fruit. Save the glaze on the side. Place the skewers on the grill for about 2 to 3 minutes or until you see light \"grill marks\" on the fruit.  Brush the glaze on the fruit and turn the skewers over for another 2 to 3 minutes.  Scoop the ice cream and give each bowl a few generous scoops.  Scoop on or spray whipped cream on top of the ice cream.  Remove the grilled fruit and use it as a topping on the whipped cream. ",
  "tyn_model":[
    "grill",
    "ice cream",
    "whipped cream",
    "honey",
    "lime juice",
    "canola oil",
    "cinnamon",
    "salt",
    "medium bowl",
    "banana",
    "strawberry",
    "grilled fruit"
  ],
  "tyn_section":[

  ]
}