{
  "title":"How to Make Gluten Free Chocolate Chip Cookie Bars",
  "url":"https://www.wikihow.com/Make-Gluten-Free-Chocolate-Chip-Cookie-Bars",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes",
    "Gluten Free Dishes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350°F/180ºC.",
      "description":""
    },
    {
      "headline":"Lightly grease a 9\" X 13\" baking pan.",
      "description":""
    },
    {
      "headline":"Whisk together the baking flour, xanthan gum, salt, baking powder and the baking soda in a large bowl.",
      "description":""
    },
    {
      "headline":"Add the flax meal, and whisk until combined.",
      "description":"The flaxseed works in place of an egg; it helps to bind and it adds fiber."
    },
    {
      "headline":"Stir in the brown sugar and whisk until combined.",
      "description":""
    },
    {
      "headline":"Add the oil, vanilla, agave syrup, and coffee.",
      "description":""
    },
    {
      "headline":"Mix together using a spatula if you find the whisk is not cutting through the dough.",
      "description":"If the dough is way too stiff and you need it to be a bit thinner or smoother, add another tablespoon at a time of coffee to soften. Do this until it forms a pretty thick cookie dough."
    },
    {
      "headline":"Stir in the chocolate chips.",
      "description":""
    },
    {
      "headline":"Scrape the batter into the greased baking pan.",
      "description":""
    },
    {
      "headline":"Spread batter evenly into prepared pan.",
      "description":""
    },
    {
      "headline":"Bake in the center of preheated oven for 35 to 40 minutes, or until the center is almost firm to the touch and just leaves a little dent in the top.",
      "description":"When you press on them, they should feel a little soft but you'll be able to see that it looks done. If you test it with a toothpick or knife, it will appear a little gooey, but that's fine."
    },
    {
      "headline":"Let the bars cool completely in pan before cutting into squares or bars.",
      "description":"They're now ready to serve."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350°F/180ºC.  Lightly grease a 9\" X 13\" baking pan.  Whisk together the baking flour, xanthan gum, salt, baking powder and the baking soda in a large bowl.  Add the flax meal, and whisk until combined. The flaxseed works in place of an egg; it helps to bind and it adds fiber. Stir in the brown sugar and whisk until combined.  Add the oil, vanilla, agave syrup, and coffee.  Mix together using a spatula if you find the whisk is not cutting through the dough. If the dough is way too stiff and you need it to be a bit thinner or smoother, add another tablespoon at a time of coffee to soften. Do this until it forms a pretty thick cookie dough. Stir in the chocolate chips.  Scrape the batter into the greased baking pan.  Spread batter evenly into prepared pan.  Bake in the center of preheated oven for 35 to 40 minutes, or until the center is almost firm to the touch and just leaves a little dent in the top. When you press on them, they should feel a little soft but you'll be able to see that it looks done. If you test it with a toothpick or knife, it will appear a little gooey, but that's fine. Let the bars cool completely in pan before cutting into squares or bars. They're now ready to serve. Finished. ",
  "tyn_model":[
    "whisk",
    "oven",
    "baking pan",
    "baking flour",
    "xanthan gum",
    "salt",
    "baking powder",
    "baking soda",
    "large bowl",
    "flax meal",
    "brown sugar",
    "oil",
    "vanilla",
    "agave syrup",
    "coffee",
    "spatula",
    "cookie dough",
    "chocolate chips",
    "knife"
  ],
  "tyn_section":[

  ]
}