{
  "title":"How to Run Downloaded Games on a PSP",
  "url":"https://www.wikihow.com/Run-Downloaded-Games-on-a-PSP",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PSP"
  ],
  "parts":[
    {
      "name":"Adding Games to the PSP",
      "steps":[
        {
          "headline":"Turn on your PSP.",
          "description":"Press your PSP's power button to do so."
        },
        {
          "headline":"Make sure your PSP can run downloaded games.",
          "description":"Your PSP must be up to date and have custom-installed firmware in order for you to be able to place downloaded games on it. If you haven't yet done so, install custom firmware on your PSP before continuing. This will allow you to run downloaded games. You'll also need to download the game(s) that you want to put on your PSP."
        },
        {
          "headline":"Plug your PSP into your computer.",
          "description":"Attach the USB end of the PSP's charging cable to your computer, then attach the charging side to your PSP."
        },
        {
          "headline":"Open Start {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"}.",
          "description":"Click the Windows logo in the bottom-left corner of the screen."
        },
        {
          "headline":"Open File Explorer {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Windowsstartexplorer.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Windowsstartexplorer.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"}.",
          "description":"It's in the lower-left side of the Start window."
        },
        {
          "headline":"Go to the folder where your game's ISO file is stored.",
          "description":"If you downloaded a video game to put on your PSP, you'll likely find the ISO file in the game's folder. Some games use CSO files instead of ISO files. If this is the case with your game, you'll look for the CSO file instead. You can typically find the folder where the ISO file (or the game folder) is stored."
        },
        {
          "headline":"Click the ISO file.",
          "description":"This will select it."
        },
        {
          "headline":"Click Home.",
          "description":"This tab is in the upper-left corner of the File Explorer window."
        },
        {
          "headline":"Click Copy.",
          "description":"It's on the left side of the Home toolbar that's at the top of the window. Doing so will copy the selected ISO file."
        },
        {
          "headline":"Click your PSP's name.",
          "description":"You'll find it in the left-hand sidebar of folders, though you'll likely need to scroll down to find it. If you can't find it here, click instead the \"This PC\" folder, then double-click the PSP's name below the \"Devices and drives\" heading."
        },
        {
          "headline":"Make sure there is an ISO folder on your PSP.",
          "description":"Look for a folder entitled \"ISO\" (not \"iso\") in the PSP folder. If you don't see this folder, create one before proceeding:\nClick the Home tab. Click New Folder. Type in ISO (not iso) and then press ↵ Enter."
        },
        {
          "headline":"Open the \"ISO\" folder.",
          "description":"Double-click it to do so."
        },
        {
          "headline":"Click the Home tab again.",
          "description":"The Home toolbar will appear at the top of the File Explorer window."
        },
        {
          "headline":"Click Paste.",
          "description":"It's just right of the Copy option in the toolbar. Doing so will begin copying the ISO file into your PSP's \"ISO\" folder. This process may take several minutes."
        },
        {
          "headline":"Eject and unplug your PSP from your computer.",
          "description":"After the ISO file finishes transferring over to your PSP, you can click the flash drive icon in the bottom-right corner of the screen (you may first have to click ^ here) and click Eject. After doing so, it's safe to detach your PSP from your computer."
        },
        {
          "headline":"Turn on your PSP.",
          "description":"Press your PSP's power button to do so."
        },
        {
          "headline":"Make sure your PSP can run downloaded games.",
          "description":"Your PSP must be up-to-date and have custom-installed firmware in order for you to be able to place downloaded games on it. If you haven't yet done so, install custom firmware on your PSP before continuing. This will allow you to run downloaded games. You'll also need to download the game(s) that you want to put on your PSP."
        },
        {
          "headline":"Plug your PSP into your computer.",
          "description":"Attach the USB end of the PSP's charging cable to your computer, then attach the charging side to your PSP."
        },
        {
          "headline":"Open the Finder.",
          "description":"This app is a blue, face-shaped icon in your Mac's Dock."
        },
        {
          "headline":"Go to the folder where your game's ISO file is stored.",
          "description":"If you downloaded a video game to put on your PSP, you'll likely find the ISO file in the game's folder. Some games use CSO files instead of ISO files. If this is the case with your game, you'll look for the CSO file instead. You can usually select the folder from the left side of the Finder window. You may need to click All My Files in the top-left side of the Finder and then type the ISO's name into the search bar in the upper-right side of the Finder window to locate the ISO."
        },
        {
          "headline":"Select the ISO.",
          "description":"Simply click the ISO file in order to select it."
        },
        {
          "headline":"Click Edit.",
          "description":"This menu item is in the upper-left side of your Mac's screen. Doing so prompts a drop-down menu."
        },
        {
          "headline":"Click Copy.",
          "description":"It's near the top of the drop-down menu. This will copy the ISO file."
        },
        {
          "headline":"Double-click your PSP's name.",
          "description":"It will be on the left side of the Finder window, just below the \"Devices\" heading. Doing so opens your PSP's folder."
        },
        {
          "headline":"Make sure there is an ISO folder on your PSP.",
          "description":"Look for a folder entitled \"ISO\" (not \"iso\") in the PSP folder. If you don't see this folder, create one before proceeding:\nClick the File menu item. Click New Folder. Type ISO (not iso) in and press ⏎ Return."
        },
        {
          "headline":"Open the \"ISO\" folder.",
          "description":"Double-click it to open it."
        },
        {
          "headline":"Click Edit again.",
          "description":"The drop-down menu will appear."
        },
        {
          "headline":"Click Paste.",
          "description":"It's near the top of the drop-down menu. Doing so will begin copying the ISO file into the \"ISO\" folder. This process may take a few minutes."
        },
        {
          "headline":"Eject and unplug your PSP from the computer.",
          "description":"Once the ISO file finishes copying into your PSP's \"ISO\" folder, you can eject your PSP from your computer by clicking the upward-facing arrow to the right of its name. After doing so, it's safe to physically detach the PSP from your Mac."
        }
      ]
    },
    {
      "name":"Running Games on the PSP",
      "steps":[
        {
          "headline":"Restart your PSP.",
          "description":"To ensure that the game files are properly incorporated, turn off your PSP, then turn it back on using the power button."
        },
        {
          "headline":"Select Game.",
          "description":"You may have to scroll left or right to select this option."
        },
        {
          "headline":"Scroll down to select Memory Stick, then press X.",
          "description":"This will open the PSP's internal memory, which is where the game is stored."
        },
        {
          "headline":"Select your game and press X.",
          "description":"This will load the game. As long as you placed the ISO file inside of the \"ISO\" folder on your PSP, the game will run properly."
        }
      ]
    }
  ],
  "text":" Adding Games to the PSP Turn on your PSP. Press your PSP's power button to do so. Make sure your PSP can run downloaded games. Your PSP must be up to date and have custom-installed firmware in order for you to be able to place downloaded games on it. If you haven't yet done so, install custom firmware on your PSP before continuing. This will allow you to run downloaded games. You'll also need to download the game(s) that you want to put on your PSP. Plug your PSP into your computer. Attach the USB end of the PSP's charging cable to your computer, then attach the charging side to your PSP. Open Start {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"}. Click the Windows logo in the bottom-left corner of the screen. Open File Explorer {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Windowsstartexplorer.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Windowsstartexplorer.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"}. It's in the lower-left side of the Start window. Go to the folder where your game's ISO file is stored. If you downloaded a video game to put on your PSP, you'll likely find the ISO file in the game's folder. Some games use CSO files instead of ISO files. If this is the case with your game, you'll look for the CSO file instead. You can typically find the folder where the ISO file (or the game folder) is stored. Click the ISO file. This will select it. Click Home. This tab is in the upper-left corner of the File Explorer window. Click Copy. It's on the left side of the Home toolbar that's at the top of the window. Doing so will copy the selected ISO file. Click your PSP's name. You'll find it in the left-hand sidebar of folders, though you'll likely need to scroll down to find it. If you can't find it here, click instead the \"This PC\" folder, then double-click the PSP's name below the \"Devices and drives\" heading. Make sure there is an ISO folder on your PSP. Look for a folder entitled \"ISO\" (not \"iso\") in the PSP folder. If you don't see this folder, create one before proceeding:\nClick the Home tab. Click New Folder. Type in ISO (not iso) and then press ↵ Enter. Open the \"ISO\" folder. Double-click it to do so. Click the Home tab again. The Home toolbar will appear at the top of the File Explorer window. Click Paste. It's just right of the Copy option in the toolbar. Doing so will begin copying the ISO file into your PSP's \"ISO\" folder. This process may take several minutes. Eject and unplug your PSP from your computer. After the ISO file finishes transferring over to your PSP, you can click the flash drive icon in the bottom-right corner of the screen (you may first have to click ^ here) and click Eject. After doing so, it's safe to detach your PSP from your computer. Turn on your PSP. Press your PSP's power button to do so. Make sure your PSP can run downloaded games. Your PSP must be up-to-date and have custom-installed firmware in order for you to be able to place downloaded games on it. If you haven't yet done so, install custom firmware on your PSP before continuing. This will allow you to run downloaded games. You'll also need to download the game(s) that you want to put on your PSP. Plug your PSP into your computer. Attach the USB end of the PSP's charging cable to your computer, then attach the charging side to your PSP. Open the Finder. This app is a blue, face-shaped icon in your Mac's Dock. Go to the folder where your game's ISO file is stored. If you downloaded a video game to put on your PSP, you'll likely find the ISO file in the game's folder. Some games use CSO files instead of ISO files. If this is the case with your game, you'll look for the CSO file instead. You can usually select the folder from the left side of the Finder window. You may need to click All My Files in the top-left side of the Finder and then type the ISO's name into the search bar in the upper-right side of the Finder window to locate the ISO. Select the ISO. Simply click the ISO file in order to select it. Click Edit. This menu item is in the upper-left side of your Mac's screen. Doing so prompts a drop-down menu. Click Copy. It's near the top of the drop-down menu. This will copy the ISO file. Double-click your PSP's name. It will be on the left side of the Finder window, just below the \"Devices\" heading. Doing so opens your PSP's folder. Make sure there is an ISO folder on your PSP. Look for a folder entitled \"ISO\" (not \"iso\") in the PSP folder. If you don't see this folder, create one before proceeding:\nClick the File menu item. Click New Folder. Type ISO (not iso) in and press ⏎ Return. Open the \"ISO\" folder. Double-click it to open it. Click Edit again. The drop-down menu will appear. Click Paste. It's near the top of the drop-down menu. Doing so will begin copying the ISO file into the \"ISO\" folder. This process may take a few minutes. Eject and unplug your PSP from the computer. Once the ISO file finishes copying into your PSP's \"ISO\" folder, you can eject your PSP from your computer by clicking the upward-facing arrow to the right of its name. After doing so, it's safe to physically detach the PSP from your Mac. Running Games on the PSP Restart your PSP. To ensure that the game files are properly incorporated, turn off your PSP, then turn it back on using the power button. Select Game. You may have to scroll left or right to select this option. Scroll down to select Memory Stick, then press X. This will open the PSP's internal memory, which is where the game is stored. Select your game and press X. This will load the game. As long as you placed the ISO file inside of the \"ISO\" folder on your PSP, the game will run properly.",
  "tyn_model":[
    "psp",
    "computer",
    "iso",
    "file explorer",
    "↵ enter",
    "flash drive",
    "finder",
    "⏎ return",
    "mac",
    "memory stick"
  ],
  "tyn_section":[

  ]
}