{
  "title":"How to Take a Screenshot on Wii U",
  "url":"https://www.wikihow.com/Take-a-Screenshot-on-Wii-U",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Wii U"
  ],
  "steps":[
    {
      "headline":"Go to the screen you want to capture.",
      "description":"You can take a screenshot of most games and apps on your Wii U and share it on Twitter, Facebook, or Tumblr. Some apps (such as Netflix) don't allow screenshots."
    },
    {
      "headline":"Press the ⇱ Home on the game controller.",
      "description":"This pauses the game or app and opens the Home menu."
    },
    {
      "headline":"Tap the blue globe icon to open the internet browser.",
      "description":"It's at the bottom of the screen."
    },
    {
      "headline":"Type i.nintendo.net into the address bar and tap OK.",
      "description":"The \"https://\" part is already filled in. This brings you to the Wii U Image Share service. If you prefer, you can use a different image uploading website (like Google Photos, Imgur, or Cubeupload). Some upload sites decrease the quality of the screenshot."
    },
    {
      "headline":"Follow the on-screen instructions to sign in.",
      "description":"Select the button for the service you want to share your screenshot with (Facebook, Twitter, or Tumblr), then sign into your account."
    },
    {
      "headline":"Tap Browse on Wii U Image Share.",
      "description":"A screen with two options (the TV and GamePad versions of the screen shots) will appear."
    },
    {
      "headline":"Tap the screenshot you want to share.",
      "description":"This captures the screenshot."
    },
    {
      "headline":"Type your post or tweet.",
      "description":"If you want to include any text, type it into the blank below the uploaded image name."
    },
    {
      "headline":"Tap Post.",
      "description":"This uploads the screenshot and posts it to your (Twitter/Facebook/Twitter) feed."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Go to the screen you want to capture. You can take a screenshot of most games and apps on your Wii U and share it on Twitter, Facebook, or Tumblr. Some apps (such as Netflix) don't allow screenshots. Press the ⇱ Home on the game controller. This pauses the game or app and opens the Home menu. Tap the blue globe icon to open the internet browser. It's at the bottom of the screen. Type i.nintendo.net into the address bar and tap OK. The \"https://\" part is already filled in. This brings you to the Wii U Image Share service. If you prefer, you can use a different image uploading website (like Google Photos, Imgur, or Cubeupload). Some upload sites decrease the quality of the screenshot. Follow the on-screen instructions to sign in. Select the button for the service you want to share your screenshot with (Facebook, Twitter, or Tumblr), then sign into your account. Tap Browse on Wii U Image Share. A screen with two options (the TV and GamePad versions of the screen shots) will appear. Tap the screenshot you want to share. This captures the screenshot. Type your post or tweet. If you want to include any text, type it into the blank below the uploaded image name. Tap Post. This uploads the screenshot and posts it to your (Twitter/Facebook/Twitter) feed. Finished. ",
  "tyn_model":[
    "wii u",
    "⇱ home",
    "game controller",
    "internet browser",
    "wii u image share",
    "image uploading"
  ],
  "tyn_section":[

  ]
}