{
  "title":"How to Create a Great Scrapbook with Friends (for Girls)",
  "url":"https://www.wikihow.com/Create-a-Great-Scrapbook-with-Friends-(for-Girls)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Scrapbooks"
  ],
  "steps":[
    {
      "headline":"Give each friend their own page(s) to decorate.",
      "description":"They can do this with pictures of themselves, what they like, stuff like that."
    },
    {
      "headline":"Choose another page or several pages to detail the activities you like to do together, such as photos taken together in a theme park, at the pool, shopping, visiting a museum or art gallery.",
      "description":""
    },
    {
      "headline":"Make a page with a picture of all/both of you at the beginning of the scrapbook.",
      "description":""
    },
    {
      "headline":"Put in amusing quotes throughout the scrapbook.",
      "description":"If you and your friend(s) say lots of random/funny things, include a page just for quotes; it'll be well worth remembering them down the track! Write each person's quote in their favorite color, maybe in a fancy font."
    },
    {
      "headline":"Add any other favorite items that relate to you and your friends, like ribbons, ticket stubs, notes sent to each other in class etc.",
      "description":""
    },
    {
      "headline":"Decide how to share the scrapbook.",
      "description":"At the end, you'll have one scrapbook between you. Take turns in keeping at home and showing parents/other friends etc. Or, have several weekends in a row where you make a scrapbook each until each one of you has a scrapbook of her own. This can be achieved easily by printing off several copies of photos from your computer, so that no-one need miss out (scan them in if necessary)."
    }
  ],
  "text":" Give each friend their own page(s) to decorate. They can do this with pictures of themselves, what they like, stuff like that. Choose another page or several pages to detail the activities you like to do together, such as photos taken together in a theme park, at the pool, shopping, visiting a museum or art gallery.  Make a page with a picture of all/both of you at the beginning of the scrapbook.  Put in amusing quotes throughout the scrapbook. If you and your friend(s) say lots of random/funny things, include a page just for quotes; it'll be well worth remembering them down the track! Write each person's quote in their favorite color, maybe in a fancy font. Add any other favorite items that relate to you and your friends, like ribbons, ticket stubs, notes sent to each other in class etc.  Decide how to share the scrapbook. At the end, you'll have one scrapbook between you. Take turns in keeping at home and showing parents/other friends etc. Or, have several weekends in a row where you make a scrapbook each until each one of you has a scrapbook of her own. This can be achieved easily by printing off several copies of photos from your computer, so that no-one need miss out (scan them in if necessary).",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}