{
  "title":"How to Access Master Packs on Star Wars: Card Trader",
  "url":"https://www.wikihow.com/Access-Master-Packs-on-Star-Wars:-Card-Trader",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "parts":[
    {
      "name":"Buying Credits",
      "steps":[
        {
          "headline":"Launch Star Wars: Card Trader.",
          "description":"Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it."
        },
        {
          "headline":"Go to the Cantina.",
          "description":"The Cantina is the app’s store. Tap on the Cantina or marketplace icon on the bottom toolbar to access it. The Main Cantina is where you can see the available card packs for purchase. You can see the different Base Packs available for everyone, including free users."
        },
        {
          "headline":"Tap on the Credits menu from the left panel to see all the credit packages available.",
          "description":"You can buy different amounts of credits, from as little as 3,000 Credits at $0.99 to as much as 900,000 Credits at $99.99."
        },
        {
          "headline":"Select a credit package to buy.",
          "description":"From the list of available credit packages, select the one you’d like to buy by tapping on the price button beside the package. Sign into the iTunes Store. Your purchase will be processed within iTunes Store. You will be prompted to sign in with your Apple ID. Type your password and tap the “OK” button."
        },
        {
          "headline":"View your total credits.",
          "description":"iTunes Store will validate and process your purchase. Once done, you will receive your purchased credits. Your total credits are displayed on the top left corner of the screen."
        }
      ]
    },
    {
      "name":"Accessing Master Packs",
      "steps":[
        {
          "headline":"Go to the Main Cantina.",
          "description":"Tap on the Main Cantina menu from the left panel to view the available card packs."
        },
        {
          "headline":"View the available packs.",
          "description":"Aside from the Base Packs you saw earlier, you now can see the Master packs available as well. The Master Packs were unlocked when you purchased a credit package. The Master Packs access will be available to you for one day only. You will have to buy credits again the next day to gain back access."
        },
        {
          "headline":"Buy a Master Pack.",
          "description":"From the list of Master Packs, select the one you’d like to buy. Tap on the corresponding button with the cost in credits to buy the pack. Master Packs can be more expensive than Base Packs, but they can contain the more special and rarest of the cards."
        }
      ]
    }
  ],
  "text":" Buying Credits Launch Star Wars: Card Trader. Locate the app on your device. The app icon has the Star Wars logo on it with some cards in the background. Tap on it. Go to the Cantina. The Cantina is the app’s store. Tap on the Cantina or marketplace icon on the bottom toolbar to access it. The Main Cantina is where you can see the available card packs for purchase. You can see the different Base Packs available for everyone, including free users. Tap on the Credits menu from the left panel to see all the credit packages available. You can buy different amounts of credits, from as little as 3,000 Credits at $0.99 to as much as 900,000 Credits at $99.99. Select a credit package to buy. From the list of available credit packages, select the one you’d like to buy by tapping on the price button beside the package. Sign into the iTunes Store. Your purchase will be processed within iTunes Store. You will be prompted to sign in with your Apple ID. Type your password and tap the “OK” button. View your total credits. iTunes Store will validate and process your purchase. Once done, you will receive your purchased credits. Your total credits are displayed on the top left corner of the screen. Accessing Master Packs Go to the Main Cantina. Tap on the Main Cantina menu from the left panel to view the available card packs. View the available packs. Aside from the Base Packs you saw earlier, you now can see the Master packs available as well. The Master Packs were unlocked when you purchased a credit package. The Master Packs access will be available to you for one day only. You will have to buy credits again the next day to gain back access. Buy a Master Pack. From the list of Master Packs, select the one you’d like to buy. Tap on the corresponding button with the cost in credits to buy the pack. Master Packs can be more expensive than Base Packs, but they can contain the more special and rarest of the cards.",
  "tyn_model":[
    "itunes store",
    "star wars: card trader",
    "star wars logo",
    "credit package",
    "apple id",
    "“ok",
    "” button"
  ],
  "tyn_section":[

  ]
}