{
  "title":"How to Eliminate Red Eye With Photoshop CS3",
  "url":"https://www.wikihow.com/Eliminate-Red-Eye-With-Photoshop-CS3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Editing",
    "Editing Red Eye in Photos"
  ],
  "methods":[
    {
      "name":"Red eye tool",
      "steps":[
        {
          "headline":"Open up Adobe Photoshop CS3.",
          "description":""
        },
        {
          "headline":"Click and hold the bandage icon on the left side of the screen.",
          "description":"Select the option Red Eye Tool that slides out as an extra feature."
        },
        {
          "headline":"Select the area you want to correct with the Photoshop Red Eye Tool.",
          "description":"This tool allows you to select the area that you want the red eye tool to look in for a circle object that represents the eye."
        },
        {
          "headline":"Release the area that you selected.",
          "description":"The program will cover the pupil with a darker color. From close up it may look a little weird but from the original zoom distance it looks good."
        },
        {
          "headline":"Do the same for the other eye.",
          "description":""
        },
        {
          "headline":"You're finished!",
          "description":"Enjoy your natural colored eyes on the photos."
        }
      ]
    },
    {
      "name":"Opacity red eye removal",
      "steps":[
        {
          "headline":"Select each eye with the selection tool.",
          "description":"Create this as two new layers."
        },
        {
          "headline":"Use the Red Eye Tool on each new layer and remove the red eye.",
          "description":""
        },
        {
          "headline":"Go to each new layer and drop the opacity level to blend the red eye fix to a more natural state.",
          "description":""
        }
      ]
    }
  ],
  "text":" Red eye tool Open up Adobe Photoshop CS3.  Click and hold the bandage icon on the left side of the screen. Select the option Red Eye Tool that slides out as an extra feature. Select the area you want to correct with the Photoshop Red Eye Tool. This tool allows you to select the area that you want the red eye tool to look in for a circle object that represents the eye. Release the area that you selected. The program will cover the pupil with a darker color. From close up it may look a little weird but from the original zoom distance it looks good. Do the same for the other eye.  You're finished! Enjoy your natural colored eyes on the photos. Opacity red eye removal Select each eye with the selection tool. Create this as two new layers. Use the Red Eye Tool on each new layer and remove the red eye.  Go to each new layer and drop the opacity level to blend the red eye fix to a more natural state. ",
  "tyn_model":[
    "red eye tool",
    "adobe photoshop",
    "photoshop red eye tool",
    "red eye removal",
    "red eye"
  ],
  "tyn_section":[

  ]
}