{
  "title":"How to Find the Blue Ring in the Legend of Zelda",
  "url":"https://www.wikihow.com/Find-the-Blue-Ring-in-the-Legend-of-Zelda",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "The Legend of Zelda Series"
  ],
  "methods":[
    {
      "name":"Finding the Blue Ring in the Legend of Zelda",
      "steps":[
        {
          "headline":"Find the secret shop.",
          "description":"From the starting point on the map (at the bottom-middle), head one map tile up and then take three map tiles to the left (there are two bushes at the third tile that serves as a landmark). Once you get to the third tile, move three more map tiles up until you get to the place where six statues can be found. This is where a secret shop can be found."
        },
        {
          "headline":"Enter the secret shop.",
          "description":"Approach the middle statue on the upper row and push it down. This will reveal a secret stair going underground. Take the stairs, and it will lead you to the secret shop."
        },
        {
          "headline":"Buy the Blue Ring.",
          "description":"The Blue Ring can be bought from the secret shop here for 250 Rupees. Approach the secret shop merchant, and talk to him to purchase and obtain the Blue Ring."
        }
      ]
    },
    {
      "name":"Finding the Blue Ring in the Oracle of Seasons",
      "steps":[
        {
          "headline":"Go to the Sea of No Return.",
          "description":"The Sea of No Return is the easternmost area in the map of the game. It houses the eighth and last dungeon of the game, the Ancient Tomb. The Sea of No Return can be only be accessed through a cave found on the Crescent Island, the area on the southeast corner of the game’s map."
        },
        {
          "headline":"Find the eastern statue.",
          "description":"There are three statues found on the Sea of No Return area—on the the top left corner, one at the bottom, and another one on the eastern side. Head to the eastern side of the place to find a blue statue that blocks the path."
        },
        {
          "headline":"Equip the Power Glove.",
          "description":"Press the “Start” button on your controller to open Link’s bag and show your character’s item inventory. Use the arrow keys on your controller to move around the inventory list and highlight the Power Glove, which allows you to lift heavy objects. Press the A button on the controller to equip the item. The Power Glove can be obtained inside the Ancient Tomb, the eighth level of the game found on the same area."
        },
        {
          "headline":"Lift the blue statue.",
          "description":"Press the “A” button and press the back arrow on the keypad on your controller to lift and break the blue statue, revealing a treasure chest below."
        },
        {
          "headline":"Open the chest.",
          "description":"Press the “A” button once more to open the chest. Inside you’ll find an unknown ring that you need to have appraised."
        },
        {
          "headline":"Appraise the ring.",
          "description":"Go to Vasu the Jeweler’s shop found in Horon Village, right at the middle of the game map. Talk to him, and he will appraise the unknown ring you found for 20 Rupees, turning it into the Blue Ring."
        }
      ]
    }
  ],
  "text":" Finding the Blue Ring in the Legend of Zelda Find the secret shop. From the starting point on the map (at the bottom-middle), head one map tile up and then take three map tiles to the left (there are two bushes at the third tile that serves as a landmark). Once you get to the third tile, move three more map tiles up until you get to the place where six statues can be found. This is where a secret shop can be found. Enter the secret shop. Approach the middle statue on the upper row and push it down. This will reveal a secret stair going underground. Take the stairs, and it will lead you to the secret shop. Buy the Blue Ring. The Blue Ring can be bought from the secret shop here for 250 Rupees. Approach the secret shop merchant, and talk to him to purchase and obtain the Blue Ring. Finding the Blue Ring in the Oracle of Seasons Go to the Sea of No Return. The Sea of No Return is the easternmost area in the map of the game. It houses the eighth and last dungeon of the game, the Ancient Tomb. The Sea of No Return can be only be accessed through a cave found on the Crescent Island, the area on the southeast corner of the game’s map. Find the eastern statue. There are three statues found on the Sea of No Return area—on the the top left corner, one at the bottom, and another one on the eastern side. Head to the eastern side of the place to find a blue statue that blocks the path. Equip the Power Glove. Press the “Start” button on your controller to open Link’s bag and show your character’s item inventory. Use the arrow keys on your controller to move around the inventory list and highlight the Power Glove, which allows you to lift heavy objects. Press the A button on the controller to equip the item. The Power Glove can be obtained inside the Ancient Tomb, the eighth level of the game found on the same area. Lift the blue statue. Press the “A” button and press the back arrow on the keypad on your controller to lift and break the blue statue, revealing a treasure chest below. Open the chest. Press the “A” button once more to open the chest. Inside you’ll find an unknown ring that you need to have appraised. Appraise the ring. Go to Vasu the Jeweler’s shop found in Horon Village, right at the middle of the game map. Talk to him, and he will appraise the unknown ring you found for 20 Rupees, turning it into the Blue Ring.",
  "tyn_model":[
    "power glove",
    "” button",
    "“a",
    "blue ring",
    "secret shop",
    "—on",
    "“start",
    "jeweler"
  ],
  "tyn_section":[

  ]
}