{
  "title":"How to Save a Dying Cactus",
  "url":"https://www.wikihow.com/Save-a-Dying-Cactus",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Succulents and Cacti"
  ],
  "methods":[
    {
      "name":"Providing Immediate Care",
      "steps":[
        {
          "headline":"Give more water to a wilting cactus.",
          "description":"If parts of the cactus appear shrunken, wrinkled, or wilting (drooping or appearing limp), it probably needs more water. If the soil is fully dry, water it thoroughly, allowing excess water to drain out the bottom of the pot. If the soil is not dry, the problem could be a condition called etiolation, where the rounded or stem-shaped parts of the cactus become narrower. This tells you that the cactus needs more sunlight, so move the pot to a southern- or western-facing window."
        },
        {
          "headline":"Cut away rotting parts.",
          "description":"Any brown or black segments should be cut away. Rotting can be caused by a fungus that appears after overwatering. If the soil is soaked throughout, remove the plant and repot in a measured soil blend. If it is not entirely soaked, let the soil dry completely before watering again. A standard mixture of soil for cacti of desert origin consists of two parts garden soil, two parts coarse sand, and one part peat."
        },
        {
          "headline":"Give more light to a narrowing cactus.",
          "description":"Spherical or other rounded cacti with pointy tops, or narrowing and stringy stems in column-shaped cacti, are signs of a condition called etiolation. Insufficient sunlight is the cause, so find a spot in the home that gets sunlight for a longer period (a southern-facing window) or more intense sunlight(a western-facing window)."
        },
        {
          "headline":"Look for yellowing skin.",
          "description":"If the parts of the sun-facing side of the plant have yellowish or brownish skin, it is getting too much sunlight. Move it immediately to a spot with better shade, such as an east-facing window, which gets gentle sunlight. Wait to see how the cactus responds to its new shadier location. If the yellowed segments don’t improve in a few weeks, cut them away up to the healthy, green areas."
        },
        {
          "headline":"Do away with insects.",
          "description":"The main insect pests that can damage cacti are mealybugs and spider mites. Mealybugs are tiny, powdery white, and appear in clusters. Spider mites are red, also quite small, and spin sheet-like webs between the cactus’s spines. To remove both these, apply rubbing alcohol directly to the infested areas with a cotton swab. A miticide may also be used for spider mites."
        }
      ]
    },
    {
      "name":"Ensuring Long-Term Health",
      "steps":[
        {
          "headline":"Use an appropriate soil mixture.",
          "description":"For most cacti of desert origin, a good general soil mixture consists of two parts garden soil, two parts coarse sand, and one part peat. This mixture is meant to drain well, and not harden when it is dry. Use a clay pot as well--their heaviness helps keep bulkier cacti from tipping over; they also allow the soil to breathe, preventing the roots from rotting."
        },
        {
          "headline":"Water only when the soil is dry.",
          "description":"Test the moisture level by pressing your finger into the top inch of the soil. If it is completely dry, water the cactus fully, allowing excess water to drain out the hole in the bottom of the pot"
        },
        {
          "headline":"Adjust watering according to the seasons.",
          "description":"Cacti need different amounts of water depending on whether they’re growing or dormant. During the growing season of March to September, water them, on average, once a month. During the dormant season of October to February, water only once per month at the most. Watering too much during the dormant season is the main cause of complications with cacti."
        },
        {
          "headline":"Provide enough sunlight.",
          "description":"Most cacti need lots of sun. In the summer, keep the cactus outdoors, being careful not to let it get too much rain. Start it in a shady area at first, gradually moving it into sunnier areas to avoid sunburn. In the winter, place the pot in a southern- or western- facing window, which have the best sun exposure."
        },
        {
          "headline":"Monitor the room temperature.",
          "description":"Cacti like cooler temperatures during their dormant period in the winter. But be careful to keep them out of the way of drafts--away from leaky windows and off the floor near doors. A healthy temperature range at night in the winter is 45 - 60 degrees Fahrenheit (7 - 16 degrees Celsius), so a basement or a room that gets less heat would be suitable storage areas during this period. Unless you have a cold-hardy cactus, be careful not to let the room temperature drop below freezing, since most cacti can’t tolerate frost."
        },
        {
          "headline":"Repot your cactus according to its growth.",
          "description":"You’ll know it’s time to transplant your cactus to a larger pot when either it becomes too top-heavy for the pot to support it, or when it grows within one inch of the edge of the pot. Use a standard potting mixture consisting of two parts garden soil, two parts coarse sand, and one part peat. Replant the cactus at the same level in the soil as it was in the original pot."
        },
        {
          "headline":"Cut away dead roots.",
          "description":"A common result of over-watering is root rot, which happens when roots sit for too long in poorly-drained, moist soil. Before repotting, gently brush away the soil from the roots after removing the old soil ball from the original pot. Inspect the root system, and cut away any soft black roots, or any dried-up roots that appear dead. Cut just up to the part of the root that is still living. You can avoid root rot by making sure the your pot has a hole in the bottom for drainage, and that it never sits in excess water that collects in a saucer underneath the pot."
        },
        {
          "headline":"Don’t immediately repot damaged roots.",
          "description":"If the roots are damaged when you remove the cactus from its original pot, or if you needed to cut away dead roots, let the cactus sit for about ten days out of its soil. This will allow it time to form calluses around the damaged or cut areas. Place it on a piece of paper, out of the sun but away from cool temperatures. Cacti do best after repotting if you transplant them during the growing season (March to September). Most cacti should generally be repotted every one-to-two years."
        },
        {
          "headline":"Use a fertilizer low in nitrogen.",
          "description":"Most fertilizers are given a number rating that indicates how much nitrogen, phosphorus, and potassium they contain (in the form: N-Ph.-Po.) An example of a low-nitrogen fertilizer appropriate for cacti is 10-30-20, where the Nitrogen content is rated at 10. Too much nitrogen gives the cactus a flabby texture that impedes its growth. Never fertilize a cactus during the dormant season (October to February)."
        },
        {
          "headline":"Wash away dust and dirt.",
          "description":"If the skin of your cactus is dusty or dirty, it may not be able to photosynthesize properly. Wash off this residue with a rag or sponge and a solution of with one drop of dish soap. Then rinse the plant under a faucet or with a soaked sponge."
        }
      ]
    }
  ],
  "text":" Providing Immediate Care Give more water to a wilting cactus. If parts of the cactus appear shrunken, wrinkled, or wilting (drooping or appearing limp), it probably needs more water. If the soil is fully dry, water it thoroughly, allowing excess water to drain out the bottom of the pot. If the soil is not dry, the problem could be a condition called etiolation, where the rounded or stem-shaped parts of the cactus become narrower. This tells you that the cactus needs more sunlight, so move the pot to a southern- or western-facing window. Cut away rotting parts. Any brown or black segments should be cut away. Rotting can be caused by a fungus that appears after overwatering. If the soil is soaked throughout, remove the plant and repot in a measured soil blend. If it is not entirely soaked, let the soil dry completely before watering again. A standard mixture of soil for cacti of desert origin consists of two parts garden soil, two parts coarse sand, and one part peat. Give more light to a narrowing cactus. Spherical or other rounded cacti with pointy tops, or narrowing and stringy stems in column-shaped cacti, are signs of a condition called etiolation. Insufficient sunlight is the cause, so find a spot in the home that gets sunlight for a longer period (a southern-facing window) or more intense sunlight(a western-facing window). Look for yellowing skin. If the parts of the sun-facing side of the plant have yellowish or brownish skin, it is getting too much sunlight. Move it immediately to a spot with better shade, such as an east-facing window, which gets gentle sunlight. Wait to see how the cactus responds to its new shadier location. If the yellowed segments don’t improve in a few weeks, cut them away up to the healthy, green areas. Do away with insects. The main insect pests that can damage cacti are mealybugs and spider mites. Mealybugs are tiny, powdery white, and appear in clusters. Spider mites are red, also quite small, and spin sheet-like webs between the cactus’s spines. To remove both these, apply rubbing alcohol directly to the infested areas with a cotton swab. A miticide may also be used for spider mites. Ensuring Long-Term Health Use an appropriate soil mixture. For most cacti of desert origin, a good general soil mixture consists of two parts garden soil, two parts coarse sand, and one part peat. This mixture is meant to drain well, and not harden when it is dry. Use a clay pot as well--their heaviness helps keep bulkier cacti from tipping over; they also allow the soil to breathe, preventing the roots from rotting. Water only when the soil is dry. Test the moisture level by pressing your finger into the top inch of the soil. If it is completely dry, water the cactus fully, allowing excess water to drain out the hole in the bottom of the pot Adjust watering according to the seasons. Cacti need different amounts of water depending on whether they’re growing or dormant. During the growing season of March to September, water them, on average, once a month. During the dormant season of October to February, water only once per month at the most. Watering too much during the dormant season is the main cause of complications with cacti. Provide enough sunlight. Most cacti need lots of sun. In the summer, keep the cactus outdoors, being careful not to let it get too much rain. Start it in a shady area at first, gradually moving it into sunnier areas to avoid sunburn. In the winter, place the pot in a southern- or western- facing window, which have the best sun exposure. Monitor the room temperature. Cacti like cooler temperatures during their dormant period in the winter. But be careful to keep them out of the way of drafts--away from leaky windows and off the floor near doors. A healthy temperature range at night in the winter is 45 - 60 degrees Fahrenheit (7 - 16 degrees Celsius), so a basement or a room that gets less heat would be suitable storage areas during this period. Unless you have a cold-hardy cactus, be careful not to let the room temperature drop below freezing, since most cacti can’t tolerate frost. Repot your cactus according to its growth. You’ll know it’s time to transplant your cactus to a larger pot when either it becomes too top-heavy for the pot to support it, or when it grows within one inch of the edge of the pot. Use a standard potting mixture consisting of two parts garden soil, two parts coarse sand, and one part peat. Replant the cactus at the same level in the soil as it was in the original pot. Cut away dead roots. A common result of over-watering is root rot, which happens when roots sit for too long in poorly-drained, moist soil. Before repotting, gently brush away the soil from the roots after removing the old soil ball from the original pot. Inspect the root system, and cut away any soft black roots, or any dried-up roots that appear dead. Cut just up to the part of the root that is still living. You can avoid root rot by making sure the your pot has a hole in the bottom for drainage, and that it never sits in excess water that collects in a saucer underneath the pot. Don’t immediately repot damaged roots. If the roots are damaged when you remove the cactus from its original pot, or if you needed to cut away dead roots, let the cactus sit for about ten days out of its soil. This will allow it time to form calluses around the damaged or cut areas. Place it on a piece of paper, out of the sun but away from cool temperatures. Cacti do best after repotting if you transplant them during the growing season (March to September). Most cacti should generally be repotted every one-to-two years. Use a fertilizer low in nitrogen. Most fertilizers are given a number rating that indicates how much nitrogen, phosphorus, and potassium they contain (in the form: N-Ph.-Po.) An example of a low-nitrogen fertilizer appropriate for cacti is 10-30-20, where the Nitrogen content is rated at 10. Too much nitrogen gives the cactus a flabby texture that impedes its growth. Never fertilize a cactus during the dormant season (October to February). Wash away dust and dirt. If the skin of your cactus is dusty or dirty, it may not be able to photosynthesize properly. Wash off this residue with a rag or sponge and a solution of with one drop of dish soap. Then rinse the plant under a faucet or with a soaked sponge.",
  "tyn_model":[
    "water",
    "pot",
    "garden soil",
    "peat",
    "nitrogen",
    "coarse sand",
    "fertilizer",
    "sponge",
    "soil",
    "cactus",
    "insects",
    "rubbing alcohol",
    "cotton swab",
    "clay pot",
    "cacti",
    "potting mixture",
    "saucer",
    "fertilizers",
    "phosphorus",
    "dish soap"
  ],
  "tyn_section":[

  ]
}