{
  "title":"How to Play the Xbox",
  "url":"https://www.wikihow.com/Play-the-Xbox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox"
  ],
  "parts":[
    {
      "name":"Setting up Your Xbox",
      "steps":[
        {
          "headline":"Hook your console up to the power supply.",
          "description":"Plug one end of the slotted power cable into the main power port on the back of the console. Insert the opposite, double-pronged end into the nearest wall outlet. This cable will provide the electricity needed to power your Xbox. Make sure the power cord is securely connected to the rectangular adapter box in the center as well as at both ends. The power cable features an oblong plug with 2 round slots, unlike the HDMI cord, which is flat on both ends."
        },
        {
          "headline":"Connect the included HDMI cord to both the console and your TV.",
          "description":"Insert one end of the cord into the HDMI output on the backside of your Xbox and run the other to the matching HDMI input on your TV. You’ll find the HDMI port on either the back or side of most newer TVs. The HDMI cord is how your console will send and receive video and audio signals.Tip: If you’re playing an older system, like the 360 or original Xbox, you’ll also need to hook up the multicolored audio/video cables to both your console and TV in order to get picture and sound."
        },
        {
          "headline":"Install 2 AA batteries in your Xbox controller.",
          "description":"Remove the battery compartment cover from the backside of the controller by pulling up on the small tab. Stick a AA battery in each of the slots, double-checking that the “+” and “-” ends are oriented correctly. When you’re done, replace the battery compartment cover. Once you’ve installed fresh batteries in your controller, you’ll be able to move it around freely as you play without tangling or unplugging the cord. If you have a second controller, don’t forget to put batteries in it as well in case you want to play with a friend."
        },
        {
          "headline":"Touch the Xbox logo on the front of the console to turn it on.",
          "description":"This logo serves as the power button for the system. When you press it, a brief startup animation will play on the screen, and you’ll be given a brief walkthrough on how to finish setting up your system. You’ll also use this button to turn off the console when you’re done playing. The power button on the 360 and One are touch-sensitive, so avoid pushing on them too hard or you might break them."
        },
        {
          "headline":"Activate your controller to continue setting up your system.",
          "description":"Wait for the controller diagram to appear on the screen, then press and hold the Xbox logo button on the front side the controller to turn it on. The system should detect the controller after a few seconds. Once it does, press the “A” button to proceed. If your Xbox doesn’t recognize your controller, press and hold the small button on the top lefthand side of the controller and the matching button on the lefthand side of the console to sync it."
        },
        {
          "headline":"Follow the prompts onscreen to complete the setup process.",
          "description":"If it’s your first time loading up your Xbox, you’ll be asked to choose a language and specify your location. This information will be used to help you navigate the main dashboard menu, set your console to the correct time zone, and match you up with other gamers from around the world for online play. It may take several minutes for your Xbox to install important updates once the set process is complete."
        },
        {
          "headline":"Connect to the Internet to download and play games via Xbox Live.",
          "description":"If you're accessing the Internet directly from a router, just plug an Ethernet cable directly into the port on the back of the console and you're good to go. If you're using a WiFi connection, find the connection you want to use in the list of available networks, then log in using your network password. As long as you’re signed in to your Microsoft account and connected to the Internet, you’ll be able to take advantage of Xbox Live features. If you encounter any issues with your internet signal during setup, try manually resetting your router and waiting a few minutes to see if it fixes the problem."
        }
      ]
    },
    {
      "name":"Creating and Customizing Your Gamer Profile",
      "steps":[
        {
          "headline":"Make a new Microsoft account, or sign into an existing account.",
          "description":"If you already have an account with another Microsoft product or service, you can use it to sign in right away. Otherwise, you’ll need to create a new account from scratch. Select the “Get a New Account” option, then enter your desired username, along with the password you want to use to sign in. You won’t have to create an account if you have an existing Outlook.com email address, or if you use Skype or Windows Phone. At this point, you can either set your system to sign you in automatically whenever you turn it on or ask you for a passkey each time. Instant sign-in will be easiest if you’re the only person who will be playing your Xbox. If others may be using it, a passkey will offer greater security."
        },
        {
          "headline":"Pick out a color scheme to personalize your Xbox dashboard.",
          "description":"On the next screen, you’ll be shown a series of colored squares. Selecting one of these squares will change the color scheme on the system’s dashboard and sub-menus. The available color schemes range from the default green to blue, purple, orange, red and brown, so you’ll have quite a few options to choose from. The dashboard is the main menu screen that appears when you first turn the system on. You can return to your dashboard at any time by pressing the Xbox button on your controller. If you decide you want to change your color scheme later on, it's possible to do so by accessing your gamer profile page."
        },
        {
          "headline":"Customize your Xbox gamertag.",
          "description":"Press the Xbox button on your controller, then highlight and select your gamerpic in the upper lefthand corner of the screen. From there, select the “My Profile” option, then hit “Customize my Profile” and enter your new, custom gamertag. When you’re satisfied, select “Claim It,” “Sounds Good,” and” finally “Close” to return to the main dashboard. When you first set up your Microsoft account, you’ll be assigned a randomly-generated gamertag. You can change your gamertag at any time by visiting your profile page. Try to come up with a catchy, unique gamertag that allows you to express yourself as a gamer. A lot of the more obvious gamertags have already been claim, so be prepared to get creative!Tip: You’ll only be able to change your gamertag for free once. After that, you’ll have to pay a small fee each time you want to update it."
        },
        {
          "headline":"Sign up for Xbox Gold for free and exclusive content.",
          "description":"Finally, you’ll be asked if you want to upgrade to Xbox Gold, which is Microsoft’s premium subscription service for Xbox players. With Gold, you’ll get access to 2-4 free games and apps each month, as well as in-store discounts of up to 75% off. If you want to sign up, choose your preferred subscription length, then put in your personal info and credit card number..\nA subscription to Xbox Gold currently costs $9.99 per month in the US. It’s not necessary to have an Xbox Gold subscription in order to begin playing games on your console."
        }
      ]
    },
    {
      "name":"Playing Games",
      "steps":[
        {
          "headline":"Slide a game disc into the disc slot on the front of the console.",
          "description":"If you own a physical copy of the game you want to play, remove it from its protective case and insert the edge into the disc slot. The rest of the disc should slip in by itself. To begin playing, select the title of the game from the top of the main dashboard. Make sure the label displaying the game’s title and artwork is facing up. When you’re ready to switch games, hold the Xbox button on your controller and select the option to “Eject disc,” or tap the small eject button beside the disc slot."
        },
        {
          "headline":"Purchase games online through the Xbox game store.",
          "description":"Access the game store by visiting the “Games” section on the main dashboard. From there, you can browse various titles, including new and recommended releases, free games, and sale items. Once you’ve downloaded a game to your console, you’ll be able to play it whenever you want without having to put in a disc. Keep in mind that you’ll need to add your credit card information to your profile if you want to be able to buy games online."
        },
        {
          "headline":"Use Xbox Live to enjoy multiplayer gaming online.",
          "description":"If you’re signed in to your Microsoft account and connected to the internet, you’ll already be logged on to Xbox Live. Playing online is then as simple as loading a game and choosing the online multiplayer mode. You’ll have the choice to either play a game with select friends or be matched up with other players from around the world at random. First-person shooters, puzzle solvers, and fighting and racing games are some of the best games to play with other people. Exchange gamertags with your friends so you can all join in the same multiplayer sessions together."
        },
        {
          "headline":"Explore a wide range of titles to try out different styles of gameplay.",
          "description":"There are hundreds of Xbox games to choose from. Maybe you’re a fan of first-person shooters like Fortnite, Call of Duty, or Halo, or perhaps you’re more into open-world adventures like Red Dead Redemption 2 or the Assassin’s Creed or Far Cry series. Whatever you’re into, you’re sure to find a game that suits your interests! Some of the most popular Xbox titles of 2018 include Destiny 2, Overwatch, Call of Duty: Black Ops 4, NBA2K19, Forza Horizon 4, and Grand Theft Auto V.Tip: New titles are added to the Xbox game store every week, so be sure to check back frequently."
        }
      ]
    }
  ],
  "text":" Setting up Your Xbox Hook your console up to the power supply. Plug one end of the slotted power cable into the main power port on the back of the console. Insert the opposite, double-pronged end into the nearest wall outlet. This cable will provide the electricity needed to power your Xbox. Make sure the power cord is securely connected to the rectangular adapter box in the center as well as at both ends. The power cable features an oblong plug with 2 round slots, unlike the HDMI cord, which is flat on both ends. Connect the included HDMI cord to both the console and your TV. Insert one end of the cord into the HDMI output on the backside of your Xbox and run the other to the matching HDMI input on your TV. You’ll find the HDMI port on either the back or side of most newer TVs. The HDMI cord is how your console will send and receive video and audio signals.Tip: If you’re playing an older system, like the 360 or original Xbox, you’ll also need to hook up the multicolored audio/video cables to both your console and TV in order to get picture and sound. Install 2 AA batteries in your Xbox controller. Remove the battery compartment cover from the backside of the controller by pulling up on the small tab. Stick a AA battery in each of the slots, double-checking that the “+” and “-” ends are oriented correctly. When you’re done, replace the battery compartment cover. Once you’ve installed fresh batteries in your controller, you’ll be able to move it around freely as you play without tangling or unplugging the cord. If you have a second controller, don’t forget to put batteries in it as well in case you want to play with a friend. Touch the Xbox logo on the front of the console to turn it on. This logo serves as the power button for the system. When you press it, a brief startup animation will play on the screen, and you’ll be given a brief walkthrough on how to finish setting up your system. You’ll also use this button to turn off the console when you’re done playing. The power button on the 360 and One are touch-sensitive, so avoid pushing on them too hard or you might break them. Activate your controller to continue setting up your system. Wait for the controller diagram to appear on the screen, then press and hold the Xbox logo button on the front side the controller to turn it on. The system should detect the controller after a few seconds. Once it does, press the “A” button to proceed. If your Xbox doesn’t recognize your controller, press and hold the small button on the top lefthand side of the controller and the matching button on the lefthand side of the console to sync it. Follow the prompts onscreen to complete the setup process. If it’s your first time loading up your Xbox, you’ll be asked to choose a language and specify your location. This information will be used to help you navigate the main dashboard menu, set your console to the correct time zone, and match you up with other gamers from around the world for online play. It may take several minutes for your Xbox to install important updates once the set process is complete. Connect to the Internet to download and play games via Xbox Live. If you're accessing the Internet directly from a router, just plug an Ethernet cable directly into the port on the back of the console and you're good to go. If you're using a WiFi connection, find the connection you want to use in the list of available networks, then log in using your network password. As long as you’re signed in to your Microsoft account and connected to the Internet, you’ll be able to take advantage of Xbox Live features. If you encounter any issues with your internet signal during setup, try manually resetting your router and waiting a few minutes to see if it fixes the problem. Creating and Customizing Your Gamer Profile Make a new Microsoft account, or sign into an existing account. If you already have an account with another Microsoft product or service, you can use it to sign in right away. Otherwise, you’ll need to create a new account from scratch. Select the “Get a New Account” option, then enter your desired username, along with the password you want to use to sign in. You won’t have to create an account if you have an existing Outlook.com email address, or if you use Skype or Windows Phone. At this point, you can either set your system to sign you in automatically whenever you turn it on or ask you for a passkey each time. Instant sign-in will be easiest if you’re the only person who will be playing your Xbox. If others may be using it, a passkey will offer greater security. Pick out a color scheme to personalize your Xbox dashboard. On the next screen, you’ll be shown a series of colored squares. Selecting one of these squares will change the color scheme on the system’s dashboard and sub-menus. The available color schemes range from the default green to blue, purple, orange, red and brown, so you’ll have quite a few options to choose from. The dashboard is the main menu screen that appears when you first turn the system on. You can return to your dashboard at any time by pressing the Xbox button on your controller. If you decide you want to change your color scheme later on, it's possible to do so by accessing your gamer profile page. Customize your Xbox gamertag. Press the Xbox button on your controller, then highlight and select your gamerpic in the upper lefthand corner of the screen. From there, select the “My Profile” option, then hit “Customize my Profile” and enter your new, custom gamertag. When you’re satisfied, select “Claim It,” “Sounds Good,” and” finally “Close” to return to the main dashboard. When you first set up your Microsoft account, you’ll be assigned a randomly-generated gamertag. You can change your gamertag at any time by visiting your profile page. Try to come up with a catchy, unique gamertag that allows you to express yourself as a gamer. A lot of the more obvious gamertags have already been claim, so be prepared to get creative!Tip: You’ll only be able to change your gamertag for free once. After that, you’ll have to pay a small fee each time you want to update it. Sign up for Xbox Gold for free and exclusive content. Finally, you’ll be asked if you want to upgrade to Xbox Gold, which is Microsoft’s premium subscription service for Xbox players. With Gold, you’ll get access to 2-4 free games and apps each month, as well as in-store discounts of up to 75% off. If you want to sign up, choose your preferred subscription length, then put in your personal info and credit card number..\nA subscription to Xbox Gold currently costs $9.99 per month in the US. It’s not necessary to have an Xbox Gold subscription in order to begin playing games on your console. Playing Games Slide a game disc into the disc slot on the front of the console. If you own a physical copy of the game you want to play, remove it from its protective case and insert the edge into the disc slot. The rest of the disc should slip in by itself. To begin playing, select the title of the game from the top of the main dashboard. Make sure the label displaying the game’s title and artwork is facing up. When you’re ready to switch games, hold the Xbox button on your controller and select the option to “Eject disc,” or tap the small eject button beside the disc slot. Purchase games online through the Xbox game store. Access the game store by visiting the “Games” section on the main dashboard. From there, you can browse various titles, including new and recommended releases, free games, and sale items. Once you’ve downloaded a game to your console, you’ll be able to play it whenever you want without having to put in a disc. Keep in mind that you’ll need to add your credit card information to your profile if you want to be able to buy games online. Use Xbox Live to enjoy multiplayer gaming online. If you’re signed in to your Microsoft account and connected to the internet, you’ll already be logged on to Xbox Live. Playing online is then as simple as loading a game and choosing the online multiplayer mode. You’ll have the choice to either play a game with select friends or be matched up with other players from around the world at random. First-person shooters, puzzle solvers, and fighting and racing games are some of the best games to play with other people. Exchange gamertags with your friends so you can all join in the same multiplayer sessions together. Explore a wide range of titles to try out different styles of gameplay. There are hundreds of Xbox games to choose from. Maybe you’re a fan of first-person shooters like Fortnite, Call of Duty, or Halo, or perhaps you’re more into open-world adventures like Red Dead Redemption 2 or the Assassin’s Creed or Far Cry series. Whatever you’re into, you’re sure to find a game that suits your interests! Some of the most popular Xbox titles of 2018 include Destiny 2, Overwatch, Call of Duty: Black Ops 4, NBA2K19, Forza Horizon 4, and Grand Theft Auto V.Tip: New titles are added to the Xbox game store every week, so be sure to check back frequently.",
  "tyn_model":[
    "xbox",
    "controller",
    "xbox gold",
    "hdmi cord",
    "” and",
    "console",
    "battery compartment",
    "batteries",
    "xbox live",
    "” option",
    "xbox game store",
    "power cord",
    "power cable",
    "hdmi",
    "xbox controller",
    "“+",
    "“-",
    "” ends",
    "360",
    "xbox logo button",
    "“a",
    "” button",
    "ethernet cable",
    "xbox live features",
    "router",
    "“get",
    "“my",
    "“customize",
    "“claim",
    "” “",
    "” finally",
    "“close",
    "” to",
    "game disc",
    "xbox button",
    "“eject",
    "” or",
    "“games",
    "” section",
    "forza horizon 4"
  ],
  "tyn_section":[

  ]
}