{
  "title":"How to Boil Corned Beef",
  "url":"https://www.wikihow.com/Boil-Corned-Beef",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb"
  ],
  "methods":[
    {
      "name":"Boiling the Beef",
      "steps":[
        {
          "headline":"Submerge the corned beef brisket in a large pot of boiling water boil five hours before you plan to eat; add any included flavoring pack or pickling spice.",
          "description":"If your brisket came without a flavoring packet, then you can make your own. Tie four bay leaves, one tablespoon of coriander seeds, one tablespoon whole mustard seeds, and one tablespoon of whole black peppercorns up in a cheesecloth and add it to the boiling water. You can also add a pint of Guinness to give your corned beef a creamy kick."
        },
        {
          "headline":"Add water to the pot to keep beef covered: boiling water evaporates.",
          "description":""
        },
        {
          "headline":"While boiling the beef, peel and cut the vegetables into large chunks, which you will add to the boiling water after the beef has cooked.",
          "description":""
        },
        {
          "headline":"After 3 1/2 hours of cooking the beef, add the carrots and turnips.",
          "description":"At 3 3/4 hours, add the onions and potatoes. At 4 hours, add the cabbage."
        }
      ]
    },
    {
      "name":"Cutting the Beef",
      "steps":[
        {
          "headline":"Ladle out the cabbage when it is tender and separate the vegetables in a pan.",
          "description":"Carefully move the meat from the water to a cutting board. Keep the juice-the water the beef has been boiling in-hot for serving."
        },
        {
          "headline":"Let the corned beef cool for about 15 to 20 minutes.",
          "description":"Scrape the fat from the meat with a knife or spoon."
        },
        {
          "headline":"Cutting across the grain, slice the meat into 1-inch thick pieces.",
          "description":""
        },
        {
          "headline":"Spoon some of each vegetable into a large soup bowl.",
          "description":"Lay a slice of corned beef on top of the vegetables and pour in about 1/4 cup of the juice."
        }
      ]
    },
    {
      "name":"Ideas for Using the Boiled Corned Beef",
      "steps":[
        {
          "headline":"Make your corned beef into hash and get ready for some serious flavor.",
          "description":"Corned Beef hash is a traditional Irish dish that can be both breakfast and dinner."
        },
        {
          "headline":"Spice up your corned beef hash by making baked eggs in hash nests.",
          "description":"Breakfast guests will admire your ingenuity."
        },
        {
          "headline":"Get traditional by making a New England boiled dinner.",
          "description":"Nothing is quite as warming on a freezing day as salty boiled veggies and corned beef."
        },
        {
          "headline":"Make your corned beef into a pie.",
          "description":"Making a pie is a great way to transform left over corned beef into something entirely new."
        },
        {
          "headline":"Try something totally different by making Scotch eggs covered in corned beef.",
          "description":"Scotch eggs are a traditional yet intriguing and delicious British dish."
        }
      ]
    }
  ],
  "text":" Boiling the Beef Submerge the corned beef brisket in a large pot of boiling water boil five hours before you plan to eat; add any included flavoring pack or pickling spice. If your brisket came without a flavoring packet, then you can make your own. Tie four bay leaves, one tablespoon of coriander seeds, one tablespoon whole mustard seeds, and one tablespoon of whole black peppercorns up in a cheesecloth and add it to the boiling water. You can also add a pint of Guinness to give your corned beef a creamy kick. Add water to the pot to keep beef covered: boiling water evaporates.  While boiling the beef, peel and cut the vegetables into large chunks, which you will add to the boiling water after the beef has cooked.  After 3 1/2 hours of cooking the beef, add the carrots and turnips. At 3 3/4 hours, add the onions and potatoes. At 4 hours, add the cabbage. Cutting the Beef Ladle out the cabbage when it is tender and separate the vegetables in a pan. Carefully move the meat from the water to a cutting board. Keep the juice-the water the beef has been boiling in-hot for serving. Let the corned beef cool for about 15 to 20 minutes. Scrape the fat from the meat with a knife or spoon. Cutting across the grain, slice the meat into 1-inch thick pieces.  Spoon some of each vegetable into a large soup bowl. Lay a slice of corned beef on top of the vegetables and pour in about 1/4 cup of the juice. Ideas for Using the Boiled Corned Beef Make your corned beef into hash and get ready for some serious flavor. Corned Beef hash is a traditional Irish dish that can be both breakfast and dinner. Spice up your corned beef hash by making baked eggs in hash nests. Breakfast guests will admire your ingenuity. Get traditional by making a New England boiled dinner. Nothing is quite as warming on a freezing day as salty boiled veggies and corned beef. Make your corned beef into a pie. Making a pie is a great way to transform left over corned beef into something entirely new. Try something totally different by making Scotch eggs covered in corned beef. Scotch eggs are a traditional yet intriguing and delicious British dish.",
  "tyn_model":[
    "corned beef",
    "water",
    "vegetables",
    "cabbage",
    "corned beef hash",
    "scotch eggs",
    "corned beef brisket",
    "boiling water",
    "pickling spice",
    "coriander",
    "mustard",
    "cheesecloth and",
    "pot",
    "carrots",
    "turnips",
    "onions",
    "potatoes",
    "beef ladle",
    "pan",
    "knife",
    "large soup bowl",
    "baked eggs",
    "pie"
  ],
  "tyn_section":[

  ]
}