{
  "title":"How to Plan a House Move",
  "url":"https://www.wikihow.com/Plan-a-House-Move",
  "category_hierarchy":[
    "Home and Garden",
    "Moving and Removals",
    "Planning to Move"
  ],
  "steps":[
    {
      "headline":"Get Rid of Unnecessary Possessions - Removal companies find that they move items from a basement or attic that haven't been opened since the last house move.",
      "description":"If you know when you are going to move it is time worth spent sifting through stuff that you are never going to use and putting it on e-bay or giving it to the local charity shop."
    },
    {
      "headline":"Plan Your Packaging - Hire plastic crates in advance and or you may choose to purchase your own storage boxes, tape and bubble wrap.",
      "description":"If you are working to a tight budget you may opt to collect boxes that are being thrown out at the local supermarket."
    },
    {
      "headline":"Mark Every Box - Buy some marker pens and take your time to mark up each box.",
      "description":"Firstly with the room it is going to be going into, e.g. Bathroom, Bedroom 1, Bedroom 2, Kitchen and secondly with the key items that are in the box. There is nothing more frustrating than ‘losing’ a box in your new home and having to rifle through boxes that you would have otherwise not opened."
    },
    {
      "headline":"Reserve Parking - If you have residents parking, you may need to speak to a local council and suspend the parking bay to allow access for the removal vans.",
      "description":"You should do this a few weeks in advance of your move. You may have to do this at your destination address as well."
    },
    {
      "headline":"Utilities & Insurance - Make sure all utilities are notified before you move and that you have checked your insurances.",
      "description":""
    },
    {
      "headline":"Cleaning - If you can afford it, pay for a cleaning service to clean your house as you leave.",
      "description":"Managing a move and moving in at the other end is enough stress to cope with, let alone trying to give your previous house a spring clean at the same time."
    }
  ],
  "text":" Get Rid of Unnecessary Possessions - Removal companies find that they move items from a basement or attic that haven't been opened since the last house move. If you know when you are going to move it is time worth spent sifting through stuff that you are never going to use and putting it on e-bay or giving it to the local charity shop. Plan Your Packaging - Hire plastic crates in advance and or you may choose to purchase your own storage boxes, tape and bubble wrap. If you are working to a tight budget you may opt to collect boxes that are being thrown out at the local supermarket. Mark Every Box - Buy some marker pens and take your time to mark up each box. Firstly with the room it is going to be going into, e.g. Bathroom, Bedroom 1, Bedroom 2, Kitchen and secondly with the key items that are in the box. There is nothing more frustrating than ‘losing’ a box in your new home and having to rifle through boxes that you would have otherwise not opened. Reserve Parking - If you have residents parking, you may need to speak to a local council and suspend the parking bay to allow access for the removal vans. You should do this a few weeks in advance of your move. You may have to do this at your destination address as well. Utilities & Insurance - Make sure all utilities are notified before you move and that you have checked your insurances.  Cleaning - If you can afford it, pay for a cleaning service to clean your house as you leave. Managing a move and moving in at the other end is enough stress to cope with, let alone trying to give your previous house a spring clean at the same time.",
  "tyn_model":[
    "utilities",
    "plastic crates",
    "tape",
    "bubble wrap",
    "marker pens",
    "‘losing",
    "’ a"
  ],
  "tyn_section":[

  ]
}