{
  "title":"How to Make Vegetarian Pasta with Fresh Tomatoes",
  "url":"https://www.wikihow.com/Make-Vegetarian-Pasta-with-Fresh-Tomatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegetarian Pasta"
  ],
  "methods":[
    {
      "name":"Cooking the Sauce",
      "steps":[
        {
          "headline":"Wash the tomatoes and remove the core.",
          "description":""
        },
        {
          "headline":"Cut the tomatoes into quarters",
          "description":""
        },
        {
          "headline":"Crush the quartered tomatoes  in a food processor or blender until it looks like a slush.",
          "description":""
        },
        {
          "headline":"Pour the crushed tomatoes into an empty bowl.",
          "description":""
        },
        {
          "headline":"Mince the garlic cloves into very small pieces.",
          "description":""
        },
        {
          "headline":"Remove the outer skin and mince the onion into small pieces.",
          "description":""
        },
        {
          "headline":"Chop a handful of basil (15 leaves) into tiny pieces (size doesn't matter).",
          "description":""
        },
        {
          "headline":"Chop mushrooms, carrots, okra, peas, corn, and green pepper of your choice in order to make the sauce more flavorful.",
          "description":"These are just suggestions, you don't have to include all of the vegetables listed."
        },
        {
          "headline":"Place the saucepan on a stove, turn the stove on high and pour in the olive oil.",
          "description":""
        },
        {
          "headline":"Add the chopped garlic cloves and onions to the olive oil.",
          "description":""
        },
        {
          "headline":"Stir until the garlic and onion pieces become golden brown color.",
          "description":"This will occur within 2 minutes, so be careful and don't leave the stove unattended."
        },
        {
          "headline":"Add in the tomato puree to the saucepan once the minced garlic and onions turn golden brown.",
          "description":""
        },
        {
          "headline":"Let the mixture sit on medium heat for 8 to 10 minutes, after 4 minutes, add in all the desired vegetables that you chopped up earlier along with the basil then cover the pot with the saucepan lid.",
          "description":""
        },
        {
          "headline":"Turn off the gas and allow the sauce to sit once cooked properly.",
          "description":""
        }
      ]
    },
    {
      "name":"Cooking the Pasta",
      "steps":[
        {
          "headline":"Choose the type of pasta you desire.",
          "description":""
        },
        {
          "headline":"Fill a large pot 2/3 of the way with water",
          "description":""
        },
        {
          "headline":"Turn the knob on the stove to high.",
          "description":""
        },
        {
          "headline":"Add in a pinch of salt to help the pasta boil faster.",
          "description":""
        },
        {
          "headline":"Add in a half box of the pasta and a couple of drops of oil once the water starts to  boil.",
          "description":""
        },
        {
          "headline":"Let the pasta boil on medium heat for 10 to 12 minutes and then turn off the gas.",
          "description":"Make sure to keep stirring the entire time."
        },
        {
          "headline":"Drain the pasta and make sure there is no water left, using a strainer.",
          "description":""
        },
        {
          "headline":"Combine the drained pasta and sauce into a pot and heat it up for 3 minutes on the stove, in this time add  salt, black pepper, and red crushed pepper to the sauce as desired.",
          "description":""
        },
        {
          "headline":"You are finally done and this wonderful, fresh dish is ready to be served!",
          "description":""
        }
      ]
    }
  ],
  "text":" Cooking the Sauce Wash the tomatoes and remove the core.  Cut the tomatoes into quarters  Crush the quartered tomatoes  in a food processor or blender until it looks like a slush.  Pour the crushed tomatoes into an empty bowl.  Mince the garlic cloves into very small pieces.  Remove the outer skin and mince the onion into small pieces.  Chop a handful of basil (15 leaves) into tiny pieces (size doesn't matter).  Chop mushrooms, carrots, okra, peas, corn, and green pepper of your choice in order to make the sauce more flavorful. These are just suggestions, you don't have to include all of the vegetables listed. Place the saucepan on a stove, turn the stove on high and pour in the olive oil.  Add the chopped garlic cloves and onions to the olive oil.  Stir until the garlic and onion pieces become golden brown color. This will occur within 2 minutes, so be careful and don't leave the stove unattended. Add in the tomato puree to the saucepan once the minced garlic and onions turn golden brown.  Let the mixture sit on medium heat for 8 to 10 minutes, after 4 minutes, add in all the desired vegetables that you chopped up earlier along with the basil then cover the pot with the saucepan lid.  Turn off the gas and allow the sauce to sit once cooked properly.  Cooking the Pasta Choose the type of pasta you desire.  Fill a large pot 2/3 of the way with water  Turn the knob on the stove to high.  Add in a pinch of salt to help the pasta boil faster.  Add in a half box of the pasta and a couple of drops of oil once the water starts to  boil.  Let the pasta boil on medium heat for 10 to 12 minutes and then turn off the gas. Make sure to keep stirring the entire time. Drain the pasta and make sure there is no water left, using a strainer.  Combine the drained pasta and sauce into a pot and heat it up for 3 minutes on the stove, in this time add  salt, black pepper, and red crushed pepper to the sauce as desired.  You are finally done and this wonderful, fresh dish is ready to be served! ",
  "tyn_model":[
    "stove",
    "tomatoes",
    "garlic",
    "saucepan",
    "water",
    "basil",
    "olive oil",
    "pot",
    "gas",
    "salt",
    "food processor",
    "blender",
    "bowl",
    "onion",
    "mushrooms",
    "carrots",
    "okra",
    "peas",
    "corn",
    "green pepper",
    "onions",
    "tomato puree",
    "large pot",
    "oil",
    "strainer",
    "black pepper",
    "red crushed pepper"
  ],
  "tyn_section":[

  ]
}