{
  "title":"How to Care for Marimos",
  "url":"https://www.wikihow.com/Care-for-Marimos",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Theme and Feature Gardens",
    "Water Gardens"
  ],
  "methods":[
    {
      "name":"Setting Up Your Marimo's Habitat",
      "steps":[
        {
          "headline":"Choose its home.",
          "description":"This will depend on the size of your marimo. You should be able to take the marimo out to roll it. If you want a tiny one, a simple cork bottle will do fine. If you want a medium/large marimo, get a jar instead."
        },
        {
          "headline":"Fill the bottle with tap water.",
          "description":"You can put a lid on; this prevents mosquitoes from laying eggs in the jar. Marimos don't need oxygen But they do need carbon dioxide to create their food, so make sure fresh air can enter the habitat at all times."
        }
      ]
    },
    {
      "name":"Getting Your Marimo",
      "steps":[
        {
          "headline":"Buy your marimo at a local pet store or aquarium.",
          "description":"Beware! Some pet stores/aquariums sell fakes. Petsmart has been known to sell fakes. A fake marimo is usually made from other types of algae, or Java moss strung or even stitched into a ball. Some are styrofoam or rocks covered in fake moss."
        },
        {
          "headline":"Know the difference between the reals and fakes.",
          "description":"A few good rules of thumb are:\nReal marimos can't stand too much direct sunlight because they grow on the bottoms of lakes. They cannot handle temperatures higher than 76 degrees fahrenheit. When placed in tank water, it will float for a little while before sinking."
        },
        {
          "headline":"Examine the marimo for blemishes.",
          "description":"It might have worms, black/brown patches, or other such sicknesses. Do not buy anything from the pet store/aquarium if you see these."
        },
        {
          "headline":"Place your marimo in its home.",
          "description":"Be sure it is always in water!"
        }
      ]
    },
    {
      "name":"Caring For Your Marimo",
      "steps":[
        {
          "headline":"Change its water once every 1-2 weeks.",
          "description":"Dump the old tap water out and add new tap water. Use aquarium dechlorinator to treat the new tap water. Chlorine and chloramine can have negative effects on aquatic plants over time. Lightly squeeze your marimo to remove excess dirt and dust, and then rinse it under light running water."
        },
        {
          "headline":"Avoid direct sunlight.",
          "description":"Marimos' natural habitat is at the depths of the river, so give it some sunlight but not direct light. Marimos make their own food from photosynthesis. They do well with artificial sunlight as well."
        }
      ]
    },
    {
      "name":"Marimo Illness",
      "steps":[
        {
          "headline":"Watch for illness.",
          "description":"If your marimo starts developing brown spots, try letting that part get more sunlight. If the brown coloration persists, cut the part off and it will grow back green in the proper conditions. Adding a small amount of table salt to the water to create brackish conditions may improve your marimo's color."
        },
        {
          "headline":"Check for bright spots.",
          "description":"This means it is getting too much sunlight. Move the marimo to a shadier spot."
        },
        {
          "headline":"Keep worms and other creatures off your marimo.",
          "description":"If you see these animals on it, remove them and rinse the marimo under light running water."
        }
      ]
    },
    {
      "name":"Propagating (Breeding) Marimos",
      "steps":[
        {
          "headline":"Cut your marimo into two halves.",
          "description":"This will stimulate the inner dormant region in the center."
        },
        {
          "headline":"Tie it into a round shape with string.",
          "description":"Keep the string firm until your baby marimos develop a permanent round shape. If there is a loose piece of marimo on your marimo, simply pluck it out for it to become another marimo. It does not hurt the marimo by cutting it."
        },
        {
          "headline":"If your marimo has a lump coming out of it, pluck it out and there is a new marimo!",
          "description":""
        }
      ]
    }
  ],
  "text":" Setting Up Your Marimo's Habitat Choose its home. This will depend on the size of your marimo. You should be able to take the marimo out to roll it. If you want a tiny one, a simple cork bottle will do fine. If you want a medium/large marimo, get a jar instead. Fill the bottle with tap water. You can put a lid on; this prevents mosquitoes from laying eggs in the jar. Marimos don't need oxygen But they do need carbon dioxide to create their food, so make sure fresh air can enter the habitat at all times. Getting Your Marimo Buy your marimo at a local pet store or aquarium. Beware! Some pet stores/aquariums sell fakes. Petsmart has been known to sell fakes. A fake marimo is usually made from other types of algae, or Java moss strung or even stitched into a ball. Some are styrofoam or rocks covered in fake moss. Know the difference between the reals and fakes. A few good rules of thumb are:\nReal marimos can't stand too much direct sunlight because they grow on the bottoms of lakes. They cannot handle temperatures higher than 76 degrees fahrenheit. When placed in tank water, it will float for a little while before sinking. Examine the marimo for blemishes. It might have worms, black/brown patches, or other such sicknesses. Do not buy anything from the pet store/aquarium if you see these. Place your marimo in its home. Be sure it is always in water! Caring For Your Marimo Change its water once every 1-2 weeks. Dump the old tap water out and add new tap water. Use aquarium dechlorinator to treat the new tap water. Chlorine and chloramine can have negative effects on aquatic plants over time. Lightly squeeze your marimo to remove excess dirt and dust, and then rinse it under light running water. Avoid direct sunlight. Marimos' natural habitat is at the depths of the river, so give it some sunlight but not direct light. Marimos make their own food from photosynthesis. They do well with artificial sunlight as well. Marimo Illness Watch for illness. If your marimo starts developing brown spots, try letting that part get more sunlight. If the brown coloration persists, cut the part off and it will grow back green in the proper conditions. Adding a small amount of table salt to the water to create brackish conditions may improve your marimo's color. Check for bright spots. This means it is getting too much sunlight. Move the marimo to a shadier spot. Keep worms and other creatures off your marimo. If you see these animals on it, remove them and rinse the marimo under light running water. Propagating (Breeding) Marimos Cut your marimo into two halves. This will stimulate the inner dormant region in the center. Tie it into a round shape with string. Keep the string firm until your baby marimos develop a permanent round shape. If there is a loose piece of marimo on your marimo, simply pluck it out for it to become another marimo. It does not hurt the marimo by cutting it. If your marimo has a lump coming out of it, pluck it out and there is a new marimo! ",
  "tyn_model":[
    "marimo",
    "water",
    "tap water",
    "string",
    "jar",
    "algae",
    "moss",
    "rocks",
    "marimos",
    "aquarium dechlorinator to",
    "table salt",
    "worms"
  ],
  "tyn_section":[

  ]
}