{
  "title":"How to Decorate a Cake",
  "url":"https://www.wikihow.com/Decorate-a-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Cake Decorating"
  ],
  "methods":[
    {
      "name":"Piping or Spreading Frosting",
      "steps":[
        {
          "headline":"Select a frosting for the cake.",
          "description":"Use any frosting that's thick enough to stick to the top and sides of the cake. If your frosting is too runny to pipe or spread using an offset spatula, mix in powdered sugar until it thickens. Consider using:\n\nButtercream or Vienna cream\nCream cheese frosting\nMarshmallow frosting\nRoyal icing\nSwiss or Italian meringue buttercream\nGanache"
        },
        {
          "headline":"Use an icing smoother to create evenly frosted sides.",
          "description":"Use an icing tip on a pastry bag to pipe thick bands of frosting around the sides of the cake. Keep going up around the sides until they're coated with frosting. Then hold an icing smoother or bench scraper vertically against the side of the cake. Run the smoother around the cake to create an even surface. It's easier to use the icing smoother if the cake is on a turntable. Then you can slowly rotate the cake while holding the icing smoother against the side. If you choose to leave the sides of the cake \"naked,\" spread just a few thin patches of frosting along the sides so the layers of cake are still visible."
        },
        {
          "headline":"Fill a piping bag and pipe a pattern onto the cake.",
          "description":"Choose a piping tip that helps you create the design you want. For example, select a petal tip to pipe a ruffled edge along the cake or use a plain round tip to pipe dots across the top of the cake. Did You Know? Popular patterns include basketweave, ruffles, scallops, stars, and lace. If you don't have a piping bag, put the frosting into a food-safe plastic bag and cut off the bottom tip of the bag. You won't be able to control the level of piping detail, but it will give you a simple piping bag."
        },
        {
          "headline":"Use piping tips to create decorative shapes, flowers, or words.",
          "description":"Once you've covered the cake with the frosting of your choice, decide if you want to add a few embellishments. Change the tip on the piping bag so you can write words or pipe flowers. Some tips are designed for specific shapes, such as leaves. For example, to make an elegant fleurs-de-lis, use a star tip to pipe 3 reverse shells. You can also use the star tip to pipe the frosting into a simple rosette."
        },
        {
          "headline":"Use the back of a spoon to make swirls in the frosting.",
          "description":"Ensure that the cake has at least 1 to 2 inches (2.5 to 5.1 cm) of frosting on the top and sides. Take a spoon and hold the back so the tip is pressing gently into the frosting. Twist the spoon in a half-circle motion to create a wave. Keep doing this across the sides and top of the cake. To create an easy zigzag pattern, drag the tines of a fork through the frosting in a back and forth motion."
        }
      ]
    },
    {
      "name":"Working with Fondant",
      "steps":[
        {
          "headline":"Cover the entire cake for an even surface.",
          "description":"To create the smoothest surface for your cake, purchase or make fondant. Sprinkle your work surface with powdered sugar and roll the fondant until it's about ⁄4 inch (0.64 cm) thick. Lay the rolled fondant circle over a cake that you've lightly frosted. Then smooth the fondant over the top and sides of the cake so it sticks. The crumb coat of frosting will help the fondant adhere to the cake. Trim away the excess fondant from the bottom edge of the cake. Save the scraps and use them for other decorations."
        },
        {
          "headline":"Apply fondant fringe, ribbons, or swag.",
          "description":"Add texture to the cake by cutting pieces of fondant and trimming them into fringe. Then drape the fringe or roll and drape the fondant along the sides of the cake. You can also fold strips of fondant to create ribbons or bows. Attach them to the top or sides of the cake. For a bold cake, make a single, large bow and place it on top of the cake. If you'd like a fun cake, make several rows of brightly colored fondant fringe. Wrap these around the sides of the cake. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMathew Rice\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Baker & Dessert Influencer\t\t\t\t\t\t\t\tMathew Rice has worked in restaurant pastry kitchens across the country since the late 1990's. His creations have been featured in Food & Wine, Bon Appetit, and Martha Stewart Weddings. In 2016, Eater named Mathew one of the top 18 chefs to follow on Instagram. Mathew Rice\t\t\tProfessional Baker & Dessert Influencer\t\t\t\tMathew Rice, pastry chef, adds: \"I always think that fondant is great for accent decor, whether you're making flowers or borders or something else. As far as actually eating a cake, I think people prefer other kinds of icing more. If you do want to cover the entire cake, make sure you frost the cake first so that the fondant is glued to something. That way people have the kind of frosting they actually want to eat underneath!\""
        },
        {
          "headline":"Shape fondant into flowers or figures.",
          "description":"To create a flower, roll a piece of fondant and cut it into long strips. Fold the strip in half and wrap it tightly around itself. Then pinch the base of the flower and apply it to the cake. You can also use fondant to create any figure you like such as a person, animal, or plant.Tip: To make fondant impressions, roll a piece of fondant and press impression molds, lace, or leaves on it. Remove the item to reveal a decorative piece of fondant that you can attach to the cake."
        },
        {
          "headline":"Paint an image or design on the fondant.",
          "description":"Pour a little vodka into a small dish and stir in a few squirts of gel-paste food coloring to make a simple food-safe paint. Then dip a fine paint brush into it and paint the surface of the fondant. It's easy to create abstract designs or spend time painting a specific image. To create an easy effect, try stippling. Dip a medium-sized brush with firm bristles into the paint. Then press it onto the fondant to create a dot. Keep making dots across the sides or top of the cake."
        }
      ]
    },
    {
      "name":"Adding Quick Decorations",
      "steps":[
        {
          "headline":"Place fresh flowers on the top or sides of the cake.",
          "description":"To add an elegant or rustic touch to your cake, purchase pesticide-free flowers and gently insert the stems into the cake. To keep the cake fresher for longer, wrap the stems with an edible sealer before sticking them in the cake. Types of edible flowers include:\nChamomile\nMarigolds\nCarnations\nCornflowers\nDaisies\nFuchsia\nHibiscus\nPansies\nRoses\nLavender"
        },
        {
          "headline":"Top the cake with crunchy or chewy textures.",
          "description":"If you want to cover the frosting or add a burst of color and texture, scatter sprinkles, chopped nuts, caramels, meringues, or candy over the top or sides of the cake. To add them to the sides of the cake, use your palms to gently press them into the frosting so they stick. Tips:\nUse shredded or colored coconut flakes for a tropically themed cake. Sort candies by color and arrange them in a rainbow pattern. Place 2 mini-candy canes together to create a heart shape. Toffee or spun sugar makes an impressive decoration that has a slight crunch."
        },
        {
          "headline":"Set a topper or figurines on the cake.",
          "description":"If you're decorating a wedding cake, the couple might request brides, grooms, bells, or hearts on top. Look for sturdy toppers or figurines that won't sink down too far into the cake. Keep in mind that toppers and figurines aren't just for weddings. For example, top birthday cakes with clean:\nToy animals\nAction figures\nSmall plastic dolls\nToy cars"
        },
        {
          "headline":"Arrange fruit on the cake.",
          "description":"Try to use whatever fruit is in season that works with the flavor of the cake. For example, if you're decorating a summery lemon cake, top it with fresh berries such as blueberries, blackberries or strawberries. If you're decorating an autumn gingerbread cake, place slices of dried apples or pears around the edge. To make the fruit look sparkly, consider dipping it in a sugar glaze and letting it harden. Or use crystallized fruits or citrus peel for a little extra shine."
        },
        {
          "headline":"Dust a plain cake with sifted cocoa or powdered sugar.",
          "description":"If you don't want to put frosting on a cake that's already richly flavored, hold a fine mesh strainer or flour sifter over the cake. Fill it with powdered sugar or cocoa powder and shake so the cake is dusted with the sugar or cocoa. To create a lacy pattern, set a paper doily on the cake before you dust it. Then lift away the doily to reveal the decorative pattern."
        },
        {
          "headline":"Add chocolate drizzle, shavings, or pieces.",
          "description":"Chocolate is one of the most versatile decorations since you can easily place chocolate curls, shavings, chips, or chunks on the cake. For example, drop finely chopped white chocolate around the edge of the cake to make a quick border. You can also melt your favorite chocolate and drizzle or pipe it over the cake. Create abstract designs or use the chocolate to pipe a pattern."
        },
        {
          "headline":"Dollop freshly whipped cream on the top.",
          "description":"For a simple decoration that looks great with fresh fruit, spoon whipped cream on top of the cake just before serving. If you'd like to be able to pipe the whipped cream, stabilize it with gelatin, marshmallow fluff, or pudding mix first. To flavor the whipped cream, beat in a few drops of vanilla, almond, lemon, or coffee extract."
        }
      ]
    }
  ],
  "text":" Piping or Spreading Frosting Select a frosting for the cake. Use any frosting that's thick enough to stick to the top and sides of the cake. If your frosting is too runny to pipe or spread using an offset spatula, mix in powdered sugar until it thickens. Consider using:\n\nButtercream or Vienna cream\nCream cheese frosting\nMarshmallow frosting\nRoyal icing\nSwiss or Italian meringue buttercream\nGanache Use an icing smoother to create evenly frosted sides. Use an icing tip on a pastry bag to pipe thick bands of frosting around the sides of the cake. Keep going up around the sides until they're coated with frosting. Then hold an icing smoother or bench scraper vertically against the side of the cake. Run the smoother around the cake to create an even surface. It's easier to use the icing smoother if the cake is on a turntable. Then you can slowly rotate the cake while holding the icing smoother against the side. If you choose to leave the sides of the cake \"naked,\" spread just a few thin patches of frosting along the sides so the layers of cake are still visible. Fill a piping bag and pipe a pattern onto the cake. Choose a piping tip that helps you create the design you want. For example, select a petal tip to pipe a ruffled edge along the cake or use a plain round tip to pipe dots across the top of the cake. Did You Know? Popular patterns include basketweave, ruffles, scallops, stars, and lace. If you don't have a piping bag, put the frosting into a food-safe plastic bag and cut off the bottom tip of the bag. You won't be able to control the level of piping detail, but it will give you a simple piping bag. Use piping tips to create decorative shapes, flowers, or words. Once you've covered the cake with the frosting of your choice, decide if you want to add a few embellishments. Change the tip on the piping bag so you can write words or pipe flowers. Some tips are designed for specific shapes, such as leaves. For example, to make an elegant fleurs-de-lis, use a star tip to pipe 3 reverse shells. You can also use the star tip to pipe the frosting into a simple rosette. Use the back of a spoon to make swirls in the frosting. Ensure that the cake has at least 1 to 2 inches (2.5 to 5.1 cm) of frosting on the top and sides. Take a spoon and hold the back so the tip is pressing gently into the frosting. Twist the spoon in a half-circle motion to create a wave. Keep doing this across the sides and top of the cake. To create an easy zigzag pattern, drag the tines of a fork through the frosting in a back and forth motion. Working with Fondant Cover the entire cake for an even surface. To create the smoothest surface for your cake, purchase or make fondant. Sprinkle your work surface with powdered sugar and roll the fondant until it's about ⁄4 inch (0.64 cm) thick. Lay the rolled fondant circle over a cake that you've lightly frosted. Then smooth the fondant over the top and sides of the cake so it sticks. The crumb coat of frosting will help the fondant adhere to the cake. Trim away the excess fondant from the bottom edge of the cake. Save the scraps and use them for other decorations. Apply fondant fringe, ribbons, or swag. Add texture to the cake by cutting pieces of fondant and trimming them into fringe. Then drape the fringe or roll and drape the fondant along the sides of the cake. You can also fold strips of fondant to create ribbons or bows. Attach them to the top or sides of the cake. For a bold cake, make a single, large bow and place it on top of the cake. If you'd like a fun cake, make several rows of brightly colored fondant fringe. Wrap these around the sides of the cake. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMathew Rice\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Baker & Dessert Influencer\t\t\t\t\t\t\t\tMathew Rice has worked in restaurant pastry kitchens across the country since the late 1990's. His creations have been featured in Food & Wine, Bon Appetit, and Martha Stewart Weddings. In 2016, Eater named Mathew one of the top 18 chefs to follow on Instagram. Mathew Rice\t\t\tProfessional Baker & Dessert Influencer\t\t\t\tMathew Rice, pastry chef, adds: \"I always think that fondant is great for accent decor, whether you're making flowers or borders or something else. As far as actually eating a cake, I think people prefer other kinds of icing more. If you do want to cover the entire cake, make sure you frost the cake first so that the fondant is glued to something. That way people have the kind of frosting they actually want to eat underneath!\" Shape fondant into flowers or figures. To create a flower, roll a piece of fondant and cut it into long strips. Fold the strip in half and wrap it tightly around itself. Then pinch the base of the flower and apply it to the cake. You can also use fondant to create any figure you like such as a person, animal, or plant.Tip: To make fondant impressions, roll a piece of fondant and press impression molds, lace, or leaves on it. Remove the item to reveal a decorative piece of fondant that you can attach to the cake. Paint an image or design on the fondant. Pour a little vodka into a small dish and stir in a few squirts of gel-paste food coloring to make a simple food-safe paint. Then dip a fine paint brush into it and paint the surface of the fondant. It's easy to create abstract designs or spend time painting a specific image. To create an easy effect, try stippling. Dip a medium-sized brush with firm bristles into the paint. Then press it onto the fondant to create a dot. Keep making dots across the sides or top of the cake. Adding Quick Decorations Place fresh flowers on the top or sides of the cake. To add an elegant or rustic touch to your cake, purchase pesticide-free flowers and gently insert the stems into the cake. To keep the cake fresher for longer, wrap the stems with an edible sealer before sticking them in the cake. Types of edible flowers include:\nChamomile\nMarigolds\nCarnations\nCornflowers\nDaisies\nFuchsia\nHibiscus\nPansies\nRoses\nLavender Top the cake with crunchy or chewy textures. If you want to cover the frosting or add a burst of color and texture, scatter sprinkles, chopped nuts, caramels, meringues, or candy over the top or sides of the cake. To add them to the sides of the cake, use your palms to gently press them into the frosting so they stick. Tips:\nUse shredded or colored coconut flakes for a tropically themed cake. Sort candies by color and arrange them in a rainbow pattern. Place 2 mini-candy canes together to create a heart shape. Toffee or spun sugar makes an impressive decoration that has a slight crunch. Set a topper or figurines on the cake. If you're decorating a wedding cake, the couple might request brides, grooms, bells, or hearts on top. Look for sturdy toppers or figurines that won't sink down too far into the cake. Keep in mind that toppers and figurines aren't just for weddings. For example, top birthday cakes with clean:\nToy animals\nAction figures\nSmall plastic dolls\nToy cars Arrange fruit on the cake. Try to use whatever fruit is in season that works with the flavor of the cake. For example, if you're decorating a summery lemon cake, top it with fresh berries such as blueberries, blackberries or strawberries. If you're decorating an autumn gingerbread cake, place slices of dried apples or pears around the edge. To make the fruit look sparkly, consider dipping it in a sugar glaze and letting it harden. Or use crystallized fruits or citrus peel for a little extra shine. Dust a plain cake with sifted cocoa or powdered sugar. If you don't want to put frosting on a cake that's already richly flavored, hold a fine mesh strainer or flour sifter over the cake. Fill it with powdered sugar or cocoa powder and shake so the cake is dusted with the sugar or cocoa. To create a lacy pattern, set a paper doily on the cake before you dust it. Then lift away the doily to reveal the decorative pattern. Add chocolate drizzle, shavings, or pieces. Chocolate is one of the most versatile decorations since you can easily place chocolate curls, shavings, chips, or chunks on the cake. For example, drop finely chopped white chocolate around the edge of the cake to make a quick border. You can also melt your favorite chocolate and drizzle or pipe it over the cake. Create abstract designs or use the chocolate to pipe a pattern. Dollop freshly whipped cream on the top. For a simple decoration that looks great with fresh fruit, spoon whipped cream on top of the cake just before serving. If you'd like to be able to pipe the whipped cream, stabilize it with gelatin, marshmallow fluff, or pudding mix first. To flavor the whipped cream, beat in a few drops of vanilla, almond, lemon, or coffee extract.",
  "tyn_model":[
    "fondant",
    "frosting",
    "powdered sugar",
    "piping bag",
    "chocolate",
    "whipped cream",
    "spoon",
    "cake",
    "icing",
    "flowers",
    "toppers",
    "fruit",
    "cocoa",
    "buttercream",
    "vienna cream",
    "cream cheese frosting",
    "marshmallow frosting",
    "royal icing",
    "meringue buttercream",
    "ganache",
    "pastry bag",
    "bench scraper",
    "piping tip",
    "scallops",
    "lace",
    "piping tips",
    "fork",
    "restaurant pastry",
    "pastry chef",
    "vodka",
    "small dish",
    "gel-paste food coloring",
    "fine paint brush",
    "paint",
    "edible sealer",
    "edible flowers",
    "chamomile",
    "marigolds",
    "carnations",
    "cornflowers",
    "hibiscus",
    "roses",
    "lavender",
    "candy",
    "coconut",
    "toffee",
    "spun sugar",
    "topper",
    "blueberries",
    "blackberries",
    "strawberries",
    "apples",
    "pears",
    "sugar glaze",
    "citrus peel",
    "fine mesh strainer",
    "flour sifter",
    "cocoa powder",
    "sugar",
    "chocolate drizzle",
    "gelatin",
    "marshmallow fluff,",
    "vanilla",
    "lemon"
  ],
  "tyn_section":[

  ]
}