{
  "title":"How to Play Minesweeper on Paper",
  "url":"https://www.wikihow.com/Play-Minesweeper-on-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "methods":[
    {
      "name":"Setting It Up",
      "steps":[
        {
          "headline":"Pick the 'computer'.",
          "description":"One person needs to be “the computer.” In other words, s/he needs to set up the game. In most of the games, it’ll be you, since you’ll be the one who’s read the article."
        },
        {
          "headline":"Assuming you’re the computer, you should take a piece of paper and tear it in half.",
          "description":"Then make an 9 by 9 grid on each sheet."
        },
        {
          "headline":"Label the columns of your grid A-I and the rows 1-9.",
          "description":"Do the same on the other grid."
        },
        {
          "headline":"Have your friend outline a 4 by 4 arrangement of squares on your grid.",
          "description":"That selection should be arranged like an even bigger square. Copy the arrangement onto your friend’s grid in the same place. Make sure that the letters and numbers correspond."
        },
        {
          "headline":"Cover your own grid from view.",
          "description":"This will now be the cheat sheet. Place 8-10 Xs (or “mines”) on your grid, making sure that none of them are inside the 4 by 4 arrangement. Surrounding each X should be 3, 5 or 8 squares. Any mines in the corner will be surrounded by 3 squares, any mines bordering the edge of the grid will be surrounded by 5 squares, and all other mines will be surrounded by 8 squares. We will call these squares ‘’’border squares.’’’"
        },
        {
          "headline":"Pick a border square.",
          "description":"Figure out how many mines are surrounding the border square. The answer will be written as a number on the border square."
        },
        {
          "headline":"Do the same thing on every border square.",
          "description":"To make sure you’ve filled them all in, just look at how many border squares are labeled around each mine. If a mine has only 7 labeled border squares, you probably missed one."
        }
      ]
    },
    {
      "name":"Completing the First Move",
      "steps":[
        {
          "headline":"Take your friend’s grid.",
          "description":"Pick a non-border square in the 4 by 4 arrangement that your friend made. A type of path on the grid can be traveled by moving only horizontally and vertically across other non-border squares. Which ones of them can be reached in this type of path from your chosen square? Those are called “friendly squares.”"
        },
        {
          "headline":"Focus on the friendly squares furthest away from the square you chose and outline a shape that includes all of them on your friend’s grid.",
          "description":""
        },
        {
          "headline":"Visualize a path that can be traveled by moving only horizontally and vertically all the way around your outline.",
          "description":"The path needs to always be touching it."
        },
        {
          "headline":"On your friend’s grid, write down any numbers that are on the path, using your own grid as a reference.",
          "description":""
        }
      ]
    },
    {
      "name":"Rest of the Game",
      "steps":[
        {
          "headline":"To mark a square that may have a mine, draw a red flag or triangle over it.",
          "description":"Question marks can also be drawn."
        },
        {
          "headline":"Have your friend outline a square when s/he wants to dig up a square.",
          "description":"If the square has a number on it, reveal that number only. If it’s a non-border square, repeat steps 10-14, using the square that your friend chose as your “chosen square.”\nIf it’s a mine, then either your friend lost, or you made a mistake in making the game. (See warnings.)"
        },
        {
          "headline":"Game is over.",
          "description":"The game ends when all the numbers on your cheat sheet are uncovered on your friend’s grid."
        }
      ]
    }
  ],
  "text":" Setting It Up Pick the 'computer'. One person needs to be “the computer.” In other words, s/he needs to set up the game. In most of the games, it’ll be you, since you’ll be the one who’s read the article. Assuming you’re the computer, you should take a piece of paper and tear it in half. Then make an 9 by 9 grid on each sheet. Label the columns of your grid A-I and the rows 1-9. Do the same on the other grid. Have your friend outline a 4 by 4 arrangement of squares on your grid. That selection should be arranged like an even bigger square. Copy the arrangement onto your friend’s grid in the same place. Make sure that the letters and numbers correspond. Cover your own grid from view. This will now be the cheat sheet. Place 8-10 Xs (or “mines”) on your grid, making sure that none of them are inside the 4 by 4 arrangement. Surrounding each X should be 3, 5 or 8 squares. Any mines in the corner will be surrounded by 3 squares, any mines bordering the edge of the grid will be surrounded by 5 squares, and all other mines will be surrounded by 8 squares. We will call these squares ‘’’border squares.’’’ Pick a border square. Figure out how many mines are surrounding the border square. The answer will be written as a number on the border square. Do the same thing on every border square. To make sure you’ve filled them all in, just look at how many border squares are labeled around each mine. If a mine has only 7 labeled border squares, you probably missed one. Completing the First Move Take your friend’s grid. Pick a non-border square in the 4 by 4 arrangement that your friend made. A type of path on the grid can be traveled by moving only horizontally and vertically across other non-border squares. Which ones of them can be reached in this type of path from your chosen square? Those are called “friendly squares.” Focus on the friendly squares furthest away from the square you chose and outline a shape that includes all of them on your friend’s grid.  Visualize a path that can be traveled by moving only horizontally and vertically all the way around your outline. The path needs to always be touching it. On your friend’s grid, write down any numbers that are on the path, using your own grid as a reference.  Rest of the Game To mark a square that may have a mine, draw a red flag or triangle over it. Question marks can also be drawn. Have your friend outline a square when s/he wants to dig up a square. If the square has a number on it, reveal that number only. If it’s a non-border square, repeat steps 10-14, using the square that your friend chose as your “chosen square.”\nIf it’s a mine, then either your friend lost, or you made a mistake in making the game. (See warnings.) Game is over. The game ends when all the numbers on your cheat sheet are uncovered on your friend’s grid.",
  "tyn_model":[
    "mines",
    "“the",
    "” in",
    "paper",
    "“mines",
    "”)",
    "‘’’",
    "’’’",
    "“friendly",
    "” focus",
    "“chosen",
    "”\n"
  ],
  "tyn_section":[

  ]
}