{
  "title":"How to Create a Ghetto DIY Studio",
  "url":"https://www.wikihow.com/Create-a-Ghetto-DIY-Studio",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "steps":[
    {
      "headline":"Go to a craft store (or look around the house) for some clean, smooth surfaces.",
      "description":"Poster boards are a good source. You can also use some light colored sheets."
    },
    {
      "headline":"Start out with 2 desk lamps.",
      "description":"The ones that allow you to adjust them easily are the best ones to get."
    },
    {
      "headline":"Find a flat surface near a wall that you want to use.",
      "description":"A kitchen table will do great."
    },
    {
      "headline":"Find a way to attach the chosen background to the wall.",
      "description":"Thumb tacks or double sided tape should do the trick."
    },
    {
      "headline":"Be sure that you have a place to set up the lamps.",
      "description":""
    },
    {
      "headline":"Use 40 watt and 60 watt bulbs for the lamps.",
      "description":"Be aware that you probably can't go 'green' and use low wattage bulbs. The light will be different. If you have a digital camera, you might be able to adjust for this by adjusting your white balance."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Go to a craft store (or look around the house) for some clean, smooth surfaces. Poster boards are a good source. You can also use some light colored sheets. Start out with 2 desk lamps. The ones that allow you to adjust them easily are the best ones to get. Find a flat surface near a wall that you want to use. A kitchen table will do great. Find a way to attach the chosen background to the wall. Thumb tacks or double sided tape should do the trick. Be sure that you have a place to set up the lamps.  Use 40 watt and 60 watt bulbs for the lamps. Be aware that you probably can't go 'green' and use low wattage bulbs. The light will be different. If you have a digital camera, you might be able to adjust for this by adjusting your white balance. Finished. ",
  "tyn_model":[
    "poster boards",
    "lamps"
  ],
  "tyn_section":[

  ]
}