{
  "title":"How to Create a Lacing Needle from a Metal Scrapbook Post",
  "url":"https://www.wikihow.com/Create-a-Lacing-Needle-from-a-Metal-Scrapbook-Post",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "steps":[
    {
      "headline":"Purchase metal scrap book album binding posts from a hobby supply store or an office supply store.",
      "description":"Posts are available in aluminum or steel. Album binding extenders are threaded posts used for scrapbook albums and photo albums. Extenders are ⁄8 inch (0.3 cm) diameter metal posts, usually ⁄4 inch (1.9 cm) long. The posts are threaded externally on one end, like a bolt. The other end is threaded internally, like a nut. Therefore, the extender posts can be threaded together to make various lengths."
    },
    {
      "headline":"Place the internally-threaded end of an extension post into the chuck of a power drill and tighten as you would a drill bit.",
      "description":""
    },
    {
      "headline":"Place a metal file on your workbench surface.",
      "description":""
    },
    {
      "headline":"Turn on the drill and grind the spinning post until the external threads are gone.",
      "description":"Grind away all of the threads. Shape the tip into a point. You may choose to use a grinding wheel, a sander, a file, an emery board, steel wool, a whetstone or any other tool designed for grinding and polishing. Do not grind or damage any other part of the post."
    },
    {
      "headline":"Smooth and polish the extension post using fine grit sandpaper and steel wool.",
      "description":"Use successively finer grit to polish the pointed end of the post until it is very smooth. You do not want it to snag material as it passes through."
    },
    {
      "headline":"Cut and sear the end of your 550 cord.",
      "description":"It will likely be necessary to cut at an angle creating a narrow tip to fit into the threaded end of your needle."
    },
    {
      "headline":"Twist your finished needle onto the prepared end of your 550 cord until it is secure for threading and sewing.",
      "description":"Untwist to remove the cord."
    }
  ],
  "text":" Purchase metal scrap book album binding posts from a hobby supply store or an office supply store. Posts are available in aluminum or steel. Album binding extenders are threaded posts used for scrapbook albums and photo albums. Extenders are ⁄8 inch (0.3 cm) diameter metal posts, usually ⁄4 inch (1.9 cm) long. The posts are threaded externally on one end, like a bolt. The other end is threaded internally, like a nut. Therefore, the extender posts can be threaded together to make various lengths. Place the internally-threaded end of an extension post into the chuck of a power drill and tighten as you would a drill bit.  Place a metal file on your workbench surface.  Turn on the drill and grind the spinning post until the external threads are gone. Grind away all of the threads. Shape the tip into a point. You may choose to use a grinding wheel, a sander, a file, an emery board, steel wool, a whetstone or any other tool designed for grinding and polishing. Do not grind or damage any other part of the post. Smooth and polish the extension post using fine grit sandpaper and steel wool. Use successively finer grit to polish the pointed end of the post until it is very smooth. You do not want it to snag material as it passes through. Cut and sear the end of your 550 cord. It will likely be necessary to cut at an angle creating a narrow tip to fit into the threaded end of your needle. Twist your finished needle onto the prepared end of your 550 cord until it is secure for threading and sewing. Untwist to remove the cord.",
  "tyn_model":[
    "extension post",
    "steel wool",
    "550 cord",
    "album binding extenders",
    "power drill",
    "drill bit",
    "drill",
    "grinding wheel",
    "sander",
    "file",
    "emery board",
    "whetstone",
    "fine grit sandpaper"
  ],
  "tyn_section":[

  ]
}