{
  "title":"How to Replay Missions in GTA",
  "url":"https://www.wikihow.com/Replay-Missions-in-GTA",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Grand Theft Auto"
  ],
  "methods":[
    {
      "name":"Replaying Missions in GTA III (PC)",
      "steps":[
        {
          "headline":"Launch Grand Theft Auto III.",
          "description":"This can be done either by double-clicking the GTA III shortcut icon on the desktop, if it is there, or by following this Start Menu sequence: Start button >> All Programs >> Rockstar Games >> Grand Theft Auto III."
        },
        {
          "headline":"Enter the game world.",
          "description":"Press Enter repeatedly to skip through the pre-game cinematics till you arrive at the Main Menu. Click “Start Game” and then “New Game” to start GTA III from the beginning, or click “Load Game” to load a previously saved file and continue from there. This will enter you into the game world."
        },
        {
          "headline":"Save your current game progress.",
          "description":"Before playing the mission you wish to be able to replay, save your current progress. To do this, drive to your safe house (which is represented by a pink house icon on the map to the bottom left corner of your screen) and simply walk in. This will bring up the Save screen. On the Save screen, click an empty save slot and click “Yes” to confirm. This will save your progress and return you to the game world."
        },
        {
          "headline":"Play the mission for the first time.",
          "description":"Start and finish a mission you want to replay. To trigger a mission in GTA III, check your map (located on the bottom left corner of your screen) for icons that represent missions. These icons could be pink- or green-colored blips or sometimes letter icons that represent the gang boss giving you the mission (e.g., L for Luigi). Walk or drive to the location of the mission and stand in the blue marker. This will immediately activate the mission. A pre-mission cinematic will play that will give you the mission instructions."
        },
        {
          "headline":"Load your previously saved game progress.",
          "description":"To do this, press the Esc key to bring up the Main Menu. Click “Start Game” and then “Load Game”; this will take you to the Load Game page. On the Load Game page, select the save slot you used to save your current progress earlier, and click “Yes” to confirm. This will load your previously saved game progress and return you to the game world."
        },
        {
          "headline":"Replay your mission!",
          "description":"Find the mission you want to replay on the game map and trigger it so you can play it again. Using this method, you can replay your mission an infinite number of times. When you’ve had enough fun, just save your progress to continue on to the other missions in the game’s story."
        }
      ]
    },
    {
      "name":"Replaying Missions in GTA III (PlayStation 2)",
      "steps":[
        {
          "headline":"Launch Grand Theft Auto III.",
          "description":"Press the standby/RESET button at the front of your PS2 to switch it on, press the “Open” button at the front of the console and put the GTA III disc in. Then follow the on-screen prompts to start the game."
        },
        {
          "headline":"Enter the game world.",
          "description":"Press the “Start” button on your DualShock controller repeatedly to skip through the pre-game cinematics till you arrive at the Main Menu. Using Dpad Up and Dpad Down to scroll up and down, the X button to accept options, and Triangle to exit menus, select “Start Game” and then “New Game” to start GTA III from the beginning. Otherwise, choose “Load Game” to load a previously saved file and continue from there. This will enter you into the game world."
        },
        {
          "headline":"Save your current game progress.",
          "description":"Before playing the mission you wish to replay, save your current progress. To do this, drive to your safe house, which is represented by a pink house icon on the map to the bottom left corner of your screen, and simply walk in. This will bring up the Save screen. On the Save screen, select an empty save slot and select “Yes” to confirm. This will save your progress and return you to the game world."
        },
        {
          "headline":"Play the mission for the first time.",
          "description":"Start and finish a mission you want to replay. To trigger a mission in GTA III, check your map (located on the bottom left corner of your screen) for icons that represent missions. These icons could be pink- or green-colored blips or sometimes letter icons that represent the gang boss giving you the mission (e.g., L for Luigi). Walk or drive to the location of the mission and stand in the blue marker. This will immediately activate the mission. A pre-mission cinematic will play that will give you the mission instructions."
        },
        {
          "headline":"Load your previously saved game progress.",
          "description":"To do this, press the Start button to pause the game and bring up the Main Menu. Select “Load Game” from the Main Menu items using Dpad Left and Dpad Right to scroll and X to select. This will take you to the Load Game page. On the Load Game page, select the save slot you used earlier, and click “Yes” to confirm. This will load your previously saved game progress and return you to the game world."
        },
        {
          "headline":"Replay your mission!",
          "description":"Find the mission you want to replay on the game map and trigger it so you can play it again. Using this method, you can replay your mission an infinite number of times. When you’ve had enough fun, just save your progress to continue on to the other missions in the game’s story."
        }
      ]
    },
    {
      "name":"Replaying Missions in GTA Vice City (PC)",
      "steps":[
        {
          "headline":"Launch Grand Theft Auto: Vice City.",
          "description":"This can be done by either double-clicking the GTA: VC icon on the desktop, if you have it there, or by following this Start menu sequence: Start button >> All Programs >> Rockstar Games >> Grand Theft Auto: Vice City."
        },
        {
          "headline":"Enter the game world.",
          "description":"Press Enter repeatedly to skip through the pre-game cinematics till you arrive at the Main Menu. Click “Start Game” and then “New Game” to start GTA: VC from the beginning, or click “Load Game” to load a previously saved file and continue from there. This will enter you into the game world."
        },
        {
          "headline":"Save your current game progress.",
          "description":"Before playing the mission to replay, save your current progress. To do this, drive to your safe house (which is represented by a pink cassette tape icon on the map to the bottom left corner of your screen) and simply walk in. Inside the safe house, you will notice a 3D pink cassette tape icon. Walk and stand in the icon to bring up the Save Screen. On the Save Screen, click an empty save slot and click “Yes” to confirm. This will save your progress and return you to the game world."
        },
        {
          "headline":"Play your mission for the first time.",
          "description":"Start and finish the mission you want to replay. To trigger a mission in GTA: VC, check your map (located on the bottom left corner of your screen) for icons that represent missions. These icons could be pink or green colored blips or sometimes letter icons that represent the gang boss giving you the mission (e.g., L for Lawyer). Walk or drive to the location of the mission and stand in the blue marker. This will immediately activate the mission. A pre-mission cinematic will play that will give you the mission instructions."
        },
        {
          "headline":"Load your previously saved game progress.",
          "description":"To do this, press the Escape key to bring up the Main Menu. Click “Start Game” and then “Load Game” to take you to the Load Game page. On the Load Game page, select the save slot you used earlier, and click “Yes” to confirm. This will load your previously saved game progress and return you to the game world."
        },
        {
          "headline":"Replay the mission!",
          "description":"Find the mission you want to replay on the game map and trigger it so you can play it again. You can repeat this process for as many times as you want to replay the mission. When you’ve had enough fun, just save your progress to continue on to the other missions in the game’s story."
        }
      ]
    },
    {
      "name":"Replaying Missions in GTA: V (Xbox 360\\/PS3)",
      "steps":[
        {
          "headline":"Load the game into your console.",
          "description":"If you have a physical game disc of GTA: V, insert it into the game console, and load the game. For those who have the game saved in the console, locate it in your game’s list, and load it from there."
        },
        {
          "headline":"Access the game world.",
          "description":"On the game’s main screen, opt to load a saved game. Select the saved game file from the list, and you will be taken to the game world."
        },
        {
          "headline":"Open the Game menu.",
          "description":"Do this by pressing Start on your controller. A window will open, with the Map displayed. There will be several tabs at the top of the window for each menu option. Select the Game tab. The Game tab will display “Replay Missions,” “Load Game,” and “New Game.”"
        },
        {
          "headline":"Select a mission to replay.",
          "description":"Use the D-pad on your controller to scroll down to “Replay Missions” and press A (Xbox) or X (PS3) to select. A list of all the missions you have accomplished will be displayed. Scroll through this list and select the mission you would like to replay. Take advantage of this feature to get 100% in each mission as you can replay missions as often as you want."
        }
      ]
    }
  ],
  "text":" Replaying Missions in GTA III (PC) Launch Grand Theft Auto III. This can be done either by double-clicking the GTA III shortcut icon on the desktop, if it is there, or by following this Start Menu sequence: Start button >> All Programs >> Rockstar Games >> Grand Theft Auto III. Enter the game world. Press Enter repeatedly to skip through the pre-game cinematics till you arrive at the Main Menu. Click “Start Game” and then “New Game” to start GTA III from the beginning, or click “Load Game” to load a previously saved file and continue from there. This will enter you into the game world. Save your current game progress. Before playing the mission you wish to be able to replay, save your current progress. To do this, drive to your safe house (which is represented by a pink house icon on the map to the bottom left corner of your screen) and simply walk in. This will bring up the Save screen. On the Save screen, click an empty save slot and click “Yes” to confirm. This will save your progress and return you to the game world. Play the mission for the first time. Start and finish a mission you want to replay. To trigger a mission in GTA III, check your map (located on the bottom left corner of your screen) for icons that represent missions. These icons could be pink- or green-colored blips or sometimes letter icons that represent the gang boss giving you the mission (e.g., L for Luigi). Walk or drive to the location of the mission and stand in the blue marker. This will immediately activate the mission. A pre-mission cinematic will play that will give you the mission instructions. Load your previously saved game progress. To do this, press the Esc key to bring up the Main Menu. Click “Start Game” and then “Load Game”; this will take you to the Load Game page. On the Load Game page, select the save slot you used to save your current progress earlier, and click “Yes” to confirm. This will load your previously saved game progress and return you to the game world. Replay your mission! Find the mission you want to replay on the game map and trigger it so you can play it again. Using this method, you can replay your mission an infinite number of times. When you’ve had enough fun, just save your progress to continue on to the other missions in the game’s story. Replaying Missions in GTA III (PlayStation 2) Launch Grand Theft Auto III. Press the standby/RESET button at the front of your PS2 to switch it on, press the “Open” button at the front of the console and put the GTA III disc in. Then follow the on-screen prompts to start the game. Enter the game world. Press the “Start” button on your DualShock controller repeatedly to skip through the pre-game cinematics till you arrive at the Main Menu. Using Dpad Up and Dpad Down to scroll up and down, the X button to accept options, and Triangle to exit menus, select “Start Game” and then “New Game” to start GTA III from the beginning. Otherwise, choose “Load Game” to load a previously saved file and continue from there. This will enter you into the game world. Save your current game progress. Before playing the mission you wish to replay, save your current progress. To do this, drive to your safe house, which is represented by a pink house icon on the map to the bottom left corner of your screen, and simply walk in. This will bring up the Save screen. On the Save screen, select an empty save slot and select “Yes” to confirm. This will save your progress and return you to the game world. Play the mission for the first time. Start and finish a mission you want to replay. To trigger a mission in GTA III, check your map (located on the bottom left corner of your screen) for icons that represent missions. These icons could be pink- or green-colored blips or sometimes letter icons that represent the gang boss giving you the mission (e.g., L for Luigi). Walk or drive to the location of the mission and stand in the blue marker. This will immediately activate the mission. A pre-mission cinematic will play that will give you the mission instructions. Load your previously saved game progress. To do this, press the Start button to pause the game and bring up the Main Menu. Select “Load Game” from the Main Menu items using Dpad Left and Dpad Right to scroll and X to select. This will take you to the Load Game page. On the Load Game page, select the save slot you used earlier, and click “Yes” to confirm. This will load your previously saved game progress and return you to the game world. Replay your mission! Find the mission you want to replay on the game map and trigger it so you can play it again. Using this method, you can replay your mission an infinite number of times. When you’ve had enough fun, just save your progress to continue on to the other missions in the game’s story. Replaying Missions in GTA Vice City (PC) Launch Grand Theft Auto: Vice City. This can be done by either double-clicking the GTA: VC icon on the desktop, if you have it there, or by following this Start menu sequence: Start button >> All Programs >> Rockstar Games >> Grand Theft Auto: Vice City. Enter the game world. Press Enter repeatedly to skip through the pre-game cinematics till you arrive at the Main Menu. Click “Start Game” and then “New Game” to start GTA: VC from the beginning, or click “Load Game” to load a previously saved file and continue from there. This will enter you into the game world. Save your current game progress. Before playing the mission to replay, save your current progress. To do this, drive to your safe house (which is represented by a pink cassette tape icon on the map to the bottom left corner of your screen) and simply walk in. Inside the safe house, you will notice a 3D pink cassette tape icon. Walk and stand in the icon to bring up the Save Screen. On the Save Screen, click an empty save slot and click “Yes” to confirm. This will save your progress and return you to the game world. Play your mission for the first time. Start and finish the mission you want to replay. To trigger a mission in GTA: VC, check your map (located on the bottom left corner of your screen) for icons that represent missions. These icons could be pink or green colored blips or sometimes letter icons that represent the gang boss giving you the mission (e.g., L for Lawyer). Walk or drive to the location of the mission and stand in the blue marker. This will immediately activate the mission. A pre-mission cinematic will play that will give you the mission instructions. Load your previously saved game progress. To do this, press the Escape key to bring up the Main Menu. Click “Start Game” and then “Load Game” to take you to the Load Game page. On the Load Game page, select the save slot you used earlier, and click “Yes” to confirm. This will load your previously saved game progress and return you to the game world. Replay the mission! Find the mission you want to replay on the game map and trigger it so you can play it again. You can repeat this process for as many times as you want to replay the mission. When you’ve had enough fun, just save your progress to continue on to the other missions in the game’s story. Replaying Missions in GTA: V (Xbox 360\\/PS3) Load the game into your console. If you have a physical game disc of GTA: V, insert it into the game console, and load the game. For those who have the game saved in the console, locate it in your game’s list, and load it from there. Access the game world. On the game’s main screen, opt to load a saved game. Select the saved game file from the list, and you will be taken to the game world. Open the Game menu. Do this by pressing Start on your controller. A window will open, with the Map displayed. There will be several tabs at the top of the window for each menu option. Select the Game tab. The Game tab will display “Replay Missions,” “Load Game,” and “New Game.” Select a mission to replay. Use the D-pad on your controller to scroll down to “Replay Missions” and press A (Xbox) or X (PS3) to select. A list of all the missions you have accomplished will be displayed. Scroll through this list and select the mission you would like to replay. Take advantage of this feature to get 100% in each mission as you can replay missions as often as you want.",
  "tyn_model":[
    "” to",
    "” and",
    "“start",
    "“load",
    "“yes",
    "gta iii",
    "“new",
    "grand theft auto iii",
    "” button",
    "“replay",
    "theft auto iii",
    "gta iii shortcut",
    "”;",
    "ps2 to",
    "“open",
    "dualshock controller",
    "” from",
    "grand theft auto: vice city",
    "gta: vc",
    "” “",
    "” select"
  ],
  "tyn_section":[

  ]
}