{
  "title":"How to Freeze Blueberries",
  "url":"https://www.wikihow.com/Freeze-Blueberries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Freezing Food"
  ],
  "parts":[
    {
      "name":"Preparing the blueberries",
      "steps":[
        {
          "headline":"Harvest blueberries at their peak.",
          "description":"For best freezing results, freeze berries that are juicy, tender, and flavorful as can be. Freezing berries that are too tart or a little mushy will leave you disappointed in their texture and flavor when they thaw. Harvest blueberries early in the morning - that's when their flavor is strongest. If you don't freeze blueberries right after harvesting them, keep them cool in the refrigerator until you're ready."
        },
        {
          "headline":"Decide whether you want to wash the berries.",
          "description":"When it comes to washing blueberries before freezing, there are two camps. There is research that shows that washing blueberries before freezing can result in slightly tougher skin once the berries thaw. Others say the difference is imperceptible, and they'd rather not have dirt in their freezer. If the berries are washed before frozen, you can enjoy eating a frozen one without having to thaw it. If you're planning to use the berries in a recipe for pie or another cooked dessert, washing them before freezing shouldn't be a problem. If you decide to wash before freezing, rinse the berries gently and let them dry completely before freezing."
        },
        {
          "headline":"Place the berries on a pan in a single layer.",
          "description":"A cookie sheet or large roasting pan should do the trick. Spread them out so that they aren't piled on top of each other."
        }
      ]
    },
    {
      "name":"Freezing the blueberries",
      "steps":[
        {
          "headline":"Place the pan in the freezer until the blueberries are frozen.",
          "description":"It should take 2 - 3 hours. Don't leave the berries on the cookie sheet too long before you remove them; doing so puts them at risk of getting freezer burn."
        },
        {
          "headline":"Place the frozen berries in a vacuum bag or a Ziploc type bag.",
          "description":"Remove excess air from the bag. The more air you can remove, the less freezer burns the berries will have. Label the bags with the date you're freezing them."
        },
        {
          "headline":"Store the bags in the freezer.",
          "description":"You can freeze berries for up to one year. Enjoy anytime. Packaged and stored properly, blueberries can be kept frozen for 6-8 months (optimal) but will still be edible after this time. Blueberries freeze well, keeping both shape and texture when used in baking."
        }
      ]
    },
    {
      "name":"Using frozen blueberries",
      "steps":[
        {
          "headline":"Thaw berries slowly.",
          "description":"The best way is to place them in the fridge or let them come to room temperature. Don't use a microwave to defrost unless you plan on cooking with them. To use still-frozen blueberries for baking, there is no need to thaw. Simply put them straight into muffins and other baked goods. Bake as usual. This prevents the blueberries from being smashed while mixing them into the batter, and they end up being juicier and plumper in the finished product. They still become just as warm as the rest of the baked item. If you decided not to wash the berries before freezing, remember to do so once they have been thawed."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the blueberries Harvest blueberries at their peak. For best freezing results, freeze berries that are juicy, tender, and flavorful as can be. Freezing berries that are too tart or a little mushy will leave you disappointed in their texture and flavor when they thaw. Harvest blueberries early in the morning - that's when their flavor is strongest. If you don't freeze blueberries right after harvesting them, keep them cool in the refrigerator until you're ready. Decide whether you want to wash the berries. When it comes to washing blueberries before freezing, there are two camps. There is research that shows that washing blueberries before freezing can result in slightly tougher skin once the berries thaw. Others say the difference is imperceptible, and they'd rather not have dirt in their freezer. If the berries are washed before frozen, you can enjoy eating a frozen one without having to thaw it. If you're planning to use the berries in a recipe for pie or another cooked dessert, washing them before freezing shouldn't be a problem. If you decide to wash before freezing, rinse the berries gently and let them dry completely before freezing. Place the berries on a pan in a single layer. A cookie sheet or large roasting pan should do the trick. Spread them out so that they aren't piled on top of each other. Freezing the blueberries Place the pan in the freezer until the blueberries are frozen. It should take 2 - 3 hours. Don't leave the berries on the cookie sheet too long before you remove them; doing so puts them at risk of getting freezer burn. Place the frozen berries in a vacuum bag or a Ziploc type bag. Remove excess air from the bag. The more air you can remove, the less freezer burns the berries will have. Label the bags with the date you're freezing them. Store the bags in the freezer. You can freeze berries for up to one year. Enjoy anytime. Packaged and stored properly, blueberries can be kept frozen for 6-8 months (optimal) but will still be edible after this time. Blueberries freeze well, keeping both shape and texture when used in baking. Using frozen blueberries Thaw berries slowly. The best way is to place them in the fridge or let them come to room temperature. Don't use a microwave to defrost unless you plan on cooking with them. To use still-frozen blueberries for baking, there is no need to thaw. Simply put them straight into muffins and other baked goods. Bake as usual. This prevents the blueberries from being smashed while mixing them into the batter, and they end up being juicier and plumper in the finished product. They still become just as warm as the rest of the baked item. If you decided not to wash the berries before freezing, remember to do so once they have been thawed. Finished. ",
  "tyn_model":[
    "blueberries",
    "berries",
    "cookie sheet",
    "freezer",
    "refrigerator",
    "pan",
    "roasting pan",
    "vacuum bag",
    "ziploc type",
    "fridge",
    "microwave",
    "baked goods"
  ],
  "tyn_section":[

  ]
}