{
  "title":"How to Keep Your Attic Cool in Summer",
  "url":"https://www.wikihow.com/Keep-Your-Attic-Cool-in-Summer",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Cooling Systems",
    "DIY Cooling"
  ],
  "methods":[
    {
      "name":"Install an Electric Attic Fan",
      "steps":[
        {
          "headline":"Research your options.",
          "description":"While there are many different brands available, there are two basic options for an attic fan. Either variation can be completed by DIYers and has the added option of programming the fan to only come on if the attic reaches certain temperatures. Roof-mounted fans are set into the roof of your house and will require you to cut into the roof during installation. You’ll then need to feel comfortable shingling around the fan area, though the installation process itself is relatively easy. Wall-mounted fans are meant to fit into a gable wall and for extra ease can be installed in place of an existing gable vent, which means you won’t have to remove any shingles or make significant changes to your attic."
        },
        {
          "headline":"Install a roof-mounted fan if desired.",
          "description":"If you're not sure about installation, don't hesitate to contact a professional. Otherwise:\nStart by removing the shingles of the roof somewhere near the peak where you’re planning to install the fan. Cut an opening and install the fan over the opening. Re-shingle around the base of the fan. Contact an electrician to finish wiring the fan to a thermostat and make sure the electrical work meets code for your house."
        },
        {
          "headline":"Install a wall-mounted fan if it suits you better.",
          "description":"If you're not sure about installation, don't hesitate to contact a professional. Otherwise:\nDecide which gable to replace with a fan and make sure the fan you’re buying is approximately the same size or larger. Use a piece of plywood to mount the fan by selecting a piece of plywood of the right size, cutting an opening in the plywood, centering the fan over the opening and mounting the fan brackets to the plywood. Be sure to center the opening you cut in the plywood for the fan over the opening in the attic wall. Mount the plywood and fan to the attic wall. Contact an electrician to finish wiring the fan to a thermostat and make sure the electrical work meets code for your house."
        }
      ]
    },
    {
      "name":"Install a Ventilation System of Ridge\\/Soffit Vents",
      "steps":[
        {
          "headline":"Measure your net free ventilating area (NFVA): Attics need a certain amount of ventilation based on their square footage.",
          "description":"Divide the area of your attic by 150 to find your NVFA and determine how many of each type of vent you’ll need to install (compare the area you need to cover with the area each vent covers, as stated on their packaging)."
        },
        {
          "headline":"Install the ridge vent: The ridge vent will create a space for heat to escape the attic, which is why these vents are at the peak of the roof.",
          "description":"To install the vent,\nRemove all cap shingles. Starting 6 inches from the end of the roof, cut through any shingles about 1.5 inches from the ridge, and use a power saw with a blade depth of about .75 inches to cut through the wood sheathing and create an opening. Install the ridge vent according to the type of vent you’ve purchased: for a shingle-over ridge vent, pre fasten the first section and add others until you’ve covered the entire opening, and for metal ridge vents align the vent over the opening and fasten with 2 inch roof nails. Metal ridge vents will require straps over the joints that will also need to be fastened with roofing nails. Shingle-over ridge vents get a layer of shingles so the look of the roof is less interrupted. Cut the cap shingle to size and reattach."
        },
        {
          "headline":"Install the soffit vents: Soffit vents are located lower in the eaves of the house and draw in cooler air (forcing the hotter air out through the ridge vent).",
          "description":"Without both sets of vents, air will not circulate through the attic and you’ll need another method of keeping it cool. However, for an easy, energy-efficient method, install soffit vents:\nDetermine the placement of soffit vents that will be free of objects and other obstructions. Remove the insulation that creates a barrier between you and the site of installation. Use a power saw to cut an opening for each of the soffit vents. The opening should be just slightly smaller than the vents themselves. Discard the removed pieces of wall. Place the vents and use screws to attach them to the eaves, and caulk the edges to ensure a tight fit with no air leakage. Reapply the insulation, though if the insulation prevents airflow in through the soffit vents and out through the ridge vent, insert baffles."
        }
      ]
    },
    {
      "name":"Add an Extra Air Conditioner to Your Home",
      "steps":[
        {
          "headline":"Determine your cooling needs: Is the attic a space you use for storage, or is it an extra living space that you or members of your family will be spending a lot of time in?",
          "description":"If the space is being used often, it may warrant adding another air conditioning unit or extending your central air system to include the attic."
        },
        {
          "headline":"Determine what A/C services you use for the rest of your home: If you’re using central air, contact whomever performs your a.c. installation and services to discuss extending cool air to the attic, and work with a professional to incorporate that space in your home.",
          "description":"If you use window air conditioners, consider whether you want to add another unit or if you want to make the switch to central air. Either contact a professional or find a window unit that fits in your space."
        },
        {
          "headline":"Insulate your attic: If your attic is not or is poorly insulated, using an a.c. unit will simply waste money by allowing cool air to escape outside.",
          "description":"Reevaluate your insulation and upgrade if needed."
        }
      ]
    }
  ],
  "text":" Install an Electric Attic Fan Research your options. While there are many different brands available, there are two basic options for an attic fan. Either variation can be completed by DIYers and has the added option of programming the fan to only come on if the attic reaches certain temperatures. Roof-mounted fans are set into the roof of your house and will require you to cut into the roof during installation. You’ll then need to feel comfortable shingling around the fan area, though the installation process itself is relatively easy. Wall-mounted fans are meant to fit into a gable wall and for extra ease can be installed in place of an existing gable vent, which means you won’t have to remove any shingles or make significant changes to your attic. Install a roof-mounted fan if desired. If you're not sure about installation, don't hesitate to contact a professional. Otherwise:\nStart by removing the shingles of the roof somewhere near the peak where you’re planning to install the fan. Cut an opening and install the fan over the opening. Re-shingle around the base of the fan. Contact an electrician to finish wiring the fan to a thermostat and make sure the electrical work meets code for your house. Install a wall-mounted fan if it suits you better. If you're not sure about installation, don't hesitate to contact a professional. Otherwise:\nDecide which gable to replace with a fan and make sure the fan you’re buying is approximately the same size or larger. Use a piece of plywood to mount the fan by selecting a piece of plywood of the right size, cutting an opening in the plywood, centering the fan over the opening and mounting the fan brackets to the plywood. Be sure to center the opening you cut in the plywood for the fan over the opening in the attic wall. Mount the plywood and fan to the attic wall. Contact an electrician to finish wiring the fan to a thermostat and make sure the electrical work meets code for your house. Install a Ventilation System of Ridge\\/Soffit Vents Measure your net free ventilating area (NFVA): Attics need a certain amount of ventilation based on their square footage. Divide the area of your attic by 150 to find your NVFA and determine how many of each type of vent you’ll need to install (compare the area you need to cover with the area each vent covers, as stated on their packaging). Install the ridge vent: The ridge vent will create a space for heat to escape the attic, which is why these vents are at the peak of the roof. To install the vent,\nRemove all cap shingles. Starting 6 inches from the end of the roof, cut through any shingles about 1.5 inches from the ridge, and use a power saw with a blade depth of about .75 inches to cut through the wood sheathing and create an opening. Install the ridge vent according to the type of vent you’ve purchased: for a shingle-over ridge vent, pre fasten the first section and add others until you’ve covered the entire opening, and for metal ridge vents align the vent over the opening and fasten with 2 inch roof nails. Metal ridge vents will require straps over the joints that will also need to be fastened with roofing nails. Shingle-over ridge vents get a layer of shingles so the look of the roof is less interrupted. Cut the cap shingle to size and reattach. Install the soffit vents: Soffit vents are located lower in the eaves of the house and draw in cooler air (forcing the hotter air out through the ridge vent). Without both sets of vents, air will not circulate through the attic and you’ll need another method of keeping it cool. However, for an easy, energy-efficient method, install soffit vents:\nDetermine the placement of soffit vents that will be free of objects and other obstructions. Remove the insulation that creates a barrier between you and the site of installation. Use a power saw to cut an opening for each of the soffit vents. The opening should be just slightly smaller than the vents themselves. Discard the removed pieces of wall. Place the vents and use screws to attach them to the eaves, and caulk the edges to ensure a tight fit with no air leakage. Reapply the insulation, though if the insulation prevents airflow in through the soffit vents and out through the ridge vent, insert baffles. Add an Extra Air Conditioner to Your Home Determine your cooling needs: Is the attic a space you use for storage, or is it an extra living space that you or members of your family will be spending a lot of time in? If the space is being used often, it may warrant adding another air conditioning unit or extending your central air system to include the attic. Determine what A/C services you use for the rest of your home: If you’re using central air, contact whomever performs your a.c. installation and services to discuss extending cool air to the attic, and work with a professional to incorporate that space in your home. If you use window air conditioners, consider whether you want to add another unit or if you want to make the switch to central air. Either contact a professional or find a window unit that fits in your space. Insulate your attic: If your attic is not or is poorly insulated, using an a.c. unit will simply waste money by allowing cool air to escape outside. Reevaluate your insulation and upgrade if needed.",
  "tyn_model":[
    "fan",
    "plywood",
    "insulation",
    "soffit vents",
    "fans",
    "electrician",
    "thermostat",
    "power saw",
    "electric attic fan",
    "cap shingles",
    "roof nails",
    "roofing nails",
    "shingles",
    "screws",
    "air conditioner",
    "air conditioning",
    "central air system",
    "a/c services",
    "air conditioners",
    "window unit",
    "a.c. unit"
  ],
  "tyn_section":[

  ]
}