{
  "title":"How to Play Lucky Blocks in Minecraft",
  "url":"https://www.wikihow.com/Play-Lucky-Blocks-in-Minecraft",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft",
    "Minecraft Servers",
    "Minecraft Minigames"
  ],
  "methods":[
    {
      "name":"Joining The Lucky Blocks Minecraft Server",
      "steps":[
        {
          "headline":"Open your Minecraft client and login to your account.",
          "description":""
        },
        {
          "headline":"Add the server.",
          "description":"Proceed to click the \"Multiplayer\" option and hit the \"Add Server\" button. Once the screen appears, you can add the Server Address, which is mc.wubcraft.com in this case."
        },
        {
          "headline":"Click done.",
          "description":"(Make sure you have selected to allow server resource packs!)"
        }
      ]
    },
    {
      "name":"Downloading The Lucky Blocks Mod",
      "steps":[
        {
          "headline":"Check the client version.",
          "description":"When downloading the Lucky Blocks mod you need to make sure you are using the correct version of the mod so that it will work with your client version. (You do not need to worry about this if you use the public lucky blocks server.)"
        },
        {
          "headline":"Determine the version to download.",
          "description":"In order to check your Minecraft version first launch the game and check the version number in the bottom right corner of the screen as shown."
        },
        {
          "headline":"Download the mod.",
          "description":"Now that you know the version of Minecraft that you are using you can download the correct version of the Lucky Blocks from the Official Website."
        },
        {
          "headline":"Install the mod.",
          "description":"From here the process is simple, simply download the version you need and double click the file on your computer (check your downloads folder). The mod will automatically install itself into your Minecraft client. Note this is only a single player mod, if you want to install Lucky Blocks to a Minecraft server you will need to use Minecraft Forge Loader."
        },
        {
          "headline":"Use the mod.",
          "description":"In order to use the Lucky Blocks mod you need to know how to craft a Lucky Block, which is only applicable in the mod version not the server version. To craft a Lucky Block you must use the following crafting recipe."
        }
      ]
    }
  ],
  "text":" Joining The Lucky Blocks Minecraft Server Open your Minecraft client and login to your account.  Add the server. Proceed to click the \"Multiplayer\" option and hit the \"Add Server\" button. Once the screen appears, you can add the Server Address, which is mc.wubcraft.com in this case. Click done. (Make sure you have selected to allow server resource packs!) Downloading The Lucky Blocks Mod Check the client version. When downloading the Lucky Blocks mod you need to make sure you are using the correct version of the mod so that it will work with your client version. (You do not need to worry about this if you use the public lucky blocks server.) Determine the version to download. In order to check your Minecraft version first launch the game and check the version number in the bottom right corner of the screen as shown. Download the mod. Now that you know the version of Minecraft that you are using you can download the correct version of the Lucky Blocks from the Official Website. Install the mod. From here the process is simple, simply download the version you need and double click the file on your computer (check your downloads folder). The mod will automatically install itself into your Minecraft client. Note this is only a single player mod, if you want to install Lucky Blocks to a Minecraft server you will need to use Minecraft Forge Loader. Use the mod. In order to use the Lucky Blocks mod you need to know how to craft a Lucky Block, which is only applicable in the mod version not the server version. To craft a Lucky Block you must use the following crafting recipe.",
  "tyn_model":[
    "lucky blocks",
    "minecraft server",
    "minecraft client",
    "lucky blocks mod",
    "lucky blocks server",
    "minecraft",
    "minecraft forge loader"
  ],
  "tyn_section":[

  ]
}