{
  "title":"How to Avoid Beehives in Animal Crossing",
  "url":"https://www.wikihow.com/Avoid-Beehives-in-Animal-Crossing",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo 3DS",
    "Animal Crossing: New Leaf"
  ],
  "methods":[
    {
      "name":"Escaping the Bees",
      "steps":[
        {
          "headline":"Run!",
          "description":"When faced against the wrath of a hundred annoyed bees, your best bet is to run. While you can’t run very far or fast enough to completely avoid them, this will save you a few seconds before complete and utter agony. To run, press the B button while moving with your D-pad in all games, save for City Folk. In City Folk, press A and B at the same time so the character runs towards the cursor."
        },
        {
          "headline":"Run in circles.",
          "description":"Bees don’t take sharp turns very well, and enough sharp turns will buy you time, so move in another direction abruptly while running. Running in wide circles or changing directions are the best way to escape bees, as long as you don’t accidentally turn towards the bees."
        },
        {
          "headline":"Seek the nearest shelter.",
          "description":"When you can, duck into the nearest indoor sanctuary. It could be your house or the town store—any building or structure that leads indoors would suffice. You can immediately exit it after ducking inside, because either way, the bees would disperse, leaving you safe from the dreaded hoard."
        }
      ]
    },
    {
      "name":"Catching a Bee",
      "steps":[
        {
          "headline":"Buy a net.",
          "description":"Nets can be bought in the town store (located in main Street in New Leaf and randomly placed in other game versions) for 500 bells, which you can use to catch quite a lot of other bugs too!"
        },
        {
          "headline":"Equip it quickly.",
          "description":"Once you see the beehive drop, access your inventory as quickly as possible ( - on City Folk, X in New Leaf, and Y in both the original and Wild World). Drag your Net towards you character icon by pressing A and selecting “Grab, then maneuver to the icon and press A again to equip it. On New Leaf and Wild World, you can simply tap and drag the Net to your character icon. You can cycle your tools in City Folk and New leaf by pressing the left and right buttons on the D-pad, which makes things even easier for you."
        },
        {
          "headline":"Mash the A button.",
          "description":"Once you equip your tool and exit the inventory, keep pressing A while facing the swarm. Once you catch one, rejoice in your sweet, sweet victory against the dreaded bees!"
        }
      ]
    }
  ],
  "text":" Escaping the Bees Run! When faced against the wrath of a hundred annoyed bees, your best bet is to run. While you can’t run very far or fast enough to completely avoid them, this will save you a few seconds before complete and utter agony. To run, press the B button while moving with your D-pad in all games, save for City Folk. In City Folk, press A and B at the same time so the character runs towards the cursor. Run in circles. Bees don’t take sharp turns very well, and enough sharp turns will buy you time, so move in another direction abruptly while running. Running in wide circles or changing directions are the best way to escape bees, as long as you don’t accidentally turn towards the bees. Seek the nearest shelter. When you can, duck into the nearest indoor sanctuary. It could be your house or the town store—any building or structure that leads indoors would suffice. You can immediately exit it after ducking inside, because either way, the bees would disperse, leaving you safe from the dreaded hoard. Catching a Bee Buy a net. Nets can be bought in the town store (located in main Street in New Leaf and randomly placed in other game versions) for 500 bells, which you can use to catch quite a lot of other bugs too! Equip it quickly. Once you see the beehive drop, access your inventory as quickly as possible ( - on City Folk, X in New Leaf, and Y in both the original and Wild World). Drag your Net towards you character icon by pressing A and selecting “Grab, then maneuver to the icon and press A again to equip it. On New Leaf and Wild World, you can simply tap and drag the Net to your character icon. You can cycle your tools in City Folk and New leaf by pressing the left and right buttons on the D-pad, which makes things even easier for you. Mash the A button. Once you equip your tool and exit the inventory, keep pressing A while facing the swarm. Once you catch one, rejoice in your sweet, sweet victory against the dreaded bees!",
  "tyn_model":[
    "bees",
    "net",
    "d-pad",
    "—any",
    "nets",
    "beehive",
    "“grab",
    "tools",
    "tool"
  ],
  "tyn_section":[

  ]
}