{
  "title":"How to Make Clear Ice",
  "url":"https://www.wikihow.com/Make-Clear-Ice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Water Ice and Sports Drinks"
  ],
  "methods":[
    {
      "name":"The Boiled Water Method",
      "steps":[
        {
          "headline":"Use pure water.",
          "description":"This method looks to get as much of the air and mineral impurities out of the water as possible before freezing, start with already distilled water. Filtered bottled water will work, or any water purified by reverse osmosis."
        },
        {
          "headline":"Boil the water twice.",
          "description":"Boiling removes air bubbles from the liquid, allowing the water molecules to stick together even harder in the freezer. After boiling the first time, allow the water to cool. Then boil again. Keep the cooling water covered to prevent any dust from collecting on the surface."
        },
        {
          "headline":"Pour water into an ice tray or other mold and cover with a plastic wrap to keep out particles.",
          "description":"Make sure that you have let the water cool a bit before pouring it in the tray so that it doesn't melt the plastic. If you really want to impress, try making extra-large clear ice cubes and ice spheres. Nothing like drinking a cocktail on one very large rock."
        },
        {
          "headline":"Place the ice tray in the freezer.",
          "description":"Leave it for few hours to freeze."
        },
        {
          "headline":"Take out the tray and gently remove your clear ice cubes.",
          "description":""
        }
      ]
    },
    {
      "name":"The Top-Down Freezing Method",
      "steps":[
        {
          "headline":"Get a small cooler.",
          "description":"Just a regular cooler is fine, like the one you use to keep food and drinks cool for a picnic, but it must be small enough to fit in your freezer. The cooler will insulate your ice cubes, forcing them to freeze slowly from the top down."
        },
        {
          "headline":"Place your ice tray, mold or other freezing container at the bottom of the cooler.",
          "description":"Do not close the cooler. If you can, use trays that make larger ice cubes, or get a series of small, rectangular plastic or silicone containers."
        },
        {
          "headline":"Fill your tray or molds with water.",
          "description":"Proponents of this method claim tap water works as well as distilled and boiled water."
        },
        {
          "headline":"Pour water into the bottom of the cooler, filling in around your ice tray or molds.",
          "description":"This water will seal off your ice cubes, keeping cold air from freezing the sides or bottom."
        },
        {
          "headline":"Place the cooler with the lid off in your freezer.",
          "description":"Make sure your freezer is not set too cold—17-25°F (-3 -8°C) should do it. Leave the cooler for 24 hours."
        },
        {
          "headline":"Take out your cooler and carefully remove the block of ice with your ice tray or molds frozen in it.",
          "description":"The ice should have a thin cloudy layer at the top but be clear the rest of the way through."
        },
        {
          "headline":"Chip away the ice around your tray or molds and remove your ice cubes.",
          "description":""
        },
        {
          "headline":"Leave them out for a minute to let the top cloudy later melt off.",
          "description":"You now have large, solidly crystal ice cubes."
        }
      ]
    },
    {
      "name":"The High-Temperature Freezing Method",
      "steps":[
        {
          "headline":"Set your freezer to just below freezing, around 30°F or -1°C.",
          "description":"This should be the warmest setting on your freezer. If you don't want your whole freezer that warm, set it as low as you are willing and place ice tray on the top shelf."
        },
        {
          "headline":"Fill an ice tray or mold with water and place it in the freezer.",
          "description":"Leave it to freeze for 24 hours. The slow freeze should force out any gasses and impurities, leaving you with perfectly clear ice cubes."
        }
      ]
    },
    {
      "name":"The bottom freezing method",
      "steps":[
        {
          "headline":"Fill up a bowl with water then dump a lot of salt into it to prevent it from freezing then put it in the freezer.",
          "description":"Be careful not to put too little water in the bowl or the freezing will release enough heat to warm up the salt water to 0°C before the ice cubes finish freezing. The colder the freezer is, the higher the concentration of salt needs to be to prevent the salt water from freezing. You will learn from experience how much salt is needed for the temperature you normally set your freezer to."
        },
        {
          "headline":"Leave the salt water in the freezer at least 3 hours to get really cold.",
          "description":""
        },
        {
          "headline":"Boil some water, then let it cool to eliminate microscopic bubbles.",
          "description":""
        },
        {
          "headline":"Take the bowl of salt water out of the freezer to prevent the water in the ice cube tray from freezing from the top.",
          "description":""
        },
        {
          "headline":"Fill up an ice cube tray with water then float it on the salt water in the freezer which is denser than fresh water.",
          "description":"The result is bubble free ice that is strong and crack free because it froze without any trapped regions of water ever forming during the process."
        },
        {
          "headline":"Put the ice cube tray back in the freezer to prevent melting.",
          "description":""
        },
        {
          "headline":"Put the bowl of salt water back into the freezer so that you can skip the first step the next time you want to make clear ice cubes.",
          "description":""
        }
      ]
    }
  ],
  "text":" The Boiled Water Method Use pure water. This method looks to get as much of the air and mineral impurities out of the water as possible before freezing, start with already distilled water. Filtered bottled water will work, or any water purified by reverse osmosis. Boil the water twice. Boiling removes air bubbles from the liquid, allowing the water molecules to stick together even harder in the freezer. After boiling the first time, allow the water to cool. Then boil again. Keep the cooling water covered to prevent any dust from collecting on the surface. Pour water into an ice tray or other mold and cover with a plastic wrap to keep out particles. Make sure that you have let the water cool a bit before pouring it in the tray so that it doesn't melt the plastic. If you really want to impress, try making extra-large clear ice cubes and ice spheres. Nothing like drinking a cocktail on one very large rock. Place the ice tray in the freezer. Leave it for few hours to freeze. Take out the tray and gently remove your clear ice cubes.  The Top-Down Freezing Method Get a small cooler. Just a regular cooler is fine, like the one you use to keep food and drinks cool for a picnic, but it must be small enough to fit in your freezer. The cooler will insulate your ice cubes, forcing them to freeze slowly from the top down. Place your ice tray, mold or other freezing container at the bottom of the cooler. Do not close the cooler. If you can, use trays that make larger ice cubes, or get a series of small, rectangular plastic or silicone containers. Fill your tray or molds with water. Proponents of this method claim tap water works as well as distilled and boiled water. Pour water into the bottom of the cooler, filling in around your ice tray or molds. This water will seal off your ice cubes, keeping cold air from freezing the sides or bottom. Place the cooler with the lid off in your freezer. Make sure your freezer is not set too cold—17-25°F (-3 -8°C) should do it. Leave the cooler for 24 hours. Take out your cooler and carefully remove the block of ice with your ice tray or molds frozen in it. The ice should have a thin cloudy layer at the top but be clear the rest of the way through. Chip away the ice around your tray or molds and remove your ice cubes.  Leave them out for a minute to let the top cloudy later melt off. You now have large, solidly crystal ice cubes. The High-Temperature Freezing Method Set your freezer to just below freezing, around 30°F or -1°C. This should be the warmest setting on your freezer. If you don't want your whole freezer that warm, set it as low as you are willing and place ice tray on the top shelf. Fill an ice tray or mold with water and place it in the freezer. Leave it to freeze for 24 hours. The slow freeze should force out any gasses and impurities, leaving you with perfectly clear ice cubes. The bottom freezing method Fill up a bowl with water then dump a lot of salt into it to prevent it from freezing then put it in the freezer. Be careful not to put too little water in the bowl or the freezing will release enough heat to warm up the salt water to 0°C before the ice cubes finish freezing. The colder the freezer is, the higher the concentration of salt needs to be to prevent the salt water from freezing. You will learn from experience how much salt is needed for the temperature you normally set your freezer to. Leave the salt water in the freezer at least 3 hours to get really cold.  Boil some water, then let it cool to eliminate microscopic bubbles.  Take the bowl of salt water out of the freezer to prevent the water in the ice cube tray from freezing from the top.  Fill up an ice cube tray with water then float it on the salt water in the freezer which is denser than fresh water. The result is bubble free ice that is strong and crack free because it froze without any trapped regions of water ever forming during the process. Put the ice cube tray back in the freezer to prevent melting.  Put the bowl of salt water back into the freezer so that you can skip the first step the next time you want to make clear ice cubes. ",
  "tyn_model":[
    "water",
    "ice cubes",
    "freezer",
    "cooler",
    "ice tray",
    "salt water",
    "bowl",
    "ice",
    "ice cube tray",
    "tray",
    "salt",
    "plastic wrap",
    "ice spheres",
    "freezing container",
    "tap water"
  ],
  "tyn_section":[

  ]
}