{
  "title":"How to Make a Meal Plan for One",
  "url":"https://www.wikihow.com/Make-a-Meal-Plan-for-One",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Offline Method",
      "steps":[
        {
          "headline":"Take a writing pad and a pen.",
          "description":""
        },
        {
          "headline":"Think about your schedule:",
          "description":"What days of the week are you home late? Chances are you are too tired to even think about cooking, let alone shopping for food! What days are you home a little earlier, or maybe working from home? Consider cooking extra on these days. For example: have a rice dish on Tuesday and a fried rice dish on Thursday, made with the leftover rice."
        },
        {
          "headline":"Browse your recipe books.",
          "description":""
        },
        {
          "headline":"Make a draft like this:",
          "description":"Monday: salad. Tuesday: chicken curry with rice. Wednesday: mashed potatoes, peas and a pork chop. Thursday: fried rice with vegetables and fish. Friday: soup and a sandwich. Saturday: dinner date (yes, you can still eat out if you want!) Sunday: treat yourself to a three course meal."
        },
        {
          "headline":"Put your meal plan on your fridge.",
          "description":""
        }
      ]
    },
    {
      "name":"Online Method",
      "steps":[
        {
          "headline":"Google meal plan.",
          "description":"Then you have two options:\nYou may subscribe to a site where you can browse through online recipes, put together a menu, and create a shopping list. Or if you can't find the time to sit down and put a menu together, you may use a ready made menu. These mostly come in the form of a newsletter, to which you must subscribe."
        },
        {
          "headline":"Browse wikiHow.",
          "description":"There is a very extensive Recipes category. Who knows what you'll find there?"
        }
      ]
    }
  ],
  "text":" Offline Method Take a writing pad and a pen.  Think about your schedule: What days of the week are you home late? Chances are you are too tired to even think about cooking, let alone shopping for food! What days are you home a little earlier, or maybe working from home? Consider cooking extra on these days. For example: have a rice dish on Tuesday and a fried rice dish on Thursday, made with the leftover rice. Browse your recipe books.  Make a draft like this: Monday: salad. Tuesday: chicken curry with rice. Wednesday: mashed potatoes, peas and a pork chop. Thursday: fried rice with vegetables and fish. Friday: soup and a sandwich. Saturday: dinner date (yes, you can still eat out if you want!) Sunday: treat yourself to a three course meal. Put your meal plan on your fridge.  Online Method Google meal plan. Then you have two options:\nYou may subscribe to a site where you can browse through online recipes, put together a menu, and create a shopping list. Or if you can't find the time to sit down and put a menu together, you may use a ready made menu. These mostly come in the form of a newsletter, to which you must subscribe. Browse wikiHow. There is a very extensive Recipes category. Who knows what you'll find there?",
  "tyn_model":[
    "fried rice",
    "rice",
    "writing pad",
    "pen",
    "chicken curry",
    "mashed potatoes",
    "peas",
    "pork chop"
  ],
  "tyn_section":[

  ]
}