{
  "title":"How to Survive in Minecraft Hunger Games",
  "url":"https://www.wikihow.com/Survive-in-Minecraft-Hunger-Games",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft",
    "Minecraft Servers",
    "Minecraft Minigames"
  ],
  "parts":[
    {
      "name":"Getting In",
      "steps":[
        {
          "headline":"Create your server.",
          "description":"Enter Minecraft and click “Add Server\". In the server IP spot, type sg.lbsg.net (no spaces or capital letters). Be careful! Do not touch the ”Port\" spot. For the server name, type Hunger Games."
        },
        {
          "headline":"Enter the server and log in with your Minecraft account in the chat messages (type your password).",
          "description":"Or, create an account by typing /register."
        },
        {
          "headline":"Head towards the Survival Games section and tap any sign that says Join to join a match!",
          "description":""
        }
      ]
    },
    {
      "name":"Starting Your Game",
      "steps":[
        {
          "headline":"Plan where you will run when the game starts.",
          "description":"Once you tap a sign, you are teleported to a survival map. You can run towards the chests in the middle or run in another direction to hunt for your own chests. Remember, the death match starts 7 minutes after the game starts. Be quick!"
        },
        {
          "headline":"When you find a chest, be wary.",
          "description":"Do not take anything you don't need. Avoid leather armour and wooden tools if you can. Always take food, a sword and some armour so you will survive. But, if you are in a rush, grab what you can and run out!"
        },
        {
          "headline":"Be quick if you choose to run towards the middle.",
          "description":"Many will have the same idea and may get to the chests first. Do not worry about any bloodshed, since you get 30 seconds of invincibility at the start of the game."
        }
      ]
    },
    {
      "name":"Staying Alive",
      "steps":[
        {
          "headline":"Kill opponents when you can.",
          "description":"If you meet a player, try to kill them if they have less armour or a weaker weapon then you. On the other hand, if they have full gold armour and a gold sword, it's better to run, immediately."
        },
        {
          "headline":"Avoid others.",
          "description":"If you meet another player and decide to run, always get higher. That way, they have to jump or climb to get to you, and you can easily hit them from above."
        },
        {
          "headline":"Find a base.",
          "description":"A good base is any place that has at least 2 levels. You can hide out in an abandoned cave or an Alaskan townhouse. As long as you have a good place to hide and an easy way out, your good."
        },
        {
          "headline":"Be prepared for the game to end after 7 minutes.",
          "description":"You are teleported into a small area where you fight the last standing players to the death. Make sure all your armour is on and your best weapons and some food are in your hot bar. If you have flint and steel, use it. There is a river of lava around the arena. If you win the death match, the game ends and you are declared winner. If you lose, well, that's it. Good luck!"
        }
      ]
    }
  ],
  "text":" Getting In Create your server. Enter Minecraft and click “Add Server\". In the server IP spot, type sg.lbsg.net (no spaces or capital letters). Be careful! Do not touch the ”Port\" spot. For the server name, type Hunger Games. Enter the server and log in with your Minecraft account in the chat messages (type your password). Or, create an account by typing /register. Head towards the Survival Games section and tap any sign that says Join to join a match!  Starting Your Game Plan where you will run when the game starts. Once you tap a sign, you are teleported to a survival map. You can run towards the chests in the middle or run in another direction to hunt for your own chests. Remember, the death match starts 7 minutes after the game starts. Be quick! When you find a chest, be wary. Do not take anything you don't need. Avoid leather armour and wooden tools if you can. Always take food, a sword and some armour so you will survive. But, if you are in a rush, grab what you can and run out! Be quick if you choose to run towards the middle. Many will have the same idea and may get to the chests first. Do not worry about any bloodshed, since you get 30 seconds of invincibility at the start of the game. Staying Alive Kill opponents when you can. If you meet a player, try to kill them if they have less armour or a weaker weapon then you. On the other hand, if they have full gold armour and a gold sword, it's better to run, immediately. Avoid others. If you meet another player and decide to run, always get higher. That way, they have to jump or climb to get to you, and you can easily hit them from above. Find a base. A good base is any place that has at least 2 levels. You can hide out in an abandoned cave or an Alaskan townhouse. As long as you have a good place to hide and an easy way out, your good. Be prepared for the game to end after 7 minutes. You are teleported into a small area where you fight the last standing players to the death. Make sure all your armour is on and your best weapons and some food are in your hot bar. If you have flint and steel, use it. There is a river of lava around the arena. If you win the death match, the game ends and you are declared winner. If you lose, well, that's it. Good luck!",
  "tyn_model":[
    "sword",
    "minecraft",
    "“add",
    "”port",
    "hunger games",
    "chest",
    "armour",
    "flint",
    "lava"
  ],
  "tyn_section":[

  ]
}