{
  "title":"How to Become a Bento Chef",
  "url":"https://www.wikihow.com/Become-a-Bento-Chef",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "methods":[
    {
      "name":"Before Starting",
      "steps":[
        {
          "headline":"Buy boxes.",
          "description":"You can simply make one if you want. First buy small, simple design boxes to cute characters. The box is often essential or at least inspirational to the design process. However, as they are not personal boxes, stick to simple boxes that have specific sections, to keep the flavors from running together."
        },
        {
          "headline":"Get supplies.",
          "description":"For authenticity, there is almost always a decent Asian supermarket around. It's best to use these for things like kimchi, and specialty Hello Kitty candies. Any well-stocked market will have bento supplies, and large scale cooking supplies, which you will want for the quantities of rice you'll be making. Stick to your supermarket for anything standard, as the prices of American food is often inflated at the Asian markets."
        }
      ]
    },
    {
      "name":"The \"Rules\"",
      "steps":[
        {
          "headline":"Use correct proportions.",
          "description":"A proper bento will follow the 4:3:2:1. Four parts starch (Rice, noodles, potatoes), 3 parts side dish (Meats or proteins), 2 parts vegetables, and 1 part something different (Desserts, pickles, anything else)"
        },
        {
          "headline":"Size it correctly.",
          "description":"The biggest mistake is packing too much food. Customers purchasing bento are often looking for something healthy, and this is hardly achieved with face-sized onigiri."
        },
        {
          "headline":"Decorate it!",
          "description":"Bento is known for cuteness, but it doesn't need to be so. As long as it is colorful and eye-catching, the bento law is satisfied."
        },
        {
          "headline":"Make sure it's safe to eat.",
          "description":"Bento is rarely able to be refrigerated, and often cannot be reheated due to the combination of foods. Thus, bento is lukewarm. Avoid putting raw meats, and other such things that are prone to spoilage unless you have a riceless concept that can be kept colder."
        }
      ]
    },
    {
      "name":"Time to Cook!",
      "steps":[
        {
          "headline":"Plan out your designs before you cook it, and have a very strong visual concept of what you are assembling.",
          "description":"A poorly-planned bento shows."
        },
        {
          "headline":"Have fun cooking it!",
          "description":"Expect to spend 3-4 hours in the kitchen cooking rice, making decorations, and assembling bento."
        },
        {
          "headline":"Garnish it.",
          "description":"The most common decorations are seaweed designs on onigiri, and other flat foods (such as cheese) cut into flowers. Cookie cutters and scissors are invaluable to this task. For seasonings and sauces, use small bottles and containers (specifically for bento)"
        },
        {
          "headline":"Have a bento sale!",
          "description":"It should cost at least ten dollars, depending on the materials used."
        }
      ]
    }
  ],
  "text":" Before Starting Buy boxes. You can simply make one if you want. First buy small, simple design boxes to cute characters. The box is often essential or at least inspirational to the design process. However, as they are not personal boxes, stick to simple boxes that have specific sections, to keep the flavors from running together. Get supplies. For authenticity, there is almost always a decent Asian supermarket around. It's best to use these for things like kimchi, and specialty Hello Kitty candies. Any well-stocked market will have bento supplies, and large scale cooking supplies, which you will want for the quantities of rice you'll be making. Stick to your supermarket for anything standard, as the prices of American food is often inflated at the Asian markets. The \"Rules\" Use correct proportions. A proper bento will follow the 4:3:2:1. Four parts starch (Rice, noodles, potatoes), 3 parts side dish (Meats or proteins), 2 parts vegetables, and 1 part something different (Desserts, pickles, anything else) Size it correctly. The biggest mistake is packing too much food. Customers purchasing bento are often looking for something healthy, and this is hardly achieved with face-sized onigiri. Decorate it! Bento is known for cuteness, but it doesn't need to be so. As long as it is colorful and eye-catching, the bento law is satisfied. Make sure it's safe to eat. Bento is rarely able to be refrigerated, and often cannot be reheated due to the combination of foods. Thus, bento is lukewarm. Avoid putting raw meats, and other such things that are prone to spoilage unless you have a riceless concept that can be kept colder. Time to Cook! Plan out your designs before you cook it, and have a very strong visual concept of what you are assembling. A poorly-planned bento shows. Have fun cooking it! Expect to spend 3-4 hours in the kitchen cooking rice, making decorations, and assembling bento. Garnish it. The most common decorations are seaweed designs on onigiri, and other flat foods (such as cheese) cut into flowers. Cookie cutters and scissors are invaluable to this task. For seasonings and sauces, use small bottles and containers (specifically for bento) Have a bento sale! It should cost at least ten dollars, depending on the materials used.",
  "tyn_model":[
    "bento",
    "rice",
    "hello kitty candies",
    "potatoes",
    "vegetables",
    "pickles",
    "bento law",
    "decorations",
    "cheese",
    "cookie cutters",
    "scissors"
  ],
  "tyn_section":[

  ]
}