{
  "title":"How to Remove Cigarette Smoke Smell from a Carpet or Rug",
  "url":"https://www.wikihow.com/Remove-Cigarette-Smoke-Smell-from-a-Carpet-or-Rug",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Carpets and Rugs",
    "Cleaning Carpets",
    "Deodorizing Carpets"
  ],
  "steps":[
    {
      "headline":"Schedule a vacation or a weekend away.",
      "description":"Time is an important feature of this cure."
    },
    {
      "headline":"Buy several pounds of plain baking soda.",
      "description":""
    },
    {
      "headline":"Make sure your vacuum cleaner is in good working  condition and is well stocked with  a nice new bag and a few replacements.",
      "description":""
    },
    {
      "headline":"Spread the soda.",
      "description":"One hour before you leave your house for your vacation, liberally sprinkle a large amount of baking soda all over your rug, making sure to hit all exposed areas."
    },
    {
      "headline":"Go back over the rug and sprinkle more baking soda over the same areas.",
      "description":"Since the baking soda will be absorbing the smoke odor, you need to be sure and use plenty."
    },
    {
      "headline":"Close your door, lock it up, and go away.",
      "description":""
    },
    {
      "headline":"Vacuum.",
      "description":"When you come home from your getaway, immediately vacuum the rug."
    },
    {
      "headline":"Change the bag.",
      "description":"Dispose of the bag outside the house and vacuum again your home will smell nice and fresh."
    }
  ],
  "text":" Schedule a vacation or a weekend away. Time is an important feature of this cure. Buy several pounds of plain baking soda.  Make sure your vacuum cleaner is in good working  condition and is well stocked with  a nice new bag and a few replacements.  Spread the soda. One hour before you leave your house for your vacation, liberally sprinkle a large amount of baking soda all over your rug, making sure to hit all exposed areas. Go back over the rug and sprinkle more baking soda over the same areas. Since the baking soda will be absorbing the smoke odor, you need to be sure and use plenty. Close your door, lock it up, and go away.  Vacuum. When you come home from your getaway, immediately vacuum the rug. Change the bag. Dispose of the bag outside the house and vacuum again your home will smell nice and fresh.",
  "tyn_model":[
    "baking soda",
    "vacuum",
    "vacuum cleaner",
    "soda"
  ],
  "tyn_section":[

  ]
}