{
  "title":"How to Prevent a Toilet from Auto Flushing",
  "url":"https://www.wikihow.com/Prevent-a-Toilet-from-Auto-Flushing",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Sensor Separate from the Wall",
      "steps":[
        {
          "headline":"Take a long strip of toilet paper.",
          "description":"About three or four squares will do."
        },
        {
          "headline":"Balance the strip of toilet paper on top of the sensor so that it blocks the sensor.",
          "description":""
        },
        {
          "headline":"Sit in peace.",
          "description":""
        },
        {
          "headline":"Remove the strip of toilet paper and flush it down the toilet once you are finished and preparing to leave the stall.",
          "description":""
        }
      ]
    },
    {
      "name":"Sensor Embedded in the Wall",
      "steps":[
        {
          "headline":"Look for a thin crack in between the top of the sensor panel and the restroom wall opposite you.",
          "description":""
        },
        {
          "headline":"Take a long strip of toilet paper.",
          "description":"About three or four squares will do."
        },
        {
          "headline":"Hold the toilet paper against the panel with your weak hand, with the top of the toilet paper over the gap you identified in Step 1.",
          "description":"Use your fingertips of both hands to crinkle the paper into the gap. Continue pressing the toilet paper into the space until the toilet paper remains in place."
        },
        {
          "headline":"Take a deep breath and relax, knowing that the toilet won't be done until you are.",
          "description":""
        },
        {
          "headline":"Pull the strip of toilet paper out once you are finished and preparing to leave the stall, and flush it down the toilet.",
          "description":""
        }
      ]
    }
  ],
  "text":" Sensor Separate from the Wall Take a long strip of toilet paper. About three or four squares will do. Balance the strip of toilet paper on top of the sensor so that it blocks the sensor.  Sit in peace.  Remove the strip of toilet paper and flush it down the toilet once you are finished and preparing to leave the stall.  Sensor Embedded in the Wall Look for a thin crack in between the top of the sensor panel and the restroom wall opposite you.  Take a long strip of toilet paper. About three or four squares will do. Hold the toilet paper against the panel with your weak hand, with the top of the toilet paper over the gap you identified in Step 1. Use your fingertips of both hands to crinkle the paper into the gap. Continue pressing the toilet paper into the space until the toilet paper remains in place. Take a deep breath and relax, knowing that the toilet won't be done until you are.  Pull the strip of toilet paper out once you are finished and preparing to leave the stall, and flush it down the toilet. ",
  "tyn_model":[
    "toilet paper",
    "paper"
  ],
  "tyn_section":[

  ]
}