{
  "title":"How to Raise Sanity in Don't Starve",
  "url":"https://www.wikihow.com/Raise-Sanity-in-Don%27t-Starve",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Don't Starve Video Games"
  ],
  "parts":[
    {
      "name":"Preparing the Necessities",
      "steps":[
        {
          "headline":"Make your tools.",
          "description":"You’ll be needing at least a pickaxe and an axe to gather some of the required materials for this venture. They’re both available through the Tool tab (crossed axe and pickaxe icon). Axes cost 1 each of Twig (gathered from dried-out bushes scattered in the world) and Flint (sharp-looking rock that’s scattered everywhere in the game), while pickaxes cost 2 each of the same materials. To use tools, select it by right-clicking on the tool (PC) or scrolling to it with the right analog stick and pressing the right button of the D-pad (PS4). Go up to the tree (axe) or boulder (pickaxe) and hold down the left mouse button (PC) or X button (PS4) to wear them down to states you can gather with."
        },
        {
          "headline":"Gather the necessary materials.",
          "description":"Now that you have your tools, get going and get gathering! Make sure you chop down some trees for Logs since they’re vital for creating a Science Machine. Gathering some Rocks from boulders is also a priority, both for the Science Machine and also your other creations. Gathering Cut Grass from tufts of long grass poking from the ground is also vital for your campfires and torches."
        },
        {
          "headline":"Create your crafting stations.",
          "description":"Aside from the Science Machine, you’ll also be needing an Alchemy Engine to create your supplies. Both can be created through the Science tab, represented by an atom icon, but you’ll need a Science Machine to make an Alchemy Engine. A Science Machine costs 1 Gold Nugget, 4 Logs, and 4 Rocks, and an Alchemy Engine costs 4 Boards, 2 Cut Stones, and 6 Gold. You can craft Boards and Cut Stones through the Science Machine on the Refine tab, represented by a diamond icon. You can gather Gold Nuggets by trading Meats to the Pig King (if he’s available in the current world), mining yellow-streaked boulders (which are predominantly found in Rockylands), or by finding them scattered around Graveyards."
        }
      ]
    },
    {
      "name":"Getting Some Shuteye",
      "steps":[
        {
          "headline":"Stock up on food.",
          "description":"Since sleeping increases your health and sanity at the huge cost of hunger, make sure you have plenty of food on hand. Even just having a stock of berries and carrots in your inventory would be enough to keep you from dying of starvation. Cooking your food over a campfire is an effective way to increase the hunger points gained by most food types. Simply select your food, walk up to the campfire, and left-click or press X to cook it."
        },
        {
          "headline":"Get to a safe spot.",
          "description":"Seeing as you want to sleep, looking for a relaxing spot to camp out is always a good idea. Ideally, the area must be free from any Spider Dens, Beefalo herds, and Frog ponds. This is because Spider Dens and Frog ponds tend to spawn hostile creatures (Spiders for the dens, Frogs for the ponds), while Beefalo tend to become hostile and attack you during mating season, a time when their rears turn red. Note that you can’t sleep if you’re in a dangerous area or if your hunger is too low, so only sleep if you need to regain Sanity quick and are either willing to suffer the penalty, or if you have enough food on stock."
        },
        {
          "headline":"Make your bedding.",
          "description":"Most characters, excluding Wickerbottom, can sleep off their troubles by crafting Fur Rolls, Straw Rolls, Tents or, in the Reign of Giants DLC, a Siesta Lean-To. You can craft a Straw Roll, which you can use once, early enough in the game as long as you have a Science Machine. Fur Rolls and Tents require an Alchemy Engine, which is the second available crafting station in the game. If you plan on making a Tent, seeing as it’s semi-permanent (cannot be picked up without destroying it with a hammer, wears out after 6 uses), you’re better off using the space as your main campsite. Tents themselves need a fairly wide space, and combined with a campfire might require a lot of space. A Straw Roll is the easiest of the bunch to create, requiring 6 Cut Grass and 1 Rope to make in a Science Machine. While both Tents and Fur Rolls are available and Fur Rolls can be brought anywhere to sleep with, Tents are more economic, since Fur Rolls not only need 1 Straw Roll but also require 2 pieces of a late-game item called Bunny Puffs found underground. A Tent only requires 6 Silk, 4 Twigs and 3 Ropes, which are readily and available on the surface."
        }
      ]
    },
    {
      "name":"Getting Dapper (and Flowery)",
      "steps":[
        {
          "headline":"Find the Dress tab.",
          "description":"Your Sanity basically decreases the longer you go on without a semblance of civilization to hang on to, and what better way to emulate the feeling of being a civilized person than by wearing nice clothing? Right near the very bottom of the crafting bar (located at the far left side of the screen), there’s an icon of a green hat. This is the Dress tab, where you can create clothing with different effects."
        },
        {
          "headline":"Pick flowers.",
          "description":"Now, this may sound silly, but picking flowers is an excellent way to maintain sanity, especially early in the game. Each flower picked gives you 5 sanity points, and once you have 12 Petals from the flowers you picked, you can craft a Garland, a clothing item that, once worn, steadily increases your sanity until it wilts away in 6 days. While most of the clothes are available only when you have a Science Machine or an Alchemy Engine, the Garland is available at the very start of the game."
        },
        {
          "headline":"Consider your other clothing options.",
          "description":"Other than Garlands, you can craft other clothes once you have the necessary materials. One of the most effective and easy to acquire articles of clothing you can make earlier on in the game is the Top Hat, which require 6 Silk and is crafted at a Science Machine. Some clothes, while not possessing any ability to gain Sanity, have other functions. Straw Hats are used to make other hats, Beefalo Hats are used to keep you warm in the winter and would enable you to walk among the Beefalo during mating season without being attacked, and Beekeeper Hats render you nearly immune to Bees of all kinds."
        }
      ]
    },
    {
      "name":"Stuff Yourself!",
      "steps":[
        {
          "headline":"Choose your food options.",
          "description":"Eating food, aside from Monster Meats, is always a good way to recover hunger, health, and sanity. Earlier on in the game, your main source of food will be from rabbits caught in traps, berries picked from berry bushes, and carrots lying around, all of which you can cook over a campfire and eat to restore your Hunger. However, for food that restores sanity, you'll need more thorough methods. Carrots can be found poking out of the ground and Berry bushes are scattered around the world. You can pick them up by left-clicking or pressing X. To catch rabbits, make a trap with 6 Cut Grass and 2 Twigs. You can craft it in the Survival tab, represented by a looped rope icon. Once created, place it near or on top of a rabbit hole, which is a small hole in the ground found in grasslands and savannahs, then wait until a rabbit is caught. Once caught, the trap will rattle and jump around. If you pick it up, you’ll get both the trap and the rabbit. You can then re-use the trap for 7 more times before it disappears. You’ll need to “murder” the rabbit before you can make use of the meat, though. Right-clicking (PC) it or pressing the right direction button (PS4) when a rabbit is selected will do the trick. With a Science Machine, you can also craft a Bird Trap for 3 Twigs and 4 Silk through the Survival tab. This functions similarly to a trap, but only catches birds. To make a farm plot, you need at least a Science Machine. You can make it through the Food tab, represented by a buried carrot icon, for 8 Grass, 4 Manure, and 4 Logs. You can get Manure from Beefalo, which excrete them regularly at random intervals and are found in savannahs. You can also get Manure by feeding a pig, found individually in random spots in the map or collectively in huge villages normally found at the end of roads, with some non-meat food (berries, carrots, produce from farm plots, cave bananas, etc.). Once you’ve placed the farm plot, you can put a seed on it by selecting the seed and interacting with the farm. You can either wait for it to grow slowly throughout the day or pile manure on it until it grows. Once grown, simply interact with the crop to gather it, and congratulations! You now have some food!"
        },
        {
          "headline":"Dry out some Jerky.",
          "description":"Jerky and Small Jerky are long-lasting food items that restore quite a bit of all three gauges. To make Jerky, you'll need to make a Drying Rack first, which is made with a Science Machine and requires 3 Rope, 3 Twigs, and 2 Charcoal. Charcoal can be obtained by burning down Trees. You can do this by making a Torch, equipping it, then right-clicking on the Trees. Each burned Tree can be chopped down with an Axe to get 1 Charcoal. Upon creating a Drying Rack, you can then place a piece of Meat of any kind, including Frog Legs, Batilisk Wings, and Monster Meat, by approaching the rack and using the left mouse button or X to place the meat. After a few days you'll have your Jerky ready for consumption!"
        },
        {
          "headline":"Cook with your Crock Pot.",
          "description":"The Crock Pot is another way of cooking your food, and you can make one with a Science Machine and costs 6 Charcoal, 6 Twigs and 3 Cut Stone. The Crock Pot's cooking mechanic requires you to put in 4 items of food in the four slots to cook and takes about a minute for the dish to cook. Most meals can restore a great amount of sanity, as long as you figure out the recipe. You can use Twigs as fillers for recipe, which would usually save you from using up more important “edible” ingredients. Be careful when adding Monster Meats and Durians, though. Use too much without a twig, and you’ll end up with a Monster Lasagna, an incredibly damaging food that gives a hefty penalty to Health and Sanity."
        }
      ]
    },
    {
      "name":"Making Some friends",
      "steps":[
        {
          "headline":"Find Pigmen.",
          "description":"Sometimes, while exploring the world, you occasionally encounter giant pigs roaming around the area, normally right next to a hut or a set of huts. These are the Pigmen, who are presumably the dominant sentient species of the setting. You can befriend these strange piggies and gain Sanity when around them!"
        },
        {
          "headline":"Feed the Pigs.",
          "description":"You can befriend them by giving them Meat, and once befriended, they tend to follow you around and help you with fighting and chopping down trees. Aside from that, staying close to them recovers your Sanity continuously. Different meats have different values, and higher values make your Pig friends stay with you for longer periods of time! Feed them as regularly as you can, with any type of meat you have on hand to keep them friendly. Be careful with the Monster Meats! Feeding them 4 units of Monster Meat will turn them into a Werepig, which not only attacks you but also decreases your sanity upon close contact!"
        },
        {
          "headline":"Keep close.",
          "description":"As long as your Pig friends are nearby, you’ll be able to gain some amount of Sanity, but to really benefit from it, you’ll have to stick very close to them. As long as they are close at hand, you will continuously gain sanity as long as they remain friendly."
        },
        {
          "headline":"Feed the Bunnies.",
          "description":"Later on in the game, you'll also encounter giant rabbits, called Bunnymen, underground. Unlike the Pigmen, the Bunnymen can and will attack you as long as you're carrying meat, but is easily befriended when fed Carrots, which can be found growing on the ground in the surface. They function similarly to the Pigmen as well, and also help recover Sanity when nearby."
        }
      ]
    },
    {
      "name":"Repairing the Relics",
      "steps":[
        {
          "headline":"Explore the Ruins.",
          "description":"Every so often, you can come across some objects and colorful piles of rock called Relics. Relics (and Broken Relics) are the remains of the Ancient Civilization that apparently ruled the land you are now trapped in. While for some people these objects are an archaeological blessing, for someone trapped and scraping at survival they are either only nuisances or possible boons."
        },
        {
          "headline":"Grab some Rocks.",
          "description":"Rocks are plentiful and renewable in the underground, so don’t be shy! Pick up as many as you can and want, since they’re a valuable resource."
        },
        {
          "headline":"Repair the Relics.",
          "description":"Now, when you encounter Relics, you are presented with the choice to break them to pieces or restore them. While destroying them utterly with a Hammer would yield uncommon, possibly vital resources, repairing them with Rocks will restore 20 points of Sanity. For late-game players, either yield would be a boon or a burden, depending on the state of their resources and mental health. Choose wisely though, since Relics are non-renewable."
        }
      ]
    }
  ],
  "text":" Preparing the Necessities Make your tools. You’ll be needing at least a pickaxe and an axe to gather some of the required materials for this venture. They’re both available through the Tool tab (crossed axe and pickaxe icon). Axes cost 1 each of Twig (gathered from dried-out bushes scattered in the world) and Flint (sharp-looking rock that’s scattered everywhere in the game), while pickaxes cost 2 each of the same materials. To use tools, select it by right-clicking on the tool (PC) or scrolling to it with the right analog stick and pressing the right button of the D-pad (PS4). Go up to the tree (axe) or boulder (pickaxe) and hold down the left mouse button (PC) or X button (PS4) to wear them down to states you can gather with. Gather the necessary materials. Now that you have your tools, get going and get gathering! Make sure you chop down some trees for Logs since they’re vital for creating a Science Machine. Gathering some Rocks from boulders is also a priority, both for the Science Machine and also your other creations. Gathering Cut Grass from tufts of long grass poking from the ground is also vital for your campfires and torches. Create your crafting stations. Aside from the Science Machine, you’ll also be needing an Alchemy Engine to create your supplies. Both can be created through the Science tab, represented by an atom icon, but you’ll need a Science Machine to make an Alchemy Engine. A Science Machine costs 1 Gold Nugget, 4 Logs, and 4 Rocks, and an Alchemy Engine costs 4 Boards, 2 Cut Stones, and 6 Gold. You can craft Boards and Cut Stones through the Science Machine on the Refine tab, represented by a diamond icon. You can gather Gold Nuggets by trading Meats to the Pig King (if he’s available in the current world), mining yellow-streaked boulders (which are predominantly found in Rockylands), or by finding them scattered around Graveyards. Getting Some Shuteye Stock up on food. Since sleeping increases your health and sanity at the huge cost of hunger, make sure you have plenty of food on hand. Even just having a stock of berries and carrots in your inventory would be enough to keep you from dying of starvation. Cooking your food over a campfire is an effective way to increase the hunger points gained by most food types. Simply select your food, walk up to the campfire, and left-click or press X to cook it. Get to a safe spot. Seeing as you want to sleep, looking for a relaxing spot to camp out is always a good idea. Ideally, the area must be free from any Spider Dens, Beefalo herds, and Frog ponds. This is because Spider Dens and Frog ponds tend to spawn hostile creatures (Spiders for the dens, Frogs for the ponds), while Beefalo tend to become hostile and attack you during mating season, a time when their rears turn red. Note that you can’t sleep if you’re in a dangerous area or if your hunger is too low, so only sleep if you need to regain Sanity quick and are either willing to suffer the penalty, or if you have enough food on stock. Make your bedding. Most characters, excluding Wickerbottom, can sleep off their troubles by crafting Fur Rolls, Straw Rolls, Tents or, in the Reign of Giants DLC, a Siesta Lean-To. You can craft a Straw Roll, which you can use once, early enough in the game as long as you have a Science Machine. Fur Rolls and Tents require an Alchemy Engine, which is the second available crafting station in the game. If you plan on making a Tent, seeing as it’s semi-permanent (cannot be picked up without destroying it with a hammer, wears out after 6 uses), you’re better off using the space as your main campsite. Tents themselves need a fairly wide space, and combined with a campfire might require a lot of space. A Straw Roll is the easiest of the bunch to create, requiring 6 Cut Grass and 1 Rope to make in a Science Machine. While both Tents and Fur Rolls are available and Fur Rolls can be brought anywhere to sleep with, Tents are more economic, since Fur Rolls not only need 1 Straw Roll but also require 2 pieces of a late-game item called Bunny Puffs found underground. A Tent only requires 6 Silk, 4 Twigs and 3 Ropes, which are readily and available on the surface. Getting Dapper (and Flowery) Find the Dress tab. Your Sanity basically decreases the longer you go on without a semblance of civilization to hang on to, and what better way to emulate the feeling of being a civilized person than by wearing nice clothing? Right near the very bottom of the crafting bar (located at the far left side of the screen), there’s an icon of a green hat. This is the Dress tab, where you can create clothing with different effects. Pick flowers. Now, this may sound silly, but picking flowers is an excellent way to maintain sanity, especially early in the game. Each flower picked gives you 5 sanity points, and once you have 12 Petals from the flowers you picked, you can craft a Garland, a clothing item that, once worn, steadily increases your sanity until it wilts away in 6 days. While most of the clothes are available only when you have a Science Machine or an Alchemy Engine, the Garland is available at the very start of the game. Consider your other clothing options. Other than Garlands, you can craft other clothes once you have the necessary materials. One of the most effective and easy to acquire articles of clothing you can make earlier on in the game is the Top Hat, which require 6 Silk and is crafted at a Science Machine. Some clothes, while not possessing any ability to gain Sanity, have other functions. Straw Hats are used to make other hats, Beefalo Hats are used to keep you warm in the winter and would enable you to walk among the Beefalo during mating season without being attacked, and Beekeeper Hats render you nearly immune to Bees of all kinds. Stuff Yourself! Choose your food options. Eating food, aside from Monster Meats, is always a good way to recover hunger, health, and sanity. Earlier on in the game, your main source of food will be from rabbits caught in traps, berries picked from berry bushes, and carrots lying around, all of which you can cook over a campfire and eat to restore your Hunger. However, for food that restores sanity, you'll need more thorough methods. Carrots can be found poking out of the ground and Berry bushes are scattered around the world. You can pick them up by left-clicking or pressing X. To catch rabbits, make a trap with 6 Cut Grass and 2 Twigs. You can craft it in the Survival tab, represented by a looped rope icon. Once created, place it near or on top of a rabbit hole, which is a small hole in the ground found in grasslands and savannahs, then wait until a rabbit is caught. Once caught, the trap will rattle and jump around. If you pick it up, you’ll get both the trap and the rabbit. You can then re-use the trap for 7 more times before it disappears. You’ll need to “murder” the rabbit before you can make use of the meat, though. Right-clicking (PC) it or pressing the right direction button (PS4) when a rabbit is selected will do the trick. With a Science Machine, you can also craft a Bird Trap for 3 Twigs and 4 Silk through the Survival tab. This functions similarly to a trap, but only catches birds. To make a farm plot, you need at least a Science Machine. You can make it through the Food tab, represented by a buried carrot icon, for 8 Grass, 4 Manure, and 4 Logs. You can get Manure from Beefalo, which excrete them regularly at random intervals and are found in savannahs. You can also get Manure by feeding a pig, found individually in random spots in the map or collectively in huge villages normally found at the end of roads, with some non-meat food (berries, carrots, produce from farm plots, cave bananas, etc.). Once you’ve placed the farm plot, you can put a seed on it by selecting the seed and interacting with the farm. You can either wait for it to grow slowly throughout the day or pile manure on it until it grows. Once grown, simply interact with the crop to gather it, and congratulations! You now have some food! Dry out some Jerky. Jerky and Small Jerky are long-lasting food items that restore quite a bit of all three gauges. To make Jerky, you'll need to make a Drying Rack first, which is made with a Science Machine and requires 3 Rope, 3 Twigs, and 2 Charcoal. Charcoal can be obtained by burning down Trees. You can do this by making a Torch, equipping it, then right-clicking on the Trees. Each burned Tree can be chopped down with an Axe to get 1 Charcoal. Upon creating a Drying Rack, you can then place a piece of Meat of any kind, including Frog Legs, Batilisk Wings, and Monster Meat, by approaching the rack and using the left mouse button or X to place the meat. After a few days you'll have your Jerky ready for consumption! Cook with your Crock Pot. The Crock Pot is another way of cooking your food, and you can make one with a Science Machine and costs 6 Charcoal, 6 Twigs and 3 Cut Stone. The Crock Pot's cooking mechanic requires you to put in 4 items of food in the four slots to cook and takes about a minute for the dish to cook. Most meals can restore a great amount of sanity, as long as you figure out the recipe. You can use Twigs as fillers for recipe, which would usually save you from using up more important “edible” ingredients. Be careful when adding Monster Meats and Durians, though. Use too much without a twig, and you’ll end up with a Monster Lasagna, an incredibly damaging food that gives a hefty penalty to Health and Sanity. Making Some friends Find Pigmen. Sometimes, while exploring the world, you occasionally encounter giant pigs roaming around the area, normally right next to a hut or a set of huts. These are the Pigmen, who are presumably the dominant sentient species of the setting. You can befriend these strange piggies and gain Sanity when around them! Feed the Pigs. You can befriend them by giving them Meat, and once befriended, they tend to follow you around and help you with fighting and chopping down trees. Aside from that, staying close to them recovers your Sanity continuously. Different meats have different values, and higher values make your Pig friends stay with you for longer periods of time! Feed them as regularly as you can, with any type of meat you have on hand to keep them friendly. Be careful with the Monster Meats! Feeding them 4 units of Monster Meat will turn them into a Werepig, which not only attacks you but also decreases your sanity upon close contact! Keep close. As long as your Pig friends are nearby, you’ll be able to gain some amount of Sanity, but to really benefit from it, you’ll have to stick very close to them. As long as they are close at hand, you will continuously gain sanity as long as they remain friendly. Feed the Bunnies. Later on in the game, you'll also encounter giant rabbits, called Bunnymen, underground. Unlike the Pigmen, the Bunnymen can and will attack you as long as you're carrying meat, but is easily befriended when fed Carrots, which can be found growing on the ground in the surface. They function similarly to the Pigmen as well, and also help recover Sanity when nearby. Repairing the Relics Explore the Ruins. Every so often, you can come across some objects and colorful piles of rock called Relics. Relics (and Broken Relics) are the remains of the Ancient Civilization that apparently ruled the land you are now trapped in. While for some people these objects are an archaeological blessing, for someone trapped and scraping at survival they are either only nuisances or possible boons. Grab some Rocks. Rocks are plentiful and renewable in the underground, so don’t be shy! Pick up as many as you can and want, since they’re a valuable resource. Repair the Relics. Now, when you encounter Relics, you are presented with the choice to break them to pieces or restore them. While destroying them utterly with a Hammer would yield uncommon, possibly vital resources, repairing them with Rocks will restore 20 points of Sanity. For late-game players, either yield would be a boon or a burden, depending on the state of their resources and mental health. Choose wisely though, since Relics are non-renewable.",
  "tyn_model":[
    "food",
    "twigs",
    "rocks",
    "science machine",
    "carrots",
    "rabbit",
    "meat",
    "charcoal",
    "tools",
    "pickaxe",
    "axe",
    "berries",
    "campfire",
    "fur",
    "tents",
    "grass",
    "silk",
    "flowers",
    "manure",
    "jerky",
    "crock pot",
    "alchemy engine",
    "boards",
    "meats",
    "straw roll",
    "tent",
    "hammer",
    "garland",
    "rabbits",
    "pigs",
    "relics",
    "axes",
    "flint",
    "pickaxes",
    "boulder",
    "torches",
    "spiders",
    "straw rolls",
    "ropes",
    "flower",
    "garlands",
    "straw hats",
    "berry",
    "“murder",
    "” the",
    "bird trap",
    "birds",
    "carrot",
    "pig",
    "bananas",
    "rope",
    "torch",
    "drying rack",
    "cut stone",
    "“edible",
    "” ingredients",
    "twig",
    "pigmen",
    "sanity",
    "monster meat",
    "bunnies",
    "rock"
  ],
  "tyn_section":[

  ]
}