{
  "title":"How to Make Grits Casserole",
  "url":"https://www.wikihow.com/Make-Grits-Casserole",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes"
  ],
  "steps":[
    {
      "headline":"Start to prepare the grits.",
      "description":"You can have the casserole ready faster  by having grit leftovers from breakfast. Or, you can either cook them and have the grits hot and fresh. Have a plastic bowl and have grits in the bowl. Add about ¼ cup of water to the bowl so it will mix well with the other ingredients."
    },
    {
      "headline":"Grab the chopped ham and dump it in the bowl of grits.",
      "description":"Stir the bowl well so that the grits and ham mix well."
    },
    {
      "headline":"Have the shredded cheese ready to be poured all over the bowl of grits and ham.",
      "description":"Stir the three ingredients you have well."
    },
    {
      "headline":"Get the beaten eggs and dump it in the bowl of grits.",
      "description":"Stir and add half of the cool milk to the bowl. Do not use all of the milk; this will be used later in the recipe. This will make the ingredients creamy and smooth."
    },
    {
      "headline":"Add ½  teaspoon of salt to the bowl and stir so the salt will reach all the food.",
      "description":""
    },
    {
      "headline":"Add the rest of the milk and stir carefully.",
      "description":"The food should be creamy and smooth."
    },
    {
      "headline":"Have an oven-safe bowl or plate and place it in an oven.",
      "description":""
    },
    {
      "headline":"Keep the casserole in the oven for about 35 to 55 minutes at 350°F (180°C).",
      "description":""
    },
    {
      "headline":"With protective oven gloves, carefully take the casserole out and cool the food on a table or under a towel.",
      "description":"Cool the casserole for about 15 to 20 minutes."
    },
    {
      "headline":"Add cheese toppings to the casserole after the casserole has cooled.",
      "description":"Consider adding cheddar cheese or ricotta cheese."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Start to prepare the grits. You can have the casserole ready faster  by having grit leftovers from breakfast. Or, you can either cook them and have the grits hot and fresh. Have a plastic bowl and have grits in the bowl. Add about ¼ cup of water to the bowl so it will mix well with the other ingredients. Grab the chopped ham and dump it in the bowl of grits. Stir the bowl well so that the grits and ham mix well. Have the shredded cheese ready to be poured all over the bowl of grits and ham. Stir the three ingredients you have well. Get the beaten eggs and dump it in the bowl of grits. Stir and add half of the cool milk to the bowl. Do not use all of the milk; this will be used later in the recipe. This will make the ingredients creamy and smooth. Add ½  teaspoon of salt to the bowl and stir so the salt will reach all the food.  Add the rest of the milk and stir carefully. The food should be creamy and smooth. Have an oven-safe bowl or plate and place it in an oven.  Keep the casserole in the oven for about 35 to 55 minutes at 350°F (180°C).  With protective oven gloves, carefully take the casserole out and cool the food on a table or under a towel. Cool the casserole for about 15 to 20 minutes. Add cheese toppings to the casserole after the casserole has cooled. Consider adding cheddar cheese or ricotta cheese. Finished. ",
  "tyn_model":[
    "bowl",
    "ham",
    "milk",
    "grits",
    "salt",
    "oven",
    "grit",
    "water",
    "cheese",
    "eggs",
    "plate",
    "oven gloves",
    "cheddar cheese",
    "ricotta cheese"
  ],
  "tyn_section":[

  ]
}