{
  "title":"How to Use Apples",
  "url":"https://www.wikihow.com/Use-Apples",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Apples"
  ],
  "steps":[
    {
      "headline":"Make apple chips.",
      "description":"When you really want a potato chip, but not all the fat and other nastiness, then you can have apple crisps! They are quite easy to make and are good for you, too."
    },
    {
      "headline":"Make apple jelly.",
      "description":"Why not preserve this season's bounty for next season's breakfast?"
    },
    {
      "headline":"Carve shrunken head apples.",
      "description":"Folk dolls made from carved apples have been around at least since the settlers of early rural America made dolls from whatever was plentiful at the time. Carved apple heads can last for years if dried properly and painted or sprayed with sealant. Here's an interesting way to preserve your apples..."
    },
    {
      "headline":"Make toffee apples.",
      "description":"They may not be good for your teeth, but toffee apples are oh so scrumptious! Stick that sweet autumn apple onto a sturdy wooden stick for easy holding and biting. This recipe makes 10 toffee apples."
    },
    {
      "headline":"Bob for apples.",
      "description":"This is a traditional Halloween game enjoyed by young and old. Bobbing for apples requires a large tub of water, apples and a group of people willing to get their faces - and maybe their heads - wet."
    },
    {
      "headline":"Bake an apple pie from scratch.",
      "description":"Have you ever craved a good old-fashioned pie like your grandma used to make, but think it's too much of a challenge to bake a real home-made pie from scratch, crust and all? With these easy steps, you could become the next pie baking contest winner at the county fair. The end result is so tasty and delicious that you won't be able to believe you made it all by yourself. Add some ice cream on top when serving for an even more delicious taste."
    },
    {
      "headline":"Make a baked apple.",
      "description":"A baked apple is a simple, delicious and time-old recipe that has been cooked for many centuries or as the New York Times once put it, \"dates back as far as fire and apples\". This recipe is for the traditional version of a baked apple, which tends to always include raisins and spices, along with some form of traditional sweetener such as sugar or a syrup. You can bake your apple(s) in an oven or cook by microwave. Both methods are provided in the article linked."
    },
    {
      "headline":"Make apple sauce Ever wondered how grandma \"put up applesauce\"?",
      "description":"Here is how you can fill your pantry with delicious, all-natural, applesauce for your family to enjoy for some time to come."
    },
    {
      "headline":"Make apple butter.",
      "description":"Apple butter is a concentrated cousin of applesauce. It's cooked until the sugar caramelizes, so it takes on a dark brown color and has a longer shelf life than applesauce. It used to be extremely time consuming, but if you use a slow cooker, you can be eating apple butter in a day!"
    },
    {
      "headline":"Make apple raisin bread pudding.",
      "description":"This bread pudding is very popular in the British Isles. Add this delicious apple-raisin bread pudding to your holiday table this year."
    },
    {
      "headline":"Make apple souffle.",
      "description":"This is a very special dessert that tastes so great! It is suitable for special occasions such as dinner parties."
    },
    {
      "headline":"Make apple wine if you're into wine making.",
      "description":"Apple wine is a cost-friendly and tasty wine to use up an overflow of apples."
    }
  ],
  "text":" Make apple chips. When you really want a potato chip, but not all the fat and other nastiness, then you can have apple crisps! They are quite easy to make and are good for you, too. Make apple jelly. Why not preserve this season's bounty for next season's breakfast? Carve shrunken head apples. Folk dolls made from carved apples have been around at least since the settlers of early rural America made dolls from whatever was plentiful at the time. Carved apple heads can last for years if dried properly and painted or sprayed with sealant. Here's an interesting way to preserve your apples... Make toffee apples. They may not be good for your teeth, but toffee apples are oh so scrumptious! Stick that sweet autumn apple onto a sturdy wooden stick for easy holding and biting. This recipe makes 10 toffee apples. Bob for apples. This is a traditional Halloween game enjoyed by young and old. Bobbing for apples requires a large tub of water, apples and a group of people willing to get their faces - and maybe their heads - wet. Bake an apple pie from scratch. Have you ever craved a good old-fashioned pie like your grandma used to make, but think it's too much of a challenge to bake a real home-made pie from scratch, crust and all? With these easy steps, you could become the next pie baking contest winner at the county fair. The end result is so tasty and delicious that you won't be able to believe you made it all by yourself. Add some ice cream on top when serving for an even more delicious taste. Make a baked apple. A baked apple is a simple, delicious and time-old recipe that has been cooked for many centuries or as the New York Times once put it, \"dates back as far as fire and apples\". This recipe is for the traditional version of a baked apple, which tends to always include raisins and spices, along with some form of traditional sweetener such as sugar or a syrup. You can bake your apple(s) in an oven or cook by microwave. Both methods are provided in the article linked. Make apple sauce Ever wondered how grandma \"put up applesauce\"? Here is how you can fill your pantry with delicious, all-natural, applesauce for your family to enjoy for some time to come. Make apple butter. Apple butter is a concentrated cousin of applesauce. It's cooked until the sugar caramelizes, so it takes on a dark brown color and has a longer shelf life than applesauce. It used to be extremely time consuming, but if you use a slow cooker, you can be eating apple butter in a day! Make apple raisin bread pudding. This bread pudding is very popular in the British Isles. Add this delicious apple-raisin bread pudding to your holiday table this year. Make apple souffle. This is a very special dessert that tastes so great! It is suitable for special occasions such as dinner parties. Make apple wine if you're into wine making. Apple wine is a cost-friendly and tasty wine to use up an overflow of apples.",
  "tyn_model":[
    "apples",
    "applesauce",
    "apple butter",
    "toffee apples",
    "baked apple",
    "sugar",
    "apple wine",
    "apple chips",
    "potato chip",
    "apple crisps",
    "apple jelly",
    "bob",
    "water",
    "apple pie",
    "pie baking contest",
    "ice cream",
    "fire",
    "oven",
    "microwave",
    "apple sauce",
    "slow cooker",
    "apple raisin bread pudding",
    "bread pudding",
    "apple-raisin bread pudding",
    "apple souffle"
  ],
  "tyn_section":[

  ]
}