{
  "title":"How to Sort Laundry by Colors",
  "url":"https://www.wikihow.com/Sort-Laundry-by-Colors",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry"
  ],
  "methods":[
    {
      "name":"Sorting Whites, Lights and Darks",
      "steps":[
        {
          "headline":"Designate laundry containers.",
          "description":"You’ll want three to six laundry baskets, bags, or hampers. The number will depend on the colors in your wardrobe: separating by whites, lights, and darks is a must, but you could also add one for bright colors such as reds and oranges, one for delicate items, or even one for just denim items. Put items in their designated container as soon as you remove them."
        },
        {
          "headline":"Choose one for whites.",
          "description":"This basket or container will be for white clothing only. This means clothing that is pure white; it should not contain any designs, labels, insignias, or patterns. These items can be bleached with chlorine bleach since they do not contain any other colors. Wash white clothing in hot water, and dry at a high temperature."
        },
        {
          "headline":"Pick one for lights.",
          "description":"Add light-colored clothing only to this basket. Put white items with labels or designs in this container, as well as other light-colored items such as khakis or pastel items. Wash light-colored clothing in warm water, and dry them at a warm temperature."
        },
        {
          "headline":"Select one for darks.",
          "description":"Dark clothing includes jeans as well as black, dark gray, blue, and purple items. Depending on the colors in your wardrobe and the way you choose to sort, red and orange items could be added to the dark container as well. Dark-colored laundry should be washed in cold water, and dried at a low temperature. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Stevens-Heebner, SMM-C, CPO®\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Professional Organizer & Senior Move Manager\t\t\t\t\t\t\t\tMarty Stevens-Heebner is a Certified Professional Organizer (CPO) and Founder of Clear Home Solutions, a home organizing and senior moving management company based in southern California. Marty is the first Certified Senior Move Manager (SMM-C) in the United States and is a Certified Aging in Place Specialist (CAPS) through the National Association of Home Builders. She is the President-Elect and is on the board of directors of the National Association for Senior Move Managers, a member of the National Association of Professional Organizers, and has been acknowledged as a Hoarding Specialist and AD/HD Specialist through the Institute for Challenging Disorganization. Marty Stevens-Heebner, SMM-C, CPO®\t\t\tCertified Professional Organizer & Senior Move Manager\t\t\t\tCreate a laundry system that works for you. Break the job into smaller tasks so it doesn't get so overwhelming. For instance, you might do all the dark clothes every Saturday, all the light clothes on Sunday, and the linens on Monday. You can also delegate tasks to other family members so you don't have to take it all on yourself."
        }
      ]
    },
    {
      "name":"Sorting Other Colors",
      "steps":[
        {
          "headline":"Use a separate container for brights.",
          "description":"Bright colored clothing includes reds, pinks, and oranges. These items are the most likely to bleed when washing, so it is a good idea to wash them separately from other items. Bright-colored laundry should be washed in cold water, and dried at a low temperature."
        },
        {
          "headline":"Separate your jeans.",
          "description":"Denim often bleeds when washing it, especially the first few times. The fabric is also heavier than many other clothing items. You can wash denim items separately from your other clothing to ensure there is no dye transfer, and dry them together to prevent other items from being heated too long. Washing your jeans inside out also helps preserve the color as well as clean the dirtiest part: the inside."
        },
        {
          "headline":"Set aside delicates.",
          "description":"Delicate items may include clothing with special trim, beading, sequins, or lace, as well as underwear, bras, or nightgowns. These items should be washed separately from your other clothes, and be sure to check the labels before putting them in the washer or dryer. You may need to hand wash these items and hang them up or lay them flat to dry."
        }
      ]
    },
    {
      "name":"Using Fabric to Sort",
      "steps":[
        {
          "headline":"Isolate cotton fabrics.",
          "description":"Cotton is thinner than many other fabrics, meaning it does not need to dry as long. Washing and drying cotton items together will prevent the fabric from being over-stressed, as all your items should be dry at the same time. Cotton can also withstand higher temperatures than other fabrics, and can be washed in hot water and dried at a high temperature."
        },
        {
          "headline":"Separate linens.",
          "description":"Linen fabric is often more absorbent as well as more delicate than other kinds of clothing. Washing linen items together will ensure your clothing stays in good condition. Wash and dry linen fabrics at low temperatures to avoid shrinkage."
        },
        {
          "headline":"Keep acrylic, polyester, and nylon together.",
          "description":"These fabrics are synthetic and can be washed and dried together. Synthetic fabrics such as acrylic, polyester, and nylon are pretty durable and can be washed and dried at high temperatures. Remember to turn the temp down if these items are dark in color though, as lower heat helps keep the color from fading."
        }
      ]
    }
  ],
  "text":" Sorting Whites, Lights and Darks Designate laundry containers. You’ll want three to six laundry baskets, bags, or hampers. The number will depend on the colors in your wardrobe: separating by whites, lights, and darks is a must, but you could also add one for bright colors such as reds and oranges, one for delicate items, or even one for just denim items. Put items in their designated container as soon as you remove them. Choose one for whites. This basket or container will be for white clothing only. This means clothing that is pure white; it should not contain any designs, labels, insignias, or patterns. These items can be bleached with chlorine bleach since they do not contain any other colors. Wash white clothing in hot water, and dry at a high temperature. Pick one for lights. Add light-colored clothing only to this basket. Put white items with labels or designs in this container, as well as other light-colored items such as khakis or pastel items. Wash light-colored clothing in warm water, and dry them at a warm temperature. Select one for darks. Dark clothing includes jeans as well as black, dark gray, blue, and purple items. Depending on the colors in your wardrobe and the way you choose to sort, red and orange items could be added to the dark container as well. Dark-colored laundry should be washed in cold water, and dried at a low temperature. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Stevens-Heebner, SMM-C, CPO®\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Professional Organizer & Senior Move Manager\t\t\t\t\t\t\t\tMarty Stevens-Heebner is a Certified Professional Organizer (CPO) and Founder of Clear Home Solutions, a home organizing and senior moving management company based in southern California. Marty is the first Certified Senior Move Manager (SMM-C) in the United States and is a Certified Aging in Place Specialist (CAPS) through the National Association of Home Builders. She is the President-Elect and is on the board of directors of the National Association for Senior Move Managers, a member of the National Association of Professional Organizers, and has been acknowledged as a Hoarding Specialist and AD/HD Specialist through the Institute for Challenging Disorganization. Marty Stevens-Heebner, SMM-C, CPO®\t\t\tCertified Professional Organizer & Senior Move Manager\t\t\t\tCreate a laundry system that works for you. Break the job into smaller tasks so it doesn't get so overwhelming. For instance, you might do all the dark clothes every Saturday, all the light clothes on Sunday, and the linens on Monday. You can also delegate tasks to other family members so you don't have to take it all on yourself. Sorting Other Colors Use a separate container for brights. Bright colored clothing includes reds, pinks, and oranges. These items are the most likely to bleed when washing, so it is a good idea to wash them separately from other items. Bright-colored laundry should be washed in cold water, and dried at a low temperature. Separate your jeans. Denim often bleeds when washing it, especially the first few times. The fabric is also heavier than many other clothing items. You can wash denim items separately from your other clothing to ensure there is no dye transfer, and dry them together to prevent other items from being heated too long. Washing your jeans inside out also helps preserve the color as well as clean the dirtiest part: the inside. Set aside delicates. Delicate items may include clothing with special trim, beading, sequins, or lace, as well as underwear, bras, or nightgowns. These items should be washed separately from your other clothes, and be sure to check the labels before putting them in the washer or dryer. You may need to hand wash these items and hang them up or lay them flat to dry. Using Fabric to Sort Isolate cotton fabrics. Cotton is thinner than many other fabrics, meaning it does not need to dry as long. Washing and drying cotton items together will prevent the fabric from being over-stressed, as all your items should be dry at the same time. Cotton can also withstand higher temperatures than other fabrics, and can be washed in hot water and dried at a high temperature. Separate linens. Linen fabric is often more absorbent as well as more delicate than other kinds of clothing. Washing linen items together will ensure your clothing stays in good condition. Wash and dry linen fabrics at low temperatures to avoid shrinkage. Keep acrylic, polyester, and nylon together. These fabrics are synthetic and can be washed and dried together. Synthetic fabrics such as acrylic, polyester, and nylon are pretty durable and can be washed and dried at high temperatures. Remember to turn the temp down if these items are dark in color though, as lower heat helps keep the color from fading.",
  "tyn_model":[
    "water",
    "laundry",
    "fabric",
    "cotton",
    "basket",
    "professional organizer",
    "linens",
    "jeans",
    "denim",
    "linen",
    "acrylic",
    "polyester",
    "nylon",
    "laundry containers",
    "laundry baskets",
    "chlorine bleach",
    "container",
    "smm-c",
    "clear home solutions",
    "home organizing and senior moving management company",
    "home builders",
    "hoarding specialist",
    "washer or dryer",
    "fabrics"
  ],
  "tyn_section":[

  ]
}