{
  "title":"How to Save Water",
  "url":"https://www.wikihow.com/Save-Water",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Conserving Water in the Bathroom",
      "steps":[
        {
          "headline":"Check faucets, toilets, and pipes for leaks.",
          "description":"Unknown leaks in your household can waste up to 3,000 gallons (11,000 L) of water a year. For this reason, be sure to check your plumbing for leaks, especially leaking toilets and faucets. If you find a leak, figure out the source of the leak and try to fix it. If it's serious, you may have to enlist the help of a plumber, and find out whether your homeowner's insurance or renter's insurance will cover any damage it has caused. If you're unsure about whether your toilet is leaking or not, put some food coloring in the tank and let it sit for 10-15 minutes without flushing. If you see food coloring in the toilet after the time has passed, you have a leak."
        },
        {
          "headline":"Turn the faucet off when brushing your teeth or shaving.",
          "description":"Instead of letting the water run the entire time you're brushing your teeth, turn it off when it's not needed. When shaving, turn the water off in between rinsing the razor. If you shave in the shower, try turning the shower off while you shave instead of leaving the water running."
        },
        {
          "headline":"Install water-saving shower heads.",
          "description":"Many shower heads use 2.5 gallons (9.5 L) of water per minute, and others use up to 5. Install a water-saving shower head that will maintain the pressure and feel of the flow while using as little as half as much water as conventional units. Depending on the quality, these shower heads typically range in cost from $10-$30. You can also install a valve behind the shower head that will allow you to turn off the water while you soap up and then turn the water back on while preserving the temperature."
        },
        {
          "headline":"Install a faucet aerator.",
          "description":"Adding an aerator to your faucet will add air to the flow of water, giving you a more stable stream while also using less water overall. These can be very easily installed - most simply screw into place - and cost an average of $5."
        },
        {
          "headline":"Take shorter showers.",
          "description":"Take a timer or clock into the bathroom with you and challenge yourself to cut down your showering time, or play one song and try to finish your shower by the time the song is over. Cutting down your shower time by just two minutes can save 10 gallons (37.9 L) of water. Taking a shower uses roughly one third of the amount of water used in taking a bath, depending on the size of your tub and depth of the water. So skip the bath and take a short shower instead."
        },
        {
          "headline":"Convert to a low-flush or dual-flush toilet.",
          "description":"Low-flush toilets use no more than 1.6 gallons (6.1 L) of water per flush, while normal toilets use three or four times that much. A dual-flush toilet allows you to use less water to flush liquid waste and more water to flush solid waste simply by pressing the correct button. You can buy a dual-flush conversion kit to turn your water-guzzling toilet into a water-saver. Search the web for devices like SelectAFlush and TwoFlush. They both work well and save money. Not all toilets will be able to flush effectively with a reduced amount of water, so be sure to check that your toilet does. If you reduce the water amount and the waste isn't flushing, your toilet needs more water."
        },
        {
          "headline":"Don’t use the toilet as a wastebasket.",
          "description":"Not only can flushing trash down your toilet cause plumbing and water quality issues, but it uses several gallons of water each time. Throw your facial wipes, medication, and any other trash away in a trash can to prevent unnecessary waste."
        },
        {
          "headline":"(Men and boys) Use urinals in school and work office bathrooms when available.",
          "description":"If you are a biological male, urinals provide an efficient way for you to empty your bladder."
        }
      ]
    },
    {
      "name":"Conserving Water When Doing Laundry",
      "steps":[
        {
          "headline":"Replace your washing machine with a high-efficiency washer.",
          "description":"Old-style top-loading washers use 40 to 45 gallons (150 to 170 L) per load, but you can cut that in half by using high-efficiency top-loading washers or front-loaders. Not only do these machines use much less water, but they also get your clothes cleaner. Front-loaders use much less water and energy than top-loaders, so do some research beforehand to pick out which washing machine you think would be best."
        },
        {
          "headline":"Make sure you’re washing a full load of laundry.",
          "description":"Don’t just throw some socks and two shirts in the washing machine - put a full load of laundry in so that you’ll be sure to not waste water. While you want the washing machine to be full, don't overload it. If you put too many clothes in there you'll strain the machine and your clothes won't get as clean. When washing your clothes, use the economy mode - this will save you both water and electricity!"
        },
        {
          "headline":"Use cold water instead of warm water.",
          "description":"It takes water to create energy, and energy is needed to heat up your water. By choosing to wash your clothes in cold water, you'll save water and energy. Using cold water prevents stains from setting and colors from bleeding as well."
        },
        {
          "headline":"Dry your clean clothes on a drying rack.",
          "description":"This may not be possible to do with all of your clothes, but try to hang-dry as many dresses, shirts, pants, etc. as possible. The dryer uses lots of energy, which in turn uses lots of water to help create that energy."
        },
        {
          "headline":"Do less laundry.",
          "description":"Many items of clothing, such as jeans and sweaters, don’t need to be washed every time you wear them. Try to be aware of which items of clothing are truly dirty and which could be worn again. This will not only save water, but will save wear and tear on your clothes! It’s normal to wear pajamas two or three times before having to wash them, especially if you shower before going to bed. Do change socks and underwear daily, but wear slacks, jeans, and skirts more than once between washings. When wearing a sweatshirt or sweater over another shirt, you only need to wash the innermost layer regularly. Hang towels on a rack to air dry after you shower, and use them multiple times between washings."
        }
      ]
    },
    {
      "name":"Conserving Water in the Kitchen",
      "steps":[
        {
          "headline":"Load your dishwasher to its full capacity.",
          "description":"Similar to your washing machine, you want to make sure your dishwasher is completely full before running it to save water. If you don’t have a dishwasher, try rinsing the dishes in a full sink or pan of water instead of leaving the faucet running while hand washing. Scrape larger pieces of food waste into the trash or compost. If your dishes don't get clean without pre-rinsing, make sure you're loading properly, that your dishwasher is in good repair, and that you're using an effective dishwasher detergent."
        },
        {
          "headline":"Use your garbage disposal sparingly.",
          "description":"Garbage disposals use a lot of water to get rid of the garbage, so try not to use it very often. Either dump your scraps in the trash, or better yet, start a homemade compost bin rather than washing them down the sink."
        },
        {
          "headline":"Defrost frozen food in the refrigerator.",
          "description":"While it may be faster to soak your frozen food in water, this isn’t necessary and wastes water. Try planning ahead and putting the food you want thawed in the fridge overnight."
        },
        {
          "headline":"Rinse foods in a full sink or pan of water.",
          "description":"When you need to rinse fruits, vegetables, or other foods with water, try filling up a pan or tub of water to wash them in instead of letting the faucet run. You'll use less water and can also use water from the pan for your plants."
        },
        {
          "headline":"Keep a pitcher of drinking water in the fridge.",
          "description":"Instead of running the faucet long enough for the water to become cold enough to drink, fill a bottle or pitcher up with water and put it in the fridge. Now you won't have to wait for cold water, and you've saved water as well."
        }
      ]
    },
    {
      "name":"Conserving Water Outdoors",
      "steps":[
        {
          "headline":"Install a water meter.",
          "description":"You might be very surprised to find out how much water you are actually using. By installing a water meter, you can raise your awareness and consequently reduce your water usage. If you already have a water meter, learn how to read it. Meters can be very helpful in detecting leaks - read the meter once, wait an hour or two without running any water, and read it again. If it has moved, something is leaking."
        },
        {
          "headline":"Use smart watering tactics on your yard and plants.",
          "description":"There’s a way to keep your grass and plants healthy while also conserving water. Water areas that truly need it, and only when there hasn’t been enough rain. The best time of day to do your watering is in the morning or evening so that the water doesn’t immediately evaporate, and don’t water on cool, rainy, or windy days. Water your garden with a watering can or use a trigger nozzle on your hose to prevent extra water usage. You can build a rainwater collection system to watch the rain and use it for watering your plants, lawn or garden. Check your local water rules first to make sure it's allowed. Water deeply but less often. This will encourage plants to grow deeper roots, so that they need water less frequently."
        },
        {
          "headline":"Time your water usage.",
          "description":"Put a timer on your sprinkler and outdoor faucets/taps. Look for inexpensive, automatic timers that screw between the hose and the hose bib, or install a programmable timer on your sprinkler or drip system. An automatic timer can also help you water at times of day when the water can be absorbed the best. If you water something manually, set a kitchen timer before you turn the water on, or stay with the hose the whole time. Know how to adjust your sprinkler and irrigation timer settings for the seasons. Water less or not at all during wetter, cooler weather. Don't over-water, and don't water any faster than the soil can absorb the water. If water is running off the lawn onto the sidewalk, cut the watering time or divide it into two smaller segments to allow time for the water to absorb."
        },
        {
          "headline":"Maintain your sprinklers and irrigation.",
          "description":"If you have irrigation on timers, make sure you monitor it from time to time. Fix broken sprinkler heads and pipes, and make sure that spray patterns are directed where they are intended. Consider using a drip irrigation system or something similar to save even more water. Adjust sprinklers if necessary so that they only reach areas that need water instead of the sidewalk or driveway."
        },
        {
          "headline":"Don’t cut your grass too short.",
          "description":"In terms of water-saving strategies, growing long grass is better than cutting it too short. Grass is able to grow deeper roots when it's longer, allowing it to be watered less often. Raise the height of your mower blade to avoid mowing your lawn too short. If you live in an area with infrequent rain, consider not planting grass and instead using plants from your area that don't need as much attention and water."
        },
        {
          "headline":"Use mulch on your garden to retain moisture.",
          "description":"Covering the soil around your plants with mulch will not only prevent water from evaporating, but it will keep your soil healthy and prevent weed growth. You want to find mulch that is organic - it'll improve your soil as it breaks down. The most common types of mulch are wood chips and bark."
        },
        {
          "headline":"Use a bucket as opposed to a hose to wash your car.",
          "description":"While a little bit more work, using a bucket instead of a hose to wash your car will cut down on water use. Many commercial car washes may use less water than you use at home, and many of them have water recycling systems to collect and filter used water. Use environmentally-friendly cleansers. This will enable you to reuse wastewater from washing to water the lawn or garden."
        },
        {
          "headline":"Don't wash the driveway or sidewalk with a hose.",
          "description":"If you need to clean your sidewalk or driveway, use a broom, rake, or leaf blower to remove dry matter. If the driveway or sidewalk still needs additional cleaning, use a bucket of water or let the rain do the rest. Using a hose will only waste water."
        },
        {
          "headline":"Cover your swimming pool.",
          "description":"If you have a pool, using a pool cover at night during the warmer months helps to prevent evaporation. In some places, emptying and refilling a pool is under severe restrictions, or even banned, so preserving this precious resource is crucial."
        },
        {
          "headline":"Use grey water to flush your toilet or water your lawn.",
          "description":"Grey water is any water that’s been used after running the dishwasher, shower, washing machine, or sink in your house. Depending on the laws where you live, it’s possible to re-route grey water and use it to flush your toilets or water your lawn so as not to be wasteful. If watering plants, don’t use grey water on anything you might eat, as the water could be contaminated. The easiest way to use grey water is to link it directly from the indoors to the outdoors using piping, and then use the water on your garden or yard."
        }
      ]
    },
    {
      "name":"Reducing Your Water Footprint",
      "steps":[
        {
          "headline":"Eat and buy locally.",
          "description":"If your food, clothing, or other goods had to travel a long distance to get to you, it probably used a lot of water in doing so. The production of gasoline uses many gallons of water, so try to purchase local foods and merchandise to reduce your water footprint. Shop for your food at a local farmers market, or find local boutiques where you can purchase clothing. Instead of heading to huge chain stores such as Walmart or Target, try to buy your goods from individual local businesses that specialize in what you need."
        },
        {
          "headline":"Eat less meat and dairy.",
          "description":"Growing animal feed uses tons of water, not to mention the amount of water used in the rest of the meat and dairy production process. Learn to fish and hunt responsibly for more sustainable animal protein. The more domesticated meat and dairy you eat, the more animals are needed to keep up with the demand, so try to limit your intake of such foods."
        },
        {
          "headline":"Cut down on the amount of processed foods you eat.",
          "description":"Every step needed to process food uses lots of water. By eating fresher food, not only will you cut down on your water footprint, but you'll also feel healthier! Sugar cane uses much more water to grow than most other crops - cut out those sugary foods to help save water and stay healthier."
        },
        {
          "headline":"Drink water.",
          "description":"All of those other beverages —wine, tea, soda, juice — took water to produce too. More water is used to help power the factory where the soda is made and grow the fruits and sugar used in juice than is worth the large water footprint it causes. Instead of drinking a soft drink, opt for plain water - the health advantages are in your favor as well as the Earth's."
        },
        {
          "headline":"Carpool, bike, or use public transportation.",
          "description":"By carpooling to school, biking to work, or taking a bus to run errands, you'll cut down on energy use as well as water use. As stated earlier, it takes many gallons of water to produce one gallon of gasoline, so do your part and try to drive less."
        },
        {
          "headline":"Reuse or recycle products.",
          "description":"It takes hundreds of gallons of water to produce everything from a t-shirt to a ream of paper. Donate old clothes, furniture, or any other household items to charities or donation centers, and recycle your paper, plastics, and metals. Reduce, reuse, recycle is usually the best policy when it comes to the environment, and trying to save water is no exception."
        }
      ]
    }
  ],
  "text":" Conserving Water in the Bathroom Check faucets, toilets, and pipes for leaks. Unknown leaks in your household can waste up to 3,000 gallons (11,000 L) of water a year. For this reason, be sure to check your plumbing for leaks, especially leaking toilets and faucets. If you find a leak, figure out the source of the leak and try to fix it. If it's serious, you may have to enlist the help of a plumber, and find out whether your homeowner's insurance or renter's insurance will cover any damage it has caused. If you're unsure about whether your toilet is leaking or not, put some food coloring in the tank and let it sit for 10-15 minutes without flushing. If you see food coloring in the toilet after the time has passed, you have a leak. Turn the faucet off when brushing your teeth or shaving. Instead of letting the water run the entire time you're brushing your teeth, turn it off when it's not needed. When shaving, turn the water off in between rinsing the razor. If you shave in the shower, try turning the shower off while you shave instead of leaving the water running. Install water-saving shower heads. Many shower heads use 2.5 gallons (9.5 L) of water per minute, and others use up to 5. Install a water-saving shower head that will maintain the pressure and feel of the flow while using as little as half as much water as conventional units. Depending on the quality, these shower heads typically range in cost from $10-$30. You can also install a valve behind the shower head that will allow you to turn off the water while you soap up and then turn the water back on while preserving the temperature. Install a faucet aerator. Adding an aerator to your faucet will add air to the flow of water, giving you a more stable stream while also using less water overall. These can be very easily installed - most simply screw into place - and cost an average of $5. Take shorter showers. Take a timer or clock into the bathroom with you and challenge yourself to cut down your showering time, or play one song and try to finish your shower by the time the song is over. Cutting down your shower time by just two minutes can save 10 gallons (37.9 L) of water. Taking a shower uses roughly one third of the amount of water used in taking a bath, depending on the size of your tub and depth of the water. So skip the bath and take a short shower instead. Convert to a low-flush or dual-flush toilet. Low-flush toilets use no more than 1.6 gallons (6.1 L) of water per flush, while normal toilets use three or four times that much. A dual-flush toilet allows you to use less water to flush liquid waste and more water to flush solid waste simply by pressing the correct button. You can buy a dual-flush conversion kit to turn your water-guzzling toilet into a water-saver. Search the web for devices like SelectAFlush and TwoFlush. They both work well and save money. Not all toilets will be able to flush effectively with a reduced amount of water, so be sure to check that your toilet does. If you reduce the water amount and the waste isn't flushing, your toilet needs more water. Don’t use the toilet as a wastebasket. Not only can flushing trash down your toilet cause plumbing and water quality issues, but it uses several gallons of water each time. Throw your facial wipes, medication, and any other trash away in a trash can to prevent unnecessary waste. (Men and boys) Use urinals in school and work office bathrooms when available. If you are a biological male, urinals provide an efficient way for you to empty your bladder. Conserving Water When Doing Laundry Replace your washing machine with a high-efficiency washer. Old-style top-loading washers use 40 to 45 gallons (150 to 170 L) per load, but you can cut that in half by using high-efficiency top-loading washers or front-loaders. Not only do these machines use much less water, but they also get your clothes cleaner. Front-loaders use much less water and energy than top-loaders, so do some research beforehand to pick out which washing machine you think would be best. Make sure you’re washing a full load of laundry. Don’t just throw some socks and two shirts in the washing machine - put a full load of laundry in so that you’ll be sure to not waste water. While you want the washing machine to be full, don't overload it. If you put too many clothes in there you'll strain the machine and your clothes won't get as clean. When washing your clothes, use the economy mode - this will save you both water and electricity! Use cold water instead of warm water. It takes water to create energy, and energy is needed to heat up your water. By choosing to wash your clothes in cold water, you'll save water and energy. Using cold water prevents stains from setting and colors from bleeding as well. Dry your clean clothes on a drying rack. This may not be possible to do with all of your clothes, but try to hang-dry as many dresses, shirts, pants, etc. as possible. The dryer uses lots of energy, which in turn uses lots of water to help create that energy. Do less laundry. Many items of clothing, such as jeans and sweaters, don’t need to be washed every time you wear them. Try to be aware of which items of clothing are truly dirty and which could be worn again. This will not only save water, but will save wear and tear on your clothes! It’s normal to wear pajamas two or three times before having to wash them, especially if you shower before going to bed. Do change socks and underwear daily, but wear slacks, jeans, and skirts more than once between washings. When wearing a sweatshirt or sweater over another shirt, you only need to wash the innermost layer regularly. Hang towels on a rack to air dry after you shower, and use them multiple times between washings. Conserving Water in the Kitchen Load your dishwasher to its full capacity. Similar to your washing machine, you want to make sure your dishwasher is completely full before running it to save water. If you don’t have a dishwasher, try rinsing the dishes in a full sink or pan of water instead of leaving the faucet running while hand washing. Scrape larger pieces of food waste into the trash or compost. If your dishes don't get clean without pre-rinsing, make sure you're loading properly, that your dishwasher is in good repair, and that you're using an effective dishwasher detergent. Use your garbage disposal sparingly. Garbage disposals use a lot of water to get rid of the garbage, so try not to use it very often. Either dump your scraps in the trash, or better yet, start a homemade compost bin rather than washing them down the sink. Defrost frozen food in the refrigerator. While it may be faster to soak your frozen food in water, this isn’t necessary and wastes water. Try planning ahead and putting the food you want thawed in the fridge overnight. Rinse foods in a full sink or pan of water. When you need to rinse fruits, vegetables, or other foods with water, try filling up a pan or tub of water to wash them in instead of letting the faucet run. You'll use less water and can also use water from the pan for your plants. Keep a pitcher of drinking water in the fridge. Instead of running the faucet long enough for the water to become cold enough to drink, fill a bottle or pitcher up with water and put it in the fridge. Now you won't have to wait for cold water, and you've saved water as well. Conserving Water Outdoors Install a water meter. You might be very surprised to find out how much water you are actually using. By installing a water meter, you can raise your awareness and consequently reduce your water usage. If you already have a water meter, learn how to read it. Meters can be very helpful in detecting leaks - read the meter once, wait an hour or two without running any water, and read it again. If it has moved, something is leaking. Use smart watering tactics on your yard and plants. There’s a way to keep your grass and plants healthy while also conserving water. Water areas that truly need it, and only when there hasn’t been enough rain. The best time of day to do your watering is in the morning or evening so that the water doesn’t immediately evaporate, and don’t water on cool, rainy, or windy days. Water your garden with a watering can or use a trigger nozzle on your hose to prevent extra water usage. You can build a rainwater collection system to watch the rain and use it for watering your plants, lawn or garden. Check your local water rules first to make sure it's allowed. Water deeply but less often. This will encourage plants to grow deeper roots, so that they need water less frequently. Time your water usage. Put a timer on your sprinkler and outdoor faucets/taps. Look for inexpensive, automatic timers that screw between the hose and the hose bib, or install a programmable timer on your sprinkler or drip system. An automatic timer can also help you water at times of day when the water can be absorbed the best. If you water something manually, set a kitchen timer before you turn the water on, or stay with the hose the whole time. Know how to adjust your sprinkler and irrigation timer settings for the seasons. Water less or not at all during wetter, cooler weather. Don't over-water, and don't water any faster than the soil can absorb the water. If water is running off the lawn onto the sidewalk, cut the watering time or divide it into two smaller segments to allow time for the water to absorb. Maintain your sprinklers and irrigation. If you have irrigation on timers, make sure you monitor it from time to time. Fix broken sprinkler heads and pipes, and make sure that spray patterns are directed where they are intended. Consider using a drip irrigation system or something similar to save even more water. Adjust sprinklers if necessary so that they only reach areas that need water instead of the sidewalk or driveway. Don’t cut your grass too short. In terms of water-saving strategies, growing long grass is better than cutting it too short. Grass is able to grow deeper roots when it's longer, allowing it to be watered less often. Raise the height of your mower blade to avoid mowing your lawn too short. If you live in an area with infrequent rain, consider not planting grass and instead using plants from your area that don't need as much attention and water. Use mulch on your garden to retain moisture. Covering the soil around your plants with mulch will not only prevent water from evaporating, but it will keep your soil healthy and prevent weed growth. You want to find mulch that is organic - it'll improve your soil as it breaks down. The most common types of mulch are wood chips and bark. Use a bucket as opposed to a hose to wash your car. While a little bit more work, using a bucket instead of a hose to wash your car will cut down on water use. Many commercial car washes may use less water than you use at home, and many of them have water recycling systems to collect and filter used water. Use environmentally-friendly cleansers. This will enable you to reuse wastewater from washing to water the lawn or garden. Don't wash the driveway or sidewalk with a hose. If you need to clean your sidewalk or driveway, use a broom, rake, or leaf blower to remove dry matter. If the driveway or sidewalk still needs additional cleaning, use a bucket of water or let the rain do the rest. Using a hose will only waste water. Cover your swimming pool. If you have a pool, using a pool cover at night during the warmer months helps to prevent evaporation. In some places, emptying and refilling a pool is under severe restrictions, or even banned, so preserving this precious resource is crucial. Use grey water to flush your toilet or water your lawn. Grey water is any water that’s been used after running the dishwasher, shower, washing machine, or sink in your house. Depending on the laws where you live, it’s possible to re-route grey water and use it to flush your toilets or water your lawn so as not to be wasteful. If watering plants, don’t use grey water on anything you might eat, as the water could be contaminated. The easiest way to use grey water is to link it directly from the indoors to the outdoors using piping, and then use the water on your garden or yard. Reducing Your Water Footprint Eat and buy locally. If your food, clothing, or other goods had to travel a long distance to get to you, it probably used a lot of water in doing so. The production of gasoline uses many gallons of water, so try to purchase local foods and merchandise to reduce your water footprint. Shop for your food at a local farmers market, or find local boutiques where you can purchase clothing. Instead of heading to huge chain stores such as Walmart or Target, try to buy your goods from individual local businesses that specialize in what you need. Eat less meat and dairy. Growing animal feed uses tons of water, not to mention the amount of water used in the rest of the meat and dairy production process. Learn to fish and hunt responsibly for more sustainable animal protein. The more domesticated meat and dairy you eat, the more animals are needed to keep up with the demand, so try to limit your intake of such foods. Cut down on the amount of processed foods you eat. Every step needed to process food uses lots of water. By eating fresher food, not only will you cut down on your water footprint, but you'll also feel healthier! Sugar cane uses much more water to grow than most other crops - cut out those sugary foods to help save water and stay healthier. Drink water. All of those other beverages —wine, tea, soda, juice — took water to produce too. More water is used to help power the factory where the soda is made and grow the fruits and sugar used in juice than is worth the large water footprint it causes. Instead of drinking a soft drink, opt for plain water - the health advantages are in your favor as well as the Earth's. Carpool, bike, or use public transportation. By carpooling to school, biking to work, or taking a bus to run errands, you'll cut down on energy use as well as water use. As stated earlier, it takes many gallons of water to produce one gallon of gasoline, so do your part and try to drive less. Reuse or recycle products. It takes hundreds of gallons of water to produce everything from a t-shirt to a ream of paper. Donate old clothes, furniture, or any other household items to charities or donation centers, and recycle your paper, plastics, and metals. Reduce, reuse, recycle is usually the best policy when it comes to the environment, and trying to save water is no exception.",
  "tyn_model":[
    "water",
    "hose",
    "mulch",
    "shower heads",
    "water meter",
    "grey water",
    "food coloring",
    "shower head",
    "toilet",
    "urinals",
    "washing machine",
    "dishwasher",
    "sprinklers",
    "bucket",
    "pool",
    "plumber",
    "faucet aerator",
    "timer",
    "shower",
    "dual-flush toilet",
    "toilets",
    "washer",
    "washers",
    "top-loaders",
    "drying rack",
    "dryer",
    "towels",
    "dishwasher detergent",
    "garbage disposal",
    "pitcher",
    "watering can",
    "sprinkler",
    "drip irrigation system",
    "grass",
    "mower",
    "broom",
    "leaf blower",
    "swimming pool",
    "pool cover",
    "fish",
    "sugar cane",
    "—wine",
    "tea",
    "— took",
    "paper"
  ],
  "tyn_section":[

  ]
}