{
  "title":"How to Make Chocolate Chip Cookie Dough Stuffed Oreos",
  "url":"https://www.wikihow.com/Make-Chocolate-Chip-Cookie-Dough-Stuffed-Oreos",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "parts":[
    {
      "name":"Making the Cookie Dough",
      "steps":[
        {
          "headline":"Cream the butter and brown sugar.",
          "description":"Using an electric mixer or spoon, combine the butter and brown sugar in a small bowl."
        },
        {
          "headline":"Pour in the vanilla extract and salt.",
          "description":"Mix again with an electric mixer or spoon."
        },
        {
          "headline":"Stir in the flour.",
          "description":"The cookie dough will become dry and crumbly; this is normal. Mix until there are no \"clumps\" of flour in the bowl."
        },
        {
          "headline":"Combine in the milk.",
          "description":"The dough should stick together once the milk is mixed in, and resemble cookie dough."
        },
        {
          "headline":"Fold in the mini chocolate chips.",
          "description":""
        },
        {
          "headline":"Scoop the cookie dough onto a flat surface.",
          "description":"Something like a clean, flat countertop or a chopping board is best."
        },
        {
          "headline":"Roll the cookie dough into small balls.",
          "description":"Separate the cookie dough into small pieces and use your hands to roll it into small balls. It's also possible to use a melon baller or mini ice cream scoop to scoop out small balls of cookie dough. You may want to place the cookie dough balls into a bowl to ensure that they don't roll away."
        }
      ]
    },
    {
      "name":"Stuffing the Oreos",
      "steps":[
        {
          "headline":"Carefully open the Oreos.",
          "description":"The best way to open an Oreo is to twist the cookies apart, so as to prevent the cream filling from \"splitting\"."
        },
        {
          "headline":"Take a ball of cookie dough and use your hand to gently press on it and flatten it slightly.",
          "description":""
        },
        {
          "headline":"Place the flattened ball of cookie dough into the center of the Oreo.",
          "description":""
        },
        {
          "headline":"Press the other half of the Oreo to the cookie dough.",
          "description":"Flatten it down with the cookie, but be careful not to press too hard."
        },
        {
          "headline":"Repeat this process for each cookie you want to make.",
          "description":""
        },
        {
          "headline":"Serve the cookies.",
          "description":"Place the cookie-dough-stuffed Oreos on a plate. Serve with a glass of milk, if desired."
        }
      ]
    }
  ],
  "text":" Making the Cookie Dough Cream the butter and brown sugar. Using an electric mixer or spoon, combine the butter and brown sugar in a small bowl. Pour in the vanilla extract and salt. Mix again with an electric mixer or spoon. Stir in the flour. The cookie dough will become dry and crumbly; this is normal. Mix until there are no \"clumps\" of flour in the bowl. Combine in the milk. The dough should stick together once the milk is mixed in, and resemble cookie dough. Fold in the mini chocolate chips.  Scoop the cookie dough onto a flat surface. Something like a clean, flat countertop or a chopping board is best. Roll the cookie dough into small balls. Separate the cookie dough into small pieces and use your hands to roll it into small balls. It's also possible to use a melon baller or mini ice cream scoop to scoop out small balls of cookie dough. You may want to place the cookie dough balls into a bowl to ensure that they don't roll away. Stuffing the Oreos Carefully open the Oreos. The best way to open an Oreo is to twist the cookies apart, so as to prevent the cream filling from \"splitting\". Take a ball of cookie dough and use your hand to gently press on it and flatten it slightly.  Place the flattened ball of cookie dough into the center of the Oreo.  Press the other half of the Oreo to the cookie dough. Flatten it down with the cookie, but be careful not to press too hard. Repeat this process for each cookie you want to make.  Serve the cookies. Place the cookie-dough-stuffed Oreos on a plate. Serve with a glass of milk, if desired.",
  "tyn_model":[
    "cookie dough",
    "milk",
    "oreos",
    "butter",
    "brown sugar",
    "electric mixer",
    "flour",
    "small bowl",
    "vanilla extract",
    "salt",
    "bowl",
    "chocolate chips",
    "melon baller",
    "ice cream scoop",
    "oreo",
    "plate"
  ],
  "tyn_section":[

  ]
}