{
  "title":"How to Find Frog Ponds in Don't Starve",
  "url":"https://www.wikihow.com/Find-Frog-Ponds-in-Don%27t-Starve",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Don't Starve Video Games"
  ],
  "methods":[
    {
      "name":"Finding Frog Ponds the Conventional Way",
      "steps":[
        {
          "headline":"Know the different ponds.",
          "description":"There are three kinds of Ponds in the game: the Mosquito pond, the Frog pond and the Eel pond. The first two kinds are readily available on the surface, while the third is exclusive only to the Ruins portion of the underground. Frog ponds are more common and found in more places than the Mosquito ponds, and they spawn Frogs during the daytime. Meanwhile, Mosquito ponds are found in the Marshes and spawn Mosquitos during dusk and nighttime. For visual differences, Frog ponds have a green border, Mosquito ponds have a purple border, and Eel ponds have bright green water."
        },
        {
          "headline":"Follow the roads.",
          "description":"Following the trail of a cobblestone road or a dirt path is often the most reliable way to get anywhere in the game. Oftentimes, they would lead you to places like Pig Villages or Things. More often, though, they tend to lead you towards a pond or even a large cluster of ponds!"
        },
        {
          "headline":"Explore forests.",
          "description":"Forests are one of the places you can find Ponds in. You can usually find them scattered near the trees. They’re a bit uncommon though and are generated one at a time. With the addition of the multiple trees making your view limited, it can be tricky to search in the Forest."
        },
        {
          "headline":"Wander around grasslands.",
          "description":"Ponds are a bit easier to find in the Grasslands, and not only because they have less trees blocking the view. Ponds spawn more often and tend to cluster around each other in the Grasslands, making it one of the surest areas to search when looking for your Ponds."
        },
        {
          "headline":"Listen for croaking.",
          "description":"If you’re exploring during the day, you can usually hear the Frogs croaking and wandering about a short distance before encountering any ponds. Frogs spawn during the day and tend to wander around the area near their ponds, and then retreat during dusk. Be careful, though! Frogs are aggressive, pesky little buggers, and they tend to knock away things from your inventory whenever they attack. You can always pick your stuff back up, but it would leave you vulnerable to more Frog attacks, so watch yourself if you plan on looking for Ponds!"
        }
      ]
    },
    {
      "name":"Adjusting the Number of Ponds in the Creation Menu",
      "steps":[
        {
          "headline":"Go to the World menu.",
          "description":"When you first make your world in Don’t Starve, you can see a set of options to modify your gaming experience. Press the “World” option in the Creation screen. This will open the World menu where you can adjust the settings for the game world."
        },
        {
          "headline":"Scroll through the menu until you see the icon of a pond.",
          "description":"Like the others, beside the icon is a bar with the word “Default” and arrows."
        },
        {
          "headline":"Click the right arrow to increase your chances of finding a pond to either “More” or “Lots.” The “More” option simply makes your ponds more accessible and plentiful, while the “Lots” options would place them nearly everywhere.",
          "description":"If you press the left arrow button, it would decrease the spawn rates of whatever you choose. You can also modify the settings and spawn rates of other things and monsters, depending on your preference!"
        },
        {
          "headline":"Exit the menu and start playing the game.",
          "description":"When you enter the game, you’ll find that the number of ponds have increased, depending on whether you set it to “More” or “Lots.” Now enjoy your nearly effort-free Pond spoils! Be careful though! More ponds means more Frogs, and if you choose Lots, you’ll be practically swimming in them. Tread carefully when under Frog-infested worlds, and make armor and weapons as quickly as possible when playing in one."
        }
      ]
    },
    {
      "name":"Finding Frog Ponds Using Cheat Codes (PC Only)",
      "steps":[
        {
          "headline":"Find a nice spot to place your Pond in.",
          "description":"Since the cheat works by generating the item or structure where the cursor is, you’re better off placing it somewhere wide and accessible. It won’t spawn if the area is too small to hold a Pond, and you wouldn’t want it too near your stuff. Go to a clear place at least a screen or two from your camp’s location. To make it look naturally generated, place it in the nearest Grasslands or in a Forest area."
        },
        {
          "headline":"Press the tilde (~) button on your keyboard.",
          "description":"This method only works for the PC, and this will immediately place a pond right where your mouse is pointed at, so make sure you see the mouse cursor on the screen before you enter the cheat code."
        },
        {
          "headline":"Type “DebugSpawn “pond”” in the box that appears.",
          "description":"The DebugSpawn code is simply a code that generates items and structures depending on what item name you type in. While you’ll need a guide to find all the item names, the Frog Pond is simply “pond” in the game’s files, ensuring that you get a single Frog Pond every time you use the cheat. To get rid of the scrolling text that remains on the screen after you finish putting in your cheat, press CTRL + L.\nThe other ponds are known as “pond_mos” and “pond_cave” in the database, so if you want to get an Eel without diving deep into the Caves, or want to farm Mosquitos without being in the swamp, you can use these instead of “pond.”"
        }
      ]
    }
  ],
  "text":" Finding Frog Ponds the Conventional Way Know the different ponds. There are three kinds of Ponds in the game: the Mosquito pond, the Frog pond and the Eel pond. The first two kinds are readily available on the surface, while the third is exclusive only to the Ruins portion of the underground. Frog ponds are more common and found in more places than the Mosquito ponds, and they spawn Frogs during the daytime. Meanwhile, Mosquito ponds are found in the Marshes and spawn Mosquitos during dusk and nighttime. For visual differences, Frog ponds have a green border, Mosquito ponds have a purple border, and Eel ponds have bright green water. Follow the roads. Following the trail of a cobblestone road or a dirt path is often the most reliable way to get anywhere in the game. Oftentimes, they would lead you to places like Pig Villages or Things. More often, though, they tend to lead you towards a pond or even a large cluster of ponds! Explore forests. Forests are one of the places you can find Ponds in. You can usually find them scattered near the trees. They’re a bit uncommon though and are generated one at a time. With the addition of the multiple trees making your view limited, it can be tricky to search in the Forest. Wander around grasslands. Ponds are a bit easier to find in the Grasslands, and not only because they have less trees blocking the view. Ponds spawn more often and tend to cluster around each other in the Grasslands, making it one of the surest areas to search when looking for your Ponds. Listen for croaking. If you’re exploring during the day, you can usually hear the Frogs croaking and wandering about a short distance before encountering any ponds. Frogs spawn during the day and tend to wander around the area near their ponds, and then retreat during dusk. Be careful, though! Frogs are aggressive, pesky little buggers, and they tend to knock away things from your inventory whenever they attack. You can always pick your stuff back up, but it would leave you vulnerable to more Frog attacks, so watch yourself if you plan on looking for Ponds! Adjusting the Number of Ponds in the Creation Menu Go to the World menu. When you first make your world in Don’t Starve, you can see a set of options to modify your gaming experience. Press the “World” option in the Creation screen. This will open the World menu where you can adjust the settings for the game world. Scroll through the menu until you see the icon of a pond. Like the others, beside the icon is a bar with the word “Default” and arrows. Click the right arrow to increase your chances of finding a pond to either “More” or “Lots.” The “More” option simply makes your ponds more accessible and plentiful, while the “Lots” options would place them nearly everywhere. If you press the left arrow button, it would decrease the spawn rates of whatever you choose. You can also modify the settings and spawn rates of other things and monsters, depending on your preference! Exit the menu and start playing the game. When you enter the game, you’ll find that the number of ponds have increased, depending on whether you set it to “More” or “Lots.” Now enjoy your nearly effort-free Pond spoils! Be careful though! More ponds means more Frogs, and if you choose Lots, you’ll be practically swimming in them. Tread carefully when under Frog-infested worlds, and make armor and weapons as quickly as possible when playing in one. Finding Frog Ponds Using Cheat Codes (PC Only) Find a nice spot to place your Pond in. Since the cheat works by generating the item or structure where the cursor is, you’re better off placing it somewhere wide and accessible. It won’t spawn if the area is too small to hold a Pond, and you wouldn’t want it too near your stuff. Go to a clear place at least a screen or two from your camp’s location. To make it look naturally generated, place it in the nearest Grasslands or in a Forest area. Press the tilde (~) button on your keyboard. This method only works for the PC, and this will immediately place a pond right where your mouse is pointed at, so make sure you see the mouse cursor on the screen before you enter the cheat code. Type “DebugSpawn “pond”” in the box that appears. The DebugSpawn code is simply a code that generates items and structures depending on what item name you type in. While you’ll need a guide to find all the item names, the Frog Pond is simply “pond” in the game’s files, ensuring that you get a single Frog Pond every time you use the cheat. To get rid of the scrolling text that remains on the screen after you finish putting in your cheat, press CTRL + L.\nThe other ponds are known as “pond_mos” and “pond_cave” in the database, so if you want to get an Eel without diving deep into the Caves, or want to farm Mosquitos without being in the swamp, you can use these instead of “pond.”",
  "tyn_model":[
    "ponds",
    "pond",
    "“more",
    "“lots",
    "“pond",
    "frogs",
    "” option",
    "” and",
    "” or",
    "” in",
    "frog",
    "water",
    "forests",
    "“world",
    "“default",
    "” the",
    "” options",
    "” now",
    "“debugspawn",
    "””",
    "frog pond",
    "“pond_mos",
    "“pond_cave",
    "eel"
  ],
  "tyn_section":[

  ]
}