{
  "title":"How to Guard Yourself Against Fire in Your Home",
  "url":"https://www.wikihow.com/Guard-Yourself-Against-Fire-in-Your-Home",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "steps":[
    {
      "headline":"Check your household smoke alarms once a month.",
      "description":"Smoke detectors reduce your risk of being killed in fire by 50%. If the battery is low, replace it. Change the batteries every year. Replace your smoke alarms every 10 years."
    },
    {
      "headline":"Stay in the kitchen when using the stove, and turn everything off when you are done.",
      "description":"Don't leave the kitchen if you are frying, grilling, using the stove, or using an open flame. Too many people go out and mistakenly leave food cooking on the stove and it boils dry and causes a fire. A moment's thought can and does save lives. If you need to leave the kitchen briefly, turn off the stove (no matter how soon you'll be back). Tie back long hair. Wear short, tight, or tightly-rolled-up sleeves when cooking. Make sure you turn off the stove, oven, etc. when you are done."
    },
    {
      "headline":"Never put toasters or other hot items underneath a kitchen cupboard.",
      "description":"It may cause a fire."
    },
    {
      "headline":"Practice safety with heat and electricity in the bathroom.",
      "description":"Turn off any heat-styling equipment (hair curlers, blow-dryers) once you're done, and place them where they aren't touching anything flammable."
    },
    {
      "headline":"Be very careful when burning candles in the home.",
      "description":"Candles may fall over a TV switch, washing machine, or dryer, and start a fire. If you have a candle burning, keep it in sight. Run the spent match under cold water from the faucet before you throw it in the trash. Place the candle in a glass jar or on a glass dish. Some candles get very hot from prolonged use, and may burn plastic containers. (This also protects your fingers if you pick up a hot candle.)"
    },
    {
      "headline":"Keep flammable objects \"3 feet from the heat\" (1 meter).",
      "description":"If you are using a fireplace, space heater, baseboard, etc. it's important to keep away objects that could catch fire. Be mindful of things such as...\nFurniture\nCurtains\nDish towels\nPapers"
    },
    {
      "headline":"Stay safe with electrical wires and outlets.",
      "description":"Avoid using too many extension cords, or too much electricity from one outlet. If a light switch is hot to the touch, or if a light flickers, it needs to be professionally replaced."
    },
    {
      "headline":"Don't smoke in the house.",
      "description":"If you need to smoke, do so outside or in a garage or basement, at least 3 feet (1 meter) away from flammable items. Put out the butt in a can of sand, then place it in an ashtray. Soak the butts and ashes in water before throwing them away. Make a habit of properly disposing of the butt. One careless disposal could cost you lots of money, your home, or your life. Never smoke in an armchair or in bed; doing so could lead to fire."
    },
    {
      "headline":"Turn off lights and heat sources when you are done.",
      "description":"Avoid leaving lights, lamps, or electric blankets on for long periods."
    },
    {
      "headline":"Talk to children about fire safety.",
      "description":"Explain to children that matches and some appliances (stove, oven, hair dryer) are dangerous, so they must not play with them. Explain that they need a responsible adult when using these things, for their and the family's safety. For young children, keep matches and hot appliances out of reach. Tell children that if they find a match or lighter, they should not touch it. The best thing to do is let it be, and go tell an adult right away. Never leave children unattended near stoves, candles, space heaters, etc. (even for a short time)"
    }
  ],
  "text":" Check your household smoke alarms once a month. Smoke detectors reduce your risk of being killed in fire by 50%. If the battery is low, replace it. Change the batteries every year. Replace your smoke alarms every 10 years. Stay in the kitchen when using the stove, and turn everything off when you are done. Don't leave the kitchen if you are frying, grilling, using the stove, or using an open flame. Too many people go out and mistakenly leave food cooking on the stove and it boils dry and causes a fire. A moment's thought can and does save lives. If you need to leave the kitchen briefly, turn off the stove (no matter how soon you'll be back). Tie back long hair. Wear short, tight, or tightly-rolled-up sleeves when cooking. Make sure you turn off the stove, oven, etc. when you are done. Never put toasters or other hot items underneath a kitchen cupboard. It may cause a fire. Practice safety with heat and electricity in the bathroom. Turn off any heat-styling equipment (hair curlers, blow-dryers) once you're done, and place them where they aren't touching anything flammable. Be very careful when burning candles in the home. Candles may fall over a TV switch, washing machine, or dryer, and start a fire. If you have a candle burning, keep it in sight. Run the spent match under cold water from the faucet before you throw it in the trash. Place the candle in a glass jar or on a glass dish. Some candles get very hot from prolonged use, and may burn plastic containers. (This also protects your fingers if you pick up a hot candle.) Keep flammable objects \"3 feet from the heat\" (1 meter). If you are using a fireplace, space heater, baseboard, etc. it's important to keep away objects that could catch fire. Be mindful of things such as...\nFurniture\nCurtains\nDish towels\nPapers Stay safe with electrical wires and outlets. Avoid using too many extension cords, or too much electricity from one outlet. If a light switch is hot to the touch, or if a light flickers, it needs to be professionally replaced. Don't smoke in the house. If you need to smoke, do so outside or in a garage or basement, at least 3 feet (1 meter) away from flammable items. Put out the butt in a can of sand, then place it in an ashtray. Soak the butts and ashes in water before throwing them away. Make a habit of properly disposing of the butt. One careless disposal could cost you lots of money, your home, or your life. Never smoke in an armchair or in bed; doing so could lead to fire. Turn off lights and heat sources when you are done. Avoid leaving lights, lamps, or electric blankets on for long periods. Talk to children about fire safety. Explain to children that matches and some appliances (stove, oven, hair dryer) are dangerous, so they must not play with them. Explain that they need a responsible adult when using these things, for their and the family's safety. For young children, keep matches and hot appliances out of reach. Tell children that if they find a match or lighter, they should not touch it. The best thing to do is let it be, and go tell an adult right away. Never leave children unattended near stoves, candles, space heaters, etc. (even for a short time)",
  "tyn_model":[
    "stove",
    "candles",
    "smoke alarms",
    "oven",
    "candle",
    "match",
    "water",
    "matches",
    "smoke detectors",
    "toasters",
    "heat-styling equipment",
    "hair curlers",
    "blow-dryers",
    "fireplace",
    "space heater",
    "dish towels",
    "papers",
    "electrical wires",
    "extension cords",
    "sand",
    "ashtray",
    "lamps",
    "electric blankets",
    "lighter",
    "stoves",
    "space heaters"
  ],
  "tyn_section":[

  ]
}