{
  "title":"How to Plant Rice Indoors",
  "url":"https://www.wikihow.com/Plant-Rice-Indoors",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "parts":[
    {
      "name":"Sprouting Your Grains",
      "steps":[
        {
          "headline":"Purchase brown rice online or even at your local grocery store.",
          "description":"If you want a specific or special kind of rice, you'll likely need to go online to find the seeds. Otherwise, you can just use brown rice from your grocery store, as the seeds are what you eat. Pick the least processed rice you can find, such as organic brown rice. Don't pick white rice, as it has the shell of the seed removed. It won't germinate."
        },
        {
          "headline":"Soak the grains in water for 24 hours.",
          "description":"Place the rice grains in a bowl and cover them with water. Leave the grains in a warm area for the next 24 hours. When you come back and check on them, they should be sprouted. If you're just using brown rice from the grocery store, you may not have high germination, meaning you may only see half your seeds sprout, for instance. If none of the seeds have sprouted, change the water and leave them for another 24 hours. Germinating the seeds this way may help increase the number of seeds that sprout. However, you can skip this process altogether; instead, you can prepare your pot with soil and water and and simply drop the seeds into it to germinate in the soil."
        },
        {
          "headline":"Place the seeds in a wet paper towel for 2-3 days.",
          "description":"Pull the seeds out of the water and put them in a damp paper towel. Place the towel in a plastic bag and seal it up. Then you can set it in a warm area for another couple of days. Check on the seeds each day. You should see 1 to 2 inches (2.5 to 5.1 cm) of sprouting within a day or two."
        }
      ]
    },
    {
      "name":"Preparing Your Pot",
      "steps":[
        {
          "headline":"Find 1-2 large pots.",
          "description":"To grow enough rice to be of use to you, you should have several pots or buckets growing. Otherwise, if you just want an ornamental plant, you can use a single pot or bucket. You can use the large buckets you find at home improvement stores, for instance, or any large container, such as a clay pot. Make sure your containers are at least 1 foot (0.30 m) deep and 1 to 2 feet (0.30 to 0.61 m) wide. Rice produces 10 pounds (4.5 kg) per 100 square feet (9.3 m). That means if you're only using containers that hold 1 to 2 square feet (0.093 to 0.186 m), you'll only get about 0.1 to 0.2 pounds (0.045 to 0.091 kg) of rice from your plants."
        },
        {
          "headline":"Plug up the drainage holes if your container has any.",
          "description":"Unlike most plants, you don't want the water to drain away from the rice. Therefore, it's very important to either pick containers without holes or to plug up any holes the container has on the bottom. Try using clay or rubber to plug up the bottom of the container. Make sure it's water-tight before adding the soil."
        },
        {
          "headline":"Layer 6 to 8 inches (15 to 20 cm) of potting soil on the bottom.",
          "description":"You need a solid amount of dirt for your rice to grow in. You can just use soil from your garden, but if you do, you'll need to add in compost or another fertilizer. Use about 1 part compost to 2 parts soil. Make sure you still have about 6 inches (15 cm) from the top of the pot to add water. If you add soil from your garden, keep in mind it can carry pests and bacteria that you're bringing inside your home. Pre-packaged potting soil tends to be free of these problems. Don't pack the soil in. Keep it fairly loose. Pick a potting soil that's designed to retain water. The bag will say \"good water retention\" or something to that effect."
        },
        {
          "headline":"Add enough water to cover the soil by 2 inches (5.1 cm).",
          "description":"You will need to keep adding water to the container, as it will continue to soak into the soil for several minutes. Once it stops soaking in, fill the container up so the water level is 2 inches (5.1 cm) above the soil. Your rice will need this amount of water for most of the time it's growing."
        }
      ]
    },
    {
      "name":"Growing Your Seeds",
      "steps":[
        {
          "headline":"Add your germinated seeds to the bucket.",
          "description":"You don't need to actually \"plant\" the seeds, as the sprouted seeds will sink into the soil. Spread out an even layer of rice, aiming for seeds every 1 to 2 inches (2.5 to 5.1 cm). If your sprouts don't stand up in the water, you can use your fingers to push the roots down into the soil."
        },
        {
          "headline":"Place the bucket in a warm area with 6-8 hours of light.",
          "description":"If you don't have a sunny area in your home that offers 6-8 hours of light each day, you'll likely need to buy a grow light. Set it up above the buckets so they have consistent light. If the area is drafty, try adding heating mats underneath the buckets to warm the water. Make sure to set the pads on \"low,\" as you don't want the water to get too hot. Heating pads are generally used to help germinate seeds. You can buy them at garden stores or online."
        },
        {
          "headline":"Keep the water topped off until the plants are about 8 inches (20 cm) tall.",
          "description":"Check the plants regularly to make sure they have enough water, maintaining the water at 2 inches (5.1 cm) above the soil. When the plants reach 6 inches (15 cm) above the water, you can top the water off to 4 inches (10 cm) over the soil."
        },
        {
          "headline":"Let the water evaporate off for the rest of the growing season.",
          "description":"The rice stems will continue to grow and absorb the water, but you don't need to add more. The water needs to evaporate as the rice matures. If there's still water above the soil when the rice begins to tip down at the top (\"nod\"), drain it off."
        }
      ]
    },
    {
      "name":"Harvesting the Rice",
      "steps":[
        {
          "headline":"Wait 3-4 months before harvesting your rice.",
          "description":"Rice takes a long time, so don't expect to harvest this plant quickly. From planting, it takes about 4 months to reach maturity. You'll notice the heads start to droop when it's getting close to harvest time."
        },
        {
          "headline":"Look for golden heads 2 weeks after the heads droop.",
          "description":"The stalks will be green up until the heads are ready to be harvested. At the time, they will turn golden, and then you know the plants are ready to be cut."
        },
        {
          "headline":"Cut off the heads with scissors or shears.",
          "description":"When you're ready to harvest, snip the stems 2 to 3 inches (5.1 to 7.6 cm) under the heads. Hold onto the stem above where you want to make the cut so you can catch the heads as they come off the stem. Gather them up together as you cut them."
        },
        {
          "headline":"Spread the heads out to dry.",
          "description":"Put them in a dry, warm area where you can spread the stalks out in a single layer. You can also hang them up in bunches to dry. Simply tie twine around them and hang them upside down. Keep the bunches small so they have space to dry."
        },
        {
          "headline":"Heat the heads in the oven or a dehydrator.",
          "description":"The grains need to be heated to 180 °F (82 °C). Place them on a pan covered in foil, and leave them in the oven or dehydrator for an hour. This way, you know they're completely dry. Spread the heads out as thin as you can in the oven or dehydrator."
        },
        {
          "headline":"Separate the grains from the head to eat them.",
          "description":"Rub the heads with your fingers to get the kernels out of the hulls. Pick all the hulls out by hand so they don't go in your rice! Then, you can cook the rice as you normally would."
        }
      ]
    }
  ],
  "text":" Sprouting Your Grains Purchase brown rice online or even at your local grocery store. If you want a specific or special kind of rice, you'll likely need to go online to find the seeds. Otherwise, you can just use brown rice from your grocery store, as the seeds are what you eat. Pick the least processed rice you can find, such as organic brown rice. Don't pick white rice, as it has the shell of the seed removed. It won't germinate. Soak the grains in water for 24 hours. Place the rice grains in a bowl and cover them with water. Leave the grains in a warm area for the next 24 hours. When you come back and check on them, they should be sprouted. If you're just using brown rice from the grocery store, you may not have high germination, meaning you may only see half your seeds sprout, for instance. If none of the seeds have sprouted, change the water and leave them for another 24 hours. Germinating the seeds this way may help increase the number of seeds that sprout. However, you can skip this process altogether; instead, you can prepare your pot with soil and water and and simply drop the seeds into it to germinate in the soil. Place the seeds in a wet paper towel for 2-3 days. Pull the seeds out of the water and put them in a damp paper towel. Place the towel in a plastic bag and seal it up. Then you can set it in a warm area for another couple of days. Check on the seeds each day. You should see 1 to 2 inches (2.5 to 5.1 cm) of sprouting within a day or two. Preparing Your Pot Find 1-2 large pots. To grow enough rice to be of use to you, you should have several pots or buckets growing. Otherwise, if you just want an ornamental plant, you can use a single pot or bucket. You can use the large buckets you find at home improvement stores, for instance, or any large container, such as a clay pot. Make sure your containers are at least 1 foot (0.30 m) deep and 1 to 2 feet (0.30 to 0.61 m) wide. Rice produces 10 pounds (4.5 kg) per 100 square feet (9.3 m). That means if you're only using containers that hold 1 to 2 square feet (0.093 to 0.186 m), you'll only get about 0.1 to 0.2 pounds (0.045 to 0.091 kg) of rice from your plants. Plug up the drainage holes if your container has any. Unlike most plants, you don't want the water to drain away from the rice. Therefore, it's very important to either pick containers without holes or to plug up any holes the container has on the bottom. Try using clay or rubber to plug up the bottom of the container. Make sure it's water-tight before adding the soil. Layer 6 to 8 inches (15 to 20 cm) of potting soil on the bottom. You need a solid amount of dirt for your rice to grow in. You can just use soil from your garden, but if you do, you'll need to add in compost or another fertilizer. Use about 1 part compost to 2 parts soil. Make sure you still have about 6 inches (15 cm) from the top of the pot to add water. If you add soil from your garden, keep in mind it can carry pests and bacteria that you're bringing inside your home. Pre-packaged potting soil tends to be free of these problems. Don't pack the soil in. Keep it fairly loose. Pick a potting soil that's designed to retain water. The bag will say \"good water retention\" or something to that effect. Add enough water to cover the soil by 2 inches (5.1 cm). You will need to keep adding water to the container, as it will continue to soak into the soil for several minutes. Once it stops soaking in, fill the container up so the water level is 2 inches (5.1 cm) above the soil. Your rice will need this amount of water for most of the time it's growing. Growing Your Seeds Add your germinated seeds to the bucket. You don't need to actually \"plant\" the seeds, as the sprouted seeds will sink into the soil. Spread out an even layer of rice, aiming for seeds every 1 to 2 inches (2.5 to 5.1 cm). If your sprouts don't stand up in the water, you can use your fingers to push the roots down into the soil. Place the bucket in a warm area with 6-8 hours of light. If you don't have a sunny area in your home that offers 6-8 hours of light each day, you'll likely need to buy a grow light. Set it up above the buckets so they have consistent light. If the area is drafty, try adding heating mats underneath the buckets to warm the water. Make sure to set the pads on \"low,\" as you don't want the water to get too hot. Heating pads are generally used to help germinate seeds. You can buy them at garden stores or online. Keep the water topped off until the plants are about 8 inches (20 cm) tall. Check the plants regularly to make sure they have enough water, maintaining the water at 2 inches (5.1 cm) above the soil. When the plants reach 6 inches (15 cm) above the water, you can top the water off to 4 inches (10 cm) over the soil. Let the water evaporate off for the rest of the growing season. The rice stems will continue to grow and absorb the water, but you don't need to add more. The water needs to evaporate as the rice matures. If there's still water above the soil when the rice begins to tip down at the top (\"nod\"), drain it off. Harvesting the Rice Wait 3-4 months before harvesting your rice. Rice takes a long time, so don't expect to harvest this plant quickly. From planting, it takes about 4 months to reach maturity. You'll notice the heads start to droop when it's getting close to harvest time. Look for golden heads 2 weeks after the heads droop. The stalks will be green up until the heads are ready to be harvested. At the time, they will turn golden, and then you know the plants are ready to be cut. Cut off the heads with scissors or shears. When you're ready to harvest, snip the stems 2 to 3 inches (5.1 to 7.6 cm) under the heads. Hold onto the stem above where you want to make the cut so you can catch the heads as they come off the stem. Gather them up together as you cut them. Spread the heads out to dry. Put them in a dry, warm area where you can spread the stalks out in a single layer. You can also hang them up in bunches to dry. Simply tie twine around them and hang them upside down. Keep the bunches small so they have space to dry. Heat the heads in the oven or a dehydrator. The grains need to be heated to 180 °F (82 °C). Place them on a pan covered in foil, and leave them in the oven or dehydrator for an hour. This way, you know they're completely dry. Spread the heads out as thin as you can in the oven or dehydrator. Separate the grains from the head to eat them. Rub the heads with your fingers to get the kernels out of the hulls. Pick all the hulls out by hand so they don't go in your rice! Then, you can cook the rice as you normally would.",
  "tyn_model":[
    "water",
    "rice",
    "brown rice",
    "pot",
    "buckets",
    "bucket",
    "containers",
    "soil",
    "potting soil",
    "oven",
    "dehydrator",
    "pots",
    "compost",
    "bowl",
    "clay pot",
    "clay",
    "container",
    "grow light",
    "heating pads",
    "scissors",
    "shears",
    "twine",
    "pan",
    "foil"
  ],
  "tyn_section":[

  ]
}