{
  "title":"How to Make a French Meringues",
  "url":"https://www.wikihow.com/Make-a-French-Meringues",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "steps":[
    {
      "headline":"Heat the oven to 90°C/194°F/Gas Mark 2",
      "description":""
    },
    {
      "headline":"In 2 medium-sized clean bowls separate the eggs so that you are left with 4 egg whites and 4 egg yolks.",
      "description":"Put the bowl with the egg yolks aside as you will not be using them."
    },
    {
      "headline":"Put the egg whites into a large mixing bowl and whisk for at least 12 minutes to produce soft peaks.",
      "description":""
    },
    {
      "headline":"Put the saucepan on a stove and add the sugar and water.",
      "description":""
    },
    {
      "headline":"Slowly boil the sugar and water.",
      "description":""
    },
    {
      "headline":"Add the whisked egg whites to the boiling sugar and water.",
      "description":""
    },
    {
      "headline":"Mix the sugar, water and whisked egg whites together.",
      "description":"At first the mixture will look runny but as it cools it will go back to the consistency of your meringue. Keep whisking the mixture until it has cooled down."
    },
    {
      "headline":"Put the food thermometer into the mixture to check and when it reaches150 °F/60°C the mixture will be ready to use.",
      "description":""
    },
    {
      "headline":"Grease the silicone mat or baking tray with the melted butter or oil.",
      "description":""
    },
    {
      "headline":"Spoon the cooled mixture into your piping bag.",
      "description":""
    },
    {
      "headline":"Pipe a 2-inch spread of meringue mixture onto the baking tray.",
      "description":"You can pipe the mixture quite close together because it will not spread. You can make lots of small meringues or one large one."
    },
    {
      "headline":"Put the tray into the oven and cook for 2 hours until the meringues have totally dried out.",
      "description":""
    },
    {
      "headline":"Using oven gloves remove the tray from the oven and place on the cooling rack until cold.",
      "description":""
    },
    {
      "headline":"Put the cold meringues in to an airtight container.",
      "description":"They should keep fresh for about 2 weeks."
    }
  ],
  "text":" Heat the oven to 90°C/194°F/Gas Mark 2  In 2 medium-sized clean bowls separate the eggs so that you are left with 4 egg whites and 4 egg yolks. Put the bowl with the egg yolks aside as you will not be using them. Put the egg whites into a large mixing bowl and whisk for at least 12 minutes to produce soft peaks.  Put the saucepan on a stove and add the sugar and water.  Slowly boil the sugar and water.  Add the whisked egg whites to the boiling sugar and water.  Mix the sugar, water and whisked egg whites together. At first the mixture will look runny but as it cools it will go back to the consistency of your meringue. Keep whisking the mixture until it has cooled down. Put the food thermometer into the mixture to check and when it reaches150 °F/60°C the mixture will be ready to use.  Grease the silicone mat or baking tray with the melted butter or oil.  Spoon the cooled mixture into your piping bag.  Pipe a 2-inch spread of meringue mixture onto the baking tray. You can pipe the mixture quite close together because it will not spread. You can make lots of small meringues or one large one. Put the tray into the oven and cook for 2 hours until the meringues have totally dried out.  Using oven gloves remove the tray from the oven and place on the cooling rack until cold.  Put the cold meringues in to an airtight container. They should keep fresh for about 2 weeks.",
  "tyn_model":[
    "sugar",
    "water",
    "oven",
    "meringue",
    "baking tray",
    "tray",
    "eggs",
    "bowl",
    "large mixing bowl",
    "whisk",
    "saucepan",
    "stove",
    "food thermometer",
    "silicone mat",
    "butter",
    "oil",
    "piping bag",
    "oven gloves",
    "airtight container"
  ],
  "tyn_section":[

  ]
}