{
  "title":"How to Make Rainbow Colored Paper",
  "url":"https://www.wikihow.com/Make-Rainbow-Colored-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papermaking"
  ],
  "methods":[
    {
      "name":"Watercolor Paint",
      "steps":[
        {
          "headline":"Gather the materials: newspaper, a piece of white paper, watercolor paints, a paintbrush and a hair dryer (optional).",
          "description":""
        },
        {
          "headline":"Set down the newspaper and supplies.",
          "description":"Start by using red about an inc thick on the side of the paper. You can really water it down to give it that faded rainbow look or keep it bright. Continue with the other colors you desire."
        },
        {
          "headline":"If you want it not to be straight lines but messy or splatters, paint as desired, but do not overlap colors until the color underneath is dry or it will mix.",
          "description":""
        },
        {
          "headline":"Use a hairdryer to blow on the paper to give it a messy look.",
          "description":"Let dry and continue method on other side if desired."
        }
      ]
    },
    {
      "name":"Melted Crayons",
      "steps":[
        {
          "headline":"Gather the materials: assorted colored crayons with no wrappers, a canvas board, hot glue, white paper, newspaper and a hairdryer.",
          "description":""
        },
        {
          "headline":"Tape the paper to the canvas board.",
          "description":"Use weak tape so that you can take the finished paper off later."
        },
        {
          "headline":"Start by hot glueing all of the crayons to the top of the board, parallel.",
          "description":"Lean the board against an outdoor wall. Put newspaper underneath the board and optionally on the wall."
        },
        {
          "headline":"Put the hairdryer on the hot setting and hold it over the crayons.",
          "description":"The crayons will start to melt and create an awesome aftermath."
        },
        {
          "headline":"Let the entire thing cool and dry.",
          "description":"Carefully take the paper off the canvas board and- voila! Rainbow color."
        }
      ]
    },
    {
      "name":"Glitter",
      "steps":[
        {
          "headline":"Gather the materials: Glue, assorted colored glitter, a piece of white paper and newspaper.",
          "description":""
        },
        {
          "headline":"Start by laying out the newspaper on a table.",
          "description":"Set down the piece of paper."
        },
        {
          "headline":"Use the glue and add where you want the glitter.",
          "description":"Start with one color at a time. For example, create a circle shape with the glue and then use red glitter on that, then let it dry, and continue with the next color. Using glitter glue is recommended. No big mess and easier to do."
        },
        {
          "headline":"If you want a thinner result for folding the paper with, use a cotton swab or toothpick to smoothen the glitter with.",
          "description":"After adding the glitter, roll the cotton swab or toothpick and flatten it out. Voila!"
        }
      ]
    }
  ],
  "text":" Watercolor Paint Gather the materials: newspaper, a piece of white paper, watercolor paints, a paintbrush and a hair dryer (optional).  Set down the newspaper and supplies. Start by using red about an inc thick on the side of the paper. You can really water it down to give it that faded rainbow look or keep it bright. Continue with the other colors you desire. If you want it not to be straight lines but messy or splatters, paint as desired, but do not overlap colors until the color underneath is dry or it will mix.  Use a hairdryer to blow on the paper to give it a messy look. Let dry and continue method on other side if desired. Melted Crayons Gather the materials: assorted colored crayons with no wrappers, a canvas board, hot glue, white paper, newspaper and a hairdryer.  Tape the paper to the canvas board. Use weak tape so that you can take the finished paper off later. Start by hot glueing all of the crayons to the top of the board, parallel. Lean the board against an outdoor wall. Put newspaper underneath the board and optionally on the wall. Put the hairdryer on the hot setting and hold it over the crayons. The crayons will start to melt and create an awesome aftermath. Let the entire thing cool and dry. Carefully take the paper off the canvas board and- voila! Rainbow color. Glitter Gather the materials: Glue, assorted colored glitter, a piece of white paper and newspaper.  Start by laying out the newspaper on a table. Set down the piece of paper. Use the glue and add where you want the glitter. Start with one color at a time. For example, create a circle shape with the glue and then use red glitter on that, then let it dry, and continue with the next color. Using glitter glue is recommended. No big mess and easier to do. If you want a thinner result for folding the paper with, use a cotton swab or toothpick to smoothen the glitter with. After adding the glitter, roll the cotton swab or toothpick and flatten it out. Voila!",
  "tyn_model":[
    "newspaper",
    "crayons",
    "white paper",
    "hairdryer",
    "paper",
    "glitter",
    "glue",
    "cotton swab",
    "watercolor paint",
    "watercolor paints",
    "paintbrush",
    "hair dryer",
    "water",
    "paint",
    "hot glue",
    "tape",
    "hot glueing",
    "colored glitter",
    "red glitter",
    "glitter glue"
  ],
  "tyn_section":[

  ]
}