{
  "title":"How to Get Togepi in Pokémon Games",
  "url":"https://www.wikihow.com/Get-Togepi-in-Pok%C3%A9mon-Games",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games"
  ],
  "steps":[
    {
      "headline":"Silver/Gold: Beat the first Gym Leader (Falkner) and go to the Pokémon Centre.",
      "description":"When you go there, talk to Prof. Elm's assistant; he will give you an egg which will hatch into Togepi!"
    },
    {
      "headline":"FireRed/LeafGreen: Go to the Water Labyrinth and make sure the Pokémon that is first in your party has high happiness.",
      "description":"At the end of the Labyrinth, an old man should be there, talk to him and he will give you the egg!"
    },
    {
      "headline":"Diamond/Pearl: After you beat the Elite 4, go to Route 230 and use your Pokeradar and go to the patches of grass that were moving.",
      "description":""
    },
    {
      "headline":"Platinum: After you beat the Eterna Gym Leader, Gardenia, and beat Team Galactic's Jupiter, go to the Bike Shop and talk to the Manager.",
      "description":"For saving him from Team Galactic, he will reward you with a Bike. When you come out of the shop, Cynthia will be there, talk to her and when she offers to give you the egg, say Yes and she will give you the egg!"
    },
    {
      "headline":"HeartGold/SoulSilver: It is the same as Silver/Gold:.",
      "description":"Just meet him in the Pokemart instead."
    },
    {
      "headline":"White: After finishing the main story line, use the Entralink to bring Miki over from Black City to your White Version.",
      "description":"Go to White Forest and keep running back and forth in the tall grass until you find a Togepi."
    },
    {
      "headline":"Black: Ask a friend that has White for a Togepi.",
      "description":"In return, make sure to give him/her an item from Black City that is rare and hard to find anywhere else."
    }
  ],
  "text":" Silver/Gold: Beat the first Gym Leader (Falkner) and go to the Pokémon Centre. When you go there, talk to Prof. Elm's assistant; he will give you an egg which will hatch into Togepi! FireRed/LeafGreen: Go to the Water Labyrinth and make sure the Pokémon that is first in your party has high happiness. At the end of the Labyrinth, an old man should be there, talk to him and he will give you the egg! Diamond/Pearl: After you beat the Elite 4, go to Route 230 and use your Pokeradar and go to the patches of grass that were moving.  Platinum: After you beat the Eterna Gym Leader, Gardenia, and beat Team Galactic's Jupiter, go to the Bike Shop and talk to the Manager. For saving him from Team Galactic, he will reward you with a Bike. When you come out of the shop, Cynthia will be there, talk to her and when she offers to give you the egg, say Yes and she will give you the egg! HeartGold/SoulSilver: It is the same as Silver/Gold:. Just meet him in the Pokemart instead. White: After finishing the main story line, use the Entralink to bring Miki over from Black City to your White Version. Go to White Forest and keep running back and forth in the tall grass until you find a Togepi. Black: Ask a friend that has White for a Togepi. In return, make sure to give him/her an item from Black City that is rare and hard to find anywhere else.",
  "tyn_model":[
    "pokeradar",
    "bike shop",
    "bike",
    "entralink"
  ],
  "tyn_section":[

  ]
}