{
  "title":"How to Make Three Ingredient Scones",
  "url":"https://www.wikihow.com/Make-Three-Ingredient-Scones",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Scones"
  ],
  "steps":[
    {
      "headline":"Place an oven rack in the top third of an oven and pre heat at 200 °C (392 °F), or 390ºF (fan forced).",
      "description":""
    },
    {
      "headline":"Sift flour into large mixing bowl to remove all lumps.",
      "description":""
    },
    {
      "headline":"Add 200mls of cream and can of lemonade to flour.",
      "description":"Cut and fold the mixture with a spatula until it forms a ball."
    },
    {
      "headline":"Tip mixture onto baking sheet or dusted oven tray.",
      "description":""
    },
    {
      "headline":"Dust your fingers with flour and knead lightly until the mixture is just smooth and slightly springy.",
      "description":"Do not overwork the mixture."
    },
    {
      "headline":"Mold the dough to roughly form a square approx 2 centimeter (0.8 in) thick.",
      "description":"Dust the spatula with flour and using its edge, ‘cut’ the dough into your desired scone shape. Gently separate each scone on the baking sheet or oven tray."
    },
    {
      "headline":"Bake scones for 15 minutes or until golden brown and cooked through.",
      "description":""
    },
    {
      "headline":"Whilst warm, split and serve with cream, jam and fresh berries.",
      "description":""
    }
  ],
  "text":" Place an oven rack in the top third of an oven and pre heat at 200 °C (392 °F), or 390ºF (fan forced).  Sift flour into large mixing bowl to remove all lumps.  Add 200mls of cream and can of lemonade to flour. Cut and fold the mixture with a spatula until it forms a ball. Tip mixture onto baking sheet or dusted oven tray.  Dust your fingers with flour and knead lightly until the mixture is just smooth and slightly springy. Do not overwork the mixture. Mold the dough to roughly form a square approx 2 centimeter (0.8 in) thick. Dust the spatula with flour and using its edge, ‘cut’ the dough into your desired scone shape. Gently separate each scone on the baking sheet or oven tray. Bake scones for 15 minutes or until golden brown and cooked through.  Whilst warm, split and serve with cream, jam and fresh berries. ",
  "tyn_model":[
    "flour",
    "cream",
    "spatula",
    "baking sheet",
    "oven tray",
    "oven rack",
    "oven",
    "large mixing bowl",
    "lemonade",
    "‘cut",
    "’ the",
    "jam",
    "berries"
  ],
  "tyn_section":[

  ]
}