{
  "title":"How to Loosen up a Stiff Knife",
  "url":"https://www.wikihow.com/Loosen-up-a-Stiff-Knife",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Cutting Tools"
  ],
  "methods":[
    {
      "name":"Rust\\/age",
      "steps":[
        {
          "headline":"Check to see what color the blade or hinges are.",
          "description":"Does the blade or hinge look slightly orange? Or even slightly powdery or white? This could be caused by the metal in the knife oxidizing to the point of the blades adhering to the casing or each other."
        },
        {
          "headline":"If the knife has only metal parts, simply give it a good soaking in a mineral oil.",
          "description":"Then, buff it clean in a day or two. Once you've done this, keep the knife oiled from then on."
        },
        {
          "headline":"If the knife has non-metal parts, your job will be trickier.",
          "description":"In this case, the metal parts need a good soak without getting the rust removal fluid on the non-metal parts. You can do this by masking the area off with tape, by using tiny brushes or \"Q-tips\", etc."
        },
        {
          "headline":"Repeat several times over the course of a week, buffing the rust and working the oil into the hinge(s).",
          "description":"Use a heavy towel or wear gloves to protect your fingers from the blade(s) during this process."
        }
      ]
    },
    {
      "name":"Goop",
      "steps":[
        {
          "headline":"Observe whether the knife has some substance on the blades.",
          "description":"Is it sticky? Did the knife fall into something that is just not wiping off easily?"
        },
        {
          "headline":"Clean the \"goop\" off.",
          "description":"How successful this will be depends on the type of \"goop\" it is. If you have no idea, it is best to start with the mildest cleaner available and progress to the strongest. Try cleaning agents in this order (rinsing and drying thoroughly in between):  Water, ammonia, light mineral oil, \"tape remover\" or \"goop remover\" products from the store."
        },
        {
          "headline":"Thoroughly oil the knife when you're finished cleaning.",
          "description":"This will prevent future oxidation."
        }
      ]
    },
    {
      "name":"Friction",
      "steps":[
        {
          "headline":"Clean the knife thoroughly using the methods outlined above.",
          "description":"Sometimes a knife \"sticks\" because its blades were too snugly squeezed at the factory when the hinge(s) were pressed or riveted in. Loosen it as follows."
        },
        {
          "headline":"Oil the knife hinges thoroughly.",
          "description":""
        },
        {
          "headline":"Protect your hands with either heavy gloves or a heavy towel.",
          "description":""
        },
        {
          "headline":"Place a drop or two of mineral oil in the hinge area.",
          "description":""
        },
        {
          "headline":"Open and shut the blade repeatedly to create enough wear in the hinge to loosen it.",
          "description":""
        }
      ]
    },
    {
      "name":"Loosening the hinges",
      "steps":[
        {
          "headline":"Inspect the knife for a screw at the base of the blade.",
          "description":"It may be under the clip. Depending on the knife, you may need to remove the clip to access the screw."
        },
        {
          "headline":"Use a small screwdriver to loosen the screw holding the blade in place.",
          "description":"Be sure to not loosen the screw too much as the blade could potentially fall out."
        },
        {
          "headline":"Replace the clip if needed.",
          "description":"Check that the blade moves smoothly."
        }
      ]
    }
  ],
  "text":" Rust\\/age Check to see what color the blade or hinges are. Does the blade or hinge look slightly orange? Or even slightly powdery or white? This could be caused by the metal in the knife oxidizing to the point of the blades adhering to the casing or each other. If the knife has only metal parts, simply give it a good soaking in a mineral oil. Then, buff it clean in a day or two. Once you've done this, keep the knife oiled from then on. If the knife has non-metal parts, your job will be trickier. In this case, the metal parts need a good soak without getting the rust removal fluid on the non-metal parts. You can do this by masking the area off with tape, by using tiny brushes or \"Q-tips\", etc. Repeat several times over the course of a week, buffing the rust and working the oil into the hinge(s). Use a heavy towel or wear gloves to protect your fingers from the blade(s) during this process. Goop Observe whether the knife has some substance on the blades. Is it sticky? Did the knife fall into something that is just not wiping off easily? Clean the \"goop\" off. How successful this will be depends on the type of \"goop\" it is. If you have no idea, it is best to start with the mildest cleaner available and progress to the strongest. Try cleaning agents in this order (rinsing and drying thoroughly in between):  Water, ammonia, light mineral oil, \"tape remover\" or \"goop remover\" products from the store. Thoroughly oil the knife when you're finished cleaning. This will prevent future oxidation. Friction Clean the knife thoroughly using the methods outlined above. Sometimes a knife \"sticks\" because its blades were too snugly squeezed at the factory when the hinge(s) were pressed or riveted in. Loosen it as follows. Oil the knife hinges thoroughly.  Protect your hands with either heavy gloves or a heavy towel.  Place a drop or two of mineral oil in the hinge area.  Open and shut the blade repeatedly to create enough wear in the hinge to loosen it.  Loosening the hinges Inspect the knife for a screw at the base of the blade. It may be under the clip. Depending on the knife, you may need to remove the clip to access the screw. Use a small screwdriver to loosen the screw holding the blade in place. Be sure to not loosen the screw too much as the blade could potentially fall out. Replace the clip if needed. Check that the blade moves smoothly.",
  "tyn_model":[
    "knife",
    "mineral oil",
    "oil",
    "tape",
    "cleaner",
    "cleaning agents",
    "water",
    "ammonia",
    "tape remover",
    "goop remover",
    "screwdriver"
  ],
  "tyn_section":[

  ]
}