{
  "title":"How to Make Garlic and Herb Foccacia Bread",
  "url":"https://www.wikihow.com/Make-Garlic-and-Herb-Foccacia-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Flat Breads"
  ],
  "steps":[
    {
      "headline":"Add all dough ingredients to the bread machine.",
      "description":""
    },
    {
      "headline":"Select dough cycle.",
      "description":""
    },
    {
      "headline":"Combine all topping ingredients except the olive oil",
      "description":""
    },
    {
      "headline":"Preheat oven to 400 °F (204 °C).",
      "description":""
    },
    {
      "headline":"Spray a pizza pan with nonstick cooking spray or grease with cooking brush.",
      "description":""
    },
    {
      "headline":"Remove dough from bread pan once the dough cycle is complete.",
      "description":""
    },
    {
      "headline":"Pat dough into an even layer in the pizza pan.",
      "description":""
    },
    {
      "headline":"Poke indentations into dough using your thumb.",
      "description":""
    },
    {
      "headline":"Drizzle 2 to 3 tablespoons (29.6 to 44.4 ml) olive oil over dough indentations.",
      "description":""
    },
    {
      "headline":"Sprinkle with combined topping ingredients.",
      "description":""
    },
    {
      "headline":"Bake until the focaccia is golden brown, about 18 to 20 minutes.",
      "description":""
    },
    {
      "headline":"Serve warm.",
      "description":""
    }
  ],
  "text":" Add all dough ingredients to the bread machine.  Select dough cycle.  Combine all topping ingredients except the olive oil  Preheat oven to 400 °F (204 °C).  Spray a pizza pan with nonstick cooking spray or grease with cooking brush.  Remove dough from bread pan once the dough cycle is complete.  Pat dough into an even layer in the pizza pan.  Poke indentations into dough using your thumb.  Drizzle 2 to 3 tablespoons (29.6 to 44.4 ml) olive oil over dough indentations.  Sprinkle with combined topping ingredients.  Bake until the focaccia is golden brown, about 18 to 20 minutes.  Serve warm. ",
  "tyn_model":[
    "olive oil",
    "pizza pan",
    "bread machine",
    "oven",
    "nonstick cooking spray",
    "cooking brush",
    "bread pan"
  ],
  "tyn_section":[

  ]
}