{
  "title":"How to Improve the Energy Savings of Your Fridge or Freezer",
  "url":"https://www.wikihow.com/Improve-the-Energy-Savings-of-Your-Fridge-or-Freezer",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "steps":[
    {
      "headline":"Avoid placing a fridge or freezer near heat sources.",
      "description":"The most common source of heat in a kitchen is the oven and the dishwasher, but some kitchens also have a water heater in place as well. Keep the fridge or freezer well away from these heat sources. If you situate a fridge next to an oven, for example, the fridge will over-compensate for the heating up. For the same reason, it is also important to avoid placing a fridge or freezer in direct, constant sunlight."
    },
    {
      "headline":"Keep the door seals clean.",
      "description":"If the doors don't shut tightly, energy is wasted. Clean them regularly and replace once worn."
    },
    {
      "headline":"Avoid overestimating your size needs.",
      "description":"Only buy a fridge or freezer at the size for normal usage. The larger the fridge, the greater the energy usage. Your power bill will reflect this choice too!"
    },
    {
      "headline":"Keep the temperature of your fridge at 41ºF/5ºC.",
      "description":"These are suitable temperatures that will save on energy usage. Every degree colder adds more greenhouse gas to the atmosphere."
    },
    {
      "headline":"Avoid putting hot food into the fridge or freezer.",
      "description":"The appliance will try to compensate by cooling down the item. Equally, keep cold items cold by returning cold items to the fridge quickly after use."
    },
    {
      "headline":"Check the ventilation at the rear of the appliance.",
      "description":"Good circulation of air around the coils helps the fridge or freezer work less hard, thereby using up less energy and your energy bills will be reduced. Keep the coils clean with a regular vacuum or dusting; dust decreases efficiency."
    },
    {
      "headline":"Keep the shelves stocked.",
      "description":"Use water bottles or ice packs if need be. The cold mass will help the unit recover quickly after door openings and reduce loss due to air changeover."
    }
  ],
  "text":" Avoid placing a fridge or freezer near heat sources. The most common source of heat in a kitchen is the oven and the dishwasher, but some kitchens also have a water heater in place as well. Keep the fridge or freezer well away from these heat sources. If you situate a fridge next to an oven, for example, the fridge will over-compensate for the heating up. For the same reason, it is also important to avoid placing a fridge or freezer in direct, constant sunlight. Keep the door seals clean. If the doors don't shut tightly, energy is wasted. Clean them regularly and replace once worn. Avoid overestimating your size needs. Only buy a fridge or freezer at the size for normal usage. The larger the fridge, the greater the energy usage. Your power bill will reflect this choice too! Keep the temperature of your fridge at 41ºF/5ºC. These are suitable temperatures that will save on energy usage. Every degree colder adds more greenhouse gas to the atmosphere. Avoid putting hot food into the fridge or freezer. The appliance will try to compensate by cooling down the item. Equally, keep cold items cold by returning cold items to the fridge quickly after use. Check the ventilation at the rear of the appliance. Good circulation of air around the coils helps the fridge or freezer work less hard, thereby using up less energy and your energy bills will be reduced. Keep the coils clean with a regular vacuum or dusting; dust decreases efficiency. Keep the shelves stocked. Use water bottles or ice packs if need be. The cold mass will help the unit recover quickly after door openings and reduce loss due to air changeover.",
  "tyn_model":[
    "fridge",
    "freezer",
    "oven",
    "vacuum",
    "water bottles",
    "ice packs"
  ],
  "tyn_section":[

  ]
}