{
  "title":"How to Get the Black Eye Skull in Halo 3",
  "url":"https://www.wikihow.com/Get-the-Black-Eye-Skull-in-Halo-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Halo 3"
  ],
  "steps":[
    {
      "headline":"Begin the Crow's Nest campaign level on Halo 3.",
      "description":"To claim the skull, you must have begun the campaign level from the beginning and have attempted it on a difficulty of at least Normal. The Crow's Nest campaign level can be accessed from the Campaign option on the main menu."
    },
    {
      "headline":"Play your way through the beginning of the level until you reach the level chapter 'Know Your Role' in the command centre for the base.",
      "description":"This is towards the beginning of the level and is directly after the Covenant forces breach the perimeter to the base. Commander Miranda Keyes will be talking to a Marine technician and the room is lined with fairly large monitors."
    },
    {
      "headline":"Look directly up at the ceiling.",
      "description":"You will see a large portion of piping running through the top of the room - the Black Eye Skull is resting at the very end of this piping."
    },
    {
      "headline":"Walk to the far end of the room, away from the monitors, until you have gone up two levels of stairs.",
      "description":"There will be two barrels and a marine or two beneath the piping. If you go through the door leading to the barracks, you have gone too far."
    },
    {
      "headline":"Walk directly below the lighting on the top level of the room and jump onto the green supports below the piping.",
      "description":"The supports are right behind the two barrels, right below the piping, and run parallel to the piping for a while."
    },
    {
      "headline":"Move along the supports until you can jump up onto the large piping on which the skull is located.",
      "description":"The Black Eye Skull is located at the far end of the piping, directly above the command centre's monitors."
    },
    {
      "headline":"Claim the Black Eye Skull by pressing the Right Bunker button on your Xbox 360 controller.",
      "description":"Congratulations, you've found it! Check your Xbox 360 gamerscore and achievement statistics to see the Black Eye achievement has been unlocked for 10 gamerscore. It is represented by a skull with a black eye and a smaller skull with a black eye printed on it. You will also be able to use the Black Eye skull in your campaign games by pressing X in the campaign menu and selecting it. It gives you a x1.5 campaign score multiplier, but you can only get shield regeneration by performing melee attacks on enemies."
    }
  ],
  "text":" Begin the Crow's Nest campaign level on Halo 3. To claim the skull, you must have begun the campaign level from the beginning and have attempted it on a difficulty of at least Normal. The Crow's Nest campaign level can be accessed from the Campaign option on the main menu. Play your way through the beginning of the level until you reach the level chapter 'Know Your Role' in the command centre for the base. This is towards the beginning of the level and is directly after the Covenant forces breach the perimeter to the base. Commander Miranda Keyes will be talking to a Marine technician and the room is lined with fairly large monitors. Look directly up at the ceiling. You will see a large portion of piping running through the top of the room - the Black Eye Skull is resting at the very end of this piping. Walk to the far end of the room, away from the monitors, until you have gone up two levels of stairs. There will be two barrels and a marine or two beneath the piping. If you go through the door leading to the barracks, you have gone too far. Walk directly below the lighting on the top level of the room and jump onto the green supports below the piping. The supports are right behind the two barrels, right below the piping, and run parallel to the piping for a while. Move along the supports until you can jump up onto the large piping on which the skull is located. The Black Eye Skull is located at the far end of the piping, directly above the command centre's monitors. Claim the Black Eye Skull by pressing the Right Bunker button on your Xbox 360 controller. Congratulations, you've found it! Check your Xbox 360 gamerscore and achievement statistics to see the Black Eye achievement has been unlocked for 10 gamerscore. It is represented by a skull with a black eye and a smaller skull with a black eye printed on it. You will also be able to use the Black Eye skull in your campaign games by pressing X in the campaign menu and selecting it. It gives you a x1.5 campaign score multiplier, but you can only get shield regeneration by performing melee attacks on enemies.",
  "tyn_model":[
    "monitors",
    "piping",
    "skull",
    "crow's nest",
    "barrels",
    "xbox 360 controller",
    "xbox 360"
  ],
  "tyn_section":[

  ]
}