{
  "title":"How to Make Balsamic Strawberries",
  "url":"https://www.wikihow.com/Make-Balsamic-Strawberries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "methods":[
    {
      "name":"Balsamic strawberries",
      "steps":[
        {
          "headline":"Hull the strawberries.",
          "description":"Wash the strawberries, then remove the greenery."
        },
        {
          "headline":"Cut the strawberries in half if they are large.",
          "description":"Arrange the strawberries in a bowl (glass or china)."
        },
        {
          "headline":"Sprinkle the sugar over the top of the strawberries.",
          "description":"Toss to coat the strawberries well."
        },
        {
          "headline":"Cover the bowl and place in the refrigerator to chill.",
          "description":"Leave for half an hour, occasionally stirring. When a light syrup forms, the strawberries are ready."
        },
        {
          "headline":"Add the balsamic vinegar.",
          "description":"Stir through gently."
        },
        {
          "headline":"Serve immediately.",
          "description":""
        }
      ]
    },
    {
      "name":"Balsamic strawberries with pepper",
      "steps":[
        {
          "headline":"Hull the strawberries.",
          "description":"Wash the strawberries, then remove the greenery."
        },
        {
          "headline":"Cut the strawberries into halves.",
          "description":"Sprinkle the sugar over the strawberry halves. Stir to combine, stirring gently."
        },
        {
          "headline":"Cover the strawberries with cling film.",
          "description":"Set aside to stand at room temperature for one hour minimum but less than four hours total."
        },
        {
          "headline":"Prepare for serving.",
          "description":"Sprinkle with the freshly ground pepper."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Balsamic strawberries Hull the strawberries. Wash the strawberries, then remove the greenery. Cut the strawberries in half if they are large. Arrange the strawberries in a bowl (glass or china). Sprinkle the sugar over the top of the strawberries. Toss to coat the strawberries well. Cover the bowl and place in the refrigerator to chill. Leave for half an hour, occasionally stirring. When a light syrup forms, the strawberries are ready. Add the balsamic vinegar. Stir through gently. Serve immediately.  Balsamic strawberries with pepper Hull the strawberries. Wash the strawberries, then remove the greenery. Cut the strawberries into halves. Sprinkle the sugar over the strawberry halves. Stir to combine, stirring gently. Cover the strawberries with cling film. Set aside to stand at room temperature for one hour minimum but less than four hours total. Prepare for serving. Sprinkle with the freshly ground pepper. Finished. ",
  "tyn_model":[
    "strawberries",
    "balsamic strawberries",
    "bowl",
    "sugar",
    "pepper",
    "refrigerator",
    "balsamic vinegar",
    "cling film"
  ],
  "tyn_section":[

  ]
}