{
  "title":"How to Make Baked Tomatoes",
  "url":"https://www.wikihow.com/Make-Baked-Tomatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Tomato Dishes"
  ],
  "methods":[
    {
      "name":"Baked Tomatoes",
      "steps":[
        {
          "headline":"Preheat oven to 350 °F (177 °C).",
          "description":""
        },
        {
          "headline":"Spray a baking dish with nonstick cooking spray.",
          "description":""
        },
        {
          "headline":"Core tomatoes but leave the skins on.",
          "description":""
        },
        {
          "headline":"Add 1 teaspoon EACH vinegar and brown sugar to each tomato.",
          "description":""
        },
        {
          "headline":"Insert a clove inside the sugar mixture.",
          "description":""
        },
        {
          "headline":"Bake tomatoes until they are lightly browned.",
          "description":""
        },
        {
          "headline":"Serves 6.",
          "description":""
        }
      ]
    },
    {
      "name":"Baked Tomatoes with Parmesan Cheese Topping",
      "steps":[
        {
          "headline":"Preheat oven to 450 °F (232 °C).",
          "description":""
        },
        {
          "headline":"Spray a 11 x 7-inch baking pan with nonstick cooking spray.",
          "description":""
        },
        {
          "headline":"Add bread crumbs, Parmesan cheese, olive oil and garlic to a small mixing bowl.",
          "description":"Stir until well mixed."
        },
        {
          "headline":"Core tomatoes.",
          "description":""
        },
        {
          "headline":"Add equal amounts of stuffing to each cored tomato.",
          "description":"Just sprinkle the crumb mixture across the tomato tops."
        },
        {
          "headline":"Drizzle with a bit more olive oil.",
          "description":""
        },
        {
          "headline":"Bake 8 to 10 minutes or until the topping is just toasted.",
          "description":""
        }
      ]
    },
    {
      "name":"Scalloped Tomatoes",
      "steps":[
        {
          "headline":"Toast the sliced bread.",
          "description":"Cut bread into small cubes."
        },
        {
          "headline":"Preheat oven to 350 °F (177 °C).",
          "description":""
        },
        {
          "headline":"Spray a 9 x 13-inch baking dish with nonstick cooking spray.",
          "description":""
        },
        {
          "headline":"Add all the ingredients EXCEPT the margarine to the baking dish.",
          "description":""
        },
        {
          "headline":"Stir to combine the ingredients until well mixed.",
          "description":""
        },
        {
          "headline":"Dot tomato mixture with butter.",
          "description":""
        },
        {
          "headline":"Cover tomato mixture with foil and bake 30 minutes.",
          "description":""
        },
        {
          "headline":"Remove foil about 5 minutes before the baking is completed, if desired, to crisp the tomato mixture.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Baked Tomatoes Preheat oven to 350 °F (177 °C).  Spray a baking dish with nonstick cooking spray.  Core tomatoes but leave the skins on.  Add 1 teaspoon EACH vinegar and brown sugar to each tomato.  Insert a clove inside the sugar mixture.  Bake tomatoes until they are lightly browned.  Serves 6.  Baked Tomatoes with Parmesan Cheese Topping Preheat oven to 450 °F (232 °C).  Spray a 11 x 7-inch baking pan with nonstick cooking spray.  Add bread crumbs, Parmesan cheese, olive oil and garlic to a small mixing bowl. Stir until well mixed. Core tomatoes.  Add equal amounts of stuffing to each cored tomato. Just sprinkle the crumb mixture across the tomato tops. Drizzle with a bit more olive oil.  Bake 8 to 10 minutes or until the topping is just toasted.  Scalloped Tomatoes Toast the sliced bread. Cut bread into small cubes. Preheat oven to 350 °F (177 °C).  Spray a 9 x 13-inch baking dish with nonstick cooking spray.  Add all the ingredients EXCEPT the margarine to the baking dish.  Stir to combine the ingredients until well mixed.  Dot tomato mixture with butter.  Cover tomato mixture with foil and bake 30 minutes.  Remove foil about 5 minutes before the baking is completed, if desired, to crisp the tomato mixture.  Finished. ",
  "tyn_model":[
    "oven",
    "baking dish",
    "nonstick cooking spray",
    "tomatoes",
    "parmesan cheese",
    "olive oil",
    "tomato",
    "foil",
    "each vinegar",
    "brown sugar",
    "sugar",
    "baking pan",
    "bread crumbs",
    "garlic",
    "small mixing bowl",
    "margarine",
    "butter"
  ],
  "tyn_section":[

  ]
}