{
  "title":"How to Keep Brown Sugar Soft",
  "url":"https://www.wikihow.com/Keep-Brown-Sugar-Soft",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Storing Brown Sugar Properly",
      "steps":[
        {
          "headline":"Store brown sugar in an airtight container.",
          "description":"Brown sugar tends to get hard due to air exposure. If you want to keep brown sugar soft, you're best option is to store your brown sugar in a sealable, airtight container as soon as you open it up. Limit air exposure as much as possible when storing brown sugar. Choose a smaller container and pack the brown sugar to the top. Make sure to seal tightly, double checking for cracks and openings. You may not find a small enough container. In this case, use a small Ziplock bag. Squeeze out all the excess air before sealing the bag."
        },
        {
          "headline":"Use a terra cotta sugar saver.",
          "description":"Kitchen shops and some grocery stores sell what are called terra cotta sugar savers. These are small, circular devices made from terra cotta clay. They are inexpensive, about $3 each, and can be easily used to soften brown sugar. They are designed to release moisture into your sugar, keeping it soft in storage. After purchasing the terra cotta sugar saver, soak it in water for 15 minutes. Then, dry off the disk. Store the sugar saver with the brown sugar. Ideally, you should be using the terra cotta sugar saver alongside a sealable airtight container or plastic bag. If you add a sugar saver to a bag of brown sugar that's already hardened, it may take up to 8 hours for the sugar to soften."
        },
        {
          "headline":"Add marshmallows to your bag.",
          "description":"If you don't have a sugar saver, marshmallows work for some when it comes to keeping sugar soft. Throw a few marshmallows into your sugar container and see if it helps."
        },
        {
          "headline":"Store with apples and bread.",
          "description":"Apples and bread are both fairly moist by nature. Adding a few slices of apples or a piece of bread to a bag of brown sugar can help keep it soft. The idea is the sugar will draw moisture from the bread or fruit. If you're adding apples or bread to hardened brown sugar, it may take a day before it begins to soften."
        }
      ]
    },
    {
      "name":"Softening Hard Sugar",
      "steps":[
        {
          "headline":"Add water for a few days.",
          "description":"Remember, brown sugar hardens due to a lack of moisture. The simplest way to get it to soften is by adding water. Sprinkle a few drops of water over hardened brown sugar. Then, seal the sugar into a plastic bag. Set aside for a few days and it should soften considerably as the water makes its way through the sugar."
        },
        {
          "headline":"Use a moistened cloth.",
          "description":"You can also use a cloth to add moisture to brown sugar. Place your hardened brown sugar in an open container. Then, get a cloth or paper towel wet. Wring out until moist and set it over the container. Leave the sugar like this overnight. If this method is successful, your sugar should be soft by morning."
        },
        {
          "headline":"Soften overnight with tinfoil and dampened paper towel.",
          "description":"You can also use tinfoil and paper towel to soften brown sugar. To start, put the hardened sugar in a sealable container. Place a piece of tinfoil over the top of the hardened brown sugar. Then, get some paper towels damp and place them over the tinfoil. Seal the container. Let it sit long enough that the paper towel dries. This can happen overnight but may also take a few days. Once the towel is dry, the sugar should be softened."
        }
      ]
    },
    {
      "name":"Using Quicker Methods",
      "steps":[
        {
          "headline":"Use your food processor.",
          "description":"If you need to use the sugar right now, you can simply put it through a blender or food processor. This can break up the hardened chunks and produce grainy, usable brown sugar. Simply chop or pulse the sugar until it softens."
        },
        {
          "headline":"Microwave the sugar.",
          "description":"If you don't have a food processor, you can use your microwave. Take the hardened sugar and set it in a microwave safe plastic bag. Take one square of paper towel and get it wet. Wring it out so it's damp and not dripping. Place the paper towel with the sugar and seal the bag. Microwave for 20 seconds and then check. If the sugar is not soft, keep microwaving it in 20 minute increments until it softens to your liking."
        },
        {
          "headline":"Soften over the oven.",
          "description":"If you don't have a microwave or food processor, you can also use your oven. Heat the oven to 250 degrees. Then, set the brown sugar in a baking pan. Bake for 5 minutes and then check. If the sugar's still not soft, bake it for another few minutes. Keep going until the sugar gets as soft as you want it."
        }
      ]
    }
  ],
  "text":" Storing Brown Sugar Properly Store brown sugar in an airtight container. Brown sugar tends to get hard due to air exposure. If you want to keep brown sugar soft, you're best option is to store your brown sugar in a sealable, airtight container as soon as you open it up. Limit air exposure as much as possible when storing brown sugar. Choose a smaller container and pack the brown sugar to the top. Make sure to seal tightly, double checking for cracks and openings. You may not find a small enough container. In this case, use a small Ziplock bag. Squeeze out all the excess air before sealing the bag. Use a terra cotta sugar saver. Kitchen shops and some grocery stores sell what are called terra cotta sugar savers. These are small, circular devices made from terra cotta clay. They are inexpensive, about $3 each, and can be easily used to soften brown sugar. They are designed to release moisture into your sugar, keeping it soft in storage. After purchasing the terra cotta sugar saver, soak it in water for 15 minutes. Then, dry off the disk. Store the sugar saver with the brown sugar. Ideally, you should be using the terra cotta sugar saver alongside a sealable airtight container or plastic bag. If you add a sugar saver to a bag of brown sugar that's already hardened, it may take up to 8 hours for the sugar to soften. Add marshmallows to your bag. If you don't have a sugar saver, marshmallows work for some when it comes to keeping sugar soft. Throw a few marshmallows into your sugar container and see if it helps. Store with apples and bread. Apples and bread are both fairly moist by nature. Adding a few slices of apples or a piece of bread to a bag of brown sugar can help keep it soft. The idea is the sugar will draw moisture from the bread or fruit. If you're adding apples or bread to hardened brown sugar, it may take a day before it begins to soften. Softening Hard Sugar Add water for a few days. Remember, brown sugar hardens due to a lack of moisture. The simplest way to get it to soften is by adding water. Sprinkle a few drops of water over hardened brown sugar. Then, seal the sugar into a plastic bag. Set aside for a few days and it should soften considerably as the water makes its way through the sugar. Use a moistened cloth. You can also use a cloth to add moisture to brown sugar. Place your hardened brown sugar in an open container. Then, get a cloth or paper towel wet. Wring out until moist and set it over the container. Leave the sugar like this overnight. If this method is successful, your sugar should be soft by morning. Soften overnight with tinfoil and dampened paper towel. You can also use tinfoil and paper towel to soften brown sugar. To start, put the hardened sugar in a sealable container. Place a piece of tinfoil over the top of the hardened brown sugar. Then, get some paper towels damp and place them over the tinfoil. Seal the container. Let it sit long enough that the paper towel dries. This can happen overnight but may also take a few days. Once the towel is dry, the sugar should be softened. Using Quicker Methods Use your food processor. If you need to use the sugar right now, you can simply put it through a blender or food processor. This can break up the hardened chunks and produce grainy, usable brown sugar. Simply chop or pulse the sugar until it softens. Microwave the sugar. If you don't have a food processor, you can use your microwave. Take the hardened sugar and set it in a microwave safe plastic bag. Take one square of paper towel and get it wet. Wring it out so it's damp and not dripping. Place the paper towel with the sugar and seal the bag. Microwave for 20 seconds and then check. If the sugar is not soft, keep microwaving it in 20 minute increments until it softens to your liking. Soften over the oven. If you don't have a microwave or food processor, you can also use your oven. Heat the oven to 250 degrees. Then, set the brown sugar in a baking pan. Bake for 5 minutes and then check. If the sugar's still not soft, bake it for another few minutes. Keep going until the sugar gets as soft as you want it.",
  "tyn_model":[
    "sugar",
    "brown sugar",
    "paper towel",
    "water",
    "sugar saver",
    "apples",
    "tinfoil",
    "food processor",
    "oven",
    "airtight container",
    "terra cotta sugar saver",
    "marshmallows",
    "cloth",
    "microwave",
    "container",
    "ziplock bag",
    "terra cotta sugar savers",
    "terra cotta clay",
    "sugar container",
    "paper towels",
    "blender",
    "microwave safe plastic bag",
    "baking pan"
  ],
  "tyn_section":[

  ]
}