{
  "title":"How to Lessen the Effects of Alcohol",
  "url":"https://www.wikihow.com/Lessen-the-Effects-of-Alcohol",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Alcohol Consumption"
  ],
  "methods":[
    {
      "name":"Drinking Cautiously",
      "steps":[
        {
          "headline":"Eat first.",
          "description":"When you consume alcohol it sits in your stomach while it waits to be processed. If you don't have food in there, the alcohol will process faster and at one time. If you have food in your belly, the alcohol will enter your system more slowly and at a varied pace thus lessening the effects of alcohol immediately. This is especially important if you know you will be drinking for a sustained period, like a bar crawl."
        },
        {
          "headline":"Drink slowly.",
          "description":"For the same reason that you want food in your stomach, drinking slowly will allow your body to process the alcohol over a period of time. Whereas, if you inundate your body with alcohol, it will be more difficult to process."
        },
        {
          "headline":"Choose your beverages carefully.",
          "description":"Choose alcohols with fewer congeners (substances that are also produced during the fermentation process), which are less likely to cause a hangover. Light-colored beers and white wine have fewer congeners than darker beers and harder liquors. Stay away from brandy, whisky, and red wine. Cheap boozes tend to give you a worse hangover. Your body expends more energy to process impurities left in the alcohol. Clearer alcohols like vodka, gin, and white rum are good options."
        }
      ]
    },
    {
      "name":"Hydrating Your Body",
      "steps":[
        {
          "headline":"Drink plenty of water.",
          "description":"Drink water throughout the day before you start drinking alcohol and drink water in between alcoholic beverages. As one of the key causes of a hangover is dehydration, the more you do to combat it beforehand the better. If you have a hangover, be sure to drink plenty of water as well. Drink a pint of water before you go to sleep at night. Since your body continues to process water while you sleep — albeit less water — you will still wake up more dehydrated than when you go to bed. Since hangovers operate on dehydration, you can help lessen the effects of alcohol by drinking more water. Try to leave a glass of water by your bed so you can drink it when you wake up."
        },
        {
          "headline":"Drink sports drinks.",
          "description":"In addition to water, these isotonic sports drinks can quickly replenish the fluids in your body, while adding carbohydrates needed for energy and electrolytes to your system. Sports drinks can be good to ease an upset stomach, too. Pick a flavor that tastes good and won't make you further nauseous."
        },
        {
          "headline":"Drink some orange juice.",
          "description":"Vitamin C, specifically, helps replenish energy, which is vital when the lethargic power of a hangover kicks in. The fructose found in many types of juices will help replenish sugars in your body depleted in order to process the alcohol you've consumed. Tomato juice and coconut water are also great options."
        },
        {
          "headline":"Stay away from caffeinated beverages.",
          "description":"Since alcohol is a depressant and makes people sleepy, it seems like the common cure-all would be coffee. Yet, coffee will further dehydrate you. If you have an upset stomach too, coffee may further irritate it. Stick to water. Rest is better than coffee."
        },
        {
          "headline":"Drink Sprite.",
          "description":"Chinese researchers tested the effects of 57 drinks and found that Sprite was the most effective at combatting hangover effects. The enzyme alcohol dehydrogenase is released by your liver when you consume alcohol. The longer this enzyme is in your system directly relates to the length of your hangover. Get rid of it quickly if you want a shorter hangover. These researchers found that Sprite flushed the human system of alcohol dehydrogenase faster than any other beverage. Herbal tea actually prolonged the presence of this enzyme."
        },
        {
          "headline":"Don't drink more alcohol.",
          "description":"Stay away from \"the hair of the dog that bit you.\" While many people will tell you to just drink a little more of what you drank the night before to get over a hangover, don't listen to them. All you'll be doing is prolonging the effects of the alcohol. It may numb your symptoms in the short-term, it'll probably worsen the hangover in the long term."
        }
      ]
    },
    {
      "name":"Eating to Combat the Effects of Alcohol",
      "steps":[
        {
          "headline":"Eat some eggs.",
          "description":"Eggs are an essential foodstuff for any hangover cure repertoire. They contain an amino acid called cysteine, which soaks up the toxins introduced to your body by alcohol. Eat a few egg whites and soon enough you'll begin feeling back to normal. Fry or scramble them; it doesn't matter how you prepare your eggs, as long as they are cooked. An urban myth says to drink a couple raw eggs after a night out on the town. The slimy factor mixed with the ever-present danger of salmonella make this myth simply that — a myth."
        },
        {
          "headline":"Eat some crackers or toast.",
          "description":"Your first inclination may be to eat a heavy, greasy cheeseburger. Don't do it. Eat something light like crackers or toast. Both contain sodium— something your body needs to work properly and something that alcohol consumption tends to reduce."
        },
        {
          "headline":"Eat foods rich in potassium, like bananas.",
          "description":"Since you urinate more when you drink heavily, your body is losing its precious potassium. Lower potassium levels lead to lethargy, nausea, and weakness. Bananas and kiwis are great sources of potassium. Baked potatoes, leafy greens, apricots, and mushrooms are also loaded with potassium. Consider chasing that last drink with a banana to lessen the effects of alcohol."
        },
        {
          "headline":"Eat soups rich with nutrients.",
          "description":"Bouillon, chicken noodle, and miso soups are great soup options for a number of reasons. They all contain many nutrients your body needs to overcome a hangover and the nauseating effects of alcohol. Sodium, cysteine, and the rehydrating power of water and broth will help you immensely."
        }
      ]
    },
    {
      "name":"Relaxing to Lessen Alcoholic Effects",
      "steps":[
        {
          "headline":"Sleep it off.",
          "description":"Hangovers are best eliminated with time. Since alcohol makes you feel sleepy, you might reach for the caffeinated beverage. This won't work for you. Your body needs time to recuperate. Take a nap. This is the best way to get rid of that headache and to get your better judgement back."
        },
        {
          "headline":"Take a shower.",
          "description":"A warm shower will raise your core temperature. A warmer temperature will prepare your body for sleep, which will in turn allow you to bypass the horrendous headache of the dreaded hangover. If you need to stay alert while drunk, a cold shower can help wake you up and keep your at the ready."
        },
        {
          "headline":"Go for a short walk.",
          "description":"A great way to get your alcohol's effects under control is to go for a walk. Walking speeds up your metabolism, processing what's in your stomach faster. So going for a short stroll may help reduce the duration of your alcohol's effects. Obviously, alcohol impairs your ability to walk, so make sure you go for your jaunt in a safe space — away from cars and stairs (the two greatest dangers to the drunk)."
        }
      ]
    },
    {
      "name":"Medicating Appropriately",
      "steps":[
        {
          "headline":"Take Ibuprofen, naproxen, and other prescription non-steroidal anti-inflammatory medications (NSAIDs).",
          "description":"These medications can help numb that pounding headache. Follow the instructions on the bottle. Do not take more unless prescribed by a doctor. Do not take acetaminophen (Tylenol). Acetaminophen will tax your liver further, leading to mild and even severe swelling."
        },
        {
          "headline":"Take a B6 supplement or shot.",
          "description":"B6 will help revitalize your body. B6 increases cognitive function as well as reducing nausea and vomiting. You can purchase B6 from most pharmacies or vitamin supplement stores."
        },
        {
          "headline":"Take an antacid.",
          "description":"Stomach pains and nausea are common effects of alcohol. Antacid pills will help regulate the acidity levels in your stomach. If you feel sick, pop an antacid. Sodium alginate and potassium bicarbonate based antacids, available over the counter, can help a lot. Be sure to follow the instructions on the bottle. Do not take more than is recommended by your doctor."
        }
      ]
    }
  ],
  "text":" Drinking Cautiously Eat first. When you consume alcohol it sits in your stomach while it waits to be processed. If you don't have food in there, the alcohol will process faster and at one time. If you have food in your belly, the alcohol will enter your system more slowly and at a varied pace thus lessening the effects of alcohol immediately. This is especially important if you know you will be drinking for a sustained period, like a bar crawl. Drink slowly. For the same reason that you want food in your stomach, drinking slowly will allow your body to process the alcohol over a period of time. Whereas, if you inundate your body with alcohol, it will be more difficult to process. Choose your beverages carefully. Choose alcohols with fewer congeners (substances that are also produced during the fermentation process), which are less likely to cause a hangover. Light-colored beers and white wine have fewer congeners than darker beers and harder liquors. Stay away from brandy, whisky, and red wine. Cheap boozes tend to give you a worse hangover. Your body expends more energy to process impurities left in the alcohol. Clearer alcohols like vodka, gin, and white rum are good options. Hydrating Your Body Drink plenty of water. Drink water throughout the day before you start drinking alcohol and drink water in between alcoholic beverages. As one of the key causes of a hangover is dehydration, the more you do to combat it beforehand the better. If you have a hangover, be sure to drink plenty of water as well. Drink a pint of water before you go to sleep at night. Since your body continues to process water while you sleep — albeit less water — you will still wake up more dehydrated than when you go to bed. Since hangovers operate on dehydration, you can help lessen the effects of alcohol by drinking more water. Try to leave a glass of water by your bed so you can drink it when you wake up. Drink sports drinks. In addition to water, these isotonic sports drinks can quickly replenish the fluids in your body, while adding carbohydrates needed for energy and electrolytes to your system. Sports drinks can be good to ease an upset stomach, too. Pick a flavor that tastes good and won't make you further nauseous. Drink some orange juice. Vitamin C, specifically, helps replenish energy, which is vital when the lethargic power of a hangover kicks in. The fructose found in many types of juices will help replenish sugars in your body depleted in order to process the alcohol you've consumed. Tomato juice and coconut water are also great options. Stay away from caffeinated beverages. Since alcohol is a depressant and makes people sleepy, it seems like the common cure-all would be coffee. Yet, coffee will further dehydrate you. If you have an upset stomach too, coffee may further irritate it. Stick to water. Rest is better than coffee. Drink Sprite. Chinese researchers tested the effects of 57 drinks and found that Sprite was the most effective at combatting hangover effects. The enzyme alcohol dehydrogenase is released by your liver when you consume alcohol. The longer this enzyme is in your system directly relates to the length of your hangover. Get rid of it quickly if you want a shorter hangover. These researchers found that Sprite flushed the human system of alcohol dehydrogenase faster than any other beverage. Herbal tea actually prolonged the presence of this enzyme. Don't drink more alcohol. Stay away from \"the hair of the dog that bit you.\" While many people will tell you to just drink a little more of what you drank the night before to get over a hangover, don't listen to them. All you'll be doing is prolonging the effects of the alcohol. It may numb your symptoms in the short-term, it'll probably worsen the hangover in the long term. Eating to Combat the Effects of Alcohol Eat some eggs. Eggs are an essential foodstuff for any hangover cure repertoire. They contain an amino acid called cysteine, which soaks up the toxins introduced to your body by alcohol. Eat a few egg whites and soon enough you'll begin feeling back to normal. Fry or scramble them; it doesn't matter how you prepare your eggs, as long as they are cooked. An urban myth says to drink a couple raw eggs after a night out on the town. The slimy factor mixed with the ever-present danger of salmonella make this myth simply that — a myth. Eat some crackers or toast. Your first inclination may be to eat a heavy, greasy cheeseburger. Don't do it. Eat something light like crackers or toast. Both contain sodium— something your body needs to work properly and something that alcohol consumption tends to reduce. Eat foods rich in potassium, like bananas. Since you urinate more when you drink heavily, your body is losing its precious potassium. Lower potassium levels lead to lethargy, nausea, and weakness. Bananas and kiwis are great sources of potassium. Baked potatoes, leafy greens, apricots, and mushrooms are also loaded with potassium. Consider chasing that last drink with a banana to lessen the effects of alcohol. Eat soups rich with nutrients. Bouillon, chicken noodle, and miso soups are great soup options for a number of reasons. They all contain many nutrients your body needs to overcome a hangover and the nauseating effects of alcohol. Sodium, cysteine, and the rehydrating power of water and broth will help you immensely. Relaxing to Lessen Alcoholic Effects Sleep it off. Hangovers are best eliminated with time. Since alcohol makes you feel sleepy, you might reach for the caffeinated beverage. This won't work for you. Your body needs time to recuperate. Take a nap. This is the best way to get rid of that headache and to get your better judgement back. Take a shower. A warm shower will raise your core temperature. A warmer temperature will prepare your body for sleep, which will in turn allow you to bypass the horrendous headache of the dreaded hangover. If you need to stay alert while drunk, a cold shower can help wake you up and keep your at the ready. Go for a short walk. A great way to get your alcohol's effects under control is to go for a walk. Walking speeds up your metabolism, processing what's in your stomach faster. So going for a short stroll may help reduce the duration of your alcohol's effects. Obviously, alcohol impairs your ability to walk, so make sure you go for your jaunt in a safe space — away from cars and stairs (the two greatest dangers to the drunk). Medicating Appropriately Take Ibuprofen, naproxen, and other prescription non-steroidal anti-inflammatory medications (NSAIDs). These medications can help numb that pounding headache. Follow the instructions on the bottle. Do not take more unless prescribed by a doctor. Do not take acetaminophen (Tylenol). Acetaminophen will tax your liver further, leading to mild and even severe swelling. Take a B6 supplement or shot. B6 will help revitalize your body. B6 increases cognitive function as well as reducing nausea and vomiting. You can purchase B6 from most pharmacies or vitamin supplement stores. Take an antacid. Stomach pains and nausea are common effects of alcohol. Antacid pills will help regulate the acidity levels in your stomach. If you feel sick, pop an antacid. Sodium alginate and potassium bicarbonate based antacids, available over the counter, can help a lot. Be sure to follow the instructions on the bottle. Do not take more than is recommended by your doctor.",
  "tyn_model":[
    "alcohol",
    "water",
    "coffee",
    "eggs",
    "sprite",
    "b6",
    "alcohol dehydrogenase",
    "crackers",
    "bananas",
    "potassium",
    "shower",
    "antacid",
    "beverages",
    "brandy",
    "whisky",
    "red wine",
    "vodka",
    "gin",
    "white rum",
    "— albeit",
    "— you",
    "orange juice",
    "juices",
    "tomato juice",
    "coconut water",
    "herbal tea",
    "— a",
    "— something",
    "apricots",
    "mushrooms",
    "banana",
    "bouillon",
    "chicken noodle,",
    "broth",
    "— away",
    "ibuprofen",
    "naproxen",
    "anti-inflammatory medications",
    "acetaminophen (",
    "tylenol",
    "b6 supplement",
    "vitamin supplement stores",
    "antacid pills"
  ],
  "tyn_section":[

  ]
}