{
  "title":"How to Make Italian Espresso Chocolate Brownies",
  "url":"https://www.wikihow.com/Make-Italian-Espresso-Chocolate-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "parts":[
    {
      "name":"Baking the Brownies",
      "steps":[
        {
          "headline":"Melt the butter and chocolate.",
          "description":"Add the butter cubes to a small, heavy-bottomed saucepan. Heat the butter over medium heat, stirring constantly, until it’s completely melted. Add the chocolate pieces. Continue stirring, and keep heating the mixture until the chocolate is melted and the ingredients are fully incorporated. When the butter and chocolate are melted, remove the pan from the heat and set it aside to cool."
        },
        {
          "headline":"Combine the dry ingredients.",
          "description":"In a large mixing bowl, whisk together the flour, baking powder, and salt. Whisk until the three ingredients are combined, and there are no lumps in the powder. Don’t add the sugar or espresso powder, as these will be mixed in with the wet ingredients."
        },
        {
          "headline":"Combine the wet ingredients.",
          "description":"Crack the eggs one at a time into a separate large mixing bowl. Add the sugar, espresso powder, liqueur, and vanilla. With a hand mixer, beat the ingredients on medium speed until they're fully combined. If you can't find espresso powder, use ½ cup (117 g) of instant coffee instead."
        },
        {
          "headline":"Mix all the ingredients together.",
          "description":"Pour the cooled chocolate and butter mixture into the bowl with the wet ingredients. Mix on medium speed until incorporated. Pour in the flour mixture and beat again until you have a smooth and lump-free batter. Stop as soon as the batter is smooth. Overmixing can develop the gluten in the flour, and this will make the brownies dense."
        },
        {
          "headline":"Pour the brownies.",
          "description":"Line a baking sheet that’s 13-by-9 inches (33-by-23 cm) with parchment paper. Cover the parchment paper with a thin layer of butter, cooking spray, or vegetable shortening. Pour the batter into the pan, and use a spoon to spread it out evenly."
        },
        {
          "headline":"Bake the brownies.",
          "description":"Preheat an oven to 350 F (177 C). When the oven reaches temperature, put in the brownies and bake them for 25 to 30 minutes. The brownies are done when the top sets and is no longer liquid. For chewier brownies, bake them for 35 to 40 minutes.Set the brownies aside to cool for 10 minutes in the baking dish."
        },
        {
          "headline":"Cool and garnish before serving.",
          "description":"Turn the brownies out onto a wire cooling rack. Set them aside to cool to room temperature, about an hour. Cut the brownies into 1.5-inch (3.8-cm) squares. Transfer the individual brownie pieces to serving plates and garnish with chocolate-covered coffee beans if you like.For larger brownies, cut each one into a 2-inch (5-cm) square. That way, you'll end up with about 30 brownies."
        }
      ]
    },
    {
      "name":"Turning the Brownies into Affogato",
      "steps":[
        {
          "headline":"Crumble the brownie.",
          "description":"Take two cooled brownie squares and use your hand to crumble them into smaller bite-sized pieces. Transfer the brownie pieces to a bowl or dessert serving dish.If you cut your brownie into small squares, use between two and four brownie squares per affogato. Traditionally, affogato is a dessert beverage made by drowning a scoop of ice cream in hot coffee."
        },
        {
          "headline":"Add the ice cream and espresso.",
          "description":"Scoop the vanilla ice cream onto the crumbled brownie pieces. You can also use gelato or frozen yogurt if you prefer. Then, pour the hot and freshly brewed shot of espresso over top of the ice cream. To make an adults-only affogato, combine the espresso with a shot of coffee liqueur before pouring it over the ice cream. To make the espresso, you can use a commercial espresso machine, a stovetop espresso pot, or you can brew a small cup of very strong coffee."
        },
        {
          "headline":"Garnish before serving.",
          "description":"Once you’ve poured the espresso, top the ice cream and brownie with whipped cream. Sprinkle the chocolate shavings and chocolate-covered coffee beans on top of the whipped cream and serve the dessert with a spoon.For an extra-decadent dessert, drizzle some warm chocolate or fudge sauce over the whipped cream before garnishing it with the chocolate pieces and coffee beans."
        }
      ]
    },
    {
      "name":"Getting Creative with Brownies",
      "steps":[
        {
          "headline":"Bake them with additional ingredients.",
          "description":"There are lots of things you can add to brownie batter to customize the flavor, add crunch, or change the brownie completely. Fold in up to a cup of your favorite ingredients right before baking. A few of the most popular brownie additions include:Chopped nut, such as walnuts, peanuts, or pecans\nChocolate chips\nCrushed peppermint candies\nCrushed cookie pieces\nMini marshmallows"
        },
        {
          "headline":"Make a frosting for them.",
          "description":"Brownies and frosting go together like peanut butter and jelly. Many brownies often come with a chocolate topping, but you can experiment with a variety of different frostings for your dessert, including:\nCream cheese icing\nOrange frosting\nPeppermint frosting\nCaramel sauce\nMarshmallow frosting"
        },
        {
          "headline":"Turn them into brownie sandwiches.",
          "description":"Once you have a frosting for your brownies, you can get creative and put the frosting in between the brownies instead of on top! Frost the top of one brownie with your favorite icing, and then place a second brownie piece on top for a brownie sandwich. Instead of frosting, you can also stuff a brownie sandwich with other toppings, such as peanut butter, jam, chocolate-hazelnut spread, marshmallow spread, or even ice cream."
        },
        {
          "headline":"Use a brownie as an ice cream cake base.",
          "description":"Brownies and ice cream are another classic combination, and you can use a freshly made brownie as the base for an ice cream cake. After baking and cooling the brownie, turn the dessert into a cake with this method:Spread 1½ cups (340 g) of chocolate or vanilla frosting over the uncut brownie\nFreeze the frosted brownie for 30 minutes\nSpread 6 cups (516 g) of your favorite ice cream evenly over the frosted brownie\nCover the cake\nFreeze the cake for three hours\nGarnish the cake with whipped cream and sprinkles before serving"
        },
        {
          "headline":"Try brownies on a stick.",
          "description":"Brownies on a stick are a tasty and fun treat that’s perfect for birthdays, parties, and other celebrations. Bake and cool a batch of brownies, and transfer the cooled brownie to the freezer for 30 minutes. Remove the chilled brownie from the freezer and cut it into 12 to 15 squares. Insert a clean popsicle stick into the side of each brownie and freeze for another 30 minutes. When the brownies are chilled, cover them with melted chocolate and sprinkles. Allow the chocolate to dry before serving."
        }
      ]
    }
  ],
  "text":" Baking the Brownies Melt the butter and chocolate. Add the butter cubes to a small, heavy-bottomed saucepan. Heat the butter over medium heat, stirring constantly, until it’s completely melted. Add the chocolate pieces. Continue stirring, and keep heating the mixture until the chocolate is melted and the ingredients are fully incorporated. When the butter and chocolate are melted, remove the pan from the heat and set it aside to cool. Combine the dry ingredients. In a large mixing bowl, whisk together the flour, baking powder, and salt. Whisk until the three ingredients are combined, and there are no lumps in the powder. Don’t add the sugar or espresso powder, as these will be mixed in with the wet ingredients. Combine the wet ingredients. Crack the eggs one at a time into a separate large mixing bowl. Add the sugar, espresso powder, liqueur, and vanilla. With a hand mixer, beat the ingredients on medium speed until they're fully combined. If you can't find espresso powder, use ½ cup (117 g) of instant coffee instead. Mix all the ingredients together. Pour the cooled chocolate and butter mixture into the bowl with the wet ingredients. Mix on medium speed until incorporated. Pour in the flour mixture and beat again until you have a smooth and lump-free batter. Stop as soon as the batter is smooth. Overmixing can develop the gluten in the flour, and this will make the brownies dense. Pour the brownies. Line a baking sheet that’s 13-by-9 inches (33-by-23 cm) with parchment paper. Cover the parchment paper with a thin layer of butter, cooking spray, or vegetable shortening. Pour the batter into the pan, and use a spoon to spread it out evenly. Bake the brownies. Preheat an oven to 350 F (177 C). When the oven reaches temperature, put in the brownies and bake them for 25 to 30 minutes. The brownies are done when the top sets and is no longer liquid. For chewier brownies, bake them for 35 to 40 minutes.Set the brownies aside to cool for 10 minutes in the baking dish. Cool and garnish before serving. Turn the brownies out onto a wire cooling rack. Set them aside to cool to room temperature, about an hour. Cut the brownies into 1.5-inch (3.8-cm) squares. Transfer the individual brownie pieces to serving plates and garnish with chocolate-covered coffee beans if you like.For larger brownies, cut each one into a 2-inch (5-cm) square. That way, you'll end up with about 30 brownies. Turning the Brownies into Affogato Crumble the brownie. Take two cooled brownie squares and use your hand to crumble them into smaller bite-sized pieces. Transfer the brownie pieces to a bowl or dessert serving dish.If you cut your brownie into small squares, use between two and four brownie squares per affogato. Traditionally, affogato is a dessert beverage made by drowning a scoop of ice cream in hot coffee. Add the ice cream and espresso. Scoop the vanilla ice cream onto the crumbled brownie pieces. You can also use gelato or frozen yogurt if you prefer. Then, pour the hot and freshly brewed shot of espresso over top of the ice cream. To make an adults-only affogato, combine the espresso with a shot of coffee liqueur before pouring it over the ice cream. To make the espresso, you can use a commercial espresso machine, a stovetop espresso pot, or you can brew a small cup of very strong coffee. Garnish before serving. Once you’ve poured the espresso, top the ice cream and brownie with whipped cream. Sprinkle the chocolate shavings and chocolate-covered coffee beans on top of the whipped cream and serve the dessert with a spoon.For an extra-decadent dessert, drizzle some warm chocolate or fudge sauce over the whipped cream before garnishing it with the chocolate pieces and coffee beans. Getting Creative with Brownies Bake them with additional ingredients. There are lots of things you can add to brownie batter to customize the flavor, add crunch, or change the brownie completely. Fold in up to a cup of your favorite ingredients right before baking. A few of the most popular brownie additions include:Chopped nut, such as walnuts, peanuts, or pecans\nChocolate chips\nCrushed peppermint candies\nCrushed cookie pieces\nMini marshmallows Make a frosting for them. Brownies and frosting go together like peanut butter and jelly. Many brownies often come with a chocolate topping, but you can experiment with a variety of different frostings for your dessert, including:\nCream cheese icing\nOrange frosting\nPeppermint frosting\nCaramel sauce\nMarshmallow frosting Turn them into brownie sandwiches. Once you have a frosting for your brownies, you can get creative and put the frosting in between the brownies instead of on top! Frost the top of one brownie with your favorite icing, and then place a second brownie piece on top for a brownie sandwich. Instead of frosting, you can also stuff a brownie sandwich with other toppings, such as peanut butter, jam, chocolate-hazelnut spread, marshmallow spread, or even ice cream. Use a brownie as an ice cream cake base. Brownies and ice cream are another classic combination, and you can use a freshly made brownie as the base for an ice cream cake. After baking and cooling the brownie, turn the dessert into a cake with this method:Spread 1½ cups (340 g) of chocolate or vanilla frosting over the uncut brownie\nFreeze the frosted brownie for 30 minutes\nSpread 6 cups (516 g) of your favorite ice cream evenly over the frosted brownie\nCover the cake\nFreeze the cake for three hours\nGarnish the cake with whipped cream and sprinkles before serving Try brownies on a stick. Brownies on a stick are a tasty and fun treat that’s perfect for birthdays, parties, and other celebrations. Bake and cool a batch of brownies, and transfer the cooled brownie to the freezer for 30 minutes. Remove the chilled brownie from the freezer and cut it into 12 to 15 squares. Insert a clean popsicle stick into the side of each brownie and freeze for another 30 minutes. When the brownies are chilled, cover them with melted chocolate and sprinkles. Allow the chocolate to dry before serving.",
  "tyn_model":[
    "ice cream",
    "chocolate",
    "butter",
    "whipped cream",
    "flour",
    "espresso powder",
    "sugar",
    "bowl",
    "parchment paper",
    "spoon",
    "oven",
    "chocolate-covered coffee beans",
    "espresso",
    "frosting",
    "brownie",
    "ice cream cake",
    "freezer",
    "small, heavy-bottomed saucepan",
    "pan",
    "mixing bowl",
    "baking powder",
    "salt",
    "eggs",
    "large mixing bowl",
    "liqueur",
    "vanilla",
    "hand mixer",
    "instant coffee",
    "baking sheet",
    "cooking spray",
    "vegetable shortening",
    "baking dish",
    "dessert serving dish",
    "vanilla ice cream",
    "gelato or",
    "frozen yogurt",
    "coffee liqueur",
    "espresso machine",
    "espresso pot",
    "coffee beans",
    "brownie batter",
    "walnuts",
    "peanuts",
    "pecans",
    "marshmallows",
    "peanut butter and jelly",
    "cream cheese",
    "orange frosting",
    "peppermint frosting",
    "caramel sauce",
    "marshmallow frosting",
    "brownie sandwiches",
    "icing",
    "peanut butter",
    "chocolate or vanilla",
    "popsicle stick"
  ],
  "tyn_section":[

  ]
}