{
  "title":"How to Warm up for Running",
  "url":"https://www.wikihow.com/Warm-up-for-Running",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Heating Systems"
  ],
  "methods":[
    {
      "name":"Choosing a Light Cardio Warmup",
      "steps":[
        {
          "headline":"Take a light jog.",
          "description":"Jogging even for 10 minutes will activate your muscles, increase your resting pulse, and put you in a better condition to run. Even taking a brisk walk before you go for a run can be an effective way of warming up. You won't be able to run without getting your blood pumping and your muscles warmed up with light cardio exercises like the ones listed in this section. If you plan on doing a walking warmup, keep your pace faster than normal and swing your arms as you would if you were really running. Jog or walk until the motion becomes natural. Avoid jogging for too long during your warmup; many runners feel some fatigue set in after about 25 minutes of jogging."
        },
        {
          "headline":"Exercise range of motion in your legs with butt-kickers and high-knees.",
          "description":"While at a moderate pace, raise your knees as high in front of you as comfortable to perform the high-knee exercise. Butt-kickers are the exact opposite: extend your leg as far back as far as comfortable so that it nearly strikes your butt. Butt-kickers and high-knee exercises are a great way to get movement to the hip joint that increases blood flow around the cartilage and helps to lubricate the connective tissues."
        },
        {
          "headline":"Jump rope instead of jogging.",
          "description":"You could also do this in addition to a light jog for extra cardiovascular conditioning. Beyond being an excellent cardio warmup, jumping rope will also engage your upper body and arms, preparing it for the run to come. While jumping rope, keep your weight on the balls of your feet and the swinging motion of the rope in your wrists (as opposed to your shoulders/arms)."
        },
        {
          "headline":"Do some jumping jacks.",
          "description":"Jumping jacks can be done pretty much anywhere, making this a versatile warmup for your exercise toolbox. But that doesn’t mean this exercise should be taken lightly! Your shoulder blades should be back, your spine straight, and your arms fully extended throughout."
        }
      ]
    },
    {
      "name":"Moving Dynamically Pre-Run",
      "steps":[
        {
          "headline":"Avoid stretching before your run.",
          "description":"Doing a static stretch before you run risks straining your muscles. Because your muscles aren't warmed up, the lack of oxygen and blood in your system can cause pain and even damage your workout. Dynamic stretching, which uses an active motion (like a lunge) to fully engage a body part’s range of motion, is preferred for warming up pre-run. Although there is some evidence that static stretching can have a negative impact on performance, dynamic stretching has no proven negative effects."
        },
        {
          "headline":"Perform a few bodyweight squats.",
          "description":"Squats will engage your quads and glutes. Watch your form carefully; poor form when squatting, especially when doing weighted squats, can be harmful. Don't get psyched out by exercise terms - \"bodyweight\" only means that you don't use any extra weights, all you need is your body's weight (like a standard push up). Generally, when squatting your feet should be about shoulder width apart and facing forward. Focus your eyes in front of you, keep your shoulders back, and maintain a straight spine. It might take some getting used to, but this motion should be initiated by a folding of your hips into as deep of a squat as is comfortable."
        },
        {
          "headline":"Do some bodyweight lunges.",
          "description":"A variety of lunges will warm up your lower body best. Do 10 to 20 forward lunges to start with, beginning with shorter steps and a smaller range of motion, and working up to your full range of motion by the 20th rep. Follow this up with 10 to 20 more lunges, but twist your torso to the left as you lunge with your left leg, and to the right on your right leg. Once you’re comfortable with the forward lunge and the lunge-twist, try adding 10 to 20 backwards and side lunges to your warmup routine."
        },
        {
          "headline":"Warm up with mountain climbers.",
          "description":"Mountain climbers will work your legs and torso. Be cautious when doing mountain climbers for your warm up, as they can require more energy than running. Move slowly at first, and only do them for a minute or two before resting. Add some variety to this exercise by doing the “doubles out” style: instead of kicking legs out one at a time, kick both out on each repetition."
        },
        {
          "headline":"Kick like a donkey while on all fours.",
          "description":"Well-stretched hips are important if you want to have the best run. One of the best hip stretches can be performed while on all fours. Keep your back straight, your shoulders above your hands, and your eyes be facing down. Fully extend your legs one at a time behind you. As you reach a full extension with your leg, squeeze with the muscles in your glutes and hold the fully extended position for a few seconds before returning to the neutral position."
        },
        {
          "headline":"Try A-skips and B-skips.",
          "description":"To do an A-skip, bring 1 knee up above your hip and then quickly lower it as you move forward. Repeat on both sides. Once you have mastered that, move onto the B-skip. Bring your knee up above your hip but extend your leg forward before lowering your foot to the ground. This should make a circular motion.Try doing skips across a room, gym, or court. As you move forward, move your arms as though you were running."
        }
      ]
    },
    {
      "name":"Preventing and Treating Shin Splints",
      "steps":[
        {
          "headline":"Build the intensity of your runs gradually.",
          "description":"Pushing yourself too hard, especially when you’re just starting out, can be a major contributor to shin splints. Maybe start with a half an hour walk-run, and increase this little by little until you reach the level you’re aiming for. To keep yourself challenged, try to increase your distance and speed by about 10% every week."
        },
        {
          "headline":"Maintain a short stride.",
          "description":"It may feel like you’re kicking it into high gear when you lengthen your stride, but this puts extra strain on your legs. Take extra care when getting back into the swing of running to reduce your stride length and decrease the likelihood of shin splints. It’s especially common at the end of a race or workout to lengthen your stride when pushing through to the finish."
        },
        {
          "headline":"Walk on your heels before and after running.",
          "description":"When you run, your calf muscles get a work out. The same isn’t true, however, for the muscles at the front of your shin. Promote balance between these muscle groups and lower your chances of shin splints by walking around on your heels before and after running. At first, this activity won’t likely be easy. Try walking around for 15 to 30 seconds at a time for about 3 sets."
        },
        {
          "headline":"Stretch your calves after running.",
          "description":"Sit on the floor with your legs extended straight in front of you. Hold either end of an exercise band or a towel and loop it around the ball of your foot. Pull back lightly until you feel the stretch in your calf. If you don't have an exercise band or towel, stand in front of a wall with your feet placed 1 to 2½ steps away. Lean to the wall until you feel your calves stretch. Generally, this stretch should only be held for about 20 to 30 seconds and should be repeated about 2 or 3 times for each leg."
        },
        {
          "headline":"Ice the painful area when shin splints occur.",
          "description":"Even after taking every precaution, you might still end up with shin splints. It’s a bummer, but a little ice can take the edge off the pain. Ice your shins for about 10 to 15 minutes at a time between 4 and 8 times a day. Over the counter pain killers, like Ibuprofen or Aspirin, can also help alleviate some of the pain. Consult your doctor if pain persists for more than two weeks."
        }
      ]
    }
  ],
  "text":" Choosing a Light Cardio Warmup Take a light jog. Jogging even for 10 minutes will activate your muscles, increase your resting pulse, and put you in a better condition to run. Even taking a brisk walk before you go for a run can be an effective way of warming up. You won't be able to run without getting your blood pumping and your muscles warmed up with light cardio exercises like the ones listed in this section. If you plan on doing a walking warmup, keep your pace faster than normal and swing your arms as you would if you were really running. Jog or walk until the motion becomes natural. Avoid jogging for too long during your warmup; many runners feel some fatigue set in after about 25 minutes of jogging. Exercise range of motion in your legs with butt-kickers and high-knees. While at a moderate pace, raise your knees as high in front of you as comfortable to perform the high-knee exercise. Butt-kickers are the exact opposite: extend your leg as far back as far as comfortable so that it nearly strikes your butt. Butt-kickers and high-knee exercises are a great way to get movement to the hip joint that increases blood flow around the cartilage and helps to lubricate the connective tissues. Jump rope instead of jogging. You could also do this in addition to a light jog for extra cardiovascular conditioning. Beyond being an excellent cardio warmup, jumping rope will also engage your upper body and arms, preparing it for the run to come. While jumping rope, keep your weight on the balls of your feet and the swinging motion of the rope in your wrists (as opposed to your shoulders/arms). Do some jumping jacks. Jumping jacks can be done pretty much anywhere, making this a versatile warmup for your exercise toolbox. But that doesn’t mean this exercise should be taken lightly! Your shoulder blades should be back, your spine straight, and your arms fully extended throughout. Moving Dynamically Pre-Run Avoid stretching before your run. Doing a static stretch before you run risks straining your muscles. Because your muscles aren't warmed up, the lack of oxygen and blood in your system can cause pain and even damage your workout. Dynamic stretching, which uses an active motion (like a lunge) to fully engage a body part’s range of motion, is preferred for warming up pre-run. Although there is some evidence that static stretching can have a negative impact on performance, dynamic stretching has no proven negative effects. Perform a few bodyweight squats. Squats will engage your quads and glutes. Watch your form carefully; poor form when squatting, especially when doing weighted squats, can be harmful. Don't get psyched out by exercise terms - \"bodyweight\" only means that you don't use any extra weights, all you need is your body's weight (like a standard push up). Generally, when squatting your feet should be about shoulder width apart and facing forward. Focus your eyes in front of you, keep your shoulders back, and maintain a straight spine. It might take some getting used to, but this motion should be initiated by a folding of your hips into as deep of a squat as is comfortable. Do some bodyweight lunges. A variety of lunges will warm up your lower body best. Do 10 to 20 forward lunges to start with, beginning with shorter steps and a smaller range of motion, and working up to your full range of motion by the 20th rep. Follow this up with 10 to 20 more lunges, but twist your torso to the left as you lunge with your left leg, and to the right on your right leg. Once you’re comfortable with the forward lunge and the lunge-twist, try adding 10 to 20 backwards and side lunges to your warmup routine. Warm up with mountain climbers. Mountain climbers will work your legs and torso. Be cautious when doing mountain climbers for your warm up, as they can require more energy than running. Move slowly at first, and only do them for a minute or two before resting. Add some variety to this exercise by doing the “doubles out” style: instead of kicking legs out one at a time, kick both out on each repetition. Kick like a donkey while on all fours. Well-stretched hips are important if you want to have the best run. One of the best hip stretches can be performed while on all fours. Keep your back straight, your shoulders above your hands, and your eyes be facing down. Fully extend your legs one at a time behind you. As you reach a full extension with your leg, squeeze with the muscles in your glutes and hold the fully extended position for a few seconds before returning to the neutral position. Try A-skips and B-skips. To do an A-skip, bring 1 knee up above your hip and then quickly lower it as you move forward. Repeat on both sides. Once you have mastered that, move onto the B-skip. Bring your knee up above your hip but extend your leg forward before lowering your foot to the ground. This should make a circular motion.Try doing skips across a room, gym, or court. As you move forward, move your arms as though you were running. Preventing and Treating Shin Splints Build the intensity of your runs gradually. Pushing yourself too hard, especially when you’re just starting out, can be a major contributor to shin splints. Maybe start with a half an hour walk-run, and increase this little by little until you reach the level you’re aiming for. To keep yourself challenged, try to increase your distance and speed by about 10% every week. Maintain a short stride. It may feel like you’re kicking it into high gear when you lengthen your stride, but this puts extra strain on your legs. Take extra care when getting back into the swing of running to reduce your stride length and decrease the likelihood of shin splints. It’s especially common at the end of a race or workout to lengthen your stride when pushing through to the finish. Walk on your heels before and after running. When you run, your calf muscles get a work out. The same isn’t true, however, for the muscles at the front of your shin. Promote balance between these muscle groups and lower your chances of shin splints by walking around on your heels before and after running. At first, this activity won’t likely be easy. Try walking around for 15 to 30 seconds at a time for about 3 sets. Stretch your calves after running. Sit on the floor with your legs extended straight in front of you. Hold either end of an exercise band or a towel and loop it around the ball of your foot. Pull back lightly until you feel the stretch in your calf. If you don't have an exercise band or towel, stand in front of a wall with your feet placed 1 to 2½ steps away. Lean to the wall until you feel your calves stretch. Generally, this stretch should only be held for about 20 to 30 seconds and should be repeated about 2 or 3 times for each leg. Ice the painful area when shin splints occur. Even after taking every precaution, you might still end up with shin splints. It’s a bummer, but a little ice can take the edge off the pain. Ice your shins for about 10 to 15 minutes at a time between 4 and 8 times a day. Over the counter pain killers, like Ibuprofen or Aspirin, can also help alleviate some of the pain. Consult your doctor if pain persists for more than two weeks.",
  "tyn_model":[
    "mountain climbers",
    "ice",
    "butt-kickers",
    "rope",
    "dynamic stretching",
    "exercise band",
    "towel",
    "jumping rope",
    "static stretching",
    "“doubles",
    "” style",
    "ibuprofen",
    "aspirin"
  ],
  "tyn_section":[

  ]
}