{
  "title":"How to Make Water in the Desert",
  "url":"https://www.wikihow.com/Make-Water-in-the-Desert",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Pit-style Solar Still",
      "steps":[
        {
          "headline":"Survey the land for signs of dried out river beds.",
          "description":"These locations are the best place to seek moisture."
        },
        {
          "headline":"Dig a few curved holes (the more the better) about 19 inches (50 cm) deep so that the moist subsoil is clearly visible.",
          "description":"If you are in dryer conditions, the moist subsoil may be slightly deeper. Dig until you find it. Do not dig the hole/holes in the shade. This process needs direct sunlight to work correctly. Look around and make sure that shade won't move over your solar still before evening arrives."
        },
        {
          "headline":"Throw any non-poisonous plants into the hole/holes.",
          "description":""
        },
        {
          "headline":"Place an open coffee can, mug, cup or canteen in the center of each hole.",
          "description":"If you have a length of plastic tubing, you can run it from the bottom of the coffee can out the edge of the hole. You can use the tubing to suck the water from the can without dismantling the still."
        },
        {
          "headline":"Lay a taut piece of clear plastic wrap across the top of each hole.",
          "description":""
        },
        {
          "headline":"Create a seal by pouring sand in a circle around each hole along the outside of the plastic wrap.",
          "description":"Pour the sand 1 to 2 inches (2.5 to 5 cm) from the edge of the plastic wrap. Ensure that there are no gaps. The plastic wrap must seal the hole shut; if it is punctured, the water will not condense."
        },
        {
          "headline":"Place a small to medium sized rock in the center of the plastic wrap so that the plastic wrap dips to a point above the can.",
          "description":"Keep the plastic wrap from touching the can or else the water will not drip into the can."
        },
        {
          "headline":"Wait for the sun to evaporate water out of the moist soil and any plants within each hole.",
          "description":"The water will condense on the plastic wrap because it cannot escape the hole and will drip into the can. If you have installed plastic tubing, drink from that."
        },
        {
          "headline":"Once the sun dries the subsoil in a hole, just dig another.",
          "description":"Alternatively, you may dig deeper using the established hole/holes."
        }
      ]
    },
    {
      "name":"Plant Condensation",
      "steps":[
        {
          "headline":"Using 550 paracord (or similar material), tie a clear plastic bag on the end of a plant or small tree branch.",
          "description":"Do not use tape - the heat will prevent the tape from adhering effectively to the bag."
        },
        {
          "headline":"Make sure the bag is sealed as tightly as possible around the branch.",
          "description":"The plant transpires water during the process of transpiration."
        },
        {
          "headline":"Water vapor will collect and condense in the bag.",
          "description":"Make sure the water collecting in the bag won't drip out."
        },
        {
          "headline":"Wait until evening for maximum condensation before removing the bag.",
          "description":""
        },
        {
          "headline":"Switch the bag to another branch and repeat.",
          "description":""
        },
        {
          "headline":"Expected yield is one cup of water per large bag - you will need several of these to survive.",
          "description":""
        }
      ]
    }
  ],
  "text":" Pit-style Solar Still Survey the land for signs of dried out river beds. These locations are the best place to seek moisture. Dig a few curved holes (the more the better) about 19 inches (50 cm) deep so that the moist subsoil is clearly visible. If you are in dryer conditions, the moist subsoil may be slightly deeper. Dig until you find it. Do not dig the hole/holes in the shade. This process needs direct sunlight to work correctly. Look around and make sure that shade won't move over your solar still before evening arrives. Throw any non-poisonous plants into the hole/holes.  Place an open coffee can, mug, cup or canteen in the center of each hole. If you have a length of plastic tubing, you can run it from the bottom of the coffee can out the edge of the hole. You can use the tubing to suck the water from the can without dismantling the still. Lay a taut piece of clear plastic wrap across the top of each hole.  Create a seal by pouring sand in a circle around each hole along the outside of the plastic wrap. Pour the sand 1 to 2 inches (2.5 to 5 cm) from the edge of the plastic wrap. Ensure that there are no gaps. The plastic wrap must seal the hole shut; if it is punctured, the water will not condense. Place a small to medium sized rock in the center of the plastic wrap so that the plastic wrap dips to a point above the can. Keep the plastic wrap from touching the can or else the water will not drip into the can. Wait for the sun to evaporate water out of the moist soil and any plants within each hole. The water will condense on the plastic wrap because it cannot escape the hole and will drip into the can. If you have installed plastic tubing, drink from that. Once the sun dries the subsoil in a hole, just dig another. Alternatively, you may dig deeper using the established hole/holes. Plant Condensation Using 550 paracord (or similar material), tie a clear plastic bag on the end of a plant or small tree branch. Do not use tape - the heat will prevent the tape from adhering effectively to the bag. Make sure the bag is sealed as tightly as possible around the branch. The plant transpires water during the process of transpiration. Water vapor will collect and condense in the bag. Make sure the water collecting in the bag won't drip out. Wait until evening for maximum condensation before removing the bag.  Switch the bag to another branch and repeat.  Expected yield is one cup of water per large bag - you will need several of these to survive. ",
  "tyn_model":[
    "water",
    "plastic wrap",
    "solar still",
    "coffee can",
    "plastic tubing",
    "sand",
    "plants",
    "clear plastic wrap",
    "clear plastic bag",
    "tape"
  ],
  "tyn_section":[

  ]
}