{
  "title":"How to Make Pumpkin Seeds",
  "url":"https://www.wikihow.com/Make-Pumpkin-Seeds",
  "category_hierarchy":[
    "Food and Entertaining",
    "Nuts and Seeds"
  ],
  "methods":[
    {
      "name":"Roasting Pumpkin Seeds",
      "steps":[
        {
          "headline":"Collect the pumpkin seeds.",
          "description":"The easiest way to get seeds out of the pumpkin is to start by slicing off the top two inches (five cm) of the pumpkin’s top. Then, cut the pumpkin into quarters. Scrape out the seeds with a spoon and transfer them to a colander. If you're going to be carving the pumpkin for Halloween, you have to cut the pumpkin a different way. Two to three inches out from the stem, insert a knife into the top of the pumpkin on a 45-degree angle aimed inward toward the center. Cut a hole around the stem on this angle. Pull out the top, reach your hand in, and scrape out the insides with a flat spoon. Transfer the seeds to a colander."
        },
        {
          "headline":"Clean the seeds.",
          "description":"Place the colander of seeds under running water. As the water rinses the seeds, use your fingers to pick through and loosen and remove the bits of orange flesh. When you’ve removed all the stringy bits and flesh, turn off the water and shake the seeds in the colander to remove the excess."
        },
        {
          "headline":"Brine the seeds.",
          "description":"Pour the salt and water into a small saucepan. Add the pumpkin seeds, and bring the brine to a boil over medium heat. When the water boils, let it simmer for another 10 minutes. When the simmering time is up, remove the pan from the heat. Drain the seeds in a strainer, shaking the strainer a few times to remove as much water as possible\nIf you didn’t get a full 1½ cups of seeds from your pumpkin, use 2 cups (474 ml) of water and 1 tablespoon (19 g) of salt per ½ cup (65 g) of seeds."
        },
        {
          "headline":"Oil and season the seeds.",
          "description":"Transfer the seeds to a bowl. Drizzle the seeds with oil and toss or stir to coat the seeds in the oil. You can also season the seeds with your favorite spices. Use about 1 to 2 teaspoons of seasoning, or to taste. Popular spices for pumpkin seeds include:\nSalt and pepper\nCayenne pepper\nGarlic powder\nOnion powder\nCajun powder\nPaprika\nBrown sugar and chipotle powder\nCurry\nHerbs, such as rosemary and thyme"
        },
        {
          "headline":"Bake the seeds.",
          "description":"Transfer the seeds to a baking sheet and spread them out in a single layer. Bake the seeds in a 400ºF (204ºC) oven for 10 to 20 minutes, until they're golden brown. Stir the seeds every five minutes to prevent burning and ensure even cooking."
        },
        {
          "headline":"Cool the seeds before serving.",
          "description":"Place the hot baking sheet on a wire cooling rack and let the seeds cool down for at least 10 minutes before serving or eating."
        }
      ]
    },
    {
      "name":"Toasting Pumpkin Seeds",
      "steps":[
        {
          "headline":"Collect and clean the seeds.",
          "description":"To cook your own pumpkin seeds, you must start with raw seeds, and the best place to get these is a fresh pumpkin. Cut open your pumpkin by cutting off the top and quartering it, or by cutting an angled hole around the stem. Remove the seeds with a spoon. Transfer the seeds to a colander and rinse them under running water. Pick through with your fingers to remove the stringy bits and orange flesh. Toss the seeds to remove excess water."
        },
        {
          "headline":"Heat the frying pan.",
          "description":"The easiest way to toast pumpkin seeds is to cook them in a frying pan. Place a dry 10-inch skillet over medium heat and let it preheat for two to three minutes. A dry frying pan means there is no oil or other liquid in it."
        },
        {
          "headline":"Toast the seeds.",
          "description":"Add the pumpkin seeds to the hot frying pan and spread them out in a single layer to ensure even cooking. Cook the seeds for four to five minutes. As the seeds cook, toss them around in the pan or stir them with a wooden spoon every minute. The seeds are ready when they become golden brown and puff up."
        },
        {
          "headline":"Season with oil and spices before serving.",
          "description":"Remove the pan from the heat and transfer the warm seeds to a bowl. Drizzle in the oil, add the spices, and toss to coat. You can season the seeds with a pinch of:\nSalt\nPepper\nCinnamon\nCurry powder\nHerbs, such as rosemary or thyme"
        }
      ]
    },
    {
      "name":"Soaking and Dehydrating Pumpkin Seeds",
      "steps":[
        {
          "headline":"Remove and clean the seeds.",
          "description":"Cut the top off the pumpkin or cut an angled hole around the stem. Scrape out the seeds with a spoon, and transfer them to a strainer. Rinse the seeds under running water, picking out strings and bits of orange flesh. When the seeds are clean, shake the strainer to remove excess water."
        },
        {
          "headline":"Soak the seeds.",
          "description":"Transfer the seeds to a jar or bowl. Cover them with the water and sprinkle in the salt. Cover the bowl with a clean towel or sheet of a paper towel and set it aside on the counter. Allow the seeds to soak for at least seven hours, or overnight if possible. Soaking seeds is similar to sprouting, in that it makes the nutrients easier to digest. Pumpkin seeds, however, won’t sprout, so you have to soak them instead."
        },
        {
          "headline":"Dehydrate the seeds.",
          "description":"Drain the seeds through a strainer to remove the water. Spread the seeds out in a single layer on a baking sheet. Transfer them to a warm oven that’s been preheated to 150ºF (66ºC). Let them dehydrate in the oven for between 12 and 24 hours. Start checking the seeds after 12 hours. The seeds are done when they are completely dry and there's no water left in them. If your oven doesn’t go that low, either set your oven to its lowest temperature, or use a dehydrator."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Roasting Pumpkin Seeds Collect the pumpkin seeds. The easiest way to get seeds out of the pumpkin is to start by slicing off the top two inches (five cm) of the pumpkin’s top. Then, cut the pumpkin into quarters. Scrape out the seeds with a spoon and transfer them to a colander. If you're going to be carving the pumpkin for Halloween, you have to cut the pumpkin a different way. Two to three inches out from the stem, insert a knife into the top of the pumpkin on a 45-degree angle aimed inward toward the center. Cut a hole around the stem on this angle. Pull out the top, reach your hand in, and scrape out the insides with a flat spoon. Transfer the seeds to a colander. Clean the seeds. Place the colander of seeds under running water. As the water rinses the seeds, use your fingers to pick through and loosen and remove the bits of orange flesh. When you’ve removed all the stringy bits and flesh, turn off the water and shake the seeds in the colander to remove the excess. Brine the seeds. Pour the salt and water into a small saucepan. Add the pumpkin seeds, and bring the brine to a boil over medium heat. When the water boils, let it simmer for another 10 minutes. When the simmering time is up, remove the pan from the heat. Drain the seeds in a strainer, shaking the strainer a few times to remove as much water as possible\nIf you didn’t get a full 1½ cups of seeds from your pumpkin, use 2 cups (474 ml) of water and 1 tablespoon (19 g) of salt per ½ cup (65 g) of seeds. Oil and season the seeds. Transfer the seeds to a bowl. Drizzle the seeds with oil and toss or stir to coat the seeds in the oil. You can also season the seeds with your favorite spices. Use about 1 to 2 teaspoons of seasoning, or to taste. Popular spices for pumpkin seeds include:\nSalt and pepper\nCayenne pepper\nGarlic powder\nOnion powder\nCajun powder\nPaprika\nBrown sugar and chipotle powder\nCurry\nHerbs, such as rosemary and thyme Bake the seeds. Transfer the seeds to a baking sheet and spread them out in a single layer. Bake the seeds in a 400ºF (204ºC) oven for 10 to 20 minutes, until they're golden brown. Stir the seeds every five minutes to prevent burning and ensure even cooking. Cool the seeds before serving. Place the hot baking sheet on a wire cooling rack and let the seeds cool down for at least 10 minutes before serving or eating. Toasting Pumpkin Seeds Collect and clean the seeds. To cook your own pumpkin seeds, you must start with raw seeds, and the best place to get these is a fresh pumpkin. Cut open your pumpkin by cutting off the top and quartering it, or by cutting an angled hole around the stem. Remove the seeds with a spoon. Transfer the seeds to a colander and rinse them under running water. Pick through with your fingers to remove the stringy bits and orange flesh. Toss the seeds to remove excess water. Heat the frying pan. The easiest way to toast pumpkin seeds is to cook them in a frying pan. Place a dry 10-inch skillet over medium heat and let it preheat for two to three minutes. A dry frying pan means there is no oil or other liquid in it. Toast the seeds. Add the pumpkin seeds to the hot frying pan and spread them out in a single layer to ensure even cooking. Cook the seeds for four to five minutes. As the seeds cook, toss them around in the pan or stir them with a wooden spoon every minute. The seeds are ready when they become golden brown and puff up. Season with oil and spices before serving. Remove the pan from the heat and transfer the warm seeds to a bowl. Drizzle in the oil, add the spices, and toss to coat. You can season the seeds with a pinch of:\nSalt\nPepper\nCinnamon\nCurry powder\nHerbs, such as rosemary or thyme Soaking and Dehydrating Pumpkin Seeds Remove and clean the seeds. Cut the top off the pumpkin or cut an angled hole around the stem. Scrape out the seeds with a spoon, and transfer them to a strainer. Rinse the seeds under running water, picking out strings and bits of orange flesh. When the seeds are clean, shake the strainer to remove excess water. Soak the seeds. Transfer the seeds to a jar or bowl. Cover them with the water and sprinkle in the salt. Cover the bowl with a clean towel or sheet of a paper towel and set it aside on the counter. Allow the seeds to soak for at least seven hours, or overnight if possible. Soaking seeds is similar to sprouting, in that it makes the nutrients easier to digest. Pumpkin seeds, however, won’t sprout, so you have to soak them instead. Dehydrate the seeds. Drain the seeds through a strainer to remove the water. Spread the seeds out in a single layer on a baking sheet. Transfer them to a warm oven that’s been preheated to 150ºF (66ºC). Let them dehydrate in the oven for between 12 and 24 hours. Start checking the seeds after 12 hours. The seeds are done when they are completely dry and there's no water left in them. If your oven doesn’t go that low, either set your oven to its lowest temperature, or use a dehydrator. Finished. ",
  "tyn_model":[
    "water",
    "pumpkin",
    "colander",
    "salt",
    "oven",
    "strainer",
    "oil",
    "bowl",
    "spices",
    "frying pan",
    "pumpkin seeds",
    "spoon",
    "baking sheet",
    "knife",
    "flat spoon",
    "small saucepan",
    "pan",
    "seasoning",
    "cayenne pepper",
    "garlic powder",
    "onion powder",
    "cajun powder",
    "paprika",
    "brown sugar",
    "chipotle powder",
    "curry",
    "rosemary",
    "thyme",
    "10-inch skillet",
    "wooden spoon",
    "pepper",
    "paper towel",
    "dehydrator"
  ],
  "tyn_section":[

  ]
}