{
  "title":"How to Drink Gin",
  "url":"https://www.wikihow.com/Drink-Gin",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks"
  ],
  "methods":[
    {
      "name":"Enjoying Gin on Its Own",
      "steps":[
        {
          "headline":"Drink gin neat.",
          "description":"Drinking a spirit neat means you drink it without any additional preparation. This means no chilling, no ice, and no mix. To enjoy gin this way, pour a standard shot, which is 1½ ounces (44 ml), of gin into an old fashioned cocktail glass. Drink the gin slowly and in small sips so you can appreciate the flavors. Modern gins are brewed in a variety of ways and with many different ingredients. Flavors you may taste when you sip your gin include florals, berries, citrus hints, and herbs. An old fashioned cocktail glass is a short and wide glass that holds 6 to 8 ounces (177 to 237 ml) of liquid."
        },
        {
          "headline":"Have it up.",
          "description":"When you order a drink up, it means you want it chilled but served without ice. To do this, pour a shot of gin into a martini shaker filled with ice. Put on the lid and shake the gin thoroughly to combine it with the ice. Remove the lid, leaving the strainer on the martini shaker, and pour the gin into your cocktail glass. Enjoy the gin slowly, and try to pick out the flavors that make the gin unique. Instead of chilling the gin with ice cubes, you can also freeze the bottle for a few hours to chill it. While the alcohol won’t freeze, it will make the gin a little thicker. As the gin warms, it will become less viscous and the flavors will become more apparent. Another name for this drink is a bone-dry gin martini."
        },
        {
          "headline":"Try it on the rocks.",
          "description":"On the rocks is a cocktail term that means served over ice. Place 2 or 3 ice cubes in an old-fashioned glass and pour your shot of gin over the ice. Before taking a sip, swirl the gin and ice cubes around in the glass a few times to help chill the gin. As always, sip the gin slowly. You can also use chilled whiskey stones instead of ice cubes. These are special rocks that you freeze, and that cool your drink without watering it down."
        }
      ]
    },
    {
      "name":"Pairing Gin with Other Flavors",
      "steps":[
        {
          "headline":"Mix a classic gin and tonic.",
          "description":"Tonic water is similar to soda water, except that it also has quinine, sugar, and a few other ingredients that give tonic a distinctive and slightly bitter flavor. To make a gin and tonic, combine in a tall glass:4 ice cubes\n2 ounces (60 ml) of gin\n4 ounces (118 ml) of chilled tonic water\n1 tablespoon (15 ml) of fresh lime juice\n1 lime wedge for garnish"
        },
        {
          "headline":"Add a bit of soda water.",
          "description":"Soda water is a great and simple way to make your gin last longer, add extra flavor profiles, and make the drink less strong. You can add a splash of soda water, have equal parts gin and soda water, or you can have your gin in a high ball and fill the glass the rest of the way with soda water. You can also pair your gin with citrus-infused soda. Lemon, lemon lime, grapefruit, and blood orange sodas are great additions to gin."
        },
        {
          "headline":"Try a splash of ginger ale.",
          "description":"Gin and ginger is a delicious combination, and the easiest way to pair the two flavors is with ginger ale. Fill a tall glass with 4 or 5 ice cubes, pour in 1½ ounces (44 ml) of gin, and fill the glass the rest of the way with ginger ale. For an extra ginger kick, garnish the glass with a piece of candied ginger."
        },
        {
          "headline":"Finish gin with citrus.",
          "description":"Many gins have citrusy aromas like lemon and grapefruit, while some others are floral and have hints of rose, lavender, and other blossoms. These gins include Bloom, Hendrick’s, and Bombay Sapphire. Citrusy and floral gins can be paired with citrus, including:\nGarnished with a twist of lemon rind or a wedge of citrus\nFinished with a squeeze of fresh citrus juice\nCombined with lemon bitters, citrus-flavored tonic, or a citrus soda"
        },
        {
          "headline":"Add herbs to herbaceous gins.",
          "description":"You don’t have to drink gin neat or chilled, and you can also add other ingredients to the drink to complement or contrast the aromas of the alcohol. For herbaceous gins, such as Portobello Road, that taste or smell of herbs, you can serve the gin with:\nA sprig of fresh rosemary or thyme\nFresh mint\nA few basil leaves\nFresh sage\nAn herb-flavored tonic"
        },
        {
          "headline":"Infuse your gin with tea.",
          "description":"Pour a full bottle of gin into a large glass bowl. Add 4 Earl Grey or chamomile tea bags and let the mixture steep for at least 2 hours at room temperature. Remove the tea bags and pour the gin back into the bottle. You can use this tea-infused gin for:\nCocktails\nGin and tonics\nMartinis\nDrinking neat, up, or on the rocks"
        }
      ]
    },
    {
      "name":"Mixing Gin-Based Cocktails",
      "steps":[
        {
          "headline":"Have a gin martini.",
          "description":"A gin martini is a great way to sample different gins, and the trick is to make a relatively neutral martini that allows the flavors of the gin to shine. To make a martini that works with any gin, stir 2½ ounces (74 ml) of gin, 1/2 ounce (15 ml) of dry vermouth, and a dash of orange bitters (optional) with ice in a mixing vessel for 20-30 seconds. Fine-strain the mixture in a chilled martini glass and garnish it with an olive or lemon twist."
        },
        {
          "headline":"Try a Long Island iced tea.",
          "description":"This is a classic cocktail that features gin and a variety of other alcohols. To make this delicious drink, stir together in a tall glass 1/2 ounce (15 mL) each of gin, white rum, white tequila, vodka, clear orange liqueur, simple syrup, fresh lemon juice, and cola. Add ice and enjoy!To make simple syrup, combine ¼ cup (56 g) of sugar and ¼ cup (59 ml) of water in a small saucepan. Simmer over medium heat until the sugar is dissolved. Remove the pan from the heat and set it aside to cool."
        },
        {
          "headline":"Mix yourself a gin Caesar.",
          "description":"A Caesar is a spicy tomato-based cocktail that can be made with either gin or vodka. To make this drink, start by coating the rim of a tall glass with celery salt or steak seasoning. Add a few ice cubes to the glass, and then pour in:\n2 ounces (59 ml) of gin\n6 ounces (177 ml) of Caesar mix or clamato juice\n3 dashes each of Worcestershire and hot sauce\n1 dash of olive brine\nJuice from half a lime\nSalt and pepper\nGarnish the drink with olives and a celery stick"
        }
      ]
    }
  ],
  "text":" Enjoying Gin on Its Own Drink gin neat. Drinking a spirit neat means you drink it without any additional preparation. This means no chilling, no ice, and no mix. To enjoy gin this way, pour a standard shot, which is 1½ ounces (44 ml), of gin into an old fashioned cocktail glass. Drink the gin slowly and in small sips so you can appreciate the flavors. Modern gins are brewed in a variety of ways and with many different ingredients. Flavors you may taste when you sip your gin include florals, berries, citrus hints, and herbs. An old fashioned cocktail glass is a short and wide glass that holds 6 to 8 ounces (177 to 237 ml) of liquid. Have it up. When you order a drink up, it means you want it chilled but served without ice. To do this, pour a shot of gin into a martini shaker filled with ice. Put on the lid and shake the gin thoroughly to combine it with the ice. Remove the lid, leaving the strainer on the martini shaker, and pour the gin into your cocktail glass. Enjoy the gin slowly, and try to pick out the flavors that make the gin unique. Instead of chilling the gin with ice cubes, you can also freeze the bottle for a few hours to chill it. While the alcohol won’t freeze, it will make the gin a little thicker. As the gin warms, it will become less viscous and the flavors will become more apparent. Another name for this drink is a bone-dry gin martini. Try it on the rocks. On the rocks is a cocktail term that means served over ice. Place 2 or 3 ice cubes in an old-fashioned glass and pour your shot of gin over the ice. Before taking a sip, swirl the gin and ice cubes around in the glass a few times to help chill the gin. As always, sip the gin slowly. You can also use chilled whiskey stones instead of ice cubes. These are special rocks that you freeze, and that cool your drink without watering it down. Pairing Gin with Other Flavors Mix a classic gin and tonic. Tonic water is similar to soda water, except that it also has quinine, sugar, and a few other ingredients that give tonic a distinctive and slightly bitter flavor. To make a gin and tonic, combine in a tall glass:4 ice cubes\n2 ounces (60 ml) of gin\n4 ounces (118 ml) of chilled tonic water\n1 tablespoon (15 ml) of fresh lime juice\n1 lime wedge for garnish Add a bit of soda water. Soda water is a great and simple way to make your gin last longer, add extra flavor profiles, and make the drink less strong. You can add a splash of soda water, have equal parts gin and soda water, or you can have your gin in a high ball and fill the glass the rest of the way with soda water. You can also pair your gin with citrus-infused soda. Lemon, lemon lime, grapefruit, and blood orange sodas are great additions to gin. Try a splash of ginger ale. Gin and ginger is a delicious combination, and the easiest way to pair the two flavors is with ginger ale. Fill a tall glass with 4 or 5 ice cubes, pour in 1½ ounces (44 ml) of gin, and fill the glass the rest of the way with ginger ale. For an extra ginger kick, garnish the glass with a piece of candied ginger. Finish gin with citrus. Many gins have citrusy aromas like lemon and grapefruit, while some others are floral and have hints of rose, lavender, and other blossoms. These gins include Bloom, Hendrick’s, and Bombay Sapphire. Citrusy and floral gins can be paired with citrus, including:\nGarnished with a twist of lemon rind or a wedge of citrus\nFinished with a squeeze of fresh citrus juice\nCombined with lemon bitters, citrus-flavored tonic, or a citrus soda Add herbs to herbaceous gins. You don’t have to drink gin neat or chilled, and you can also add other ingredients to the drink to complement or contrast the aromas of the alcohol. For herbaceous gins, such as Portobello Road, that taste or smell of herbs, you can serve the gin with:\nA sprig of fresh rosemary or thyme\nFresh mint\nA few basil leaves\nFresh sage\nAn herb-flavored tonic Infuse your gin with tea. Pour a full bottle of gin into a large glass bowl. Add 4 Earl Grey or chamomile tea bags and let the mixture steep for at least 2 hours at room temperature. Remove the tea bags and pour the gin back into the bottle. You can use this tea-infused gin for:\nCocktails\nGin and tonics\nMartinis\nDrinking neat, up, or on the rocks Mixing Gin-Based Cocktails Have a gin martini. A gin martini is a great way to sample different gins, and the trick is to make a relatively neutral martini that allows the flavors of the gin to shine. To make a martini that works with any gin, stir 2½ ounces (74 ml) of gin, 1/2 ounce (15 ml) of dry vermouth, and a dash of orange bitters (optional) with ice in a mixing vessel for 20-30 seconds. Fine-strain the mixture in a chilled martini glass and garnish it with an olive or lemon twist. Try a Long Island iced tea. This is a classic cocktail that features gin and a variety of other alcohols. To make this delicious drink, stir together in a tall glass 1/2 ounce (15 mL) each of gin, white rum, white tequila, vodka, clear orange liqueur, simple syrup, fresh lemon juice, and cola. Add ice and enjoy!To make simple syrup, combine ¼ cup (56 g) of sugar and ¼ cup (59 ml) of water in a small saucepan. Simmer over medium heat until the sugar is dissolved. Remove the pan from the heat and set it aside to cool. Mix yourself a gin Caesar. A Caesar is a spicy tomato-based cocktail that can be made with either gin or vodka. To make this drink, start by coating the rim of a tall glass with celery salt or steak seasoning. Add a few ice cubes to the glass, and then pour in:\n2 ounces (59 ml) of gin\n6 ounces (177 ml) of Caesar mix or clamato juice\n3 dashes each of Worcestershire and hot sauce\n1 dash of olive brine\nJuice from half a lime\nSalt and pepper\nGarnish the drink with olives and a celery stick",
  "tyn_model":[
    "gin",
    "ice cubes",
    "soda water",
    "ice",
    "herbs",
    "sugar",
    "ginger ale",
    "tall glass",
    "citrus",
    "old fashioned cocktail glass",
    "martini shaker",
    "ginger",
    "tea bags",
    "gin martini",
    "vodka",
    "simple syrup",
    "gins",
    "berries",
    "strainer",
    "cocktail glass",
    "old-fashioned glass",
    "tonic water",
    "tall glass:4",
    "chilled tonic water",
    "fresh lime juice",
    "blood orange sodas",
    "bombay sapphire",
    "lemon",
    "citrus juice",
    "lemon bitters",
    "citrus soda",
    "thyme",
    "mint",
    "basil",
    "sage",
    "herb-flavored tonic",
    "tea",
    "large glass bowl",
    "earl grey or",
    "dry vermouth",
    "orange bitters",
    "mixing vessel",
    "chilled martini glass",
    "iced tea",
    "white rum",
    "white tequila",
    "clear orange liqueur",
    "fresh lemon juice",
    "cola",
    "water",
    "small saucepan",
    "celery salt",
    "steak seasoning",
    "caesar mix",
    "clamato juice",
    "worcestershire and hot sauce",
    "olive brine",
    "lime",
    "salt",
    "olives",
    "celery stick"
  ],
  "tyn_section":[

  ]
}