{
  "title":"How to Make Gulab Jamun (Indian Sweet) from Package Mix",
  "url":"https://www.wikihow.com/Make-Gulab-Jamun-(Indian-Sweet)-from-Package-Mix",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Desserts"
  ],
  "parts":[
    {
      "name":"Making the package jamuns",
      "steps":[
        {
          "headline":"Tip the package mix into a mixing bowl.",
          "description":""
        },
        {
          "headline":"Pour the milk into the package mix.",
          "description":"Stir to combine."
        },
        {
          "headline":"Take the dough out.",
          "description":"Knead it until it forms a smooth and soft dough."
        },
        {
          "headline":"Form the gulab jamun balls.",
          "description":"Coat your hands with ghee or oil, on both palms. Take small pieces of the dough and shape into balls. Continue forming a small, round and smooth jamun that has no cracks. Set aside on a plate or silicone sheet."
        },
        {
          "headline":"Continue until all of the dough has been used up.",
          "description":""
        },
        {
          "headline":"Heat oil or ghee in a deep frying pan or container.",
          "description":"Heat over medium to low heat."
        },
        {
          "headline":"Add the jamuns to heated oil.",
          "description":"Fry until golden brown."
        },
        {
          "headline":"Remove with a slotted spoon.",
          "description":"Allow the excess oil to drain onto kitchen paper towel. They're now ready to soak in the sugar syrup (see below)."
        }
      ]
    },
    {
      "name":"Making the sugar syrup",
      "steps":[
        {
          "headline":"Add the sugar and water in a pan.",
          "description":"Bring to the boil, then immediately switch down to a simmer."
        },
        {
          "headline":"Heat at a simmer for 5 minutes.",
          "description":"Stir the ingredients well to combine them and to help the sugar dissolve. Do not overheat it, or the syrup will turn into caramel. If it does begin to caramelize, though, all you have to do is to add a bit of water, stir the ingredients together, and heat it up again."
        }
      ]
    },
    {
      "name":"Preparing the gulab jamun dessert",
      "steps":[
        {
          "headline":"Allow the syrup to cool.",
          "description":"Then pour it into the serving dish. This dish must be deep enough to hold all of the jamuns (balls) and the syrup."
        },
        {
          "headline":"Add the jamuns to the syrup.",
          "description":""
        },
        {
          "headline":"Soak the jamuns in the sugar syrup for 30 minutes.",
          "description":"If you don't wish to wait this long, turn the jamuns in the syrup to at least coat them thoroughly in syrup before serving."
        },
        {
          "headline":"Serve.",
          "description":"The gulab jamun can be served cold or warmed slightly and served warm."
        }
      ]
    }
  ],
  "text":" Making the package jamuns Tip the package mix into a mixing bowl.  Pour the milk into the package mix. Stir to combine. Take the dough out. Knead it until it forms a smooth and soft dough. Form the gulab jamun balls. Coat your hands with ghee or oil, on both palms. Take small pieces of the dough and shape into balls. Continue forming a small, round and smooth jamun that has no cracks. Set aside on a plate or silicone sheet. Continue until all of the dough has been used up.  Heat oil or ghee in a deep frying pan or container. Heat over medium to low heat. Add the jamuns to heated oil. Fry until golden brown. Remove with a slotted spoon. Allow the excess oil to drain onto kitchen paper towel. They're now ready to soak in the sugar syrup (see below). Making the sugar syrup Add the sugar and water in a pan. Bring to the boil, then immediately switch down to a simmer. Heat at a simmer for 5 minutes. Stir the ingredients well to combine them and to help the sugar dissolve. Do not overheat it, or the syrup will turn into caramel. If it does begin to caramelize, though, all you have to do is to add a bit of water, stir the ingredients together, and heat it up again. Preparing the gulab jamun dessert Allow the syrup to cool. Then pour it into the serving dish. This dish must be deep enough to hold all of the jamuns (balls) and the syrup. Add the jamuns to the syrup.  Soak the jamuns in the sugar syrup for 30 minutes. If you don't wish to wait this long, turn the jamuns in the syrup to at least coat them thoroughly in syrup before serving. Serve. The gulab jamun can be served cold or warmed slightly and served warm.",
  "tyn_model":[
    "oil",
    "syrup",
    "sugar syrup",
    "gulab jamun",
    "ghee",
    "sugar",
    "water",
    "mixing bowl",
    "milk",
    "package mix",
    "plate",
    "deep frying pan",
    "slotted spoon",
    "kitchen paper towel",
    "pan",
    "serving dish"
  ],
  "tyn_section":[

  ]
}