{
  "title":"How to Bake Dark Chocolate Cookies",
  "url":"https://www.wikihow.com/Bake-Dark-Chocolate-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 190ºC/375ºF/Gas mark 5.",
      "description":""
    },
    {
      "headline":"Line the baking sheets with baking parchment.",
      "description":""
    },
    {
      "headline":"Chop the chocolate into small chunks.",
      "description":"Set aside until further use."
    },
    {
      "headline":"Melt the butter in a small saucepan over low heat.",
      "description":""
    },
    {
      "headline":"Combine the two kinds of sugar in a mixing bowl.",
      "description":""
    },
    {
      "headline":"Pour the melted butter over the combined sugar.",
      "description":"Mix with a wooden spoon."
    },
    {
      "headline":"Add the egg and the vanilla.",
      "description":"Blend well."
    },
    {
      "headline":"Sift the flour, baking powder and salt into the mixing bowl.",
      "description":"Stir them in."
    },
    {
      "headline":"Add the chopped chocolate.",
      "description":""
    },
    {
      "headline":"Scoop heaps of the mixture on the lined baking sheets using a pudding spoon.",
      "description":""
    },
    {
      "headline":"Leave plenty of space in between the cookies.",
      "description":"They spread out a lot while baking."
    },
    {
      "headline":"Bake for 8-10 minutes, until the cookies are just turning golden brown.",
      "description":""
    },
    {
      "headline":"Leave the cookies on the baking sheets to harden for a couple of minutes.",
      "description":""
    },
    {
      "headline":"Transfer them to a wire cooling rack and let them cool completely.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 190ºC/375ºF/Gas mark 5.  Line the baking sheets with baking parchment.  Chop the chocolate into small chunks. Set aside until further use. Melt the butter in a small saucepan over low heat.  Combine the two kinds of sugar in a mixing bowl.  Pour the melted butter over the combined sugar. Mix with a wooden spoon. Add the egg and the vanilla. Blend well. Sift the flour, baking powder and salt into the mixing bowl. Stir them in. Add the chopped chocolate.  Scoop heaps of the mixture on the lined baking sheets using a pudding spoon.  Leave plenty of space in between the cookies. They spread out a lot while baking. Bake for 8-10 minutes, until the cookies are just turning golden brown.  Leave the cookies on the baking sheets to harden for a couple of minutes.  Transfer them to a wire cooling rack and let them cool completely.  Finished. ",
  "tyn_model":[
    "baking sheets",
    "chocolate",
    "butter",
    "sugar",
    "mixing bowl",
    "oven",
    "baking parchment",
    "small saucepan",
    "wooden spoon",
    "vanilla",
    "flour",
    "baking powder",
    "salt",
    "pudding spoon"
  ],
  "tyn_section":[

  ]
}