{
  "title":"How to Make Semisweet Chocolate Chip Cookies",
  "url":"https://www.wikihow.com/Make-Semisweet-Chocolate-Chip-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Sift together the 2 and a half cups of flour with the 1 teaspoon baking soda and 1 teaspoon salt in a medium sized bowl.",
      "description":"Stir and set aside."
    },
    {
      "headline":"Beat together the sugars with the softened butter in a large bowl until creamy.",
      "description":""
    },
    {
      "headline":"Add the 2 teaspoons vanilla extract and the 2 eggs.",
      "description":"Mix well"
    },
    {
      "headline":"Add the dry ingredients and combine until just blended.",
      "description":""
    },
    {
      "headline":"Stir in the chocolate chips.",
      "description":""
    },
    {
      "headline":"Preheat the oven to 350 degrees.",
      "description":""
    },
    {
      "headline":"Drop heaping tablespoons of dough onto ungreased cookie sheets and bake for ten minutes, or until golden brown.",
      "description":""
    },
    {
      "headline":"Remove cookies onto cooling racks.",
      "description":""
    },
    {
      "headline":"Makes approximately 50 cookies.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Sift together the 2 and a half cups of flour with the 1 teaspoon baking soda and 1 teaspoon salt in a medium sized bowl. Stir and set aside. Beat together the sugars with the softened butter in a large bowl until creamy.  Add the 2 teaspoons vanilla extract and the 2 eggs. Mix well Add the dry ingredients and combine until just blended.  Stir in the chocolate chips.  Preheat the oven to 350 degrees.  Drop heaping tablespoons of dough onto ungreased cookie sheets and bake for ten minutes, or until golden brown.  Remove cookies onto cooling racks.  Makes approximately 50 cookies.  Finished. ",
  "tyn_model":[
    "flour",
    "baking soda",
    "salt",
    "medium sized bowl",
    "sugars",
    "butter",
    "large bowl",
    "vanilla extract",
    "eggs",
    "chocolate chips",
    "oven",
    "cookie sheets"
  ],
  "tyn_section":[

  ]
}