{
  "title":"How to Beat Grow Island",
  "url":"https://www.wikihow.com/Beat-Grow-Island",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Electronic Game Strategies",
    "Online Game Strategies"
  ],
  "methods":[
    {
      "name":"Beating Grow island (Traditional Ending)",
      "steps":[
        {
          "headline":"Navigate to http://www.hoodamath.com/games/growisland.html in a web browser.",
          "description":"This is the website where you can play Grow Island. You need to Install the Adobe Flash Player in order to play Grow Island."
        },
        {
          "headline":"Allow Adobe Flash Player to access your web browser.",
          "description":"If you see a grey screen that says \"Select for Adobe Flash\" or \"Run Adobe Flash\", click the center of the screen. A pop-up window will appear. Click the tab that says \"Allow\" or \"Allow Once\". If you are using Google Chrome, you will need to Enable Flash in the Settings menu."
        },
        {
          "headline":"Click English.",
          "description":"If you can't read the text on the screen, click English or the language of your choice."
        },
        {
          "headline":"Click Play.",
          "description":"It's in the center of the screen. The game will begin."
        },
        {
          "headline":"Click on the “Mechanical Engineering” icon.",
          "description":"This is the icon located to the far right that resembles a bolt. A single bolt will appear on the island."
        },
        {
          "headline":"Click on the “Civil Engineering” icon.",
          "description":"It's the icon that resembles a pickaxe. A little man will use the pickaxe to construct a road on the island."
        },
        {
          "headline":"Click on the “Architecture” icon.",
          "description":"It's the icon that resembles a pile of logs. The little man will use a paving machine to pave the dirt road. The logs will be placed on the cliffs on the right side of the island."
        },
        {
          "headline":"Click on the “Aeronautics” icon.",
          "description":"It's the icon that resembles a steering wheel. The little man will use a sword to carve a dock on the left side of the island. A small house will appear on the right side of the island."
        },
        {
          "headline":"Click on the “Environmental Engineering” icon.",
          "description":"It's the icon that resembles a red smokestack. The little man will build a river. He will then offer flowers to the woman living in the home. An automobile will appear on the island and start driving on the paved road, while the home grows larger in size."
        },
        {
          "headline":"Click on the “Electrical Engineering” icon.",
          "description":"It's the icon that resembles a red and white battery. The little man will bulldoze a tunnel into the mountain. A ship will land at the dock."
        },
        {
          "headline":"Click on the “Computer Science” icon.",
          "description":"It's the icon that resembles a microchip. A computer will appear near the top of the island. A railroad will be built through the tunnel. A rocket ship will also appear on the island."
        },
        {
          "headline":"Click on the “Applied Chemistry” icon.",
          "description":"It's the icon that resembles a Bunsen burner. The little man will enjoy a picnic lunch with his family while the island’s technology continues to improve. You have now achieved maximum points, and have beat Grow Island."
        },
        {
          "headline":"Wait for the regular Ending to appear.",
          "description":"A congratulations message will appear on screen."
        }
      ]
    },
    {
      "name":"Beating Grow Island (UFO Ending)",
      "steps":[
        {
          "headline":"Navigate to http://www.hoodamath.com/games/growisland.html in a web browser.",
          "description":"This is the website where you can play Grow Island. You need to Install the Adobe Flash Player in order to play Grow Island."
        },
        {
          "headline":"Allow Adobe Flash Player to access your web browser.",
          "description":"If you see a grey screen that says \"Select for Adobe Flash\" or \"Run Adobe Flash\", click the center of the screen. A pop-up window will appear. Click the tab that says \"Allow\" or \"Allow Once\". If you are using Google Chrome, you will need to Enable Flash in the Settings menu."
        },
        {
          "headline":"Click English.",
          "description":"If you can't read the text on the screen, click English or the language of your choice."
        },
        {
          "headline":"Click Play.",
          "description":"It's in the center of the screen. The game will begin."
        },
        {
          "headline":"Click on the “Aeronautics” icon.",
          "description":"It's the icon that resembles a steering wheel. A steering-wheel landing pad will appear on the left side of the island."
        },
        {
          "headline":"Click on the “Civil Engineering” icon.",
          "description":"It's the icon that resembles a pickaxe. A little man will use the pickaxe to create a dirt road."
        },
        {
          "headline":"Click on the “Architecture” icon.",
          "description":"It's the icon that resembles a pile of logs. A small pile of logs will appear on the right side of the island."
        },
        {
          "headline":"Click on the “Computer Science” icon.",
          "description":"It's the icon that resembles a microchip. A computer will appear near the top of the island. A woman and her home will replace the pile of logs."
        },
        {
          "headline":"Click on the “Electrical Engineering” icon.",
          "description":"It's the icon that resembles a red and white battery. A battery will appear near the dirt road. The man will build a river behind the house."
        },
        {
          "headline":"Click on the “Mechanical Engineering” icon.",
          "description":"It's the icon that resembles a bolt. The home will grow larger. The man will cut away a series of trees located to the left of the home."
        },
        {
          "headline":"Click on the “Applied Chemistry” icon.",
          "description":"It's the icon that resembles a Bunsen burner. A Bunsen burner will appear on the island. An alien ship will turn the man into a green alien. The house will also be converted into an alien-like space home."
        },
        {
          "headline":"Click on the “Environmental Engineering” icon.",
          "description":"It's the icon that resembles a smokestack. A group of aliens will teleport onto the dirt road, and start dancing. You have now achieved maximum points for the UFO ending, and have beat Grow Island."
        },
        {
          "headline":"Wait for the UFO Ending to appear.",
          "description":"A congratu-alien-s message will appear on screen."
        }
      ]
    }
  ],
  "text":" Beating Grow island (Traditional Ending) Navigate to http://www.hoodamath.com/games/growisland.html in a web browser. This is the website where you can play Grow Island. You need to Install the Adobe Flash Player in order to play Grow Island. Allow Adobe Flash Player to access your web browser. If you see a grey screen that says \"Select for Adobe Flash\" or \"Run Adobe Flash\", click the center of the screen. A pop-up window will appear. Click the tab that says \"Allow\" or \"Allow Once\". If you are using Google Chrome, you will need to Enable Flash in the Settings menu. Click English. If you can't read the text on the screen, click English or the language of your choice. Click Play. It's in the center of the screen. The game will begin. Click on the “Mechanical Engineering” icon. This is the icon located to the far right that resembles a bolt. A single bolt will appear on the island. Click on the “Civil Engineering” icon. It's the icon that resembles a pickaxe. A little man will use the pickaxe to construct a road on the island. Click on the “Architecture” icon. It's the icon that resembles a pile of logs. The little man will use a paving machine to pave the dirt road. The logs will be placed on the cliffs on the right side of the island. Click on the “Aeronautics” icon. It's the icon that resembles a steering wheel. The little man will use a sword to carve a dock on the left side of the island. A small house will appear on the right side of the island. Click on the “Environmental Engineering” icon. It's the icon that resembles a red smokestack. The little man will build a river. He will then offer flowers to the woman living in the home. An automobile will appear on the island and start driving on the paved road, while the home grows larger in size. Click on the “Electrical Engineering” icon. It's the icon that resembles a red and white battery. The little man will bulldoze a tunnel into the mountain. A ship will land at the dock. Click on the “Computer Science” icon. It's the icon that resembles a microchip. A computer will appear near the top of the island. A railroad will be built through the tunnel. A rocket ship will also appear on the island. Click on the “Applied Chemistry” icon. It's the icon that resembles a Bunsen burner. The little man will enjoy a picnic lunch with his family while the island’s technology continues to improve. You have now achieved maximum points, and have beat Grow Island. Wait for the regular Ending to appear. A congratulations message will appear on screen. Beating Grow Island (UFO Ending) Navigate to http://www.hoodamath.com/games/growisland.html in a web browser. This is the website where you can play Grow Island. You need to Install the Adobe Flash Player in order to play Grow Island. Allow Adobe Flash Player to access your web browser. If you see a grey screen that says \"Select for Adobe Flash\" or \"Run Adobe Flash\", click the center of the screen. A pop-up window will appear. Click the tab that says \"Allow\" or \"Allow Once\". If you are using Google Chrome, you will need to Enable Flash in the Settings menu. Click English. If you can't read the text on the screen, click English or the language of your choice. Click Play. It's in the center of the screen. The game will begin. Click on the “Aeronautics” icon. It's the icon that resembles a steering wheel. A steering-wheel landing pad will appear on the left side of the island. Click on the “Civil Engineering” icon. It's the icon that resembles a pickaxe. A little man will use the pickaxe to create a dirt road. Click on the “Architecture” icon. It's the icon that resembles a pile of logs. A small pile of logs will appear on the right side of the island. Click on the “Computer Science” icon. It's the icon that resembles a microchip. A computer will appear near the top of the island. A woman and her home will replace the pile of logs. Click on the “Electrical Engineering” icon. It's the icon that resembles a red and white battery. A battery will appear near the dirt road. The man will build a river behind the house. Click on the “Mechanical Engineering” icon. It's the icon that resembles a bolt. The home will grow larger. The man will cut away a series of trees located to the left of the home. Click on the “Applied Chemistry” icon. It's the icon that resembles a Bunsen burner. A Bunsen burner will appear on the island. An alien ship will turn the man into a green alien. The house will also be converted into an alien-like space home. Click on the “Environmental Engineering” icon. It's the icon that resembles a smokestack. A group of aliens will teleport onto the dirt road, and start dancing. You have now achieved maximum points for the UFO ending, and have beat Grow Island. Wait for the UFO Ending to appear. A congratu-alien-s message will appear on screen.",
  "tyn_model":[
    "” icon",
    "logs",
    "adobe flash",
    "pickaxe",
    "adobe flash player",
    "bunsen burner",
    "grow island",
    "“mechanical",
    "“civil",
    "“architecture",
    "“aeronautics",
    "“environmental",
    "“electrical",
    "“computer",
    "computer",
    "“applied",
    "google chrome",
    "sword",
    "flowers",
    "automobile",
    "railroad",
    "rocket ship",
    "aliens"
  ],
  "tyn_section":[

  ]
}