{
  "title":"How to Make Vegan Ceviche",
  "url":"https://www.wikihow.com/Make-Vegan-Ceviche",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "steps":[
    {
      "headline":"Finely chop the cauliflower.",
      "description":"It's the substitute for tilapia or seafood."
    },
    {
      "headline":"Place the chopped cauliflower into a steamer and steam for about 20 minutes until it is soft.",
      "description":""
    },
    {
      "headline":"Drain any liquid from the steamed cauliflower and put into a medium bowl.",
      "description":""
    },
    {
      "headline":"Pour 1 cup of lime juice over the cauliflower.",
      "description":"You should squeeze about 8 limes to get 1 cup of lime juice."
    },
    {
      "headline":"Mix the cauliflower and juice gently to combine the flavors.",
      "description":""
    },
    {
      "headline":"Cover the bowl with plastic wrap and refrigerate for about 20 minutes.",
      "description":""
    },
    {
      "headline":"Remove the cauliflower from the refrigerator when the lime juice has been absorbed by the cauliflower.",
      "description":""
    },
    {
      "headline":"Pour any remaining lime juice from the bowl and discard.",
      "description":""
    },
    {
      "headline":"Gently squeeze the cauliflower with your hands (if you're wearing gloves) or press into it gently with a wooden spoon.",
      "description":""
    },
    {
      "headline":"Discard the lime juice you have squeezed from the cauliflower.",
      "description":""
    },
    {
      "headline":"Add ½ cup of seeded chopped tomato, ½ of a peeled, seeded, and diced cucumber, ½ cup of chopped onion, and ¼ cup of chopped fresh cilantro to the mixture.",
      "description":""
    },
    {
      "headline":"Season the mixture with salt and pepper to taste.",
      "description":""
    },
    {
      "headline":"Add ½ cup of finely sliced Jicama, 1 tbsp.",
      "description":"of hot sauce, and 1 diced serrano chili to the mixture."
    },
    {
      "headline":"Spread 4 tbsp.",
      "description":"of mayonnaise over the 6 tostadas."
    },
    {
      "headline":"Evenly spread the cauliflower ceviche onto each of the tostadas.",
      "description":""
    },
    {
      "headline":"Arrange the slices of 1 sliced avocado on top of the ceviche tostadas and serve this delicious dish with a wedge of lime.",
      "description":""
    }
  ],
  "text":" Finely chop the cauliflower. It's the substitute for tilapia or seafood. Place the chopped cauliflower into a steamer and steam for about 20 minutes until it is soft.  Drain any liquid from the steamed cauliflower and put into a medium bowl.  Pour 1 cup of lime juice over the cauliflower. You should squeeze about 8 limes to get 1 cup of lime juice. Mix the cauliflower and juice gently to combine the flavors.  Cover the bowl with plastic wrap and refrigerate for about 20 minutes.  Remove the cauliflower from the refrigerator when the lime juice has been absorbed by the cauliflower.  Pour any remaining lime juice from the bowl and discard.  Gently squeeze the cauliflower with your hands (if you're wearing gloves) or press into it gently with a wooden spoon.  Discard the lime juice you have squeezed from the cauliflower.  Add ½ cup of seeded chopped tomato, ½ of a peeled, seeded, and diced cucumber, ½ cup of chopped onion, and ¼ cup of chopped fresh cilantro to the mixture.  Season the mixture with salt and pepper to taste.  Add ½ cup of finely sliced Jicama, 1 tbsp. of hot sauce, and 1 diced serrano chili to the mixture. Spread 4 tbsp. of mayonnaise over the 6 tostadas. Evenly spread the cauliflower ceviche onto each of the tostadas.  Arrange the slices of 1 sliced avocado on top of the ceviche tostadas and serve this delicious dish with a wedge of lime. ",
  "tyn_model":[
    "cauliflower",
    "lime juice",
    "bowl",
    "lime",
    "seafood",
    "steamer",
    "medium bowl",
    "plastic wrap",
    "refrigerator",
    "wooden spoon",
    "tomato",
    "cucumber",
    "onion",
    "cilantro",
    "salt and pepper",
    "jicama",
    "hot sauce",
    "serrano chili",
    "mayonnaise",
    "cauliflower ceviche",
    "avocado"
  ],
  "tyn_section":[

  ]
}