{
  "title":"How to Make Italian‐Style Ramen",
  "url":"https://www.wikihow.com/Make-Italian%E2%80%90Style-Ramen",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Ramen Dishes"
  ],
  "steps":[
    {
      "headline":"Heat the water, butter, and oil in a large pot.",
      "description":"Sprinkle black pepper to taste. Turn the heat up to high and let it boil."
    },
    {
      "headline":"Reduce the heat to medium, letting the mixture simmer.",
      "description":"Fold in the cheese and dry noodles and stir around carefully with a wooden spoon. Keep mixing until there are no more clumps or brick-sized pieces from the cheese and noodles."
    },
    {
      "headline":"Cover the pot with a lid.",
      "description":"Cook the ramen noodles for about four minutes until most of the liquid disappears and the noodles cook fully. The noodles will start to look cheesy and glossy when they have finished cooking."
    },
    {
      "headline":"Stir in the sauce and parsley if desired.",
      "description":"Mix with a wooden spoon."
    },
    {
      "headline":"Serve.",
      "description":"Use tongs to serve the ramen noodles in a serving bowl. Add extra parsley if desired. Enjoy!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Heat the water, butter, and oil in a large pot. Sprinkle black pepper to taste. Turn the heat up to high and let it boil. Reduce the heat to medium, letting the mixture simmer. Fold in the cheese and dry noodles and stir around carefully with a wooden spoon. Keep mixing until there are no more clumps or brick-sized pieces from the cheese and noodles. Cover the pot with a lid. Cook the ramen noodles for about four minutes until most of the liquid disappears and the noodles cook fully. The noodles will start to look cheesy and glossy when they have finished cooking. Stir in the sauce and parsley if desired. Mix with a wooden spoon. Serve. Use tongs to serve the ramen noodles in a serving bowl. Add extra parsley if desired. Enjoy! Finished. ",
  "tyn_model":[
    "wooden spoon",
    "ramen noodles",
    "parsley",
    "water",
    "butter",
    "oil",
    "large pot",
    "black pepper",
    "pot",
    "serving bowl"
  ],
  "tyn_section":[

  ]
}