{
  "title":"How to Make a Trading Card Game",
  "url":"https://www.wikihow.com/Make-a-Trading-Card-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Plan out the name of your trading card game.",
      "description":"It has to be an interesting name so that people will want to play it. The name should be catchy and original, so people will want to play your game. (Don't use other card game names, like Yu-Gi-Oh! or Pokémon)"
    },
    {
      "headline":"Come up with a basic genre for your game.",
      "description":"Science fiction, space, fantasy, western, past, future, are a few examples."
    },
    {
      "headline":"Come up with a unique background and story.",
      "description":"You should base the rules on the background and story, not the other way around. So this step must come before the rules"
    },
    {
      "headline":"Plan the game.",
      "description":"Make a good set of rules and an exciting objective. The rules have to be balanced its not too easy its not too complicated. It's no fun playing a card game when there are no rules or too many rules to follow. If the rules are too strict, people won't be free to make some of their own decisions during play. Many games have different rules. Some are strict whereas others can be looser. Experiment, and see what is right for you. When planning the game, you must come up with a good playing field. You might as well think of how turns will be lost or gained, how to win the game, and more."
    },
    {
      "headline":"Think of various types of cards.",
      "description":"There definitely must be a very wide assortment of characters. Power-ups, bonuses and health are also several cards that can make a card game more interesting. You can also make \"rule-bending\" cards that change the rules. Don't make too many types of cards or it will be confusing and also try to avoid making two very similar types of cards. This makes your card game more interesting. These cards may be grouped into types, elements, or classes if the creator desires. These cards must have graphics. Few people would like to play a card game by just looking at words on a card. Hire an artist if you need."
    },
    {
      "headline":"Come up with a good and relevant time period.",
      "description":"It would have been a bit confusing if the creator of Yu-Gi-Oh! called his game \"A Time in Modern Rome\" for a time period. If your game has many different creatures from different time periods, this step is irrelevant. You can write your rules on a tiny notebook or on scrap paper and then type it in your computer and then print it. Make a good background story. This will make your game more colorful. Unique themes will be especially attractive."
    },
    {
      "headline":"Get a program such as MS Paint and a tablet.",
      "description":"Photoshop is a recommended choice. Draw out your templates on the program, then write on the card the abilities, colour, attack power, name etc... You may also draw the cards by hand, but this is extremely time consuming."
    },
    {
      "headline":"Either print out the templates on card or paper, then get your artist to draw on them, or use a tablet to draw them on your computer.",
      "description":"Card sleeves are a good alternative if you don't want to laminate the cards. It's a good idea to have a binder or portfolio to keep your cards in. Print your cards/card template on card stock or print it on regular paper and paste it onto something hard. Print on photo paper, if possible. The paper is stiffer, the colors are more vivid, and you can get a nice gloss effect. Glue your cards onto cardboard, or use special printing paper. If the cards are made of paper, laminate them. This way they can't rip as easily. Put your trading cards in a wrapper. If you can't find a good one, use cheap envelopes with a cool design. Make some designs different from the others."
    },
    {
      "headline":"Play it with your friends and have fun!",
      "description":"Don't make yourself the invincible boss of the game. It would be unfair if you make 100 copies of the most powerful cards for yourself. It ruins the fun of the game. Be ready to change the rules as you all learn and have fun."
    }
  ],
  "text":" Plan out the name of your trading card game. It has to be an interesting name so that people will want to play it. The name should be catchy and original, so people will want to play your game. (Don't use other card game names, like Yu-Gi-Oh! or Pokémon) Come up with a basic genre for your game. Science fiction, space, fantasy, western, past, future, are a few examples. Come up with a unique background and story. You should base the rules on the background and story, not the other way around. So this step must come before the rules Plan the game. Make a good set of rules and an exciting objective. The rules have to be balanced its not too easy its not too complicated. It's no fun playing a card game when there are no rules or too many rules to follow. If the rules are too strict, people won't be free to make some of their own decisions during play. Many games have different rules. Some are strict whereas others can be looser. Experiment, and see what is right for you. When planning the game, you must come up with a good playing field. You might as well think of how turns will be lost or gained, how to win the game, and more. Think of various types of cards. There definitely must be a very wide assortment of characters. Power-ups, bonuses and health are also several cards that can make a card game more interesting. You can also make \"rule-bending\" cards that change the rules. Don't make too many types of cards or it will be confusing and also try to avoid making two very similar types of cards. This makes your card game more interesting. These cards may be grouped into types, elements, or classes if the creator desires. These cards must have graphics. Few people would like to play a card game by just looking at words on a card. Hire an artist if you need. Come up with a good and relevant time period. It would have been a bit confusing if the creator of Yu-Gi-Oh! called his game \"A Time in Modern Rome\" for a time period. If your game has many different creatures from different time periods, this step is irrelevant. You can write your rules on a tiny notebook or on scrap paper and then type it in your computer and then print it. Make a good background story. This will make your game more colorful. Unique themes will be especially attractive. Get a program such as MS Paint and a tablet. Photoshop is a recommended choice. Draw out your templates on the program, then write on the card the abilities, colour, attack power, name etc... You may also draw the cards by hand, but this is extremely time consuming. Either print out the templates on card or paper, then get your artist to draw on them, or use a tablet to draw them on your computer. Card sleeves are a good alternative if you don't want to laminate the cards. It's a good idea to have a binder or portfolio to keep your cards in. Print your cards/card template on card stock or print it on regular paper and paste it onto something hard. Print on photo paper, if possible. The paper is stiffer, the colors are more vivid, and you can get a nice gloss effect. Glue your cards onto cardboard, or use special printing paper. If the cards are made of paper, laminate them. This way they can't rip as easily. Put your trading cards in a wrapper. If you can't find a good one, use cheap envelopes with a cool design. Make some designs different from the others. Play it with your friends and have fun! Don't make yourself the invincible boss of the game. It would be unfair if you make 100 copies of the most powerful cards for yourself. It ruins the fun of the game. Be ready to change the rules as you all learn and have fun.",
  "tyn_model":[
    "trading card game",
    "card game",
    "ms paint",
    "photoshop",
    "card stock",
    "paper",
    "cardboard",
    "trading cards"
  ],
  "tyn_section":[

  ]
}