{
  "title":"How to Make Enemies Bigger on Super Mario Maker for Wii U",
  "url":"https://www.wikihow.com/Make-Enemies-Bigger-on-Super-Mario-Maker-for-Wii-U",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Wii U"
  ],
  "steps":[
    {
      "headline":"Open up your Super Mario Maker game for the Wii U.",
      "description":""
    },
    {
      "headline":"When at the home screen, click on the \"Make\" button.",
      "description":"You are now in design mode. From this mode you can now start designing your level."
    },
    {
      "headline":"Find an enemy that looks interesting and drag it onto your course.",
      "description":""
    },
    {
      "headline":"While still in design view, drag a mushroom from your inventory and put it on top of the enemy that you wish to make bigger, and then release.",
      "description":"The enemy that you dropped the mushroom on will now be larger. You can only use one mushroom on an enemy. If you try to drag another mushroom onto the enemy, it will temporarily become larger and then sneeze, which drops out the second mushroom and returns the enemy to it's previous size."
    }
  ],
  "text":" Open up your Super Mario Maker game for the Wii U.  When at the home screen, click on the \"Make\" button. You are now in design mode. From this mode you can now start designing your level. Find an enemy that looks interesting and drag it onto your course.  While still in design view, drag a mushroom from your inventory and put it on top of the enemy that you wish to make bigger, and then release. The enemy that you dropped the mushroom on will now be larger. You can only use one mushroom on an enemy. If you try to drag another mushroom onto the enemy, it will temporarily become larger and then sneeze, which drops out the second mushroom and returns the enemy to it's previous size.",
  "tyn_model":[
    "mushroom",
    "super mario maker",
    "wii u."
  ],
  "tyn_section":[

  ]
}