{
  "title":"How to Hoard Food for an Emergency",
  "url":"https://www.wikihow.com/Hoard-Food-for-an-Emergency",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness",
    "Hazard Survival Equipment"
  ],
  "parts":[
    {
      "name":"Planning What to Buy",
      "steps":[
        {
          "headline":"Get an overview of which foods you want to hoard.",
          "description":"Keep dietary needs, food preferences and special conditions of you and your family in mind. Ideally, the foods should be shelf-stable and require no refrigeration. Planning emergency meals in advance can save money since you can keep an eye out for deals and coupons and buy some of the supplies at warehouse stores. Good options for emergency food include ready-to-eat canned meats, fruits, and vegetables (with a can opener), fruit bars and protein bars, dry cereals or granola or other grains, peanut butter, dried fruit, canned juices, and non-perishable milk (the kind that doesn't require refrigeration), and cooking oil if needed."
        },
        {
          "headline":"Build up your stash gradually if needed.",
          "description":"If you're able to, you can always buy a large amount of food at once. But if you can't do this, don't neglect the need for emergency supplies. Begin buying just a few more of these food items that you regularly consume, and just make sure it's non-perishable."
        }
      ]
    },
    {
      "name":"Buying the Goods",
      "steps":[
        {
          "headline":"Look for deals.",
          "description":"Look online and in grocery catalogs for coupons, promo codes, and offers for certain brands of food or deals on bulk buys, such as 10 for 10, Buy 1 Get 1 Free, or Buy 1 get 50% off, etc. Shop around for the best prices and use coupons. The money saved can go elsewhere for an emergency. Skip the fresh fruit, bread, cakes, etc. You won't need fresh items for your emergency supplies, so go to a shop that sells canned foods and drinks. Going to a bulk store such as Bulk Market or Sam’s Club is a good idea. You can save even more by having a membership at those stores (if applicable)."
        },
        {
          "headline":"Be picky about which items you buy, what their expiration date is, and how they're contained.",
          "description":"Select cans and tins from the back of the shelf with expiration dates in the far future. Avoid picking up cans that are damaged, expire in the next few months, cannot be opened by safe means or have dents. Those cans could be unsafe to open or contaminated by bacteria and unfit for consumption. Nothing is worse than getting canned and tinned food and discovering that it can’t be eaten. Choose bagged food for easy use. They may have a plastic zipper that can be pulled or cut off. Large bags of dried beans and rice can be bought in bulk for reasonable prices and be sorted into smaller portions for future use."
        },
        {
          "headline":"Don't forget the liquids!",
          "description":"Safe water is going to be crucially important in many emergencies, not just for drinking but for cooking and washing, too. Buy plenty of bottles of water, dry milk, drink powder and baby formula (if applicable)."
        },
        {
          "headline":"Consider other food-related supplies.",
          "description":"You may want disposable dishes and plastic utensils that can be used and thrown away in case water isn’t available or is contaminated. Paper cups or individual water bottles can help you portion out water safely, without contaminating large jugs/bottles. Toilet paper may be advantageous."
        },
        {
          "headline":"Make sure you have enough food to last your entire family at least three days.",
          "description":"Ideally, get much more. Again, consider special conditions, dietary needs, and special preferences."
        }
      ]
    },
    {
      "name":"Storing Your Food",
      "steps":[
        {
          "headline":"Consider your current storage space and limitations.",
          "description":"Most foods and bottled water will benefit from being stored in a cool, dark, dry place. You'll want it to be easily accessible, too. For many people, a basement or garage works well. Put the cans in a crate and wrap the crate with sturdy mesh to keep dust, moisture, and critters out. Label the type of food item and the date you bought it and the expiration date with permanent marker and set it in a cool, dry area."
        },
        {
          "headline":"Aim for organization.",
          "description":"Keep your food organized so you know how/when to rotate the items in your stock. Arrange canned and tinned food by expiration date, type and/or size. You'll want to check your storage area often for damaged or expired food. It’s a good idea to eat the food before it expires to avoid wasting money."
        },
        {
          "headline":"Use and replace some of your supply over time.",
          "description":"Don't just forget all about it once you've bought it. Be sure to revolve your holdings by always consuming the oldest stock you have instead of trashing it. When you feel you have an adequate hoard, you can taper off by only buying enough to replace your regular consumption."
        }
      ]
    }
  ],
  "text":" Planning What to Buy Get an overview of which foods you want to hoard. Keep dietary needs, food preferences and special conditions of you and your family in mind. Ideally, the foods should be shelf-stable and require no refrigeration. Planning emergency meals in advance can save money since you can keep an eye out for deals and coupons and buy some of the supplies at warehouse stores. Good options for emergency food include ready-to-eat canned meats, fruits, and vegetables (with a can opener), fruit bars and protein bars, dry cereals or granola or other grains, peanut butter, dried fruit, canned juices, and non-perishable milk (the kind that doesn't require refrigeration), and cooking oil if needed. Build up your stash gradually if needed. If you're able to, you can always buy a large amount of food at once. But if you can't do this, don't neglect the need for emergency supplies. Begin buying just a few more of these food items that you regularly consume, and just make sure it's non-perishable. Buying the Goods Look for deals. Look online and in grocery catalogs for coupons, promo codes, and offers for certain brands of food or deals on bulk buys, such as 10 for 10, Buy 1 Get 1 Free, or Buy 1 get 50% off, etc. Shop around for the best prices and use coupons. The money saved can go elsewhere for an emergency. Skip the fresh fruit, bread, cakes, etc. You won't need fresh items for your emergency supplies, so go to a shop that sells canned foods and drinks. Going to a bulk store such as Bulk Market or Sam’s Club is a good idea. You can save even more by having a membership at those stores (if applicable). Be picky about which items you buy, what their expiration date is, and how they're contained. Select cans and tins from the back of the shelf with expiration dates in the far future. Avoid picking up cans that are damaged, expire in the next few months, cannot be opened by safe means or have dents. Those cans could be unsafe to open or contaminated by bacteria and unfit for consumption. Nothing is worse than getting canned and tinned food and discovering that it can’t be eaten. Choose bagged food for easy use. They may have a plastic zipper that can be pulled or cut off. Large bags of dried beans and rice can be bought in bulk for reasonable prices and be sorted into smaller portions for future use. Don't forget the liquids! Safe water is going to be crucially important in many emergencies, not just for drinking but for cooking and washing, too. Buy plenty of bottles of water, dry milk, drink powder and baby formula (if applicable). Consider other food-related supplies. You may want disposable dishes and plastic utensils that can be used and thrown away in case water isn’t available or is contaminated. Paper cups or individual water bottles can help you portion out water safely, without contaminating large jugs/bottles. Toilet paper may be advantageous. Make sure you have enough food to last your entire family at least three days. Ideally, get much more. Again, consider special conditions, dietary needs, and special preferences. Storing Your Food Consider your current storage space and limitations. Most foods and bottled water will benefit from being stored in a cool, dark, dry place. You'll want it to be easily accessible, too. For many people, a basement or garage works well. Put the cans in a crate and wrap the crate with sturdy mesh to keep dust, moisture, and critters out. Label the type of food item and the date you bought it and the expiration date with permanent marker and set it in a cool, dry area. Aim for organization. Keep your food organized so you know how/when to rotate the items in your stock. Arrange canned and tinned food by expiration date, type and/or size. You'll want to check your storage area often for damaged or expired food. It’s a good idea to eat the food before it expires to avoid wasting money. Use and replace some of your supply over time. Don't just forget all about it once you've bought it. Be sure to revolve your holdings by always consuming the oldest stock you have instead of trashing it. When you feel you have an adequate hoard, you can taper off by only buying enough to replace your regular consumption.",
  "tyn_model":[
    "food",
    "water",
    "cans",
    "fruits",
    "vegetables",
    "can opener",
    "fruit bars",
    "peanut butter",
    "milk",
    "cooking oil",
    "fruit",
    "bread",
    "cakes",
    "tins",
    "rice",
    "dry milk",
    "drink powder",
    "baby formula",
    "dishes",
    "toilet paper",
    "bottled water",
    "permanent marker"
  ],
  "tyn_section":[

  ]
}