{
  "title":"How to Make Chicken Noodle Soup",
  "url":"https://www.wikihow.com/Make-Chicken-Noodle-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Simple Chicken Noodle Soup",
      "steps":[
        {
          "headline":"Add the chicken breasts, celery, carrots, onions, and parsley in a large pot.",
          "description":"Place 2 large chicken breasts, 2 chopped celery stalks, 2 chopped carrots, 1/2 a diced white onion, and 3 springs of fresh parsley into a large pot."
        },
        {
          "headline":"Cover the ingredients with water and add seasonings.",
          "description":"Cover the ingredients with water and add 1 tsp. of garlic powder, 1 tsp. of black pepper, and 1 tsp. of salt."
        },
        {
          "headline":"Bring the ingredients to a boil and reduce the heat.",
          "description":"Then, cover the soup and let it simmer of 1 hour. This will blend the ingredients that will make up the chicken soup stock."
        },
        {
          "headline":"Skim off any foam that rises to the top.",
          "description":"This will make the soup’s stock even tastier."
        },
        {
          "headline":"Remove the chicken and set it aside to cool.",
          "description":"Place it on a plate"
        },
        {
          "headline":"Strain the stock into a bowl.",
          "description":"Then, transfer it back into the pot and place it on the range."
        },
        {
          "headline":"Add bouillon cubes and allow them to dissolve by bringing it to a boil.",
          "description":"Add additional seasonings to taste."
        },
        {
          "headline":"Pick the meat off the bone and set it aside.",
          "description":"The chicken in the soup will be free of bones."
        },
        {
          "headline":"Chop up the carrots, onions, and celery and sauté them in a tablespoon of butter.",
          "description":"Peel and dice 2 carrots and dice 2 celery stalks and 1/4 of a white onion and sauté them in a tablespoon of butter until they’re tender. This should take 3-5 minutes."
        },
        {
          "headline":"Add the chicken, carrots, celery, and onion into the stock and bring to a boil for 5-10 minutes or until carrots are tender.",
          "description":"After five minutes, you can start testing the carrots to see if the soup is ready."
        },
        {
          "headline":"Add 2 cups of egg noodles and cook uncovered for 10-12 minutes or until the noodles are tender.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Serve this delicious simple chicken noodle soup by itself or with a loaf of bread."
        }
      ]
    },
    {
      "name":"Creamy Chicken Noodle Soup",
      "steps":[
        {
          "headline":"Fill a large stockpot with 2 quarts of water.",
          "description":""
        },
        {
          "headline":"Place 2-3 raw chicken breasts into the water.",
          "description":"The chicken breasts should add about 1.5 lbs. combined."
        },
        {
          "headline":"Add 1/2 of a medium finely chopped sweet onion.",
          "description":"This will add a delicious flavor to the chicken."
        },
        {
          "headline":"Add salt, celery salt, onion powder, powdered chicken bullion cubes, sliced carrots, celery, and a bay leaf to the pot.",
          "description":"Add 2 tsp. of salt, 1 tsp. of celery salt, 1 tsp. of onion powder, 2 chicken bullion cubes ground into powder, 3 sliced medium-sized carrots, 2 chopped celery stalks, and 1 bay leaf to the pot. Stir the ingredients a bit to combine the flavors."
        },
        {
          "headline":"Cover and cook over medium high heat for about an hour.",
          "description":"You can cook the soup closer to high heat. This will be enough time to cook the chicken and combine the flavors of the soup."
        },
        {
          "headline":"Uncover the soup.",
          "description":""
        },
        {
          "headline":"Remove the bay leaf and chicken breasts.",
          "description":"Discard the bay leaf and chop the chicken breasts into small bite-sized chunks, which are about 1 inch (2.5 cm) long."
        },
        {
          "headline":"Add the noodles and more water to the stockpot.",
          "description":"Add 2-3 cups of thick homestyle egg noodles and 1 cup of water to the pot."
        },
        {
          "headline":"Boil the ingredients for another 20 minutes.",
          "description":"If too much of the water evaporates, you can always add some more."
        },
        {
          "headline":"Combine the milk and heavy cream.",
          "description":"Combine 2 cups of milk and 2 cups of heavy cream and stir them together until you’ve thoroughly mixed them."
        },
        {
          "headline":"Melt ½ cup of butter in a saucepan over medium heat.",
          "description":"This should take about 2-3 minutes."
        },
        {
          "headline":"Add ½ cup of flour.",
          "description":"Stir the flour and the butter thoroughly to form roux. Cook this mixture for an additional 1-2 minutes."
        },
        {
          "headline":"Add the milk and cream mixture to the flour mixture.",
          "description":"Add it 1/2 cup at a time while stirring constantly. When the first 1/2 cup of milk is blended in, then you can add the next one. Continue this process until all of the milk mixture is blended with the cream mixture."
        },
        {
          "headline":"Add 1 tsp.",
          "description":"of garlic and 1/2 tsp. of salt. This seasoning will add a nice kick to the sauce."
        },
        {
          "headline":"Add the chicken back to the soup base after the noodles have boiled.",
          "description":""
        },
        {
          "headline":"Pour in the white sauce.",
          "description":"Stir in the sauce until you’ve completely combined the ingredients. If the soup is too thin, you can continue to stir it over medium heat until it reaches a richer consistency."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this creamy chicken soup while it’s warm."
        }
      ]
    },
    {
      "name":"Spicy Chicken Noodle Soup",
      "steps":[
        {
          "headline":"Chop 1 whole small chicken (2.5-3lbs.)",
          "description":"Use a sharp knife to remove the breasts from a chicken carcass and set them aside. Discard the skin. Then, remove the legs from the chicken and set them aside as well. Use a heavy knife to chop the chicken’s body into fine pieces."
        },
        {
          "headline":"Move the chicken body and legs to a large saucepan.",
          "description":""
        },
        {
          "headline":"Add the ham, ginger, garlic, lemongrass, cilantro stems, mint stems, and scallion whites to the saucepan.",
          "description":"Add 4 oz. of smoked ham, 1 minced three-inch knob of ginger, 4 smashed garlic cloves, the finely-chopped dry outer leaves of 1 stalk of lemon grass, the stems of 1 small bunch of cilantro, the stems of 1 small bunch of mint, and the whites of six scallions to the saucepan."
        },
        {
          "headline":"Cover the ingredients with water and bring them to a simmer over high heat.",
          "description":"After the water simmers, you can reduce the heat to low and skim the foam from the surface of the water, topping it with hot water when necessary."
        },
        {
          "headline":"Cook the ingredients for 45 minutes.",
          "description":"This will begin to cook the chicken and combine the flavors."
        },
        {
          "headline":"Add the chicken breasts to the pot and cook the ingredients for 10 more minutes.",
          "description":""
        },
        {
          "headline":"Strain the broth through a fine mesh strainer into a 2 quart measuring cup.",
          "description":""
        },
        {
          "headline":"Remove the chicken legs and breasts to a plate.",
          "description":"Set them aside. Discard the remaining chicken parts."
        },
        {
          "headline":"Add hot water to the broth to reach two quarts.",
          "description":""
        },
        {
          "headline":"Rinse the pot and pour the broth into it.",
          "description":""
        },
        {
          "headline":"Add the onions, carrots, cabbage, and Thai chilis to the pot and bring it to a simmer.",
          "description":"Add 1 finely sliced medium yellow onion, 2 finely sliced medium carrots,1 finely sliced head of Napa cabbage, and 1 finely sliced Thai bird chili to the pot. Cook these ingredients until the vegetables are tender."
        },
        {
          "headline":"Add 1 cup of rice noodles to the pot and cook it for five minutes.",
          "description":"You may need to cook the noodles for a bit longer, depending on the directions on the package."
        },
        {
          "headline":"Shred the chicken breast and leg meat.",
          "description":"Once the chicken cools down enough so that it can be easily handled, use your hands to shred the meat into bite-sized pieces. Remove the skin and bones."
        },
        {
          "headline":"Add the fish sauce, lime juice, soy sauce, and shredded chicken to the pot.",
          "description":"Add 3 tbsp. of fish sauce, 1/4 cup of lime juice, 1 tbsp. of soy sauce, and the shredded chicken to the pot. Season the soup to taste with Kosher salt."
        },
        {
          "headline":"Garnish.",
          "description":"Garnish the soup with the leaves from 1 bunch of cilantro and 1 bunch of mint, and the greens from 6 scallions."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this spicy soup while it’s hot."
        }
      ]
    },
    {
      "name":"Mexican Chicken Noodle Soup",
      "steps":[
        {
          "headline":"Combine the chicken and spices in a large stockpot.",
          "description":"Combine 1 sliced chicken, 1 bay leaf, 1/2 tsp. of ground cumin, 1/2 tsp. of garlic granules, and 1 tsp. salt in the stockpot."
        },
        {
          "headline":"Cover and boil.",
          "description":"Cover the ingredients with enough water to cover them completely. Boil them until they have combined evenly, for about 30 minutes."
        },
        {
          "headline":"Drain and reserve the broth.",
          "description":"Save the broth for the soup."
        },
        {
          "headline":"Heat 2 tbsp.",
          "description":"of vegetable oil in a large skillet. You can do this while the chicken and spices are still cooking."
        },
        {
          "headline":"Sauté 2 (10 oz.)",
          "description":"boxes of broken dry vermicelli in the oil for 3-4 minutes over medium heat. Continue to sauté the noodles until they’re lightly browned."
        },
        {
          "headline":"Add 1 chopped onion and 1 chopped green bell pepper to the oil and noodles.",
          "description":"Continue to sauté the ingredients until the onion is translucent, for another 3-4 minutes."
        },
        {
          "headline":"Add the cooked vegetables to the cooked chicken.",
          "description":""
        },
        {
          "headline":"Pour in the broth and one (8 oz.)",
          "description":"can of tomato sauce. Pour just enough broth to cover the ingredients into the pot with the broth and chicken."
        },
        {
          "headline":"Simmer the ingredients until the noodles are cooked through.",
          "description":"This should take another 8-10 minutes."
        },
        {
          "headline":"Season the soup.",
          "description":"Add more cumin, salt, and garlic granules to taste."
        },
        {
          "headline":"Garnish.",
          "description":"Garnish the soup with a sprinkle of cilantro or jalapeno."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this tasty soup on its own or with a side of tortilla chips."
        }
      ]
    },
    {
      "name":"Slow Cooker Chicken Noodle Soup",
      "steps":[
        {
          "headline":"Roughly chop celery, carrots, and an onion.",
          "description":"Set aside."
        },
        {
          "headline":"Combine olive oil, salt, pepper, garlic powder, and Italian seasoning to create a rub.",
          "description":""
        },
        {
          "headline":"Add the chicken thighs to the rub and make sure the chicken is fully coated.",
          "description":"Let sit for a few minutes as you complete the next step.You can add chili powder to add some spice."
        },
        {
          "headline":"Fill the slow cooker with warm water and add in the chicken bouillon paste, stirring until the bullion is fully dissolved.",
          "description":"(you may substitute this for chicken stock)"
        },
        {
          "headline":"Add the chopped celery, carrots, and onions to the slow cooker.",
          "description":""
        },
        {
          "headline":"Add the chicken thigh to the slow cooker",
          "description":""
        },
        {
          "headline":"Add a bay leaf to the slow cooker.",
          "description":""
        },
        {
          "headline":"Cook on high for 6 hours, or on low for 8 hours.",
          "description":""
        },
        {
          "headline":"When the time has passed, add in the egg noodles and wait for about 5-8 minutes, stirring occasionally.",
          "description":""
        },
        {
          "headline":"Season with salt and pepper to taste and enjoy!",
          "description":"It is best served with flaky biscuits!"
        }
      ]
    }
  ],
  "text":" Simple Chicken Noodle Soup Add the chicken breasts, celery, carrots, onions, and parsley in a large pot. Place 2 large chicken breasts, 2 chopped celery stalks, 2 chopped carrots, 1/2 a diced white onion, and 3 springs of fresh parsley into a large pot. Cover the ingredients with water and add seasonings. Cover the ingredients with water and add 1 tsp. of garlic powder, 1 tsp. of black pepper, and 1 tsp. of salt. Bring the ingredients to a boil and reduce the heat. Then, cover the soup and let it simmer of 1 hour. This will blend the ingredients that will make up the chicken soup stock. Skim off any foam that rises to the top. This will make the soup’s stock even tastier. Remove the chicken and set it aside to cool. Place it on a plate Strain the stock into a bowl. Then, transfer it back into the pot and place it on the range. Add bouillon cubes and allow them to dissolve by bringing it to a boil. Add additional seasonings to taste. Pick the meat off the bone and set it aside. The chicken in the soup will be free of bones. Chop up the carrots, onions, and celery and sauté them in a tablespoon of butter. Peel and dice 2 carrots and dice 2 celery stalks and 1/4 of a white onion and sauté them in a tablespoon of butter until they’re tender. This should take 3-5 minutes. Add the chicken, carrots, celery, and onion into the stock and bring to a boil for 5-10 minutes or until carrots are tender. After five minutes, you can start testing the carrots to see if the soup is ready. Add 2 cups of egg noodles and cook uncovered for 10-12 minutes or until the noodles are tender.  Serve. Serve this delicious simple chicken noodle soup by itself or with a loaf of bread. Creamy Chicken Noodle Soup Fill a large stockpot with 2 quarts of water.  Place 2-3 raw chicken breasts into the water. The chicken breasts should add about 1.5 lbs. combined. Add 1/2 of a medium finely chopped sweet onion. This will add a delicious flavor to the chicken. Add salt, celery salt, onion powder, powdered chicken bullion cubes, sliced carrots, celery, and a bay leaf to the pot. Add 2 tsp. of salt, 1 tsp. of celery salt, 1 tsp. of onion powder, 2 chicken bullion cubes ground into powder, 3 sliced medium-sized carrots, 2 chopped celery stalks, and 1 bay leaf to the pot. Stir the ingredients a bit to combine the flavors. Cover and cook over medium high heat for about an hour. You can cook the soup closer to high heat. This will be enough time to cook the chicken and combine the flavors of the soup. Uncover the soup.  Remove the bay leaf and chicken breasts. Discard the bay leaf and chop the chicken breasts into small bite-sized chunks, which are about 1 inch (2.5 cm) long. Add the noodles and more water to the stockpot. Add 2-3 cups of thick homestyle egg noodles and 1 cup of water to the pot. Boil the ingredients for another 20 minutes. If too much of the water evaporates, you can always add some more. Combine the milk and heavy cream. Combine 2 cups of milk and 2 cups of heavy cream and stir them together until you’ve thoroughly mixed them. Melt ½ cup of butter in a saucepan over medium heat. This should take about 2-3 minutes. Add ½ cup of flour. Stir the flour and the butter thoroughly to form roux. Cook this mixture for an additional 1-2 minutes. Add the milk and cream mixture to the flour mixture. Add it 1/2 cup at a time while stirring constantly. When the first 1/2 cup of milk is blended in, then you can add the next one. Continue this process until all of the milk mixture is blended with the cream mixture. Add 1 tsp. of garlic and 1/2 tsp. of salt. This seasoning will add a nice kick to the sauce. Add the chicken back to the soup base after the noodles have boiled.  Pour in the white sauce. Stir in the sauce until you’ve completely combined the ingredients. If the soup is too thin, you can continue to stir it over medium heat until it reaches a richer consistency. Serve. Enjoy this creamy chicken soup while it’s warm. Spicy Chicken Noodle Soup Chop 1 whole small chicken (2.5-3lbs.) Use a sharp knife to remove the breasts from a chicken carcass and set them aside. Discard the skin. Then, remove the legs from the chicken and set them aside as well. Use a heavy knife to chop the chicken’s body into fine pieces. Move the chicken body and legs to a large saucepan.  Add the ham, ginger, garlic, lemongrass, cilantro stems, mint stems, and scallion whites to the saucepan. Add 4 oz. of smoked ham, 1 minced three-inch knob of ginger, 4 smashed garlic cloves, the finely-chopped dry outer leaves of 1 stalk of lemon grass, the stems of 1 small bunch of cilantro, the stems of 1 small bunch of mint, and the whites of six scallions to the saucepan. Cover the ingredients with water and bring them to a simmer over high heat. After the water simmers, you can reduce the heat to low and skim the foam from the surface of the water, topping it with hot water when necessary. Cook the ingredients for 45 minutes. This will begin to cook the chicken and combine the flavors. Add the chicken breasts to the pot and cook the ingredients for 10 more minutes.  Strain the broth through a fine mesh strainer into a 2 quart measuring cup.  Remove the chicken legs and breasts to a plate. Set them aside. Discard the remaining chicken parts. Add hot water to the broth to reach two quarts.  Rinse the pot and pour the broth into it.  Add the onions, carrots, cabbage, and Thai chilis to the pot and bring it to a simmer. Add 1 finely sliced medium yellow onion, 2 finely sliced medium carrots,1 finely sliced head of Napa cabbage, and 1 finely sliced Thai bird chili to the pot. Cook these ingredients until the vegetables are tender. Add 1 cup of rice noodles to the pot and cook it for five minutes. You may need to cook the noodles for a bit longer, depending on the directions on the package. Shred the chicken breast and leg meat. Once the chicken cools down enough so that it can be easily handled, use your hands to shred the meat into bite-sized pieces. Remove the skin and bones. Add the fish sauce, lime juice, soy sauce, and shredded chicken to the pot. Add 3 tbsp. of fish sauce, 1/4 cup of lime juice, 1 tbsp. of soy sauce, and the shredded chicken to the pot. Season the soup to taste with Kosher salt. Garnish. Garnish the soup with the leaves from 1 bunch of cilantro and 1 bunch of mint, and the greens from 6 scallions. Serve. Enjoy this spicy soup while it’s hot. Mexican Chicken Noodle Soup Combine the chicken and spices in a large stockpot. Combine 1 sliced chicken, 1 bay leaf, 1/2 tsp. of ground cumin, 1/2 tsp. of garlic granules, and 1 tsp. salt in the stockpot. Cover and boil. Cover the ingredients with enough water to cover them completely. Boil them until they have combined evenly, for about 30 minutes. Drain and reserve the broth. Save the broth for the soup. Heat 2 tbsp. of vegetable oil in a large skillet. You can do this while the chicken and spices are still cooking. Sauté 2 (10 oz.) boxes of broken dry vermicelli in the oil for 3-4 minutes over medium heat. Continue to sauté the noodles until they’re lightly browned. Add 1 chopped onion and 1 chopped green bell pepper to the oil and noodles. Continue to sauté the ingredients until the onion is translucent, for another 3-4 minutes. Add the cooked vegetables to the cooked chicken.  Pour in the broth and one (8 oz.) can of tomato sauce. Pour just enough broth to cover the ingredients into the pot with the broth and chicken. Simmer the ingredients until the noodles are cooked through. This should take another 8-10 minutes. Season the soup. Add more cumin, salt, and garlic granules to taste. Garnish. Garnish the soup with a sprinkle of cilantro or jalapeno. Serve. Enjoy this tasty soup on its own or with a side of tortilla chips. Slow Cooker Chicken Noodle Soup Roughly chop celery, carrots, and an onion. Set aside. Combine olive oil, salt, pepper, garlic powder, and Italian seasoning to create a rub.  Add the chicken thighs to the rub and make sure the chicken is fully coated. Let sit for a few minutes as you complete the next step.You can add chili powder to add some spice. Fill the slow cooker with warm water and add in the chicken bouillon paste, stirring until the bullion is fully dissolved. (you may substitute this for chicken stock) Add the chopped celery, carrots, and onions to the slow cooker.  Add the chicken thigh to the slow cooker  Add a bay leaf to the slow cooker.  Cook on high for 6 hours, or on low for 8 hours.  When the time has passed, add in the egg noodles and wait for about 5-8 minutes, stirring occasionally.  Season with salt and pepper to taste and enjoy! It is best served with flaky biscuits!",
  "tyn_model":[
    "chicken",
    "carrots",
    "water",
    "pot",
    "celery",
    "salt",
    "milk",
    "garlic",
    "broth",
    "onions",
    "butter",
    "onion",
    "bay leaf",
    "slow cooker",
    "chicken breasts",
    "stockpot",
    "saucepan",
    "flour",
    "mint",
    "chicken noodle soup",
    "large pot",
    "white onion",
    "seasonings",
    "garlic powder",
    "plate",
    "stock",
    "celery salt",
    "onion powder",
    "noodles",
    "heavy cream",
    "cream",
    "ginger",
    "cilantro",
    "scallions",
    "hot water",
    "fish sauce",
    "lime juice",
    "soy sauce",
    "spices",
    "oil",
    "parsley",
    "fresh parsley",
    "black pepper",
    "chicken soup",
    "bowl",
    "bouillon",
    "egg noodles",
    "sweet onion",
    "chicken bullion cubes",
    "chicken bullion",
    "bay",
    "white sauce",
    "sharp knife",
    "heavy knife",
    "large saucepan",
    "ham",
    "lemongrass",
    "scallion",
    "smoked ham",
    "lemon grass",
    "fine mesh strainer",
    "cabbage",
    "thai chilis",
    "yellow onion",
    "napa cabbage",
    "thai bird chili",
    "rice noodles",
    "chicken breast",
    "kosher salt",
    "large stockpot",
    "ground cumin",
    "vegetable oil",
    "large skillet",
    "green bell pepper",
    "tomato sauce",
    "cumin",
    "tortilla chips",
    "slow cooker chicken noodle soup",
    "olive oil",
    "pepper",
    "italian seasoning",
    "chicken thighs",
    "chili powder",
    "chicken bouillon",
    "chicken stock",
    "salt and pepper"
  ],
  "tyn_section":[

  ]
}