{
  "title":"How to Make Chocolate Chip Banana Bread",
  "url":"https://www.wikihow.com/Make-Chocolate-Chip-Banana-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Fruit Breads"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350 °F (177 °C).",
      "description":""
    },
    {
      "headline":"Grease and flour the bottom of a 4x8 loaf pan.",
      "description":""
    },
    {
      "headline":"Gather a large mixing bowl, hand mixer, spatula, and the ingredients.",
      "description":""
    },
    {
      "headline":"Cream sugar, butter, and sour cream in mixing bowl.",
      "description":""
    },
    {
      "headline":"Add bananas to mash them into the creamed mixture.",
      "description":""
    },
    {
      "headline":"Add vanilla.",
      "description":""
    },
    {
      "headline":"Add eggs.",
      "description":""
    },
    {
      "headline":"Sift dry ingredients (flour, baking soda, salt) together.",
      "description":""
    },
    {
      "headline":"Add dry ingredients to mixture at lowest speed.",
      "description":"DO NOT OVER MIX!"
    },
    {
      "headline":"Stir in chocolate chips with the spatula.",
      "description":""
    },
    {
      "headline":"Pour mixture into greased and floured pan.",
      "description":""
    },
    {
      "headline":"Place bread in preheated oven to bake for 55 minutes or until inserted toothpick comes out clean.",
      "description":""
    },
    {
      "headline":"Remove bread from oven and let cool in pan for 5 minutes.",
      "description":""
    },
    {
      "headline":"Remove bread from pan and let cool on a cooling rack.",
      "description":""
    },
    {
      "headline":"Cut slices and enjoy!",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350 °F (177 °C).  Grease and flour the bottom of a 4x8 loaf pan.  Gather a large mixing bowl, hand mixer, spatula, and the ingredients.  Cream sugar, butter, and sour cream in mixing bowl.  Add bananas to mash them into the creamed mixture.  Add vanilla.  Add eggs.  Sift dry ingredients (flour, baking soda, salt) together.  Add dry ingredients to mixture at lowest speed. DO NOT OVER MIX! Stir in chocolate chips with the spatula.  Pour mixture into greased and floured pan.  Place bread in preheated oven to bake for 55 minutes or until inserted toothpick comes out clean.  Remove bread from oven and let cool in pan for 5 minutes.  Remove bread from pan and let cool on a cooling rack.  Cut slices and enjoy! ",
  "tyn_model":[
    "oven",
    "flour",
    "spatula",
    "loaf pan",
    "large mixing bowl",
    "hand mixer",
    "sugar",
    "butter",
    "sour cream",
    "mixing bowl",
    "bananas",
    "vanilla",
    "eggs",
    "baking soda",
    "salt",
    "chocolate chips",
    "bread"
  ],
  "tyn_section":[

  ]
}