{
  "title":"How to Bake Unsweetened Chocolate Brownies",
  "url":"https://www.wikihow.com/Bake-Unsweetened-Chocolate-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 350ºF or 180ºC.",
      "description":""
    },
    {
      "headline":"Put the butter in your saucepan and cook on medium heat until it is fully melted.",
      "description":"Slowly stir in the cocoa until it has mixed with the butter."
    },
    {
      "headline":"Stir in eggs, sugar, flour and vanilla essence with a spatula until the mixture has a smooth, creamy consistency.",
      "description":"Add the nuts."
    },
    {
      "headline":"Grease a baking pan using butter or vegetable fat and then spread flour or cocoa on all the sides.",
      "description":"This will prevent the brownies from sticking to the sides of the pan."
    },
    {
      "headline":"Pour the brownie batter in the baking pan.",
      "description":"Bake for 35 to 40 minutes."
    },
    {
      "headline":"Cool brownies on a wire rack until only slightly warm.",
      "description":"Cut it into bars and serve."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat oven to 350ºF or 180ºC.  Put the butter in your saucepan and cook on medium heat until it is fully melted. Slowly stir in the cocoa until it has mixed with the butter. Stir in eggs, sugar, flour and vanilla essence with a spatula until the mixture has a smooth, creamy consistency. Add the nuts. Grease a baking pan using butter or vegetable fat and then spread flour or cocoa on all the sides. This will prevent the brownies from sticking to the sides of the pan. Pour the brownie batter in the baking pan. Bake for 35 to 40 minutes. Cool brownies on a wire rack until only slightly warm. Cut it into bars and serve. Finished. ",
  "tyn_model":[
    "butter",
    "cocoa",
    "flour",
    "baking pan",
    "oven",
    "saucepan",
    "eggs",
    "sugar",
    "vanilla essence",
    "spatula",
    "nuts",
    "vegetable fat",
    "wire rack"
  ],
  "tyn_section":[

  ]
}