{
  "title":"How to Make Butter‐Rum Walnut Cake",
  "url":"https://www.wikihow.com/Make-Butter%E2%80%90Rum-Walnut-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "steps":[
    {
      "headline":"Prepare the fruit.",
      "description":"In a microwave-safe bowl, combine the dried fruit and rum together. Microwave for a minute, stir with a spoon, and microwave again for an additional minute."
    },
    {
      "headline":"Preheat the oven to 325° Fahrenheit or 162° Celsius.",
      "description":""
    },
    {
      "headline":"Grease a large cake pan with non-stick greasing spray.",
      "description":""
    },
    {
      "headline":"In a large mixing bowl, whisk the brown sugar, butter, baking powder, salt, molasses, nutmeg, vanilla, and allspice.",
      "description":"Whisk until well-combined."
    },
    {
      "headline":"Crack in each egg, one at a time, and whisk.",
      "description":""
    },
    {
      "headline":"Add the flour and mix slowly, pouring in the milk.",
      "description":"Mix using rubber spatula until there are no more flour streaks."
    },
    {
      "headline":"Stir in the walnuts, candied cherries, and microwaved fruit mixture.",
      "description":"Mix until well-combined."
    },
    {
      "headline":"Pour and scrape out the batter into the greased cake pan.",
      "description":""
    },
    {
      "headline":"Bake the cake for about 60-90 minutes, until the cake is golden brown.",
      "description":""
    },
    {
      "headline":"Remove the cake from the oven and allow it cool for several minutes.",
      "description":""
    },
    {
      "headline":"Brush the cake with the simple syrup using a pastry brush.",
      "description":""
    },
    {
      "headline":"Let the cake sit for about 45 minutes so the syrup can soak into the cake.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Slice the cake using a knife and place it on a serving plate. Garnish with dried fruit and candied red cherries, if desired. Enjoy!"
    }
  ],
  "text":" Prepare the fruit. In a microwave-safe bowl, combine the dried fruit and rum together. Microwave for a minute, stir with a spoon, and microwave again for an additional minute. Preheat the oven to 325° Fahrenheit or 162° Celsius.  Grease a large cake pan with non-stick greasing spray.  In a large mixing bowl, whisk the brown sugar, butter, baking powder, salt, molasses, nutmeg, vanilla, and allspice. Whisk until well-combined. Crack in each egg, one at a time, and whisk.  Add the flour and mix slowly, pouring in the milk. Mix using rubber spatula until there are no more flour streaks. Stir in the walnuts, candied cherries, and microwaved fruit mixture. Mix until well-combined. Pour and scrape out the batter into the greased cake pan.  Bake the cake for about 60-90 minutes, until the cake is golden brown.  Remove the cake from the oven and allow it cool for several minutes.  Brush the cake with the simple syrup using a pastry brush.  Let the cake sit for about 45 minutes so the syrup can soak into the cake.  Serve. Slice the cake using a knife and place it on a serving plate. Garnish with dried fruit and candied red cherries, if desired. Enjoy!",
  "tyn_model":[
    "oven",
    "microwave-safe bowl",
    "rum",
    "spoon",
    "microwave",
    "large cake pan",
    "non-stick greasing spray",
    "large mixing bowl",
    "brown sugar",
    "butter",
    "baking powder",
    "salt",
    "molasses",
    "nutmeg",
    "vanilla",
    "allspice",
    "egg",
    "whisk",
    "flour",
    "milk",
    "rubber spatula",
    "walnuts",
    "cherries",
    "microwaved fruit",
    "cake pan",
    "simple syrup",
    "pastry brush",
    "knife",
    "serving plate",
    "dried fruit",
    "candied red cherries"
  ],
  "tyn_section":[

  ]
}