{
  "title":"How to Make an Ice Cream Sandwich",
  "url":"https://www.wikihow.com/Make-an-Ice-Cream-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts"
  ],
  "methods":[
    {
      "name":"Graham Cracker Whipped Cream Sandwich",
      "steps":[
        {
          "headline":"Break the graham crackers in half.",
          "description":""
        },
        {
          "headline":"Put the whipped cream all on top of 1/2 of the cracker.",
          "description":""
        },
        {
          "headline":"Put the other cracker on top and onto a plate.",
          "description":""
        },
        {
          "headline":"Freeze the sandwiches overnight.",
          "description":""
        },
        {
          "headline":"Take them out the next day and enjoy!",
          "description":""
        }
      ]
    },
    {
      "name":"Generic Cookie Ice Cream Sandwich",
      "steps":[
        {
          "headline":"Grab two cookies of your choice.",
          "description":"Also get any kind of ice cream."
        },
        {
          "headline":"Set out a plate and put one cookie down.",
          "description":""
        },
        {
          "headline":"Add a generous scoop of ice cream on the first cookie.",
          "description":""
        },
        {
          "headline":"Stack the other cookie on top of the ice cream layer.",
          "description":""
        },
        {
          "headline":"Add extras, as desired.",
          "description":"For a bonus you can get mini chocolate chips (regular ones work just as well) and put them around the outside of the ice cream. You can put any kind of chip on it, white chocolate, dark chocolate, butterscotch, etc."
        },
        {
          "headline":"Serve or freeze.",
          "description":"If you are not going to eat it right away, put it on the plate and in a freezer. On the other hand if you can't resist put back on the plate and enjoy this tasty treat!"
        }
      ]
    },
    {
      "name":"Waffle Ice Cream Sandwich",
      "steps":[
        {
          "headline":"Pour almost liquid ice cream into a tray.",
          "description":""
        },
        {
          "headline":"Place in a freezer and wait to freeze.",
          "description":""
        },
        {
          "headline":"Take out the frozen ice cream and using a knife cut waffle shaped rectangles.",
          "description":""
        },
        {
          "headline":"Get the first waffle and place the ice-ream rectangle on to it.",
          "description":""
        },
        {
          "headline":"Place the second waffle on top.",
          "description":""
        }
      ]
    },
    {
      "name":"Churros Ice Cream Sandwich",
      "steps":[
        {
          "headline":"Line a baking sheet with parchment paper (or use a silicone sheet).",
          "description":""
        },
        {
          "headline":"Place the saucepan onto the stove top.",
          "description":"Add the milk, water, salt, sugar and butter. Warm over a medium to hot heat."
        },
        {
          "headline":"Stir to combine.",
          "description":"When the butter melts, bring to a boil. Remove from the heat once it reaches a boil. Pour in the vanilla extract and stir."
        },
        {
          "headline":"Add the flour to the liquid mixture.",
          "description":"Stir with a spatula to create a smooth dough."
        },
        {
          "headline":"Select a star tip for the piping bag.",
          "description":"Place the dough into the piping bag."
        },
        {
          "headline":"Pipe long lengths of the dough onto the parchment paper lined baking sheet.",
          "description":"Let sit for quarter of an hour to 20 minutes."
        },
        {
          "headline":"Create the churros sandwich shape.",
          "description":"Roll each length of long dough into a little circle. The circle should be sized according to how large you'd like the ice cream sandwich to be. Realize that this will be bite-size, not huge."
        },
        {
          "headline":"Make the topping for the churros.",
          "description":"Mix the sugars and cinnamon until combined. Place this in a small bowl but ensure it is wide enough for dipping the churros into, for coating."
        },
        {
          "headline":"Prepare the deep fryer.",
          "description":"Heat to 360ºF (182ºC). These can be fried in a pot with high sides and a heavy base, using medium heat, if you don't have a deep fryer."
        },
        {
          "headline":"Fry the churros.",
          "description":"Only do two at a time, to avoid crowding the churros and to ensure the best texture. They should fr on one side for around 3 to 3.5 minutes, until golden brown. Then turn them over with tongs, slotted spoon or similar, and fry the other side for around the same time, or until golden brown."
        },
        {
          "headline":"Using the tongs, a wire skimmer or slotted spoon, remove the fried churros.",
          "description":"Lay them down on a plate lined with kitchen paper towel, to drain the oil. Continue to make more churros, as required."
        },
        {
          "headline":"Dip the churros into the cinnamon sugar mix.",
          "description":"Do this while they are still hot."
        },
        {
          "headline":"Create the ice cream sandwiches.",
          "description":"To assemble, place one churros onto the serving plate, add the ice cream, then top with another churros. The churros should be quite warm still, as this adds to the deliciousness."
        },
        {
          "headline":"Serve immediately.",
          "description":"These are best when still warm and fresh."
        }
      ]
    }
  ],
  "text":" Graham Cracker Whipped Cream Sandwich Break the graham crackers in half.  Put the whipped cream all on top of 1/2 of the cracker.  Put the other cracker on top and onto a plate.  Freeze the sandwiches overnight.  Take them out the next day and enjoy!  Generic Cookie Ice Cream Sandwich Grab two cookies of your choice. Also get any kind of ice cream. Set out a plate and put one cookie down.  Add a generous scoop of ice cream on the first cookie.  Stack the other cookie on top of the ice cream layer.  Add extras, as desired. For a bonus you can get mini chocolate chips (regular ones work just as well) and put them around the outside of the ice cream. You can put any kind of chip on it, white chocolate, dark chocolate, butterscotch, etc. Serve or freeze. If you are not going to eat it right away, put it on the plate and in a freezer. On the other hand if you can't resist put back on the plate and enjoy this tasty treat! Waffle Ice Cream Sandwich Pour almost liquid ice cream into a tray.  Place in a freezer and wait to freeze.  Take out the frozen ice cream and using a knife cut waffle shaped rectangles.  Get the first waffle and place the ice-ream rectangle on to it.  Place the second waffle on top.  Churros Ice Cream Sandwich Line a baking sheet with parchment paper (or use a silicone sheet).  Place the saucepan onto the stove top. Add the milk, water, salt, sugar and butter. Warm over a medium to hot heat. Stir to combine. When the butter melts, bring to a boil. Remove from the heat once it reaches a boil. Pour in the vanilla extract and stir. Add the flour to the liquid mixture. Stir with a spatula to create a smooth dough. Select a star tip for the piping bag. Place the dough into the piping bag. Pipe long lengths of the dough onto the parchment paper lined baking sheet. Let sit for quarter of an hour to 20 minutes. Create the churros sandwich shape. Roll each length of long dough into a little circle. The circle should be sized according to how large you'd like the ice cream sandwich to be. Realize that this will be bite-size, not huge. Make the topping for the churros. Mix the sugars and cinnamon until combined. Place this in a small bowl but ensure it is wide enough for dipping the churros into, for coating. Prepare the deep fryer. Heat to 360ºF (182ºC). These can be fried in a pot with high sides and a heavy base, using medium heat, if you don't have a deep fryer. Fry the churros. Only do two at a time, to avoid crowding the churros and to ensure the best texture. They should fr on one side for around 3 to 3.5 minutes, until golden brown. Then turn them over with tongs, slotted spoon or similar, and fry the other side for around the same time, or until golden brown. Using the tongs, a wire skimmer or slotted spoon, remove the fried churros. Lay them down on a plate lined with kitchen paper towel, to drain the oil. Continue to make more churros, as required. Dip the churros into the cinnamon sugar mix. Do this while they are still hot. Create the ice cream sandwiches. To assemble, place one churros onto the serving plate, add the ice cream, then top with another churros. The churros should be quite warm still, as this adds to the deliciousness. Serve immediately. These are best when still warm and fresh.",
  "tyn_model":[
    "ice cream",
    "plate",
    "freezer",
    "butter",
    "deep fryer",
    "slotted spoon",
    "cracker whipped cream",
    "graham crackers",
    "whipped cream",
    "cracker",
    "chocolate chips",
    "butterscotch",
    "tray",
    "knife",
    "ice-ream",
    "baking sheet",
    "parchment paper",
    "saucepan",
    "stove top",
    "milk",
    "water",
    "salt",
    "sugar",
    "vanilla extract",
    "flour",
    "spatula",
    "piping bag",
    "parchment paper lined baking sheet",
    "sugars",
    "cinnamon",
    "pot",
    "wire skimmer",
    "kitchen paper towel",
    "oil",
    "cinnamon sugar",
    "serving plate"
  ],
  "tyn_section":[

  ]
}