{
  "title":"How to Get Invited to Parties",
  "url":"https://www.wikihow.com/Get-Invited-to-Parties",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Planning",
    "Invitations"
  ],
  "parts":[
    {
      "name":"Getting out of Your House",
      "steps":[
        {
          "headline":"Join a club or activity.",
          "description":"Most schools host a ton of clubs and activities. Join a few and see which ones you like the most. Try not to over-commit yourself, but have enough variety that you can find something-- and a group of people-- that you really \"click\" with. Get to know new people in the club(s). At each meeting, try to talk to someone you’ve never talked to before."
        },
        {
          "headline":"Find a social hobby.",
          "description":"If school organizations aren’t your thing, find another hobby outside of school. Check the local paper (or its website) for community events nearby. Libraries or art studios often host events for teens. Look for organizations that hold meetings for things that you are interested in, like outdoor activities, games, or artistic expression."
        },
        {
          "headline":"Hang out where other people you admire spend time.",
          "description":"This may be a cool coffee shop, a bookstore, a rock climbing gym, or even the mall. If you base your hangout spot around your interests, you're more likely to meet people that you have something in common with."
        },
        {
          "headline":"Attend school functions that draw large crowds.",
          "description":"Activities such as football games, dances, or large-scale fundraisers often draw a large number of students with different interests and personalities."
        }
      ]
    },
    {
      "name":"Developing Your Friend Group",
      "steps":[
        {
          "headline":"Be friendly to everyone.",
          "description":"Whenever you meet someone new, greet them warmly. Try to find something in common with them. Don’t be afraid to initiate a conversation. Even if you’re naturally shy, go up and talk to someone if you want to. You may want to find an “excuse” to talk to them (like giving them something they dropped or asking them what time it is). If you recognize someone from school or a club or activity, or if you have a mutual friend, bring that up. Ask new friends questions about themselves. People love to talk about themselves, and asking them questions rather than spending most of the time talking about yourself will leave a better first impression. Avoid gossiping or talking badly about others. Though this can be tempting, it can leave a bad impression or you may offend your new friend unintentionally."
        },
        {
          "headline":"Evaluate your existing friendships.",
          "description":"Try to determine why you have the friends that you currently have and what things you have in common. Reach out to friends that you would like to spend more time with. A simple call or text every now and then can help you maintain or recover old relationships. If you have any friends who are possessive or controlling of your time—particularly if you start spending time with new people—you may want to distance yourself from them."
        },
        {
          "headline":"Invite new (or existing) friends to spend time with you.",
          "description":"Deepening friendships makes the friends more likely to invite you along to parties that they are going to attend."
        },
        {
          "headline":"Meet your new friends’ other friends.",
          "description":"The more friends you have, the more likely it is that someone will invite you to a party. Ask new friends to introduce you to their other friends. Try to maintain those friendships too."
        },
        {
          "headline":"Become connected with new friends on social networks.",
          "description":"Some party invitations are organized online, and you need to be connected with others to get an invitation."
        }
      ]
    },
    {
      "name":"Attending Parties or Social Events",
      "steps":[
        {
          "headline":"Find a way to attend a party.",
          "description":"If you hear someone talking about a party, find out some details and try to get an invitation for it. Ask a friend that you know is going to the party to hang out one-on-one at the time of the party—they may tell you about the party and invite you to go with them. If someone mentions the party, say \"wow, that sounds really fun\" and look them in the eye. They will likely invite you if they are able to. Ask a friend who is attending a party directly if you can tag along. Show up to the party if you know when and where it is. It is very unlikely that anyone will question you about who invited you."
        },
        {
          "headline":"Invite yourself to a party.",
          "description":"While this may not be as good as being invited, it may be a good place to start. If a friend is attending a party but they are not sure if they can invite you to another person’s party, ask them to introduce you to the host. Start a conversation with the host of the next party, and then compliment them on their outfit or a recent accomplishment that you heard about (like being nominated to homecoming court). Casually ask them if they mind you dropping by her party for a little while. Most people will be uncomfortable telling someone no to their face."
        },
        {
          "headline":"Host a fun party yourself.",
          "description":"Invite a lot of different people from different groups and tell them it’s okay to invite a few friends. Be sure that everyone has a good time. Try to spend a little time with everyone who attends. Address everyone by name and thank them for coming. Even if it’s someone you don’t know well, they will feel special if you pay some personal attention to them. If you're not sure of someone's name, ask another party attendee who may know. At the end of your party, jokingly ask, “okay, whose turn is it to throw the next one?”"
        }
      ]
    },
    {
      "name":"Behaving Appropriately at Parties or Gatherings",
      "steps":[
        {
          "headline":"Be friendly and funny.",
          "description":"If you are genuinely friendly and nice to everyone, they will automatically like you. If you are also funny, then they will like you even more. Tell jokes only if you’re good at it. Be sure your joke is appropriate for the audience and context (don’t offend anyone). Laugh at other people’s jokes, even if they’re not that funny. If you laugh at people’s jokes, people will think that you have a good sense of humor."
        },
        {
          "headline":"Dress appropriately for the occasion.",
          "description":"Not sure what is appropriate? Ask a friend who you think has great style what you should wear. Borrow clothes if you need to."
        },
        {
          "headline":"Be the life of the party!",
          "description":"Leave an impression on people by doing a silly dance in front of everyone, singing some awesome karaoke, or showing off a unique talent. You want people to remember you, even if they have never met you before."
        },
        {
          "headline":"Don’t be too much of a party animal.",
          "description":"There is a fine line between the life of the party and going too far. You may not know where the line is, so consider having a secret signal with a close friend who can tell you “back down a little.”\nYou don’t want people to remember you in a bad way."
        },
        {
          "headline":"Work on getting invited to more parties while at parties.",
          "description":"While having fun at a party is the perfect time to plan to attend the next party. If you are having a good conversation with someone, ask if there is anything fun happening the next weekend. If you know someone who is planning to host a party soon, be sure to spend some time chatting with them to give them the opportunity to invite you to their party."
        }
      ]
    }
  ],
  "text":" Getting out of Your House Join a club or activity. Most schools host a ton of clubs and activities. Join a few and see which ones you like the most. Try not to over-commit yourself, but have enough variety that you can find something-- and a group of people-- that you really \"click\" with. Get to know new people in the club(s). At each meeting, try to talk to someone you’ve never talked to before. Find a social hobby. If school organizations aren’t your thing, find another hobby outside of school. Check the local paper (or its website) for community events nearby. Libraries or art studios often host events for teens. Look for organizations that hold meetings for things that you are interested in, like outdoor activities, games, or artistic expression. Hang out where other people you admire spend time. This may be a cool coffee shop, a bookstore, a rock climbing gym, or even the mall. If you base your hangout spot around your interests, you're more likely to meet people that you have something in common with. Attend school functions that draw large crowds. Activities such as football games, dances, or large-scale fundraisers often draw a large number of students with different interests and personalities. Developing Your Friend Group Be friendly to everyone. Whenever you meet someone new, greet them warmly. Try to find something in common with them. Don’t be afraid to initiate a conversation. Even if you’re naturally shy, go up and talk to someone if you want to. You may want to find an “excuse” to talk to them (like giving them something they dropped or asking them what time it is). If you recognize someone from school or a club or activity, or if you have a mutual friend, bring that up. Ask new friends questions about themselves. People love to talk about themselves, and asking them questions rather than spending most of the time talking about yourself will leave a better first impression. Avoid gossiping or talking badly about others. Though this can be tempting, it can leave a bad impression or you may offend your new friend unintentionally. Evaluate your existing friendships. Try to determine why you have the friends that you currently have and what things you have in common. Reach out to friends that you would like to spend more time with. A simple call or text every now and then can help you maintain or recover old relationships. If you have any friends who are possessive or controlling of your time—particularly if you start spending time with new people—you may want to distance yourself from them. Invite new (or existing) friends to spend time with you. Deepening friendships makes the friends more likely to invite you along to parties that they are going to attend. Meet your new friends’ other friends. The more friends you have, the more likely it is that someone will invite you to a party. Ask new friends to introduce you to their other friends. Try to maintain those friendships too. Become connected with new friends on social networks. Some party invitations are organized online, and you need to be connected with others to get an invitation. Attending Parties or Social Events Find a way to attend a party. If you hear someone talking about a party, find out some details and try to get an invitation for it. Ask a friend that you know is going to the party to hang out one-on-one at the time of the party—they may tell you about the party and invite you to go with them. If someone mentions the party, say \"wow, that sounds really fun\" and look them in the eye. They will likely invite you if they are able to. Ask a friend who is attending a party directly if you can tag along. Show up to the party if you know when and where it is. It is very unlikely that anyone will question you about who invited you. Invite yourself to a party. While this may not be as good as being invited, it may be a good place to start. If a friend is attending a party but they are not sure if they can invite you to another person’s party, ask them to introduce you to the host. Start a conversation with the host of the next party, and then compliment them on their outfit or a recent accomplishment that you heard about (like being nominated to homecoming court). Casually ask them if they mind you dropping by her party for a little while. Most people will be uncomfortable telling someone no to their face. Host a fun party yourself. Invite a lot of different people from different groups and tell them it’s okay to invite a few friends. Be sure that everyone has a good time. Try to spend a little time with everyone who attends. Address everyone by name and thank them for coming. Even if it’s someone you don’t know well, they will feel special if you pay some personal attention to them. If you're not sure of someone's name, ask another party attendee who may know. At the end of your party, jokingly ask, “okay, whose turn is it to throw the next one?” Behaving Appropriately at Parties or Gatherings Be friendly and funny. If you are genuinely friendly and nice to everyone, they will automatically like you. If you are also funny, then they will like you even more. Tell jokes only if you’re good at it. Be sure your joke is appropriate for the audience and context (don’t offend anyone). Laugh at other people’s jokes, even if they’re not that funny. If you laugh at people’s jokes, people will think that you have a good sense of humor. Dress appropriately for the occasion. Not sure what is appropriate? Ask a friend who you think has great style what you should wear. Borrow clothes if you need to. Be the life of the party! Leave an impression on people by doing a silly dance in front of everyone, singing some awesome karaoke, or showing off a unique talent. You want people to remember you, even if they have never met you before. Don’t be too much of a party animal. There is a fine line between the life of the party and going too far. You may not know where the line is, so consider having a secret signal with a close friend who can tell you “back down a little.”\nYou don’t want people to remember you in a bad way. Work on getting invited to more parties while at parties. While having fun at a party is the perfect time to plan to attend the next party. If you are having a good conversation with someone, ask if there is anything fun happening the next weekend. If you know someone who is planning to host a party soon, be sure to spend some time chatting with them to give them the opportunity to invite you to their party.",
  "tyn_model":[
    "“excuse",
    "” to",
    "—particularly",
    "—you",
    "’ other",
    "—they",
    "“okay",
    "” behaving",
    "“back",
    "”\n"
  ],
  "tyn_section":[

  ]
}