{
  "title":"How to Make Your Economy Boom in Age of Empires III",
  "url":"https://www.wikihow.com/Make-Your-Economy-Boom-in-Age-of-Empires-III",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "parts":[
    {
      "name":"Choosing a Favorable Civilization for Booming",
      "steps":[
        {
          "headline":"Open the Home Cities page.",
          "description":"Some civilizations (civs) make it easier to boom than others, owing to how cheaper and faster it is to create villagers and/or how much more effective the villagers are at gathering economic resources. To begin selecting a civilization, on the AoE3 main menu, click “Single Player” or “Multiplayer,” depending on the game mode you want. This will bring up the Home Cities page."
        },
        {
          "headline":"Click “Manage Home Cities.” If the civilization you want is one you have used before, click “Select a Home City.” Otherwise, click “Create new Home City” and proceed to the next step.",
          "description":""
        },
        {
          "headline":"Select the civilization you want from the list that appears, and click “Play.” Civilizations that favor booming include:",
          "description":" British—Every time a house (manor) is built, a free villager is spawned, and these manors can train villagers. This allows the player to easily have a high villager count. French—Special villagers called Coureurs gather resources faster than the villagers of other civs. Russians—Villagers train in sets of three as opposed to one by one in other civs. This allows the player to easily acquire a high villager count. Ottoman—Villagers spawn automatically without the player's intervention, and for free. Germans—Settler wagons are produced along with normal villagers. These settler wagons allow very quick gathering of resources."
        }
      ]
    },
    {
      "name":"Using Military Cards from the Home City",
      "steps":[
        {
          "headline":"Set the gathering point for shipments.",
          "description":"Click the building where you want Home City shipments to be delivered. Buildings that qualify include Town Centers, Castles, and Outposts. Click the “Deliver Home City Shipments Here” button. This is the button with the picture of a house and a red arrow on it."
        },
        {
          "headline":"Open the Home City window.",
          "description":"Do this by pressing the Home City hotkey (H) or click the Home City button (the button with your civ’s flag above the resources stockpile on the bottom left of the game screen). The Home City Window displays the cards you can use to send free shipments from the Home City to aid your developing colony."
        },
        {
          "headline":"Click military cards to request free military shipments.",
          "description":"During the game, using military cards from your Home City will delay having to spend resources on military for as long as you can. The number and type of military cards depends on the civilization you are using to play the game and also on the age your colony is in. For instance, for the Germans:\nIn Age Two: 3 Doppelsoldners + 2 Uhlans | 5 Uhlans | 2 Outpost Wagons | 4 Landsknecht Mercenaries\nIn Age Three: 7 Skirmishers + 3 Uhlans | 8 Uhlans | 3 War Wagons + 3 Uhlans | a Falconet + 3 Uhlans | a Fort Wagon\nIn Age Four: 9 Skirmishers + 3 Uhlans"
        },
        {
          "headline":"Use the received military units for defense or minor attacks.",
          "description":"Position the military units sent over from the Home City in defensive positions around your colony, or use them to launch minor assaults on enemy colonies."
        }
      ]
    },
    {
      "name":"Upgrading Your Villagers’ Gathering Abilities",
      "steps":[
        {
          "headline":"Build a Market.",
          "description":"Perform all possible upgrades on your villagers to make them most efficient at gathering economic resources, but first, you must build a Market. The Market building provides early economic upgrades for your villagers without which your economy simply cannot boom. Click an idle villager to select him and then press the hotkeys B followed by M to construct a Market (costs 100 Wood)."
        },
        {
          "headline":"Left-click the Market to select it.",
          "description":"Its command panel will appear at the bottom right corner of the screen with icons for various technologies for improving your villagers."
        },
        {
          "headline":"Click the icons to perform the upgrades.",
          "description":"To discover what upgrade each icon represents, hover your mouse over the icons to produce tooltips. Here are the technologies together with their costs and the age your colony is required to be in so the upgrade can commence:\n\nGang Saw (Age One; costs 100 Food)—Villagers gather Wood 10% faster\n\nLog Flume (Age Two; costs 150 Food & 250 Coin)—Villagers gather Wood a further 20% faster\n\nCircular Saw (Age Three; costs 240 Food & 480 Coin)—Villagers gather Wood a further 30% faster\n\nHunting Dogs (Age One; costs 50 Wood & 50 Coin)—Villagers gather Food from Hunted Animals 10% faster\n\nSteel Traps (Age Two; costs 125 Wood & 125 Coin)—Villagers gather Food from Hunted Animals 20% faster\n\nPlacer Mines (Age One; costs 75 Food & 75 Wood)—Villagers gather Coin from Mines 10% faster\n\nAmalgamation (Age Two; costs 250 Food & 200 Wood)—Villagers gather Coin from Mines 20% faster"
        }
      ]
    },
    {
      "name":"Upgrading All Economic Buildings",
      "steps":[
        {
          "headline":"Perform Mill upgrades.",
          "description":"Of great importance to booming is upgrading economic buildings so they perform at their best in terms of producing resources. First, perform Mill upgrades:\nResearch Seed Drill (Age II; costs 150 Wood & 150 Coin)—Click your Mill to select it (hotkey Ctrl + I) and click the Seed Drill button (a picture of an antique seed drill). This will allow villagers to gather food from Mills at a +15% rate. Research Artificial Fertilizer (Age III; costs 335 Wood & 335 Coin)—Click the Artificial Fertilizer button (features a picture of a sack with fertilizer in it). This will increase the rate at which food is gathered from Mills a further 30%."
        },
        {
          "headline":"Perform Livestock Pen upgrades.",
          "description":"Research Selective Breeding (Age I; costs 150 Wood & 150 Coin) by clicking your Livestock Pen to select it and then click the icon with a picture of sheep on it. This upgrade enables livestock to fatten 25% faster at the Livestock Pen."
        },
        {
          "headline":"Perform Plantation upgrades.",
          "description":"Research Bookkeeping (Age III; costs 300 Food & 300 Wood)—Press the hotkey Ctrl + L to go to your Plantation, and then click the icon of a book. This upgrade increases Plantation coin gathering rates by 10%. Research Refineries (Age IV; costs 600 Food & 600 Wood)—Click the icon of smelted gold being poured from a container to another. This upgrade increases Plantation coin gathering rates by 10%."
        }
      ]
    }
  ],
  "text":" Choosing a Favorable Civilization for Booming Open the Home Cities page. Some civilizations (civs) make it easier to boom than others, owing to how cheaper and faster it is to create villagers and/or how much more effective the villagers are at gathering economic resources. To begin selecting a civilization, on the AoE3 main menu, click “Single Player” or “Multiplayer,” depending on the game mode you want. This will bring up the Home Cities page. Click “Manage Home Cities.” If the civilization you want is one you have used before, click “Select a Home City.” Otherwise, click “Create new Home City” and proceed to the next step.  Select the civilization you want from the list that appears, and click “Play.” Civilizations that favor booming include:  British—Every time a house (manor) is built, a free villager is spawned, and these manors can train villagers. This allows the player to easily have a high villager count. French—Special villagers called Coureurs gather resources faster than the villagers of other civs. Russians—Villagers train in sets of three as opposed to one by one in other civs. This allows the player to easily acquire a high villager count. Ottoman—Villagers spawn automatically without the player's intervention, and for free. Germans—Settler wagons are produced along with normal villagers. These settler wagons allow very quick gathering of resources. Using Military Cards from the Home City Set the gathering point for shipments. Click the building where you want Home City shipments to be delivered. Buildings that qualify include Town Centers, Castles, and Outposts. Click the “Deliver Home City Shipments Here” button. This is the button with the picture of a house and a red arrow on it. Open the Home City window. Do this by pressing the Home City hotkey (H) or click the Home City button (the button with your civ’s flag above the resources stockpile on the bottom left of the game screen). The Home City Window displays the cards you can use to send free shipments from the Home City to aid your developing colony. Click military cards to request free military shipments. During the game, using military cards from your Home City will delay having to spend resources on military for as long as you can. The number and type of military cards depends on the civilization you are using to play the game and also on the age your colony is in. For instance, for the Germans:\nIn Age Two: 3 Doppelsoldners + 2 Uhlans | 5 Uhlans | 2 Outpost Wagons | 4 Landsknecht Mercenaries\nIn Age Three: 7 Skirmishers + 3 Uhlans | 8 Uhlans | 3 War Wagons + 3 Uhlans | a Falconet + 3 Uhlans | a Fort Wagon\nIn Age Four: 9 Skirmishers + 3 Uhlans Use the received military units for defense or minor attacks. Position the military units sent over from the Home City in defensive positions around your colony, or use them to launch minor assaults on enemy colonies. Upgrading Your Villagers’ Gathering Abilities Build a Market. Perform all possible upgrades on your villagers to make them most efficient at gathering economic resources, but first, you must build a Market. The Market building provides early economic upgrades for your villagers without which your economy simply cannot boom. Click an idle villager to select him and then press the hotkeys B followed by M to construct a Market (costs 100 Wood). Left-click the Market to select it. Its command panel will appear at the bottom right corner of the screen with icons for various technologies for improving your villagers. Click the icons to perform the upgrades. To discover what upgrade each icon represents, hover your mouse over the icons to produce tooltips. Here are the technologies together with their costs and the age your colony is required to be in so the upgrade can commence:\n\nGang Saw (Age One; costs 100 Food)—Villagers gather Wood 10% faster\n\nLog Flume (Age Two; costs 150 Food & 250 Coin)—Villagers gather Wood a further 20% faster\n\nCircular Saw (Age Three; costs 240 Food & 480 Coin)—Villagers gather Wood a further 30% faster\n\nHunting Dogs (Age One; costs 50 Wood & 50 Coin)—Villagers gather Food from Hunted Animals 10% faster\n\nSteel Traps (Age Two; costs 125 Wood & 125 Coin)—Villagers gather Food from Hunted Animals 20% faster\n\nPlacer Mines (Age One; costs 75 Food & 75 Wood)—Villagers gather Coin from Mines 10% faster\n\nAmalgamation (Age Two; costs 250 Food & 200 Wood)—Villagers gather Coin from Mines 20% faster Upgrading All Economic Buildings Perform Mill upgrades. Of great importance to booming is upgrading economic buildings so they perform at their best in terms of producing resources. First, perform Mill upgrades:\nResearch Seed Drill (Age II; costs 150 Wood & 150 Coin)—Click your Mill to select it (hotkey Ctrl + I) and click the Seed Drill button (a picture of an antique seed drill). This will allow villagers to gather food from Mills at a +15% rate. Research Artificial Fertilizer (Age III; costs 335 Wood & 335 Coin)—Click the Artificial Fertilizer button (features a picture of a sack with fertilizer in it). This will increase the rate at which food is gathered from Mills a further 30%. Perform Livestock Pen upgrades. Research Selective Breeding (Age I; costs 150 Wood & 150 Coin) by clicking your Livestock Pen to select it and then click the icon with a picture of sheep on it. This upgrade enables livestock to fatten 25% faster at the Livestock Pen. Perform Plantation upgrades. Research Bookkeeping (Age III; costs 300 Food & 300 Wood)—Press the hotkey Ctrl + L to go to your Plantation, and then click the icon of a book. This upgrade increases Plantation coin gathering rates by 10%. Research Refineries (Age IV; costs 600 Food & 600 Wood)—Click the icon of smelted gold being poured from a container to another. This upgrade increases Plantation coin gathering rates by 10%.",
  "tyn_model":[
    "market",
    "wood",
    "civilization",
    "—villagers",
    "food",
    "mill",
    "mills",
    "civilizations",
    "“single",
    "” or",
    "“multiplayer",
    "” depending",
    "“manage",
    "” if",
    "“select",
    "” otherwise",
    "“create",
    "” and",
    "“play",
    "” civilizations",
    "british",
    "—every",
    "french",
    "—special",
    "russians",
    "—settler",
    "“deliver",
    "” button",
    "military cards",
    "war wagons",
    "falconet",
    "fort wagon",
    "’ gathering",
    "hotkeys",
    "saw",
    "log",
    "dogs",
    "coin",
    "artificial fertilizer",
    "fertilizer",
    "sheep",
    "hotkey",
    "book",
    "container"
  ],
  "tyn_section":[

  ]
}