{
  "title":"How to Clean a Cement Mixer",
  "url":"https://www.wikihow.com/Clean-a-Cement-Mixer",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Concrete",
    "Working with Concrete and Cement"
  ],
  "steps":[
    {
      "headline":"Remove the drum from the mixer.",
      "description":"This is usually done by turning the drum in the opposite direction to that of its normal rotation."
    },
    {
      "headline":"Place the drum on its side and put some firewood and paper into the drum and set alight.",
      "description":"The drum needs to be on it’s side so it can draw in air. If the drum is upright, it will not and the fire will go out."
    },
    {
      "headline":"Once lit, keep burning for approximately 1 hour.",
      "description":"You can use a little coal to increase the heat and keep the fire in. After approximately 1 hour the drum will be EXTREMELY HOT. (take care when handling!)"
    },
    {
      "headline":"Cool the outside of the mixer drum with cold water.",
      "description":"(Do not wet the inside of the drum)"
    },
    {
      "headline":"Empty the drum of burnt coal & or ash.",
      "description":""
    },
    {
      "headline":"Replace cooled drum back on the mixer.",
      "description":"(Remember to grease the spigot)"
    },
    {
      "headline":"Use a claw hammer or small chisel to chip away the old cement.",
      "description":"This will take a little while depending upon how badly the drum was coated with old cement."
    },
    {
      "headline":"Avoid banging the outside of the drum, as this could dent and damage it.",
      "description":""
    },
    {
      "headline":"When the worst of the cement has been loosened, tip it out into a wheelbarrow.",
      "description":""
    },
    {
      "headline":"Pour some water in the drum along with some old bricks or rubble and leave turning for about 30 minutes.",
      "description":"You can tilt the drum a little so that the rubble scrapes the upper edges of the drum."
    },
    {
      "headline":"Empty the drum of rubble and water.",
      "description":""
    },
    {
      "headline":"You should now have a clean cement mixer ready for work again.",
      "description":""
    }
  ],
  "text":" Remove the drum from the mixer. This is usually done by turning the drum in the opposite direction to that of its normal rotation. Place the drum on its side and put some firewood and paper into the drum and set alight. The drum needs to be on it’s side so it can draw in air. If the drum is upright, it will not and the fire will go out. Once lit, keep burning for approximately 1 hour. You can use a little coal to increase the heat and keep the fire in. After approximately 1 hour the drum will be EXTREMELY HOT. (take care when handling!) Cool the outside of the mixer drum with cold water. (Do not wet the inside of the drum) Empty the drum of burnt coal & or ash.  Replace cooled drum back on the mixer. (Remember to grease the spigot) Use a claw hammer or small chisel to chip away the old cement. This will take a little while depending upon how badly the drum was coated with old cement. Avoid banging the outside of the drum, as this could dent and damage it.  When the worst of the cement has been loosened, tip it out into a wheelbarrow.  Pour some water in the drum along with some old bricks or rubble and leave turning for about 30 minutes. You can tilt the drum a little so that the rubble scrapes the upper edges of the drum. Empty the drum of rubble and water.  You should now have a clean cement mixer ready for work again. ",
  "tyn_model":[
    "mixer",
    "water",
    "cement",
    "firewood",
    "paper",
    "coal",
    "claw hammer",
    "wheelbarrow",
    "cement mixer"
  ],
  "tyn_section":[

  ]
}