{
  "title":"How to Remove Cat Spray or Pee from a Leather Couch",
  "url":"https://www.wikihow.com/Remove-Cat-Spray-or-Pee-from-a-Leather-Couch",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Removing the odor",
      "steps":[
        {
          "headline":"Buy orange-scented cleaner from your pet store.",
          "description":"Mix a strong solution of the orange-scented cleaner with water: use a 1:10 ish ratio in a spray bottle. Spray liberally over the affected area. Remove covers and really spray them down practically soaking them. Spray the foam as well if you can, airing it out after."
        },
        {
          "headline":"Let the spray emulsify (turn white).",
          "description":"Allow it to soak in for about an hour or so. Blot dry."
        },
        {
          "headline":"Repeat one or two more times.",
          "description":""
        },
        {
          "headline":"Liberally sprinkle baking soda all over the underside where the cushions sit (if your cushions are removable that is), add ground cloves to the mix and leave for several hours.",
          "description":"Vacuum it all up, or leave it for as long as you want."
        }
      ]
    },
    {
      "name":"Conditioning the leather",
      "steps":[
        {
          "headline":"Mix some essential oils with coconut oil and rub all over the surfaces which were treated.",
          "description":"This conditions the leather and adds a new smell which should cover the urine smell."
        },
        {
          "headline":"Cover your couch with plastic sheeting for about a month.",
          "description":"This is to try to help the cat forget it ever peed or sprayed there. The important thing is to discourage reuse, as cats tend to return to the same place. Another alternative is to keep the cat out of the room until it has resumed toileting where it is meant to."
        }
      ]
    }
  ],
  "text":" Removing the odor Buy orange-scented cleaner from your pet store. Mix a strong solution of the orange-scented cleaner with water: use a 1:10 ish ratio in a spray bottle. Spray liberally over the affected area. Remove covers and really spray them down practically soaking them. Spray the foam as well if you can, airing it out after. Let the spray emulsify (turn white). Allow it to soak in for about an hour or so. Blot dry. Repeat one or two more times.  Liberally sprinkle baking soda all over the underside where the cushions sit (if your cushions are removable that is), add ground cloves to the mix and leave for several hours. Vacuum it all up, or leave it for as long as you want. Conditioning the leather Mix some essential oils with coconut oil and rub all over the surfaces which were treated. This conditions the leather and adds a new smell which should cover the urine smell. Cover your couch with plastic sheeting for about a month. This is to try to help the cat forget it ever peed or sprayed there. The important thing is to discourage reuse, as cats tend to return to the same place. Another alternative is to keep the cat out of the room until it has resumed toileting where it is meant to.",
  "tyn_model":[
    "orange-scented cleaner",
    "water",
    "spray bottle",
    "baking soda",
    "ground cloves",
    "essential oils",
    "coconut oil",
    "cat"
  ],
  "tyn_section":[

  ]
}