{
  "title":"How to Make a \"Taco Town\" Taco",
  "url":"https://www.wikihow.com/Make-a-%22Taco-Town%22-Taco",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Taco Dishes"
  ],
  "steps":[
    {
      "headline":"Fill a small crispy tortilla with ground beef, melted cheese sauce, lettuce, tomatoes, and southwestern sauce.",
      "description":""
    },
    {
      "headline":"Wrap it in a larger flour tortilla with a layer of refried beans in between.",
      "description":""
    },
    {
      "headline":"Wrap that in a larger corn tortilla with a layer of melted Monterrey jack cheese in between.",
      "description":""
    },
    {
      "headline":"Take a deep fried gordita shell and wrap that around the taco with a layer of guacamole in between.",
      "description":""
    },
    {
      "headline":"Wrap that in a corn husk filled with pico de gallo.",
      "description":"bake it."
    },
    {
      "headline":"Wrap that in a crepe filled with egg, gruyere, portobello mushrooms, and Merguez sausage.",
      "description":""
    },
    {
      "headline":"Wrap that in a Chicago-style deep dish meat lovers' pizza.",
      "description":""
    },
    {
      "headline":"Wrap that in a large blueberry pancake",
      "description":""
    },
    {
      "headline":"Dip the whole thing in batter and deep fry until golden brown.",
      "description":""
    },
    {
      "headline":"Put it in the \"commemorative\" tote-bag.",
      "description":"Fill the bag with vegetarian chili."
    }
  ],
  "text":" Fill a small crispy tortilla with ground beef, melted cheese sauce, lettuce, tomatoes, and southwestern sauce.  Wrap it in a larger flour tortilla with a layer of refried beans in between.  Wrap that in a larger corn tortilla with a layer of melted Monterrey jack cheese in between.  Take a deep fried gordita shell and wrap that around the taco with a layer of guacamole in between.  Wrap that in a corn husk filled with pico de gallo. bake it. Wrap that in a crepe filled with egg, gruyere, portobello mushrooms, and Merguez sausage.  Wrap that in a Chicago-style deep dish meat lovers' pizza.  Wrap that in a large blueberry pancake  Dip the whole thing in batter and deep fry until golden brown.  Put it in the \"commemorative\" tote-bag. Fill the bag with vegetarian chili.",
  "tyn_model":[
    "ground beef",
    "melted cheese sauce",
    "lettuce",
    "tomatoes",
    "southwestern sauce",
    "flour tortilla",
    "refried beans",
    "corn tortilla",
    "monterrey jack cheese",
    "deep fried gordita",
    "taco",
    "guacamole",
    "corn husk",
    "pico de gallo",
    "crepe",
    "egg",
    "gruyere",
    "portobello mushrooms",
    "merguez sausage",
    "deep dish meat lovers' pizza",
    "large blueberry pancake",
    "vegetarian chili"
  ],
  "tyn_section":[

  ]
}