{
  "title":"How to Prepare Kerala Sambar",
  "url":"https://www.wikihow.com/Prepare-Kerala-Sambar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Vegetarian Indian Dishes"
  ],
  "steps":[
    {
      "headline":"Peel the veggies, wash and cut them.",
      "description":"(Cut okra and drumstick as 2inch long pieces and all others as cubes). Take 6-7 shallots and halve them. Cut the green chillies length-wise. ns."
    },
    {
      "headline":"Cook the toor dal (soaked in normal water for around 30 minutes), shallots, green chillies and 1 teaspoon turmeric in a pressure cooker until they become tender (wait for two whistles in the cooker).",
      "description":"This takes around 10 minutes ."
    },
    {
      "headline":"Sauté cut okra and/or eggplant (this step helps to control the slimy nature of these veggies)",
      "description":""
    },
    {
      "headline":"Add the remaining cut veggies and sauteed veggies into the pressure cooker, add water to completely submerge veggies, salt to taste and cook for 5 minutes and wait for it to boil.",
      "description":""
    },
    {
      "headline":"In the meantime, Sauté the scraped/grated coconut, 3-4 red chillies, coriander seeds/powder and curry leaves without oil in a hard bottomed wok till light to reddish brown.",
      "description":"Take care to see that it does not get burnt. This is now ground to a fine paste and added along with the ingredients in the cooker once it starts to boil. Add 3 tablespoons of sambar powder/masala to this and let it cook for another 5 minutes. See to it that the veggies don't get mashed."
    },
    {
      "headline":"Stir well and add tamarind water to the cooker.",
      "description":""
    },
    {
      "headline":"Gather mustard seeds, dry red chilies and curry leaves to prepare tadka.",
      "description":"Heat oil in a pan and add the ingredients gathered."
    },
    {
      "headline":"Mix the tadka well with contents of the pressure cooker and the sambar is ready!",
      "description":"Serve along with idlis / dosa / rice."
    }
  ],
  "text":" Peel the veggies, wash and cut them. (Cut okra and drumstick as 2inch long pieces and all others as cubes). Take 6-7 shallots and halve them. Cut the green chillies length-wise. ns. Cook the toor dal (soaked in normal water for around 30 minutes), shallots, green chillies and 1 teaspoon turmeric in a pressure cooker until they become tender (wait for two whistles in the cooker). This takes around 10 minutes . Sauté cut okra and/or eggplant (this step helps to control the slimy nature of these veggies)  Add the remaining cut veggies and sauteed veggies into the pressure cooker, add water to completely submerge veggies, salt to taste and cook for 5 minutes and wait for it to boil.  In the meantime, Sauté the scraped/grated coconut, 3-4 red chillies, coriander seeds/powder and curry leaves without oil in a hard bottomed wok till light to reddish brown. Take care to see that it does not get burnt. This is now ground to a fine paste and added along with the ingredients in the cooker once it starts to boil. Add 3 tablespoons of sambar powder/masala to this and let it cook for another 5 minutes. See to it that the veggies don't get mashed. Stir well and add tamarind water to the cooker.  Gather mustard seeds, dry red chilies and curry leaves to prepare tadka. Heat oil in a pan and add the ingredients gathered. Mix the tadka well with contents of the pressure cooker and the sambar is ready! Serve along with idlis / dosa / rice.",
  "tyn_model":[
    "pressure cooker",
    "okra",
    "water",
    "curry leaves",
    "cooker",
    "drumstick",
    "toor dal",
    "shallots",
    "green chillies",
    "turmeric",
    "eggplant",
    "salt",
    "coconut",
    "red chillies",
    "coriander",
    "wok",
    "sambar powder",
    "masala",
    "tamarind water",
    "mustard",
    "red chilies",
    "oil",
    "pan",
    "rice"
  ],
  "tyn_section":[

  ]
}