{
  "title":"How to Fold Paper Airplanes",
  "url":"https://www.wikihow.com/Fold-Paper-Airplanes",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft"
  ],
  "methods":[
    {
      "name":"Folding a Simple Paper Airplane",
      "steps":[
        {
          "headline":"Fold a piece of paper in half lengthwise.",
          "description":"The best type of paper to use is an ordinary 8 ½ in (21.5 cm) by 11 in (28 cm) printer or A4 paper. Perform a book fold to begin. Make a book fold by folding your paper in half the long way. You can use any 8 ½ by 11 in piece of paper like notebook paper, construction paper, or printer paper. For best results, lay your paper on a flat surface like a desk. Crease your fold with the edge of your finger, then unfold."
        },
        {
          "headline":"Fold the top two corners down.",
          "description":"Take the top corners of your paper and fold each one into meet at the center crease. You will have two triangular flaps on top of the rectangular portion of your paper. Your center crease should be in a valley fold, meaning the crease points down and the paper lifts up toward you, like a valley. Crease the outer diagonal edges of your folds to keep each fold in place."
        },
        {
          "headline":"Fold the top corners to the center crease.",
          "description":"Repeat the same type of fold you just made. Fold in the outer points at the base of each triangle. Fold toward the crease. You will now have two isosceles triangle flaps folded down. An isosceles triangle means that two sides are of equal length while the third is a different length."
        },
        {
          "headline":"Fold the paper in half in a mountain fold.",
          "description":"Take your plane and fold it back in a mountain fold. This is another hot dog style fold on the center crease. The flaps you previously folded down should now be on the outside of your plane."
        },
        {
          "headline":"Fold the wings down.",
          "description":"Position the plane so the straight portion is on the bottom. Fold the wings down to line up with the base of your plane. Fold the wings down so the small flat portion in the back of each one aligns to the base of the plane."
        },
        {
          "headline":"Fold the wings down again.",
          "description":"The base of your plane should be flat and at the top you should have a flat edge starting about halfway back. Fold the paper down to align your edges. Again, fold your wing flaps down over your previous folds to align the flat portion that was at the top of the wing to the flat base. The distance from the base of your plane to the top should be about 1 inch (25 mm) tall. Crease the wings with your finger."
        },
        {
          "headline":"Fan out the wings.",
          "description":"Now pull the top layer of folds up to fan out the wings. You will have two larger, flat wings on the top with a few smaller wings below. You should have a long, narrow plane now ready for flight."
        },
        {
          "headline":"Throw your paper airplane.",
          "description":"Test your plane by flicking your wrist. This plane is great for a long, straight flight. Hold your plane parallel to the ground and throw. You can tape the nose of your plane shut to keep the wings together."
        }
      ]
    },
    {
      "name":"Folding a More Advanced Paper Airplane",
      "steps":[
        {
          "headline":"Fold a piece of paper in half lengthwise.",
          "description":"Use ordinary 8 ½ in (21.5 cm) by 11 in (28 cm) printer or A4 paper. Perform a book fold to begin. A book fold is made by folding your paper in half the long way. Notebook paper, construction paper, or printer paper all work well. For best results, lay your paper on a flat surface like a desk. Crease your fold with the edge of your finger, then unfold."
        },
        {
          "headline":"Fold the top down.",
          "description":"Take about two 2 inches (51 mm) at the top of your paper and fold down in a horizontal valley fold. Keep the center crease aligned when you fold the top of the paper down toward you. Crease the top edge with your finger to keep the flap in place."
        },
        {
          "headline":"Fold the top portion down again in half.",
          "description":"Now repeat the fold you just made, only this time folding only the top 1 inch (25 mm). Align the bottom edge of this fold to the bottom edge of your previous fold. Crease to keep the fold in place. Perform a third horizontal valley fold. Fold the top 0.5 inches (13 mm) down. Line up all the edges once again. Go over all of your creases and press each one again to keep the folds in place."
        },
        {
          "headline":"Flip your paper over.",
          "description":"You center crease should now be a mountain fold, meaning it is pointing up. The last folds you performed should be on the opposite side of the paper now facing down. Fold the top two corners to the center line. Take the top two corners and fold each into the center. Align each so both folds are even. You may have to play with getting the paper to fold as the three folds you previously made might make it hard to fold the flaps down."
        },
        {
          "headline":"Flip your paper back over.",
          "description":"You will now have a piece of paper that looks like a house with a small triangle cap at the top. The folds you just made should now be on the opposite side of the paper facing down."
        },
        {
          "headline":"Fold the plane in half towards you.",
          "description":"Fold your paper up in a vertical valley fold along the center crease. You will now have two rectangular flaps showing, a triangle portion, and a square portion."
        },
        {
          "headline":"Fold the wings down.",
          "description":"Fold the wings down over your rectangular flaps. You want to fold the wings so the edges are flat. Fold the wings down so the creases you make here are at the top of your rectangular portion. This will create the wings and the body of your plane. The body should be about 0.5 inches (13 mm) tall. Make sure both wings are even with one another."
        },
        {
          "headline":"Fold up two wing flaps.",
          "description":"With your wings still folded down, take about 0.5 inches (13 mm) of your paper and fold it up in a valley fold. This will create a fin on each wing to help the plane fly."
        },
        {
          "headline":"Throw your paper plane.",
          "description":"Fold the wings up so the top portion is flat. Lift up your wing fins so each is perpendicular with your wings. This plane has a heavy nose so you can throw it hard and watch it fly far. Hold the plane parallel to the ground and let loose."
        }
      ]
    },
    {
      "name":"Folding a Very Advanced Paper Airplane",
      "steps":[
        {
          "headline":"Start with a piece of 8 ½ in (21.5 cm) by 11 in (28 cm) printer or A4 paper.",
          "description":"Position your paper in portrait mode. Fold the top left corner down in a diagonal valley fold. Crease and unfold. Repeat with the top right corner. Portrait mode means the paper is taller than it is wider. When you fold your diagonal valley fold you will have a triangle with a portion of rectangular paper of about 2.5 inches (64 mm) at the bottom."
        },
        {
          "headline":"Perform a balloon fold.",
          "description":"With your paper laying flat, pick up the sides of your paper and fold the middles in. Follow the creases you made to fold your paper down into a triangle shape. You will now have a triangle shape with two flaps on top of your paper. Below, you will see two more flaps of paper which are creased in the center."
        },
        {
          "headline":"Fold the bottom corners of your top layer up.",
          "description":"Take the two corners of your triangle on the top layer, fold each to meet at the top of your paper. This is another diagonal valley fold. When completed you have a new top layer consisting of two triangles pointing away from each other. Together, these triangles form a diamond."
        },
        {
          "headline":"Fold the outer edges into the center.",
          "description":"You will have a larger triangle shape under your diamond. Take the outer corners of your triangle and fold to the center. Lift up the flaps of your diamond layer to fold these sections of paper under the diamond. The inner edges of this fold should meet at the area where the bottom crease on the inside of each diamond is."
        },
        {
          "headline":"Fold the plane in half.",
          "description":"Perform a vertical valley fold to fold your plane in half. Press all of your creases to keep your folds in place. Make sure that both sides of your plane are as even as possible."
        },
        {
          "headline":"Fold the wings down.",
          "description":"Fold your wings down so the edges of the wings align with the body of the plane. Then fold the triangle flaps in the front down. Fold these inner flaps down over the top edge of your wings. Make sure that your wings are even with one another for best results. Crease all of your new folds to keep everything in place."
        },
        {
          "headline":"Fan out the wings and fly your plane.",
          "description":"Fan out your wings so you have two narrow wings underneath two larger triangular wings at the front of your plane. This plane is built to fly far due to its narrow structure. Hold it parallel to the ground flick your wrist to let it fly. Fly your plane in an open space for best results."
        }
      ]
    }
  ],
  "text":" Folding a Simple Paper Airplane Fold a piece of paper in half lengthwise. The best type of paper to use is an ordinary 8 ½ in (21.5 cm) by 11 in (28 cm) printer or A4 paper. Perform a book fold to begin. Make a book fold by folding your paper in half the long way. You can use any 8 ½ by 11 in piece of paper like notebook paper, construction paper, or printer paper. For best results, lay your paper on a flat surface like a desk. Crease your fold with the edge of your finger, then unfold. Fold the top two corners down. Take the top corners of your paper and fold each one into meet at the center crease. You will have two triangular flaps on top of the rectangular portion of your paper. Your center crease should be in a valley fold, meaning the crease points down and the paper lifts up toward you, like a valley. Crease the outer diagonal edges of your folds to keep each fold in place. Fold the top corners to the center crease. Repeat the same type of fold you just made. Fold in the outer points at the base of each triangle. Fold toward the crease. You will now have two isosceles triangle flaps folded down. An isosceles triangle means that two sides are of equal length while the third is a different length. Fold the paper in half in a mountain fold. Take your plane and fold it back in a mountain fold. This is another hot dog style fold on the center crease. The flaps you previously folded down should now be on the outside of your plane. Fold the wings down. Position the plane so the straight portion is on the bottom. Fold the wings down to line up with the base of your plane. Fold the wings down so the small flat portion in the back of each one aligns to the base of the plane. Fold the wings down again. The base of your plane should be flat and at the top you should have a flat edge starting about halfway back. Fold the paper down to align your edges. Again, fold your wing flaps down over your previous folds to align the flat portion that was at the top of the wing to the flat base. The distance from the base of your plane to the top should be about 1 inch (25 mm) tall. Crease the wings with your finger. Fan out the wings. Now pull the top layer of folds up to fan out the wings. You will have two larger, flat wings on the top with a few smaller wings below. You should have a long, narrow plane now ready for flight. Throw your paper airplane. Test your plane by flicking your wrist. This plane is great for a long, straight flight. Hold your plane parallel to the ground and throw. You can tape the nose of your plane shut to keep the wings together. Folding a More Advanced Paper Airplane Fold a piece of paper in half lengthwise. Use ordinary 8 ½ in (21.5 cm) by 11 in (28 cm) printer or A4 paper. Perform a book fold to begin. A book fold is made by folding your paper in half the long way. Notebook paper, construction paper, or printer paper all work well. For best results, lay your paper on a flat surface like a desk. Crease your fold with the edge of your finger, then unfold. Fold the top down. Take about two 2 inches (51 mm) at the top of your paper and fold down in a horizontal valley fold. Keep the center crease aligned when you fold the top of the paper down toward you. Crease the top edge with your finger to keep the flap in place. Fold the top portion down again in half. Now repeat the fold you just made, only this time folding only the top 1 inch (25 mm). Align the bottom edge of this fold to the bottom edge of your previous fold. Crease to keep the fold in place. Perform a third horizontal valley fold. Fold the top 0.5 inches (13 mm) down. Line up all the edges once again. Go over all of your creases and press each one again to keep the folds in place. Flip your paper over. You center crease should now be a mountain fold, meaning it is pointing up. The last folds you performed should be on the opposite side of the paper now facing down. Fold the top two corners to the center line. Take the top two corners and fold each into the center. Align each so both folds are even. You may have to play with getting the paper to fold as the three folds you previously made might make it hard to fold the flaps down. Flip your paper back over. You will now have a piece of paper that looks like a house with a small triangle cap at the top. The folds you just made should now be on the opposite side of the paper facing down. Fold the plane in half towards you. Fold your paper up in a vertical valley fold along the center crease. You will now have two rectangular flaps showing, a triangle portion, and a square portion. Fold the wings down. Fold the wings down over your rectangular flaps. You want to fold the wings so the edges are flat. Fold the wings down so the creases you make here are at the top of your rectangular portion. This will create the wings and the body of your plane. The body should be about 0.5 inches (13 mm) tall. Make sure both wings are even with one another. Fold up two wing flaps. With your wings still folded down, take about 0.5 inches (13 mm) of your paper and fold it up in a valley fold. This will create a fin on each wing to help the plane fly. Throw your paper plane. Fold the wings up so the top portion is flat. Lift up your wing fins so each is perpendicular with your wings. This plane has a heavy nose so you can throw it hard and watch it fly far. Hold the plane parallel to the ground and let loose. Folding a Very Advanced Paper Airplane Start with a piece of 8 ½ in (21.5 cm) by 11 in (28 cm) printer or A4 paper. Position your paper in portrait mode. Fold the top left corner down in a diagonal valley fold. Crease and unfold. Repeat with the top right corner. Portrait mode means the paper is taller than it is wider. When you fold your diagonal valley fold you will have a triangle with a portion of rectangular paper of about 2.5 inches (64 mm) at the bottom. Perform a balloon fold. With your paper laying flat, pick up the sides of your paper and fold the middles in. Follow the creases you made to fold your paper down into a triangle shape. You will now have a triangle shape with two flaps on top of your paper. Below, you will see two more flaps of paper which are creased in the center. Fold the bottom corners of your top layer up. Take the two corners of your triangle on the top layer, fold each to meet at the top of your paper. This is another diagonal valley fold. When completed you have a new top layer consisting of two triangles pointing away from each other. Together, these triangles form a diamond. Fold the outer edges into the center. You will have a larger triangle shape under your diamond. Take the outer corners of your triangle and fold to the center. Lift up the flaps of your diamond layer to fold these sections of paper under the diamond. The inner edges of this fold should meet at the area where the bottom crease on the inside of each diamond is. Fold the plane in half. Perform a vertical valley fold to fold your plane in half. Press all of your creases to keep your folds in place. Make sure that both sides of your plane are as even as possible. Fold the wings down. Fold your wings down so the edges of the wings align with the body of the plane. Then fold the triangle flaps in the front down. Fold these inner flaps down over the top edge of your wings. Make sure that your wings are even with one another for best results. Crease all of your new folds to keep everything in place. Fan out the wings and fly your plane. Fan out your wings so you have two narrow wings underneath two larger triangular wings at the front of your plane. This plane is built to fly far due to its narrow structure. Hold it parallel to the ground flick your wrist to let it fly. Fly your plane in an open space for best results.",
  "tyn_model":[
    "paper",
    "printer or a4 paper",
    "plane",
    "notebook paper",
    "construction paper",
    "printer paper",
    "isosceles triangle",
    "hot dog",
    "paper airplane"
  ],
  "tyn_section":[

  ]
}