{
  "title":"How to Get Rid of a Tan in Animal Crossing: New Leaf",
  "url":"https://www.wikihow.com/Get-Rid-of-a-Tan-in-Animal-Crossing:-New-Leaf",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo 3DS",
    "Animal Crossing: New Leaf"
  ],
  "steps":[
    {
      "headline":"Avoid the sun.",
      "description":"Your tan fades and disappears as long as you’re not exposed to the bright summer sun, which means you need to avoid it. The simplest way to do so is by staying indoors or using an umbrella during noontime in the entire summer period or when visiting the island. Keeping away from the sun ensures that you don’t get darker and will slowly let your tan fade away. Exploring during cloudy or rainy days counts as avoiding exposure to the sun, and you can go out and explore without jeopardizing your tan removal. Between 10 AM and 4 PM is the point where you have the most sun out, so you can safely run around outside of this time period."
    },
    {
      "headline":"Wear a lot of clothes.",
      "description":"You can also halt or remove the progression of your tan by equipping certain clothes and accessories. Hats are your best bet, as well as wearing clothes that cover most of your body, like dresses and long-sleeved tops."
    },
    {
      "headline":"Wait a few days.",
      "description":"Of course, you’ll need a few days for it to disappear completely. It takes about 15 days for the darkest level of tanning to fade away, which means you need approximately 3 days to lighten your skin by 1 level. Of course, this does not take frequent ventures into the sun without protection into account. If you insist in running out without an umbrella at noon, this will certainly take longer to get rid of the tan."
    }
  ],
  "text":" Avoid the sun. Your tan fades and disappears as long as you’re not exposed to the bright summer sun, which means you need to avoid it. The simplest way to do so is by staying indoors or using an umbrella during noontime in the entire summer period or when visiting the island. Keeping away from the sun ensures that you don’t get darker and will slowly let your tan fade away. Exploring during cloudy or rainy days counts as avoiding exposure to the sun, and you can go out and explore without jeopardizing your tan removal. Between 10 AM and 4 PM is the point where you have the most sun out, so you can safely run around outside of this time period. Wear a lot of clothes. You can also halt or remove the progression of your tan by equipping certain clothes and accessories. Hats are your best bet, as well as wearing clothes that cover most of your body, like dresses and long-sleeved tops. Wait a few days. Of course, you’ll need a few days for it to disappear completely. It takes about 15 days for the darkest level of tanning to fade away, which means you need approximately 3 days to lighten your skin by 1 level. Of course, this does not take frequent ventures into the sun without protection into account. If you insist in running out without an umbrella at noon, this will certainly take longer to get rid of the tan.",
  "tyn_model":[
    "sun",
    "umbrella",
    "hats"
  ],
  "tyn_section":[

  ]
}