{
  "title":"How to Make a Flea Trap",
  "url":"https://www.wikihow.com/Make-a-Flea-Trap",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Pest Repellents and Traps"
  ],
  "parts":[
    {
      "name":"Making a Dish Soap Trap",
      "steps":[
        {
          "headline":"Fill a large, shallow dish with water.",
          "description":"Ideal containers for a dish soap flea trap include cookie sheets, rubber tote lids, plates, and pie plates. You want a container with a large surface area and short sides. A shallow dish will help you catch as many fleas as possible, because the short sides won’t act as a barrier for jumping fleas that might land in the trap."
        },
        {
          "headline":"Add dish soap.",
          "description":"Add 1 to 2 tablespoons (15 to 30 ml) of liquid dish soap to the water. Swish the water around with a spoon or your finger to distribute the soap throughout the water. Fleas don’t drown in plain water because they aren't heavy enough to break the water’s surface tension. Adding liquid dish soap to the water reduces the surface tension. When the fleas jump into the trap, they will sink and drown. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tScott McCombe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPest Control Specialist\t\t\t\t\t\t\t\tScott McCombe is the CEO of Summit Environmental Solutions (SES), a family-owned local pest solutions, animal control, and home insulation company based in Northern Virginia. Founded in 1991, SES has an A+ rating with the Better Business Bureau and has been awarded \"Best of the Best 2017,\" “Top Rated Professional,” and “Elite Service Award\" by HomeAdvisor. Scott McCombe\t\t\tPest Control Specialist\t\t\t\tTry this variation from our expert: Make your own flea trap by putting Alka Seltzer and water in a pie tin, then place an incandescent lamp above the trap."
        },
        {
          "headline":"Place the trap where fleas have been.",
          "description":"A homemade flea trap doesn’t have the power to attract fleas, so it’s best to put it somewhere that fleas have already been in your house. Place a towel on the floor to catch spills, and lay the trap on top of the towel on the floor. Make multiple flea traps for different rooms if necessary. Common places to find fleas include:\nOn carpets and rugs\nNear pet bedding\nNear windows,doors and food\nAround pillows and furniture\nAround pet bowls\nNear drapes and curtains"
        },
        {
          "headline":"Leave the trap overnight.",
          "description":"Fleas become active a couple of hours before sunset and stay active all night long, so the best time to catch them is overnight. Once you lay the trap, try to leave it undisturbed for the rest of the night. When possible, close the door to the room to keep pets and kids out."
        },
        {
          "headline":"Empty and refill the trap each morning.",
          "description":"In the morning, check the trap for dead fleas. If you caught any, dump the soapy water and rinse the dish. Fill the dish with fresh water, add more dish soap, and lay the trap out again on the towel for the next night. Repeat each night until you stop catching fleas."
        }
      ]
    },
    {
      "name":"Attracting Fleas to the Trap",
      "steps":[
        {
          "headline":"Use a lamp to attract fleas.",
          "description":"Place a directional or table lamp beside the trap. Before bed, turn on the lamp and position the bulb above the trap, so the light shines into the trap. The fleas will be attracted to the light and warmth, and when they jump toward the light, they’ll land in the trap below. Use an incandescent or other heat-producing bulb for your trap to attract the most fleas possible. Make sure the lamp is sturdy and not at risk of being knocked over into the water. Use this attractant only in rooms where you can shut the door and keep people and pets out while the lamp is on."
        },
        {
          "headline":"Use a yellow-green filter on a light.",
          "description":"Fleas are, for some reason, twice as attracted to yellow-green light as they are to other colors of light. You can increase the efficacy of your lamp attractant by using a yellow-green bulb, or by installing a yellow-green filter on a lamp with a regular bulb. You can buy colored light bulbs at many department and superstores. You may be able to find filters and gels at camera and art supply stores."
        },
        {
          "headline":"Place a candle in the center of the dish.",
          "description":"You can also use a tea light to create light and warmth that will attract fleas to the trap. Place a tea light or votive candle at the center of the trap, and light the candle before bed. As the fleas try to get close to the source, they’ll fall into the trap and drown. Place the trap away from walls, drapery, and other flammable objects. Always exercise great care and proper fire safety measures when burning candles. Close off the room to prevent people and pets from entering when the candle is lit."
        },
        {
          "headline":"Place an indoor plant beside the trap.",
          "description":"Fleas are attracted to carbon dioxide, and this is part of the mechanism they use to find a host. Because plants release carbon dioxide at night, placing one beside the trap may help to attract more fleas. Dormant flea pupae are particularly sensitive to carbon dioxide, so this may be a great way to catch young fleas before they have a chance to lay eggs."
        }
      ]
    },
    {
      "name":"Keeping Your House Flea-Free",
      "steps":[
        {
          "headline":"Bathe and comb your pets.",
          "description":"Pets are the most likely culprit for bringing fleas into your house, so keeping your pets clean and groomed will help stop the infestation at its source. To treat your pet:\nComb your pet’s fur with a flea comb, concentrating at the neck and tail especially\nSwish the comb around in soapy water after each brush to kill fleas\nAfter combing, soak your pet with a hose or in a tub\nLather your pet’s fur with a flea controlling shampoo\nLeave the shampoo on the fur for a few minutes\nRinse your pet down\nRepeat regularly during the spring, summer, and fall"
        },
        {
          "headline":"Vacuum regularly.",
          "description":"Adult fleas, eggs, larvae, and pupae can hide almost anywhere in your house, so you must vacuum three to four times each week to stay on top of them. Use a strong vacuum that will suck fleas and eggs from the nooks and crannies in your house. Use a brush or nozzle attachment for hard to reach areas. Vacuum floors, carpets, sideboards, furniture, around windows, and especially around areas where your pet spends the most time. After vacuuming with a bag-style vacuum, remove the bag, tie it tightly in a plastic bag, and remove it from the house immediately."
        },
        {
          "headline":"Wash bedding, drapery, clothes, and rugs.",
          "description":"Fleas and eggs won’t survive a trip through the washing machine and dryer, so launder everything that can go into the washing machine, and hand wash everything else. Use the hottest water setting and highest heat setting in the washer and dryer. Items to wash include:\nBlankets\nSheets\nPillow cases\nPillows\nShoes\nClothes\nPet toys\nPet bowls\nTowels"
        },
        {
          "headline":"Consider an insecticide.",
          "description":"Flea infestations can persist for months if you're not successful at removing all the fleas and their eggs. For stubborn infestations, use a pyrethrin-based pesticide with an insect growth regulator, such as Ultracide or Onslaught. Apply the insecticide inside and outside. Get everybody out of the house. Put on gloves, goggles, long sleeves, and a respirator to apply the insecticide. Use a dust or aerosol and apply a light mist on floors, walls, furniture, and all other surfaces inside the house. Allow the dust or spray to settle before letting people back in. Vacuum after 48 hours. Outside, apply a layer of dust or spray to the garden, on bushes and shrubs, around tall grass, in wooded areas, and around windows and doors."
        }
      ]
    }
  ],
  "text":" Making a Dish Soap Trap Fill a large, shallow dish with water. Ideal containers for a dish soap flea trap include cookie sheets, rubber tote lids, plates, and pie plates. You want a container with a large surface area and short sides. A shallow dish will help you catch as many fleas as possible, because the short sides won’t act as a barrier for jumping fleas that might land in the trap. Add dish soap. Add 1 to 2 tablespoons (15 to 30 ml) of liquid dish soap to the water. Swish the water around with a spoon or your finger to distribute the soap throughout the water. Fleas don’t drown in plain water because they aren't heavy enough to break the water’s surface tension. Adding liquid dish soap to the water reduces the surface tension. When the fleas jump into the trap, they will sink and drown. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tScott McCombe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPest Control Specialist\t\t\t\t\t\t\t\tScott McCombe is the CEO of Summit Environmental Solutions (SES), a family-owned local pest solutions, animal control, and home insulation company based in Northern Virginia. Founded in 1991, SES has an A+ rating with the Better Business Bureau and has been awarded \"Best of the Best 2017,\" “Top Rated Professional,” and “Elite Service Award\" by HomeAdvisor. Scott McCombe\t\t\tPest Control Specialist\t\t\t\tTry this variation from our expert: Make your own flea trap by putting Alka Seltzer and water in a pie tin, then place an incandescent lamp above the trap. Place the trap where fleas have been. A homemade flea trap doesn’t have the power to attract fleas, so it’s best to put it somewhere that fleas have already been in your house. Place a towel on the floor to catch spills, and lay the trap on top of the towel on the floor. Make multiple flea traps for different rooms if necessary. Common places to find fleas include:\nOn carpets and rugs\nNear pet bedding\nNear windows,doors and food\nAround pillows and furniture\nAround pet bowls\nNear drapes and curtains Leave the trap overnight. Fleas become active a couple of hours before sunset and stay active all night long, so the best time to catch them is overnight. Once you lay the trap, try to leave it undisturbed for the rest of the night. When possible, close the door to the room to keep pets and kids out. Empty and refill the trap each morning. In the morning, check the trap for dead fleas. If you caught any, dump the soapy water and rinse the dish. Fill the dish with fresh water, add more dish soap, and lay the trap out again on the towel for the next night. Repeat each night until you stop catching fleas. Attracting Fleas to the Trap Use a lamp to attract fleas. Place a directional or table lamp beside the trap. Before bed, turn on the lamp and position the bulb above the trap, so the light shines into the trap. The fleas will be attracted to the light and warmth, and when they jump toward the light, they’ll land in the trap below. Use an incandescent or other heat-producing bulb for your trap to attract the most fleas possible. Make sure the lamp is sturdy and not at risk of being knocked over into the water. Use this attractant only in rooms where you can shut the door and keep people and pets out while the lamp is on. Use a yellow-green filter on a light. Fleas are, for some reason, twice as attracted to yellow-green light as they are to other colors of light. You can increase the efficacy of your lamp attractant by using a yellow-green bulb, or by installing a yellow-green filter on a lamp with a regular bulb. You can buy colored light bulbs at many department and superstores. You may be able to find filters and gels at camera and art supply stores. Place a candle in the center of the dish. You can also use a tea light to create light and warmth that will attract fleas to the trap. Place a tea light or votive candle at the center of the trap, and light the candle before bed. As the fleas try to get close to the source, they’ll fall into the trap and drown. Place the trap away from walls, drapery, and other flammable objects. Always exercise great care and proper fire safety measures when burning candles. Close off the room to prevent people and pets from entering when the candle is lit. Place an indoor plant beside the trap. Fleas are attracted to carbon dioxide, and this is part of the mechanism they use to find a host. Because plants release carbon dioxide at night, placing one beside the trap may help to attract more fleas. Dormant flea pupae are particularly sensitive to carbon dioxide, so this may be a great way to catch young fleas before they have a chance to lay eggs. Keeping Your House Flea-Free Bathe and comb your pets. Pets are the most likely culprit for bringing fleas into your house, so keeping your pets clean and groomed will help stop the infestation at its source. To treat your pet:\nComb your pet’s fur with a flea comb, concentrating at the neck and tail especially\nSwish the comb around in soapy water after each brush to kill fleas\nAfter combing, soak your pet with a hose or in a tub\nLather your pet’s fur with a flea controlling shampoo\nLeave the shampoo on the fur for a few minutes\nRinse your pet down\nRepeat regularly during the spring, summer, and fall Vacuum regularly. Adult fleas, eggs, larvae, and pupae can hide almost anywhere in your house, so you must vacuum three to four times each week to stay on top of them. Use a strong vacuum that will suck fleas and eggs from the nooks and crannies in your house. Use a brush or nozzle attachment for hard to reach areas. Vacuum floors, carpets, sideboards, furniture, around windows, and especially around areas where your pet spends the most time. After vacuuming with a bag-style vacuum, remove the bag, tie it tightly in a plastic bag, and remove it from the house immediately. Wash bedding, drapery, clothes, and rugs. Fleas and eggs won’t survive a trip through the washing machine and dryer, so launder everything that can go into the washing machine, and hand wash everything else. Use the hottest water setting and highest heat setting in the washer and dryer. Items to wash include:\nBlankets\nSheets\nPillow cases\nPillows\nShoes\nClothes\nPet toys\nPet bowls\nTowels Consider an insecticide. Flea infestations can persist for months if you're not successful at removing all the fleas and their eggs. For stubborn infestations, use a pyrethrin-based pesticide with an insect growth regulator, such as Ultracide or Onslaught. Apply the insecticide inside and outside. Get everybody out of the house. Put on gloves, goggles, long sleeves, and a respirator to apply the insecticide. Use a dust or aerosol and apply a light mist on floors, walls, furniture, and all other surfaces inside the house. Allow the dust or spray to settle before letting people back in. Vacuum after 48 hours. Outside, apply a layer of dust or spray to the garden, on bushes and shrubs, around tall grass, in wooded areas, and around windows and doors.",
  "tyn_model":[
    "water",
    "dish soap",
    "lamp",
    "vacuum",
    "insecticide",
    "liquid dish soap",
    "towel",
    "yellow-green filter",
    "candle",
    "comb",
    "cookie sheets",
    "rubber tote lids",
    "plates",
    "pie plates",
    "spoon",
    "soap",
    "fleas",
    "pest control",
    "summit environmental",
    "pest solutions, animal control, and home insulation",
    "better business bureau and has been",
    "“top rated professional",
    "” and",
    "“elite service award\" by homeadvisor.",
    "pest control specialist\t\t\t\ttry",
    "alka seltzer",
    "pie tin",
    "incandescent lamp",
    "flea trap",
    "flea traps",
    "food",
    "incandescent or other heat-producing bulb",
    "lamp attractant",
    "yellow-green bulb",
    "colored light bulbs",
    "tea light",
    "tea light or",
    "votive candle",
    "candles",
    "plant",
    "plants",
    "flea comb",
    "soapy water",
    "hose",
    "tub",
    "flea controlling shampoo",
    "brush",
    "vacuuming",
    "plastic bag",
    "rugs",
    "eggs",
    "sheets",
    "pillow cases",
    "pillows",
    "bowls",
    "towels",
    "pesticide",
    "insect growth regulator",
    "goggles",
    "respirator",
    "dust or spray"
  ],
  "tyn_section":[

  ]
}