{
  "title":"How to Pit a Cherry",
  "url":"https://www.wikihow.com/Pit-a-Cherry",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Cutting out the Pit",
      "steps":[
        {
          "headline":"Set aside the necessary materials.",
          "description":"You will need the following:\nCherries. A knife. A cutting board."
        },
        {
          "headline":"Wash and inspect the cherry.",
          "description":"If there are any bruises, splits, or patches of mold then dispose of it and pick another one. If it is fine then continue. Wash the cherries in water that is roughly 10 degrees (Fahrenheit) above room temperature in order to prevent damage to the fruit."
        },
        {
          "headline":"Look for the \"mark\".",
          "description":"On every cherry there will be a little line that is shaped a bit like a small valley. We will call this \"the mark\". Place the cherry mark side up on the chopping board."
        },
        {
          "headline":"Carefully place your knife on the mark and press down.",
          "description":"Stop when you hit the pit."
        },
        {
          "headline":"Roll the cherry along the knife edge.",
          "description":"You should end where you began, making a straight cut along the mark and around the other side. Gently twist both sections until they come off from the pit."
        },
        {
          "headline":"Throw the pit and stem away.",
          "description":"Repeat the process until you have as many cherries as desired."
        }
      ]
    },
    {
      "name":"Scooping out the Pit",
      "steps":[
        {
          "headline":"Find a paper clip of the appropriate size.",
          "description":"You will need one that is no wider than the pit of the cherry. Wash it before use."
        },
        {
          "headline":"Wash and inspect the cherry.",
          "description":"If there are any bruises, splits, or patches of mold then dispose of it and pick another one. If it is fine then continue. Wash the cherries in water that is roughly 10 degrees (Fahrenheit) above room temperature in order to prevent damage to the fruit."
        },
        {
          "headline":"Push one end of the paper clip down into the cherry from the stem side.",
          "description":"Try to stay close to the center, making sure not to unnecessarily cut out too much of the cherry. Stop pushing it in when it is alongside the pit."
        },
        {
          "headline":"Twist the paper clip around the pit.",
          "description":"Keep it as close to the pit as possible to avoid removing the flesh of the fruit."
        },
        {
          "headline":"Pull the stem to remove the pit.",
          "description":"If the stem has fallen off, use the paper clip as a lever to pull the pit out. Repeat the process with as many additional cherries as you wish."
        }
      ]
    },
    {
      "name":"Pushing out the Pit",
      "steps":[
        {
          "headline":"Find a straw of the appropriate size.",
          "description":"You will need a straw that is fairly rigid but not too large. If it is too big it will cut an unnecessarily large hole in the cherry."
        },
        {
          "headline":"Wash and inspect the cherry.",
          "description":"If there are any bruises, splits, or patches of mold then dispose of it and pick another one. If it is fine then continue. Wash the cherries in water that is roughly 10 degrees (Fahrenheit) above room temperature in order to prevent damage to the fruit."
        },
        {
          "headline":"Grip the cherry between your first two fingers and thumb, but do not squeeze it.",
          "description":"Hold it on the sides, leaving the top (with the stem) and bottom exposed."
        },
        {
          "headline":"Push the straw down around the stem until it reaches the cherry.",
          "description":"Continue to push the straw through to the other side. The pit will be pushed out, hopefully with a minimum of the fruit."
        },
        {
          "headline":"Discard the stem and pit.",
          "description":"Repeat the steps on additional cherries until you have all you need."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cutting out the Pit Set aside the necessary materials. You will need the following:\nCherries. A knife. A cutting board. Wash and inspect the cherry. If there are any bruises, splits, or patches of mold then dispose of it and pick another one. If it is fine then continue. Wash the cherries in water that is roughly 10 degrees (Fahrenheit) above room temperature in order to prevent damage to the fruit. Look for the \"mark\". On every cherry there will be a little line that is shaped a bit like a small valley. We will call this \"the mark\". Place the cherry mark side up on the chopping board. Carefully place your knife on the mark and press down. Stop when you hit the pit. Roll the cherry along the knife edge. You should end where you began, making a straight cut along the mark and around the other side. Gently twist both sections until they come off from the pit. Throw the pit and stem away. Repeat the process until you have as many cherries as desired. Scooping out the Pit Find a paper clip of the appropriate size. You will need one that is no wider than the pit of the cherry. Wash it before use. Wash and inspect the cherry. If there are any bruises, splits, or patches of mold then dispose of it and pick another one. If it is fine then continue. Wash the cherries in water that is roughly 10 degrees (Fahrenheit) above room temperature in order to prevent damage to the fruit. Push one end of the paper clip down into the cherry from the stem side. Try to stay close to the center, making sure not to unnecessarily cut out too much of the cherry. Stop pushing it in when it is alongside the pit. Twist the paper clip around the pit. Keep it as close to the pit as possible to avoid removing the flesh of the fruit. Pull the stem to remove the pit. If the stem has fallen off, use the paper clip as a lever to pull the pit out. Repeat the process with as many additional cherries as you wish. Pushing out the Pit Find a straw of the appropriate size. You will need a straw that is fairly rigid but not too large. If it is too big it will cut an unnecessarily large hole in the cherry. Wash and inspect the cherry. If there are any bruises, splits, or patches of mold then dispose of it and pick another one. If it is fine then continue. Wash the cherries in water that is roughly 10 degrees (Fahrenheit) above room temperature in order to prevent damage to the fruit. Grip the cherry between your first two fingers and thumb, but do not squeeze it. Hold it on the sides, leaving the top (with the stem) and bottom exposed. Push the straw down around the stem until it reaches the cherry. Continue to push the straw through to the other side. The pit will be pushed out, hopefully with a minimum of the fruit. Discard the stem and pit. Repeat the steps on additional cherries until you have all you need. Finished. ",
  "tyn_model":[
    "cherries",
    "straw",
    "knife",
    "water",
    "cherry",
    "paper clip",
    "cutting board",
    "chopping board",
    "paper"
  ],
  "tyn_section":[

  ]
}