{
  "title":"How to Improve Your Drawings With Tonal Contrast",
  "url":"https://www.wikihow.com/Improve-Your-Drawings-With-Tonal-Contrast",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Coloring and Shading"
  ],
  "methods":[
    {
      "name":"How to Make a Tonal Scale",
      "steps":[
        {
          "headline":"Take a pencil and paper (preferably a grade 2B or 3B pencil, and good cartridge paper - but anything will do for the moment -  don't put it off until you can get to the art shop - start now!)",
          "description":""
        },
        {
          "headline":"Hold your pencil as loosely as you can and,  starting  a little way in - an inch (3cms) or so -  from the left-hand edge, make a small patch on the paper, as lightly and softly as possible - just let the pencil use its own weight.",
          "description":"The patch can be as big or small as you like, but something about an inch (2 or 3cms) across is ideal."
        },
        {
          "headline":"Next to this patch, make another - but this time use just a little more pressure, to make a very slightly darker patch.",
          "description":""
        },
        {
          "headline":"Continue making these patches, in a row, each one slightly darker than the last, until you find you can't make one any darker - you can go back over the patches if necessary.",
          "description":"You'll need to press harder with the pencil, and probably find yourself holding it differently,  for each patch - eventually you'll find you can't press any harder and you'll have a patch on the end of the row as dark as it will go. Now stop!"
        },
        {
          "headline":"Look at what you now have - a row of patches, each one darker than the last.",
          "description":"How many have you got? Probably 8 or 10."
        },
        {
          "headline":"Number the patches, making the first, lightest patch No.",
          "description":"2 (yes 2 - you'll see why in a minute) and the last, darkest patch, whatever number it ends up with - probably 8 or 10 (maybe 9, it doesn't matter as long as you've got a row from lightest to darkest.)"
        },
        {
          "headline":"Go back to the beginning of the scale,  and draw just a circle, or a square, so you've got a patch of pure white paper inside it.",
          "description":"That's why you started a little way in! This is your  tone Number 1."
        },
        {
          "headline":"The row should look something like this:",
          "description":""
        },
        {
          "headline":"Congratulations!",
          "description":"You've made a Tonal Scale! So what has this to do with your drawing?"
        }
      ]
    },
    {
      "name":"How to Use a Tonal Scale",
      "steps":[
        {
          "headline":"Find some drawings you've done, and compare them to the scale.",
          "description":"Try to see which tones in your drawing match  the tones on the scale. Important - use your scale, not the one here! If you think your drawing lacks something, probably the only tones you can match are in the middle range, say 4 to 6. So what does this tell you? To give your drawing dynamism, you must be able to see the dark tones - whether it's 8, 9 or 10 on your tonal scale, it needs to have, somewhere,  the darkest, strongest tone you can make. It often only needs to be a small area that has this darkest tone, but it makes all the difference to the result."
        },
        {
          "headline":"Equally important is Tone Number 1, pure white - this, and the darkest tone, give you the complete tonal range to use in your drawings.",
          "description":""
        },
        {
          "headline":"Important - You don't need all these tones - 1 to 10 - in a drawing, but you do need the lightest, No.",
          "description":"1, the darkest, No 10 (or whatever it is on your scale), and one or two in the middle range - say 4 and 6. Don't be too worried about the middle ranges, they usually look after themselves -it's the lightest and darkest which seem to cause problems, and that's the purpose of this exercise - to make you aware of them."
        },
        {
          "headline":"Look at pure white tone No 1 for a minute.",
          "description":"Although it's vital, somehow it doesn't cause a anything like the anxiety to beginners that the dark tones do!"
        },
        {
          "headline":"Beginners often make a superb tonal scale, but somehow are afraid to re-create that darkest tone on their actual drawings.",
          "description":"“I'm scared!” is a common cry…Well, it's a sheet of paper - you won't kill anyone or drown or cause an accident - so just do it!"
        },
        {
          "headline":"Good quality pencils and paper will definitely help - the next article will show you the pencil grades, and  how to get the most from them.",
          "description":""
        },
        {
          "headline":"Happy drawing!",
          "description":""
        }
      ]
    }
  ],
  "text":" How to Make a Tonal Scale Take a pencil and paper (preferably a grade 2B or 3B pencil, and good cartridge paper - but anything will do for the moment -  don't put it off until you can get to the art shop - start now!)  Hold your pencil as loosely as you can and,  starting  a little way in - an inch (3cms) or so -  from the left-hand edge, make a small patch on the paper, as lightly and softly as possible - just let the pencil use its own weight. The patch can be as big or small as you like, but something about an inch (2 or 3cms) across is ideal. Next to this patch, make another - but this time use just a little more pressure, to make a very slightly darker patch.  Continue making these patches, in a row, each one slightly darker than the last, until you find you can't make one any darker - you can go back over the patches if necessary. You'll need to press harder with the pencil, and probably find yourself holding it differently,  for each patch - eventually you'll find you can't press any harder and you'll have a patch on the end of the row as dark as it will go. Now stop! Look at what you now have - a row of patches, each one darker than the last. How many have you got? Probably 8 or 10. Number the patches, making the first, lightest patch No. 2 (yes 2 - you'll see why in a minute) and the last, darkest patch, whatever number it ends up with - probably 8 or 10 (maybe 9, it doesn't matter as long as you've got a row from lightest to darkest.) Go back to the beginning of the scale,  and draw just a circle, or a square, so you've got a patch of pure white paper inside it. That's why you started a little way in! This is your  tone Number 1. The row should look something like this:  Congratulations! You've made a Tonal Scale! So what has this to do with your drawing? How to Use a Tonal Scale Find some drawings you've done, and compare them to the scale. Try to see which tones in your drawing match  the tones on the scale. Important - use your scale, not the one here! If you think your drawing lacks something, probably the only tones you can match are in the middle range, say 4 to 6. So what does this tell you? To give your drawing dynamism, you must be able to see the dark tones - whether it's 8, 9 or 10 on your tonal scale, it needs to have, somewhere,  the darkest, strongest tone you can make. It often only needs to be a small area that has this darkest tone, but it makes all the difference to the result. Equally important is Tone Number 1, pure white - this, and the darkest tone, give you the complete tonal range to use in your drawings.  Important - You don't need all these tones - 1 to 10 - in a drawing, but you do need the lightest, No. 1, the darkest, No 10 (or whatever it is on your scale), and one or two in the middle range - say 4 and 6. Don't be too worried about the middle ranges, they usually look after themselves -it's the lightest and darkest which seem to cause problems, and that's the purpose of this exercise - to make you aware of them. Look at pure white tone No 1 for a minute. Although it's vital, somehow it doesn't cause a anything like the anxiety to beginners that the dark tones do! Beginners often make a superb tonal scale, but somehow are afraid to re-create that darkest tone on their actual drawings. “I'm scared!” is a common cry…Well, it's a sheet of paper - you won't kill anyone or drown or cause an accident - so just do it! Good quality pencils and paper will definitely help - the next article will show you the pencil grades, and  how to get the most from them.  Happy drawing! ",
  "tyn_model":[
    "pencil",
    "paper",
    "pure white paper",
    "scale",
    "“i",
    "” is",
    "…well",
    "pencils"
  ],
  "tyn_section":[

  ]
}