{
  "title":"How to Collect Fishbucks and Fishcoins in Fishao",
  "url":"https://www.wikihow.com/Collect-Fishbucks-and-Fishcoins-in-Fishao",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "parts":[
    {
      "name":"Getting Fishbucks",
      "steps":[
        {
          "headline":"Sell fish at the fish market.",
          "description":"The fish market is located at the left part of Pinheira Beach. Once you enter the fish market, you sell your fish to either John or Rick. You can sell all your fish to Rick at one time or you can sell it to John for his best daily bids. Remember that the fish market isn't open on Sunday so manage your time well. John has different prices for some fishes each day so you might want to save your fishes to sell for another time."
        },
        {
          "headline":"Collect fishbucks from your money tree.",
          "description":"Your money tree is located in the backyard of your home. The money tree can give out free fishbucks and fishcoins each day. You can upgrade your money tree so that it can give out more money. If you leave your money tree alone for a few days, the fishbucks and fishcoins won't stack up so it wouldn't be worth it. Make sure to collect money from the tree each day to receive it's maximum worth."
        },
        {
          "headline":"Sell fish, fruit, decorations and other items to other players.",
          "description":"You can use the trade system to sell items to other players while they give you fishbucks. If you are selling fish or decorations, sell rare ones since common items aren't hard to get. Set good prices for the items you are selling so that you can get profit. The recommended place to sell your items is at the middle of Pinheira Beach because lots of players go there to trade things. Although Golden Arowanas aren't extremely rare, some people price it for up to 400 fishbucks and they are still bought! Remember that there are some things you can't trade such as fishcoins."
        },
        {
          "headline":"Trade with Vasily.",
          "description":"Vasily is a non-player character(NPC), you could still trade bait, gadgets, decoration, and rods to get fishbucks from him. Although he will buy your items at a low price, he will still give you some fishbucks for it."
        },
        {
          "headline":"Complete missions.",
          "description":"Some missions award you fishbucks. Once you complete the mission(s), you can collect your award and receive the fishbucks."
        },
        {
          "headline":"Get referrals.",
          "description":"Go to your profile then click on the referrals tab. Copy your referral link and advertise it to people or invite your friends. Once they reach a certain level, you will get free fishbucks."
        }
      ]
    },
    {
      "name":"Getting Fishcoins",
      "steps":[
        {
          "headline":"Play Bob's mini-game.",
          "description":"You can play Bob's mini-game once a week. Each time you play it, you can get a maximum of 10 fishcoins! You can find him near the tents in Rio Tropical. The fishcoins will be scattered all over Rio. You will not find fishcoins in trees, on water, on the bridge, in Little Rio, or in homes. Running shoes are good to have because they make you run instead of walk. That way, you can get the fishcoins quicker."
        },
        {
          "headline":"Find Herb.",
          "description":"Although you might not be able to find him all the time, Herb can give you 2 to 4 fishcoins for completing his easy missions. That way, you can easily earn some fishcoins. His location is usually different everyday. If you don't want to find him yourself, you can always ask other people or look at the Fishaowiki forum thread that tracks Herb's locations. To go to the forum thread, type in \"fishao herb daily\" and click the first link. Then go to the latest post to see where Herb was most recently spotted."
        },
        {
          "headline":"Talk to Ben.",
          "description":"Once in a while, Ben could be able to give you a fishcoin. Be sure to check with Ben everyday so that you won't miss out on anything."
        },
        {
          "headline":"Participate in tournaments.",
          "description":"Although you have to spend 5 fishcoins to enter, you could reap more if you are able to get yourself into the three winning positions."
        },
        {
          "headline":"Collect fishcoins from your money tree.",
          "description":"Apart from fishbucks, your money tree can also give out fishcoins. The ratio between fishcoins and fishbucks is low so you have to stay patient."
        },
        {
          "headline":"Complete missions.",
          "description":"There are several missions that can give you fishcoins. Try to complete them so that you can get the fishcoins."
        },
        {
          "headline":"Be on the top of the list of players in events.",
          "description":"Events can give you a large sum of fishbucks or fishcoins. The players that are at the top of list will receive the money. Events could range from gaining the most experience to catch as many piranhas as you can. Events are timed and the top players will receive their rewards once the time is up. The time varies. Some are a few minutes and some are several hours."
        }
      ]
    }
  ],
  "text":" Getting Fishbucks Sell fish at the fish market. The fish market is located at the left part of Pinheira Beach. Once you enter the fish market, you sell your fish to either John or Rick. You can sell all your fish to Rick at one time or you can sell it to John for his best daily bids. Remember that the fish market isn't open on Sunday so manage your time well. John has different prices for some fishes each day so you might want to save your fishes to sell for another time. Collect fishbucks from your money tree. Your money tree is located in the backyard of your home. The money tree can give out free fishbucks and fishcoins each day. You can upgrade your money tree so that it can give out more money. If you leave your money tree alone for a few days, the fishbucks and fishcoins won't stack up so it wouldn't be worth it. Make sure to collect money from the tree each day to receive it's maximum worth. Sell fish, fruit, decorations and other items to other players. You can use the trade system to sell items to other players while they give you fishbucks. If you are selling fish or decorations, sell rare ones since common items aren't hard to get. Set good prices for the items you are selling so that you can get profit. The recommended place to sell your items is at the middle of Pinheira Beach because lots of players go there to trade things. Although Golden Arowanas aren't extremely rare, some people price it for up to 400 fishbucks and they are still bought! Remember that there are some things you can't trade such as fishcoins. Trade with Vasily. Vasily is a non-player character(NPC), you could still trade bait, gadgets, decoration, and rods to get fishbucks from him. Although he will buy your items at a low price, he will still give you some fishbucks for it. Complete missions. Some missions award you fishbucks. Once you complete the mission(s), you can collect your award and receive the fishbucks. Get referrals. Go to your profile then click on the referrals tab. Copy your referral link and advertise it to people or invite your friends. Once they reach a certain level, you will get free fishbucks. Getting Fishcoins Play Bob's mini-game. You can play Bob's mini-game once a week. Each time you play it, you can get a maximum of 10 fishcoins! You can find him near the tents in Rio Tropical. The fishcoins will be scattered all over Rio. You will not find fishcoins in trees, on water, on the bridge, in Little Rio, or in homes. Running shoes are good to have because they make you run instead of walk. That way, you can get the fishcoins quicker. Find Herb. Although you might not be able to find him all the time, Herb can give you 2 to 4 fishcoins for completing his easy missions. That way, you can easily earn some fishcoins. His location is usually different everyday. If you don't want to find him yourself, you can always ask other people or look at the Fishaowiki forum thread that tracks Herb's locations. To go to the forum thread, type in \"fishao herb daily\" and click the first link. Then go to the latest post to see where Herb was most recently spotted. Talk to Ben. Once in a while, Ben could be able to give you a fishcoin. Be sure to check with Ben everyday so that you won't miss out on anything. Participate in tournaments. Although you have to spend 5 fishcoins to enter, you could reap more if you are able to get yourself into the three winning positions. Collect fishcoins from your money tree. Apart from fishbucks, your money tree can also give out fishcoins. The ratio between fishcoins and fishbucks is low so you have to stay patient. Complete missions. There are several missions that can give you fishcoins. Try to complete them so that you can get the fishcoins. Be on the top of the list of players in events. Events can give you a large sum of fishbucks or fishcoins. The players that are at the top of list will receive the money. Events could range from gaining the most experience to catch as many piranhas as you can. Events are timed and the top players will receive their rewards once the time is up. The time varies. Some are a few minutes and some are several hours.",
  "tyn_model":[
    "fish",
    "fish market",
    "fishes",
    "decorations",
    "money tree",
    "fruit",
    "arowanas",
    "bait",
    "rods",
    "water",
    "herb",
    "piranhas"
  ],
  "tyn_section":[

  ]
}