{
  "title":"How to Section Citrus Fruit",
  "url":"https://www.wikihow.com/Section-Citrus-Fruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Citrus Fruits"
  ],
  "steps":[
    {
      "headline":"Wash your hands and the fruit because the juice will flow as you cut.",
      "description":""
    },
    {
      "headline":"Use a sharp, thin-bladed knife.",
      "description":"Peel over a bowl to catch the juice."
    },
    {
      "headline":"Begin by cutting off the ends of the citrus fruit--orange or grapefruit.",
      "description":""
    },
    {
      "headline":"You can see how thick the peeling is, so cut into the peel till you reach the fruit.",
      "description":""
    },
    {
      "headline":"Turn the knife blade parallel to the surface of the flesh of the fruit and begin cutting about an inch wide.",
      "description":""
    },
    {
      "headline":"Turn the fruit as you cut and the peel will come off in a conical strip.",
      "description":""
    },
    {
      "headline":"If the peel is cut off at any point, just begin again and cut in a spiral down the length of the fruit around and around.",
      "description":""
    },
    {
      "headline":"Hold the fruit with the sections going away from you.",
      "description":""
    },
    {
      "headline":"Insert the tip of blade on one side of a section and cut next to the membrane all the way from the center to the edge of the fruit.",
      "description":""
    },
    {
      "headline":"Insert the blade against the section at the center of the fruit and under the piece of fruit you want to separate from the next membrane.",
      "description":""
    },
    {
      "headline":"Lift the section with the knife blade and away from the membrane all the way to the edge till the whole section drops.",
      "description":""
    },
    {
      "headline":"Insert the blade against the next membrane and cut it away from that next section.",
      "description":""
    },
    {
      "headline":"Again re-insert the blade under the next section and separate it from the next membrane.",
      "description":""
    },
    {
      "headline":"Repeat for each section.",
      "description":""
    },
    {
      "headline":"Squeeze the remaining pulp and membrane to remove all the juice.",
      "description":""
    },
    {
      "headline":"If there are seeds, remove them with a fork.",
      "description":""
    },
    {
      "headline":"Enjoy.",
      "description":""
    }
  ],
  "text":" Wash your hands and the fruit because the juice will flow as you cut.  Use a sharp, thin-bladed knife. Peel over a bowl to catch the juice. Begin by cutting off the ends of the citrus fruit--orange or grapefruit.  You can see how thick the peeling is, so cut into the peel till you reach the fruit.  Turn the knife blade parallel to the surface of the flesh of the fruit and begin cutting about an inch wide.  Turn the fruit as you cut and the peel will come off in a conical strip.  If the peel is cut off at any point, just begin again and cut in a spiral down the length of the fruit around and around.  Hold the fruit with the sections going away from you.  Insert the tip of blade on one side of a section and cut next to the membrane all the way from the center to the edge of the fruit.  Insert the blade against the section at the center of the fruit and under the piece of fruit you want to separate from the next membrane.  Lift the section with the knife blade and away from the membrane all the way to the edge till the whole section drops.  Insert the blade against the next membrane and cut it away from that next section.  Again re-insert the blade under the next section and separate it from the next membrane.  Repeat for each section.  Squeeze the remaining pulp and membrane to remove all the juice.  If there are seeds, remove them with a fork.  Enjoy. ",
  "tyn_model":[
    "knife",
    "fruit",
    "bowl",
    "citrus fruit",
    "peeling",
    "fork"
  ],
  "tyn_section":[

  ]
}