{
  "title":"How to Add Your Own Flash Head to set.a.light 3D Studio",
  "url":"https://www.wikihow.com/Add-Your-Own-Flash-Head-to-set.a.light-3D-Studio",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "methods":[
    {
      "name":"Using the Edit Menu",
      "steps":[
        {
          "headline":"After starting up set.a.light, go to Edit >> Menu.",
          "description":""
        },
        {
          "headline":"Look at your flash head and determine what its control range is.",
          "description":"If you can't find it on the flash, look around on the Internet. Usually, someone has posted that information somewhere."
        },
        {
          "headline":"Press Add.",
          "description":""
        },
        {
          "headline":"If done, press Close to close out the dialog box, or add another one.",
          "description":""
        }
      ]
    },
    {
      "name":"Using the Flash Head Menu (Preferred)",
      "steps":[
        {
          "headline":"Add a speedlight by going to the Speedlight option and select Speedlight.",
          "description":""
        },
        {
          "headline":"Drag the speedlight to the studio.",
          "description":""
        },
        {
          "headline":"With the speedlight still selected, look to the left of the screen where you will see the flash head.",
          "description":"Towards the bottom of the window, you will see a + sign."
        },
        {
          "headline":"Click on the + sign.",
          "description":"This will take you to the Add Flash head dialog box. Be aware that at this time, it is different than the other method."
        },
        {
          "headline":"Name the flash.",
          "description":"It is usually a good idea to be as descriptive as possible in the title to ensure that you know to which flash you refer to."
        },
        {
          "headline":"Set the Control Range.",
          "description":""
        },
        {
          "headline":"Set the Focal Length.",
          "description":""
        },
        {
          "headline":"Set the Guide Number.",
          "description":"All of this information should be with your documentation of your flash, or on the Internet."
        },
        {
          "headline":"Select Add, then Close, unless you need to add more.",
          "description":""
        }
      ]
    }
  ],
  "text":" Using the Edit Menu After starting up set.a.light, go to Edit >> Menu.  Look at your flash head and determine what its control range is. If you can't find it on the flash, look around on the Internet. Usually, someone has posted that information somewhere. Press Add.  If done, press Close to close out the dialog box, or add another one.  Using the Flash Head Menu (Preferred) Add a speedlight by going to the Speedlight option and select Speedlight.  Drag the speedlight to the studio.  With the speedlight still selected, look to the left of the screen where you will see the flash head. Towards the bottom of the window, you will see a + sign. Click on the + sign. This will take you to the Add Flash head dialog box. Be aware that at this time, it is different than the other method. Name the flash. It is usually a good idea to be as descriptive as possible in the title to ensure that you know to which flash you refer to. Set the Control Range.  Set the Focal Length.  Set the Guide Number. All of this information should be with your documentation of your flash, or on the Internet. Select Add, then Close, unless you need to add more. ",
  "tyn_model":[
    "speedlight"
  ],
  "tyn_section":[

  ]
}