{
  "title":"How to Make Chocolate River Bars",
  "url":"https://www.wikihow.com/Make-Chocolate-River-Bars",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Bars and Slices"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 350 degrees Fahrenheit.",
      "description":""
    },
    {
      "headline":"Line a 5×9 inch loaf pan with parchment paper.",
      "description":""
    },
    {
      "headline":"Get a large bowl.",
      "description":"Using a wooden spoon, cream together the margarine and both types of sugars including the brown and white sugars."
    },
    {
      "headline":"Add the egg and vanilla and beat the batter until smooth with the wooden spoon.",
      "description":""
    },
    {
      "headline":"Combine the flour, baking soda and salt in a small bowl, without sifting the flour.",
      "description":""
    },
    {
      "headline":"Add the flour mixture gradually to creamy mixture, mixing until the batter is smooth.",
      "description":""
    },
    {
      "headline":"Spread batter evenly into the loaf pan.",
      "description":"Sprinkle the chocolate chips evenly over the top."
    },
    {
      "headline":"Place in preheated oven for two minutes.",
      "description":""
    },
    {
      "headline":"Remove the pan from the oven and gently swirl the melted chocolate into the batter using a butter knife.",
      "description":""
    },
    {
      "headline":"Return pan to the oven for 18 to 20 minutes or until golden brown.",
      "description":""
    },
    {
      "headline":"Let it cool on the cooling rack before cutting into squares.",
      "description":""
    }
  ],
  "text":" Preheat oven to 350 degrees Fahrenheit.  Line a 5×9 inch loaf pan with parchment paper.  Get a large bowl. Using a wooden spoon, cream together the margarine and both types of sugars including the brown and white sugars. Add the egg and vanilla and beat the batter until smooth with the wooden spoon.  Combine the flour, baking soda and salt in a small bowl, without sifting the flour.  Add the flour mixture gradually to creamy mixture, mixing until the batter is smooth.  Spread batter evenly into the loaf pan. Sprinkle the chocolate chips evenly over the top. Place in preheated oven for two minutes.  Remove the pan from the oven and gently swirl the melted chocolate into the batter using a butter knife.  Return pan to the oven for 18 to 20 minutes or until golden brown.  Let it cool on the cooling rack before cutting into squares. ",
  "tyn_model":[
    "oven",
    "flour",
    "loaf pan",
    "wooden spoon",
    "parchment paper",
    "large bowl",
    "margarine",
    "egg",
    "vanilla",
    "baking soda",
    "salt",
    "small bowl",
    "chocolate chips",
    "chocolate",
    "butter knife"
  ],
  "tyn_section":[

  ]
}