{
  "title":"How to Make Felt Flowers",
  "url":"https://www.wikihow.com/Make-Felt-Flowers",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Making Felt Roses",
      "steps":[
        {
          "headline":"Select your felt.",
          "description":"To create felt roses, you will need to cut large circles out of your felt. Choose any color you would like, and consider choosing additional shades of green felt to create matching leaves."
        },
        {
          "headline":"Cut your felt.",
          "description":"To start your rose, you will need to use a felt circle. It doesn’t need to be a perfect circle, so you can either trace a round object or freehand it. Make the circle anywhere from 4–10 inches (10.2–25.4 cm) in diameter depending on how large you would like your rose to be."
        },
        {
          "headline":"Create a spiral.",
          "description":"Use a pair of scissors to cut a spiral into your felt circle. Start at one edge, and cut a spiral inwards using a wavy-cut until you reach the center of the circle. Take your scissors and cut a wavy pattern around the edge of the circle as well, so that you are left with a flat, snake-like spiral."
        },
        {
          "headline":"Roll up the spiral.",
          "description":"Start at the outside edge of the spiral and begin rolling it inwards. Pinch the base of the spiral as you roll to create the base of the flower. When the spiral is completely rolled up, it will create a pretty rose shape."
        },
        {
          "headline":"Secure the rose.",
          "description":"Turn your felted rose over and use a needle and thread to stitch the spiral together. Tie a knot at one end of your thread and add several stitches to the back to keep the layers of the rose in place. Tie off your thread with a second knot, and you’re finished!"
        }
      ]
    },
    {
      "name":"Making Felt Lilacs",
      "steps":[
        {
          "headline":"Choose your felt.",
          "description":"For this pattern, you will be making multiple small felt flowers and attaching them in a bunch to a felt base, similar to the appearance of lilacs in real life. For a traditional lilac look, use cream fuschia, or lavender colored felt with matching thread."
        },
        {
          "headline":"Cut your template.",
          "description":"To start your flowers out, you will need to cut many small circles. Cut between 5-15 circles measuring 1 inch (2.5 cm) in diameter. You will also need to cut one larger circle to act as the backing. This will change in size depending on the number of blossoms you decide to create, but should be large enough that you can place all your small circles on it without seeing any edges."
        },
        {
          "headline":"Cut your flowers.",
          "description":"With your circles cut out, you can create your lilac blossoms. In each circle, cut out a rounded “+” shape to look like a lilac bud. Try to use as much of the circle as you can by cutting away a minimal amount of fabric."
        },
        {
          "headline":"Sew your buds together.",
          "description":"Arrange your small lilac blossoms over the larger felt circle you have created. Use a needle and corresponding thread to sew each blossom to the base using an “x” shape in the center of the flowers. Overlap the flowers to create texture and add a realistic appearance."
        },
        {
          "headline":"Finish your bunch.",
          "description":"As you finish sewing on all your small blossoms, tie a knot in the back of the bunch with your thread and cut the excess string. Add felt flowers if you want, but if not, enjoy your pretty new lilac blooms!"
        }
      ]
    },
    {
      "name":"Making Felt Peonies",
      "steps":[
        {
          "headline":"Select your felt.",
          "description":"This method of making peonies requires long, skinny strips of felt, so use fabric that you have long pieces of. You can use any color you would like."
        },
        {
          "headline":"Cut your felt to size.",
          "description":"Your felt strips will need to be 1½ inch wide and whatever length you would like. The longer the piece of felt you use, the larger your flower will be."
        },
        {
          "headline":"Glue your strips.",
          "description":"To create the illusion of petals, you will need to create a loop out of each strip of felt. Fold the felt in half and dab glue along the edge of the fabric all the way across the strip. Hold the edges together until it is dry, forming a long, narrow, oblong tube."
        },
        {
          "headline":"Create your petals.",
          "description":"Use a pair of scissors to cut small notches in the loop. Cut notches that go ⅔ of the way down the loop (from the top, not the glued end) and are ¼ inch apart. You will end up with several dozen small loops attached along a single band of felt at the bottom. You can cut the felt straight down or at a slight angle to get different variations of petals. Try both to see which you prefer. Experiment with the distance between the slits you cut, as these will create petals of different sizes. For a very intricate flower, make cuts very close together. For a chunky flower, space your notches farther apart."
        },
        {
          "headline":"Roll up your flower.",
          "description":"Start at one end and begin rolling the felt strip inwards along the glued bottom edge. As you roll, dab glue on the inside of the felt so that the flower sticks together. When you reach the end, add a bit more glue to secure it."
        },
        {
          "headline":"Finish your peony.",
          "description":"When the flower has been rolled up completely, it is done! For extra security, add a few stitches of thread in addition to the glue you used to keep the flower together. You can optionally add a few felt leaves to complete the blossom."
        }
      ]
    },
    {
      "name":"Making Felt Dahlias",
      "steps":[
        {
          "headline":"Choose the best felt.",
          "description":"Dahlias require many small parts and thusly need a lot of felt. Make sure that you have several full-sized strips of fabric to do this project. Use any color you would like for the flowers, and use shades of green to create matching leaves."
        },
        {
          "headline":"Cut your template.",
          "description":"The dahlias will have three layers of petals, so you will need to cut three sections of felt in differing sizes. Cut 16 rectangles measuring ½ inch x 2 inches (5.1 cm), cut 10 rectangles measuring ½ inch by 1½ inches, and 7 rectangle measuring ½ inch x 1 inch (2.5 cm). You will also need a circular base measuring 3 inches (7.6 cm) across."
        },
        {
          "headline":"Cut your petals.",
          "description":"To form the shape of a dahlia petal, draw an oblong diamond shape onto each rectangle. Have two points in the center across the length, and add two more points ⅓ of the way from the top across the width. Cut these shapes out."
        },
        {
          "headline":"Adjust the shape.",
          "description":"Use your scissors to sculpt each petal into the correct form. Round the edges of the two points nearest to the top of the diamond, and cut ¼ of the way up the petal straight across to create a horizontal base. You will now be left with a shape reminiscent of the Pope’s hat."
        },
        {
          "headline":"Form the petals.",
          "description":"At the base of each petal, add a dab of hot glue and fold the sides in till they meet at the center. This will leave the top part of the petal open while creating a rolled edge and pleat down the center of the bottom of the petal. Do this for all of the petal forms."
        },
        {
          "headline":"Combine the petals.",
          "description":"Add the largest petals to your circular base by adding a dab of glue to the back (near the bottom) and sticking it to the base about ¼ of an inch from the edge. Work your way around until all your petals are glued."
        },
        {
          "headline":"Add your second layer of petals.",
          "description":"Use the medium-sized petals to create the second layer for your dahlia. Put a small dab of glue to the back of the petal, and stick them ¼ of an inch below the base of the first layer."
        },
        {
          "headline":"Glue on your final petals.",
          "description":"Use the smallest petals last, and glue them in a final row ¼ of an inch below the base of the second level of petals. You will be left with an open center on the felt circle."
        },
        {
          "headline":"Finish your dahlia.",
          "description":"Add a pretty button, bead, brooch, or bit of colored felt with glue to the center of the dahlias to finish them off. Additionally, you can choose to glue or stitch on some green felt leaves to the bottom of the flower. You’re done!"
        }
      ]
    },
    {
      "name":"Making Felt Hydrangeas",
      "steps":[
        {
          "headline":"Select your felt.",
          "description":"Hydrangeas are made from multiple small sections glued together, so make sure you have a fairly sizeable piece of felt to start this project. You can use multiple colors for a single flower if you want."
        },
        {
          "headline":"Cut your template.",
          "description":"To begin, you will need to cut 6 flower shapes from your felt. You can cut them to be any size, with larger pieces equalling a larger flower. Cut each piece to be a five petal flower with rounded edges (think of the flowers you drew as a kid). Also, cut out a small circle at least 1 inch (2.5 cm) in diameter; increase the size of the circle for a larger bunch of hydrangeas."
        },
        {
          "headline":"Fold your petals in half.",
          "description":"Take each petal and fold it in half, adding a small dab of hot glue to the center of the flower. Because there are 5 sides to each bud, the edges won’t line up perfectly and that’s ok. Don’t glue the petals all the way across, because you want them to stay open along the edges."
        },
        {
          "headline":"Fold your petals again.",
          "description":"With all of your petals folded and stuck together in half, fold them in half a second time. This will leave you with a small pyramid-esq petal shape. Use another small dab of glue in the center of each petal to hold the form, but don’t add glue anywhere else."
        },
        {
          "headline":"Combine your petals.",
          "description":"Glue the tip of each petal bunch to the small circle you cut. The flat sides of the folded petals should fit together nicely, and give you a lovely hydrangea clump. Add additional felt leaves for a finishing touch."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Felt Roses Select your felt. To create felt roses, you will need to cut large circles out of your felt. Choose any color you would like, and consider choosing additional shades of green felt to create matching leaves. Cut your felt. To start your rose, you will need to use a felt circle. It doesn’t need to be a perfect circle, so you can either trace a round object or freehand it. Make the circle anywhere from 4–10 inches (10.2–25.4 cm) in diameter depending on how large you would like your rose to be. Create a spiral. Use a pair of scissors to cut a spiral into your felt circle. Start at one edge, and cut a spiral inwards using a wavy-cut until you reach the center of the circle. Take your scissors and cut a wavy pattern around the edge of the circle as well, so that you are left with a flat, snake-like spiral. Roll up the spiral. Start at the outside edge of the spiral and begin rolling it inwards. Pinch the base of the spiral as you roll to create the base of the flower. When the spiral is completely rolled up, it will create a pretty rose shape. Secure the rose. Turn your felted rose over and use a needle and thread to stitch the spiral together. Tie a knot at one end of your thread and add several stitches to the back to keep the layers of the rose in place. Tie off your thread with a second knot, and you’re finished! Making Felt Lilacs Choose your felt. For this pattern, you will be making multiple small felt flowers and attaching them in a bunch to a felt base, similar to the appearance of lilacs in real life. For a traditional lilac look, use cream fuschia, or lavender colored felt with matching thread. Cut your template. To start your flowers out, you will need to cut many small circles. Cut between 5-15 circles measuring 1 inch (2.5 cm) in diameter. You will also need to cut one larger circle to act as the backing. This will change in size depending on the number of blossoms you decide to create, but should be large enough that you can place all your small circles on it without seeing any edges. Cut your flowers. With your circles cut out, you can create your lilac blossoms. In each circle, cut out a rounded “+” shape to look like a lilac bud. Try to use as much of the circle as you can by cutting away a minimal amount of fabric. Sew your buds together. Arrange your small lilac blossoms over the larger felt circle you have created. Use a needle and corresponding thread to sew each blossom to the base using an “x” shape in the center of the flowers. Overlap the flowers to create texture and add a realistic appearance. Finish your bunch. As you finish sewing on all your small blossoms, tie a knot in the back of the bunch with your thread and cut the excess string. Add felt flowers if you want, but if not, enjoy your pretty new lilac blooms! Making Felt Peonies Select your felt. This method of making peonies requires long, skinny strips of felt, so use fabric that you have long pieces of. You can use any color you would like. Cut your felt to size. Your felt strips will need to be 1½ inch wide and whatever length you would like. The longer the piece of felt you use, the larger your flower will be. Glue your strips. To create the illusion of petals, you will need to create a loop out of each strip of felt. Fold the felt in half and dab glue along the edge of the fabric all the way across the strip. Hold the edges together until it is dry, forming a long, narrow, oblong tube. Create your petals. Use a pair of scissors to cut small notches in the loop. Cut notches that go ⅔ of the way down the loop (from the top, not the glued end) and are ¼ inch apart. You will end up with several dozen small loops attached along a single band of felt at the bottom. You can cut the felt straight down or at a slight angle to get different variations of petals. Try both to see which you prefer. Experiment with the distance between the slits you cut, as these will create petals of different sizes. For a very intricate flower, make cuts very close together. For a chunky flower, space your notches farther apart. Roll up your flower. Start at one end and begin rolling the felt strip inwards along the glued bottom edge. As you roll, dab glue on the inside of the felt so that the flower sticks together. When you reach the end, add a bit more glue to secure it. Finish your peony. When the flower has been rolled up completely, it is done! For extra security, add a few stitches of thread in addition to the glue you used to keep the flower together. You can optionally add a few felt leaves to complete the blossom. Making Felt Dahlias Choose the best felt. Dahlias require many small parts and thusly need a lot of felt. Make sure that you have several full-sized strips of fabric to do this project. Use any color you would like for the flowers, and use shades of green to create matching leaves. Cut your template. The dahlias will have three layers of petals, so you will need to cut three sections of felt in differing sizes. Cut 16 rectangles measuring ½ inch x 2 inches (5.1 cm), cut 10 rectangles measuring ½ inch by 1½ inches, and 7 rectangle measuring ½ inch x 1 inch (2.5 cm). You will also need a circular base measuring 3 inches (7.6 cm) across. Cut your petals. To form the shape of a dahlia petal, draw an oblong diamond shape onto each rectangle. Have two points in the center across the length, and add two more points ⅓ of the way from the top across the width. Cut these shapes out. Adjust the shape. Use your scissors to sculpt each petal into the correct form. Round the edges of the two points nearest to the top of the diamond, and cut ¼ of the way up the petal straight across to create a horizontal base. You will now be left with a shape reminiscent of the Pope’s hat. Form the petals. At the base of each petal, add a dab of hot glue and fold the sides in till they meet at the center. This will leave the top part of the petal open while creating a rolled edge and pleat down the center of the bottom of the petal. Do this for all of the petal forms. Combine the petals. Add the largest petals to your circular base by adding a dab of glue to the back (near the bottom) and sticking it to the base about ¼ of an inch from the edge. Work your way around until all your petals are glued. Add your second layer of petals. Use the medium-sized petals to create the second layer for your dahlia. Put a small dab of glue to the back of the petal, and stick them ¼ of an inch below the base of the first layer. Glue on your final petals. Use the smallest petals last, and glue them in a final row ¼ of an inch below the base of the second level of petals. You will be left with an open center on the felt circle. Finish your dahlia. Add a pretty button, bead, brooch, or bit of colored felt with glue to the center of the dahlias to finish them off. Additionally, you can choose to glue or stitch on some green felt leaves to the bottom of the flower. You’re done! Making Felt Hydrangeas Select your felt. Hydrangeas are made from multiple small sections glued together, so make sure you have a fairly sizeable piece of felt to start this project. You can use multiple colors for a single flower if you want. Cut your template. To begin, you will need to cut 6 flower shapes from your felt. You can cut them to be any size, with larger pieces equalling a larger flower. Cut each piece to be a five petal flower with rounded edges (think of the flowers you drew as a kid). Also, cut out a small circle at least 1 inch (2.5 cm) in diameter; increase the size of the circle for a larger bunch of hydrangeas. Fold your petals in half. Take each petal and fold it in half, adding a small dab of hot glue to the center of the flower. Because there are 5 sides to each bud, the edges won’t line up perfectly and that’s ok. Don’t glue the petals all the way across, because you want them to stay open along the edges. Fold your petals again. With all of your petals folded and stuck together in half, fold them in half a second time. This will leave you with a small pyramid-esq petal shape. Use another small dab of glue in the center of each petal to hold the form, but don’t add glue anywhere else. Combine your petals. Glue the tip of each petal bunch to the small circle you cut. The flat sides of the folded petals should fit together nicely, and give you a lovely hydrangea clump. Add additional felt leaves for a finishing touch. Finished. ",
  "tyn_model":[
    "glue",
    "felt",
    "thread",
    "scissors",
    "fabric",
    "” shape",
    "felt leaves",
    "hot glue",
    "felt roses",
    "needle and thread",
    "felt base",
    "flowers",
    "“+",
    "needle",
    "“x",
    "string",
    "felt strips",
    "⅔ of",
    "felt strip",
    "peony",
    "petals",
    "dahlia petal",
    "⅓ of",
    "hydrangeas"
  ],
  "tyn_section":[

  ]
}