{
  "title":"How to Get Rid of Garden Moles",
  "url":"https://www.wikihow.com/Get-Rid-of-Garden-Moles",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "methods":[
    {
      "name":"Setting a Trap",
      "steps":[
        {
          "headline":"Place toxic baits in the tunnels.",
          "description":"Toxic baits will resemble earthworms, which are the mole’s primary food source. Find a tunnel running through your garden and dig into it. Drop 1 of the baits into the tunnel and then fill in the hole you dug. Place 3 or 4 baits throughout the tunnel or near exposed molehills. Toxic mole baits can be purchased at most gardening stores or online. If you notice new mounds appearing in your garden, place more baits near them. Many times, baits will not be enough and you will need to pair them with traps."
        },
        {
          "headline":"Use a spear trap for shallow tunnels.",
          "description":"Spear or harpoon traps are spring-loaded and impale the mole as it passes through its tunnel. Use your thumbs to depress the center of an active tunnel by about 1 inch (2.5 cm). Push the trap into the soil so just the tips of the spikes are in the ground. When the mole passes through the tunnel, the trap will set and stab into the mole. Use caution when setting the trap since it has sharp, spring-loaded edges. If you have pets or children that play outdoors, select a different trap since spear traps have sharp exposed edges."
        },
        {
          "headline":"Set a scissor trap for deeper tunnels.",
          "description":"Dig into and expose the tunnel with a tool the same width of the trap. Build up a mound of compact dirt in the middle of the tunnel. Set the trap on top of the mound, following the instructions on the package. When the mole tries to dig through the mound, the trap activates and snaps the blades together to kill the mole."
        },
        {
          "headline":"Lay a barrel trap in the tunnel for minimal setup.",
          "description":"Dig a hole the size of the hole into an active tunnel. Fit the barrel into the hole and cover it so sunlight cannot penetrate through. When the mole moves through the barrel, claws will puncture the mole and kill it efficiently. Barrel traps are effective for yards if you have pets or children."
        },
        {
          "headline":"Make a humane trap by burying a bucket under their tunnel.",
          "description":"Dig a hole large enough to fit a jar or large bucket underneath the bottom of a mole tunnel. Keep the lip of the bucket level with the tunnel’s bottom. Cover the tunnel with dirt so no sunlight gets through. Check the trap twice daily to see if you’ve caught any moles. Release live moles somewhere 5 miles (8.0 km) away from your yard and be sure they are not near any other garden."
        }
      ]
    },
    {
      "name":"Using Household Treatments",
      "steps":[
        {
          "headline":"Flood the tunnels using a garden hose.",
          "description":"Take your hose and place the spout in one of the molehills. Turn your hose on to a steady stream until the tunnel floods. Keep your eyes on other molehills in your garden to see if a mole tries to escape. If problems persist, try flooding the tunnels again. Most moles can swim, so it may take a while for the moles to come to the surface for air."
        },
        {
          "headline":"Sprinkle strong-scented materials near the molehills.",
          "description":"Moles have very sensitive noses and strong scents can deter them from the area. Using materials such as red pepper, cayenne, or coffee grounds near the entrances of molehills can make a mole abandon an area. Blood meal fertilizer has a high nitrogen content and helps plants grow while also deterring moles from the area. Be sure to always re-apply the material after it rains, otherwise a mole may return to its tunnels."
        },
        {
          "headline":"Plug the molehill with a corn cob dipped in roofing tar.",
          "description":"Since roofing tar has a strong smell, moles will avoid the area. A corn cob is a perfect size for fitting into the hole leading into a mole’s tunnel. Plug each of the entrances to force the mole out from the ground."
        },
        {
          "headline":"Make a castor oil repellent.",
          "description":"Castor oil has a pungent smell and makes a good repellent for moles. Mix 3 parts castor oil to 1 part dish detergent. Combine 4 tablespoons (59 ml) of the liquid with 1 gallon (3.8 L) of water. Pour the mixture into and around the tunnels. Pouring the full amount across the molehills will also coat some of the mole's food source and cause it to taste foul."
        }
      ]
    },
    {
      "name":"Taking Preventative Measures",
      "steps":[
        {
          "headline":"Keep a cat outside to hunt the moles.",
          "description":"Cats hunt and kill small mammals like moles and mice. Let your cat explore and hunt in your yard. Even the smell of an outdoor cat will help deter them from the area. Using cat litter around or in the molehills will discourage moles from the area."
        },
        {
          "headline":"Water your garden less.",
          "description":"Moles essentially “swim” through the ground with their front paws. When the soil is drier, it is more difficult for the mole to burrow and travel through the ground. Watering your garden less will attract fewer earthworms and make moles find new food sources."
        },
        {
          "headline":"Bury a wire mesh 18 inches (0.46 m) into the ground around your garden.",
          "description":"Measure the total length around your garden to find how much mesh you will need. Dig a trench around your garden that is 18 inches (0.46 m) deep. Leave 6 inches (15 cm) of mesh exposed above the ground. You can purchase wire mesh at any home improvement or garden store. It is possible for moles to chew through the wire mesh, so consider opting thicker or sturdier wire. EXPERT TIP\t\"Moles don't really damage the plants, so in a vegetable garden, we just line the bed with wire so the moles can't disturb the seedlings.\" Steve Masley\t\t\t\t\tOrganic Vegetable Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years. He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening. In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University. Steve MasleyOrganic Vegetable Gardener"
        },
        {
          "headline":"Spray beneficial nematodes on the ground to remove grubs.",
          "description":"Nematodes are a small bacteria that infect the grubs in your yard to use as their food source. Purchase a nematode solution online or in gardening stores. Follow the directions on the packaging to spread it across your yard. Nematodes will also kill Japanese beetle larva, so you can get rid of two pests at once!"
        },
        {
          "headline":"Create a barrier with rocks or gravel underground.",
          "description":"Dig out an area 1 foot (0.30 m) wide and 24 inches (0.61 m) deep. Fill the hole with gravel so a mole can not dig through it. Cover the gravel with a thin layer of soil or sod to keep a uniform look in your lawn or garden."
        }
      ]
    }
  ],
  "text":" Setting a Trap Place toxic baits in the tunnels. Toxic baits will resemble earthworms, which are the mole’s primary food source. Find a tunnel running through your garden and dig into it. Drop 1 of the baits into the tunnel and then fill in the hole you dug. Place 3 or 4 baits throughout the tunnel or near exposed molehills. Toxic mole baits can be purchased at most gardening stores or online. If you notice new mounds appearing in your garden, place more baits near them. Many times, baits will not be enough and you will need to pair them with traps. Use a spear trap for shallow tunnels. Spear or harpoon traps are spring-loaded and impale the mole as it passes through its tunnel. Use your thumbs to depress the center of an active tunnel by about 1 inch (2.5 cm). Push the trap into the soil so just the tips of the spikes are in the ground. When the mole passes through the tunnel, the trap will set and stab into the mole. Use caution when setting the trap since it has sharp, spring-loaded edges. If you have pets or children that play outdoors, select a different trap since spear traps have sharp exposed edges. Set a scissor trap for deeper tunnels. Dig into and expose the tunnel with a tool the same width of the trap. Build up a mound of compact dirt in the middle of the tunnel. Set the trap on top of the mound, following the instructions on the package. When the mole tries to dig through the mound, the trap activates and snaps the blades together to kill the mole. Lay a barrel trap in the tunnel for minimal setup. Dig a hole the size of the hole into an active tunnel. Fit the barrel into the hole and cover it so sunlight cannot penetrate through. When the mole moves through the barrel, claws will puncture the mole and kill it efficiently. Barrel traps are effective for yards if you have pets or children. Make a humane trap by burying a bucket under their tunnel. Dig a hole large enough to fit a jar or large bucket underneath the bottom of a mole tunnel. Keep the lip of the bucket level with the tunnel’s bottom. Cover the tunnel with dirt so no sunlight gets through. Check the trap twice daily to see if you’ve caught any moles. Release live moles somewhere 5 miles (8.0 km) away from your yard and be sure they are not near any other garden. Using Household Treatments Flood the tunnels using a garden hose. Take your hose and place the spout in one of the molehills. Turn your hose on to a steady stream until the tunnel floods. Keep your eyes on other molehills in your garden to see if a mole tries to escape. If problems persist, try flooding the tunnels again. Most moles can swim, so it may take a while for the moles to come to the surface for air. Sprinkle strong-scented materials near the molehills. Moles have very sensitive noses and strong scents can deter them from the area. Using materials such as red pepper, cayenne, or coffee grounds near the entrances of molehills can make a mole abandon an area. Blood meal fertilizer has a high nitrogen content and helps plants grow while also deterring moles from the area. Be sure to always re-apply the material after it rains, otherwise a mole may return to its tunnels. Plug the molehill with a corn cob dipped in roofing tar. Since roofing tar has a strong smell, moles will avoid the area. A corn cob is a perfect size for fitting into the hole leading into a mole’s tunnel. Plug each of the entrances to force the mole out from the ground. Make a castor oil repellent. Castor oil has a pungent smell and makes a good repellent for moles. Mix 3 parts castor oil to 1 part dish detergent. Combine 4 tablespoons (59 ml) of the liquid with 1 gallon (3.8 L) of water. Pour the mixture into and around the tunnels. Pouring the full amount across the molehills will also coat some of the mole's food source and cause it to taste foul. Taking Preventative Measures Keep a cat outside to hunt the moles. Cats hunt and kill small mammals like moles and mice. Let your cat explore and hunt in your yard. Even the smell of an outdoor cat will help deter them from the area. Using cat litter around or in the molehills will discourage moles from the area. Water your garden less. Moles essentially “swim” through the ground with their front paws. When the soil is drier, it is more difficult for the mole to burrow and travel through the ground. Watering your garden less will attract fewer earthworms and make moles find new food sources. Bury a wire mesh 18 inches (0.46 m) into the ground around your garden. Measure the total length around your garden to find how much mesh you will need. Dig a trench around your garden that is 18 inches (0.46 m) deep. Leave 6 inches (15 cm) of mesh exposed above the ground. You can purchase wire mesh at any home improvement or garden store. It is possible for moles to chew through the wire mesh, so consider opting thicker or sturdier wire. EXPERT TIP\t\"Moles don't really damage the plants, so in a vegetable garden, we just line the bed with wire so the moles can't disturb the seedlings.\" Steve Masley\t\t\t\t\tOrganic Vegetable Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years. He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening. In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University. Steve MasleyOrganic Vegetable Gardener Spray beneficial nematodes on the ground to remove grubs. Nematodes are a small bacteria that infect the grubs in your yard to use as their food source. Purchase a nematode solution online or in gardening stores. Follow the directions on the packaging to spread it across your yard. Nematodes will also kill Japanese beetle larva, so you can get rid of two pests at once! Create a barrier with rocks or gravel underground. Dig out an area 1 foot (0.30 m) wide and 24 inches (0.61 m) deep. Fill the hole with gravel so a mole can not dig through it. Cover the gravel with a thin layer of soil or sod to keep a uniform look in your lawn or garden.",
  "tyn_model":[
    "bucket",
    "castor oil",
    "wire mesh",
    "gravel",
    "soil",
    "hose",
    "mole",
    "corn cob",
    "roofing tar",
    "water",
    "wire",
    "nematodes",
    "toxic baits",
    "toxic mole",
    "baits",
    "traps",
    "spear trap",
    "spear or",
    "harpoon",
    "spear traps",
    "scissor trap",
    "tool",
    "barrel trap",
    "barrel",
    "barrel traps",
    "humane trap",
    "jar",
    "garden hose",
    "red pepper",
    "coffee grounds",
    "blood meal fertilizer",
    "dish detergent",
    "cats",
    "cat litter",
    "“swim",
    "” through",
    "mesh",
    "vegetable garden",
    "organic vegetable gardens",
    "organic gardening consultant",
    "organic vegetable gardening",
    "nematode",
    "rocks",
    "sod"
  ],
  "tyn_section":[

  ]
}