{
  "title":"How to Care for a Pothos Plant",
  "url":"https://www.wikihow.com/Care-for-a-Pothos-Plant",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "steps":[
    {
      "headline":"Pick a Pothos plant.",
      "description":"The easiest way to fail at houseplant care is to buy an already dying plant. When at the store, look for:\nBroad, firm, green leaves\nFirm but not rigid green stems\nA firm root base\nNo leaves with white or yellow splotches - these may be disease marks\nNo mold anywhere, including the soil."
    },
    {
      "headline":"Select a pot or container.",
      "description":"If you like the pot that the plant came in, skip this step. If you want a different pot, read on. When purchasing a new pot, think of where the pot will go. Consider weight, size, colour, breakability (will children be near it? ), and so forth."
    },
    {
      "headline":"Repot the plant, if needed.",
      "description":"See How to repot a plant for repotting details. Follow those instructions carefully."
    },
    {
      "headline":"Choose a plant location.",
      "description":"Where should a Pothos plant go? Pothos plants thrive in every light condition except total darkness and direct sunlight. Bathrooms, bedrooms, hallways, and so on, make excellent locations."
    },
    {
      "headline":"Keep the plant watered.",
      "description":"Pothos plants need the soil to be just damp, not soaking. When you touch the soil with your finger, your finger should have dirt clinging to it but not have water on it. If there is no clinging - water it! If your finger is wet - hold off!"
    },
    {
      "headline":"Don't fertilize the plant.",
      "description":"Pothos plants do not require fertilization as they grow slowly and do not require much to do so."
    },
    {
      "headline":"Prune the plant.",
      "description":"If your Pothos plant grows too big, use scissors to make a clean cut near a stem base, not below the soil line. Let the stub 'scab' over before you push it into the dirt to prevent disease."
    },
    {
      "headline":"Weather-proof the plant.",
      "description":"Pothos plants are usually kept indoors. If yours is an outdoor plant, bring it inside before the first frost and return it after you are certain that there will be no more."
    }
  ],
  "text":" Pick a Pothos plant. The easiest way to fail at houseplant care is to buy an already dying plant. When at the store, look for:\nBroad, firm, green leaves\nFirm but not rigid green stems\nA firm root base\nNo leaves with white or yellow splotches - these may be disease marks\nNo mold anywhere, including the soil. Select a pot or container. If you like the pot that the plant came in, skip this step. If you want a different pot, read on. When purchasing a new pot, think of where the pot will go. Consider weight, size, colour, breakability (will children be near it? ), and so forth. Repot the plant, if needed. See How to repot a plant for repotting details. Follow those instructions carefully. Choose a plant location. Where should a Pothos plant go? Pothos plants thrive in every light condition except total darkness and direct sunlight. Bathrooms, bedrooms, hallways, and so on, make excellent locations. Keep the plant watered. Pothos plants need the soil to be just damp, not soaking. When you touch the soil with your finger, your finger should have dirt clinging to it but not have water on it. If there is no clinging - water it! If your finger is wet - hold off! Don't fertilize the plant. Pothos plants do not require fertilization as they grow slowly and do not require much to do so. Prune the plant. If your Pothos plant grows too big, use scissors to make a clean cut near a stem base, not below the soil line. Let the stub 'scab' over before you push it into the dirt to prevent disease. Weather-proof the plant. Pothos plants are usually kept indoors. If yours is an outdoor plant, bring it inside before the first frost and return it after you are certain that there will be no more.",
  "tyn_model":[
    "pot",
    "water",
    "container",
    "prune",
    "scissors"
  ],
  "tyn_section":[

  ]
}