{
  "title":"How to Clean Your House (for Kids)",
  "url":"https://www.wikihow.com/Clean-Your-House-(for-Kids)",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning"
  ],
  "steps":[
    {
      "headline":"Make sure you know what is expected of you.",
      "description":"If you are only expected to clean the main floor of your house or apartment then just skip over the parts that don't apply to you."
    },
    {
      "headline":"Gather all of the materials you will need to clean.",
      "description":""
    },
    {
      "headline":"Get out your dusting supplies (dusting solution and a rag) and dust every surface that needs dusting.",
      "description":""
    },
    {
      "headline":"Get the vacuum or dust and clean the floor.",
      "description":"If you will use vacuum, don't forget to ask your parents!"
    },
    {
      "headline":"Empty the dishwasher and put away all clean dishes in the appropriate area.",
      "description":""
    },
    {
      "headline":"Wipe down all counter tops and kitchen tables.",
      "description":""
    },
    {
      "headline":"Take out the trash.",
      "description":"Replace the old trash bag with a new one."
    },
    {
      "headline":"Clean all windows and mirrors.",
      "description":"Make sure to clean it all. When using sprays put gloves on to not irritate your skin."
    },
    {
      "headline":"Return all books, magazines, paper, pencils, anything that isn't in a proper area.",
      "description":""
    }
  ],
  "text":" Make sure you know what is expected of you. If you are only expected to clean the main floor of your house or apartment then just skip over the parts that don't apply to you. Gather all of the materials you will need to clean.  Get out your dusting supplies (dusting solution and a rag) and dust every surface that needs dusting.  Get the vacuum or dust and clean the floor. If you will use vacuum, don't forget to ask your parents! Empty the dishwasher and put away all clean dishes in the appropriate area.  Wipe down all counter tops and kitchen tables.  Take out the trash. Replace the old trash bag with a new one. Clean all windows and mirrors. Make sure to clean it all. When using sprays put gloves on to not irritate your skin. Return all books, magazines, paper, pencils, anything that isn't in a proper area. ",
  "tyn_model":[
    "vacuum",
    "dusting supplies",
    "dusting solution",
    "rag",
    "dust",
    "trash",
    "gloves"
  ],
  "tyn_section":[

  ]
}