{
  "title":"How to Play Flood Escape on Roblox",
  "url":"https://www.wikihow.com/Play-Flood-Escape-on-Roblox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Roblox"
  ],
  "methods":[
    {
      "name":"Multiplayer",
      "steps":[
        {
          "headline":"At the area you spawn, go straight ahead.",
          "description":"Through the door, there should be 3 elevators. The first is green, second is yellow, and last is red."
        },
        {
          "headline":"Go to an open elevator.",
          "description":"\"Easy\" difficulty is recommended for starters. \"Medium\" is for intermediate challenges. \"Hard\" difficulty is very challenging, which is recommended for veteran players."
        },
        {
          "headline":"Press the buttons.",
          "description":"Each button does an action that helps the players. Here's what each button does:\nBlue buttons have not been pressed. Pressing them will create a pathway for the players. Red buttons have already been pressed. Pressing them will do nothing. Green buttons, the most important buttons, have not been pressed. Pressing them will open the endpoint. Black buttons only appear in the map Power Required. A blue button must be pressed first."
        },
        {
          "headline":"Try to press as many buttons as possible.",
          "description":"Pressing lots of buttons will unlock a bonus stage!"
        },
        {
          "headline":"Get to the gate at the end.",
          "description":"Failing to get there in time will result in you drowning. But, remember, the green button must be pressed first!"
        },
        {
          "headline":"Progress to the next stages.",
          "description":"Each stage has a different format, providing a different challenge every time."
        },
        {
          "headline":"Progress to the final stage and find the button combination.",
          "description":"If the light is green, the correct combination was entered. Also, don't try to interfere with other player's work, it just makes it harder for all players."
        },
        {
          "headline":"Provided that you have pressed at least six buttons, try to get to the end as quickly as possible.",
          "description":"Although the bonus stage does not give any extra rewards, it's a gift from the game for not being selfish."
        },
        {
          "headline":"Get wins and buy aesthetics and gear from the shop.",
          "description":"Aesthetics make you look cooler, change sounds, and change textures. Gear provides a certain boost. Here's what they do:\nFlood Shard lets you press buttons from farther away. Dash gives you a temporary speed boost, but makes you slower when it is over. Weak Gravity Coil lets you jump higher, but, unlike the regular Gravity Coil (from other servers) it doesn't have the hovering effect."
        }
      ]
    },
    {
      "name":"Expert Mode",
      "steps":[
        {
          "headline":"Get 10 wins.",
          "description":"Wins are when you successfully complete 3 stages and the button lock."
        },
        {
          "headline":"Go to the right of the spawn.",
          "description":"Before 10 wins, you'll see a lock on the door. After getting ten wins, the door will be unlocked. Go down the stairs and through the path."
        },
        {
          "headline":"Choose a stage.",
          "description":"Only two stages are available to you, the others are either locked until you win or still in development."
        },
        {
          "headline":"Go down the elevator.",
          "description":"Once the ride has finished, be prepared for some seriously intense escaping..."
        },
        {
          "headline":"Get all of the buttons.",
          "description":"The game will be there to assist you, and your only advantage is that you have an Air meter, which lets you survive in the water a bit longer."
        },
        {
          "headline":"Be aware that you cannot use gear.",
          "description":"Most players become used to having gear, so they are usually unprepared for Expert Mode."
        }
      ]
    }
  ],
  "text":" Multiplayer At the area you spawn, go straight ahead. Through the door, there should be 3 elevators. The first is green, second is yellow, and last is red. Go to an open elevator. \"Easy\" difficulty is recommended for starters. \"Medium\" is for intermediate challenges. \"Hard\" difficulty is very challenging, which is recommended for veteran players. Press the buttons. Each button does an action that helps the players. Here's what each button does:\nBlue buttons have not been pressed. Pressing them will create a pathway for the players. Red buttons have already been pressed. Pressing them will do nothing. Green buttons, the most important buttons, have not been pressed. Pressing them will open the endpoint. Black buttons only appear in the map Power Required. A blue button must be pressed first. Try to press as many buttons as possible. Pressing lots of buttons will unlock a bonus stage! Get to the gate at the end. Failing to get there in time will result in you drowning. But, remember, the green button must be pressed first! Progress to the next stages. Each stage has a different format, providing a different challenge every time. Progress to the final stage and find the button combination. If the light is green, the correct combination was entered. Also, don't try to interfere with other player's work, it just makes it harder for all players. Provided that you have pressed at least six buttons, try to get to the end as quickly as possible. Although the bonus stage does not give any extra rewards, it's a gift from the game for not being selfish. Get wins and buy aesthetics and gear from the shop. Aesthetics make you look cooler, change sounds, and change textures. Gear provides a certain boost. Here's what they do:\nFlood Shard lets you press buttons from farther away. Dash gives you a temporary speed boost, but makes you slower when it is over. Weak Gravity Coil lets you jump higher, but, unlike the regular Gravity Coil (from other servers) it doesn't have the hovering effect. Expert Mode Get 10 wins. Wins are when you successfully complete 3 stages and the button lock. Go to the right of the spawn. Before 10 wins, you'll see a lock on the door. After getting ten wins, the door will be unlocked. Go down the stairs and through the path. Choose a stage. Only two stages are available to you, the others are either locked until you win or still in development. Go down the elevator. Once the ride has finished, be prepared for some seriously intense escaping... Get all of the buttons. The game will be there to assist you, and your only advantage is that you have an Air meter, which lets you survive in the water a bit longer. Be aware that you cannot use gear. Most players become used to having gear, so they are usually unprepared for Expert Mode.",
  "tyn_model":[
    "gear",
    "gravity coil",
    "elevator",
    "buttons",
    "dash",
    "water"
  ],
  "tyn_section":[

  ]
}