{
  "title":"How to Improve Your Scrabble Score",
  "url":"https://www.wikihow.com/Improve-Your-Scrabble-Score",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Board Games"
  ],
  "steps":[
    {
      "headline":"Learn the two-letter words.",
      "description":"They're the \"glue\" of Scrabble. Some two-letter words are obvious and worth a lot of points (HE, AX), but there are others, which, when played properly, can add up to a lot of points (JO, XI, XU, QI) especially if you're able to use the high scoring letter in two different words in the same turn. Lists of the two letter words can be found in many places throughout the internet. Example: Building off the word LABEL, one could play the word AX under the LA and get double points off the X."
    },
    {
      "headline":"Know common prefixes and suffixes, such as -ED, -ING, -UN, -RE and so on.",
      "description":"If there's a word already on the board with a lot of points, you can leverage these points by adding a suffix or a prefix to the word."
    },
    {
      "headline":"Use blanks and S's effectively.",
      "description":"An S should only be used when it adds at least 8 points to your turn (unless you have two of them). A blank should not be used unless you can get an extra 25 points for using it. Blanks and Ss can be very helpful in playing a bingo, (when you play all seven letters at once)."
    },
    {
      "headline":"Try to arrange your letters for a Bingo.",
      "description":"Playing all seven letters in one turn will give you an additional 50 points, which can ultimately win the game for you. Common prefixes and suffixes, the blank and the S will all be very helpful in winning the game. For example, if you have an ED, it is possible you can rearrange the other five letters into a word using the ED suffix."
    },
    {
      "headline":"Learn the words with a Q in them, but no U, such as QI, QAID, QAT, etc.",
      "description":""
    },
    {
      "headline":"Don't hesitate to swap some tiles if you're in a tough situation.",
      "description":"For example, if you have all consonants, it's possible you might only be able to play one letter and there's a good chance the next letter you draw will also be a consonant. Instead of setting yourself up for two low-scoring plays, swap out some lower value letters and increase your chances for one higher scoring play."
    },
    {
      "headline":"Practice makes perfect.",
      "description":"Play often! There are ways to play online if you can't always find an opponent. You will learn new words or even strategies this way."
    }
  ],
  "text":" Learn the two-letter words. They're the \"glue\" of Scrabble. Some two-letter words are obvious and worth a lot of points (HE, AX), but there are others, which, when played properly, can add up to a lot of points (JO, XI, XU, QI) especially if you're able to use the high scoring letter in two different words in the same turn. Lists of the two letter words can be found in many places throughout the internet. Example: Building off the word LABEL, one could play the word AX under the LA and get double points off the X. Know common prefixes and suffixes, such as -ED, -ING, -UN, -RE and so on. If there's a word already on the board with a lot of points, you can leverage these points by adding a suffix or a prefix to the word. Use blanks and S's effectively. An S should only be used when it adds at least 8 points to your turn (unless you have two of them). A blank should not be used unless you can get an extra 25 points for using it. Blanks and Ss can be very helpful in playing a bingo, (when you play all seven letters at once). Try to arrange your letters for a Bingo. Playing all seven letters in one turn will give you an additional 50 points, which can ultimately win the game for you. Common prefixes and suffixes, the blank and the S will all be very helpful in winning the game. For example, if you have an ED, it is possible you can rearrange the other five letters into a word using the ED suffix. Learn the words with a Q in them, but no U, such as QI, QAID, QAT, etc.  Don't hesitate to swap some tiles if you're in a tough situation. For example, if you have all consonants, it's possible you might only be able to play one letter and there's a good chance the next letter you draw will also be a consonant. Instead of setting yourself up for two low-scoring plays, swap out some lower value letters and increase your chances for one higher scoring play. Practice makes perfect. Play often! There are ways to play online if you can't always find an opponent. You will learn new words or even strategies this way.",
  "tyn_model":[
    "two-letter words",
    "blank",
    "glue",
    "scrabble",
    "bingo",
    "tiles"
  ],
  "tyn_section":[

  ]
}