{
  "title":"How to Make Potted Meat Gravy",
  "url":"https://www.wikihow.com/Make-Potted-Meat-Gravy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Gravies"
  ],
  "steps":[
    {
      "headline":"Make sure that all products needed are at your convenience.",
      "description":"Be sure to sift the flour or use a fork to check for lumps. Any salt or salt substitute, pepper, or garlic powder can be directly added to sifted flour. Have flour pre-measured and set aside. The same step applies to the oil, and the milk or water. Be sure to place the skillet on the burner of the stove."
    },
    {
      "headline":"Set the burner that's underneath the skillet on a medium setting, allowing the oil to get extremely hot.",
      "description":"A person can test to see if it is hot enough by adding a little flour. If the flour sizzles it is time to begin preparing the gravy."
    },
    {
      "headline":"Add flour a little at a time, while constantly stirring.",
      "description":"Allow the gravy to become lightly brown before moving on to the next step. Add milk or milk and water mixture slowly while stirring with fork until you have reach the desired consistency"
    },
    {
      "headline":"Reduce the heat and slowly add in the potted meat as soon as the gravy has reached the desired thickness.",
      "description":"Be sure to continue stirring while allowing the gravy to simmer once the potted meat has been added."
    },
    {
      "headline":"Remove it from the heat and serve hot, when the gravy is ready, or allow it to cool.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Make sure that all products needed are at your convenience. Be sure to sift the flour or use a fork to check for lumps. Any salt or salt substitute, pepper, or garlic powder can be directly added to sifted flour. Have flour pre-measured and set aside. The same step applies to the oil, and the milk or water. Be sure to place the skillet on the burner of the stove. Set the burner that's underneath the skillet on a medium setting, allowing the oil to get extremely hot. A person can test to see if it is hot enough by adding a little flour. If the flour sizzles it is time to begin preparing the gravy. Add flour a little at a time, while constantly stirring. Allow the gravy to become lightly brown before moving on to the next step. Add milk or milk and water mixture slowly while stirring with fork until you have reach the desired consistency Reduce the heat and slowly add in the potted meat as soon as the gravy has reached the desired thickness. Be sure to continue stirring while allowing the gravy to simmer once the potted meat has been added. Remove it from the heat and serve hot, when the gravy is ready, or allow it to cool.  Finished. ",
  "tyn_model":[
    "flour",
    "milk",
    "fork",
    "oil",
    "water",
    "skillet",
    "potted meat",
    "garlic powder",
    "stove"
  ],
  "tyn_section":[

  ]
}