{
  "title":"How to Unlock EMS Sasuke",
  "url":"https://www.wikihow.com/Unlock-EMS-Sasuke",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Role Playing Games"
  ],
  "steps":[
    {
      "headline":"Complete the game’s main story, also known as Ultimate Adventure.",
      "description":"Upon completion, the game will deposit your character in Hidden Leaf Village."
    },
    {
      "headline":"Navigate to the Hokage Carved Mountains near Kage Mansion.",
      "description":"A small frog named Gekomatsu with a purple scroll above his head will be waiting for you at the bottom of the stairs to the left."
    },
    {
      "headline":"Select the option to speak to Gekomatsu.",
      "description":"The frog will send your character on a mission to collect 500 chakra fragments."
    },
    {
      "headline":"Run through the village to collect 500 chakra fragments.",
      "description":"Most of the fragments will be within eyesight and relatively easy to find. Speed up your mission by navigating to the training field to collect a total of 200 chakra fragments, then continue leaving and re-enter the training field to collect 200 more chakra fragments until you collect a total of 500 fragments."
    },
    {
      "headline":"Return to Gekomatsu after collecting the 500 chakra fragments.",
      "description":"The frog will then send you on another mission to collect 5,000 additional chakra fragments."
    },
    {
      "headline":"Roam around Hidden Leaf Village and the world of Shinobi until your character collects 5,000 chakra fragments.",
      "description":"This process may take between 30 minutes to one hour, depending on your skill level. Save time collecting chakra fragments by roaming around Hidden Leaf Village and returning to places from which you’ve already collected fragments. Chakra fragments will reappear within 30 to 60 seconds after being collected, or after you leave and re-enter a screen."
    },
    {
      "headline":"Return to Gekomatsu after collecting 5,000 chakra fragments.",
      "description":"The frog will instruct you to go to Hidden Cloud Village. You may need to initiate two or more conversations with the frog to receive instructions to go to Hidden Cloud Village."
    },
    {
      "headline":"Go to the Teleportation Ninja woman standing in front of the wooden construction building in the village.",
      "description":"The woman will help you teleport to Hidden Cloud Village in exchange for 1,000 ryo."
    },
    {
      "headline":"Select the option to pay 1,000 ryo, then select “Head to Village Hidden in Cloud.” The game will deposit your character in Hidden Cloud Village.",
      "description":""
    },
    {
      "headline":"Head south, then run across the bridge and along the path until you reach The Land of the Last Battle.",
      "description":"A purple chakra fragment will be lying on the ground at the battle site."
    },
    {
      "headline":"Select the purple chakra fragment.",
      "description":"The game will now load the story of EMS Sasuke."
    },
    {
      "headline":"Follow the in-game instructions to complete your next mission as EMS Sasuke.",
      "description":"When your mission is complete, EMS Sasuke will be unlocked."
    }
  ],
  "text":" Complete the game’s main story, also known as Ultimate Adventure. Upon completion, the game will deposit your character in Hidden Leaf Village. Navigate to the Hokage Carved Mountains near Kage Mansion. A small frog named Gekomatsu with a purple scroll above his head will be waiting for you at the bottom of the stairs to the left. Select the option to speak to Gekomatsu. The frog will send your character on a mission to collect 500 chakra fragments. Run through the village to collect 500 chakra fragments. Most of the fragments will be within eyesight and relatively easy to find. Speed up your mission by navigating to the training field to collect a total of 200 chakra fragments, then continue leaving and re-enter the training field to collect 200 more chakra fragments until you collect a total of 500 fragments. Return to Gekomatsu after collecting the 500 chakra fragments. The frog will then send you on another mission to collect 5,000 additional chakra fragments. Roam around Hidden Leaf Village and the world of Shinobi until your character collects 5,000 chakra fragments. This process may take between 30 minutes to one hour, depending on your skill level. Save time collecting chakra fragments by roaming around Hidden Leaf Village and returning to places from which you’ve already collected fragments. Chakra fragments will reappear within 30 to 60 seconds after being collected, or after you leave and re-enter a screen. Return to Gekomatsu after collecting 5,000 chakra fragments. The frog will instruct you to go to Hidden Cloud Village. You may need to initiate two or more conversations with the frog to receive instructions to go to Hidden Cloud Village. Go to the Teleportation Ninja woman standing in front of the wooden construction building in the village. The woman will help you teleport to Hidden Cloud Village in exchange for 1,000 ryo. Select the option to pay 1,000 ryo, then select “Head to Village Hidden in Cloud.” The game will deposit your character in Hidden Cloud Village.  Head south, then run across the bridge and along the path until you reach The Land of the Last Battle. A purple chakra fragment will be lying on the ground at the battle site. Select the purple chakra fragment. The game will now load the story of EMS Sasuke. Follow the in-game instructions to complete your next mission as EMS Sasuke. When your mission is complete, EMS Sasuke will be unlocked.",
  "tyn_model":[
    "frog",
    "teleportation ninja",
    "teleport",
    "“head",
    "” the"
  ],
  "tyn_section":[

  ]
}