{
  "title":"How to Organize a Birthday Party for Kids",
  "url":"https://www.wikihow.com/Organize-a-Birthday-Party-for-Kids",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Parties for Children"
  ],
  "methods":[
    {
      "name":"Planning Party Basics",
      "steps":[
        {
          "headline":"Pick a theme with your child.",
          "description":"Though it may seem unnecessary, having a theme will help you know what decorations to buy, what food to prepare, and what games to plan. Character parties are popular (think Sponge Bob or Scooby-Doo), but general themes work, too (pirates, fairies, princesses, cowboys, etc.). Unless they want something that just isn't appropriate, allow them creative freedom. Sit down with your child at the table with a pen and paper and write down all the ideas you both like. Some themes will obviously be more difficult than others. Go with your child to a couple of party stores and see what's available or go online. It'll be easiest to pick a theme based on what you have at your disposal. Most parents aren't Martha Stewart; you certainly don't have to be."
        },
        {
          "headline":"Nail down the specifics.",
          "description":"There are a few questions you'll have to address: When is the party going to be? How long will it last? Where is it going to be? Is there anything going on communally or culturally that would prevent other children from coming? What time of day works into your schedule? Take your child's age into account. Generally, the younger the child, the earlier the party. You do not have to entertain all day--a few hours is more than sufficient. If you're not having it at home, consult the desired venue to see what times are available."
        },
        {
          "headline":"Get invitations (that match the theme!).",
          "description":"Once you have them picked out, it's time to finalize the details. Check your schedule to make sure there are no girl scouts or work meetings during the time you're thinking. On the invitation, put the start and end times, address, what each child should bring (swimsuit, etc.) and if there will be a meal so parents can plan accordingly. As for guests, a good rule of thumb is the child's age plus 1. And if parents can come along, great! It's best to have a couple others to help with monitoring and clean up. Have your invitations in the theme of your party. The other children will probably get excited, too. Your child can hand them out at school (if possible to do it discreetly) or you can give them to the parents if your child is too young (or forgetful!). Your child shouldn't hand them out in front of those not invited -- it might make the others feel bad. Give them to the teacher to put in the take home folder or have your child put them in desks or lockers."
        },
        {
          "headline":"Buy decorations.",
          "description":"For everything from table cloths to pinatas, a party store is your best bet -- or else you'll end up bouncing around town for days looking to piece it all together. And if they don't have a specific something, ask! They may be able to order it for you. It's always an option to make your own if you're DIY handy. And your child can always help if you want someone to blame the poor penmanship on! As an alternative idea, a few children can come over a bit earlier to make decorations themselves, if they'd like."
        }
      ]
    },
    {
      "name":"Organizing Activities & What to Eat",
      "steps":[
        {
          "headline":"Plan some games.",
          "description":"These are the building blocks of a good child's party, so start thinking up craft projects, look into renting an entertainer, or utilize the facilities at an outside venue. Look in your phone book or online for party rentals or places near you. For younger kids, have a loose schedule to keep things running. Don't be afraid to go super theme-oriented. If you're having a Wild West party, have them pan for gold in the sandbox. Conduct a scavenger hunt with theme-related clues and a final prize. Don't be afraid to go super simple. Nowadays, kids aren't playing the old school games they could be. Instead of having them all plop down in front of the Wii, have them Capture the Flag, play Red Rover, Blind Man's Bluff, or have relay races. For older children, have more free time. The older the child, the less structured the party should be. Kids will likely want to do their own thing at one point or another. If they express this, don't stress. More free time for you and the other parents!"
        },
        {
          "headline":"Make party favors interactive.",
          "description":"Instead of giving them a bag of small toys that will get played with for three minutes and then shoved in a drawer, have them make the party favors themselves! The kids will feel more involved and like they were a part of the party. They could make potato print t-shirts, simple masks, jewelry, fishing rods, badges -- the list goes on and on and on. This requires a bit more forethought, but will pay off in the long run. You could have this be the first activity -- so children that come earlier have something to busy themselves with while the others slowly file in. Any late arriving child can take the necessary materials home with them if they'd like. Let the kids take home the decorations. This is an easy and quick idea if you have something with a general theme, like princesses or baseball. And it allows for minimal clean up!"
        },
        {
          "headline":"Plan the party food.",
          "description":"When it comes to parties, one thing is timeless: cake. Will you bake one or buy one? Or two?! Cupcakes are easy and super trendy as well. Whatever you choose, either get the order in early or go grocery shopping for the ingredients ahead of time. Make the food theme oriented, too! Despite what logic dictates, cake isn't enough. You'll need food food too -- make it easy on yourself and get some pizzas delivered or get a fast food restaurant or catering company to take care of everything. Finger sandwiches and lunch bags with sandwiches and fruit, jellos or cookies are great choices, too. If it's a nice day outside and you have a grill, kids love hot dogs and hamburgers. Don't forget the buns, mustard, and ketchup! If there will be other parents or adults attending and watching over the kids, have food for them, too. They may not be so keen on chicken nuggets and Sprite."
        },
        {
          "headline":"Plan the party drinks.",
          "description":"Soda pop, lemonade, and juice are all pretty standard. And if you'll be outside a lot, a cooler filled with bottles of water or cans of soda will surely be appreciated, especially if it's hot outside. And, of course, milk goes great with cake. If it's autumn or winter, have the kids play outside and come in for cider to warm them up. Have glasses (and cutlery in general) that are safe for the kids to use. Things may get broken -- so don't break out your fine china. Be prepared for a mess."
        },
        {
          "headline":"Plan the goodbye.",
          "description":"Give the other parents your cell phone number on the off chance they're running late, early, or sending someone else to pick up their child. Establish protocol for the safety of every child. As the child leaves, take note. Have them say goodbye to everyone, gather their things, their party favor, and mentally check them off their list. Never let the child leave on their own or with an adult you don't recognize."
        }
      ]
    }
  ],
  "text":" Planning Party Basics Pick a theme with your child. Though it may seem unnecessary, having a theme will help you know what decorations to buy, what food to prepare, and what games to plan. Character parties are popular (think Sponge Bob or Scooby-Doo), but general themes work, too (pirates, fairies, princesses, cowboys, etc.). Unless they want something that just isn't appropriate, allow them creative freedom. Sit down with your child at the table with a pen and paper and write down all the ideas you both like. Some themes will obviously be more difficult than others. Go with your child to a couple of party stores and see what's available or go online. It'll be easiest to pick a theme based on what you have at your disposal. Most parents aren't Martha Stewart; you certainly don't have to be. Nail down the specifics. There are a few questions you'll have to address: When is the party going to be? How long will it last? Where is it going to be? Is there anything going on communally or culturally that would prevent other children from coming? What time of day works into your schedule? Take your child's age into account. Generally, the younger the child, the earlier the party. You do not have to entertain all day--a few hours is more than sufficient. If you're not having it at home, consult the desired venue to see what times are available. Get invitations (that match the theme!). Once you have them picked out, it's time to finalize the details. Check your schedule to make sure there are no girl scouts or work meetings during the time you're thinking. On the invitation, put the start and end times, address, what each child should bring (swimsuit, etc.) and if there will be a meal so parents can plan accordingly. As for guests, a good rule of thumb is the child's age plus 1. And if parents can come along, great! It's best to have a couple others to help with monitoring and clean up. Have your invitations in the theme of your party. The other children will probably get excited, too. Your child can hand them out at school (if possible to do it discreetly) or you can give them to the parents if your child is too young (or forgetful!). Your child shouldn't hand them out in front of those not invited -- it might make the others feel bad. Give them to the teacher to put in the take home folder or have your child put them in desks or lockers. Buy decorations. For everything from table cloths to pinatas, a party store is your best bet -- or else you'll end up bouncing around town for days looking to piece it all together. And if they don't have a specific something, ask! They may be able to order it for you. It's always an option to make your own if you're DIY handy. And your child can always help if you want someone to blame the poor penmanship on! As an alternative idea, a few children can come over a bit earlier to make decorations themselves, if they'd like. Organizing Activities & What to Eat Plan some games. These are the building blocks of a good child's party, so start thinking up craft projects, look into renting an entertainer, or utilize the facilities at an outside venue. Look in your phone book or online for party rentals or places near you. For younger kids, have a loose schedule to keep things running. Don't be afraid to go super theme-oriented. If you're having a Wild West party, have them pan for gold in the sandbox. Conduct a scavenger hunt with theme-related clues and a final prize. Don't be afraid to go super simple. Nowadays, kids aren't playing the old school games they could be. Instead of having them all plop down in front of the Wii, have them Capture the Flag, play Red Rover, Blind Man's Bluff, or have relay races. For older children, have more free time. The older the child, the less structured the party should be. Kids will likely want to do their own thing at one point or another. If they express this, don't stress. More free time for you and the other parents! Make party favors interactive. Instead of giving them a bag of small toys that will get played with for three minutes and then shoved in a drawer, have them make the party favors themselves! The kids will feel more involved and like they were a part of the party. They could make potato print t-shirts, simple masks, jewelry, fishing rods, badges -- the list goes on and on and on. This requires a bit more forethought, but will pay off in the long run. You could have this be the first activity -- so children that come earlier have something to busy themselves with while the others slowly file in. Any late arriving child can take the necessary materials home with them if they'd like. Let the kids take home the decorations. This is an easy and quick idea if you have something with a general theme, like princesses or baseball. And it allows for minimal clean up! Plan the party food. When it comes to parties, one thing is timeless: cake. Will you bake one or buy one? Or two?! Cupcakes are easy and super trendy as well. Whatever you choose, either get the order in early or go grocery shopping for the ingredients ahead of time. Make the food theme oriented, too! Despite what logic dictates, cake isn't enough. You'll need food food too -- make it easy on yourself and get some pizzas delivered or get a fast food restaurant or catering company to take care of everything. Finger sandwiches and lunch bags with sandwiches and fruit, jellos or cookies are great choices, too. If it's a nice day outside and you have a grill, kids love hot dogs and hamburgers. Don't forget the buns, mustard, and ketchup! If there will be other parents or adults attending and watching over the kids, have food for them, too. They may not be so keen on chicken nuggets and Sprite. Plan the party drinks. Soda pop, lemonade, and juice are all pretty standard. And if you'll be outside a lot, a cooler filled with bottles of water or cans of soda will surely be appreciated, especially if it's hot outside. And, of course, milk goes great with cake. If it's autumn or winter, have the kids play outside and come in for cider to warm them up. Have glasses (and cutlery in general) that are safe for the kids to use. Things may get broken -- so don't break out your fine china. Be prepared for a mess. Plan the goodbye. Give the other parents your cell phone number on the off chance they're running late, early, or sending someone else to pick up their child. Establish protocol for the safety of every child. As the child leaves, take note. Have them say goodbye to everyone, gather their things, their party favor, and mentally check them off their list. Never let the child leave on their own or with an adult you don't recognize.",
  "tyn_model":[
    "decorations",
    "cake",
    "pirates",
    "pen",
    "paper",
    "invitations",
    "table cloths",
    "wii",
    "jewelry",
    "cupcakes",
    "fast food restaurant",
    "cookies",
    "grill",
    "sprite",
    "soda pop",
    "lemonade",
    "juice",
    "soda",
    "milk",
    "cider",
    "glasses",
    "cutlery",
    "china"
  ],
  "tyn_section":[

  ]
}