{
  "title":"How to Cook a Turkey",
  "url":"https://www.wikihow.com/Cook-a-Turkey",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes"
  ],
  "parts":[
    {
      "name":"Choosing and Preparing the Turkey",
      "steps":[
        {
          "headline":"Pick out a good quality turkey.",
          "description":"A turkey is an item that's worth splurging on if you can. Turkeys that have been frozen for a long time, have been sitting out in the display for a while, or have been treated with preservatives won't taste as good or cook as well as fresh, untreated turkeys. Keep these pointers in mind when you're picking one out:\nTry to get a fresh turkey from a butcher rather than from the meat display at the grocery store. Butcher shops tend to have meat that is fresher. Free-range or pasture-raised turkeys are more expensive than coop-raised turkeys, but they tend to have a more robust flavor. Self-basted turkeys have added seasonings and water, making them extra moist and salty. You might consider the moisture a plus, but these birds will have less of a natural turkey flavor than untreated turkeys. Kosher turkeys also have added salt, which can affect the flavor."
        },
        {
          "headline":"Get a turkey that’s the right size for your needs.",
          "description":"Before you buy a turkey, consider how many people you're feeding. As a rule of thumb, aim to get about 1 pound (0.45 kg) of bird per person, or a little more. So, for example, a small 12–14 lb (5.4–6.4 kg) turkey will feed up to 14 people, a medium 15–17 lb (6.8–7.7 kg) turkey will feed up to 17, and a large 18–21 pounds (8.2–9.5 kg) turkey can feed up to 21. If you want plenty of leftovers, get a larger bird than you need to serve everyone."
        },
        {
          "headline":"Thaw the turkey if necessary.",
          "description":"If you happen to choose a frozen turkey for your meal, it's very important to take it out of the freezer ahead of time to allow the turkey to fully defrost and thaw prior to cooking. The safest thawing method is to put the turkey on the bottom shelf of your fridge in its original wrapping. Give it 24 hours of thawing time for every 4–5 pounds (1.8–2.3 kg) of weight.Did you know? You can safely cook a frozen turkey, but the process takes 50% longer than cooking a fresh or defrosted turkey. For a faster thaw, put the wrapped turkey in a sink full of cold water. This method takes approximately 30 minutes per 1 pound (0.45 kg) of bird. For safety reasons, you’ll need to change the water every 30 minutes and cook the turkey as soon as it’s done thawing. If you’re really pressed for time, try defrosting your unwrapped turkey in a deep dish in the microwave (if it fits!). While the amount of time this takes varies, you’ll generally need 6 minutes of defrosting time for each 1 pound (0.45 kg) of turkey."
        },
        {
          "headline":"Empty the turkey's cavity if it has giblets.",
          "description":"Before you cook your turkey, remove any giblets from the inside cavity. They often come in a little bag that is easily discarded, although some people like to save them for soup or incorporate them into the stuffing. You may also find a neck in the cavity; either save it or discard it. You may find giblets either in the main cavity of the turkey or tucked under a flap of skin at the head end of the bird."
        },
        {
          "headline":"Rinse the turkey under running water only if it’s brined.",
          "description":"If you’re cooking a brined turkey, give the inside cavity a quick rinse under cool, running water to remove excess brine. Keep the roasting pan next to the sink so you can transfer the turkey there easily without dripping all over your work area. Afterward, pat the turkey dry with paper towels to make sure the skin gets nice and crispy in the oven. Note: The USDA does not recommend rinsing turkeys before cooking them unless they are brined. Rinsing an unbrined turkey will not do much except unnecessarily spread germs around your kitchen. Wash your sink with hot, soapy water both before and after rinsing a brined turkey. You can also protect the area around the sink by laying down paper towels first."
        }
      ]
    },
    {
      "name":"Stuffing and Seasoning the Turkey",
      "steps":[
        {
          "headline":"Brine the turkey if desired.",
          "description":"Brining involves soaking your turkey in a salt solution infused with aromatic herbs and spices. The brining process adds both flavor and moisture to the turkey and prevents drying during the cooking process. To brine your turkey, put the turkey in a large, covered pot with enough brining solution to cover it completely. Refrigerate the turkey in the brine for 12-24 hours before cooking it. You’ll need to rinse your turkey and pat it dry after you brine it. Chefs differ with regard to whether brining a turkey is really necessary. If you love the taste of salty turkey meat, you might want to give it a try; if you'd prefer to avoid eating a lot of salt, skip the brine. Don’t brine your turkey if it’s Kosher, self-basting, or pre-brined. This will result in an unpleasantly salty turkey. You can make a basic brine by dissolving 1 cup (about 250 g) of kosher salt in 4 US quarts (3.8 L) of warm water. Add aromatics, such as bay leaves, peppercorns, cloves, allspice, or lemon peel, to taste."
        },
        {
          "headline":"Prepare the stuffing of your choice.",
          "description":"You can either use a boxed stuffing mix or make stuffing from scratch. Check your recipe closely to make sure you prepare the right amount of stuffing for your turkey based on the size of the bird. As a rule, you should aim to prepare about ¾ of a cup (about 150 g) of stuffing per 1 pound (0.45 kg) of turkey."
        },
        {
          "headline":"Stuff the turkey if you like.",
          "description":"Once the stuffing is cooked and cool enough to handle, loosely fill the turkey’s neck cavity and fold over the flap of skin to keep the stuffing contained. If you like, you can pin the skin in place with a metal skewer. Spoon the rest of the stuffing loosely into the body cavity and truss the legs together with kitchen twine.Tip: Some cooks dislike adding stuffing because it causes the turkey to cook unevenly and increases the total cooking time. There's no need to stuff your turkey if you'd prefer not to. As an alternative to adding the stuffing directly to the turkey, you can cook it separately in a baking dish."
        },
        {
          "headline":"Rub the turkey with olive oil and season it to taste.",
          "description":"Once the turkey is stuffed (or not, if you prefer to make the stuffing separately), rub the skin all over with olive oil or melted, clarified butter to lock in moisture. Season the turkey with a little salt and pepper if you wish. Skip the salt if your turkey is brined, self-basting, or kosher. You can also experiment with other seasonings, such as rosemary, sage, or garlic powder. If you’re feeling a little more ambitious, try coating your turkey with a delicious sage butter."
        }
      ]
    },
    {
      "name":"Roasting and Basting the Turkey",
      "steps":[
        {
          "headline":"Preheat the oven to 325 °F (163 °C).",
          "description":"Cooking your turkey at a low, even temperature will help ensure that you get a tasty, tender bird. Put the baking rack in the lowest position in the oven so you’ll have plenty of room for your turkey. Some chefs recommend starting the turkey at 425 °F (218 °C) and then reducing the heat after half an hour. This approach will speed up your cooking time by 30-90 minutes, but it’s important to remember to turn the oven down!"
        },
        {
          "headline":"Cover a roasting pan with aluminum foil.",
          "description":"Use 2 sheets of heavy-duty aluminum foil. 1 sheet should go length-wise across the pan and the next sheet width-wise. Make sure the sheets are large enough to fully wrap over and around the entire turkey to form a loose, sealed tent. This locks in moisture and helps prevent the turkey from scorching or browning too quickly. Some cooks recommend waiting until 2/3rds of the way through the cooking time before adding a foil tent to the turkey. This can help prevent scorching while giving the skin plenty of time to get crisp."
        },
        {
          "headline":"Determine the cooking time based on the turkey’s weight.",
          "description":"The average cooking time is 20 minutes per 1 pound (0.45 kg) of turkey if your bird is unstuffed. If your turkey is stuffed, however, add an extra ¼ hour to the total cooking time.Safety precaution: While you can get an estimated cooking time based on the size of your turkey, you’ll need to check its doneness to be sure. To make sure your turkey is safe to eat, use a meat thermometer to check that both the meat and the stuffing have reached an internal temperature of 165 °F (74 °C) before you eat it."
        },
        {
          "headline":"Place the turkey in the roasting pan and put it in the oven.",
          "description":"Once the turkey is prepared and the oven is on, put the turkey in the roasting pan and cover it with the aluminum foil tent. If possible, put the turkey in the oven so the legs face toward the back, since these take longer to cook than the breast. Your turkey will likely produce a lot of liquid, especially if it’s brined or self-basting. However, if your turkey is unbrined, you can add a little extra moisture by pouring 2 cups (470 mL) of turkey stock into the bottom of the pan."
        },
        {
          "headline":"Baste the turkey every 30 minutes.",
          "description":"Open the oven, carefully unfold the foil, and use a turkey baster or a spoon to pour the turkey's juices from the bottom of the roasting pan over the skin of the turkey. Basting will help the skin brown more evenly. If your turkey isn’t making enough moisture on its own, you can add a little more stock to the bottom of the pan."
        },
        {
          "headline":"Remove the foil in the last 45 minutes to crisp the skin.",
          "description":"During the last 30-45 minutes of cooking, remove the foil over the breast and thighs. This will help the skin become brown and crispy. Leaving the foil over the ends of the wings and drumsticks will help keep them from scorching. If any part of your turkey is browning too quickly, try turning the pan to help distribute the heat more evenly."
        },
        {
          "headline":"Use a meat thermometer to see if the turkey is done.",
          "description":"When your estimated cooking time is finished, use a meat thermometer to check if the turkey is ready to come out. Place the thermometer in the inside thigh. The turkey is done when the temperature reaches 165 °F (74 °C). Your turkey might cook faster than you anticipated, so start checking the temperature about halfway through the estimated cooking time. If the turkey still isn’t hot enough at the end of the estimated cooking time, put it in for another 20 minutes and then check it again. Don’t forget to check the temperature of the stuffing, too!"
        }
      ]
    },
    {
      "name":"Resting and Carving the Turkey",
      "steps":[
        {
          "headline":"Let the turkey rest for 30 minutes once it’s cooked.",
          "description":"Tilt the pan so that the juices collect at one end. Lift the turkey and foil from the pan and place it on a large cutting board. Tent the foil over the turkey and let it rest for 30 minutes. This ensures that the turkey will be moist and tender. While the turkey is resting, use the juices to make gravy. If you stuffed the turkey, use a spoon to move the stuffing from the turkey to a serving dish."
        },
        {
          "headline":"Carve the turkey when it's finished resting.",
          "description":"Turkeys are carved using the same technique as chickens. Using a sharp knife, remove the legs, thighs, and wings, and carve the meat away from the breasts. Place the white meat and the dark meat in separate areas on a platter. Don't forget to remove the wishbone, so you can make a wish! If you trussed the turkey’s legs, make sure to cut the twine before you start carving."
        },
        {
          "headline":"Store any leftover turkey in your fridge or freezer.",
          "description":"Leftover turkey meat is delicious in turkey soup, turkey sandwiches, and turkey casserole. You can store the cooked turkey in the fridge for 3-4 days or for up to 3 months in the freezer.Tip: When you’re reheating leftovers, try to reheat only as much as you plan to eat right away. Repeatedly reheating leftover turkey will cause it to dry out and lose its flavor. Make sure to put the turkey in an airtight container. If you plan to freeze it, use a freezer-safe plastic tub or bag."
        }
      ]
    }
  ],
  "text":" Choosing and Preparing the Turkey Pick out a good quality turkey. A turkey is an item that's worth splurging on if you can. Turkeys that have been frozen for a long time, have been sitting out in the display for a while, or have been treated with preservatives won't taste as good or cook as well as fresh, untreated turkeys. Keep these pointers in mind when you're picking one out:\nTry to get a fresh turkey from a butcher rather than from the meat display at the grocery store. Butcher shops tend to have meat that is fresher. Free-range or pasture-raised turkeys are more expensive than coop-raised turkeys, but they tend to have a more robust flavor. Self-basted turkeys have added seasonings and water, making them extra moist and salty. You might consider the moisture a plus, but these birds will have less of a natural turkey flavor than untreated turkeys. Kosher turkeys also have added salt, which can affect the flavor. Get a turkey that’s the right size for your needs. Before you buy a turkey, consider how many people you're feeding. As a rule of thumb, aim to get about 1 pound (0.45 kg) of bird per person, or a little more. So, for example, a small 12–14 lb (5.4–6.4 kg) turkey will feed up to 14 people, a medium 15–17 lb (6.8–7.7 kg) turkey will feed up to 17, and a large 18–21 pounds (8.2–9.5 kg) turkey can feed up to 21. If you want plenty of leftovers, get a larger bird than you need to serve everyone. Thaw the turkey if necessary. If you happen to choose a frozen turkey for your meal, it's very important to take it out of the freezer ahead of time to allow the turkey to fully defrost and thaw prior to cooking. The safest thawing method is to put the turkey on the bottom shelf of your fridge in its original wrapping. Give it 24 hours of thawing time for every 4–5 pounds (1.8–2.3 kg) of weight.Did you know? You can safely cook a frozen turkey, but the process takes 50% longer than cooking a fresh or defrosted turkey. For a faster thaw, put the wrapped turkey in a sink full of cold water. This method takes approximately 30 minutes per 1 pound (0.45 kg) of bird. For safety reasons, you’ll need to change the water every 30 minutes and cook the turkey as soon as it’s done thawing. If you’re really pressed for time, try defrosting your unwrapped turkey in a deep dish in the microwave (if it fits!). While the amount of time this takes varies, you’ll generally need 6 minutes of defrosting time for each 1 pound (0.45 kg) of turkey. Empty the turkey's cavity if it has giblets. Before you cook your turkey, remove any giblets from the inside cavity. They often come in a little bag that is easily discarded, although some people like to save them for soup or incorporate them into the stuffing. You may also find a neck in the cavity; either save it or discard it. You may find giblets either in the main cavity of the turkey or tucked under a flap of skin at the head end of the bird. Rinse the turkey under running water only if it’s brined. If you’re cooking a brined turkey, give the inside cavity a quick rinse under cool, running water to remove excess brine. Keep the roasting pan next to the sink so you can transfer the turkey there easily without dripping all over your work area. Afterward, pat the turkey dry with paper towels to make sure the skin gets nice and crispy in the oven. Note: The USDA does not recommend rinsing turkeys before cooking them unless they are brined. Rinsing an unbrined turkey will not do much except unnecessarily spread germs around your kitchen. Wash your sink with hot, soapy water both before and after rinsing a brined turkey. You can also protect the area around the sink by laying down paper towels first. Stuffing and Seasoning the Turkey Brine the turkey if desired. Brining involves soaking your turkey in a salt solution infused with aromatic herbs and spices. The brining process adds both flavor and moisture to the turkey and prevents drying during the cooking process. To brine your turkey, put the turkey in a large, covered pot with enough brining solution to cover it completely. Refrigerate the turkey in the brine for 12-24 hours before cooking it. You’ll need to rinse your turkey and pat it dry after you brine it. Chefs differ with regard to whether brining a turkey is really necessary. If you love the taste of salty turkey meat, you might want to give it a try; if you'd prefer to avoid eating a lot of salt, skip the brine. Don’t brine your turkey if it’s Kosher, self-basting, or pre-brined. This will result in an unpleasantly salty turkey. You can make a basic brine by dissolving 1 cup (about 250 g) of kosher salt in 4 US quarts (3.8 L) of warm water. Add aromatics, such as bay leaves, peppercorns, cloves, allspice, or lemon peel, to taste. Prepare the stuffing of your choice. You can either use a boxed stuffing mix or make stuffing from scratch. Check your recipe closely to make sure you prepare the right amount of stuffing for your turkey based on the size of the bird. As a rule, you should aim to prepare about ¾ of a cup (about 150 g) of stuffing per 1 pound (0.45 kg) of turkey. Stuff the turkey if you like. Once the stuffing is cooked and cool enough to handle, loosely fill the turkey’s neck cavity and fold over the flap of skin to keep the stuffing contained. If you like, you can pin the skin in place with a metal skewer. Spoon the rest of the stuffing loosely into the body cavity and truss the legs together with kitchen twine.Tip: Some cooks dislike adding stuffing because it causes the turkey to cook unevenly and increases the total cooking time. There's no need to stuff your turkey if you'd prefer not to. As an alternative to adding the stuffing directly to the turkey, you can cook it separately in a baking dish. Rub the turkey with olive oil and season it to taste. Once the turkey is stuffed (or not, if you prefer to make the stuffing separately), rub the skin all over with olive oil or melted, clarified butter to lock in moisture. Season the turkey with a little salt and pepper if you wish. Skip the salt if your turkey is brined, self-basting, or kosher. You can also experiment with other seasonings, such as rosemary, sage, or garlic powder. If you’re feeling a little more ambitious, try coating your turkey with a delicious sage butter. Roasting and Basting the Turkey Preheat the oven to 325 °F (163 °C). Cooking your turkey at a low, even temperature will help ensure that you get a tasty, tender bird. Put the baking rack in the lowest position in the oven so you’ll have plenty of room for your turkey. Some chefs recommend starting the turkey at 425 °F (218 °C) and then reducing the heat after half an hour. This approach will speed up your cooking time by 30-90 minutes, but it’s important to remember to turn the oven down! Cover a roasting pan with aluminum foil. Use 2 sheets of heavy-duty aluminum foil. 1 sheet should go length-wise across the pan and the next sheet width-wise. Make sure the sheets are large enough to fully wrap over and around the entire turkey to form a loose, sealed tent. This locks in moisture and helps prevent the turkey from scorching or browning too quickly. Some cooks recommend waiting until 2/3rds of the way through the cooking time before adding a foil tent to the turkey. This can help prevent scorching while giving the skin plenty of time to get crisp. Determine the cooking time based on the turkey’s weight. The average cooking time is 20 minutes per 1 pound (0.45 kg) of turkey if your bird is unstuffed. If your turkey is stuffed, however, add an extra ¼ hour to the total cooking time.Safety precaution: While you can get an estimated cooking time based on the size of your turkey, you’ll need to check its doneness to be sure. To make sure your turkey is safe to eat, use a meat thermometer to check that both the meat and the stuffing have reached an internal temperature of 165 °F (74 °C) before you eat it. Place the turkey in the roasting pan and put it in the oven. Once the turkey is prepared and the oven is on, put the turkey in the roasting pan and cover it with the aluminum foil tent. If possible, put the turkey in the oven so the legs face toward the back, since these take longer to cook than the breast. Your turkey will likely produce a lot of liquid, especially if it’s brined or self-basting. However, if your turkey is unbrined, you can add a little extra moisture by pouring 2 cups (470 mL) of turkey stock into the bottom of the pan. Baste the turkey every 30 minutes. Open the oven, carefully unfold the foil, and use a turkey baster or a spoon to pour the turkey's juices from the bottom of the roasting pan over the skin of the turkey. Basting will help the skin brown more evenly. If your turkey isn’t making enough moisture on its own, you can add a little more stock to the bottom of the pan. Remove the foil in the last 45 minutes to crisp the skin. During the last 30-45 minutes of cooking, remove the foil over the breast and thighs. This will help the skin become brown and crispy. Leaving the foil over the ends of the wings and drumsticks will help keep them from scorching. If any part of your turkey is browning too quickly, try turning the pan to help distribute the heat more evenly. Use a meat thermometer to see if the turkey is done. When your estimated cooking time is finished, use a meat thermometer to check if the turkey is ready to come out. Place the thermometer in the inside thigh. The turkey is done when the temperature reaches 165 °F (74 °C). Your turkey might cook faster than you anticipated, so start checking the temperature about halfway through the estimated cooking time. If the turkey still isn’t hot enough at the end of the estimated cooking time, put it in for another 20 minutes and then check it again. Don’t forget to check the temperature of the stuffing, too! Resting and Carving the Turkey Let the turkey rest for 30 minutes once it’s cooked. Tilt the pan so that the juices collect at one end. Lift the turkey and foil from the pan and place it on a large cutting board. Tent the foil over the turkey and let it rest for 30 minutes. This ensures that the turkey will be moist and tender. While the turkey is resting, use the juices to make gravy. If you stuffed the turkey, use a spoon to move the stuffing from the turkey to a serving dish. Carve the turkey when it's finished resting. Turkeys are carved using the same technique as chickens. Using a sharp knife, remove the legs, thighs, and wings, and carve the meat away from the breasts. Place the white meat and the dark meat in separate areas on a platter. Don't forget to remove the wishbone, so you can make a wish! If you trussed the turkey’s legs, make sure to cut the twine before you start carving. Store any leftover turkey in your fridge or freezer. Leftover turkey meat is delicious in turkey soup, turkey sandwiches, and turkey casserole. You can store the cooked turkey in the fridge for 3-4 days or for up to 3 months in the freezer.Tip: When you’re reheating leftovers, try to reheat only as much as you plan to eat right away. Repeatedly reheating leftover turkey will cause it to dry out and lose its flavor. Make sure to put the turkey in an airtight container. If you plan to freeze it, use a freezer-safe plastic tub or bag.",
  "tyn_model":[
    "turkey",
    "turkeys",
    "water",
    "stuffing",
    "oven",
    "foil",
    "roasting pan",
    "salt",
    "meat thermometer",
    "pan",
    "paper towels",
    "olive oil",
    "aluminum foil",
    "spoon",
    "butcher",
    "meat",
    "seasonings",
    "bird",
    "freezer",
    "fridge",
    "deep dish",
    "microwave",
    "brining solution",
    "brine",
    "kosher",
    "kosher salt",
    "cloves",
    "allspice",
    "lemon peel",
    "kitchen twine",
    "baking dish",
    "clarified butter",
    "salt and pepper",
    "rosemary",
    "sage",
    "garlic powder",
    "sage butter",
    "baking rack",
    "heavy-duty aluminum foil",
    "foil tent",
    "turkey stock",
    "turkey baster",
    "stock",
    "drumsticks",
    "thermometer",
    "large cutting board",
    "serving dish",
    "chickens",
    "sharp knife",
    "twine",
    "airtight container",
    "freezer-safe plastic tub"
  ],
  "tyn_section":[

  ]
}