{
  "title":"How to Make a Chocolate Cookie Dough Cake",
  "url":"https://www.wikihow.com/Make-a-Chocolate-Cookie-Dough-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "parts":[
    {
      "name":"Making the Chocolate Cake",
      "steps":[
        {
          "headline":"Preheat the oven to 350 degrees Fahrenheit or 176 degrees Celsius.",
          "description":""
        },
        {
          "headline":"Grease three 6 inch (15.2 cm) round cake pans and dust with cocoa powder.",
          "description":""
        },
        {
          "headline":"Combine the dry ingredients together.",
          "description":"In a large bowl, mix the salt, baking soda, baking powder, cocoa, and flour together until well mixed."
        },
        {
          "headline":"In a separate bowl, whisk the wet ingredients.",
          "description":"Beat the oil, buttermilk, vanilla, and eggs until well-mixed. Pour in the coffee slowly to avoid cooking the eggs slightly, since the coffee is hot."
        },
        {
          "headline":"Pour the wet ingredients in with the dry.",
          "description":"Blend for about 2-3 minutes with an electric mixer on medium speed. The cake batter will be thin."
        },
        {
          "headline":"Pour the cake batter evenly into the three pans.",
          "description":""
        },
        {
          "headline":"Bake the three cakes in the oven for about 30-35 minutes.",
          "description":""
        },
        {
          "headline":"Allow the cakes to cool for about 10 minutes.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Frosting and Ganache",
      "steps":[
        {
          "headline":"Cream the butter and both sugars with an electric mixer until light and fluffy.",
          "description":""
        },
        {
          "headline":"Add in the vanilla extract and mix until well-combined.",
          "description":""
        },
        {
          "headline":"Fold in the flour, salt, and milk.",
          "description":"Mix slowly on low speed for about 2-3 minutes."
        },
        {
          "headline":"Add the chocolate chips and blend until fully combined.",
          "description":""
        },
        {
          "headline":"Set the cookie dough aside for later use.",
          "description":""
        },
        {
          "headline":"Make the ganache.",
          "description":"Microwave the dark chocolate and cream in a microwave-safe bowl. Stir every 30 seconds with spoon until the mixture fully melts and is smooth."
        }
      ]
    },
    {
      "name":"Assembling the Cake",
      "steps":[
        {
          "headline":"Place one of the layers of the cake on a cake stand.",
          "description":""
        },
        {
          "headline":"Spread 2/3 cup of frosting over it and repeat with the other layers.",
          "description":"Be sure to smooth the outside of the cake using a large butter knife."
        },
        {
          "headline":"Chill the cake in the fridge for about 30 minutes until slightly firm.",
          "description":""
        },
        {
          "headline":"Drip the ganache all over the cake and fill the tops with it.",
          "description":""
        },
        {
          "headline":"Chill the cake again for abut 15 minutes until the ganache hardens.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Garnish with chopped chocolate chip cookies if desired. Slice the cake and lay it on a serving plate. Enjoy!"
        }
      ]
    }
  ],
  "text":" Making the Chocolate Cake Preheat the oven to 350 degrees Fahrenheit or 176 degrees Celsius.  Grease three 6 inch (15.2 cm) round cake pans and dust with cocoa powder.  Combine the dry ingredients together. In a large bowl, mix the salt, baking soda, baking powder, cocoa, and flour together until well mixed. In a separate bowl, whisk the wet ingredients. Beat the oil, buttermilk, vanilla, and eggs until well-mixed. Pour in the coffee slowly to avoid cooking the eggs slightly, since the coffee is hot. Pour the wet ingredients in with the dry. Blend for about 2-3 minutes with an electric mixer on medium speed. The cake batter will be thin. Pour the cake batter evenly into the three pans.  Bake the three cakes in the oven for about 30-35 minutes.  Allow the cakes to cool for about 10 minutes.  Making the Frosting and Ganache Cream the butter and both sugars with an electric mixer until light and fluffy.  Add in the vanilla extract and mix until well-combined.  Fold in the flour, salt, and milk. Mix slowly on low speed for about 2-3 minutes. Add the chocolate chips and blend until fully combined.  Set the cookie dough aside for later use.  Make the ganache. Microwave the dark chocolate and cream in a microwave-safe bowl. Stir every 30 seconds with spoon until the mixture fully melts and is smooth. Assembling the Cake Place one of the layers of the cake on a cake stand.  Spread 2/3 cup of frosting over it and repeat with the other layers. Be sure to smooth the outside of the cake using a large butter knife. Chill the cake in the fridge for about 30 minutes until slightly firm.  Drip the ganache all over the cake and fill the tops with it.  Chill the cake again for abut 15 minutes until the ganache hardens.  Serve. Garnish with chopped chocolate chip cookies if desired. Slice the cake and lay it on a serving plate. Enjoy!",
  "tyn_model":[
    "oven",
    "salt",
    "flour",
    "eggs",
    "coffee",
    "electric mixer",
    "cake batter",
    "chocolate cake",
    "cake pans",
    "cocoa powder",
    "large bowl",
    "baking soda",
    "baking powder",
    "cocoa",
    "oil",
    "buttermilk",
    "vanilla",
    "butter",
    "sugars",
    "vanilla extract",
    "milk",
    "chocolate chips",
    "cookie dough",
    "dark chocolate",
    "cream",
    "microwave-safe bowl",
    "spoon",
    "cake stand",
    "large butter knife",
    "fridge",
    "cake",
    "chocolate chip cookies",
    "serving plate"
  ],
  "tyn_section":[

  ]
}