{
  "title":"How to Use Bounce Flash to Improve Your Photography",
  "url":"https://www.wikihow.com/Use-Bounce-Flash-to-Improve-Your-Photography",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographic Techniques"
  ],
  "steps":[
    {
      "headline":"Make sure your camera has either a hot-shoe for an external flash, or a socket for plugging one in.",
      "description":"Most cameras have at least one of the two."
    },
    {
      "headline":"Invest in an external flash unit with a 90 degree swivel (bounce) head.",
      "description":"All major camera makers sell reasonably-priced units with this feature. Some models also rotate, adding even more functionality."
    },
    {
      "headline":"When taking a flash picture indoors, turn off the camera's built-in flash.",
      "description":"Point the bounce flash head at the ceiling (rather than at the subject) and take the picture. This will provide a soft, diffused light and it will cut down on red-eye."
    },
    {
      "headline":"For even better results, buy a cable which connects your camera to the flash unit.",
      "description":"You can then remove the flash from the camera and bounce the light off walls, a reflector, or whatever you want."
    },
    {
      "headline":"While Professor Kobre's Lightscoop is not advertised to replace external flash units, some photographers may be interested in its low-tech but effective approach to bouncing the built-in flash itself.",
      "description":"To bounce the built-in flash with the Lightscoop (no external flash necessary):\n\nSlide the Lightscoop onto the camera's hot shoe. Set the camera to work in Manual mode. Set the camera's exposure mode to Spot meter. Set the ISO to 800. Set the shutter speed to 1/200. Set the aperture to the lens's maximum."
    },
    {
      "headline":"As is the case when bouncing an external flash (see \"Warnings\"), the Lightscoop works best with light-colored ceilings approximately 8–10 feet (2.4–3.0 m) tall or walls (when camera is in vertical orientation).",
      "description":"It will NOT work in rooms with cathedral ceilings, paneled wood ceilings, in gymnasiums or churches, or in places like nightclubs with dark ceilings. When ceilings are too high or too dark, not enough light can bounce back to reach the scene below."
    },
    {
      "headline":"If you do own a hotshoe flash with a head that can tilt upwards consider getting a diffuser such as a Sto-fen Omnibounce or a Lightsphere these allow for a bounce-like effect when there is no handy surface to bounce flash from.",
      "description":"A budget alternative is creating one yourself."
    }
  ],
  "text":" Make sure your camera has either a hot-shoe for an external flash, or a socket for plugging one in. Most cameras have at least one of the two. Invest in an external flash unit with a 90 degree swivel (bounce) head. All major camera makers sell reasonably-priced units with this feature. Some models also rotate, adding even more functionality. When taking a flash picture indoors, turn off the camera's built-in flash. Point the bounce flash head at the ceiling (rather than at the subject) and take the picture. This will provide a soft, diffused light and it will cut down on red-eye. For even better results, buy a cable which connects your camera to the flash unit. You can then remove the flash from the camera and bounce the light off walls, a reflector, or whatever you want. While Professor Kobre's Lightscoop is not advertised to replace external flash units, some photographers may be interested in its low-tech but effective approach to bouncing the built-in flash itself. To bounce the built-in flash with the Lightscoop (no external flash necessary):\n\nSlide the Lightscoop onto the camera's hot shoe. Set the camera to work in Manual mode. Set the camera's exposure mode to Spot meter. Set the ISO to 800. Set the shutter speed to 1/200. Set the aperture to the lens's maximum. As is the case when bouncing an external flash (see \"Warnings\"), the Lightscoop works best with light-colored ceilings approximately 8–10 feet (2.4–3.0 m) tall or walls (when camera is in vertical orientation). It will NOT work in rooms with cathedral ceilings, paneled wood ceilings, in gymnasiums or churches, or in places like nightclubs with dark ceilings. When ceilings are too high or too dark, not enough light can bounce back to reach the scene below. If you do own a hotshoe flash with a head that can tilt upwards consider getting a diffuser such as a Sto-fen Omnibounce or a Lightsphere these allow for a bounce-like effect when there is no handy surface to bounce flash from. A budget alternative is creating one yourself.",
  "tyn_model":[
    "lightscoop",
    "bounce flash",
    "reflector",
    "diffuser",
    "sto-fen"
  ],
  "tyn_section":[

  ]
}