{
  "title":"How to Love the Taste of Water",
  "url":"https://www.wikihow.com/Love-the-Taste-of-Water",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Water Ice and Sports Drinks"
  ],
  "parts":[
    {
      "name":"Encouraging your enjoyment of water",
      "steps":[
        {
          "headline":"Change the taste of water.",
          "description":"It's simple to make slight improvements to the taste of the water without adding too many calories and without making it unhealthy. Some suggestions:\nAdd a little squirt of lemon or lime into the water. It will add a little bit of sourness and will taste good. Add fresh, clean mint leaves to the water and some ice. Chill in the fridge for a bit and then drink as needed. Many other fragrant herbs can be experimented with. Add a drop or two of bitters (regular or orange), which can also mask the flavor of tap water, if your building has old pipes or the water has other unpleasant off-flavors. Add strawberry halves and leave to sit for about 5 minutes before drinking. In fact, many berries are suitable for this treatment and you can eat the berries too! Some people find it helps to slightly warm water during the cooler months, especially first thing in the morning. A small squeeze of lemon juice in slightly warmed water is an excellent, refreshing way to wake up in the morning and also has detoxing properties."
        },
        {
          "headline":"Drink only water for a while.",
          "description":"This might seem counterintuitive, but when you drink super-sweet beverages like soda pop and juice all the time, it is hard for water to compete. Your affinity for sweetness can decrease if you expose yourself to less of it. In addition, if you eliminate all the unhealthy sources of fluids, such as sodas, fruit juices, and sugary drinks or flavored milks, you will be healthier and you are likely to lose weight. An occasional treat is fine, as you don't have to totally restrict yourself but be very disciplined about such \"candy drinks\". You might even find that after not drinking them for a while, they are too sweet!"
        },
        {
          "headline":"Trick yourself into liking water.",
          "description":"Learn to love the taste of water by associating it with pleasant things. Each time you drink water, think of something that makes you happy – a person you love, an activity you enjoy, a food you like, a merry song, a beautiful scenery – whatever works best. And try to drink water when you are enjoying good company, or when you are doing things you enjoy. This is called classical, or Pavlovian, conditioning. When something you love (the conditioned stimulus) is paired with drinking water (the unconditioned stimulus), you eventually associate the two stimuli together, and, in this case, you will learn to love the taste of water because you associate it with things you love. Keep telling yourself that you love the taste of water. And tell it to others as well. The more you reinforce the idea, the deeper the idea will become rooted in your mind, and, in order to avoid cognitive dissonance, you will eventually love the taste of water when it matches your beliefs."
        },
        {
          "headline":"Always keep water near you.",
          "description":"Having water with you is a certain means for getting you to drink it! The more you resort to drinking it in place of other liquids, the more it will taste the very best to you. If you're going to be sitting for a long time, keep a glass of water near, and you will reach for it and drink without even noticing. Always bring a reusable eco-friendly water bottle with you so that you're not tempted to buy bottled water. Keep a glass of water next to your bed at night."
        }
      ]
    },
    {
      "name":"Appreciating the benefits of water",
      "steps":[
        {
          "headline":"Learn about the benefits of drinking water.",
          "description":"The more you know about why water is good for you, the stronger your desire will become to drink it, and the more enjoyable it will be. Just some benefits of drinking water include:\nDrinking an adequate amount of water will prevent excess thirst or dry mouth. Water is very important for the body. An estimated 60 to 70 percent of our bodies consists of water, and our bodily fluids (urine, sweat, blood, tears and the fluids in and between the cells) are comprised principally of water. Water aids digestion, keeps our skin hydrated (and supple) and keeps the mucous membranes moist. Most importantly, water carries nutrients to every cell in our body. Water helps us to get rid of toxins in the body. Water increases kidney filtration rate, so you can eliminate waste products more effectively and keep the kidneys healthy. And water helps to keep your body's waste disposal system (liver, kidneys, lungs, digestive system, lymphatic system, and skin) functioning efficiently. Water can help your mind function better. If you are not drinking enough fluids, you may get lightheaded, dizzy, or have a headache. These are symptoms of dehydration. Drinking enough water will prevent fatigue or muscle weakness resulting from dehydration. Muscles and joints can feel pain and you may experience backache when you haven't had enough water. Water helps to reduce bloating. Water can be an aid in weight loss by helping to increase  your metabolism rate. Water also helps to lose weight because \"thirst\" can be misinterpreted by your body as \"hunger\" and cause you to eat unnecessarily. As such, drinking water instead of juice and soda can help to regulate your appetite. Water is vital in regulating your body's temperature. Drinking water is the best preventive measure for kidney stones, as water lowers the risk of crystal precipitation and helps to wash out any small stones that do form. Moreover, there is some evidence that women with high water intakes have a reduced level of lower urinary tract cancers and colon cancer. Water saves you money! Water is cheaper than other sources of fluid."
        },
        {
          "headline":"Understand the importance of replenishing water regularly.",
          "description":"As already noted above, water is an important part of removing toxins from our bodies and in keeping our entire system well hydrated and functioning properly. Another factor to consider is the loss of water. Urine, waste elimination, sweat, tears, and breathing cause us to lose water all the time and this needs to be replenished constantly."
        },
        {
          "headline":"Know how much water you need.",
          "description":"The amount you need is dependent on your level of activity, the types of activities you undertake, the climate, and the food and other sources of liquid that you're consuming. And the advice about eight glasses of water a day is not based in science; it's advice with unfounded origin but has stuck as an urban nutrition myth, possibly because it's an easy guide to remember. That said however, getting adequate water daily is vital for your ongoing health. When gauging your water level need, some indicators that might help you include:\nColor of your urine: If your urine is pale yellow or straw color, and is of a good quantity, that's a good sign that you're getting plenty of fluids. However, vitamin supplements, some foods, and medications can affect the color. For example, vitamins from the B group can cause urine to become bright yellow or green; this is not bad, it is simply excess B being secreted but it could leave you concerned about your fluid intake! Frequency of urinating: If you urinate frequently and you don't have a medical condition such as diabetes, this is usually a good indicator of adequate fluid intake. Remember that some medications and foods can increase your need to urinate though. Thirst is not a good indicator of how much water you need or when. For most of us, thirst is a sign that fluid loss is already somewhere between 0.8 percent and 2 percent of total body weight, meaning that the body is already mildly dehydrated at this point. The older you are, the less sensitive your thirst indicators are. If you are very active, such as an athlete, an outdoor worker, a frequent sauna user, filled with nervous energy, sitting in indoor heating all day, living in the tropics and eating a lot of dehydrating foods, then you will need to increase your water intake accordingly.Pregnancy, breastfeeding, illness, age, gender, sedentary or active lifestyles, food intake, weight, etc., are all factors in your fluid intake requirements. Some people are strongly of the belief that adequate fluid can come from soups, herbal teas, watery foods, etc., such as those following macrobiotic diets. If that is your case, read up carefully on the requirements of your special diet and speak with your doctor for more advice to ensure optimal health. Water is lost rapidly during exercise. Dehydration occurs when fluid loss amounts to 1 percent or more of body weight; by 10 percent loss, it is life-threatening. Most people are dehydrated to a small degree rather than having enough. Bear this in mind when assessing your water needs. (See \"Warnings\" below for excessive water consumption.)"
        }
      ]
    }
  ],
  "text":" Encouraging your enjoyment of water Change the taste of water. It's simple to make slight improvements to the taste of the water without adding too many calories and without making it unhealthy. Some suggestions:\nAdd a little squirt of lemon or lime into the water. It will add a little bit of sourness and will taste good. Add fresh, clean mint leaves to the water and some ice. Chill in the fridge for a bit and then drink as needed. Many other fragrant herbs can be experimented with. Add a drop or two of bitters (regular or orange), which can also mask the flavor of tap water, if your building has old pipes or the water has other unpleasant off-flavors. Add strawberry halves and leave to sit for about 5 minutes before drinking. In fact, many berries are suitable for this treatment and you can eat the berries too! Some people find it helps to slightly warm water during the cooler months, especially first thing in the morning. A small squeeze of lemon juice in slightly warmed water is an excellent, refreshing way to wake up in the morning and also has detoxing properties. Drink only water for a while. This might seem counterintuitive, but when you drink super-sweet beverages like soda pop and juice all the time, it is hard for water to compete. Your affinity for sweetness can decrease if you expose yourself to less of it. In addition, if you eliminate all the unhealthy sources of fluids, such as sodas, fruit juices, and sugary drinks or flavored milks, you will be healthier and you are likely to lose weight. An occasional treat is fine, as you don't have to totally restrict yourself but be very disciplined about such \"candy drinks\". You might even find that after not drinking them for a while, they are too sweet! Trick yourself into liking water. Learn to love the taste of water by associating it with pleasant things. Each time you drink water, think of something that makes you happy – a person you love, an activity you enjoy, a food you like, a merry song, a beautiful scenery – whatever works best. And try to drink water when you are enjoying good company, or when you are doing things you enjoy. This is called classical, or Pavlovian, conditioning. When something you love (the conditioned stimulus) is paired with drinking water (the unconditioned stimulus), you eventually associate the two stimuli together, and, in this case, you will learn to love the taste of water because you associate it with things you love. Keep telling yourself that you love the taste of water. And tell it to others as well. The more you reinforce the idea, the deeper the idea will become rooted in your mind, and, in order to avoid cognitive dissonance, you will eventually love the taste of water when it matches your beliefs. Always keep water near you. Having water with you is a certain means for getting you to drink it! The more you resort to drinking it in place of other liquids, the more it will taste the very best to you. If you're going to be sitting for a long time, keep a glass of water near, and you will reach for it and drink without even noticing. Always bring a reusable eco-friendly water bottle with you so that you're not tempted to buy bottled water. Keep a glass of water next to your bed at night. Appreciating the benefits of water Learn about the benefits of drinking water. The more you know about why water is good for you, the stronger your desire will become to drink it, and the more enjoyable it will be. Just some benefits of drinking water include:\nDrinking an adequate amount of water will prevent excess thirst or dry mouth. Water is very important for the body. An estimated 60 to 70 percent of our bodies consists of water, and our bodily fluids (urine, sweat, blood, tears and the fluids in and between the cells) are comprised principally of water. Water aids digestion, keeps our skin hydrated (and supple) and keeps the mucous membranes moist. Most importantly, water carries nutrients to every cell in our body. Water helps us to get rid of toxins in the body. Water increases kidney filtration rate, so you can eliminate waste products more effectively and keep the kidneys healthy. And water helps to keep your body's waste disposal system (liver, kidneys, lungs, digestive system, lymphatic system, and skin) functioning efficiently. Water can help your mind function better. If you are not drinking enough fluids, you may get lightheaded, dizzy, or have a headache. These are symptoms of dehydration. Drinking enough water will prevent fatigue or muscle weakness resulting from dehydration. Muscles and joints can feel pain and you may experience backache when you haven't had enough water. Water helps to reduce bloating. Water can be an aid in weight loss by helping to increase  your metabolism rate. Water also helps to lose weight because \"thirst\" can be misinterpreted by your body as \"hunger\" and cause you to eat unnecessarily. As such, drinking water instead of juice and soda can help to regulate your appetite. Water is vital in regulating your body's temperature. Drinking water is the best preventive measure for kidney stones, as water lowers the risk of crystal precipitation and helps to wash out any small stones that do form. Moreover, there is some evidence that women with high water intakes have a reduced level of lower urinary tract cancers and colon cancer. Water saves you money! Water is cheaper than other sources of fluid. Understand the importance of replenishing water regularly. As already noted above, water is an important part of removing toxins from our bodies and in keeping our entire system well hydrated and functioning properly. Another factor to consider is the loss of water. Urine, waste elimination, sweat, tears, and breathing cause us to lose water all the time and this needs to be replenished constantly. Know how much water you need. The amount you need is dependent on your level of activity, the types of activities you undertake, the climate, and the food and other sources of liquid that you're consuming. And the advice about eight glasses of water a day is not based in science; it's advice with unfounded origin but has stuck as an urban nutrition myth, possibly because it's an easy guide to remember. That said however, getting adequate water daily is vital for your ongoing health. When gauging your water level need, some indicators that might help you include:\nColor of your urine: If your urine is pale yellow or straw color, and is of a good quantity, that's a good sign that you're getting plenty of fluids. However, vitamin supplements, some foods, and medications can affect the color. For example, vitamins from the B group can cause urine to become bright yellow or green; this is not bad, it is simply excess B being secreted but it could leave you concerned about your fluid intake! Frequency of urinating: If you urinate frequently and you don't have a medical condition such as diabetes, this is usually a good indicator of adequate fluid intake. Remember that some medications and foods can increase your need to urinate though. Thirst is not a good indicator of how much water you need or when. For most of us, thirst is a sign that fluid loss is already somewhere between 0.8 percent and 2 percent of total body weight, meaning that the body is already mildly dehydrated at this point. The older you are, the less sensitive your thirst indicators are. If you are very active, such as an athlete, an outdoor worker, a frequent sauna user, filled with nervous energy, sitting in indoor heating all day, living in the tropics and eating a lot of dehydrating foods, then you will need to increase your water intake accordingly.Pregnancy, breastfeeding, illness, age, gender, sedentary or active lifestyles, food intake, weight, etc., are all factors in your fluid intake requirements. Some people are strongly of the belief that adequate fluid can come from soups, herbal teas, watery foods, etc., such as those following macrobiotic diets. If that is your case, read up carefully on the requirements of your special diet and speak with your doctor for more advice to ensure optimal health. Water is lost rapidly during exercise. Dehydration occurs when fluid loss amounts to 1 percent or more of body weight; by 10 percent loss, it is life-threatening. Most people are dehydrated to a small degree rather than having enough. Bear this in mind when assessing your water needs. (See \"Warnings\" below for excessive water consumption.)",
  "tyn_model":[
    "water",
    "lemon",
    "lime",
    "ice",
    "bitters",
    "tap water",
    "strawberry",
    "berries",
    "soda pop and juice",
    "fruit juices",
    "– a",
    "– whatever",
    "water bottle",
    "vitamins",
    "urine",
    "thirst",
    "sauna",
    "fluid"
  ],
  "tyn_section":[

  ]
}