{
  "title":"How to Choose Knitting Supplies",
  "url":"https://www.wikihow.com/Choose-Knitting-Supplies",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Knitting",
    "Knitting Tools and Accessories"
  ],
  "parts":[
    {
      "name":"Choosing Yarn",
      "steps":[
        {
          "headline":"Go with a medium worsted weight yarn.",
          "description":"Whether you are just getting started or working on your 100th sweater, medium worsted weight yarn is a safe bet. You can find this kind of yarn in almost any color and it comes in a variety of materials, such as acrylic, wool, alpaca, cashmere, and bamboo. To figure out if a yarn is medium worsted weight, check the label on the yarn. It should describe the weight with a term like medium, bulky, or super bulky."
        },
        {
          "headline":"Consider a bulky yarn.",
          "description":"If you want to finish a project faster, or you just like the bulky look, then opt for a bulky or extra bulky yarn. These yarns are popular as well, so you will have lots of different colors to choose from. Most often, bulky yarns are acrylic, but you may be able to find them in other materials if you go to a craft or specialty yarn store."
        },
        {
          "headline":"Try cotton yarn for washcloths.",
          "description":"Cotton yarn does not give the way that other types of yarn do, so it is not usually a good type of yarn for hats and other garments that need some stretch to them. However, cotton yarn is excellent for making washcloths and hand towels. If you feel like making a washcloth, try picking up a ball of cotton yarn."
        },
        {
          "headline":"Experiment with a specialty yarn.",
          "description":"There are some really fun specialty yarns available, so try one out the next time you are feeling adventurous. You can find yarn that is made from t-shirt material, woven with metallic ribbon, or that looks fluffy like feathers or fur."
        }
      ]
    },
    {
      "name":"Choosing Knitting Needles",
      "steps":[
        {
          "headline":"Opt for some metallic or plastic needles.",
          "description":"Metallic and plastic needles are the cheapest and most widely available, so these are great for knitting on a budget or building up your supply of different size needles. You can even find sets of three or more pairs of metallic needles if you want to buy in bulk. Metallic needles can make it easier to knit faster, but plastic needles are lighter in weight. Try starting with a standard size 8 needle. This is a common size for patterns that use medium worsted weight yarn."
        },
        {
          "headline":"Use bamboo or wood needles if you are just starting out.",
          "description":"Bamboo and wood needles are incredibly popular among knitters. They are often easier to grip and some knitters prefer the texture of wood or bamboo to plastic or metal. If you are new to knitting, or if you have never tried using bamboo or plastic needles, give them a try. You can get bamboo needles in all sizes."
        },
        {
          "headline":"Try out circular needles.",
          "description":"Circular needles are knitting needles with a length of nylon suspended between them. They are mainly use for knitting in the round, such as making sweaters or hats. However, some people also like to knit on circular needles when doing a big project like a blanket because it is easier to fit all the stitches. You can also use double ended needles for small scale knitting in the round, such as for making mittens or a hat for a baby."
        }
      ]
    },
    {
      "name":"Choosing Additional Supplies",
      "steps":[
        {
          "headline":"Choose a pattern.",
          "description":"You can find tons of free knitting patterns online, or you can purchase knitting pattern books for everything from washcloths to hats to lap blankets. Browse through some patterns online or in a pattern book to find a project that you want to make. A pattern is also a helpful guide for the supplies you will need to complete a project. Always check you pattern and get the exact type of yarn, needles, and other supplies indicated for the project."
        },
        {
          "headline":"Get a pair of sharp scissors.",
          "description":"Sharp scissors are a must for knitting. You may only need to use them once for your project, or you may find yourself using them every 15 minutes if you have to switch your yarn out a lot. Keep a pair handy while you are working."
        },
        {
          "headline":"Buy some stitch markers.",
          "description":"Stitch markers are little plastic rings that go around your needles to mark the beginning of a stitch. They are especially useful for complex projects and for marking the start of your stitches when knitting in the round."
        },
        {
          "headline":"Try out cabling with a cable hook.",
          "description":"Cabling intimidates many knitters when they are first starting out, but cabling is much easier than it looks. A cable hook is essential for cabling, so make sure to pick one up when you feel ready to try out this technique. They come in many different sizes."
        },
        {
          "headline":"Grab some end protectors.",
          "description":"End protectors go on the ends of your knitting needles to keep the yarn from sliding off when you are working or taking a break. These are especially useful when you are knitting on double ended needles, but you can place them on the ends of any type of needle when you are ready to put it away for the day."
        },
        {
          "headline":"Keep a tapestry needle on hand.",
          "description":"You can buy large eye plastic tapestry needles in craft stores to help with finishing your knitting projects. These are essential for weaving in the ends of your knitting project and adding embellishments like pompoms on hats."
        },
        {
          "headline":"Buy yourself a nice knitting bag.",
          "description":"You will need someplace nice to keep all of your supplies, so pick up a knitting bag for yourself. If you don’t want to purchase a bag, then you can also designate a canvas bag or tote as your knitting supply bag."
        }
      ]
    }
  ],
  "text":" Choosing Yarn Go with a medium worsted weight yarn. Whether you are just getting started or working on your 100th sweater, medium worsted weight yarn is a safe bet. You can find this kind of yarn in almost any color and it comes in a variety of materials, such as acrylic, wool, alpaca, cashmere, and bamboo. To figure out if a yarn is medium worsted weight, check the label on the yarn. It should describe the weight with a term like medium, bulky, or super bulky. Consider a bulky yarn. If you want to finish a project faster, or you just like the bulky look, then opt for a bulky or extra bulky yarn. These yarns are popular as well, so you will have lots of different colors to choose from. Most often, bulky yarns are acrylic, but you may be able to find them in other materials if you go to a craft or specialty yarn store. Try cotton yarn for washcloths. Cotton yarn does not give the way that other types of yarn do, so it is not usually a good type of yarn for hats and other garments that need some stretch to them. However, cotton yarn is excellent for making washcloths and hand towels. If you feel like making a washcloth, try picking up a ball of cotton yarn. Experiment with a specialty yarn. There are some really fun specialty yarns available, so try one out the next time you are feeling adventurous. You can find yarn that is made from t-shirt material, woven with metallic ribbon, or that looks fluffy like feathers or fur. Choosing Knitting Needles Opt for some metallic or plastic needles. Metallic and plastic needles are the cheapest and most widely available, so these are great for knitting on a budget or building up your supply of different size needles. You can even find sets of three or more pairs of metallic needles if you want to buy in bulk. Metallic needles can make it easier to knit faster, but plastic needles are lighter in weight. Try starting with a standard size 8 needle. This is a common size for patterns that use medium worsted weight yarn. Use bamboo or wood needles if you are just starting out. Bamboo and wood needles are incredibly popular among knitters. They are often easier to grip and some knitters prefer the texture of wood or bamboo to plastic or metal. If you are new to knitting, or if you have never tried using bamboo or plastic needles, give them a try. You can get bamboo needles in all sizes. Try out circular needles. Circular needles are knitting needles with a length of nylon suspended between them. They are mainly use for knitting in the round, such as making sweaters or hats. However, some people also like to knit on circular needles when doing a big project like a blanket because it is easier to fit all the stitches. You can also use double ended needles for small scale knitting in the round, such as for making mittens or a hat for a baby. Choosing Additional Supplies Choose a pattern. You can find tons of free knitting patterns online, or you can purchase knitting pattern books for everything from washcloths to hats to lap blankets. Browse through some patterns online or in a pattern book to find a project that you want to make. A pattern is also a helpful guide for the supplies you will need to complete a project. Always check you pattern and get the exact type of yarn, needles, and other supplies indicated for the project. Get a pair of sharp scissors. Sharp scissors are a must for knitting. You may only need to use them once for your project, or you may find yourself using them every 15 minutes if you have to switch your yarn out a lot. Keep a pair handy while you are working. Buy some stitch markers. Stitch markers are little plastic rings that go around your needles to mark the beginning of a stitch. They are especially useful for complex projects and for marking the start of your stitches when knitting in the round. Try out cabling with a cable hook. Cabling intimidates many knitters when they are first starting out, but cabling is much easier than it looks. A cable hook is essential for cabling, so make sure to pick one up when you feel ready to try out this technique. They come in many different sizes. Grab some end protectors. End protectors go on the ends of your knitting needles to keep the yarn from sliding off when you are working or taking a break. These are especially useful when you are knitting on double ended needles, but you can place them on the ends of any type of needle when you are ready to put it away for the day. Keep a tapestry needle on hand. You can buy large eye plastic tapestry needles in craft stores to help with finishing your knitting projects. These are essential for weaving in the ends of your knitting project and adding embellishments like pompoms on hats. Buy yourself a nice knitting bag. You will need someplace nice to keep all of your supplies, so pick up a knitting bag for yourself. If you don’t want to purchase a bag, then you can also designate a canvas bag or tote as your knitting supply bag.",
  "tyn_model":[
    "yarn",
    "needles",
    "circular needles",
    "scissors",
    "stitch markers",
    "cable hook",
    "end protectors",
    "wool",
    "bamboo",
    "cotton yarn",
    "bamboo needles",
    "knitting pattern books",
    "tapestry needle",
    "tapestry needles",
    "canvas bag",
    "knitting supply bag"
  ],
  "tyn_section":[

  ]
}