{
  "title":"How to Spot a Storm Chasing Roofing Contractor After a Disaster",
  "url":"https://www.wikihow.com/Spot-a-Storm-Chasing-Roofing-Contractor-After-a-Disaster",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Roofs"
  ],
  "steps":[
    {
      "headline":"Be patient and calm.",
      "description":"Most home owners after a hurricane or hailstorm are desperate to find a contractor. Being desperate leaves you open to being preyed upon by \"drifter contractors\" who claim to be local."
    },
    {
      "headline":"Look for out-of-state tags on their trucks.",
      "description":"The vehicle is likely to be registered anywhere but locally if the contractor is not local. This indicates that the contractor is only in town for storm work and won't be hanging around for upkeep or remedying any damage that is poorly fixed."
    },
    {
      "headline":"Be wary of claims of staying in town.",
      "description":"Quiz an out-of-town contractor very carefully. Extract a promise of return for further mending even if the contractor leaves the state; get this in writing. Long-term warranties, however, won't be much good if your contractor has left town."
    },
    {
      "headline":"Check to make sure that any non-locally engaged roofing contractor has been properly licensed locally.",
      "description":"Ask for current certificates of workman's compensation and liability insurance. This is for your protection. They must have both, as one covers property damage and one covers their workers from injuries if they fall from your roof. Roofing contractors usually use sub contractors to install the roofs, and a lot have crews that travel with them. In most states, the home owner or their insurance company will be liable if something happens; you don't want to risk your home."
    },
    {
      "headline":"Be aware that roofing insurance is expensive.",
      "description":"This can lead some contractors to cut corners to avoid the expense. Insist on seeing proof of current dated insurance."
    },
    {
      "headline":"Avoid signing any contingency agreements.",
      "description":"These will be very vague, lacking in description of the work to be done and will lack information about insurance proceeds."
    },
    {
      "headline":"Do your own research.",
      "description":"Check your local Yellow Pages; go back two or three years to find stability of business continuity. Check the BBB when they joined, as they often join the local BBB because when they come into town, they will be new members."
    },
    {
      "headline":"Make sure that all materials used are paid for.",
      "description":"There have been instances where storm chasing roofing contractors come in, roof a bunch of houses, and leave without paying the suppliers, thereby leaving the homeowner to pay twice! Ask to see invoices for payments."
    },
    {
      "headline":"Prefer the local roofing specialists.",
      "description":"In a storm situation, it is always best to buy from an established local roofing contractor as they will be around to service their work afterward. If your state has any state licensing requirements, you will be able to check these online."
    }
  ],
  "text":" Be patient and calm. Most home owners after a hurricane or hailstorm are desperate to find a contractor. Being desperate leaves you open to being preyed upon by \"drifter contractors\" who claim to be local. Look for out-of-state tags on their trucks. The vehicle is likely to be registered anywhere but locally if the contractor is not local. This indicates that the contractor is only in town for storm work and won't be hanging around for upkeep or remedying any damage that is poorly fixed. Be wary of claims of staying in town. Quiz an out-of-town contractor very carefully. Extract a promise of return for further mending even if the contractor leaves the state; get this in writing. Long-term warranties, however, won't be much good if your contractor has left town. Check to make sure that any non-locally engaged roofing contractor has been properly licensed locally. Ask for current certificates of workman's compensation and liability insurance. This is for your protection. They must have both, as one covers property damage and one covers their workers from injuries if they fall from your roof. Roofing contractors usually use sub contractors to install the roofs, and a lot have crews that travel with them. In most states, the home owner or their insurance company will be liable if something happens; you don't want to risk your home. Be aware that roofing insurance is expensive. This can lead some contractors to cut corners to avoid the expense. Insist on seeing proof of current dated insurance. Avoid signing any contingency agreements. These will be very vague, lacking in description of the work to be done and will lack information about insurance proceeds. Do your own research. Check your local Yellow Pages; go back two or three years to find stability of business continuity. Check the BBB when they joined, as they often join the local BBB because when they come into town, they will be new members. Make sure that all materials used are paid for. There have been instances where storm chasing roofing contractors come in, roof a bunch of houses, and leave without paying the suppliers, thereby leaving the homeowner to pay twice! Ask to see invoices for payments. Prefer the local roofing specialists. In a storm situation, it is always best to buy from an established local roofing contractor as they will be around to service their work afterward. If your state has any state licensing requirements, you will be able to check these online.",
  "tyn_model":[
    "roofing contractor",
    "roofing contractors",
    "roofing insurance",
    "yellow pages"
  ],
  "tyn_section":[

  ]
}