{
  "title":"How to Create a Character in Fallout 4",
  "url":"https://www.wikihow.com/Create-a-Character-in-Fallout-4",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Fallout"
  ],
  "steps":[
    {
      "headline":"Start Fallout 4.",
      "description":"Wait for the opening live-action sequence to end. The screen will transition to Nate observing himself in the mirror."
    },
    {
      "headline":"Choose your gender.",
      "description":"You can choose to play as Nate or Nora."
    },
    {
      "headline":"Choose hair and eye colors.",
      "description":"You can do this by pressing on the areas mentioned and scrolling through the options."
    },
    {
      "headline":"Choose the hair and body style.",
      "description":"You can scroll through available hairstyles, and adjust your body mass."
    },
    {
      "headline":"Choose the skin color.",
      "description":""
    },
    {
      "headline":"Go to Others.",
      "description":"Choose any facial marks, blemishes, or scars to add."
    },
    {
      "headline":"Begin sculpting.",
      "description":"This is the most important, and trickiest part. You can select specific parts of the face and sculpt it to your liking. Simply press on the area and drag it, slowly, to a new position."
    },
    {
      "headline":"Press \"Done\" to signal you are finished with your character.",
      "description":"Exit the bathroom and meander around the house until the Vault-Tec representative arrives."
    },
    {
      "headline":"Talk to the Vault-Tec representative.",
      "description":"He will inform you that you have been selected for entry into Vault 111."
    },
    {
      "headline":"Accept the offer and fill out the \"paperwork\".",
      "description":"Here, you can select which of your SPECIAL skills to upgrade, as well as change your name."
    },
    {
      "headline":"Begin the game.",
      "description":"You will be given one final chance to change your appearance before you exit Vault 111."
    }
  ],
  "text":" Start Fallout 4. Wait for the opening live-action sequence to end. The screen will transition to Nate observing himself in the mirror. Choose your gender. You can choose to play as Nate or Nora. Choose hair and eye colors. You can do this by pressing on the areas mentioned and scrolling through the options. Choose the hair and body style. You can scroll through available hairstyles, and adjust your body mass. Choose the skin color.  Go to Others. Choose any facial marks, blemishes, or scars to add. Begin sculpting. This is the most important, and trickiest part. You can select specific parts of the face and sculpt it to your liking. Simply press on the area and drag it, slowly, to a new position. Press \"Done\" to signal you are finished with your character. Exit the bathroom and meander around the house until the Vault-Tec representative arrives. Talk to the Vault-Tec representative. He will inform you that you have been selected for entry into Vault 111. Accept the offer and fill out the \"paperwork\". Here, you can select which of your SPECIAL skills to upgrade, as well as change your name. Begin the game. You will be given one final chance to change your appearance before you exit Vault 111.",
  "tyn_model":[
    "fallout 4",
    "vault-tec",
    "vault-tec representative"
  ],
  "tyn_section":[

  ]
}