{
  "title":"How to Make Banana Baby Food",
  "url":"https://www.wikihow.com/Make-Banana-Baby-Food",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Bananas"
  ],
  "methods":[
    {
      "name":"Making Banana Baby Food to Be Eaten Immediately",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"You'll need a ripe banana, a fork or potato masher, and a bowl."
        },
        {
          "headline":"Clean the outside of the banana in a vinegar rinse.",
          "description":"The vinegar rinse should be 1 part white vinegar to 3 parts water. Scrub the outside of the banana with it to remove bacteria and pesticides. Even though you discard the peel, you can move bacteria from the outside to the inside of the banana if you don't wash it before peeling it."
        },
        {
          "headline":"Create a clean preparation area.",
          "description":"Wipe down counters to sterilize them, and make sure your utensils and dishes are all as clean as possible."
        },
        {
          "headline":"Peel the banana.",
          "description":"Remove the peel from the banana, and discard it. Break the banana into large pieces into the bowl."
        },
        {
          "headline":"Mash the banana.",
          "description":"Use the fork or potato masher to create a soft puree out of the banana. Make sure you do not leave any large chunks for the baby to choke on. If you want the banana smoother, you can use a blender or small food processor to puree the banana. Try adding a little formula to it to help it blend."
        },
        {
          "headline":"Refrigerate half the mash.",
          "description":"Place the mash in a small container, and place plastic wrap directly on the top of the banana. Refrigerate it for later in case your baby doesn't eat all of the banana in one sitting."
        },
        {
          "headline":"Feed the banana mash to your baby.",
          "description":"Use a spoon to feed the mashed banana to your baby. Banana is a great food beginner food because it is so soft and easy to digest."
        }
      ]
    },
    {
      "name":"Mixing Banana with Other Foods for Your Baby",
      "steps":[
        {
          "headline":"Add banana to baby rice cereal.",
          "description":"Cook rice cereal, then add mashed banana to the cereal at the end. To make your own baby rice cereal, grind up brown rice in a clean coffee grinder. In a small saucepan, boil 8 ounces of water. Add 1/4 cup of the rice powder to the water, stirring briskly. Let it simmer on low heat for 10 minutes, stirring while it cooks. If it is too thick, you can add formula or breast milk to think it out. It's too thick if it's hard to spoon out of the dish."
        },
        {
          "headline":"Mix in mashed avocado.",
          "description":"Just like banana, all you need to do with avocado is to clean the utensils and the fruit. Mash the avocado with a fork or potato masher, and add in the banana. Mix to combine. A one-to-one ratio works fine, though really, it's fine to have more of one or the other."
        },
        {
          "headline":"Make a baby yogurt parfait.",
          "description":"Begin with plain yogurt. Add in mashed bananas. You can also add in pureed strawberries, if your baby is not allergic to them, and wheat germ, though check with your doctor to see if your baby should be eating gluten."
        },
        {
          "headline":"Mix it with oatmeal.",
          "description":"Make oatmeal from oat powder, and mix in the mashed banana. To make oatmeal for your baby, start out by grinding oatmeal in a clean spice grinder. Bring a cup of water to boil on the stove, and add 1/4 cup of the oat powder. Let it simmer on low for 10 minutes, while stirring to keep it from sticking. To thin it out, add breast milk or formula."
        },
        {
          "headline":"Puree banana with raw spinach.",
          "description":"Make sure your spinach is fresh and cleaned. You can use the pre-washed spinach, though you can wash it again if your prefer. Puree a small handful of spinach with 2 bananas in a blender. Serve as you would regular banana baby food."
        },
        {
          "headline":"Combine it with mashed sweet potato.",
          "description":"Try a one-to-one ration. Boil or steam a sweet potato until it is soft. Take off the peel. Mash it with fork or puree it in a blender. Add in the mashed banana once it cools."
        }
      ]
    },
    {
      "name":"Freezing Banana Baby Food",
      "steps":[
        {
          "headline":"Divide the banana baby food into the ice cube trays.",
          "description":"Spoon the banana mash into the ice cube trays. Fill each one up, but try not to let the cubes connect."
        },
        {
          "headline":"Cover the tray.",
          "description":"Use the plastic wrap or foil to cover the tray. If using plastic wrap, push the wrap down on top of each individual cube to keep the air out."
        },
        {
          "headline":"Freeze the tray.",
          "description":"Once the cubes freeze, you can move them to a zip-top freezer bag. Label the bag with the date and type of food, as you should only keep them in the freezer for 3 to 6 months."
        },
        {
          "headline":"Thaw in the refrigerator.",
          "description":"When thawing, place a couple of cubes in the refrigerator overnight. One ice cube is about an ounce, and by 6 to 8 months, your baby could be eating 2 to 4 ounces of food per day. Thaw it enough to melt all the iciness in the food, letting it reach refrigerator-temperature."
        }
      ]
    }
  ],
  "text":" Making Banana Baby Food to Be Eaten Immediately Gather your materials. You'll need a ripe banana, a fork or potato masher, and a bowl. Clean the outside of the banana in a vinegar rinse. The vinegar rinse should be 1 part white vinegar to 3 parts water. Scrub the outside of the banana with it to remove bacteria and pesticides. Even though you discard the peel, you can move bacteria from the outside to the inside of the banana if you don't wash it before peeling it. Create a clean preparation area. Wipe down counters to sterilize them, and make sure your utensils and dishes are all as clean as possible. Peel the banana. Remove the peel from the banana, and discard it. Break the banana into large pieces into the bowl. Mash the banana. Use the fork or potato masher to create a soft puree out of the banana. Make sure you do not leave any large chunks for the baby to choke on. If you want the banana smoother, you can use a blender or small food processor to puree the banana. Try adding a little formula to it to help it blend. Refrigerate half the mash. Place the mash in a small container, and place plastic wrap directly on the top of the banana. Refrigerate it for later in case your baby doesn't eat all of the banana in one sitting. Feed the banana mash to your baby. Use a spoon to feed the mashed banana to your baby. Banana is a great food beginner food because it is so soft and easy to digest. Mixing Banana with Other Foods for Your Baby Add banana to baby rice cereal. Cook rice cereal, then add mashed banana to the cereal at the end. To make your own baby rice cereal, grind up brown rice in a clean coffee grinder. In a small saucepan, boil 8 ounces of water. Add 1/4 cup of the rice powder to the water, stirring briskly. Let it simmer on low heat for 10 minutes, stirring while it cooks. If it is too thick, you can add formula or breast milk to think it out. It's too thick if it's hard to spoon out of the dish. Mix in mashed avocado. Just like banana, all you need to do with avocado is to clean the utensils and the fruit. Mash the avocado with a fork or potato masher, and add in the banana. Mix to combine. A one-to-one ratio works fine, though really, it's fine to have more of one or the other. Make a baby yogurt parfait. Begin with plain yogurt. Add in mashed bananas. You can also add in pureed strawberries, if your baby is not allergic to them, and wheat germ, though check with your doctor to see if your baby should be eating gluten. Mix it with oatmeal. Make oatmeal from oat powder, and mix in the mashed banana. To make oatmeal for your baby, start out by grinding oatmeal in a clean spice grinder. Bring a cup of water to boil on the stove, and add 1/4 cup of the oat powder. Let it simmer on low for 10 minutes, while stirring to keep it from sticking. To thin it out, add breast milk or formula. Puree banana with raw spinach. Make sure your spinach is fresh and cleaned. You can use the pre-washed spinach, though you can wash it again if your prefer. Puree a small handful of spinach with 2 bananas in a blender. Serve as you would regular banana baby food. Combine it with mashed sweet potato. Try a one-to-one ration. Boil or steam a sweet potato until it is soft. Take off the peel. Mash it with fork or puree it in a blender. Add in the mashed banana once it cools. Freezing Banana Baby Food Divide the banana baby food into the ice cube trays. Spoon the banana mash into the ice cube trays. Fill each one up, but try not to let the cubes connect. Cover the tray. Use the plastic wrap or foil to cover the tray. If using plastic wrap, push the wrap down on top of each individual cube to keep the air out. Freeze the tray. Once the cubes freeze, you can move them to a zip-top freezer bag. Label the bag with the date and type of food, as you should only keep them in the freezer for 3 to 6 months. Thaw in the refrigerator. When thawing, place a couple of cubes in the refrigerator overnight. One ice cube is about an ounce, and by 6 to 8 months, your baby could be eating 2 to 4 ounces of food per day. Thaw it enough to melt all the iciness in the food, letting it reach refrigerator-temperature.",
  "tyn_model":[
    "banana",
    "fork",
    "water",
    "oatmeal",
    "spinach",
    "potato masher",
    "blender",
    "plastic wrap",
    "rice cereal",
    "avocado",
    "bowl",
    "vinegar",
    "breast milk",
    "bananas",
    "oat powder",
    "sweet potato",
    "ice cube trays",
    "tray",
    "refrigerator",
    "white vinegar",
    "pesticides",
    "food processor",
    "banana mash",
    "spoon",
    "brown rice",
    "coffee grinder",
    "small saucepan",
    "rice powder",
    "plain yogurt",
    "strawberries",
    "wheat germ",
    "spice grinder",
    "banana baby food",
    "foil",
    "zip-top freezer bag",
    "freezer",
    "ice cube",
    "food"
  ],
  "tyn_section":[

  ]
}