{
  "title":"How to Play Flashlight",
  "url":"https://www.wikihow.com/Play-Flashlight",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Hiding Games",
    "Hide and Seek"
  ],
  "steps":[
    {
      "headline":"Find a big with area, and something to call \"home\" (a tree, a dustbin, a door to a building) and plenty of hiding places.",
      "description":""
    },
    {
      "headline":"Have everyone dress in dark non-reflective clothing.",
      "description":"(make sure there are no roads near your game area! )."
    },
    {
      "headline":"Get a torch (flashlight) that doesn't have a beam that is too wide or too narrow.",
      "description":""
    },
    {
      "headline":"Define the boundaries - anyone hiding in forbidden territory immediately becomes \"it\" next round.",
      "description":""
    },
    {
      "headline":"Choose a place to be \"home\", and choose someone to be \"it\" in whatever way you deem fairest.",
      "description":""
    },
    {
      "headline":"Have the person that is \"it\" count to 100.",
      "description":""
    },
    {
      "headline":"Just like hide and seek the idea is to not be found, but also the hiders must get to the \"home\" without being spotted first.",
      "description":""
    },
    {
      "headline":"The rules are as follows:",
      "description":"The seeker can only use the torch (flashlight) when they think they see someone in the dark; The torch (flashlight) can only be on for 3 seconds at most; When the seeker spots someone they must run to the \"home\" and shout 'forty-forty' then the person's name and location while shining the torch (flashlight) on them (see below); When a hider makes it to the \"home\" they must shout 'flashlight' - until they do this they can still be caught; The first person caught is \"it\" for the next turn; Hiders are not allowed to trip, catch or hold back the Seeker; The Seeker must stay outside a two meter exclusion zone around the \"home\" unless they are counting or they spot someone; If somewhere is out of bounds it cannot be used for hiding in, or traveling through, until the game is over."
    },
    {
      "headline":"Other than these rules all else is fair game.",
      "description":"Anyone found breaking the rules is \"it\" next time regardless of who was caught first."
    },
    {
      "headline":"If everyone makes it \"home\" without getting spotted the seeker is \"it\" again.",
      "description":""
    },
    {
      "headline":"Once everyone is \"home\" or caught the next person \"it\" starts counting and the game begins again",
      "description":""
    },
    {
      "headline":"A Note on Rule 3 - If a hider suspects they have been spotted it is perfectly fair to move from their hiding place to a new one before the seeker has called their name.",
      "description":"The flashlight must be on them when their name is called for them to be caught (this is where calling out the location comes in useful)."
    }
  ],
  "text":" Find a big with area, and something to call \"home\" (a tree, a dustbin, a door to a building) and plenty of hiding places.  Have everyone dress in dark non-reflective clothing. (make sure there are no roads near your game area! ). Get a torch (flashlight) that doesn't have a beam that is too wide or too narrow.  Define the boundaries - anyone hiding in forbidden territory immediately becomes \"it\" next round.  Choose a place to be \"home\", and choose someone to be \"it\" in whatever way you deem fairest.  Have the person that is \"it\" count to 100.  Just like hide and seek the idea is to not be found, but also the hiders must get to the \"home\" without being spotted first.  The rules are as follows: The seeker can only use the torch (flashlight) when they think they see someone in the dark; The torch (flashlight) can only be on for 3 seconds at most; When the seeker spots someone they must run to the \"home\" and shout 'forty-forty' then the person's name and location while shining the torch (flashlight) on them (see below); When a hider makes it to the \"home\" they must shout 'flashlight' - until they do this they can still be caught; The first person caught is \"it\" for the next turn; Hiders are not allowed to trip, catch or hold back the Seeker; The Seeker must stay outside a two meter exclusion zone around the \"home\" unless they are counting or they spot someone; If somewhere is out of bounds it cannot be used for hiding in, or traveling through, until the game is over. Other than these rules all else is fair game. Anyone found breaking the rules is \"it\" next time regardless of who was caught first. If everyone makes it \"home\" without getting spotted the seeker is \"it\" again.  Once everyone is \"home\" or caught the next person \"it\" starts counting and the game begins again  A Note on Rule 3 - If a hider suspects they have been spotted it is perfectly fair to move from their hiding place to a new one before the seeker has called their name. The flashlight must be on them when their name is called for them to be caught (this is where calling out the location comes in useful).",
  "tyn_model":[
    "torch",
    "hiders",
    "hider",
    "seeker",
    "flashlight"
  ],
  "tyn_section":[

  ]
}