{
  "title":"How to Drink Green Tea for Improved Health",
  "url":"https://www.wikihow.com/Drink-Green-Tea-for-Improved-Health",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food"
  ],
  "parts":[
    {
      "name":"Making Green Tea",
      "steps":[
        {
          "headline":"Choose a high quality tea.",
          "description":"Try to find an organic tea from a reputable tea company. Many sellers will list the antioxidant qualities of their teas, helping you make an informed decision. Don't forget that you can easily purchase green tea online. Avoid any tea that is produced using pesticides since these will end up in your tea cup."
        },
        {
          "headline":"Prepare the water.",
          "description":"Use clean filtered water and bring almost to a boil."
        },
        {
          "headline":"Add the tea to the pot.",
          "description":"Place 1 heaping teaspoon of green tea in a tea ball strainer or place 1 green tea bag in your cup. Gently pour the water over the tea ball, loose tea, or tea bag."
        },
        {
          "headline":"Steep the tea.",
          "description":"Allow the tea to steep for 1 to 3 minutes, depending on how strong you prefer the tea. The stronger the tea, the greater the levels of epigallocatechin gallate (EGCG), other antioxidants and other beneficial constituents. If you use loose tea, strain the leaves before drinking. Add honey or lemon if you'd like to adjust the flavor."
        },
        {
          "headline":"Watch for any side effects.",
          "description":"While people have been drinking green tea for thousands of years with very few negative effects ever noted, some people may be sensitive to the components in green tea. If you're sensitive, you may have difficulty sleeping, anxiety, irritability and stomach upset. Green tea can interact with some prescription medications like beta blockers (propranolol, metpranol), benzodiazepines (to treat anxiety), lithium (to treat bipolar disorder), clozapine (an anti-psychotic medication) and oral contraceptives. If you have been prescribed any of these medications, talk to your doctor about how much green tea you can safely drink."
        }
      ]
    },
    {
      "name":"Drinking Green Tea For Health Benefits",
      "steps":[
        {
          "headline":"Reduce your risk of cancer.",
          "description":"Because there's difficulty in controlling research subjects, studies regarding cancer prevention are conflicted. The Federal Drug Administration does not currently support any claims that green tea can prevent cancer. The results of studies are often hard to interpret and more definite research is needed. At this point, green tea is associated with a decreased risk of certain cancers, including cancer of the:\nPancreas\nBladder\nBreast\nColon\nProstate\nSkin\nStomach\nLung\nEsophagus"
        },
        {
          "headline":"Improve your heart health and cholesterol.",
          "description":"Drink at least 5 to 6 cups of green tea a day to decrease your risk of heart disease. Studies have shown that green tea can lower your blood pressure which improves cholesterol and triglycerides. Green tea may increase your HDL (\"good\") cholesterol while lowering the LDL (\"bad\") cholesterol. Green tea drinking also appears to reduce death from all causes."
        },
        {
          "headline":"Drink green tea to improve your cognitive functions.",
          "description":"Drink 4 to 6 cups of green tea a day to get the greatest protective benefits for cognitive function. Specifically, green tea may prevent neurodegenerative disorders like Alzheimer’s disease (AD), Parkinson’s disease (PD), and Huntington’s disease (HD). This preventative effect seems to come from the theanine levels in green tea. Theanine is an amino acid that acts directly on brain neurotransmitters (chemical messengers in the brain) to protect nerves."
        },
        {
          "headline":"Drink green tea to control your blood sugar.",
          "description":"To get the most benefits, drink between 2 and 6 cups of green tea a day. Green tea contains a substance, epigallocatechin-3-gallate (EGCG), that can control your blood sugar levels. EGCG has been shown to improve insulin sensitivity. Green tea is a good beverage to drink because it contains no added sugar and has no calories. One study showed that people who drank green tea had significant decreases in body weight, percentages of body fat, and waist circumferences."
        },
        {
          "headline":"Use green tea for oral health.",
          "description":"Green tea contains antiviral properties and antioxidants. These can reduce gum diseases like gingivitis. The antibacterial properties of green tea can also destroy mouth bacteria which causes tooth decay and gum disease. You can also use green tea as a mouthwash. Studies have shown it can reduce bleeding in the mouth and can manage gingivitis."
        },
        {
          "headline":"Treat skin disorders and allergies with green tea.",
          "description":"Drink 4 to 5 cups of green tea a day to treat allergies. Green tea contains quercetin, a natural antihistamine. Studies have also shown that green tea can treat a variety of skin disorders. These include:\nWarts\nPsoriasis\nEczema\nInflammatory skin conditions"
        }
      ]
    }
  ],
  "text":" Making Green Tea Choose a high quality tea. Try to find an organic tea from a reputable tea company. Many sellers will list the antioxidant qualities of their teas, helping you make an informed decision. Don't forget that you can easily purchase green tea online. Avoid any tea that is produced using pesticides since these will end up in your tea cup. Prepare the water. Use clean filtered water and bring almost to a boil. Add the tea to the pot. Place 1 heaping teaspoon of green tea in a tea ball strainer or place 1 green tea bag in your cup. Gently pour the water over the tea ball, loose tea, or tea bag. Steep the tea. Allow the tea to steep for 1 to 3 minutes, depending on how strong you prefer the tea. The stronger the tea, the greater the levels of epigallocatechin gallate (EGCG), other antioxidants and other beneficial constituents. If you use loose tea, strain the leaves before drinking. Add honey or lemon if you'd like to adjust the flavor. Watch for any side effects. While people have been drinking green tea for thousands of years with very few negative effects ever noted, some people may be sensitive to the components in green tea. If you're sensitive, you may have difficulty sleeping, anxiety, irritability and stomach upset. Green tea can interact with some prescription medications like beta blockers (propranolol, metpranol), benzodiazepines (to treat anxiety), lithium (to treat bipolar disorder), clozapine (an anti-psychotic medication) and oral contraceptives. If you have been prescribed any of these medications, talk to your doctor about how much green tea you can safely drink. Drinking Green Tea For Health Benefits Reduce your risk of cancer. Because there's difficulty in controlling research subjects, studies regarding cancer prevention are conflicted. The Federal Drug Administration does not currently support any claims that green tea can prevent cancer. The results of studies are often hard to interpret and more definite research is needed. At this point, green tea is associated with a decreased risk of certain cancers, including cancer of the:\nPancreas\nBladder\nBreast\nColon\nProstate\nSkin\nStomach\nLung\nEsophagus Improve your heart health and cholesterol. Drink at least 5 to 6 cups of green tea a day to decrease your risk of heart disease. Studies have shown that green tea can lower your blood pressure which improves cholesterol and triglycerides. Green tea may increase your HDL (\"good\") cholesterol while lowering the LDL (\"bad\") cholesterol. Green tea drinking also appears to reduce death from all causes. Drink green tea to improve your cognitive functions. Drink 4 to 6 cups of green tea a day to get the greatest protective benefits for cognitive function. Specifically, green tea may prevent neurodegenerative disorders like Alzheimer’s disease (AD), Parkinson’s disease (PD), and Huntington’s disease (HD). This preventative effect seems to come from the theanine levels in green tea. Theanine is an amino acid that acts directly on brain neurotransmitters (chemical messengers in the brain) to protect nerves. Drink green tea to control your blood sugar. To get the most benefits, drink between 2 and 6 cups of green tea a day. Green tea contains a substance, epigallocatechin-3-gallate (EGCG), that can control your blood sugar levels. EGCG has been shown to improve insulin sensitivity. Green tea is a good beverage to drink because it contains no added sugar and has no calories. One study showed that people who drank green tea had significant decreases in body weight, percentages of body fat, and waist circumferences. Use green tea for oral health. Green tea contains antiviral properties and antioxidants. These can reduce gum diseases like gingivitis. The antibacterial properties of green tea can also destroy mouth bacteria which causes tooth decay and gum disease. You can also use green tea as a mouthwash. Studies have shown it can reduce bleeding in the mouth and can manage gingivitis. Treat skin disorders and allergies with green tea. Drink 4 to 5 cups of green tea a day to treat allergies. Green tea contains quercetin, a natural antihistamine. Studies have also shown that green tea can treat a variety of skin disorders. These include:\nWarts\nPsoriasis\nEczema\nInflammatory skin conditions",
  "tyn_model":[
    "green tea",
    "water",
    "theanine",
    "tea",
    "pot",
    "tea ball strainer",
    "green tea bag",
    "tea ball",
    "epigallocatechin gallate",
    "honey",
    "lemon",
    "beta blockers",
    "propranolol",
    "metpranol",
    "lithium",
    "oral contraceptives",
    "antioxidants",
    "quercetin"
  ],
  "tyn_section":[

  ]
}