{
  "title":"How to Cut Health Costs",
  "url":"https://www.wikihow.com/Cut-Health-Costs",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Using Insurance Incentives",
      "steps":[
        {
          "headline":"Use preventative care.",
          "description":"With the induction of the Affordable Care Act, health care plans must offer some types of preventative care free of charge. This includes cancer screenings, wellness checkups for women and children, and immunizations. These preventative methods can help you cut down on larger, and more expensive health problems later down the road. If you aren't sure which preventative care your insurance provides, visit your provider's website."
        },
        {
          "headline":"Take part in wellness programs.",
          "description":"Many employers are trying to control health care costs by offering wellness programs to their employees. These programs often lead to a lower insurance premium or other monetary incentives. The kinds of programs include:\nHealth screenings of levels such as cholesterol and blood pressure. Completing a health risk assessment, such as a questionnaire. Taking part in physical activity programs or initiatives to quit smoking. Diabetes or weight management plans."
        },
        {
          "headline":"Look into extra discounts.",
          "description":"Some insurance providers offer extra discounts if you use certain doctors, providers, or hospitals. Look into your insurance documents or ask an insurance representative if there are places near you."
        },
        {
          "headline":"Look into other insurance plans.",
          "description":"If you think you might be paying too much for health insurance, look into different insurance plans. This may be a different plan from the same provider that might suit you better or another plan from a different provider. Look into the details of your plan as well. You may find a better plan that will save you money in the long run, such as ones with a smaller deductible or a smaller copay."
        }
      ]
    },
    {
      "name":"Taking Charge of Your Medical Care",
      "steps":[
        {
          "headline":"Cut out unnecessary procedures.",
          "description":"When you end up in the hospital or at the doctor's office, ask your doctor if every test he is running or performing on you is necessary. Let him know that you only want procedures or medicine that is required to treat your ailment. Often, doctors run tests and offer other treatments that aren't required. This will help you pay less in the long run, because your doctor and hospital bills will be lower."
        },
        {
          "headline":"See a doctor within your network.",
          "description":"Most health care providers have doctors who are considered \"in network,\" which means that they will cost less. If you see a doctor out of your network, your coverage will cover much less of the expenses, which means your out of pocket costs will be higher. Check your insurance provider's website or any supplementary material they send to you to ensure your doctors are in network. If you are unsure, call your insurance company to ask."
        },
        {
          "headline":"Make lump sum payments.",
          "description":"If you have a large medical bill, you may be able to negotiate a lower lump sum payment option. This will cost you more out of pocket at one time, but your overall cost can be much lower."
        }
      ]
    },
    {
      "name":"Saving Money on Medications",
      "steps":[
        {
          "headline":"Switch to generic medications.",
          "description":"Most prescriptions have a generic option. These cost much less than name brand medicines, but are essentially the same medication. Ask your doctor or pharmacist if any of your prescriptions can be switched to generic version. Insurance plans often cover more on these as well."
        },
        {
          "headline":"Get your prescriptions through the mail.",
          "description":"There are mail-order pharmacies that you can send your prescriptions to in order to cut costs. These pharmacies take medicines for which you have a long-standing prescriptions and send you a three month supply for the price of one. If you are taking expensive medications for chronic conditions, this can save you a lot of money since you will only pay for four months worth of medication per twelve months."
        },
        {
          "headline":"Get a discount prescription card.",
          "description":"There are certain organizations, such as AARP and AAA, that can offer discounts on prescriptions. There are even certain people who might qualify for free prescription cards through Medicare or other plans. When using a discount card, make sure you find the cheapest price you can on the prescriptions before you use the discount card. Some pharmacies offer lower prices on medications than others. This way, your out of pocket cost is as low as possible."
        },
        {
          "headline":"Use over-the-counter medications when possible.",
          "description":"If there are conditions or illnesses that you suffer from that you can use over-the-counter medication for, use those medications instead. Conditions such as chronic allergies or head colds can easily be helped with over the counter medicine instead of expensive prescriptions. If your condition doesn't get any better, see your doctor to make sure nothing serious is wrong."
        }
      ]
    },
    {
      "name":"Taking Care of Yourself",
      "steps":[
        {
          "headline":"Keep yourself healthy.",
          "description":"In order to cut down on your visits to the doctor, keep yourself healthy. Eat healthy, exercise, and keep up with your hygiene. This will limit the out of pocket costs you pay because you will go to the doctor less. Although this won't keep you from getting sick all the time, it will help keep your body in the best shape to fight illness."
        },
        {
          "headline":"Avoid emergency rooms if possible.",
          "description":"If you have an ailment that can be taken care of with a doctor's visit, make an appointment instead of heading to the emergency room. Emergency room visits can cost upwards of $1,000, which you may have to may out of pocket if your deductible hasn't been met. Common illnesses, such as colds, or other non-emergency problems can be taken care of at home or with over the counter treatments. You can also visit a clinic or other after hours facility, which are usually cheaper than an emergency room. Try the Minute Clinic at CVS or urgent care facilities."
        },
        {
          "headline":"Be aware of your own health.",
          "description":"If you are unaware of your personal health, you may be more likely to get reactionary health care. This can make your health costs pile up over time. Perform regular exams of your breasts, skin, testicles, mouth, and other common areas for cancer or other health issues. Checking yourself over can also help you find major health issues sooner, which can help cut down on long term health costs."
        }
      ]
    }
  ],
  "text":" Using Insurance Incentives Use preventative care. With the induction of the Affordable Care Act, health care plans must offer some types of preventative care free of charge. This includes cancer screenings, wellness checkups for women and children, and immunizations. These preventative methods can help you cut down on larger, and more expensive health problems later down the road. If you aren't sure which preventative care your insurance provides, visit your provider's website. Take part in wellness programs. Many employers are trying to control health care costs by offering wellness programs to their employees. These programs often lead to a lower insurance premium or other monetary incentives. The kinds of programs include:\nHealth screenings of levels such as cholesterol and blood pressure. Completing a health risk assessment, such as a questionnaire. Taking part in physical activity programs or initiatives to quit smoking. Diabetes or weight management plans. Look into extra discounts. Some insurance providers offer extra discounts if you use certain doctors, providers, or hospitals. Look into your insurance documents or ask an insurance representative if there are places near you. Look into other insurance plans. If you think you might be paying too much for health insurance, look into different insurance plans. This may be a different plan from the same provider that might suit you better or another plan from a different provider. Look into the details of your plan as well. You may find a better plan that will save you money in the long run, such as ones with a smaller deductible or a smaller copay. Taking Charge of Your Medical Care Cut out unnecessary procedures. When you end up in the hospital or at the doctor's office, ask your doctor if every test he is running or performing on you is necessary. Let him know that you only want procedures or medicine that is required to treat your ailment. Often, doctors run tests and offer other treatments that aren't required. This will help you pay less in the long run, because your doctor and hospital bills will be lower. See a doctor within your network. Most health care providers have doctors who are considered \"in network,\" which means that they will cost less. If you see a doctor out of your network, your coverage will cover much less of the expenses, which means your out of pocket costs will be higher. Check your insurance provider's website or any supplementary material they send to you to ensure your doctors are in network. If you are unsure, call your insurance company to ask. Make lump sum payments. If you have a large medical bill, you may be able to negotiate a lower lump sum payment option. This will cost you more out of pocket at one time, but your overall cost can be much lower. Saving Money on Medications Switch to generic medications. Most prescriptions have a generic option. These cost much less than name brand medicines, but are essentially the same medication. Ask your doctor or pharmacist if any of your prescriptions can be switched to generic version. Insurance plans often cover more on these as well. Get your prescriptions through the mail. There are mail-order pharmacies that you can send your prescriptions to in order to cut costs. These pharmacies take medicines for which you have a long-standing prescriptions and send you a three month supply for the price of one. If you are taking expensive medications for chronic conditions, this can save you a lot of money since you will only pay for four months worth of medication per twelve months. Get a discount prescription card. There are certain organizations, such as AARP and AAA, that can offer discounts on prescriptions. There are even certain people who might qualify for free prescription cards through Medicare or other plans. When using a discount card, make sure you find the cheapest price you can on the prescriptions before you use the discount card. Some pharmacies offer lower prices on medications than others. This way, your out of pocket cost is as low as possible. Use over-the-counter medications when possible. If there are conditions or illnesses that you suffer from that you can use over-the-counter medication for, use those medications instead. Conditions such as chronic allergies or head colds can easily be helped with over the counter medicine instead of expensive prescriptions. If your condition doesn't get any better, see your doctor to make sure nothing serious is wrong. Taking Care of Yourself Keep yourself healthy. In order to cut down on your visits to the doctor, keep yourself healthy. Eat healthy, exercise, and keep up with your hygiene. This will limit the out of pocket costs you pay because you will go to the doctor less. Although this won't keep you from getting sick all the time, it will help keep your body in the best shape to fight illness. Avoid emergency rooms if possible. If you have an ailment that can be taken care of with a doctor's visit, make an appointment instead of heading to the emergency room. Emergency room visits can cost upwards of $1,000, which you may have to may out of pocket if your deductible hasn't been met. Common illnesses, such as colds, or other non-emergency problems can be taken care of at home or with over the counter treatments. You can also visit a clinic or other after hours facility, which are usually cheaper than an emergency room. Try the Minute Clinic at CVS or urgent care facilities. Be aware of your own health. If you are unaware of your personal health, you may be more likely to get reactionary health care. This can make your health costs pile up over time. Perform regular exams of your breasts, skin, testicles, mouth, and other common areas for cancer or other health issues. Checking yourself over can also help you find major health issues sooner, which can help cut down on long term health costs.",
  "tyn_model":[
    "medications",
    "medicines",
    "health care plans",
    "medicine",
    "health care providers",
    "medication",
    "over the counter medicine",
    "urgent care facilities"
  ],
  "tyn_section":[

  ]
}