{
  "title":"How to Beat the Third Bowser in Super Mario 64",
  "url":"https://www.wikihow.com/Beat-the-Third-Bowser-in-Super-Mario-64",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo 64"
  ],
  "methods":[
    {
      "name":"With 70 stars",
      "steps":[
        {
          "headline":"Collect 70 Stars from the various levels in the castle.",
          "description":""
        },
        {
          "headline":"Know where the final battle with bowser is located.",
          "description":"It is on the third floor of the castle, in the same type of door that the first two bowser battles were in, and on the same floor as Tick Tock Clock, Rainbow ride, and the secret level Wing Mario Over the Rainbow."
        },
        {
          "headline":"Know that the same method is used in fighting Bowser as the first two times.",
          "description":"You have to get behind him, grab his tail, spin him around using the control stick on your controller, and throw him into a bomb located on the side of the arena."
        },
        {
          "headline":"Know most commonly used method to grab Bowser's tail is running around Bowser in circles.",
          "description":"He'll most likely spin around to keep track of you so that he can attack in your direction, but don't be alarmed."
        },
        {
          "headline":"Recognize his most commonly used attack.",
          "description":"His most commonly used attack is his fire breath. When he does this attack, he faces one direction and keeps facing that direction as he breathes the fire. This is the perfect opportunity for you to maneuver around him and grab his tail with B."
        },
        {
          "headline":"Spin Bowser around using the control stick.",
          "description":"Remember that the more speed you gain, the farther he'll fly. However, it'll  be harder to aim if you move too fast. This is perfected with practice."
        },
        {
          "headline":"Avoid worrying if you miss the bomb.",
          "description":"If he falls off, he'll come back up, and break a piece off of the side of the arena. Watch for the shockwaves that will also be on the ground, and try avoiding them by jumping over them. This is easier if you are farther away from where Bowser lands."
        },
        {
          "headline":"Let go of his tail using the B button, and throw him into a bomb on the edge of the stage.",
          "description":""
        },
        {
          "headline":"Repeat this process once again when he comes back up.",
          "description":""
        },
        {
          "headline":"Know that after the second time you succeed in throwing him into a bomb, parts of the stage will collapse and form a star shape.",
          "description":"Don't worry, it's still possible to defeat him at this point."
        },
        {
          "headline":"Repeat this process a third time.",
          "description":""
        },
        {
          "headline":"Collect the giant star that Bowser turns into.",
          "description":"Mario will then be wearing a wing cap. Now, enjoy the ending sequence and celebrate beating the final boss of Super Mario 64!"
        }
      ]
    },
    {
      "name":"Without 70 Stars",
      "steps":[
        {
          "headline":"Go to the star door.",
          "description":"This time, you will have to scroll a message from Bowser. While you technically don't have enough stars to access the final Bowser, the door will still open for you, however the stairs are supposedly endless."
        },
        {
          "headline":"Glitch up the stairs.",
          "description":"You can do this by performing the backwards long jump move."
        },
        {
          "headline":"Tap the A button rapidly while you are doing the move.",
          "description":"If you have successfully done the glitch, you should now be at the top of the stairs, and notice the painting of Bowser, as well as a hole you can jump in to access the final level."
        }
      ]
    }
  ],
  "text":" With 70 stars Collect 70 Stars from the various levels in the castle.  Know where the final battle with bowser is located. It is on the third floor of the castle, in the same type of door that the first two bowser battles were in, and on the same floor as Tick Tock Clock, Rainbow ride, and the secret level Wing Mario Over the Rainbow. Know that the same method is used in fighting Bowser as the first two times. You have to get behind him, grab his tail, spin him around using the control stick on your controller, and throw him into a bomb located on the side of the arena. Know most commonly used method to grab Bowser's tail is running around Bowser in circles. He'll most likely spin around to keep track of you so that he can attack in your direction, but don't be alarmed. Recognize his most commonly used attack. His most commonly used attack is his fire breath. When he does this attack, he faces one direction and keeps facing that direction as he breathes the fire. This is the perfect opportunity for you to maneuver around him and grab his tail with B. Spin Bowser around using the control stick. Remember that the more speed you gain, the farther he'll fly. However, it'll  be harder to aim if you move too fast. This is perfected with practice. Avoid worrying if you miss the bomb. If he falls off, he'll come back up, and break a piece off of the side of the arena. Watch for the shockwaves that will also be on the ground, and try avoiding them by jumping over them. This is easier if you are farther away from where Bowser lands. Let go of his tail using the B button, and throw him into a bomb on the edge of the stage.  Repeat this process once again when he comes back up.  Know that after the second time you succeed in throwing him into a bomb, parts of the stage will collapse and form a star shape. Don't worry, it's still possible to defeat him at this point. Repeat this process a third time.  Collect the giant star that Bowser turns into. Mario will then be wearing a wing cap. Now, enjoy the ending sequence and celebrate beating the final boss of Super Mario 64! Without 70 Stars Go to the star door. This time, you will have to scroll a message from Bowser. While you technically don't have enough stars to access the final Bowser, the door will still open for you, however the stairs are supposedly endless. Glitch up the stairs. You can do this by performing the backwards long jump move. Tap the A button rapidly while you are doing the move. If you have successfully done the glitch, you should now be at the top of the stairs, and notice the painting of Bowser, as well as a hole you can jump in to access the final level.",
  "tyn_model":[
    "bowser",
    "arena",
    "super mario 64"
  ],
  "tyn_section":[

  ]
}