{
  "title":"How to Use Kill Ping",
  "url":"https://www.wikihow.com/Use-Kill-Ping",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "parts":[
    {
      "name":"Downloading and Installing the Application",
      "steps":[
        {
          "headline":"Head on to the application's website.",
          "description":"Type the address on your browser address bar: http://www.killping.com and press enter to visit applications official website."
        },
        {
          "headline":"Installation file will be downloaded automatically after subscription.",
          "description":"Click on the downloaded file to start installation."
        },
        {
          "headline":"Install the application.",
          "description":"You may start the installation by clicking on the downloaded installer. Just continue to install the application. Once installed, you are ready to launch the application."
        }
      ]
    },
    {
      "name":"Using Kill Ping",
      "steps":[
        {
          "headline":"Run the application.",
          "description":"Right-click on the application and click on 'Run as administrator'. This will take you to the login screen."
        },
        {
          "headline":"Login with your account credentials.",
          "description":"Either click on “I Have An Account” and proceed with your existing credentials or click on “I Don't Have An Account” to Sign Up for the application if you don't have an account. To sign up, fill out your name in “What's Your Name, Warrior?” and type in your email address in the next field. Remember to check your email for verification code when asked for “Enter Your Warrior Code” on the application."
        },
        {
          "headline":"Select the game of your choice.",
          "description":"Choose your favorite game or add a game of your choice through “Add a Custom Game” option on the drop down list."
        },
        {
          "headline":"Select the game server location.",
          "description":"After selection of your game, select the server region you will be playing in."
        },
        {
          "headline":"Select the server you want to pass through.",
          "description":"It is recommended to select the server closest to the client or the game location to achieve best results. Click NEXT and the game will launch."
        }
      ]
    }
  ],
  "text":" Downloading and Installing the Application Head on to the application's website. Type the address on your browser address bar: http://www.killping.com and press enter to visit applications official website. Installation file will be downloaded automatically after subscription. Click on the downloaded file to start installation. Install the application. You may start the installation by clicking on the downloaded installer. Just continue to install the application. Once installed, you are ready to launch the application. Using Kill Ping Run the application. Right-click on the application and click on 'Run as administrator'. This will take you to the login screen. Login with your account credentials. Either click on “I Have An Account” and proceed with your existing credentials or click on “I Don't Have An Account” to Sign Up for the application if you don't have an account. To sign up, fill out your name in “What's Your Name, Warrior?” and type in your email address in the next field. Remember to check your email for verification code when asked for “Enter Your Warrior Code” on the application. Select the game of your choice. Choose your favorite game or add a game of your choice through “Add a Custom Game” option on the drop down list. Select the game server location. After selection of your game, select the server region you will be playing in. Select the server you want to pass through. It is recommended to select the server closest to the client or the game location to achieve best results. Click NEXT and the game will launch.",
  "tyn_model":[
    "“i",
    "” and",
    "kill ping",
    "” to",
    "“what",
    "“enter",
    "” on",
    "“add",
    "” option"
  ],
  "tyn_section":[

  ]
}