{
  "title":"How to Make Healthy Hot Chocolate",
  "url":"https://www.wikihow.com/Make-Healthy-Hot-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Chocolate and Cocoa Drinks"
  ],
  "methods":[
    {
      "name":"Making Healthy Hot Chocolate From Scratch",
      "steps":[
        {
          "headline":"Set up the appropriate cooking equipment.",
          "description":"If you're planning on making homemade versions of hot chocolate, make sure you have the right cooking utensils. Many recipes will tell you to make your hot chocolate in a small pot or sauce pan on the stove. This allows all the ingredients to get heated evenly and the chocolate to melt. You'll also need a heat-proof or microwave-safe mug. Some materials, like glass, may not be microwave- or heat-safe. They could break or crack when hot liquid is added or when heated in the microwave. Look at the bottom of your mug to see if there is any notation of whether or not it's heat- or microwave-safe. Although a plain wooden spoon will do, a whisk is a great tool to help incorporate all the ingredients in your hot chocolate."
        },
        {
          "headline":"Choose your mixing liquid.",
          "description":"The main ingredient in hot chocolate is the liquid. If you're looking to make a healthier or lower-calorie version of hot chocolate, heat up 6 – 8 oz of these lower-calorie liquids:\nWater. This is plain-jane, but is zero calories. This will help you get a very low-calorie hot chocolate. Skim milk. This offers you a little more creaminess, protein and calcium. For a 6 – 8 oz serving, you'll total about 80 calories.r\nIf you have a milk allergy, are lactose intolerant, vegan or just want to add some creaminess without using dairy, try unsweetened soy, almond, or coconut milk. They have about 30 – 40 calories."
        },
        {
          "headline":"Whisk in the chocolate.",
          "description":"Although hot chocolate is mostly milk or water, the tastiest ingredient is the chocolate. Mix or whisk in your desired amount of any of these types of chocolate:\nDutch processed cocoa powder. This is a fairly common form of chocolate to add to hot chocolate recipes. Dutch processed cocoa powder is naturally low in calories, dissolves well in liquids and has a very intense chocolate flavor. Add anywhere from 1 –3 tablespoons per serving depending on your flavor preferences. Chocolate chips or solid chocolate. Use about 2 – 4 tablespoons of chocolate chips or chopped solid chocolate per serving. Choosing a dark chocolate or 70% cocoa solid chocolate bar is best as it's lower in calories and higher in antioxidants. Carob powder or chips. These vegan chocolate chips are all natural, lower in calories, fat, sugar and caffeine compared to regular chocolate, but offer a very similar flavor. They can be substituted one for one for either chocolate chips or cocoa powder. You may want to consider even adding in chocolate protein powder. This is an easy way to add an extra hit of protein to your hot chocolate without changing the flavor."
        },
        {
          "headline":"Add a sweetener.",
          "description":"If you're making hot chocolate from scratch, you also have the ability to choose what type of sweetener and how much you use to make your chocolate the perfect treat. You'll most likely only need a sweetener if using a cocoa powder which is naturally unsweetened. Try out your desired amounts of any of these sweeteners:\nAgave syrup. This is an all natural sweetener that's made from the sap of the agave plant from Mexico. It still has calories like regular sugar, but is significantly less processed. Maple syrup. Although this will impart a distinct flavor to your hot chocolate, maple syrup is another all natural sweetener you can use. Honey. A tablespoon of honey can naturally sweeten up your cocoa. Just be sure not to serve anything containing honey to children under 12 months. Sugar substitutes. These are no-calorie sweeteners that vary widely in their level of processing; however, if you're looking to really minimize the calories in your hot chocolate, you may consider adding a sugar substitute or artificial sweetener."
        },
        {
          "headline":"Boost the flavor of your hot chocolate.",
          "description":"Most hot chocolate recipes are fairly simple; however, you can spice up your hot chocolate while still making it healthy and low-calorie. Try these flavorful no calorie mix ins:\nVanilla extract\nInstant coffee powder\nCinnamon\nCayenne or chili pepper\nOrange rind\nChai spices"
        }
      ]
    },
    {
      "name":"Using Store Bought Hot Chocolate",
      "steps":[
        {
          "headline":"Look for reduced calorie hot chocolate mixes.",
          "description":"Although the idea of making homemade hot chocolate sounds great, it's a bit easier to buy something from the store. Make sure to read the packaging to ensure you're picking a healthier choice. Many hot chocolate companies do sell either low-calorie, \"diet\" or no-sugar added mixes. Look for this wording on the packaging. This labeling generally means these mixes are lower in calories and lower in sugar. Note that they may also contain artificial sweeteners. If you do not want to consume these, make sure you double check the ingredient list to see what type of sweetener is used."
        },
        {
          "headline":"Read the labels.",
          "description":"In addition to looking at the front of the package or box, you should also flip the box over to take a look at the nutrition fact panel and ingredient list. First look at the serving size. Many hot chocolates come in a powdered form contained in a packet. Most of the time it's one packet per serving, but always double check. Review the calories, fat and sugar in your hot chocolate. Make sure it fits into your current diet or eating plan. Also review the ingredient list. This will show you the type of chocolate used and the types of sweeteners used as well."
        },
        {
          "headline":"Use low-calorie liquids for mixing.",
          "description":"If you're using a powdered hot chocolate mix from the grocery store, you'll need to mix it with liquid to make your hot chocolate. Stick to lower calorie, natural liquids for the healthiest hot chocolate. Try:\nWater\nSkim or 1% milk\nAlmond milk\nSoy milk"
        },
        {
          "headline":"Halve the serving size.",
          "description":"You may notice that some of the grocery store brands of hot chocolate aren't as flavorful or as tasty as others. If you truly enjoy the regular or higher calorie versions, incorporate some tricks to lower your overall calories. Split the package in half. There's generally a large amount of hot chocolate powder per serving. If it's the regular type, not diet, try splitting the serving size in half. Many of the regular hot chocolates will also tell you to mix the powder with whole milk or cream for the best flavor and texture. However, stick with water or skim milk to lessen the overall calories. You can also indulge in the regular, higher calorie hot chocolate every once in awhile. Stick to your low-calorie homemade version or the \"diet\" hot chocolate the majority of the time."
        }
      ]
    }
  ],
  "text":" Making Healthy Hot Chocolate From Scratch Set up the appropriate cooking equipment. If you're planning on making homemade versions of hot chocolate, make sure you have the right cooking utensils. Many recipes will tell you to make your hot chocolate in a small pot or sauce pan on the stove. This allows all the ingredients to get heated evenly and the chocolate to melt. You'll also need a heat-proof or microwave-safe mug. Some materials, like glass, may not be microwave- or heat-safe. They could break or crack when hot liquid is added or when heated in the microwave. Look at the bottom of your mug to see if there is any notation of whether or not it's heat- or microwave-safe. Although a plain wooden spoon will do, a whisk is a great tool to help incorporate all the ingredients in your hot chocolate. Choose your mixing liquid. The main ingredient in hot chocolate is the liquid. If you're looking to make a healthier or lower-calorie version of hot chocolate, heat up 6 – 8 oz of these lower-calorie liquids:\nWater. This is plain-jane, but is zero calories. This will help you get a very low-calorie hot chocolate. Skim milk. This offers you a little more creaminess, protein and calcium. For a 6 – 8 oz serving, you'll total about 80 calories.r\nIf you have a milk allergy, are lactose intolerant, vegan or just want to add some creaminess without using dairy, try unsweetened soy, almond, or coconut milk. They have about 30 – 40 calories. Whisk in the chocolate. Although hot chocolate is mostly milk or water, the tastiest ingredient is the chocolate. Mix or whisk in your desired amount of any of these types of chocolate:\nDutch processed cocoa powder. This is a fairly common form of chocolate to add to hot chocolate recipes. Dutch processed cocoa powder is naturally low in calories, dissolves well in liquids and has a very intense chocolate flavor. Add anywhere from 1 –3 tablespoons per serving depending on your flavor preferences. Chocolate chips or solid chocolate. Use about 2 – 4 tablespoons of chocolate chips or chopped solid chocolate per serving. Choosing a dark chocolate or 70% cocoa solid chocolate bar is best as it's lower in calories and higher in antioxidants. Carob powder or chips. These vegan chocolate chips are all natural, lower in calories, fat, sugar and caffeine compared to regular chocolate, but offer a very similar flavor. They can be substituted one for one for either chocolate chips or cocoa powder. You may want to consider even adding in chocolate protein powder. This is an easy way to add an extra hit of protein to your hot chocolate without changing the flavor. Add a sweetener. If you're making hot chocolate from scratch, you also have the ability to choose what type of sweetener and how much you use to make your chocolate the perfect treat. You'll most likely only need a sweetener if using a cocoa powder which is naturally unsweetened. Try out your desired amounts of any of these sweeteners:\nAgave syrup. This is an all natural sweetener that's made from the sap of the agave plant from Mexico. It still has calories like regular sugar, but is significantly less processed. Maple syrup. Although this will impart a distinct flavor to your hot chocolate, maple syrup is another all natural sweetener you can use. Honey. A tablespoon of honey can naturally sweeten up your cocoa. Just be sure not to serve anything containing honey to children under 12 months. Sugar substitutes. These are no-calorie sweeteners that vary widely in their level of processing; however, if you're looking to really minimize the calories in your hot chocolate, you may consider adding a sugar substitute or artificial sweetener. Boost the flavor of your hot chocolate. Most hot chocolate recipes are fairly simple; however, you can spice up your hot chocolate while still making it healthy and low-calorie. Try these flavorful no calorie mix ins:\nVanilla extract\nInstant coffee powder\nCinnamon\nCayenne or chili pepper\nOrange rind\nChai spices Using Store Bought Hot Chocolate Look for reduced calorie hot chocolate mixes. Although the idea of making homemade hot chocolate sounds great, it's a bit easier to buy something from the store. Make sure to read the packaging to ensure you're picking a healthier choice. Many hot chocolate companies do sell either low-calorie, \"diet\" or no-sugar added mixes. Look for this wording on the packaging. This labeling generally means these mixes are lower in calories and lower in sugar. Note that they may also contain artificial sweeteners. If you do not want to consume these, make sure you double check the ingredient list to see what type of sweetener is used. Read the labels. In addition to looking at the front of the package or box, you should also flip the box over to take a look at the nutrition fact panel and ingredient list. First look at the serving size. Many hot chocolates come in a powdered form contained in a packet. Most of the time it's one packet per serving, but always double check. Review the calories, fat and sugar in your hot chocolate. Make sure it fits into your current diet or eating plan. Also review the ingredient list. This will show you the type of chocolate used and the types of sweeteners used as well. Use low-calorie liquids for mixing. If you're using a powdered hot chocolate mix from the grocery store, you'll need to mix it with liquid to make your hot chocolate. Stick to lower calorie, natural liquids for the healthiest hot chocolate. Try:\nWater\nSkim or 1% milk\nAlmond milk\nSoy milk Halve the serving size. You may notice that some of the grocery store brands of hot chocolate aren't as flavorful or as tasty as others. If you truly enjoy the regular or higher calorie versions, incorporate some tricks to lower your overall calories. Split the package in half. There's generally a large amount of hot chocolate powder per serving. If it's the regular type, not diet, try splitting the serving size in half. Many of the regular hot chocolates will also tell you to mix the powder with whole milk or cream for the best flavor and texture. However, stick with water or skim milk to lessen the overall calories. You can also indulge in the regular, higher calorie hot chocolate every once in awhile. Stick to your low-calorie homemade version or the \"diet\" hot chocolate the majority of the time.",
  "tyn_model":[
    "hot chocolate",
    "chocolate",
    "milk",
    "chocolate chips",
    "sweetener",
    "water",
    "cocoa powder",
    "honey",
    "whisk",
    "– 8",
    "sugar",
    "maple syrup",
    "cooking equipment",
    "cooking utensils",
    "small pot",
    "sauce pan",
    "mug",
    "glass",
    "microwave",
    "mixing liquid",
    "coconut milk",
    "– 40",
    "dutch processed cocoa powder",
    "–3",
    "– 4",
    "carob powder",
    "chocolate protein powder",
    "agave syrup",
    "agave plant",
    "cocoa",
    "sugar substitutes",
    "sugar substitute",
    "artificial sweetener",
    "vanilla",
    "instant coffee powder",
    "cinnamon",
    "chili pepper",
    "chocolates",
    "almond milk",
    "hot chocolates",
    "whole milk",
    "cream",
    "skim milk"
  ],
  "tyn_section":[

  ]
}