{
  "title":"How to Make an Ice Cream Sundae Grande",
  "url":"https://www.wikihow.com/Make-an-Ice-Cream-Sundae-Grande",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Ice Cream Sundaes"
  ],
  "steps":[
    {
      "headline":"Get out a bowl.",
      "description":"The bowl should be a bit bigger than a normal sized bowl."
    },
    {
      "headline":"Warm some chocolate syrup in the microwave and pour it into the bottom of the bowl.",
      "description":"It should cover just the bottom of the bowl."
    },
    {
      "headline":"Scoop out your first choice of ice cream and put it on the bottom.",
      "description":"Layer it with this first flavor."
    },
    {
      "headline":"Take the crushed Oreo cookies and sprinkle them over the ice cream.",
      "description":""
    },
    {
      "headline":"Use your second flavor.",
      "description":"Scoop out the second flavor of ice cream you want to use and put two scoops over the Oreo cookies and the first flavor."
    },
    {
      "headline":"Drizzle hot fudge and caramel over the second flavor.",
      "description":""
    },
    {
      "headline":"Add bananas.",
      "description":"With the remaining area next to your second flavor, add two bananas, and if you want, chop them beforehand."
    },
    {
      "headline":"Add your third flavor.",
      "description":"Take your third flavor of ice cream and put two layers of it over the second flavor and the bananas."
    },
    {
      "headline":"Sprinkle the crushed nuts over the top layer of your third flavor.",
      "description":""
    },
    {
      "headline":"Get another few scoops of your first flavor and put it on top of your third flavor.",
      "description":""
    },
    {
      "headline":"Place whipped cream in between the scoops of your first flavor.",
      "description":""
    },
    {
      "headline":"Add chocolate syrup.",
      "description":"Squirt chocolate syrup from the top of the sundae and watch it drip to the bottom. If it doesn't drip, put more on."
    },
    {
      "headline":"Add caramel.",
      "description":"Drizzle the caramel onto your sundae as if you were wrapping yarn around it."
    },
    {
      "headline":"Sprinkle the sprinkles onto the top of the sundae and load the sprinkles everywhere else.",
      "description":""
    },
    {
      "headline":"Place the fruit (cherries, strawberries, etc.)",
      "description":"on the top."
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Get out a bowl. The bowl should be a bit bigger than a normal sized bowl. Warm some chocolate syrup in the microwave and pour it into the bottom of the bowl. It should cover just the bottom of the bowl. Scoop out your first choice of ice cream and put it on the bottom. Layer it with this first flavor. Take the crushed Oreo cookies and sprinkle them over the ice cream.  Use your second flavor. Scoop out the second flavor of ice cream you want to use and put two scoops over the Oreo cookies and the first flavor. Drizzle hot fudge and caramel over the second flavor.  Add bananas. With the remaining area next to your second flavor, add two bananas, and if you want, chop them beforehand. Add your third flavor. Take your third flavor of ice cream and put two layers of it over the second flavor and the bananas. Sprinkle the crushed nuts over the top layer of your third flavor.  Get another few scoops of your first flavor and put it on top of your third flavor.  Place whipped cream in between the scoops of your first flavor.  Add chocolate syrup. Squirt chocolate syrup from the top of the sundae and watch it drip to the bottom. If it doesn't drip, put more on. Add caramel. Drizzle the caramel onto your sundae as if you were wrapping yarn around it. Sprinkle the sprinkles onto the top of the sundae and load the sprinkles everywhere else.  Place the fruit (cherries, strawberries, etc.) on the top. Enjoy! ",
  "tyn_model":[
    "ice cream",
    "bowl",
    "chocolate syrup",
    "caramel",
    "bananas",
    "oreo cookies",
    "microwave",
    "hot fudge",
    "nuts",
    "whipped cream",
    "yarn",
    "fruit",
    "strawberries"
  ],
  "tyn_section":[

  ]
}