{
  "title":"How to Make a Parsnip Clarinet",
  "url":"https://www.wikihow.com/Make-a-Parsnip-Clarinet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "steps":[
    {
      "headline":"Buy a parsnip.",
      "description":"This can be bought at your local grocery store in the fresh produce section. The size you would approximately want is 18.7cm in length and a diameter of 1.2cm. Check that the parsnip is free of cracks, and avoid any that bend or show soft spots. A fresh parsnip will have an herbal fragrance."
    },
    {
      "headline":"Go to a hardware store and get yourself a 1/2-inch PVC pipe.",
      "description":""
    },
    {
      "headline":"Get yourself a clarinet mouthpiece.",
      "description":"These can be acquired at any music store that sells instruments or online. (The reed is attached to the mouthpiece, so no need to worry about buying it separately.)"
    },
    {
      "headline":"With the hand drill, drill a hole from one end of the parsnip to the other end.",
      "description":"Make sure to get rid of any pieces of the parsnip by blowing in it or washing it out."
    },
    {
      "headline":"Drill six holes on the side of the parsnip that mimics those of a clarinet.",
      "description":"Each hole should be 1.5cm-1.7cm apart from each other."
    },
    {
      "headline":"Drill one hole on the opposite side of the six already made holes where you will place your thumb.",
      "description":""
    },
    {
      "headline":"Put the parsnip in the refrigerator to harden.",
      "description":"Refrigerate for 24 hours."
    },
    {
      "headline":"Put the 1/2inch PVC pipe inside the parsnip where the mouthpiece will be placed.",
      "description":""
    },
    {
      "headline":"Place the mouthpiece on the other end of the 1/2inch PVC pipe.",
      "description":""
    },
    {
      "headline":"Insert the funnel at the opposite end of the parsnip.",
      "description":"(This will amplify the sound, but its optional) Play your parsnip clarinet and notice the similar sounds it produces."
    }
  ],
  "text":" Buy a parsnip. This can be bought at your local grocery store in the fresh produce section. The size you would approximately want is 18.7cm in length and a diameter of 1.2cm. Check that the parsnip is free of cracks, and avoid any that bend or show soft spots. A fresh parsnip will have an herbal fragrance. Go to a hardware store and get yourself a 1/2-inch PVC pipe.  Get yourself a clarinet mouthpiece. These can be acquired at any music store that sells instruments or online. (The reed is attached to the mouthpiece, so no need to worry about buying it separately.) With the hand drill, drill a hole from one end of the parsnip to the other end. Make sure to get rid of any pieces of the parsnip by blowing in it or washing it out. Drill six holes on the side of the parsnip that mimics those of a clarinet. Each hole should be 1.5cm-1.7cm apart from each other. Drill one hole on the opposite side of the six already made holes where you will place your thumb.  Put the parsnip in the refrigerator to harden. Refrigerate for 24 hours. Put the 1/2inch PVC pipe inside the parsnip where the mouthpiece will be placed.  Place the mouthpiece on the other end of the 1/2inch PVC pipe.  Insert the funnel at the opposite end of the parsnip. (This will amplify the sound, but its optional) Play your parsnip clarinet and notice the similar sounds it produces.",
  "tyn_model":[
    "parsnip",
    "pvc pipe",
    "clarinet mouthpiece",
    "drill",
    "clarinet",
    "refrigerator",
    "funnel",
    "parsnip clarinet"
  ],
  "tyn_section":[

  ]
}