{
  "title":"How to Build a Cupcake Snowman",
  "url":"https://www.wikihow.com/Build-a-Cupcake-Snowman",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Fill  the muffin cups with cupcake batter.",
      "description":"Chocolate is always a good flavor but you can make it into any flavor you want!"
    },
    {
      "headline":"Frost the cupcake with white.",
      "description":"Add the frosting to the top of the cupcake. If you are serving this to guests, it may be best to put on a dairy free frosting -- carrot is a good idea."
    },
    {
      "headline":"Add a chocolate scarf decoration.",
      "description":"You can make this yourself by melting the chocolate and molding it into shape or you can ask a local chocolate maker to create some for you. You could also use chocolate frosting and apply it with a medium-soft paint brush, or squirt it on."
    },
    {
      "headline":"Make the head.",
      "description":"Add a small round chocolate cookie or truffle to the center of the scarf. If using a cookie, stand it upright as shown in the image. If using a truffle, sit it on firmly in the middle."
    },
    {
      "headline":"Coat the cookie or truffle in more white frosting.",
      "description":"Make sure you don't paint on the scarf! Apply a little frosting to the head a time. If you glob it on, the frosting will drip down onto the scarf."
    },
    {
      "headline":"Add two chocolate drops for eyes.",
      "description":"You can also add small jelly candy, or leftover candy corn (from Halloween) for the nose."
    },
    {
      "headline":"Make a mouth using a line of small chocolate drops.",
      "description":"Put a lovely big smile!"
    },
    {
      "headline":"Make the brim of his top hat.",
      "description":"Add a small flat cookie to the top of your snowman's head."
    },
    {
      "headline":"Put the top in the top hat.",
      "description":"Place a square chocolate candy on top of the round cookie brim. Use melted chocolate or frosting to glue the chocolate to the cookie."
    },
    {
      "headline":"Make it frosty.",
      "description":"Sprinkle a little powdered sugar or coconut flakes over your snowman. If you're serving them on a serving plate, it may be a good idea to only apply the \"snow\" when it's on the platter. You can also cover the platter and snowman with \"snow\"."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Fill  the muffin cups with cupcake batter. Chocolate is always a good flavor but you can make it into any flavor you want! Frost the cupcake with white. Add the frosting to the top of the cupcake. If you are serving this to guests, it may be best to put on a dairy free frosting -- carrot is a good idea. Add a chocolate scarf decoration. You can make this yourself by melting the chocolate and molding it into shape or you can ask a local chocolate maker to create some for you. You could also use chocolate frosting and apply it with a medium-soft paint brush, or squirt it on. Make the head. Add a small round chocolate cookie or truffle to the center of the scarf. If using a cookie, stand it upright as shown in the image. If using a truffle, sit it on firmly in the middle. Coat the cookie or truffle in more white frosting. Make sure you don't paint on the scarf! Apply a little frosting to the head a time. If you glob it on, the frosting will drip down onto the scarf. Add two chocolate drops for eyes. You can also add small jelly candy, or leftover candy corn (from Halloween) for the nose. Make a mouth using a line of small chocolate drops. Put a lovely big smile! Make the brim of his top hat. Add a small flat cookie to the top of your snowman's head. Put the top in the top hat. Place a square chocolate candy on top of the round cookie brim. Use melted chocolate or frosting to glue the chocolate to the cookie. Make it frosty. Sprinkle a little powdered sugar or coconut flakes over your snowman. If you're serving them on a serving plate, it may be a good idea to only apply the \"snow\" when it's on the platter. You can also cover the platter and snowman with \"snow\". Finished. ",
  "tyn_model":[
    "chocolate",
    "frosting",
    "cookie",
    "snow",
    "cupcake batter",
    "chocolate scarf",
    "chocolate maker",
    "chocolate frosting",
    "chocolate cookie",
    "white frosting",
    "candy corn",
    "powdered sugar",
    "coconut flakes",
    "serving plate"
  ],
  "tyn_section":[

  ]
}