{
  "title":"How to Choose Safe BPA Free Plastics",
  "url":"https://www.wikihow.com/Choose-Safe-BPA-Free-Plastics",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Identifying Plastics with BPA",
      "steps":[
        {
          "headline":"Examine plastic products for labeling.",
          "description":"Many plastic products, and especially those used for food or drink or children’s toys, contain a number label that can tell you if they contain BPA. Look on the bottom of the product for a number from one to seven (1-7) surrounded by a triangle made of three arrows (commonly known as the “recycling symbol”). Items with numbers 3, 6, and especially 7 are most likely to contain BPA. Items with 1, 2, 4, or 5 generally do not contain BPA. A “BPA free” label on the product or packaging, in combination with one of the “safer” recycling numbers, is your safest bet for avoiding BPA."
        },
        {
          "headline":"Identify polycarbonate products.",
          "description":"BPA is used to provide some “give” to rigid plastics in order to reduce cracking and breaking, and rigid plastics are usually made of polycarbonates. If the plastic item has a recycling number “7” and/or has the marking “PC,” it is a polycarbonate and more likely to contain BPA. If a plastic product is rigid and transparent — for instance, a reusable food storage container — the odds are good that it is a polycarbonate that may contain BPA. Softer, flexible, and opaque plastics are usually not polycarbonates and less likely to contain BPA. But always look for labeling."
        },
        {
          "headline":"Discard older plastic products.",
          "description":"BPA has been in use since the late 1950s, so there’s a distinct possibility that your childhood “sippy cup” or your grandma’s vintage plastic food storage containers contain BPA. Older products are less likely to have identifying labeling as well. Many people are particularly concerned about BPA exposure in babies. BPA was banned in baby bottles and kids’ sippy cups by the FDA in the U.S. in 2012, and earlier in Europe. If you have older plastic baby bottles, assume they have BPA and discard them. Scratches, general wear and tear, and repeated heat exposure cause the release of greater amounts of BPA from plastic products. This is another reason to consider discarding older, well-used products that may contain BPA."
        }
      ]
    },
    {
      "name":"Limiting Possible BPA Exposure",
      "steps":[
        {
          "headline":"Choose non-plastic food and beverage containers.",
          "description":"Before the widespread adoption of plastic, everything from baby bottles to mixing bowls was typically made of materials like glass, ceramic, and stainless steel. As concerns over BPA and other chemicals in plastics has grown, so too has the market for food and beverage products made from these alternate containers, which do not leach potentially harmful materials. If even BPA-free baby bottles concern you, for instance, there are newer glass options that include a silicone sleeve on the outside to limit the chance of shattering. Be aware, however, that many metal cans used for foods and beverages (like beans and beer) contain a lining resin that contains BPA. Regular consumption of food from such containers does appear to at least temporarily increase blood BPA levels. Cans usually have no markings indicating the use (or absence) of BPA linings, but you can find lists of manufacturers that at least claim not to use BPA. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tTry glass containers with a snap-on lid to store your food. Kathryn Kellogg, author of 101 Ways to Go Zero Waste, says: \"You can find glass containers with silicone and bamboo lids, but even if the lids are plastic, there's not as much plastic touching your food. Since you can see through the glass, you're more likely to remember what's in the fridge and eat the food before it goes bad. Also, the containers will last a really long time if you take care of them. \""
        },
        {
          "headline":"Limit the use of high heat or harsh cleaning with plastics.",
          "description":"Even if your plastic products are advertised as “microwave safe” or “dishwasher safe,” high temperatures weaken the plastic and facilitate the release of chemicals like BPA. Harsh chemicals or scouring and scrubbing that causes scratches can cause the same issue. If you want to limit possible BPA exposure:  Use microwave-safe glass or ceramic dishes to reheat foods in the microwave. Don’t put hot foods or beverages directly into plastic containers. Wash plastic items by hand, with gentle soap, warm water, and non-abrasive brushes or rags. Discard scratched, discolored, faded, or misshapen plastics, or plastic food containers that have been in use for long periods of time."
        },
        {
          "headline":"Find plastics alternatives for products that make mouth contact.",
          "description":"Especially if you have small children around, you know that food and beverage containers aren’t the only plastics that make mouth contact. Sucking, chewing, or — yes — swallowing plastic items like teethers and toys can possibly cause BPA exposure. Once again, the increased public concern about what may lurk in their plastics has lead to a resurgence of baby items, toys, and other products made of traditional, non-plastic materials. Untreated, uncoated wood blocks are just as much fun as plastic ones. Especially for small children, look for toys made of uncoated wood, cotton, wool, etc. Try a frozen washcloth as a baby teether instead of using plastic. Don’t let your small child chew on TV remotes, cell phones, etc."
        },
        {
          "headline":"Worry more about cavities than possible BPA in your dental sealants and composites.",
          "description":"BPA is not used directly in dental sealants or composites, but it can occur as a trace material left over from the manufacturing process or be created in minute amounts by the degradation of other materials in the sealants. All evidence indicates that any BPA exposure will be temporary (usually less than three hours) and 50,000 times below the threshold for an acute exposure event. The bottom line, at least as far as the current research indicates:  You may well be exposed to minute amounts of BPA for a short period after having dental work done. However, the demonstrated health risks of leaving cavities or other dental problems untreated should far outweigh concerns about trace amounts of BPA."
        }
      ]
    },
    {
      "name":"Examining the Issue",
      "steps":[
        {
          "headline":"Learn more about BPA.",
          "description":"Without getting into a chemistry lesson here, it is perhaps sufficient to say that bisphenol-A (BPA) is an industrial chemical additive. It adds flexible strength to a wide range of polycarbonate plastics, as well as epoxy resins in items like can coatings and dental sealants. Unfortunately, when ingested in sufficient quantities, BPA has also been shown to be a “hormone disruptor” that mimics estrogen. The real questions are “How bad is BPA for us?”, and “How much BPA is needed to cause potentially negative effects?”"
        },
        {
          "headline":"Weigh both sides of the debate over BPA safety.",
          "description":"The U.S. Food and Drug Administration (FDA) is clear on the issue:  “current approved uses of BPA in food containers and packaging are safe.”  And, just to be extra clear:  “Is BPA safe? Yes.”  Basically, the FDA (and plastics manufacturers) contend that while BPA can cause health problems, the amount you can ingest from products is far below the threshold for concern. Anti-BPA campaigners and some researchers are not so sure about that, however. Because BPA mimics the hormone estrogen, they claim, even smaller amounts can impact brain, behavioral, and reproductive development, especially in fetuses, infants, and small children. BPA exposure may also have links to obesity and possibly even some cancers. Basically, anti-BPA advocates contend, BPA is not approved by the FDA because it has been proven “safe”; it has simply “not been proven unsafe” to a degree sufficient to convince the organization."
        },
        {
          "headline":"Question whether BPA-free plastics are necessarily safer.",
          "description":"In response to consumer pressure, many plastics manufacturers have rushed to remove BPA from their products. Often, BPA is replaced by bisphenol-S (BPS) or similar chemicals. Unfortunately, there is growing evidence that BPS (and other similar chemicals) may also cause similar effects on the human body as BPA. One study of 455 plastic products found that nearly all of them, including those labeled “BPA-free,” had some amount of estrogen-mimicking chemicals inside. Basically, if you believe that you should be legitimately concerned about BPA and avoid it, you should probably try to limit your contact with all plastics (especially polycarbonate plastics). Again, study the issue and make the best decision for yourself and your family."
        }
      ]
    }
  ],
  "text":" Identifying Plastics with BPA Examine plastic products for labeling. Many plastic products, and especially those used for food or drink or children’s toys, contain a number label that can tell you if they contain BPA. Look on the bottom of the product for a number from one to seven (1-7) surrounded by a triangle made of three arrows (commonly known as the “recycling symbol”). Items with numbers 3, 6, and especially 7 are most likely to contain BPA. Items with 1, 2, 4, or 5 generally do not contain BPA. A “BPA free” label on the product or packaging, in combination with one of the “safer” recycling numbers, is your safest bet for avoiding BPA. Identify polycarbonate products. BPA is used to provide some “give” to rigid plastics in order to reduce cracking and breaking, and rigid plastics are usually made of polycarbonates. If the plastic item has a recycling number “7” and/or has the marking “PC,” it is a polycarbonate and more likely to contain BPA. If a plastic product is rigid and transparent — for instance, a reusable food storage container — the odds are good that it is a polycarbonate that may contain BPA. Softer, flexible, and opaque plastics are usually not polycarbonates and less likely to contain BPA. But always look for labeling. Discard older plastic products. BPA has been in use since the late 1950s, so there’s a distinct possibility that your childhood “sippy cup” or your grandma’s vintage plastic food storage containers contain BPA. Older products are less likely to have identifying labeling as well. Many people are particularly concerned about BPA exposure in babies. BPA was banned in baby bottles and kids’ sippy cups by the FDA in the U.S. in 2012, and earlier in Europe. If you have older plastic baby bottles, assume they have BPA and discard them. Scratches, general wear and tear, and repeated heat exposure cause the release of greater amounts of BPA from plastic products. This is another reason to consider discarding older, well-used products that may contain BPA. Limiting Possible BPA Exposure Choose non-plastic food and beverage containers. Before the widespread adoption of plastic, everything from baby bottles to mixing bowls was typically made of materials like glass, ceramic, and stainless steel. As concerns over BPA and other chemicals in plastics has grown, so too has the market for food and beverage products made from these alternate containers, which do not leach potentially harmful materials. If even BPA-free baby bottles concern you, for instance, there are newer glass options that include a silicone sleeve on the outside to limit the chance of shattering. Be aware, however, that many metal cans used for foods and beverages (like beans and beer) contain a lining resin that contains BPA. Regular consumption of food from such containers does appear to at least temporarily increase blood BPA levels. Cans usually have no markings indicating the use (or absence) of BPA linings, but you can find lists of manufacturers that at least claim not to use BPA. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tTry glass containers with a snap-on lid to store your food. Kathryn Kellogg, author of 101 Ways to Go Zero Waste, says: \"You can find glass containers with silicone and bamboo lids, but even if the lids are plastic, there's not as much plastic touching your food. Since you can see through the glass, you're more likely to remember what's in the fridge and eat the food before it goes bad. Also, the containers will last a really long time if you take care of them. \" Limit the use of high heat or harsh cleaning with plastics. Even if your plastic products are advertised as “microwave safe” or “dishwasher safe,” high temperatures weaken the plastic and facilitate the release of chemicals like BPA. Harsh chemicals or scouring and scrubbing that causes scratches can cause the same issue. If you want to limit possible BPA exposure:  Use microwave-safe glass or ceramic dishes to reheat foods in the microwave. Don’t put hot foods or beverages directly into plastic containers. Wash plastic items by hand, with gentle soap, warm water, and non-abrasive brushes or rags. Discard scratched, discolored, faded, or misshapen plastics, or plastic food containers that have been in use for long periods of time. Find plastics alternatives for products that make mouth contact. Especially if you have small children around, you know that food and beverage containers aren’t the only plastics that make mouth contact. Sucking, chewing, or — yes — swallowing plastic items like teethers and toys can possibly cause BPA exposure. Once again, the increased public concern about what may lurk in their plastics has lead to a resurgence of baby items, toys, and other products made of traditional, non-plastic materials. Untreated, uncoated wood blocks are just as much fun as plastic ones. Especially for small children, look for toys made of uncoated wood, cotton, wool, etc. Try a frozen washcloth as a baby teether instead of using plastic. Don’t let your small child chew on TV remotes, cell phones, etc. Worry more about cavities than possible BPA in your dental sealants and composites. BPA is not used directly in dental sealants or composites, but it can occur as a trace material left over from the manufacturing process or be created in minute amounts by the degradation of other materials in the sealants. All evidence indicates that any BPA exposure will be temporary (usually less than three hours) and 50,000 times below the threshold for an acute exposure event. The bottom line, at least as far as the current research indicates:  You may well be exposed to minute amounts of BPA for a short period after having dental work done. However, the demonstrated health risks of leaving cavities or other dental problems untreated should far outweigh concerns about trace amounts of BPA. Examining the Issue Learn more about BPA. Without getting into a chemistry lesson here, it is perhaps sufficient to say that bisphenol-A (BPA) is an industrial chemical additive. It adds flexible strength to a wide range of polycarbonate plastics, as well as epoxy resins in items like can coatings and dental sealants. Unfortunately, when ingested in sufficient quantities, BPA has also been shown to be a “hormone disruptor” that mimics estrogen. The real questions are “How bad is BPA for us?”, and “How much BPA is needed to cause potentially negative effects?” Weigh both sides of the debate over BPA safety. The U.S. Food and Drug Administration (FDA) is clear on the issue:  “current approved uses of BPA in food containers and packaging are safe.”  And, just to be extra clear:  “Is BPA safe? Yes.”  Basically, the FDA (and plastics manufacturers) contend that while BPA can cause health problems, the amount you can ingest from products is far below the threshold for concern. Anti-BPA campaigners and some researchers are not so sure about that, however. Because BPA mimics the hormone estrogen, they claim, even smaller amounts can impact brain, behavioral, and reproductive development, especially in fetuses, infants, and small children. BPA exposure may also have links to obesity and possibly even some cancers. Basically, anti-BPA advocates contend, BPA is not approved by the FDA because it has been proven “safe”; it has simply “not been proven unsafe” to a degree sufficient to convince the organization. Question whether BPA-free plastics are necessarily safer. In response to consumer pressure, many plastics manufacturers have rushed to remove BPA from their products. Often, BPA is replaced by bisphenol-S (BPS) or similar chemicals. Unfortunately, there is growing evidence that BPS (and other similar chemicals) may also cause similar effects on the human body as BPA. One study of 455 plastic products found that nearly all of them, including those labeled “BPA-free,” had some amount of estrogen-mimicking chemicals inside. Basically, if you believe that you should be legitimately concerned about BPA and avoid it, you should probably try to limit your contact with all plastics (especially polycarbonate plastics). Again, study the issue and make the best decision for yourself and your family.",
  "tyn_model":[
    "bpa",
    "plastic",
    "containers",
    "dental sealants",
    "“bpa",
    "” to",
    "polycarbonate",
    "” or",
    "bottles",
    "plastics",
    "“how",
    "”  ",
    "“recycling",
    "”)",
    "” label",
    "“safer",
    "” recycling",
    "“give",
    "polycarbonates",
    "“7",
    "” and/or",
    "“pc",
    "” it",
    "— for",
    "— the",
    "“sippy",
    "’ sippy",
    "cans",
    "beer",
    "bpa linings",
    "eco-friendly living",
    "plastic-free living for national geographic",
    "fridge",
    "“microwave",
    "“dishwasher",
    "” high",
    "dishes",
    "microwave",
    "gentle soap",
    "water",
    "— yes",
    "— swallowing",
    "washcloth",
    "bisphenol-",
    "epoxy resins",
    "“hormone",
    "” that",
    "”,",
    "” weigh",
    "“current",
    "“is",
    "“safe",
    "”;",
    "“not",
    "bisphenol-s",
    "bps",
    "” had"
  ],
  "tyn_section":[

  ]
}