{
  "title":"How to Use Electronic Signatures on Online Contracts",
  "url":"https://www.wikihow.com/Use-Electronic-Signatures-on-Online-Contracts",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Text and Lettering"
  ],
  "parts":[
    {
      "name":"Registering with a Paid Service",
      "steps":[
        {
          "headline":"Search for e-signature providers.",
          "description":"There are dozens of online services which provide e-signature platforms. To find them, you should search the Internet for “electronic signature provider.”  Some of the more popular e-signature providers include:\nSertifi\nRightSignature\neSignly\nDocuSign\nSignix"
        },
        {
          "headline":"Sign up for a free trial.",
          "description":"Many e-signature providers allow you to use a free trial. You should sign up for a free trial so that you can compare the experience of using each service. To sing up, visit the website and click on “Start Free Trial” or a similar link. You will be prompted to create a username and password. You also will enter your personal information (name, title, company, and phone number)."
        },
        {
          "headline":"Compare your experiences.",
          "description":"You should use each platform to send contracts and see if you find the service easy to use. You want a platform which integrates well with your current business needs. For example, if you send mostly PDFs, then you want the platform to be able to handle that type of file."
        },
        {
          "headline":"Purchase.",
          "description":"Most e-signature platforms require that you pay a monthly fee. The amount can vary, with prices of $10-30 a month common. You should find the most up-to-date prices by visiting the platform’s website. Check to see if you can get a discount for purchasing the service for an entire year. For example, an e-signature provider might charge $12 a month but only charge $99 for an entire year."
        }
      ]
    },
    {
      "name":"Creating a Photoshop Scan",
      "steps":[
        {
          "headline":"Sign your name on a piece of paper.",
          "description":"Take out a piece of unlined computer paper and sign your name several times. Try to make the signatures different sizes, because some sizes will look better when scanned into a digital image. You can experiment using different pens, e.g., felt-tip or gel pens. Be sure to use a dark color, preferably black."
        },
        {
          "headline":"Scan the paper.",
          "description":"Put the paper face-down on the scanner and scan. Make sure that the resolution is sufficiently high. For example, you probably shouldn’t go below 600 dpi."
        },
        {
          "headline":"Pick a signature.",
          "description":"Open the digital file and look at all of the signatures on the page. Find one that is the clearest. You will want to copy that one, using the magic wand feature on Photoshop. If none of your signatures look clear, then write your name again on a different piece of paper. Choose different types of pens as well. If you used a gel pen for the first round of signatures, choose to use a felt-tip pen to see if it creates clearer, stronger signatures."
        },
        {
          "headline":"Use the “magic wand” tool.",
          "description":"You can find the magic wand tool by clicking on the “Quick Selection Tool” icon in CS3 or later versions of Photoshop. You will use this tool to select your signature. Hover your cursor over the signature and make sure to click on the signature itself. The wand should then select all of the pixels in your signature. Click on “Select” and “Inverse.”"
        },
        {
          "headline":"Paste the signature into a new document.",
          "description":"You want to paste the signature into a new document which can be saved with a transparent background. You can save an image with a transparent background in Adobe Illustrator."
        },
        {
          "headline":"Save the image.",
          "description":"You must save the signature in a format that supports transparent backgrounds. Generally, you can save the signature as a PNG file. You should avoid saving it as a JPEG. As you save the image in PNG format, you will need to set the “background color” to “Transparent” and then click “Okay.”"
        },
        {
          "headline":"Use your scanned signature.",
          "description":"Once you have saved a PNG file of your signature, you can paste it into documents. For example, you could paste it into the body of an email or insert it into a document as an image. Once you insert the signature, move it around so that it lines up with the signature line on the contract. You will then need to save the contract so that the signature image becomes part of the document."
        }
      ]
    },
    {
      "name":"Declining to Use an E-signature",
      "steps":[
        {
          "headline":"Opt for a paper contract.",
          "description":"Federal law allows you to opt-out of electronic contracts and to receive a paper copy. Before using an electronic contract, the other business must get your consent. You must also be given notice that you can opt out of electronic contracts at any point in the future. However, you may have to pay additional fees for the right to use paper contracts. You should find out this information before opting out of electronic contracts."
        },
        {
          "headline":"Identify which contracts must be on paper.",
          "description":"Not every legal document can be an electronic document. Accordingly, you should get paper copies of the following:\nwills, testamentary trusts, and codicils\nnotices of cancellation or termination of utility services\nany document related to family matters, such as divorce or adoption\nnotices of default, repossession, foreclosure, or eviction\ncourt documents, such as notices or court orders\nnotices of cancellation for life or health insurance benefits\nproduct recalls for health and safety\ndocuments required to travel with hazardous materials"
        },
        {
          "headline":"Create digital scans of paper documents.",
          "description":"If you continue to use paper copies, then you will need to store them. However, you might find that you don’t have room for all of your paper copies in your office. You can choose to scan your hard copies so that you can gain easy access to the contracts in digital form. You could then store the paper copy off-site."
        }
      ]
    }
  ],
  "text":" Registering with a Paid Service Search for e-signature providers. There are dozens of online services which provide e-signature platforms. To find them, you should search the Internet for “electronic signature provider.”  Some of the more popular e-signature providers include:\nSertifi\nRightSignature\neSignly\nDocuSign\nSignix Sign up for a free trial. Many e-signature providers allow you to use a free trial. You should sign up for a free trial so that you can compare the experience of using each service. To sing up, visit the website and click on “Start Free Trial” or a similar link. You will be prompted to create a username and password. You also will enter your personal information (name, title, company, and phone number). Compare your experiences. You should use each platform to send contracts and see if you find the service easy to use. You want a platform which integrates well with your current business needs. For example, if you send mostly PDFs, then you want the platform to be able to handle that type of file. Purchase. Most e-signature platforms require that you pay a monthly fee. The amount can vary, with prices of $10-30 a month common. You should find the most up-to-date prices by visiting the platform’s website. Check to see if you can get a discount for purchasing the service for an entire year. For example, an e-signature provider might charge $12 a month but only charge $99 for an entire year. Creating a Photoshop Scan Sign your name on a piece of paper. Take out a piece of unlined computer paper and sign your name several times. Try to make the signatures different sizes, because some sizes will look better when scanned into a digital image. You can experiment using different pens, e.g., felt-tip or gel pens. Be sure to use a dark color, preferably black. Scan the paper. Put the paper face-down on the scanner and scan. Make sure that the resolution is sufficiently high. For example, you probably shouldn’t go below 600 dpi. Pick a signature. Open the digital file and look at all of the signatures on the page. Find one that is the clearest. You will want to copy that one, using the magic wand feature on Photoshop. If none of your signatures look clear, then write your name again on a different piece of paper. Choose different types of pens as well. If you used a gel pen for the first round of signatures, choose to use a felt-tip pen to see if it creates clearer, stronger signatures. Use the “magic wand” tool. You can find the magic wand tool by clicking on the “Quick Selection Tool” icon in CS3 or later versions of Photoshop. You will use this tool to select your signature. Hover your cursor over the signature and make sure to click on the signature itself. The wand should then select all of the pixels in your signature. Click on “Select” and “Inverse.” Paste the signature into a new document. You want to paste the signature into a new document which can be saved with a transparent background. You can save an image with a transparent background in Adobe Illustrator. Save the image. You must save the signature in a format that supports transparent backgrounds. Generally, you can save the signature as a PNG file. You should avoid saving it as a JPEG. As you save the image in PNG format, you will need to set the “background color” to “Transparent” and then click “Okay.” Use your scanned signature. Once you have saved a PNG file of your signature, you can paste it into documents. For example, you could paste it into the body of an email or insert it into a document as an image. Once you insert the signature, move it around so that it lines up with the signature line on the contract. You will then need to save the contract so that the signature image becomes part of the document. Declining to Use an E-signature Opt for a paper contract. Federal law allows you to opt-out of electronic contracts and to receive a paper copy. Before using an electronic contract, the other business must get your consent. You must also be given notice that you can opt out of electronic contracts at any point in the future. However, you may have to pay additional fees for the right to use paper contracts. You should find out this information before opting out of electronic contracts. Identify which contracts must be on paper. Not every legal document can be an electronic document. Accordingly, you should get paper copies of the following:\nwills, testamentary trusts, and codicils\nnotices of cancellation or termination of utility services\nany document related to family matters, such as divorce or adoption\nnotices of default, repossession, foreclosure, or eviction\ncourt documents, such as notices or court orders\nnotices of cancellation for life or health insurance benefits\nproduct recalls for health and safety\ndocuments required to travel with hazardous materials Create digital scans of paper documents. If you continue to use paper copies, then you will need to store them. However, you might find that you don’t have room for all of your paper copies in your office. You can choose to scan your hard copies so that you can gain easy access to the contracts in digital form. You could then store the paper copy off-site.",
  "tyn_model":[
    "e-signature providers",
    "e-signature platforms",
    "paper",
    "magic wand",
    "” and",
    "“electronic signature provider",
    "”  ",
    "“start",
    "” or",
    "e-signature provider",
    "computer paper",
    "felt-tip or gel pens",
    "scanner",
    "pens",
    "felt-tip pen",
    "“magic wand",
    "” tool",
    "“quick selection",
    "” icon",
    "photoshop",
    "“select",
    "“inverse",
    "” paste",
    "adobe illustrator",
    "png",
    "jpeg",
    "“background",
    "” to",
    "“transparent",
    "“okay",
    "” use"
  ],
  "tyn_section":[

  ]
}