{
  "title":"How to Make a Cocktail",
  "url":"https://www.wikihow.com/Make-a-Cocktail",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails"
  ],
  "methods":[
    {
      "name":"Making a Basic Cocktail",
      "steps":[
        {
          "headline":"Choose a type of liquor that you want to use in your cocktail.",
          "description":"It wouldn't be a cocktail without some alcohol, so be sure to get some. Here are some ideas for spirits you can use:\nClear or colorless spirits. These are more or less colorless in appearance and much of the time has a milder taste than other spirits. Colorless spirits include:\nVodka\nGin\n(Unaged) Cachaça\nNeutral Grain Spirit\nSoju\n\n\nWhiskeys. Whiskeys are made from fermented grain mash, with the grain used changing from type to type. Whiskey is popular around the world but primarily manufactured in Scotland, Ireland, America, Canada, and Japan, each of which have distinct flavors. The types of whiskey include:\nBourbon\nScotch\nRye\nIrish\nCanadian\nJapanese\n\nOther colored spirits. There are dozens of different kinds of spirits that would make sense in a cocktail. Some of the most popular spirits not to have already been listed include:\nTequila\nMezcal\nAbsinthe\nBrandy"
        },
        {
          "headline":"Add another type of alcohol to enhance the taste of the spirit, if desired.",
          "description":"Sometimes, a drink with a lower alcohol concentration is chosen to enhance the flavor of the spirit. If you're going to use 2 types of alcohol in combination, be sure to test whether their tastes are compatible. Gin and light beer may work in a refreshing drink with lemon and honey, or beer and tequila may work as a \"beer-garita,\" but ouzo and red wine probably aren't likely to be paired anytime soon. Beer and wine cocktails have become increasingly popular over the years. Experiment with beer, for example, by making a simple Shandy from lemonade and beer. Experiment with wine by making a Kalimotxo, or red wine and cola. Or try a French 75, which combines gin, sparkling wine, lemon, and sugar."
        },
        {
          "headline":"Get a nice cocktail shaker.",
          "description":"In order to combine your ingredients together, you're probably going to need a cocktail shaker. Although certain cocktails that cocktails that use distilled spirits or very light mixers are stirred, most other cocktails are shaken. Cocktails that have fruit juices, dairy products or eggs, simple syrup, sour mix, or any other thick ingredients should to shaken."
        },
        {
          "headline":"Use a jigger or measuring cup.",
          "description":"A jigger is a useful tool if you want to make clean cocktails with exact measurements. Think about it: a cocktail where you \"eyeball\" the amount of alcohol or the amount of mixer can turn out too strong or too weak. Many jiggers or measuring cups contain 2 sides, kind of like an hourglass. The small jigger usually holds 1  fl oz (30 mL) of liquid, while the bigger jigger holds 2  fl oz (59 mL). This makes pouring cocktails that require \"double\" shots much easier."
        },
        {
          "headline":"Muddle your fruit or herbs in the cocktail shaker first, if applicable.",
          "description":"Simply put the recommended amount of fruit and herbs in the bottom of your cocktail shaker and muddle with a muddler or the end of a wooden spoon. Make sure to get all the juices out of the fruit and break it up sufficiently. Some recipes won't call for muddled fruits, but many will. A mojito, for example, calls for muddled limes and mint to begin with."
        },
        {
          "headline":"Add the juices, alcohols, and liqueurs into the cocktail shaker.",
          "description":"As directed by your recipe, add the required liquids to your cocktail shaker."
        },
        {
          "headline":"Put in the ice after adding the liquids.",
          "description":"Add ice once you're ready to shake so that you don't dilute the cocktail unnecessarily. This is a mistake that many people make. They put the ice in at the beginning instead of the end, thereby diluting their drink."
        },
        {
          "headline":"Close the cap to the cocktail shaker and shake vigorously.",
          "description":"This can take anywhere from 10 to 20 seconds, or until the shaker is too cold to hold. Vigorous shaking will combine all the ingredients in the drink together, blending them so that you don't taste an overwhelming amount of juice and not alcohol, or vice versa. If you plan on salting or sugaring the rim of your glass — for a margarita, for example — do it now, before you pour the drink. Dip the glass into a shallow dish full of water, then dip it in a shallow dish of salt, sugar, or whatever is appropriate for your drink."
        },
        {
          "headline":"Strain the drink into the appropriate vessel.",
          "description":"Different drinks call for different glasses. A martini, for example, is always served in a martini glass, whereas a mojito is usually served in a highball glass. Take the time to find which vessel is best for your cocktail. You may think it's a bunch of hogwash, but there are plenty of people who think that choosing the right glass is what sets a good drink apart from a great one. Also, the glass affects the appearance, which influences your perception of its taste. If your cocktail calls for ice to be added after you've shaken it, add fresh ice cubes instead of the ice cubes used while shaking. Fresh ice cubes are larger, meaning they won't melt as quickly, diluting your drink."
        },
        {
          "headline":"Add bitters to your drink, if applicable.",
          "description":"Bitters are aromatic flavorings added to many (usually whiskey) drinks after mixing. Probably the most famous bitters mix is Angostura bitters."
        },
        {
          "headline":"Finish with a garnish to your drink.",
          "description":"The garnish you choose should be suitable for your cocktail. An olive on a skewer, for example, traditionally goes with a martini."
        }
      ]
    },
    {
      "name":"Five Classic Cocktails",
      "steps":[
        {
          "headline":"Make a martini.",
          "description":"Sleek and sophisticated — and seriously boozy — this cocktail is the epitome of class. Classic martinis come with either gin or vodka, and have the option of being made \"dirty,\" or with added olive juice. Chocolate martini\nStrawberry martini\nEggnog martini\nKey lime martini"
        },
        {
          "headline":"Make a mojito.",
          "description":"Popularized in the Americas by none other than Ernest Hemingway, this summery drink is the class of the tropics. Lime, mint, rum, sugar, and fizzy water — how can you go wrong with that? Strawberry mojito\nMango mojito\nBlueberry mojito\nPineapple mojito"
        },
        {
          "headline":"Make a mint julep.",
          "description":"A classic American southern tradition, the mint julep is simple but sophisticated. Drink this during Derby weekend and you'll feel like you're in Kentucky no matter where you are."
        },
        {
          "headline":"Make a margarita.",
          "description":"Margaritas are the quintessential Mexican cocktail. Made with lime juice, tequila, orange liqueur, and a bit of sugar, they are usually served straight-up, although they can also be blended. Orange margaritas\nStrawberry margaritas\nFrozen margaritas\nBanana margaritas"
        },
        {
          "headline":"Make an old fashioned.",
          "description":"The old fashioned is a boozy cocktail — only bourbon and syrup stand between it and your tummy. Although the old fashioned has seemingly fallen out of fashion since its heyday in the '20s and '30s, it remains a go-to for many cocktail drinkers."
        }
      ]
    }
  ],
  "text":" Making a Basic Cocktail Choose a type of liquor that you want to use in your cocktail. It wouldn't be a cocktail without some alcohol, so be sure to get some. Here are some ideas for spirits you can use:\nClear or colorless spirits. These are more or less colorless in appearance and much of the time has a milder taste than other spirits. Colorless spirits include:\nVodka\nGin\n(Unaged) Cachaça\nNeutral Grain Spirit\nSoju\n\n\nWhiskeys. Whiskeys are made from fermented grain mash, with the grain used changing from type to type. Whiskey is popular around the world but primarily manufactured in Scotland, Ireland, America, Canada, and Japan, each of which have distinct flavors. The types of whiskey include:\nBourbon\nScotch\nRye\nIrish\nCanadian\nJapanese\n\nOther colored spirits. There are dozens of different kinds of spirits that would make sense in a cocktail. Some of the most popular spirits not to have already been listed include:\nTequila\nMezcal\nAbsinthe\nBrandy Add another type of alcohol to enhance the taste of the spirit, if desired. Sometimes, a drink with a lower alcohol concentration is chosen to enhance the flavor of the spirit. If you're going to use 2 types of alcohol in combination, be sure to test whether their tastes are compatible. Gin and light beer may work in a refreshing drink with lemon and honey, or beer and tequila may work as a \"beer-garita,\" but ouzo and red wine probably aren't likely to be paired anytime soon. Beer and wine cocktails have become increasingly popular over the years. Experiment with beer, for example, by making a simple Shandy from lemonade and beer. Experiment with wine by making a Kalimotxo, or red wine and cola. Or try a French 75, which combines gin, sparkling wine, lemon, and sugar. Get a nice cocktail shaker. In order to combine your ingredients together, you're probably going to need a cocktail shaker. Although certain cocktails that cocktails that use distilled spirits or very light mixers are stirred, most other cocktails are shaken. Cocktails that have fruit juices, dairy products or eggs, simple syrup, sour mix, or any other thick ingredients should to shaken. Use a jigger or measuring cup. A jigger is a useful tool if you want to make clean cocktails with exact measurements. Think about it: a cocktail where you \"eyeball\" the amount of alcohol or the amount of mixer can turn out too strong or too weak. Many jiggers or measuring cups contain 2 sides, kind of like an hourglass. The small jigger usually holds 1  fl oz (30 mL) of liquid, while the bigger jigger holds 2  fl oz (59 mL). This makes pouring cocktails that require \"double\" shots much easier. Muddle your fruit or herbs in the cocktail shaker first, if applicable. Simply put the recommended amount of fruit and herbs in the bottom of your cocktail shaker and muddle with a muddler or the end of a wooden spoon. Make sure to get all the juices out of the fruit and break it up sufficiently. Some recipes won't call for muddled fruits, but many will. A mojito, for example, calls for muddled limes and mint to begin with. Add the juices, alcohols, and liqueurs into the cocktail shaker. As directed by your recipe, add the required liquids to your cocktail shaker. Put in the ice after adding the liquids. Add ice once you're ready to shake so that you don't dilute the cocktail unnecessarily. This is a mistake that many people make. They put the ice in at the beginning instead of the end, thereby diluting their drink. Close the cap to the cocktail shaker and shake vigorously. This can take anywhere from 10 to 20 seconds, or until the shaker is too cold to hold. Vigorous shaking will combine all the ingredients in the drink together, blending them so that you don't taste an overwhelming amount of juice and not alcohol, or vice versa. If you plan on salting or sugaring the rim of your glass — for a margarita, for example — do it now, before you pour the drink. Dip the glass into a shallow dish full of water, then dip it in a shallow dish of salt, sugar, or whatever is appropriate for your drink. Strain the drink into the appropriate vessel. Different drinks call for different glasses. A martini, for example, is always served in a martini glass, whereas a mojito is usually served in a highball glass. Take the time to find which vessel is best for your cocktail. You may think it's a bunch of hogwash, but there are plenty of people who think that choosing the right glass is what sets a good drink apart from a great one. Also, the glass affects the appearance, which influences your perception of its taste. If your cocktail calls for ice to be added after you've shaken it, add fresh ice cubes instead of the ice cubes used while shaking. Fresh ice cubes are larger, meaning they won't melt as quickly, diluting your drink. Add bitters to your drink, if applicable. Bitters are aromatic flavorings added to many (usually whiskey) drinks after mixing. Probably the most famous bitters mix is Angostura bitters. Finish with a garnish to your drink. The garnish you choose should be suitable for your cocktail. An olive on a skewer, for example, traditionally goes with a martini. Five Classic Cocktails Make a martini. Sleek and sophisticated — and seriously boozy — this cocktail is the epitome of class. Classic martinis come with either gin or vodka, and have the option of being made \"dirty,\" or with added olive juice. Chocolate martini\nStrawberry martini\nEggnog martini\nKey lime martini Make a mojito. Popularized in the Americas by none other than Ernest Hemingway, this summery drink is the class of the tropics. Lime, mint, rum, sugar, and fizzy water — how can you go wrong with that? Strawberry mojito\nMango mojito\nBlueberry mojito\nPineapple mojito Make a mint julep. A classic American southern tradition, the mint julep is simple but sophisticated. Drink this during Derby weekend and you'll feel like you're in Kentucky no matter where you are. Make a margarita. Margaritas are the quintessential Mexican cocktail. Made with lime juice, tequila, orange liqueur, and a bit of sugar, they are usually served straight-up, although they can also be blended. Orange margaritas\nStrawberry margaritas\nFrozen margaritas\nBanana margaritas Make an old fashioned. The old fashioned is a boozy cocktail — only bourbon and syrup stand between it and your tummy. Although the old fashioned has seemingly fallen out of fashion since its heyday in the '20s and '30s, it remains a go-to for many cocktail drinkers.",
  "tyn_model":[
    "cocktail shaker",
    "spirits",
    "gin",
    "beer",
    "sugar",
    "ice",
    "alcohol",
    "tequila",
    "ice cubes",
    "bitters",
    "vodka",
    "whiskeys",
    "whiskey",
    "bourbon",
    "lemon",
    "red wine",
    "jigger",
    "fruit",
    "mint",
    "shallow dish",
    "martini",
    "lime",
    "mint julep",
    "old fashioned",
    "liquor",
    "soju",
    "scotch",
    "rye",
    "cocktail",
    "mezcal",
    "absinthe",
    "brandy",
    "ouzo",
    "lemonade",
    "wine",
    "cola",
    "french 75",
    "sparkling wine",
    "distilled spirits",
    "simple syrup",
    "sour mix",
    "mixer",
    "wooden spoon",
    "limes",
    "liqueurs",
    "— for",
    "— do",
    "water",
    "salt",
    "martini glass",
    "glass",
    "angostura bitters",
    "olive",
    "— and",
    "— this",
    "eggnog martini",
    "key lime",
    "fizzy water",
    "— how",
    "margarita",
    "margaritas",
    "orange liqueur",
    "— only",
    "syrup"
  ],
  "tyn_section":[

  ]
}