{
  "title":"How to Make Chocolate Mice",
  "url":"https://www.wikihow.com/Make-Chocolate-Mice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Making Chocolate"
  ],
  "steps":[
    {
      "headline":"Rinse off maraschino cherries.",
      "description":"Set a dry paper towel on a small plate to let the cherries sit and dry."
    },
    {
      "headline":"Lay a sheet of wax paper on top of the cookie pan, covering the cookie pan.",
      "description":""
    },
    {
      "headline":"Open and lay out the York patties.",
      "description":"You will need one York bar for every one cherry you plan to use. Start with a small amount of York bars, if you plan on making many mice."
    },
    {
      "headline":"Unwrap the Hershey Kisses and set them aside in a bowl or small plate.",
      "description":"The amount of Hershey Kisses and York patties you have laid out should be the same."
    },
    {
      "headline":"Open the almond slices, and select two (2) large almond slices for every one Hershey Kiss you have.",
      "description":""
    },
    {
      "headline":"Set the selected almond slices on a separate small plate or napkin.",
      "description":""
    },
    {
      "headline":"Heat the Candiquick.",
      "description":"The Candiquick comes in a microwave-safe container, but it is smart to put the package on a microwave-safe plate. Follow the directions on the package if heating the entire package. If you do not plan on using the entire Candiquick package in one sitting,  break the chocolate into however many squares of the chocolate you may need, and heat them up in a separate bowl, heating in fifteen (15) second intervals."
    },
    {
      "headline":"Take a tray or bowl slightly larger than the tray or bowl used to heat the chocolate, and fill 1/4 of it with hot water.",
      "description":"Carefully place the bowl with chocolate into the bowl with water. The hot water will keep the chocolate warm for a longer period of time."
    },
    {
      "headline":"Take a dry cherry, and dip it so that the entire cherry, except the stem, is covered with the chocolate.",
      "description":"Part of the chocolate may reach the base of the stem."
    },
    {
      "headline":"Place the cherry on the center of a York bar.",
      "description":"The stem should curve up to like a tail."
    },
    {
      "headline":"Use a spoon or fork to scoop some of the Candiquick and dip the base of the Hershey kiss.",
      "description":"You will only need a small amount to barely cover the base."
    },
    {
      "headline":"Take two (2) almond slices and stick them on the same side of the bottom of the kiss.",
      "description":"Let part of the almonds stick out, looking like ears."
    },
    {
      "headline":"Put the kiss on the cherry, almond slivers pointing up.",
      "description":"The kiss should look like the head, the almonds should look like the ears, and the cherry should be the body and tail. The York bar acts as the base for the mouse."
    },
    {
      "headline":"Repeat steps 8-12 until all of the York bars laid out have been completed.",
      "description":""
    },
    {
      "headline":"Place the cookie pan in the refrigerator for about five (5) minutes.",
      "description":"If you plan on making more mice, set up and prepare more ingredients."
    },
    {
      "headline":"After five (5) minutes, or until the chocolate has solidified, take out the pan.",
      "description":""
    },
    {
      "headline":"Put two small dots of white icing gel on the face so they look like eyes.",
      "description":"Put two (2) mini chocolate chips, one on each icing dot."
    },
    {
      "headline":"For a nose, put a small dot of pink icing gel on the tip of the Hershey kiss.",
      "description":""
    },
    {
      "headline":"If you are going to bring the mice to a party, you can individually \"wrap\" them by placing each one in a cupcake paper.",
      "description":""
    },
    {
      "headline":"Enjoy your chocolate mice!",
      "description":""
    }
  ],
  "text":" Rinse off maraschino cherries. Set a dry paper towel on a small plate to let the cherries sit and dry. Lay a sheet of wax paper on top of the cookie pan, covering the cookie pan.  Open and lay out the York patties. You will need one York bar for every one cherry you plan to use. Start with a small amount of York bars, if you plan on making many mice. Unwrap the Hershey Kisses and set them aside in a bowl or small plate. The amount of Hershey Kisses and York patties you have laid out should be the same. Open the almond slices, and select two (2) large almond slices for every one Hershey Kiss you have.  Set the selected almond slices on a separate small plate or napkin.  Heat the Candiquick. The Candiquick comes in a microwave-safe container, but it is smart to put the package on a microwave-safe plate. Follow the directions on the package if heating the entire package. If you do not plan on using the entire Candiquick package in one sitting,  break the chocolate into however many squares of the chocolate you may need, and heat them up in a separate bowl, heating in fifteen (15) second intervals. Take a tray or bowl slightly larger than the tray or bowl used to heat the chocolate, and fill 1/4 of it with hot water. Carefully place the bowl with chocolate into the bowl with water. The hot water will keep the chocolate warm for a longer period of time. Take a dry cherry, and dip it so that the entire cherry, except the stem, is covered with the chocolate. Part of the chocolate may reach the base of the stem. Place the cherry on the center of a York bar. The stem should curve up to like a tail. Use a spoon or fork to scoop some of the Candiquick and dip the base of the Hershey kiss. You will only need a small amount to barely cover the base. Take two (2) almond slices and stick them on the same side of the bottom of the kiss. Let part of the almonds stick out, looking like ears. Put the kiss on the cherry, almond slivers pointing up. The kiss should look like the head, the almonds should look like the ears, and the cherry should be the body and tail. The York bar acts as the base for the mouse. Repeat steps 8-12 until all of the York bars laid out have been completed.  Place the cookie pan in the refrigerator for about five (5) minutes. If you plan on making more mice, set up and prepare more ingredients. After five (5) minutes, or until the chocolate has solidified, take out the pan.  Put two small dots of white icing gel on the face so they look like eyes. Put two (2) mini chocolate chips, one on each icing dot. For a nose, put a small dot of pink icing gel on the tip of the Hershey kiss.  If you are going to bring the mice to a party, you can individually \"wrap\" them by placing each one in a cupcake paper.  Enjoy your chocolate mice! ",
  "tyn_model":[
    "chocolate",
    "bowl",
    "almond",
    "small plate",
    "cookie pan",
    "candiquick",
    "york bars",
    "hershey kisses",
    "tray",
    "water",
    "hershey kiss",
    "almonds",
    "maraschino cherries",
    "paper towel",
    "wax paper",
    "napkin",
    "hot water",
    "spoon",
    "fork",
    "cherry",
    "refrigerator",
    "white icing",
    "chocolate chips",
    "pink icing gel",
    "cupcake paper"
  ],
  "tyn_section":[

  ]
}