{
  "title":"How to Make Sugar Bread",
  "url":"https://www.wikihow.com/Make-Sugar-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 350ºF/180ºC and prepare your ingredients and tools.",
      "description":""
    },
    {
      "headline":"Put everything except the water into a bowl- flour, sugar, eggs and oil.",
      "description":"Be sure to sieve the flour and get rid of any clumps in the brown sugar."
    },
    {
      "headline":"Stir until smooth.",
      "description":"Be careful not to over-mix the dough but ensure it is relatively smooth."
    },
    {
      "headline":"Put the water in and stir until smooth again.",
      "description":""
    },
    {
      "headline":"Pour into a greased round pan.",
      "description":"You may want to create a circle of baking paper on the bottom and simply spray the sides with spray cooking oil."
    },
    {
      "headline":"Bake for 30 minutes.",
      "description":"Keep an eye out for when the bread becomes golden brown."
    },
    {
      "headline":"Take out of oven.",
      "description":""
    },
    {
      "headline":"Wait until cooled.",
      "description":""
    },
    {
      "headline":"Cut and enjoy!",
      "description":""
    }
  ],
  "text":" Preheat oven to 350ºF/180ºC and prepare your ingredients and tools.  Put everything except the water into a bowl- flour, sugar, eggs and oil. Be sure to sieve the flour and get rid of any clumps in the brown sugar. Stir until smooth. Be careful not to over-mix the dough but ensure it is relatively smooth. Put the water in and stir until smooth again.  Pour into a greased round pan. You may want to create a circle of baking paper on the bottom and simply spray the sides with spray cooking oil. Bake for 30 minutes. Keep an eye out for when the bread becomes golden brown. Take out of oven.  Wait until cooled.  Cut and enjoy! ",
  "tyn_model":[
    "oven",
    "water",
    "flour",
    "sugar",
    "eggs",
    "oil",
    "brown sugar",
    "spray cooking oil"
  ],
  "tyn_section":[

  ]
}