{
  "title":"How to Make Fake Rocks With Roof Sealant",
  "url":"https://www.wikihow.com/Make-Fake-Rocks-With-Roof-Sealant",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Landscaping",
    "Landscaping Rocks"
  ],
  "steps":[
    {
      "headline":"Purchase foam roof sealant (in a tube).",
      "description":""
    },
    {
      "headline":"Spray the foam into a circle on cardboard or poster board.",
      "description":"Keep the size that you want."
    },
    {
      "headline":"Start filling the circle in with the foam, then work the foam upward, to build a mound-like lump.",
      "description":""
    },
    {
      "headline":"Let it dry.",
      "description":""
    },
    {
      "headline":"Paint your rocks.",
      "description":"Purchase brown, black, and white paint, then sponge it onto your rock(s) using a sea sponge, found in arts and craft stores."
    },
    {
      "headline":"You can also paint the rocks using a series of layers of paint or by using an airbrush to apply subtle colors or shading.",
      "description":"When using spray bottles you will need to water down the paints to make sure that they will spray evenly. Repeat multiple layers of paint using this process and finish the final layer with a light misting of black to have incredibly real looking stones"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Purchase foam roof sealant (in a tube).  Spray the foam into a circle on cardboard or poster board. Keep the size that you want. Start filling the circle in with the foam, then work the foam upward, to build a mound-like lump.  Let it dry.  Paint your rocks. Purchase brown, black, and white paint, then sponge it onto your rock(s) using a sea sponge, found in arts and craft stores. You can also paint the rocks using a series of layers of paint or by using an airbrush to apply subtle colors or shading. When using spray bottles you will need to water down the paints to make sure that they will spray evenly. Repeat multiple layers of paint using this process and finish the final layer with a light misting of black to have incredibly real looking stones Finished. ",
  "tyn_model":[
    "paint",
    "foam",
    "sea sponge",
    "spray bottles",
    "paints"
  ],
  "tyn_section":[

  ]
}