{
  "title":"How to Redeem Your Nintendo Points Card on a Nintendo DSi",
  "url":"https://www.wikihow.com/Redeem-Your-Nintendo-Points-Card-on-a-Nintendo-DSi",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DSi"
  ],
  "steps":[
    {
      "headline":"Get a DSi, if you don't have one already.",
      "description":"You can find a DSi in almost every retail store."
    },
    {
      "headline":"Buy a Nintendo points card.",
      "description":"You can find a Nintendo points card in different stores. You can buy a 1000 points card, 2000 (not in Japan, Australia, or New Zealand), 3000 (not in Australia or New Zealand), and 5000 Nintendo points card (only in Japan)."
    },
    {
      "headline":"Now that you have a DSi and a Nintendo points card, turn on your DSi.",
      "description":"There's a power button on the inside of your DSi to turn it on."
    },
    {
      "headline":"You'll be at the DSi menu automatically.",
      "description":"On the DSi menu, go to Nintendo DSi Shop. You will need internet access to access the DSi Shop (get this on System Settings on your DSi Welcome menu)."
    },
    {
      "headline":"Wait for your DSi to connect to the Internet.",
      "description":"It should only take about 30 seconds to load."
    },
    {
      "headline":"Once your DSi has loaded and you're now at the Nintendo DSi shop, click on, \"Start Shopping.\"",
      "description":"You will see \"Start Shopping\" at the bottom of the Welcome Screen (the DSi shop main menu)."
    },
    {
      "headline":"Go to \"Add Nintendo DSi Points.\"",
      "description":""
    },
    {
      "headline":"Click on, \"Redeem Nintendo Points Card.\"",
      "description":"This is where you'll enter your code."
    },
    {
      "headline":"Enter the code that's on the back of your Points card.",
      "description":"It's a 16-digit number."
    },
    {
      "headline":"Once you have entered your code, you can go shopping and buy some downloads for your DSi!",
      "description":""
    }
  ],
  "text":" Get a DSi, if you don't have one already. You can find a DSi in almost every retail store. Buy a Nintendo points card. You can find a Nintendo points card in different stores. You can buy a 1000 points card, 2000 (not in Japan, Australia, or New Zealand), 3000 (not in Australia or New Zealand), and 5000 Nintendo points card (only in Japan). Now that you have a DSi and a Nintendo points card, turn on your DSi. There's a power button on the inside of your DSi to turn it on. You'll be at the DSi menu automatically. On the DSi menu, go to Nintendo DSi Shop. You will need internet access to access the DSi Shop (get this on System Settings on your DSi Welcome menu). Wait for your DSi to connect to the Internet. It should only take about 30 seconds to load. Once your DSi has loaded and you're now at the Nintendo DSi shop, click on, \"Start Shopping.\" You will see \"Start Shopping\" at the bottom of the Welcome Screen (the DSi shop main menu). Go to \"Add Nintendo DSi Points.\"  Click on, \"Redeem Nintendo Points Card.\" This is where you'll enter your code. Enter the code that's on the back of your Points card. It's a 16-digit number. Once you have entered your code, you can go shopping and buy some downloads for your DSi! ",
  "tyn_model":[
    "dsi",
    "nintendo points card",
    "nintendo dsi shop",
    "nintendo dsi points"
  ],
  "tyn_section":[

  ]
}