{
  "title":"How to Get Biome Keys in Terraria",
  "url":"https://www.wikihow.com/Get-Biome-Keys-in-Terraria",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Terraria"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Defeat Plantera.",
          "description":"When she dies, she drops a Temple Key. This is the main ingredient for crafting Biome Keys. There are five different types of Biome Chests, so if you want all the different treasures from them, you obviously need to defeat Plantera five times."
        },
        {
          "headline":"Defeat Skeletron Prime.",
          "description":"He drops Souls of Fright, and you need five Souls of Fright for each Biome Key."
        },
        {
          "headline":"Defeat The Destroyer.",
          "description":"You similarly need five Souls of Might, which he drops, for each Key. You can also defeat Lepus to get the Souls of Might. He only has a 1% chance of dropping it though."
        },
        {
          "headline":"Defeat the Twins.",
          "description":"You also need 5 Souls of Sight."
        }
      ]
    },
    {
      "name":"Drops",
      "steps":[
        {
          "headline":"Learn about the different Keys and Chests.",
          "description":"There are five Keys: Jungle, Corruption, Crimson, Frozen, and Hallowed. Each of the Keys opens these Chests: Jungle, Corruption, Crimson, Frozen, and Hallowed. The chests contain, in respective order, The Piranha Gun, The Scourge of the Corruptor, Vampire Knives, The Staff of the Frost Hydra, and The Rainbow Gun."
        },
        {
          "headline":"Understand that each Key can be dropped by enemies in their respective Biome.",
          "description":"For example, Frozen Keys drop in a Tundra Biome, Jungle Keys drop in a Jungle Biome, etc."
        },
        {
          "headline":"Kill enemies.",
          "description":"As mentioned above, each Key only has a 1/2500 chance of dropping, but look on the bright side. At least you'll have a lot of killing experience by the end of this. Placing down a Water Candle or drinking a Battle Potion increases the number of enemies spawned."
        },
        {
          "headline":"Make Hybrid Biomes.",
          "description":"You can do this by manually enhancing any natural Biome. For example, plant Hallowed Seeds near a Desert to make a Hallowed Desert. Plant Corrupt Seeds on a Floating Island to make a Corrupt Floating Island. In a Hybrid Biome, each enemy has a chance of dropping any type of Key."
        }
      ]
    },
    {
      "name":"Lepus",
      "steps":[
        {
          "headline":"Spawn Lepus.",
          "description":"Change your phone's date to Easter Time, kill Disaster Bunnies, and get collect their drop, the Suspicious Looking Egg. Use it to spawn Lepus."
        },
        {
          "headline":"Build an arena around Lepus when he spawns.",
          "description":"Make sure it's in a Biome that can produce Keys. Include around it:\nChests full of healing potions\nA room with the Nurse in it\nA Campfire"
        },
        {
          "headline":"Wait for Lepus to drop giant Suspicious Looking Eggs.",
          "description":"They spawn other Lepus, which can spawn other Lepus, while remaining easy to beat."
        }
      ]
    },
    {
      "name":"Events",
      "steps":[
        {
          "headline":"Use Events to get Biome Keys.",
          "description":"Choose a suitable Biome, equip any potions you may want, and spawn an Event. Your choices are:\nGoblin Army\nPirate Invasion\nBlood Moon\nFrost Legion\nSolar Eclipse\nPumpkin Moon\nFrost Moon"
        },
        {
          "headline":"Wait for a Goblin Army to spawn.",
          "description":"They spawn randomly."
        },
        {
          "headline":"Open a Present in Hardmode.",
          "description":"You have a 1/15 chance of receiving a Snow Globe, which spawns a Frost Legion. To get Presents, kill random enemies at Christmas time."
        },
        {
          "headline":"Wait for a Blood Moon.",
          "description":"They happen randomly at night."
        },
        {
          "headline":"Kill enemies until they drop the Pirate Map.",
          "description":"Use it to spawn a Pirate Invasion."
        },
        {
          "headline":"Explore Lizard Temples.",
          "description":"Open Chests until you find a Solar Tablet, which you can use to spawn the Solar Eclipse. Random enemies in the Underground Jungle (excluding Golem) drop Solar Tablet Fragments. Combine eight of these at an Orithchalum or Mythril Anvil to make a Solar Tablet. In the Mobile Version, Solar Eclipses occur randomly, and there are no Solar Tablets or Solar Tablet Fragments."
        },
        {
          "headline":"Summon a Pumpkin Moon with a Pumpkin Medallion.",
          "description":"Make it with thirty pumpkins, five Ectoplasms, and ten Hallowed Bars."
        },
        {
          "headline":"Summon the Frost Moon.",
          "description":"Use a Naughty Present at night to do so. The Naughty Present can be made using twenty Silk, five Ectoplasms, and five Souls of Fright."
        }
      ]
    },
    {
      "name":"Bosses",
      "steps":[
        {
          "headline":"Spawn the Eater of Worlds.",
          "description":"The Eater of Worlds has fifty body segments, and each segment counts as an enemy. Since it's easy to beat, this boss is great for binge battles. To spawn the Eater of Worlds, destroy three Shadow Orbs with any Hammer or make Worm Food with fifty Vile Powder and fifteen Rotten Chunks. The Eater of Worlds will (hopefully) get you the Corrupt Key."
        },
        {
          "headline":"Spawn the Brain of Cthulhu.",
          "description":"The Brain spawns large groups of enemies known as Creepers (that aren't green), which can drop the Crimson Key. The Brain can be summoned two ways: by the destruction of three Crimson Hearts, or via a Bloody Spine. On the Computer Version, make the Spine out of fifteen Vertebrae and thirty Vicious Powder. In the Mobile Version, just use fifteen Vertebrae."
        },
        {
          "headline":"Make your Keys.",
          "description":"In the Computer Version, combine the Key and five Souls of Fright, Sight, and  Might."
        },
        {
          "headline":"Head down to the Dungeon.",
          "description":""
        },
        {
          "headline":"Open the Biome Chests and behold the wondrous Sight!",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Defeat Plantera. When she dies, she drops a Temple Key. This is the main ingredient for crafting Biome Keys. There are five different types of Biome Chests, so if you want all the different treasures from them, you obviously need to defeat Plantera five times. Defeat Skeletron Prime. He drops Souls of Fright, and you need five Souls of Fright for each Biome Key. Defeat The Destroyer. You similarly need five Souls of Might, which he drops, for each Key. You can also defeat Lepus to get the Souls of Might. He only has a 1% chance of dropping it though. Defeat the Twins. You also need 5 Souls of Sight. Drops Learn about the different Keys and Chests. There are five Keys: Jungle, Corruption, Crimson, Frozen, and Hallowed. Each of the Keys opens these Chests: Jungle, Corruption, Crimson, Frozen, and Hallowed. The chests contain, in respective order, The Piranha Gun, The Scourge of the Corruptor, Vampire Knives, The Staff of the Frost Hydra, and The Rainbow Gun. Understand that each Key can be dropped by enemies in their respective Biome. For example, Frozen Keys drop in a Tundra Biome, Jungle Keys drop in a Jungle Biome, etc. Kill enemies. As mentioned above, each Key only has a 1/2500 chance of dropping, but look on the bright side. At least you'll have a lot of killing experience by the end of this. Placing down a Water Candle or drinking a Battle Potion increases the number of enemies spawned. Make Hybrid Biomes. You can do this by manually enhancing any natural Biome. For example, plant Hallowed Seeds near a Desert to make a Hallowed Desert. Plant Corrupt Seeds on a Floating Island to make a Corrupt Floating Island. In a Hybrid Biome, each enemy has a chance of dropping any type of Key. Lepus Spawn Lepus. Change your phone's date to Easter Time, kill Disaster Bunnies, and get collect their drop, the Suspicious Looking Egg. Use it to spawn Lepus. Build an arena around Lepus when he spawns. Make sure it's in a Biome that can produce Keys. Include around it:\nChests full of healing potions\nA room with the Nurse in it\nA Campfire Wait for Lepus to drop giant Suspicious Looking Eggs. They spawn other Lepus, which can spawn other Lepus, while remaining easy to beat. Events Use Events to get Biome Keys. Choose a suitable Biome, equip any potions you may want, and spawn an Event. Your choices are:\nGoblin Army\nPirate Invasion\nBlood Moon\nFrost Legion\nSolar Eclipse\nPumpkin Moon\nFrost Moon Wait for a Goblin Army to spawn. They spawn randomly. Open a Present in Hardmode. You have a 1/15 chance of receiving a Snow Globe, which spawns a Frost Legion. To get Presents, kill random enemies at Christmas time. Wait for a Blood Moon. They happen randomly at night. Kill enemies until they drop the Pirate Map. Use it to spawn a Pirate Invasion. Explore Lizard Temples. Open Chests until you find a Solar Tablet, which you can use to spawn the Solar Eclipse. Random enemies in the Underground Jungle (excluding Golem) drop Solar Tablet Fragments. Combine eight of these at an Orithchalum or Mythril Anvil to make a Solar Tablet. In the Mobile Version, Solar Eclipses occur randomly, and there are no Solar Tablets or Solar Tablet Fragments. Summon a Pumpkin Moon with a Pumpkin Medallion. Make it with thirty pumpkins, five Ectoplasms, and ten Hallowed Bars. Summon the Frost Moon. Use a Naughty Present at night to do so. The Naughty Present can be made using twenty Silk, five Ectoplasms, and five Souls of Fright. Bosses Spawn the Eater of Worlds. The Eater of Worlds has fifty body segments, and each segment counts as an enemy. Since it's easy to beat, this boss is great for binge battles. To spawn the Eater of Worlds, destroy three Shadow Orbs with any Hammer or make Worm Food with fifty Vile Powder and fifteen Rotten Chunks. The Eater of Worlds will (hopefully) get you the Corrupt Key. Spawn the Brain of Cthulhu. The Brain spawns large groups of enemies known as Creepers (that aren't green), which can drop the Crimson Key. The Brain can be summoned two ways: by the destruction of three Crimson Hearts, or via a Bloody Spine. On the Computer Version, make the Spine out of fifteen Vertebrae and thirty Vicious Powder. In the Mobile Version, just use fifteen Vertebrae. Make your Keys. In the Computer Version, combine the Key and five Souls of Fright, Sight, and  Might. Head down to the Dungeon.  Open the Biome Chests and behold the wondrous Sight! ",
  "tyn_model":[
    "plantera",
    "lepus",
    "crimson",
    "solar tablet",
    "skeletron",
    "frozen",
    "piranha gun",
    "vampire knives",
    "rainbow gun",
    "water candle",
    "battle potion",
    "seeds",
    "phone",
    "campfire",
    "goblin",
    "present",
    "snow globe",
    "frost legion",
    "presents",
    "chests",
    "golem",
    "mythril anvil",
    "solar tablets",
    "pumpkin medallion",
    "pumpkins",
    "silk",
    "hammer",
    "worm food",
    "vile powder",
    "cthulhu",
    "crimson key",
    "bloody spine",
    "vicious powder",
    "biome chests"
  ],
  "tyn_section":[

  ]
}