{
  "title":"How to Play SimCity Creator DS",
  "url":"https://www.wikihow.com/Play-SimCity-Creator-DS",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS"
  ],
  "steps":[
    {
      "headline":".",
      "description":"]]To begin freeplay mode, you need to scroll until you find freeplay on the start screen."
    },
    {
      "headline":"Select the \"New Game\" button and click on the one next to the last.",
      "description":"This is the \"Global Warming Age\", which is present time. If you want to play in a different age, use challenge mode to unlock them."
    },
    {
      "headline":"Build a power plant.",
      "description":"Don't buy a real expensive plant, such as geotherm or nuclear! A good coal plant should do. Place it in a corner to avoid over-pollution."
    },
    {
      "headline":"Build power lines to the center of the map.",
      "description":"Just run them down halfway, then change direction so they reach the middle."
    },
    {
      "headline":"Zone some houses.",
      "description":"LD Residential is what you need to start out with."
    },
    {
      "headline":"Build roads around the city!",
      "description":""
    },
    {
      "headline":"Build a school close to the houses.",
      "description":"A school will increase the Sims' desire to live in the city and decrease crime a bit."
    },
    {
      "headline":"Build a hospital close to the houses.",
      "description":"A hospital will also increase the Sims' desire to live in the city. It also decreases crime."
    },
    {
      "headline":"Build police and fire stations.",
      "description":"They will almost completely stop the trouble of fires and riots."
    },
    {
      "headline":"Provide water to the city.",
      "description":"A water tower will suffice."
    },
    {
      "headline":"Build a casino.",
      "description":"It is very hard to develop your city without a casino because of police and fire funding. It brings in 500$ per month."
    },
    {
      "headline":"Zone commercial zones, these will give your Sims places to buy the goods they need to survive.",
      "description":""
    },
    {
      "headline":"Zone industrial zones and farms.",
      "description":"Farms are industrial zones, just not as nasty. Pollution will wreak havoc on your city if you build industrial zones too close to the city. Industrial zones will develop almost anytime."
    },
    {
      "headline":"Build parks around the houses.",
      "description":"Not only will they cut down on pollution, but they will attract higher wealth buildings."
    },
    {
      "headline":"As the city gets bigger, repeat these steps.",
      "description":""
    },
    {
      "headline":"When your population reaches 75,000, begin replacing your LD zones with MD.",
      "description":"Bigger buildings will appear if you have enough parks. Be sure to save MD areas from pollution."
    },
    {
      "headline":"Repeat the steps.",
      "description":""
    },
    {
      "headline":"When your population reaches 250,000, which is possible, start replacing MD with HD.",
      "description":"This will boost your population real high. At this time, replace your farms with industry."
    }
  ],
  "text":" . ]]To begin freeplay mode, you need to scroll until you find freeplay on the start screen. Select the \"New Game\" button and click on the one next to the last. This is the \"Global Warming Age\", which is present time. If you want to play in a different age, use challenge mode to unlock them. Build a power plant. Don't buy a real expensive plant, such as geotherm or nuclear! A good coal plant should do. Place it in a corner to avoid over-pollution. Build power lines to the center of the map. Just run them down halfway, then change direction so they reach the middle. Zone some houses. LD Residential is what you need to start out with. Build roads around the city!  Build a school close to the houses. A school will increase the Sims' desire to live in the city and decrease crime a bit. Build a hospital close to the houses. A hospital will also increase the Sims' desire to live in the city. It also decreases crime. Build police and fire stations. They will almost completely stop the trouble of fires and riots. Provide water to the city. A water tower will suffice. Build a casino. It is very hard to develop your city without a casino because of police and fire funding. It brings in 500$ per month. Zone commercial zones, these will give your Sims places to buy the goods they need to survive.  Zone industrial zones and farms. Farms are industrial zones, just not as nasty. Pollution will wreak havoc on your city if you build industrial zones too close to the city. Industrial zones will develop almost anytime. Build parks around the houses. Not only will they cut down on pollution, but they will attract higher wealth buildings. As the city gets bigger, repeat these steps.  When your population reaches 75,000, begin replacing your LD zones with MD. Bigger buildings will appear if you have enough parks. Be sure to save MD areas from pollution. Repeat the steps.  When your population reaches 250,000, which is possible, start replacing MD with HD. This will boost your population real high. At this time, replace your farms with industry.",
  "tyn_model":[
    "hospital",
    "water",
    "industrial zones"
  ],
  "tyn_section":[

  ]
}