{
  "title":"How to Clean an Easy Bake Oven",
  "url":"https://www.wikihow.com/Clean-an-Easy-Bake-Oven",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Preparing Your Oven for Cleaning",
      "steps":[
        {
          "headline":"Turn off the Easy Bake Oven before you clean it.",
          "description":"You will use solutions that include water, so it is critically important that the oven is not on or near any electrical source. If you are a child, do not try to clean the Easy Bake Oven by yourself. Ask a parent or other adult to help you do it. Easy Bake Ovens are recommended for children over 8. Never, ever use a plugged in oven around water."
        },
        {
          "headline":"Gather the items you need to clean the Easy Bake Oven.",
          "description":"Put the oven on a towel when cleaning it so you don’t get the floor wet. You might want to clean it outside on a patio or sidewalk. Don’t forget to clean the other parts of the oven, such as the spatula, cupcake pan, and baking pan. The toymaker recommends that you hand-wash and dry all pans and tools before using them for the first time and after baking. The Easy Bake Oven works by putting baking mix on a tray you insert with a plastic spatula into the baking compartment on the side of the oven."
        },
        {
          "headline":"Keep the Easy Bake Oven intact.",
          "description":"You probably won’t need to take the oven apart for cleaning. In fact, most pieces of the oven are not supposed to be removed. Instead, try covering the baking pan with aluminum foil when baking to reduce the chances of spills. You can’t use a regular screwdriver to take apart the Easy Bake Oven. You do use a standard Phillips screwdriver to take off the panel at the bottom of the oven in order to change the lightbulb. The other parts of the oven are not designed to be removed. That’s why the screws won’t work with most common household screwdrivers. You would need a specialized screw driver to take the other pieces of the oven apart."
        }
      ]
    },
    {
      "name":"Cleaning Your Oven",
      "steps":[
        {
          "headline":"Take tissues or rags.",
          "description":"You need to gather something to use when wiping the oven. There are many different things you can use to wipe off an Easy Bake Oven. Easy Bake Ovens can be cleaned with basic tissues. Or you could use a dry washcloth, paper towels or other rag. You might need a long, thin tool to reach inside the baking compartment to knock off crusted food. Then you could turn the oven upside down to shake it out. You could use a chopstick for this purpose. You could also use a Q-tip to reach into the oven to dislodge any chunks of food inside it."
        },
        {
          "headline":"Use a dab of dish soap to clean the oven.",
          "description":"You can easily clean an Easy Bake Oven with a little bit of water and a dash of soap. You don’t need much soap or water to clean an Easy Bake Oven. It’s not like a conventional oven. Don’t douse the oven with water! Instead you want to lightly apply the cleaning solution to the rag or tissue. Or take some dish soap, and mix it with window/glass cleaner. Then dab this concoction onto your rag or tissue. You could try soap and water first, but if you’ve got tougher stains or old food stuck in the oven, you might want to try the other approach. Take a wet towel, adding a little amount of dishwasher gel. Or add soap suds to the cloth. Wipe the inside and outside of the oven. Repeat this several times."
        },
        {
          "headline":"Use laundry detergent on the oven.",
          "description":"Cleaning the bottom of the Easy Bake Oven is easy. Soak it in diluted laundry detergent that you mix with a dash of water, and then spread out in a wet paste. Leave the wet paste on the bottom of the oven for a couple of hours, depending on how greasy and dirty it is. Spray the oven with the same mix diluted to spray or with 20 Mule Team Borax, which can also be used in place of laundry detergent. Be sure to rinse well. You could also try using Clorox wipes. Clorox wipes are great to clean with, as well as magic erasers."
        },
        {
          "headline":"Use white vinegar to clean the oven.",
          "description":"If you desire a chemical-free option, replace the dish soap with white vinegar in an equal mix with water. Spray the vinegar. Put a little vinegar in a spray bottle and spritz everywhere. Another chemical-free option is to use lemon juice to clean the oven. Lemon juice will make it smell good and, if you add a bit liquid soap to the lemon juice, it will help to remove stains."
        },
        {
          "headline":"Try oven cleaner.",
          "description":"Only adults should use this. Spray the oven cleaner by holding it a little ways away from the oven. You don’t want to get it in your eyes. Leave the oven cleaner for 25-30 minutes. Then, simply wipe the cleaner off your oven, and it should be clean. Or make a baking soda paste. In a small bowl, mix 1/2 cup of baking soda with a few tablespoons of water. Adjust the ratio of both as needed until you have a spreadable paste. Coat your oven. Spread the paste all over the interior surfaces of the Easy Bake Oven. Let it sit overnight, and then wipe it clean."
        }
      ]
    },
    {
      "name":"Completing the Cleaning Process",
      "steps":[
        {
          "headline":"Wipe away the soap residue with clear water.",
          "description":"Dip a clean rag into hot water, and wipe off the Easy Bake Oven. The goal is to remove any soapy residue from the oven. You may need to repeat this process several times, rinsing out your rag each time. Stop when you see no remaining streaks of detergent, soap, or any other cleaning product that you used on the oven."
        },
        {
          "headline":"Dry the Easy Bake Oven.",
          "description":"Once you’ve wiped the oven with the soapy mixture, and cleaned it off with the water, you need to dry the oven. Wipe the oven with a dry towel to remove the moisture. You could also use paper towels to dry off the oven. Remember to dry both the outside and the inside of the Easy Bake Oven. You could also use a dry rag. If you live in a warm climate, you could let it sit outside for a time to dry it."
        }
      ]
    }
  ],
  "text":" Preparing Your Oven for Cleaning Turn off the Easy Bake Oven before you clean it. You will use solutions that include water, so it is critically important that the oven is not on or near any electrical source. If you are a child, do not try to clean the Easy Bake Oven by yourself. Ask a parent or other adult to help you do it. Easy Bake Ovens are recommended for children over 8. Never, ever use a plugged in oven around water. Gather the items you need to clean the Easy Bake Oven. Put the oven on a towel when cleaning it so you don’t get the floor wet. You might want to clean it outside on a patio or sidewalk. Don’t forget to clean the other parts of the oven, such as the spatula, cupcake pan, and baking pan. The toymaker recommends that you hand-wash and dry all pans and tools before using them for the first time and after baking. The Easy Bake Oven works by putting baking mix on a tray you insert with a plastic spatula into the baking compartment on the side of the oven. Keep the Easy Bake Oven intact. You probably won’t need to take the oven apart for cleaning. In fact, most pieces of the oven are not supposed to be removed. Instead, try covering the baking pan with aluminum foil when baking to reduce the chances of spills. You can’t use a regular screwdriver to take apart the Easy Bake Oven. You do use a standard Phillips screwdriver to take off the panel at the bottom of the oven in order to change the lightbulb. The other parts of the oven are not designed to be removed. That’s why the screws won’t work with most common household screwdrivers. You would need a specialized screw driver to take the other pieces of the oven apart. Cleaning Your Oven Take tissues or rags. You need to gather something to use when wiping the oven. There are many different things you can use to wipe off an Easy Bake Oven. Easy Bake Ovens can be cleaned with basic tissues. Or you could use a dry washcloth, paper towels or other rag. You might need a long, thin tool to reach inside the baking compartment to knock off crusted food. Then you could turn the oven upside down to shake it out. You could use a chopstick for this purpose. You could also use a Q-tip to reach into the oven to dislodge any chunks of food inside it. Use a dab of dish soap to clean the oven. You can easily clean an Easy Bake Oven with a little bit of water and a dash of soap. You don’t need much soap or water to clean an Easy Bake Oven. It’s not like a conventional oven. Don’t douse the oven with water! Instead you want to lightly apply the cleaning solution to the rag or tissue. Or take some dish soap, and mix it with window/glass cleaner. Then dab this concoction onto your rag or tissue. You could try soap and water first, but if you’ve got tougher stains or old food stuck in the oven, you might want to try the other approach. Take a wet towel, adding a little amount of dishwasher gel. Or add soap suds to the cloth. Wipe the inside and outside of the oven. Repeat this several times. Use laundry detergent on the oven. Cleaning the bottom of the Easy Bake Oven is easy. Soak it in diluted laundry detergent that you mix with a dash of water, and then spread out in a wet paste. Leave the wet paste on the bottom of the oven for a couple of hours, depending on how greasy and dirty it is. Spray the oven with the same mix diluted to spray or with 20 Mule Team Borax, which can also be used in place of laundry detergent. Be sure to rinse well. You could also try using Clorox wipes. Clorox wipes are great to clean with, as well as magic erasers. Use white vinegar to clean the oven. If you desire a chemical-free option, replace the dish soap with white vinegar in an equal mix with water. Spray the vinegar. Put a little vinegar in a spray bottle and spritz everywhere. Another chemical-free option is to use lemon juice to clean the oven. Lemon juice will make it smell good and, if you add a bit liquid soap to the lemon juice, it will help to remove stains. Try oven cleaner. Only adults should use this. Spray the oven cleaner by holding it a little ways away from the oven. You don’t want to get it in your eyes. Leave the oven cleaner for 25-30 minutes. Then, simply wipe the cleaner off your oven, and it should be clean. Or make a baking soda paste. In a small bowl, mix 1/2 cup of baking soda with a few tablespoons of water. Adjust the ratio of both as needed until you have a spreadable paste. Coat your oven. Spread the paste all over the interior surfaces of the Easy Bake Oven. Let it sit overnight, and then wipe it clean. Completing the Cleaning Process Wipe away the soap residue with clear water. Dip a clean rag into hot water, and wipe off the Easy Bake Oven. The goal is to remove any soapy residue from the oven. You may need to repeat this process several times, rinsing out your rag each time. Stop when you see no remaining streaks of detergent, soap, or any other cleaning product that you used on the oven. Dry the Easy Bake Oven. Once you’ve wiped the oven with the soapy mixture, and cleaned it off with the water, you need to dry the oven. Wipe the oven with a dry towel to remove the moisture. You could also use paper towels to dry off the oven. Remember to dry both the outside and the inside of the Easy Bake Oven. You could also use a dry rag. If you live in a warm climate, you could let it sit outside for a time to dry it.",
  "tyn_model":[
    "oven",
    "easy bake oven",
    "water",
    "soap",
    "laundry detergent",
    "lemon juice",
    "oven cleaner",
    "easy bake ovens",
    "spatula",
    "baking pan",
    "paper towels",
    "dish soap",
    "clorox wipes",
    "white vinegar",
    "vinegar",
    "baking soda",
    "cupcake pan",
    "toymaker recommends",
    "baking mix",
    "aluminum foil",
    "screwdriver",
    "screw driver",
    "tissues",
    "rags",
    "chopstick",
    "q-tip",
    "window/glass cleaner",
    "dishwasher gel",
    "soap suds",
    "20 mule team borax",
    "magic erasers",
    "spray bottle",
    "dry towel",
    "dry rag"
  ],
  "tyn_section":[

  ]
}