{
  "title":"How to Tie a Ring",
  "url":"https://www.wikihow.com/Tie-a-Ring",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Learn the terminology.",
      "description":"The bumps around the edge are called \"bights\". The strands making up the ring are \"leads\" (as in a dog lead, not the element lead [Pb]). This method produces a 2-lead, 5-bight ring, like the one in the picture. With minor adaptations, you can make rings that have 3 leads or 8 bights, but these require more line. The \"working end\" is the end of the line that you are using to make the ring."
    },
    {
      "headline":"Start by selecting a round object.",
      "description":"You may need to tie a few experimental rings to determine the right diameter. In general, a smaller object is better, as you can wrap paper around it to increase the diameter. An object that is too large cannot be made smaller."
    },
    {
      "headline":"Make 8 wraps around the object.",
      "description":"This is the amount of line that you will need."
    },
    {
      "headline":"Wrap the working end around the object once.",
      "description":""
    },
    {
      "headline":"Bring the working end down the back and up over the bottom right-hand strand.",
      "description":""
    },
    {
      "headline":"Rotate the object so that the top crossing is facing you.",
      "description":""
    },
    {
      "headline":"Bring the working end under the right-hand strand and over the left.",
      "description":""
    },
    {
      "headline":"Rotate again.",
      "description":""
    },
    {
      "headline":"Pass the left-hand strand (not the working end) over the top of the right-hand strand.",
      "description":""
    },
    {
      "headline":"Pass the working end under the new left-hand strand and over the new right-hand strand.",
      "description":""
    },
    {
      "headline":"Rotate again.",
      "description":""
    },
    {
      "headline":"Pass the right-hand strand over the top of the left-hand strand.",
      "description":""
    },
    {
      "headline":"Pass the working end under the new right-hand strand and over the new left-hand strand.",
      "description":""
    },
    {
      "headline":"Thread the line along the pattern once more to create the second lead.",
      "description":"At this stage, if desired, you can thread the line along the pattern again to make a third lead, or add a bead to the ring."
    },
    {
      "headline":"Starting at the working end, carefully pull the line back through the knot, away from the working end, until the end is about 2 inches (5 cm) long.",
      "description":"At each stage, pull tightly to tighten up the ring. Keep going until you reach the standing part (the part not used in the ring)"
    },
    {
      "headline":"Tie the working end and standing part together.",
      "description":"Make this knot as close to the ring as you can. A reef knot works very well. Add a dab of superglue to this knot to hold it in place."
    },
    {
      "headline":"Cut off the standing part and slide the ring off the end of the object.",
      "description":"Finished!"
    }
  ],
  "text":" Learn the terminology. The bumps around the edge are called \"bights\". The strands making up the ring are \"leads\" (as in a dog lead, not the element lead [Pb]). This method produces a 2-lead, 5-bight ring, like the one in the picture. With minor adaptations, you can make rings that have 3 leads or 8 bights, but these require more line. The \"working end\" is the end of the line that you are using to make the ring. Start by selecting a round object. You may need to tie a few experimental rings to determine the right diameter. In general, a smaller object is better, as you can wrap paper around it to increase the diameter. An object that is too large cannot be made smaller. Make 8 wraps around the object. This is the amount of line that you will need. Wrap the working end around the object once.  Bring the working end down the back and up over the bottom right-hand strand.  Rotate the object so that the top crossing is facing you.  Bring the working end under the right-hand strand and over the left.  Rotate again.  Pass the left-hand strand (not the working end) over the top of the right-hand strand.  Pass the working end under the new left-hand strand and over the new right-hand strand.  Rotate again.  Pass the right-hand strand over the top of the left-hand strand.  Pass the working end under the new right-hand strand and over the new left-hand strand.  Thread the line along the pattern once more to create the second lead. At this stage, if desired, you can thread the line along the pattern again to make a third lead, or add a bead to the ring. Starting at the working end, carefully pull the line back through the knot, away from the working end, until the end is about 2 inches (5 cm) long. At each stage, pull tightly to tighten up the ring. Keep going until you reach the standing part (the part not used in the ring) Tie the working end and standing part together. Make this knot as close to the ring as you can. A reef knot works very well. Add a dab of superglue to this knot to hold it in place. Cut off the standing part and slide the ring off the end of the object. Finished!",
  "tyn_model":[
    "line",
    "paper",
    "rotate",
    "thread",
    "superglue",
    "ring"
  ],
  "tyn_section":[

  ]
}