{
  "title":"How to Make a Turkey and Cheese Sandwich",
  "url":"https://www.wikihow.com/Make-a-Turkey-and-Cheese-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Meat and Poultry Sandwiches"
  ],
  "steps":[
    {
      "headline":"Mix the Dijon mustard with the butter in a small bowl.",
      "description":"Set aside."
    },
    {
      "headline":"Spread the Miracle Whip or other spread in a thin layer on each piece of bread.",
      "description":""
    },
    {
      "headline":"On one piece of bread, lay down the cheddar cheese.",
      "description":"If you desire, sprinkle the shredded cheese on top."
    },
    {
      "headline":"On the other piece, put on the piece of turkey.",
      "description":"Spread a little bit of Miracle Whip on top of the turkey."
    },
    {
      "headline":"Combine the slices of bread.",
      "description":""
    },
    {
      "headline":"Spread some of the mustard and butter mixture on the upward facing side of the sandwich.",
      "description":""
    },
    {
      "headline":"Place the side with the mustard-butter mixture in the bottom of a pan on the stove.",
      "description":"The stove temperature of the stove should be on medium heat. The un-buttered side should be facing up. Spread some of the mustard and butter mixture on that side."
    },
    {
      "headline":"Place the glass top of the pan on top of the sandwich.",
      "description":"Cook for 2-4 minutes, 4 if you like it brown."
    },
    {
      "headline":"Flip the sandwich and repeat step 10.",
      "description":""
    },
    {
      "headline":"Remove the sandwich from the pan and cut diagonally.",
      "description":"Let it cool off a bit before enjoying the gooey goodness of quality ingredients and some little clever secrets! !"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Mix the Dijon mustard with the butter in a small bowl. Set aside. Spread the Miracle Whip or other spread in a thin layer on each piece of bread.  On one piece of bread, lay down the cheddar cheese. If you desire, sprinkle the shredded cheese on top. On the other piece, put on the piece of turkey. Spread a little bit of Miracle Whip on top of the turkey. Combine the slices of bread.  Spread some of the mustard and butter mixture on the upward facing side of the sandwich.  Place the side with the mustard-butter mixture in the bottom of a pan on the stove. The stove temperature of the stove should be on medium heat. The un-buttered side should be facing up. Spread some of the mustard and butter mixture on that side. Place the glass top of the pan on top of the sandwich. Cook for 2-4 minutes, 4 if you like it brown. Flip the sandwich and repeat step 10.  Remove the sandwich from the pan and cut diagonally. Let it cool off a bit before enjoying the gooey goodness of quality ingredients and some little clever secrets! ! Finished. ",
  "tyn_model":[
    "butter",
    "pan",
    "miracle whip",
    "mustard",
    "stove",
    "dijon mustard",
    "small bowl",
    "shredded cheese",
    "turkey",
    "mustard-"
  ],
  "tyn_section":[

  ]
}