{
  "title":"How to Get Minecraft on the PS3",
  "url":"https://www.wikihow.com/Get-Minecraft-on-the-PS3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 3"
  ],
  "methods":[
    {
      "name":"Purchasing the Disc",
      "steps":[
        {
          "headline":"Visit any video game retail store.",
          "description":"Minecraft for the PS3 is available from most video game retail stores, including GameStop, Walmart, and Best Buy, as well as online retailers such as Amazon and Newegg."
        },
        {
          "headline":"Purchase the disc version of Minecraft for the PS3.",
          "description":"The game usually retails for between $15 and $20, but prices are subject to change based on the retailer."
        },
        {
          "headline":"Power on your PS3 console and insert the Minecraft disc into the disc drive.",
          "description":"Your PS3 will automatically detect the new disc and begin the installation process, which takes between two and 10 minutes to complete. The console installs a small percentage of game files to allow for faster loading times during gameplay."
        },
        {
          "headline":"Confirm the Minecraft disc is inserted into your console’s disc drive whenever you want to play the game.",
          "description":"Your PS3 will not launch Minecraft unless the disc is installed."
        }
      ]
    },
    {
      "name":"Purchasing from PlayStation Network",
      "steps":[
        {
          "headline":"Confirm your PS3 is connected to your Internet network.",
          "description":"Accessing the PlayStation Network (PSN) on your PS3 requires an Internet connection. Establish a wired connection using an Ethernet cable, or go to Settings > Network Settings to enter your wireless network credentials."
        },
        {
          "headline":"Power on your PS3 console and scroll to “PlayStation Network.”",
          "description":""
        },
        {
          "headline":"Scroll down and select “PlayStation Store.”",
          "description":""
        },
        {
          "headline":"Select “Sign In,” then enter your PSN login credentials.",
          "description":"Sign up for PSN using these steps if you don’t already have an account."
        },
        {
          "headline":"Type “Minecraft” into the search field using your PS3 controller.",
          "description":""
        },
        {
          "headline":"Select “Minecraft” from search results.",
          "description":"This displays more information about the game, including its price and required storage space."
        },
        {
          "headline":"Select “Add to Cart,” then select “View Cart.”",
          "description":""
        },
        {
          "headline":"Select “Proceed to Checkout,” then select “Confirm Purchase.” The purchase amount for Minecraft will be subtracted from funds in your PSN wallet, and you’ll receive a confirmation message at the email address associated with your PSN account.",
          "description":""
        },
        {
          "headline":"Select where you want Minecraft saved on your PS3 console.",
          "description":"You can choose “System Storage” or “Memory Stick” media, based on your preferences. PSN will now install Minecraft on your PS3 console. When complete, Minecraft can be launched from the “Games” menu."
        }
      ]
    },
    {
      "name":"Troubleshooting",
      "steps":[
        {
          "headline":"Free up storage space on your PS3 if Minecraft fails to download completely to your console.",
          "description":"Sony recommends that users have at least twice the amount of required space available before downloading games. Required storage space for Minecraft is displayed on the details screen at the time of purchase. Navigate to Game > Game Data Utility, then select the option to delete game data for games you no longer play. This frees up storage without deleting online stats and game progress."
        },
        {
          "headline":"Switch to using a wired Ethernet connection if your download gets stuck when installing Minecraft.",
          "description":"A wired connection is often faster and more reliable than wireless connections when installing games from PlayStation Store."
        },
        {
          "headline":"Try installing Minecraft on your PS3 at a later date if you continue experiencing connection or download errors.",
          "description":"In some cases, Minecraft will fail to download if PSN servers are temporarily down or busy."
        },
        {
          "headline":"Try cleaning your Minecraft game disc using water and a soft cloth if the game fails to launch in your PS3 console.",
          "description":"Dusty or dirty game discs will often fail to launch properly in your console."
        }
      ]
    }
  ],
  "text":" Purchasing the Disc Visit any video game retail store. Minecraft for the PS3 is available from most video game retail stores, including GameStop, Walmart, and Best Buy, as well as online retailers such as Amazon and Newegg. Purchase the disc version of Minecraft for the PS3. The game usually retails for between $15 and $20, but prices are subject to change based on the retailer. Power on your PS3 console and insert the Minecraft disc into the disc drive. Your PS3 will automatically detect the new disc and begin the installation process, which takes between two and 10 minutes to complete. The console installs a small percentage of game files to allow for faster loading times during gameplay. Confirm the Minecraft disc is inserted into your console’s disc drive whenever you want to play the game. Your PS3 will not launch Minecraft unless the disc is installed. Purchasing from PlayStation Network Confirm your PS3 is connected to your Internet network. Accessing the PlayStation Network (PSN) on your PS3 requires an Internet connection. Establish a wired connection using an Ethernet cable, or go to Settings > Network Settings to enter your wireless network credentials. Power on your PS3 console and scroll to “PlayStation Network.”  Scroll down and select “PlayStation Store.”  Select “Sign In,” then enter your PSN login credentials. Sign up for PSN using these steps if you don’t already have an account. Type “Minecraft” into the search field using your PS3 controller.  Select “Minecraft” from search results. This displays more information about the game, including its price and required storage space. Select “Add to Cart,” then select “View Cart.”  Select “Proceed to Checkout,” then select “Confirm Purchase.” The purchase amount for Minecraft will be subtracted from funds in your PSN wallet, and you’ll receive a confirmation message at the email address associated with your PSN account.  Select where you want Minecraft saved on your PS3 console. You can choose “System Storage” or “Memory Stick” media, based on your preferences. PSN will now install Minecraft on your PS3 console. When complete, Minecraft can be launched from the “Games” menu. Troubleshooting Free up storage space on your PS3 if Minecraft fails to download completely to your console. Sony recommends that users have at least twice the amount of required space available before downloading games. Required storage space for Minecraft is displayed on the details screen at the time of purchase. Navigate to Game > Game Data Utility, then select the option to delete game data for games you no longer play. This frees up storage without deleting online stats and game progress. Switch to using a wired Ethernet connection if your download gets stuck when installing Minecraft. A wired connection is often faster and more reliable than wireless connections when installing games from PlayStation Store. Try installing Minecraft on your PS3 at a later date if you continue experiencing connection or download errors. In some cases, Minecraft will fail to download if PSN servers are temporarily down or busy. Try cleaning your Minecraft game disc using water and a soft cloth if the game fails to launch in your PS3 console. Dusty or dirty game discs will often fail to launch properly in your console.",
  "tyn_model":[
    "minecraft",
    "”  ",
    "” then",
    "video game retail",
    "ps3",
    "playstation network",
    "“playstation",
    "“minecraft",
    "“sign",
    "” into",
    "ps3 controller",
    "” from",
    "“add",
    "“view",
    "“proceed",
    "“confirm",
    "” the",
    "psn wallet",
    "“system",
    "” or",
    "“memory",
    "” media",
    "“games",
    "” menu",
    "playstation store",
    "water"
  ],
  "tyn_section":[

  ]
}