{
  "title":"How to Make Creamy Hot Chocolate from Scratch",
  "url":"https://www.wikihow.com/Make-Creamy-Hot-Chocolate-from-Scratch",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Chocolate and Cocoa Drinks"
  ],
  "steps":[
    {
      "headline":"Gather ingredients.",
      "description":""
    },
    {
      "headline":"Melt butter in the pan.",
      "description":""
    },
    {
      "headline":"Break up the chocolate and melt on a low heat in a saucepan, stirring occasionally to prevent chocolate sticking to the bottom of the pot.",
      "description":""
    },
    {
      "headline":"Meanwhile heat the milk in the microwave, but do not let it boil.",
      "description":"If you don't like using the microwave, just heat it up on the stove (in another saucepan, of course! )."
    },
    {
      "headline":"When all of the chocolate is melted, (and while on low heat still) grab your whisk and add milk, little by little, and whisk away.",
      "description":"Add more milk and keep whisking until the chocolate and milk are blended."
    },
    {
      "headline":"Bring the heat up and heat to your liking.",
      "description":"If everyone likes sugar, you may want to add it now. Serve in big mugs with a dollop of whipped cream. Some cocoa powder dusted on top makes it look extra nice. Other toppings include:\nice cream cubes (place softened ice cream in ice cube trays, once set, add to hot chocolate - try different flavors). M&Ms\nlicorice\ncinnamon stick\npeppermint stick\ncandy cane\nmarshmallows\nchocolate shavings"
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Gather ingredients.  Melt butter in the pan.  Break up the chocolate and melt on a low heat in a saucepan, stirring occasionally to prevent chocolate sticking to the bottom of the pot.  Meanwhile heat the milk in the microwave, but do not let it boil. If you don't like using the microwave, just heat it up on the stove (in another saucepan, of course! ). When all of the chocolate is melted, (and while on low heat still) grab your whisk and add milk, little by little, and whisk away. Add more milk and keep whisking until the chocolate and milk are blended. Bring the heat up and heat to your liking. If everyone likes sugar, you may want to add it now. Serve in big mugs with a dollop of whipped cream. Some cocoa powder dusted on top makes it look extra nice. Other toppings include:\nice cream cubes (place softened ice cream in ice cube trays, once set, add to hot chocolate - try different flavors). M&Ms\nlicorice\ncinnamon stick\npeppermint stick\ncandy cane\nmarshmallows\nchocolate shavings Enjoy! ",
  "tyn_model":[
    "milk",
    "chocolate",
    "saucepan",
    "microwave",
    "whisk",
    "ice cream",
    "butter",
    "stove",
    "sugar",
    "whipped cream",
    "cocoa powder",
    "ice cube",
    "hot chocolate",
    "licorice",
    "candy cane"
  ],
  "tyn_section":[

  ]
}