{
  "title":"How to Make an Orange Cornmeal Cake",
  "url":"https://www.wikihow.com/Make-an-Orange-Cornmeal-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Fruit Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 375 °F (191 °C).",
      "description":""
    },
    {
      "headline":"Take the cake tin and place it on a piece of parchment paper.",
      "description":""
    },
    {
      "headline":"Use the pencil to trace round the bottom of the tin and cut out the circle with your scissors.",
      "description":""
    },
    {
      "headline":"Cut a piece of parchment paper to fit all round the inside of the cake tin.",
      "description":""
    },
    {
      "headline":"Take your brush and a little of the oil and brush over all the sides and bottom of the cake tin.",
      "description":""
    },
    {
      "headline":"Place the parchment paper inside the tin so that it sticks onto to oiled parchment paper.",
      "description":""
    },
    {
      "headline":"Place your grater on a plate and grate the zest of the orange and place into a small dish for later.",
      "description":""
    },
    {
      "headline":"Squeeze the orange and place the juice into a cup to use later.",
      "description":""
    },
    {
      "headline":"In a large bowl add the oil, sugar, eggs and orange juice.",
      "description":""
    },
    {
      "headline":"Whisk these ingredients until thick and creamy.",
      "description":""
    },
    {
      "headline":"Add the flour, baking powder, cornmeal, orange zest and salt.",
      "description":""
    },
    {
      "headline":"Whisk the mixture until smooth.",
      "description":""
    },
    {
      "headline":"Pour the mixture into the cake tin.",
      "description":""
    },
    {
      "headline":"Sprinkle the sugar all over the top of the cake mixture.",
      "description":""
    },
    {
      "headline":"Place the tin on the middle shelf of the pre-heated oven.",
      "description":""
    },
    {
      "headline":"Bake for 35-40 minutes.",
      "description":""
    },
    {
      "headline":"Test that the cake is cooked by pushing a skewer into the center of the cake, if the skewer comes out clean then the cake is cooked, if not put the cake back into the oven and cook for another 5 minutes or until cooked.",
      "description":""
    },
    {
      "headline":"Using oven gloves remove the cake from the oven and place onto a cooling rack to cool for about 20 minutes.",
      "description":""
    },
    {
      "headline":"Run a large knife round the edge of the cake and then invert the cake onto a plate.",
      "description":""
    },
    {
      "headline":"Remove all of the parchment paper.",
      "description":""
    },
    {
      "headline":"Re-invert the cake and carefully place back onto the cooling rack to completely cool down.",
      "description":"Make sure that you do not spill the crunchy sugar topping."
    },
    {
      "headline":"When the cake is cold place it onto a serving plate.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat your oven to 375 °F (191 °C).  Take the cake tin and place it on a piece of parchment paper.  Use the pencil to trace round the bottom of the tin and cut out the circle with your scissors.  Cut a piece of parchment paper to fit all round the inside of the cake tin.  Take your brush and a little of the oil and brush over all the sides and bottom of the cake tin.  Place the parchment paper inside the tin so that it sticks onto to oiled parchment paper.  Place your grater on a plate and grate the zest of the orange and place into a small dish for later.  Squeeze the orange and place the juice into a cup to use later.  In a large bowl add the oil, sugar, eggs and orange juice.  Whisk these ingredients until thick and creamy.  Add the flour, baking powder, cornmeal, orange zest and salt.  Whisk the mixture until smooth.  Pour the mixture into the cake tin.  Sprinkle the sugar all over the top of the cake mixture.  Place the tin on the middle shelf of the pre-heated oven.  Bake for 35-40 minutes.  Test that the cake is cooked by pushing a skewer into the center of the cake, if the skewer comes out clean then the cake is cooked, if not put the cake back into the oven and cook for another 5 minutes or until cooked.  Using oven gloves remove the cake from the oven and place onto a cooling rack to cool for about 20 minutes.  Run a large knife round the edge of the cake and then invert the cake onto a plate.  Remove all of the parchment paper.  Re-invert the cake and carefully place back onto the cooling rack to completely cool down. Make sure that you do not spill the crunchy sugar topping. When the cake is cold place it onto a serving plate.  Finished. ",
  "tyn_model":[
    "parchment paper",
    "oven",
    "sugar",
    "cake tin",
    "oil",
    "plate",
    "pencil",
    "scissors",
    "brush",
    "grater",
    "orange",
    "large bowl",
    "eggs",
    "orange juice",
    "flour",
    "baking powder",
    "cornmeal",
    "orange zest",
    "salt",
    "oven gloves",
    "large knife",
    "serving plate"
  ],
  "tyn_section":[

  ]
}