{
  "title":"How to Safely Free Dive for Lobster",
  "url":"https://www.wikihow.com/Safely-Free-Dive-for-Lobster",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Lobster"
  ],
  "steps":[
    {
      "headline":"Find a lobster \"hole\".",
      "description":"Ask your friends, the local spearfishing shop worker, read a local book or magazine, and find an area that has reefs that \"look alive\". A reef that looks alive is teeming with life and has healthy coral. Except for slipper lobsters, lobsters will not be found in sandy areas."
    },
    {
      "headline":"Mobilize two others for this endeavor.",
      "description":"Use a boat; a dinghy will do for calm to moderate conditions."
    },
    {
      "headline":"Go out in mid-morning, fully rested, and on a bright sunny day.",
      "description":"Avoid the dusk, night and dawn hours. For subsistence fare, the day hours are clearly sufficient."
    },
    {
      "headline":"Anchor the boat.",
      "description":"Lobsters can be found in waters from ten feet deep and deeper. Most people should not go deeper than 30 feet (9.1 m)."
    },
    {
      "headline":"Throw an additional rope in the water.",
      "description":"This rope is for the divers to get a sense of bearing and should be knotted at intervals to signify depth."
    },
    {
      "headline":"Inform the lookout of your plans and have him or her monitor the water for sharks and excessive dive times.",
      "description":"Discuss your working depths, cinch on your weight belts and slip calmly into the abyss. Strive to relax to keep from hyperventilating, and soon you will recall the cold and darkness of the deep."
    },
    {
      "headline":"Descend slowly and check the depth from the knots on the rope.",
      "description":""
    },
    {
      "headline":"Search the reefs with repeated dives and you will find the lobster - an unsuspecting prey.",
      "description":"Going past 10 feet (3.0 m) in depth, it gets dark, even in the day carry a small flashlight at the very least. Be careful how you use the flashlight to avoid vision problems. After a while your vision will adjust to the darkness of the depths."
    },
    {
      "headline":"Grab lobsters from the top and back.",
      "description":"Often, they will be partially in a hole, so beware of the vicious moray eels. The eel and the lobster strangely coexist. The three-pronged spear serves a second purpose: coax the lobster into the open with it, so the lobster can be grabbed. Grab the lobster from the back and the top, and away from the moray eel (the spiny lobster has no claws to hurt you). As you begin to understand that the lobsters swim backwards in quick bursts, (using their powerful tail), you will be able to determine where and when to grab them. If you think a lobster will dart as soon as you reach,  aim a few inches behind the lobster."
    },
    {
      "headline":"Avoid spearing lobsters.",
      "description":"A speared lobster will bring the sharks, they like lobsters. A lobster that is not speared tastes better and lives longer."
    },
    {
      "headline":"Put the lobster in a mesh bag and ascend slowly.",
      "description":"Rest in the boat if necessary if tired from the compression."
    },
    {
      "headline":"Take just what you need, be thankful and return to shore.",
      "description":""
    }
  ],
  "text":" Find a lobster \"hole\". Ask your friends, the local spearfishing shop worker, read a local book or magazine, and find an area that has reefs that \"look alive\". A reef that looks alive is teeming with life and has healthy coral. Except for slipper lobsters, lobsters will not be found in sandy areas. Mobilize two others for this endeavor. Use a boat; a dinghy will do for calm to moderate conditions. Go out in mid-morning, fully rested, and on a bright sunny day. Avoid the dusk, night and dawn hours. For subsistence fare, the day hours are clearly sufficient. Anchor the boat. Lobsters can be found in waters from ten feet deep and deeper. Most people should not go deeper than 30 feet (9.1 m). Throw an additional rope in the water. This rope is for the divers to get a sense of bearing and should be knotted at intervals to signify depth. Inform the lookout of your plans and have him or her monitor the water for sharks and excessive dive times. Discuss your working depths, cinch on your weight belts and slip calmly into the abyss. Strive to relax to keep from hyperventilating, and soon you will recall the cold and darkness of the deep. Descend slowly and check the depth from the knots on the rope.  Search the reefs with repeated dives and you will find the lobster - an unsuspecting prey. Going past 10 feet (3.0 m) in depth, it gets dark, even in the day carry a small flashlight at the very least. Be careful how you use the flashlight to avoid vision problems. After a while your vision will adjust to the darkness of the depths. Grab lobsters from the top and back. Often, they will be partially in a hole, so beware of the vicious moray eels. The eel and the lobster strangely coexist. The three-pronged spear serves a second purpose: coax the lobster into the open with it, so the lobster can be grabbed. Grab the lobster from the back and the top, and away from the moray eel (the spiny lobster has no claws to hurt you). As you begin to understand that the lobsters swim backwards in quick bursts, (using their powerful tail), you will be able to determine where and when to grab them. If you think a lobster will dart as soon as you reach,  aim a few inches behind the lobster. Avoid spearing lobsters. A speared lobster will bring the sharks, they like lobsters. A lobster that is not speared tastes better and lives longer. Put the lobster in a mesh bag and ascend slowly. Rest in the boat if necessary if tired from the compression. Take just what you need, be thankful and return to shore. ",
  "tyn_model":[
    "lobster",
    "lobsters",
    "boat",
    "rope",
    "water",
    "flashlight",
    "dinghy",
    "divers",
    "moray eels",
    "eel",
    "spear",
    "moray eel",
    "sharks",
    "mesh bag"
  ],
  "tyn_section":[

  ]
}