{
  "title":"How to Make Cucumber Sandwiches",
  "url":"https://www.wikihow.com/Make-Cucumber-Sandwiches",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals"
  ],
  "methods":[
    {
      "name":"Basic Cucumber Sandwich",
      "steps":[
        {
          "headline":"Peel and slice a fresh, washed cucumber.",
          "description":"Traditionally, cucumber sandwiches use thin, crisp slices of cucumber with the dark green peel removed. Use a potato peeler or a small, sharp knife to shave off the peel. You can use thick slices or leave the peel on if you wish — it's up to you. The peel won't hurt you, but its texture is slightly tougher than the flesh of the cucumber."
        },
        {
          "headline":"Drain the liquid from the cucumber slices.",
          "description":"Drop the slices into a colander in the sink. Let them drain for about 10 minutes, then remove them to a plate and pat dry with a paper towel. Getting your cucumber slices as crisp and dry (on the outside) as possible is important for a good sandwich. Soft, wet slices of cucumber are exactly what you don't want — they'll leave you with a dull, soggy mess."
        },
        {
          "headline":"Make your cream cheese spread.",
          "description":"In a small bowl, combine cream cheese, Worcestershire sauce, mayonnaise, garlic powder, and onion salt. Stir well until smooth and uniform."
        },
        {
          "headline":"Spread the cream cheese mixture on both pieces of bread.",
          "description":"You can be as generous as you like with the spread. One of the nice things about putting the spread on both pieces of bread is that it traps the moisture from the cucumber slices in the middle of the sandwich so that they don't make the bread soggy. This is something you can do with many fat or oil-based spreads (like peanut butter)."
        },
        {
          "headline":"Sandwich the cucumbers between the bread slices.",
          "description":"Lay down a few slices of cucumber on one of the pieces of bread. You can be generous here — you want a little cucumber in every bite. When you're done, lay the other piece of bread on top (spread facing down, of course). Congratulations — you just made your first cucumber sandwich!"
        },
        {
          "headline":"Remove the crusts and cut the sandwich into small pieces.",
          "description":"There's no \"wrong\" way to eat a cucumber sandwich, but in England, the sandwich is often eaten in small, crust-less squares, triangles, or fingers. Cut the sandwich how you wish (or leave it how it is) and serve immediately. If you're serving guests, repeat the steps above for more sandwiches, working through your loaf of bread. If needed, make more spread or cut more cucumber slices. In the section below, you'll learn a few tips for \"spicing up\" the basic cucumber sandwich recipe. Use these variations as you wish — you may even want to try serving a platter with every different kind of sandwich for variety's sake."
        }
      ]
    },
    {
      "name":"Recipe Variations",
      "steps":[
        {
          "headline":"Sprinkle dill over the cucumbers for a subtly fresh flavor.",
          "description":"Dill pairs excellently with the smooth, subdued flavors of a typical cucumber sandwich. After all, it's a crucial ingredient in dill pickles (which are made from cucumbers). A pinch or two of dried dill sprinkled into the sandwich will add some of this unique pickle-y flavor to the dish. For an eye-catching presentation, try serving the sandwiches open-faced (without the top piece of bread) and laying a single sprig of fresh dill across the cucumber slices. It'll look gorgeous (and taste great, too)."
        },
        {
          "headline":"Use lemon pepper for a tangy twist.",
          "description":"With their crisp, cool taste and texture, cucumber sandwiches are the perfect summertime snack. Adding a little lemon pepper to the spread or sprinkling it over the cucumber slices gives your sandwiches just a hint of sourness, making them even more refreshing. Lemon pepper can be bought for fairly cheap at most mid- to high-end grocery stores. You can also make it yourself from lemon zest, salt, and pepper."
        },
        {
          "headline":"Add Italian-style salad dressing for savory flavor.",
          "description":"If the standard cucumber sandwich doesn't have quite enough flavor for you, try adding a splash of your favorite Italian salad dressing as you're mixing the spread. This will give it a slightly more savory, substantial flavor without ruining the overall smoothness that makes a cucumber sandwich so great."
        },
        {
          "headline":"Use pumpernickel rye bread for a traditional combination.",
          "description":"Cucumber sandwiches are great with any good-quality white or wheat bread, but for an old-fashioned taste, use pumpernickel rye. Its heavy, sweet flavor contrasts well with the light, crisp bitterness of the cucumbers and the smoothness of the spread. Rye breads aren't always sold at neighborhood grocery stores, but you should be able to find it at many higher-end locations."
        },
        {
          "headline":"Try with chopped mint for added coolness.",
          "description":"Cucumbers are cool and crisp on their own, but with the added flavor and aroma of fresh mint, they're practically ice cold. Chop a few sprigs of mint and sprinkle them over the cucumbers or add them on top of each sandwich as a garnish. If you can, chop the mint into small, fine pieces. It's a little difficult to chew through whole mint leaves when they're in the middle of a sandwich."
        },
        {
          "headline":"Try the sandwich with Marmite spread (if you're bold).",
          "description":"Marmite is an infamous, strong-flavored spread made from yeast extract that is popular in the U.K. and some Commonwealth countries. Some people love it and some people hate it — it doesn't leave many tasters without a strong opinion. People who enjoy Marmite have been known to add it to cucumber sandwiches. If you want to try it but you've never had Marmite before, using a small amount is recommended. Marmite is often described as having a very salty taste with fishy qualities. It also has a strong odor that, to some, is unappealing."
        }
      ]
    }
  ],
  "text":" Basic Cucumber Sandwich Peel and slice a fresh, washed cucumber. Traditionally, cucumber sandwiches use thin, crisp slices of cucumber with the dark green peel removed. Use a potato peeler or a small, sharp knife to shave off the peel. You can use thick slices or leave the peel on if you wish — it's up to you. The peel won't hurt you, but its texture is slightly tougher than the flesh of the cucumber. Drain the liquid from the cucumber slices. Drop the slices into a colander in the sink. Let them drain for about 10 minutes, then remove them to a plate and pat dry with a paper towel. Getting your cucumber slices as crisp and dry (on the outside) as possible is important for a good sandwich. Soft, wet slices of cucumber are exactly what you don't want — they'll leave you with a dull, soggy mess. Make your cream cheese spread. In a small bowl, combine cream cheese, Worcestershire sauce, mayonnaise, garlic powder, and onion salt. Stir well until smooth and uniform. Spread the cream cheese mixture on both pieces of bread. You can be as generous as you like with the spread. One of the nice things about putting the spread on both pieces of bread is that it traps the moisture from the cucumber slices in the middle of the sandwich so that they don't make the bread soggy. This is something you can do with many fat or oil-based spreads (like peanut butter). Sandwich the cucumbers between the bread slices. Lay down a few slices of cucumber on one of the pieces of bread. You can be generous here — you want a little cucumber in every bite. When you're done, lay the other piece of bread on top (spread facing down, of course). Congratulations — you just made your first cucumber sandwich! Remove the crusts and cut the sandwich into small pieces. There's no \"wrong\" way to eat a cucumber sandwich, but in England, the sandwich is often eaten in small, crust-less squares, triangles, or fingers. Cut the sandwich how you wish (or leave it how it is) and serve immediately. If you're serving guests, repeat the steps above for more sandwiches, working through your loaf of bread. If needed, make more spread or cut more cucumber slices. In the section below, you'll learn a few tips for \"spicing up\" the basic cucumber sandwich recipe. Use these variations as you wish — you may even want to try serving a platter with every different kind of sandwich for variety's sake. Recipe Variations Sprinkle dill over the cucumbers for a subtly fresh flavor. Dill pairs excellently with the smooth, subdued flavors of a typical cucumber sandwich. After all, it's a crucial ingredient in dill pickles (which are made from cucumbers). A pinch or two of dried dill sprinkled into the sandwich will add some of this unique pickle-y flavor to the dish. For an eye-catching presentation, try serving the sandwiches open-faced (without the top piece of bread) and laying a single sprig of fresh dill across the cucumber slices. It'll look gorgeous (and taste great, too). Use lemon pepper for a tangy twist. With their crisp, cool taste and texture, cucumber sandwiches are the perfect summertime snack. Adding a little lemon pepper to the spread or sprinkling it over the cucumber slices gives your sandwiches just a hint of sourness, making them even more refreshing. Lemon pepper can be bought for fairly cheap at most mid- to high-end grocery stores. You can also make it yourself from lemon zest, salt, and pepper. Add Italian-style salad dressing for savory flavor. If the standard cucumber sandwich doesn't have quite enough flavor for you, try adding a splash of your favorite Italian salad dressing as you're mixing the spread. This will give it a slightly more savory, substantial flavor without ruining the overall smoothness that makes a cucumber sandwich so great. Use pumpernickel rye bread for a traditional combination. Cucumber sandwiches are great with any good-quality white or wheat bread, but for an old-fashioned taste, use pumpernickel rye. Its heavy, sweet flavor contrasts well with the light, crisp bitterness of the cucumbers and the smoothness of the spread. Rye breads aren't always sold at neighborhood grocery stores, but you should be able to find it at many higher-end locations. Try with chopped mint for added coolness. Cucumbers are cool and crisp on their own, but with the added flavor and aroma of fresh mint, they're practically ice cold. Chop a few sprigs of mint and sprinkle them over the cucumbers or add them on top of each sandwich as a garnish. If you can, chop the mint into small, fine pieces. It's a little difficult to chew through whole mint leaves when they're in the middle of a sandwich. Try the sandwich with Marmite spread (if you're bold). Marmite is an infamous, strong-flavored spread made from yeast extract that is popular in the U.K. and some Commonwealth countries. Some people love it and some people hate it — it doesn't leave many tasters without a strong opinion. People who enjoy Marmite have been known to add it to cucumber sandwiches. If you want to try it but you've never had Marmite before, using a small amount is recommended. Marmite is often described as having a very salty taste with fishy qualities. It also has a strong odor that, to some, is unappealing.",
  "tyn_model":[
    "cucumber",
    "cucumbers",
    "mint",
    "dill",
    "marmite",
    "cream cheese",
    "— you",
    "lemon pepper",
    "— it",
    "bread",
    "salad dressing",
    "potato peeler",
    "colander",
    "plate",
    "paper towel",
    "— they",
    "worcestershire sauce",
    "mayonnaise",
    "garlic powder",
    "onion salt",
    "peanut butter",
    "cucumber sandwich",
    "dill pickles",
    "lemon zest",
    "salt",
    "pepper",
    "pumpernickel rye bread",
    "pumpernickel rye",
    "marmite spread"
  ],
  "tyn_section":[

  ]
}