{
  "title":"How to Build a Metal Detector",
  "url":"https://www.wikihow.com/Build-a-Metal-Detector",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Rocks and Minerals",
    "Metals",
    "Metal Detecting"
  ],
  "methods":[
    {
      "name":"Using a Calculator and Radio to Detect Metal",
      "steps":[
        {
          "headline":"Tune the radio to highest band on the AM setting.",
          "description":"Make sure you are not tuned to a station. You should hear the static tone clearly and steadily. This will allow you to hear any differences in the tone when your device detects a metal object."
        },
        {
          "headline":"Assemble the search head.",
          "description":"Turn on your calculator. Next, position the two devices back-to-back, until a steady, dull tone is emitted. You may have to arrange the devices at certain angles or distances to achieve this tone."
        },
        {
          "headline":"Tape your devices into the position.",
          "description":"Once the calculator and radio are producing the correct tone, you need to tape them in that position. If the distance is too awkward to tape your devices together, mount them in that position on a board. This will keep your search head sturdy and functioning properly as you search for metals."
        },
        {
          "headline":"Attach your search head to a shaft.",
          "description":"An old broomstick or similar pole will make a suitable shaft. Use duct tape as a quick and secure method to mount the shaft. Alternatively, you can use zip ties to fasten the two pieces together. Use whichever method works best for the shape of your search head.."
        },
        {
          "headline":"Test your metal detector on some household metals.",
          "description":"First, prove that the metal detector works by placing a spoon on the table. Run the detector over the spoon and listen for the detector to beep or give off a new sound (different from the steady tone that it is producing). Now, you can take it outside or around your house to locate other metal objects."
        }
      ]
    },
    {
      "name":"Turning Your Smartphone into a Metal Detector",
      "steps":[
        {
          "headline":"Download a metal detector app.",
          "description":"Smartphones are electrical devices, and as such they produce a magnetic field. There have been applications developed that allow you to use the phone’s own magnetic field to detect metal objects. Go to your respective app store (this differs from platform to platform) and download metal detector app. One example of a metal detector app is the app “Metal Detector.”"
        },
        {
          "headline":"Pass your phone over metals with the app open.",
          "description":"Once the app has downloaded, open it. Follow any setup instructions within the app so that it works optimally. When the app is loaded and ready, start passing your phone over different metal objects."
        },
        {
          "headline":"Watch the measured magnetic field change.",
          "description":"The metal detector apps work by measuring changes in the magnetic field of your phone. As you pass over metal, it interacts with this field and the app detects that interaction. These interactions show as fluctuations in the magnetic field as you move from object to object. For example, as you pass over a metal object, the magnitude of the field may increase dramatically. This indicates that you have found something metal."
        }
      ]
    },
    {
      "name":"Assembling a Metal Detector Kit",
      "steps":[
        {
          "headline":"Assemble the hardware.",
          "description":"You can buy metal detector kits that come with various pieces of hardware. Some will include a coil and shaft. Others will only include a control box. Choose the kit that is right for you and assemble the pieces per the instructions. If you choose a kit with less hardware, you will have to make the additional pieces such as the shaft and coil."
        },
        {
          "headline":"Solder the circuits.",
          "description":"The control box will require soldering to complete all of the necessary circuits. You will need a soldering gun or iron to solder the components. If you have never soldered before, you should consider having a more experienced person help."
        },
        {
          "headline":"Test the metal detector.",
          "description":"Once you have assembled your metal detector, you should test it. Put down different metals on the floor and pass the coil over them. If the coil detects the metals, then you are ready to take your new metal detector out and start looking for treasures."
        }
      ]
    }
  ],
  "text":" Using a Calculator and Radio to Detect Metal Tune the radio to highest band on the AM setting. Make sure you are not tuned to a station. You should hear the static tone clearly and steadily. This will allow you to hear any differences in the tone when your device detects a metal object. Assemble the search head. Turn on your calculator. Next, position the two devices back-to-back, until a steady, dull tone is emitted. You may have to arrange the devices at certain angles or distances to achieve this tone. Tape your devices into the position. Once the calculator and radio are producing the correct tone, you need to tape them in that position. If the distance is too awkward to tape your devices together, mount them in that position on a board. This will keep your search head sturdy and functioning properly as you search for metals. Attach your search head to a shaft. An old broomstick or similar pole will make a suitable shaft. Use duct tape as a quick and secure method to mount the shaft. Alternatively, you can use zip ties to fasten the two pieces together. Use whichever method works best for the shape of your search head.. Test your metal detector on some household metals. First, prove that the metal detector works by placing a spoon on the table. Run the detector over the spoon and listen for the detector to beep or give off a new sound (different from the steady tone that it is producing). Now, you can take it outside or around your house to locate other metal objects. Turning Your Smartphone into a Metal Detector Download a metal detector app. Smartphones are electrical devices, and as such they produce a magnetic field. There have been applications developed that allow you to use the phone’s own magnetic field to detect metal objects. Go to your respective app store (this differs from platform to platform) and download metal detector app. One example of a metal detector app is the app “Metal Detector.” Pass your phone over metals with the app open. Once the app has downloaded, open it. Follow any setup instructions within the app so that it works optimally. When the app is loaded and ready, start passing your phone over different metal objects. Watch the measured magnetic field change. The metal detector apps work by measuring changes in the magnetic field of your phone. As you pass over metal, it interacts with this field and the app detects that interaction. These interactions show as fluctuations in the magnetic field as you move from object to object. For example, as you pass over a metal object, the magnitude of the field may increase dramatically. This indicates that you have found something metal. Assembling a Metal Detector Kit Assemble the hardware. You can buy metal detector kits that come with various pieces of hardware. Some will include a coil and shaft. Others will only include a control box. Choose the kit that is right for you and assemble the pieces per the instructions. If you choose a kit with less hardware, you will have to make the additional pieces such as the shaft and coil. Solder the circuits. The control box will require soldering to complete all of the necessary circuits. You will need a soldering gun or iron to solder the components. If you have never soldered before, you should consider having a more experienced person help. Test the metal detector. Once you have assembled your metal detector, you should test it. Put down different metals on the floor and pass the coil over them. If the coil detects the metals, then you are ready to take your new metal detector out and start looking for treasures.",
  "tyn_model":[
    "metal detector",
    "calculator",
    "radio",
    "phone",
    "spoon",
    "duct tape",
    "zip ties",
    "smartphone",
    "smartphones",
    "“metal",
    "” pass",
    "metal detector kit",
    "soldering gun",
    "iron"
  ],
  "tyn_section":[

  ]
}