{
  "title":"How to Make Pink Lemonade Popcorn",
  "url":"https://www.wikihow.com/Make-Pink-Lemonade-Popcorn",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Popcorn"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350º Fahrenheit or 180º Celsius.",
      "description":""
    },
    {
      "headline":"Place the popcorn in a large bowl.",
      "description":""
    },
    {
      "headline":"Bake the coconut flakes and cashews for about 5-7 minutes.",
      "description":"Cook until they are slightly golden and toasted."
    },
    {
      "headline":"Melt the butter, brown sugar, and lemon juice over medium heat on a saucepan.",
      "description":"Stir well with a wooden spoon for about 5-7 minutes until fully melted."
    },
    {
      "headline":"Fold in the marshmallows and mix well until melted.",
      "description":""
    },
    {
      "headline":"Pour the marshmallow mixture all over the popcorn.",
      "description":""
    },
    {
      "headline":"Lay parchment paper on a baking tray.",
      "description":"Pour the popcorn all over it."
    },
    {
      "headline":"Sprinkle the lemon zest over the popcorn and allow it to cool for 30 minutes.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Place the popcorn back in the large bowl. Drizzle strawberry syrup over the popcorn, if desired. Enjoy!"
    }
  ],
  "text":" Preheat the oven to 350º Fahrenheit or 180º Celsius.  Place the popcorn in a large bowl.  Bake the coconut flakes and cashews for about 5-7 minutes. Cook until they are slightly golden and toasted. Melt the butter, brown sugar, and lemon juice over medium heat on a saucepan. Stir well with a wooden spoon for about 5-7 minutes until fully melted. Fold in the marshmallows and mix well until melted.  Pour the marshmallow mixture all over the popcorn.  Lay parchment paper on a baking tray. Pour the popcorn all over it. Sprinkle the lemon zest over the popcorn and allow it to cool for 30 minutes.  Serve. Place the popcorn back in the large bowl. Drizzle strawberry syrup over the popcorn, if desired. Enjoy!",
  "tyn_model":[
    "large bowl",
    "oven",
    "coconut flakes",
    "cashews",
    "butter",
    "brown sugar",
    "lemon juice",
    "saucepan",
    "wooden spoon",
    "popcorn",
    "parchment paper",
    "baking tray",
    "lemon",
    "strawberry syrup"
  ],
  "tyn_section":[

  ]
}