{
  "title":"How to Make Strawberry Margaritas",
  "url":"https://www.wikihow.com/Make-Strawberry-Margaritas",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Margaritas"
  ],
  "methods":[
    {
      "name":"Making a Strawberry Margarita on the Rocks",
      "steps":[
        {
          "headline":"Make a simple syrup.",
          "description":"In a small saucepan, combine 1/4 cup of granulated sugar with 1/4 cup of water. Bring the mixture to a boil over medium-high heat. Reduce the heat so the mixture simmers. Cook the syrup until the sugar dissolves. Refrigerate this syrup till it's cold. It will only take a few minutes for the sugar to dissolve and create a syrup. This should make about 1/4 cup of simple syrup. Always be careful when handling hot sugar syrup since it could burn you."
        },
        {
          "headline":"Make a strawberry puree.",
          "description":"Wash 1 1/4 cups of strawberries and cut off the stems. Put them in a blender with 2 tablespoons of your cold simple syrup. Blend the berries and syrup until you have a smooth strawberry puree. If you'd like to leave a few chunks of strawberry for your drinks, simply pulse the berries and syrup until you have the consistency you'd like."
        },
        {
          "headline":"Combine the puree with your other ingredients.",
          "description":"Transfer the strawberry puree to a tall serving pitcher. Add 2 1/2 ounces of freshly squeezed lime juice, 1 ounce of orange liqueur (like Triple Sec) and 2 ounces of tequila. Stir this mixture to combine it. Taste the mixture and add more simple syrup if you'd like it sweeter."
        },
        {
          "headline":"Shake or stir the margaritas.",
          "description":"Add ice to the pitcher and stir the margaritas to chill them. Or you can pour the margarita mixture into a martini shaker. Add ice to the shaker and shake the margaritas until the sides of the shaker are cold. Avoid letting the margaritas sit in the shakers with the ice too long. The ice will begin to melt and will dilute your drinks."
        },
        {
          "headline":"Serve the margaritas.",
          "description":"Fill your glasses with crushed ice or ice cubes. Pour the margaritas into your glasses. This recipe should make two margaritas. Garnish the margaritas with thinly sliced limes or strawberries and serve them immediately. Have straws available for serving. Choose thin cocktail straws since this will make the drink last longer than if you use large smoothie-sized straws."
        }
      ]
    },
    {
      "name":"Making a Blended Strawberry Margarita",
      "steps":[
        {
          "headline":"Place the ingredients in your blender.",
          "description":"Add 3 ounces of tequila, 1 ounce of orange liqueur, 4 ounces of frozen strawberries in syrup, and 2 ounces of frozen limeade concentrate into your blender. You could use fresh strawberries instead of frozen, but your margaritas may not be as cold. You may also need to taste the margaritas to adjust the sweetness."
        },
        {
          "headline":"Add ice and crush the mixture.",
          "description":"Fill your blender halfway full of ice. Turn on the blender so that you completely crush your ice. If you prefer a smoother blended margarita, you could also use a shaved ice machine. You can also purchase crushed ice to use, although it may be chunkier than ice you crush yourself."
        },
        {
          "headline":"Blend the margaritas.",
          "description":"Cover the blender and turn it on. Blend the ingredients for about 30 seconds or until the margaritas are completely smooth. If you'd like some texture in your margaritas, you may want to just pulse the margaritas so they remain somewhat chunky."
        },
        {
          "headline":"Serve the margaritas.",
          "description":"Pour the blended margaritas into your glasses. This recipe should make two margaritas. If you want your margaritas to stay cooler for longer, consider chilling the glasses in the freezer before filling them. Try to serve the margaritas as soon as they're blended. They may begin to melt, especially if it's hot outside."
        }
      ]
    },
    {
      "name":"Garnishing and Trying Variations",
      "steps":[
        {
          "headline":"Make a salt rim.",
          "description":"Have two small plates ready. Add enough kosher salt to cover the bottom of one plate and pour a little lime juice onto the other plate. Make sure the plate has a bit of a lip so the liquid doesn't run out. Dip the rims of your margarita glasses in the juice and immediately dip the juiced rims into the salt. The juice will help the salt stick to the glass. Consider chilling the glasses in the freezer before salting the rims and serving the margaritas. Cold glasses will make your margaritas stay cooler longer."
        },
        {
          "headline":"Try a sweet rim.",
          "description":"If you don't want the salty-sweet taste of a margarita served with a salty rim, you may want to make a sugar rim. Keep in mind that this will add to the overall sweetness of your drink. To make a sugar rim, have two small rimmed plates ready. Pour a little water onto the bottom of one plate and add enough sugar to cover the bottom of the other plate. Dip the rims of your margarita glasses in the water and immediately dip them into the sugar. Different sugars will give different textures. Try demerara sugar if you want a lot of crunch and a rich flavor. For a light crunch, use granulated sugar. You probably don't want to use powdered sugar since it may dissolve too quickly."
        },
        {
          "headline":"Garnish your margaritas with fruit.",
          "description":"Since strawberry margaritas aren't as common as classic margaritas made with lime, garnish with strawberries. This way, if you're serving the cocktails to guests, they'll be able to tell what flavor the drinks are. Slice limes and strawberries thinly to float in the drinks. Since fruit won't easily float in the frozen margarita, you may want to leave the fruit whole or in larger slices. Simply cut a slit in a whole strawberry so you can set it in the rim of the glass."
        },
        {
          "headline":"Try a different flavor.",
          "description":"You can easily add different fruit flavors to your strawberry margarita. For example, you can add frozen sliced bananas for a strawberry banana margarita. Or for a strawberry lemonade margarita, replace the lime juice with lemon juice (or use frozen lemonade concentrate). To make a strawberry coconut margarita, add a little sweetened cream of coconut for an extra tropical flavor. To garnish, consider adding sliced banana, sliced lemons, or shredded coconut on the rim of the glass."
        },
        {
          "headline":"Make a virgin strawberry margarita.",
          "description":"If you'll be serving drinks to minors or those who can't drink alcohol, you may want to make a batch of non-alcoholic margaritas. Simply leave out the alcohol. You may need to adjust the consistency of the blended margarita by adding more lime juice or strawberry puree. You can still make salt or sugar rims for serving virgin margaritas."
        }
      ]
    }
  ],
  "text":" Making a Strawberry Margarita on the Rocks Make a simple syrup. In a small saucepan, combine 1/4 cup of granulated sugar with 1/4 cup of water. Bring the mixture to a boil over medium-high heat. Reduce the heat so the mixture simmers. Cook the syrup until the sugar dissolves. Refrigerate this syrup till it's cold. It will only take a few minutes for the sugar to dissolve and create a syrup. This should make about 1/4 cup of simple syrup. Always be careful when handling hot sugar syrup since it could burn you. Make a strawberry puree. Wash 1 1/4 cups of strawberries and cut off the stems. Put them in a blender with 2 tablespoons of your cold simple syrup. Blend the berries and syrup until you have a smooth strawberry puree. If you'd like to leave a few chunks of strawberry for your drinks, simply pulse the berries and syrup until you have the consistency you'd like. Combine the puree with your other ingredients. Transfer the strawberry puree to a tall serving pitcher. Add 2 1/2 ounces of freshly squeezed lime juice, 1 ounce of orange liqueur (like Triple Sec) and 2 ounces of tequila. Stir this mixture to combine it. Taste the mixture and add more simple syrup if you'd like it sweeter. Shake or stir the margaritas. Add ice to the pitcher and stir the margaritas to chill them. Or you can pour the margarita mixture into a martini shaker. Add ice to the shaker and shake the margaritas until the sides of the shaker are cold. Avoid letting the margaritas sit in the shakers with the ice too long. The ice will begin to melt and will dilute your drinks. Serve the margaritas. Fill your glasses with crushed ice or ice cubes. Pour the margaritas into your glasses. This recipe should make two margaritas. Garnish the margaritas with thinly sliced limes or strawberries and serve them immediately. Have straws available for serving. Choose thin cocktail straws since this will make the drink last longer than if you use large smoothie-sized straws. Making a Blended Strawberry Margarita Place the ingredients in your blender. Add 3 ounces of tequila, 1 ounce of orange liqueur, 4 ounces of frozen strawberries in syrup, and 2 ounces of frozen limeade concentrate into your blender. You could use fresh strawberries instead of frozen, but your margaritas may not be as cold. You may also need to taste the margaritas to adjust the sweetness. Add ice and crush the mixture. Fill your blender halfway full of ice. Turn on the blender so that you completely crush your ice. If you prefer a smoother blended margarita, you could also use a shaved ice machine. You can also purchase crushed ice to use, although it may be chunkier than ice you crush yourself. Blend the margaritas. Cover the blender and turn it on. Blend the ingredients for about 30 seconds or until the margaritas are completely smooth. If you'd like some texture in your margaritas, you may want to just pulse the margaritas so they remain somewhat chunky. Serve the margaritas. Pour the blended margaritas into your glasses. This recipe should make two margaritas. If you want your margaritas to stay cooler for longer, consider chilling the glasses in the freezer before filling them. Try to serve the margaritas as soon as they're blended. They may begin to melt, especially if it's hot outside. Garnishing and Trying Variations Make a salt rim. Have two small plates ready. Add enough kosher salt to cover the bottom of one plate and pour a little lime juice onto the other plate. Make sure the plate has a bit of a lip so the liquid doesn't run out. Dip the rims of your margarita glasses in the juice and immediately dip the juiced rims into the salt. The juice will help the salt stick to the glass. Consider chilling the glasses in the freezer before salting the rims and serving the margaritas. Cold glasses will make your margaritas stay cooler longer. Try a sweet rim. If you don't want the salty-sweet taste of a margarita served with a salty rim, you may want to make a sugar rim. Keep in mind that this will add to the overall sweetness of your drink. To make a sugar rim, have two small rimmed plates ready. Pour a little water onto the bottom of one plate and add enough sugar to cover the bottom of the other plate. Dip the rims of your margarita glasses in the water and immediately dip them into the sugar. Different sugars will give different textures. Try demerara sugar if you want a lot of crunch and a rich flavor. For a light crunch, use granulated sugar. You probably don't want to use powdered sugar since it may dissolve too quickly. Garnish your margaritas with fruit. Since strawberry margaritas aren't as common as classic margaritas made with lime, garnish with strawberries. This way, if you're serving the cocktails to guests, they'll be able to tell what flavor the drinks are. Slice limes and strawberries thinly to float in the drinks. Since fruit won't easily float in the frozen margarita, you may want to leave the fruit whole or in larger slices. Simply cut a slit in a whole strawberry so you can set it in the rim of the glass. Try a different flavor. You can easily add different fruit flavors to your strawberry margarita. For example, you can add frozen sliced bananas for a strawberry banana margarita. Or for a strawberry lemonade margarita, replace the lime juice with lemon juice (or use frozen lemonade concentrate). To make a strawberry coconut margarita, add a little sweetened cream of coconut for an extra tropical flavor. To garnish, consider adding sliced banana, sliced lemons, or shredded coconut on the rim of the glass. Make a virgin strawberry margarita. If you'll be serving drinks to minors or those who can't drink alcohol, you may want to make a batch of non-alcoholic margaritas. Simply leave out the alcohol. You may need to adjust the consistency of the blended margarita by adding more lime juice or strawberry puree. You can still make salt or sugar rims for serving virgin margaritas.",
  "tyn_model":[
    "ice",
    "blender",
    "strawberries",
    "glasses",
    "simple syrup",
    "sugar",
    "strawberry puree",
    "water",
    "lime juice",
    "salt",
    "plate",
    "granulated sugar",
    "berries",
    "syrup",
    "orange liqueur",
    "tequila",
    "crushed ice",
    "limes",
    "plates",
    "margarita glasses",
    "lime",
    "coconut",
    "small saucepan",
    "sugar syrup",
    "tall serving pitcher",
    "triple sec",
    "pitcher",
    "martini shaker",
    "ice cubes",
    "cocktail straws",
    "frozen strawberries",
    "frozen limeade concentrate",
    "shaved ice machine",
    "kosher salt",
    "sugars",
    "demerara sugar",
    "powdered sugar",
    "fruit",
    "strawberry",
    "strawberry margarita",
    "bananas",
    "lemon juice",
    "frozen lemonade concentrate",
    "sweetened cream",
    "banana",
    "lemons"
  ],
  "tyn_section":[

  ]
}