{
  "title":"How to Choose Healthy Cereals for Your Baby",
  "url":"https://www.wikihow.com/Choose-Healthy-Cereals-for-Your-Baby",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children"
  ],
  "methods":[
    {
      "name":"Looking for a Nutritious Cereal for Your Baby",
      "steps":[
        {
          "headline":"Read the nutrition label.",
          "description":"When you're looking for a healthy and nutritious baby cereal, the first place you'll need to look is the food label. This is where you'll get a lot of information on the product and be able to compare to other items in the store. Start by looking at the ingredient list. You'll want to know exactly what you're feeding your child (especially if you're worried about allergies or sensitivities). This is usually found on the back or side of the cereal container. Regardless of what grain you're choosing, go for 100% whole grains. If the label says white rice or hulled wheat, these are not 100% whole grains. You will also see the nutrition fact panel on baby cereals. If your child needs to meet a certain calorie level to improve growth, this is where you'll find out how many calories this cereal contains per serving."
        },
        {
          "headline":"Consider looking for fortified cereals.",
          "description":"Many health professions like pediatricians suggest starting babies on fortified cereals. These products have certain nutrients added to them to help them be a more nutrient dense food for your child. Look for cereals that are fortified with iron. You might find this as a \"call-out\" on the front of the package. Double check there is iron on the ingredient list and on the nutrition fact panel. Babies need about 10 – 11 mg of iron per day. You may also see cereals that are fortified with DHA or EPA. These are optional fortifications; however, both of these healthy fats help support the development of your baby's brain and immune system. DHA is needed for brain, eye, and nervous system development. DHA accumulates in the brain during the first two years of life. The brain grows quickly at this time of life. Some infant cereals even advertise that they contain probiotics. Although this is only an optional fortification, some studies show that probiotics may help infants with colic, diarrhea or eczema."
        },
        {
          "headline":"Consider organic versus conventional cereals.",
          "description":"Another option that you'll see on store shelves is organic baby cereal. Decide whether or not you want to feed your child organic or conventional baby cereal. Organic baby cereals are produced the same way that other organic foods are. They are not raised or farmed with pesticides or synthetic fertilizers. Feeding your baby an organic cereal may limit their exposure to these pesticides. There are different organic labels you'll see in the store. \"100% organic\" can be used to label a product that contains 100% organic ingredients (excluding salt and water which are considered natural). \"Organic\" can be used to label any product that contains a minimum of 95% organic ingredients (excluding salt and water). Up to 5% of the ingredients may be inorganic, and are not commercially available as organic. \"Made with organic ingredients\" means they contain at least 70% organically produced ingredients. When it comes to nutrition, there is no difference between organic and conventional baby cereal. The nutrients are identical. Health professionals generally recommend you choose organic if you feel that is most important; however, it's better to focus on finding a cereal that contains adequate fortification and is something you and your baby will enjoy."
        },
        {
          "headline":"Consider making your own baby cereal at home.",
          "description":"If you don't find a baby cereal in-store that you think is appropriate for your child, consider making your own baby cereal. This is not very difficult, but does take some advanced planning. To make your own homemade baby cereal, start by choosing what grain you'd like to use. Brown rice is the most common grain, but you can also use oats or multigrain cereals. Blend 1/4 cup of your chosen grain in a food processor until it becomes a powder or the consistency of flour. Mix this with about 1 cup of water, breast milk or formula. Bring to a low simmer and whisk for a few constantly for about 10 minutes. Taste the cereal to make sure there are not uncooked pieces. Allow your homemade cereal to cool completely or to be only room temperature. Serve to your child within 24 hours."
        }
      ]
    },
    {
      "name":"Determining What Cereal Grain is Appropriate for Your Baby",
      "steps":[
        {
          "headline":"Talk to your pediatrician.",
          "description":"Starting your baby on solid foods can be intimidating. To help make sure you choose the right cereal and start your child with solid foods at the appropriate time, talk to your pediatrician. Most pediatricians will recommend that your child (as long as they are developing normally) begins solid foods anywhere from four to six months. Talk to your pediatrician about what type of grain they think is the most appropriate for your child. Although rice cereal is the most common, your physician may suggest something different. Also ask your pediatrician how often to start feeding your child cereals. It's typically recommended to try two times a day when your baby isn't overly cranky or sleepy."
        },
        {
          "headline":"Give your baby rice cereal.",
          "description":"Rice cereals are the most common and easily found infant cereals. You will see white rice cereal and brown rice cereal options available. Rice cereal is typically the most commonly recommended infant cereal to start with because it is exceedingly rare for an infant to be allergic to rice. If you do choose to start with rice cereal, choose a product that is fortified with iron. Also, choose a cereal that is made from brown rice. White rice is heavily processed and many of the nutrients have been stripped from the grain. You may be surprised and concerned that there is arsenic in rice. But arsenic is found in the Earth’s crust, and present in water and soil. Crops absorb arsenic as they grow, that’s how it gets into our foods.The FDA has issued a limit of 100 parts per billion for arsenic in infant rice cereal. Rice cereal is a good source of nutrients for your baby, but it should not be the only one. Be sure to provide a variety of infant cereals, like oat, barley and multigrain."
        },
        {
          "headline":"Try out multigrain cereals.",
          "description":"Another type of infant cereal that's widely available is multigrain cereal. This will introduce more than one type of grain to your infant and may provide other sources of nutrients. Whole grain cereals may include rice, oats, wheat, barley and even flax. If it's 100% whole grain, these foods are unrefined and still contain most of their nutrient dense components. Health professionals do recommend, that like all other cereals, your multigrain infant cereal should be fortified with iron. Check the labels to see that iron has been added to the cereal. If you are worried that some of these grains could lead to an allergy later on, note that studies do not support this. In fact, introducing some of these grains earlier on actually reduce the risk for future food allergies."
        },
        {
          "headline":"Make whole wheat cereal.",
          "description":"100% whole grain cereal is another option that is available to parents. This is a single grain cereal that contains all the nutrient dense components of the wheat grain. Again, the risk of allergies to wheat do not increase by giving your child wheat cereal in an early age. In addition, both whole wheat, multi grain and oat cereal do not contain arsenic which may be found in rice cereals (like brown rice cereal). Look for a wheat cereal that features 100% whole wheat grains and is fortified with iron."
        },
        {
          "headline":"Give your baby oat cereal.",
          "description":"If you want to give your child something other than rice or whole wheat cereal, you can try using oat cereal. It will have little to no arsenic and is still a nutritious  whole grain. Like rice cereals, oat cereal is a great option because it's a single grain cereal. In addition, the likelihood of your child being allergic to oats is very, very low. Again, check the labeling to make sure it's 100% whole grain oats (you'll find this information on the food label). Also, this cereal should be fortified with iron as oats do not have a high level of iron naturally."
        }
      ]
    },
    {
      "name":"Preparing Nutritious Cereals for Your Baby",
      "steps":[
        {
          "headline":"Read the package instructions.",
          "description":"Regardless of what type of cereal you purchase for your baby, it's important to make sure that you follow the mixing instructions correctly. This will help ensure your baby is getting the right amount of cereal. Each infant cereal will have specific instructions listed on the actual product. Before you purchase a product, make sure you read over the instructions. If you need to cook or heat the cereal, make sure to follow the directions to ensure the cereal is prepared correctly. Always allow a cereal to come down to room temperature before feeding it to your child. The cereal should be mixed until it's a thin and quite liquid consistency. You may need to add more milk or formula to get it to the right consistency."
        },
        {
          "headline":"Choose the appropriate liquid to mix with cereals.",
          "description":"When preparing an infant or baby cereal, you'll need to mix the dry cereal with a liquid. Take advantage of this opportunity to add more nutrition to your baby's cereal. Most cereals will tell you to mix with breast milk or formula. This helps increase the nutrient content (especially in terms of protein and fat) of the cereal. It's essential that you do this step. You can mix your infant cereal with water if you do not have any breast milk or formula available to you. However, try to limit how often you do this."
        },
        {
          "headline":"Toss out unused cereals.",
          "description":"Like most baby foods, you do not want to keep prepared cereals long. Feeding your child leftovers can put them in danger of getting sick. You need to be extra careful with how long you store uneaten baby cereals. Babies and infants are the most susceptible to foodborne illness since their immune systems are still immature. If you make extra baby cereal, only put a few tablespoons into a bowl. Do not feed your child from the larger serving. Saliva can contaminate the cereal if you were to store it the refrigerator. Throw out any extra cereal your child didn't consume from their pre-portioned serving. In addition, only keep baby cereal for 24 hrs."
        },
        {
          "headline":"Be patient with your child.",
          "description":"All children tolerate foods at different stages and at different times. As you and your child get the hang of eating solids, you'll notice your child becomes much better at eating. Children are great at knowing when they are hungry, when they're not and when they want more food. Make sure to follow your child's hunger and satisfaction cues. A baby may turn away his head or not open his lips if he doesn't want any solids or doesn't want anymore of the cereal. Do not try to force feed a child who doesn't want cereal. Even if your child only eats a bite or two, that's OK. There will be other opportunities to try solid foods."
        }
      ]
    }
  ],
  "text":" Looking for a Nutritious Cereal for Your Baby Read the nutrition label. When you're looking for a healthy and nutritious baby cereal, the first place you'll need to look is the food label. This is where you'll get a lot of information on the product and be able to compare to other items in the store. Start by looking at the ingredient list. You'll want to know exactly what you're feeding your child (especially if you're worried about allergies or sensitivities). This is usually found on the back or side of the cereal container. Regardless of what grain you're choosing, go for 100% whole grains. If the label says white rice or hulled wheat, these are not 100% whole grains. You will also see the nutrition fact panel on baby cereals. If your child needs to meet a certain calorie level to improve growth, this is where you'll find out how many calories this cereal contains per serving. Consider looking for fortified cereals. Many health professions like pediatricians suggest starting babies on fortified cereals. These products have certain nutrients added to them to help them be a more nutrient dense food for your child. Look for cereals that are fortified with iron. You might find this as a \"call-out\" on the front of the package. Double check there is iron on the ingredient list and on the nutrition fact panel. Babies need about 10 – 11 mg of iron per day. You may also see cereals that are fortified with DHA or EPA. These are optional fortifications; however, both of these healthy fats help support the development of your baby's brain and immune system. DHA is needed for brain, eye, and nervous system development. DHA accumulates in the brain during the first two years of life. The brain grows quickly at this time of life. Some infant cereals even advertise that they contain probiotics. Although this is only an optional fortification, some studies show that probiotics may help infants with colic, diarrhea or eczema. Consider organic versus conventional cereals. Another option that you'll see on store shelves is organic baby cereal. Decide whether or not you want to feed your child organic or conventional baby cereal. Organic baby cereals are produced the same way that other organic foods are. They are not raised or farmed with pesticides or synthetic fertilizers. Feeding your baby an organic cereal may limit their exposure to these pesticides. There are different organic labels you'll see in the store. \"100% organic\" can be used to label a product that contains 100% organic ingredients (excluding salt and water which are considered natural). \"Organic\" can be used to label any product that contains a minimum of 95% organic ingredients (excluding salt and water). Up to 5% of the ingredients may be inorganic, and are not commercially available as organic. \"Made with organic ingredients\" means they contain at least 70% organically produced ingredients. When it comes to nutrition, there is no difference between organic and conventional baby cereal. The nutrients are identical. Health professionals generally recommend you choose organic if you feel that is most important; however, it's better to focus on finding a cereal that contains adequate fortification and is something you and your baby will enjoy. Consider making your own baby cereal at home. If you don't find a baby cereal in-store that you think is appropriate for your child, consider making your own baby cereal. This is not very difficult, but does take some advanced planning. To make your own homemade baby cereal, start by choosing what grain you'd like to use. Brown rice is the most common grain, but you can also use oats or multigrain cereals. Blend 1/4 cup of your chosen grain in a food processor until it becomes a powder or the consistency of flour. Mix this with about 1 cup of water, breast milk or formula. Bring to a low simmer and whisk for a few constantly for about 10 minutes. Taste the cereal to make sure there are not uncooked pieces. Allow your homemade cereal to cool completely or to be only room temperature. Serve to your child within 24 hours. Determining What Cereal Grain is Appropriate for Your Baby Talk to your pediatrician. Starting your baby on solid foods can be intimidating. To help make sure you choose the right cereal and start your child with solid foods at the appropriate time, talk to your pediatrician. Most pediatricians will recommend that your child (as long as they are developing normally) begins solid foods anywhere from four to six months. Talk to your pediatrician about what type of grain they think is the most appropriate for your child. Although rice cereal is the most common, your physician may suggest something different. Also ask your pediatrician how often to start feeding your child cereals. It's typically recommended to try two times a day when your baby isn't overly cranky or sleepy. Give your baby rice cereal. Rice cereals are the most common and easily found infant cereals. You will see white rice cereal and brown rice cereal options available. Rice cereal is typically the most commonly recommended infant cereal to start with because it is exceedingly rare for an infant to be allergic to rice. If you do choose to start with rice cereal, choose a product that is fortified with iron. Also, choose a cereal that is made from brown rice. White rice is heavily processed and many of the nutrients have been stripped from the grain. You may be surprised and concerned that there is arsenic in rice. But arsenic is found in the Earth’s crust, and present in water and soil. Crops absorb arsenic as they grow, that’s how it gets into our foods.The FDA has issued a limit of 100 parts per billion for arsenic in infant rice cereal. Rice cereal is a good source of nutrients for your baby, but it should not be the only one. Be sure to provide a variety of infant cereals, like oat, barley and multigrain. Try out multigrain cereals. Another type of infant cereal that's widely available is multigrain cereal. This will introduce more than one type of grain to your infant and may provide other sources of nutrients. Whole grain cereals may include rice, oats, wheat, barley and even flax. If it's 100% whole grain, these foods are unrefined and still contain most of their nutrient dense components. Health professionals do recommend, that like all other cereals, your multigrain infant cereal should be fortified with iron. Check the labels to see that iron has been added to the cereal. If you are worried that some of these grains could lead to an allergy later on, note that studies do not support this. In fact, introducing some of these grains earlier on actually reduce the risk for future food allergies. Make whole wheat cereal. 100% whole grain cereal is another option that is available to parents. This is a single grain cereal that contains all the nutrient dense components of the wheat grain. Again, the risk of allergies to wheat do not increase by giving your child wheat cereal in an early age. In addition, both whole wheat, multi grain and oat cereal do not contain arsenic which may be found in rice cereals (like brown rice cereal). Look for a wheat cereal that features 100% whole wheat grains and is fortified with iron. Give your baby oat cereal. If you want to give your child something other than rice or whole wheat cereal, you can try using oat cereal. It will have little to no arsenic and is still a nutritious  whole grain. Like rice cereals, oat cereal is a great option because it's a single grain cereal. In addition, the likelihood of your child being allergic to oats is very, very low. Again, check the labeling to make sure it's 100% whole grain oats (you'll find this information on the food label). Also, this cereal should be fortified with iron as oats do not have a high level of iron naturally. Preparing Nutritious Cereals for Your Baby Read the package instructions. Regardless of what type of cereal you purchase for your baby, it's important to make sure that you follow the mixing instructions correctly. This will help ensure your baby is getting the right amount of cereal. Each infant cereal will have specific instructions listed on the actual product. Before you purchase a product, make sure you read over the instructions. If you need to cook or heat the cereal, make sure to follow the directions to ensure the cereal is prepared correctly. Always allow a cereal to come down to room temperature before feeding it to your child. The cereal should be mixed until it's a thin and quite liquid consistency. You may need to add more milk or formula to get it to the right consistency. Choose the appropriate liquid to mix with cereals. When preparing an infant or baby cereal, you'll need to mix the dry cereal with a liquid. Take advantage of this opportunity to add more nutrition to your baby's cereal. Most cereals will tell you to mix with breast milk or formula. This helps increase the nutrient content (especially in terms of protein and fat) of the cereal. It's essential that you do this step. You can mix your infant cereal with water if you do not have any breast milk or formula available to you. However, try to limit how often you do this. Toss out unused cereals. Like most baby foods, you do not want to keep prepared cereals long. Feeding your child leftovers can put them in danger of getting sick. You need to be extra careful with how long you store uneaten baby cereals. Babies and infants are the most susceptible to foodborne illness since their immune systems are still immature. If you make extra baby cereal, only put a few tablespoons into a bowl. Do not feed your child from the larger serving. Saliva can contaminate the cereal if you were to store it the refrigerator. Throw out any extra cereal your child didn't consume from their pre-portioned serving. In addition, only keep baby cereal for 24 hrs. Be patient with your child. All children tolerate foods at different stages and at different times. As you and your child get the hang of eating solids, you'll notice your child becomes much better at eating. Children are great at knowing when they are hungry, when they're not and when they want more food. Make sure to follow your child's hunger and satisfaction cues. A baby may turn away his head or not open his lips if he doesn't want any solids or doesn't want anymore of the cereal. Do not try to force feed a child who doesn't want cereal. Even if your child only eats a bite or two, that's OK. There will be other opportunities to try solid foods.",
  "tyn_model":[
    "cereal",
    "iron",
    "cereals",
    "rice cereal",
    "oats",
    "water",
    "oat cereal",
    "breast milk",
    "rice",
    "arsenic",
    "formula",
    "probiotics",
    "barley",
    "– 11",
    "epa",
    "dha",
    "infant cereals",
    "organic foods",
    "food processor",
    "whisk",
    "rice cereals",
    "brown rice",
    "oat",
    "wheat",
    "flax",
    "whole wheat cereal",
    "wheat cereal",
    "milk",
    "liquid",
    "bowl"
  ],
  "tyn_section":[

  ]
}