{
  "title":"How to Draft a Reseller Agreement for Photographs",
  "url":"https://www.wikihow.com/Draft-a-Reseller-Agreement-for-Photographs",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographs"
  ],
  "parts":[
    {
      "name":"Beginning the Reseller Agreement",
      "steps":[
        {
          "headline":"Format your word processing document.",
          "description":"Make sure that it is readable. Use a font size and style that is legible for the average person. Times New Roman 12 point is fairly standard. If you will use many different resellers to sell your photographs, then you should think about creating a template. Use blank lines for information that will change with each contract, such as the date and the name of the reseller."
        },
        {
          "headline":"Title the agreement.",
          "description":"You can title the agreement “Independent Reseller Agreement” or “Reseller Agreement.” Insert the title at the top of the page, centered between the left-hand and right-hand margin."
        },
        {
          "headline":"Identify the parties.",
          "description":"You should identify the reseller, yourself, and the date of the agreement in the first paragraph. Also include the business address for each party. Sample language could read, “This Reseller Agreement (‘Agreement’) is made this [insert blank line for the date] (‘the Effective Date’), by and between [insert your name] (‘Company’) located at [insert your address] and [insert blank line for reseller’s name] (‘Reseller’), with offices at [insert blank line for reseller’s address].”"
        },
        {
          "headline":"Include your recitals.",
          "description":"Recitals are the “whereas” clauses that appear in standard contracts. Your recitals summarize why you and the reseller are entering into the agreement. These recitals can be fragment sentences. Sample recitals could read: “Whereas Reseller wishes to sell Company photographs, and Company wishes Reseller to sell its photographs. Now therefore, in consideration of the mutual covenants contained herein, the parties agree as follows.”"
        },
        {
          "headline":"Include definitions.",
          "description":"You might want to include a section which defines terms that you think might be unclear either to the reseller or to a judge. You can draft this section last. Once you finish the rest of the contract, go through and see if there are any terms that need to be defined. Reseller agreements typically define the term “territory,” since it is so central to the agreement. You might want to limit the reseller’s right to sell your photographs to particular geographic locations. If so, then define the geographic scope of the reseller agreement when you define “territory.”"
        }
      ]
    },
    {
      "name":"Defining the Reseller Agreement",
      "steps":[
        {
          "headline":"State the duration of the agreement.",
          "description":"You can create a reseller’s agreement for any length of time. Be sure to mention also whether the agreement can be renewed at your discretion. Sample language could read, “This Agreement shall be for an initial term of one (1) year from the Effective Date of this Agreement. Thereafter, the Term of Agreement may be renewed for a period of another year.”"
        },
        {
          "headline":"Appoint the reseller.",
          "description":"You need to include a provision where you appoint the reseller and identify what the reseller will do. For example, your reseller might market and sell your photographs. You should also state whether the appointment is exclusive or non-exclusive. A sample appointment provision might read: “Company authorizes and appoints Reseller, and Reseller accepts the appointment, as a non-exclusive reseller to purchase photographs from Company and to market and sell them in the Territory.”"
        },
        {
          "headline":"Place restrictions on the reseller.",
          "description":"You might want to specify here that you are restricting the reseller to sales in the defined territory. You can also explain that you must approve additional sales locations."
        },
        {
          "headline":"Identify the reseller as an independent contractor.",
          "description":"You want to make it crystal clear that the reseller is not your agent or employee. In order to avoid confusion, add a provision stating that the reseller is an independent contractor. You could write, “Neither party shall be deemed agents or employees of the other. Instead, it is understood that both parties are independent contractors for all purposes at all times.”"
        },
        {
          "headline":"Set the price for your photographs.",
          "description":"The reseller buys your photographs and then sells them. Accordingly, you should identify the price that the reseller must pay you for the photographs. You might also want to explain who sets the reseller’s price. Typically, the reseller sets the prices he or she asks consumers to pay. However you can still offer suggested prices. A sample provision might read: “Reseller shall pay $50 for each photograph. Reseller will determine its own resale prices to End Purchasers. From time to time, Company may suggest retail prices to Reseller. At no time shall Reseller publicly share resale prices with any third party other than End Purchasers.”"
        },
        {
          "headline":"Reserve the right to change your prices.",
          "description":"You might want to raise or lower the prices your reseller pays you for each photograph in the future. For this reason, insert a provision granting you the right to revise the prices. You could write, “Company may change the amount charged for all photographs upon thirty (30) days advance written notice to Reseller.”"
        },
        {
          "headline":"Include details about purchase orders and cancellations.",
          "description":"If you want, you can go into detail about how the reseller should order the photographs. You can require that they submit a purchase order. You can also include information about how much time the reseller has to cancel any order."
        }
      ]
    },
    {
      "name":"Explaining Termination",
      "steps":[
        {
          "headline":"Identify how to terminate the agreement without cause.",
          "description":"Sometimes people want to end their contracts early. You can include a provision stating when either you or the reseller can terminate the contract without having to give a reason. You might write, “Company or Reseller may terminate the Agreement without cause after providing ninety (90) days prior written notice to the other party.”"
        },
        {
          "headline":"Identify what actions can trigger termination for cause.",
          "description":"Either you or the reseller might want to terminate “for cause” when the other party breaks the agreement. You should identify the events that can trigger a termination for cause. For example, you might want to include the following:\nThe other party breaches a term of the agreement and fails to fix the breach within 30 days of receiving a notice of the breach. The other party breaches a term of the agreement and it is impossible to fix the breach. The other party dissolves or goes bankrupt. The other party is unable to pay its debts or stops conducting business."
        },
        {
          "headline":"Explain the effects of termination.",
          "description":"Once the agreement ends, you want to make sure that the reseller stops selling your photographs and stops claiming any relationship with you. You should include a provision that explains that the parties will make a clean break after a termination. You should specifically identify the following effects:\nThe reseller will cease to be an authorized reseller of your photographs. All rights and licenses granted by the agreement cease. The reseller shall immediately stop using and distributing your photographs. The reseller shall stop promoting your work and stop taking orders from customers for your photographs."
        }
      ]
    },
    {
      "name":"Protecting Your Intellectual Property",
      "steps":[
        {
          "headline":"Explain that you retain intellectual property rights.",
          "description":"The reseller purchases your physical or digital photographs. The reseller does not have a license to reproduce your pictures or gain other copyrights in the work. You should make this very clear in your reseller agreement. For example, you could clarify by including the following: “All intellectual property rights remain vested solely in Company. Reseller shall have no rights other than the limited rights set forth expressly in this Agreement.”"
        },
        {
          "headline":"Limit the use of your trademarks.",
          "description":"You might have a trademark, such as your company name. You can grant the reseller the right to use your trademark in its marketing materials. However, you should clarify that the reseller does not gain any rights in your trademark by using it in this manner. For example, you could write: “Reseller may use Company’s trademark in all promotional and marketing material as authorized by Company in performance of Reseller’s duties under this Agreement. Reseller shall have no right or claim in the trademark, and Reseller may not make any claim or contest the use of any such trademark. Reseller shall not attempt to register the trademark or any confusingly similar trademark.”"
        },
        {
          "headline":"Include a confidentiality clause.",
          "description":"You also want to protect any confidential information that you share with the reseller. For example, you might share a tentative list of photographs you intend to take in the future, or you could share a customer list. You should include a provision where you and the reseller agree to protect each other’s confidential information. In your definition section, you should define “confidential information.”\nA sample provision could read: “Reseller and Company agree to protect each other’s Confidential Information from unauthorized disclosure. Parties further agree to use the same degree of care that each would use to protect its own confidential information. Neither party shall disclose the confidential information to third parties without the prior written consent of the other party. Neither party shall use the other’s Confidential Information for any purpose other than that necessary to further the purpose of this Agreement. Each agent or employer of Reseller shall execute a document binding said employee or agent to the same level of confidentiality contained herein.”"
        }
      ]
    },
    {
      "name":"Protecting Yourself from a Lawsuit",
      "steps":[
        {
          "headline":"Add an “as is” warranty.",
          "description":"A warranty is a legal promise to stand behind your product. You can try to limit the warranties you make to the reseller. Add a provision in which you warrant your photographs “as is.” This means that you are not making any other promises about your photographs and that the reseller accepts them with any faults that they have. A sample warranty provision could read: “Except as provided herein, the photographs are provided on an “as is” basis without warranty of any kind. Company expressly disclaims all other warranties, whether express, implied, statutory or otherwise, including but not limited to warranties of title, merchantability, fitness for a particular purpose, and non-infringement, as well as warranties arising from a course of dealing or course of performance.”"
        },
        {
          "headline":"Include an indemnification clause.",
          "description":"This is an important clause to have. With it, the reseller agrees to compensate you for any harm arising out of the contract. When the reseller looks over your agreement, he or she might push back on this clause, but you should include it in your draft. An indemnity clause could read: “Company shall not be liable for, and Reseller hereby indemnifies and holds harmless company from any and all claims, actions, losses, damages, and other expenses including reasonable attorney’s fees that may arise out of: (i) any action brought by an End Purchaser, (ii) any breach or violation by Reseller of this agreement, (iii) any breach of a representation made by Reseller in this Agreement, (iv) Reseller’s violation of laws, rules, and regulations of federal, state, or local governments; or (v) any act or omission of Reseller in connection with Reseller’s use of the photographs.”"
        },
        {
          "headline":"Add a limitation on liability.",
          "description":"If you are sued, then the reseller might try to get as much money as they can. For example, your photographs may be defective. The reseller might sue you to be reimbursed for the amount they paid. However, the reseller might claim that your defective photographs caused other damages to their business, such as loss of customers, damaged reputation, etc. These are “consequential” or “special” damages. You should include a provision that limits your liability for these damages. A limitation of liability provision could read: “Company shall not be liable for any incidental, indirect, consequential, or special damages, regardless of whether Company has received advance notice that such losses are possible. This exclusion includes any liability that may arise out of a third party claim against the other party. Additionally, Company’s total liability under this Agreement shall not exceed the amount Reseller has paid Company during the twenty four (24) months preceding the event giving rise to such liability.”"
        }
      ]
    },
    {
      "name":"Finalizing the Agreement",
      "steps":[
        {
          "headline":"Add a notices provision.",
          "description":"Either you or the reseller might need to send written notice under the agreement. You should state the address where you want the notices sent and also explain acceptable methods of sending the notice. Your notice provision could read: “All notices required by this Agreement shall be given to the Party at the address specified on the first page. The notice shall be effective upon actual receipt.”"
        },
        {
          "headline":"Add a choice of law provision.",
          "description":"You can decide which state’s law to use to interpret the contract. Typically, you should choose the state where you do business. Your choice of law provision could read: “This Agreement shall be governed by and construed in accordance with the laws of the State of Michigan.”"
        },
        {
          "headline":"Include a merger clause.",
          "description":"This clause states that the contract contains the entire agreement between you and the reseller. You should also state that any changes to the contract must be made in a writing signed by both parties. A sample merger clause would read: “This Agreement and its attachments constitute the entire Agreement between the Parties with respect to the subject matter contained herein. It may be modified or amended only with a written agreement executed by both parties.”"
        },
        {
          "headline":"Add a severability clause.",
          "description":"If you go to court in a breach of contract lawsuit, then the judge might find that one provision of the contract is invalid. You will want to explain that the rest of the contract should still be enforced. You can clarify this by including a severability clause. A sample severability clause could read: “If any provision is held unenforceable or invalid, then the remaining provisions shall not be affected but shall remain in full force and effect.”"
        },
        {
          "headline":"Add a dispute resolution clause.",
          "description":"If a dispute arises, you will probably want to try and settle the dispute outside of court. You could include a provision where each side agrees to arbitrate the dispute. Arbitration is like a trial; however, you present your case to a panel of arbitrators instead of a judge. Arbitration is typically faster and cheaper than lawsuits. It is also private. You can include an arbitration provision like the following: “Any claim or dispute arising out of this Agreement or the breach thereof shall be settled by arbitration administered by the American Arbitration Association under its Commercial Arbitration Rules. The number of arbitrators shall be three. The place of arbitration shall be [insert the city and state]. Judgment on any award rendered may be entered in any court having jurisdiction thereof.”"
        },
        {
          "headline":"Insert a signature block.",
          "description":"You should insert lines for both your signature and the reseller’s signature. Also include a line for the date. Just above the signature lines, include this language: “In witness whereof, the Parties have signed this Agreement on the date above.”"
        },
        {
          "headline":"Show your agreement to a lawyer.",
          "description":"This article describes a basic reseller agreement. It might not work for everybody. Depending on your needs, you may need to add or revise the agreement. You should show it to a lawyer and ask if you should change anything. To find a qualified attorney, you can contact your local or state bar association and ask for a referral. Also ask other photographers if they have used a lawyer. If so, get the lawyer’s name and schedule a consultation."
        },
        {
          "headline":"Show the agreement to the reseller.",
          "description":"He or she will want to review it before signing. The reseller might have suggestions for changing the agreement. You should agree to everything in the agreement before signing it. After the agreement is signed, give the reseller a copy and keep the original in a safe location."
        }
      ]
    }
  ],
  "text":" Beginning the Reseller Agreement Format your word processing document. Make sure that it is readable. Use a font size and style that is legible for the average person. Times New Roman 12 point is fairly standard. If you will use many different resellers to sell your photographs, then you should think about creating a template. Use blank lines for information that will change with each contract, such as the date and the name of the reseller. Title the agreement. You can title the agreement “Independent Reseller Agreement” or “Reseller Agreement.” Insert the title at the top of the page, centered between the left-hand and right-hand margin. Identify the parties. You should identify the reseller, yourself, and the date of the agreement in the first paragraph. Also include the business address for each party. Sample language could read, “This Reseller Agreement (‘Agreement’) is made this [insert blank line for the date] (‘the Effective Date’), by and between [insert your name] (‘Company’) located at [insert your address] and [insert blank line for reseller’s name] (‘Reseller’), with offices at [insert blank line for reseller’s address].” Include your recitals. Recitals are the “whereas” clauses that appear in standard contracts. Your recitals summarize why you and the reseller are entering into the agreement. These recitals can be fragment sentences. Sample recitals could read: “Whereas Reseller wishes to sell Company photographs, and Company wishes Reseller to sell its photographs. Now therefore, in consideration of the mutual covenants contained herein, the parties agree as follows.” Include definitions. You might want to include a section which defines terms that you think might be unclear either to the reseller or to a judge. You can draft this section last. Once you finish the rest of the contract, go through and see if there are any terms that need to be defined. Reseller agreements typically define the term “territory,” since it is so central to the agreement. You might want to limit the reseller’s right to sell your photographs to particular geographic locations. If so, then define the geographic scope of the reseller agreement when you define “territory.” Defining the Reseller Agreement State the duration of the agreement. You can create a reseller’s agreement for any length of time. Be sure to mention also whether the agreement can be renewed at your discretion. Sample language could read, “This Agreement shall be for an initial term of one (1) year from the Effective Date of this Agreement. Thereafter, the Term of Agreement may be renewed for a period of another year.” Appoint the reseller. You need to include a provision where you appoint the reseller and identify what the reseller will do. For example, your reseller might market and sell your photographs. You should also state whether the appointment is exclusive or non-exclusive. A sample appointment provision might read: “Company authorizes and appoints Reseller, and Reseller accepts the appointment, as a non-exclusive reseller to purchase photographs from Company and to market and sell them in the Territory.” Place restrictions on the reseller. You might want to specify here that you are restricting the reseller to sales in the defined territory. You can also explain that you must approve additional sales locations. Identify the reseller as an independent contractor. You want to make it crystal clear that the reseller is not your agent or employee. In order to avoid confusion, add a provision stating that the reseller is an independent contractor. You could write, “Neither party shall be deemed agents or employees of the other. Instead, it is understood that both parties are independent contractors for all purposes at all times.” Set the price for your photographs. The reseller buys your photographs and then sells them. Accordingly, you should identify the price that the reseller must pay you for the photographs. You might also want to explain who sets the reseller’s price. Typically, the reseller sets the prices he or she asks consumers to pay. However you can still offer suggested prices. A sample provision might read: “Reseller shall pay $50 for each photograph. Reseller will determine its own resale prices to End Purchasers. From time to time, Company may suggest retail prices to Reseller. At no time shall Reseller publicly share resale prices with any third party other than End Purchasers.” Reserve the right to change your prices. You might want to raise or lower the prices your reseller pays you for each photograph in the future. For this reason, insert a provision granting you the right to revise the prices. You could write, “Company may change the amount charged for all photographs upon thirty (30) days advance written notice to Reseller.” Include details about purchase orders and cancellations. If you want, you can go into detail about how the reseller should order the photographs. You can require that they submit a purchase order. You can also include information about how much time the reseller has to cancel any order. Explaining Termination Identify how to terminate the agreement without cause. Sometimes people want to end their contracts early. You can include a provision stating when either you or the reseller can terminate the contract without having to give a reason. You might write, “Company or Reseller may terminate the Agreement without cause after providing ninety (90) days prior written notice to the other party.” Identify what actions can trigger termination for cause. Either you or the reseller might want to terminate “for cause” when the other party breaks the agreement. You should identify the events that can trigger a termination for cause. For example, you might want to include the following:\nThe other party breaches a term of the agreement and fails to fix the breach within 30 days of receiving a notice of the breach. The other party breaches a term of the agreement and it is impossible to fix the breach. The other party dissolves or goes bankrupt. The other party is unable to pay its debts or stops conducting business. Explain the effects of termination. Once the agreement ends, you want to make sure that the reseller stops selling your photographs and stops claiming any relationship with you. You should include a provision that explains that the parties will make a clean break after a termination. You should specifically identify the following effects:\nThe reseller will cease to be an authorized reseller of your photographs. All rights and licenses granted by the agreement cease. The reseller shall immediately stop using and distributing your photographs. The reseller shall stop promoting your work and stop taking orders from customers for your photographs. Protecting Your Intellectual Property Explain that you retain intellectual property rights. The reseller purchases your physical or digital photographs. The reseller does not have a license to reproduce your pictures or gain other copyrights in the work. You should make this very clear in your reseller agreement. For example, you could clarify by including the following: “All intellectual property rights remain vested solely in Company. Reseller shall have no rights other than the limited rights set forth expressly in this Agreement.” Limit the use of your trademarks. You might have a trademark, such as your company name. You can grant the reseller the right to use your trademark in its marketing materials. However, you should clarify that the reseller does not gain any rights in your trademark by using it in this manner. For example, you could write: “Reseller may use Company’s trademark in all promotional and marketing material as authorized by Company in performance of Reseller’s duties under this Agreement. Reseller shall have no right or claim in the trademark, and Reseller may not make any claim or contest the use of any such trademark. Reseller shall not attempt to register the trademark or any confusingly similar trademark.” Include a confidentiality clause. You also want to protect any confidential information that you share with the reseller. For example, you might share a tentative list of photographs you intend to take in the future, or you could share a customer list. You should include a provision where you and the reseller agree to protect each other’s confidential information. In your definition section, you should define “confidential information.”\nA sample provision could read: “Reseller and Company agree to protect each other’s Confidential Information from unauthorized disclosure. Parties further agree to use the same degree of care that each would use to protect its own confidential information. Neither party shall disclose the confidential information to third parties without the prior written consent of the other party. Neither party shall use the other’s Confidential Information for any purpose other than that necessary to further the purpose of this Agreement. Each agent or employer of Reseller shall execute a document binding said employee or agent to the same level of confidentiality contained herein.” Protecting Yourself from a Lawsuit Add an “as is” warranty. A warranty is a legal promise to stand behind your product. You can try to limit the warranties you make to the reseller. Add a provision in which you warrant your photographs “as is.” This means that you are not making any other promises about your photographs and that the reseller accepts them with any faults that they have. A sample warranty provision could read: “Except as provided herein, the photographs are provided on an “as is” basis without warranty of any kind. Company expressly disclaims all other warranties, whether express, implied, statutory or otherwise, including but not limited to warranties of title, merchantability, fitness for a particular purpose, and non-infringement, as well as warranties arising from a course of dealing or course of performance.” Include an indemnification clause. This is an important clause to have. With it, the reseller agrees to compensate you for any harm arising out of the contract. When the reseller looks over your agreement, he or she might push back on this clause, but you should include it in your draft. An indemnity clause could read: “Company shall not be liable for, and Reseller hereby indemnifies and holds harmless company from any and all claims, actions, losses, damages, and other expenses including reasonable attorney’s fees that may arise out of: (i) any action brought by an End Purchaser, (ii) any breach or violation by Reseller of this agreement, (iii) any breach of a representation made by Reseller in this Agreement, (iv) Reseller’s violation of laws, rules, and regulations of federal, state, or local governments; or (v) any act or omission of Reseller in connection with Reseller’s use of the photographs.” Add a limitation on liability. If you are sued, then the reseller might try to get as much money as they can. For example, your photographs may be defective. The reseller might sue you to be reimbursed for the amount they paid. However, the reseller might claim that your defective photographs caused other damages to their business, such as loss of customers, damaged reputation, etc. These are “consequential” or “special” damages. You should include a provision that limits your liability for these damages. A limitation of liability provision could read: “Company shall not be liable for any incidental, indirect, consequential, or special damages, regardless of whether Company has received advance notice that such losses are possible. This exclusion includes any liability that may arise out of a third party claim against the other party. Additionally, Company’s total liability under this Agreement shall not exceed the amount Reseller has paid Company during the twenty four (24) months preceding the event giving rise to such liability.” Finalizing the Agreement Add a notices provision. Either you or the reseller might need to send written notice under the agreement. You should state the address where you want the notices sent and also explain acceptable methods of sending the notice. Your notice provision could read: “All notices required by this Agreement shall be given to the Party at the address specified on the first page. The notice shall be effective upon actual receipt.” Add a choice of law provision. You can decide which state’s law to use to interpret the contract. Typically, you should choose the state where you do business. Your choice of law provision could read: “This Agreement shall be governed by and construed in accordance with the laws of the State of Michigan.” Include a merger clause. This clause states that the contract contains the entire agreement between you and the reseller. You should also state that any changes to the contract must be made in a writing signed by both parties. A sample merger clause would read: “This Agreement and its attachments constitute the entire Agreement between the Parties with respect to the subject matter contained herein. It may be modified or amended only with a written agreement executed by both parties.” Add a severability clause. If you go to court in a breach of contract lawsuit, then the judge might find that one provision of the contract is invalid. You will want to explain that the rest of the contract should still be enforced. You can clarify this by including a severability clause. A sample severability clause could read: “If any provision is held unenforceable or invalid, then the remaining provisions shall not be affected but shall remain in full force and effect.” Add a dispute resolution clause. If a dispute arises, you will probably want to try and settle the dispute outside of court. You could include a provision where each side agrees to arbitrate the dispute. Arbitration is like a trial; however, you present your case to a panel of arbitrators instead of a judge. Arbitration is typically faster and cheaper than lawsuits. It is also private. You can include an arbitration provision like the following: “Any claim or dispute arising out of this Agreement or the breach thereof shall be settled by arbitration administered by the American Arbitration Association under its Commercial Arbitration Rules. The number of arbitrators shall be three. The place of arbitration shall be [insert the city and state]. Judgment on any award rendered may be entered in any court having jurisdiction thereof.” Insert a signature block. You should insert lines for both your signature and the reseller’s signature. Also include a line for the date. Just above the signature lines, include this language: “In witness whereof, the Parties have signed this Agreement on the date above.” Show your agreement to a lawyer. This article describes a basic reseller agreement. It might not work for everybody. Depending on your needs, you may need to add or revise the agreement. You should show it to a lawyer and ask if you should change anything. To find a qualified attorney, you can contact your local or state bar association and ask for a referral. Also ask other photographers if they have used a lawyer. If so, get the lawyer’s name and schedule a consultation. Show the agreement to the reseller. He or she will want to review it before signing. The reseller might have suggestions for changing the agreement. You should agree to everything in the agreement before signing it. After the agreement is signed, give the reseller a copy and keep the original in a safe location.",
  "tyn_model":[
    "photographs",
    "reseller",
    "” include",
    "“company",
    "“reseller",
    "“this",
    "’)",
    "” add",
    "arbitration",
    "“as",
    "lawyer",
    "” or",
    "” insert",
    "“whereas",
    "“territory",
    "“all",
    "word processing document",
    "times new roman 12 point is",
    "“independent",
    "‘agreement",
    "‘the",
    "‘company",
    "‘reseller",
    "” clauses",
    "” since",
    "” defining",
    "reseller’s",
    "” appoint",
    "” place",
    "“neither",
    "” set",
    "” reserve",
    "” identify",
    "“for",
    "” when",
    "intellectual property rights",
    "” limit",
    "“confidential",
    "”\n",
    "” protecting",
    "” warranty",
    "” this",
    "“except",
    "” basis",
    "“consequential",
    "“special",
    "” damages",
    "limitation of liability provision",
    "” finalizing",
    "“if",
    "dispute resolution clause",
    "lawsuits",
    "“any",
    "arbitration association",
    "“in",
    "” show",
    "attorney"
  ],
  "tyn_section":[

  ]
}