{
  "title":"How to Make Nettle Spray for Aphids",
  "url":"https://www.wikihow.com/Make-Nettle-Spray-for-Aphids",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds",
    "Garden Sprays"
  ],
  "methods":[
    {
      "name":"Nettle spray #1",
      "steps":[
        {
          "headline":"Select some nettles from the garden.",
          "description":"Wear gloves when picking and carrying–nettles sting easily."
        },
        {
          "headline":"Place the nettles into a bucket.",
          "description":"Cover the bucket with water."
        },
        {
          "headline":"Leave the nettles to break down in the water.",
          "description":"Leave for 1–2 weeks. The water will turn brown during this time."
        },
        {
          "headline":"Strain out the plant matter.",
          "description":"Dilute with a little water and pour the liquid into a spray bottle."
        },
        {
          "headline":"Spray on plants affected by aphids.",
          "description":"This spray is good for roses, vegetables and fruit trees. Not only will this spray kill the aphids but it will also strengthen the plants that it is sprayed on."
        }
      ]
    },
    {
      "name":"Nettle spray #2",
      "steps":[
        {
          "headline":"Place the nettles into a bucket.",
          "description":"Wear gloves when handling stinging nettles."
        },
        {
          "headline":"Cover with water.",
          "description":"Leave to ferment for 3 weeks. Top up the water if needed but don't dilute it too much."
        },
        {
          "headline":"Strain the liquid.",
          "description":"This will be the spray; discard the nettles (add to your compost)."
        },
        {
          "headline":"Make the nettle spray solution.",
          "description":"Pour the nettle liquid into a spray bottle and add water. The ratio should be 1 part nettle liquid to 7 parts water. Store the remaining nettle liquid in the garden shed for later use."
        },
        {
          "headline":"Spray on plants affected by aphids.",
          "description":"Repeat until all the aphids have gone."
        }
      ]
    }
  ],
  "text":" Nettle spray #1 Select some nettles from the garden. Wear gloves when picking and carrying–nettles sting easily. Place the nettles into a bucket. Cover the bucket with water. Leave the nettles to break down in the water. Leave for 1–2 weeks. The water will turn brown during this time. Strain out the plant matter. Dilute with a little water and pour the liquid into a spray bottle. Spray on plants affected by aphids. This spray is good for roses, vegetables and fruit trees. Not only will this spray kill the aphids but it will also strengthen the plants that it is sprayed on. Nettle spray #2 Place the nettles into a bucket. Wear gloves when handling stinging nettles. Cover with water. Leave to ferment for 3 weeks. Top up the water if needed but don't dilute it too much. Strain the liquid. This will be the spray; discard the nettles (add to your compost). Make the nettle spray solution. Pour the nettle liquid into a spray bottle and add water. The ratio should be 1 part nettle liquid to 7 parts water. Store the remaining nettle liquid in the garden shed for later use. Spray on plants affected by aphids. Repeat until all the aphids have gone.",
  "tyn_model":[
    "water",
    "nettle spray",
    "bucket",
    "spray bottle",
    "nettle liquid",
    "nettles",
    "–nettles"
  ],
  "tyn_section":[

  ]
}