{
  "title":"How to Do Camo Spray Paint",
  "url":"https://www.wikihow.com/Do-Camo-Spray-Paint",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Go to the store and get two different colors of flat or ultra-flat quick-dry spray paint.",
      "description":""
    },
    {
      "headline":"Take the object that you would like to Spray Paint.",
      "description":"(Works best with Nerf guns, Airsoft guns, etc.)"
    },
    {
      "headline":"Spray paint one side with one color, let dry, and repeat on other side with the same color.",
      "description":""
    },
    {
      "headline":"Find a leaf that is not rotted, ripped, or to big or small.",
      "description":"(If you can't find a good leaf, cut leaf like shapes out of paper.)"
    },
    {
      "headline":"Place the leaf on your object.",
      "description":""
    },
    {
      "headline":"Do little bursts of spray paint around the leaf.",
      "description":""
    },
    {
      "headline":"Remove the leaf, place it somewhere else on your object, and repeat.",
      "description":""
    },
    {
      "headline":"When you are done one side, let dry and do the same thing on the other side.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Go to the store and get two different colors of flat or ultra-flat quick-dry spray paint.  Take the object that you would like to Spray Paint. (Works best with Nerf guns, Airsoft guns, etc.) Spray paint one side with one color, let dry, and repeat on other side with the same color.  Find a leaf that is not rotted, ripped, or to big or small. (If you can't find a good leaf, cut leaf like shapes out of paper.) Place the leaf on your object.  Do little bursts of spray paint around the leaf.  Remove the leaf, place it somewhere else on your object, and repeat.  When you are done one side, let dry and do the same thing on the other side.  Finished. ",
  "tyn_model":[
    "spray paint",
    "paint"
  ],
  "tyn_section":[

  ]
}