{
  "title":"How to Tame in ARK: Survival Evolved",
  "url":"https://www.wikihow.com/Tame-in-ARK:-Survival-Evolved",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "methods":[
    {
      "name":"Knock-Out Taming",
      "steps":[
        {
          "headline":"Craft tools necessary for rendering the quarry unconscious.",
          "description":"In order to initiate the taming process, one must render the intended animal asleep. Although many weapons are available to accomplish this, the grind of early game only presents two practical options: the bow and tranq arrows or the wooden club. The bow and tranq arrows are ideal for ranged knock-out, and almost mandatory for taming larger starter dinos such as the trike and stego. To attain tranq arrows, see this page. The wooden club is a melee weapon dealing more torpor damage than attack damage. Using this on smaller starter dinos, such as the dilo or the dodo, saves many resources and achieves the intended effect."
        },
        {
          "headline":"Feed the unconscious dinosaur its intended food required for taming.",
          "description":"Dinosaurs are categorized into two basic categories: carnivores and herbivores (although certain animals require other types of consumables). To keep the taming quarry asleep, one may need to feed the animal narcoberries or narcotics. A taming bar, effectiveness, and unconscious meter are present on a dashboard near the unconscious tame. The taming bar becomes completely green upon a successful tame."
        },
        {
          "headline":"Saddle the tame once the process finishes.",
          "description":"Most dinos and animals require a saddle to ride, yet some do not. Although some are more expensive than others, a saddle provides armor for the tame."
        }
      ]
    },
    {
      "name":"Passive Taming",
      "steps":[
        {
          "headline":"Remain out of the line of the sight of the tame.",
          "description":"In a basic sense, remain behind the tame at all times while in a close proximity. Avoid hitbox contact with the tame. The only exception to this line of sight rule is the Ichthy."
        },
        {
          "headline":"Press \"E\" to feed the tame its intended food.",
          "description":"Passive tames do not require the owner to render the animal or dino unconscious. Once again the tame requires a certain food, depending on whether it is a herbivore or a carnivore. Wait until the option reappears, for the food bar of the tame requires a drop before the animal can consume again. In other words, the tame needs to become \"hungry\" again."
        },
        {
          "headline":"Once the tame is complete, place a saddle on the creature.",
          "description":"Once again, some will not require a saddle to ride the dino or animal."
        }
      ]
    }
  ],
  "text":" Knock-Out Taming Craft tools necessary for rendering the quarry unconscious. In order to initiate the taming process, one must render the intended animal asleep. Although many weapons are available to accomplish this, the grind of early game only presents two practical options: the bow and tranq arrows or the wooden club. The bow and tranq arrows are ideal for ranged knock-out, and almost mandatory for taming larger starter dinos such as the trike and stego. To attain tranq arrows, see this page. The wooden club is a melee weapon dealing more torpor damage than attack damage. Using this on smaller starter dinos, such as the dilo or the dodo, saves many resources and achieves the intended effect. Feed the unconscious dinosaur its intended food required for taming. Dinosaurs are categorized into two basic categories: carnivores and herbivores (although certain animals require other types of consumables). To keep the taming quarry asleep, one may need to feed the animal narcoberries or narcotics. A taming bar, effectiveness, and unconscious meter are present on a dashboard near the unconscious tame. The taming bar becomes completely green upon a successful tame. Saddle the tame once the process finishes. Most dinos and animals require a saddle to ride, yet some do not. Although some are more expensive than others, a saddle provides armor for the tame. Passive Taming Remain out of the line of the sight of the tame. In a basic sense, remain behind the tame at all times while in a close proximity. Avoid hitbox contact with the tame. The only exception to this line of sight rule is the Ichthy. Press \"E\" to feed the tame its intended food. Passive tames do not require the owner to render the animal or dino unconscious. Once again the tame requires a certain food, depending on whether it is a herbivore or a carnivore. Wait until the option reappears, for the food bar of the tame requires a drop before the animal can consume again. In other words, the tame needs to become \"hungry\" again. Once the tame is complete, place a saddle on the creature. Once again, some will not require a saddle to ride the dino or animal.",
  "tyn_model":[
    "saddle",
    "wooden club",
    "bow",
    "trike",
    "stego",
    "dodo",
    "dinosaurs",
    "narcotics",
    "ichthy",
    "food"
  ],
  "tyn_section":[

  ]
}