{
  "title":"How to Reuse Paper",
  "url":"https://www.wikihow.com/Reuse-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Using the Paper to the Fullest",
      "steps":[
        {
          "headline":"Use both sides of the paper.",
          "description":"One of the easiest way to reuse paper is to use the backside of a used piece of paper for a new document or picture. Encourage people in your household or workplace to put used paper in a bin for reuse."
        },
        {
          "headline":"Reuse old paper for a doodling pad.",
          "description":"You can use several sheets of used paper to make a doodle pad for yourself or a child. Gather together several sheets of used paper and cut them in half. Clip or staple all of the half sized sheets of paper together at the top to make a small notepad. Use the notepad to doodle on when you have free time."
        },
        {
          "headline":"Cut off unused portions of paper to use as bookmarks.",
          "description":"Most paper has unused borders on the top, bottom, and sides. You can cut these unused portions off to use for a homemade bookmark. Cut off the unused portions of several sheets of paper. Glue together 3-5 of the unused portions, and then cut it to a bookmark size. Decorate the bookmark. Punch a hole in the top of the bookmark, and attach a ribbon."
        },
        {
          "headline":"Cut used paper into note squares.",
          "description":"Cut a sheet of paper into four equal rectangles. Keep a stack of small squares next to your phone for jotting down notes during phone calls."
        }
      ]
    },
    {
      "name":"Reusing Paper Around the House",
      "steps":[
        {
          "headline":"Use it as packing material.",
          "description":"Wrap breakable items you are packing away with used paper. Crumple up paper and use it to pack around fragile items. Used magazines and newspapers are great for packing material."
        },
        {
          "headline":"Put used paper in a compost bin.",
          "description":"Paper will decompose over time and would be a great addition to a compost bin. Tear up your used paper and mix it into your compost to reuse it in your garden."
        },
        {
          "headline":"Shred used paper for pet cage liner.",
          "description":"Many pet cages like bunnies and hamsters use liners underneath them. You can make your own pet cage liner from used paper by shredding the paper into fine strands. Use a paper shredder to shred all of your unused paper and recycle it to use in your pet’s cage as needed."
        },
        {
          "headline":"Make a fire starter.",
          "description":"Paper is a great fire starter because it burns quickly, so you can use it in your fireplace or fire pit to get the logs burning. Crumple up 1 to 2 sheets of used paper and add them to your logs."
        },
        {
          "headline":"Line the drawers of your refrigerator.",
          "description":"Place a sheet of old newspaper on the bottom of the vegetable drawer in the refrigerator. The newspaper will help the veggies maintain the proper humidity and make cleaning up any drips easy by simply replacing the paper."
        },
        {
          "headline":"Clean with old paper.",
          "description":"Newspaper makes a great streak free wipe for windows. You can also shine stainless steel appliances by rubbing them with a sheet of dampened newspaper. Crumpled sheets of paper can also serve as a scrubbing pad to clean the surfaces of bathrooms or counters."
        }
      ]
    },
    {
      "name":"Crafting with Used Paper",
      "steps":[
        {
          "headline":"Decoupage with old magazines.",
          "description":"Use old magazines to create fun decoupaged crafts by cutting out words and pictures in the magazines and gluing them onto paper or wood. Use a decoupage glue to be able to add layers of glue without ripping the magazine paper. Make a collage on poster board for your wall. Decorate a birdhouse. Make a notebook unique by decoupaging the front cover."
        },
        {
          "headline":"Fold origami.",
          "description":"Origami is the art of paper folding, so it would be a great art project for all of your used paper. You need a square sheet of paper to fold origami, so cut your used paper into perfect squares. Look online for origami tutorials for you to make."
        },
        {
          "headline":"Make paper beads for jewelry.",
          "description":"You can make fun jewelry out of your used paper by making paper beads. Magazine paper and newspaper are especially good for this kind of paper craft. You’ll need paper, glue, and scissors, and toothpicks to make this craft. Cut the paper into strips of various widths. (½ inch, 1 inch, 2 inches)\nLift the end of one strip and put a dab of glue on the back. Roll the paper around a toothpick and put a glue on the last ¼ inch of the paper as you roll so the paper holds the roll. Remove the toothpick and let the bead dry. Repeat the steps with all the strips to create as many beads as you want, and then string the beads on a string to create a necklace or bracelet."
        },
        {
          "headline":"Craft a paper wallet.",
          "description":"Your used paper can become a fun paper wallet to hold your things. To make a paper wallet, you need paper, scissors, and clear packing tape. Magazine paper and used calendar pictures work great for making a paper wallet. Cover the paper completely with clear packing tape. Fold the paper horizontally so that one side is about an inch less than the other side. Tape the sides together leaving the leftover inch open to form a pocket. Fold the pocket in half to create a wallet."
        },
        {
          "headline":"Create new paper.",
          "description":"You can recycle old paper into a brand new sheet by creating paper pulp in a blender. Press the paper pulp into a mold and squeeze the water out. Once your new sheets are dry you can use the paper for a variety of purposes."
        }
      ]
    }
  ],
  "text":" Using the Paper to the Fullest Use both sides of the paper. One of the easiest way to reuse paper is to use the backside of a used piece of paper for a new document or picture. Encourage people in your household or workplace to put used paper in a bin for reuse. Reuse old paper for a doodling pad. You can use several sheets of used paper to make a doodle pad for yourself or a child. Gather together several sheets of used paper and cut them in half. Clip or staple all of the half sized sheets of paper together at the top to make a small notepad. Use the notepad to doodle on when you have free time. Cut off unused portions of paper to use as bookmarks. Most paper has unused borders on the top, bottom, and sides. You can cut these unused portions off to use for a homemade bookmark. Cut off the unused portions of several sheets of paper. Glue together 3-5 of the unused portions, and then cut it to a bookmark size. Decorate the bookmark. Punch a hole in the top of the bookmark, and attach a ribbon. Cut used paper into note squares. Cut a sheet of paper into four equal rectangles. Keep a stack of small squares next to your phone for jotting down notes during phone calls. Reusing Paper Around the House Use it as packing material. Wrap breakable items you are packing away with used paper. Crumple up paper and use it to pack around fragile items. Used magazines and newspapers are great for packing material. Put used paper in a compost bin. Paper will decompose over time and would be a great addition to a compost bin. Tear up your used paper and mix it into your compost to reuse it in your garden. Shred used paper for pet cage liner. Many pet cages like bunnies and hamsters use liners underneath them. You can make your own pet cage liner from used paper by shredding the paper into fine strands. Use a paper shredder to shred all of your unused paper and recycle it to use in your pet’s cage as needed. Make a fire starter. Paper is a great fire starter because it burns quickly, so you can use it in your fireplace or fire pit to get the logs burning. Crumple up 1 to 2 sheets of used paper and add them to your logs. Line the drawers of your refrigerator. Place a sheet of old newspaper on the bottom of the vegetable drawer in the refrigerator. The newspaper will help the veggies maintain the proper humidity and make cleaning up any drips easy by simply replacing the paper. Clean with old paper. Newspaper makes a great streak free wipe for windows. You can also shine stainless steel appliances by rubbing them with a sheet of dampened newspaper. Crumpled sheets of paper can also serve as a scrubbing pad to clean the surfaces of bathrooms or counters. Crafting with Used Paper Decoupage with old magazines. Use old magazines to create fun decoupaged crafts by cutting out words and pictures in the magazines and gluing them onto paper or wood. Use a decoupage glue to be able to add layers of glue without ripping the magazine paper. Make a collage on poster board for your wall. Decorate a birdhouse. Make a notebook unique by decoupaging the front cover. Fold origami. Origami is the art of paper folding, so it would be a great art project for all of your used paper. You need a square sheet of paper to fold origami, so cut your used paper into perfect squares. Look online for origami tutorials for you to make. Make paper beads for jewelry. You can make fun jewelry out of your used paper by making paper beads. Magazine paper and newspaper are especially good for this kind of paper craft. You’ll need paper, glue, and scissors, and toothpicks to make this craft. Cut the paper into strips of various widths. (½ inch, 1 inch, 2 inches)\nLift the end of one strip and put a dab of glue on the back. Roll the paper around a toothpick and put a glue on the last ¼ inch of the paper as you roll so the paper holds the roll. Remove the toothpick and let the bead dry. Repeat the steps with all the strips to create as many beads as you want, and then string the beads on a string to create a necklace or bracelet. Craft a paper wallet. Your used paper can become a fun paper wallet to hold your things. To make a paper wallet, you need paper, scissors, and clear packing tape. Magazine paper and used calendar pictures work great for making a paper wallet. Cover the paper completely with clear packing tape. Fold the paper horizontally so that one side is about an inch less than the other side. Tape the sides together leaving the leftover inch open to form a pocket. Fold the pocket in half to create a wallet. Create new paper. You can recycle old paper into a brand new sheet by creating paper pulp in a blender. Press the paper pulp into a mold and squeeze the water out. Once your new sheets are dry you can use the paper for a variety of purposes.",
  "tyn_model":[
    "paper",
    "glue",
    "newspaper",
    "pet cage liner",
    "magazines",
    "scissors",
    "clear packing tape",
    "doodle pad",
    "notepad",
    "ribbon",
    "newspapers",
    "compost bin",
    "paper shredder",
    "refrigerator",
    "decoupage glue",
    "poster board",
    "notebook",
    "paper beads",
    "paper wallet",
    "magazine paper",
    "paper pulp",
    "blender",
    "water"
  ],
  "tyn_section":[

  ]
}