{
  "title":"How to Make Choko Curry",
  "url":"https://www.wikihow.com/Make-Choko-Curry",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Choko coconut curry",
      "steps":[
        {
          "headline":"Heat the oil in a wok or frying pan over medium heat.",
          "description":""
        },
        {
          "headline":"Add the onion and garlic.",
          "description":"Sauté until gently cooked. Add the potatoes and cook until some of the sides of the potatoes are golden (stir frequently)."
        },
        {
          "headline":"Add the curry paste and stir through.",
          "description":"Add the coconut milk, chokos, sugar and sauce."
        },
        {
          "headline":"Bring to the boil.",
          "description":"Reduce heat and leave to simmer until the choko turns almost tender."
        },
        {
          "headline":"Serve with rice or quinoa.",
          "description":""
        }
      ]
    },
    {
      "name":"Choko fruit curry",
      "steps":[
        {
          "headline":"Peel the chokos.",
          "description":"Cut into pieces or chunks."
        },
        {
          "headline":"Peel and chop the onion.",
          "description":"Also chop the carrot, apple and dried apricots."
        },
        {
          "headline":"Add the ingredients to a large, heavy-based saucepan.",
          "description":""
        },
        {
          "headline":"Simmer over low to medium heat for 20 minutes.",
          "description":"When the carrot has softened, the curry is ready."
        },
        {
          "headline":"Serve.",
          "description":"Add a bit of yogurt and serve with rice."
        }
      ]
    },
    {
      "name":"Choko and sweet potato curry",
      "steps":[
        {
          "headline":"Prepare the vegetable ingredients.",
          "description":"Peel and chop the sweet potato into chunks. Boil until soft. Peel the choko. Remove the seeds and chop into cubes. Remove the skins from the tomatoes and chop finely. Dice the onion. Dice the garlic."
        },
        {
          "headline":"Add the oil to a large frying pan or large pot.",
          "description":"Add the mustard seeds. Cook until they pop."
        },
        {
          "headline":"Add the curry leaves and fry for a minute.",
          "description":"Add the onions and sauté until they turn clear. Add the garlic and cook until it turns golden brown."
        },
        {
          "headline":"Add the remaining spices.",
          "description":"Stir through and heat. Be careful not to let them burn."
        },
        {
          "headline":"Add a little water to soften the spice mixture.",
          "description":"Add the choko pieces and sweet potato and cook for 5 or so minutes to soften. Stir often."
        },
        {
          "headline":"Add the tomatoes.",
          "description":"Simmer for 5 minutes."
        },
        {
          "headline":"Continue to cook until the choko softens sufficiently.",
          "description":"Add more water if there isn't enough liquid. Stir now and then to prevent anything from sticking."
        },
        {
          "headline":"Place rice on the serving plates.",
          "description":"Spoon the choko and sweet potato curry over the top. Garnish with the fresh coriander."
        },
        {
          "headline":"Serve immediately.",
          "description":""
        }
      ]
    }
  ],
  "text":" Choko coconut curry Heat the oil in a wok or frying pan over medium heat.  Add the onion and garlic. Sauté until gently cooked. Add the potatoes and cook until some of the sides of the potatoes are golden (stir frequently). Add the curry paste and stir through. Add the coconut milk, chokos, sugar and sauce. Bring to the boil. Reduce heat and leave to simmer until the choko turns almost tender. Serve with rice or quinoa.  Choko fruit curry Peel the chokos. Cut into pieces or chunks. Peel and chop the onion. Also chop the carrot, apple and dried apricots. Add the ingredients to a large, heavy-based saucepan.  Simmer over low to medium heat for 20 minutes. When the carrot has softened, the curry is ready. Serve. Add a bit of yogurt and serve with rice. Choko and sweet potato curry Prepare the vegetable ingredients. Peel and chop the sweet potato into chunks. Boil until soft. Peel the choko. Remove the seeds and chop into cubes. Remove the skins from the tomatoes and chop finely. Dice the onion. Dice the garlic. Add the oil to a large frying pan or large pot. Add the mustard seeds. Cook until they pop. Add the curry leaves and fry for a minute. Add the onions and sauté until they turn clear. Add the garlic and cook until it turns golden brown. Add the remaining spices. Stir through and heat. Be careful not to let them burn. Add a little water to soften the spice mixture. Add the choko pieces and sweet potato and cook for 5 or so minutes to soften. Stir often. Add the tomatoes. Simmer for 5 minutes. Continue to cook until the choko softens sufficiently. Add more water if there isn't enough liquid. Stir now and then to prevent anything from sticking. Place rice on the serving plates. Spoon the choko and sweet potato curry over the top. Garnish with the fresh coriander. Serve immediately. ",
  "tyn_model":[
    "sweet potato",
    "onion",
    "garlic",
    "rice",
    "oil",
    "potatoes",
    "carrot",
    "tomatoes",
    "water",
    "coconut curry",
    "wok or frying",
    "curry paste",
    "coconut milk",
    "chokos",
    "sugar",
    "sauce",
    "quinoa",
    "choko fruit curry",
    "apple",
    "apricots",
    "heavy-based saucepan",
    "yogurt",
    "vegetable",
    "large frying pan",
    "mustard seeds",
    "curry leaves",
    "onions",
    "spices",
    "serving plates",
    "fresh coriander"
  ],
  "tyn_section":[

  ]
}