{
  "title":"How to Dine Al Fresco",
  "url":"https://www.wikihow.com/Dine-Al-Fresco",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Cooking for the Outdoors",
      "steps":[
        {
          "headline":"Keep your recipes simple.",
          "description":"Eating outside is about letting the atmosphere flavor your food. Most of the time, if you're able to eat outside, the weather is nice, and fresh produce is in season. Let it shine with simple preparations, such as grilled corn on the cob with butter, a simple chopped fruit salad, and sliced tomatoes with a sprinkling of salt. Plus, keeping it simple will allow you to enjoy your time outside, as you won't be as focused on getting the meal completed. You'll have more time to relax."
        },
        {
          "headline":"Add fresh tastes.",
          "description":"Eating outside creates a feeling of freshness, and you can incorporate that in your food. Try adding fresh herbs to your favorite vinaigrette recipe or add finely chopped mint to your fruit salad. You could also add a fresh squeeze of lemon over a piece of grilled fish."
        },
        {
          "headline":"Have as much food ready as possible.",
          "description":"If you're hosting friends or even if you're just having a quiet dinner at home, it's best to get everything as close to ready as possible before you head outdoors. If you're eating an oven- or stove-prepared meal, you can have the whole dinner ready. If you're planning on grilling, get everything prepped and ready to go on the grill before heading outside. That way, you are ready to start grilling as soon as people are there."
        },
        {
          "headline":"Invite people to bring food.",
          "description":"If you're having people over, keep it simple by asking everyone to bring a dish. Most people won't mind, and then you're only stuck doing a main dish and a few odds and ends."
        },
        {
          "headline":"Don't forget the drinks.",
          "description":"When you're outside, you're going to work up a thirst. Have lots of iced beverages on hand, such as ice water, iced tea, or lemonade. You can also have a signature alcoholic drink, such as a sangria or fruit punch, or you can just have a bucket of beers over ice."
        }
      ]
    },
    {
      "name":"Keeping Food Safe to Eat",
      "steps":[
        {
          "headline":"Scrub down the table.",
          "description":"Even if you're putting a tablecloth down, it's best to scrub the table clean with disinfectant first. That way, you won't risk transferring bacteria from the table to your food while you eat."
        },
        {
          "headline":"Keep your food at the right temperature.",
          "description":"If you're cooking outside, make sure to hold the meat (pre-grilling) and other cold foods in the fridge until you're ready to cook. Similarly, keep salads in the fridge and hot foods warm until you're ready to eat. Keeping foods at unsafe temperatures for too long increases the risk of bacteria growing in your food."
        },
        {
          "headline":"Wash your produce.",
          "description":"When you're out on the patio, you may skip washing that luscious looking peach because you want to dig in. Therefore, it's a better idea to wash and scrub everything ahead of time when you're inside, so you don't have to worry about it when you get outside."
        },
        {
          "headline":"Keep raw meat separate from other foods.",
          "description":"When you're cooking outdoors, it's easy to get distracted. If you get distracted, you may not notice that you used the same tongs for the vegetables that you did for the raw meat. Make sure to keep everything separate, and bring out extra platters and utensils, just in case you find yourself in need of a place to stick something that's not contaminated."
        }
      ]
    },
    {
      "name":"Making the Outdoors More Enjoyable",
      "steps":[
        {
          "headline":"Add some light when it gets dark.",
          "description":"If you plan to be out in the evening, you're likely going to end up needing some light. You can turn on the porch light, but you can also add strings of lights and candles or torches to create a fun atmosphere."
        },
        {
          "headline":"Secure everything.",
          "description":"No matter where you are, a wind can kick up without notice. It's important to make sure you have everything clipped or weighted down. For instance, if you want to use a tablecloth, invest in some tablecloth clips to ensure it will stay put. Place napkins under heavier objects, such as platters. Cloth napkins are less likely to be caught by the wind than paper napkins. Make sure any decorations you add are secured well. For instance, tape or nail down hung decorations well. Pick more solid centerpieces, such as bowls of fruit, over lighter ones, such as a basket of fake flowers."
        },
        {
          "headline":"Skip the paper plates.",
          "description":"Paper plates and plasticware have a tendency to fly away or go limp. If you're dining on your patio, your regular plates will work just fine. If you don't want to risk damage to your everyday plates, invest in some heavy-duty picnic plates and silverware. Similarly, regular glasses are less likely to blow away than plastic cups."
        },
        {
          "headline":"Find some shade.",
          "description":"If you're eating outdoors, you have to deal with the elements. A little shade can go a long way towards making your experience more enjoyable. Try setting up your dining area under trees. Alternatively, set up a large shade umbrella or create a canopy. Keep in mind that if you live in a warm area, setting up your dining area right near a brick wall could make it feel warmer."
        },
        {
          "headline":"Add warmth with a fire pit.",
          "description":"If you live in a cool area, you can still dine al fresco. You just need to make a few changes. A fire pit is a great way to add warmth to your yard. You can even make it the centerpiece of a party, where you roast hot dogs and marshmallows on sticks. Plus, it adds light to your yard when it gets dark."
        },
        {
          "headline":"Keep the bugs away with citronella candles.",
          "description":"Bugs are always an issue when you're outside. However, you can cut down on the insects by lighting citronella candles or torches. You can also wear bug spray. Be sure to clean up any spills right away, so you don't draw more bugs. Also, have covers for all your dishes to keep the bugs out."
        }
      ]
    },
    {
      "name":"Eating Al Fresco Away from Home",
      "steps":[
        {
          "headline":"Find local restaurants with patio dining.",
          "description":"Many restaurants offer patio dining, particularly if you live in an area with nice weather. If you're not sure what restaurants in your area offer it, call around or search online to see if you can find any. Also, keep your eyes peeled when you're out and about. You're sure to notice some restaurants with a patio."
        },
        {
          "headline":"Check the weather.",
          "description":"You obviously don't want to eat outside when it's too hot or too cold. However, you also want to keep an eye out for storms and high winds, which will make dining al fresco no fun at all. It's a good idea to call ahead to the restaurant, as many restaurants won't seat on the patio in bad weather."
        },
        {
          "headline":"Hang out and enjoy the atmosphere.",
          "description":"One of the big pluses of dining al fresco is to have a leisurely meal where you linger over drinks or coffee at the end. Take the time to really enjoy being outside."
        },
        {
          "headline":"Try farm-to-table meals.",
          "description":"Many local farmer's markets are now offering produce-inspired one-off meals. You dine outside with neighbors and others from your community as you enjoy the fresh produce from local farms. Check at your local farmer's market to see if they offer this type of event."
        }
      ]
    }
  ],
  "text":" Cooking for the Outdoors Keep your recipes simple. Eating outside is about letting the atmosphere flavor your food. Most of the time, if you're able to eat outside, the weather is nice, and fresh produce is in season. Let it shine with simple preparations, such as grilled corn on the cob with butter, a simple chopped fruit salad, and sliced tomatoes with a sprinkling of salt. Plus, keeping it simple will allow you to enjoy your time outside, as you won't be as focused on getting the meal completed. You'll have more time to relax. Add fresh tastes. Eating outside creates a feeling of freshness, and you can incorporate that in your food. Try adding fresh herbs to your favorite vinaigrette recipe or add finely chopped mint to your fruit salad. You could also add a fresh squeeze of lemon over a piece of grilled fish. Have as much food ready as possible. If you're hosting friends or even if you're just having a quiet dinner at home, it's best to get everything as close to ready as possible before you head outdoors. If you're eating an oven- or stove-prepared meal, you can have the whole dinner ready. If you're planning on grilling, get everything prepped and ready to go on the grill before heading outside. That way, you are ready to start grilling as soon as people are there. Invite people to bring food. If you're having people over, keep it simple by asking everyone to bring a dish. Most people won't mind, and then you're only stuck doing a main dish and a few odds and ends. Don't forget the drinks. When you're outside, you're going to work up a thirst. Have lots of iced beverages on hand, such as ice water, iced tea, or lemonade. You can also have a signature alcoholic drink, such as a sangria or fruit punch, or you can just have a bucket of beers over ice. Keeping Food Safe to Eat Scrub down the table. Even if you're putting a tablecloth down, it's best to scrub the table clean with disinfectant first. That way, you won't risk transferring bacteria from the table to your food while you eat. Keep your food at the right temperature. If you're cooking outside, make sure to hold the meat (pre-grilling) and other cold foods in the fridge until you're ready to cook. Similarly, keep salads in the fridge and hot foods warm until you're ready to eat. Keeping foods at unsafe temperatures for too long increases the risk of bacteria growing in your food. Wash your produce. When you're out on the patio, you may skip washing that luscious looking peach because you want to dig in. Therefore, it's a better idea to wash and scrub everything ahead of time when you're inside, so you don't have to worry about it when you get outside. Keep raw meat separate from other foods. When you're cooking outdoors, it's easy to get distracted. If you get distracted, you may not notice that you used the same tongs for the vegetables that you did for the raw meat. Make sure to keep everything separate, and bring out extra platters and utensils, just in case you find yourself in need of a place to stick something that's not contaminated. Making the Outdoors More Enjoyable Add some light when it gets dark. If you plan to be out in the evening, you're likely going to end up needing some light. You can turn on the porch light, but you can also add strings of lights and candles or torches to create a fun atmosphere. Secure everything. No matter where you are, a wind can kick up without notice. It's important to make sure you have everything clipped or weighted down. For instance, if you want to use a tablecloth, invest in some tablecloth clips to ensure it will stay put. Place napkins under heavier objects, such as platters. Cloth napkins are less likely to be caught by the wind than paper napkins. Make sure any decorations you add are secured well. For instance, tape or nail down hung decorations well. Pick more solid centerpieces, such as bowls of fruit, over lighter ones, such as a basket of fake flowers. Skip the paper plates. Paper plates and plasticware have a tendency to fly away or go limp. If you're dining on your patio, your regular plates will work just fine. If you don't want to risk damage to your everyday plates, invest in some heavy-duty picnic plates and silverware. Similarly, regular glasses are less likely to blow away than plastic cups. Find some shade. If you're eating outdoors, you have to deal with the elements. A little shade can go a long way towards making your experience more enjoyable. Try setting up your dining area under trees. Alternatively, set up a large shade umbrella or create a canopy. Keep in mind that if you live in a warm area, setting up your dining area right near a brick wall could make it feel warmer. Add warmth with a fire pit. If you live in a cool area, you can still dine al fresco. You just need to make a few changes. A fire pit is a great way to add warmth to your yard. You can even make it the centerpiece of a party, where you roast hot dogs and marshmallows on sticks. Plus, it adds light to your yard when it gets dark. Keep the bugs away with citronella candles. Bugs are always an issue when you're outside. However, you can cut down on the insects by lighting citronella candles or torches. You can also wear bug spray. Be sure to clean up any spills right away, so you don't draw more bugs. Also, have covers for all your dishes to keep the bugs out. Eating Al Fresco Away from Home Find local restaurants with patio dining. Many restaurants offer patio dining, particularly if you live in an area with nice weather. If you're not sure what restaurants in your area offer it, call around or search online to see if you can find any. Also, keep your eyes peeled when you're out and about. You're sure to notice some restaurants with a patio. Check the weather. You obviously don't want to eat outside when it's too hot or too cold. However, you also want to keep an eye out for storms and high winds, which will make dining al fresco no fun at all. It's a good idea to call ahead to the restaurant, as many restaurants won't seat on the patio in bad weather. Hang out and enjoy the atmosphere. One of the big pluses of dining al fresco is to have a leisurely meal where you linger over drinks or coffee at the end. Take the time to really enjoy being outside. Try farm-to-table meals. Many local farmer's markets are now offering produce-inspired one-off meals. You dine outside with neighbors and others from your community as you enjoy the fresh produce from local farms. Check at your local farmer's market to see if they offer this type of event.",
  "tyn_model":[
    "plates",
    "torches",
    "napkins",
    "fire pit",
    "citronella candles",
    "grilled corn",
    "butter",
    "tomatoes",
    "salt",
    "mint",
    "fruit salad",
    "lemon",
    "grilled fish",
    "grilling",
    "grill",
    "food",
    "ice water",
    "iced tea",
    "lemonade",
    "fruit punch",
    "salads",
    "produce",
    "meat",
    "tongs",
    "utensils",
    "candles",
    "tablecloth",
    "bowls",
    "plasticware",
    "silverware",
    "umbrella",
    "dishes",
    "patio"
  ],
  "tyn_section":[

  ]
}