{
  "title":"How to Make Butterscotch Sauce",
  "url":"https://www.wikihow.com/Make-Butterscotch-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "parts":[
    {
      "name":"Gathering Your Ingredients",
      "steps":[
        {
          "headline":"Go for unsalted, rather than salted, butter.",
          "description":"Using unsalted butter is preferable because this way you can control how salty your sauce becomes. If you only have semi-salted or salted butter, omit the salt noted in the ingredients. Taste the sauce once it's made and adjust the seasoning with more salt if needed."
        },
        {
          "headline":"Use high-quality vanilla extract.",
          "description":"Though you can definitely use basic vanilla extract for this recipe, high quality vanilla extract makes a big difference in terms of taste. You can also make your own vanilla extract by infusing vanilla beans in an alcohol like vodka, brandy, or rum. It's easy to do and you can refill the bottle endlessly without having to splurge."
        },
        {
          "headline":"Don't use regular table salt.",
          "description":"Table salt has a harsh taste that will be too strong for this sweet sauce. Any kind of sea salt, flaky or fine, is good. But for the best taste, use fleur de sel, which has a subtle salty flavor that pairs well with sweets."
        },
        {
          "headline":"Make the sauce lactose-free, if necessary.",
          "description":"If you have an allergy to dairy, you can replace the regular butter and cream with goats' milk butter and lactose-free cream. The sauce will turn out just as delicious."
        }
      ]
    },
    {
      "name":"Making the Sauce",
      "steps":[
        {
          "headline":"Take out a medium, heavy-bottomed saucepan.",
          "description":"Place it on the stove and turn the stove to medium heat."
        },
        {
          "headline":"Melt ½ cup butter in the saucepan.",
          "description":"Keep an eye on the butter as it melts so it doesn't burn or brown."
        },
        {
          "headline":"Add 1 cup brown sugar, 1 cup heavy cream, and ½ tsp salt.",
          "description":"Use a flat whisk to whisk the ingredients together until they are well blended."
        },
        {
          "headline":"Bring the sauce to a gentle boil.",
          "description":"Cook for 5 minutes, stirring occasionally."
        },
        {
          "headline":"Remove the sauce from the heat.",
          "description":"Add 2 teaspoons vanilla extract and the vanilla seeds, if using them. Whisk to combine."
        },
        {
          "headline":"Taste the sauce.",
          "description":"If you feel it still needs more salt, sprinkle in more sea salt until you reach a flavor that makes your mouth water with delight. If you're making the sauce for an adult crowd, add a shot of bourbon to the sauce to give it a little kick."
        },
        {
          "headline":"Serve the sauce warm or cool.",
          "description":"The sauce will thicken a little as it cools, but it will remain soft enough that you can spoon it straight out of the fridge. Butterscotch sauce is great over roasted pears, vanilla ice cream, and pound cake. Store the sauce in an airtight container in the fridge for up to 2 weeks."
        }
      ]
    }
  ],
  "text":" Gathering Your Ingredients Go for unsalted, rather than salted, butter. Using unsalted butter is preferable because this way you can control how salty your sauce becomes. If you only have semi-salted or salted butter, omit the salt noted in the ingredients. Taste the sauce once it's made and adjust the seasoning with more salt if needed. Use high-quality vanilla extract. Though you can definitely use basic vanilla extract for this recipe, high quality vanilla extract makes a big difference in terms of taste. You can also make your own vanilla extract by infusing vanilla beans in an alcohol like vodka, brandy, or rum. It's easy to do and you can refill the bottle endlessly without having to splurge. Don't use regular table salt. Table salt has a harsh taste that will be too strong for this sweet sauce. Any kind of sea salt, flaky or fine, is good. But for the best taste, use fleur de sel, which has a subtle salty flavor that pairs well with sweets. Make the sauce lactose-free, if necessary. If you have an allergy to dairy, you can replace the regular butter and cream with goats' milk butter and lactose-free cream. The sauce will turn out just as delicious. Making the Sauce Take out a medium, heavy-bottomed saucepan. Place it on the stove and turn the stove to medium heat. Melt ½ cup butter in the saucepan. Keep an eye on the butter as it melts so it doesn't burn or brown. Add 1 cup brown sugar, 1 cup heavy cream, and ½ tsp salt. Use a flat whisk to whisk the ingredients together until they are well blended. Bring the sauce to a gentle boil. Cook for 5 minutes, stirring occasionally. Remove the sauce from the heat. Add 2 teaspoons vanilla extract and the vanilla seeds, if using them. Whisk to combine. Taste the sauce. If you feel it still needs more salt, sprinkle in more sea salt until you reach a flavor that makes your mouth water with delight. If you're making the sauce for an adult crowd, add a shot of bourbon to the sauce to give it a little kick. Serve the sauce warm or cool. The sauce will thicken a little as it cools, but it will remain soft enough that you can spoon it straight out of the fridge. Butterscotch sauce is great over roasted pears, vanilla ice cream, and pound cake. Store the sauce in an airtight container in the fridge for up to 2 weeks.",
  "tyn_model":[
    "butter",
    "vanilla extract",
    "salt",
    "table salt",
    "sea salt",
    "saucepan",
    "stove",
    "unsalted butter",
    "vanilla beans",
    "rum",
    "fleur",
    "cream",
    "goats' milk butter",
    "lactose-free cream",
    "brown sugar",
    "heavy cream",
    "flat whisk",
    "vanilla seeds",
    "bourbon",
    "butterscotch sauce",
    "vanilla ice cream",
    "pound cake"
  ],
  "tyn_section":[

  ]
}