{
  "title":"How to Make Gluten Free Flour Tortillas",
  "url":"https://www.wikihow.com/Make-Gluten-Free-Flour-Tortillas",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes",
    "Gluten Free Dishes"
  ],
  "steps":[
    {
      "headline":"Mix all of the dry ingredients together, thoroughly.",
      "description":""
    },
    {
      "headline":"Cut in the shortening, followed by the milk and mix until it forms a ball.",
      "description":""
    },
    {
      "headline":"Put the ball onto a floured surface and knead it (using the sweet rice or tapioca flour) until smooth.",
      "description":""
    },
    {
      "headline":"Cover the mixture with plastic wrap and let it rest for an hour.",
      "description":""
    },
    {
      "headline":"Shape the dough into a long cylinder and cut it into 12 pieces, as evenly distributed as you can.",
      "description":""
    },
    {
      "headline":"Put the pieces on a plate and cover with a damp paper towel.",
      "description":"You have to do this or the dough will dry out too quickly."
    },
    {
      "headline":"Roll out the dough, one by one, using as little of the sweet rice flour as you can get away with.",
      "description":""
    },
    {
      "headline":"Using a 9\" plate as a template, make circles with the dough.",
      "description":""
    },
    {
      "headline":"Stack the circles.",
      "description":"As you finish the circles, place them onto a flat surface between layers of wax paper. This will keep them from sticking together."
    },
    {
      "headline":"Put a flat bottomed frying pan on the stove to heat, about medium high, with a little olive or coconut oil.",
      "description":""
    },
    {
      "headline":"Carefully slide each flour in to fry for 30 seconds on each side.",
      "description":""
    },
    {
      "headline":"Let cool.",
      "description":""
    },
    {
      "headline":"Store in a sealed plastic or Ziploc bag in the refrigerator.",
      "description":""
    }
  ],
  "text":" Mix all of the dry ingredients together, thoroughly.  Cut in the shortening, followed by the milk and mix until it forms a ball.  Put the ball onto a floured surface and knead it (using the sweet rice or tapioca flour) until smooth.  Cover the mixture with plastic wrap and let it rest for an hour.  Shape the dough into a long cylinder and cut it into 12 pieces, as evenly distributed as you can.  Put the pieces on a plate and cover with a damp paper towel. You have to do this or the dough will dry out too quickly. Roll out the dough, one by one, using as little of the sweet rice flour as you can get away with.  Using a 9\" plate as a template, make circles with the dough.  Stack the circles. As you finish the circles, place them onto a flat surface between layers of wax paper. This will keep them from sticking together. Put a flat bottomed frying pan on the stove to heat, about medium high, with a little olive or coconut oil.  Carefully slide each flour in to fry for 30 seconds on each side.  Let cool.  Store in a sealed plastic or Ziploc bag in the refrigerator. ",
  "tyn_model":[
    "shortening",
    "milk",
    "sweet rice",
    "tapioca flour",
    "plastic wrap",
    "plate",
    "sweet rice flour",
    "9\" plate",
    "wax paper",
    "frying pan",
    "stove",
    "olive or",
    "coconut oil",
    "flour",
    "ziploc bag",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}