{
  "title":"How to Make Creme Fraiche",
  "url":"https://www.wikihow.com/Make-Creme-Fraiche",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine",
    "French Cuisine"
  ],
  "methods":[
    {
      "name":"Basic Crème fraiche",
      "steps":[
        {
          "headline":"Pour one cup of heavy cream into a jar with a lid.",
          "description":"If you prefer, you can use yogurt instead of heavy cream but the results will be a bit runnier than traditional Crème fraiche."
        },
        {
          "headline":"Add one tablespoon of buttermilk.",
          "description":"Put the lid on the jar and shake well for fifteen to twenty seconds."
        },
        {
          "headline":"Place the closed jar on a windowsill.",
          "description":"The cream needs to sit for 24 hours in order to form. Stir one to two times during this waiting period."
        },
        {
          "headline":"Stir the thickened Crème fraiche.",
          "description":"It should be quite thick now, peaking with the spoon. Refrigerate for six hours before serving."
        },
        {
          "headline":"Serve and enjoy!",
          "description":"The Crème fraiche is good for 7-10 days before needing to be discarded. Keep refrigerated in a sealed container."
        }
      ]
    },
    {
      "name":"Variations of Crème fraiche",
      "steps":[
        {
          "headline":"Make sweetened Crème fraiche.",
          "description":"Add one to two tablespoons of powdered sugar to taste, and stir well. If desired, add one teaspoon of vanilla as well."
        },
        {
          "headline":"Whip your Crème fraiche.",
          "description":"Use a whisk or an egg-beater to beat the Crème fraiche. It should peak, but will not become stiff like classic whipped cream."
        },
        {
          "headline":"Try herbed Crème fraiche.",
          "description":"Add chives and tarragon with a bit of lemon juice, salt, and pepper for a savory variation that perfectly complements meat."
        }
      ]
    },
    {
      "name":"Cooking with Crème fraiche",
      "steps":[
        {
          "headline":"Try scrambled eggs with Crème fraiche.",
          "description":"For the lightest, creamiest eggs add one to two tablespoons and whisk well before cooking over low heat."
        },
        {
          "headline":"Substitute Crème fraiche for cream in soups.",
          "description":"Using your favorite cream-based soup or chowder recipe, switch out the cream for Crème fraiche in half the amount. This will provide a more rich texture as well as a slightly enhanced flavor."
        },
        {
          "headline":"Make creamy mashed potatoes.",
          "description":"After boiling and mashing your potatoes, add in half a cup of Crème fraiche with a bit of softened butter and blend. The resulting mashed potatoes will be creamy and light, a perfect side dish."
        },
        {
          "headline":"Serve Crème fraiche with grilled fruit for dessert.",
          "description":"Choose a fruit to your liking, although peaches and apricots work well, and grill them with a little brown sugar. Serve with a dollop of Crème fraiche."
        }
      ]
    }
  ],
  "text":" Basic Crème fraiche Pour one cup of heavy cream into a jar with a lid. If you prefer, you can use yogurt instead of heavy cream but the results will be a bit runnier than traditional Crème fraiche. Add one tablespoon of buttermilk. Put the lid on the jar and shake well for fifteen to twenty seconds. Place the closed jar on a windowsill. The cream needs to sit for 24 hours in order to form. Stir one to two times during this waiting period. Stir the thickened Crème fraiche. It should be quite thick now, peaking with the spoon. Refrigerate for six hours before serving. Serve and enjoy! The Crème fraiche is good for 7-10 days before needing to be discarded. Keep refrigerated in a sealed container. Variations of Crème fraiche Make sweetened Crème fraiche. Add one to two tablespoons of powdered sugar to taste, and stir well. If desired, add one teaspoon of vanilla as well. Whip your Crème fraiche. Use a whisk or an egg-beater to beat the Crème fraiche. It should peak, but will not become stiff like classic whipped cream. Try herbed Crème fraiche. Add chives and tarragon with a bit of lemon juice, salt, and pepper for a savory variation that perfectly complements meat. Cooking with Crème fraiche Try scrambled eggs with Crème fraiche. For the lightest, creamiest eggs add one to two tablespoons and whisk well before cooking over low heat. Substitute Crème fraiche for cream in soups. Using your favorite cream-based soup or chowder recipe, switch out the cream for Crème fraiche in half the amount. This will provide a more rich texture as well as a slightly enhanced flavor. Make creamy mashed potatoes. After boiling and mashing your potatoes, add in half a cup of Crème fraiche with a bit of softened butter and blend. The resulting mashed potatoes will be creamy and light, a perfect side dish. Serve Crème fraiche with grilled fruit for dessert. Choose a fruit to your liking, although peaches and apricots work well, and grill them with a little brown sugar. Serve with a dollop of Crème fraiche.",
  "tyn_model":[
    "crème fraiche",
    "cream",
    "heavy cream",
    "potatoes",
    "yogurt",
    "buttermilk",
    "spoon",
    "sweetened crème fraiche",
    "powdered sugar",
    "vanilla",
    "whisk",
    "egg-beater",
    "whipped cream",
    "chives",
    "tarragon",
    "lemon juice",
    "salt",
    "pepper",
    "scrambled eggs",
    "eggs",
    "butter",
    "grilled fruit",
    "apricots",
    "brown sugar"
  ],
  "tyn_section":[

  ]
}