{
  "title":"How to Escape the Crimson Room",
  "url":"https://www.wikihow.com/Escape-the-Crimson-Room",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "steps":[
    {
      "headline":"Understand the game controls.",
      "description":"In this game, you move around, collect and use items by clicking. The items you currently have are in your inventory, which is located on the right side of the screen."
    },
    {
      "headline":"Read through the text on the screen explaining how you ended up in the room.",
      "description":"You will then awaken in the Crimson Room. While facing the ceiling, click toward the bottom of the game window to look down. You should now be facing a blue door and a yellow chest of drawers holding various items."
    },
    {
      "headline":"Click to zoom in on the table, and then again to zoom in on the yellow bowl that sits on top.",
      "description":"Take the thin ring inside of it."
    },
    {
      "headline":"Open the two drawers that don't have keyholes.",
      "description":"In the drawer on the upper-left, you will find a CD, and in the other a memo."
    },
    {
      "headline":"Look under the bureau.",
      "description":"You will find a cassette tape."
    },
    {
      "headline":"Turn right to face the window.",
      "description":"If you click on the curtain, it will open. On the windowsill you will find a small silver key."
    },
    {
      "headline":"Click the curtain repeatedly.",
      "description":"After about five times, a thick ring will fall, which you will collect."
    },
    {
      "headline":"Turn right to face the bed.",
      "description":""
    },
    {
      "headline":"Click on the pillow.",
      "description":"When you lift it, you will find a small silver key underneath."
    },
    {
      "headline":"Click on the part of the mattress closest to the headboard of the bed.",
      "description":"Click in the very middle of the headboard, and you'll discover an odd metal stick."
    },
    {
      "headline":"Turn right to face the red wall.",
      "description":"You'll need to click at the bottom-left corner. If you click in the right spot, you will find a blue battery at the foot of the bed."
    },
    {
      "headline":"Turn right once more to face the original wall with the door.",
      "description":""
    },
    {
      "headline":"Use the keys on the locked drawers.",
      "description":"The gold fits into the right drawer, and the silver into the left. In the right drawer, you will find a power cord. In the left, you'll discover an odd red box."
    },
    {
      "headline":"Zoom in on the stereo and connect the power cord.",
      "description":"Press the power button to turn the stereo on and collect the key from the CD slot."
    },
    {
      "headline":"Examine the red box in your inventory.",
      "description":"Notice the strange slots on its top. In these slots, you can insert the metal stick and the two rings. The box will now open."
    },
    {
      "headline":"Insert the cassette and battery into their spots inside of the box.",
      "description":"Click on the box."
    },
    {
      "headline":"Watch the video of the man dancing.",
      "description":"You will notice that toward the end of the video, a \"+\" appears on the screen. The dancing man stops dancing to point to this spot. While he does this, move your mouse onto the spot."
    },
    {
      "headline":"Wait until the end of the video, and then click on the spot where the \"+\" sign was.",
      "description":"A rectangular slot should appear on the wall, and it opens to reveal a safe."
    },
    {
      "headline":"Examine the memo in your inventory.",
      "description":""
    },
    {
      "headline":"Open a new tab or window in your browser and copy and paste the url on the memo or if the link is broken, you can search help in google for the code.",
      "description":""
    },
    {
      "headline":"Follow the url, which will take you to another game window with a table in the middle of a room.",
      "description":"The table has four cards on it. Turn them over and they will reveal the code for the safe. (Note: The numbers on the cards are different every time you play. Additionally, 1994 will always work as the code.)"
    },
    {
      "headline":"Open the safe to reveal the screwdriver.",
      "description":""
    },
    {
      "headline":"Use the screwdriver on the doorknob to open the door.",
      "description":""
    },
    {
      "headline":"Give yourself a pat on the back.",
      "description":"You've escaped The Crimson Room!"
    }
  ],
  "text":" Understand the game controls. In this game, you move around, collect and use items by clicking. The items you currently have are in your inventory, which is located on the right side of the screen. Read through the text on the screen explaining how you ended up in the room. You will then awaken in the Crimson Room. While facing the ceiling, click toward the bottom of the game window to look down. You should now be facing a blue door and a yellow chest of drawers holding various items. Click to zoom in on the table, and then again to zoom in on the yellow bowl that sits on top. Take the thin ring inside of it. Open the two drawers that don't have keyholes. In the drawer on the upper-left, you will find a CD, and in the other a memo. Look under the bureau. You will find a cassette tape. Turn right to face the window. If you click on the curtain, it will open. On the windowsill you will find a small silver key. Click the curtain repeatedly. After about five times, a thick ring will fall, which you will collect. Turn right to face the bed.  Click on the pillow. When you lift it, you will find a small silver key underneath. Click on the part of the mattress closest to the headboard of the bed. Click in the very middle of the headboard, and you'll discover an odd metal stick. Turn right to face the red wall. You'll need to click at the bottom-left corner. If you click in the right spot, you will find a blue battery at the foot of the bed. Turn right once more to face the original wall with the door.  Use the keys on the locked drawers. The gold fits into the right drawer, and the silver into the left. In the right drawer, you will find a power cord. In the left, you'll discover an odd red box. Zoom in on the stereo and connect the power cord. Press the power button to turn the stereo on and collect the key from the CD slot. Examine the red box in your inventory. Notice the strange slots on its top. In these slots, you can insert the metal stick and the two rings. The box will now open. Insert the cassette and battery into their spots inside of the box. Click on the box. Watch the video of the man dancing. You will notice that toward the end of the video, a \"+\" appears on the screen. The dancing man stops dancing to point to this spot. While he does this, move your mouse onto the spot. Wait until the end of the video, and then click on the spot where the \"+\" sign was. A rectangular slot should appear on the wall, and it opens to reveal a safe. Examine the memo in your inventory.  Open a new tab or window in your browser and copy and paste the url on the memo or if the link is broken, you can search help in google for the code.  Follow the url, which will take you to another game window with a table in the middle of a room. The table has four cards on it. Turn them over and they will reveal the code for the safe. (Note: The numbers on the cards are different every time you play. Additionally, 1994 will always work as the code.) Open the safe to reveal the screwdriver.  Use the screwdriver on the doorknob to open the door.  Give yourself a pat on the back. You've escaped The Crimson Room!",
  "tyn_model":[
    "table",
    "stereo",
    "screwdriver",
    "bowl",
    "memo",
    "bureau",
    "pillow",
    "mattress",
    "power cord",
    "cassette",
    "battery",
    "mouse",
    "safe"
  ],
  "tyn_section":[

  ]
}