{
  "title":"How to Cool off Your Mouth After Eating Something Hot",
  "url":"https://www.wikihow.com/Cool-off-Your-Mouth-After-Eating-Something-Hot",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "methods":[
    {
      "name":"Neutralizing the Capsaicin in Spicy Foods",
      "steps":[
        {
          "headline":"Coat your mouth with dairy products.",
          "description":"Dissolve the spices' capsaicin with the casein protein found in milk. If you’re at home, fetch yourself a glass of milk pronto. If you're at a restaurant, flag the server down and order one right away. Or, if a yogurt dish has been served as a side to your meal, treat your mouth to a spoonful, since the dairy in that will work, too. Ice cream works even better, since the “ice” provides some blissful relief, while the “cream” provides something more or less solid to suck on for a while before it melts."
        },
        {
          "headline":"Have a shot of alcohol.",
          "description":"Pour yourself an ounce of hard liquor. Knock your shot back without swallowing. Swish the liquid around in your mouth. Unless the liquor has been chilled beforehand, the heat-on-heat sensation may feel unpleasant at first, but rest assured that the alcohol is dissolving the capsaicin and ridding your nerves of the agitating agent. Use hard liquor rather than beer or wine. The alcohol itself is needed to actually get rid of the capsaicin, so pour yourself something with a high content. Most liquors average around 40% alcohol content, while beer is typically less than 10% with wine only reaching 20% at its highest. If you’re not a drinker, don’t worry. Go ahead and spit the liquor out once you’re done rinsing your mouth with it. There is no need to swallow."
        },
        {
          "headline":"Try a spoonful of sugar.",
          "description":"If you’re at home, fetch the sugar bowl. If you’re at a restaurant, rip open a packet. Soak up the spice with the granules by either dumping the sugar right into your mouth, or by mixing a tablespoon with 8 ounces of water for sweet relief. Honey works just as well."
        },
        {
          "headline":"Eat chocolate.",
          "description":"Suck on milk chocolate if you have it, since this will contain casein, the protein in milk that dissolves capsaicin. If all you have is dark chocolate with no dairy content, fall back on that. It will be less effective, but the fat content will absorb some of the spice."
        },
        {
          "headline":"Use bread as a sponge.",
          "description":"Grab a roll from the bread bowl or a couple slices from your bread box. It won’t break the capsaicin down, so don’t keep it in your mouth for too long. Chew it up as you’d normally eat a hunk of bread. Let it absorb the spice in your mouth, then swallow or spit it out. If you have olive oil on hand, dip the bread in that, since olive oil will dissolve the capsaicin. Peanut butter will as well, so you can also try making a sandwich. Other starchy foods, like french fries, may also do the trick. Just be sure they’re not spicy, too!"
        }
      ]
    },
    {
      "name":"Cooling Your Mouth After Burning It with Hot Food or Drink",
      "steps":[
        {
          "headline":"Suck on an ice cube.",
          "description":"Use an ice cube instead of ice water, since water will lose its chill quicker. Hold the ice cube in place over the burned area, either with your fingers, tongue, or teeth. Keep it there for as long as the ice lasts, or until the burning sensation has faded away for good. If all you have is cold water and no ice, by all means, use that instead. Ice pops, yogurt, pudding, applesauce, or any other soft treat from the fridge or freezer will provide relief, too."
        },
        {
          "headline":"Apply mint toothpaste to the burn.",
          "description":"Coat the effected area. If you’ve burned your tongue, stick it out of your mouth so the toothpaste can dry. If the burn is elsewhere inside your mouth, breathe through your mouth to help it dry the best you can. Then rinse your mouth out. Use a mint toothpaste that’s free of fluoride. Other products with mint (gum, chocolate, breath mints) will also provide a cooling effect."
        },
        {
          "headline":"Breathe through your mouth.",
          "description":"Cool the burn with the flow of air. Work up some saliva to coat your tongue. Then stick it out into the cooler air. Draw breath over your tongue and exhale the same way to soothe the burn with the air current. If you’ve burned underneath your tongue, touch the the tip of your tongue to your upper lip as you breathe. This way your inhales have a better chance of drawing air over the affected the area."
        }
      ]
    },
    {
      "name":"Treating Burns in Your Mouth",
      "steps":[
        {
          "headline":"Visit your doctor.",
          "description":"When you burn your tongue or mouth, inspect it in a mirror immediately after you cool it off. The effected area will probably look a little red even if it's only a minor burn, but if there appears to be any more damage beyond that, see your doctor in case it turns out to be a third-degree burn. Do not use any sort of topical treatment beyond ice cubes or water until your doctor okays it. If it's only a minor burn, it should heal after a few days as long as you don't aggravate it. If pain persists beyond that time, however, seek medical treatment."
        },
        {
          "headline":"Take an over-the-counter pain reliever.",
          "description":"To quell any pain that still lingers after burning your mouth, use aspirin, ibuprofen, or a similar medication. Read the instructions and warnings. Take the recommended dosage. Reduce the inflammation that your poor nerve endings are suffering. Never take more than what’s recommended. If you’re on other medication, check to make sure that pain relievers are safe to take at the same time."
        },
        {
          "headline":"Rinse with mouthwash.",
          "description":"Use an antiseptic formula. Read the instructions and swish the recommended amount for however many seconds the directions indicate. Rid your mouth of any bacteria. Minimize the chance of infection and the prolonged pain that comes with a slower healing process. Use a mint-flavored mouthwash for extra, cooling relief."
        },
        {
          "headline":"Gargle with benzocaine.",
          "description":"Use an oral pain reliever meant for cankers and mouth sores. Read the instructions for the recommended dosage. Numb pain with a direct application of medicine to the burned area. Coat the nerve endings so they won’t be further aggravated by other food and beverages. Continue to gargle according to the instruction's recommended intervals until the burn has fully healed."
        },
        {
          "headline":"Eat and drink appropriately.",
          "description":"Stick to soft, cool foods. Avoid crunchy foods (like potato chips, pretzels, and hard-crust bread) since chewing may break these down into sharp points, which may stab the burn and increase the chance of infection. Allow hot food and beverages to cool off significantly before eating so your damaged nerve endings aren’t damaged any further. Better yet, avoid warm/hot foods altogether. Instead, stick to cold foods straight out of the fridge to soothe your burn. Fix yourself a bowl of cold gazpacho soup. Enjoy yogurt or applesauce. Or treat yourself to some ice cream for dinner."
        }
      ]
    }
  ],
  "text":" Neutralizing the Capsaicin in Spicy Foods Coat your mouth with dairy products. Dissolve the spices' capsaicin with the casein protein found in milk. If you’re at home, fetch yourself a glass of milk pronto. If you're at a restaurant, flag the server down and order one right away. Or, if a yogurt dish has been served as a side to your meal, treat your mouth to a spoonful, since the dairy in that will work, too. Ice cream works even better, since the “ice” provides some blissful relief, while the “cream” provides something more or less solid to suck on for a while before it melts. Have a shot of alcohol. Pour yourself an ounce of hard liquor. Knock your shot back without swallowing. Swish the liquid around in your mouth. Unless the liquor has been chilled beforehand, the heat-on-heat sensation may feel unpleasant at first, but rest assured that the alcohol is dissolving the capsaicin and ridding your nerves of the agitating agent. Use hard liquor rather than beer or wine. The alcohol itself is needed to actually get rid of the capsaicin, so pour yourself something with a high content. Most liquors average around 40% alcohol content, while beer is typically less than 10% with wine only reaching 20% at its highest. If you’re not a drinker, don’t worry. Go ahead and spit the liquor out once you’re done rinsing your mouth with it. There is no need to swallow. Try a spoonful of sugar. If you’re at home, fetch the sugar bowl. If you’re at a restaurant, rip open a packet. Soak up the spice with the granules by either dumping the sugar right into your mouth, or by mixing a tablespoon with 8 ounces of water for sweet relief. Honey works just as well. Eat chocolate. Suck on milk chocolate if you have it, since this will contain casein, the protein in milk that dissolves capsaicin. If all you have is dark chocolate with no dairy content, fall back on that. It will be less effective, but the fat content will absorb some of the spice. Use bread as a sponge. Grab a roll from the bread bowl or a couple slices from your bread box. It won’t break the capsaicin down, so don’t keep it in your mouth for too long. Chew it up as you’d normally eat a hunk of bread. Let it absorb the spice in your mouth, then swallow or spit it out. If you have olive oil on hand, dip the bread in that, since olive oil will dissolve the capsaicin. Peanut butter will as well, so you can also try making a sandwich. Other starchy foods, like french fries, may also do the trick. Just be sure they’re not spicy, too! Cooling Your Mouth After Burning It with Hot Food or Drink Suck on an ice cube. Use an ice cube instead of ice water, since water will lose its chill quicker. Hold the ice cube in place over the burned area, either with your fingers, tongue, or teeth. Keep it there for as long as the ice lasts, or until the burning sensation has faded away for good. If all you have is cold water and no ice, by all means, use that instead. Ice pops, yogurt, pudding, applesauce, or any other soft treat from the fridge or freezer will provide relief, too. Apply mint toothpaste to the burn. Coat the effected area. If you’ve burned your tongue, stick it out of your mouth so the toothpaste can dry. If the burn is elsewhere inside your mouth, breathe through your mouth to help it dry the best you can. Then rinse your mouth out. Use a mint toothpaste that’s free of fluoride. Other products with mint (gum, chocolate, breath mints) will also provide a cooling effect. Breathe through your mouth. Cool the burn with the flow of air. Work up some saliva to coat your tongue. Then stick it out into the cooler air. Draw breath over your tongue and exhale the same way to soothe the burn with the air current. If you’ve burned underneath your tongue, touch the the tip of your tongue to your upper lip as you breathe. This way your inhales have a better chance of drawing air over the affected the area. Treating Burns in Your Mouth Visit your doctor. When you burn your tongue or mouth, inspect it in a mirror immediately after you cool it off. The effected area will probably look a little red even if it's only a minor burn, but if there appears to be any more damage beyond that, see your doctor in case it turns out to be a third-degree burn. Do not use any sort of topical treatment beyond ice cubes or water until your doctor okays it. If it's only a minor burn, it should heal after a few days as long as you don't aggravate it. If pain persists beyond that time, however, seek medical treatment. Take an over-the-counter pain reliever. To quell any pain that still lingers after burning your mouth, use aspirin, ibuprofen, or a similar medication. Read the instructions and warnings. Take the recommended dosage. Reduce the inflammation that your poor nerve endings are suffering. Never take more than what’s recommended. If you’re on other medication, check to make sure that pain relievers are safe to take at the same time. Rinse with mouthwash. Use an antiseptic formula. Read the instructions and swish the recommended amount for however many seconds the directions indicate. Rid your mouth of any bacteria. Minimize the chance of infection and the prolonged pain that comes with a slower healing process. Use a mint-flavored mouthwash for extra, cooling relief. Gargle with benzocaine. Use an oral pain reliever meant for cankers and mouth sores. Read the instructions for the recommended dosage. Numb pain with a direct application of medicine to the burned area. Coat the nerve endings so they won’t be further aggravated by other food and beverages. Continue to gargle according to the instruction's recommended intervals until the burn has fully healed. Eat and drink appropriately. Stick to soft, cool foods. Avoid crunchy foods (like potato chips, pretzels, and hard-crust bread) since chewing may break these down into sharp points, which may stab the burn and increase the chance of infection. Allow hot food and beverages to cool off significantly before eating so your damaged nerve endings aren’t damaged any further. Better yet, avoid warm/hot foods altogether. Instead, stick to cold foods straight out of the fridge to soothe your burn. Fix yourself a bowl of cold gazpacho soup. Enjoy yogurt or applesauce. Or treat yourself to some ice cream for dinner.",
  "tyn_model":[
    "water",
    "milk",
    "yogurt",
    "capsaicin",
    "bread",
    "ice cube",
    "ice cream",
    "” provides",
    "alcohol",
    "liquor",
    "sugar",
    "olive oil",
    "ice",
    "applesauce",
    "mint toothpaste",
    "dairy products",
    "casein protein",
    "dairy",
    "“ice",
    "“cream",
    "hard liquor",
    "beer",
    "sugar bowl",
    "honey",
    "chocolate",
    "milk chocolate",
    "bread bowl",
    "bread box",
    "peanut butter",
    "french fries",
    "ice water",
    "ice pops",
    "pudding",
    "toothpaste",
    "saliva",
    "ice cubes",
    "pain reliever",
    "aspirin",
    "ibuprofen",
    "pain relievers",
    "antiseptic formula",
    "benzocaine",
    "oral pain reliever",
    "medicine",
    "pretzels",
    "beverages"
  ],
  "tyn_section":[

  ]
}