{
  "title":"How to Get Zinc Metal",
  "url":"https://www.wikihow.com/Get-Zinc-Metal",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Rocks and Minerals",
    "Metals"
  ],
  "methods":[
    {
      "name":"Getting Zinc from a Penny",
      "steps":[
        {
          "headline":"Dress appropriately and know the precautions.",
          "description":"You'll be working with hot objects in an indoor environment. Wear clothing that can cover your bare skin, tie back long hair, and put on safety goggles and thick gloves if you have any. In addition, move any food, drinks, and potentially flammable objects away from your workspace."
        },
        {
          "headline":"Gather the materials.",
          "description":"You will essentially need the following:\nUnited States pennies (minted after 1982)\npliers\na heat-proof container (such as a crucible)\na gas stove."
        },
        {
          "headline":"Turn on the stove to high.",
          "description":"You want to make sure that the stove is producing a hot enough temperature to ensure your yield of zinc."
        },
        {
          "headline":"Heat the penny.",
          "description":"With the pliers, place the penny on the tip of the flames (which is the hottest part). The penny will soon start to deform and soften. Be ready to get your container out!"
        },
        {
          "headline":"Get your heat-proof container ready.",
          "description":"As the penny starts to crumple, the inner layer will start to liquify. Once you're at that stage, carefully hold the penny above the container, and rock it slightly to coax the liquid metal out; this is the zinc metal. You may still have a thin sheet of metal on your pliers; this is the outer copper layer. (It doesn't melt due to the higher melting point.) Keep in mind: the zinc metal is going to be very hot initially."
        },
        {
          "headline":"Enjoy your zinc metal!",
          "description":"This experiment works because current US pennies contain an inner layer of zinc. Zinc has a low melting point, which means that heating up a penny as such can liquefy the metal, allowing for its extraction."
        }
      ]
    },
    {
      "name":"Getting Zinc from a Zinc-Carbon Lantern Battery",
      "steps":[
        {
          "headline":"Gather the materials.",
          "description":"The main thing you'll need is the zinc-carbon lantern battery. You may also need pliers, wire cutters, screwdrivers, utility knives, and other similar implements to assist you in dismantling the battery. It is recommended that you wear gloves for the whole procedure."
        },
        {
          "headline":"Split the top off the battery.",
          "description":"You will notice a rim at the top of the battery; using a knife or a screwdriver, cut/pry off the top."
        },
        {
          "headline":"Take out the inner batteries.",
          "description":"Inside the opened battery, you'll find four smaller batteries, all connected by wires. Cut off the wires, and you'll have the four batteries to work with."
        },
        {
          "headline":"Empty the four batteries.",
          "description":"For each of the four batteries, pull the protruding end with a pair of pliers. You should be able to pull out the carbon rod. Then, dig out the remaining contents in the battery; the black powder you'll find is a mixture of manganese dioxide and carbon. This, along with the carbon rod, can be disposed, or stored for potential experimenting. (These chemicals are not hazardous, so you do not need to worry too much about handling/disposing them.)"
        },
        {
          "headline":"Clean the emptied batteries.",
          "description":"Avoid washing it, especially at a sink, as the manganese dioxide-carbon residue is not water-soluble. Instead, try wiping it clean, cutting open the battery if you need to. Once that's done, you'll have your zinc metal!"
        }
      ]
    }
  ],
  "text":" Getting Zinc from a Penny Dress appropriately and know the precautions. You'll be working with hot objects in an indoor environment. Wear clothing that can cover your bare skin, tie back long hair, and put on safety goggles and thick gloves if you have any. In addition, move any food, drinks, and potentially flammable objects away from your workspace. Gather the materials. You will essentially need the following:\nUnited States pennies (minted after 1982)\npliers\na heat-proof container (such as a crucible)\na gas stove. Turn on the stove to high. You want to make sure that the stove is producing a hot enough temperature to ensure your yield of zinc. Heat the penny. With the pliers, place the penny on the tip of the flames (which is the hottest part). The penny will soon start to deform and soften. Be ready to get your container out! Get your heat-proof container ready. As the penny starts to crumple, the inner layer will start to liquify. Once you're at that stage, carefully hold the penny above the container, and rock it slightly to coax the liquid metal out; this is the zinc metal. You may still have a thin sheet of metal on your pliers; this is the outer copper layer. (It doesn't melt due to the higher melting point.) Keep in mind: the zinc metal is going to be very hot initially. Enjoy your zinc metal! This experiment works because current US pennies contain an inner layer of zinc. Zinc has a low melting point, which means that heating up a penny as such can liquefy the metal, allowing for its extraction. Getting Zinc from a Zinc-Carbon Lantern Battery Gather the materials. The main thing you'll need is the zinc-carbon lantern battery. You may also need pliers, wire cutters, screwdrivers, utility knives, and other similar implements to assist you in dismantling the battery. It is recommended that you wear gloves for the whole procedure. Split the top off the battery. You will notice a rim at the top of the battery; using a knife or a screwdriver, cut/pry off the top. Take out the inner batteries. Inside the opened battery, you'll find four smaller batteries, all connected by wires. Cut off the wires, and you'll have the four batteries to work with. Empty the four batteries. For each of the four batteries, pull the protruding end with a pair of pliers. You should be able to pull out the carbon rod. Then, dig out the remaining contents in the battery; the black powder you'll find is a mixture of manganese dioxide and carbon. This, along with the carbon rod, can be disposed, or stored for potential experimenting. (These chemicals are not hazardous, so you do not need to worry too much about handling/disposing them.) Clean the emptied batteries. Avoid washing it, especially at a sink, as the manganese dioxide-carbon residue is not water-soluble. Instead, try wiping it clean, cutting open the battery if you need to. Once that's done, you'll have your zinc metal!",
  "tyn_model":[
    "pliers",
    "zinc",
    "stove",
    "container",
    "zinc-carbon lantern",
    "carbon rod",
    "manganese dioxide",
    "crucible",
    "gas stove",
    "heat-proof container",
    "penny",
    "wire cutters",
    "screwdrivers",
    "utility knives",
    "knife",
    "screwdriver",
    "carbon",
    "batteries",
    "zinc metal"
  ],
  "tyn_section":[

  ]
}