{
  "title":"How to Use an Xbox 360 Headset",
  "url":"https://www.wikihow.com/Use-an-Xbox-360-Headset",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox 360"
  ],
  "steps":[
    {
      "headline":"There are many headsets official and unofficial which are usable with the Xbox 360.",
      "description":"The one key thing to remember is that you have two types which are wireless and wired."
    },
    {
      "headline":"If you have a wireless headset or earpiece you will need to charge it fully first.",
      "description":"All wireless headsets come uncharged when brought new, much like a mobile phone."
    },
    {
      "headline":"Now on to the connection of the headset.",
      "description":"First make sure your Xbox 360 is on, you can see the display on the television and your controller is synced with the Xbox 360 as player one."
    },
    {
      "headline":"For a wired headset plug the 2.5mm pin into the bottom of the controller listening for a small click.",
      "description":"For older models of the official headset you will have the same method but will have a block to plug in rather than just the pin."
    },
    {
      "headline":"For a wireless headset, once fully charged you will need to sync it.",
      "description":"Press the sync button on the Xbox 360 at the front and simultaneously with the sync button on the wireless headset. The lights on the wireless headset will flash until the circled \"one\" is solid. This means it has successfully synced to the Xbox 360 and is used for player one."
    },
    {
      "headline":"Most of the time new headsets won't be set to mute but if you cannot hear any sound make sure this is the case.",
      "description":"As well as this make sure you test to volume as most of the time it will be set to zero."
    },
    {
      "headline":"To test if you have connected it right press the home button on your controller to bring up the box.",
      "description":"You will then see near the controller battery life either the same for the wireless headset or a sound icon for wired."
    }
  ],
  "text":" There are many headsets official and unofficial which are usable with the Xbox 360. The one key thing to remember is that you have two types which are wireless and wired. If you have a wireless headset or earpiece you will need to charge it fully first. All wireless headsets come uncharged when brought new, much like a mobile phone. Now on to the connection of the headset. First make sure your Xbox 360 is on, you can see the display on the television and your controller is synced with the Xbox 360 as player one. For a wired headset plug the 2.5mm pin into the bottom of the controller listening for a small click. For older models of the official headset you will have the same method but will have a block to plug in rather than just the pin. For a wireless headset, once fully charged you will need to sync it. Press the sync button on the Xbox 360 at the front and simultaneously with the sync button on the wireless headset. The lights on the wireless headset will flash until the circled \"one\" is solid. This means it has successfully synced to the Xbox 360 and is used for player one. Most of the time new headsets won't be set to mute but if you cannot hear any sound make sure this is the case. As well as this make sure you test to volume as most of the time it will be set to zero. To test if you have connected it right press the home button on your controller to bring up the box. You will then see near the controller battery life either the same for the wireless headset or a sound icon for wired.",
  "tyn_model":[
    "xbox 360",
    "headset",
    "wireless headset"
  ],
  "tyn_section":[

  ]
}