{
  "title":"How to Play Pokémon GO",
  "url":"https://www.wikihow.com/Play-Pok%C3%A9mon-GO",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games",
    "Pokemon GO"
  ],
  "parts":[
    {
      "name":"Getting Started With the Pokémon GO App",
      "steps":[
        {
          "headline":"Go to the App Store.",
          "description":"Pokémon GO is available on the iPhone and Android. From the home screen of your phone, swipe your finger to the right and type \"App Store\" (or \"Play Store\", on an Android) into the search bar that appears. Tap the App Store icon to open the App Store."
        },
        {
          "headline":"Search for the Pokémon GO app.",
          "description":"Tap on the Search button at the bottom of the screen and type \"Pokémon GO\" into the search bar. Tap Search to see a list of results pop up."
        },
        {
          "headline":"Download the Pokémon GO app.",
          "description":"Find the Pokémon GO app in the results. Tap the GET button at the top-right corner of the results bar. You may be prompted to enter your Apple ID password. After doing this, you should see the app begin to download."
        },
        {
          "headline":"Open the Pokémon GO app.",
          "description":"Press the home screen button and tap on the new Pokémon GO icon that will have appeared. If you don't see the app on your home screen, swipe left until you see the Spotlight search bar appear where you can type \"Pokémon GO\" in and tap on the app that appears."
        },
        {
          "headline":"Allow Pokémon GO to access your location.",
          "description":"Giving the app access to your location will allow you to make full use of the game's features."
        },
        {
          "headline":"Enter your date of birth.",
          "description":"When you have done this, hit Submit."
        },
        {
          "headline":"Sign up for a Pokémon GO account.",
          "description":"You can do this one of two ways:\n\nSign up using Gmail. If you have a Gmail account, you can choose this option to link your account to the game, allowing you to share data between the two accounts. Signing up with Gmail currently seems to be more stable than using the Pokémon Trainer Club. Sign up for the Pokémon Trainer Club. This is a feature on Pokémon.com that seeks to create a dedicated community of Pokémon players who can communicate, battle, and trade Pokémon with one another. If you're interested in joining this community, this is a good option to choose."
        },
        {
          "headline":"Design your trainer avatar.",
          "description":"After accepting the terms and conditions and an introduction from Professor Willow, you'll be taken to the picture of two avatars. Tap your preferred presentation and you'll be taken to a screen where you can edit different physical features of your avatar. Edit your features by tapping on the different sections of each and using the arrows to toggle between different looks. Tap on the checkmark at the bottom-right corner of the screen when you are finished designing your avatar. You're ready to go!"
        }
      ]
    },
    {
      "name":"Catching Pokémon",
      "steps":[
        {
          "headline":"Check the sidebar for Pokémon.",
          "description":"If Pokémon are nearby, you'll see a gray sidebar on the bottom-right corner of your screen that displays the silhouettes of the Pokémon near you."
        },
        {
          "headline":"Watch for rustling grass.",
          "description":"On your screen, look for a set of leaves moving around in the distance. When you see some, you are receiving an indication that there may be a Pokémon there."
        },
        {
          "headline":"Walk to the rustling grass.",
          "description":"Yes, literally walk, with your feet, to where you see the rustling grass on the map! When you approach the spot, a Pokémon may appear on your screen."
        },
        {
          "headline":"Tap on the Pokémon.",
          "description":"When you get close enough to a Pokémon, tap on it to enter the game's \"capture\" mode. It's battle time."
        },
        {
          "headline":"Check the Pokémon's CP level.",
          "description":"A Pokémon's Combat Points, or CP level, is the number shown in the grey bar above its head, and it denotes their strength. A Pokémon with a low CP level will be easier to capture than a Pokémon with a high level."
        },
        {
          "headline":"Use the right type of Pokéball.",
          "description":"There are different types of Pokéballs you can use to capture Pokémon, and they yield different levels of effectiveness. A Pokéball is the most basic and weakest kind of ball to use - it's also the kind of Pokéball you receive as you start the game. You can stock up on Pokéballs at a PokéStop, which will be discussed more in this article. You can also buy PokéBalls at the PokéShop."
        },
        {
          "headline":"Wait for the right moment.",
          "description":"Look for the ring that sits inside the circle where the Pokémon is standing. It'll be red, orange, or green depending on how difficult the Pokémon is to capture. It'll also change in size; when this ring is at its smallest, the Pokémon is most vulnerable and your chances at capturing it are highest (but only if your Pokéball lands within the ring)."
        },
        {
          "headline":"When you're ready, swipe the Pokéball towards the Pokémon to capture it.",
          "description":"You'll throw a Pokéball at it. If you miss, or the Pokémon bursts out of the Pokéball, you can try again until it flees. If it runs away, don't fret - return to your map, and move on to your next attempt at finding and capturing a Pokémon!"
        },
        {
          "headline":"Master your throwing technique.",
          "description":"The single most important factor that affects your ability to successfully capture Pokémon is the technique you use to fling a Pokéball at it. To throw a Pokéball, simply use your finger to flick the Pokéball towards the Pokémon on the screen. To improve your throws, be sure to:\n\nGet your angle right. If you accidentally throw your Pokéball too far to the left or right, you'll miss the Pokémon. Use the right amount of force. A slower, shorter flick will cause you to throw the ball with less force. A quick, longer flick will cause the ball to fly faster and longer. Try to throw the ball with some force, but be sure not to overshoot the Pokémon during your throw! Turn off Augmented Reality. Battles in Augmented Reality require you to have greater throwing precision as you try to capture Pokémon. To have a better shot at catching them, turn off AR in the game's settings."
        }
      ]
    },
    {
      "name":"Using PokéStops",
      "steps":[
        {
          "headline":"Look for PokéStops on your map.",
          "description":"As you venture around the world, look for floating blue cubes on your map. These are PokéStops, where you can acquire valuable gear for your journey as a Pokémon trainer."
        },
        {
          "headline":"Walk towards the PokéStop.",
          "description":"As you approach it, it will change shape, turning into a medal shaped like a Pokéball. This signals that you are close enough to use the PokéStop."
        },
        {
          "headline":"Tap on the PokéStop.",
          "description":"This will bring up a close-up view of the PokéStop."
        },
        {
          "headline":"Spin the medal with your finger.",
          "description":"A number of items will appear around the medal."
        },
        {
          "headline":"Tap on the items to add them to your pack.",
          "description":""
        },
        {
          "headline":"Find another PokéStops that is blue.",
          "description":"After you use a PokéStop, it will turn purple, indicating that you've recently used it and it needs time to reset before you can collect more items from it. To collect more items, head to a PokéStop that appears on your map as blue."
        }
      ]
    },
    {
      "name":"Battling at Gyms",
      "steps":[
        {
          "headline":"Reach level 5 as a trainer.",
          "description":"Gyms are places around the world where Pokémon trainers meet up to battle each other. To learn the different ways to level up your Pokémon trainer, check out the Strategy and Advanced Tips section."
        },
        {
          "headline":"Locate gyms on your map.",
          "description":"Gyms are the largest objects that appear on your map. You can recognize them as tall pedestals surrounded by light. Gyms are most likely to be found in prominent meeting places, so if you can't see one in your immediate vicinity, try zooming out on your map. Gyms will be either yellow, blue or red, indicating the Pokémon team that currently has \"control\" over that gym."
        },
        {
          "headline":"Walk over to the gym.",
          "description":"When you are close to it, tap on the gym to be led through an introduction dialogue with Professor Willow."
        },
        {
          "headline":"Choose a team to battle with.",
          "description":"You will be asked to join either the Blue, Yellow or Red team. Tap on your team of choice, noting that the team with the same color of the gym currently controls that gym."
        },
        {
          "headline":"Select Pokémon to battle with.",
          "description":"You will be taken to a screen that displays the first Pokémon in your team. Select which Pokémon to choose by tapping the button at the bottom-right corner of your screen (with two Pokéballs colliding against each other) and tapping on the Pokémon you would like to battle with."
        },
        {
          "headline":"Hit the GO!",
          "description":"button when you are ready to battle. Brace yourself!"
        },
        {
          "headline":"Tap on the enemy Pokémon to attack them.",
          "description":"This will lower the other Pokémon's CP. When one Pokémon's CP reaches 0, it will faint, and the next Pokémon in the pack will be sent to fight."
        },
        {
          "headline":"Dodge the enemy's attacks by swiping left and right.",
          "description":"If the enemy has just sent an attack towards you, consider dodging it to save your CP instead of immediately attacking them back."
        }
      ]
    },
    {
      "name":"Strategy and Advanced Tips",
      "steps":[
        {
          "headline":"Start out with Pikachu.",
          "description":"When you start out the game, you will be given a choice between Squirtle, Charmander, and Bulbasaur as your starter Pokémon. If you walk away from all three of these Pokémon and wait for them to reappear on your map near you, the fourth time, you will eventually see Pikachu appear along with them."
        },
        {
          "headline":"Find the best PokéStops at cultural landmarks.",
          "description":"Not all PokéStops are created equal! PokéStops located at more central locations tend to yield better items. To find Pokéstops with serious plunder, check out locations such as:\nMonuments\nWell-known buildings\nParks\nMuseums\nGraveyards\nCollege Campuses"
        },
        {
          "headline":"Collect eggs to \"hatch\" your Pokémon.",
          "description":"At some Pokéstops, you'll be able to collect eggs. After walking a certain distance with an egg in your pack, it will hatch, adding a Pokémon to your team without you having to catch it."
        },
        {
          "headline":"Level up your trainer.",
          "description":"As you journey through the world, you have opportunities to gain experience that will allow you to level up as a trainer. At level 5, you can access gyms where you can battle other trainers. As you level up, you will also begin to encounter rarer, more powerful Pokémon in the world and have access to better items at PokéStops. You gain different levels of experience for completing different tasks, and the amount of experience you gain increases once you become a more powerful trainer. Here are some things you can do to level up your trainer and the XP rewards you get from them at the beginning of the game:\n100 XP – Pokémon Caught\n500 XP – New Pokémon\n10 XP – Curve Ball\n10 XP – Nice Throw\n50 XP – Great Throw\n100 XP – Excellent Throw\n50 XP – Checking in at a PokéStop\n100 XP – Battling a Pokémon Trainer at a Gym\n150 XP – Beating a Pokémon Trainer at a Gym\n50 XP – Beat a Pokémon in training at a Gym\n200 XP – Hatch a Pokémon\n500 XP – Evolve a Pokémon"
        },
        {
          "headline":"Use special attacks during gym battles.",
          "description":"When you're battling another trainer, you can charge up a special attack by holding a long tap on the screen and letting it go when the bar is full. These attacks are more powerful than your Pokémon's regular combat moves. This takes a long time to charge up, so it may not be possible during all gym battles."
        },
        {
          "headline":"Battle Pokémon according to their types.",
          "description":"All Pokémon have types that are strong against certain other types and weak against others. When battling, try to match your Pokémon up against a Pokémon that will give yours an advantage. This chart shows you which Pokémon are stronger and weaker against others (the arrow points to the strongest types)."
        },
        {
          "headline":"Save your battery life.",
          "description":"Pokémon Go will devour your battery if you don't take measures to save it. To do this, tap the Pokéball icon at the bottom of your screen and then the \"Settings\" icon at the top-right. Tap on the \"Battery Saver\" option for a greatly-improved battery life."
        }
      ]
    }
  ],
  "text":" Getting Started With the Pokémon GO App Go to the App Store. Pokémon GO is available on the iPhone and Android. From the home screen of your phone, swipe your finger to the right and type \"App Store\" (or \"Play Store\", on an Android) into the search bar that appears. Tap the App Store icon to open the App Store. Search for the Pokémon GO app. Tap on the Search button at the bottom of the screen and type \"Pokémon GO\" into the search bar. Tap Search to see a list of results pop up. Download the Pokémon GO app. Find the Pokémon GO app in the results. Tap the GET button at the top-right corner of the results bar. You may be prompted to enter your Apple ID password. After doing this, you should see the app begin to download. Open the Pokémon GO app. Press the home screen button and tap on the new Pokémon GO icon that will have appeared. If you don't see the app on your home screen, swipe left until you see the Spotlight search bar appear where you can type \"Pokémon GO\" in and tap on the app that appears. Allow Pokémon GO to access your location. Giving the app access to your location will allow you to make full use of the game's features. Enter your date of birth. When you have done this, hit Submit. Sign up for a Pokémon GO account. You can do this one of two ways:\n\nSign up using Gmail. If you have a Gmail account, you can choose this option to link your account to the game, allowing you to share data between the two accounts. Signing up with Gmail currently seems to be more stable than using the Pokémon Trainer Club. Sign up for the Pokémon Trainer Club. This is a feature on Pokémon.com that seeks to create a dedicated community of Pokémon players who can communicate, battle, and trade Pokémon with one another. If you're interested in joining this community, this is a good option to choose. Design your trainer avatar. After accepting the terms and conditions and an introduction from Professor Willow, you'll be taken to the picture of two avatars. Tap your preferred presentation and you'll be taken to a screen where you can edit different physical features of your avatar. Edit your features by tapping on the different sections of each and using the arrows to toggle between different looks. Tap on the checkmark at the bottom-right corner of the screen when you are finished designing your avatar. You're ready to go! Catching Pokémon Check the sidebar for Pokémon. If Pokémon are nearby, you'll see a gray sidebar on the bottom-right corner of your screen that displays the silhouettes of the Pokémon near you. Watch for rustling grass. On your screen, look for a set of leaves moving around in the distance. When you see some, you are receiving an indication that there may be a Pokémon there. Walk to the rustling grass. Yes, literally walk, with your feet, to where you see the rustling grass on the map! When you approach the spot, a Pokémon may appear on your screen. Tap on the Pokémon. When you get close enough to a Pokémon, tap on it to enter the game's \"capture\" mode. It's battle time. Check the Pokémon's CP level. A Pokémon's Combat Points, or CP level, is the number shown in the grey bar above its head, and it denotes their strength. A Pokémon with a low CP level will be easier to capture than a Pokémon with a high level. Use the right type of Pokéball. There are different types of Pokéballs you can use to capture Pokémon, and they yield different levels of effectiveness. A Pokéball is the most basic and weakest kind of ball to use - it's also the kind of Pokéball you receive as you start the game. You can stock up on Pokéballs at a PokéStop, which will be discussed more in this article. You can also buy PokéBalls at the PokéShop. Wait for the right moment. Look for the ring that sits inside the circle where the Pokémon is standing. It'll be red, orange, or green depending on how difficult the Pokémon is to capture. It'll also change in size; when this ring is at its smallest, the Pokémon is most vulnerable and your chances at capturing it are highest (but only if your Pokéball lands within the ring). When you're ready, swipe the Pokéball towards the Pokémon to capture it. You'll throw a Pokéball at it. If you miss, or the Pokémon bursts out of the Pokéball, you can try again until it flees. If it runs away, don't fret - return to your map, and move on to your next attempt at finding and capturing a Pokémon! Master your throwing technique. The single most important factor that affects your ability to successfully capture Pokémon is the technique you use to fling a Pokéball at it. To throw a Pokéball, simply use your finger to flick the Pokéball towards the Pokémon on the screen. To improve your throws, be sure to:\n\nGet your angle right. If you accidentally throw your Pokéball too far to the left or right, you'll miss the Pokémon. Use the right amount of force. A slower, shorter flick will cause you to throw the ball with less force. A quick, longer flick will cause the ball to fly faster and longer. Try to throw the ball with some force, but be sure not to overshoot the Pokémon during your throw! Turn off Augmented Reality. Battles in Augmented Reality require you to have greater throwing precision as you try to capture Pokémon. To have a better shot at catching them, turn off AR in the game's settings. Using PokéStops Look for PokéStops on your map. As you venture around the world, look for floating blue cubes on your map. These are PokéStops, where you can acquire valuable gear for your journey as a Pokémon trainer. Walk towards the PokéStop. As you approach it, it will change shape, turning into a medal shaped like a Pokéball. This signals that you are close enough to use the PokéStop. Tap on the PokéStop. This will bring up a close-up view of the PokéStop. Spin the medal with your finger. A number of items will appear around the medal. Tap on the items to add them to your pack.  Find another PokéStops that is blue. After you use a PokéStop, it will turn purple, indicating that you've recently used it and it needs time to reset before you can collect more items from it. To collect more items, head to a PokéStop that appears on your map as blue. Battling at Gyms Reach level 5 as a trainer. Gyms are places around the world where Pokémon trainers meet up to battle each other. To learn the different ways to level up your Pokémon trainer, check out the Strategy and Advanced Tips section. Locate gyms on your map. Gyms are the largest objects that appear on your map. You can recognize them as tall pedestals surrounded by light. Gyms are most likely to be found in prominent meeting places, so if you can't see one in your immediate vicinity, try zooming out on your map. Gyms will be either yellow, blue or red, indicating the Pokémon team that currently has \"control\" over that gym. Walk over to the gym. When you are close to it, tap on the gym to be led through an introduction dialogue with Professor Willow. Choose a team to battle with. You will be asked to join either the Blue, Yellow or Red team. Tap on your team of choice, noting that the team with the same color of the gym currently controls that gym. Select Pokémon to battle with. You will be taken to a screen that displays the first Pokémon in your team. Select which Pokémon to choose by tapping the button at the bottom-right corner of your screen (with two Pokéballs colliding against each other) and tapping on the Pokémon you would like to battle with. Hit the GO! button when you are ready to battle. Brace yourself! Tap on the enemy Pokémon to attack them. This will lower the other Pokémon's CP. When one Pokémon's CP reaches 0, it will faint, and the next Pokémon in the pack will be sent to fight. Dodge the enemy's attacks by swiping left and right. If the enemy has just sent an attack towards you, consider dodging it to save your CP instead of immediately attacking them back. Strategy and Advanced Tips Start out with Pikachu. When you start out the game, you will be given a choice between Squirtle, Charmander, and Bulbasaur as your starter Pokémon. If you walk away from all three of these Pokémon and wait for them to reappear on your map near you, the fourth time, you will eventually see Pikachu appear along with them. Find the best PokéStops at cultural landmarks. Not all PokéStops are created equal! PokéStops located at more central locations tend to yield better items. To find Pokéstops with serious plunder, check out locations such as:\nMonuments\nWell-known buildings\nParks\nMuseums\nGraveyards\nCollege Campuses Collect eggs to \"hatch\" your Pokémon. At some Pokéstops, you'll be able to collect eggs. After walking a certain distance with an egg in your pack, it will hatch, adding a Pokémon to your team without you having to catch it. Level up your trainer. As you journey through the world, you have opportunities to gain experience that will allow you to level up as a trainer. At level 5, you can access gyms where you can battle other trainers. As you level up, you will also begin to encounter rarer, more powerful Pokémon in the world and have access to better items at PokéStops. You gain different levels of experience for completing different tasks, and the amount of experience you gain increases once you become a more powerful trainer. Here are some things you can do to level up your trainer and the XP rewards you get from them at the beginning of the game:\n100 XP – Pokémon Caught\n500 XP – New Pokémon\n10 XP – Curve Ball\n10 XP – Nice Throw\n50 XP – Great Throw\n100 XP – Excellent Throw\n50 XP – Checking in at a PokéStop\n100 XP – Battling a Pokémon Trainer at a Gym\n150 XP – Beating a Pokémon Trainer at a Gym\n50 XP – Beat a Pokémon in training at a Gym\n200 XP – Hatch a Pokémon\n500 XP – Evolve a Pokémon Use special attacks during gym battles. When you're battling another trainer, you can charge up a special attack by holding a long tap on the screen and letting it go when the bar is full. These attacks are more powerful than your Pokémon's regular combat moves. This takes a long time to charge up, so it may not be possible during all gym battles. Battle Pokémon according to their types. All Pokémon have types that are strong against certain other types and weak against others. When battling, try to match your Pokémon up against a Pokémon that will give yours an advantage. This chart shows you which Pokémon are stronger and weaker against others (the arrow points to the strongest types). Save your battery life. Pokémon Go will devour your battery if you don't take measures to save it. To do this, tap the Pokéball icon at the bottom of your screen and then the \"Settings\" icon at the top-right. Tap on the \"Battery Saver\" option for a greatly-improved battery life.",
  "tyn_model":[
    "pokémon",
    "pokéball",
    "pokémon go",
    "pokémon go app",
    "gmail",
    "pokéballs",
    "app store",
    "pokémon trainer club",
    "eggs",
    "pokémon trainer",
    "apple id password",
    "grass",
    "augmented reality",
    "medal",
    "pokéstop",
    "gym",
    "pikachu",
    "charmander",
    "bulbasaur",
    "– pokémon",
    "– new",
    "– curve",
    "– nice",
    "– great",
    "– excellent",
    "– checking",
    "– battling",
    "– beating",
    "– beat",
    "– hatch",
    "– evolve"
  ],
  "tyn_section":[

  ]
}