{
  "title":"How to Level Up in Pokémon GO",
  "url":"https://www.wikihow.com/Level-Up-in-Pok%C3%A9mon-GO",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games",
    "Pokemon GO"
  ],
  "methods":[
    {
      "name":"Basics to Leveling Up as a Trainer",
      "steps":[
        {
          "headline":"Catch new Pokémon.",
          "description":"Each time you encounter a Pokémon in the wild, you have the opportunity to gain experience. You gain experience both when you attempt to catch Pokémon as well as when you successfully catch them. The experience you gain as a trainer in encountering Pokémon occurs as follows:\nThrow a Curve Ball at a Pokémon - 10 XP\nThrow a PokéBall with Good Accuracy (Nice Throw) - 10XP\nThrow a PokéBall with Great Accuracy (Great Throw) - 50 XP\nThrow a PokéBall with Perfect Accuracy (Excellent Throw) - 100 XP\nCatch a Pokémon - 100 XP\nCatch a New Pokémon - 500 XP"
        },
        {
          "headline":"Make use of gyms.",
          "description":"You can also gain experience by battling at gyms. The experience you gain as a trainer using gyms occurs as follows:\nBattle a Pokémon Trainer at a Gym - 100 XP\nBeat a Pokémon Trainer at a Gym - 150 XP\nBeat a Pokémon in training at a Gym - 50XP"
        },
        {
          "headline":"Evolve your Pokémon.",
          "description":"You can do this both with your \"living\" Pokémon as well as with PokéEggs. For more information on how to level up and evolve your Pokémon, check the \"Leveling Up Your Pokémon\" section. The experience you gain by evolving Pokémon is as follows:\n200 XP – Hatch a Pokémon\n500 XP – Evolve a Pokémon"
        },
        {
          "headline":"Purchase a Lucky Egg.",
          "description":"A Lucky Egg is an item that allows you to gain twice the XP for the actions listed above. To purchase a Lucky Egg, tap on the PokéBall on the main screen and tap the \"Shop\" icon. Scroll to the third row of items to find Lucky Eggs."
        }
      ]
    },
    {
      "name":"Tricks to Leveling Up as a Trainer",
      "steps":[
        {
          "headline":"Buy a Lucky Egg (optional).",
          "description":"This is not required for the trick to work, but will allow you to level up twice as fast. To purchase a Lucky Egg, tap on the PokéBall on the main screen and tap the \"Shop\" icon. Scroll to the third row of items to find Lucky Eggs."
        },
        {
          "headline":"Catch several weak Pokémon of the same type.",
          "description":"These Pokémon are the easiest to level up, which is how you will gain your experience using this trick. Pidgey is the best Pokémon to use for this reason, but Weedle and Rattata work as well."
        },
        {
          "headline":"Transfer your duplicate Pokémon to Professor Willow.",
          "description":"In return, he will give you candy, which you can use to level up your Pokémon. To transfer Pokémon to Professor Willow:\nTap the PokéBall on screen, and then the Pokémon symbol to open your list of Pokémon. Tap on a Pokémon that you have a duplicate of, and hit the \"Transfer\" button."
        },
        {
          "headline":"Tap the Pokémon button.",
          "description":"This will open a list of the Pokémon you have caught."
        },
        {
          "headline":"Transfer your duplicate Pokémon to Professor Willow.",
          "description":"Tap on a Pokémon you have caught multiple of, and hit the \"Transfer\" button. Professor Willow will take the Pokémon to his lab, and give you candy in return. This candy can be used to level up and evolve your Pokémon."
        },
        {
          "headline":"Open up your Items.",
          "description":"From the main screen, tap the PokéBall near the bottom and then the \"Items\" button to open up a list of all items in your pack."
        },
        {
          "headline":"Use your Lucky Egg.",
          "description":"Tap on the Lucky Egg you have purchased to use it. This will grant you a 30-minute period during which all of the experience you gain will be doubled. Since this period only lasts 30 minutes, be sure to complete the rest of this method once you have enacted this step!"
        },
        {
          "headline":"Use all of your candy on the Pidgeys in your pack.",
          "description":"Your Pokémon will level up very quickly, causing you to gain a huge spike in XP and, depending on your current level as a trainer, allow you to increase by a level or two.The evolution animation takes almost 30 seconds to complete, meaning that you could get about 60,000 to 65,000 XP if you use up the entire 30 minutes on evolving."
        },
        {
          "headline":"Repeat these steps over to gain more experience.",
          "description":"You're well on your way to becoming a stronger trainer!"
        }
      ]
    }
  ],
  "text":" Basics to Leveling Up as a Trainer Catch new Pokémon. Each time you encounter a Pokémon in the wild, you have the opportunity to gain experience. You gain experience both when you attempt to catch Pokémon as well as when you successfully catch them. The experience you gain as a trainer in encountering Pokémon occurs as follows:\nThrow a Curve Ball at a Pokémon - 10 XP\nThrow a PokéBall with Good Accuracy (Nice Throw) - 10XP\nThrow a PokéBall with Great Accuracy (Great Throw) - 50 XP\nThrow a PokéBall with Perfect Accuracy (Excellent Throw) - 100 XP\nCatch a Pokémon - 100 XP\nCatch a New Pokémon - 500 XP Make use of gyms. You can also gain experience by battling at gyms. The experience you gain as a trainer using gyms occurs as follows:\nBattle a Pokémon Trainer at a Gym - 100 XP\nBeat a Pokémon Trainer at a Gym - 150 XP\nBeat a Pokémon in training at a Gym - 50XP Evolve your Pokémon. You can do this both with your \"living\" Pokémon as well as with PokéEggs. For more information on how to level up and evolve your Pokémon, check the \"Leveling Up Your Pokémon\" section. The experience you gain by evolving Pokémon is as follows:\n200 XP – Hatch a Pokémon\n500 XP – Evolve a Pokémon Purchase a Lucky Egg. A Lucky Egg is an item that allows you to gain twice the XP for the actions listed above. To purchase a Lucky Egg, tap on the PokéBall on the main screen and tap the \"Shop\" icon. Scroll to the third row of items to find Lucky Eggs. Tricks to Leveling Up as a Trainer Buy a Lucky Egg (optional). This is not required for the trick to work, but will allow you to level up twice as fast. To purchase a Lucky Egg, tap on the PokéBall on the main screen and tap the \"Shop\" icon. Scroll to the third row of items to find Lucky Eggs. Catch several weak Pokémon of the same type. These Pokémon are the easiest to level up, which is how you will gain your experience using this trick. Pidgey is the best Pokémon to use for this reason, but Weedle and Rattata work as well. Transfer your duplicate Pokémon to Professor Willow. In return, he will give you candy, which you can use to level up your Pokémon. To transfer Pokémon to Professor Willow:\nTap the PokéBall on screen, and then the Pokémon symbol to open your list of Pokémon. Tap on a Pokémon that you have a duplicate of, and hit the \"Transfer\" button. Tap the Pokémon button. This will open a list of the Pokémon you have caught. Transfer your duplicate Pokémon to Professor Willow. Tap on a Pokémon you have caught multiple of, and hit the \"Transfer\" button. Professor Willow will take the Pokémon to his lab, and give you candy in return. This candy can be used to level up and evolve your Pokémon. Open up your Items. From the main screen, tap the PokéBall near the bottom and then the \"Items\" button to open up a list of all items in your pack. Use your Lucky Egg. Tap on the Lucky Egg you have purchased to use it. This will grant you a 30-minute period during which all of the experience you gain will be doubled. Since this period only lasts 30 minutes, be sure to complete the rest of this method once you have enacted this step! Use all of your candy on the Pidgeys in your pack. Your Pokémon will level up very quickly, causing you to gain a huge spike in XP and, depending on your current level as a trainer, allow you to increase by a level or two.The evolution animation takes almost 30 seconds to complete, meaning that you could get about 60,000 to 65,000 XP if you use up the entire 30 minutes on evolving. Repeat these steps over to gain more experience. You're well on your way to becoming a stronger trainer!",
  "tyn_model":[
    "pokémon",
    "pokéball",
    "lucky egg",
    "candy",
    "pokémon trainer",
    "gym",
    "– hatch",
    "– evolve",
    "weedle",
    "rattata"
  ],
  "tyn_section":[

  ]
}