{
  "title":"How to Be Fun at Parties",
  "url":"https://www.wikihow.com/Be-Fun-at-Parties",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Socializing"
  ],
  "methods":[
    {
      "name":"Getting Yourself Ready",
      "steps":[
        {
          "headline":"Psych yourself up for the party.",
          "description":"Put on some music while you get ready and start to put yourself in a party mood. Parties are meant to be fun, so you need to make sure you’ve got the right mindset. Don’t focus on the negatives or any nervousness that you may have. Instead, think about all the fun you’re going to have! Play some energetic music to pump yourself up! Dance around a bit to get your heart rate up and get excited about the party."
        },
        {
          "headline":"Pick out a fun and cute outfit to wear.",
          "description":"It is a party, after all! Choose an outfit that looks good and makes you feel good wearing it. You’ll be much more confident and fun if you feel good about your appearance. Consider getting a new outfit for the party. Buying and wearing a brand new outfit would boost your confidence. If you’re not sure if your outfit looks good, take a picture and send it to a friend to see what they think."
        },
        {
          "headline":"Get everything that you need ready to go ahead of time.",
          "description":"Avoid scrambling to find everything just before you head out for the party by organizing all of your necessities. Save yourself from panicking by packing your keys, phone, wallet, cash, purse, or anything else that you need to bring with you. Get them all ready to go before you get dressed, that way, you can focus on getting yourself ready. Make sure you have enough money to get home or get food if you need it later in the night. Try to pack lightly so you don’t have to keep track of a lot of things at the party."
        },
        {
          "headline":"Get cleaned up for the party.",
          "description":"Practice good hygiene and get yourself feeling squeaky clean, fresh, and confident. Take a nice hot shower, brush your teeth, and fix your hair before you head out to the party. Nobody wants to party with someone who’s dirty and smelly! Try a new hairstyle to make yourself appear more fun! Put on some cologne or perfume so you smell nice. Consider shaving for the party."
        },
        {
          "headline":"Practice talking to people in front of a mirror.",
          "description":"Make yourself feel more confident going to the party by simulating conversations that you think will take place. Watching yourself in a mirror allows you to see how you look when you talk, smile, and react to what other people are saying. Try laughing so you can make sure you don’t look silly or dorky. For example, you can try saying a few sample conversational lines like, “Hi! My name is (Your Name), what’s yours?” or “Nice party! How do you know (Party Host’s Name)?”\nPay attention to how you look when you smile and how you hold your hands when you gesture."
        },
        {
          "headline":"Touch base with friends who are going to the party.",
          "description":"A party is much more fun if you have friends there with you. It can help settle your nerves and get you excited to have fun at the party if you talk to some of your friends who will be there. Ask your friends what they plan to wear so you can coordinate outfits together.Tip: Ride with your friends to the party so you can arrive at the same time and get pumped up on the way there."
        }
      ]
    },
    {
      "name":"Interacting with People",
      "steps":[
        {
          "headline":"Try to calm your nerves so you can engage people.",
          "description":"In order for you to be fun at a party, you need to be having fun at a party. If you’re a nervous wreck, you won’t want to talk to other people or participate in any of the activities of the party. Take a moment to calm your nerves before you start to interact with people at the party. Take some deep breaths if you start to feel anxious. Focus your thoughts on the present and the positive aspects of being at a fun party. Consider getting a drink to loosen up."
        },
        {
          "headline":"Put your phone away when you get to the party.",
          "description":"You need to keep your phone on you in case someone is trying to contact you, but you don’t want to be glued to it and miss out on the party. People will also think that you’re disinterested and aren’t any fun. When you arrive, put your phone in your pocket or purse so you can have fun at the party. Turn your ringer on loud so you can hear your phone. Set your phone to vibrate if you don’t want your ringer to go off during the party and embarrass you."
        },
        {
          "headline":"Make eye contact when you talk to people.",
          "description":"Give people your full attention when they’re talking to you so they know you’re listening to them. If you’re constantly looking around the party while someone is answering you, then they’ll think that you’re rude and you don’t care about what they have to say. People will think that you’re more fun if they feel like you like them and value their opinions."
        },
        {
          "headline":"Tell jokes to loosen people up.",
          "description":"Jokes are an easy way to break the ice and get people comfortable around you. People will have more fun if they’re relaxed and loose. Don’t be afraid to make jokes at your own expense, either. It shows people that you’re silly and fun. Try making cheesy impressions of people at the party, but don’t tease people too much or hurt their feelings. Tell the corniest joke or most awful pun that you know."
        },
        {
          "headline":"Ask people questions about themselves.",
          "description":"People love to talk about themselves, so an easy way to get them talking to and having fun with you is to simply let them do it. Whether you’re on the dance floor, next to the chips and dip, or even away from the music, asking someone at the party about their life and what they like to do for fun is a surefire way to make yourself fun. You can start with basic questions like, “So, what do you do for a living?” That will usually get the ball rolling and allows you to ask follow-up questions. If a song is playing, ask them if they know the song or like the music. Even if they don’t like it, it gets a conversation started. Try asking something personal and specific like, “What is your biggest fear?” People may get a kick out an engaging question as opposed to the small talk that often occurs at parties."
        },
        {
          "headline":"Move around the party to talk to more people.",
          "description":"Visit all of the different spaces of the party and talk to the different people and groups of people. If you stand in one spot or section of the party, you’ll limit the people you meet and the fun that you have. People will remember you if you work your way around the party to have fun with them. Ignore the impulse to stay in one spot with familiar people and get out of your comfort zone to have a little fun!"
        },
        {
          "headline":"Try not to drink too much.",
          "description":"It’s a party, you should have fun, but be sure to drink in moderation. Alcohol is a great way to loosen people up and have fun, but nobody likes a sloppy drunk person at a party. Be sure to drink plenty of water in addition to any alcohol that you consume.Safety Tip: Never drink and drive. If you drink too much, have someone else drive, ride with someone else, or use a ride-sharing app like Uber or Lyft to get home safely."
        }
      ]
    },
    {
      "name":"Doing Fun Activities",
      "steps":[
        {
          "headline":"Challenge someone to a dance-off.",
          "description":"If you hear a song that you like or is popular, ask the people around you to dance. People may be hesitant at first, but if you get really into it and are having fun, they will want to join you. Don’t be afraid to take the first step! Choose a song that has choreography that many people know. For example, you can play “La Macarena” by Los Del Rio or “Footloose” and have people do the movements. If they don’t know them, you can teach them!"
        },
        {
          "headline":"Play a drinking game.",
          "description":"Many parties will have alcoholic drinks being served so you can kick the party up a notch by initiating a drinking game. People will quickly loosen up and have fun once they start playing and drinking. Start up a game of beer pong. Even if you don’t have a super long table, you can still have some fun and a little friendly competition. Use a deck of cards to play king’s cup with a bunch of players. Make up your own drinking game. For example, if there’s a movie playing, make up a game related to the movie. You could have everyone drink whenever there’s a close-up shot or a kiss."
        },
        {
          "headline":"Initiate a party game and try to get people to play.",
          "description":"If you spot a game of Twister on the shelf or you see a video game console set up, ask people to play a game with you. The host of the party may have set up some fun party games to play, so take advantage of them and be the life of the party by getting people to participate. Try a classic game like charades if you don’t have any gaming supplies. Play “Never Have I Ever.” One person says something that they haven’t done, and if the other players have done it, they have to take a sip of their drink. For example, you could say, “Never have I ever kissed a fish.” If someone else has, then they have to drink! If people are hesitant at first, no problem! Just start playing around and when people see how much fun you’re having, they’ll join in!"
        },
        {
          "headline":"Do a party trick that you know.",
          "description":"If you have some weird or interesting skill or ability, use it to impress or get a laugh from people at the party. Party tricks can be cheesy, but that’s kind of the point. Have fun and show people any weird ability or silly trick that you know. Try a card trick to impress people. Do some simple magic tricks  to wow and intrigue people at the party. For example, if you can curl or roll your tongue, ask people if they can do it and then show them how you can!"
        },
        {
          "headline":"Bring snacks for people to eat.",
          "description":"Everyone loves food, so bringing some tasty snacks is a great way for you be fun and engage people. Put out your snacks when you arrive and while you’re at the party talking to new people, ask them if they’ve tried the snacks yet. Then tell them you made or brought them! Make a cheese or a spinach dip to bring with you. Tell people they should try it! Bring some healthy snacks for people to eat as well. Try making a vegan queso dip to give people a vegan option.Tip: Go to a foreign food market and pick up some interesting snacks for people to try. For example, visit an Asian supermarket and get some chips or drinks that people may have never tried before."
        }
      ]
    }
  ],
  "text":" Getting Yourself Ready Psych yourself up for the party. Put on some music while you get ready and start to put yourself in a party mood. Parties are meant to be fun, so you need to make sure you’ve got the right mindset. Don’t focus on the negatives or any nervousness that you may have. Instead, think about all the fun you’re going to have! Play some energetic music to pump yourself up! Dance around a bit to get your heart rate up and get excited about the party. Pick out a fun and cute outfit to wear. It is a party, after all! Choose an outfit that looks good and makes you feel good wearing it. You’ll be much more confident and fun if you feel good about your appearance. Consider getting a new outfit for the party. Buying and wearing a brand new outfit would boost your confidence. If you’re not sure if your outfit looks good, take a picture and send it to a friend to see what they think. Get everything that you need ready to go ahead of time. Avoid scrambling to find everything just before you head out for the party by organizing all of your necessities. Save yourself from panicking by packing your keys, phone, wallet, cash, purse, or anything else that you need to bring with you. Get them all ready to go before you get dressed, that way, you can focus on getting yourself ready. Make sure you have enough money to get home or get food if you need it later in the night. Try to pack lightly so you don’t have to keep track of a lot of things at the party. Get cleaned up for the party. Practice good hygiene and get yourself feeling squeaky clean, fresh, and confident. Take a nice hot shower, brush your teeth, and fix your hair before you head out to the party. Nobody wants to party with someone who’s dirty and smelly! Try a new hairstyle to make yourself appear more fun! Put on some cologne or perfume so you smell nice. Consider shaving for the party. Practice talking to people in front of a mirror. Make yourself feel more confident going to the party by simulating conversations that you think will take place. Watching yourself in a mirror allows you to see how you look when you talk, smile, and react to what other people are saying. Try laughing so you can make sure you don’t look silly or dorky. For example, you can try saying a few sample conversational lines like, “Hi! My name is (Your Name), what’s yours?” or “Nice party! How do you know (Party Host’s Name)?”\nPay attention to how you look when you smile and how you hold your hands when you gesture. Touch base with friends who are going to the party. A party is much more fun if you have friends there with you. It can help settle your nerves and get you excited to have fun at the party if you talk to some of your friends who will be there. Ask your friends what they plan to wear so you can coordinate outfits together.Tip: Ride with your friends to the party so you can arrive at the same time and get pumped up on the way there. Interacting with People Try to calm your nerves so you can engage people. In order for you to be fun at a party, you need to be having fun at a party. If you’re a nervous wreck, you won’t want to talk to other people or participate in any of the activities of the party. Take a moment to calm your nerves before you start to interact with people at the party. Take some deep breaths if you start to feel anxious. Focus your thoughts on the present and the positive aspects of being at a fun party. Consider getting a drink to loosen up. Put your phone away when you get to the party. You need to keep your phone on you in case someone is trying to contact you, but you don’t want to be glued to it and miss out on the party. People will also think that you’re disinterested and aren’t any fun. When you arrive, put your phone in your pocket or purse so you can have fun at the party. Turn your ringer on loud so you can hear your phone. Set your phone to vibrate if you don’t want your ringer to go off during the party and embarrass you. Make eye contact when you talk to people. Give people your full attention when they’re talking to you so they know you’re listening to them. If you’re constantly looking around the party while someone is answering you, then they’ll think that you’re rude and you don’t care about what they have to say. People will think that you’re more fun if they feel like you like them and value their opinions. Tell jokes to loosen people up. Jokes are an easy way to break the ice and get people comfortable around you. People will have more fun if they’re relaxed and loose. Don’t be afraid to make jokes at your own expense, either. It shows people that you’re silly and fun. Try making cheesy impressions of people at the party, but don’t tease people too much or hurt their feelings. Tell the corniest joke or most awful pun that you know. Ask people questions about themselves. People love to talk about themselves, so an easy way to get them talking to and having fun with you is to simply let them do it. Whether you’re on the dance floor, next to the chips and dip, or even away from the music, asking someone at the party about their life and what they like to do for fun is a surefire way to make yourself fun. You can start with basic questions like, “So, what do you do for a living?” That will usually get the ball rolling and allows you to ask follow-up questions. If a song is playing, ask them if they know the song or like the music. Even if they don’t like it, it gets a conversation started. Try asking something personal and specific like, “What is your biggest fear?” People may get a kick out an engaging question as opposed to the small talk that often occurs at parties. Move around the party to talk to more people. Visit all of the different spaces of the party and talk to the different people and groups of people. If you stand in one spot or section of the party, you’ll limit the people you meet and the fun that you have. People will remember you if you work your way around the party to have fun with them. Ignore the impulse to stay in one spot with familiar people and get out of your comfort zone to have a little fun! Try not to drink too much. It’s a party, you should have fun, but be sure to drink in moderation. Alcohol is a great way to loosen people up and have fun, but nobody likes a sloppy drunk person at a party. Be sure to drink plenty of water in addition to any alcohol that you consume.Safety Tip: Never drink and drive. If you drink too much, have someone else drive, ride with someone else, or use a ride-sharing app like Uber or Lyft to get home safely. Doing Fun Activities Challenge someone to a dance-off. If you hear a song that you like or is popular, ask the people around you to dance. People may be hesitant at first, but if you get really into it and are having fun, they will want to join you. Don’t be afraid to take the first step! Choose a song that has choreography that many people know. For example, you can play “La Macarena” by Los Del Rio or “Footloose” and have people do the movements. If they don’t know them, you can teach them! Play a drinking game. Many parties will have alcoholic drinks being served so you can kick the party up a notch by initiating a drinking game. People will quickly loosen up and have fun once they start playing and drinking. Start up a game of beer pong. Even if you don’t have a super long table, you can still have some fun and a little friendly competition. Use a deck of cards to play king’s cup with a bunch of players. Make up your own drinking game. For example, if there’s a movie playing, make up a game related to the movie. You could have everyone drink whenever there’s a close-up shot or a kiss. Initiate a party game and try to get people to play. If you spot a game of Twister on the shelf or you see a video game console set up, ask people to play a game with you. The host of the party may have set up some fun party games to play, so take advantage of them and be the life of the party by getting people to participate. Try a classic game like charades if you don’t have any gaming supplies. Play “Never Have I Ever.” One person says something that they haven’t done, and if the other players have done it, they have to take a sip of their drink. For example, you could say, “Never have I ever kissed a fish.” If someone else has, then they have to drink! If people are hesitant at first, no problem! Just start playing around and when people see how much fun you’re having, they’ll join in! Do a party trick that you know. If you have some weird or interesting skill or ability, use it to impress or get a laugh from people at the party. Party tricks can be cheesy, but that’s kind of the point. Have fun and show people any weird ability or silly trick that you know. Try a card trick to impress people. Do some simple magic tricks  to wow and intrigue people at the party. For example, if you can curl or roll your tongue, ask people if they can do it and then show them how you can! Bring snacks for people to eat. Everyone loves food, so bringing some tasty snacks is a great way for you be fun and engage people. Put out your snacks when you arrive and while you’re at the party talking to new people, ask them if they’ve tried the snacks yet. Then tell them you made or brought them! Make a cheese or a spinach dip to bring with you. Tell people they should try it! Bring some healthy snacks for people to eat as well. Try making a vegan queso dip to give people a vegan option.Tip: Go to a foreign food market and pick up some interesting snacks for people to try. For example, visit an Asian supermarket and get some chips or drinks that people may have never tried before.",
  "tyn_model":[
    "phone",
    "alcohol",
    "“never",
    "snacks",
    "mirror",
    "“hi",
    "” or",
    "“nice",
    "”\n",
    "“so",
    "” that",
    "“what",
    "” people",
    "“la",
    "” by",
    "“footloose",
    "” and",
    "beer pong",
    "cards",
    "twister",
    "video game console",
    "” one",
    "drink",
    "” if"
  ],
  "tyn_section":[

  ]
}