{
  "title":"How to Cook Fish in a Flaky Pastry Coat",
  "url":"https://www.wikihow.com/Cook-Fish-in-a-Flaky-Pastry-Coat",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Unfreeze the puff pastry.",
      "description":""
    },
    {
      "headline":"Heat some oil in a pan.",
      "description":""
    },
    {
      "headline":"Cut the onion into fine rings and put it on the pan.",
      "description":"Fry on low heat for 5 minutes."
    },
    {
      "headline":"Chop garlic and add to pan.",
      "description":""
    },
    {
      "headline":"Chop the pepper and add to pan.",
      "description":"Fry for 10 to 15 minutes."
    },
    {
      "headline":"Add the fillets of fish and immediately add the milk.",
      "description":""
    },
    {
      "headline":"Add the bay leaves, the salt and the pepper.",
      "description":""
    },
    {
      "headline":"Steam the fish for about 20 minutes.",
      "description":""
    },
    {
      "headline":"Meanwhile in a small pot melt 3 oz of butter.",
      "description":"Turn off the flame and add the flour. Mix well. Add salt, oregano and basil.#"
    },
    {
      "headline":"Preheat oven to 400 °F (204 °C).",
      "description":""
    },
    {
      "headline":"Grease a ceramic rectangular baking pan with the rest of the butter.",
      "description":""
    },
    {
      "headline":"Take out the fish, the onion and pepper out of the pan after 20 minutes and put into the baking pan.",
      "description":"Set aside."
    },
    {
      "headline":"Pour the milk from the pan into the pot with the butter-flour sauce.",
      "description":"Mix well on low heat."
    },
    {
      "headline":"Now pour the sauce over the fish.",
      "description":""
    },
    {
      "headline":"Cut a rectangle of the puff pastry as large as the baking pan and cover the fish-sauce mass and form a \"pie crust\".",
      "description":""
    },
    {
      "headline":"Brush the pastry with the egg.",
      "description":""
    },
    {
      "headline":"Put on the oven and bake for 30 minutes.",
      "description":""
    }
  ],
  "text":" Unfreeze the puff pastry.  Heat some oil in a pan.  Cut the onion into fine rings and put it on the pan. Fry on low heat for 5 minutes. Chop garlic and add to pan.  Chop the pepper and add to pan. Fry for 10 to 15 minutes. Add the fillets of fish and immediately add the milk.  Add the bay leaves, the salt and the pepper.  Steam the fish for about 20 minutes.  Meanwhile in a small pot melt 3 oz of butter. Turn off the flame and add the flour. Mix well. Add salt, oregano and basil.# Preheat oven to 400 °F (204 °C).  Grease a ceramic rectangular baking pan with the rest of the butter.  Take out the fish, the onion and pepper out of the pan after 20 minutes and put into the baking pan. Set aside. Pour the milk from the pan into the pot with the butter-flour sauce. Mix well on low heat. Now pour the sauce over the fish.  Cut a rectangle of the puff pastry as large as the baking pan and cover the fish-sauce mass and form a \"pie crust\".  Brush the pastry with the egg.  Put on the oven and bake for 30 minutes. ",
  "tyn_model":[
    "fish",
    "pepper",
    "baking pan",
    "puff pastry",
    "onion",
    "milk",
    "salt",
    "butter",
    "oven",
    "oil",
    "pan",
    "garlic",
    "bay leaves",
    "small pot",
    "flour",
    "oregano",
    "basil",
    "pot",
    "butter-flour",
    "pastry",
    "egg"
  ],
  "tyn_section":[

  ]
}