{
  "title":"How to Prepare Grits",
  "url":"https://www.wikihow.com/Prepare-Grits",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Breakfast Cereal",
    "Oatmeal and Porridge"
  ],
  "methods":[
    {
      "name":"Traditional Grits",
      "steps":[
        {
          "headline":"Combine all the ingredients in a large saucepan.",
          "description":"These ingredients usually include the butter and salt but don't need to."
        },
        {
          "headline":"Bring the water containing the grits, butter, and salt to a boil.",
          "description":"Stay with the grits so that they don't boil over. Stir until butter is completely melted."
        },
        {
          "headline":"Once the water is boiling, cover the pot and reduce the heat to a simmer.",
          "description":""
        },
        {
          "headline":"Cook the grits for about 40 to 45 minutes.",
          "description":"You want the grits to have a smooth, creamy texture, but not be overcooked."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy the grits with:\nA bit of syrup or brown sugar sprinkled on top. A strawberry compote made with framboise and sugar. Extra cream and butter, severed straight up."
        }
      ]
    },
    {
      "name":"Instant Grits",
      "steps":[
        {
          "headline":"Use instant grits for quick fixes.",
          "description":"Instant grits are a lot quicker to cook than traditional grits, but many southerners feel that \"instant\" grits are synonymous with \"tasteless.\" But don't let that fool you. Decide for yourself!"
        },
        {
          "headline":"Bring 2 cups of water to boil in a large saucepan.",
          "description":""
        },
        {
          "headline":"Once the water is boiling, add 1/2 cup instant grits, 1 pinch salt, and 1 tablespoon butter.",
          "description":"Bring to a boil again."
        },
        {
          "headline":"Lower the heat on the burner to bring the grits to a slow simmer.",
          "description":""
        },
        {
          "headline":"Simmer for 5 minutes, stirring frequently.",
          "description":"Look for a creamy consistency. Enjoy!"
        }
      ]
    }
  ],
  "text":" Traditional Grits Combine all the ingredients in a large saucepan. These ingredients usually include the butter and salt but don't need to. Bring the water containing the grits, butter, and salt to a boil. Stay with the grits so that they don't boil over. Stir until butter is completely melted. Once the water is boiling, cover the pot and reduce the heat to a simmer.  Cook the grits for about 40 to 45 minutes. You want the grits to have a smooth, creamy texture, but not be overcooked. Serve. Enjoy the grits with:\nA bit of syrup or brown sugar sprinkled on top. A strawberry compote made with framboise and sugar. Extra cream and butter, severed straight up. Instant Grits Use instant grits for quick fixes. Instant grits are a lot quicker to cook than traditional grits, but many southerners feel that \"instant\" grits are synonymous with \"tasteless.\" But don't let that fool you. Decide for yourself! Bring 2 cups of water to boil in a large saucepan.  Once the water is boiling, add 1/2 cup instant grits, 1 pinch salt, and 1 tablespoon butter. Bring to a boil again. Lower the heat on the burner to bring the grits to a slow simmer.  Simmer for 5 minutes, stirring frequently. Look for a creamy consistency. Enjoy!",
  "tyn_model":[
    "butter",
    "water",
    "salt",
    "instant grits",
    "large saucepan",
    "pot",
    "brown sugar",
    "framboise",
    "sugar",
    "cream"
  ],
  "tyn_section":[

  ]
}