{
  "title":"How to Make Garlic Butter Roasted Carrots",
  "url":"https://www.wikihow.com/Make-Garlic-Butter-Roasted-Carrots",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 425° Fahrenheit or 218° Celsius.",
      "description":""
    },
    {
      "headline":"Grease a baking sheet with non-stick greasing spray or brush.",
      "description":""
    },
    {
      "headline":"Wash and diagonally slice the carrots into 2-3 inch pieces.",
      "description":"Set aside in a large bowl."
    },
    {
      "headline":"On medium heat, melt the butter on a large saucepan.",
      "description":""
    },
    {
      "headline":"Add the garlic and saute for about 3 minutes, until golden brown.",
      "description":""
    },
    {
      "headline":"Drizzle and toss the garlic butter over the carrots.",
      "description":""
    },
    {
      "headline":"Pour the carrots on the baking sheet.",
      "description":""
    },
    {
      "headline":"Bake the carrots for about 22-30 minutes, until the carrots are tender and have slightly roasted.",
      "description":""
    },
    {
      "headline":"Season the carrots with the salt and pepper.",
      "description":""
    },
    {
      "headline":"Allow the carrots to cool until warm.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Scoop a desired amount of garlic butter carrots onto a serving plate. Garnish with chopped parsley if desired. Enjoy!"
    }
  ],
  "text":" Preheat the oven to 425° Fahrenheit or 218° Celsius.  Grease a baking sheet with non-stick greasing spray or brush.  Wash and diagonally slice the carrots into 2-3 inch pieces. Set aside in a large bowl. On medium heat, melt the butter on a large saucepan.  Add the garlic and saute for about 3 minutes, until golden brown.  Drizzle and toss the garlic butter over the carrots.  Pour the carrots on the baking sheet.  Bake the carrots for about 22-30 minutes, until the carrots are tender and have slightly roasted.  Season the carrots with the salt and pepper.  Allow the carrots to cool until warm.  Serve. Scoop a desired amount of garlic butter carrots onto a serving plate. Garnish with chopped parsley if desired. Enjoy!",
  "tyn_model":[
    "carrots",
    "baking sheet",
    "garlic butter",
    "oven",
    "non-stick greasing spray",
    "large bowl",
    "butter",
    "large saucepan",
    "garlic",
    "salt and pepper",
    "serving plate",
    "parsley"
  ],
  "tyn_section":[

  ]
}