{
  "title":"How to Make Super Fudge Brownies",
  "url":"https://www.wikihow.com/Make-Super-Fudge-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 325ºF/165ºC.",
      "description":"Butter and flour the baking pan."
    },
    {
      "headline":"Melt butter and chocolate over medium-low heat, stirring until well blended.",
      "description":""
    },
    {
      "headline":"Add cocoa and fold it into the butter mixture",
      "description":""
    },
    {
      "headline":"Remove butter/chocolate mixture from heat, and stir in sugar and vanilla extract.",
      "description":""
    },
    {
      "headline":"Add eggs, one at a time, beating well after each addition.",
      "description":""
    },
    {
      "headline":"Stir in flour.",
      "description":"Mix in chocolate chips or chopped nuts."
    },
    {
      "headline":"Spread batter evenly in the prepared pan.",
      "description":""
    },
    {
      "headline":"Sprinkle chocolate chips or chopped nuts evenly across surface.",
      "description":""
    },
    {
      "headline":"Bake in a 325ºF/165ºC oven for about 45-55-minutes or until brownie feels dry on top.",
      "description":""
    },
    {
      "headline":"Let the brownies cool in the pan on a rack.",
      "description":"When completely cool, cut into squares and store airtight."
    },
    {
      "headline":"Cut into bite-sized pieces and enjoy!",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat oven to 325ºF/165ºC. Butter and flour the baking pan. Melt butter and chocolate over medium-low heat, stirring until well blended.  Add cocoa and fold it into the butter mixture  Remove butter/chocolate mixture from heat, and stir in sugar and vanilla extract.  Add eggs, one at a time, beating well after each addition.  Stir in flour. Mix in chocolate chips or chopped nuts. Spread batter evenly in the prepared pan.  Sprinkle chocolate chips or chopped nuts evenly across surface.  Bake in a 325ºF/165ºC oven for about 45-55-minutes or until brownie feels dry on top.  Let the brownies cool in the pan on a rack. When completely cool, cut into squares and store airtight. Cut into bite-sized pieces and enjoy!  Finished. ",
  "tyn_model":[
    "butter",
    "oven",
    "flour",
    "chocolate",
    "chocolate chips",
    "baking pan",
    "cocoa",
    "sugar",
    "vanilla extract",
    "eggs"
  ],
  "tyn_section":[

  ]
}