{
  "title":"How to Make Watermelon Sherbet",
  "url":"https://www.wikihow.com/Make-Watermelon-Sherbet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Sorbet and Sherbet"
  ],
  "steps":[
    {
      "headline":"Make a syrup.",
      "description":"Dissolve the sugar in the water in a saucepan over gentle heat. Bring to the boil and boil for 3 minutes."
    },
    {
      "headline":"Pour the mixture into a bowl.",
      "description":"Leave to cool. Once cooled, place in the fridge to chill for 1 hour."
    },
    {
      "headline":"Cut the watermelon into cubes.",
      "description":"Puree the cubes in a blender or food processor until smooth."
    },
    {
      "headline":"Push the pureed watermelon mixture through a coarse sieve over the bowl.",
      "description":"Add the lemon or lime juice and the salt and mix through."
    },
    {
      "headline":"Put the pureed mixture into the fridge.",
      "description":"Leave to chill for one hour. Once chilled, stir in the chilled syrup and mix through."
    },
    {
      "headline":"Pour the mix into an ice cream maker and follow the manufacturer's instructions.",
      "description":"Alternatively, use an ice cream tray if making by hand and freeze just until it starts to set around the edges."
    },
    {
      "headline":"Remove the ice cream tray from the freezer and beat the ice cream until smooth.",
      "description":"Cover with foil and return to the freezer. Freeze until it becomes entirely firm."
    },
    {
      "headline":"Serve.",
      "description":"Scoop into suitable serving bowls. Feel free to add a garnish of fresh mint leaves."
    }
  ],
  "text":" Make a syrup. Dissolve the sugar in the water in a saucepan over gentle heat. Bring to the boil and boil for 3 minutes. Pour the mixture into a bowl. Leave to cool. Once cooled, place in the fridge to chill for 1 hour. Cut the watermelon into cubes. Puree the cubes in a blender or food processor until smooth. Push the pureed watermelon mixture through a coarse sieve over the bowl. Add the lemon or lime juice and the salt and mix through. Put the pureed mixture into the fridge. Leave to chill for one hour. Once chilled, stir in the chilled syrup and mix through. Pour the mix into an ice cream maker and follow the manufacturer's instructions. Alternatively, use an ice cream tray if making by hand and freeze just until it starts to set around the edges. Remove the ice cream tray from the freezer and beat the ice cream until smooth. Cover with foil and return to the freezer. Freeze until it becomes entirely firm. Serve. Scoop into suitable serving bowls. Feel free to add a garnish of fresh mint leaves.",
  "tyn_model":[
    "bowl",
    "fridge",
    "watermelon",
    "ice cream tray",
    "freezer",
    "sugar",
    "water",
    "saucepan",
    "blender",
    "food processor",
    "lemon",
    "salt",
    "ice cream maker",
    "ice cream",
    "foil"
  ],
  "tyn_section":[

  ]
}