{
  "title":"How to Make Rolled Wafers",
  "url":"https://www.wikihow.com/Make-Rolled-Wafers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Cream the butter, add sugar gradually, and milk drop by drop, in a large mixing bowl.",
      "description":"Add the flour and flavoring and mix through."
    },
    {
      "headline":"Spread the dough very thinly with a broad, long-bladed knife on the buttered inverted pan.",
      "description":"Crease in three-inch squares."
    },
    {
      "headline":"Bake in a slow oven until delicately browned.",
      "description":""
    },
    {
      "headline":"Place the warm dough on a warm surface.",
      "description":"Cut squares apart with a sharp knife, and roll while warm in tubular or cornucopia shapes. If the squares become too brittle to roll, place back in the oven to soften again. If rolled in a tubular shape, tie in bunches with narrow ribbon."
    },
    {
      "headline":"Serve.",
      "description":"These are very attractive, and may be served with sherbet, ice cream, or chocolate. If you choose to roll them in a cornucopia shape, they can be filled with whipped cream just before sending to table."
    }
  ],
  "text":" Cream the butter, add sugar gradually, and milk drop by drop, in a large mixing bowl. Add the flour and flavoring and mix through. Spread the dough very thinly with a broad, long-bladed knife on the buttered inverted pan. Crease in three-inch squares. Bake in a slow oven until delicately browned.  Place the warm dough on a warm surface. Cut squares apart with a sharp knife, and roll while warm in tubular or cornucopia shapes. If the squares become too brittle to roll, place back in the oven to soften again. If rolled in a tubular shape, tie in bunches with narrow ribbon. Serve. These are very attractive, and may be served with sherbet, ice cream, or chocolate. If you choose to roll them in a cornucopia shape, they can be filled with whipped cream just before sending to table.",
  "tyn_model":[
    "oven",
    "butter",
    "sugar",
    "milk",
    "large mixing bowl",
    "flour",
    "buttered inverted pan",
    "sherbet",
    "ice cream",
    "chocolate",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}