{
  "title":"How to Make a Warm Salad with Halloumi Cheese",
  "url":"https://www.wikihow.com/Make-a-Warm-Salad-with-Halloumi-Cheese",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Traditional Salads"
  ],
  "steps":[
    {
      "headline":"Heat the butter in the frying pan.",
      "description":""
    },
    {
      "headline":"Add the onion and gently fry for about 10 minutes.",
      "description":"Use the wooden spoon to stir until they are soft and lightly caramelized."
    },
    {
      "headline":"Turn up the heat under the onions and add all of the vegetables and a pinch of salt.",
      "description":""
    },
    {
      "headline":"Continue to stir for 2-3 minutes.",
      "description":""
    },
    {
      "headline":"Reduce the heat and continue to gently stir for another minute, then take off the heat and set aside.",
      "description":""
    },
    {
      "headline":"Grab the bowl and whisk the oil, lemon zest, juice and a little seasoning to taste.",
      "description":""
    },
    {
      "headline":"Toss the oil mixture and parsley through the vegetables and turn out onto a large service plate.",
      "description":""
    },
    {
      "headline":"Wipe the frying pan out with the kitchen paper and dry fry the cheese for 2 - 3 minutes, until browned.",
      "description":""
    },
    {
      "headline":"Scatter the cheese over the salad and add some parsley to garnish.",
      "description":""
    }
  ],
  "text":" Heat the butter in the frying pan.  Add the onion and gently fry for about 10 minutes. Use the wooden spoon to stir until they are soft and lightly caramelized. Turn up the heat under the onions and add all of the vegetables and a pinch of salt.  Continue to stir for 2-3 minutes.  Reduce the heat and continue to gently stir for another minute, then take off the heat and set aside.  Grab the bowl and whisk the oil, lemon zest, juice and a little seasoning to taste.  Toss the oil mixture and parsley through the vegetables and turn out onto a large service plate.  Wipe the frying pan out with the kitchen paper and dry fry the cheese for 2 - 3 minutes, until browned.  Scatter the cheese over the salad and add some parsley to garnish. ",
  "tyn_model":[
    "frying pan",
    "oil",
    "parsley",
    "butter",
    "onion",
    "wooden spoon",
    "onions",
    "vegetables",
    "salt",
    "bowl",
    "lemon",
    "large service plate",
    "kitchen paper"
  ],
  "tyn_section":[

  ]
}