{
  "title":"How to Make Spicy Indian Tomato Chutney",
  "url":"https://www.wikihow.com/Make-Spicy-Indian-Tomato-Chutney",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Tomato Dishes"
  ],
  "parts":[
    {
      "name":"Making the Different Pastes",
      "steps":[
        {
          "headline":"Wash the tomatoes.",
          "description":"Cut them into slices. Place into the blender and blend until liquefied. (Don't add water.) Set the tomato paste aside."
        },
        {
          "headline":"Remove the peel from the ginger and garlic.",
          "description":"Put into the blender. Add 25 ml water into the blender to form into a paste. Set the ginger and garlic paste aside."
        },
        {
          "headline":"Peel the onions.",
          "description":"Cut into pieces and put into the blender. Add 25 ml water to make into a paste. Set the onion paste aside."
        }
      ]
    },
    {
      "name":"Heating the Ingredients",
      "steps":[
        {
          "headline":"Place the saucepan onto the stove top to heat.",
          "description":"Add 150ml of the oil to the base of the pan. Heat it gently, then add the mustard seeds. Then add the curry leaves."
        },
        {
          "headline":"Add the ginger and garlic paste and stir it in.",
          "description":""
        },
        {
          "headline":"Wait for the raw odor to dissipate.",
          "description":"Stir the mixture as it cooks until it softens. It will take around 2 to 3 minutes for the smell to dissipate."
        },
        {
          "headline":"Add the onion paste to the saucepan.",
          "description":"Stir for 2 minutes while it cooks in."
        },
        {
          "headline":"Add the tomato paste.",
          "description":"Stir it in. Turn the heat up to maximum. Add the turmeric powder and stir in, then reduce the heat."
        },
        {
          "headline":"Add the chilli powder after a minute.",
          "description":"Stir the mixture."
        },
        {
          "headline":"Add salt to taste.",
          "description":"You can begin with a small amount and add more if needed. Add the coriander powder and stir through."
        }
      ]
    },
    {
      "name":"Cooking the Chutney Mixture",
      "steps":[
        {
          "headline":"Let the chutney mixture boil for 10 to 15 minutes over a low flame (or low heat).",
          "description":""
        },
        {
          "headline":"Add the remaining 100ml of oil to the tomato chutney.",
          "description":"Boil the chutney for 2 minutes."
        },
        {
          "headline":"Switch off the heat/flame.",
          "description":"The tomato chutney is ready for serving."
        },
        {
          "headline":"Serve.",
          "description":"It is good to eat with boiled rice and dosa, idly, upma, roti, chapatti, curd rice, and so forth."
        }
      ]
    }
  ],
  "text":" Making the Different Pastes Wash the tomatoes. Cut them into slices. Place into the blender and blend until liquefied. (Don't add water.) Set the tomato paste aside. Remove the peel from the ginger and garlic. Put into the blender. Add 25 ml water into the blender to form into a paste. Set the ginger and garlic paste aside. Peel the onions. Cut into pieces and put into the blender. Add 25 ml water to make into a paste. Set the onion paste aside. Heating the Ingredients Place the saucepan onto the stove top to heat. Add 150ml of the oil to the base of the pan. Heat it gently, then add the mustard seeds. Then add the curry leaves. Add the ginger and garlic paste and stir it in.  Wait for the raw odor to dissipate. Stir the mixture as it cooks until it softens. It will take around 2 to 3 minutes for the smell to dissipate. Add the onion paste to the saucepan. Stir for 2 minutes while it cooks in. Add the tomato paste. Stir it in. Turn the heat up to maximum. Add the turmeric powder and stir in, then reduce the heat. Add the chilli powder after a minute. Stir the mixture. Add salt to taste. You can begin with a small amount and add more if needed. Add the coriander powder and stir through. Cooking the Chutney Mixture Let the chutney mixture boil for 10 to 15 minutes over a low flame (or low heat).  Add the remaining 100ml of oil to the tomato chutney. Boil the chutney for 2 minutes. Switch off the heat/flame. The tomato chutney is ready for serving. Serve. It is good to eat with boiled rice and dosa, idly, upma, roti, chapatti, curd rice, and so forth.",
  "tyn_model":[
    "blender",
    "water",
    "ginger",
    "garlic",
    "saucepan",
    "oil",
    "tomato chutney",
    "tomatoes",
    "onions",
    "stove top",
    "mustard seeds",
    "curry leaves",
    "onion",
    "tomato paste",
    "turmeric",
    "chilli powder",
    "salt",
    "coriander",
    "boiled rice",
    "curd rice"
  ],
  "tyn_section":[

  ]
}