{
  "title":"How to Make Sir Edmund Hillary's Nutty Crunch",
  "url":"https://www.wikihow.com/Make-Sir-Edmund-Hillary%27s-Nutty-Crunch",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "steps":[
    {
      "headline":"Place all of the ingredients into a large mixing bowl, except for the butter.",
      "description":"Mix together well."
    },
    {
      "headline":"Melt the butter in a heavy-based saucepan over low heat.",
      "description":""
    },
    {
      "headline":"Tip the mixing bowl mixture into the saucepan of melted butter.",
      "description":""
    },
    {
      "headline":"Heat gently, stirring continuously until the sugar melts.",
      "description":""
    },
    {
      "headline":"Remove from the heat.",
      "description":""
    },
    {
      "headline":"Spread the mixture across a tray lined with baking paper.",
      "description":"Leave it to cool."
    },
    {
      "headline":"Store.",
      "description":"Once cooled, place into an airtight container for storage. As suggested above, use as a topping for ice-cream, puddings, and fruit."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Place all of the ingredients into a large mixing bowl, except for the butter. Mix together well. Melt the butter in a heavy-based saucepan over low heat.  Tip the mixing bowl mixture into the saucepan of melted butter.  Heat gently, stirring continuously until the sugar melts.  Remove from the heat.  Spread the mixture across a tray lined with baking paper. Leave it to cool. Store. Once cooled, place into an airtight container for storage. As suggested above, use as a topping for ice-cream, puddings, and fruit. Finished. ",
  "tyn_model":[
    "butter",
    "large mixing bowl",
    "heavy-based saucepan",
    "mixing bowl",
    "saucepan",
    "sugar",
    "tray",
    "baking paper",
    "airtight container",
    "ice-cream",
    "fruit"
  ],
  "tyn_section":[

  ]
}