{
  "title":"How to Make Girl Scout Cookies",
  "url":"https://www.wikihow.com/Make-Girl-Scout-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Making Samoas",
      "steps":[
        {
          "headline":"Cream together 1 cup of butter and ½ cup of sugar.",
          "description":"Measure out your butter and sugar and then combine them in a large mixing bowl. Use a hand mixer or stand mixer to cream them together. You can also use a fork to cream the ingredients together. It will just take a little more time and effort."
        },
        {
          "headline":"Add the other ingredients.",
          "description":"Next add the flour, baking powder, vanilla extract, and milk to the bowl. Then mix together the ingredients until they form a dough. You can use a fork, a hand mixer or stand mixer, or your hands to mix the dough. Make sure that the ingredients are well combined. You may even want to sift together the dry ingredients in a separate bowl before adding them to the butter and sugar mixture. Then, mix in the milk and vanilla extract with the butter and sugar before adding the dry ingredients to the butter and sugar."
        },
        {
          "headline":"Refrigerate and roll out the cookie dough.",
          "description":"Refrigerating the cookie dough before you roll it out may make the dough easier to work with. Try wrapping the dough in plastic wrap and placing it in the refrigerator for an hour. Before you begin rolling out and cutting your cookie dough, turn on the oven. You will need to heat the oven to 350 degrees Fahrenheit to bake the cookies and to toast the coconut. After the dough is chilled, place it onto a piece of parchment paper. Then, place another equal sized piece of parchment paper over the dough ball. Use a rolling pin to roll out the dough between the two pieces of parchment paper."
        },
        {
          "headline":"Cut the cookies into ring shapes.",
          "description":"Use a round cookie cutter to cut disc shapes in the dough. Then, use a smaller round cookie cutter or a frosting bag tip to cut a smaller circle out of the center of the dough. You can cut the cookies into any shape you like, but cutting them into rings will help to make the cookies look more like real Samoas."
        },
        {
          "headline":"Bake the cookies.",
          "description":"Place the cookie dough rings on a baking sheet and bake the cookies at 350 degrees Fahrenheit for about 10 minutes. The cookies should look slightly browned when they are ready. After they are done, remove them from the oven and let them cool. You can transfer them to a cooling rack after you remove them from the oven to help them cool faster."
        },
        {
          "headline":"Toast the coconut.",
          "description":"Line a cookie sheet with parchment paper and dump an entire bag of sweetened coconut onto the parchment paper. Bake the coconut at 350 degrees Fahrenheit for 10 minutes. Do not allow the coconut to bake for any longer than this or it will burn. You can also toast coconut over medium heat in a non-stick skillet if you prefer. To do this, you will need to watch the coconut until it is completely toasted. Remove it from the pan when it is done toasting to prevent it from burning."
        },
        {
          "headline":"Melt the caramel and 1 teaspoon of milk.",
          "description":"Unwrap the caramels and place them into a microwave safe bowl. Then add 1 teaspoon of milk to the bowl and microwave the milk and caramels for about 15 to 20 seconds. You can add more milk (one teaspoon at a time) for a thinner caramel sauce if it seems too thick. Remove the bowl from the microwave and stir the milk and caramels together. Combine the caramel with the toasted coconut."
        },
        {
          "headline":"Add the topping.",
          "description":"After the cookies are done and the topping is done, top each of the cookies with some of the caramel and coconut mixture. Try to place the topping so that it goes around the cookie's ring, not over the hole in the center. Press the topping gently to make it stay in place."
        },
        {
          "headline":"Melt the chocolate.",
          "description":"Next, place 2 cups of semi-sweet chocolate chips into a microwave safe bowl or in the glass bowl of a double boiler to melt them. Microwave the chocolate for about one minute or heat the water under the glass bowl of the double boiler until the chocolate melts. Stir the chocolate after a minute in the microwave or as it starts to melt in the double boiler."
        },
        {
          "headline":"Coat the cookie bottoms.",
          "description":"Dip the cookies into the melted chocolate so that just the bottoms get coated in the chocolate. If you prefer, you can also spread some chocolate on the bottoms of the cookies using a spoon. Place the cookies onto a tray or plate lined with parchment paper as you finish dipping them in the chocolate."
        },
        {
          "headline":"Drizzle with chocolate.",
          "description":"Finish the cookies by drizzling them with chocolate syrup. You can do this by filling a pastry bag or a plastic Ziploc bag with some melted chocolate and cutting a small hole in the tip. Then, squeeze the bag over the cookies and move it side to side to add the chocolate drizzle. Make sure that the chocolate is still warm when you do this or it will not drizzle easily."
        }
      ]
    },
    {
      "name":"Making Thin Mints",
      "steps":[
        {
          "headline":"Mix together 1 cup of butter and 1 cup of sugar.",
          "description":"Place the butter and sugar into a large mixing bowl. Use your hand mixer or stand mixer to combine the butter and sugar. Your butter should be at room temperature when you mix it with the sugar. Mix until the ingredients are well-combined and they have a fluffy texture."
        },
        {
          "headline":"Add the extracts and egg.",
          "description":"Crack one egg and add it to the sugar and butter mixture. Then add 1 and ¼ teaspoons of peppermint extract to the bowl. Use your hand mixer or stand mixer to combine these ingredients. Make sure that you use peppermint extract and not mint extract."
        },
        {
          "headline":"Sift in the dry ingredients.",
          "description":"Next, sift together the flour, cocoa powder, and salt in a separate bowl. Then sift these dry ingredients into the wet ingredients. Mix all of the ingredients together until a dough forms. Use your hand mixer or stand mixer to combine the ingredients."
        },
        {
          "headline":"Refrigerate the dough.",
          "description":"After you have your cookie dough, wrap it in a piece of plastic wrap or in a plastic Ziploc bag. Then place the dough in the refrigerator and let it sit for at least one hour. This will help the dough to keep its shape when you roll it out and cut out the cookies. Chilling the dough will make it much easier to work with and keep its shape. Otherwise, the dough may slide around and not stay in the shape you cut the cookies into."
        },
        {
          "headline":"Preheat the oven to 350 degrees Fahrenheit.",
          "description":"The oven will need to be heated to 350 degrees Fahrenheit to cook the cookies properly. Turn on your oven and set the temperature to 350 degrees Fahrenheit just before you begin to roll out the cookie dough."
        },
        {
          "headline":"Roll out the dough.",
          "description":"Remove the dough from the refrigerator and remove it from the plastic wrap or bag. Lay the dough on a floured work surface and sprinkle it with some flour as well. This will help to prevent the dough from sticking to the rolling pin. Roll the dough out so that it is about 1/8 of an inch thick. Keep sprinkling flour onto the dough to prevent it from sticking to the rolling pin. You can also sprinkle the dough with confectioner's sugar. This can help to prevent the dough from becoming tough from too much added flour."
        },
        {
          "headline":"Cut out the cookies.",
          "description":"Use a circular cookie cutter to cut out the cookies. You can use a different shape if you prefer, but using a circular shape will make the cookies look more like real Thin Mints. Make sure that you cut the cookies close together to get as many cookies as you can from the rolled out dough. After you have cut out as many cookies as you can, you can gather up the excess dough and roll this out again to cut more cookies from it if desired."
        },
        {
          "headline":"Bake the cookies.",
          "description":"After you cut out the cookies, transfer them to a parchment lined cookie sheet. Bake the cookies at 350 degrees for 10 to 12 minutes. When time is up, remove the cookies from the oven and transfer them to a cooling rack."
        },
        {
          "headline":"Melt the chocolate.",
          "description":"While the cookies are baking, you can melt the chocolate. Place your bag of chocolate chips or candy melts into a bowl and microwave it for about one minute. Then, remove it from the microwave and stir the chocolate. If necessary, you can microwave the chocolate for longer, but do it in short intervals, such as 5 to 10 seconds at a time. If the chocolate seems too thick, then you can always add a small amount of shortening to the chocolate to thin it out. Try stirring in 1 teaspoon to the melted chocolate to make it thinner."
        },
        {
          "headline":"Dip the cookies.",
          "description":"After the cookies have cooled and the chocolate is melted, you can begin dipping the cookies into the chocolate. Line a cookie sheet with parchment paper to place the cookies on after you finish dipping each one. Dip each of the cookies into the chocolate using a fork to hold the cookie. Wipe the excess chocolate on the rim of the bowl before you transfer the cookie to the parchment-lined cookie sheet. Allow the cookies to set before enjoying. This will take about 10 minutes, but you can also pop them in the fridge to set if you like."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Samoas Cream together 1 cup of butter and ½ cup of sugar. Measure out your butter and sugar and then combine them in a large mixing bowl. Use a hand mixer or stand mixer to cream them together. You can also use a fork to cream the ingredients together. It will just take a little more time and effort. Add the other ingredients. Next add the flour, baking powder, vanilla extract, and milk to the bowl. Then mix together the ingredients until they form a dough. You can use a fork, a hand mixer or stand mixer, or your hands to mix the dough. Make sure that the ingredients are well combined. You may even want to sift together the dry ingredients in a separate bowl before adding them to the butter and sugar mixture. Then, mix in the milk and vanilla extract with the butter and sugar before adding the dry ingredients to the butter and sugar. Refrigerate and roll out the cookie dough. Refrigerating the cookie dough before you roll it out may make the dough easier to work with. Try wrapping the dough in plastic wrap and placing it in the refrigerator for an hour. Before you begin rolling out and cutting your cookie dough, turn on the oven. You will need to heat the oven to 350 degrees Fahrenheit to bake the cookies and to toast the coconut. After the dough is chilled, place it onto a piece of parchment paper. Then, place another equal sized piece of parchment paper over the dough ball. Use a rolling pin to roll out the dough between the two pieces of parchment paper. Cut the cookies into ring shapes. Use a round cookie cutter to cut disc shapes in the dough. Then, use a smaller round cookie cutter or a frosting bag tip to cut a smaller circle out of the center of the dough. You can cut the cookies into any shape you like, but cutting them into rings will help to make the cookies look more like real Samoas. Bake the cookies. Place the cookie dough rings on a baking sheet and bake the cookies at 350 degrees Fahrenheit for about 10 minutes. The cookies should look slightly browned when they are ready. After they are done, remove them from the oven and let them cool. You can transfer them to a cooling rack after you remove them from the oven to help them cool faster. Toast the coconut. Line a cookie sheet with parchment paper and dump an entire bag of sweetened coconut onto the parchment paper. Bake the coconut at 350 degrees Fahrenheit for 10 minutes. Do not allow the coconut to bake for any longer than this or it will burn. You can also toast coconut over medium heat in a non-stick skillet if you prefer. To do this, you will need to watch the coconut until it is completely toasted. Remove it from the pan when it is done toasting to prevent it from burning. Melt the caramel and 1 teaspoon of milk. Unwrap the caramels and place them into a microwave safe bowl. Then add 1 teaspoon of milk to the bowl and microwave the milk and caramels for about 15 to 20 seconds. You can add more milk (one teaspoon at a time) for a thinner caramel sauce if it seems too thick. Remove the bowl from the microwave and stir the milk and caramels together. Combine the caramel with the toasted coconut. Add the topping. After the cookies are done and the topping is done, top each of the cookies with some of the caramel and coconut mixture. Try to place the topping so that it goes around the cookie's ring, not over the hole in the center. Press the topping gently to make it stay in place. Melt the chocolate. Next, place 2 cups of semi-sweet chocolate chips into a microwave safe bowl or in the glass bowl of a double boiler to melt them. Microwave the chocolate for about one minute or heat the water under the glass bowl of the double boiler until the chocolate melts. Stir the chocolate after a minute in the microwave or as it starts to melt in the double boiler. Coat the cookie bottoms. Dip the cookies into the melted chocolate so that just the bottoms get coated in the chocolate. If you prefer, you can also spread some chocolate on the bottoms of the cookies using a spoon. Place the cookies onto a tray or plate lined with parchment paper as you finish dipping them in the chocolate. Drizzle with chocolate. Finish the cookies by drizzling them with chocolate syrup. You can do this by filling a pastry bag or a plastic Ziploc bag with some melted chocolate and cutting a small hole in the tip. Then, squeeze the bag over the cookies and move it side to side to add the chocolate drizzle. Make sure that the chocolate is still warm when you do this or it will not drizzle easily. Making Thin Mints Mix together 1 cup of butter and 1 cup of sugar. Place the butter and sugar into a large mixing bowl. Use your hand mixer or stand mixer to combine the butter and sugar. Your butter should be at room temperature when you mix it with the sugar. Mix until the ingredients are well-combined and they have a fluffy texture. Add the extracts and egg. Crack one egg and add it to the sugar and butter mixture. Then add 1 and ¼ teaspoons of peppermint extract to the bowl. Use your hand mixer or stand mixer to combine these ingredients. Make sure that you use peppermint extract and not mint extract. Sift in the dry ingredients. Next, sift together the flour, cocoa powder, and salt in a separate bowl. Then sift these dry ingredients into the wet ingredients. Mix all of the ingredients together until a dough forms. Use your hand mixer or stand mixer to combine the ingredients. Refrigerate the dough. After you have your cookie dough, wrap it in a piece of plastic wrap or in a plastic Ziploc bag. Then place the dough in the refrigerator and let it sit for at least one hour. This will help the dough to keep its shape when you roll it out and cut out the cookies. Chilling the dough will make it much easier to work with and keep its shape. Otherwise, the dough may slide around and not stay in the shape you cut the cookies into. Preheat the oven to 350 degrees Fahrenheit. The oven will need to be heated to 350 degrees Fahrenheit to cook the cookies properly. Turn on your oven and set the temperature to 350 degrees Fahrenheit just before you begin to roll out the cookie dough. Roll out the dough. Remove the dough from the refrigerator and remove it from the plastic wrap or bag. Lay the dough on a floured work surface and sprinkle it with some flour as well. This will help to prevent the dough from sticking to the rolling pin. Roll the dough out so that it is about 1/8 of an inch thick. Keep sprinkling flour onto the dough to prevent it from sticking to the rolling pin. You can also sprinkle the dough with confectioner's sugar. This can help to prevent the dough from becoming tough from too much added flour. Cut out the cookies. Use a circular cookie cutter to cut out the cookies. You can use a different shape if you prefer, but using a circular shape will make the cookies look more like real Thin Mints. Make sure that you cut the cookies close together to get as many cookies as you can from the rolled out dough. After you have cut out as many cookies as you can, you can gather up the excess dough and roll this out again to cut more cookies from it if desired. Bake the cookies. After you cut out the cookies, transfer them to a parchment lined cookie sheet. Bake the cookies at 350 degrees for 10 to 12 minutes. When time is up, remove the cookies from the oven and transfer them to a cooling rack. Melt the chocolate. While the cookies are baking, you can melt the chocolate. Place your bag of chocolate chips or candy melts into a bowl and microwave it for about one minute. Then, remove it from the microwave and stir the chocolate. If necessary, you can microwave the chocolate for longer, but do it in short intervals, such as 5 to 10 seconds at a time. If the chocolate seems too thick, then you can always add a small amount of shortening to the chocolate to thin it out. Try stirring in 1 teaspoon to the melted chocolate to make it thinner. Dip the cookies. After the cookies have cooled and the chocolate is melted, you can begin dipping the cookies into the chocolate. Line a cookie sheet with parchment paper to place the cookies on after you finish dipping each one. Dip each of the cookies into the chocolate using a fork to hold the cookie. Wipe the excess chocolate on the rim of the bowl before you transfer the cookie to the parchment-lined cookie sheet. Allow the cookies to set before enjoying. This will take about 10 minutes, but you can also pop them in the fridge to set if you like. Finished. ",
  "tyn_model":[
    "chocolate",
    "butter",
    "sugar",
    "oven",
    "coconut",
    "milk",
    "bowl",
    "parchment paper",
    "hand mixer",
    "stand mixer",
    "flour",
    "microwave",
    "fork",
    "cookie dough",
    "plastic wrap",
    "refrigerator",
    "rolling pin",
    "caramel",
    "double boiler",
    "large mixing bowl",
    "vanilla extract",
    "cookie cutter",
    "cookie sheet",
    "microwave safe bowl",
    "chocolate chips",
    "ziploc bag",
    "thin mints",
    "peppermint extract",
    "baking powder",
    "frosting bag tip",
    "baking sheet",
    "sweetened coconut",
    "non-stick skillet",
    "water",
    "spoon",
    "chocolate syrup",
    "pastry bag",
    "egg",
    "mint extract",
    "cocoa powder",
    "salt",
    "confectioner's sugar",
    "circular cookie cutter",
    "cookies",
    "parchment lined cookie sheet",
    "candy melts",
    "shortening",
    "parchment-lined cookie sheet"
  ],
  "tyn_section":[

  ]
}