{
  "title":"How to Make a Simple Meatloaf",
  "url":"https://www.wikihow.com/Make-a-Simple-Meatloaf",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "steps":[
    {
      "headline":"Gather all needed ingredients.",
      "description":""
    },
    {
      "headline":"Tear the bread into small pieces.",
      "description":"You could toast the bread and break it up after it cools if you prefer."
    },
    {
      "headline":"Preheat your oven to 350 °F (177 °C).",
      "description":""
    },
    {
      "headline":"Spray a shallow baking pan with nonstick cooking spray.",
      "description":""
    },
    {
      "headline":"Add all the ingredients to a mixing bowl.",
      "description":""
    },
    {
      "headline":"Combine all the ingredients thoroughly.",
      "description":"You can use your clean hands to mix up the meat loaf or use a heavy-duty stand mixer such as a Kitchen Aid to do this."
    },
    {
      "headline":"Shape into a loaf and place in the prepared baking pan.",
      "description":""
    },
    {
      "headline":"Spread ketchup over the top of the loaf.",
      "description":""
    },
    {
      "headline":"Bake approximately one hour.",
      "description":"Use a clean meat thermometer to ensure it's baked properly."
    },
    {
      "headline":"Remove from bread pan.",
      "description":"Slice like bread to serve."
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Gather all needed ingredients.  Tear the bread into small pieces. You could toast the bread and break it up after it cools if you prefer. Preheat your oven to 350 °F (177 °C).  Spray a shallow baking pan with nonstick cooking spray.  Add all the ingredients to a mixing bowl.  Combine all the ingredients thoroughly. You can use your clean hands to mix up the meat loaf or use a heavy-duty stand mixer such as a Kitchen Aid to do this. Shape into a loaf and place in the prepared baking pan.  Spread ketchup over the top of the loaf.  Bake approximately one hour. Use a clean meat thermometer to ensure it's baked properly. Remove from bread pan. Slice like bread to serve. Enjoy! ",
  "tyn_model":[
    "oven",
    "shallow baking pan",
    "nonstick cooking spray",
    "mixing bowl",
    "meat loaf",
    "heavy-duty stand mixer",
    "kitchen aid",
    "baking pan",
    "ketchup",
    "meat thermometer",
    "bread pan"
  ],
  "tyn_section":[

  ]
}