{
  "title":"How to Make Lavender and Thyme Potpourri",
  "url":"https://www.wikihow.com/Make-Lavender-and-Thyme-Potpourri",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Potpourri"
  ],
  "steps":[
    {
      "headline":"Dry any of the fresh or moist ingredients that are not already dry.",
      "description":"There should be no moisture or you risk mildew growth. Arrange the freshly picked leaves on a tray and place in a sunny spot to dry or dry for a few hours in an oven on very low heat."
    },
    {
      "headline":"Mix together all of the ingredients in a large bowl.",
      "description":"Mix together thoroughly so that the orris root powder is evenly distributed."
    },
    {
      "headline":"Put the potpourri mixture into a dark, covered container.",
      "description":"Put away into storage for 4 - 6 weeks. Stir it each few days to distribute the essences."
    },
    {
      "headline":"Use as required.",
      "description":"When you are satisfied that the mixture is scented to your liking, it can be put into potpourri bowls or inside sachets. Keep wherever you would like this scent to permeate the air."
    }
  ],
  "text":" Dry any of the fresh or moist ingredients that are not already dry. There should be no moisture or you risk mildew growth. Arrange the freshly picked leaves on a tray and place in a sunny spot to dry or dry for a few hours in an oven on very low heat. Mix together all of the ingredients in a large bowl. Mix together thoroughly so that the orris root powder is evenly distributed. Put the potpourri mixture into a dark, covered container. Put away into storage for 4 - 6 weeks. Stir it each few days to distribute the essences. Use as required. When you are satisfied that the mixture is scented to your liking, it can be put into potpourri bowls or inside sachets. Keep wherever you would like this scent to permeate the air.",
  "tyn_model":[
    "oven",
    "large bowl",
    "orris root powder",
    "potpourri mixture",
    "potpourri bowls"
  ],
  "tyn_section":[

  ]
}