{
  "title":"How to Make Chocolate Orange Cookies with Cream Cheese Filling",
  "url":"https://www.wikihow.com/Make-Chocolate-Orange-Cookies-with-Cream-Cheese-Filling",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350℉ (175℃).",
      "description":"{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/9\\/98\\/Make-Chocolate-Orange-Cookies-with-Cream-Cheese-Filling-Step-1.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/9\\/98\\/Make-Chocolate-Orange-Cookies-with-Cream-Cheese-Filling-Step-1.jpg\\/v4-190px-Make-Chocolate-Orange-Cookies-with-Cream-Cheese-Filling-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":\"190\",\"bigHeight\":\"127\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Mix the dry ingredients.",
      "description":"In a large bowl, combine 2 cups of all-purpose flour, 1 teaspoon of Kosher Salt, and 1 teaspoon of baking power. Whisk the ingredients until well-combined and set aside."
    },
    {
      "headline":"Cream the butter and sugar.",
      "description":"In a separate large bowl, pour the softened butter and sugar. Using a hand or electric blender, cream the ingredients until they are light and fluffy."
    },
    {
      "headline":"Add the vanilla, egg, and orange zest to the creamed mixture.",
      "description":"Blend again until thoroughly mixed."
    },
    {
      "headline":"Add the dry ingredients to the wet ingredients.",
      "description":"Slowly pour them into the wet ingredients and blend on slow speed. Take caution to avoid the flour spilling out. Mix until the dough forms."
    },
    {
      "headline":"Bake the cookies.",
      "description":"Grease a baking sheet, and then using a tablespoon scoop the dough and roll the piece into the shape of a ball. Repeat until all the dough is placed onto the baking sheet. Bake for about 12-14 minutes, until the cookies are lightly golden brown."
    },
    {
      "headline":"Top the cookies with chocolate.",
      "description":"Place the chocolate chips in a bowl and put the bowl on a saucepan filled with about 1 inch (2.5cm) of water. Melt the chocolate chips. Frost half the cookies with the melted chocolate and set aside."
    },
    {
      "headline":"Make the cream cheese filling.",
      "description":"Beat all the ingredients together until fully combined into a thick, creamy, and fluffy mixture."
    },
    {
      "headline":"Add the filling to the cookies.",
      "description":"Spread the cream cheese mixture on the unfrosted half of the batch. Then top with the frosted cookie."
    },
    {
      "headline":"Serve and enjoy!",
      "description":"You have a perfect dessert for any occasion."
    }
  ],
  "text":" Preheat the oven to 350℉ (175℃). {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/9\\/98\\/Make-Chocolate-Orange-Cookies-with-Cream-Cheese-Filling-Step-1.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/9\\/98\\/Make-Chocolate-Orange-Cookies-with-Cream-Cheese-Filling-Step-1.jpg\\/v4-190px-Make-Chocolate-Orange-Cookies-with-Cream-Cheese-Filling-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":\"190\",\"bigHeight\":\"127\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Mix the dry ingredients. In a large bowl, combine 2 cups of all-purpose flour, 1 teaspoon of Kosher Salt, and 1 teaspoon of baking power. Whisk the ingredients until well-combined and set aside. Cream the butter and sugar. In a separate large bowl, pour the softened butter and sugar. Using a hand or electric blender, cream the ingredients until they are light and fluffy. Add the vanilla, egg, and orange zest to the creamed mixture. Blend again until thoroughly mixed. Add the dry ingredients to the wet ingredients. Slowly pour them into the wet ingredients and blend on slow speed. Take caution to avoid the flour spilling out. Mix until the dough forms. Bake the cookies. Grease a baking sheet, and then using a tablespoon scoop the dough and roll the piece into the shape of a ball. Repeat until all the dough is placed onto the baking sheet. Bake for about 12-14 minutes, until the cookies are lightly golden brown. Top the cookies with chocolate. Place the chocolate chips in a bowl and put the bowl on a saucepan filled with about 1 inch (2.5cm) of water. Melt the chocolate chips. Frost half the cookies with the melted chocolate and set aside. Make the cream cheese filling. Beat all the ingredients together until fully combined into a thick, creamy, and fluffy mixture. Add the filling to the cookies. Spread the cream cheese mixture on the unfrosted half of the batch. Then top with the frosted cookie. Serve and enjoy! You have a perfect dessert for any occasion.",
  "tyn_model":[
    "cream-cheese",
    "large bowl",
    "butter",
    "sugar",
    "baking sheet",
    "chocolate",
    "chocolate chips",
    "bowl",
    "cream cheese",
    "oven",
    "℉ (",
    "℃)",
    "cream-",
    "cheese",
    "all-purpose flour",
    "kosher salt",
    "baking power",
    "electric blender",
    "cream",
    "vanilla",
    "egg",
    "orange zest",
    "flour",
    "saucepan",
    "water"
  ],
  "tyn_section":[

  ]
}