{
  "title":"How to Build a Yu Gi Oh! Wind Deck",
  "url":"https://www.wikihow.com/Build-a-Yu-Gi-Oh!-Wind-Deck",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Good WIND archetypes are Harpies, Mist Valley, and Speedroids.",
      "description":"Speedroids can fit into almost any WIND deck, and let you make fast synchro plays and Rank 3 Xyz summons. The basic Speedroid engine is 3 Terrortop and 1-2 Taketomborg, though you can include 1 Tri-Eyed Dice or a few Speed Rebirth."
    },
    {
      "headline":"Buy the Structure deck \"Lord of the Storm\".",
      "description":"This will give you many cards to put in your WIND deck."
    },
    {
      "headline":"Add in your two \"Flying Kamakiri #1\" to your deck.",
      "description":"Buy 1 more from some other source."
    },
    {
      "headline":"Add 2 or 3 \"Simorgh, Bird of Ancestry\".",
      "description":"This is not the same card in your structure deck. Keep this card in mind when you make your deck and include some level 5-6 WIND monsters to summon, like \"Swift birdman Joe\""
    },
    {
      "headline":"Add in 2 \"Hunter Owl\", and 2 \"Icarus Attack\", because most of your monsters will also be Winged-Beast.",
      "description":"Add at least 1 \"Spiritual wind art Miyabi\""
    },
    {
      "headline":"Optionally, you can include a few \"Harpie lady\" cards.",
      "description":"Recommended are Harpie lady 1 especially, which will support your other WIND monsters. Use \"Elegant Egotist\" as well, but DO NOT use Harpie lady sisters."
    },
    {
      "headline":"If it is within your budget, use \"Mist Valley Soldier\" and \"Mist Valley Shaman\" as your Tuner monsters.",
      "description":"Try to get the synchro monster \"Mist Wurm\" which will go well with your deck. You can use \"Mist Valley Thunderbird\" for the effect of Mist valley shaman as well. Fill the rest of your extra deck with basic synchro monsters which require 1 tuner + 1 or more non tuners"
    },
    {
      "headline":"Add basic Staple Cards like MST, Torrential Tribute, etc.",
      "description":"Since a lot of \"splash-able\" and \"staple monsters\" are DARK (Like sangan, breaker the magical warrior and gorz the emissary of darkness), you can try to include \"Dark Simorgh\", which will be very powerful but also very expensive. You can get it if you think you can afford it."
    },
    {
      "headline":"Fill the rest of your deck with cards of your choosing.",
      "description":"You can include some from your structure deck, recommended are \"Bladefly\", \"Silpheed\" and \"sonic shooter.\" You can also use Lady Ninja Yae + Gravity Bind and Level Limit area b to control your opponent's attacks until you use her effect. If you go this route, you can also include \"Tornado Bird\" and \"Sonic Jammer\", along with some \"Book of Moon\" for re-using the flip effects."
    }
  ],
  "text":" Good WIND archetypes are Harpies, Mist Valley, and Speedroids. Speedroids can fit into almost any WIND deck, and let you make fast synchro plays and Rank 3 Xyz summons. The basic Speedroid engine is 3 Terrortop and 1-2 Taketomborg, though you can include 1 Tri-Eyed Dice or a few Speed Rebirth. Buy the Structure deck \"Lord of the Storm\". This will give you many cards to put in your WIND deck. Add in your two \"Flying Kamakiri #1\" to your deck. Buy 1 more from some other source. Add 2 or 3 \"Simorgh, Bird of Ancestry\". This is not the same card in your structure deck. Keep this card in mind when you make your deck and include some level 5-6 WIND monsters to summon, like \"Swift birdman Joe\" Add in 2 \"Hunter Owl\", and 2 \"Icarus Attack\", because most of your monsters will also be Winged-Beast. Add at least 1 \"Spiritual wind art Miyabi\" Optionally, you can include a few \"Harpie lady\" cards. Recommended are Harpie lady 1 especially, which will support your other WIND monsters. Use \"Elegant Egotist\" as well, but DO NOT use Harpie lady sisters. If it is within your budget, use \"Mist Valley Soldier\" and \"Mist Valley Shaman\" as your Tuner monsters. Try to get the synchro monster \"Mist Wurm\" which will go well with your deck. You can use \"Mist Valley Thunderbird\" for the effect of Mist valley shaman as well. Fill the rest of your extra deck with basic synchro monsters which require 1 tuner + 1 or more non tuners Add basic Staple Cards like MST, Torrential Tribute, etc. Since a lot of \"splash-able\" and \"staple monsters\" are DARK (Like sangan, breaker the magical warrior and gorz the emissary of darkness), you can try to include \"Dark Simorgh\", which will be very powerful but also very expensive. You can get it if you think you can afford it. Fill the rest of your deck with cards of your choosing. You can include some from your structure deck, recommended are \"Bladefly\", \"Silpheed\" and \"sonic shooter.\" You can also use Lady Ninja Yae + Gravity Bind and Level Limit area b to control your opponent's attacks until you use her effect. If you go this route, you can also include \"Tornado Bird\" and \"Sonic Jammer\", along with some \"Book of Moon\" for re-using the flip effects.",
  "tyn_model":[
    "speedroids",
    "harpies",
    "terrortop",
    "simorgh",
    "harpie lady",
    "mist valley shaman",
    "sangan",
    "sonic shooter",
    "book"
  ],
  "tyn_section":[

  ]
}