{
  "title":"How to Bake Devil's Food Cake With Cocoa",
  "url":"https://www.wikihow.com/Bake-Devil%27s-Food-Cake-With-Cocoa",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180ºC/350ºF.",
      "description":"Brush a bundt or fancy cake mould with the melted butter. Dust with the cocoa powder reserved for dusting."
    },
    {
      "headline":"Make up the cocoa.",
      "description":"Place the cup of cocoa into a small bowl and mix in the boiling water. Stir the contents until the mixture thickens. Leave to cool."
    },
    {
      "headline":"Put the butter, sugar, and vanilla into a bowl.",
      "description":"Beat by hand or with an electric mixer until it turns light and fluffy."
    },
    {
      "headline":"Add the eggs one at a time, beating in to combine thoroughly.",
      "description":""
    },
    {
      "headline":"Sift in the flours and baking soda.",
      "description":"Mix through."
    },
    {
      "headline":"Pour in the cocoa mixture made earlier.",
      "description":"Fold this through the mixture using a metal spoon, until all ingredients are completely combined."
    },
    {
      "headline":"Pour the mixture into the prepared cake mould.",
      "description":"Smooth over using a spatula and place in the oven. Bake for 1 1/4 hours or until cooked. Test by piercing with a skewer; if it comes out clean, the cake is cooked."
    },
    {
      "headline":"Remove from oven and leave to stand in the mould for 10 minutes.",
      "description":"Turn onto a wire cooling rack after 10 minutes and leave to cool."
    },
    {
      "headline":"Dust with more cocoa or icing sugar if wished.",
      "description":"Serve."
    }
  ],
  "text":" Preheat the oven to 180ºC/350ºF. Brush a bundt or fancy cake mould with the melted butter. Dust with the cocoa powder reserved for dusting. Make up the cocoa. Place the cup of cocoa into a small bowl and mix in the boiling water. Stir the contents until the mixture thickens. Leave to cool. Put the butter, sugar, and vanilla into a bowl. Beat by hand or with an electric mixer until it turns light and fluffy. Add the eggs one at a time, beating in to combine thoroughly.  Sift in the flours and baking soda. Mix through. Pour in the cocoa mixture made earlier. Fold this through the mixture using a metal spoon, until all ingredients are completely combined. Pour the mixture into the prepared cake mould. Smooth over using a spatula and place in the oven. Bake for 1 1/4 hours or until cooked. Test by piercing with a skewer; if it comes out clean, the cake is cooked. Remove from oven and leave to stand in the mould for 10 minutes. Turn onto a wire cooling rack after 10 minutes and leave to cool. Dust with more cocoa or icing sugar if wished. Serve.",
  "tyn_model":[
    "oven",
    "cocoa",
    "butter",
    "cocoa powder",
    "small bowl",
    "water",
    "sugar",
    "vanilla",
    "bowl",
    "electric mixer",
    "eggs",
    "flours",
    "baking soda",
    "metal spoon",
    "cake mould",
    "spatula",
    "skewer",
    "cocoa or",
    "icing sugar"
  ],
  "tyn_section":[

  ]
}