{
  "title":"How to Make Louise Cake",
  "url":"https://www.wikihow.com/Make-Louise-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Shaped and Themed Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 170 degrees Celsius (338 Fahrenheit).",
      "description":"While the oven is heating, grease a 30 centimeter (11.8 in) x 20 centimeter (7.9 in) tin and line with baking paper. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/af\\/Make-Louise-Cake-Step-1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/af\\/Make-Louise-Cake-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":760,\"bigHeight\":508,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\nEnsure the dimensions of the tin are accurate. If they aren't, the cake will turn out either too thin and weak, or too thick and hard to eat."
    },
    {
      "headline":"Cream the butter and sugar.",
      "description":"Continue until the mixture is light and fluffy. Pour the sugar in slowly while mixing, or add a little in between mixing to make sure that the sugar is properly combined."
    },
    {
      "headline":"Beat in one egg yolk at a time, then sift in flour and baking powder.",
      "description":"Mix well. Make sure you beat the egg yolk properly. The flour and baking powder must be sifted, so the finished cake will come out light and not dense. The mixture's consistency should resemble that of fine breadcrumbs."
    },
    {
      "headline":"Press the mixture evenly into the bottom of the prepared tin.",
      "description":"Make sure that it is firm and evenly spread. Repeatedly pat the base down so it can retain its shape."
    },
    {
      "headline":"Bake for ten minutes.",
      "description":"Remove from the oven to cool for five minutes, then increase the oven temperature to 180 °C (356 °F) (356 fahrenheit). If the base is let to cool properly, it will harden and won't fall apart when the additional layers are added."
    },
    {
      "headline":"In another bowl, beat the egg whites until they form stiff white peaks.",
      "description":"Add the sugar a little at a time while continuing to beat the mixture until it is thick and glossy. An electric hand mixer or stand mixer is recommended. Again, it is best to add the sugar a little at a time."
    },
    {
      "headline":"Gently fold into the mixture the vanilla and coconut.",
      "description":"Be careful when doing this."
    },
    {
      "headline":"Coat the cooled base evenly with the raspberry jam.",
      "description":"Spread the coconut and egg topping over it. Avoid mixing the jam with the coconut layer. Keep everything separate and uniform."
    },
    {
      "headline":"Bake for 15-20 minutes.",
      "description":"Cool in the tin for ten to fifteen minutes, and cut into squares. If the Louise cake isn't cooled for long enough, it can break apart when cut, and burn. If it is also immediately stored in a container, the container will steam up and the cake will soften. Optionally top with fresh raspberries."
    },
    {
      "headline":"Serve immediately or store.",
      "description":"Louise cake can be kept in an airtight container for up to a week."
    }
  ],
  "text":" Preheat the oven to 170 degrees Celsius (338 Fahrenheit). While the oven is heating, grease a 30 centimeter (11.8 in) x 20 centimeter (7.9 in) tin and line with baking paper. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/af\\/Make-Louise-Cake-Step-1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/af\\/Make-Louise-Cake-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":760,\"bigHeight\":508,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\nEnsure the dimensions of the tin are accurate. If they aren't, the cake will turn out either too thin and weak, or too thick and hard to eat. Cream the butter and sugar. Continue until the mixture is light and fluffy. Pour the sugar in slowly while mixing, or add a little in between mixing to make sure that the sugar is properly combined. Beat in one egg yolk at a time, then sift in flour and baking powder. Mix well. Make sure you beat the egg yolk properly. The flour and baking powder must be sifted, so the finished cake will come out light and not dense. The mixture's consistency should resemble that of fine breadcrumbs. Press the mixture evenly into the bottom of the prepared tin. Make sure that it is firm and evenly spread. Repeatedly pat the base down so it can retain its shape. Bake for ten minutes. Remove from the oven to cool for five minutes, then increase the oven temperature to 180 °C (356 °F) (356 fahrenheit). If the base is let to cool properly, it will harden and won't fall apart when the additional layers are added. In another bowl, beat the egg whites until they form stiff white peaks. Add the sugar a little at a time while continuing to beat the mixture until it is thick and glossy. An electric hand mixer or stand mixer is recommended. Again, it is best to add the sugar a little at a time. Gently fold into the mixture the vanilla and coconut. Be careful when doing this. Coat the cooled base evenly with the raspberry jam. Spread the coconut and egg topping over it. Avoid mixing the jam with the coconut layer. Keep everything separate and uniform. Bake for 15-20 minutes. Cool in the tin for ten to fifteen minutes, and cut into squares. If the Louise cake isn't cooled for long enough, it can break apart when cut, and burn. If it is also immediately stored in a container, the container will steam up and the cake will soften. Optionally top with fresh raspberries. Serve immediately or store. Louise cake can be kept in an airtight container for up to a week.",
  "tyn_model":[
    "sugar",
    "oven",
    "coconut",
    "flour",
    "baking powder",
    "baking paper",
    "butter",
    "bowl",
    "egg",
    "electric hand mixer",
    "stand mixer",
    "vanilla",
    "raspberry jam",
    "louise cake",
    "container",
    "raspberries",
    "airtight container"
  ],
  "tyn_section":[

  ]
}