{
  "title":"How to Make Hershey Kiss Cookies",
  "url":"https://www.wikihow.com/Make-Hershey-Kiss-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Making Quick Hershey Kiss Cookies",
      "steps":[
        {
          "headline":"Turn on the oven.",
          "description":"Preheat your oven to 375 degrees F (190 C). You should also have several cookie sheets on hand. You won't need to grease the cookie sheets before baking the cookies. If you like baking with a silicone mat, you could place one on your baking sheet for even cooking."
        },
        {
          "headline":"Combine the sweetened condensed milk and cookie butter.",
          "description":"Scoop 1 can (14 oz) of sweetened condensed milk and ¾ cup (170 g) of purchased cookie butter into a large mixing bowl. Use a whisk, spoon, or hand mixer to beat the sweetened condensed milk and cookie butter until they're completely combined. If you don't have cookie butter, you can substitute peanut or almond butter."
        },
        {
          "headline":"Add baking mix and vanilla.",
          "description":"Stir in 2 cups (256 g) of baking mix and 1 teaspoon of vanilla extract. Stir or beat the dough until the dry mix is incorporated. The dough should be fairly sticky. You can use a baking mix (like Bisquick). Just ensure that lists flour, shortening or oil, baking powder and salt in the ingredients."
        },
        {
          "headline":"Shape your cookies.",
          "description":"Portion out your dough into lumps that are about 1-inch in size. Roll each lump of dough between the palms of your hands so they become balls. You can use a cookie scoop, ice cream scoop, or spoons to portion out the dough."
        },
        {
          "headline":"Roll the balls in sugar and bake them.",
          "description":"Place ¼ cup (50 g) of granulated sugar into a small bowl. Roll each ball of dough in the sugar so that they're completely coated. Place the cookies on the baking sheets. Leave at least 2-inches of room between each ball on the sheet. Bake them for 6 to 8 minutes or until they start turning light brown. For a more festive look, consider rolling the balls in colored sugar or sprinkles."
        },
        {
          "headline":"Remove the cookies and place Hershey's Kisses on top.",
          "description":"Use oven mitts to take the cookies out of the oven. You should immediately place one unwrapped Hershey's Kiss on top of each cookie. You'll need to press down a little using the Hershey's Kiss. This will also help the cookies spread a little. Let the cookies cool on a wire rack. This recipe will make about 48 cookies."
        }
      ]
    },
    {
      "name":"Making S'Mores Kiss Cookies",
      "steps":[
        {
          "headline":"Turn on the oven.",
          "description":"Preheat the oven to 350 degrees F (180 C). Grease two large baking sheets with cooking spray. You could also line the sheets with parchment paper or a silicone mat. Any of these things will keep the cookies from sticking and help them cook evenly."
        },
        {
          "headline":"Cream the butter, sugar, and some of the graham cracker crumbs.",
          "description":"Place 8 tablespoons (113 g) of room temperature butter, 1/4 cup (50 g) of granulated sugar, 1/4 cup (50 g) of packed light brown sugar, and 3/4 cup (3 ounces) of the graham cracker crumbs into a large mixing bowl. Beat the ingredients on medium until they're combined, light and fluffy. It will take 2 or 3 minutes to cream the ingredients well."
        },
        {
          "headline":"Add an egg and vanilla.",
          "description":"Add 1 large egg and 1 teaspoon of pure vanilla extract to the wet ingredients in the mixing bowl. Stir the ingredients until the egg is completely mixed into the wet ingredients. If you don't have vanilla extract, you could substitute almond extract."
        },
        {
          "headline":"Combine the remaining dry ingredients.",
          "description":"In a separate bowl, add 1 1/4 cups (156 g) of all-purpose flour, 1/2 teaspoon of baking powder, 1/4 teaspoon of baking soda, and 1/4 teaspoon of salt. Whisk the ingredients for about 30 seconds. Whisking the ingredients ensures they're completely incorporated. This will help the dry ingredients evenly absorb the wet ingredients."
        },
        {
          "headline":"Stir in the dry ingredients.",
          "description":"Add the dry ingredients to the wet ingredients in the large mixing bowl. Turn the mixer onto low and beat the ingredients until the dry ingredients are just combined with the wet ingredients. Over mixing your batter can make the cookies tough and dense."
        },
        {
          "headline":"Scoop and roll the cookie dough.",
          "description":"Portion out the dough into tablespoon-sized lumps. Roll each lump into a ball using the palms of your hands. Place the remaining 1/4 cup (1 ounce) of graham cracker crumbs in a small bowl. Roll each ball in the crumbs so they're lightly coated. You can use your fingers, spoons, a cookie scoop, or an ice cream scoop to portion the dough into balls."
        },
        {
          "headline":"Bake the cookies.",
          "description":"Place each ball onto the cookie sheets so there are 12 on each sheet. Bake the cookies for 8 to 10 minutes. They should just be starting to crack, but still be soft when they're finished baking. Remove the cookies from the oven and let them cool for a minute on the sheet. If your oven bakes unevenly, consider baking one sheet of cookies at a time."
        },
        {
          "headline":"Toast the marshmallows and place the Hershey's Kisses.",
          "description":"Turn on your broiler and set your oven rack about 10 inches below the broiler. Place half of a marshmallow on top of each cookie. Set the sheet of cookies with marshmallow tops under the broiler for 30 seconds. Remove the sheet of cookies and push an unwrapped Hershey's Kiss into the middle of each toasted marshmallow. Let the cookies cool before you serve them. You'll want to do one sheet of cookies at a time. This way, the toasted marshmallows won't harden too much before you set the Hershey's Kisses in place."
        }
      ]
    },
    {
      "name":"Making Coconut Macaroon Kiss Cookies",
      "steps":[
        {
          "headline":"Turn on the oven.",
          "description":"Preheat the oven to 350 degrees F (180 C). You should also have several cookie sheets on hand. You won't need to grease the cookie sheets before baking the cookies. If you like baking with a silicone mat, you could place one on your baking sheet for even cooking."
        },
        {
          "headline":"Cream the butter, cream cheese and sugar.",
          "description":"Place 1/3 cup (76 g) of softened butter, 3 ounces (85 g) of softened cream cheese, and 3/4 cup (150 g) of sugar into a large mixing bowl. Beat the ingredients with mixer on medium speed until they're completely combined. It's important to have the butter and cream cheese softened. If they're too cold, you'll have small lumps of butter or cream cheese in your dough."
        },
        {
          "headline":"Add the egg yolk and flavorings.",
          "description":"Add 1 egg yolk, 1 1/2 to 2 teaspoons of almond extract, and 2 teaspoons of orange juice to the bowl with the creamed mixture. Beat the yolk and flavorings on medium speed until you no longer see the egg yolk. You can discard the egg white or save it for another use."
        },
        {
          "headline":"Combine the dry ingredients.",
          "description":"In a separate bowl, whisk together 1 1/4 cups (156 g) of all-purpose flour, 2 teaspoons of baking powder and 1/4 teaspoon of salt. Whisk for about 30 seconds so the baking powder is evenly distributed throughout the flour. You could also sift and stir the dry ingredients to help combine the baking powder into the flour, especially if your flour is lumpy."
        },
        {
          "headline":"Mix the dry ingredients and coconut with the creamed mixture.",
          "description":"Slowly add the dry ingredients to the creamed butter mixture while beating on low speed. Beat the mixture until the dry ingredients are completely combined. Stir in 3 (225 g) cups of sweetened coconut flakes until the dough is combined. If you mix the dry ingredients into the creamed mixture on high or even medium speed, the dry ingredients will be quickly beaten out of the bowl and onto your counter."
        },
        {
          "headline":"Refrigerate and shape the dough.",
          "description":"Cover the dough and refrigerate it until it's firm enough for you to shape (about 1 hour). Portion out the dough into 1-inch balls. Roll the balls into the remaining 2 cups (150 g) of sweetened coconut flakes. Set the balls on the cookie sheets, leaving a few inches of room between each cookie. This recipe will make 48 cookies, so you'll need several baking sheets."
        },
        {
          "headline":"Bake the cookies and place the Hershey's Kisses on top.",
          "description":"Bake the coconut macaroons for 10 to 12 minutes. They should be light golden brown when they're done. Take the cookies out of the oven and immediately push one unwrapped Hershey's Kiss into the top of each cookie. Let the cookies rest on the sheet for a minute. Let them finish cooling on a wire rack. Cool the cookies completely before serving. This will help them firm up a little."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Quick Hershey Kiss Cookies Turn on the oven. Preheat your oven to 375 degrees F (190 C). You should also have several cookie sheets on hand. You won't need to grease the cookie sheets before baking the cookies. If you like baking with a silicone mat, you could place one on your baking sheet for even cooking. Combine the sweetened condensed milk and cookie butter. Scoop 1 can (14 oz) of sweetened condensed milk and ¾ cup (170 g) of purchased cookie butter into a large mixing bowl. Use a whisk, spoon, or hand mixer to beat the sweetened condensed milk and cookie butter until they're completely combined. If you don't have cookie butter, you can substitute peanut or almond butter. Add baking mix and vanilla. Stir in 2 cups (256 g) of baking mix and 1 teaspoon of vanilla extract. Stir or beat the dough until the dry mix is incorporated. The dough should be fairly sticky. You can use a baking mix (like Bisquick). Just ensure that lists flour, shortening or oil, baking powder and salt in the ingredients. Shape your cookies. Portion out your dough into lumps that are about 1-inch in size. Roll each lump of dough between the palms of your hands so they become balls. You can use a cookie scoop, ice cream scoop, or spoons to portion out the dough. Roll the balls in sugar and bake them. Place ¼ cup (50 g) of granulated sugar into a small bowl. Roll each ball of dough in the sugar so that they're completely coated. Place the cookies on the baking sheets. Leave at least 2-inches of room between each ball on the sheet. Bake them for 6 to 8 minutes or until they start turning light brown. For a more festive look, consider rolling the balls in colored sugar or sprinkles. Remove the cookies and place Hershey's Kisses on top. Use oven mitts to take the cookies out of the oven. You should immediately place one unwrapped Hershey's Kiss on top of each cookie. You'll need to press down a little using the Hershey's Kiss. This will also help the cookies spread a little. Let the cookies cool on a wire rack. This recipe will make about 48 cookies. Making S'Mores Kiss Cookies Turn on the oven. Preheat the oven to 350 degrees F (180 C). Grease two large baking sheets with cooking spray. You could also line the sheets with parchment paper or a silicone mat. Any of these things will keep the cookies from sticking and help them cook evenly. Cream the butter, sugar, and some of the graham cracker crumbs. Place 8 tablespoons (113 g) of room temperature butter, 1/4 cup (50 g) of granulated sugar, 1/4 cup (50 g) of packed light brown sugar, and 3/4 cup (3 ounces) of the graham cracker crumbs into a large mixing bowl. Beat the ingredients on medium until they're combined, light and fluffy. It will take 2 or 3 minutes to cream the ingredients well. Add an egg and vanilla. Add 1 large egg and 1 teaspoon of pure vanilla extract to the wet ingredients in the mixing bowl. Stir the ingredients until the egg is completely mixed into the wet ingredients. If you don't have vanilla extract, you could substitute almond extract. Combine the remaining dry ingredients. In a separate bowl, add 1 1/4 cups (156 g) of all-purpose flour, 1/2 teaspoon of baking powder, 1/4 teaspoon of baking soda, and 1/4 teaspoon of salt. Whisk the ingredients for about 30 seconds. Whisking the ingredients ensures they're completely incorporated. This will help the dry ingredients evenly absorb the wet ingredients. Stir in the dry ingredients. Add the dry ingredients to the wet ingredients in the large mixing bowl. Turn the mixer onto low and beat the ingredients until the dry ingredients are just combined with the wet ingredients. Over mixing your batter can make the cookies tough and dense. Scoop and roll the cookie dough. Portion out the dough into tablespoon-sized lumps. Roll each lump into a ball using the palms of your hands. Place the remaining 1/4 cup (1 ounce) of graham cracker crumbs in a small bowl. Roll each ball in the crumbs so they're lightly coated. You can use your fingers, spoons, a cookie scoop, or an ice cream scoop to portion the dough into balls. Bake the cookies. Place each ball onto the cookie sheets so there are 12 on each sheet. Bake the cookies for 8 to 10 minutes. They should just be starting to crack, but still be soft when they're finished baking. Remove the cookies from the oven and let them cool for a minute on the sheet. If your oven bakes unevenly, consider baking one sheet of cookies at a time. Toast the marshmallows and place the Hershey's Kisses. Turn on your broiler and set your oven rack about 10 inches below the broiler. Place half of a marshmallow on top of each cookie. Set the sheet of cookies with marshmallow tops under the broiler for 30 seconds. Remove the sheet of cookies and push an unwrapped Hershey's Kiss into the middle of each toasted marshmallow. Let the cookies cool before you serve them. You'll want to do one sheet of cookies at a time. This way, the toasted marshmallows won't harden too much before you set the Hershey's Kisses in place. Making Coconut Macaroon Kiss Cookies Turn on the oven. Preheat the oven to 350 degrees F (180 C). You should also have several cookie sheets on hand. You won't need to grease the cookie sheets before baking the cookies. If you like baking with a silicone mat, you could place one on your baking sheet for even cooking. Cream the butter, cream cheese and sugar. Place 1/3 cup (76 g) of softened butter, 3 ounces (85 g) of softened cream cheese, and 3/4 cup (150 g) of sugar into a large mixing bowl. Beat the ingredients with mixer on medium speed until they're completely combined. It's important to have the butter and cream cheese softened. If they're too cold, you'll have small lumps of butter or cream cheese in your dough. Add the egg yolk and flavorings. Add 1 egg yolk, 1 1/2 to 2 teaspoons of almond extract, and 2 teaspoons of orange juice to the bowl with the creamed mixture. Beat the yolk and flavorings on medium speed until you no longer see the egg yolk. You can discard the egg white or save it for another use. Combine the dry ingredients. In a separate bowl, whisk together 1 1/4 cups (156 g) of all-purpose flour, 2 teaspoons of baking powder and 1/4 teaspoon of salt. Whisk for about 30 seconds so the baking powder is evenly distributed throughout the flour. You could also sift and stir the dry ingredients to help combine the baking powder into the flour, especially if your flour is lumpy. Mix the dry ingredients and coconut with the creamed mixture. Slowly add the dry ingredients to the creamed butter mixture while beating on low speed. Beat the mixture until the dry ingredients are completely combined. Stir in 3 (225 g) cups of sweetened coconut flakes until the dough is combined. If you mix the dry ingredients into the creamed mixture on high or even medium speed, the dry ingredients will be quickly beaten out of the bowl and onto your counter. Refrigerate and shape the dough. Cover the dough and refrigerate it until it's firm enough for you to shape (about 1 hour). Portion out the dough into 1-inch balls. Roll the balls into the remaining 2 cups (150 g) of sweetened coconut flakes. Set the balls on the cookie sheets, leaving a few inches of room between each cookie. This recipe will make 48 cookies, so you'll need several baking sheets. Bake the cookies and place the Hershey's Kisses on top. Bake the coconut macaroons for 10 to 12 minutes. They should be light golden brown when they're done. Take the cookies out of the oven and immediately push one unwrapped Hershey's Kiss into the top of each cookie. Let the cookies rest on the sheet for a minute. Let them finish cooling on a wire rack. Cool the cookies completely before serving. This will help them firm up a little. Finished. ",
  "tyn_model":[
    "oven",
    "cookie sheets",
    "baking powder",
    "sugar",
    "butter",
    "cookie butter",
    "large mixing bowl",
    "flour",
    "hershey's kisses",
    "hershey's kiss",
    "silicone mat",
    "sweetened condensed milk",
    "baking mix",
    "salt",
    "baking sheets",
    "broiler",
    "cream cheese",
    "baking sheet",
    "vanilla",
    "vanilla extract",
    "cookie scoop",
    "ice cream scoop",
    "spoons",
    "granulated sugar",
    "graham cracker crumbs",
    "almond extract",
    "all-purpose flour",
    "mixer",
    "bowl",
    "hershey kiss cookies",
    "whisk",
    "peanut or almond butter",
    "colored sugar",
    "oven mitts",
    "cooking spray",
    "parchment paper",
    "graham cracker",
    "light brown sugar",
    "egg",
    "pure vanilla",
    "mixing bowl",
    "baking soda",
    "cookie dough",
    "oven rack",
    "coconut macaroon kiss",
    "butter or cream cheese",
    "orange juice",
    "coconut",
    "creamed butter",
    "sweetened coconut",
    "sweetened coconut flakes",
    "coconut macaroons"
  ],
  "tyn_section":[

  ]
}