{
  "title":"How to Whittle a Wimmy Diddle",
  "url":"https://www.wikihow.com/Whittle-a-Wimmy-Diddle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Puzzles and Memory Games",
    "Mechanical Puzzles"
  ],
  "steps":[
    {
      "headline":"Gather your materials.",
      "description":""
    },
    {
      "headline":"Cut a piece, about 1 inch (2.5 cm) long, off the stick that you have and save it for later.",
      "description":""
    },
    {
      "headline":"Begin to sharpen the tip of the stick by slivering off little bits of wood and rotating it until the end is fairly sharp.",
      "description":""
    },
    {
      "headline":"Cut off about 1/8 of an inch off the end of the sharp piece.",
      "description":"You want the end to be flat so it will be easier to push the nail/ pin into the wood."
    },
    {
      "headline":"Put notches along the stick on one side.",
      "description":"Make them about ⁄4 inch (0.6 cm) deep and ⁄4 inch (0.6 cm) apart. Set this aside. This will make the \"body\"."
    },
    {
      "headline":"Get that small 1 inch (2.5 cm) piece of wood and begin to carve it so it is hourglass shaped.",
      "description":"You want it skinny in the middle and fatter on the edges. This will be your \"propeller\"."
    },
    {
      "headline":"Pierce a hole in the propeller big enough for the pin/ nail to fit through.",
      "description":""
    },
    {
      "headline":"Get the body and the nail and poke it in the sharpened tip so you have a small indent.",
      "description":""
    },
    {
      "headline":"Put the nail through the hole in the propeller and push the nail into the indent you made in the body.",
      "description":"You can use a hammer to tap this in, but don't put it in too tight or else it won't work."
    },
    {
      "headline":"Make sure you can spin the propeller.",
      "description":""
    },
    {
      "headline":"Use it: Get the smaller stick (or the back of your knife and run it along the notches.",
      "description":"Make sure you do this very quickly. if the propeller doesn't spin, then rub it faster, or make the notches deeper."
    }
  ],
  "text":" Gather your materials.  Cut a piece, about 1 inch (2.5 cm) long, off the stick that you have and save it for later.  Begin to sharpen the tip of the stick by slivering off little bits of wood and rotating it until the end is fairly sharp.  Cut off about 1/8 of an inch off the end of the sharp piece. You want the end to be flat so it will be easier to push the nail/ pin into the wood. Put notches along the stick on one side. Make them about ⁄4 inch (0.6 cm) deep and ⁄4 inch (0.6 cm) apart. Set this aside. This will make the \"body\". Get that small 1 inch (2.5 cm) piece of wood and begin to carve it so it is hourglass shaped. You want it skinny in the middle and fatter on the edges. This will be your \"propeller\". Pierce a hole in the propeller big enough for the pin/ nail to fit through.  Get the body and the nail and poke it in the sharpened tip so you have a small indent.  Put the nail through the hole in the propeller and push the nail into the indent you made in the body. You can use a hammer to tap this in, but don't put it in too tight or else it won't work. Make sure you can spin the propeller.  Use it: Get the smaller stick (or the back of your knife and run it along the notches. Make sure you do this very quickly. if the propeller doesn't spin, then rub it faster, or make the notches deeper.",
  "tyn_model":[
    "nail",
    "nail/",
    "pin",
    "wood",
    "hammer",
    "knife"
  ],
  "tyn_section":[

  ]
}