{
  "title":"How to Hide in the Woods",
  "url":"https://www.wikihow.com/Hide-in-the-Woods",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Hiding Games"
  ],
  "parts":[
    {
      "name":"Camouflaging Your Appearance",
      "steps":[
        {
          "headline":"Wear dark or camouflaged clothing.",
          "description":"Avoid bright colors that don’t appear naturally in the woods, like white, orange, or red. Instead, wear browns, greens, or greys to stay hidden. These colors will easily blend in with your surroundings. Even though black seems like a color that would blend in well, it will stick out compared to the rest of woods since it doesn’t occur in nature often. Wear long sleeves and pants so most of your skin is covered and hidden from sight."
        },
        {
          "headline":"Take off any shiny or metallic objects.",
          "description":"Remove any jewelry or metal watches that could reflect the sunlight. Keep them in your pockets or set them in a safe place before you go into the woods. You don’t want to have a great hiding spot ruined by a glare! Wear contacts instead of glasses if you can. The sun could reflect from the frames and give away your hiding spot."
        },
        {
          "headline":"Cover any exposed skin with dark colors or mud.",
          "description":"If you want to completely blend in, rub dirt or mud on your face so your skin doesn’t give away your hiding spot. Alternatively, you can use body-safe paint or ashes from a fire. Camouflage face paint can be purchased at your local hunting or sporting goods store. Be careful near your eyes, nose, and mouth when applying your camouflage. Wrap a scarf or bandana around your face if you don’t want to put anything on your skin."
        },
        {
          "headline":"Disguise your silhouette with branches or fabrics.",
          "description":"One thing that will stand out from the rest of the woods is the shape of your body. Find branches or grasses that you can tie on top of your shoulders and wrap around your sleeves to make your form look more organic. Construct a ghillie suit by tying ropes and grasses together. Good camouflage isn’t about blending into your background; it’s about making your form look less familiar."
        },
        {
          "headline":"Hide in thick bushes or grasses.",
          "description":"Avoid open fields or areas that don’t have a lot of trees or else you may get spotted. Stay crouched low or lie on the ground as you hide in the underbrush. If anyone comes near you, don’t make a noise so you don’t give yourself away. Many people will not look in plants like nettles or near thorny bushes. Take advantage of these areas while you’re hiding, just be careful not to hurt yourself."
        }
      ]
    },
    {
      "name":"Moving Through the Forest",
      "steps":[
        {
          "headline":"Make most of your movements in the shadows.",
          "description":"Avoid direct sunlight so you don’t make shadows when you have to move. Stay in the underbrush or under the cover of trees to stay hidden from whoever is trying to find you. Wait for clouds to cover the sun to make movements. Just make sure to get to your new spot before the sun comes back out!"
        },
        {
          "headline":"Stay low to the ground when you move.",
          "description":"Walk while crouching if you have to move around so you don’t get silhouetted by the sun. When you stand up, check to make sure the sun isn’t casting a noticeable shadow. If there are hills, do your best to go around them rather than over the top of them."
        },
        {
          "headline":"Move 50 yd (46 m) at a time before listening to your surroundings.",
          "description":"Stay crouched to the ground as you move. Stop periodically to look around and listen to the woods. Stay still and silent for at least 10 seconds as you listen to see if you can hear anyone near you. If you see another person, stay completely still. Chances are they haven’t noticed you and you can slowly and quietly duck down to the ground."
        },
        {
          "headline":"Avoid breaking branches or stepping on undergrowth.",
          "description":"Watch where you step as you move so you don’t break any of the foliage. A snapping branch can sound like a gunshot in a quiet woods. When you change spots, check behind you to make sure you aren’t leaving a trail of any sort or else you’ll be easy to track! Cover up any footprints if you run through wet ground."
        }
      ]
    },
    {
      "name":"Building an Invisible Camp",
      "steps":[
        {
          "headline":"Hide the fire behind trees at night in a heavily wooded area.",
          "description":"Look for a space that is surrounded by trees so that you can’t see very far into the woods. The thick trees will help hide any firelight and smoke when you make your fire. Remove the bark from your wood so the fire produces less smoke."
        },
        {
          "headline":"Put the fire in a hole so the light isn’t visible.",
          "description":"If you’re still worried about anyone seeing your camp, dig a 2 by 2 by 2 feet (0.61 × 0.61 × 0.61 m) hole in the ground. Start making another air hole back towards the surface at the bottom of the one you’ve just dug. This helps the fire burn more easily. Put out your fire before you go to sleep so it doesn’t burn out of control and so no one can find you."
        },
        {
          "headline":"Dig a pit shelter to lay in so you’re not exposed.",
          "description":"Make the pit 3 feet (0.91 m) deep and slightly longer than your body length. Leave a lip around the edge of your pit that’s 8 inches (20 cm) deep and wide. Lay logs that are sturdy but you can still lift on the lip around the pit. Cover the logs with leaves and soil to conceal your shelter. This type of shelter allows others to walk over the top of it without them knowing you’re underneath them. Cover the floor of your shelter with leaves for comfort and insulation. Don’t use any rotting logs since these may break under somebody’s weight."
        }
      ]
    }
  ],
  "text":" Camouflaging Your Appearance Wear dark or camouflaged clothing. Avoid bright colors that don’t appear naturally in the woods, like white, orange, or red. Instead, wear browns, greens, or greys to stay hidden. These colors will easily blend in with your surroundings. Even though black seems like a color that would blend in well, it will stick out compared to the rest of woods since it doesn’t occur in nature often. Wear long sleeves and pants so most of your skin is covered and hidden from sight. Take off any shiny or metallic objects. Remove any jewelry or metal watches that could reflect the sunlight. Keep them in your pockets or set them in a safe place before you go into the woods. You don’t want to have a great hiding spot ruined by a glare! Wear contacts instead of glasses if you can. The sun could reflect from the frames and give away your hiding spot. Cover any exposed skin with dark colors or mud. If you want to completely blend in, rub dirt or mud on your face so your skin doesn’t give away your hiding spot. Alternatively, you can use body-safe paint or ashes from a fire. Camouflage face paint can be purchased at your local hunting or sporting goods store. Be careful near your eyes, nose, and mouth when applying your camouflage. Wrap a scarf or bandana around your face if you don’t want to put anything on your skin. Disguise your silhouette with branches or fabrics. One thing that will stand out from the rest of the woods is the shape of your body. Find branches or grasses that you can tie on top of your shoulders and wrap around your sleeves to make your form look more organic. Construct a ghillie suit by tying ropes and grasses together. Good camouflage isn’t about blending into your background; it’s about making your form look less familiar. Hide in thick bushes or grasses. Avoid open fields or areas that don’t have a lot of trees or else you may get spotted. Stay crouched low or lie on the ground as you hide in the underbrush. If anyone comes near you, don’t make a noise so you don’t give yourself away. Many people will not look in plants like nettles or near thorny bushes. Take advantage of these areas while you’re hiding, just be careful not to hurt yourself. Moving Through the Forest Make most of your movements in the shadows. Avoid direct sunlight so you don’t make shadows when you have to move. Stay in the underbrush or under the cover of trees to stay hidden from whoever is trying to find you. Wait for clouds to cover the sun to make movements. Just make sure to get to your new spot before the sun comes back out! Stay low to the ground when you move. Walk while crouching if you have to move around so you don’t get silhouetted by the sun. When you stand up, check to make sure the sun isn’t casting a noticeable shadow. If there are hills, do your best to go around them rather than over the top of them. Move 50 yd (46 m) at a time before listening to your surroundings. Stay crouched to the ground as you move. Stop periodically to look around and listen to the woods. Stay still and silent for at least 10 seconds as you listen to see if you can hear anyone near you. If you see another person, stay completely still. Chances are they haven’t noticed you and you can slowly and quietly duck down to the ground. Avoid breaking branches or stepping on undergrowth. Watch where you step as you move so you don’t break any of the foliage. A snapping branch can sound like a gunshot in a quiet woods. When you change spots, check behind you to make sure you aren’t leaving a trail of any sort or else you’ll be easy to track! Cover up any footprints if you run through wet ground. Building an Invisible Camp Hide the fire behind trees at night in a heavily wooded area. Look for a space that is surrounded by trees so that you can’t see very far into the woods. The thick trees will help hide any firelight and smoke when you make your fire. Remove the bark from your wood so the fire produces less smoke. Put the fire in a hole so the light isn’t visible. If you’re still worried about anyone seeing your camp, dig a 2 by 2 by 2 feet (0.61 × 0.61 × 0.61 m) hole in the ground. Start making another air hole back towards the surface at the bottom of the one you’ve just dug. This helps the fire burn more easily. Put out your fire before you go to sleep so it doesn’t burn out of control and so no one can find you. Dig a pit shelter to lay in so you’re not exposed. Make the pit 3 feet (0.91 m) deep and slightly longer than your body length. Leave a lip around the edge of your pit that’s 8 inches (20 cm) deep and wide. Lay logs that are sturdy but you can still lift on the lip around the pit. Cover the logs with leaves and soil to conceal your shelter. This type of shelter allows others to walk over the top of it without them knowing you’re underneath them. Cover the floor of your shelter with leaves for comfort and insulation. Don’t use any rotting logs since these may break under somebody’s weight.",
  "tyn_model":[
    "logs",
    "trees",
    "× 0.61",
    "jewelry",
    "contacts",
    "glasses",
    "mud",
    "paint",
    "scarf",
    "bandana",
    "branches",
    "fabrics",
    "ropes",
    "sun",
    "woods",
    "fire",
    "soil",
    "leaves"
  ],
  "tyn_section":[

  ]
}