{
  "title":"How to Draw a Cool World Map",
  "url":"https://www.wikihow.com/Draw-a-Cool-World-Map",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Geography and Nature",
    "Drawing Countries"
  ],
  "steps":[
    {
      "headline":"Find an idea.",
      "description":"For example, you want to do the world of the future which will be similar to the real world, or an alien planet with big continents on it."
    },
    {
      "headline":"On a draft paper, draw the main continents, with no islands.",
      "description":"Simple as that!"
    },
    {
      "headline":"Draw 'large' islands.",
      "description":"Is it an island the size of Borneo? Or the Great Britain? It can be any size!"
    },
    {
      "headline":"Draw \"Antarctica\", or the bottom-most continent.",
      "description":"Is it just a lump of ground? No problem; just draw it."
    },
    {
      "headline":"Add the tiny details from your map.",
      "description":""
    },
    {
      "headline":"Review your draft.",
      "description":"Is there an area that needs improving? Is there a continent that has boxy borders around it? If there is, try to fix it."
    },
    {
      "headline":"Copy it on a blank piece of paper.",
      "description":""
    },
    {
      "headline":"Add countries to your map, and then color your map.",
      "description":""
    },
    {
      "headline":"Make sure there is no uncolored countries.",
      "description":"Is there an uncolored country? Color it!"
    },
    {
      "headline":"Ta-da!",
      "description":"Now you made your own cool \"fictional\" map, you can either show it to your friends or family or store it as your artwork."
    }
  ],
  "text":" Find an idea. For example, you want to do the world of the future which will be similar to the real world, or an alien planet with big continents on it. On a draft paper, draw the main continents, with no islands. Simple as that! Draw 'large' islands. Is it an island the size of Borneo? Or the Great Britain? It can be any size! Draw \"Antarctica\", or the bottom-most continent. Is it just a lump of ground? No problem; just draw it. Add the tiny details from your map.  Review your draft. Is there an area that needs improving? Is there a continent that has boxy borders around it? If there is, try to fix it. Copy it on a blank piece of paper.  Add countries to your map, and then color your map.  Make sure there is no uncolored countries. Is there an uncolored country? Color it! Ta-da! Now you made your own cool \"fictional\" map, you can either show it to your friends or family or store it as your artwork.",
  "tyn_model":[
    "paper",
    "map"
  ],
  "tyn_section":[

  ]
}