{
  "title":"How to Clean a Room for a Sleepover",
  "url":"https://www.wikihow.com/Clean-a-Room-for-a-Sleepover",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "steps":[
    {
      "headline":"Put away all of your valuables and the things you don't want on display.",
      "description":"You can hide them in  uninteresting looking cupboards, bottom drawers, or even in a place downstairs. Ask your parents if you could use a place in their room to store a couple of things if you get really concerned about your items being found."
    },
    {
      "headline":"Dust the furniture.",
      "description":"Dust can cause your guests to sneeze."
    },
    {
      "headline":"Clean all the mirrors and glass in the room.",
      "description":"You don't want mucky mirrors for your guests to use."
    },
    {
      "headline":"Hoover the rugs and carpets.",
      "description":""
    },
    {
      "headline":"Change all the spare bedding covers you will be using, unless you did that after the last person slept over.",
      "description":""
    },
    {
      "headline":"Empty the rubbish (trash) bin if you need to.",
      "description":""
    },
    {
      "headline":"Make your bed.",
      "description":"Usually the first thing a person looks at is your bed, because it is the one of the biggest items in your room."
    },
    {
      "headline":"Set up a spot for your guest's luggage.",
      "description":"Usually, a clean corner works well."
    }
  ],
  "text":" Put away all of your valuables and the things you don't want on display. You can hide them in  uninteresting looking cupboards, bottom drawers, or even in a place downstairs. Ask your parents if you could use a place in their room to store a couple of things if you get really concerned about your items being found. Dust the furniture. Dust can cause your guests to sneeze. Clean all the mirrors and glass in the room. You don't want mucky mirrors for your guests to use. Hoover the rugs and carpets.  Change all the spare bedding covers you will be using, unless you did that after the last person slept over.  Empty the rubbish (trash) bin if you need to.  Make your bed. Usually the first thing a person looks at is your bed, because it is the one of the biggest items in your room. Set up a spot for your guest's luggage. Usually, a clean corner works well.",
  "tyn_model":[
    "dust",
    "rugs"
  ],
  "tyn_section":[

  ]
}