{
  "title":"How to Cook Pork Loin Steaks",
  "url":"https://www.wikihow.com/Cook-Pork-Loin-Steaks",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork"
  ],
  "methods":[
    {
      "name":"Pan-Frying Pork Loin Steaks",
      "steps":[
        {
          "headline":"Create a dredging station.",
          "description":"Pat the pork loin steaks dry with paper towels and set them aside. Pour ½ to 1 cup (60 to 125 g) of flour onto a shallow plate. Sprinkle 1 teaspoon of salt and 1/4 teaspoon of ground pepper onto the flour. Use your fingers to mix the salt and pepper into the flour. If your steaks are over 1 in (2.5 cm) thick, turn the oven on to 400 °F (204 °C)."
        },
        {
          "headline":"Heat oil in the pan.",
          "description":"Place a heavy bottomed skillet or cast iron skillet over medium high heat. Add 1/4 cup of vegetable or canola oil and let it heat up. There should be enough oil to cover the entire bottom of your pan. If there isn't, add more oil. Avoid pan-frying the steaks in olive oil or butter. These will burn over the high heat."
        },
        {
          "headline":"Dredge the steaks.",
          "description":"Lay each steak into the seasoned flour so that that it's coated. Turn each steak over so that they're completely covered in the mixture. Lift the steaks up and shake off the excess flour mixture. Wash your hands with soap and water after handling the raw steaks to prevent the spread of disease. It's a good idea to handle the steaks with one hand while using your other hand to sprinkle the flour mixture over the steak. This keeps one hand dry so the flour mixture doesn't stick to you."
        },
        {
          "headline":"Fry the steaks in the pan.",
          "description":"Once the oil is hot and shimmering, carefully lower the prepared steaks into the pan. Cook the steaks for 3 minutes on medium-high heat. Use tongs to flip the steaks over and cook for another 3 minutes. The steaks should be golden brown. If they're thin, they should be finished cooking. If they're thick, transfer them to the oven to finish cooking for another 6 to 10 minutes. Regardless of thickness, the pork loin steaks should be at least 145 °F (63 °C) before they're ready to serve. If you're finishing the steaks in the oven, ensure that the pan you use is oven safe."
        }
      ]
    },
    {
      "name":"Broiling Pork Loin Steaks",
      "steps":[
        {
          "headline":"Turn on the broiler and season the pork loin steaks.",
          "description":"If you have a top-oven broiler, move the top rack so that it's 3 to 5 in (7.6 to 12.7 cm) from the broiler. Turn the broiler on to hi and let it heat for about 10 minutes. Generously salt and pepper both sides of your pork loin steaks. You could also sprinkle them with:\nGround fennel\nGarlic powder\nOnion powder\nGround cumin"
        },
        {
          "headline":"Broil the first side of the steaks.",
          "description":"Cover a baking or roasting pan with foil so that it's easier to clean up. Set the seasoned pork loin steaks on the foil and place the pan under the broiler. Broil the steaks for 6 to 8 minutes. Keep in mind that thinner steaks will cook quicker while thicker steaks may take longer. If your steaks are more than 1 ⁄2 in (3.8 cm) thick, consider broiling them 4 to 5 in (10 to 13 cm) away from the heat source. This will prevent the outside from burning before the inside has a chance to cook."
        },
        {
          "headline":"Turn the steaks and broil the bottom sides.",
          "description":"Carefully use tongs to flip the pork loin steaks over on the baking pan. Place the steaks back under the broiler and continue to broil them for another 6 to 8 minutes or until the steaks are golden brown. Remember to wear oven mitts and use caution when pulling the baking pan out of the oven."
        },
        {
          "headline":"Rest the steaks before you serve them.",
          "description":"Once the pork loin steaks have browned on both sides, remove the pan and check the internal temperature of the steaks. The steaks should be between 145 and 160 °F (63 and 71 °C) before you let them rest. Let them rest for 5 minutes before you serve them. Resting the steaks helps relax the muscle so the juices evenly distribute."
        }
      ]
    },
    {
      "name":"Grilling Pork Loin Steaks",
      "steps":[
        {
          "headline":"Heat the grill and season the steaks.",
          "description":"Turn your gas grill on to medium heat. If you have a charcoal grill, heat the coals and dump the coals in the center of the grate. Sprinkle the pork loin chops with salt and pepper on both sides. Squeeze juice from half a lime over the pork chops and brush them with 2 tablespoons of vegetable oil. While you can season the steaks with salt and pepper ahead of time, avoid squeezing the lime juice over them until right before you put them on the grill."
        },
        {
          "headline":"Place the steaks on the grill.",
          "description":"Ensure that the grill's grate is clean and place your seasoned pork loin steaks on the grate. If you're using a charcoal grill, place them over direct heat (right above the coals). If your steaks are about 3/4\" thick, cook them for 4 to 6 minutes. If your steaks are around 1 ⁄2 in (3.8 cm), cook them longer. They'll need closer to 10 minutes for the first side."
        },
        {
          "headline":"Turn and grill the other side.",
          "description":"Use tongs to carefully turn over the steaks. Once you've flipped the steaks, let them finish cooking. Grill the ⁄4 in (1.9 cm) steaks for another 4 to 6 minutes or grill the 1 ⁄2 in (3.8 cm) steaks for another 10 minutes. Check the steak temperature to see if they're between 145 and 160 °F (63 and 71 °C). Let them rest for 5 minutes before you serve them. If you'd like to get decorative grill marks, consider turning the steaks at a about a 90-degree angle during the last few minutes of grilling. This will give your steaks cross-hatches."
        }
      ]
    },
    {
      "name":"Selecting and Serving Pork Loin Steaks",
      "steps":[
        {
          "headline":"Choose the pork loin steaks.",
          "description":"Decide how many people you'll be cooking for and determine how much pork you need. Plan on buying 4 ounces of pork loin steaks for each person. Look for pork that's pinkish-red in color and has a little marbled fat. Avoid choosing pork loin steaks that have a dark bone or dark spots on the fat."
        },
        {
          "headline":"Store the pork loin steaks in the fridge.",
          "description":"If you won't be cooking the pork loin steaks as soon as you get home, you can refrigerate them for 2 to 4 days if they're in pre-packaged containers. If they're not or you want to store them for longer, consider freezing them. To freeze the steaks, completely wrap them in a freezer-safe material (like freezer paper or aluminum foil) and remove as much of the air as you can. Label the steaks and freeze them at 0 °F (−18 °C) until you need them."
        },
        {
          "headline":"Serve the pork loin steaks.",
          "description":"Since pork loin steaks can make a light meal, you can serve more filling sides like rice, beans, and potatoes. Or you can keep the meal light and serve the steaks with roasted vegetables or a tossed salad. Other serving sides include:\nColeslaw\nSweet potatoes\nRed cabbage with apples\nCollard greens\nPureed white beans"
        }
      ]
    }
  ],
  "text":" Pan-Frying Pork Loin Steaks Create a dredging station. Pat the pork loin steaks dry with paper towels and set them aside. Pour ½ to 1 cup (60 to 125 g) of flour onto a shallow plate. Sprinkle 1 teaspoon of salt and 1/4 teaspoon of ground pepper onto the flour. Use your fingers to mix the salt and pepper into the flour. If your steaks are over 1 in (2.5 cm) thick, turn the oven on to 400 °F (204 °C). Heat oil in the pan. Place a heavy bottomed skillet or cast iron skillet over medium high heat. Add 1/4 cup of vegetable or canola oil and let it heat up. There should be enough oil to cover the entire bottom of your pan. If there isn't, add more oil. Avoid pan-frying the steaks in olive oil or butter. These will burn over the high heat. Dredge the steaks. Lay each steak into the seasoned flour so that that it's coated. Turn each steak over so that they're completely covered in the mixture. Lift the steaks up and shake off the excess flour mixture. Wash your hands with soap and water after handling the raw steaks to prevent the spread of disease. It's a good idea to handle the steaks with one hand while using your other hand to sprinkle the flour mixture over the steak. This keeps one hand dry so the flour mixture doesn't stick to you. Fry the steaks in the pan. Once the oil is hot and shimmering, carefully lower the prepared steaks into the pan. Cook the steaks for 3 minutes on medium-high heat. Use tongs to flip the steaks over and cook for another 3 minutes. The steaks should be golden brown. If they're thin, they should be finished cooking. If they're thick, transfer them to the oven to finish cooking for another 6 to 10 minutes. Regardless of thickness, the pork loin steaks should be at least 145 °F (63 °C) before they're ready to serve. If you're finishing the steaks in the oven, ensure that the pan you use is oven safe. Broiling Pork Loin Steaks Turn on the broiler and season the pork loin steaks. If you have a top-oven broiler, move the top rack so that it's 3 to 5 in (7.6 to 12.7 cm) from the broiler. Turn the broiler on to hi and let it heat for about 10 minutes. Generously salt and pepper both sides of your pork loin steaks. You could also sprinkle them with:\nGround fennel\nGarlic powder\nOnion powder\nGround cumin Broil the first side of the steaks. Cover a baking or roasting pan with foil so that it's easier to clean up. Set the seasoned pork loin steaks on the foil and place the pan under the broiler. Broil the steaks for 6 to 8 minutes. Keep in mind that thinner steaks will cook quicker while thicker steaks may take longer. If your steaks are more than 1 ⁄2 in (3.8 cm) thick, consider broiling them 4 to 5 in (10 to 13 cm) away from the heat source. This will prevent the outside from burning before the inside has a chance to cook. Turn the steaks and broil the bottom sides. Carefully use tongs to flip the pork loin steaks over on the baking pan. Place the steaks back under the broiler and continue to broil them for another 6 to 8 minutes or until the steaks are golden brown. Remember to wear oven mitts and use caution when pulling the baking pan out of the oven. Rest the steaks before you serve them. Once the pork loin steaks have browned on both sides, remove the pan and check the internal temperature of the steaks. The steaks should be between 145 and 160 °F (63 and 71 °C) before you let them rest. Let them rest for 5 minutes before you serve them. Resting the steaks helps relax the muscle so the juices evenly distribute. Grilling Pork Loin Steaks Heat the grill and season the steaks. Turn your gas grill on to medium heat. If you have a charcoal grill, heat the coals and dump the coals in the center of the grate. Sprinkle the pork loin chops with salt and pepper on both sides. Squeeze juice from half a lime over the pork chops and brush them with 2 tablespoons of vegetable oil. While you can season the steaks with salt and pepper ahead of time, avoid squeezing the lime juice over them until right before you put them on the grill. Place the steaks on the grill. Ensure that the grill's grate is clean and place your seasoned pork loin steaks on the grate. If you're using a charcoal grill, place them over direct heat (right above the coals). If your steaks are about 3/4\" thick, cook them for 4 to 6 minutes. If your steaks are around 1 ⁄2 in (3.8 cm), cook them longer. They'll need closer to 10 minutes for the first side. Turn and grill the other side. Use tongs to carefully turn over the steaks. Once you've flipped the steaks, let them finish cooking. Grill the ⁄4 in (1.9 cm) steaks for another 4 to 6 minutes or grill the 1 ⁄2 in (3.8 cm) steaks for another 10 minutes. Check the steak temperature to see if they're between 145 and 160 °F (63 and 71 °C). Let them rest for 5 minutes before you serve them. If you'd like to get decorative grill marks, consider turning the steaks at a about a 90-degree angle during the last few minutes of grilling. This will give your steaks cross-hatches. Selecting and Serving Pork Loin Steaks Choose the pork loin steaks. Decide how many people you'll be cooking for and determine how much pork you need. Plan on buying 4 ounces of pork loin steaks for each person. Look for pork that's pinkish-red in color and has a little marbled fat. Avoid choosing pork loin steaks that have a dark bone or dark spots on the fat. Store the pork loin steaks in the fridge. If you won't be cooking the pork loin steaks as soon as you get home, you can refrigerate them for 2 to 4 days if they're in pre-packaged containers. If they're not or you want to store them for longer, consider freezing them. To freeze the steaks, completely wrap them in a freezer-safe material (like freezer paper or aluminum foil) and remove as much of the air as you can. Label the steaks and freeze them at 0 °F (−18 °C) until you need them. Serve the pork loin steaks. Since pork loin steaks can make a light meal, you can serve more filling sides like rice, beans, and potatoes. Or you can keep the meal light and serve the steaks with roasted vegetables or a tossed salad. Other serving sides include:\nColeslaw\nSweet potatoes\nRed cabbage with apples\nCollard greens\nPureed white beans",
  "tyn_model":[
    "pork loin steaks",
    "flour",
    "pork loin",
    "broiler",
    "grill",
    "oven",
    "salt",
    "oil",
    "pan",
    "foil",
    "baking pan",
    "charcoal grill",
    "salt and pepper",
    "pork",
    "paper towels",
    "shallow plate",
    "ground pepper",
    "pepper",
    "skillet",
    "cast iron skillet",
    "vegetable or canola oil",
    "olive oil",
    "butter",
    "water",
    "fennel",
    "garlic powder",
    "onion powder",
    "ground cumin",
    "baking or roasting pan",
    "steaks",
    "oven mitts",
    "gas grill",
    "pork loin chops",
    "vegetable oil",
    "tongs",
    "freezer paper",
    "aluminum foil",
    "rice",
    "potatoes",
    "coleslaw",
    "sweet potatoes",
    "red cabbage",
    "apples",
    "collard greens",
    "white beans"
  ],
  "tyn_section":[

  ]
}