{
  "title":"How to Buy Spaghetti Squash",
  "url":"https://www.wikihow.com/Buy-Spaghetti-Squash",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Squash"
  ],
  "methods":[
    {
      "name":"Selecting a Spaghetti Squash",
      "steps":[
        {
          "headline":"Choose a dry, firm squash.",
          "description":"Spaghetti squash are creamy white to pale yellow in color and shaped like watermelon, but are smaller in size. When selecting a spaghetti squash, go for one that has a firm, dry rind. There should not be soft spots or cracks on your squash. A good spaghetti squash will seem heavy for its size. In the U.S., spaghetti squash usually cost a few dollars each."
        },
        {
          "headline":"Avoid squash without stems.",
          "description":"Choose a squash with a stem that is still attached, and is firm and dry to the touch. Attached stems help keep bacteria out of the squash. The stem itself should be short and round, without excessive damage."
        },
        {
          "headline":"Pass on shiny or green spaghetti squash.",
          "description":"Aside from soft spots, cracks, or missing stems, you should also watch out for squash that have a noticeably shiny rind. This could indicate that the squash was picked before it was ready. Green squash were definitely picked before they were ripe. Shininess may also indicate that a wax coating has been applied to the squash. If possible, select a squash that has not been coated in wax."
        }
      ]
    },
    {
      "name":"Finding and Storing Your Squash",
      "steps":[
        {
          "headline":"Look for squash all year.",
          "description":"Spaghetti squash are available all year. These vegetables are in their peak season from early fall through the winter. Local farmers markets are the best option in fall and winter, where spaghetti squash will likely be available."
        },
        {
          "headline":"Store squash for up to three months.",
          "description":"If you get a freshly harvested squash, it can last several month in a cool, dry location. Keep the squash between 55° to 60° Fahrenheit (13°-16° Celsius). Keep the squash out of direct sunlight or heat."
        },
        {
          "headline":"Do not refrigerate uncooked, uncut squash.",
          "description":"Putting your spaghetti squash in the fridge will actually make it spoil more quickly. At refrigerated temps, your squash will only last a week or two. If your cut your squash and use only some of it, wrap the unused portion tightly in plastic wrap and refrigerate it. Use the rest of the squash within a week or so."
        }
      ]
    },
    {
      "name":"Preparing Spaghetti Squash",
      "steps":[
        {
          "headline":"Cut spaghetti squash lengthwise.",
          "description":"Start to prepare a spaghetti squash by cutting it in half lengthwise. Remove the seeds from the center of the squash with a large spoon. If you plan to bake the squash, rub olive oil inside it. Consider seasoning it with whatever spices you prefer, though salt and pepper are a sure bet. Whichever method you choose, take care to avoid overcooking spaghetti squash, as this will detrimentally affect its flavor and texture."
        },
        {
          "headline":"Bake or boil the squash.",
          "description":"Preheat your oven to 375°F (191°C). Place the halves of the squash cut sides down in a casserole dish that is large enough to allow them to rest flat. The dish shouldn’t have too much excess space. Our ½ cup of water into the dish to help keep the squash from drying out. Bake for 30 to 35 minutes, or until tender. To roast a whole, uncut squash, make several small cuts in the rind and cook at 350° F (180° C) for 60 to 90 minutes. You can also boil the squash until the flesh is tender. Cut it into large pieces, such as halves, and boil it for about twenty minutes and check for tenderness."
        },
        {
          "headline":"Microwave your squash.",
          "description":"Tightly cover a dish containing a half squash, cut side down and a small amount of water with plastic wrap. Microwave on high for 12 minutes and check to see if the flesh is tender."
        },
        {
          "headline":"Rake the squash flesh into strings.",
          "description":"You can rake all the way to the rind. The resultant strips of flesh make a great alternative to spaghetti. Try them with your favorite spaghetti sauce, tossed in olive oil and sea salt, or with anything else that strikes your fancy. Spaghetti squash does not actually taste like wheat spaghetti. It will be sweeter, with a crunchier texture."
        }
      ]
    }
  ],
  "text":" Selecting a Spaghetti Squash Choose a dry, firm squash. Spaghetti squash are creamy white to pale yellow in color and shaped like watermelon, but are smaller in size. When selecting a spaghetti squash, go for one that has a firm, dry rind. There should not be soft spots or cracks on your squash. A good spaghetti squash will seem heavy for its size. In the U.S., spaghetti squash usually cost a few dollars each. Avoid squash without stems. Choose a squash with a stem that is still attached, and is firm and dry to the touch. Attached stems help keep bacteria out of the squash. The stem itself should be short and round, without excessive damage. Pass on shiny or green spaghetti squash. Aside from soft spots, cracks, or missing stems, you should also watch out for squash that have a noticeably shiny rind. This could indicate that the squash was picked before it was ready. Green squash were definitely picked before they were ripe. Shininess may also indicate that a wax coating has been applied to the squash. If possible, select a squash that has not been coated in wax. Finding and Storing Your Squash Look for squash all year. Spaghetti squash are available all year. These vegetables are in their peak season from early fall through the winter. Local farmers markets are the best option in fall and winter, where spaghetti squash will likely be available. Store squash for up to three months. If you get a freshly harvested squash, it can last several month in a cool, dry location. Keep the squash between 55° to 60° Fahrenheit (13°-16° Celsius). Keep the squash out of direct sunlight or heat. Do not refrigerate uncooked, uncut squash. Putting your spaghetti squash in the fridge will actually make it spoil more quickly. At refrigerated temps, your squash will only last a week or two. If your cut your squash and use only some of it, wrap the unused portion tightly in plastic wrap and refrigerate it. Use the rest of the squash within a week or so. Preparing Spaghetti Squash Cut spaghetti squash lengthwise. Start to prepare a spaghetti squash by cutting it in half lengthwise. Remove the seeds from the center of the squash with a large spoon. If you plan to bake the squash, rub olive oil inside it. Consider seasoning it with whatever spices you prefer, though salt and pepper are a sure bet. Whichever method you choose, take care to avoid overcooking spaghetti squash, as this will detrimentally affect its flavor and texture. Bake or boil the squash. Preheat your oven to 375°F (191°C). Place the halves of the squash cut sides down in a casserole dish that is large enough to allow them to rest flat. The dish shouldn’t have too much excess space. Our ½ cup of water into the dish to help keep the squash from drying out. Bake for 30 to 35 minutes, or until tender. To roast a whole, uncut squash, make several small cuts in the rind and cook at 350° F (180° C) for 60 to 90 minutes. You can also boil the squash until the flesh is tender. Cut it into large pieces, such as halves, and boil it for about twenty minutes and check for tenderness. Microwave your squash. Tightly cover a dish containing a half squash, cut side down and a small amount of water with plastic wrap. Microwave on high for 12 minutes and check to see if the flesh is tender. Rake the squash flesh into strings. You can rake all the way to the rind. The resultant strips of flesh make a great alternative to spaghetti. Try them with your favorite spaghetti sauce, tossed in olive oil and sea salt, or with anything else that strikes your fancy. Spaghetti squash does not actually taste like wheat spaghetti. It will be sweeter, with a crunchier texture.",
  "tyn_model":[
    "squash",
    "spaghetti squash",
    "wax",
    "plastic wrap",
    "olive oil",
    "water",
    "fridge",
    "large spoon",
    "oven",
    "casserole dish",
    "dish",
    "spaghetti",
    "spaghetti sauce",
    "sea salt"
  ],
  "tyn_section":[

  ]
}