{
  "title":"How to Make a Choc Orange Pudding in the Microwave",
  "url":"https://www.wikihow.com/Make-a-Choc-Orange-Pudding-in-the-Microwave",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Puddings"
  ],
  "parts":[
    {
      "name":"Making the Pudding Batter",
      "steps":[
        {
          "headline":"Sift together the flour and cocoa powder in a mixing bowl.",
          "description":""
        },
        {
          "headline":"Add the sugar, milk and vanilla essence (extract).",
          "description":"Stir well."
        },
        {
          "headline":"Melt the butter in a separate small bowl in the microwave at \"medium\" (505) for 1 minute.",
          "description":""
        },
        {
          "headline":"Pour the melted butter to the bowl with the pudding batter.",
          "description":"Mix well."
        },
        {
          "headline":"Spread the pudding batter into the casserole bowl.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Sauce",
      "steps":[
        {
          "headline":"Make the sauce.",
          "description":"The sauce is added to the pudding batter before cooking. It won't mix into the batter but it will form a moist outer layer that slightly seeps into the cooked pudding and creates a lovely, gooey sauce."
        },
        {
          "headline":"Mix the cocoa powder, orange juice, brown sugar and water in a jug (or other container with a pouring lip).",
          "description":"Stir well to combine."
        },
        {
          "headline":"Pour the sauce evenly over the pudding batter.",
          "description":"Don't stir it! The sauce will settle on top on its own; if stirred, it'll combine with the batter, which you don't want happening."
        }
      ]
    },
    {
      "name":"Microwaving the Pudding",
      "steps":[
        {
          "headline":"Cover the glass bowl with a piece of cling wrap (plastic food wrap suitable for the microwave).",
          "description":"Or, put a suitable lid (glass) on top."
        },
        {
          "headline":"Place the pudding into the microwave oven.",
          "description":"Cook the pudding on high for 7 minutes. Remove when cooked, and let it stand for 5 minutes."
        },
        {
          "headline":"Serve.",
          "description":"Scoop into serving bowls, making sure to get sufficient sauce for each pudding portion. Eat and enjoy!"
        }
      ]
    }
  ],
  "text":" Making the Pudding Batter Sift together the flour and cocoa powder in a mixing bowl.  Add the sugar, milk and vanilla essence (extract). Stir well. Melt the butter in a separate small bowl in the microwave at \"medium\" (505) for 1 minute.  Pour the melted butter to the bowl with the pudding batter. Mix well. Spread the pudding batter into the casserole bowl.  Making the Sauce Make the sauce. The sauce is added to the pudding batter before cooking. It won't mix into the batter but it will form a moist outer layer that slightly seeps into the cooked pudding and creates a lovely, gooey sauce. Mix the cocoa powder, orange juice, brown sugar and water in a jug (or other container with a pouring lip). Stir well to combine. Pour the sauce evenly over the pudding batter. Don't stir it! The sauce will settle on top on its own; if stirred, it'll combine with the batter, which you don't want happening. Microwaving the Pudding Cover the glass bowl with a piece of cling wrap (plastic food wrap suitable for the microwave). Or, put a suitable lid (glass) on top. Place the pudding into the microwave oven. Cook the pudding on high for 7 minutes. Remove when cooked, and let it stand for 5 minutes. Serve. Scoop into serving bowls, making sure to get sufficient sauce for each pudding portion. Eat and enjoy!",
  "tyn_model":[
    "pudding batter",
    "cocoa powder",
    "butter",
    "microwave",
    "pudding",
    "flour",
    "mixing bowl",
    "sugar",
    "milk",
    "vanilla",
    "small bowl",
    "casserole bowl",
    "orange juice",
    "brown sugar",
    "water",
    "cling wrap",
    "plastic food wrap",
    "microwave oven",
    "serving bowls"
  ],
  "tyn_section":[

  ]
}