{
  "title":"How to Make a Gourmet Grilled Cheese",
  "url":"https://www.wikihow.com/Make-a-Gourmet-Grilled-Cheese",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Cheese Sandwiches"
  ],
  "methods":[
    {
      "name":"Selecting Gourmet Ingredients",
      "steps":[
        {
          "headline":"Find a new favorite cheese.",
          "description":"Begin by visiting a specialty cheese shop or a grocery store with a particularly large cheese section. Talk to an employee about what flavors you’re looking for and what sort of flavor combinations you’re in the mood for. Don’t forget to mention whether you’re looking for a particular consistency as well. Be brave. You could always go for a solid cheese you’ve had before, but trying something new will broaden the scope of flavors you’re able to incorporate in future recipes. If you’re looking for the meltiest of all cheeses, go for Muenster and Havarti."
        },
        {
          "headline":"Blend several cheeses together.",
          "description":"Leaning towards building a basic grilled cheese, just a bit fancier? Don’t hesitate to use multiple cheeses on one sandwich. For example, get some Comte, Taleggio, and Brie, all for use on one sandwich. This particular combination will go best with a fine, relatively neutral bread like Brioche. The important thing it to be creative. Plus, winding up with a few different blocks of cheese in your fridge gives you the opportunity to try other new, equally adventurous recipes."
        },
        {
          "headline":"Consider your bread options.",
          "description":"A high quality bread is an absolute necessity if you want your sandwich to look, feel, and taste gourmet. Most importantly, make sure the bread you choose is firm enough to provide a crisp outer layer when buttered and cooked. Go with Pullman bread for a soft and airy option similar to white bread, but with a better crust and higher quality ingredients. Rich, dense multigrain options can hold up to the most flavorful of cheeses. Pair it with Manchego. Pumpernickel can pair well more powerful flavors too. Day-old sourdough is the crème-de-la-crème of grilled cheese bread options. The air pockets in sourdough add texture to your bite, and a day gives it the necessary time to firm up and maximize crunchiness."
        }
      ]
    },
    {
      "name":"Trying Proven Gourmet Grilled Cheese Recipes",
      "steps":[
        {
          "headline":"Expand upon the mushroom classic.",
          "description":"Though a cheddar and tomato grilled cheese may be the standard, a gouda, mushroom, and onion grilled cheese is the standard gourmet option. Roast some mushrooms and onions and add to liberal amount of Gouda, all pressed between a pair of whole wheat bread slices. Add greens too! Kale will go especially great in this one."
        },
        {
          "headline":"Default to roasted veggies.",
          "description":"Once you’ve got a better handle on all the different cheeses to choose from, spend a few extra minutes in the produce department. Particularly healthy – and tasty – options include Brussel sprouts, asparagus, and spinach. All of these go very well with goat cheese. In truth, you can pair just about any cheese with just about any vegetable. After finding a few cheeses you like, grab a whole slew of different veggies to slice up and try out in different combinations."
        },
        {
          "headline":"Make a sweet sandwich with Brie.",
          "description":"One borderline-dessert grilled cheese option incorporates strawberries, a delightful cheese called Brie, and chocolate. Cover a slice of multigrain bread with a layer of sliced Brie. Next, cover the chees with strawberries that have been quartered, salted, peppered, and briefly pan-roasted. Include a liquid drizzle of dark chocolate and add another slice of multigrain. Heat as desired. Alternatively, pair Brie with apple slices and fig jam on multigrain. If you’re looking for a particularly complex sandwich, throw in some arugula and caramelized onions as well. Want to keep it simple, add some class, and incorporate bacon? It can happen: pair brie with still-hot bacon and apricot preserves."
        },
        {
          "headline":"Try a spicy recipe.",
          "description":"Grab yourself a jar of jalapeño jelly and swing by the produce section for a crisp, tart apple too. Pair these with a cheese combination, such as cheddar and mozzarella. This recipe calls for sourdough, and will be best grilled. Alternatively, you can always cut up some fresh jalapeños. While your sandwich will still be both fancy and delicious, it will lose some of the balance brought by the jelly’s sweetness."
        },
        {
          "headline":"Redefine gourmet with a lobster grilled cheese.",
          "description":"Go for seafood gold and grab yourself some lobster. Include it in a sandwich with Mascarpone cheese, diced scallions, and few slices of freshly cut tomatoes. The flavor of lobster is, admittedly, best allowed to access your taste buds when paired with white bread, such as that of a dinner roll. Consider adding some provolone as well, and some arugula to add some vegetal spiciness."
        },
        {
          "headline":"Build the ultimate grilled cheese with blueberries and balsamic.",
          "description":"Another fruit and cheese sandwich? Well, this one’s especially worthy of note. Simply layer blueberries, greens of your choosing, and goat cheese on a baguette and douse in balsamic vinegar."
        }
      ]
    },
    {
      "name":"Cooking a Perfect Grilled Cheese Sandwich",
      "steps":[
        {
          "headline":"Butter a skillet.",
          "description":"Melt 1 tablespoon of salted butter in a nonstick skillet over medium-low heat. If you’ve got one, use a cast-iron skillet. While salted butter isn’t your only option – it’s widely accepted to be the best. For instance, mayo will work, but is best for American cheese on white bread – not quite worthy of “gourmet” status. In fact, your butter can be the source of your sandwich’s sophistication. Try truffle butter, herbed butter, or garlic butter."
        },
        {
          "headline":"Cook the sandwich for 3 to 5 minutes on one side.",
          "description":"Before placing the sandwich in the pan, press it down gently. Avoid crushing any of your gourmet ingredients, or press hard enough to keep it all together. After three minutes, use a spatula to peak at the side of the sandwich that’s been cooking. If it’s golden brown, you’ve nailed it. Hurry up and flip your sandwich over."
        },
        {
          "headline":"Cook the other side.",
          "description":"Lift the sandwich with a spatula and inspect the skillet’s surface. If the sandwich lifted without resistance, and there is still an buttery sheen to the skillet’s surface, carefully flip your sandwich and begin cooking the other side. Give it three minutes and check to see if the bread has browned to perfection. Add a bit more butter between sides if the sandwich sticks to the surface or the skillet looks dry when you check it."
        },
        {
          "headline":"Plate your sandwich.",
          "description":"Carefully transfer your sandwich from the pan to a plate of your choosing. Garnish per the recipe you’re working with, or with something that will simply boost the visual appeal of your sandwich. A single stalk of parsley or another well-placed bit of herb, albeit simple, will not only look good, but will call attention to the fact that you put care and attention into the sandwich. Finally: enjoy!"
        }
      ]
    }
  ],
  "text":" Selecting Gourmet Ingredients Find a new favorite cheese. Begin by visiting a specialty cheese shop or a grocery store with a particularly large cheese section. Talk to an employee about what flavors you’re looking for and what sort of flavor combinations you’re in the mood for. Don’t forget to mention whether you’re looking for a particular consistency as well. Be brave. You could always go for a solid cheese you’ve had before, but trying something new will broaden the scope of flavors you’re able to incorporate in future recipes. If you’re looking for the meltiest of all cheeses, go for Muenster and Havarti. Blend several cheeses together. Leaning towards building a basic grilled cheese, just a bit fancier? Don’t hesitate to use multiple cheeses on one sandwich. For example, get some Comte, Taleggio, and Brie, all for use on one sandwich. This particular combination will go best with a fine, relatively neutral bread like Brioche. The important thing it to be creative. Plus, winding up with a few different blocks of cheese in your fridge gives you the opportunity to try other new, equally adventurous recipes. Consider your bread options. A high quality bread is an absolute necessity if you want your sandwich to look, feel, and taste gourmet. Most importantly, make sure the bread you choose is firm enough to provide a crisp outer layer when buttered and cooked. Go with Pullman bread for a soft and airy option similar to white bread, but with a better crust and higher quality ingredients. Rich, dense multigrain options can hold up to the most flavorful of cheeses. Pair it with Manchego. Pumpernickel can pair well more powerful flavors too. Day-old sourdough is the crème-de-la-crème of grilled cheese bread options. The air pockets in sourdough add texture to your bite, and a day gives it the necessary time to firm up and maximize crunchiness. Trying Proven Gourmet Grilled Cheese Recipes Expand upon the mushroom classic. Though a cheddar and tomato grilled cheese may be the standard, a gouda, mushroom, and onion grilled cheese is the standard gourmet option. Roast some mushrooms and onions and add to liberal amount of Gouda, all pressed between a pair of whole wheat bread slices. Add greens too! Kale will go especially great in this one. Default to roasted veggies. Once you’ve got a better handle on all the different cheeses to choose from, spend a few extra minutes in the produce department. Particularly healthy – and tasty – options include Brussel sprouts, asparagus, and spinach. All of these go very well with goat cheese. In truth, you can pair just about any cheese with just about any vegetable. After finding a few cheeses you like, grab a whole slew of different veggies to slice up and try out in different combinations. Make a sweet sandwich with Brie. One borderline-dessert grilled cheese option incorporates strawberries, a delightful cheese called Brie, and chocolate. Cover a slice of multigrain bread with a layer of sliced Brie. Next, cover the chees with strawberries that have been quartered, salted, peppered, and briefly pan-roasted. Include a liquid drizzle of dark chocolate and add another slice of multigrain. Heat as desired. Alternatively, pair Brie with apple slices and fig jam on multigrain. If you’re looking for a particularly complex sandwich, throw in some arugula and caramelized onions as well. Want to keep it simple, add some class, and incorporate bacon? It can happen: pair brie with still-hot bacon and apricot preserves. Try a spicy recipe. Grab yourself a jar of jalapeño jelly and swing by the produce section for a crisp, tart apple too. Pair these with a cheese combination, such as cheddar and mozzarella. This recipe calls for sourdough, and will be best grilled. Alternatively, you can always cut up some fresh jalapeños. While your sandwich will still be both fancy and delicious, it will lose some of the balance brought by the jelly’s sweetness. Redefine gourmet with a lobster grilled cheese. Go for seafood gold and grab yourself some lobster. Include it in a sandwich with Mascarpone cheese, diced scallions, and few slices of freshly cut tomatoes. The flavor of lobster is, admittedly, best allowed to access your taste buds when paired with white bread, such as that of a dinner roll. Consider adding some provolone as well, and some arugula to add some vegetal spiciness. Build the ultimate grilled cheese with blueberries and balsamic. Another fruit and cheese sandwich? Well, this one’s especially worthy of note. Simply layer blueberries, greens of your choosing, and goat cheese on a baguette and douse in balsamic vinegar. Cooking a Perfect Grilled Cheese Sandwich Butter a skillet. Melt 1 tablespoon of salted butter in a nonstick skillet over medium-low heat. If you’ve got one, use a cast-iron skillet. While salted butter isn’t your only option – it’s widely accepted to be the best. For instance, mayo will work, but is best for American cheese on white bread – not quite worthy of “gourmet” status. In fact, your butter can be the source of your sandwich’s sophistication. Try truffle butter, herbed butter, or garlic butter. Cook the sandwich for 3 to 5 minutes on one side. Before placing the sandwich in the pan, press it down gently. Avoid crushing any of your gourmet ingredients, or press hard enough to keep it all together. After three minutes, use a spatula to peak at the side of the sandwich that’s been cooking. If it’s golden brown, you’ve nailed it. Hurry up and flip your sandwich over. Cook the other side. Lift the sandwich with a spatula and inspect the skillet’s surface. If the sandwich lifted without resistance, and there is still an buttery sheen to the skillet’s surface, carefully flip your sandwich and begin cooking the other side. Give it three minutes and check to see if the bread has browned to perfection. Add a bit more butter between sides if the sandwich sticks to the surface or the skillet looks dry when you check it. Plate your sandwich. Carefully transfer your sandwich from the pan to a plate of your choosing. Garnish per the recipe you’re working with, or with something that will simply boost the visual appeal of your sandwich. A single stalk of parsley or another well-placed bit of herb, albeit simple, will not only look good, but will call attention to the fact that you put care and attention into the sandwich. Finally: enjoy!",
  "tyn_model":[
    "grilled cheese",
    "brie",
    "bread",
    "skillet",
    "cheese",
    "sourdough",
    "goat cheese",
    "strawberries",
    "arugula",
    "bacon",
    "lobster",
    "blueberries",
    "salted butter",
    "butter",
    "pan",
    "spatula",
    "muenster",
    "comte",
    "taleggio",
    "brioche",
    "pullman bread",
    "pumpernickel",
    "grilled cheese bread",
    "mushroom",
    "mushrooms",
    "onions",
    "gouda",
    "whole wheat bread",
    "– and",
    "– options",
    "brussel sprouts",
    "asparagus",
    "spinach",
    "chocolate",
    "dark chocolate",
    "apple slices",
    "fig jam",
    "caramelized onions",
    "apricot preserves",
    "jalapeño jelly",
    "cheddar",
    "mozzarella",
    "jalapeños",
    "jelly",
    "mascarpone cheese",
    "scallions",
    "tomatoes",
    "dinner roll",
    "provolone",
    "balsamic",
    "baguette",
    "balsamic vinegar",
    "nonstick skillet",
    "cast-iron skillet",
    "– it",
    "mayo",
    "– not",
    "“gourmet",
    "” status",
    "truffle butter",
    "herbed butter",
    "garlic butter",
    "plate",
    "parsley"
  ],
  "tyn_section":[

  ]
}