{
  "title":"How to Clean Grout with Toilet Cleaner",
  "url":"https://www.wikihow.com/Clean-Grout-with-Toilet-Cleaner",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "parts":[
    {
      "name":"Selecting the Toilet Cleaner",
      "steps":[
        {
          "headline":"Look for a toilet cleaner that contains sodium hydroxide.",
          "description":"Many toilet cleaners contain sodium hydroxide and sodium hypochlorite. These two ingredients help to remove stains and grime on porcelain or tile surfaces as well as grout. Though they can be toxic in large amounts, they do work to effectively clean grout. You may look for common brands of toilet cleaner at your local hardware store or in the cleaning aisle at your grocery store."
        },
        {
          "headline":"Try an eco-friendly toilet cleaner.",
          "description":"To avoid exposing yourself or others to harmful chemicals, you may opt for a toilet cleaner that is eco-friendly. There are several toilet cleaners on the market that do not contain harmful chemicals. However, they may not be as effective for cleaning grout, or your toilet bowl, if they do not contain chemicals like sodium hydroxide or sodium hypochlorite. Many eco-friendly toilet cleaners are made with plant and mineral-based products. They may also be scented with lemon, mint, or pine, a bonus for making your grout smell less wet or dirty."
        },
        {
          "headline":"Use toilet cleaner that contains bleach with caution.",
          "description":"Though you may opt for toilet cleaner that contains bleach to better clean the grout, using bleach can be toxic to your health and possibly damage the tiling around the grout. Bleach can also strip the water-repellant materials that are in the grout, leading to damaged grout in the future, especially in showers or bathrooms. If you do go for a toilet cleaner that contains bleach, make sure you wear rubber gloves, eye protection like safety goggles, and a respirator mask so you are not at risk of inhaling the bleach. You should also wear clothing that you would not mind throwing out, as bleach can damage your clothing."
        }
      ]
    },
    {
      "name":"Cleaning the Grout",
      "steps":[
        {
          "headline":"Spot test the cleaner on the grout.",
          "description":"Before you dive right into cleaning the grout with the toilet cleaner, you should spot test it first on a portion of the grout. Choose a spot that can be covered up or hidden if it gets damaged. Use a small amount of the toilet cleaner on the grout and leave it on for five minutes. If the grout does not appear damaged, you can proceed to use the toilet cleaner on the rest of the grout."
        },
        {
          "headline":"Pour the cleaner on the grout and let it sit.",
          "description":"Do this by pouring the cleaner on the area with grout that is furthest from the door. This way, you can clean the grout in small sections, moving towards the door and cleaning each section as you go. If you are cleaning grout along a bathtub or a faucet, you do not have to worry about doing this. Pour a small amount of the cleaner on the grout. Do not pour too much cleaner on the grout or lay it on too thickly. You want an even amount dispersed on the grout so the cleaner can soak in and remove any dirt or grime. Allow the cleaner to stay on the dirty grout and soak in for five minutes. Do not touch or disturb the cleaner when it is sitting on the grout. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tFF\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFabricio Ferraz\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Consultant & Co-Owner, Hire a Cleaning\t\t\t\t\t\t\t\tFabricio Ferraz is the Co-Owner and Operator of Hire a Cleaning. Hire a Cleaning is a family owned and operated business that has been serving San Francisco, California homes for over 10 years. FF\t\t\t\t\tFabricio Ferraz\t\t\tCleaning Consultant & Co-Owner, Hire a Cleaning\t\t\t\tIf you're cleaning the grout in your shower, make sure no one has used it for 2 hours. If you try to clean the grout within 2 hours after anyone takes a shower, you can easily scratch the paint. Over time, this will cause you to have to repaint your bath much sooner. Using a paper towel will help protect the paint, as well."
        },
        {
          "headline":"Scrub the grout with a toothbrush.",
          "description":"Once you have let the cleaner sit on the grout, take a toothbrush or a grout cleaning brush, and gently run it over the grout. You should not have to scrub the cleaner off the grout very hard to remove any grime or dirt. Often, the grime will come off easy by running the brush over the grout. Scrub all of the grout that is covered with the cleaner. You should notice the grout appears clean and grime-free once you scrub it with the brush."
        },
        {
          "headline":"Rinse and dry the grout well.",
          "description":"It is very important that you rinse off the toilet cleaner as soon as you are done scrubbing the grout with the brush. Do not let the cleaner sit on the tile or the grout once you are done scrubbing it, as this can lead to a build-up of residue. This may also lead to a stain on the tile or the grout. Use a wet mop or a wet cloth to rinse off the cleaner. You should then dry the grout and the tiles well once the cleaner has been rinsed. Use a towel or soft cloth to do this. Do not use cloth that will scratch the surface of the tile or the grout."
        }
      ]
    },
    {
      "name":"Maintaining the Grout",
      "steps":[
        {
          "headline":"Squeegee the grout after you shower.",
          "description":"Try to get in the habit of using a squeegee to remove water from the surface of the tiles and the grout in your bathroom after you shower. Drying the shower doors and the tiles in the shower helps to prevent a buildup of grime or mineral deposits in your grout. You can attach a squeegee to the inside of your shower with a suction cup so it is right there at the end of your shower. Encourage others in your household to squeegee off the shower once they are done to keep the grout dry and clean."
        },
        {
          "headline":"Use a sealing product on the grout.",
          "description":"You can also maintain the grout so it looks its best by using a sealing product on it. Seal the grout once or twice a year so it remains water repellent. This will ensure the grout stays clean and grime-free. You can find sealing products for grout at your local hardware store or online."
        },
        {
          "headline":"Replace the grout if it becomes damaged.",
          "description":"If you notice the grout in your bathroom or kitchen is shrivelled, full of mildew, or damaged in any way, try to get it replaced as soon as possible. Replacing the grout will ensure it does not get worse or you do not experience other home repair issues as a result of damaged grout. You may try cleaning the grout before you consider replacing it. If it does not respond well to cleaning, it may be time to switch it out for new grout."
        }
      ]
    }
  ],
  "text":" Selecting the Toilet Cleaner Look for a toilet cleaner that contains sodium hydroxide. Many toilet cleaners contain sodium hydroxide and sodium hypochlorite. These two ingredients help to remove stains and grime on porcelain or tile surfaces as well as grout. Though they can be toxic in large amounts, they do work to effectively clean grout. You may look for common brands of toilet cleaner at your local hardware store or in the cleaning aisle at your grocery store. Try an eco-friendly toilet cleaner. To avoid exposing yourself or others to harmful chemicals, you may opt for a toilet cleaner that is eco-friendly. There are several toilet cleaners on the market that do not contain harmful chemicals. However, they may not be as effective for cleaning grout, or your toilet bowl, if they do not contain chemicals like sodium hydroxide or sodium hypochlorite. Many eco-friendly toilet cleaners are made with plant and mineral-based products. They may also be scented with lemon, mint, or pine, a bonus for making your grout smell less wet or dirty. Use toilet cleaner that contains bleach with caution. Though you may opt for toilet cleaner that contains bleach to better clean the grout, using bleach can be toxic to your health and possibly damage the tiling around the grout. Bleach can also strip the water-repellant materials that are in the grout, leading to damaged grout in the future, especially in showers or bathrooms. If you do go for a toilet cleaner that contains bleach, make sure you wear rubber gloves, eye protection like safety goggles, and a respirator mask so you are not at risk of inhaling the bleach. You should also wear clothing that you would not mind throwing out, as bleach can damage your clothing. Cleaning the Grout Spot test the cleaner on the grout. Before you dive right into cleaning the grout with the toilet cleaner, you should spot test it first on a portion of the grout. Choose a spot that can be covered up or hidden if it gets damaged. Use a small amount of the toilet cleaner on the grout and leave it on for five minutes. If the grout does not appear damaged, you can proceed to use the toilet cleaner on the rest of the grout. Pour the cleaner on the grout and let it sit. Do this by pouring the cleaner on the area with grout that is furthest from the door. This way, you can clean the grout in small sections, moving towards the door and cleaning each section as you go. If you are cleaning grout along a bathtub or a faucet, you do not have to worry about doing this. Pour a small amount of the cleaner on the grout. Do not pour too much cleaner on the grout or lay it on too thickly. You want an even amount dispersed on the grout so the cleaner can soak in and remove any dirt or grime. Allow the cleaner to stay on the dirty grout and soak in for five minutes. Do not touch or disturb the cleaner when it is sitting on the grout. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tFF\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFabricio Ferraz\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Consultant & Co-Owner, Hire a Cleaning\t\t\t\t\t\t\t\tFabricio Ferraz is the Co-Owner and Operator of Hire a Cleaning. Hire a Cleaning is a family owned and operated business that has been serving San Francisco, California homes for over 10 years. FF\t\t\t\t\tFabricio Ferraz\t\t\tCleaning Consultant & Co-Owner, Hire a Cleaning\t\t\t\tIf you're cleaning the grout in your shower, make sure no one has used it for 2 hours. If you try to clean the grout within 2 hours after anyone takes a shower, you can easily scratch the paint. Over time, this will cause you to have to repaint your bath much sooner. Using a paper towel will help protect the paint, as well. Scrub the grout with a toothbrush. Once you have let the cleaner sit on the grout, take a toothbrush or a grout cleaning brush, and gently run it over the grout. You should not have to scrub the cleaner off the grout very hard to remove any grime or dirt. Often, the grime will come off easy by running the brush over the grout. Scrub all of the grout that is covered with the cleaner. You should notice the grout appears clean and grime-free once you scrub it with the brush. Rinse and dry the grout well. It is very important that you rinse off the toilet cleaner as soon as you are done scrubbing the grout with the brush. Do not let the cleaner sit on the tile or the grout once you are done scrubbing it, as this can lead to a build-up of residue. This may also lead to a stain on the tile or the grout. Use a wet mop or a wet cloth to rinse off the cleaner. You should then dry the grout and the tiles well once the cleaner has been rinsed. Use a towel or soft cloth to do this. Do not use cloth that will scratch the surface of the tile or the grout. Maintaining the Grout Squeegee the grout after you shower. Try to get in the habit of using a squeegee to remove water from the surface of the tiles and the grout in your bathroom after you shower. Drying the shower doors and the tiles in the shower helps to prevent a buildup of grime or mineral deposits in your grout. You can attach a squeegee to the inside of your shower with a suction cup so it is right there at the end of your shower. Encourage others in your household to squeegee off the shower once they are done to keep the grout dry and clean. Use a sealing product on the grout. You can also maintain the grout so it looks its best by using a sealing product on it. Seal the grout once or twice a year so it remains water repellent. This will ensure the grout stays clean and grime-free. You can find sealing products for grout at your local hardware store or online. Replace the grout if it becomes damaged. If you notice the grout in your bathroom or kitchen is shrivelled, full of mildew, or damaged in any way, try to get it replaced as soon as possible. Replacing the grout will ensure it does not get worse or you do not experience other home repair issues as a result of damaged grout. You may try cleaning the grout before you consider replacing it. If it does not respond well to cleaning, it may be time to switch it out for new grout.",
  "tyn_model":[
    "grout",
    "toilet cleaner",
    "cleaner",
    "bleach",
    "toilet cleaners",
    "toothbrush",
    "brush",
    "squeegee",
    "rubber gloves",
    "respirator mask",
    "cleaning\t\t\t\t\t\t\t\tfabricio",
    "cleaning consultant",
    "cleaning\t\t\t\tif",
    "paper towel",
    "grout cleaning brush",
    "towel",
    "water",
    "suction cup",
    "sealing product",
    "sealing products"
  ],
  "tyn_section":[

  ]
}