{
  "title":"How to Collect Yu Gi Oh! Cards",
  "url":"https://www.wikihow.com/Collect-Yu-Gi-Oh!-Cards",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Start from the top of the game.",
      "description":"Never buy trading cards out of order. If you do, you will get confused. Always buy trading cards in the first order; for example: the first edition/season and the second edition/season then you go up and up."
    },
    {
      "headline":"Decide if you want to open them.",
      "description":"You may not want to open them because they can be worth some money and will be more valuable if you haven't opened them. Make sure you don't get them damaged - that will decrease their value by a lot. This will be a little hard, but Yu-Gi-Oh! trading cards are not expensive, so whatever age you are trying to collect trading cards this is for you."
    },
    {
      "headline":"Find a special place to put your trading cards like a shoe box, your closet, a jewelry box, a scrap-book or a binder.",
      "description":"You can get binders from game shops that are designed to hold trading cards. Put more valuable ones in sleeves to protect them from damage."
    },
    {
      "headline":"Try to get Yu-Gi-Oh!",
      "description":"cards every week or month, but stick to your budget! If you're young, make a deal with your parents about how much you can spend."
    },
    {
      "headline":"Keep your cards neat and organized so they don't get mixed up.",
      "description":"Have a system of sorting them. Most people sort by set number, which is a mix of letters and numbers that can be found at the bottom of the art and above the text. An example is SHVI-EN047. SHVI is the set, Shining Victories, EN is English language, and 47 is the number in the set list."
    },
    {
      "headline":"Try to trade your spare cards for the ones you don't have or you want, or maybe you can try selling them, and buy new ones with the money!",
      "description":""
    }
  ],
  "text":" Start from the top of the game. Never buy trading cards out of order. If you do, you will get confused. Always buy trading cards in the first order; for example: the first edition/season and the second edition/season then you go up and up. Decide if you want to open them. You may not want to open them because they can be worth some money and will be more valuable if you haven't opened them. Make sure you don't get them damaged - that will decrease their value by a lot. This will be a little hard, but Yu-Gi-Oh! trading cards are not expensive, so whatever age you are trying to collect trading cards this is for you. Find a special place to put your trading cards like a shoe box, your closet, a jewelry box, a scrap-book or a binder. You can get binders from game shops that are designed to hold trading cards. Put more valuable ones in sleeves to protect them from damage. Try to get Yu-Gi-Oh! cards every week or month, but stick to your budget! If you're young, make a deal with your parents about how much you can spend. Keep your cards neat and organized so they don't get mixed up. Have a system of sorting them. Most people sort by set number, which is a mix of letters and numbers that can be found at the bottom of the art and above the text. An example is SHVI-EN047. SHVI is the set, Shining Victories, EN is English language, and 47 is the number in the set list. Try to trade your spare cards for the ones you don't have or you want, or maybe you can try selling them, and buy new ones with the money! ",
  "tyn_model":[
    "cards",
    "trading cards",
    "yu-gi-oh!",
    "scrap-book",
    "binder",
    "binders"
  ],
  "tyn_section":[

  ]
}