{
  "title":"How to Cook Completely Non Dairy for a Day",
  "url":"https://www.wikihow.com/Cook-Completely-Non-Dairy-for-a-Day",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes"
  ],
  "methods":[
    {
      "name":"Breakfast: Banana smoothie and Blueberry Pancakes.",
      "steps":[
        {
          "headline":"Pour bananas in blender, then add strawberries.",
          "description":""
        },
        {
          "headline":"Blend while slowly adding water.",
          "description":""
        },
        {
          "headline":"Add ice cubes.",
          "description":""
        },
        {
          "headline":"In a medium-sized mixing bowl, mix together the flour, sugar, baking powder, and salt until well combined.",
          "description":"In another small bowl, whisk together the canola oil, vanilla extract and almond milk until well mixed, then add the wet ingredients to the dry, mixing until just combined. Let the mixture rest for 5 minutes."
        },
        {
          "headline":"Heat a lightly oiled skillet or griddle over medium-high heat.",
          "description":"Add the batter to the skillet, about 1/3 cup at a time, pressing a small amount of berries into the top of each pancake immediately after adding to the skillet. Once the underside is golden brown and bubbles have appeared on the surface, flip the pancakes and cook until the other side is golden brown and the cakes are light and fluffy. Repeat until all of the batter is used. Serve warm with berries, soy margarine and syrup."
        }
      ]
    },
    {
      "name":"Lunch:Dairy free pasta, peas and corn",
      "steps":[
        {
          "headline":"Bring a medium-to-large stock pot of salted water to a boil.",
          "description":""
        },
        {
          "headline":"Make the pesto.",
          "description":"In a blender, combine the basil, almond meal, ground cashews and garlic, and blend until creamy but not completely pureed."
        },
        {
          "headline":"Add the miso paste, vinegar and nutritional yeast and blend until just combined.",
          "description":""
        },
        {
          "headline":"In 2-3 additions, add the olive oil until mixture is just creamy (you may not need to use all of the oil).",
          "description":"Add salt to taste and set aside."
        },
        {
          "headline":"Add the pasta to the boiling water, and cook until al dente, about 7-10 minutes, or according to the manufacturer's instructions.",
          "description":""
        },
        {
          "headline":"Drain the pasta in a colander and toss with about half of the pesto.",
          "description":""
        },
        {
          "headline":"Portion the pasta onto individual plates and serve with the extra pesto in a dish at the table.",
          "description":""
        },
        {
          "headline":"Peas and corn can just be from the garden or frozen.",
          "description":"Cook any way you want."
        }
      ]
    },
    {
      "name":"Dinner: Baked vegetables in a garlic-tomato sauce.",
      "steps":[
        {
          "headline":"Chop the onions and garlic roughly and put in frying pan or saucepan.",
          "description":"This sauce gets 'whizzed' in a blender or with a hand-held blender. Your choice of cooking vessel will depend on which you possess. Frying pan for the former, deeper saucepan for the latter."
        },
        {
          "headline":"Add a glug of olive oil and start to cook on a low heat.",
          "description":""
        },
        {
          "headline":"Peel the carrot and chop finely.",
          "description":"Add to the pan."
        },
        {
          "headline":"Chop the mush and add to the above.",
          "description":"Cover and leave to fry. gently for a few minutes, stir every now and then so that it doesn't stick."
        },
        {
          "headline":"Slice the courgette and peppers and add to the mix.",
          "description":""
        },
        {
          "headline":"Add the dried or fresh herbs, stir round.",
          "description":""
        },
        {
          "headline":"Let it all fry / steam gently in the covered pan.",
          "description":""
        },
        {
          "headline":"Open the cans of tomatoes and chop the tomatoes into the pan.",
          "description":"Or use chopped tomatoes."
        },
        {
          "headline":"Stir round and add a good long squeeze of tomato puree, about 1-2 tbsp.",
          "description":""
        },
        {
          "headline":"Add 100ml of water (you may have to add more later), stir round, cover and leave to simmer gently for about 15 minutes or so.",
          "description":""
        },
        {
          "headline":"Add the Dijon mustard (if using) and about 2 tsps sugar (takes away the acid taste of the tomatoes).",
          "description":""
        },
        {
          "headline":"Taste.",
          "description":"Add salt and pepper if using, and more puree, more sugar as you see fit."
        },
        {
          "headline":"Put into blender and blend (you might need to add more water if too thick), or use the hand blender.",
          "description":"Keep the latter well submerged, unless you want a Jackson Pollock look to your splashback."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Breakfast: Banana smoothie and Blueberry Pancakes. Pour bananas in blender, then add strawberries.  Blend while slowly adding water.  Add ice cubes.  In a medium-sized mixing bowl, mix together the flour, sugar, baking powder, and salt until well combined. In another small bowl, whisk together the canola oil, vanilla extract and almond milk until well mixed, then add the wet ingredients to the dry, mixing until just combined. Let the mixture rest for 5 minutes. Heat a lightly oiled skillet or griddle over medium-high heat. Add the batter to the skillet, about 1/3 cup at a time, pressing a small amount of berries into the top of each pancake immediately after adding to the skillet. Once the underside is golden brown and bubbles have appeared on the surface, flip the pancakes and cook until the other side is golden brown and the cakes are light and fluffy. Repeat until all of the batter is used. Serve warm with berries, soy margarine and syrup. Lunch:Dairy free pasta, peas and corn Bring a medium-to-large stock pot of salted water to a boil.  Make the pesto. In a blender, combine the basil, almond meal, ground cashews and garlic, and blend until creamy but not completely pureed. Add the miso paste, vinegar and nutritional yeast and blend until just combined.  In 2-3 additions, add the olive oil until mixture is just creamy (you may not need to use all of the oil). Add salt to taste and set aside. Add the pasta to the boiling water, and cook until al dente, about 7-10 minutes, or according to the manufacturer's instructions.  Drain the pasta in a colander and toss with about half of the pesto.  Portion the pasta onto individual plates and serve with the extra pesto in a dish at the table.  Peas and corn can just be from the garden or frozen. Cook any way you want. Dinner: Baked vegetables in a garlic-tomato sauce. Chop the onions and garlic roughly and put in frying pan or saucepan. This sauce gets 'whizzed' in a blender or with a hand-held blender. Your choice of cooking vessel will depend on which you possess. Frying pan for the former, deeper saucepan for the latter. Add a glug of olive oil and start to cook on a low heat.  Peel the carrot and chop finely. Add to the pan. Chop the mush and add to the above. Cover and leave to fry. gently for a few minutes, stir every now and then so that it doesn't stick. Slice the courgette and peppers and add to the mix.  Add the dried or fresh herbs, stir round.  Let it all fry / steam gently in the covered pan.  Open the cans of tomatoes and chop the tomatoes into the pan. Or use chopped tomatoes. Stir round and add a good long squeeze of tomato puree, about 1-2 tbsp.  Add 100ml of water (you may have to add more later), stir round, cover and leave to simmer gently for about 15 minutes or so.  Add the Dijon mustard (if using) and about 2 tsps sugar (takes away the acid taste of the tomatoes).  Taste. Add salt and pepper if using, and more puree, more sugar as you see fit. Put into blender and blend (you might need to add more water if too thick), or use the hand blender. Keep the latter well submerged, unless you want a Jackson Pollock look to your splashback. Finished. ",
  "tyn_model":[
    "blender",
    "water",
    "tomatoes",
    "sugar",
    "salt",
    "skillet",
    "berries",
    "garlic",
    "olive oil",
    "frying pan",
    "saucepan",
    "banana smoothie",
    "blueberry pancakes",
    "bananas",
    "strawberries",
    "ice cubes",
    "medium-sized mixing bowl",
    "flour",
    "baking powder",
    "small bowl",
    "canola oil",
    "vanilla extract",
    "almond milk",
    "griddle",
    "soy margarine",
    "syrup",
    "medium-to-large stock pot",
    "salted water",
    "basil",
    "almond meal",
    "cashews",
    "miso paste",
    "vinegar",
    "nutritional yeast",
    "colander",
    "corn",
    "vegetables",
    "onions",
    "cooking vessel",
    "carrot",
    "courgette",
    "peppers",
    "herbs",
    "tomato puree",
    "dijon mustard",
    "pepper",
    "hand blender"
  ],
  "tyn_section":[

  ]
}