{
  "title":"How to Order In a Japanese Restaurant",
  "url":"https://www.wikihow.com/Order-In-a-Japanese-Restaurant",
  "category_hierarchy":[
    "Food and Entertaining",
    "Dining Out"
  ],
  "parts":[
    {
      "name":"Ordering Food",
      "steps":[
        {
          "headline":"Tell the host or hostess how many people are in your party.",
          "description":"When you enter the restaurant, the host or hostess will greet you by saying “irasshaimase,” which means “welcome.” Then, this person will likely ask you how many people are in your party by saying “Nan mei sama desu ka?” If you have four people, for example, answer “Yon mei desu.”\nFor three people, you can say “San nin desu.”\nIf you are eating alone, say “Hitori desu.”"
        },
        {
          "headline":"Ask for an English menu.",
          "description":"If you are worried about understanding a Japanese menu, it’s perfectly acceptable to ask if they have an English menu available. To ask for a menu in English, say “Eigo no menyuu ga arimasu ka?” Often, a Japanese restaurant that sees a lot of English speaking tourists will offer them to you without asking. If they don’t have one available, do your best to look up Japanese on a mobile device (if available) or work with what Japanese you know."
        },
        {
          "headline":"Ask about prices.",
          "description":"To do this, you say “Kore wa ikura desu ka?” This means \"How much does this cost?\" If you don’t want to ask, you can also learn some Japanese numbers to get an idea about price."
        },
        {
          "headline":"Learn numbers to understand what is written on the menu.",
          "description":"This isn’t absolutely necessary, but it is certainly helpful. Start with: ichi (一)=1; ni (二)=2; san (三)=3; shi/yon (四)=4; go (五)=5; roku (六)=6; shichi/nana (七)=7; hachi (八)=8; kyuu (九)=9; juu (十)=10; hyaku (百)=100; and sen (千)=1000. You put the numbers together like this: 19 is 10 + 9 so it is juu-kyuu (十九). 90 is 9 sets of 10 so it is kyuu-juu (九十). So 198 is hyaku-kyuu-juu-hachi (百九十八)."
        },
        {
          "headline":"Ask for more time to look at the menu.",
          "description":"The server may come over after a few minutes. If you are not yet ready to order, say “Mou sukoshi jikan wo itadakemasu ka?” This phrase means “Can I have a little more time?”"
        },
        {
          "headline":"Call over a staff member.",
          "description":"If the staff member hasn’t come over yet, you can hail the staff by calling, \"Onegaishimasu\" for please or \"Sumimasen,” which means “excuse me.” Many nicer restaurants also have a call button you can push to summon your waiter."
        },
        {
          "headline":"Order an individual item with a drink.",
          "description":"Ordering an individual item in Japanese is fairly simple. All you have to do is pair the name of the food or drink with the word “please.” For example, to ask for a tonkotsu ramen and a beer, say “tonkotsu ramen to bīru kudasai.” “Kudasai” means “please.”"
        },
        {
          "headline":"Order more than one item.",
          "description":"If you want more than one of a particular item, remember these words. Say (food or drink name) + wo + number using tsu + kudasai. For example, “Four waters please” is “Mizu wo yonku kudasai.” An example of the numbers ending is tsu is, hitotsu (one), futatsu (two), mittsu (three), and yottsu (four). If you want more than ten of something, specify using normal numbers—juichi, juni, jusan, etc."
        }
      ]
    },
    {
      "name":"Eating Your Meal",
      "steps":[
        {
          "headline":"Wait until everyone has received their drink.",
          "description":"It is polite to wait until everyone has received their drink to take a drink. When everyone has received their drink, say “kanpai!” This mean “cheers!” Now, everyone can enjoy their drinks."
        },
        {
          "headline":"Drink Japanese green tea or sake with your meal.",
          "description":"It's more authentic, and the Japanese might respect you more for trying to observe their customs while dining. If you do not like either drinks, it’s perfectly acceptable to drink water or something else with your meal."
        },
        {
          "headline":"Clean your hands before and during the meal.",
          "description":"Often, you will be given a wet towel before the meal. This towel is meant to be used to clean your hands before and throughout the meal. You can place it on the table away from the food when you are not using it."
        },
        {
          "headline":"Express gratitude before eating your meal.",
          "description":"It is customary to say “itadakimasu” before eating. Literally, this means \"I receive (this meal).” It is an expression of gratitude for the meal you have just received."
        },
        {
          "headline":"Tell them if what you ordered is okay.",
          "description":"When you have ordered and received your food, you may be asked “Daijoubu desu ka?” You were asked “Is everything ok?”  Answer “Hai” for “yes” and “Iie” for “no.”"
        },
        {
          "headline":"Use your chopsticks.",
          "description":"Typically, chopsticks are used in Japanese restaurants over utensils such as forks. If possible, use your chopsticks  with all of your food, except soup, which would be eaten with a spoon. It's okay to request a fork if you are uncomfortable using chopsticks. Don't stick your chopsticks upright in a bowl of rice. This is only done at funerals."
        }
      ]
    },
    {
      "name":"Finishing Your Meal",
      "steps":[
        {
          "headline":"Express pleasure at the end of your meal.",
          "description":"To express your pleasure at the end of the meal, say “Gochisousama deshita,” meaning \"It was a feast.\" You can also say “Oishikatta desu,” which means means \"It was tasty.\" This is polite, but not absolutely necessary."
        },
        {
          "headline":"Ask for the bill.",
          "description":"The server may bring over the bill, but if not, it’s okay to ask for it. To ask for, it say “Okaikei wo onegaishimasu.” This means “Please bring the bill.”"
        },
        {
          "headline":"Avoid tipping.",
          "description":"Do not tip the staff at the end of your meal. It is not a part of Japanese culture. It actually may be considered rude in some places to tip."
        },
        {
          "headline":"Thank the staff for your meal.",
          "description":"When leaving the restaurant, it’s polite to thank the staff for your meal. You can say “Arigato gozaimashita,” which is just past tense for “thank you.” Now, you have successfully made it through, and hopefully enjoyed, your experience at a Japanese restaurant!"
        }
      ]
    }
  ],
  "text":" Ordering Food Tell the host or hostess how many people are in your party. When you enter the restaurant, the host or hostess will greet you by saying “irasshaimase,” which means “welcome.” Then, this person will likely ask you how many people are in your party by saying “Nan mei sama desu ka?” If you have four people, for example, answer “Yon mei desu.”\nFor three people, you can say “San nin desu.”\nIf you are eating alone, say “Hitori desu.” Ask for an English menu. If you are worried about understanding a Japanese menu, it’s perfectly acceptable to ask if they have an English menu available. To ask for a menu in English, say “Eigo no menyuu ga arimasu ka?” Often, a Japanese restaurant that sees a lot of English speaking tourists will offer them to you without asking. If they don’t have one available, do your best to look up Japanese on a mobile device (if available) or work with what Japanese you know. Ask about prices. To do this, you say “Kore wa ikura desu ka?” This means \"How much does this cost?\" If you don’t want to ask, you can also learn some Japanese numbers to get an idea about price. Learn numbers to understand what is written on the menu. This isn’t absolutely necessary, but it is certainly helpful. Start with: ichi (一)=1; ni (二)=2; san (三)=3; shi/yon (四)=4; go (五)=5; roku (六)=6; shichi/nana (七)=7; hachi (八)=8; kyuu (九)=9; juu (十)=10; hyaku (百)=100; and sen (千)=1000. You put the numbers together like this: 19 is 10 + 9 so it is juu-kyuu (十九). 90 is 9 sets of 10 so it is kyuu-juu (九十). So 198 is hyaku-kyuu-juu-hachi (百九十八). Ask for more time to look at the menu. The server may come over after a few minutes. If you are not yet ready to order, say “Mou sukoshi jikan wo itadakemasu ka?” This phrase means “Can I have a little more time?” Call over a staff member. If the staff member hasn’t come over yet, you can hail the staff by calling, \"Onegaishimasu\" for please or \"Sumimasen,” which means “excuse me.” Many nicer restaurants also have a call button you can push to summon your waiter. Order an individual item with a drink. Ordering an individual item in Japanese is fairly simple. All you have to do is pair the name of the food or drink with the word “please.” For example, to ask for a tonkotsu ramen and a beer, say “tonkotsu ramen to bīru kudasai.” “Kudasai” means “please.” Order more than one item. If you want more than one of a particular item, remember these words. Say (food or drink name) + wo + number using tsu + kudasai. For example, “Four waters please” is “Mizu wo yonku kudasai.” An example of the numbers ending is tsu is, hitotsu (one), futatsu (two), mittsu (three), and yottsu (four). If you want more than ten of something, specify using normal numbers—juichi, juni, jusan, etc. Eating Your Meal Wait until everyone has received their drink. It is polite to wait until everyone has received their drink to take a drink. When everyone has received their drink, say “kanpai!” This mean “cheers!” Now, everyone can enjoy their drinks. Drink Japanese green tea or sake with your meal. It's more authentic, and the Japanese might respect you more for trying to observe their customs while dining. If you do not like either drinks, it’s perfectly acceptable to drink water or something else with your meal. Clean your hands before and during the meal. Often, you will be given a wet towel before the meal. This towel is meant to be used to clean your hands before and throughout the meal. You can place it on the table away from the food when you are not using it. Express gratitude before eating your meal. It is customary to say “itadakimasu” before eating. Literally, this means \"I receive (this meal).” It is an expression of gratitude for the meal you have just received. Tell them if what you ordered is okay. When you have ordered and received your food, you may be asked “Daijoubu desu ka?” You were asked “Is everything ok?”  Answer “Hai” for “yes” and “Iie” for “no.” Use your chopsticks. Typically, chopsticks are used in Japanese restaurants over utensils such as forks. If possible, use your chopsticks  with all of your food, except soup, which would be eaten with a spoon. It's okay to request a fork if you are uncomfortable using chopsticks. Don't stick your chopsticks upright in a bowl of rice. This is only done at funerals. Finishing Your Meal Express pleasure at the end of your meal. To express your pleasure at the end of the meal, say “Gochisousama deshita,” meaning \"It was a feast.\" You can also say “Oishikatta desu,” which means means \"It was tasty.\" This is polite, but not absolutely necessary. Ask for the bill. The server may bring over the bill, but if not, it’s okay to ask for it. To ask for, it say “Okaikei wo onegaishimasu.” This means “Please bring the bill.” Avoid tipping. Do not tip the staff at the end of your meal. It is not a part of Japanese culture. It actually may be considered rude in some places to tip. Thank the staff for your meal. When leaving the restaurant, it’s polite to thank the staff for your meal. You can say “Arigato gozaimashita,” which is just past tense for “thank you.” Now, you have successfully made it through, and hopefully enjoyed, your experience at a Japanese restaurant!",
  "tyn_model":[
    "chopsticks",
    "” which",
    "” this",
    "“please",
    "” for",
    "”\n",
    "” now",
    "towel",
    "“irasshaimase",
    "“welcome",
    "” then",
    "“nan",
    "” if",
    "“yon",
    "“san",
    "“hitori",
    "” ask",
    "“eigo",
    "” often",
    "“kore",
    "numbers",
    "sen",
    "十九)",
    "九十)",
    "百九十八)",
    "“mou",
    "“can",
    "” call",
    "“excuse",
    "” many",
    "beer",
    "“tonkotsu",
    "ramen",
    "” “",
    "” means",
    "” order",
    "“four",
    "waters",
    "” is",
    "“mizu",
    "” an",
    "tsu",
    "—juichi",
    "“kanpai",
    "“cheers",
    "green tea",
    "sake",
    "food",
    "“itadakimasu",
    "” before",
    "” it",
    "“daijoubu",
    "” you",
    "“is",
    "”  ",
    "“hai",
    "“yes",
    "” and",
    "“iie",
    "“no",
    "” use",
    "forks",
    "spoon",
    "fork",
    "bowl",
    "rice",
    "“gochisousama",
    "” meaning",
    "“oishikatta",
    "“okaikei",
    "” avoid",
    "“arigato",
    "“thank"
  ],
  "tyn_section":[

  ]
}