{
  "title":"How to Choose Raw Honey",
  "url":"https://www.wikihow.com/Choose-Raw-Honey",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Honey"
  ],
  "methods":[
    {
      "name":"Finding Raw Honey",
      "steps":[
        {
          "headline":"Know what “raw” honey really means.",
          "description":"Understand that truly raw honey has not been processed, filtered, or artificially heated in any way. This preserves its natural antioxidants, minerals, and enzymes, which can provide health benefits. However, be aware that laws and guidelines regarding labelling are very loose. Don’t assume that honey is 100% raw just because the labelling describes it as “raw,” “pure,” or “natural.”\nProcessing, filtering, and heating honey does strip away many of its nutrients. However, if you aren’t able to find truly raw honey, treated honey is still healthier than sugar and many other sweeteners."
        },
        {
          "headline":"Find local sources.",
          "description":"If possible, research and/or visit local bee farms. If the farms themselves are too far out of reach, visit sellers closer to home (such as farmers markets or natural food stores) who stock their product and deal with them directly. Either way, purchase your honey directly (or as directly as you can) from a nearby source, whose practices and trace-of-sale are more easily verified than a global company’s. Ensure that your honey is in fact 100% raw by speaking directly with the producers or as few middlemen as possible. Again, be wary of labelling when browsing honey in your grocery store. Due to relaxed regulations, honey that was imported from afar can still be labelled as “local honey” as long as it was repackaged locally."
        },
        {
          "headline":"Spot the difference.",
          "description":"Since you can’t always trust labeling, develop an eye to identify raw honey from treated honey. Expect honey that has been processed, filtered, and heated to appear “clean,” with little or no crystals or other visible particles suspended in the liquid. In contrast, expect raw honey to crystallize more readily than treated honey, resulting in a less smooth liquid. However:\nThis is less of a rule and more of a guideline. Any form of honey may crystallize or liquify over time, depending on its exposure to heat. Raw honey may appear by chance to be smooth liquid with little or no “impurities.”\nTreated honey is generally heated before packaging for aesthetic reasons, in order to attract customers who may be put off by crystallized honey’s lack of consistency. Treated honey is also filtered to remove elements (such as pollen) that customers may think of as impurities. Therefore, a honey that has crystallized and/or appears to contain “specks” is more likely to be raw."
        }
      ]
    },
    {
      "name":"Shopping for Flavor",
      "steps":[
        {
          "headline":"Taste for potency.",
          "description":"Expect the flavor of honey to vary in strength. For bold flavors, favor honey that appears dark in color. For a honey that won’t overpower other ingredients, choose a lighter shade. Flavor is, obviously, a matter of taste. However, consider using darker, bolder honeys to liven up relatively bland foods, like white toast or basic tea. Conversely, use lighter honeys when you only want to sweeten something without drastically altering how it tastes."
        },
        {
          "headline":"Sample different floral varieties.",
          "description":"Since bees feed on nectar produced by a variety of flowers, expect the flavor of honey to vary depending on which flower they fed on. Check the packaging’s label or ask the bee farm or seller to find out which type(s) of flowers were used for each product. If possible, ask for a taste test or buy small samples to find which kinds please you the most. Honeys come in both “monofloral” and “multifloral” varieties. Monofloral means that only one type of flower was used. Multifloral” or “floral blend” indicates that several were used."
        },
        {
          "headline":"Shop for “food grade” honey.",
          "description":"Be aware that, in addition to eating, honey is also marketed for medicinal uses. Learn which varieties are chiefly marketed as food and which are touted for exceptional medicinal properties, such as Manuka. Although there is little reason to not eat medicinal-grade honey just for the heck of it, expect these varieties to possibly cost more (perhaps prohibitively so, if you eat honey regularly)."
        }
      ]
    },
    {
      "name":"Understanding the Risks",
      "steps":[
        {
          "headline":"Be wary of medicinal claims.",
          "description":"As with raw honey’s labelling, realize that many of the claims regarding the health and medicinal benefits of eating raw honey are not necessarily supported by research. Although some uses have been generally proven to be beneficial and others show promise, keep in mind that the jury is still out on a great many of them. Always consult with your doctor about the known risks and benefits before treating yourself with raw honey. Credible uses include:\nUsing honey as a cough suppressant. Using Manuka honey as an antibacterial treatment on wounds."
        },
        {
          "headline":"Consider allergies.",
          "description":"Do not consume raw honey if you are allergic to bees, since honey that hasn’t been processed or filtered may contain body parts. Additionally, find out what sort of nectar the bees fed on. Understand that bees leave traces of pollen in honey. If you are allergic to specific types of pollen, avoid any raw honey that may contain traces of it. Although it is not common, be aware that you may suffer a severe allergic reactions to the pollen in raw honey. Symptoms to look out for include itching, hives, and swelling."
        },
        {
          "headline":"Only feed to children older than 12 months.",
          "description":"Do not feed honey (raw or otherwise) to anyone under one year of age. Be aware that honey may contain toxins that can cause botulism. Expect children under the age of one to be the most vulnerable."
        }
      ]
    }
  ],
  "text":" Finding Raw Honey Know what “raw” honey really means. Understand that truly raw honey has not been processed, filtered, or artificially heated in any way. This preserves its natural antioxidants, minerals, and enzymes, which can provide health benefits. However, be aware that laws and guidelines regarding labelling are very loose. Don’t assume that honey is 100% raw just because the labelling describes it as “raw,” “pure,” or “natural.”\nProcessing, filtering, and heating honey does strip away many of its nutrients. However, if you aren’t able to find truly raw honey, treated honey is still healthier than sugar and many other sweeteners. Find local sources. If possible, research and/or visit local bee farms. If the farms themselves are too far out of reach, visit sellers closer to home (such as farmers markets or natural food stores) who stock their product and deal with them directly. Either way, purchase your honey directly (or as directly as you can) from a nearby source, whose practices and trace-of-sale are more easily verified than a global company’s. Ensure that your honey is in fact 100% raw by speaking directly with the producers or as few middlemen as possible. Again, be wary of labelling when browsing honey in your grocery store. Due to relaxed regulations, honey that was imported from afar can still be labelled as “local honey” as long as it was repackaged locally. Spot the difference. Since you can’t always trust labeling, develop an eye to identify raw honey from treated honey. Expect honey that has been processed, filtered, and heated to appear “clean,” with little or no crystals or other visible particles suspended in the liquid. In contrast, expect raw honey to crystallize more readily than treated honey, resulting in a less smooth liquid. However:\nThis is less of a rule and more of a guideline. Any form of honey may crystallize or liquify over time, depending on its exposure to heat. Raw honey may appear by chance to be smooth liquid with little or no “impurities.”\nTreated honey is generally heated before packaging for aesthetic reasons, in order to attract customers who may be put off by crystallized honey’s lack of consistency. Treated honey is also filtered to remove elements (such as pollen) that customers may think of as impurities. Therefore, a honey that has crystallized and/or appears to contain “specks” is more likely to be raw. Shopping for Flavor Taste for potency. Expect the flavor of honey to vary in strength. For bold flavors, favor honey that appears dark in color. For a honey that won’t overpower other ingredients, choose a lighter shade. Flavor is, obviously, a matter of taste. However, consider using darker, bolder honeys to liven up relatively bland foods, like white toast or basic tea. Conversely, use lighter honeys when you only want to sweeten something without drastically altering how it tastes. Sample different floral varieties. Since bees feed on nectar produced by a variety of flowers, expect the flavor of honey to vary depending on which flower they fed on. Check the packaging’s label or ask the bee farm or seller to find out which type(s) of flowers were used for each product. If possible, ask for a taste test or buy small samples to find which kinds please you the most. Honeys come in both “monofloral” and “multifloral” varieties. Monofloral means that only one type of flower was used. Multifloral” or “floral blend” indicates that several were used. Shop for “food grade” honey. Be aware that, in addition to eating, honey is also marketed for medicinal uses. Learn which varieties are chiefly marketed as food and which are touted for exceptional medicinal properties, such as Manuka. Although there is little reason to not eat medicinal-grade honey just for the heck of it, expect these varieties to possibly cost more (perhaps prohibitively so, if you eat honey regularly). Understanding the Risks Be wary of medicinal claims. As with raw honey’s labelling, realize that many of the claims regarding the health and medicinal benefits of eating raw honey are not necessarily supported by research. Although some uses have been generally proven to be beneficial and others show promise, keep in mind that the jury is still out on a great many of them. Always consult with your doctor about the known risks and benefits before treating yourself with raw honey. Credible uses include:\nUsing honey as a cough suppressant. Using Manuka honey as an antibacterial treatment on wounds. Consider allergies. Do not consume raw honey if you are allergic to bees, since honey that hasn’t been processed or filtered may contain body parts. Additionally, find out what sort of nectar the bees fed on. Understand that bees leave traces of pollen in honey. If you are allergic to specific types of pollen, avoid any raw honey that may contain traces of it. Although it is not common, be aware that you may suffer a severe allergic reactions to the pollen in raw honey. Symptoms to look out for include itching, hives, and swelling. Only feed to children older than 12 months. Do not feed honey (raw or otherwise) to anyone under one year of age. Be aware that honey may contain toxins that can cause botulism. Expect children under the age of one to be the most vulnerable.",
  "tyn_model":[
    "honey",
    "honeys",
    "“raw",
    "” honey",
    "” or",
    "”\n",
    "bees",
    "” “",
    "“natural",
    "sugar",
    "natural food stores",
    "“local",
    "” as",
    "“clean",
    "” with",
    "“impurities",
    "“specks",
    "” is",
    "flowers",
    "“monofloral",
    "” and",
    "“multifloral",
    "” varieties",
    "“floral",
    "” indicates",
    "“food",
    "manuka honey"
  ],
  "tyn_section":[

  ]
}