{
  "title":"How to Play the Game Who Stole the Cookie from the Cookie Jar",
  "url":"https://www.wikihow.com/Play-the-Game-Who-Stole-the-Cookie-from-the-Cookie-Jar",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "steps":[
    {
      "headline":"Determine a cookie swiping has taken place.",
      "description":"Examine the cookie jar. Is there a cookie missing? Don’t speculate. If no cookies were stolen, you have no grounds to start this game. If a cookie was stolen, proceed to the next step. If you need a means to start the game, persuade a student to steal a cookie from the cookie jar. Or in an ironic twist, you, the teacher, steal the cookie from the cookie jar. Student will learn a valuable lesson on trusting authority."
    },
    {
      "headline":"Gather the suspects.",
      "description":"Most cookie thefts are committed by neighbors, loved ones, or more typically, students in the classroom. Call them into a single large room. Do not play this game outside! Nervous small children may run away once realizing their cookie swiping is public knowledge. Little children are especially hard to catch when filled with cookies."
    },
    {
      "headline":"Pose the question.",
      "description":"Sit everyone down (a circle formation is recommended). Then ask in a firm and unwavering tone, “Who stole the cookie from the cookie jar?” Have group chant this to create a sense of unity and/or mob mentality."
    },
    {
      "headline":"The Accusation.",
      "description":"Indict a person. Say, “(STUDENT’S NAME) stole the cookie from the cookie jar.” Do not stumble. Do not stutter. Speak clearly. The Defense. The accused will say “Who me? Couldn’t be.”\nThe Million Dollar Question. Ask, as a group, “Then who?”\nThe Newly Accused. The accused will pass the blame. They will say “(DIFFERENT STUDENT) stole the cookie from the cookie jar. The Cycle. Repeat step 4 through 8 until cookie thief is discovered or all parties are absolved of the crime. Laugh. Be a role model that teaches forgiveness and tolerance; absolve the convicted of their felonious cookie deed. Give cookies to all the students. Teach the simple and delightful pleasure of cookies."
    }
  ],
  "text":" Determine a cookie swiping has taken place. Examine the cookie jar. Is there a cookie missing? Don’t speculate. If no cookies were stolen, you have no grounds to start this game. If a cookie was stolen, proceed to the next step. If you need a means to start the game, persuade a student to steal a cookie from the cookie jar. Or in an ironic twist, you, the teacher, steal the cookie from the cookie jar. Student will learn a valuable lesson on trusting authority. Gather the suspects. Most cookie thefts are committed by neighbors, loved ones, or more typically, students in the classroom. Call them into a single large room. Do not play this game outside! Nervous small children may run away once realizing their cookie swiping is public knowledge. Little children are especially hard to catch when filled with cookies. Pose the question. Sit everyone down (a circle formation is recommended). Then ask in a firm and unwavering tone, “Who stole the cookie from the cookie jar?” Have group chant this to create a sense of unity and/or mob mentality. The Accusation. Indict a person. Say, “(STUDENT’S NAME) stole the cookie from the cookie jar.” Do not stumble. Do not stutter. Speak clearly. The Defense. The accused will say “Who me? Couldn’t be.”\nThe Million Dollar Question. Ask, as a group, “Then who?”\nThe Newly Accused. The accused will pass the blame. They will say “(DIFFERENT STUDENT) stole the cookie from the cookie jar. The Cycle. Repeat step 4 through 8 until cookie thief is discovered or all parties are absolved of the crime. Laugh. Be a role model that teaches forgiveness and tolerance; absolve the convicted of their felonious cookie deed. Give cookies to all the students. Teach the simple and delightful pleasure of cookies.",
  "tyn_model":[
    "cookie jar",
    "cookies",
    "“who",
    "“(",
    "”\n",
    "cookie",
    "” have",
    "” do",
    "“then"
  ],
  "tyn_section":[

  ]
}