{
  "title":"How to Make a Ristretto (Espresso Coffee)",
  "url":"https://www.wikihow.com/Make-a-Ristretto-(Espresso-Coffee)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Espresso Based Coffee"
  ],
  "parts":[
    {
      "name":"Preparing the Ristretto",
      "steps":[
        {
          "headline":"Choose your coffee beans.",
          "description":"You can choose beans that you would use for an espresso, such as an Arabica or Robusta bean. An Arabica bean will be sweeter with hints of berries and a higher acidity. The Robusta has a stronger, nuttier taste and contains more caffeine than the Arabica. Check out local coffee beans for new and different kinds of Arabica or Robusta beans."
        },
        {
          "headline":"Acquire a high quality grinder with a burr.",
          "description":"Purchase a burr grinder that grinds the beans between two abrasive surfaces. This will result in more consistent and fine grounds. If your grounds are not consistent, this may lead to some going through the filter and into your ristretto. Chances are the grinder you already have is one with a blade that’s for brewing a regular cup of coffee, so double check before you throw the beans in there."
        },
        {
          "headline":"Grind your coffee beans finely.",
          "description":"You should grind your coffee beans more finely than for an espresso. A finer grind will cause less water to flow through the beans, which results in a less bitter taste."
        },
        {
          "headline":"Locate an espresso machine.",
          "description":"An espresso machine is necessary to make a ristretto so you’ll need to get one if you don’t already have one. Ask a friend who has an espresso machine if you can come over and make them a new type of coffee if you don’t have one."
        },
        {
          "headline":"Choose an espresso cup.",
          "description":"Most ristrettos are served in espresso cups, so make sure you have one handy! They’re usually about the size of a shot glass and are either glass or ceramic. Some espresso cups have handles and some don’t, so choose whichever kind appeals to you most."
        }
      ]
    },
    {
      "name":"Pulling the Ristretto",
      "steps":[
        {
          "headline":"Fill the espresso machine’s reservoir with cold, filtered water.",
          "description":"Using cold, filtered water matters! Unfiltered water won’t taste good, distilled water can ruin your machine, and hard water can accumulate lime in your machine."
        },
        {
          "headline":"Let your water heat up.",
          "description":"Turn on your espresso maker by pressing the power button and let the water heat up, which could take anywhere from a few minutes to 45 minutes. Many espresso machines will have a light that turns from red to green to signal that the water is heated."
        },
        {
          "headline":"Place 14 grams of the ground coffee in the filter.",
          "description":"Using about 14 grams of ground coffee is the amount your espresso machine needs to produce a single cup of strong ristretto."
        },
        {
          "headline":"Tamp the coffee in the filter.",
          "description":"You should tamp, or pack down, the coffee in the filter as you would do in an espresso. Tamping will get rid of spaces between coffee grinds. If you didn’t grind your coffee very finely, you should tamp down your coffee more firmly to allow less space between the grinds."
        },
        {
          "headline":"Return the filter to the machine.",
          "description":"Put the filter back into the machine by sliding it into place and then turning it towards your right to lock it into position. Get ready to brew! The filter isn’t hidden under a cover like it is in normal coffee machines. Instead, it slides into a cylindrical mechanism in the middle of the espresso machine."
        },
        {
          "headline":"Brew for 15 seconds.",
          "description":"To turn on the water flow, most espresso machines have a knob that you have to twist on. You should only pull water through the beans for 15 seconds. This will result in a less acidic and fuller taste. You should end up with about 0.5oz (~15mL) of coffee."
        }
      ]
    }
  ],
  "text":" Preparing the Ristretto Choose your coffee beans. You can choose beans that you would use for an espresso, such as an Arabica or Robusta bean. An Arabica bean will be sweeter with hints of berries and a higher acidity. The Robusta has a stronger, nuttier taste and contains more caffeine than the Arabica. Check out local coffee beans for new and different kinds of Arabica or Robusta beans. Acquire a high quality grinder with a burr. Purchase a burr grinder that grinds the beans between two abrasive surfaces. This will result in more consistent and fine grounds. If your grounds are not consistent, this may lead to some going through the filter and into your ristretto. Chances are the grinder you already have is one with a blade that’s for brewing a regular cup of coffee, so double check before you throw the beans in there. Grind your coffee beans finely. You should grind your coffee beans more finely than for an espresso. A finer grind will cause less water to flow through the beans, which results in a less bitter taste. Locate an espresso machine. An espresso machine is necessary to make a ristretto so you’ll need to get one if you don’t already have one. Ask a friend who has an espresso machine if you can come over and make them a new type of coffee if you don’t have one. Choose an espresso cup. Most ristrettos are served in espresso cups, so make sure you have one handy! They’re usually about the size of a shot glass and are either glass or ceramic. Some espresso cups have handles and some don’t, so choose whichever kind appeals to you most. Pulling the Ristretto Fill the espresso machine’s reservoir with cold, filtered water. Using cold, filtered water matters! Unfiltered water won’t taste good, distilled water can ruin your machine, and hard water can accumulate lime in your machine. Let your water heat up. Turn on your espresso maker by pressing the power button and let the water heat up, which could take anywhere from a few minutes to 45 minutes. Many espresso machines will have a light that turns from red to green to signal that the water is heated. Place 14 grams of the ground coffee in the filter. Using about 14 grams of ground coffee is the amount your espresso machine needs to produce a single cup of strong ristretto. Tamp the coffee in the filter. You should tamp, or pack down, the coffee in the filter as you would do in an espresso. Tamping will get rid of spaces between coffee grinds. If you didn’t grind your coffee very finely, you should tamp down your coffee more firmly to allow less space between the grinds. Return the filter to the machine. Put the filter back into the machine by sliding it into place and then turning it towards your right to lock it into position. Get ready to brew! The filter isn’t hidden under a cover like it is in normal coffee machines. Instead, it slides into a cylindrical mechanism in the middle of the espresso machine. Brew for 15 seconds. To turn on the water flow, most espresso machines have a knob that you have to twist on. You should only pull water through the beans for 15 seconds. This will result in a less acidic and fuller taste. You should end up with about 0.5oz (~15mL) of coffee.",
  "tyn_model":[
    "water",
    "espresso machine",
    "coffee beans",
    "filter",
    "grinder",
    "espresso cups",
    "burr",
    "burr grinder",
    "espresso cup",
    "shot glass",
    "espresso machines"
  ],
  "tyn_section":[

  ]
}