{
  "title":"How to Get Amaryllis to Rebloom",
  "url":"https://www.wikihow.com/Get-Amaryllis-to-Rebloom",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "parts":[
    {
      "name":"Caring for Amaryllis after the Old Bloom Dies",
      "steps":[
        {
          "headline":"Remove each flower as it fades.",
          "description":"Once a flower has faded, cut the flower where it meets the main stalk with a clean knife or scissors. Make sure to remove the green lump and thin green stem attaching the flower to the stalk. This prevents the plant from producing seeds, which requires a lot of energy that could be going into survival and growth instead. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaggie Moran\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHorticulturist\t\t\t\t\t\t\t\tMaggie Moran is a Professional Gardener in Pennsylvania. Maggie Moran\t\t\tHorticulturist\t\t\t\tExpect blooms to last a few weeks. Horticulturalist Maggie Moran says, “The bloom typically lasts about 3 weeks for amaryllis, though the blooming period may be slightly longer or shorter depending on the growing conditions and health of the plant.”"
        },
        {
          "headline":"Cut the flower stalks once they yellow or sag.",
          "description":"The main stalks contain food and water the plant can use, but they will likely begin to droop or turn yellow shortly after the flowers fade. They are no longer useful at this point, and should be cut back to within 2 inches (5 cm) of the bulb. Be careful not to cut the leaves or the top of the bulb. Only the flower stalks should be removed. Do not be alarmed if sap runs out of the cut. This is normal for a well-watered plant."
        },
        {
          "headline":"Move the amaryllis to an area with bright indirect light.",
          "description":"Most people with amaryllis plants keep them indoors while they bloom in winter. If this is the case, move the plant to a windowsill with indirect sunlight to let it adjust to increased sunlight. Pick a spot that is bright and receives lots of sunlight, but not by direct exposure. You may skip this step if the plant was already exposed to indirect or full sunlight. In the northern hemisphere, north and east facing windows receive indirect sunlight. In the southern hemisphere, south and east facing windows do. Make sure to keep the plant relatively cool, too, at about room temperature. This is around or slightly warmer than 60 degrees F."
        },
        {
          "headline":"Water the soil whenever it begins to dry.",
          "description":"Your amaryllis will likely require daily watering unless kept in a humid environment or planted outside in moist soil. Don't let the soil dry out completely, at least not for longer than a few hours. You’ll want to keep the soil just slightly moist at all times. After growth begins, also fertilize the plant with a half-strength, water-soluble fertilizer every two or three weeks."
        },
        {
          "headline":"Continue on to the summer section as soon as the weather becomes warm.",
          "description":"Depending on your local climate, this typically begins in May or June in the northern hemisphere. In the southern hemisphere, warm weather usually begins in December or January."
        }
      ]
    },
    {
      "name":"Caring for Amaryllis in Summer",
      "steps":[
        {
          "headline":"Once summer is underway, plant the container outside.",
          "description":"Once the last frost has passed and the weather is consistently warm, plant the container outside in a flower bed or garden. Bury it so the rim is at or just above the surface. Select a location that receives full morning light if possible, but is protected from sun during the hottest part of the day. Amaryllis plants grow better in containers, which also protect against burrowing animals and insects. Growing them directly in the soil is possible, but will be more difficult. The leaves may flop over when the plant is first moved outside, but with proper care new, more upright leaves should grow."
        },
        {
          "headline":"Continue to water regularly.",
          "description":"Check the soil daily and water whenever it is dry or almost dry. Water the soil around the plant, not the leaves or bulb. Avoid watering any plants during the hottest part of the day, since the hot water can burn the plant. Keep the soil moist, not soaked. If your soil does not drain properly, the pooling water could rot the roots."
        },
        {
          "headline":"Fertilizer once every two weeks.",
          "description":"Make the bulb strong and healthy by applying a balanced fertilizer to the soil every two weeks. Use a soluble houseplant fertilizer and apply according to instructions. Do not apply more than instructed. You should see the plant grow new, darker leaves throughout the summer."
        },
        {
          "headline":"Continue on to the autumn section when weather cools or the leaves change color.",
          "description":"If the leaves begin to turn yellow, which is normal, the plant is entering its dormant period. This typically occurs in early autumn. Expect this change in August or September if you live in the northern hemisphere, or March or April if you live in the southern hemisphere."
        }
      ]
    },
    {
      "name":"Caring for an Amaryllis in Autumn",
      "steps":[
        {
          "headline":"Reduce watering gradually as the leaves die.",
          "description":"The amaryllis should lose its foliage as the summer ends and autumn begins. When this begins to happen, start giving the plant slightly smaller quantities of water, but do not allow the soil to dry out completely."
        },
        {
          "headline":"Remove the dead leaves.",
          "description":"Trim the yellow or brown leaves once they have withered by cutting them off next to the neck of the bulb. Allow living green leaves to remain on the plant."
        },
        {
          "headline":"Bring the plant to a cool indoor area.",
          "description":"Once the weather is cooler and most of the leaves have died, bring the amaryllis indoors. Place the pot in a cool, dark area between 40 and 50ºF (5–10ºC), such as a basement. If you do not have a suitable area for a pot, you may carefully remove the bulb and roots from the soil and place it in the crisper (vegetable drawer) of a refrigerator. Always bring the amaryllis in before the first frost, which typically occurs at 32ºF or 0ºC night temperature. If storing in your refrigerator, do not store fruit in your refrigerator at the same time. Many fruits, especially apples, release chemicals that can sterilize your amaryllis bulb."
        },
        {
          "headline":"Leave the bulb alone for 6–8 weeks.",
          "description":"Leave the amaryllis in the cool, dark environment for at least six weeks. Do not water it during this time, but do remove any remaining leaves as they die. This is the bulb's dormant period, and the plant must experience this in order to bloom again."
        },
        {
          "headline":"Move on to the next section after 6–8 weeks.",
          "description":"If you want the amaryllis to rebloom by a particular date, such as Christmas, remove the bulb from the cool area at least six weeks before that day."
        }
      ]
    },
    {
      "name":"Preparing for the New Bloom",
      "steps":[
        {
          "headline":"Test to see if the bulb is rotted.",
          "description":"Reach under the soil surface and gently squeeze the bulb. If the bulb is soft, it may have rotted and become unusable. If you are not certain, you may wish to attempt to rebloom the bulb anyway, but acquire a backup amaryllis as well in case the original bulb dies."
        },
        {
          "headline":"Replace some or all of the soil.",
          "description":"Like most plants, amaryllis plants grow better in certain types of soil, and over a period of 1–3 years they may remove the nutrients from their soil. While it is not difficult to get an amaryllis to rebloom, you may have a larger, healthier plant if you use a special potting mix. Amaryllis roots are easily harmed during transplanting, so if you are not used to transplanting flowers you may wish to replace the top 1/2 inch (1.25 cm) of soil instead. The best soil for amaryllis consists of two parts loamy soil, without much sand or clay; one part perlite or gravel; and one part organic matter such as rotted manure, peat, leaf mold, or composted bark. A clay pot might be better than a plastic one, since the amaryllis can become top-heavy and tip a lightweight pot over. If you are replanting the amaryllis in your garden, remove any dead leaves and peel off the bulb sheaths. Place the plant in the soil with the bulb shoulders exposed, and give it a drink of water. This will help “wake” the amaryllis up."
        },
        {
          "headline":"Water the soil thoroughly if you repotted it.",
          "description":"If you transplanted the bulb into a new pot, you should water the soil thoroughly and allow the excess to drain through the base of the pot. Following the initial watering, you should keep the soil damp, but not soaked, as in the summer or autumn."
        },
        {
          "headline":"Keep the plant in a relatively warmer location.",
          "description":"The ideal temperature for forcing an amaryllis to flower is between 55 and 65ºF (13–18ºC). Moving the plant into a a warmer location will encourage growth, though too much warmth may lead to weak or floppy growth. Cooler temperatures may prevent or slow growth."
        },
        {
          "headline":"Wait for the plant to flower.",
          "description":"While a new amaryllis plant usually grows a flower before leaves, you may see these appear in either order when it reblooms. Keep the soil damp, but not soaked, and expect your new flower or flowers approximately six weeks after you moved it to warmer area."
        }
      ]
    }
  ],
  "text":" Caring for Amaryllis after the Old Bloom Dies Remove each flower as it fades. Once a flower has faded, cut the flower where it meets the main stalk with a clean knife or scissors. Make sure to remove the green lump and thin green stem attaching the flower to the stalk. This prevents the plant from producing seeds, which requires a lot of energy that could be going into survival and growth instead. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaggie Moran\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHorticulturist\t\t\t\t\t\t\t\tMaggie Moran is a Professional Gardener in Pennsylvania. Maggie Moran\t\t\tHorticulturist\t\t\t\tExpect blooms to last a few weeks. Horticulturalist Maggie Moran says, “The bloom typically lasts about 3 weeks for amaryllis, though the blooming period may be slightly longer or shorter depending on the growing conditions and health of the plant.” Cut the flower stalks once they yellow or sag. The main stalks contain food and water the plant can use, but they will likely begin to droop or turn yellow shortly after the flowers fade. They are no longer useful at this point, and should be cut back to within 2 inches (5 cm) of the bulb. Be careful not to cut the leaves or the top of the bulb. Only the flower stalks should be removed. Do not be alarmed if sap runs out of the cut. This is normal for a well-watered plant. Move the amaryllis to an area with bright indirect light. Most people with amaryllis plants keep them indoors while they bloom in winter. If this is the case, move the plant to a windowsill with indirect sunlight to let it adjust to increased sunlight. Pick a spot that is bright and receives lots of sunlight, but not by direct exposure. You may skip this step if the plant was already exposed to indirect or full sunlight. In the northern hemisphere, north and east facing windows receive indirect sunlight. In the southern hemisphere, south and east facing windows do. Make sure to keep the plant relatively cool, too, at about room temperature. This is around or slightly warmer than 60 degrees F. Water the soil whenever it begins to dry. Your amaryllis will likely require daily watering unless kept in a humid environment or planted outside in moist soil. Don't let the soil dry out completely, at least not for longer than a few hours. You’ll want to keep the soil just slightly moist at all times. After growth begins, also fertilize the plant with a half-strength, water-soluble fertilizer every two or three weeks. Continue on to the summer section as soon as the weather becomes warm. Depending on your local climate, this typically begins in May or June in the northern hemisphere. In the southern hemisphere, warm weather usually begins in December or January. Caring for Amaryllis in Summer Once summer is underway, plant the container outside. Once the last frost has passed and the weather is consistently warm, plant the container outside in a flower bed or garden. Bury it so the rim is at or just above the surface. Select a location that receives full morning light if possible, but is protected from sun during the hottest part of the day. Amaryllis plants grow better in containers, which also protect against burrowing animals and insects. Growing them directly in the soil is possible, but will be more difficult. The leaves may flop over when the plant is first moved outside, but with proper care new, more upright leaves should grow. Continue to water regularly. Check the soil daily and water whenever it is dry or almost dry. Water the soil around the plant, not the leaves or bulb. Avoid watering any plants during the hottest part of the day, since the hot water can burn the plant. Keep the soil moist, not soaked. If your soil does not drain properly, the pooling water could rot the roots. Fertilizer once every two weeks. Make the bulb strong and healthy by applying a balanced fertilizer to the soil every two weeks. Use a soluble houseplant fertilizer and apply according to instructions. Do not apply more than instructed. You should see the plant grow new, darker leaves throughout the summer. Continue on to the autumn section when weather cools or the leaves change color. If the leaves begin to turn yellow, which is normal, the plant is entering its dormant period. This typically occurs in early autumn. Expect this change in August or September if you live in the northern hemisphere, or March or April if you live in the southern hemisphere. Caring for an Amaryllis in Autumn Reduce watering gradually as the leaves die. The amaryllis should lose its foliage as the summer ends and autumn begins. When this begins to happen, start giving the plant slightly smaller quantities of water, but do not allow the soil to dry out completely. Remove the dead leaves. Trim the yellow or brown leaves once they have withered by cutting them off next to the neck of the bulb. Allow living green leaves to remain on the plant. Bring the plant to a cool indoor area. Once the weather is cooler and most of the leaves have died, bring the amaryllis indoors. Place the pot in a cool, dark area between 40 and 50ºF (5–10ºC), such as a basement. If you do not have a suitable area for a pot, you may carefully remove the bulb and roots from the soil and place it in the crisper (vegetable drawer) of a refrigerator. Always bring the amaryllis in before the first frost, which typically occurs at 32ºF or 0ºC night temperature. If storing in your refrigerator, do not store fruit in your refrigerator at the same time. Many fruits, especially apples, release chemicals that can sterilize your amaryllis bulb. Leave the bulb alone for 6–8 weeks. Leave the amaryllis in the cool, dark environment for at least six weeks. Do not water it during this time, but do remove any remaining leaves as they die. This is the bulb's dormant period, and the plant must experience this in order to bloom again. Move on to the next section after 6–8 weeks. If you want the amaryllis to rebloom by a particular date, such as Christmas, remove the bulb from the cool area at least six weeks before that day. Preparing for the New Bloom Test to see if the bulb is rotted. Reach under the soil surface and gently squeeze the bulb. If the bulb is soft, it may have rotted and become unusable. If you are not certain, you may wish to attempt to rebloom the bulb anyway, but acquire a backup amaryllis as well in case the original bulb dies. Replace some or all of the soil. Like most plants, amaryllis plants grow better in certain types of soil, and over a period of 1–3 years they may remove the nutrients from their soil. While it is not difficult to get an amaryllis to rebloom, you may have a larger, healthier plant if you use a special potting mix. Amaryllis roots are easily harmed during transplanting, so if you are not used to transplanting flowers you may wish to replace the top 1/2 inch (1.25 cm) of soil instead. The best soil for amaryllis consists of two parts loamy soil, without much sand or clay; one part perlite or gravel; and one part organic matter such as rotted manure, peat, leaf mold, or composted bark. A clay pot might be better than a plastic one, since the amaryllis can become top-heavy and tip a lightweight pot over. If you are replanting the amaryllis in your garden, remove any dead leaves and peel off the bulb sheaths. Place the plant in the soil with the bulb shoulders exposed, and give it a drink of water. This will help “wake” the amaryllis up. Water the soil thoroughly if you repotted it. If you transplanted the bulb into a new pot, you should water the soil thoroughly and allow the excess to drain through the base of the pot. Following the initial watering, you should keep the soil damp, but not soaked, as in the summer or autumn. Keep the plant in a relatively warmer location. The ideal temperature for forcing an amaryllis to flower is between 55 and 65ºF (13–18ºC). Moving the plant into a a warmer location will encourage growth, though too much warmth may lead to weak or floppy growth. Cooler temperatures may prevent or slow growth. Wait for the plant to flower. While a new amaryllis plant usually grows a flower before leaves, you may see these appear in either order when it reblooms. Keep the soil damp, but not soaked, and expect your new flower or flowers approximately six weeks after you moved it to warmer area.",
  "tyn_model":[
    "amaryllis",
    "water",
    "amaryllis plants",
    "fertilizer",
    "pot",
    "container",
    "refrigerator",
    "knife",
    "scissors",
    "gardener",
    "horticulturalist",
    "“the",
    "” cut",
    "flower bed",
    "containers",
    "houseplant fertilizer",
    "vegetable drawer",
    "fruit",
    "fruits",
    "apples",
    "potting mix",
    "soil",
    "“wake",
    "” the",
    "amaryllis plant"
  ],
  "tyn_section":[

  ]
}