{
  "title":"How to Brighten Up a Rental Home",
  "url":"https://www.wikihow.com/Brighten-Up-a-Rental-Home",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating"
  ],
  "methods":[
    {
      "name":"Enhancing Lighting",
      "steps":[
        {
          "headline":"Space out lights.",
          "description":"If you have additional lamps to add to your rental property, or if the property came partially furnished, spacing out lighting can go a long way to brightening the place up. If you have all your lighting concentrated in a single room, this can make the rest of the home dim. Keep lamps on opposite sides of the room so everything is brightened. Avoid keeping all your lamps in one room. Make sure there are lamps in the living room, kitchen, and hallways."
        },
        {
          "headline":"Switch out the lightbulbs.",
          "description":"Oftentimes, the lightbulbs in place in a rental are not that bright. Simply switching out all the lightbulbs can do wonders to keep your living space bright. Stop by a local department or grocery store and purchase lightbulbs with higher wattage. Replace all the lightbulbs in your rental unit with brighter ones when you get home. You will see a noticeable difference in brightness. For the brightest bulbs, go for LED bulbs. They tend to be the brightest and longest lasting bulbs. They range in wattage, so opt for higher wattage over lower wattage. There is no precise wattage that is recommended, and it depends on personal preference, but in general a higher wattage will produce a brighter light. Lightbulbs generally range from 15 to 150 watts."
        },
        {
          "headline":"Enhance natural light with the right drapes.",
          "description":"Drapes can block out natural light. Dark colored drapes can also make rooms look darker. Swapping out dark drapes for brightly colored ones can make a huge difference in your home's brightness. You can get cheap, light colored blinds at a store like Ikea. Use these blinds to cover up dull beige or off-white blinds. You can also ask your landlord if you can temporarily uninstall blinds in your unit. This way, you can replace dull blinds altogether."
        },
        {
          "headline":"Use battery operated lights.",
          "description":"You can install small lamps or lights that you can attach to your walls. These lights are usually battery operated, and some come with adhesives that allow you to simply attach them to the wall. You can add these lamps to corners that get dark easily. They work great in kitchens, as you can put them near the stove or in pantries. You can also place battery operated lights on your walls, so you can have a light hanging over a dark room."
        },
        {
          "headline":"Add lamps.",
          "description":"Lamps are a great addition to a darker apartment. You can buy lamps fairly cheap if you go to a store like Ikea or search for lamps in a thrift store. You can buy standing lamps, or lamps you can place on counters and night stands. A lamp on, say, a nightstand in the bedroom or a end table on the sofa can make for a great reading space."
        },
        {
          "headline":"Use string lighting.",
          "description":"If you want as much floor space as possible, buy string lighting. Christmas lights can be strung up on your walls, allowing you to brighten your home without adding extra clutter. It may be particularly cheap to look for string lighting just after the holiday season."
        }
      ]
    },
    {
      "name":"Decorating Effectively",
      "steps":[
        {
          "headline":"Add rugs.",
          "description":"Many rental homes have dull carpeting or floors. This can make the whole room look darker. A few colorful rugs can cover up a dull floor, brightening up the room. Some floor rugs can be quite pricey. However, there are ways to cut down on cost. Shop at secondhand stores or discount department stores. You may also be able to find fairly cheap rugs at larger retail stores."
        },
        {
          "headline":"Add functional décor.",
          "description":"If you're in a smaller rental space, adding additional decoration may add clutter. You also may not want to spend a lot of money buying brightly colored decorations to lighten up a room. However, colorful objects you use regularly can be displayed decoratively when not in use. If you have colorful dishes, set them out in a cabinet in your kitchen. This can brighten up the kitchen and, when necessary, you can simply grab a dish out of the cabinet to use. Toiletries that come in fancy containers, such as a nice perfume, can be set out in your bathroom for decoration. If you have vases, put them out when they're empty. A nice white vase can brighten up the room and, in the event you need to use it, it will already be sitting out."
        },
        {
          "headline":"Add fresh flowers and plants.",
          "description":"You can buy flowers and plants at a local greenhouse. As long as you water and care for them, plants can brighten up your home for quite awhile. Some brightly colored flowers or nice green plants set out around your home can make everything look a little brighter. If space is an issue, you can hang plants from the ceiling rather than taking up floor space. Plants that produce vines, such as philodendron and heartleaf, do not require a lot of light to thrive. Parlor palms, Boston furs, corn plants, and prayer plants also require little light."
        },
        {
          "headline":"Position mirrors strategically to increase lighting.",
          "description":"Mirrors can make great decorations. When set in the right place, they reflect lighting and increase the brightness in your room. Stop by a local furniture store, supermarket, or retail show and buy a few attractive mirrors for your home. Place mirrors in front of lights. They can reflect lights back into the room, doubling the effect. Mirrors are a great idea if you don't have a lot of floor space for extra lamps."
        },
        {
          "headline":"Put artwork and photographs on display.",
          "description":"Colorful artwork and photographs can easily brighten up a dull white or beige wall. If you don't have any artwork on hand, look into secondhand shops and local art shows. Buy a few colorful paintings or other pieces of art and pin them up on your wall. If a lot of your photos are still on your phone or camera, many chain drug stores have photo stations where you can print out pictures. If you're nailing anything to the wall, make sure the lease allows you to make holes in  your dry wall."
        },
        {
          "headline":"Try removable wallpaper.",
          "description":"You usually cannot paint over walls, or put up wallpaper. However, you can order removable wallpaper online or buy some at a local craft store. You can easily place strips of removable wallpaper on dull white or beige walls. This will brighten up your apartment without breaking the lease. When you're ready to move out, the wallpaper is easy to remove."
        }
      ]
    },
    {
      "name":"Brightening Up With Furniture",
      "steps":[
        {
          "headline":"Paint old furniture in brighter shades.",
          "description":"If you have older pieces of furniture, such as furniture you got at a local thrift store, try painting it. A dull wooden chair can be painted a bright, pastel color to brighten up your apartment. The black legs on a dully colored couch can also be painted in bright colors. If you really want to get creative, try adding designs to furniture. You can apply a stencil to a chair or stool, for example."
        },
        {
          "headline":"Go for glass furniture.",
          "description":"If you can find affordable glass furniture, this can really brighten up a dully colored room. A glass coffee table, end table, or kitchen table can really add some light to your space. In addition to this, you'll be able to see the floor though the glass. This can make your space look less cluttered."
        },
        {
          "headline":"Cover ugly countertops.",
          "description":"In rental kitchens, your counters may be darker colored. This can make your whole kitchen look dull. Place decorate plates or trays on countertops. You can also try an attractive cutting board made of light colored wood."
        },
        {
          "headline":"Position furniture in a way that doesn't block out light.",
          "description":"Be careful when arranging a rental space. Where you put your furniture can make a huge impact on lighting. Try to keep chairs, sofas, and other items of furniture away from windows. Experiment a little as you set out furniture. Tweak your set up quite a few times until you get the right look."
        }
      ]
    }
  ],
  "text":" Enhancing Lighting Space out lights. If you have additional lamps to add to your rental property, or if the property came partially furnished, spacing out lighting can go a long way to brightening the place up. If you have all your lighting concentrated in a single room, this can make the rest of the home dim. Keep lamps on opposite sides of the room so everything is brightened. Avoid keeping all your lamps in one room. Make sure there are lamps in the living room, kitchen, and hallways. Switch out the lightbulbs. Oftentimes, the lightbulbs in place in a rental are not that bright. Simply switching out all the lightbulbs can do wonders to keep your living space bright. Stop by a local department or grocery store and purchase lightbulbs with higher wattage. Replace all the lightbulbs in your rental unit with brighter ones when you get home. You will see a noticeable difference in brightness. For the brightest bulbs, go for LED bulbs. They tend to be the brightest and longest lasting bulbs. They range in wattage, so opt for higher wattage over lower wattage. There is no precise wattage that is recommended, and it depends on personal preference, but in general a higher wattage will produce a brighter light. Lightbulbs generally range from 15 to 150 watts. Enhance natural light with the right drapes. Drapes can block out natural light. Dark colored drapes can also make rooms look darker. Swapping out dark drapes for brightly colored ones can make a huge difference in your home's brightness. You can get cheap, light colored blinds at a store like Ikea. Use these blinds to cover up dull beige or off-white blinds. You can also ask your landlord if you can temporarily uninstall blinds in your unit. This way, you can replace dull blinds altogether. Use battery operated lights. You can install small lamps or lights that you can attach to your walls. These lights are usually battery operated, and some come with adhesives that allow you to simply attach them to the wall. You can add these lamps to corners that get dark easily. They work great in kitchens, as you can put them near the stove or in pantries. You can also place battery operated lights on your walls, so you can have a light hanging over a dark room. Add lamps. Lamps are a great addition to a darker apartment. You can buy lamps fairly cheap if you go to a store like Ikea or search for lamps in a thrift store. You can buy standing lamps, or lamps you can place on counters and night stands. A lamp on, say, a nightstand in the bedroom or a end table on the sofa can make for a great reading space. Use string lighting. If you want as much floor space as possible, buy string lighting. Christmas lights can be strung up on your walls, allowing you to brighten your home without adding extra clutter. It may be particularly cheap to look for string lighting just after the holiday season. Decorating Effectively Add rugs. Many rental homes have dull carpeting or floors. This can make the whole room look darker. A few colorful rugs can cover up a dull floor, brightening up the room. Some floor rugs can be quite pricey. However, there are ways to cut down on cost. Shop at secondhand stores or discount department stores. You may also be able to find fairly cheap rugs at larger retail stores. Add functional décor. If you're in a smaller rental space, adding additional decoration may add clutter. You also may not want to spend a lot of money buying brightly colored decorations to lighten up a room. However, colorful objects you use regularly can be displayed decoratively when not in use. If you have colorful dishes, set them out in a cabinet in your kitchen. This can brighten up the kitchen and, when necessary, you can simply grab a dish out of the cabinet to use. Toiletries that come in fancy containers, such as a nice perfume, can be set out in your bathroom for decoration. If you have vases, put them out when they're empty. A nice white vase can brighten up the room and, in the event you need to use it, it will already be sitting out. Add fresh flowers and plants. You can buy flowers and plants at a local greenhouse. As long as you water and care for them, plants can brighten up your home for quite awhile. Some brightly colored flowers or nice green plants set out around your home can make everything look a little brighter. If space is an issue, you can hang plants from the ceiling rather than taking up floor space. Plants that produce vines, such as philodendron and heartleaf, do not require a lot of light to thrive. Parlor palms, Boston furs, corn plants, and prayer plants also require little light. Position mirrors strategically to increase lighting. Mirrors can make great decorations. When set in the right place, they reflect lighting and increase the brightness in your room. Stop by a local furniture store, supermarket, or retail show and buy a few attractive mirrors for your home. Place mirrors in front of lights. They can reflect lights back into the room, doubling the effect. Mirrors are a great idea if you don't have a lot of floor space for extra lamps. Put artwork and photographs on display. Colorful artwork and photographs can easily brighten up a dull white or beige wall. If you don't have any artwork on hand, look into secondhand shops and local art shows. Buy a few colorful paintings or other pieces of art and pin them up on your wall. If a lot of your photos are still on your phone or camera, many chain drug stores have photo stations where you can print out pictures. If you're nailing anything to the wall, make sure the lease allows you to make holes in  your dry wall. Try removable wallpaper. You usually cannot paint over walls, or put up wallpaper. However, you can order removable wallpaper online or buy some at a local craft store. You can easily place strips of removable wallpaper on dull white or beige walls. This will brighten up your apartment without breaking the lease. When you're ready to move out, the wallpaper is easy to remove. Brightening Up With Furniture Paint old furniture in brighter shades. If you have older pieces of furniture, such as furniture you got at a local thrift store, try painting it. A dull wooden chair can be painted a bright, pastel color to brighten up your apartment. The black legs on a dully colored couch can also be painted in bright colors. If you really want to get creative, try adding designs to furniture. You can apply a stencil to a chair or stool, for example. Go for glass furniture. If you can find affordable glass furniture, this can really brighten up a dully colored room. A glass coffee table, end table, or kitchen table can really add some light to your space. In addition to this, you'll be able to see the floor though the glass. This can make your space look less cluttered. Cover ugly countertops. In rental kitchens, your counters may be darker colored. This can make your whole kitchen look dull. Place decorate plates or trays on countertops. You can also try an attractive cutting board made of light colored wood. Position furniture in a way that doesn't block out light. Be careful when arranging a rental space. Where you put your furniture can make a huge impact on lighting. Try to keep chairs, sofas, and other items of furniture away from windows. Experiment a little as you set out furniture. Tweak your set up quite a few times until you get the right look.",
  "tyn_model":[
    "lamps",
    "lightbulbs",
    "plants",
    "mirrors",
    "rugs",
    "flowers",
    "wallpaper",
    "bulbs",
    "removable wallpaper",
    "led bulbs",
    "adhesives",
    "battery operated lights",
    "lamp",
    "string lighting",
    "decorations",
    "dishes",
    "dish",
    "vases",
    "vase",
    "greenhouse",
    "parlor palms",
    "boston furs",
    "photographs",
    "paint",
    "stencil",
    "chair",
    "plates",
    "cutting board",
    "chairs"
  ],
  "tyn_section":[

  ]
}