{
  "title":"How to Make Pumpkin Popcorn",
  "url":"https://www.wikihow.com/Make-Pumpkin-Popcorn",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Popcorn"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 325° Fahrenheit (162° Celsius).",
      "description":""
    },
    {
      "headline":"Pop the popcorn kernels.",
      "description":"Pop the popcorn kernels using a microwave, air popper, or stove top by following the popcorn kernel's package instructions. It should typically take about two to three minutes."
    },
    {
      "headline":"Make the pumpkin mixture.",
      "description":"In a small frying pan or saucepan stir the butter, maple syrup, pumpkin puree, cinnamon, and salt. Cook the ingredients under medium heat for about two minutes."
    },
    {
      "headline":"Measure two cups of popcorn.",
      "description":"Pour the popped popcorn in a large bowl. Measure two cups of the popcorn and set aside."
    },
    {
      "headline":"Pour the remaining popcorn in a baking tray.",
      "description":"Pour the rest of the popcorn in a large baking tray. Spread the popcorn out using your hands or a wooden spoon."
    },
    {
      "headline":"Pour the pumpkin mixture over the popcorn.",
      "description":"Slowly pour the pumpkin mixture all over the popcorn. Gently stir it around with a wooden spoon."
    },
    {
      "headline":"Bake the popcorn.",
      "description":"Place the baking tray in the oven. Have the popcorn bake for about 6-8 minutes, stirring the popcorn occasionally every few minutes to avoid the popcorn pieces from sticking together."
    },
    {
      "headline":"Have the popcorn cool.",
      "description":"Remove the baking tray from the oven. Have the popcorn cool for about five minutes. The pieces covered with glaze will harden while the popcorn cools."
    },
    {
      "headline":"Add the remaining popcorn.",
      "description":"Pour the remaining two cups of popcorn over the pumpkin popcorn. Stir with a wooden spoon until well-combined."
    },
    {
      "headline":"Serve.",
      "description":"Pour the popcorn in a large serving bowl. Enjoy!"
    }
  ],
  "text":" Preheat the oven to 325° Fahrenheit (162° Celsius).  Pop the popcorn kernels. Pop the popcorn kernels using a microwave, air popper, or stove top by following the popcorn kernel's package instructions. It should typically take about two to three minutes. Make the pumpkin mixture. In a small frying pan or saucepan stir the butter, maple syrup, pumpkin puree, cinnamon, and salt. Cook the ingredients under medium heat for about two minutes. Measure two cups of popcorn. Pour the popped popcorn in a large bowl. Measure two cups of the popcorn and set aside. Pour the remaining popcorn in a baking tray. Pour the rest of the popcorn in a large baking tray. Spread the popcorn out using your hands or a wooden spoon. Pour the pumpkin mixture over the popcorn. Slowly pour the pumpkin mixture all over the popcorn. Gently stir it around with a wooden spoon. Bake the popcorn. Place the baking tray in the oven. Have the popcorn bake for about 6-8 minutes, stirring the popcorn occasionally every few minutes to avoid the popcorn pieces from sticking together. Have the popcorn cool. Remove the baking tray from the oven. Have the popcorn cool for about five minutes. The pieces covered with glaze will harden while the popcorn cools. Add the remaining popcorn. Pour the remaining two cups of popcorn over the pumpkin popcorn. Stir with a wooden spoon until well-combined. Serve. Pour the popcorn in a large serving bowl. Enjoy!",
  "tyn_model":[
    "oven",
    "baking tray",
    "wooden spoon",
    "pumpkin",
    "popcorn",
    "microwave",
    "air popper",
    "stove top",
    "popcorn kernel",
    "small frying pan",
    "butter",
    "maple syrup",
    "pumpkin puree",
    "cinnamon",
    "salt",
    "large bowl",
    "large baking tray",
    "pumpkin popcorn",
    "large serving bowl"
  ],
  "tyn_section":[

  ]
}