{
  "title":"How to Prepare Marijuana Butter",
  "url":"https://www.wikihow.com/Prepare-Marijuana-Butter",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Butter and Ghee"
  ],
  "methods":[
    {
      "name":"Preparing Your Weed (Decarboxylation)",
      "steps":[
        {
          "headline":"Know that, while not necessary, decarboxylating is a simple process that makes the most of every bud.",
          "description":"Also called \"pre-baking,\" this step leads to stronger bang for you bud. Marijuana is filled with many compounds, some of which are medicinal/psychoactive, and some of which are not. You can get rid of the not so useful ones if you decarboxylate the weed first, which simply means baking it at a low temperature. This vaporizes compounds like THCA, which doesn't get you high, leading to a stronger butter. You can also use shake, leaves, or a mixture of buds and leaves if you'd like."
        },
        {
          "headline":"Pre-heat the oven to 240°F (115°C).",
          "description":"You want a nice, low temperature. While a higher temp will remove the compounds faster, it will also cause wanted compounds, like terpenes (which give each strain it's unique aroma and flavor) to leak out too. 240°F is a good, safe temperature."
        },
        {
          "headline":"Hand-crumble the weed into in a rimmed baking sheet, spreading so there are no holes or gaps.",
          "description":"You want smaller pieces of bud, roughly 1/2\" or less in diameter, though exact measurements aren't needed. Use a baking sheet just big enough to contain all of the weed. Empty space will heat up the pan quickly, which causes uneven \"cooking.\""
        },
        {
          "headline":"Bake the buds for 30 minutes or so, mixing it every 10 minutes to prevent burning.",
          "description":"When done, the weed will be a light brown color and will crumble easily in your hands."
        },
        {
          "headline":"Grind the bud until it is a course mixture, with recognizable buds.",
          "description":"Don't grind it into a powder -- you just want it to be in small, manageable bits, like small pieces of gravel. You can use an herb grinder or simply pulse it quickly in a blender or food processor."
        },
        {
          "headline":"Optionally, soak your cannabis in water for 20-60 minutes before cooking.",
          "description":"This will remove some of the chlorophyll, dirt and fertilizers from the plant matter which can cause a \"grassy\" taste in your butter. THC and other cannabinoids are not water soluble, and will not be affected by the soak. When done, strain out the water with a colander and pat dry with paper towels."
        }
      ]
    },
    {
      "name":"Making Stovetop Cannabutter",
      "steps":[
        {
          "headline":"Bring a 1/4 cup of water and 1 lb butter to a light simmer on medium heat.",
          "description":"Use a small saucepan, and dump the butter and water in together. Turn on the heat, stirring until bubbles start to rise to the surface but the mixture isn't boiling. This recipe uses a ratio of 1 oz. of marijuana to 1 lb. of butter. Adjust accordingly if you have less weed. If you have a candy thermometer, this moment is at roughly 190°F"
        },
        {
          "headline":"Whisk in the cannabis and lower the heat to low.",
          "description":"Take your pre-ground cannabis and mix it in thoroughly, lowering the heat a few notches to low. The key to great cannabutter is \"slow and steady,\" which will release the essential oils and compounds without denaturing them."
        },
        {
          "headline":"Let the mixture simmer for anywhere from 2-5 hours, stirring every half hour and adding water as needed.",
          "description":"Depending on your desired strength of the butter, you can leave it in for longer or shorter. If you leave it in for closer to 5 hours you'll get the strongest butter, but you'll have to be diligent about adding more warm water occasionally if it starts to evaporate out. Three hours is the most common cooking time, but two hours will be enough for usable butter, too. If you know you want to cook the butter for 4-5 hours, add the extra water in advance, roughly 1-2 cups total instead of a 1/4 cup of water."
        },
        {
          "headline":"Line a fine-mesh strainer with a cheesecloth and place over a glass bowl.",
          "description":"Use the bowl you plan to store the butter in when finished. The strainer and cheesecloth together will get rid of any useless chunks of plant matter left in the butter when it is done cooking."
        },
        {
          "headline":"Pour the liquid butter through the strainer into your glass bowl.",
          "description":"Pour slowly, and don't wait for the butter to cool off. Use the back of a wooden spoon or spatula to press excess butter out of the solids remaining. Feeling extra fancy? You can also use a French press to simply strain and mash your buttery liquid."
        },
        {
          "headline":"Fold the cheesecloth over and squeeze to remove any last butter.",
          "description":"Make sure you get every last drop out of the cheesecloth to avoid wasting any weed. When done, you can throw the cheesecloth and remaining solids out."
        },
        {
          "headline":"Refrigerate the liquid butter, covered, for 3-5 hours, then scrape off the water on top.",
          "description":"As the butter cools, the water will separate from the butter. Simply pour or scrape this off and then return the butter to the fridge."
        },
        {
          "headline":"Use cannabutter anywhere you might use regular butter.",
          "description":"You can spread cannabutter on toast or use it to make your classic chocolate chip cookies. It will keep in the refrigerator just as long as normal butter, and can be substituted into just about any recipe."
        }
      ]
    },
    {
      "name":"Using Alternate Cooking Methods",
      "steps":[
        {
          "headline":"Adjust the amount of marijuana, not the butter, if you want to change the strength.",
          "description":"You can keep everything else the same, since the water is there to prevent burning, not actually diluting the butter. Keep the butter and water ratio the same and simply adjust the amount of bud you grind in. You can also adjust the cooking times, cooking less for less potent weed, but this is just a waste of weed -- fewer buds cooked for a longer time will get the same results. 1 ounce of buds will lead to some strong, strong butter, but you should probably use 1 1/2 ounces if you only have shake or leaves. If you use a lot more than 1 ounce, you will want to add more butter to absorb all of the THC. However, 1-ounce weed per pound of butter is usually more than enough marijuana."
        },
        {
          "headline":"Quick cook some butter in under an hour if you want a quick edible treat.",
          "description":"The following method is for smaller batches, and reliably turns out a half cup of marijuana butter quickly and easily. This method does not require a \"pre-bake.\" To make it:\nFinely grind up 1/4 ounce of cannabis buds (not shake or leaves)\nHeat 1/2 cup of butter until melted in a saucepan on medium heat\nAdd the buds slowly, stirring frequently. Simmer for 45 minutes, stirring often. There should only be small bubbles on the butter's surface. Strain through a strainer and cheesecloth. Chill and use."
        },
        {
          "headline":"Use a slow cooker for hands-free marijuana butter.",
          "description":"A simple Crockpot is the perfect way to get the \"long and slow\" cooking that you're after. To pull it off, all you need to do is:\nMix 1 cup water, 1 lb butter, and 1-ounce ground marijuana in the slow cooker. Turn the cooker on low and stir. Cover the cooker and let simmer for 8-24 hours, stirring occasionally."
        },
        {
          "headline":"Try using clarified butter (ghee) for a smoother-tasting cannabutter.",
          "description":"Clarified butter has been separated, isolating the essential milk fats. It will absorb the THC better and cook much more cleanly, with less smoke if you accidentally overheat things."
        },
        {
          "headline":"Spray your toasted buds with a little high-proof alcohol, like Everclear, before adding to the butter.",
          "description":"This scientific little trick helps break down the cellulose in your buds, leading greater THC release and a less green final color. However, this only works if you do the decarboxylation step (pre-bake). Simply spray the buds after the come out of the oven and let them sit for 10-15 minutes while you start melting the butter."
        },
        {
          "headline":"Blanch your marijuana beforehand for a relatively scentless, flavorless butter.",
          "description":"This recipe uses the nifty cooking trick of blanching, rapidly heating and cooling the buds, to remove chlorophyll and other stinky chemicals. To pull it off, you need to be prepared to pre-bake as well, so get ready for a several-hour cook. That said, blanching is easy:\nBring a large pot of water to a boil. Set aside another bowl and fill it with ice water. Place your ground up weed in a tea ball, then dunk it in the boiling water for 5 minutes. Remove weed ball and place immediately in the ice bath for 1 minute. Repeat until all the weed is blanched\nPre-bake the weed at 220°F for one hour to dry out. Make your cannabutter like normal."
        }
      ]
    }
  ],
  "text":" Preparing Your Weed (Decarboxylation) Know that, while not necessary, decarboxylating is a simple process that makes the most of every bud. Also called \"pre-baking,\" this step leads to stronger bang for you bud. Marijuana is filled with many compounds, some of which are medicinal/psychoactive, and some of which are not. You can get rid of the not so useful ones if you decarboxylate the weed first, which simply means baking it at a low temperature. This vaporizes compounds like THCA, which doesn't get you high, leading to a stronger butter. You can also use shake, leaves, or a mixture of buds and leaves if you'd like. Pre-heat the oven to 240°F (115°C). You want a nice, low temperature. While a higher temp will remove the compounds faster, it will also cause wanted compounds, like terpenes (which give each strain it's unique aroma and flavor) to leak out too. 240°F is a good, safe temperature. Hand-crumble the weed into in a rimmed baking sheet, spreading so there are no holes or gaps. You want smaller pieces of bud, roughly 1/2\" or less in diameter, though exact measurements aren't needed. Use a baking sheet just big enough to contain all of the weed. Empty space will heat up the pan quickly, which causes uneven \"cooking.\" Bake the buds for 30 minutes or so, mixing it every 10 minutes to prevent burning. When done, the weed will be a light brown color and will crumble easily in your hands. Grind the bud until it is a course mixture, with recognizable buds. Don't grind it into a powder -- you just want it to be in small, manageable bits, like small pieces of gravel. You can use an herb grinder or simply pulse it quickly in a blender or food processor. Optionally, soak your cannabis in water for 20-60 minutes before cooking. This will remove some of the chlorophyll, dirt and fertilizers from the plant matter which can cause a \"grassy\" taste in your butter. THC and other cannabinoids are not water soluble, and will not be affected by the soak. When done, strain out the water with a colander and pat dry with paper towels. Making Stovetop Cannabutter Bring a 1/4 cup of water and 1 lb butter to a light simmer on medium heat. Use a small saucepan, and dump the butter and water in together. Turn on the heat, stirring until bubbles start to rise to the surface but the mixture isn't boiling. This recipe uses a ratio of 1 oz. of marijuana to 1 lb. of butter. Adjust accordingly if you have less weed. If you have a candy thermometer, this moment is at roughly 190°F Whisk in the cannabis and lower the heat to low. Take your pre-ground cannabis and mix it in thoroughly, lowering the heat a few notches to low. The key to great cannabutter is \"slow and steady,\" which will release the essential oils and compounds without denaturing them. Let the mixture simmer for anywhere from 2-5 hours, stirring every half hour and adding water as needed. Depending on your desired strength of the butter, you can leave it in for longer or shorter. If you leave it in for closer to 5 hours you'll get the strongest butter, but you'll have to be diligent about adding more warm water occasionally if it starts to evaporate out. Three hours is the most common cooking time, but two hours will be enough for usable butter, too. If you know you want to cook the butter for 4-5 hours, add the extra water in advance, roughly 1-2 cups total instead of a 1/4 cup of water. Line a fine-mesh strainer with a cheesecloth and place over a glass bowl. Use the bowl you plan to store the butter in when finished. The strainer and cheesecloth together will get rid of any useless chunks of plant matter left in the butter when it is done cooking. Pour the liquid butter through the strainer into your glass bowl. Pour slowly, and don't wait for the butter to cool off. Use the back of a wooden spoon or spatula to press excess butter out of the solids remaining. Feeling extra fancy? You can also use a French press to simply strain and mash your buttery liquid. Fold the cheesecloth over and squeeze to remove any last butter. Make sure you get every last drop out of the cheesecloth to avoid wasting any weed. When done, you can throw the cheesecloth and remaining solids out. Refrigerate the liquid butter, covered, for 3-5 hours, then scrape off the water on top. As the butter cools, the water will separate from the butter. Simply pour or scrape this off and then return the butter to the fridge. Use cannabutter anywhere you might use regular butter. You can spread cannabutter on toast or use it to make your classic chocolate chip cookies. It will keep in the refrigerator just as long as normal butter, and can be substituted into just about any recipe. Using Alternate Cooking Methods Adjust the amount of marijuana, not the butter, if you want to change the strength. You can keep everything else the same, since the water is there to prevent burning, not actually diluting the butter. Keep the butter and water ratio the same and simply adjust the amount of bud you grind in. You can also adjust the cooking times, cooking less for less potent weed, but this is just a waste of weed -- fewer buds cooked for a longer time will get the same results. 1 ounce of buds will lead to some strong, strong butter, but you should probably use 1 1/2 ounces if you only have shake or leaves. If you use a lot more than 1 ounce, you will want to add more butter to absorb all of the THC. However, 1-ounce weed per pound of butter is usually more than enough marijuana. Quick cook some butter in under an hour if you want a quick edible treat. The following method is for smaller batches, and reliably turns out a half cup of marijuana butter quickly and easily. This method does not require a \"pre-bake.\" To make it:\nFinely grind up 1/4 ounce of cannabis buds (not shake or leaves)\nHeat 1/2 cup of butter until melted in a saucepan on medium heat\nAdd the buds slowly, stirring frequently. Simmer for 45 minutes, stirring often. There should only be small bubbles on the butter's surface. Strain through a strainer and cheesecloth. Chill and use. Use a slow cooker for hands-free marijuana butter. A simple Crockpot is the perfect way to get the \"long and slow\" cooking that you're after. To pull it off, all you need to do is:\nMix 1 cup water, 1 lb butter, and 1-ounce ground marijuana in the slow cooker. Turn the cooker on low and stir. Cover the cooker and let simmer for 8-24 hours, stirring occasionally. Try using clarified butter (ghee) for a smoother-tasting cannabutter. Clarified butter has been separated, isolating the essential milk fats. It will absorb the THC better and cook much more cleanly, with less smoke if you accidentally overheat things. Spray your toasted buds with a little high-proof alcohol, like Everclear, before adding to the butter. This scientific little trick helps break down the cellulose in your buds, leading greater THC release and a less green final color. However, this only works if you do the decarboxylation step (pre-bake). Simply spray the buds after the come out of the oven and let them sit for 10-15 minutes while you start melting the butter. Blanch your marijuana beforehand for a relatively scentless, flavorless butter. This recipe uses the nifty cooking trick of blanching, rapidly heating and cooling the buds, to remove chlorophyll and other stinky chemicals. To pull it off, you need to be prepared to pre-bake as well, so get ready for a several-hour cook. That said, blanching is easy:\nBring a large pot of water to a boil. Set aside another bowl and fill it with ice water. Place your ground up weed in a tea ball, then dunk it in the boiling water for 5 minutes. Remove weed ball and place immediately in the ice bath for 1 minute. Repeat until all the weed is blanched\nPre-bake the weed at 220°F for one hour to dry out. Make your cannabutter like normal.",
  "tyn_model":[
    "butter",
    "water",
    "cheesecloth",
    "marijuana",
    "strainer",
    "oven",
    "baking sheet",
    "saucepan",
    "cannabis",
    "glass bowl",
    "cannabutter",
    "marijuana butter",
    "slow cooker",
    "cooker",
    "clarified butter",
    "terpenes",
    "herb grinder",
    "blender",
    "food processor",
    "colander",
    "paper towels",
    "candy thermometer",
    "fine-mesh strainer",
    "wooden spoon",
    "spatula",
    "french press",
    "fridge",
    "chocolate chip cookies",
    "cannabis buds",
    "crockpot",
    "bowl",
    "ice water",
    "tea ball",
    "ice bath"
  ],
  "tyn_section":[

  ]
}