{
  "title":"How to Make Garlic Parmesan Chicken Wings",
  "url":"https://www.wikihow.com/Make-Garlic-Parmesan-Chicken-Wings",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken",
    "Fried Chicken"
  ],
  "methods":[
    {
      "name":"Cooking Boneless Wings",
      "steps":[
        {
          "headline":"Cut chicken breast into bite sized cubes.",
          "description":"Use hygienic techniques. Clean the chicken before cutting. Wash your hands before and after handling raw meat. Clean the surfaces the chicken touched. Do not allow the chicken to come into contact anything else."
        },
        {
          "headline":"Place the wings into a bowl.",
          "description":"Add the salt, pepper, garlic powder, and chili powder. Mix well."
        },
        {
          "headline":"Place flour and eggs into separate bowls.",
          "description":"Dip chicken into the flour, then eggs, and back into the flour."
        },
        {
          "headline":"Heat oil in a pan at medium-high heat.",
          "description":"Carefully place the chicken into the pan. Do not put in to much chicken in, leave some space for each piece to cook."
        },
        {
          "headline":"Fry the chicken until golden brown (8-10 minutes).",
          "description":"When the chicken is cooked, it will rise in the oil. If you still are not sure that it is fully cooked cut the chicken in half, if it is pink leave it for another minute."
        }
      ]
    },
    {
      "name":"Making the Dry Sauce",
      "steps":[
        {
          "headline":"In a pan over medium heat, cook the butter, garlic, and parsley together until garlic is just starting to brown.",
          "description":""
        },
        {
          "headline":"Turn off the heat and add in the chicken and the Parmesan.",
          "description":"Mix well."
        },
        {
          "headline":"Enjoy!",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Wet Sauce",
      "steps":[
        {
          "headline":"Mix the dry seasoning together.",
          "description":"Add in the basil, oregano, thyme, black pepper, salt, and red pepper flakes."
        },
        {
          "headline":"Mix the garlic, mayonnaise, Parmesan, apple cider vinegar, and lemon juice.",
          "description":"Add dry seasoning to your taste."
        },
        {
          "headline":"Refrigerate the sauce overnight.",
          "description":""
        },
        {
          "headline":"Pour onto wings and mix well.",
          "description":"Enjoy!"
        }
      ]
    }
  ],
  "text":" Cooking Boneless Wings Cut chicken breast into bite sized cubes. Use hygienic techniques. Clean the chicken before cutting. Wash your hands before and after handling raw meat. Clean the surfaces the chicken touched. Do not allow the chicken to come into contact anything else. Place the wings into a bowl. Add the salt, pepper, garlic powder, and chili powder. Mix well. Place flour and eggs into separate bowls. Dip chicken into the flour, then eggs, and back into the flour. Heat oil in a pan at medium-high heat. Carefully place the chicken into the pan. Do not put in to much chicken in, leave some space for each piece to cook. Fry the chicken until golden brown (8-10 minutes). When the chicken is cooked, it will rise in the oil. If you still are not sure that it is fully cooked cut the chicken in half, if it is pink leave it for another minute. Making the Dry Sauce In a pan over medium heat, cook the butter, garlic, and parsley together until garlic is just starting to brown.  Turn off the heat and add in the chicken and the Parmesan. Mix well. Enjoy!  Making the Wet Sauce Mix the dry seasoning together. Add in the basil, oregano, thyme, black pepper, salt, and red pepper flakes. Mix the garlic, mayonnaise, Parmesan, apple cider vinegar, and lemon juice. Add dry seasoning to your taste. Refrigerate the sauce overnight.  Pour onto wings and mix well. Enjoy!",
  "tyn_model":[
    "chicken",
    "flour",
    "garlic",
    "salt",
    "eggs",
    "oil",
    "pan",
    "parmesan",
    "dry seasoning",
    "chicken breast",
    "bowl",
    "pepper",
    "garlic powder",
    "chili powder",
    "butter",
    "parsley",
    "basil",
    "oregano",
    "thyme",
    "black pepper",
    "red pepper flakes",
    "mayonnaise",
    "apple cider vinegar",
    "lemon juice"
  ],
  "tyn_section":[

  ]
}