{
  "title":"How to Make Pumpkin Chili",
  "url":"https://www.wikihow.com/Make-Pumpkin-Chili",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Chili Dishes"
  ],
  "methods":[
    {
      "name":"Making Vegetarian Chili",
      "steps":[
        {
          "headline":"Peel and cut the pumpkin.",
          "description":"Before adding it to your chili, you need to peel and cut your pumpkin. To make the process easier, cut the pumpkin in half and then remove the seeds. From there, place each slice in a small dish of water and microwave for 5 minutes. You can then easily peel off the skin. Once the pumpkin is peeled, cut the pumpkin halves into small cubes for your chili."
        },
        {
          "headline":"Cut and peel the turnips.",
          "description":"Use a vegetable peeler to gently peel off the skins from the turnips. Then, slice the turnips into roughly 1-inch cubes."
        },
        {
          "headline":"Heat the butter and olive oil.",
          "description":"Select a pot that will hold at least 6 quarts. Place the butter and olive oil in the pot. Turn the burner to medium heat and heat up the butter and olive oil for a few minutes. Wait until the butter is melted before proceeding."
        },
        {
          "headline":"Add the cornmeal.",
          "description":"Pour your cornmeal into the pot. Use a wire whisk to beat the cornmeal until it forms a smooth, even texture."
        },
        {
          "headline":"Cook the vegetables and tomato paste.",
          "description":"Add the garlic, onion, bell pepper, chopped pumpkin, and turnip. Pour in the tomato paste. Stir everything together until it's all mixed. Allow the mixture to cook over medium heat for about 10 minutes. Stir the mixture regularly as it cooks."
        },
        {
          "headline":"Add the remaining ingredients and the spices.",
          "description":"Add the broth, diced tomatoes, beans, and corn. Stir in the cinnamon, chili powder, cumin, and Worcestershire sauce. Make sure to stir your chili with a spoon until all the ingredients are evenly mixed."
        },
        {
          "headline":"Simmer for about an hour.",
          "description":"Reduce the heat to a simmer. Allow the chili to cook for about an hour. It may take more or less time, depending on the precise heat of your stove. You should allow the chili to simmer until the pumpkins and turnips are tender. Check the pumpkins and turnips regularly as your chili is simmering. Some people prefer to let the chili simmer for a long time, as this can lead to more tender vegetables and increase the flavor. If you have time, let your chili simmer for an entire afternoon."
        },
        {
          "headline":"Add salt and vinegar to taste.",
          "description":"Once the turnips and pumpkins are tender, you can turn off the heat. Add salt and vinegar, tasting between each shake of salt and splash of vinegar. Keep adding salt and vinegar until your chili is at your desired taste. Add small amounts of salt and vinegar at a time. You can always add more if necessary, but you can't really remove salt or vinegar from the pot once it's added."
        },
        {
          "headline":"Serve your chili.",
          "description":"Place chopped green onions, cheddar cheese, and sour cream over your chili to serve it. You can also serve it plain, if you desire."
        }
      ]
    },
    {
      "name":"Making Turkey Pumpkin Chili",
      "steps":[
        {
          "headline":"Heat the oil and stir in the vegetables.",
          "description":"Use a large pot to heat your oil, as you're going to be making a good amount of chili. Turn the stove to medium heat and pour in the olive oil. Allow the olive oil to heat to the point the vegetables simmer slightly when they're tossed in the pot. Heat the vegetables until they're tender, stirring frequently throughout the process. This should take about 5 minutes."
        },
        {
          "headline":"Cook the turkey until brown.",
          "description":"Add your turkey to the pot. Stirring frequently, cook the turkey in the pot until it's browned throughout. Make sure to check the ground turkey carefully to make sure there are no pink or red spots left. Always wash your hands after handling raw meat."
        },
        {
          "headline":"Add the remaining ingredients, except for the beans.",
          "description":"Add your cans of diced tomatoes and pumpkin. Then, add the water, as well as the spices. The spices included are chili powder, cumin, salt, and pepper. Make sure to use a spoon to mix everything together evenly. Turn the heat to high and bring the mixture to a boil."
        },
        {
          "headline":"Add the beans and simmer for 30 minutes.",
          "description":"Once your chili is boiling, switch the burner to a medium-low setting. Then, add the can of beans. Cover the pot and simmer for about 30 minutes. Stir your chili occasionally throughout the simmering process"
        },
        {
          "headline":"Serve your chili.",
          "description":"You can serve your chili as soon as it's done. Simply ladle the chili into bowls. If you want, you can top the chili off with sour cream and cheddar cheese."
        }
      ]
    },
    {
      "name":"Making Pumpkin Chili with Pork",
      "steps":[
        {
          "headline":"Boil the pork.",
          "description":"Before cooking your chili, you will need to boil the pork. Get a large pot from your kitchen, big enough to contain a large batch of chili. Combine the pork with 3 cups of water, your beer, and 2 teaspoons of salt. Turn the burner to medium heat. Bring the pot to a simmer. As the pork is simmering, periodically remove the foam from the top of the pot. Add the chipotle peppers and the 1 and 1/2 teaspoons of oregano. Cover the pot and allow the ingredients to cook for about 30 minutes."
        },
        {
          "headline":"Mix part of the pumpkin to the sour cream.",
          "description":"Using a separate bowl, add three tablespoons of the pumpkin to the sour cream. Mix the ingredients together until you have an even texture throughout. Cover the bowl and place it in the refrigerator. Allow it to chill while you prepare the other ingredients."
        },
        {
          "headline":"Heat up the vegetables.",
          "description":"Take a skillet and pour in the vegetable oil. Allow it to heat for a few minutes over medium heat before throwing in the tomatoes, poblano peppers, and onions. You should also toss in 2 teaspoons of salt. Cook the vegetables, stirring frequently, until they're soft. It should take you about 15 minutes to stir in all the vegetables."
        },
        {
          "headline":"Add the spices and remaining pumpkin to the vegetables.",
          "description":"Add the chili powder and the last 1 and 1/2 teaspoons of oregano. Cook this with the vegetables for about five minutes. Then, add the rest of your can of pumpkin. Cook for an additional five minutes."
        },
        {
          "headline":"Combine the vegetable and pumpkin mixture with the pork.",
          "description":"Pour your vegetable and pumpkin mixture in with the pork. Gently stir in the vegetables and pumpkins until you have an even mixture. Reduce the heat to low and allow the chili to simmer for about 30 minutes."
        },
        {
          "headline":"Add the mustard greens.",
          "description":"Throw in your mustard greens once the meat is tender. Cook the chili for an additional 10 minutes to get the greens soft and tender as well. Add a bit of salt to the chili to season it."
        },
        {
          "headline":"Serve your chili.",
          "description":"Once your chili is done, you can ladle it into bowls. Remove the pumpkin and sour cream mixture from the fridge. Use this to top your bowls of chili. You can also sprinkle some more chili powder over the pumpkin and sour cream mixture."
        }
      ]
    }
  ],
  "text":" Making Vegetarian Chili Peel and cut the pumpkin. Before adding it to your chili, you need to peel and cut your pumpkin. To make the process easier, cut the pumpkin in half and then remove the seeds. From there, place each slice in a small dish of water and microwave for 5 minutes. You can then easily peel off the skin. Once the pumpkin is peeled, cut the pumpkin halves into small cubes for your chili. Cut and peel the turnips. Use a vegetable peeler to gently peel off the skins from the turnips. Then, slice the turnips into roughly 1-inch cubes. Heat the butter and olive oil. Select a pot that will hold at least 6 quarts. Place the butter and olive oil in the pot. Turn the burner to medium heat and heat up the butter and olive oil for a few minutes. Wait until the butter is melted before proceeding. Add the cornmeal. Pour your cornmeal into the pot. Use a wire whisk to beat the cornmeal until it forms a smooth, even texture. Cook the vegetables and tomato paste. Add the garlic, onion, bell pepper, chopped pumpkin, and turnip. Pour in the tomato paste. Stir everything together until it's all mixed. Allow the mixture to cook over medium heat for about 10 minutes. Stir the mixture regularly as it cooks. Add the remaining ingredients and the spices. Add the broth, diced tomatoes, beans, and corn. Stir in the cinnamon, chili powder, cumin, and Worcestershire sauce. Make sure to stir your chili with a spoon until all the ingredients are evenly mixed. Simmer for about an hour. Reduce the heat to a simmer. Allow the chili to cook for about an hour. It may take more or less time, depending on the precise heat of your stove. You should allow the chili to simmer until the pumpkins and turnips are tender. Check the pumpkins and turnips regularly as your chili is simmering. Some people prefer to let the chili simmer for a long time, as this can lead to more tender vegetables and increase the flavor. If you have time, let your chili simmer for an entire afternoon. Add salt and vinegar to taste. Once the turnips and pumpkins are tender, you can turn off the heat. Add salt and vinegar, tasting between each shake of salt and splash of vinegar. Keep adding salt and vinegar until your chili is at your desired taste. Add small amounts of salt and vinegar at a time. You can always add more if necessary, but you can't really remove salt or vinegar from the pot once it's added. Serve your chili. Place chopped green onions, cheddar cheese, and sour cream over your chili to serve it. You can also serve it plain, if you desire. Making Turkey Pumpkin Chili Heat the oil and stir in the vegetables. Use a large pot to heat your oil, as you're going to be making a good amount of chili. Turn the stove to medium heat and pour in the olive oil. Allow the olive oil to heat to the point the vegetables simmer slightly when they're tossed in the pot. Heat the vegetables until they're tender, stirring frequently throughout the process. This should take about 5 minutes. Cook the turkey until brown. Add your turkey to the pot. Stirring frequently, cook the turkey in the pot until it's browned throughout. Make sure to check the ground turkey carefully to make sure there are no pink or red spots left. Always wash your hands after handling raw meat. Add the remaining ingredients, except for the beans. Add your cans of diced tomatoes and pumpkin. Then, add the water, as well as the spices. The spices included are chili powder, cumin, salt, and pepper. Make sure to use a spoon to mix everything together evenly. Turn the heat to high and bring the mixture to a boil. Add the beans and simmer for 30 minutes. Once your chili is boiling, switch the burner to a medium-low setting. Then, add the can of beans. Cover the pot and simmer for about 30 minutes. Stir your chili occasionally throughout the simmering process Serve your chili. You can serve your chili as soon as it's done. Simply ladle the chili into bowls. If you want, you can top the chili off with sour cream and cheddar cheese. Making Pumpkin Chili with Pork Boil the pork. Before cooking your chili, you will need to boil the pork. Get a large pot from your kitchen, big enough to contain a large batch of chili. Combine the pork with 3 cups of water, your beer, and 2 teaspoons of salt. Turn the burner to medium heat. Bring the pot to a simmer. As the pork is simmering, periodically remove the foam from the top of the pot. Add the chipotle peppers and the 1 and 1/2 teaspoons of oregano. Cover the pot and allow the ingredients to cook for about 30 minutes. Mix part of the pumpkin to the sour cream. Using a separate bowl, add three tablespoons of the pumpkin to the sour cream. Mix the ingredients together until you have an even texture throughout. Cover the bowl and place it in the refrigerator. Allow it to chill while you prepare the other ingredients. Heat up the vegetables. Take a skillet and pour in the vegetable oil. Allow it to heat for a few minutes over medium heat before throwing in the tomatoes, poblano peppers, and onions. You should also toss in 2 teaspoons of salt. Cook the vegetables, stirring frequently, until they're soft. It should take you about 15 minutes to stir in all the vegetables. Add the spices and remaining pumpkin to the vegetables. Add the chili powder and the last 1 and 1/2 teaspoons of oregano. Cook this with the vegetables for about five minutes. Then, add the rest of your can of pumpkin. Cook for an additional five minutes. Combine the vegetable and pumpkin mixture with the pork. Pour your vegetable and pumpkin mixture in with the pork. Gently stir in the vegetables and pumpkins until you have an even mixture. Reduce the heat to low and allow the chili to simmer for about 30 minutes. Add the mustard greens. Throw in your mustard greens once the meat is tender. Cook the chili for an additional 10 minutes to get the greens soft and tender as well. Add a bit of salt to the chili to season it. Serve your chili. Once your chili is done, you can ladle it into bowls. Remove the pumpkin and sour cream mixture from the fridge. Use this to top your bowls of chili. You can also sprinkle some more chili powder over the pumpkin and sour cream mixture.",
  "tyn_model":[
    "pumpkin",
    "pot",
    "salt",
    "vegetables",
    "vinegar",
    "sour cream",
    "olive oil",
    "butter",
    "beans",
    "chili powder",
    "pumpkins",
    "water",
    "burner",
    "cornmeal",
    "spices",
    "turkey",
    "chili",
    "tomato paste",
    "diced tomatoes",
    "cumin",
    "spoon",
    "cheddar cheese",
    "oil",
    "large pot",
    "oregano",
    "vegetable",
    "pork",
    "mustard greens",
    "microwave",
    "vegetable peeler",
    "wire whisk",
    "garlic",
    "onion",
    "bell pepper",
    "turnip",
    "broth",
    "corn",
    "cinnamon",
    "worcestershire sauce",
    "turnips",
    "green onions",
    "stove",
    "ground turkey",
    "pepper",
    "beer",
    "chipotle peppers",
    "bowl",
    "refrigerator",
    "skillet",
    "vegetable oil",
    "tomatoes",
    "poblano peppers",
    "onions",
    "bowls"
  ],
  "tyn_section":[

  ]
}