{
  "title":"How to Learn a New Racing Track on Forza 2",
  "url":"https://www.wikihow.com/Learn-a-New-Racing-Track-on-Forza-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox"
  ],
  "steps":[
    {
      "headline":"Drive slowly around the track until you know the layout.",
      "description":""
    },
    {
      "headline":"Start using the whole width of the track for all corners, using very late apexes.",
      "description":"It may feel strange at slower, non-race speeds,but it helps you master every corner on the course - especially the important ones that lead to or are followed by straightaways."
    },
    {
      "headline":"Work up speed, and pull each apex back about 3 feet (0.9 m) with each lap.",
      "description":""
    },
    {
      "headline":"Eventually you'll have to use the entire width of the track exiting the corners.Now you're close to your car's cornering limits, so start moving the apexes back in smaller increments.",
      "description":"If you run off the outside edge of the track or have to turn in again after missing the apex, you've used too early an apex."
    },
    {
      "headline":"When you've worked up to speeds and apexes that force you to use the entire track, you've found your basic approach for lapping the track.The line around any track will be different from one driver to the next, and for different cars, car setups and track conditions.",
      "description":""
    },
    {
      "headline":"Now work on compromising certain corners, especially through a series of corners not attached to straights, to maximise your speed throughout the important ones- generally those followed by the longest straights.",
      "description":"The speed you carry out of those corners allows you to achieve the highest speed on the straightaways."
    }
  ],
  "text":" Drive slowly around the track until you know the layout.  Start using the whole width of the track for all corners, using very late apexes. It may feel strange at slower, non-race speeds,but it helps you master every corner on the course - especially the important ones that lead to or are followed by straightaways. Work up speed, and pull each apex back about 3 feet (0.9 m) with each lap.  Eventually you'll have to use the entire width of the track exiting the corners.Now you're close to your car's cornering limits, so start moving the apexes back in smaller increments. If you run off the outside edge of the track or have to turn in again after missing the apex, you've used too early an apex. When you've worked up to speeds and apexes that force you to use the entire track, you've found your basic approach for lapping the track.The line around any track will be different from one driver to the next, and for different cars, car setups and track conditions.  Now work on compromising certain corners, especially through a series of corners not attached to straights, to maximise your speed throughout the important ones- generally those followed by the longest straights. The speed you carry out of those corners allows you to achieve the highest speed on the straightaways.",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}