{
  "title":"How to Prepare Kale",
  "url":"https://www.wikihow.com/Prepare-Kale",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Cruciferous Vegetables"
  ],
  "steps":[
    {
      "headline":"Purchase or obtain about a pound of fresh kale, preferably organic grown.",
      "description":""
    },
    {
      "headline":"Clean the kale by rinsing with cold water and spin dry.",
      "description":""
    },
    {
      "headline":"Lay the kale leaves longitudinally in a bunch and holding them with one hand, chop them across their length in roughly 1\" wide strips and set aside.",
      "description":""
    },
    {
      "headline":"Peel and chop finely one medium to large clove of garlic.",
      "description":""
    },
    {
      "headline":"Chop one small onion coarsely.",
      "description":""
    },
    {
      "headline":"In a pot (big enough to hold all the kale uncooked), put about one tablespoon of olive oil and start warming it over low heat.",
      "description":""
    },
    {
      "headline":"Add the chopped garlic and chopped onions to the heating oil and stir around until the onions begin to get clear.",
      "description":""
    },
    {
      "headline":"Add the chopped greens, a handful at the time while stirring the whole mix in the pot continue to stir the mix as it cooks under low heat and add salt to your taste a little at the time (don't add more than 1/2 teaspoon of salt at first until you know how much you really want).",
      "description":""
    },
    {
      "headline":"Sprinkle a little (maybe a Tablespoon) wine vinegar or balsamic vinegar on the mix as you continue to stir.",
      "description":""
    },
    {
      "headline":"Add 1/2 to 1 cup of chopped walnuts to the mix and stir.",
      "description":""
    },
    {
      "headline":"Add a pinch of dry herb mix (basil, oregano, rosemary, thyme, marjoram, cilantro) and mix into the greens.",
      "description":"By now you've probably stirred the greens about 5 minutes."
    },
    {
      "headline":"Cover the pot and simmer on low heat for 5 minutes but keep an eye on it to prevent scorching the food.",
      "description":""
    },
    {
      "headline":"Check and see if the greens are cooked enough to your taste and if ready, serve hot and enjoy!",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Purchase or obtain about a pound of fresh kale, preferably organic grown.  Clean the kale by rinsing with cold water and spin dry.  Lay the kale leaves longitudinally in a bunch and holding them with one hand, chop them across their length in roughly 1\" wide strips and set aside.  Peel and chop finely one medium to large clove of garlic.  Chop one small onion coarsely.  In a pot (big enough to hold all the kale uncooked), put about one tablespoon of olive oil and start warming it over low heat.  Add the chopped garlic and chopped onions to the heating oil and stir around until the onions begin to get clear.  Add the chopped greens, a handful at the time while stirring the whole mix in the pot continue to stir the mix as it cooks under low heat and add salt to your taste a little at the time (don't add more than 1/2 teaspoon of salt at first until you know how much you really want).  Sprinkle a little (maybe a Tablespoon) wine vinegar or balsamic vinegar on the mix as you continue to stir.  Add 1/2 to 1 cup of chopped walnuts to the mix and stir.  Add a pinch of dry herb mix (basil, oregano, rosemary, thyme, marjoram, cilantro) and mix into the greens. By now you've probably stirred the greens about 5 minutes. Cover the pot and simmer on low heat for 5 minutes but keep an eye on it to prevent scorching the food.  Check and see if the greens are cooked enough to your taste and if ready, serve hot and enjoy!  Finished. ",
  "tyn_model":[
    "kale",
    "garlic",
    "pot",
    "salt",
    "water",
    "onion",
    "olive oil",
    "onions",
    "heating oil",
    "wine vinegar",
    "balsamic vinegar",
    "walnuts",
    "dry herb mix",
    "basil",
    "oregano",
    "rosemary",
    "thyme",
    "marjoram",
    "cilantro"
  ],
  "tyn_section":[

  ]
}