{
  "title":"How to Make Coconut Oil Cakes",
  "url":"https://www.wikihow.com/Make-Coconut-Oil-Cakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "methods":[
    {
      "name":"Making a Coconut Oil Pound Cake",
      "steps":[
        {
          "headline":"Turn on the oven and prepare your pan.",
          "description":"Preheat the oven to 350 degrees F (175 C). Spray a 10-cup capacity Bundt pan with baking spray. Ensure that you completely spray the inside of the pan, especially if your pan has an intricate design. Set your prepared pan aside while you make the cake batter. If you don't have baking spray, rub the inside of the pan with butter or coconut oil. Sprinkle about 1/4 of a cup of flour into the pan and shake it so that the inside is completely greased and floured."
        },
        {
          "headline":"Mix your wet ingredients.",
          "description":"If you have liquid coconut oil, pour 1 cup (200 g) of it into a large mixing bowl. Add 2 cups (450 g) of sugar, 1½ cups (350 ml) of milk, 6 large eggs, 1 teaspoon of vanilla, and the zest from 2 limes into the mixing bowl and whisk until the wet ingredients are completely combined. Set this mixture aside. If your coconut oil is hard, measure it out and melt it in a small saucepan on the stove over low heat. You could also microwave it to liquefy it."
        },
        {
          "headline":"Stir together the dry ingredients.",
          "description":"In a separate mixing bowl, place 3½ cups (440 g) of flour, 3½ teaspoons of baking powder, ¼ teaspoon of grated nutmeg, and ½ teaspoon of salt. Whisk the dry ingredients together for about 30 seconds. Set the dry mixture aside. Whisking the dry ingredients ensures that they absorb the wet ingredients evenly. If you don't have a whisk, try sifting the dry ingredients into your bowl and stirring them."
        },
        {
          "headline":"Combine the wet and dry ingredients.",
          "description":"Sprinkle half of the dry mixture over the wet mixture. Take a spatula and fold the dry ingredients into the wet. Use your wrist to make a circular motion as you mix the ingredients. Add the rest of the dry mixture and finish folding the ingredients just until they're combined. Avoid stirring the batter too much or your cake will be tough and lose volume."
        },
        {
          "headline":"Bake the coconut oil pound cake.",
          "description":"Pour the batter into the prepared Bundt pan and use a spatula to smooth the top. Place the cake into the preheated oven and bake for about 1 hour. The cake will be golden brown and a tester will come out clean when the cake is finished. Since Bundt pans come in a variety of styles, your cake may take more or less time. If you need to add more time, set your timer for 5 minute increments. Keep checking until your cake is baked."
        },
        {
          "headline":"Cool the cake.",
          "description":"Remove the cake from the oven and leave it in the Bundt pan for 15 minutes. You can then flip it out onto a cooling rack to let it finish cooling completely. You can serve the cake immediately or glaze it with a topping of your choice. For an optional coconut glaze, toast 1/2 cup of flaked coconut and add 1/2 cup of sugar, 1 cup of water, and a pinch of salt. Bring the mixture to a boil and stir until the sugar dissolves. Spread this coconut glaze on the cooled cake and let it set before you slice it."
        }
      ]
    },
    {
      "name":"Making a Chocolate Cake with Coconut Oil",
      "steps":[
        {
          "headline":"Turn on the oven and prepare your pan.",
          "description":"Preheat the oven to 350 degrees F (175 C). Spray two 9-inch cake pans with baking spray. If you'd like more layers, you can also bake the cake in three 8-inch cake pans. Set the pans aside while you mix the cake batter. If you want to make cupcakes, you can prepare a muffin tin. This recipe will also make 24 chocolate cupcakes made with coconut oil."
        },
        {
          "headline":"Mix the dry ingredients.",
          "description":"Place 3 cups (375 g) of flour, 2 cups of (450 g) of sugar, 6 tablespoons of cocoa, 2 teaspoons of baking soda, and ½ teaspoon of salt into a large mixing bowl. Whisk the dry ingredients until the mixture is combined. You shouldn't see any pockets of flour or cocoa. Continue whisking until the dry ingredients are a uniform tan color."
        },
        {
          "headline":"Add the wet ingredients.",
          "description":"Pour in 2 cups (470 ml) of cold water into the dry ingredients and turn your mixer on low. While the mixer runs, add ¾ cup (155 g) of coconut oil, 2 tablespoons of white vinegar, and 1 tablespoon of vanilla extract. Keep mixing the ingredients until the batter is smooth. Since this recipe doesn't rely on butter or eggs for volume, you don't need to worry about over beating the cake batter."
        },
        {
          "headline":"Bake the chocolate cake.",
          "description":"Divide the batter among your prepared cake pans. Smooth the tops with an offset spatula and place the cake pans in the preheated oven. If you're using the 9-inch cake pans, bake the cakes for about 30 minutes. If you're using the 8-inch cake pans, bake them for about 25 minutes. Check to see if they're done before removing them from the oven. You can carefully touch the tops of the cakes. They should feel firm and spring back. If your finger leaves an indentation, the cakes need to bake longer. You can also insert a cake tester which should come out clean."
        },
        {
          "headline":"Cool the cake.",
          "description":"Remove the baked cakes from the oven and place them on a cooling rack for 15 to 20 minutes. You can then flip them out of the pans and onto the cooling rack to finish cooling completely. Frost the cakes with any kind of frosting or glaze. Just ensure that the cake is completely cool before you frost it or the frosting will slide off or soak into the cake."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Coconut Oil Pound Cake Turn on the oven and prepare your pan. Preheat the oven to 350 degrees F (175 C). Spray a 10-cup capacity Bundt pan with baking spray. Ensure that you completely spray the inside of the pan, especially if your pan has an intricate design. Set your prepared pan aside while you make the cake batter. If you don't have baking spray, rub the inside of the pan with butter or coconut oil. Sprinkle about 1/4 of a cup of flour into the pan and shake it so that the inside is completely greased and floured. Mix your wet ingredients. If you have liquid coconut oil, pour 1 cup (200 g) of it into a large mixing bowl. Add 2 cups (450 g) of sugar, 1½ cups (350 ml) of milk, 6 large eggs, 1 teaspoon of vanilla, and the zest from 2 limes into the mixing bowl and whisk until the wet ingredients are completely combined. Set this mixture aside. If your coconut oil is hard, measure it out and melt it in a small saucepan on the stove over low heat. You could also microwave it to liquefy it. Stir together the dry ingredients. In a separate mixing bowl, place 3½ cups (440 g) of flour, 3½ teaspoons of baking powder, ¼ teaspoon of grated nutmeg, and ½ teaspoon of salt. Whisk the dry ingredients together for about 30 seconds. Set the dry mixture aside. Whisking the dry ingredients ensures that they absorb the wet ingredients evenly. If you don't have a whisk, try sifting the dry ingredients into your bowl and stirring them. Combine the wet and dry ingredients. Sprinkle half of the dry mixture over the wet mixture. Take a spatula and fold the dry ingredients into the wet. Use your wrist to make a circular motion as you mix the ingredients. Add the rest of the dry mixture and finish folding the ingredients just until they're combined. Avoid stirring the batter too much or your cake will be tough and lose volume. Bake the coconut oil pound cake. Pour the batter into the prepared Bundt pan and use a spatula to smooth the top. Place the cake into the preheated oven and bake for about 1 hour. The cake will be golden brown and a tester will come out clean when the cake is finished. Since Bundt pans come in a variety of styles, your cake may take more or less time. If you need to add more time, set your timer for 5 minute increments. Keep checking until your cake is baked. Cool the cake. Remove the cake from the oven and leave it in the Bundt pan for 15 minutes. You can then flip it out onto a cooling rack to let it finish cooling completely. You can serve the cake immediately or glaze it with a topping of your choice. For an optional coconut glaze, toast 1/2 cup of flaked coconut and add 1/2 cup of sugar, 1 cup of water, and a pinch of salt. Bring the mixture to a boil and stir until the sugar dissolves. Spread this coconut glaze on the cooled cake and let it set before you slice it. Making a Chocolate Cake with Coconut Oil Turn on the oven and prepare your pan. Preheat the oven to 350 degrees F (175 C). Spray two 9-inch cake pans with baking spray. If you'd like more layers, you can also bake the cake in three 8-inch cake pans. Set the pans aside while you mix the cake batter. If you want to make cupcakes, you can prepare a muffin tin. This recipe will also make 24 chocolate cupcakes made with coconut oil. Mix the dry ingredients. Place 3 cups (375 g) of flour, 2 cups of (450 g) of sugar, 6 tablespoons of cocoa, 2 teaspoons of baking soda, and ½ teaspoon of salt into a large mixing bowl. Whisk the dry ingredients until the mixture is combined. You shouldn't see any pockets of flour or cocoa. Continue whisking until the dry ingredients are a uniform tan color. Add the wet ingredients. Pour in 2 cups (470 ml) of cold water into the dry ingredients and turn your mixer on low. While the mixer runs, add ¾ cup (155 g) of coconut oil, 2 tablespoons of white vinegar, and 1 tablespoon of vanilla extract. Keep mixing the ingredients until the batter is smooth. Since this recipe doesn't rely on butter or eggs for volume, you don't need to worry about over beating the cake batter. Bake the chocolate cake. Divide the batter among your prepared cake pans. Smooth the tops with an offset spatula and place the cake pans in the preheated oven. If you're using the 9-inch cake pans, bake the cakes for about 30 minutes. If you're using the 8-inch cake pans, bake them for about 25 minutes. Check to see if they're done before removing them from the oven. You can carefully touch the tops of the cakes. They should feel firm and spring back. If your finger leaves an indentation, the cakes need to bake longer. You can also insert a cake tester which should come out clean. Cool the cake. Remove the baked cakes from the oven and place them on a cooling rack for 15 to 20 minutes. You can then flip them out of the pans and onto the cooling rack to finish cooling completely. Frost the cakes with any kind of frosting or glaze. Just ensure that the cake is completely cool before you frost it or the frosting will slide off or soak into the cake. Finished. ",
  "tyn_model":[
    "coconut oil",
    "oven",
    "cake pans",
    "flour",
    "sugar",
    "baking spray",
    "salt",
    "bundt pan",
    "butter",
    "large mixing bowl",
    "eggs",
    "mixing bowl",
    "spatula",
    "cake batter",
    "mixer",
    "milk",
    "vanilla",
    "small saucepan",
    "baking powder",
    "grated nutmeg",
    "whisk",
    "bowl",
    "pound cake",
    "bundt pans",
    "coconut glaze",
    "coconut",
    "water",
    "9-inch cake pans",
    "muffin tin",
    "cocoa",
    "baking soda",
    "cold water",
    "white vinegar",
    "vanilla extract",
    "chocolate cake",
    "offset spatula",
    "cake tester",
    "pans",
    "cooling rack"
  ],
  "tyn_section":[

  ]
}