{
  "title":"How to Save 10 Dollars a Day",
  "url":"https://www.wikihow.com/Save-10-Dollars-a-Day",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Changing Your Habits",
      "steps":[
        {
          "headline":"Eat out less.",
          "description":"Eating at restaurants instead of cooking at home can cost a lot of money. Instead of purchasing a quick meal at a restaurant, consider buying ingredients at a grocery store and cooking at home. For lunch you can make sandwiches at home the night before. The average American spends $232 a month eating at restaurants. Divide that by the typical 30-day month, and you save $7.73 per day."
        },
        {
          "headline":"Don't impulsively buy things.",
          "description":"Impulsive buying can ruin your $10-a-day savings plan. Instead of buying a product on the spot just because it catches your eye, give yourself a day to think before purchasing it. When you think about buying something, determine how necessary it is and how much it would actually benefit you. If you see a magazine or some candy placed temptingly near the check-out register, remind yourself what your long-term goals are, and simply pass such items by. The average candy bar costs $1.14."
        },
        {
          "headline":"Track your spending throughout the month.",
          "description":"Keep good records on the things that you're spending money on, even if they're small transactions. You can create a spreadsheet and update it when you get home, or you can download an app that helps you track your purchases throughout the month. Diligence and accuracy are important so that you can look over your expenses in a realistic and objective way. The most useful spending-tracker apps include BillGuard, Dollarbird, and Fudget. Purchases you should track include food, gas, clothing, entertainment, cleaning supplies, coffee, and snacks."
        },
        {
          "headline":"Determine what's really necessary.",
          "description":"Once you've tracked all your purchases throughout a given month, you'll be better able to focus on necessary costs like housing, food, and transportation. Give yourself a baseline for how much you should be spending on these things. Try to maintain a cushion for emergencies. Inevitable repairs or medical problems will come along to disrupt your budget. Gradually build up some savings to set aside for those events. That makes it harder, of course, to save for retirement, but ultimately you'll come out ahead if you have money set aside for emergencies instead of having to borrow to meet them."
        },
        {
          "headline":"Quit smoking.",
          "description":"Any habitual vice costs money. It can really add up over time. If you are a smoker, every pack costs you more than $5. The average smoker spends more than $2,000 a year on the habit. In some locations the cost is considerably higher than that. Vices like drinking and smoking take a toll on your health, too, which could cost you dearly in future medical bills."
        }
      ]
    },
    {
      "name":"Putting Away Exactly $10 Daily",
      "steps":[
        {
          "headline":"Create a separate bank account.",
          "description":"This can allow you to save your money without being tempted to spend it. There are things you can do to prevent yourself from being tempted to deplete your savings, such as opting out of a bank or debit card. Deposit your money into a money-market account, so it can earn interest over time. Regular savings accounts pay very little interest. Online banks that pay more than 1% annually include, Synchrony Bank, Ally Bank, and Barclays. Bank interest rates are variable and change with the market."
        },
        {
          "headline":"Decide how much you'll deduct from your paycheck.",
          "description":"Determine how much has to come out of your paycheck to save $10 a day. For instance, if you get paid on a weekly basis, you'll need to save $70 from your paycheck. If you get paid bi-weekly or monthly, you'll have to save $140 or $280, respectively. If you receive tips, it will be easy to set aside exactly $10 per day."
        },
        {
          "headline":"Set up automatic deductions from your paycheck.",
          "description":"Many banks allow you to transfer automatic paycheck deductions from a checking account to a savings account when you get paid. If you want to stay on track with your $10-a-day savings plan, set up these automatic deductions to make the process easier. Call your bank or go on their website to see if they offer this service."
        },
        {
          "headline":"Set up a Roth IRA.",
          "description":"This is a great retirement savings plan for younger people with a modest income. If your median household income is around $50,000, you can open a Roth IRA and make contributions monthly. Discuss with a financial advisor opening up a such a retirement account. You'll want to contribute $300 a month to achieve your ten-dollar-a-day goal. You can contribute up to $5,500 a year to your Roth IRA. To learn more about setting up a Roth IRA, read Open a Roth IRA Account."
        }
      ]
    },
    {
      "name":"Reducing Your Spending",
      "steps":[
        {
          "headline":"Take advantage of sales.",
          "description":"Actively look for deals while you shop. If something is discounted or cheaper than usual, you can save money. Register for discount cards at stores that you frequently shop at, and follow your favorite store's social media accounts so you'll see  announcements for promotions and sales. Learn supermarket sale cycles, as sales change month to month. Purchase items when they are at their lowest possible price. For example, in January, foods like celery, avocado, and broccoli are typically on sale. Take advantage of clothes sales cycles as well. You can get great deals on winter or summer clothing at the end of each season."
        },
        {
          "headline":"Use coupons.",
          "description":"Find coupons in newspapers, magazines, catalog inserts, and online. Figure out what stores and brands offer coupon discounts. Find stores that allow you to combine different coupons for more savings. Some stores will allow you to \"stack\" store and brand coupons together. Some stores will honor competitors' coupons; others will simply match prices. Stores that allow you to use competitors' coupons include Bed Bath & Beyond, Dick’s Sporting Goods, and Office Depot. Price matching means that a store will meet a competitor's price on a product. Stores that do this include Walmart, Amazon, and Staples. Combining coupons with sales can allow you to pay even less. Doing all of these things together could result in hundreds of dollars in savings when you go grocery shopping."
        },
        {
          "headline":"Avoid ATM fees.",
          "description":"Don't withdraw money from non-bank-sponsored ATMs, because they could charge a fee on top of what your bank typically charges. This could add up to a lot of money over time. When you can, use your debit card, or withdraw money from your bank's ATM if there is no fee associated. If there is a fee, just make the withdrawal through a teller. Withdrawing money from a non-bank-sponsored ATM averages more than $4 in bank fees."
        },
        {
          "headline":"Pay bills on time to avoid late fees and interest.",
          "description":"You can face penalty fees on most of your monthly bills if you fail to pay them on time. Watch for the arrival of bills, including credit cards, utilities, rent, insurance, and loans. Paying all of your bills on time will save you a lot of money over time."
        }
      ]
    },
    {
      "name":"Using Alternatives",
      "steps":[
        {
          "headline":"Drink water instead of soda or juice.",
          "description":"Drinking water instead of juice can save you a lot of money. Don't purchase bottled water. When you go to a restaurant ask for tap water instead of bottled. In a week the average person might spend almost $15 on coffee. If you drink coffee regularly, try cutting it out of your daily routine. At the very least, make your own coffee instead of buying it at a coffee shop."
        },
        {
          "headline":"Find lower-cost substitutes.",
          "description":"Most products come in a variety of brands. Some cost less than others. Replace high-cost brands with more affordable substitutes for things like food and gas. Think of other substitutions you can make that will save you money every day. Another way to save is to go to a public library instead of a bookstore. Visit a free park rather than an attraction that charges an entrance fee."
        },
        {
          "headline":"Walk or a ride a bike instead of driving.",
          "description":"Driving can cost a lot of money in gas, insurance and maintenance. Public transportation is cheaper than driving but not as cheap -- or as good for you -- as walking or riding a bike. BicycleUniverse.info has a useful tool that can tell you how much money you'll save biking and walking vs. using a car."
        },
        {
          "headline":"Look for free or low-cost activities.",
          "description":"Social activities can quickly add up to big bucks if you like to go out frequently. Instead of spending money on social time, consider finding low-cost or free activities. Search online and see if there are any free parks around you, free screenings of movies, or \"pay what you want\" days at local museums. If you're a student or senior, you may be eligible for a discount at your local museum. Other free activities include playing board games, going on a hike, or joining a community sports league."
        }
      ]
    }
  ],
  "text":" Changing Your Habits Eat out less. Eating at restaurants instead of cooking at home can cost a lot of money. Instead of purchasing a quick meal at a restaurant, consider buying ingredients at a grocery store and cooking at home. For lunch you can make sandwiches at home the night before. The average American spends $232 a month eating at restaurants. Divide that by the typical 30-day month, and you save $7.73 per day. Don't impulsively buy things. Impulsive buying can ruin your $10-a-day savings plan. Instead of buying a product on the spot just because it catches your eye, give yourself a day to think before purchasing it. When you think about buying something, determine how necessary it is and how much it would actually benefit you. If you see a magazine or some candy placed temptingly near the check-out register, remind yourself what your long-term goals are, and simply pass such items by. The average candy bar costs $1.14. Track your spending throughout the month. Keep good records on the things that you're spending money on, even if they're small transactions. You can create a spreadsheet and update it when you get home, or you can download an app that helps you track your purchases throughout the month. Diligence and accuracy are important so that you can look over your expenses in a realistic and objective way. The most useful spending-tracker apps include BillGuard, Dollarbird, and Fudget. Purchases you should track include food, gas, clothing, entertainment, cleaning supplies, coffee, and snacks. Determine what's really necessary. Once you've tracked all your purchases throughout a given month, you'll be better able to focus on necessary costs like housing, food, and transportation. Give yourself a baseline for how much you should be spending on these things. Try to maintain a cushion for emergencies. Inevitable repairs or medical problems will come along to disrupt your budget. Gradually build up some savings to set aside for those events. That makes it harder, of course, to save for retirement, but ultimately you'll come out ahead if you have money set aside for emergencies instead of having to borrow to meet them. Quit smoking. Any habitual vice costs money. It can really add up over time. If you are a smoker, every pack costs you more than $5. The average smoker spends more than $2,000 a year on the habit. In some locations the cost is considerably higher than that. Vices like drinking and smoking take a toll on your health, too, which could cost you dearly in future medical bills. Putting Away Exactly $10 Daily Create a separate bank account. This can allow you to save your money without being tempted to spend it. There are things you can do to prevent yourself from being tempted to deplete your savings, such as opting out of a bank or debit card. Deposit your money into a money-market account, so it can earn interest over time. Regular savings accounts pay very little interest. Online banks that pay more than 1% annually include, Synchrony Bank, Ally Bank, and Barclays. Bank interest rates are variable and change with the market. Decide how much you'll deduct from your paycheck. Determine how much has to come out of your paycheck to save $10 a day. For instance, if you get paid on a weekly basis, you'll need to save $70 from your paycheck. If you get paid bi-weekly or monthly, you'll have to save $140 or $280, respectively. If you receive tips, it will be easy to set aside exactly $10 per day. Set up automatic deductions from your paycheck. Many banks allow you to transfer automatic paycheck deductions from a checking account to a savings account when you get paid. If you want to stay on track with your $10-a-day savings plan, set up these automatic deductions to make the process easier. Call your bank or go on their website to see if they offer this service. Set up a Roth IRA. This is a great retirement savings plan for younger people with a modest income. If your median household income is around $50,000, you can open a Roth IRA and make contributions monthly. Discuss with a financial advisor opening up a such a retirement account. You'll want to contribute $300 a month to achieve your ten-dollar-a-day goal. You can contribute up to $5,500 a year to your Roth IRA. To learn more about setting up a Roth IRA, read Open a Roth IRA Account. Reducing Your Spending Take advantage of sales. Actively look for deals while you shop. If something is discounted or cheaper than usual, you can save money. Register for discount cards at stores that you frequently shop at, and follow your favorite store's social media accounts so you'll see  announcements for promotions and sales. Learn supermarket sale cycles, as sales change month to month. Purchase items when they are at their lowest possible price. For example, in January, foods like celery, avocado, and broccoli are typically on sale. Take advantage of clothes sales cycles as well. You can get great deals on winter or summer clothing at the end of each season. Use coupons. Find coupons in newspapers, magazines, catalog inserts, and online. Figure out what stores and brands offer coupon discounts. Find stores that allow you to combine different coupons for more savings. Some stores will allow you to \"stack\" store and brand coupons together. Some stores will honor competitors' coupons; others will simply match prices. Stores that allow you to use competitors' coupons include Bed Bath & Beyond, Dick’s Sporting Goods, and Office Depot. Price matching means that a store will meet a competitor's price on a product. Stores that do this include Walmart, Amazon, and Staples. Combining coupons with sales can allow you to pay even less. Doing all of these things together could result in hundreds of dollars in savings when you go grocery shopping. Avoid ATM fees. Don't withdraw money from non-bank-sponsored ATMs, because they could charge a fee on top of what your bank typically charges. This could add up to a lot of money over time. When you can, use your debit card, or withdraw money from your bank's ATM if there is no fee associated. If there is a fee, just make the withdrawal through a teller. Withdrawing money from a non-bank-sponsored ATM averages more than $4 in bank fees. Pay bills on time to avoid late fees and interest. You can face penalty fees on most of your monthly bills if you fail to pay them on time. Watch for the arrival of bills, including credit cards, utilities, rent, insurance, and loans. Paying all of your bills on time will save you a lot of money over time. Using Alternatives Drink water instead of soda or juice. Drinking water instead of juice can save you a lot of money. Don't purchase bottled water. When you go to a restaurant ask for tap water instead of bottled. In a week the average person might spend almost $15 on coffee. If you drink coffee regularly, try cutting it out of your daily routine. At the very least, make your own coffee instead of buying it at a coffee shop. Find lower-cost substitutes. Most products come in a variety of brands. Some cost less than others. Replace high-cost brands with more affordable substitutes for things like food and gas. Think of other substitutions you can make that will save you money every day. Another way to save is to go to a public library instead of a bookstore. Visit a free park rather than an attraction that charges an entrance fee. Walk or a ride a bike instead of driving. Driving can cost a lot of money in gas, insurance and maintenance. Public transportation is cheaper than driving but not as cheap -- or as good for you -- as walking or riding a bike. BicycleUniverse.info has a useful tool that can tell you how much money you'll save biking and walking vs. using a car. Look for free or low-cost activities. Social activities can quickly add up to big bucks if you like to go out frequently. Instead of spending money on social time, consider finding low-cost or free activities. Search online and see if there are any free parks around you, free screenings of movies, or \"pay what you want\" days at local museums. If you're a student or senior, you may be eligible for a discount at your local museum. Other free activities include playing board games, going on a hike, or joining a community sports league.",
  "tyn_model":[
    "roth ira",
    "coupons",
    "water",
    "coffee",
    "smoker",
    "candy",
    "candy bar",
    "food",
    "smoking",
    "money-market account",
    "financial advisor",
    "celery",
    "avocado",
    "broccoli",
    "office depot",
    "atm"
  ],
  "tyn_section":[

  ]
}