{
  "title":"How to Fix Common Indoor Herb Garden Problems",
  "url":"https://www.wikihow.com/Fix-Common-Indoor-Herb-Garden-Problems",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Ensuring the Right Environment",
      "steps":[
        {
          "headline":"Make sure your plants get enough light.",
          "description":"One major problem with household herbs is a lack of light. If your herbs seem to be wilting, make sure they have enough access to quality natural or artificial light. This may correct the problem and lead to your herbs growing strong. Herbs require natural light to thrive and cannot grow adequately with regular household lights. For the best results, place your herbs near a window or allow them exposure to a natural light source. If this is not an option, stop by a local indoor gardening store or nursery. You can pick up some LED grow lights that will allow your herbs to thrive. Regular light bulbs will not help your herbs grow."
        },
        {
          "headline":"Keep the environment adequately humid.",
          "description":"A common problem with indoor herb gardens is a lack of humidity. In general, the insides of homes and apartments are less humid than the outdoors. Heaters, air conditioners, and other appliances can dry out air, causing herbs to wilt. Mist your plants once a day with a spray bottle. If the air in your home is very dry, invest in a humidifier. Keep that running in the room where you're growing your herbs."
        },
        {
          "headline":"Do not place your plants by radiators, stoves, and air vents.",
          "description":"These places tend to be very dry. They can also cause sudden fluctuations in temperature, which is bad for herb plants. If your herbs are by a radiator, stove, or an air vent, move them elsewhere right away to prevent problems from occurring. Some herbs require specific temperatures during the germination period. Sage seeds, for example, will not grow if the temperature is not between 60 and 70 degrees Fahrenheit. When planting herbs, be particularly careful about avoiding temperature hazards."
        },
        {
          "headline":"See if you have room on your balcony.",
          "description":"Natural light is always best for herbs. If you have access to a balcony, and the weather does not get too cold in your area, this is the best place to place your herbs. This works best if you have a balcony facing east or west. Keep in mind that overcrowding your balcony with herbs can slow the growth of your plants. You can also look into planting in an exterior window box, if you have one."
        }
      ]
    },
    {
      "name":"Correcting Common Mistakes",
      "steps":[
        {
          "headline":"Watch for symptoms of overwatering.",
          "description":"Overwatering is a very common mistake people make with indoor plants. Make sure you research the water requirements for your plants or ask someone at a local plant nursery about the precise amount of water your plants need. If you notice your soil appears waterlogged, you are overwatering and should reduce the amount of water your plant is receiving. Overwatering can be confusing, as the symptoms can mimic those of under watering. The plant may look wilted and yellow. In extreme cases, the plant may collapse. If you've been watering your plant daily, and the soil is noticeably moist, the issue is probably over watering and not under watering. How often a plant needs to be watered depends on the humidity of your home and how much sun it's getting. Only water herbs when the soil surrounding them is dry to the touch."
        },
        {
          "headline":"Make sure you're using the right soil.",
          "description":"You should not select just any soil for an herb garden, and it's not always best to take soil from outdoors. Instead, purchase a high quality potting mix from a local greenhouse. Make sure to select a mix that is specifically used for potted plants. Mixes designed for outdoor plants will be too heavy and will dry out too easily. With the right soil, monitoring things like pH levels is unnecessary. A quality potting soil should already have the right nutrients and the label should provide suggestions for things like fertilizers. With parsley, be careful of getting soil on the leaves themselves. Outdoors, parsley frequently gets muddied with soil during heavy rainfall. When planting parsley in new soil, be careful not to get soil on the leaves. Gently wipe off any soil that gets on your parsley."
        },
        {
          "headline":"Switch the type of plant you're using.",
          "description":"Not all herbs will work in certain situations. Some herbs may not thrive indoors as well as others. Review the herbs you're using and be honest with yourself about whether they work for your specific situation. If you can't provide more than 2 to 4 hours a day of natural sunlight, this limits the types of plants you can grow. Luckily, mint, cilantro, parsley, wasabi, and wild garlic can thrive in the shade. If you have access to a lot of natural light year round, you should be able to grow most herbs indoors without a problem."
        },
        {
          "headline":"Address chlorosis quickly.",
          "description":"Chlorosis is a common problem people encounter when growing herbs indoors. It can be spotted if the leaves turn yellow while the veins of the plant remain green. Usually, this is due to poor drainage. You can spot poor drainage if your soil looks like sludge. Install another drainage hole in your pot if you notice poor drainage. You also may need to water less if your plant is displaying signs of being overwatered. If you've ruled out poor drainage, your soil may have an iron deficiency. This can be solved by purchasing chelated iron at a local nursery. Follow the instructions on the package for use."
        },
        {
          "headline":"Lower your use of fertilizer if you notice your leaves' tips burning.",
          "description":"Burnt tips are when the tips of your plant look brown or black. This is usually an indication you're over-fertilizing. If you notice burnt tips, cut back on your fertilizer. Usually, the salt in fertilizer is the culprit with burnt tips. To return the soil to a better state, water the pot until water begins flowing quickly from drainage holes."
        }
      ]
    },
    {
      "name":"Keeping Up with General Care",
      "steps":[
        {
          "headline":"Prune your plants regularly.",
          "description":"Many problems with indoor herbs stem from a lack of pruning. You need to be vigilant about pruning your plants to prevent problems from developing. Once herbs are 3 to 4 inches (7.6 to 10 cm) above the ground and have three grown sets of leaves, you can safely prune them for the first time. Make sure to only trim above a growing set of leaves."
        },
        {
          "headline":"Eliminate flowers right away.",
          "description":"Once flowering occurs, this signals to the plant that the growing stage has ended. Herbs will die shortly after flowering. Trim any flowers from the plant as soon as you see them developing. This will encourage your herbs to grow into edible plants rather than flowers. You won't be able to stop your herbs from flowering forever, but you can prolong the process by trimming off flowers when they appear."
        },
        {
          "headline":"Control exposure to bugs.",
          "description":"Many people neglect to realize that bugs are a hazard indoors as well as outdoors. You can use a commercial bug spray or pesticide if it's safe to use in your home. You can also try more natural methods. For natural solutions, you can wipe off pests as you see them. You can also use the natural pesticide neem oil to keep bugs away. Spider mites are a particular problem with rosemary, so be on the lookout for small spiders around the size of a grain of pepper. They can be red, white, brown, or black and should be removed from the plant right away."
        }
      ]
    }
  ],
  "text":" Ensuring the Right Environment Make sure your plants get enough light. One major problem with household herbs is a lack of light. If your herbs seem to be wilting, make sure they have enough access to quality natural or artificial light. This may correct the problem and lead to your herbs growing strong. Herbs require natural light to thrive and cannot grow adequately with regular household lights. For the best results, place your herbs near a window or allow them exposure to a natural light source. If this is not an option, stop by a local indoor gardening store or nursery. You can pick up some LED grow lights that will allow your herbs to thrive. Regular light bulbs will not help your herbs grow. Keep the environment adequately humid. A common problem with indoor herb gardens is a lack of humidity. In general, the insides of homes and apartments are less humid than the outdoors. Heaters, air conditioners, and other appliances can dry out air, causing herbs to wilt. Mist your plants once a day with a spray bottle. If the air in your home is very dry, invest in a humidifier. Keep that running in the room where you're growing your herbs. Do not place your plants by radiators, stoves, and air vents. These places tend to be very dry. They can also cause sudden fluctuations in temperature, which is bad for herb plants. If your herbs are by a radiator, stove, or an air vent, move them elsewhere right away to prevent problems from occurring. Some herbs require specific temperatures during the germination period. Sage seeds, for example, will not grow if the temperature is not between 60 and 70 degrees Fahrenheit. When planting herbs, be particularly careful about avoiding temperature hazards. See if you have room on your balcony. Natural light is always best for herbs. If you have access to a balcony, and the weather does not get too cold in your area, this is the best place to place your herbs. This works best if you have a balcony facing east or west. Keep in mind that overcrowding your balcony with herbs can slow the growth of your plants. You can also look into planting in an exterior window box, if you have one. Correcting Common Mistakes Watch for symptoms of overwatering. Overwatering is a very common mistake people make with indoor plants. Make sure you research the water requirements for your plants or ask someone at a local plant nursery about the precise amount of water your plants need. If you notice your soil appears waterlogged, you are overwatering and should reduce the amount of water your plant is receiving. Overwatering can be confusing, as the symptoms can mimic those of under watering. The plant may look wilted and yellow. In extreme cases, the plant may collapse. If you've been watering your plant daily, and the soil is noticeably moist, the issue is probably over watering and not under watering. How often a plant needs to be watered depends on the humidity of your home and how much sun it's getting. Only water herbs when the soil surrounding them is dry to the touch. Make sure you're using the right soil. You should not select just any soil for an herb garden, and it's not always best to take soil from outdoors. Instead, purchase a high quality potting mix from a local greenhouse. Make sure to select a mix that is specifically used for potted plants. Mixes designed for outdoor plants will be too heavy and will dry out too easily. With the right soil, monitoring things like pH levels is unnecessary. A quality potting soil should already have the right nutrients and the label should provide suggestions for things like fertilizers. With parsley, be careful of getting soil on the leaves themselves. Outdoors, parsley frequently gets muddied with soil during heavy rainfall. When planting parsley in new soil, be careful not to get soil on the leaves. Gently wipe off any soil that gets on your parsley. Switch the type of plant you're using. Not all herbs will work in certain situations. Some herbs may not thrive indoors as well as others. Review the herbs you're using and be honest with yourself about whether they work for your specific situation. If you can't provide more than 2 to 4 hours a day of natural sunlight, this limits the types of plants you can grow. Luckily, mint, cilantro, parsley, wasabi, and wild garlic can thrive in the shade. If you have access to a lot of natural light year round, you should be able to grow most herbs indoors without a problem. Address chlorosis quickly. Chlorosis is a common problem people encounter when growing herbs indoors. It can be spotted if the leaves turn yellow while the veins of the plant remain green. Usually, this is due to poor drainage. You can spot poor drainage if your soil looks like sludge. Install another drainage hole in your pot if you notice poor drainage. You also may need to water less if your plant is displaying signs of being overwatered. If you've ruled out poor drainage, your soil may have an iron deficiency. This can be solved by purchasing chelated iron at a local nursery. Follow the instructions on the package for use. Lower your use of fertilizer if you notice your leaves' tips burning. Burnt tips are when the tips of your plant look brown or black. This is usually an indication you're over-fertilizing. If you notice burnt tips, cut back on your fertilizer. Usually, the salt in fertilizer is the culprit with burnt tips. To return the soil to a better state, water the pot until water begins flowing quickly from drainage holes. Keeping Up with General Care Prune your plants regularly. Many problems with indoor herbs stem from a lack of pruning. You need to be vigilant about pruning your plants to prevent problems from developing. Once herbs are 3 to 4 inches (7.6 to 10 cm) above the ground and have three grown sets of leaves, you can safely prune them for the first time. Make sure to only trim above a growing set of leaves. Eliminate flowers right away. Once flowering occurs, this signals to the plant that the growing stage has ended. Herbs will die shortly after flowering. Trim any flowers from the plant as soon as you see them developing. This will encourage your herbs to grow into edible plants rather than flowers. You won't be able to stop your herbs from flowering forever, but you can prolong the process by trimming off flowers when they appear. Control exposure to bugs. Many people neglect to realize that bugs are a hazard indoors as well as outdoors. You can use a commercial bug spray or pesticide if it's safe to use in your home. You can also try more natural methods. For natural solutions, you can wipe off pests as you see them. You can also use the natural pesticide neem oil to keep bugs away. Spider mites are a particular problem with rosemary, so be on the lookout for small spiders around the size of a grain of pepper. They can be red, white, brown, or black and should be removed from the plant right away.",
  "tyn_model":[
    "herbs",
    "water",
    "parsley",
    "soil",
    "fertilizer",
    "humidity",
    "heaters",
    "air conditioners",
    "spray bottle",
    "humidifier",
    "radiator",
    "stove",
    "air vent",
    "balcony",
    "potting mix",
    "potting soil",
    "cilantro",
    "garlic",
    "pot",
    "iron",
    "bug spray",
    "pesticide",
    "rosemary",
    "pepper"
  ],
  "tyn_section":[

  ]
}