{
  "title":"How to Make a Healthy Omelet",
  "url":"https://www.wikihow.com/Make-a-Healthy-Omelet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Omelets"
  ],
  "methods":[
    {
      "name":"Choosing Between Eggs and Egg Whites",
      "steps":[
        {
          "headline":"Consider the nutritional value of egg yolks.",
          "description":"Though whole eggs contain a bit more protein than egg whites, their relative value comes from nutrients and vitamins that are plentiful in the egg yolk. For instance, even a small raw egg contains meaningful amounts of iron, phosphorus, zinc, and folate. Further, yolks also contain good vitamins A and D, as well as a bunch of choline, lutein, and zeaxanthin, all of which your body needs."
        },
        {
          "headline":"Substitute egg whites to limit cholesterol.",
          "description":"One small whole egg contains 54 calories and 47% of your daily allotment of cholesterol, while the equivalent amount of egg whites contains only 17 calories and 0 cholesterol. If you’re counting calories or watching your cholesterol intake, egg whites may be the better option. Otherwise, whole eggs may be the better option, as they contain many healthy vitamins and nutrients. For egg whites, there is variation in flavor and consistency between different brands. If you don’t like the first type of egg whites you try, switch brands and try another - some cook more easily than others too. Follow the container for the equivalent amount of egg white to use in exchange for whole eggs. Usually, two of the “equivalent” amount will cook up to about as much as one whole egg, in terms of size. You can also make your own egg whites by removing the yolks from eggs yourself. There are several easy ways to do so at home."
        },
        {
          "headline":"Buy local, cage free, and organic.",
          "description":"The best place to get eggs is a local farmer’s market. Not only will they be fresh and flavorful, they often come from healthier hens. At the grocery store, opt for cage-free, organic eggs or egg whites. These will ensure that the hens were not fed unhealthy food that may translate into health risks for you."
        },
        {
          "headline":"Use whole eggs and egg whites together.",
          "description":"A solid compromise is to use egg whites along with a whole egg. For a personal omelet, use one whole egg and two egg whites. (This is the rough equivalent of four egg whites or two whole eggs.) This effectively maximizes the protein to calorie ratio of your omelet."
        }
      ]
    },
    {
      "name":"Selecting Healthy Ingredients",
      "steps":[
        {
          "headline":"Strengthen an omelet with spinach.",
          "description":"Spinach adds several healthy benefits to your omelet. In particular, it’s got a ton of iron, which will help you stay healthy and gain strength. It’s also got a good amount of filling fiber and a bunch of magnesium, which is vital to both neurological and metabolic health. Perhaps best of all, there is no need to worry about how much you add - throw in as much as you’d like. For example, make a spinach and low-fat cottage cheese omelet. Add tomatoes, and season with salt and pepper."
        },
        {
          "headline":"Bulk up the omelet with bell peppers.",
          "description":"Another great vegetable to add to your omelet is bell pepper. Just ¼ cup of chopped peppers will provide more than enough vitamin C. Add whichever color bell pepper you prefer. Aside from supporting your immune system, vitamin C can help your body burn fat and convert carbs into usable fuel. Further, it can even help your muscles grow and recover after a workout."
        },
        {
          "headline":"Make a mostly veggie omelet.",
          "description":"There a plenty of veggies you can add to your omelet. In fact, creatively changing up your omelets can help make a staple meal into an ongoing (and delicious) experiment of new dishes. For instance, adding two or three ounces of a cooked vegetable can make an omelet both healthier and more filling. Especially enjoyable additions include asparagus, zucchini, mushrooms, eggplant, tomato, and avocado."
        },
        {
          "headline":"Add black beans.",
          "description":"Another way to add fiber - and good fiber at that - is by adding beans to your omelet. The benefit of doing so is two fold: you’ll stay full for longer, and your body will lose body fat more easily. Soluble fiber also helps reduce some of your cholesterol levels, counteracting some of the cholesterol found in eggs. Add diced tomatoes, garlic powder, and cayenne for a southwest-inspired flavor profile."
        },
        {
          "headline":"Use light cheese and lean meat.",
          "description":"Cheese is one of the main sources of saturated fat and cholesterol in many people’s diets. Meat is another. The healthiest route is foregoing meat and cheese in your omelet altogether, but you can get away with using a bit of reduced fat cheese and lean meat options. For instance, make a ham and cheese omelet with two egg whites, ¾ ounce of reduced fat Swiss cheese, an ounce of extra-lean ham (about ¼ cup, cubed), and scallions to bring out the omelet’s flavor."
        },
        {
          "headline":"Mix in some quinoa.",
          "description":"Omelets aren’t just for breakfast anymore. You can make an especially savory omelet by adding quinoa, which will add both flavor and texture normally foreign to egg-based dishes. Plus, quinoa is the grain with the most protein, and contains especially healthy unsaturated fats as well as filling fiber. Try adding a ¼ cup of cooked quinoa with spinach, tomatoes, and kalamata olives. Season this one with cumin."
        }
      ]
    },
    {
      "name":"Cooking Your Omelet",
      "steps":[
        {
          "headline":"Opt for coconut oil.",
          "description":"While extra-virgin olive oil is a perfectly good option, coconut oil can actually help you lose weight. As such, it’s one of the best options to grease your pan. Use a tablespoon or so, and let it fully melt before adding eggs. The coconut flavor will be subtle, if you even notice it. If you do, add turmeric to season the omelet. These two lead to great flavor combination. While butter will work, it's much less healthy. If you insist on using butter, don't overdo it. Two teaspoons is plenty to grease your pan."
        },
        {
          "headline":"Ensure your omelet won’t stick.",
          "description":"Add oil to the pan. Both eggs and egg whites are notorious for sticking to cookware. Even with a well-seasoned cast iron skillet, you’ll want to make sure your pan is ready to resist your omelet’s likely stickiness. Wait for the pan to heat up before adding the eggs. The oil should be sending up thin wisps of smoke, so that when the eggs hit, they’ll sizzle. Don’t cook anything in the pan beforehand. Residue from other ingredients will cause egg whites in particular to stick. If you want to cook other ingredients before you put together your omelet, do so in a separate pan or wipe the pan clean before cooking the eggs."
        },
        {
          "headline":"Limit stirring.",
          "description":"Leave eggs or egg whites alone for 15 seconds after you put them in the pan. Use a spatula to push back eggs that have set every couple seconds thereafter, with the burner on medium to medium-high. Tilt the pan to help uncooked egg get into contact with the pan, and continue as such until the egg no longer runs. Turn the heat down to low add whatever ingredients you’re including. Finally, fold one half of the omelet over onto the other, let it settle for a few minutes in the pan, and viola!"
        },
        {
          "headline":"Season predominantly with pepper.",
          "description":"Black pepper contains a compound called piperine, which can add spice to your omelet, and fight the formation of new fat cells too. As a rule of thumb, use a bit more pepper than salt. (This helps keep your salt amount low too.) Feel free to mix in other herbs and spices at liberty. These will offer additional flavor that add to the enjoyment and fulfillment you derive from your meal. Try basil, turmeric, dill, rosemary, thyme, and more."
        }
      ]
    }
  ],
  "text":" Choosing Between Eggs and Egg Whites Consider the nutritional value of egg yolks. Though whole eggs contain a bit more protein than egg whites, their relative value comes from nutrients and vitamins that are plentiful in the egg yolk. For instance, even a small raw egg contains meaningful amounts of iron, phosphorus, zinc, and folate. Further, yolks also contain good vitamins A and D, as well as a bunch of choline, lutein, and zeaxanthin, all of which your body needs. Substitute egg whites to limit cholesterol. One small whole egg contains 54 calories and 47% of your daily allotment of cholesterol, while the equivalent amount of egg whites contains only 17 calories and 0 cholesterol. If you’re counting calories or watching your cholesterol intake, egg whites may be the better option. Otherwise, whole eggs may be the better option, as they contain many healthy vitamins and nutrients. For egg whites, there is variation in flavor and consistency between different brands. If you don’t like the first type of egg whites you try, switch brands and try another - some cook more easily than others too. Follow the container for the equivalent amount of egg white to use in exchange for whole eggs. Usually, two of the “equivalent” amount will cook up to about as much as one whole egg, in terms of size. You can also make your own egg whites by removing the yolks from eggs yourself. There are several easy ways to do so at home. Buy local, cage free, and organic. The best place to get eggs is a local farmer’s market. Not only will they be fresh and flavorful, they often come from healthier hens. At the grocery store, opt for cage-free, organic eggs or egg whites. These will ensure that the hens were not fed unhealthy food that may translate into health risks for you. Use whole eggs and egg whites together. A solid compromise is to use egg whites along with a whole egg. For a personal omelet, use one whole egg and two egg whites. (This is the rough equivalent of four egg whites or two whole eggs.) This effectively maximizes the protein to calorie ratio of your omelet. Selecting Healthy Ingredients Strengthen an omelet with spinach. Spinach adds several healthy benefits to your omelet. In particular, it’s got a ton of iron, which will help you stay healthy and gain strength. It’s also got a good amount of filling fiber and a bunch of magnesium, which is vital to both neurological and metabolic health. Perhaps best of all, there is no need to worry about how much you add - throw in as much as you’d like. For example, make a spinach and low-fat cottage cheese omelet. Add tomatoes, and season with salt and pepper. Bulk up the omelet with bell peppers. Another great vegetable to add to your omelet is bell pepper. Just ¼ cup of chopped peppers will provide more than enough vitamin C. Add whichever color bell pepper you prefer. Aside from supporting your immune system, vitamin C can help your body burn fat and convert carbs into usable fuel. Further, it can even help your muscles grow and recover after a workout. Make a mostly veggie omelet. There a plenty of veggies you can add to your omelet. In fact, creatively changing up your omelets can help make a staple meal into an ongoing (and delicious) experiment of new dishes. For instance, adding two or three ounces of a cooked vegetable can make an omelet both healthier and more filling. Especially enjoyable additions include asparagus, zucchini, mushrooms, eggplant, tomato, and avocado. Add black beans. Another way to add fiber - and good fiber at that - is by adding beans to your omelet. The benefit of doing so is two fold: you’ll stay full for longer, and your body will lose body fat more easily. Soluble fiber also helps reduce some of your cholesterol levels, counteracting some of the cholesterol found in eggs. Add diced tomatoes, garlic powder, and cayenne for a southwest-inspired flavor profile. Use light cheese and lean meat. Cheese is one of the main sources of saturated fat and cholesterol in many people’s diets. Meat is another. The healthiest route is foregoing meat and cheese in your omelet altogether, but you can get away with using a bit of reduced fat cheese and lean meat options. For instance, make a ham and cheese omelet with two egg whites, ¾ ounce of reduced fat Swiss cheese, an ounce of extra-lean ham (about ¼ cup, cubed), and scallions to bring out the omelet’s flavor. Mix in some quinoa. Omelets aren’t just for breakfast anymore. You can make an especially savory omelet by adding quinoa, which will add both flavor and texture normally foreign to egg-based dishes. Plus, quinoa is the grain with the most protein, and contains especially healthy unsaturated fats as well as filling fiber. Try adding a ¼ cup of cooked quinoa with spinach, tomatoes, and kalamata olives. Season this one with cumin. Cooking Your Omelet Opt for coconut oil. While extra-virgin olive oil is a perfectly good option, coconut oil can actually help you lose weight. As such, it’s one of the best options to grease your pan. Use a tablespoon or so, and let it fully melt before adding eggs. The coconut flavor will be subtle, if you even notice it. If you do, add turmeric to season the omelet. These two lead to great flavor combination. While butter will work, it's much less healthy. If you insist on using butter, don't overdo it. Two teaspoons is plenty to grease your pan. Ensure your omelet won’t stick. Add oil to the pan. Both eggs and egg whites are notorious for sticking to cookware. Even with a well-seasoned cast iron skillet, you’ll want to make sure your pan is ready to resist your omelet’s likely stickiness. Wait for the pan to heat up before adding the eggs. The oil should be sending up thin wisps of smoke, so that when the eggs hit, they’ll sizzle. Don’t cook anything in the pan beforehand. Residue from other ingredients will cause egg whites in particular to stick. If you want to cook other ingredients before you put together your omelet, do so in a separate pan or wipe the pan clean before cooking the eggs. Limit stirring. Leave eggs or egg whites alone for 15 seconds after you put them in the pan. Use a spatula to push back eggs that have set every couple seconds thereafter, with the burner on medium to medium-high. Tilt the pan to help uncooked egg get into contact with the pan, and continue as such until the egg no longer runs. Turn the heat down to low add whatever ingredients you’re including. Finally, fold one half of the omelet over onto the other, let it settle for a few minutes in the pan, and viola! Season predominantly with pepper. Black pepper contains a compound called piperine, which can add spice to your omelet, and fight the formation of new fat cells too. As a rule of thumb, use a bit more pepper than salt. (This helps keep your salt amount low too.) Feel free to mix in other herbs and spices at liberty. These will offer additional flavor that add to the enjoyment and fulfillment you derive from your meal. Try basil, turmeric, dill, rosemary, thyme, and more.",
  "tyn_model":[
    "eggs",
    "egg",
    "spinach",
    "quinoa",
    "whites",
    "cheese",
    "egg whites",
    "tomatoes",
    "meat",
    "ham",
    "coconut oil",
    "turmeric",
    "butter",
    "oil",
    "pan",
    "pepper",
    "egg yolks",
    "phosphorus",
    "zinc",
    "folate",
    "yolks",
    "choline",
    "lutein",
    "container",
    "“equivalent",
    "” amount",
    "magnesium",
    "low-fat cottage cheese",
    "salt and pepper",
    "bell peppers",
    "bell pepper",
    "peppers",
    "vitamin c.",
    "vitamin c",
    "veggies",
    "vegetable",
    "asparagus",
    "zucchini",
    "mushrooms",
    "eggplant",
    "tomato",
    "avocado",
    "black beans",
    "beans",
    "diced tomatoes",
    "garlic",
    "cayenne",
    "reduced fat cheese",
    "reduced fat swiss cheese",
    "scallions",
    "kalamata olives",
    "olive oil",
    "coconut",
    "cast iron skillet",
    "spatula",
    "burner",
    "black pepper",
    "salt",
    "herbs",
    "spices",
    "basil",
    "dill",
    "rosemary",
    "thyme"
  ],
  "tyn_section":[

  ]
}