{
  "title":"How to Play a Role Playing Game by Yourself",
  "url":"https://www.wikihow.com/Play-a-Role-Playing-Game-by-Yourself",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Role Playing Games"
  ],
  "steps":[
    {
      "headline":"Decide on what your game will be about: fantasy, sci-fi, real-life or anything you can imagine.",
      "description":""
    },
    {
      "headline":"Create a world you will play in.",
      "description":"Draw a map of your house on paper. Then label every room to be a certain place e.g. Marsh, Town, dark forest, lake, mountains. You can use the same world that you would find in adventure quest worlds. You can do the same with RuneScape or wow if you want, just pick any other game that has an interesting world in it. If your house isn't big enough for all of the world, you can make rooms to be two different places that change when you want them to."
    },
    {
      "headline":"Now you have your worlds it's time to create a character.",
      "description":"You will need another sheet of paper for this. Think of a name and write it at the top of the sheet of paper. Then draw out a big portrait rectangular box on the left-hand side of the sheet of paper this will be where you draw your character, or if you don't like drawing it will be where you write what you have on you eg sword, armor, etc. There are four classes to choose from. Mage, warrior, healer, and rouge. Each has there own special abilities that you come up with later. Eg. a wizard has spells, a warrior has special heavy blows, etc. You then must draw out a bar on the right side of the paper, make sure you do all of this in pencil. The bar will be how much exp you have. You gain more from battling monster and doing quests. When your bar becomes full you level up learning a new move. We will come on to how to fill in this later. Also, draw a bar for your health and a bar for your mana under the exp bar. Draw another box for your items and then your character sheet will be finished."
    },
    {
      "headline":"Now that you have a world and a character, it's time to start playing.",
      "description":"In your world, you will fight monsters and do quests to see what level you can get to. You will decide on what your character does in this world. In the town you start in,  there will be an imaginary person to set you on your quest. The best kind of quest involves fighting creatures, getting around obstacles you have set up and a bit of finding objects. It doesn't have to conform to any specific rule (other than the rules of your role-playing game and/or the world in which you are playing) but start simple and think up your own quests. The first step is to go to the place where the task is to be done and decide on the monster you will fight. See the next step in learning how to fight."
    },
    {
      "headline":"So we now know what we are doing on our quest and where we are going but, we don't know-how.",
      "description":"First of all, you will need some dice, e.g. use the 12 sided dice on your iPod touch role-playing game dice application, but 6 sided dice will do fine, you will just have to use double the amount of dice. The weapon you start with depends on your class, a healer or a Mage will have a basic staff, a warrior will have a basic sword, and a rogue will have a basic dagger, all of these weapons do 5 dice damage (if you are using 6 sided dice this will be 10 dice damage). The monster you are fighting will have 200-300 health and you will have 500 health to start with but this can go up when you level up. You roll first, roll the dice and see how much damage you inflict. You minus that off his health. He now has 50 health left etc. He then fights you he has 3 dice damage. (again double this if you are using 6 sided dice.) Minus his damage off your health bar. Whenever yours or the monsters health bar goes to zero you or the monster dies. If you die you can ever go back to your hometown now, or you can wait 10 minutes and retire to the same place. Now we know to battle we can continue with our quest."
    },
    {
      "headline":"Once you have defeated a monster you need to find the scroll.",
      "description":"What you do for this is search your house for a certain item eg something purple, something with buttons, something round, something that has a picture of a face on it, etc. Because we need to find five ancient scrolls, we need to defeat 5 monsters and find 5 items in the same category. However, you can't just stay in the same place in the room all the time you must explore after every 3 kills. You do this by setting a challenge, something like jumping from one sofa to the other or climbing along your garden fence.Once you are at the next part you can kill the remaining monsters you need to kill. Once you have done this you have completed the quest."
    },
    {
      "headline":"Now you have done the first quest you will need to know how your character page changes.",
      "description":"First of all, let's but a new weapon, you can start with 10,000 gold which can buy you a... Spider sword, Warlocks fire/ice staff, a dragon tooth dagger or a big bad blade of destruction. Choose one to buy, these weapons are better than your old one so add one dice to how many you roll in battle. Draw this new sword on your character on the drawing. Swords that cost more do more damage, so save up your gold if you want to kill hard monsters. Now to know how to fill in your exp bar as you battle creatures you get experience, you get 50 exp every time you kill a creature and you get 300 exp every time you kill a boss (a very hard creature.) for level one you have to get 500 exp to level up, so shade in 50'exp into the bar when the whole bar is shades you level up and learn a new move 1/5. You decide what this move is and what it does, whether it lets you attack twice in a row or whether it can heal 30 of your health. You must wait for 3 turns before you use the same move again and you must lower your mana bar by a certain amount when you use the move."
    },
    {
      "headline":"So you now know how to create a world and a character, you how to quest and battle and you know how the character sheet works.",
      "description":"This is pretty much all you need to know to have fun playing your RPG. Go on quests, battle monsters... But most of all have fun and pass the time away."
    }
  ],
  "text":" Decide on what your game will be about: fantasy, sci-fi, real-life or anything you can imagine.  Create a world you will play in. Draw a map of your house on paper. Then label every room to be a certain place e.g. Marsh, Town, dark forest, lake, mountains. You can use the same world that you would find in adventure quest worlds. You can do the same with RuneScape or wow if you want, just pick any other game that has an interesting world in it. If your house isn't big enough for all of the world, you can make rooms to be two different places that change when you want them to. Now you have your worlds it's time to create a character. You will need another sheet of paper for this. Think of a name and write it at the top of the sheet of paper. Then draw out a big portrait rectangular box on the left-hand side of the sheet of paper this will be where you draw your character, or if you don't like drawing it will be where you write what you have on you eg sword, armor, etc. There are four classes to choose from. Mage, warrior, healer, and rouge. Each has there own special abilities that you come up with later. Eg. a wizard has spells, a warrior has special heavy blows, etc. You then must draw out a bar on the right side of the paper, make sure you do all of this in pencil. The bar will be how much exp you have. You gain more from battling monster and doing quests. When your bar becomes full you level up learning a new move. We will come on to how to fill in this later. Also, draw a bar for your health and a bar for your mana under the exp bar. Draw another box for your items and then your character sheet will be finished. Now that you have a world and a character, it's time to start playing. In your world, you will fight monsters and do quests to see what level you can get to. You will decide on what your character does in this world. In the town you start in,  there will be an imaginary person to set you on your quest. The best kind of quest involves fighting creatures, getting around obstacles you have set up and a bit of finding objects. It doesn't have to conform to any specific rule (other than the rules of your role-playing game and/or the world in which you are playing) but start simple and think up your own quests. The first step is to go to the place where the task is to be done and decide on the monster you will fight. See the next step in learning how to fight. So we now know what we are doing on our quest and where we are going but, we don't know-how. First of all, you will need some dice, e.g. use the 12 sided dice on your iPod touch role-playing game dice application, but 6 sided dice will do fine, you will just have to use double the amount of dice. The weapon you start with depends on your class, a healer or a Mage will have a basic staff, a warrior will have a basic sword, and a rogue will have a basic dagger, all of these weapons do 5 dice damage (if you are using 6 sided dice this will be 10 dice damage). The monster you are fighting will have 200-300 health and you will have 500 health to start with but this can go up when you level up. You roll first, roll the dice and see how much damage you inflict. You minus that off his health. He now has 50 health left etc. He then fights you he has 3 dice damage. (again double this if you are using 6 sided dice.) Minus his damage off your health bar. Whenever yours or the monsters health bar goes to zero you or the monster dies. If you die you can ever go back to your hometown now, or you can wait 10 minutes and retire to the same place. Now we know to battle we can continue with our quest. Once you have defeated a monster you need to find the scroll. What you do for this is search your house for a certain item eg something purple, something with buttons, something round, something that has a picture of a face on it, etc. Because we need to find five ancient scrolls, we need to defeat 5 monsters and find 5 items in the same category. However, you can't just stay in the same place in the room all the time you must explore after every 3 kills. You do this by setting a challenge, something like jumping from one sofa to the other or climbing along your garden fence.Once you are at the next part you can kill the remaining monsters you need to kill. Once you have done this you have completed the quest. Now you have done the first quest you will need to know how your character page changes. First of all, let's but a new weapon, you can start with 10,000 gold which can buy you a... Spider sword, Warlocks fire/ice staff, a dragon tooth dagger or a big bad blade of destruction. Choose one to buy, these weapons are better than your old one so add one dice to how many you roll in battle. Draw this new sword on your character on the drawing. Swords that cost more do more damage, so save up your gold if you want to kill hard monsters. Now to know how to fill in your exp bar as you battle creatures you get experience, you get 50 exp every time you kill a creature and you get 300 exp every time you kill a boss (a very hard creature.) for level one you have to get 500 exp to level up, so shade in 50'exp into the bar when the whole bar is shades you level up and learn a new move 1/5. You decide what this move is and what it does, whether it lets you attack twice in a row or whether it can heal 30 of your health. You must wait for 3 turns before you use the same move again and you must lower your mana bar by a certain amount when you use the move. So you now know how to create a world and a character, you how to quest and battle and you know how the character sheet works. This is pretty much all you need to know to have fun playing your RPG. Go on quests, battle monsters... But most of all have fun and pass the time away.",
  "tyn_model":[
    "paper",
    "dice",
    "sword",
    "healer",
    "rouge",
    "wizard",
    "pencil",
    "role-playing game",
    "role-playing game dice application",
    "dagger",
    "scroll",
    "scrolls",
    "dragon tooth dagger",
    "swords",
    "rpg"
  ],
  "tyn_section":[

  ]
}