{
  "title":"How to Store Fresh Fish",
  "url":"https://www.wikihow.com/Store-Fresh-Fish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Storing Freshly Caught Fish",
      "steps":[
        {
          "headline":"Fill an insulated cooler with water and ice.",
          "description":"If you are a fisherman, you need to start thinking about flavor preservation and storage temperature as soon as you get the fish into your boat. You have two options for maximum freshness. First, you can keep the fish alive in a live tank well onboard your boat and deal with the rest when you get back to shore. The second option is to immediately kill the fish and put it into an insulated bin filled with a little water and a lot of ice. Make sure to buy an insulated cooler with a drain plug."
        },
        {
          "headline":"Add ice to and drain water from the cooler regularly.",
          "description":"The fish needs to stay as cold as possible while in the cooler. Open the drain plug on the insulated cooler open so that melted ice water slowly and continuously drains out, making room for new ice. Do not allow dead fish to sit in melted ice water, because this will spoil the taste. If possible, use shaved ice in the cooler. Position the fish down into the ice in the same position which they swim, bellies down. Surround their bodies completely with ice."
        },
        {
          "headline":"Remove the gills and stomachs as soon as you can.",
          "description":"Cleaning the fish as soon as possible will preserve the most flavor. However, if you're out for a day of fishing, you probably won't be able to clean the fish right away. You can hold off on fully cleaning the fish for a few hours (as long as they're kept on ice) but you need to remove the gills and stomach cavities from the fish as soon as you possibly can. Their gills and stomachs contain waste, and you need to remove that quickly to avoid spoiling the flavor of the meat. Removing these parts also allows you to pack the empty cavities with ice, so you can keep the fish even colder."
        },
        {
          "headline":"Clean the fish within 24 hours of catching it.",
          "description":"As long as they remain in a chilly bin and on frequently replenished ice, you can store whole fish for up to one day before cleaning them and still maintain flavor and freshness. Keep the stomach and gill areas packed with shaved ice. Be sure to keep them positioned upright, in the same position in which they would swim. This will allow the fish to easily drain any excess fluid out of the cavities. Cover the fish with more ice and close the cooler. The fish won't be slimy when you take them out to clean them, because they've been kept on well-drained and frequently replenished ice. This makes them easier to handle. There won't be a strong or unpleasant fishy odor when you take them out to clean them. Cutting and slicing the meat will be easier, too."
        }
      ]
    },
    {
      "name":"Refrigerating Fresh Fish",
      "steps":[
        {
          "headline":"Rinse the freshly cleaned fish under cold water.",
          "description":"Before putting fish in the refrigerator, give the cleaned pieces a good rinsing to make sure there are no remaining scales or other detritus. Use the coldest water your faucet will produce. Never rinse a fresh fish in lukewarm or hot water. After rinsing, gently pat the pieces dry with a paper towel or a clean cloth."
        },
        {
          "headline":"Wrap the meat tightly in wax paper, plastic wrap or aluminum foil.",
          "description":"Once you have the fish all wrapped up, seal the ends tightly so that the meat isn't exposed to air. Oxygen can contribute to spoilage, especially in fatty fish like salmon or mackerel. You also don't want any ice to get in the packaging. Never allow fresh fish meat to directly touch or sit in the ice. Always wrap the fish in something first, to protect it. If you've brought home store-bought fresh fish, keep the meat in its original wrapper."
        },
        {
          "headline":"Place the wrapped fish on ice.",
          "description":"The key to storing fresh fish is keeping the meat on ice and as cold as possible until you are ready to cook it. After wrapping the meat, place the bundles back into an ice-filled insulated cooler. Once you've nestled the wrapped pieces into the ice, fill a few plastic baggies loosely with more shaved ice and seal them tightly to ensure there will be no leakage. You want there to be one to two inches of ice in the baggies. Place these ice baggies on top of the fish. Close the lid of the cooler tightly."
        },
        {
          "headline":"Put the cooler into your refrigerator  and store for up to two days.",
          "description":"Situate an empty bin beneath the cooler and open the drain plug to allow melted ice to run out of the cooler. The bin will catch the run-off. You will need to empty this bin periodically. Make sure the melted water is flowing freely out of the drain plug. Even though the fish is wrapped, you still do not want it sitting in water. The ice baggies need to be replenished daily. Large pieces of fish will store better than small pieces in the refrigerator. Lean fish (panfish, bass, walleye, flounder, sole, red fish, catfish, cod) will hold up better in the refrigerator than fatty fish (trout, salmon, herring, tuna, mackerel, carp, Chilean sea bass)."
        }
      ]
    },
    {
      "name":"Freezing Fish for Future Use",
      "steps":[
        {
          "headline":"Place the cleaned fish into freezer-safe plastic baggies.",
          "description":"Before you seal them closed, make sure you press out all of the air from the baggies, or at least as much as you can. Oxygen can lead to loss of flavor and faster spoilage. Once the bags are air-free, seal them tightly so that no air is able to get into them. To be safe, it's best to wrap the plastic baggies first in aluminum foil and then in moisture-proof freezer paper before placing them into your freezer."
        },
        {
          "headline":"Freeze the fresh fish in a solid block of ice.",
          "description":"This is an alternate way to safely freeze fresh fish without having to seal the pieces in plastic baggies. Place the fish meat directly into a clean, freezer-safe refrigerator container. Fill the container up with water until the water is just covering the fish. Place the container into the freezer. The frozen block of ice surrounding the fish will prevent oxygen from reaching the flesh."
        },
        {
          "headline":"Consume the frozen fish within twelve months.",
          "description":"As long as you've prepared the fish well in air-tight baggies before storing them in the freezer, most frozen fish will be good for up to twelve months. For the absolute best taste and freshness, consume the fish within the first three months. Keep in mind that lean fish will have a longer shelf life than fatty fish. When you're ready to cook the fish, thaw the meat by placing it into your refrigerator overnight. Never thaw fish in a microwave or by setting it out at room temperature."
        }
      ]
    }
  ],
  "text":" Storing Freshly Caught Fish Fill an insulated cooler with water and ice. If you are a fisherman, you need to start thinking about flavor preservation and storage temperature as soon as you get the fish into your boat. You have two options for maximum freshness. First, you can keep the fish alive in a live tank well onboard your boat and deal with the rest when you get back to shore. The second option is to immediately kill the fish and put it into an insulated bin filled with a little water and a lot of ice. Make sure to buy an insulated cooler with a drain plug. Add ice to and drain water from the cooler regularly. The fish needs to stay as cold as possible while in the cooler. Open the drain plug on the insulated cooler open so that melted ice water slowly and continuously drains out, making room for new ice. Do not allow dead fish to sit in melted ice water, because this will spoil the taste. If possible, use shaved ice in the cooler. Position the fish down into the ice in the same position which they swim, bellies down. Surround their bodies completely with ice. Remove the gills and stomachs as soon as you can. Cleaning the fish as soon as possible will preserve the most flavor. However, if you're out for a day of fishing, you probably won't be able to clean the fish right away. You can hold off on fully cleaning the fish for a few hours (as long as they're kept on ice) but you need to remove the gills and stomach cavities from the fish as soon as you possibly can. Their gills and stomachs contain waste, and you need to remove that quickly to avoid spoiling the flavor of the meat. Removing these parts also allows you to pack the empty cavities with ice, so you can keep the fish even colder. Clean the fish within 24 hours of catching it. As long as they remain in a chilly bin and on frequently replenished ice, you can store whole fish for up to one day before cleaning them and still maintain flavor and freshness. Keep the stomach and gill areas packed with shaved ice. Be sure to keep them positioned upright, in the same position in which they would swim. This will allow the fish to easily drain any excess fluid out of the cavities. Cover the fish with more ice and close the cooler. The fish won't be slimy when you take them out to clean them, because they've been kept on well-drained and frequently replenished ice. This makes them easier to handle. There won't be a strong or unpleasant fishy odor when you take them out to clean them. Cutting and slicing the meat will be easier, too. Refrigerating Fresh Fish Rinse the freshly cleaned fish under cold water. Before putting fish in the refrigerator, give the cleaned pieces a good rinsing to make sure there are no remaining scales or other detritus. Use the coldest water your faucet will produce. Never rinse a fresh fish in lukewarm or hot water. After rinsing, gently pat the pieces dry with a paper towel or a clean cloth. Wrap the meat tightly in wax paper, plastic wrap or aluminum foil. Once you have the fish all wrapped up, seal the ends tightly so that the meat isn't exposed to air. Oxygen can contribute to spoilage, especially in fatty fish like salmon or mackerel. You also don't want any ice to get in the packaging. Never allow fresh fish meat to directly touch or sit in the ice. Always wrap the fish in something first, to protect it. If you've brought home store-bought fresh fish, keep the meat in its original wrapper. Place the wrapped fish on ice. The key to storing fresh fish is keeping the meat on ice and as cold as possible until you are ready to cook it. After wrapping the meat, place the bundles back into an ice-filled insulated cooler. Once you've nestled the wrapped pieces into the ice, fill a few plastic baggies loosely with more shaved ice and seal them tightly to ensure there will be no leakage. You want there to be one to two inches of ice in the baggies. Place these ice baggies on top of the fish. Close the lid of the cooler tightly. Put the cooler into your refrigerator  and store for up to two days. Situate an empty bin beneath the cooler and open the drain plug to allow melted ice to run out of the cooler. The bin will catch the run-off. You will need to empty this bin periodically. Make sure the melted water is flowing freely out of the drain plug. Even though the fish is wrapped, you still do not want it sitting in water. The ice baggies need to be replenished daily. Large pieces of fish will store better than small pieces in the refrigerator. Lean fish (panfish, bass, walleye, flounder, sole, red fish, catfish, cod) will hold up better in the refrigerator than fatty fish (trout, salmon, herring, tuna, mackerel, carp, Chilean sea bass). Freezing Fish for Future Use Place the cleaned fish into freezer-safe plastic baggies. Before you seal them closed, make sure you press out all of the air from the baggies, or at least as much as you can. Oxygen can lead to loss of flavor and faster spoilage. Once the bags are air-free, seal them tightly so that no air is able to get into them. To be safe, it's best to wrap the plastic baggies first in aluminum foil and then in moisture-proof freezer paper before placing them into your freezer. Freeze the fresh fish in a solid block of ice. This is an alternate way to safely freeze fresh fish without having to seal the pieces in plastic baggies. Place the fish meat directly into a clean, freezer-safe refrigerator container. Fill the container up with water until the water is just covering the fish. Place the container into the freezer. The frozen block of ice surrounding the fish will prevent oxygen from reaching the flesh. Consume the frozen fish within twelve months. As long as you've prepared the fish well in air-tight baggies before storing them in the freezer, most frozen fish will be good for up to twelve months. For the absolute best taste and freshness, consume the fish within the first three months. Keep in mind that lean fish will have a longer shelf life than fatty fish. When you're ready to cook the fish, thaw the meat by placing it into your refrigerator overnight. Never thaw fish in a microwave or by setting it out at room temperature.",
  "tyn_model":[
    "fish",
    "ice",
    "water",
    "cooler",
    "refrigerator",
    "insulated cooler",
    "shaved ice",
    "ice water",
    "aluminum foil",
    "salmon",
    "mackerel",
    "plastic baggies",
    "ice baggies",
    "freezer",
    "insulated bin",
    "paper towel",
    "plastic wrap",
    "ice-filled insulated cooler",
    "refrigerator  and",
    "bin",
    "panfish",
    "bass",
    "walleye",
    "flounder",
    "sole",
    "red fish",
    "catfish",
    "cod",
    "trout",
    "herring",
    "tuna",
    "carp",
    "freezer-safe plastic baggies",
    "freezer paper",
    "refrigerator container",
    "container",
    "air-tight baggies",
    "microwave"
  ],
  "tyn_section":[

  ]
}