{
  "title":"How to Make Fall Potpourri",
  "url":"https://www.wikihow.com/Make-Fall-Potpourri",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Potpourri"
  ],
  "methods":[
    {
      "name":"Apple Spice Potpourri",
      "steps":[
        {
          "headline":"Dry the apple.",
          "description":"Preheat your oven to 150 degrees F (65 degrees C). Wash one apple and slice it into 1/4-inch slices. Lay the slices in a single layer on a baking sheet. Bake the apple slices for 30 minutes. Remove them once they've dried. Once they're cool, you can chop them into small pieces in order to get 3 tablespoons. You can carefully slice the apple with a very sharp knife if you have a steady hand. You could also use a mandoline to evenly slice the apple."
        },
        {
          "headline":"Combine your apple spice potpourri.",
          "description":"Place all of your potpourri ingredients in a medium sized mixing bowl and stir them till they're combined. Transfer the potpourri to a sealable glass jar until you're ready to use it. For the apple spice potpourri, stir together:\n3 tablespoons of chopped dried apple\n1/2 cup of pink and red carnation petals\n1/4 cup of dried sweet woodruff leaves\n1 3-inch cinnamon stick\n1 whole nutmeg, grated\n1 tablespoon of whole cloves\n1 tablespoon of orange peel, sliced into thin strips\n3 drops of cinnamon or vanilla scented oil"
        },
        {
          "headline":"Use the dried potpourri.",
          "description":"Decide how you'd like to display the apple spice potpourri. For example, you could place it in a shallow basin, a clear vase, or a wide-mouthed jar. Fill your container with the dried potpourri and set it out. You should begin to smell the potpourri within a day. It may take longer for the dried potpourri smell to fill your home, but the scent will last longer than if you simmer the potpourri."
        },
        {
          "headline":"Consider simmering the potpourri.",
          "description":"Scoop one teaspoon of apple spice potpourri into a small saucepan. Add one cup (235 ml) of water and bring the potpourri to a boil. Turn the heat down to low and simmer the potpourri until you can smell it throughout your house. Turn off the heat. If you want to use the potpourri again after you've heated it, just strain it through a mesh strainer and spread it on a baking sheet. Let it dry and store it until you want to use it again."
        }
      ]
    },
    {
      "name":"Simmering Fall Potpourri",
      "steps":[
        {
          "headline":"Prepare the fruit.",
          "description":"You'll need to wash and slice one apple. Since you'll end up simmering the apple, you won't need to core it or remove the seeds. Place the sliced apple in a saucepan. Peel one orange and add the peel to the saucepan as well. Eat the orange or save it for another use. You can also leave the peel on the apple."
        },
        {
          "headline":"Combine the fall potpourri.",
          "description":"Add 1 tablespoon of whole cloves and 3 cinnamon sticks to the saucepan that has the apple slices and orange peel. This is your fresh fall potpourri. Because the fruit hasn't been dried, you'll need to use this potpourri immediately."
        },
        {
          "headline":"Simmer the potpourri on the stove.",
          "description":"Add 3 cups of water (705 ml) to the fall potpourri in your saucepan. Turn the heat on to low and let the potpourri come to a slight bubble. Continue simmering the potpourri until your house smells like fall. You can turn off the potpourri once your home is fragranced. You can also add more water to the saucepan to keep simmering the potpourri."
        }
      ]
    },
    {
      "name":"Creating Your Own Fall Potpourri",
      "steps":[
        {
          "headline":"Select your fruit.",
          "description":"You can use fresh or dried fruit when making your own fall potpourri blend. If you choose to use fresh fruit, you'll need to use the potpourri immediately and simmer it. Place a small handful of your fruit into a medium sized mixing bowl. You can use any of these flavorful fruits:\nApple slices (fresh or dried)\nOrange slices or peels\nCranberries (fresh or dried)\nLemon slices or peels"
        },
        {
          "headline":"Add your spices and seasonings.",
          "description":"You can use almost any fall materials in your potpourri. If you want to use larger items (like pine cones or cinnamon sticks), just use 2 or 3. If you want to use smaller items, you can add a few handfuls to your mixing bowl. Consider using:\nWhole nuts (with their shells)\nCinnamon sticks\nWhole cloves\nWhole nutmeg\nJuniper berries\nDried rose hips\nLaurel (bay) leaves\nPine cones"
        },
        {
          "headline":"Sprinkle essential oils on the potpourri.",
          "description":"If you only have one or two types of essential oils, you can just sprinkle 4 or 5 drops over the potpourri and toss it together. You could use cedar wood oil, clove oil, cinnamon oil, orange oil, or pine oil. Or consider mixing essential oils to get these fragrances:\nFall plants: peppermint, fir, eucalyptus, tea tree and rosemary\nCinnamon spice: orange, cinnamon, clove and vanilla\nAutumn air: sweet orange, lemon and fir"
        },
        {
          "headline":"Use your potpourri.",
          "description":"Stir the potpourri and set it out in a decorative dish. Your house will soon smell like your unique fall potpourri. You could also simmer your potpourri to diffuse the fragrance faster. Just scoop a few tablespoons of your potpourri into a saucepan with a cup or two of water. Heat the potpourri over low heat and turn it off when you smell the potpourri. You can store your own dried potpourri in a sealable jar until you're ready to use it."
        }
      ]
    }
  ],
  "text":" Apple Spice Potpourri Dry the apple. Preheat your oven to 150 degrees F (65 degrees C). Wash one apple and slice it into 1/4-inch slices. Lay the slices in a single layer on a baking sheet. Bake the apple slices for 30 minutes. Remove them once they've dried. Once they're cool, you can chop them into small pieces in order to get 3 tablespoons. You can carefully slice the apple with a very sharp knife if you have a steady hand. You could also use a mandoline to evenly slice the apple. Combine your apple spice potpourri. Place all of your potpourri ingredients in a medium sized mixing bowl and stir them till they're combined. Transfer the potpourri to a sealable glass jar until you're ready to use it. For the apple spice potpourri, stir together:\n3 tablespoons of chopped dried apple\n1/2 cup of pink and red carnation petals\n1/4 cup of dried sweet woodruff leaves\n1 3-inch cinnamon stick\n1 whole nutmeg, grated\n1 tablespoon of whole cloves\n1 tablespoon of orange peel, sliced into thin strips\n3 drops of cinnamon or vanilla scented oil Use the dried potpourri. Decide how you'd like to display the apple spice potpourri. For example, you could place it in a shallow basin, a clear vase, or a wide-mouthed jar. Fill your container with the dried potpourri and set it out. You should begin to smell the potpourri within a day. It may take longer for the dried potpourri smell to fill your home, but the scent will last longer than if you simmer the potpourri. Consider simmering the potpourri. Scoop one teaspoon of apple spice potpourri into a small saucepan. Add one cup (235 ml) of water and bring the potpourri to a boil. Turn the heat down to low and simmer the potpourri until you can smell it throughout your house. Turn off the heat. If you want to use the potpourri again after you've heated it, just strain it through a mesh strainer and spread it on a baking sheet. Let it dry and store it until you want to use it again. Simmering Fall Potpourri Prepare the fruit. You'll need to wash and slice one apple. Since you'll end up simmering the apple, you won't need to core it or remove the seeds. Place the sliced apple in a saucepan. Peel one orange and add the peel to the saucepan as well. Eat the orange or save it for another use. You can also leave the peel on the apple. Combine the fall potpourri. Add 1 tablespoon of whole cloves and 3 cinnamon sticks to the saucepan that has the apple slices and orange peel. This is your fresh fall potpourri. Because the fruit hasn't been dried, you'll need to use this potpourri immediately. Simmer the potpourri on the stove. Add 3 cups of water (705 ml) to the fall potpourri in your saucepan. Turn the heat on to low and let the potpourri come to a slight bubble. Continue simmering the potpourri until your house smells like fall. You can turn off the potpourri once your home is fragranced. You can also add more water to the saucepan to keep simmering the potpourri. Creating Your Own Fall Potpourri Select your fruit. You can use fresh or dried fruit when making your own fall potpourri blend. If you choose to use fresh fruit, you'll need to use the potpourri immediately and simmer it. Place a small handful of your fruit into a medium sized mixing bowl. You can use any of these flavorful fruits:\nApple slices (fresh or dried)\nOrange slices or peels\nCranberries (fresh or dried)\nLemon slices or peels Add your spices and seasonings. You can use almost any fall materials in your potpourri. If you want to use larger items (like pine cones or cinnamon sticks), just use 2 or 3. If you want to use smaller items, you can add a few handfuls to your mixing bowl. Consider using:\nWhole nuts (with their shells)\nCinnamon sticks\nWhole cloves\nWhole nutmeg\nJuniper berries\nDried rose hips\nLaurel (bay) leaves\nPine cones Sprinkle essential oils on the potpourri. If you only have one or two types of essential oils, you can just sprinkle 4 or 5 drops over the potpourri and toss it together. You could use cedar wood oil, clove oil, cinnamon oil, orange oil, or pine oil. Or consider mixing essential oils to get these fragrances:\nFall plants: peppermint, fir, eucalyptus, tea tree and rosemary\nCinnamon spice: orange, cinnamon, clove and vanilla\nAutumn air: sweet orange, lemon and fir Use your potpourri. Stir the potpourri and set it out in a decorative dish. Your house will soon smell like your unique fall potpourri. You could also simmer your potpourri to diffuse the fragrance faster. Just scoop a few tablespoons of your potpourri into a saucepan with a cup or two of water. Heat the potpourri over low heat and turn it off when you smell the potpourri. You can store your own dried potpourri in a sealable jar until you're ready to use it.",
  "tyn_model":[
    "potpourri",
    "saucepan",
    "apple spice potpourri",
    "apple",
    "water",
    "mixing bowl",
    "orange",
    "essential oils",
    "baking sheet",
    "nutmeg",
    "orange peel",
    "cinnamon sticks",
    "oven",
    "mandoline",
    "glass jar",
    "sweet woodruff leaves",
    "cinnamon stick",
    "cloves",
    "cinnamon or vanilla scented oil",
    "container",
    "small saucepan",
    "mesh strainer",
    "fall potpourri",
    "stove",
    "cranberries",
    "spices",
    "seasonings",
    "pine cones",
    "nuts",
    "juniper berries",
    "rose hips",
    "cedar wood oil",
    "clove oil",
    "cinnamon oil",
    "orange oil",
    "pine oil",
    "tea tree",
    "rosemary",
    "cinnamon",
    "vanilla",
    "lemon"
  ],
  "tyn_section":[

  ]
}