{
  "title":"How to Make Chocolate Lasagna",
  "url":"https://www.wikihow.com/Make-Chocolate-Lasagna",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "steps":[
    {
      "headline":"Crush the Oreos in a food processor until finely chopped.",
      "description":""
    },
    {
      "headline":"In a medium-sized bowl, stir the butter and chopped Oreos together.",
      "description":""
    },
    {
      "headline":"Spread the Oreo mixture on a 9 x 13 baking dish with a rubber spatula.",
      "description":""
    },
    {
      "headline":"In a separate bowl, beat the cream cheese until light and fluffy using an electric mixer.",
      "description":""
    },
    {
      "headline":"Pour the milk and sugar and beat again.",
      "description":""
    },
    {
      "headline":"Slowly fold in only half of the Cool Whip and mix until well-combined.",
      "description":""
    },
    {
      "headline":"Pour the cream cheese mixture on the cookie crust and gently spread it around.",
      "description":""
    },
    {
      "headline":"Place the tray in the fridge to chill for about 10 minutes.",
      "description":""
    },
    {
      "headline":"In a large bowl, whisk the pudding mix and milk for about 3 minutes, until it begins to thicken.",
      "description":""
    },
    {
      "headline":"Spread the pudding on the cream cheese layer and spread it around.",
      "description":""
    },
    {
      "headline":"Allow the chocolate lasagna to chill for an additional 10 minutes until it sets.",
      "description":""
    },
    {
      "headline":"Add the rest of the cream cheese mixture on the chocolate lasagna.",
      "description":""
    },
    {
      "headline":"Sprinkle the chocolate chips if desired and cover the tray with plastic wrap.",
      "description":""
    },
    {
      "headline":"Allow the chocolate lasagna to chill for about 4 hours till overnight.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Slice the chocolate lasagna with a cutting knife and place it on a serving plate. Garnish with extra chocolate chips if desired. Enjoy!"
    }
  ],
  "text":" Crush the Oreos in a food processor until finely chopped.  In a medium-sized bowl, stir the butter and chopped Oreos together.  Spread the Oreo mixture on a 9 x 13 baking dish with a rubber spatula.  In a separate bowl, beat the cream cheese until light and fluffy using an electric mixer.  Pour the milk and sugar and beat again.  Slowly fold in only half of the Cool Whip and mix until well-combined.  Pour the cream cheese mixture on the cookie crust and gently spread it around.  Place the tray in the fridge to chill for about 10 minutes.  In a large bowl, whisk the pudding mix and milk for about 3 minutes, until it begins to thicken.  Spread the pudding on the cream cheese layer and spread it around.  Allow the chocolate lasagna to chill for an additional 10 minutes until it sets.  Add the rest of the cream cheese mixture on the chocolate lasagna.  Sprinkle the chocolate chips if desired and cover the tray with plastic wrap.  Allow the chocolate lasagna to chill for about 4 hours till overnight.  Serve. Slice the chocolate lasagna with a cutting knife and place it on a serving plate. Garnish with extra chocolate chips if desired. Enjoy!",
  "tyn_model":[
    "cream cheese",
    "chocolate lasagna",
    "milk",
    "chocolate chips",
    "food processor",
    "butter",
    "baking dish",
    "rubber spatula",
    "electric mixer",
    "sugar",
    "cool whip",
    "fridge",
    "large bowl",
    "pudding",
    "tray",
    "plastic wrap",
    "cutting knife",
    "serving plate"
  ],
  "tyn_section":[

  ]
}