{
  "title":"How to Make Salted Caramel Apple Pie",
  "url":"https://www.wikihow.com/Make-Salted-Caramel-Apple-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "parts":[
    {
      "name":"Making the Pie Crust",
      "steps":[
        {
          "headline":"In a medium-sized bowl mix the dry ingredients.",
          "description":"Stir the flour, salt, and sugar and mix until well-combined with a wooden spoon."
        },
        {
          "headline":"Pulse the cold butter and dry ingredients in a food processor.",
          "description":"Blend on high speed until the mixture resembles the texture of cornmeal, containing a few small pieces of butter."
        },
        {
          "headline":"Pour the ice cold water into the mixture and pulse again.",
          "description":"Mix until the dough forms into a ball."
        },
        {
          "headline":"Divide the dough into a half and flatten it into disks.",
          "description":""
        },
        {
          "headline":"Cover the pie crust with plastic wrap.",
          "description":""
        },
        {
          "headline":"Place the pie crust in the fridge and allow it to chill for at least 1 hour, or overnight.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Filling",
      "steps":[
        {
          "headline":"Wash, peel, core, and slice the apples into thin slices.",
          "description":"Place the apples into a large bowl."
        },
        {
          "headline":"Pour the lemon juice and zest over the apples.",
          "description":"Mix with a wooden spoon."
        },
        {
          "headline":"In a separate small bowl, combine the dry ingredients.",
          "description":"Mix the flour, cinnamon, sugar, nutmeg, and allspice. Stir with a spoon."
        },
        {
          "headline":"Sprinkle the dry ingredients mixture over the apples.",
          "description":""
        },
        {
          "headline":"Use a wooden spoon to gently fold the apple filling in, until well-combined.",
          "description":""
        }
      ]
    },
    {
      "name":"Assembling and Baking",
      "steps":[
        {
          "headline":"Preheat the oven to 400° Fahrenheit (204° Celsius).",
          "description":""
        },
        {
          "headline":"Roll out the pie crust disks on a floured surface using a rolling pin.",
          "description":""
        },
        {
          "headline":"Place one of the rolled out pieces on the bottom of a pie dish.",
          "description":"Gently secure the sides by pressing it down with your fingers."
        },
        {
          "headline":"Pour the apple filling into the pie.",
          "description":"Gently spread it around with the wooden spoon."
        },
        {
          "headline":"Pour the salted caramel sauce over the filling.",
          "description":""
        },
        {
          "headline":"Cover the pie with the last piece of pie crust.",
          "description":"Press down the edges with a fork to secure the crust."
        },
        {
          "headline":"Slit small oval-shaped holes on the pie using a small knife.",
          "description":""
        },
        {
          "headline":"Whisk the egg yolk and cream in a small bowl.",
          "description":""
        },
        {
          "headline":"Brush the pie with the egg wash using a pastry brush.",
          "description":""
        },
        {
          "headline":"Bake the pie in the oven for about 20 minutes.",
          "description":""
        },
        {
          "headline":"Reduce the heat to 350° Fahrenheit (176° Celsius) and bake for an additional 25-30 minutes.",
          "description":""
        },
        {
          "headline":"Remove the pie from the oven and allow it to cool for about 10 minutes.",
          "description":""
        },
        {
          "headline":"Sprinkle the salt and sugar all around the pie.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Slice a piece of pie and lay it on a serving plate. Drizzle extra caramel sauce over the pie if desired. Enjoy!"
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Pie Crust In a medium-sized bowl mix the dry ingredients. Stir the flour, salt, and sugar and mix until well-combined with a wooden spoon. Pulse the cold butter and dry ingredients in a food processor. Blend on high speed until the mixture resembles the texture of cornmeal, containing a few small pieces of butter. Pour the ice cold water into the mixture and pulse again. Mix until the dough forms into a ball. Divide the dough into a half and flatten it into disks.  Cover the pie crust with plastic wrap.  Place the pie crust in the fridge and allow it to chill for at least 1 hour, or overnight.  Making the Filling Wash, peel, core, and slice the apples into thin slices. Place the apples into a large bowl. Pour the lemon juice and zest over the apples. Mix with a wooden spoon. In a separate small bowl, combine the dry ingredients. Mix the flour, cinnamon, sugar, nutmeg, and allspice. Stir with a spoon. Sprinkle the dry ingredients mixture over the apples.  Use a wooden spoon to gently fold the apple filling in, until well-combined.  Assembling and Baking Preheat the oven to 400° Fahrenheit (204° Celsius).  Roll out the pie crust disks on a floured surface using a rolling pin.  Place one of the rolled out pieces on the bottom of a pie dish. Gently secure the sides by pressing it down with your fingers. Pour the apple filling into the pie. Gently spread it around with the wooden spoon. Pour the salted caramel sauce over the filling.  Cover the pie with the last piece of pie crust. Press down the edges with a fork to secure the crust. Slit small oval-shaped holes on the pie using a small knife.  Whisk the egg yolk and cream in a small bowl.  Brush the pie with the egg wash using a pastry brush.  Bake the pie in the oven for about 20 minutes.  Reduce the heat to 350° Fahrenheit (176° Celsius) and bake for an additional 25-30 minutes.  Remove the pie from the oven and allow it to cool for about 10 minutes.  Sprinkle the salt and sugar all around the pie.  Serve. Slice a piece of pie and lay it on a serving plate. Drizzle extra caramel sauce over the pie if desired. Enjoy! Finished. ",
  "tyn_model":[
    "wooden spoon",
    "pie crust",
    "apples",
    "sugar",
    "oven",
    "flour",
    "salt",
    "apple filling",
    "medium-sized bowl",
    "cold butter",
    "food processor",
    "butter",
    "ice cold water",
    "plastic wrap",
    "large bowl",
    "lemon",
    "cinnamon",
    "nutmeg",
    "allspice",
    "spoon",
    "rolling pin",
    "pie dish",
    "salted caramel",
    "fork",
    "small knife",
    "egg",
    "cream",
    "small bowl",
    "pastry brush",
    "serving plate",
    "caramel sauce"
  ],
  "tyn_section":[

  ]
}