{
  "title":"How to Use Leftover Canned Pumpkin",
  "url":"https://www.wikihow.com/Use-Leftover-Canned-Pumpkin",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Using Leftover Pumpkin in Beverages",
      "steps":[
        {
          "headline":"Make pumpkin spice coffee creamer.",
          "description":"Whisk together ½ cup heavy cream, ¼ tsp cinnamon, ¼ tsp allspice and ¼ cup pumpkin puree in a medium-sized saucepan. Simmer the liquid over low heat for fifteen to twenty minutes. Remove the saucepan from heat. Once the liquid has completely cooled, whisk in 1 cup of heavy cream and 14 ounces of sweetened condensed milk. Pour the creamer into mason jars or Tupperware and store in the refrigerator for up to one week. Always shake the creamer well before using it."
        },
        {
          "headline":"Add it to a smoothie.",
          "description":"If you’re a smoothie enthusiast, a spoonful of pumpkin puree can be a great additive to one of your favorite recipes. Simply add a teaspoon or two of pumpkin into the blender with the rest of your smoothie ingredients. Blend until smooth. Pumpkin tastes especially great with smoothies that have a vanilla or almond milk base. Ingredients like bananas, Greek yogurt, dates and cinnamon also work well."
        },
        {
          "headline":"Make pumpkin milk.",
          "description":"You can use any kind of milk – dairy, almond, soy, and rice milk all work great. Put three (or more) tablespoons of pumpkin in a medium-sized bowl. Add eight ounces of milk. Use a whisk to combine the two ingredients. For extra flavor, whisk in cinnamon and/or freshly grated nutmeg. This makes one serving of pumpkin milk. It can be served warm or cold. If you want your pumpkin milk a little sweeter, add sugar or honey to taste. If you own an immersion blender, use it instead of a whisk to froth up your pumpkin beverage."
        },
        {
          "headline":"Use it to make pumpkin chai tea lattes.",
          "description":"You only need four tablespoons of leftover pumpkin to make two servings. Boil water and pour it over chai tea bags in two mugs. Let them steep. Add the pumpkin to a small pot, along with one can of organic full fat coconut milk and a teaspoon of cinnamon. Whisk over medium heat to combine them. Remove the teabags from the hot water and pour the chai tea into the pot. Whisk and heat to your preferred temperature. Pour the tea into the mugs and sprinkle the top with cinnamon. If you like, froth it up with a hand blender before serving. If you dislike the texture, use a fine mesh sieve to strain the beverage first."
        }
      ]
    },
    {
      "name":"Using Leftover Pumpkin in Food",
      "steps":[
        {
          "headline":"Put a spoonful into your morning oatmeal.",
          "description":"Prepare one serving of oatmeal and put it into a small bowl. Take a spoonful of leftover canned pumpkin and stir it gently into the warm oatmeal. Keep stirring until the pumpkin is smooth and completely mixed into the oatmeal. Eat it as is or, for an extra treat, add a dash of cinnamon and maple syrup to the oatmeal."
        },
        {
          "headline":"Use it in baked desserts.",
          "description":"Pumpkin can taste delicious in almost any kind of baked treat. You can jazz up cakes, muffins, cookies, brownies and bars with less than one cup of leftover pumpkin puree. If you want to be exact, look up a few recipes for pumpkin spice cookies or muffins and make a batch or two. Or you can experiment by simply adding a few tablespoons of leftover pumpkin to any baked dessert you happen to be making. Treats that have spices like cinnamon, allspice, and nutmeg work very well with pumpkin flavor. Chocolate baked treats and pumpkin also pair well. Leftover pumpkin puree also tastes delicious when added to bread, pancake and waffle mixes."
        },
        {
          "headline":"Stir a few tablespoons into your favorite curry or chili.",
          "description":"Leftover pumpkin makes a great additive to these two versatile foods. Curry works especially well because curry spices taste great with pumpkin flavor. Pumpkin also works well with coconut milk, which is a very common curry base. Make your chili or curry as you normally would. Stir a few tablespoons of pumpkin into the finished dish. Mix well and serve immediately."
        },
        {
          "headline":"Make a spicy pumpkin hummus dip.",
          "description":"The flavor of leftover pumpkin puree pairs very well with hummus and savory spices. You will need ½ cup of pumpkin for every 2 ½ cups of hummus. Put the pumpkin in the blender when you’re making hummus from scratch, or combine store-bought hummus and pumpkin in the blender. Blend until smooth. Sprinkle with one teaspoon cumin and ¼ teaspoon cayenne pepper (or to taste) on top. Serve with pita wedges."
        }
      ]
    },
    {
      "name":"Using Pumpkin in Homemade Beauty Treatments",
      "steps":[
        {
          "headline":"Make your own moisturizing pumpkin body butter.",
          "description":"Mix together ½ cup of pumpkin puree and ½ cup coconut oil in a medium-sized bowl. Slather the mixture on your body while in the shower or massage the mixture into clean, dry skin. Let it sit for about ten minutes. Rinse it off with warm water in the shower. Gently pat your skin dry. Pumpkin puree works great in beauty treatments because it removes dead skin cells and nourishes your skin with antioxidants. The coconut oil is deeply hydrating. Add ½ teaspoon of cinnamon to your butter (optional). Cinnamon not only smells great but it has stimulating and antibacterial properties."
        },
        {
          "headline":"Exfoliate your skin with a pumpkin body sugar scrub.",
          "description":"Because pumpkin naturally removes dead skin cells, it makes a great ingredient in an all-natural exfoliating skin scrub. Simply mix together equal parts leftover pumpkin puree and olive oil in a medium-sized bowl, then add sugar (white or brown) until the mixture has a mud-like consistency. Use a washcloth or loofah sponge to gently rub the sugar scrub all over your body in the shower. Rinse off the scrub in the shower. Dry your skin as usual."
        },
        {
          "headline":"Use it to make a basic DIY facial mask.",
          "description":"Mix one cup of pumpkin, two tablespoons of brown sugar, one tablespoon of honey and half a cup of plain yogurt in a medium-sized bowl. Use your fingers or a cotton pad to spread a thin layer of the mixture all over your face. Leave it on for about ten minutes. Rinse the mask off with lukewarm water and gently pat your skin dry. The brown sugar and yogurt are natural exfoliants that can remove dead skin cells. Honey is an excellent moisturizer. This pumpkin facial mask works well on all skin types."
        }
      ]
    }
  ],
  "text":" Using Leftover Pumpkin in Beverages Make pumpkin spice coffee creamer. Whisk together ½ cup heavy cream, ¼ tsp cinnamon, ¼ tsp allspice and ¼ cup pumpkin puree in a medium-sized saucepan. Simmer the liquid over low heat for fifteen to twenty minutes. Remove the saucepan from heat. Once the liquid has completely cooled, whisk in 1 cup of heavy cream and 14 ounces of sweetened condensed milk. Pour the creamer into mason jars or Tupperware and store in the refrigerator for up to one week. Always shake the creamer well before using it. Add it to a smoothie. If you’re a smoothie enthusiast, a spoonful of pumpkin puree can be a great additive to one of your favorite recipes. Simply add a teaspoon or two of pumpkin into the blender with the rest of your smoothie ingredients. Blend until smooth. Pumpkin tastes especially great with smoothies that have a vanilla or almond milk base. Ingredients like bananas, Greek yogurt, dates and cinnamon also work well. Make pumpkin milk. You can use any kind of milk – dairy, almond, soy, and rice milk all work great. Put three (or more) tablespoons of pumpkin in a medium-sized bowl. Add eight ounces of milk. Use a whisk to combine the two ingredients. For extra flavor, whisk in cinnamon and/or freshly grated nutmeg. This makes one serving of pumpkin milk. It can be served warm or cold. If you want your pumpkin milk a little sweeter, add sugar or honey to taste. If you own an immersion blender, use it instead of a whisk to froth up your pumpkin beverage. Use it to make pumpkin chai tea lattes. You only need four tablespoons of leftover pumpkin to make two servings. Boil water and pour it over chai tea bags in two mugs. Let them steep. Add the pumpkin to a small pot, along with one can of organic full fat coconut milk and a teaspoon of cinnamon. Whisk over medium heat to combine them. Remove the teabags from the hot water and pour the chai tea into the pot. Whisk and heat to your preferred temperature. Pour the tea into the mugs and sprinkle the top with cinnamon. If you like, froth it up with a hand blender before serving. If you dislike the texture, use a fine mesh sieve to strain the beverage first. Using Leftover Pumpkin in Food Put a spoonful into your morning oatmeal. Prepare one serving of oatmeal and put it into a small bowl. Take a spoonful of leftover canned pumpkin and stir it gently into the warm oatmeal. Keep stirring until the pumpkin is smooth and completely mixed into the oatmeal. Eat it as is or, for an extra treat, add a dash of cinnamon and maple syrup to the oatmeal. Use it in baked desserts. Pumpkin can taste delicious in almost any kind of baked treat. You can jazz up cakes, muffins, cookies, brownies and bars with less than one cup of leftover pumpkin puree. If you want to be exact, look up a few recipes for pumpkin spice cookies or muffins and make a batch or two. Or you can experiment by simply adding a few tablespoons of leftover pumpkin to any baked dessert you happen to be making. Treats that have spices like cinnamon, allspice, and nutmeg work very well with pumpkin flavor. Chocolate baked treats and pumpkin also pair well. Leftover pumpkin puree also tastes delicious when added to bread, pancake and waffle mixes. Stir a few tablespoons into your favorite curry or chili. Leftover pumpkin makes a great additive to these two versatile foods. Curry works especially well because curry spices taste great with pumpkin flavor. Pumpkin also works well with coconut milk, which is a very common curry base. Make your chili or curry as you normally would. Stir a few tablespoons of pumpkin into the finished dish. Mix well and serve immediately. Make a spicy pumpkin hummus dip. The flavor of leftover pumpkin puree pairs very well with hummus and savory spices. You will need ½ cup of pumpkin for every 2 ½ cups of hummus. Put the pumpkin in the blender when you’re making hummus from scratch, or combine store-bought hummus and pumpkin in the blender. Blend until smooth. Sprinkle with one teaspoon cumin and ¼ teaspoon cayenne pepper (or to taste) on top. Serve with pita wedges. Using Pumpkin in Homemade Beauty Treatments Make your own moisturizing pumpkin body butter. Mix together ½ cup of pumpkin puree and ½ cup coconut oil in a medium-sized bowl. Slather the mixture on your body while in the shower or massage the mixture into clean, dry skin. Let it sit for about ten minutes. Rinse it off with warm water in the shower. Gently pat your skin dry. Pumpkin puree works great in beauty treatments because it removes dead skin cells and nourishes your skin with antioxidants. The coconut oil is deeply hydrating. Add ½ teaspoon of cinnamon to your butter (optional). Cinnamon not only smells great but it has stimulating and antibacterial properties. Exfoliate your skin with a pumpkin body sugar scrub. Because pumpkin naturally removes dead skin cells, it makes a great ingredient in an all-natural exfoliating skin scrub. Simply mix together equal parts leftover pumpkin puree and olive oil in a medium-sized bowl, then add sugar (white or brown) until the mixture has a mud-like consistency. Use a washcloth or loofah sponge to gently rub the sugar scrub all over your body in the shower. Rinse off the scrub in the shower. Dry your skin as usual. Use it to make a basic DIY facial mask. Mix one cup of pumpkin, two tablespoons of brown sugar, one tablespoon of honey and half a cup of plain yogurt in a medium-sized bowl. Use your fingers or a cotton pad to spread a thin layer of the mixture all over your face. Leave it on for about ten minutes. Rinse the mask off with lukewarm water and gently pat your skin dry. The brown sugar and yogurt are natural exfoliants that can remove dead skin cells. Honey is an excellent moisturizer. This pumpkin facial mask works well on all skin types.",
  "tyn_model":[
    "pumpkin",
    "cinnamon",
    "pumpkin puree",
    "water",
    "blender",
    "pumpkin milk",
    "whisk",
    "honey",
    "oatmeal",
    "hummus",
    "heavy cream",
    "milk",
    "sugar",
    "coconut oil",
    "brown sugar",
    "pumpkin spice coffee creamer",
    "allspice",
    "medium-sized saucepan",
    "saucepan",
    "sweetened condensed milk",
    "mason jars",
    "bananas",
    "greek yogurt",
    "dates",
    "– dairy",
    "rice milk",
    "nutmeg",
    "immersion blender",
    "pumpkin chai tea",
    "chai tea bags",
    "small pot",
    "full fat coconut milk",
    "chai tea",
    "pot",
    "hand blender",
    "fine mesh sieve",
    "maple syrup",
    "pumpkin spice cookies",
    "chocolate baked treats",
    "coconut milk",
    "chili",
    "cumin",
    "cayenne pepper",
    "pita wedges",
    "butter",
    "body sugar",
    "olive oil",
    "washcloth or",
    "loofah sponge",
    "sugar scrub",
    "plain yogurt",
    "cotton pad",
    "yogurt"
  ],
  "tyn_section":[

  ]
}