{
  "title":"How to Make Paleo Coffee Brownies",
  "url":"https://www.wikihow.com/Make-Paleo-Coffee-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes",
    "Gluten Free Dishes"
  ],
  "steps":[
    {
      "headline":"Melt the chocolate chips in a saucepan over low heat.",
      "description":"Pour in coconut oil and shortening. Stir continuously until smoothly blended and totally melted. Afterwards, preheat the oven to 350°F."
    },
    {
      "headline":"Add the instant coffee/ground espresso beans.",
      "description":"Combine with the melted chocolate, stirring until blended. The coffee may not dissolve all the way and make the mixture look slightly chunky, this is okay. Once finished, remove saucepan from heat and set aside."
    },
    {
      "headline":"Blend eggs, coconut sugar, vanilla and salt on low speed in a separate mixing bowl.",
      "description":"Continue mixing until smooth and fully combined. Add in coconut and almond flour and mix until blended. While you can use an automatic mixer, a handheld one is optimal."
    },
    {
      "headline":"Pour the melted chocolate into the mixing bowl.",
      "description":"Mix on low speed until blended. It should turn brown, thicken, and resemble brownie batter."
    },
    {
      "headline":"Pour into a 8x8 inch baking dish, either greased or covered with parchment paper.",
      "description":"Get the remaining batter out of the bowl with a rubber scraper. Smooth the top of the mixture if needed."
    },
    {
      "headline":"Bake at 350 °F (177 °C) for 25-30 minutes.",
      "description":"When finished (toothpick should come out clean), remove from oven and let cool for about an hour. Serve."
    }
  ],
  "text":" Melt the chocolate chips in a saucepan over low heat. Pour in coconut oil and shortening. Stir continuously until smoothly blended and totally melted. Afterwards, preheat the oven to 350°F. Add the instant coffee/ground espresso beans. Combine with the melted chocolate, stirring until blended. The coffee may not dissolve all the way and make the mixture look slightly chunky, this is okay. Once finished, remove saucepan from heat and set aside. Blend eggs, coconut sugar, vanilla and salt on low speed in a separate mixing bowl. Continue mixing until smooth and fully combined. Add in coconut and almond flour and mix until blended. While you can use an automatic mixer, a handheld one is optimal. Pour the melted chocolate into the mixing bowl. Mix on low speed until blended. It should turn brown, thicken, and resemble brownie batter. Pour into a 8x8 inch baking dish, either greased or covered with parchment paper. Get the remaining batter out of the bowl with a rubber scraper. Smooth the top of the mixture if needed. Bake at 350 °F (177 °C) for 25-30 minutes. When finished (toothpick should come out clean), remove from oven and let cool for about an hour. Serve.",
  "tyn_model":[
    "saucepan",
    "oven",
    "chocolate",
    "mixing bowl",
    "chocolate chips",
    "coconut oil",
    "shortening",
    "instant coffee",
    "espresso beans",
    "eggs",
    "coconut sugar",
    "vanilla",
    "salt",
    "coconut and",
    "almond flour",
    "mixer",
    "baking dish",
    "parchment paper",
    "bowl",
    "rubber scraper"
  ],
  "tyn_section":[

  ]
}