{
  "title":"How to Make Chicken Enchilada Dip",
  "url":"https://www.wikihow.com/Make-Chicken-Enchilada-Dip",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Dips"
  ],
  "parts":[
    {
      "name":"Preparing the Chicken",
      "steps":[
        {
          "headline":"Preheat your oven.",
          "description":"Set your degree to 350 degrees Fahrenheit, or 175 degrees Celsius. It’s good to set your oven before you start prepping your ingredients. Depending on your oven, it’ll take ten to twenty minutes to heat up, so it’ll be warm up while you prepare your chicken."
        },
        {
          "headline":"Bake your chicken breasts.",
          "description":"First, slice your chicken breasts into halves. Then place them on a baking sheet. Once the oven is fully preheated, pop the pan in the oven for about twenty minutes. The chicken is fully cooked once there is no pink in the center."
        },
        {
          "headline":"Shred the chicken.",
          "description":"You can do this in a variety of different ways. You can use your hands to rip apart the chicken, or tear it apart with a fork. You can even put the chicken breasts into a mixer on low speed. However you do it, the end product should be ripped up pieces of chicken. You can learn more about shredding chicken here."
        }
      ]
    },
    {
      "name":"Creating the Dip",
      "steps":[
        {
          "headline":"Mix the shredded chicken and other ingredients together.",
          "description":"As you shred the chicken, place it into a bowl. Then, add the softened cream cheese, mayonnaise, cheddar cheese, green chili peppers, and chopped jalapeno. Use a large spoon or rubber spatula to mix everything together. Make sure that you the chicken is thoroughly coated and there are no unblended ingredients. Don’t be afraid to get a bit creative. You can also add things like onion, black beans, tomatoes, and anything else you love in your Mexican dishes."
        },
        {
          "headline":"Scoop the mixture into a baking dish.",
          "description":"After you’ve mixed everything thoroughly, you’ll need to transfer it into a baking pan. Scoop the entire mixture into the pan. Then, use a spatula or spoon to even it out. Spread it out so that it fills the pan, and then flatten out the top."
        },
        {
          "headline":"Bake your dip for 30 minutes.",
          "description":"Don’t cover it or anything – simply pop it into the oven that is still heated to 350 degrees Fahrenheit, or 175 degrees Celsius. Your dip is finished cooking once the edges have browned. Remove from the oven, and let it cool a bit."
        },
        {
          "headline":"Serve your dip.",
          "description":"For a party, this is great to serve warm with tortilla chips. However, you can also serve it cold, depending on your personal preference. Store any leftovers in a sealed container in the refrigerator for up to a week."
        }
      ]
    }
  ],
  "text":" Preparing the Chicken Preheat your oven. Set your degree to 350 degrees Fahrenheit, or 175 degrees Celsius. It’s good to set your oven before you start prepping your ingredients. Depending on your oven, it’ll take ten to twenty minutes to heat up, so it’ll be warm up while you prepare your chicken. Bake your chicken breasts. First, slice your chicken breasts into halves. Then place them on a baking sheet. Once the oven is fully preheated, pop the pan in the oven for about twenty minutes. The chicken is fully cooked once there is no pink in the center. Shred the chicken. You can do this in a variety of different ways. You can use your hands to rip apart the chicken, or tear it apart with a fork. You can even put the chicken breasts into a mixer on low speed. However you do it, the end product should be ripped up pieces of chicken. You can learn more about shredding chicken here. Creating the Dip Mix the shredded chicken and other ingredients together. As you shred the chicken, place it into a bowl. Then, add the softened cream cheese, mayonnaise, cheddar cheese, green chili peppers, and chopped jalapeno. Use a large spoon or rubber spatula to mix everything together. Make sure that you the chicken is thoroughly coated and there are no unblended ingredients. Don’t be afraid to get a bit creative. You can also add things like onion, black beans, tomatoes, and anything else you love in your Mexican dishes. Scoop the mixture into a baking dish. After you’ve mixed everything thoroughly, you’ll need to transfer it into a baking pan. Scoop the entire mixture into the pan. Then, use a spatula or spoon to even it out. Spread it out so that it fills the pan, and then flatten out the top. Bake your dip for 30 minutes. Don’t cover it or anything – simply pop it into the oven that is still heated to 350 degrees Fahrenheit, or 175 degrees Celsius. Your dip is finished cooking once the edges have browned. Remove from the oven, and let it cool a bit. Serve your dip. For a party, this is great to serve warm with tortilla chips. However, you can also serve it cold, depending on your personal preference. Store any leftovers in a sealed container in the refrigerator for up to a week.",
  "tyn_model":[
    "oven",
    "chicken",
    "chicken breasts",
    "baking sheet",
    "fork",
    "mixer",
    "bowl",
    "cream cheese",
    "mayonnaise",
    "cheddar cheese",
    "green chili peppers",
    "jalapeno",
    "large spoon",
    "rubber spatula",
    "onion",
    "black beans",
    "tomatoes",
    "baking dish",
    "baking pan",
    "spatula",
    "spoon",
    "– simply",
    "tortilla chips",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}