{
  "title":"How to Choose Low‐Maintenance Houseplants",
  "url":"https://www.wikihow.com/Choose-Low%E2%80%90Maintenance-Houseplants",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "methods":[
    {
      "name":"Choosing Plants that Need Minimal Watering",
      "steps":[
        {
          "headline":"Plant some bamboo palm in your hallway.",
          "description":"Bamboo palm is easy to grow, helps purify the air in your home, and requires minimal watering. They can grow up to twelve feet tall and five feet wide, so they are great for accenting a hallway or living room. Also, they are great at filtering the air in your home. To care for your bamboo palm, use the following principles: the plant requires bright, indirect sunlight. Water thoroughly when the soil feels dry to the touch. They are non-toxic to both dogs and cats."
        },
        {
          "headline":"Plant succulents.",
          "description":"Succulents come in all kinds of neat shapes and colors. They require little water because they store water in their leaves. They require sunlight and prefer dry air."
        },
        {
          "headline":"Pick a ponytail palm.",
          "description":"The ponytail palm stores water in thick leaves that get skinny as they grow out from the base of the plant. They don’t require much watering and have a wonderful shape."
        },
        {
          "headline":"Enjoy begonias.",
          "description":"Begonias don’t require much water at all. In fact, they prefer their soil to dry out before you water them. They bloom in a wide range of crowd pleasing colors such as pink and red."
        },
        {
          "headline":"Choose echeveria for your office desk.",
          "description":"Echeveria is a beautiful, small succulent that you could put on your office desk, dining room table or in your bedroom. You can find them in a variety of colors to suit your interior decorating style. They require little watering and need plenty of bright light. They are non-toxic to both dogs and cats."
        },
        {
          "headline":"Pick Aloe Vera.",
          "description":"Aloe vera is a wonderful plant that is easy to grow and requires little watering. It is used for skin conditions such as sunburn, as well as itching, inflammation, and a variety of more serious conditions. With an aloe vera plant in your home, you won’t have to run to the pharmacy the next time you get sunburn."
        },
        {
          "headline":"Choose a snake plant for your bedroom.",
          "description":"A snake plant is very easy to maintain and requires little watering. It also does a wonderful job of keeping the air in your bedroom fresh and clean. It also removes pollutants."
        }
      ]
    },
    {
      "name":"Picking Plants that Don't Need Much Light",
      "steps":[
        {
          "headline":"Choose a Boston Fern for your office.",
          "description":"These plants are great at cleaning the air in your home and removing pollutants. They like a cool spot with indirect light and plenty of humidity. You should make sure they get plenty of water."
        },
        {
          "headline":"Plant a peace lily in your dining room.",
          "description":"They have gorgeous white flowers and help to purify the air in your dining room. They will also help remove pollutants. Remember that they will also add some pollen to your environment, so be careful if you are sensitive or have allergies to pollen."
        },
        {
          "headline":"Plant a philodendron.",
          "description":"The philodendron is very popular because it tolerates dark rooms. You can train it to climb a trellis or hang it from a basket. The Brasil version has gold and green foliage and the Mican variety has purple leaves with a satin texture. Philodendron is a poisonous plant. Make sure you keep it out of reach for children and pets."
        },
        {
          "headline":"Plant pothos.",
          "description":"This houseplant needs to be kept out of direct sunlight and is very easy to maintain. You can plant it in a hanging basket or let it climb a bookshelf or trellis. It comes in many colors such as dark green, yellow-and-green, and white-and-green. Pothos is poisonous so it's important that you keep it away from children and pets."
        },
        {
          "headline":"Enjoy a ZZ plant.",
          "description":"The plant is low maintenance since it requires little sunlight or water. It has upright stems that look like arches. The leaves are deep green."
        },
        {
          "headline":"Plant a parlor palm.",
          "description":"The parlor palm requires little light or maintenance. You can plant it in a corner and it will grow about four feet in height. It has spiky palm leaves."
        },
        {
          "headline":"Get a dieffenbachia.",
          "description":"This tropical plant can be found in both white-and-green and yellow-and-green varieties. You can plant it in a dark room, although some indirect light is good. This plant is poisonous so keep it away from children and pets."
        }
      ]
    },
    {
      "name":"Finding Plants that Don’t Require Much Attention",
      "steps":[
        {
          "headline":"Enjoy a spider plant.",
          "description":"Spider plants do pretty well just about anywhere in your home, as long as they get bright or at least moderate sunlight and average temperature and humidity. You can hang a spider plant beside a window or place one in a pot in your living room. They grow quickly, require little attention, and help purify the air in your home. They are non-toxic to both dogs and cats."
        },
        {
          "headline":"Plant peppermint in your kitchen.",
          "description":"Peppermint is a wonderful herb that you can plant indoors and keep in your kitchen without too much fuss. Whenever you need some fresh peppermint for a glass of soothing tea, you have the herb readily available. To grow peppermint indoors, place it next to a bright window and water it whenever the soil feels dry. Peppermint is great for treating an upset stomach, reducing stress, treating nausea, headaches, and has been used for irritable bowel syndrome."
        },
        {
          "headline":"Grow sage.",
          "description":"Plant sage in a sunny room. Sage tolerates dry, indoor air well, but likes good sun. It requires little attention. It is a powerful plant with strong properties as a healing plant. It looks great on your kitchen window and is very low maintenance. It has anti-inflammatory and antibacterial properties, and can be used as a relaxant and to relieve indigestion."
        },
        {
          "headline":"Enjoy dracaena marginata.",
          "description":"These spiky plants can be purchased in a variety of colors and sizes. You can find them in lime green, red, and other colors. They are very low maintenance, requiring little water, only moderate light, and have no special needs. They also help to keep your air clean and remove pollutants."
        },
        {
          "headline":"Pick the Chinese evergreen.",
          "description":"The Chinese evergreen can be placed anywhere in your home, since it requires very little light, and requires very little watering. The only requirement is to keep your home at a relatively warm temperature (e.g., 55 Fahrenheit or 12 Celsius), so you will need to keep your home at a decent temperature in the winter months. A pretty plant that is very low maintenance in a warm home."
        },
        {
          "headline":"Choose air plants.",
          "description":"These plants are great if you have little space in your house since they don’t even require a pot and soil. They just need to be dunked in water every ten days. The rest of the time you can put them on a shelf or desk and forget about them."
        },
        {
          "headline":"Find a monster deliciosa.",
          "description":"This gorgeous plant has deep green, geometric leaves. It requires only indirect sunlight and a warm house. You can forget about it most of the time and it will shower you with gorgeous leaves and purify the air."
        }
      ]
    }
  ],
  "text":" Choosing Plants that Need Minimal Watering Plant some bamboo palm in your hallway. Bamboo palm is easy to grow, helps purify the air in your home, and requires minimal watering. They can grow up to twelve feet tall and five feet wide, so they are great for accenting a hallway or living room. Also, they are great at filtering the air in your home. To care for your bamboo palm, use the following principles: the plant requires bright, indirect sunlight. Water thoroughly when the soil feels dry to the touch. They are non-toxic to both dogs and cats. Plant succulents. Succulents come in all kinds of neat shapes and colors. They require little water because they store water in their leaves. They require sunlight and prefer dry air. Pick a ponytail palm. The ponytail palm stores water in thick leaves that get skinny as they grow out from the base of the plant. They don’t require much watering and have a wonderful shape. Enjoy begonias. Begonias don’t require much water at all. In fact, they prefer their soil to dry out before you water them. They bloom in a wide range of crowd pleasing colors such as pink and red. Choose echeveria for your office desk. Echeveria is a beautiful, small succulent that you could put on your office desk, dining room table or in your bedroom. You can find them in a variety of colors to suit your interior decorating style. They require little watering and need plenty of bright light. They are non-toxic to both dogs and cats. Pick Aloe Vera. Aloe vera is a wonderful plant that is easy to grow and requires little watering. It is used for skin conditions such as sunburn, as well as itching, inflammation, and a variety of more serious conditions. With an aloe vera plant in your home, you won’t have to run to the pharmacy the next time you get sunburn. Choose a snake plant for your bedroom. A snake plant is very easy to maintain and requires little watering. It also does a wonderful job of keeping the air in your bedroom fresh and clean. It also removes pollutants. Picking Plants that Don't Need Much Light Choose a Boston Fern for your office. These plants are great at cleaning the air in your home and removing pollutants. They like a cool spot with indirect light and plenty of humidity. You should make sure they get plenty of water. Plant a peace lily in your dining room. They have gorgeous white flowers and help to purify the air in your dining room. They will also help remove pollutants. Remember that they will also add some pollen to your environment, so be careful if you are sensitive or have allergies to pollen. Plant a philodendron. The philodendron is very popular because it tolerates dark rooms. You can train it to climb a trellis or hang it from a basket. The Brasil version has gold and green foliage and the Mican variety has purple leaves with a satin texture. Philodendron is a poisonous plant. Make sure you keep it out of reach for children and pets. Plant pothos. This houseplant needs to be kept out of direct sunlight and is very easy to maintain. You can plant it in a hanging basket or let it climb a bookshelf or trellis. It comes in many colors such as dark green, yellow-and-green, and white-and-green. Pothos is poisonous so it's important that you keep it away from children and pets. Enjoy a ZZ plant. The plant is low maintenance since it requires little sunlight or water. It has upright stems that look like arches. The leaves are deep green. Plant a parlor palm. The parlor palm requires little light or maintenance. You can plant it in a corner and it will grow about four feet in height. It has spiky palm leaves. Get a dieffenbachia. This tropical plant can be found in both white-and-green and yellow-and-green varieties. You can plant it in a dark room, although some indirect light is good. This plant is poisonous so keep it away from children and pets. Finding Plants that Don’t Require Much Attention Enjoy a spider plant. Spider plants do pretty well just about anywhere in your home, as long as they get bright or at least moderate sunlight and average temperature and humidity. You can hang a spider plant beside a window or place one in a pot in your living room. They grow quickly, require little attention, and help purify the air in your home. They are non-toxic to both dogs and cats. Plant peppermint in your kitchen. Peppermint is a wonderful herb that you can plant indoors and keep in your kitchen without too much fuss. Whenever you need some fresh peppermint for a glass of soothing tea, you have the herb readily available. To grow peppermint indoors, place it next to a bright window and water it whenever the soil feels dry. Peppermint is great for treating an upset stomach, reducing stress, treating nausea, headaches, and has been used for irritable bowel syndrome. Grow sage. Plant sage in a sunny room. Sage tolerates dry, indoor air well, but likes good sun. It requires little attention. It is a powerful plant with strong properties as a healing plant. It looks great on your kitchen window and is very low maintenance. It has anti-inflammatory and antibacterial properties, and can be used as a relaxant and to relieve indigestion. Enjoy dracaena marginata. These spiky plants can be purchased in a variety of colors and sizes. You can find them in lime green, red, and other colors. They are very low maintenance, requiring little water, only moderate light, and have no special needs. They also help to keep your air clean and remove pollutants. Pick the Chinese evergreen. The Chinese evergreen can be placed anywhere in your home, since it requires very little light, and requires very little watering. The only requirement is to keep your home at a relatively warm temperature (e.g., 55 Fahrenheit or 12 Celsius), so you will need to keep your home at a decent temperature in the winter months. A pretty plant that is very low maintenance in a warm home. Choose air plants. These plants are great if you have little space in your house since they don’t even require a pot and soil. They just need to be dunked in water every ten days. The rest of the time you can put them on a shelf or desk and forget about them. Find a monster deliciosa. This gorgeous plant has deep green, geometric leaves. It requires only indirect sunlight and a warm house. You can forget about it most of the time and it will shower you with gorgeous leaves and purify the air.",
  "tyn_model":[
    "water",
    "peppermint",
    "bamboo palm",
    "aloe vera",
    "plants",
    "sage",
    "begonias",
    "echeveria",
    "philodendron",
    "succulents",
    "boston fern",
    "peace lily",
    "flowers",
    "basket",
    "parlor palm",
    "spider plant",
    "pot"
  ],
  "tyn_section":[

  ]
}