{
  "title":"How to Sew an Integrated Inseam Pocket",
  "url":"https://www.wikihow.com/Sew-an-Integrated-Inseam-Pocket",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Clothes"
  ],
  "steps":[
    {
      "headline":"Cut out the sewing pattern pieces.",
      "description":""
    },
    {
      "headline":"Cut out an extra pocket using the pocket pattern piece.",
      "description":"Cut notches or placement marks in the extra pattern piece."
    },
    {
      "headline":"Pin the pocket pattern pieces to the skirt or pattern pieces.",
      "description":"Use the notches to evenly align the pocket pattern templates to the skirt or pant pattern. Pin the pocket along the pattern cutting  line. You can use the next size down on a multi-size pattern. You could also use a seam line, if this was available on your pattern piece."
    },
    {
      "headline":"Pin the pattern pieces to the fabric following the pattern layout directions.",
      "description":""
    },
    {
      "headline":"Cut the fabric using the integrated pattern pieces.",
      "description":""
    },
    {
      "headline":"Sew the skirt or pants using the pattern directions.",
      "description":""
    },
    {
      "headline":"Pivot at and follow along the curve of the pocket piece.",
      "description":""
    },
    {
      "headline":"Press the pockets using lots of steam to ensure the pockets lay neatly.",
      "description":""
    }
  ],
  "text":" Cut out the sewing pattern pieces.  Cut out an extra pocket using the pocket pattern piece. Cut notches or placement marks in the extra pattern piece. Pin the pocket pattern pieces to the skirt or pattern pieces. Use the notches to evenly align the pocket pattern templates to the skirt or pant pattern. Pin the pocket along the pattern cutting  line. You can use the next size down on a multi-size pattern. You could also use a seam line, if this was available on your pattern piece. Pin the pattern pieces to the fabric following the pattern layout directions.  Cut the fabric using the integrated pattern pieces.  Sew the skirt or pants using the pattern directions.  Pivot at and follow along the curve of the pocket piece.  Press the pockets using lots of steam to ensure the pockets lay neatly. ",
  "tyn_model":[
    "fabric",
    "sewing pattern"
  ],
  "tyn_section":[

  ]
}