{
  "title":"How to Make Tom Yum",
  "url":"https://www.wikihow.com/Make-Tom-Yum",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Thai Dishes"
  ],
  "steps":[
    {
      "headline":"Wash all your ingredients.",
      "description":""
    },
    {
      "headline":"Cut the lemongrass stalks into 1 inch pieces.",
      "description":""
    },
    {
      "headline":"Cut the cilantro into half inch pieces.",
      "description":""
    },
    {
      "headline":"Cut the tomatoes into four parts.",
      "description":""
    },
    {
      "headline":"Slice the galangal thinly crosswise.",
      "description":""
    },
    {
      "headline":"Cut the mushrooms, shallots, chilies and kaffir leaves in half.",
      "description":""
    },
    {
      "headline":"Set all the vegetables aside and using a sharp knife cut the chicken into bite sized pieces.",
      "description":""
    },
    {
      "headline":"Squeeze the lime juice into a cup.",
      "description":""
    },
    {
      "headline":"Place a large pot onto your stove and fill three quarters full with water and a pinch of salt and bring to the boil.",
      "description":""
    },
    {
      "headline":"Add the lemongrass, galangal, kaffir and shallots into the pot.",
      "description":""
    },
    {
      "headline":"When the water has come back to the boil, stir in the chicken, stock cubes and leave to simmer until the chicken is cooked.",
      "description":""
    },
    {
      "headline":"Turn the heat down when chicken is cooked then add the mushrooms and chilies.",
      "description":""
    },
    {
      "headline":"Add the lime juice, fish sauce, and cilantro.",
      "description":""
    },
    {
      "headline":"Ready to be served",
      "description":""
    }
  ],
  "text":" Wash all your ingredients.  Cut the lemongrass stalks into 1 inch pieces.  Cut the cilantro into half inch pieces.  Cut the tomatoes into four parts.  Slice the galangal thinly crosswise.  Cut the mushrooms, shallots, chilies and kaffir leaves in half.  Set all the vegetables aside and using a sharp knife cut the chicken into bite sized pieces.  Squeeze the lime juice into a cup.  Place a large pot onto your stove and fill three quarters full with water and a pinch of salt and bring to the boil.  Add the lemongrass, galangal, kaffir and shallots into the pot.  When the water has come back to the boil, stir in the chicken, stock cubes and leave to simmer until the chicken is cooked.  Turn the heat down when chicken is cooked then add the mushrooms and chilies.  Add the lime juice, fish sauce, and cilantro.  Ready to be served ",
  "tyn_model":[
    "lemongrass",
    "cilantro",
    "galangal",
    "mushrooms",
    "shallots",
    "chilies",
    "kaffir",
    "chicken",
    "water",
    "tomatoes",
    "vegetables",
    "sharp knife",
    "lime juice",
    "large pot",
    "stove",
    "salt",
    "pot",
    "stock",
    "lime",
    "fish sauce"
  ],
  "tyn_section":[

  ]
}