{
  "title":"How to Serve Cheese As an Appetizer",
  "url":"https://www.wikihow.com/Serve-Cheese-As-an-Appetizer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "methods":[
    {
      "name":"Choosing Your Cheeses",
      "steps":[
        {
          "headline":"Serve light cheeses before dinner.",
          "description":"For an appetizer, you will want to serve light cheeses that are not heavy and will not fill your guests. You want to whet your guest's appetites, not satiate them. Consider serving light cheeses like fresh mozzarella and goat cheese. You might also consider a light cheese that pairs well with the main meal that you are serving. For example, goat cheese is a great compliment to Mediterranean or Middle Eastern dishes."
        },
        {
          "headline":"Choose a variety of cheeses.",
          "description":"In order to appreciate the truly complex flavors of cheese, the best strategy is to opt for a variety of different cheese types. Serve soft and hard cheeses with distinctly varied flavors. Mix in cheeses from different animals and from multiple geographic locations. Ideally, you will want to serve three to five cheeses. More than that can get a little overwhelming and crowd your serving area. For example, you may want to offer your guests a plate that includes Comte, camembert, Manchego, and gorgonzola."
        },
        {
          "headline":"Develop a regional theme.",
          "description":"One method of determining what cheeses to serve is to choose cheese from a specific geographic area. Focus on cheese from a certain country or a specific cheese-producing region. For example, you might decide that you want to serve Italian cheeses or choose serve cheeses exclusive to the Loire Valley of France. You can also do the opposite of this and serve a variety of cheese from around the world."
        },
        {
          "headline":"Use cheeses made from different types of milk.",
          "description":"You can also pick your cheeses based on the animal that produced it. Serve cheeses that come from goat, sheep, and cow's milk. This will give you a variety of flavors and a unique pairing."
        },
        {
          "headline":"Stay in the same family.",
          "description":"If you want a lesson in how to spot the differences between cheeses of the same family, consider a more homogenous cheese plate. For example, serve three or four different styles of brie and camembert. Let your guests appreciate the similarities of the cheeses while exploring their subtle differences."
        }
      ]
    },
    {
      "name":"Finding the Right Pairings",
      "steps":[
        {
          "headline":"Serve savory accompaniments.",
          "description":"When you are serving cheese as an appetizer, try to pair it with savory foods. This can include cured meats, like prosciutto and salami, nuts, roasted red peppers, and sauces like mustards and chutneys. You might also consider serving caramelized onions or artichoke hearts. Try to avoid spicy things. The heat of these foods can overwhelm the flavor of your cheese. Olives also make a good accompaniment."
        },
        {
          "headline":"Choose plain or neutral-flavored crackers and breads.",
          "description":"Avoid any strong-flavored breads or crackers that will overwhelm the flavor of your cheeses. Skip any items that have garlic or herb flavorings. Instead, choose sourdough or French bread and neutral-flavored crackers."
        },
        {
          "headline":"Skip most raw vegetables.",
          "description":"Although not all vegetables are bad for pairing with cheese, try to avoid those with strong flavors. Carrots, broccoli, and cauliflower are not natural pairings with most cheeses. If you are going to serve vegetables, stick with things like sliced fennel and endive spears."
        },
        {
          "headline":"Pick sweet fruits that are not too acidic.",
          "description":"Serve your guests fruits like apples, pears, grapes, and figs. You might also want to serve some dried fruits and raisins. These items will complement the flavors of your cheeses and not distract from or overwhelm them. Avoid fruits like orange, grapefruit, kiwi and pineapple. These fruits have a tendency to make the cheeses taste bitter in your mouth."
        },
        {
          "headline":"Pair your cheese with your wine.",
          "description":"In general, you should try to pair milder cheese with lighter, milder wine and stronger-flavored cheeses with more robust, bolder wines. When in doubt, it also helps to remember the old adage, “what grows together goes together.” Cheeses from specific regions tend to pair well with wines from the same area. For example, a goat cheese from the Loire pairs well with a Loire Sancerre. If you are struggling to determine good pairings, talk to a sommelier or a cheesemonger."
        },
        {
          "headline":"Match your cheese with the right beer.",
          "description":"The rules for pairing cheeses and beers are very similar to those that dictate wine. Lighter cheeses go well with lighter beers and stronger cheeses pair well with darker, heavier beers. You should also look with an eye for geography and try to create pairings from the same region. Consider having a variety of beers available for your guests that pair well with the cheeses available."
        }
      ]
    },
    {
      "name":"Preparing the Cheese",
      "steps":[
        {
          "headline":"Determine how much to serve.",
          "description":"You will want to avoid over serving your guests during the appetizer. In order to accomplish this, you should plan to serve about 1 to 2 ounces (28 to 57 grams) of cheese per guest. Ultimately, the amount of cheese you will serve is going to depend on how many guests you invite. For example, if your dinner party includes eight people, you will want to make sure that you serve at least 16 ounces (454 grams) of cheese."
        },
        {
          "headline":"Precut hard, semi-hard and semi-soft cheeses into wedges or cubes.",
          "description":"You should slice firmer cheeses before serving them to your guests. With the harder cheese in particular, you do not want your guests struggling to cut off slices on the tray. Make things easy for your guests by slicing or breaking off chunks of the cheese beforehand. Hard and semi-hard cheeses include gouda, cheddar, Swiss and parmesan. Semi-soft cheeses include bleu cheese, Monterey Jack and Havarti. Exposure to the air can really enhance the flavor of certain semi-hard cheeses."
        },
        {
          "headline":"Present soft cheeses whole.",
          "description":"Leave soft cheeses in their rind and do not cut into them before you serve them. Because your guests will want to spread these cheeses on crackers and breads, you should serve them whole with a knife. The interior of some of these cheeses is runny so you will want to keep it whole until you serve your guests. Soft cheeses include brie and camembert. The rind is the firm exterior of the cheese. With many soft cheeses, the rind is edible."
        },
        {
          "headline":"Serve the cheese at room temperature.",
          "description":"Because cold mutes flavor, you will want to make sure that you serve your cheeses at room temperature. Be sure to remove your cheeses from the refrigerator at least an hour before serving them. Some harder cheeses may need two hours to properly warm up and aerate. Make sure you do not set out your cheeses in a warm room. This can cause them to melt."
        }
      ]
    },
    {
      "name":"Serving the Cheese",
      "steps":[
        {
          "headline":"Give the cheeses some room.",
          "description":"When you present your cheeses, make sure that they are not too close together. Stronger smelling cheeses can overwhelm lighter cheeses. If you place your milder cheeses close to a stinky cheese, they all may end up tasting like the pungent cheese. Spreading out your cheeses also makes it easier for your guests to get to them. If you really want to give your cheeses some room, consider placing them on their own plate or platter."
        },
        {
          "headline":"Keep the cheese separate from other foods.",
          "description":"You should also avoid placing the cheeses in close proximity to the foods with which you have paired them. This will prevent stronger smelling items from overwhelming your lighter cheeses. Although it may be esthetically more pleasing to have everything clumped together, spreading things out will preserve the flavor of the cheese and prevent any traffic jams at the hors d'oeuvres table."
        },
        {
          "headline":"Use a different knife for each cheese.",
          "description":"For your softer cheeses, make sure to give each cheese its own knife. This will prevent a cross-contamination of flavors. The same is true for your harder cheeses if you decide not to precut them. A butter knife will work well for softer cheeses. You may need a paring knife for harder cheeses."
        },
        {
          "headline":"Create the proper arrangement.",
          "description":"In order to help guide your guests, you may want to consider arranging your cheeses in a clockwise fashion from mildest to most pungent. You may also want to label the cheeses and briefly note their characteristics. Place the cheeses on a circular platter or a Lazy Susan to facilitate access and visibility."
        }
      ]
    }
  ],
  "text":" Choosing Your Cheeses Serve light cheeses before dinner. For an appetizer, you will want to serve light cheeses that are not heavy and will not fill your guests. You want to whet your guest's appetites, not satiate them. Consider serving light cheeses like fresh mozzarella and goat cheese. You might also consider a light cheese that pairs well with the main meal that you are serving. For example, goat cheese is a great compliment to Mediterranean or Middle Eastern dishes. Choose a variety of cheeses. In order to appreciate the truly complex flavors of cheese, the best strategy is to opt for a variety of different cheese types. Serve soft and hard cheeses with distinctly varied flavors. Mix in cheeses from different animals and from multiple geographic locations. Ideally, you will want to serve three to five cheeses. More than that can get a little overwhelming and crowd your serving area. For example, you may want to offer your guests a plate that includes Comte, camembert, Manchego, and gorgonzola. Develop a regional theme. One method of determining what cheeses to serve is to choose cheese from a specific geographic area. Focus on cheese from a certain country or a specific cheese-producing region. For example, you might decide that you want to serve Italian cheeses or choose serve cheeses exclusive to the Loire Valley of France. You can also do the opposite of this and serve a variety of cheese from around the world. Use cheeses made from different types of milk. You can also pick your cheeses based on the animal that produced it. Serve cheeses that come from goat, sheep, and cow's milk. This will give you a variety of flavors and a unique pairing. Stay in the same family. If you want a lesson in how to spot the differences between cheeses of the same family, consider a more homogenous cheese plate. For example, serve three or four different styles of brie and camembert. Let your guests appreciate the similarities of the cheeses while exploring their subtle differences. Finding the Right Pairings Serve savory accompaniments. When you are serving cheese as an appetizer, try to pair it with savory foods. This can include cured meats, like prosciutto and salami, nuts, roasted red peppers, and sauces like mustards and chutneys. You might also consider serving caramelized onions or artichoke hearts. Try to avoid spicy things. The heat of these foods can overwhelm the flavor of your cheese. Olives also make a good accompaniment. Choose plain or neutral-flavored crackers and breads. Avoid any strong-flavored breads or crackers that will overwhelm the flavor of your cheeses. Skip any items that have garlic or herb flavorings. Instead, choose sourdough or French bread and neutral-flavored crackers. Skip most raw vegetables. Although not all vegetables are bad for pairing with cheese, try to avoid those with strong flavors. Carrots, broccoli, and cauliflower are not natural pairings with most cheeses. If you are going to serve vegetables, stick with things like sliced fennel and endive spears. Pick sweet fruits that are not too acidic. Serve your guests fruits like apples, pears, grapes, and figs. You might also want to serve some dried fruits and raisins. These items will complement the flavors of your cheeses and not distract from or overwhelm them. Avoid fruits like orange, grapefruit, kiwi and pineapple. These fruits have a tendency to make the cheeses taste bitter in your mouth. Pair your cheese with your wine. In general, you should try to pair milder cheese with lighter, milder wine and stronger-flavored cheeses with more robust, bolder wines. When in doubt, it also helps to remember the old adage, “what grows together goes together.” Cheeses from specific regions tend to pair well with wines from the same area. For example, a goat cheese from the Loire pairs well with a Loire Sancerre. If you are struggling to determine good pairings, talk to a sommelier or a cheesemonger. Match your cheese with the right beer. The rules for pairing cheeses and beers are very similar to those that dictate wine. Lighter cheeses go well with lighter beers and stronger cheeses pair well with darker, heavier beers. You should also look with an eye for geography and try to create pairings from the same region. Consider having a variety of beers available for your guests that pair well with the cheeses available. Preparing the Cheese Determine how much to serve. You will want to avoid over serving your guests during the appetizer. In order to accomplish this, you should plan to serve about 1 to 2 ounces (28 to 57 grams) of cheese per guest. Ultimately, the amount of cheese you will serve is going to depend on how many guests you invite. For example, if your dinner party includes eight people, you will want to make sure that you serve at least 16 ounces (454 grams) of cheese. Precut hard, semi-hard and semi-soft cheeses into wedges or cubes. You should slice firmer cheeses before serving them to your guests. With the harder cheese in particular, you do not want your guests struggling to cut off slices on the tray. Make things easy for your guests by slicing or breaking off chunks of the cheese beforehand. Hard and semi-hard cheeses include gouda, cheddar, Swiss and parmesan. Semi-soft cheeses include bleu cheese, Monterey Jack and Havarti. Exposure to the air can really enhance the flavor of certain semi-hard cheeses. Present soft cheeses whole. Leave soft cheeses in their rind and do not cut into them before you serve them. Because your guests will want to spread these cheeses on crackers and breads, you should serve them whole with a knife. The interior of some of these cheeses is runny so you will want to keep it whole until you serve your guests. Soft cheeses include brie and camembert. The rind is the firm exterior of the cheese. With many soft cheeses, the rind is edible. Serve the cheese at room temperature. Because cold mutes flavor, you will want to make sure that you serve your cheeses at room temperature. Be sure to remove your cheeses from the refrigerator at least an hour before serving them. Some harder cheeses may need two hours to properly warm up and aerate. Make sure you do not set out your cheeses in a warm room. This can cause them to melt. Serving the Cheese Give the cheeses some room. When you present your cheeses, make sure that they are not too close together. Stronger smelling cheeses can overwhelm lighter cheeses. If you place your milder cheeses close to a stinky cheese, they all may end up tasting like the pungent cheese. Spreading out your cheeses also makes it easier for your guests to get to them. If you really want to give your cheeses some room, consider placing them on their own plate or platter. Keep the cheese separate from other foods. You should also avoid placing the cheeses in close proximity to the foods with which you have paired them. This will prevent stronger smelling items from overwhelming your lighter cheeses. Although it may be esthetically more pleasing to have everything clumped together, spreading things out will preserve the flavor of the cheese and prevent any traffic jams at the hors d'oeuvres table. Use a different knife for each cheese. For your softer cheeses, make sure to give each cheese its own knife. This will prevent a cross-contamination of flavors. The same is true for your harder cheeses if you decide not to precut them. A butter knife will work well for softer cheeses. You may need a paring knife for harder cheeses. Create the proper arrangement. In order to help guide your guests, you may want to consider arranging your cheeses in a clockwise fashion from mildest to most pungent. You may also want to label the cheeses and briefly note their characteristics. Place the cheeses on a circular platter or a Lazy Susan to facilitate access and visibility.",
  "tyn_model":[
    "cheese",
    "goat cheese",
    "camembert",
    "crackers",
    "vegetables",
    "wine",
    "knife",
    "plate",
    "brie",
    "mozzarella",
    "cheeses",
    "comte",
    "gorgonzola",
    "milk",
    "cheese plate",
    "salami",
    "nuts",
    "sauces",
    "artichoke hearts",
    "olives",
    "sourdough or",
    "french bread",
    "carrots",
    "broccoli",
    "cauliflower",
    "fennel",
    "endive spears",
    "apples",
    "pears",
    "grapes",
    "raisins",
    "fruits",
    "orange",
    "grapefruit",
    "pineapple",
    "“what",
    "” cheeses",
    "wines",
    "sommelier",
    "beer",
    "beers",
    "tray",
    "cheddar",
    "swiss",
    "parmesan",
    "bleu cheese",
    "refrigerator",
    "platter",
    "butter knife",
    "paring knife",
    "lazy susan"
  ],
  "tyn_section":[

  ]
}