{
  "title":"How to Improve a Bathroom Without Remodeling",
  "url":"https://www.wikihow.com/Improve-a-Bathroom-Without-Remodeling",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Freshening Up the Look of the Bathroom",
      "steps":[
        {
          "headline":"Deep clean everything.",
          "description":"You can often improve the look of your bathroom by simply cleaning it. Before you start making more significant overhauls, simply scrub, wipe, dust and polish everything in sight, from the grout in the floor tiles to the shower curtain liner. Chances are, your bathroom will look newer, brighter and more inviting when you’re finished. A thorough cleaning can be very restorative for bathroom surfaces, which tend to show grime and discoloration very obviously. You should aim to clean and sanitize your bathroom at least once every couple of weeks."
        },
        {
          "headline":"Add a fresh coat of paint.",
          "description":"Most bathrooms are finished in drab, sterile hues. Remedy this by adding a new shade to the walls. With just a couple hours work, a lifeless white washroom can be completely transformed with playful plum or rustic olive tones. Best of all, painting is something you can do as many times as you want, so you can continue to change the motif of your bathroom over the years. Painting the walls of your bathroom can create a day-and-night difference, even if you don’t change anything else. You could also restain wood floors to improve their finish and durability."
        },
        {
          "headline":"Hide unsightly items.",
          "description":"It can be pretty unattractive to look around your bathroom and see it littered with toilet paper packages, dirty scrubbing brushes and bottles of cleaning supplies. Keep the kinds of things out of sight to highlight the comfort and serenity of the room. Use your available cabinet space or a separate supply closet to stash away items that make your intimate space look like a public restroom. Find unconventional means for storing bathroom necessities, such as a wicker basket for holding toilet paper or a multi-level fruit hanger for organizing shower supplies. Place bins full of bath products on shelves above the toilet to keep clutter off the counters."
        },
        {
          "headline":"Buy all new bath accessories.",
          "description":"Sometimes you just have to throw everything out and start over. Now is the perfect time to treat yourself to fresh bath towels, shower mats and curtains, soap dispensers or even a new toilet brush. Look for goods in different colors and styles than you’ve grown accustomed to in order to break up the monotony and get you excited about a peaceful escape to the powder room again. Updating little details is an inexpensive and immediate way to breathe new life into a tired bathroom. New towels not only make your bathroom look better, they also make your bathing experience more luxurious."
        }
      ]
    },
    {
      "name":"Making Basic Upgrades",
      "steps":[
        {
          "headline":"Replace your fixtures.",
          "description":"Do away with old hardware, like faucets, towel racks and sink and drawer handles. With time, these pieces can rust, stain or just become tedious, making them unpleasant to look at. Spend a little time and money picking out new eye-catching fixtures that more accurately reflect your evolving tastes and design ideas for your bathroom. You’d be surprised how much difference a new set of knobs or shower curtain rod can make. Though they’re small touches, your fixtures say a lot about the state of your bathroom. They tend to be in the areas that receive the most use, which means they’re one of the things people commonly notice. Choose fixtures with finishes that are the same or complementary to each other. Make sure you clean and polish your hardware regularly to keep it looking new."
        },
        {
          "headline":"Put in a new shower head.",
          "description":"Chances are, you’re still using the original shower head your bathroom came outfitted with. While this is more equipment than decoration, investing in a new shower head can do wonders for both your physical comfort and the look of your shower area. Consider which practical features you like, then shop around for different sizes and stylish designs and finishes. You can readily find inexpensive shower heads in elegant finishes like brass or graphite, while more expensive shower heads will also allow you to control the flow and pressure of the stream."
        },
        {
          "headline":"Make use of racks, shelves and cabinets.",
          "description":"Forget about stowing everything away under the sink. Mount an extra rack or shelf, or make room for a small, open cabinet and use this to organize your bath items. With more storage space, you’ll not only be able to change the appearance of your bathroom, but also eliminate the kind of clutter that has a tendency to accumulate in the areas where you spend the most time getting ready. Hang a standard kitchen spice rack and use it to store hand soaps, deodorant, shaving supplies and other items. Stow away toiletries you don’t want out in the open in an old repainted nightstand."
        },
        {
          "headline":"Install a dimmer light switch.",
          "description":"One simple trick that can make your bathroom more cozy is to soften the lighting. By swapping your standard light switch for a dimmer, you can fine-tune the brightness of the room, cranking it up when you’re shaving or doing your makeup and lowering it to a soft glow when you want to treat yourself to a spa-like experience. Custom lighting can lend a bit of class and tranquility to an otherwise unremarkable room. Lower light is perfect for taking a relaxing bubble bath, or for those times when you get up to use the restroom in the middle of the night and don’t want bright light shining right in your eyes. A good contractor can install a dimmer switch in just a few minutes, or you can look up instructions for how to do it yourself here. Alternatively, add ambience with candles (with real or fake flames). Candles are a cheap and easy way to spruce up your bathroom and also make the room smell great."
        },
        {
          "headline":"Put in new tile.",
          "description":"Ceramic tile is a relatively inexpensive way to refresh the appearance of your bathroom, and, since it covers so much surface area, makes a big impact on the room's appearance without the need to knock out a wall or have the plumbing redone. Natural stoneware or bright, colorful tiles can be used to cover up time-worn walls and floors, giving your lavatory the dressing up it desperately needs. While installing new tile is a bigger project than simply buying a new set of towels, it can usually be done in a single weekend, and allows you to fully customize the final outcome. Provided you have the right budget to work with, you can install new tile yourself for only a few hundred dollars worth of tools and materials. This could save you thousands of dollars in contractor's fees. Compare tiles in different shades, patterns and configurations to find the perfect match for your redesigned bathroom. If your tile is in good shape, you can paint it instead of replacing it, which is quicker and cheaper."
        }
      ]
    },
    {
      "name":"Refining Your Decor",
      "steps":[
        {
          "headline":"Get color coordinated.",
          "description":"Even if you don’t lay down new tile or paint over your monochromatic walls, you can liven the place up a bit by simply introducing new color schemes. Keep things quaint and homey with  bright pastels and elegant designs, or create an “executive suite” feel by doing your towels, mats, curtains and other accents in black and gold. Bath accessories come in a huge range of colors and patterns, so don’t be afraid to get creative when it comes to mixing and matching. Buy multiple sets of towels and other items and swap them out periodically to keep things looking and feeling fresh. Different bath accessories can be used to alternately complement or provide a pleasant contrast to the color and lighting of the bathroom."
        },
        {
          "headline":"Include some artwork.",
          "description":"It may be that your bathroom is just missing something. A few pieces of well-displayed artwork can really help tie together the furnishings of the room and make it feel more full. Keep an eye out for tasteful photographs, traditional paintings or zany modern works that you think might make your washroom more visually interesting. A single captivating piece can be the difference between empty and engaging. When shopping around for bathroom art, consider your own personality and go with something that reflects your own style and interests. Remember that moisture builds up in bathrooms, so choose framed pieces and be sure to hang your expensive artwork elsewhere."
        },
        {
          "headline":"Add a little flora.",
          "description":"Flowers aren’t just for your kitchen table. Try placing an arrangement of chrysanthemums on the counter alongside your sink, or work a fern or a few stalks of bamboo into a vacant corner or a nook opposite the shower. The natural appeal of plants can pleasantly offset a bathroom full of hard, flat materials like porcelain, tile and metal. Orchids make great flowers to keep in your bathroom because they develop beautiful, vibrant coloring and tolerate heat and moisture well. Bamboo is another great option as it is easy to maintain and doesn’t require much light. The vibrant green adds a pop of color and a spa-like feel."
        },
        {
          "headline":"Give the room a theme.",
          "description":"Devise a theme for you bathroom and hand pick your decorations accordingly. Why settle for a plain white-on-white when you could perform your daily hygiene in a hunter’s lodge or Victorian garden aesthetic? By choosing complimentary fixtures, accessories and ornamentations, you can distinguish your bathroom and give it even more personality than other rooms in the house. For example, you could deck out a half bath with a beach or nautical theme, complete with seafoam and coral tones, jars of sand and seashells and a framed watercolor painting of a schooner. You might also do a bathroom in a “farmhouse” style, with unfinished wood racks and cabinets and a repurposed old-fashioned toolbox to hold your soaps and shampoos. If you have multiple bathrooms in your home, decorate them all in different visual themes."
        }
      ]
    }
  ],
  "text":" Freshening Up the Look of the Bathroom Deep clean everything. You can often improve the look of your bathroom by simply cleaning it. Before you start making more significant overhauls, simply scrub, wipe, dust and polish everything in sight, from the grout in the floor tiles to the shower curtain liner. Chances are, your bathroom will look newer, brighter and more inviting when you’re finished. A thorough cleaning can be very restorative for bathroom surfaces, which tend to show grime and discoloration very obviously. You should aim to clean and sanitize your bathroom at least once every couple of weeks. Add a fresh coat of paint. Most bathrooms are finished in drab, sterile hues. Remedy this by adding a new shade to the walls. With just a couple hours work, a lifeless white washroom can be completely transformed with playful plum or rustic olive tones. Best of all, painting is something you can do as many times as you want, so you can continue to change the motif of your bathroom over the years. Painting the walls of your bathroom can create a day-and-night difference, even if you don’t change anything else. You could also restain wood floors to improve their finish and durability. Hide unsightly items. It can be pretty unattractive to look around your bathroom and see it littered with toilet paper packages, dirty scrubbing brushes and bottles of cleaning supplies. Keep the kinds of things out of sight to highlight the comfort and serenity of the room. Use your available cabinet space or a separate supply closet to stash away items that make your intimate space look like a public restroom. Find unconventional means for storing bathroom necessities, such as a wicker basket for holding toilet paper or a multi-level fruit hanger for organizing shower supplies. Place bins full of bath products on shelves above the toilet to keep clutter off the counters. Buy all new bath accessories. Sometimes you just have to throw everything out and start over. Now is the perfect time to treat yourself to fresh bath towels, shower mats and curtains, soap dispensers or even a new toilet brush. Look for goods in different colors and styles than you’ve grown accustomed to in order to break up the monotony and get you excited about a peaceful escape to the powder room again. Updating little details is an inexpensive and immediate way to breathe new life into a tired bathroom. New towels not only make your bathroom look better, they also make your bathing experience more luxurious. Making Basic Upgrades Replace your fixtures. Do away with old hardware, like faucets, towel racks and sink and drawer handles. With time, these pieces can rust, stain or just become tedious, making them unpleasant to look at. Spend a little time and money picking out new eye-catching fixtures that more accurately reflect your evolving tastes and design ideas for your bathroom. You’d be surprised how much difference a new set of knobs or shower curtain rod can make. Though they’re small touches, your fixtures say a lot about the state of your bathroom. They tend to be in the areas that receive the most use, which means they’re one of the things people commonly notice. Choose fixtures with finishes that are the same or complementary to each other. Make sure you clean and polish your hardware regularly to keep it looking new. Put in a new shower head. Chances are, you’re still using the original shower head your bathroom came outfitted with. While this is more equipment than decoration, investing in a new shower head can do wonders for both your physical comfort and the look of your shower area. Consider which practical features you like, then shop around for different sizes and stylish designs and finishes. You can readily find inexpensive shower heads in elegant finishes like brass or graphite, while more expensive shower heads will also allow you to control the flow and pressure of the stream. Make use of racks, shelves and cabinets. Forget about stowing everything away under the sink. Mount an extra rack or shelf, or make room for a small, open cabinet and use this to organize your bath items. With more storage space, you’ll not only be able to change the appearance of your bathroom, but also eliminate the kind of clutter that has a tendency to accumulate in the areas where you spend the most time getting ready. Hang a standard kitchen spice rack and use it to store hand soaps, deodorant, shaving supplies and other items. Stow away toiletries you don’t want out in the open in an old repainted nightstand. Install a dimmer light switch. One simple trick that can make your bathroom more cozy is to soften the lighting. By swapping your standard light switch for a dimmer, you can fine-tune the brightness of the room, cranking it up when you’re shaving or doing your makeup and lowering it to a soft glow when you want to treat yourself to a spa-like experience. Custom lighting can lend a bit of class and tranquility to an otherwise unremarkable room. Lower light is perfect for taking a relaxing bubble bath, or for those times when you get up to use the restroom in the middle of the night and don’t want bright light shining right in your eyes. A good contractor can install a dimmer switch in just a few minutes, or you can look up instructions for how to do it yourself here. Alternatively, add ambience with candles (with real or fake flames). Candles are a cheap and easy way to spruce up your bathroom and also make the room smell great. Put in new tile. Ceramic tile is a relatively inexpensive way to refresh the appearance of your bathroom, and, since it covers so much surface area, makes a big impact on the room's appearance without the need to knock out a wall or have the plumbing redone. Natural stoneware or bright, colorful tiles can be used to cover up time-worn walls and floors, giving your lavatory the dressing up it desperately needs. While installing new tile is a bigger project than simply buying a new set of towels, it can usually be done in a single weekend, and allows you to fully customize the final outcome. Provided you have the right budget to work with, you can install new tile yourself for only a few hundred dollars worth of tools and materials. This could save you thousands of dollars in contractor's fees. Compare tiles in different shades, patterns and configurations to find the perfect match for your redesigned bathroom. If your tile is in good shape, you can paint it instead of replacing it, which is quicker and cheaper. Refining Your Decor Get color coordinated. Even if you don’t lay down new tile or paint over your monochromatic walls, you can liven the place up a bit by simply introducing new color schemes. Keep things quaint and homey with  bright pastels and elegant designs, or create an “executive suite” feel by doing your towels, mats, curtains and other accents in black and gold. Bath accessories come in a huge range of colors and patterns, so don’t be afraid to get creative when it comes to mixing and matching. Buy multiple sets of towels and other items and swap them out periodically to keep things looking and feeling fresh. Different bath accessories can be used to alternately complement or provide a pleasant contrast to the color and lighting of the bathroom. Include some artwork. It may be that your bathroom is just missing something. A few pieces of well-displayed artwork can really help tie together the furnishings of the room and make it feel more full. Keep an eye out for tasteful photographs, traditional paintings or zany modern works that you think might make your washroom more visually interesting. A single captivating piece can be the difference between empty and engaging. When shopping around for bathroom art, consider your own personality and go with something that reflects your own style and interests. Remember that moisture builds up in bathrooms, so choose framed pieces and be sure to hang your expensive artwork elsewhere. Add a little flora. Flowers aren’t just for your kitchen table. Try placing an arrangement of chrysanthemums on the counter alongside your sink, or work a fern or a few stalks of bamboo into a vacant corner or a nook opposite the shower. The natural appeal of plants can pleasantly offset a bathroom full of hard, flat materials like porcelain, tile and metal. Orchids make great flowers to keep in your bathroom because they develop beautiful, vibrant coloring and tolerate heat and moisture well. Bamboo is another great option as it is easy to maintain and doesn’t require much light. The vibrant green adds a pop of color and a spa-like feel. Give the room a theme. Devise a theme for you bathroom and hand pick your decorations accordingly. Why settle for a plain white-on-white when you could perform your daily hygiene in a hunter’s lodge or Victorian garden aesthetic? By choosing complimentary fixtures, accessories and ornamentations, you can distinguish your bathroom and give it even more personality than other rooms in the house. For example, you could deck out a half bath with a beach or nautical theme, complete with seafoam and coral tones, jars of sand and seashells and a framed watercolor painting of a schooner. You might also do a bathroom in a “farmhouse” style, with unfinished wood racks and cabinets and a repurposed old-fashioned toolbox to hold your soaps and shampoos. If you have multiple bathrooms in your home, decorate them all in different visual themes.",
  "tyn_model":[
    "towels",
    "shower head",
    "paint",
    "shower heads",
    "candles",
    "tile",
    "tiles",
    "artwork",
    "flowers",
    "bamboo",
    "shower curtain",
    "toilet paper",
    "cleaning supplies",
    "wicker basket",
    "bath towels",
    "shower mats",
    "soap dispensers",
    "toilet brush",
    "shower curtain rod",
    "fixtures",
    "ceramic tile",
    "“executive",
    "” feel",
    "bath accessories",
    "flora",
    "chrysanthemums",
    "fern",
    "plants",
    "orchids",
    "decorations",
    "bathroom",
    "“farmhouse",
    "” style"
  ],
  "tyn_section":[

  ]
}