{
  "title":"How to Make Christmas Light Cupcakes",
  "url":"https://www.wikihow.com/Make-Christmas-Light-Cupcakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350° Fahrenheit (176° Celsius).",
      "description":""
    },
    {
      "headline":"Line a cupcake tray with 18 paper liners.",
      "description":""
    },
    {
      "headline":"Mix the cake mix, pudding mix, and wet ingredients in a large bowl.",
      "description":"Beat using an electric mixer and blend until well-combined."
    },
    {
      "headline":"Scoop the batter onto each liner on the cupcake tray.",
      "description":""
    },
    {
      "headline":"Place the tray in the oven and allow the cupcakes to bake for about 18-20 minutes.",
      "description":""
    },
    {
      "headline":"Allow the cupcakes to cool on a wire rack for about 10 minutes.",
      "description":""
    },
    {
      "headline":"Pipe vanilla buttercream frosting onto each cupcake.",
      "description":""
    },
    {
      "headline":"Swirl around the black frosting each cupcake using a frosting pipe with a round tip.",
      "description":"This will resemble the 'wires' on the lights."
    },
    {
      "headline":"Poke M&Ms into each cupcake vertically (not flat) so that a 'half moon' of each M&M sticks out.",
      "description":"These will resemble the 'Christmas-themed lights'."
    },
    {
      "headline":"Serve.",
      "description":"Place the cupcakes on a large serving plate and serve with a glass of milk if desired. Enjoy!"
    }
  ],
  "text":" Preheat the oven to 350° Fahrenheit (176° Celsius).  Line a cupcake tray with 18 paper liners.  Mix the cake mix, pudding mix, and wet ingredients in a large bowl. Beat using an electric mixer and blend until well-combined. Scoop the batter onto each liner on the cupcake tray.  Place the tray in the oven and allow the cupcakes to bake for about 18-20 minutes.  Allow the cupcakes to cool on a wire rack for about 10 minutes.  Pipe vanilla buttercream frosting onto each cupcake.  Swirl around the black frosting each cupcake using a frosting pipe with a round tip. This will resemble the 'wires' on the lights. Poke M&Ms into each cupcake vertically (not flat) so that a 'half moon' of each M&M sticks out. These will resemble the 'Christmas-themed lights'. Serve. Place the cupcakes on a large serving plate and serve with a glass of milk if desired. Enjoy!",
  "tyn_model":[
    "oven",
    "cupcake tray",
    "cake mix",
    "pudding mix",
    "large bowl",
    "electric mixer",
    "vanilla buttercream frosting",
    "frosting pipe",
    "m&ms",
    "large serving plate",
    "milk"
  ],
  "tyn_section":[

  ]
}