{
  "title":"How to Make Chlodnik",
  "url":"https://www.wikihow.com/Make-Chlodnik",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "steps":[
    {
      "headline":"Prepare the vegetables.",
      "description":"Chop up green onions, beets, cucumber, and dill. Once complete, set aside."
    },
    {
      "headline":"Grab a large pot and place the beets inside.",
      "description":"Fill the pot with water until it covers the beets allow the beets to boil for 15- 20 minutes or until tender."
    },
    {
      "headline":"Remove the beets from the stove top.",
      "description":"Pour in the chicken stock and let the beets cool down."
    },
    {
      "headline":"Pick a separate bowl to whisk the buttermilk and sour cream together.",
      "description":""
    },
    {
      "headline":"Use another bowl for the dill, and green onions.",
      "description":"Mix both these ingredients together well."
    },
    {
      "headline":"Mix in both the butter milk and dill mixtures into the chilled beets.",
      "description":""
    },
    {
      "headline":"Cut the boiled egg in half and place on top of the chlodnik.",
      "description":""
    },
    {
      "headline":"Refrigerate the chlodnik for 2 hours or more.",
      "description":"You can leave it in the fridge overnight if desired."
    },
    {
      "headline":"Remove the chlodnik from the fridge and serve in a bowl.",
      "description":""
    },
    {
      "headline":"Enjoy your chlodnik!",
      "description":""
    }
  ],
  "text":" Prepare the vegetables. Chop up green onions, beets, cucumber, and dill. Once complete, set aside. Grab a large pot and place the beets inside. Fill the pot with water until it covers the beets allow the beets to boil for 15- 20 minutes or until tender. Remove the beets from the stove top. Pour in the chicken stock and let the beets cool down. Pick a separate bowl to whisk the buttermilk and sour cream together.  Use another bowl for the dill, and green onions. Mix both these ingredients together well. Mix in both the butter milk and dill mixtures into the chilled beets.  Cut the boiled egg in half and place on top of the chlodnik.  Refrigerate the chlodnik for 2 hours or more. You can leave it in the fridge overnight if desired. Remove the chlodnik from the fridge and serve in a bowl.  Enjoy your chlodnik! ",
  "tyn_model":[
    "dill",
    "bowl",
    "green onions",
    "beets",
    "vegetables",
    "cucumber",
    "large pot",
    "pot",
    "water",
    "stove top",
    "chicken stock",
    "buttermilk",
    "sour cream",
    "butter milk",
    "fridge"
  ],
  "tyn_section":[

  ]
}