{
  "title":"How to Use Coconut Flour",
  "url":"https://www.wikihow.com/Use-Coconut-Flour",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Using Coconut Flour in Baking",
      "steps":[
        {
          "headline":"Add less coconut flour than you would wheat flour.",
          "description":"Coconut flour is much more absorbent than wheat flour. That means that you usually need much less of it in a baking recipe. How much less depends on the recipe, but you may be using as little as a third of what you'd normally use."
        },
        {
          "headline":"Consider adding extra protein.",
          "description":"Because coconut flour has less protein than wheat flour, it can sometimes come off as a bit dense. Wheat flour produces gluten, which helps provide stretch and bite to baked goods. It can help to add in a bit of whey powder to your recipe when using coconut flour to help replace the gluten."
        },
        {
          "headline":"Pay attention to differences between flours.",
          "description":"Not every coconut flour is the same. Some are denser than others, making your recipes turn out differently. Pay attention to what the dough looks like before you bake it. It should be similar in consistency to a dough made with wheat flour. If it's not, you may need to adjust the recipe."
        },
        {
          "headline":"Add liquids in equal parts.",
          "description":"Unlike recipes calling for wheat flour, you need to add a significant amount of liquid to dough using coconut flour. Usually, you'll use one part liquid to one part coconut flour. You can use water, coconut milk, milk, or any other liquid you think would go well with the recipe. Another way to avoid dryness is to add pureed fruits to your baked goods, such as applesauce or pumpkin."
        },
        {
          "headline":"Add extra eggs.",
          "description":"When baking with coconut flour, the texture of the finished product relies more heavily on the eggs than it does on the flour. That means you need to add extra eggs when baking with coconut flour. You may use as many as 6 eggs while only using 1/2 a cup (118 milliliters) of coconut flour."
        },
        {
          "headline":"Try an established recipe first.",
          "description":"That is, you may decide you want to just substitute coconut flour in your favorite recipe. However, that's likely to end in disaster if you just substitute coconut flour for wheat flour one to one. It's better to use a recipe made for coconut flour that someone has already tested. Once you get the hang of baking with coconut flour, then you can start making changes to fit your needs. Looking for a good place to start? These coconut flour cupcakes are simple but delicious!"
        }
      ]
    },
    {
      "name":"Using Coconut Flour in Other Ways",
      "steps":[
        {
          "headline":"Add it as a binder for meatloaf and meatballs.",
          "description":"Coconut flour works well as a binder in recipes where you'd normally use ingredients like cracker or bread crumbs, such as meatloaf. However, you will need to double the liquid in the recipe because the coconut flour will absorb so much of it."
        },
        {
          "headline":"Experiment with using it in sauces.",
          "description":"Some people have good luck using it to thicken sauces, while others do not. In fact, some cooks recommend not trying it at all. However, you should experiment and see what works for you. You may find it works well as a thickener for your purposes. Don't forget that coconut flour will absorb more liquid than wheat flour, though, so only try a little bit at a time."
        },
        {
          "headline":"Use it as a base for coconut shrimp or chicken.",
          "description":"If you want to make coconut chicken or shrimp, coconut flour makes a good base. Simply dip the meat into an egg wash first (whisked egg), then dip it into the coconut flour. You can also season it with salt and pepper. Next, dip it back into the egg, then roll it in coconut flakes. Finally, fry the meat as normal in oil."
        }
      ]
    }
  ],
  "text":" Using Coconut Flour in Baking Add less coconut flour than you would wheat flour. Coconut flour is much more absorbent than wheat flour. That means that you usually need much less of it in a baking recipe. How much less depends on the recipe, but you may be using as little as a third of what you'd normally use. Consider adding extra protein. Because coconut flour has less protein than wheat flour, it can sometimes come off as a bit dense. Wheat flour produces gluten, which helps provide stretch and bite to baked goods. It can help to add in a bit of whey powder to your recipe when using coconut flour to help replace the gluten. Pay attention to differences between flours. Not every coconut flour is the same. Some are denser than others, making your recipes turn out differently. Pay attention to what the dough looks like before you bake it. It should be similar in consistency to a dough made with wheat flour. If it's not, you may need to adjust the recipe. Add liquids in equal parts. Unlike recipes calling for wheat flour, you need to add a significant amount of liquid to dough using coconut flour. Usually, you'll use one part liquid to one part coconut flour. You can use water, coconut milk, milk, or any other liquid you think would go well with the recipe. Another way to avoid dryness is to add pureed fruits to your baked goods, such as applesauce or pumpkin. Add extra eggs. When baking with coconut flour, the texture of the finished product relies more heavily on the eggs than it does on the flour. That means you need to add extra eggs when baking with coconut flour. You may use as many as 6 eggs while only using 1/2 a cup (118 milliliters) of coconut flour. Try an established recipe first. That is, you may decide you want to just substitute coconut flour in your favorite recipe. However, that's likely to end in disaster if you just substitute coconut flour for wheat flour one to one. It's better to use a recipe made for coconut flour that someone has already tested. Once you get the hang of baking with coconut flour, then you can start making changes to fit your needs. Looking for a good place to start? These coconut flour cupcakes are simple but delicious! Using Coconut Flour in Other Ways Add it as a binder for meatloaf and meatballs. Coconut flour works well as a binder in recipes where you'd normally use ingredients like cracker or bread crumbs, such as meatloaf. However, you will need to double the liquid in the recipe because the coconut flour will absorb so much of it. Experiment with using it in sauces. Some people have good luck using it to thicken sauces, while others do not. In fact, some cooks recommend not trying it at all. However, you should experiment and see what works for you. You may find it works well as a thickener for your purposes. Don't forget that coconut flour will absorb more liquid than wheat flour, though, so only try a little bit at a time. Use it as a base for coconut shrimp or chicken. If you want to make coconut chicken or shrimp, coconut flour makes a good base. Simply dip the meat into an egg wash first (whisked egg), then dip it into the coconut flour. You can also season it with salt and pepper. Next, dip it back into the egg, then roll it in coconut flakes. Finally, fry the meat as normal in oil.",
  "tyn_model":[
    "coconut flour",
    "wheat flour",
    "eggs",
    "egg",
    "whey powder",
    "water",
    "coconut milk",
    "milk",
    "applesauce",
    "pumpkin",
    "flour",
    "bread crumbs",
    "coconut chicken",
    "egg wash",
    "salt and pepper",
    "coconut flakes",
    "oil"
  ],
  "tyn_section":[

  ]
}