{
  "title":"How to Make Mustard Seed Gravy",
  "url":"https://www.wikihow.com/Make-Mustard-Seed-Gravy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Gravies"
  ],
  "methods":[
    {
      "name":"Using Homemade Turkey Stock",
      "steps":[
        {
          "headline":"Soak the toasted mustard seeds.",
          "description":"If you are using toasted mustard seeds, soaking them overnight may help bring out their flavor. It will also help soften them up a little before you add them to the gravy. This may be a good option if you want your mustard seeds to be less crunchy."
        },
        {
          "headline":"Roast the meat.",
          "description":"Preheat your oven to 425 degrees Fahrenheit (218 degrees Celsius). Place the turkey neck and giblets in an ovenproof skillet and roast them for 35 to 40 minutes. Remove the skillet from the oven and deglaze the pan with a cup (237 mL) of red wine. Scrape the skillet and let the wine and meat simmer for about 8 to 10 minutes."
        },
        {
          "headline":"Simmer the stock.",
          "description":"Once the wine has properly deglazed the skillet, transfer the neck, giblets, and remaining liquid to a large stockpot. If you want, you can add the turkey wings and drumstick. You can also add vegetables like onions, carrots, celery and garlic for more flavors. Add 8 cups (2 L) of water to the stockpot and bring it to a boil. Reduce heat and let the mixture simmer for about 1 hour. Strain the stock into a bowl and discard the remaining solid pieces. If you like your gravy a little chunkier, consider leaving in any meaty pieces of turkey. You can also puree the remaining vegetable and meat and add it to the gravy. However, be sure to discard and bones or cartilage."
        },
        {
          "headline":"Make a roux.",
          "description":"Heat 4 tablespoons (57 g) of butter in a saucepan over medium heat. Once the butter melts, whisk in ¼ cup (60 g) of flour. Vigorously whisk the roux for about a minute. Be sure to whisk the roux to avoid any lumpiness."
        },
        {
          "headline":"Add stock.",
          "description":"Once the roux has set, slowly pour your stock into the mixture. Continue to whisk as you the stick to break down any clumps. Let the stock and roux mixture simmer for a few minutes or until it no longer tastes like flour. At this point you have plain turkey gravy."
        },
        {
          "headline":"Whisk in mustard.",
          "description":"Add 2 tablespoons (32 g) mustard seeds and whisk them into the gravy. Reduce the heat to low and allow the mixture to simmer for a few minutes. Season with a pinch of salt to taste. You can also add 2 teaspoons (5 mL) of soy sauce and a pinch of black pepper for a little more flavor. This recipe makes about 8 servings of mustard seed gravy."
        }
      ]
    },
    {
      "name":"Cooking a German Brown Mustard Seed Gravy",
      "steps":[
        {
          "headline":"Grind ½ tablespoons (8 g) each of Bavarian seasoning and mustard seeds.",
          "description":"If you want, you can grind your mustard seeds in a pestle with some Bavarian seasoning. However, you can also leave the seeds whole and largely get the same flavor. Grinding up the seasoning and mustard seeds will give you a smoother texture. If you are okay with some clumps, skip the grinding. Bavarian seasoning is a combination of mustard seed, thyme, garlic, rosemary, sage, and bay leaves. You can also skip the Bavarian seasoning and just use a full tablespoon (16 g) the mustard seeds."
        },
        {
          "headline":"Sauté the onions.",
          "description":"Melt 3 tablespoons (43 g) of butter in a saucepan and add ½ diced onion. Cook the onions on medium heat until they are clear. Be sure to stir the onions to keep them from burning."
        },
        {
          "headline":"Add the flour and seasonings.",
          "description":"Once the onions have cooked, you should whisk in 4 tablespoons (60 g) of flour along with your mustard seeds. Whisk the mixture for about one minute. Be sure to use a whisk to avoid creating any lumps in your gravy."
        },
        {
          "headline":"Mix in the broth.",
          "description":"Slowly add about 14 ounces (414 mL) of chicken broth to the roux. Whisk the mixture as your add the broth to break up any chunks of flour and onion. Simmer the broth until it is the desired thickness. Add salt and pepper to taste."
        }
      ]
    },
    {
      "name":"Creating a Beer-Based Mustard Seed Gravy",
      "steps":[
        {
          "headline":"Sauté the shallots.",
          "description":"Heat 3 tablespoons (43 g) of butter over medium heat. Once the butter has melted, add 2 thinly sliced shallots. Cook the shallots until they are soft."
        },
        {
          "headline":"Add the flour.",
          "description":"Once the shallots are cooked, sprinkle 3 tablespoons (45 g) of flour to make a roux. Use a whisk to keep the roux from getting clumpy. Whisk the roux for about a minute."
        },
        {
          "headline":"Pour in the beer.",
          "description":"As your roux sets, add 1 cup (237 mL) of dark beer to the mixture and continue to whisk until it is reduced completely. This will help deglaze your pan and add some flavor to your gravy. Be sure not to add too much beer and overwhelm the flavor of your gravy."
        },
        {
          "headline":"Add the chicken stock.",
          "description":"After the beer reduces, pour in 2 cups (474 mL) of chicken stock and turn up the heat. Whisk the chicken stock and roux to work out any lumps. Cook for about 5 minutes or until the flour flavor has cooked out of your gravy."
        },
        {
          "headline":"Whisk in mustard seeds and honey.",
          "description":"Remove your gravy from the heat and stir in 2 tablespoons (30 mL) of honey and 1 tablespoon (16 g) of mustard seeds. Let the gravy cool for a few minutes before serving. You may also want to sprinkle in some salt and black pepper to taste."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Using Homemade Turkey Stock Soak the toasted mustard seeds. If you are using toasted mustard seeds, soaking them overnight may help bring out their flavor. It will also help soften them up a little before you add them to the gravy. This may be a good option if you want your mustard seeds to be less crunchy. Roast the meat. Preheat your oven to 425 degrees Fahrenheit (218 degrees Celsius). Place the turkey neck and giblets in an ovenproof skillet and roast them for 35 to 40 minutes. Remove the skillet from the oven and deglaze the pan with a cup (237 mL) of red wine. Scrape the skillet and let the wine and meat simmer for about 8 to 10 minutes. Simmer the stock. Once the wine has properly deglazed the skillet, transfer the neck, giblets, and remaining liquid to a large stockpot. If you want, you can add the turkey wings and drumstick. You can also add vegetables like onions, carrots, celery and garlic for more flavors. Add 8 cups (2 L) of water to the stockpot and bring it to a boil. Reduce heat and let the mixture simmer for about 1 hour. Strain the stock into a bowl and discard the remaining solid pieces. If you like your gravy a little chunkier, consider leaving in any meaty pieces of turkey. You can also puree the remaining vegetable and meat and add it to the gravy. However, be sure to discard and bones or cartilage. Make a roux. Heat 4 tablespoons (57 g) of butter in a saucepan over medium heat. Once the butter melts, whisk in ¼ cup (60 g) of flour. Vigorously whisk the roux for about a minute. Be sure to whisk the roux to avoid any lumpiness. Add stock. Once the roux has set, slowly pour your stock into the mixture. Continue to whisk as you the stick to break down any clumps. Let the stock and roux mixture simmer for a few minutes or until it no longer tastes like flour. At this point you have plain turkey gravy. Whisk in mustard. Add 2 tablespoons (32 g) mustard seeds and whisk them into the gravy. Reduce the heat to low and allow the mixture to simmer for a few minutes. Season with a pinch of salt to taste. You can also add 2 teaspoons (5 mL) of soy sauce and a pinch of black pepper for a little more flavor. This recipe makes about 8 servings of mustard seed gravy. Cooking a German Brown Mustard Seed Gravy Grind ½ tablespoons (8 g) each of Bavarian seasoning and mustard seeds. If you want, you can grind your mustard seeds in a pestle with some Bavarian seasoning. However, you can also leave the seeds whole and largely get the same flavor. Grinding up the seasoning and mustard seeds will give you a smoother texture. If you are okay with some clumps, skip the grinding. Bavarian seasoning is a combination of mustard seed, thyme, garlic, rosemary, sage, and bay leaves. You can also skip the Bavarian seasoning and just use a full tablespoon (16 g) the mustard seeds. Sauté the onions. Melt 3 tablespoons (43 g) of butter in a saucepan and add ½ diced onion. Cook the onions on medium heat until they are clear. Be sure to stir the onions to keep them from burning. Add the flour and seasonings. Once the onions have cooked, you should whisk in 4 tablespoons (60 g) of flour along with your mustard seeds. Whisk the mixture for about one minute. Be sure to use a whisk to avoid creating any lumps in your gravy. Mix in the broth. Slowly add about 14 ounces (414 mL) of chicken broth to the roux. Whisk the mixture as your add the broth to break up any chunks of flour and onion. Simmer the broth until it is the desired thickness. Add salt and pepper to taste. Creating a Beer-Based Mustard Seed Gravy Sauté the shallots. Heat 3 tablespoons (43 g) of butter over medium heat. Once the butter has melted, add 2 thinly sliced shallots. Cook the shallots until they are soft. Add the flour. Once the shallots are cooked, sprinkle 3 tablespoons (45 g) of flour to make a roux. Use a whisk to keep the roux from getting clumpy. Whisk the roux for about a minute. Pour in the beer. As your roux sets, add 1 cup (237 mL) of dark beer to the mixture and continue to whisk until it is reduced completely. This will help deglaze your pan and add some flavor to your gravy. Be sure not to add too much beer and overwhelm the flavor of your gravy. Add the chicken stock. After the beer reduces, pour in 2 cups (474 mL) of chicken stock and turn up the heat. Whisk the chicken stock and roux to work out any lumps. Cook for about 5 minutes or until the flour flavor has cooked out of your gravy. Whisk in mustard seeds and honey. Remove your gravy from the heat and stir in 2 tablespoons (30 mL) of honey and 1 tablespoon (16 g) of mustard seeds. Let the gravy cool for a few minutes before serving. You may also want to sprinkle in some salt and black pepper to taste. Finished. ",
  "tyn_model":[
    "mustard seeds",
    "flour",
    "stock",
    "butter",
    "skillet",
    "salt",
    "bavarian seasoning",
    "onions",
    "broth",
    "chicken stock",
    "oven",
    "turkey",
    "garlic",
    "saucepan",
    "roux",
    "black pepper",
    "mustard seed gravy",
    "onion",
    "whisk",
    "beer",
    "honey",
    "turkey stock",
    "toasted mustard seeds",
    "ovenproof skillet",
    "red wine",
    "large stockpot",
    "turkey wings",
    "drumstick",
    "carrots",
    "water",
    "stockpot",
    "bowl",
    "mustard",
    "soy sauce",
    "pestle",
    "mustard seed",
    "thyme",
    "rosemary",
    "sage",
    "bay leaves",
    "seasonings",
    "chicken broth",
    "pepper",
    "dark beer"
  ],
  "tyn_section":[

  ]
}