{
  "title":"How to Make Cranberry Relish",
  "url":"https://www.wikihow.com/Make-Cranberry-Relish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments"
  ],
  "methods":[
    {
      "name":"Making Basic Cranberry Relish",
      "steps":[
        {
          "headline":"Wash and cut the orange.",
          "description":"Wash one orange and peel it. Carefully use a sharp knife to cut the orange into eight pieces. If the orange has seeds, remove them and throw them away. You should also wash and dry 12 ounces (340 g) of fresh cranberries. You could substitute other citrus for the orange. Use lemon or grapefruit for a refreshing taste."
        },
        {
          "headline":"Blend the cranberries and orange.",
          "description":"Put half of the cranberries and half of the orange pieces into a food processor or blender. Blitz the fruit until it's chopped as fine as you like. Scoop the chopped cranberries and oranges into a serving bowl. Process the rest of the cranberries and orange pieces and add them to the serving bowl. If your blender or food processor is large, you may be able to blend all of the fruit at once, instead of in batches."
        },
        {
          "headline":"Stir in the sugar.",
          "description":"Stir in 3/4 cup (150 g) of granulated sugar and taste the cranberry relish. If you'd like a sweeter relish, add another 1/4 cup (50 g) of sugar and taste the relish again. Continue tasting and adjusting the sugar until the relish is as sweet as you like it. At this point, you can stir in additional ingredients or refrigerate the relish until you're ready to serve it."
        }
      ]
    },
    {
      "name":"Trying Variations",
      "steps":[
        {
          "headline":"Add nuts.",
          "description":"For extra crunch in your cranberry relish, add about 1/2 cup of chopped nuts to the relish. Ensure that the nuts are toasted so they're especially crisp. Consider using chopped walnuts, pecans, or almonds. Raw, untoasted nuts may become soft or chewy the longer they're in the relish. If you use raw nuts, serve the relish immediately."
        },
        {
          "headline":"Stir in additional flavors.",
          "description":"Although cranberries are tangy on their own, other tangy flavors work well in the relish. For example, you could add about 3/4 of a teaspoon of balsamic vinegar or sherry vinegar to bring out the flavor. You could also try stirring in one of the following ingredients to taste:\nOrange liqueur\nPomegranate juice\nCognac"
        },
        {
          "headline":"Mix in additional fruit.",
          "description":"While traditional cranberry relish usually has orange zest or juice, you can mix in other chopped fruits like pineapple, dried figs, grapes, apples, or raisins. If you'd like to keep the fruit large, add the chopped fruit after you've pureed the cranberry relish. If you're watching your sugar intake, you could use one cup of pitted dates in place of the sugar."
        },
        {
          "headline":"Add in spices.",
          "description":"You can easily adjust the flavors of the cranberry relish by adding some of your favorite ground spices. Start by adding just a little of the spice so you can gradually add more as you like. Stir in some of these spices:\nGinger\nCinnamon\nClove\nNutmeg\nCardamom"
        }
      ]
    }
  ],
  "text":" Making Basic Cranberry Relish Wash and cut the orange. Wash one orange and peel it. Carefully use a sharp knife to cut the orange into eight pieces. If the orange has seeds, remove them and throw them away. You should also wash and dry 12 ounces (340 g) of fresh cranberries. You could substitute other citrus for the orange. Use lemon or grapefruit for a refreshing taste. Blend the cranberries and orange. Put half of the cranberries and half of the orange pieces into a food processor or blender. Blitz the fruit until it's chopped as fine as you like. Scoop the chopped cranberries and oranges into a serving bowl. Process the rest of the cranberries and orange pieces and add them to the serving bowl. If your blender or food processor is large, you may be able to blend all of the fruit at once, instead of in batches. Stir in the sugar. Stir in 3/4 cup (150 g) of granulated sugar and taste the cranberry relish. If you'd like a sweeter relish, add another 1/4 cup (50 g) of sugar and taste the relish again. Continue tasting and adjusting the sugar until the relish is as sweet as you like it. At this point, you can stir in additional ingredients or refrigerate the relish until you're ready to serve it. Trying Variations Add nuts. For extra crunch in your cranberry relish, add about 1/2 cup of chopped nuts to the relish. Ensure that the nuts are toasted so they're especially crisp. Consider using chopped walnuts, pecans, or almonds. Raw, untoasted nuts may become soft or chewy the longer they're in the relish. If you use raw nuts, serve the relish immediately. Stir in additional flavors. Although cranberries are tangy on their own, other tangy flavors work well in the relish. For example, you could add about 3/4 of a teaspoon of balsamic vinegar or sherry vinegar to bring out the flavor. You could also try stirring in one of the following ingredients to taste:\nOrange liqueur\nPomegranate juice\nCognac Mix in additional fruit. While traditional cranberry relish usually has orange zest or juice, you can mix in other chopped fruits like pineapple, dried figs, grapes, apples, or raisins. If you'd like to keep the fruit large, add the chopped fruit after you've pureed the cranberry relish. If you're watching your sugar intake, you could use one cup of pitted dates in place of the sugar. Add in spices. You can easily adjust the flavors of the cranberry relish by adding some of your favorite ground spices. Start by adding just a little of the spice so you can gradually add more as you like. Stir in some of these spices:\nGinger\nCinnamon\nClove\nNutmeg\nCardamom",
  "tyn_model":[
    "cranberry relish",
    "cranberries",
    "nuts",
    "orange",
    "sugar",
    "food processor",
    "blender",
    "serving bowl",
    "citrus",
    "lemon",
    "grapefruit",
    "oranges",
    "granulated sugar",
    "walnuts",
    "pecans",
    "almonds",
    "balsamic vinegar",
    "sherry vinegar",
    "orange liqueur",
    "pomegranate juice",
    "cognac",
    "pineapple",
    "grapes",
    "apples",
    "raisins",
    "dates",
    "spices",
    "ground spices",
    "ginger",
    "cinnamon",
    "clove",
    "nutmeg",
    "cardamom"
  ],
  "tyn_section":[

  ]
}