{
  "title":"How to Report a Stolen Dog",
  "url":"https://www.wikihow.com/Report-a-Stolen-Dog",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Reporting the Theft to the Authorities",
      "steps":[
        {
          "headline":"Write down memories of the theft.",
          "description":"Note the date and time your dog was stolen. If you saw who took the dog, then write down a description: height, weight, age, gender, race, clothing, vehicle identification, etc. Write down these details while they are fresh in your memory. Your dog might have disappeared while you were away from home. In that case, talk to your neighbors and anyone else who travels through your neighborhood regularly, such as delivery drivers, meter readers, or mail carriers. They might have seen something. Write down the names and contact information of any witnesses. Also write down their description of the thief, if they saw someone."
        },
        {
          "headline":"Gather information about your dog.",
          "description":"You need to give the police a full description of your dog. Gather the following information as soon as you can:\nname\nbreed\nmarkings or color\nweight\nage\na current picture of your dog"
        },
        {
          "headline":"Report the theft to local police.",
          "description":"Don’t delay. The sooner you report, the sooner the police can find your missing dog. Some police might hesitate to file a police report for a missing animal. Remind the police that your dog is valuable property. Stealing an animal is a misdemeanor or a felony. If your dog has microchip, then ask the police to post the serial number and your dog’s description in the National Crime Information Center database under “stolen article.”\nMake sure you get a copy of the police report. You might need it later when going to pick up your dog."
        },
        {
          "headline":"Search for your dog.",
          "description":"The thief might be close to home. Walk around your neighborhood in the evening when noise has died down. Call your dog’s name and listen carefully for any response. You can bring your dog’s favorite treats with you or favorite toy (if it makes a lot of noise). These might prompt your dog to bark out in response. If you see your dog, don’t approach it unless you are absolutely sure it is safe to do so. This may be hard. However, the thief might catch wind that you have found your dog and move them to a new location before the police can arrive. Instead of approaching your dog, call the police promptly and report where the dog is located. Insist that an officer come out immediately."
        },
        {
          "headline":"Pay attention to other thefts in your neighborhood.",
          "description":"If more dogs go missing where you live, then call the police and report those as well. You can’t rely on the dogs’ owners to report the theft, so take it upon yourself to call. Also write down in a notebook the dates the animals have gone missing."
        }
      ]
    },
    {
      "name":"Posting Flyers",
      "steps":[
        {
          "headline":"Make a flyer.",
          "description":"Don’t rely solely on the police. Be proactive and create a flyer with information about your dog. Avoid mentioning that you think the dog was stolen—that might scare off the thief. Instead, include the following information:\nname\nbreed\ncolor\nmarkings\ndate and location last seen\na reward (but don’t state the amount)\nyour contact information\na statement that the dog is sick and needs help (this can deter thieves from trying to sell your dog)"
        },
        {
          "headline":"Distribute your flyers.",
          "description":"You want to paper the community. The thief might actually live near you, or they might try to sell your dog. Deliver flyers to the following places and ask if you can post the flyer:\nanimal shelters\nlocal pet stores\ngrocery stores\nveterinary offices\nmedical laboratories\npost offices\ndog parks\ntraffic intersections"
        },
        {
          "headline":"Publish a missing pet ad.",
          "description":"Contact your local newspaper and ask how much it costs to publish an ad. You’ll want to include most of the information on your flyer, including your contact information so people can reach you. Also consider a radio ad. Some radio stations publish missing pet ads. Include any details that you think will arouse sympathy in the reader. For example, you could say that your dog is a registered service animal or an emotional support animal."
        },
        {
          "headline":"Post information online.",
          "description":"There are many websites where you can report a stolen dog. You should post on as many as you can, including the following:\nMissingpet.net\nPetfinder\nCenter for Lost Pets\nLost Dogs of America\nLost Pet USA\nMissing Pet Partnership\nYour social media accounts, such as Twitter, Facebook, Google+, etc."
        },
        {
          "headline":"Respond to calls about your dog.",
          "description":"Someone might call and claim to have found your dog. You shouldn’t immediately believe them. Instead, ask detailed questions, especially if you are offering a reward for the dog. For example, have the caller describe your dog’s distinguishing characteristics. Try to meet the caller and the dog in a neutral, public place that is busy. Meeting will give you a chance to confirm the dog is yours. Take a friend with you. You’ll feel safer with someone else around. Hand over the reward only when you have your dog in hand. Never give the money beforehand."
        },
        {
          "headline":"Monitor pet sale ads.",
          "description":"Read the description of the animals for sale. If any match your dog, then write down the contact information. Some thieves steal animals to sell them. This is particularly true if your dog is a pure breed. Also check ads online, at websites such as Hoobly.com or Craigslist. If you see a description that you think matches your dog, call the police."
        },
        {
          "headline":"Don’t give up.",
          "description":"Sometimes people search for months before finding their missing or stolen pet. You have a better chance of finding your dog if you are persistent. Revisit any business or office where you posted flyers and check that the flyer is still up. If not, put up a new one."
        }
      ]
    },
    {
      "name":"Protecting Your Dogs",
      "steps":[
        {
          "headline":"Keep your dog inside.",
          "description":"When not at home, lock your dog inside. When you do let the dog outside, you should supervise where he or she goes. Of course, constant surveillance isn’t always possible. Consider building a shelter attached to your garage, or keep the dog in a fenced-in area which is not accessible from the road. Preferably, the yard should be behind the house, so it is not even visible form the street."
        },
        {
          "headline":"Prevent your dog from roaming.",
          "description":"If you let your dogs outside, then you’ll want to keep them from roaming far from home. A dog that runs away from home is vulnerable to being stolen. Do the following:\nPut them on a leash, especially if you can’t supervise where they are going or don’t have a fenced-in area. Avoid tying their leash to a lamp post or mailbox when you run into a store. Dogs can get free or, worse, become ripe targets for thieves. Spay or neuter your dog, which will reduce the desire to roam. Also sterilized animals are less valuable to thieves."
        },
        {
          "headline":"Identify your dog with tags and a microchip.",
          "description":"Your dogs should have a collar with an identification tag that includes your name, address, and phone number. Also get microchips for your dogs. Microchips are about the size of a grain of rice and are inserted underneath the dog’s skin. The microchip contains important information about your dog. When someone passes a scanner over the chip, it can read the unique code. The person scanning your dog then calls a registry and retrieves your contact information. It costs around $45 to have a microchip implanted. The chip should last the entire life of your dog. Implanting a microchip causes no more pain than a regular vaccination so don’t avoid a microchip out of fear of hurting your dog."
        },
        {
          "headline":"Avoid bragging about your dog.",
          "description":"If you have a purebred dog, you might be tempted to tell other people. You should avoid doing so. Bragging about your dog might only serve to temp other people to steal it. If you want to brag about your dog, then brag about how loving and loyal it is. Don’t mention how much you paid or how rare your dog is. Most dogs are stolen for profit motives. For example, they may be sold to puppy mills to act as breeders. The less you say about the dog's monetary value, the better."
        },
        {
          "headline":"Place your dogs with good homes.",
          "description":"Avoid giving your dogs away for free, since scammers will jump at the opportunity. Charging even a minimal amount (such as $25) will weed out the dishonest buyers. Also do the following:\nAsk for and check references. If someone approaches you without references, then you should reconsider placing a dog with them. Visit the new owner’s home. Drop by casually by check to see that the conditions are safe."
        }
      ]
    }
  ],
  "text":" Reporting the Theft to the Authorities Write down memories of the theft. Note the date and time your dog was stolen. If you saw who took the dog, then write down a description: height, weight, age, gender, race, clothing, vehicle identification, etc. Write down these details while they are fresh in your memory. Your dog might have disappeared while you were away from home. In that case, talk to your neighbors and anyone else who travels through your neighborhood regularly, such as delivery drivers, meter readers, or mail carriers. They might have seen something. Write down the names and contact information of any witnesses. Also write down their description of the thief, if they saw someone. Gather information about your dog. You need to give the police a full description of your dog. Gather the following information as soon as you can:\nname\nbreed\nmarkings or color\nweight\nage\na current picture of your dog Report the theft to local police. Don’t delay. The sooner you report, the sooner the police can find your missing dog. Some police might hesitate to file a police report for a missing animal. Remind the police that your dog is valuable property. Stealing an animal is a misdemeanor or a felony. If your dog has microchip, then ask the police to post the serial number and your dog’s description in the National Crime Information Center database under “stolen article.”\nMake sure you get a copy of the police report. You might need it later when going to pick up your dog. Search for your dog. The thief might be close to home. Walk around your neighborhood in the evening when noise has died down. Call your dog’s name and listen carefully for any response. You can bring your dog’s favorite treats with you or favorite toy (if it makes a lot of noise). These might prompt your dog to bark out in response. If you see your dog, don’t approach it unless you are absolutely sure it is safe to do so. This may be hard. However, the thief might catch wind that you have found your dog and move them to a new location before the police can arrive. Instead of approaching your dog, call the police promptly and report where the dog is located. Insist that an officer come out immediately. Pay attention to other thefts in your neighborhood. If more dogs go missing where you live, then call the police and report those as well. You can’t rely on the dogs’ owners to report the theft, so take it upon yourself to call. Also write down in a notebook the dates the animals have gone missing. Posting Flyers Make a flyer. Don’t rely solely on the police. Be proactive and create a flyer with information about your dog. Avoid mentioning that you think the dog was stolen—that might scare off the thief. Instead, include the following information:\nname\nbreed\ncolor\nmarkings\ndate and location last seen\na reward (but don’t state the amount)\nyour contact information\na statement that the dog is sick and needs help (this can deter thieves from trying to sell your dog) Distribute your flyers. You want to paper the community. The thief might actually live near you, or they might try to sell your dog. Deliver flyers to the following places and ask if you can post the flyer:\nanimal shelters\nlocal pet stores\ngrocery stores\nveterinary offices\nmedical laboratories\npost offices\ndog parks\ntraffic intersections Publish a missing pet ad. Contact your local newspaper and ask how much it costs to publish an ad. You’ll want to include most of the information on your flyer, including your contact information so people can reach you. Also consider a radio ad. Some radio stations publish missing pet ads. Include any details that you think will arouse sympathy in the reader. For example, you could say that your dog is a registered service animal or an emotional support animal. Post information online. There are many websites where you can report a stolen dog. You should post on as many as you can, including the following:\nMissingpet.net\nPetfinder\nCenter for Lost Pets\nLost Dogs of America\nLost Pet USA\nMissing Pet Partnership\nYour social media accounts, such as Twitter, Facebook, Google+, etc. Respond to calls about your dog. Someone might call and claim to have found your dog. You shouldn’t immediately believe them. Instead, ask detailed questions, especially if you are offering a reward for the dog. For example, have the caller describe your dog’s distinguishing characteristics. Try to meet the caller and the dog in a neutral, public place that is busy. Meeting will give you a chance to confirm the dog is yours. Take a friend with you. You’ll feel safer with someone else around. Hand over the reward only when you have your dog in hand. Never give the money beforehand. Monitor pet sale ads. Read the description of the animals for sale. If any match your dog, then write down the contact information. Some thieves steal animals to sell them. This is particularly true if your dog is a pure breed. Also check ads online, at websites such as Hoobly.com or Craigslist. If you see a description that you think matches your dog, call the police. Don’t give up. Sometimes people search for months before finding their missing or stolen pet. You have a better chance of finding your dog if you are persistent. Revisit any business or office where you posted flyers and check that the flyer is still up. If not, put up a new one. Protecting Your Dogs Keep your dog inside. When not at home, lock your dog inside. When you do let the dog outside, you should supervise where he or she goes. Of course, constant surveillance isn’t always possible. Consider building a shelter attached to your garage, or keep the dog in a fenced-in area which is not accessible from the road. Preferably, the yard should be behind the house, so it is not even visible form the street. Prevent your dog from roaming. If you let your dogs outside, then you’ll want to keep them from roaming far from home. A dog that runs away from home is vulnerable to being stolen. Do the following:\nPut them on a leash, especially if you can’t supervise where they are going or don’t have a fenced-in area. Avoid tying their leash to a lamp post or mailbox when you run into a store. Dogs can get free or, worse, become ripe targets for thieves. Spay or neuter your dog, which will reduce the desire to roam. Also sterilized animals are less valuable to thieves. Identify your dog with tags and a microchip. Your dogs should have a collar with an identification tag that includes your name, address, and phone number. Also get microchips for your dogs. Microchips are about the size of a grain of rice and are inserted underneath the dog’s skin. The microchip contains important information about your dog. When someone passes a scanner over the chip, it can read the unique code. The person scanning your dog then calls a registry and retrieves your contact information. It costs around $45 to have a microchip implanted. The chip should last the entire life of your dog. Implanting a microchip causes no more pain than a regular vaccination so don’t avoid a microchip out of fear of hurting your dog. Avoid bragging about your dog. If you have a purebred dog, you might be tempted to tell other people. You should avoid doing so. Bragging about your dog might only serve to temp other people to steal it. If you want to brag about your dog, then brag about how loving and loyal it is. Don’t mention how much you paid or how rare your dog is. Most dogs are stolen for profit motives. For example, they may be sold to puppy mills to act as breeders. The less you say about the dog's monetary value, the better. Place your dogs with good homes. Avoid giving your dogs away for free, since scammers will jump at the opportunity. Charging even a minimal amount (such as $25) will weed out the dishonest buyers. Also do the following:\nAsk for and check references. If someone approaches you without references, then you should reconsider placing a dog with them. Visit the new owner’s home. Drop by casually by check to see that the conditions are safe.",
  "tyn_model":[
    "dogs",
    "flyers",
    "animal",
    "“stolen",
    "”\n",
    "treats",
    "’ owners",
    "flyer",
    "—that",
    "animal shelters",
    "pet sale ads",
    "animals",
    "craigslist",
    "scanner",
    "microchip"
  ],
  "tyn_section":[

  ]
}