{
  "title":"How to Choose a Soothing Color Scheme",
  "url":"https://www.wikihow.com/Choose-a-Soothing-Color-Scheme",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Coloring and Shading"
  ],
  "methods":[
    {
      "name":"Identifying Soothing Colors for Your Color Scheme",
      "steps":[
        {
          "headline":"Learn the moods associated with colors.",
          "description":"Colors have an influence on your mood. Generally, these are divided into warm, cool, and neutral colors. Warm colors generally convey a stimulating and communal sense. Cool colors are generally soothing and calming. Neutral colors blend in with most environments. Warm colors include red, orange, and yellow. These strong colors are frequently unsuitable for creating a soothing effect. Cool colors include green, blue, and violet. These colors, and combinations of these colors, soothe and promote trust. Neutral colors include white, gray, black, beige, and similar colors. These colors tend to fit well with most color schemes. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKelly Medford\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlein Air Painter\t\t\t\t\t\t\t\tKelly Medford is an American painter based in Rome, Italy. She studied classical painting, drawing and printmaking both in the U.S. and in Italy. She works primarily en plein air on the streets of Rome, and also travels for private international collectors on commission. She founded Sketching Rome Tours in 2012 where she teaches sketchbook journaling to visitors of Rome. Kelly is a graduate of the Florence Academy of Art. Kelly Medford\t\t\tPlein Air Painter\t\t\t\tAdd a touch of white to the color. Kelly Medford, a plein air painter, says: “To make a color calmer, you can add a touch of white. You can really take any color and mix in its complement or a touch of white to make it soothing. Blues are also more calming than reds, yellows, and browns.”"
        },
        {
          "headline":"Prioritize cool colors.",
          "description":"You can mix various shades of green, blue, and violet to create your own soothing color scheme. So long as one of these cool colors is the base, your color scheme will likely have a soothing effect. Green is an excellent base color if you want to create an atmosphere of rejuvenation and growth. Light blue as the base color will give a light, refreshing sense. Dark blue communicates a sense of dignity. Violet mixes the calmness of blue and the vitality of red. It gives the impression of serenity. Although a cool color, it is considered to be the warmest of the three. For this reason, you may want to avoid overusing violet."
        },
        {
          "headline":"Avoid over saturating bright colors.",
          "description":"Even cool colors can become agitating when they are too bright. Use bright colors in small amounts as an accent to prevent them from overpowering the main colors in your scheme. Accent colors generally highlight features like knobs, buttons, edges, and so on, to create contrast and gradient in your color scheme."
        },
        {
          "headline":"Create an airy feel with pastel colors.",
          "description":"Pastel colors tone down hues with the addition of large amounts of white. This washes out the sharpness of the pigment, giving the color a comfortable, wide-open feeling. Pastel colors might be perfect for your soothing color scheme."
        },
        {
          "headline":"Combine different colors to create your color scheme.",
          "description":"Now that you know how colors effect people, you can choose your color scheme. You never know what might suit your tastes, so experiment liberally with various combinations. You can tone down the energetic feel of warm colors by using darker shades of these. In some cases, a single warm tone as an accent or supplemental color paired with two cool ones can be uplifting while retaining a dominantly soothing tone. Feel free to integrate neutral tones with cool colors in your color scheme. Most neutral tones will work well as supplements to cool tone color schemes. However, keep at least one cool tone dominant to maintain the soothing effect. If you are painting a room, it can be difficult to imagine the color on the wall. If this is your situation, you may find it helpful to request color swatches from a paint store so you have a point of reference. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJuli Roland\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Color Specialist\t\t\t\t\t\t\t\tJuli Roland is a Color Specialist and the Founder of PaintColorHelp.com, one of the first companies in Dallas, Texas metro area that provides in-home color consultations and helps clients create paint color schemes. Juli has over 15 years of commercial and residential color consulting experience, including seven years as a custom-matcher in the paint industry. She earned her certification in color strategy from Camp Chroma and is a member of the Inter-Society Color Council. She has a BA in Advertising from Texas Tech University. Juli Roland\t\t\tCertified Color Specialist\t\t\t\tExpert Trick: Serenity comes from using colors that are more muted, and from sticking to a palette that doesn't combine too many colors. You can even use varying shades of the same color, known as a monochrome color scheme. Extreme contrasts like black and white will feel more dynamic and stimulating, instead of restful."
        }
      ]
    },
    {
      "name":"Selecting a Color Scheme According to Environment",
      "steps":[
        {
          "headline":"Account for the influence of lighting.",
          "description":"Rooms with good lighting will clearly reveal your color scheme, but darker rooms may leave it looking more shaded than you intended. Lighter tones may work better for darker rooms, as these soft colors give a sense of freedom and calmness. Also, it is important to keep in mind:\nThe quality of light, which also influences the appearance of your color scheme. Evening light, for example, is often deeper in color, and may give a golden tint, which will generally mute the hues, making them more calming. Shadows, which may be cast by trees, furniture, and so on. Shadows will have a darkening effect on your color choice. If the colors become too dark, the atmosphere of the room will shift from cool to neutral or possibly refined. Color bleeding, which is where a color diffuses through a room with light. For example, a green, well lit wall might cause the rest of a room to have a slight green tint."
        },
        {
          "headline":"Choose colors that match the function of what you will paint.",
          "description":"A soothing color scheme could be one that matches the atmosphere of its function. For example, though red is not soothing in a traditional sense, it stimulates appetite and may be considered soothing in a restaurant."
        },
        {
          "headline":"Use existing colors to determine your color scheme.",
          "description":"In some cases, like when remodeling, you may have existing base colors, like the color of your floors, furniture, appliances, and so on. You can use these as a foundation for your soothing color scheme. For example:\nIf you have brown wood floors, you might create a soothing color scheme using shades of dark green, brown, and black. If you have white carpet, you might use shades of blue with black accents for your color scheme."
        }
      ]
    },
    {
      "name":"Imitating Soothing Color Schemes in Nature",
      "steps":[
        {
          "headline":"Evoke a comfy, homey feel with wood tones.",
          "description":"Rich browns often impart a polished, sophisticated sense. A combination of two shades of accent black, a muted gray, and two brown tones will give the impression of warm calmness. This particular color scheme designed to simulate the polished wood that used to be common in studies, libraries, and sitting rooms."
        },
        {
          "headline":"Create a cool atmosphere as refreshing as fresh fruit.",
          "description":"Use a cyan, a dark blue, and a black for the base of this color scheme. Accent these base colors with beige and a muted red, which here represents fruit. The beige will tone down the energy of the red. The resulting color scheme should be cool, refreshing, and upbeat. To shift this color scheme to something lighter and more playful, you might swap red for a burnt orange."
        },
        {
          "headline":"Mirror the colors of the beach.",
          "description":"The colors of the beach are sure to have a relaxing, calming influence. Start with a sandy brown color at the bottom. Above this, use a light blue. Continue to progress through darker shades of blue until you reach a very dark blue, like midnight blue. The gradient of these colors gives the illusion of sand on the ground and water disappearing off into the distance."
        }
      ]
    }
  ],
  "text":" Identifying Soothing Colors for Your Color Scheme Learn the moods associated with colors. Colors have an influence on your mood. Generally, these are divided into warm, cool, and neutral colors. Warm colors generally convey a stimulating and communal sense. Cool colors are generally soothing and calming. Neutral colors blend in with most environments. Warm colors include red, orange, and yellow. These strong colors are frequently unsuitable for creating a soothing effect. Cool colors include green, blue, and violet. These colors, and combinations of these colors, soothe and promote trust. Neutral colors include white, gray, black, beige, and similar colors. These colors tend to fit well with most color schemes. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKelly Medford\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlein Air Painter\t\t\t\t\t\t\t\tKelly Medford is an American painter based in Rome, Italy. She studied classical painting, drawing and printmaking both in the U.S. and in Italy. She works primarily en plein air on the streets of Rome, and also travels for private international collectors on commission. She founded Sketching Rome Tours in 2012 where she teaches sketchbook journaling to visitors of Rome. Kelly is a graduate of the Florence Academy of Art. Kelly Medford\t\t\tPlein Air Painter\t\t\t\tAdd a touch of white to the color. Kelly Medford, a plein air painter, says: “To make a color calmer, you can add a touch of white. You can really take any color and mix in its complement or a touch of white to make it soothing. Blues are also more calming than reds, yellows, and browns.” Prioritize cool colors. You can mix various shades of green, blue, and violet to create your own soothing color scheme. So long as one of these cool colors is the base, your color scheme will likely have a soothing effect. Green is an excellent base color if you want to create an atmosphere of rejuvenation and growth. Light blue as the base color will give a light, refreshing sense. Dark blue communicates a sense of dignity. Violet mixes the calmness of blue and the vitality of red. It gives the impression of serenity. Although a cool color, it is considered to be the warmest of the three. For this reason, you may want to avoid overusing violet. Avoid over saturating bright colors. Even cool colors can become agitating when they are too bright. Use bright colors in small amounts as an accent to prevent them from overpowering the main colors in your scheme. Accent colors generally highlight features like knobs, buttons, edges, and so on, to create contrast and gradient in your color scheme. Create an airy feel with pastel colors. Pastel colors tone down hues with the addition of large amounts of white. This washes out the sharpness of the pigment, giving the color a comfortable, wide-open feeling. Pastel colors might be perfect for your soothing color scheme. Combine different colors to create your color scheme. Now that you know how colors effect people, you can choose your color scheme. You never know what might suit your tastes, so experiment liberally with various combinations. You can tone down the energetic feel of warm colors by using darker shades of these. In some cases, a single warm tone as an accent or supplemental color paired with two cool ones can be uplifting while retaining a dominantly soothing tone. Feel free to integrate neutral tones with cool colors in your color scheme. Most neutral tones will work well as supplements to cool tone color schemes. However, keep at least one cool tone dominant to maintain the soothing effect. If you are painting a room, it can be difficult to imagine the color on the wall. If this is your situation, you may find it helpful to request color swatches from a paint store so you have a point of reference. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJuli Roland\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Color Specialist\t\t\t\t\t\t\t\tJuli Roland is a Color Specialist and the Founder of PaintColorHelp.com, one of the first companies in Dallas, Texas metro area that provides in-home color consultations and helps clients create paint color schemes. Juli has over 15 years of commercial and residential color consulting experience, including seven years as a custom-matcher in the paint industry. She earned her certification in color strategy from Camp Chroma and is a member of the Inter-Society Color Council. She has a BA in Advertising from Texas Tech University. Juli Roland\t\t\tCertified Color Specialist\t\t\t\tExpert Trick: Serenity comes from using colors that are more muted, and from sticking to a palette that doesn't combine too many colors. You can even use varying shades of the same color, known as a monochrome color scheme. Extreme contrasts like black and white will feel more dynamic and stimulating, instead of restful. Selecting a Color Scheme According to Environment Account for the influence of lighting. Rooms with good lighting will clearly reveal your color scheme, but darker rooms may leave it looking more shaded than you intended. Lighter tones may work better for darker rooms, as these soft colors give a sense of freedom and calmness. Also, it is important to keep in mind:\nThe quality of light, which also influences the appearance of your color scheme. Evening light, for example, is often deeper in color, and may give a golden tint, which will generally mute the hues, making them more calming. Shadows, which may be cast by trees, furniture, and so on. Shadows will have a darkening effect on your color choice. If the colors become too dark, the atmosphere of the room will shift from cool to neutral or possibly refined. Color bleeding, which is where a color diffuses through a room with light. For example, a green, well lit wall might cause the rest of a room to have a slight green tint. Choose colors that match the function of what you will paint. A soothing color scheme could be one that matches the atmosphere of its function. For example, though red is not soothing in a traditional sense, it stimulates appetite and may be considered soothing in a restaurant. Use existing colors to determine your color scheme. In some cases, like when remodeling, you may have existing base colors, like the color of your floors, furniture, appliances, and so on. You can use these as a foundation for your soothing color scheme. For example:\nIf you have brown wood floors, you might create a soothing color scheme using shades of dark green, brown, and black. If you have white carpet, you might use shades of blue with black accents for your color scheme. Imitating Soothing Color Schemes in Nature Evoke a comfy, homey feel with wood tones. Rich browns often impart a polished, sophisticated sense. A combination of two shades of accent black, a muted gray, and two brown tones will give the impression of warm calmness. This particular color scheme designed to simulate the polished wood that used to be common in studies, libraries, and sitting rooms. Create a cool atmosphere as refreshing as fresh fruit. Use a cyan, a dark blue, and a black for the base of this color scheme. Accent these base colors with beige and a muted red, which here represents fruit. The beige will tone down the energy of the red. The resulting color scheme should be cool, refreshing, and upbeat. To shift this color scheme to something lighter and more playful, you might swap red for a burnt orange. Mirror the colors of the beach. The colors of the beach are sure to have a relaxing, calming influence. Start with a sandy brown color at the bottom. Above this, use a light blue. Continue to progress through darker shades of blue until you reach a very dark blue, like midnight blue. The gradient of these colors gives the illusion of sand on the ground and water disappearing off into the distance.",
  "tyn_model":[
    "colors",
    "plein air painter",
    "pastel",
    "violet",
    "paint",
    "color specialist",
    "shadows",
    "red",
    "plein air",
    "sketchbook journaling",
    "“to",
    "blues",
    "” prioritize",
    "green",
    "color strategy",
    "texas tech university",
    "fruit",
    "sand",
    "water"
  ],
  "tyn_section":[

  ]
}