{
  "title":"How to Wrap a Sandwich in Wax Paper",
  "url":"https://www.wikihow.com/Wrap-a-Sandwich-in-Wax-Paper",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "steps":[
    {
      "headline":"Tear off a piece of wax paper that is about 50% longer than it is wide.",
      "description":""
    },
    {
      "headline":"Place sandwich in the middle of the paper.",
      "description":""
    },
    {
      "headline":"Bring smooth (non-torn) edges together above the sandwich and line them up so the edges are both facing upwards.",
      "description":""
    },
    {
      "headline":"Roll joined edges once or twice until they lay flat.",
      "description":""
    },
    {
      "headline":"Turn whole operation 90 degrees and line up torn edges together facing upwards (It's OK if the folds are a bit sloppy so that edges are wider than the sandwich itself).",
      "description":""
    },
    {
      "headline":"Roll the joined edges down in the same manner as the first edge (Seam overhangs a bit).",
      "description":""
    },
    {
      "headline":"Flatten the rolled seam down and tuck the loose sides on both ends underneath to make two pockets thereby locking the wrapper.",
      "description":"The tucked pockets sit above the sandwich itself."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Tear off a piece of wax paper that is about 50% longer than it is wide.  Place sandwich in the middle of the paper.  Bring smooth (non-torn) edges together above the sandwich and line them up so the edges are both facing upwards.  Roll joined edges once or twice until they lay flat.  Turn whole operation 90 degrees and line up torn edges together facing upwards (It's OK if the folds are a bit sloppy so that edges are wider than the sandwich itself).  Roll the joined edges down in the same manner as the first edge (Seam overhangs a bit).  Flatten the rolled seam down and tuck the loose sides on both ends underneath to make two pockets thereby locking the wrapper. The tucked pockets sit above the sandwich itself. Finished. ",
  "tyn_model":[
    "wax paper",
    "paper",
    "sandwich"
  ],
  "tyn_section":[

  ]
}