{
  "title":"How to Make Breakfast a Daily Habit",
  "url":"https://www.wikihow.com/Make-Breakfast-a-Daily-Habit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast"
  ],
  "methods":[
    {
      "name":"Planning Your Breakfast Ahead of Time",
      "steps":[
        {
          "headline":"Prepare your breakfast the night before.",
          "description":"Perhaps the best step you can take to help get in the habit of eating breakfast is making it the night before. One easy, healthy option is making oatmeal in the evening. In the morning, you can eat it cold or reheat it. Mix in nuts, fruit, or a handful of raisins and a bit of cinnamon. Oats are a great breakfast food, as they are high in fiber and will keep you feeling full well into your day. Whole grain muffins are another good quick grab-and-go option. Make a big batch to last you through the week - and even longer if you freeze some. You can even do the prep work for a quick omelet ahead of time by whisking the eggs and chopping the veggies ahead of time and storing them in the fridge overnight."
        },
        {
          "headline":"Plan a week’s worth of breakfasts.",
          "description":"Whether you prefer to change up your breakfast day to to day or eat the same thing everyday, planning ahead will help you establish a routine. If you like to vary your meals, make a weekly plan so you can get everything you need and have it at the house. If you know you like to eat the same thing every day, stock up on what you need. For instance, have a backup tub of Greek yogurt and an extra bag of granola on hand in case your current supply runs out."
        },
        {
          "headline":"Stash breakfast-y snacks at work.",
          "description":"For those days when you do wind up running a bit behind, store food at work so you don’t have to go without breakfast. Definitely store a few items with stable shelf life in your desk or locker. Good options include a jar of peanut butter, protein bars, and dried fruit. If you have access to a refrigerator, consider storing protein shakes and cheese sticks in it."
        }
      ]
    },
    {
      "name":"Motivating Yourself to Eat Breakfast",
      "steps":[
        {
          "headline":"Grab and go.",
          "description":"Some people simply don’t want to be bothered by preparing a breakfast in the morning. While this is entirely understandable, it’s important to recognize that you’ll be more productive during the day if you kick start your metabolism with at least a small breakfast in the morning. Good quick options include a handful of almonds, a whole grain English muffin, a hard boiled egg, or fresh fruit with reduced-fat cottage cheese or Greek yogurt. You could keep a box of Cliff bars or a similar prepackaged bar in the car if you find yourself rushing out the door every morning."
        },
        {
          "headline":"Set your alarm fifteen minutes earlier.",
          "description":"If the reason you tend not to eat breakfast everyday is because you’re in a rush to get out of the door, you need to adjust your schedule. Get up ten to fifteen minutes earlier to give yourself a chance to start your day more calmly - and with the opportunity to eat something as well."
        },
        {
          "headline":"Don't eat too much late at night.",
          "description":"If you actually want to be hungry in the morning, you should stop eating at least 2 hours before bed. If you are always hungry during the night, think about whether your dinner meals are adequately satiating."
        },
        {
          "headline":"Eat with another person.",
          "description":"Make breakfast a social occasion by sitting down at the table with your family or a roommate each morning. Over time this will help make breakfast a habit."
        },
        {
          "headline":"Have something light before exercising.",
          "description":"Even if the thought of eating early in the morning doesn’t appeal to you, get in the habit of eating breakfast by starting small. If you like to exercise in the morning, it's important to eat something - even if only a piece of fruit, before your workout. Exercising will also increase your appetite\nOne great option for those who don’t wake up hungry is a smoothie. Not only will a smoothie give you the health benefits of eating breakfast, they can also be made to be especially nutritious. The specific ingredients in a breakfast smoothie are up to you. Use plenty of fruits and veggies, and consider using a liquid dairy alternative as the base, such as almond milk. Include powdered protein or seeds for additional vitamins and nutrients. If you start the day with something small and then exercise, be sure to eat a more substantial meal within two hours after you work out."
        },
        {
          "headline":"Open the blinds.",
          "description":"It may seem too easy to be true, but simply opening your blinds can help get your metabolic patterns on a more consistent pattern. This, in turn, can help you feel hungrier in the morning. For maximum effectiveness, open your blinds all the way as soon as you wake up and enjoy the sunlight while you’re getting dressed and preparing for the day. Get dressed before you get to the kitchen. Getting dressed for work before making your morning dietary decisions can help motivate you to be conscious of your health when deciding what you want to eat."
        },
        {
          "headline":"Eat whatever sounds good.",
          "description":"There are many foods that are commonly considered \"breakfast foods,\" but this distinction is ultimately unimportant. If you feel like eating leftovers from the night before or slicing up a tomato with fresh mozzarella, feel free! The important thing is to get something in your body that has nutritional value. In fact, look to include more vegetables in your diet wherever possible. Even if you do go for a breakfast classic like an omelet, include asparagus, bell peppers, or other veggies."
        }
      ]
    },
    {
      "name":"Choosing Healthy Breakfast Options",
      "steps":[
        {
          "headline":"Include some protein.",
          "description":"Protein is an important component of a healthy breakfast. This is in part because protein is digested more slowly than carbs, for instance, and will help you feel full longer. Lean, low-fat options are the best. For example, opt for low-fat Greek yogurt, soy or turkey sausage, or eggs. If your breakfast includes dairy products, opt for skim or low-fat options."
        },
        {
          "headline":"Get some whole grains too.",
          "description":"In addition to protein, fiber is also extremely important, as this will help keep you nourished and satiated well into the day as well. Perhaps the easiest option is cereal - but read the nutrition facts. Beware of misleading portion sizes and high amounts of sugar in many cereals. Check the nutritional label of any cereals and only go with options that have whole grains listed as the first ingredient. Further, make sure your selection has less than 10 grams of sugar, at least 3 grams of fiber, and is free of artificial coloring."
        },
        {
          "headline":"Default to savory options.",
          "description":"Though many breakfast options are rather sugary, these are not the best options. Aside from selecting options based on protein and fiber, opt for seasonings like pepper and turmeric instead of syrup or brown sugar. When you do want a bit of sweetness to something like oatmeal, use fruit or honey. Cutting to the chase, skip the donut shop. The only thing worse than skipping breakfast in the morning is loading up on sugar and unhealthy fats with your first meal of the day."
        },
        {
          "headline":"Don’t ditch yolks entirely.",
          "description":"While egg whites are lower in calories and fats, it’s important to note that egg yolks do contain highly valuable nutritional components like protein, healthy fats, choline and a variety of vitamins. A good option for an omelet is one whole egg and one or two “egg’s worth” of egg whites."
        },
        {
          "headline":"Take care with caffeine.",
          "description":"Drinking coffee in the morning will curb your appetite and may be causing you to eat less. Unfortunately, if you ride the caffeine train all day and don’t eat much, you’re metabolism will slow down, and you’ll risk storing a bunch of fat following an evening meal - which is likely to be larger than necessary if you hadn’t eaten all day. Further, you may be setting yourself up for failure by trying to get by on coffee alone. Not only is the coffee-only approach unhealthy, you’re even more likely to wind up caving in and grabbing one of those volleyball-sized cinnamon rolls when you go for a refill before eating something healthy."
        }
      ]
    }
  ],
  "text":" Planning Your Breakfast Ahead of Time Prepare your breakfast the night before. Perhaps the best step you can take to help get in the habit of eating breakfast is making it the night before. One easy, healthy option is making oatmeal in the evening. In the morning, you can eat it cold or reheat it. Mix in nuts, fruit, or a handful of raisins and a bit of cinnamon. Oats are a great breakfast food, as they are high in fiber and will keep you feeling full well into your day. Whole grain muffins are another good quick grab-and-go option. Make a big batch to last you through the week - and even longer if you freeze some. You can even do the prep work for a quick omelet ahead of time by whisking the eggs and chopping the veggies ahead of time and storing them in the fridge overnight. Plan a week’s worth of breakfasts. Whether you prefer to change up your breakfast day to to day or eat the same thing everyday, planning ahead will help you establish a routine. If you like to vary your meals, make a weekly plan so you can get everything you need and have it at the house. If you know you like to eat the same thing every day, stock up on what you need. For instance, have a backup tub of Greek yogurt and an extra bag of granola on hand in case your current supply runs out. Stash breakfast-y snacks at work. For those days when you do wind up running a bit behind, store food at work so you don’t have to go without breakfast. Definitely store a few items with stable shelf life in your desk or locker. Good options include a jar of peanut butter, protein bars, and dried fruit. If you have access to a refrigerator, consider storing protein shakes and cheese sticks in it. Motivating Yourself to Eat Breakfast Grab and go. Some people simply don’t want to be bothered by preparing a breakfast in the morning. While this is entirely understandable, it’s important to recognize that you’ll be more productive during the day if you kick start your metabolism with at least a small breakfast in the morning. Good quick options include a handful of almonds, a whole grain English muffin, a hard boiled egg, or fresh fruit with reduced-fat cottage cheese or Greek yogurt. You could keep a box of Cliff bars or a similar prepackaged bar in the car if you find yourself rushing out the door every morning. Set your alarm fifteen minutes earlier. If the reason you tend not to eat breakfast everyday is because you’re in a rush to get out of the door, you need to adjust your schedule. Get up ten to fifteen minutes earlier to give yourself a chance to start your day more calmly - and with the opportunity to eat something as well. Don't eat too much late at night. If you actually want to be hungry in the morning, you should stop eating at least 2 hours before bed. If you are always hungry during the night, think about whether your dinner meals are adequately satiating. Eat with another person. Make breakfast a social occasion by sitting down at the table with your family or a roommate each morning. Over time this will help make breakfast a habit. Have something light before exercising. Even if the thought of eating early in the morning doesn’t appeal to you, get in the habit of eating breakfast by starting small. If you like to exercise in the morning, it's important to eat something - even if only a piece of fruit, before your workout. Exercising will also increase your appetite\nOne great option for those who don’t wake up hungry is a smoothie. Not only will a smoothie give you the health benefits of eating breakfast, they can also be made to be especially nutritious. The specific ingredients in a breakfast smoothie are up to you. Use plenty of fruits and veggies, and consider using a liquid dairy alternative as the base, such as almond milk. Include powdered protein or seeds for additional vitamins and nutrients. If you start the day with something small and then exercise, be sure to eat a more substantial meal within two hours after you work out. Open the blinds. It may seem too easy to be true, but simply opening your blinds can help get your metabolic patterns on a more consistent pattern. This, in turn, can help you feel hungrier in the morning. For maximum effectiveness, open your blinds all the way as soon as you wake up and enjoy the sunlight while you’re getting dressed and preparing for the day. Get dressed before you get to the kitchen. Getting dressed for work before making your morning dietary decisions can help motivate you to be conscious of your health when deciding what you want to eat. Eat whatever sounds good. There are many foods that are commonly considered \"breakfast foods,\" but this distinction is ultimately unimportant. If you feel like eating leftovers from the night before or slicing up a tomato with fresh mozzarella, feel free! The important thing is to get something in your body that has nutritional value. In fact, look to include more vegetables in your diet wherever possible. Even if you do go for a breakfast classic like an omelet, include asparagus, bell peppers, or other veggies. Choosing Healthy Breakfast Options Include some protein. Protein is an important component of a healthy breakfast. This is in part because protein is digested more slowly than carbs, for instance, and will help you feel full longer. Lean, low-fat options are the best. For example, opt for low-fat Greek yogurt, soy or turkey sausage, or eggs. If your breakfast includes dairy products, opt for skim or low-fat options. Get some whole grains too. In addition to protein, fiber is also extremely important, as this will help keep you nourished and satiated well into the day as well. Perhaps the easiest option is cereal - but read the nutrition facts. Beware of misleading portion sizes and high amounts of sugar in many cereals. Check the nutritional label of any cereals and only go with options that have whole grains listed as the first ingredient. Further, make sure your selection has less than 10 grams of sugar, at least 3 grams of fiber, and is free of artificial coloring. Default to savory options. Though many breakfast options are rather sugary, these are not the best options. Aside from selecting options based on protein and fiber, opt for seasonings like pepper and turmeric instead of syrup or brown sugar. When you do want a bit of sweetness to something like oatmeal, use fruit or honey. Cutting to the chase, skip the donut shop. The only thing worse than skipping breakfast in the morning is loading up on sugar and unhealthy fats with your first meal of the day. Don’t ditch yolks entirely. While egg whites are lower in calories and fats, it’s important to note that egg yolks do contain highly valuable nutritional components like protein, healthy fats, choline and a variety of vitamins. A good option for an omelet is one whole egg and one or two “egg’s worth” of egg whites. Take care with caffeine. Drinking coffee in the morning will curb your appetite and may be causing you to eat less. Unfortunately, if you ride the caffeine train all day and don’t eat much, you’re metabolism will slow down, and you’ll risk storing a bunch of fat following an evening meal - which is likely to be larger than necessary if you hadn’t eaten all day. Further, you may be setting yourself up for failure by trying to get by on coffee alone. Not only is the coffee-only approach unhealthy, you’re even more likely to wind up caving in and grabbing one of those volleyball-sized cinnamon rolls when you go for a refill before eating something healthy.",
  "tyn_model":[
    "fruit",
    "coffee",
    "eggs",
    "greek yogurt",
    "smoothie",
    "protein",
    "cereals",
    "oatmeal",
    "nuts",
    "raisins",
    "cinnamon",
    "oats",
    "whole grain muffins",
    "granola",
    "food",
    "peanut butter",
    "protein bars",
    "dried fruit",
    "refrigerator",
    "protein shakes",
    "cheese sticks",
    "almonds",
    "whole grain english muffin",
    "hard boiled egg",
    "reduced-fat cottage cheese",
    "cliff bars",
    "almond milk",
    "tomato",
    "mozzarella",
    "vegetables",
    "asparagus",
    "bell peppers",
    "veggies",
    "yogurt",
    "grains",
    "cereal",
    "pepper",
    "turmeric",
    "brown sugar",
    "honey",
    "donut shop",
    "yolks",
    "egg yolks",
    "choline",
    "“egg",
    "” of",
    "egg whites",
    "cinnamon rolls"
  ],
  "tyn_section":[

  ]
}