{
  "title":"How to Marble a Wooden Floor",
  "url":"https://www.wikihow.com/Marble-a-Wooden-Floor",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Floor Types"
  ],
  "steps":[
    {
      "headline":"Sand the wooden floor completely.",
      "description":"Remove all furniture from the room or area and any rugs. Be sure to sand every part of the floor that is to be marbled."
    },
    {
      "headline":"Apply three coats of a light-coloured, flat, oil-based paint.",
      "description":"Apply across the entire floorspace."
    },
    {
      "headline":"Lay a grid of squares to create the black and white checkerboard square appearance.",
      "description":"Measure exact squares across the entire floor space using a measuring tape and pencil. Draw over the lines using a felt tip pen so that you can see the borders of each square easily when painting. Leave a general border space of 20 centimeter (7.9 in); this will \"frame\" the entire floor feature."
    },
    {
      "headline":"Work in small areas at a time.",
      "description":"Start by painting the light or white coloured squares using off-white white paint."
    },
    {
      "headline":"Start to create the mottled marble effect.",
      "description":"While each off-white square is still wet, create small brush streaks using a combination of black, tan and grey. Use a dry brush to blur in the streaks."
    },
    {
      "headline":"Leave these squares to dry thoroughly for 48 hours.",
      "description":"Once dry, use masking tape and paper to protect them from the next step, painting the the dark colour. Cover each light square completely in paper and be sure to make the masking tape meet the edges exactly. It takes a bit of work but it is worth doing well."
    },
    {
      "headline":"Use a sponge to dab on black and dark green paint on the uncovered squares.",
      "description":"This paint should not be brushed on, as you want it to appear streaked. Hence, some of the base colour should also show through. The only brush strokes should be fine ones to soften the look as the paint is still wet."
    },
    {
      "headline":"Sprinkle over a little turpentine and white spirit.",
      "description":"This will create patchy streaks on the dark paint of the squares. Leave the dark squares to dry."
    },
    {
      "headline":"Remove the paper from the border.",
      "description":"Paint entirely in black paint. While it is still wet, use a paint cloth to wipe turpentine in it here and there, to create a mottled effect. Don't do all of the border, just parts to give the effect of old marbling."
    },
    {
      "headline":"Use a fine brush to add very thin faux white lines to the border.",
      "description":"Only do this part once the paint has dried."
    },
    {
      "headline":"Remove the paper from the entire floor.",
      "description":"Seal the floor with five thin coats of a low-gloss polyurethane varnish. Allow each layer to dry before adding the next."
    },
    {
      "headline":"Do any additional touch-ups required.",
      "description":"Stand back and admire your work; it should appear as a marbled black and white checkered floor!"
    }
  ],
  "text":" Sand the wooden floor completely. Remove all furniture from the room or area and any rugs. Be sure to sand every part of the floor that is to be marbled. Apply three coats of a light-coloured, flat, oil-based paint. Apply across the entire floorspace. Lay a grid of squares to create the black and white checkerboard square appearance. Measure exact squares across the entire floor space using a measuring tape and pencil. Draw over the lines using a felt tip pen so that you can see the borders of each square easily when painting. Leave a general border space of 20 centimeter (7.9 in); this will \"frame\" the entire floor feature. Work in small areas at a time. Start by painting the light or white coloured squares using off-white white paint. Start to create the mottled marble effect. While each off-white square is still wet, create small brush streaks using a combination of black, tan and grey. Use a dry brush to blur in the streaks. Leave these squares to dry thoroughly for 48 hours. Once dry, use masking tape and paper to protect them from the next step, painting the the dark colour. Cover each light square completely in paper and be sure to make the masking tape meet the edges exactly. It takes a bit of work but it is worth doing well. Use a sponge to dab on black and dark green paint on the uncovered squares. This paint should not be brushed on, as you want it to appear streaked. Hence, some of the base colour should also show through. The only brush strokes should be fine ones to soften the look as the paint is still wet. Sprinkle over a little turpentine and white spirit. This will create patchy streaks on the dark paint of the squares. Leave the dark squares to dry. Remove the paper from the border. Paint entirely in black paint. While it is still wet, use a paint cloth to wipe turpentine in it here and there, to create a mottled effect. Don't do all of the border, just parts to give the effect of old marbling. Use a fine brush to add very thin faux white lines to the border. Only do this part once the paint has dried. Remove the paper from the entire floor. Seal the floor with five thin coats of a low-gloss polyurethane varnish. Allow each layer to dry before adding the next. Do any additional touch-ups required. Stand back and admire your work; it should appear as a marbled black and white checkered floor!",
  "tyn_model":[
    "paint",
    "paper",
    "masking tape",
    "turpentine",
    "rugs",
    "oil-based paint",
    "checkerboard square",
    "pencil",
    "felt tip pen",
    "off-white white paint",
    "sponge",
    "white spirit",
    "black paint",
    "paint cloth",
    "fine brush",
    "low-gloss polyurethane varnish"
  ],
  "tyn_section":[

  ]
}