{
  "title":"How to Make Oil Cocktails",
  "url":"https://www.wikihow.com/Make-Oil-Cocktails",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails"
  ],
  "methods":[
    {
      "name":"Creating the Fig and Olive Cocktail",
      "steps":[
        {
          "headline":"Add the celery and blood orange olive oil to a cocktail shaker.",
          "description":"Finely chop 1 stalk of celery, setting aside the top portion with the sprig. Chop enough small pieces so that the bottom of a cocktail shaker is covered. Then muddle the chopped celery in the tin. Finally, pour 1/2 oz. (15 mL) of blood orange olive oil over top. Blood orange olive oil is a unique blend of extra virgin olive oil and blood oranges, and you can find it at most grocery stores. If you're having trouble finding it, you can order it online. Muddling is a process of pressing ingredients in a cocktail shaker to release their flavors into the cocktail. If you don't have a muddling tool, you can use the back of a spoon."
        },
        {
          "headline":"Pour both juices and simple syrup into the cocktail shaker.",
          "description":"Use 1 oz. (30 mL) of blood orange juice, 3/4 oz. (22 mL) of lime juice, and 1/2 oz. (15 mL) of simple syrup. Simple syrup is available at most grocery and liquor stores, but it’s also very simple to make. By boiling equal amounts granulated sugar and water, you can create a simple syrup to store and use in all types of cocktails."
        },
        {
          "headline":"Mix in the cucumber vodka and ice.",
          "description":"This recipe calls for 2 oz. (60 mL) of cucumber vodka. You can certainly tweak this amount to make the drink stronger or weaker. Pop in a few ice cubes, and then put the lid on your shaker."
        },
        {
          "headline":"Shake your drink.",
          "description":"Make sure your cap is securely on the cocktail shaker. You want to shake until all ingredients are completely blended. This should take about 10-15 seconds of hard shaking."
        },
        {
          "headline":"Pour the mixture into a glass and add a splash of soda.",
          "description":"First, fill your glass of choice with ice. After you’ve given everything a good shake in the cocktail shaker, pour your drink over the ice. Leave a bit of room at the top. Finally, add your lemon-lime soda for a little bit of fizz. If you're wondering where the \"fig\" comes into play in this Fig and Olive cocktail, it doesn't! This drink is simply the signature cocktail of Fig & Olive, a popular restaurant in Los Angeles."
        },
        {
          "headline":"Garnish your drink with the celery sprig and enjoy.",
          "description":"For a finishing touch, add the top of celery stalk to your glass. Serve to your guest, or drink yourself, and enjoy! The blood orange olive oil will add a richness and uniqueness to your drink that makes this cocktail memorable."
        }
      ]
    },
    {
      "name":"Concocting the Oliveto Cocktail",
      "steps":[
        {
          "headline":"Put the gin, liqueur, juice, vanilla, and simple syrup in a measuring cup.",
          "description":"Use 2 oz. (60 mL) of gin, 1/2 oz. (15mL) orange liqueur, and 1 oz. (30 mL) lemon juice. Then add 1/2 teaspoon (2.5 mL) of vanilla extract and 1/2 oz. (15 mL) of simple syrup. You’ll be pouring them into your cocktail shaker later, so put them in something that you can easily pour from. Don’t worry about stirring them together at this time. Set your glass or cup aside for now."
        },
        {
          "headline":"Combine the ice, egg white, and olive oil in your cocktail shaker.",
          "description":"Fill up your shaker about half way with ice. Then add 1/2 oz. (15 mL) of olive oil and 1 egg white. You might want to do a little stretching because now it’s time to shake the egg white and oil together. In order for this drink to be successful, you need to fully emulsify the egg and oil. This creates a fluffy texture that makes the cocktail so unique and delicious. When you think you’ve done enough shaking, shake a bit more. It will take about 200 shakes (or 20-30 seconds of hard shaking) in order to get the ingredients fully emulsified."
        },
        {
          "headline":"Pour in the rest of the ingredients and shake.",
          "description":"After you’ve shaken the egg and oil mixture thoroughly, remove the top of the shaker. Pour in the mixture of gin, liqueur, juice, vanilla, and simple syrup that you previously set aside. Place the cap back on your cocktail shaker, and shake again for about 10 seconds."
        },
        {
          "headline":"Strain your drink into a glass.",
          "description":"After you’ve finished giving your cocktail a final shake, it’s time to pour it into your glass--but first, you’ll need to strain it. Some cocktail shakers will have strainers that you can pop over the top. Otherwise, you can strain your drink through a Hawthorne or julep strainer. Then pour it into a champagne flute or a rocks glass and enjoy!"
        }
      ]
    },
    {
      "name":"Mixing up the Summer’s Goodbye",
      "steps":[
        {
          "headline":"Muddle the cucumber and basil with the orange juice.",
          "description":"Chop about 2 inches (5.1 cm) of cucumber into slices or chunks, and place them in the bottom of your cocktail shaker. Toss in 4 fresh basil leaves, leaving 2 aside for garnish later. Pour 1 oz. (30 mL) of orange juice over top, and use a muddling tool to muddle everything at the bottom of your shaker."
        },
        {
          "headline":"Add the gin, simple syrup, and olive oil.",
          "description":"After you’ve muddled the leaves and cucumbers, pour in 1⅓ oz. (40 mL) of gin, ⅓ oz. (10 mL) of simple syrup, and 1 oz. (30 mL) of olive oil. Add a handful of ice, put the cap on your shaker, and shake. You can tweak the amount of gin you use in this cocktail to make the drink weaker or stronger, but you may want to taste it as is before deciding to add more."
        },
        {
          "headline":"Strain and serve over fresh ice.",
          "description":"After you’ve shaken everything and the ingredients are thoroughly blended, remove the cap of your shaker. Strain your drink by popping a strainer on your shaker, or using a Hawthorne or julep strainer. Strain it into your cocktail glass of choice, and then garnish it with a few basil leaves and/or a slice of cucumber on the rim. Enjoy!"
        }
      ]
    }
  ],
  "text":" Creating the Fig and Olive Cocktail Add the celery and blood orange olive oil to a cocktail shaker. Finely chop 1 stalk of celery, setting aside the top portion with the sprig. Chop enough small pieces so that the bottom of a cocktail shaker is covered. Then muddle the chopped celery in the tin. Finally, pour 1/2 oz. (15 mL) of blood orange olive oil over top. Blood orange olive oil is a unique blend of extra virgin olive oil and blood oranges, and you can find it at most grocery stores. If you're having trouble finding it, you can order it online. Muddling is a process of pressing ingredients in a cocktail shaker to release their flavors into the cocktail. If you don't have a muddling tool, you can use the back of a spoon. Pour both juices and simple syrup into the cocktail shaker. Use 1 oz. (30 mL) of blood orange juice, 3/4 oz. (22 mL) of lime juice, and 1/2 oz. (15 mL) of simple syrup. Simple syrup is available at most grocery and liquor stores, but it’s also very simple to make. By boiling equal amounts granulated sugar and water, you can create a simple syrup to store and use in all types of cocktails. Mix in the cucumber vodka and ice. This recipe calls for 2 oz. (60 mL) of cucumber vodka. You can certainly tweak this amount to make the drink stronger or weaker. Pop in a few ice cubes, and then put the lid on your shaker. Shake your drink. Make sure your cap is securely on the cocktail shaker. You want to shake until all ingredients are completely blended. This should take about 10-15 seconds of hard shaking. Pour the mixture into a glass and add a splash of soda. First, fill your glass of choice with ice. After you’ve given everything a good shake in the cocktail shaker, pour your drink over the ice. Leave a bit of room at the top. Finally, add your lemon-lime soda for a little bit of fizz. If you're wondering where the \"fig\" comes into play in this Fig and Olive cocktail, it doesn't! This drink is simply the signature cocktail of Fig & Olive, a popular restaurant in Los Angeles. Garnish your drink with the celery sprig and enjoy. For a finishing touch, add the top of celery stalk to your glass. Serve to your guest, or drink yourself, and enjoy! The blood orange olive oil will add a richness and uniqueness to your drink that makes this cocktail memorable. Concocting the Oliveto Cocktail Put the gin, liqueur, juice, vanilla, and simple syrup in a measuring cup. Use 2 oz. (60 mL) of gin, 1/2 oz. (15mL) orange liqueur, and 1 oz. (30 mL) lemon juice. Then add 1/2 teaspoon (2.5 mL) of vanilla extract and 1/2 oz. (15 mL) of simple syrup. You’ll be pouring them into your cocktail shaker later, so put them in something that you can easily pour from. Don’t worry about stirring them together at this time. Set your glass or cup aside for now. Combine the ice, egg white, and olive oil in your cocktail shaker. Fill up your shaker about half way with ice. Then add 1/2 oz. (15 mL) of olive oil and 1 egg white. You might want to do a little stretching because now it’s time to shake the egg white and oil together. In order for this drink to be successful, you need to fully emulsify the egg and oil. This creates a fluffy texture that makes the cocktail so unique and delicious. When you think you’ve done enough shaking, shake a bit more. It will take about 200 shakes (or 20-30 seconds of hard shaking) in order to get the ingredients fully emulsified. Pour in the rest of the ingredients and shake. After you’ve shaken the egg and oil mixture thoroughly, remove the top of the shaker. Pour in the mixture of gin, liqueur, juice, vanilla, and simple syrup that you previously set aside. Place the cap back on your cocktail shaker, and shake again for about 10 seconds. Strain your drink into a glass. After you’ve finished giving your cocktail a final shake, it’s time to pour it into your glass--but first, you’ll need to strain it. Some cocktail shakers will have strainers that you can pop over the top. Otherwise, you can strain your drink through a Hawthorne or julep strainer. Then pour it into a champagne flute or a rocks glass and enjoy! Mixing up the Summer’s Goodbye Muddle the cucumber and basil with the orange juice. Chop about 2 inches (5.1 cm) of cucumber into slices or chunks, and place them in the bottom of your cocktail shaker. Toss in 4 fresh basil leaves, leaving 2 aside for garnish later. Pour 1 oz. (30 mL) of orange juice over top, and use a muddling tool to muddle everything at the bottom of your shaker. Add the gin, simple syrup, and olive oil. After you’ve muddled the leaves and cucumbers, pour in 1⅓ oz. (40 mL) of gin, ⅓ oz. (10 mL) of simple syrup, and 1 oz. (30 mL) of olive oil. Add a handful of ice, put the cap on your shaker, and shake. You can tweak the amount of gin you use in this cocktail to make the drink weaker or stronger, but you may want to taste it as is before deciding to add more. Strain and serve over fresh ice. After you’ve shaken everything and the ingredients are thoroughly blended, remove the cap of your shaker. Strain your drink by popping a strainer on your shaker, or using a Hawthorne or julep strainer. Strain it into your cocktail glass of choice, and then garnish it with a few basil leaves and/or a slice of cucumber on the rim. Enjoy!",
  "tyn_model":[
    "cocktail shaker",
    "simple syrup",
    "shaker",
    "ice",
    "gin",
    "olive oil",
    "celery",
    "blood orange olive oil",
    "glass",
    "vanilla",
    "oil",
    "cucumber",
    "basil",
    "cucumber vodka",
    "liqueur",
    "juice",
    "egg white",
    "egg",
    "hawthorne or julep strainer",
    "orange juice",
    "extra virgin olive oil",
    "blood oranges",
    "spoon",
    "blood orange juice",
    "lime juice",
    "granulated sugar",
    "water",
    "ice cubes",
    "soda",
    "lemon-lime soda",
    "celery sprig",
    "measuring cup",
    "orange liqueur",
    "lemon juice",
    "cocktail shakers",
    "strainers",
    "champagne flute",
    "rocks glass",
    "cucumbers",
    "⅓ oz",
    "strainer",
    "cocktail glass"
  ],
  "tyn_section":[

  ]
}