{
  "title":"How to Use a Fireplace Safely",
  "url":"https://www.wikihow.com/Use-a-Fireplace-Safely",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Fire",
    "Fireplaces"
  ],
  "methods":[
    {
      "name":"Building a Fire Safely",
      "steps":[
        {
          "headline":"Burn safe materials.",
          "description":"Only burn natural materials in your fireplace; never introduce foreign substances, including cardboard, newspaper, or paper trash. These substances burn poorly, produce a lot of smoke, and release chemicals into the air. Only burn tinder (such as pine needles or tiny sticks), kindling (small sticks or pinecones), and fuel (large logs, up to about 14” long). Burning hardwood (such as maple and oak) will diminish the amount of soot and ash buildup in your chimney. Also avoid burning wood that is wet or still green, as it will produce large amounts of smoke and not burn well."
        },
        {
          "headline":"Avoid using flammable liquids to start fires.",
          "description":"You should never put gasoline into a fireplace. Gas is volatile, and could easily cause a fire to get out of control. If you're struggling to light a fire, use a small amount of lighter fluid instead, although it's best to just use matches and tinder. Flammable liquids are risky and raise the chances of a house fire. If your fires aren't starting consistently, hardware stores also sell small (rough 2” x 2”) fire-starter squares that will burn for about 15–20 minutes."
        },
        {
          "headline":"Start the fire correctly.",
          "description":"If you build your fire efficiently the first time, it will burn for longer, heat your home effectively, and result in minimal smoke escaping into your home. Start by laying your tinder at the bottom of the fire, followed by kindling. Lay the wood pieces in such a way that there will be room for airflow under the fire—without airflow, the fire will go out immediately. Finally, add two or three logs on top; you can add more logs once the initial couple are burning. When you add logs to the fire, make sure to set them gently on top of the already-burning logs or coals—if you throw new logs on, sparks and burning coals will fly off. Add logs one or two at a time, as you don't want to turn your quiet fire into a bonfire by adding too many logs at once. Before you place any wood in the fireplace, remember to open the damper. People often forget this step, and a closed damper will result in your fire filling your home with smoke."
        },
        {
          "headline":"Clean out the ashes after every fire.",
          "description":"Before lighting a new fire in the evening, you'll need to scoop out the ash from the previous fire. This will help keep your fireplace clean and attractive, and will prevent live coals from burning in your fireplace while you're away from the house. You can purchase an ash shovel at a hardware store. Also consider purchasing other common fireplace tools, such as brush and fireplace tongs or prong. The latter will allow you to move burning logs around in the fire, if they're at risk of falling out."
        },
        {
          "headline":"Keep a fireplace screen in front of the fireplace when in use.",
          "description":"A fireplace screen should be at least 3 feet (0.91 m) high, and most common models are be made of fine, crossed wire on a flexible, three-part frame. This screen will catch any live sparks that leap out of the fire, and will also prevent larger logs from falling out. A screen is a necessity if you have small children or animals in the house, as they could easily run or stumble into an open fire. If there are more durable models of fireplace grate available at your local hardware store, it may be wise to purchase a heavy grate in addition to (or instead of) a lighter screen."
        }
      ]
    },
    {
      "name":"Maintaining your Fireplace",
      "steps":[
        {
          "headline":"Inspect your fireplace every two years.",
          "description":"Parts of the fireplace can break or wear down, and it's important to note these before the fireplace malfunctions or causes an emergency fire. While the fireplace is cool, open the damper (seal at the top of the fireplace) and inspect the flue (opening connecting the fireplace to the chimney). The flue should be open and clear of obstructions. Examine the hearth to make sure no bricks are damaged or missing, and that the firebox—the interior of the fireplace—is not cracked or damaged. If you're more comfortable letting professionals inspect your fireplace and chimney, call a local chimney sweep. They will inspect both inside and outside of your house, and inform you if any cleaning or repairs are needed."
        },
        {
          "headline":"Keep the chimney cap clean.",
          "description":"The chimney cap is at the very peak of the chimney: a small, plate-sized lid that is attached to the top of your chimney pipe to make sure that no small animals or debris fall down the chimney. If it becomes clogged or broken, smoke will not be able to exit the chimney and could back up into your house. Make sure that the cap is in good condition, and is free from cracks, ash buildup, or birds' nests. Since you'll need to climb on top of your roof to do this, make sure to observe safety precautions. Firmly ground your ladder before you begin to ascend."
        },
        {
          "headline":"Clean your chimney annually.",
          "description":"Even if the chimney cap is clear, ash can still build up on the inside of the chimney pipe itself. This presents a risk, as excess buildup can catch on fire and lead to a dangerous and chimney fire. If your chimney has excess internal ash buildup, during summer months, smoky-smelling air can be drawn through the chimney into the house. To clean a chimney, you'll need a specific set of pipes and brushes that you should be able to purchase at your local hardware store. If you prefer not to clean your own chimney, a local cleaning or maintenance service should be able to do the job for you. Also inspect the chimney flashing (the seal between the chimney and roof). This should be tight and not show any signs of damage or wear."
        },
        {
          "headline":"Be aware of signs of potential problems with your fireplace.",
          "description":"Even if your fireplace seems to be in good shape and has been inspected regularly, you need to be aware of fireplace warning signs. You may smell smoke in the room while a fire is burning, notice damaged wallpaper on the wall by the fireplace (or “hot spots,” where the wall adjacent to the chimney is intensely hot in certain places), or begin to notice rust around the damper or firebox. If you see any of these signs, call a chimney sweep or local fireplace-inspection service before lighting your next fire. You may experience downdrafts when using your fireplace. A downdraft is caused by air rushing down your chimney and pushing smoke and ash out from the fireplace into your home. Your chimney cap should prevent downdrafts, but if they occur frequently, inspect the chimney cap and make sure there are no branches overhanging the top of the chimney, as these can interfere with proper airflow."
        }
      ]
    },
    {
      "name":"Preventing Emergencies",
      "steps":[
        {
          "headline":"Keep a fire extinguisher near the fireplace.",
          "description":"This will be your first line of defense if a burning log falls out of the fireplace, or a piece of furniture catches fire. Familiarize yourself with how the fire extinguisher works when you purchase it. Also check the expiration date; if your fire extinguisher has expired, purchase a new one at your local hardware store immediately. To extinguish a fire without using a fire extinguisher (say, if you need to leave the house or want to go to bed), you can “collapse” the fire on itself—push the logs down to remove the airflow under the blaze, which will smother the fire. This is not an immediate process and it may still take about 30 minutes for the fire to be reduced to coals, which you can then shovel extinguished ashes on top of to put out."
        },
        {
          "headline":"Install smoke and carbon-monoxide detectors.",
          "description":"In case of fire, always have a smoke alarm in each room of your house. Make sure that the detectors work by checking them once a month, and change the batteries annually. Also install carbon-monoxide detectors in your home. You may not need a carbon monoxide detector on every room, but you house should have one on every level or floor. If you have children, make sure they realize that these alarms are important devices and not to be tampered or played with."
        },
        {
          "headline":"Keep the area clear.",
          "description":"In order to reduce the risk of a house fire, keep the area within 5 feet (1.5 m) of your fireplace clear, otherwise you'll risk these items catching on fire. Don't set any furniture, animal beds, or pillows in this area. If you have a rug near the fireplace, make sure that it's nonflammable. If you store firewood and kindling inside your house, make sure that these flammable supplies are set back from the fireplace. It would cause immediate danger if a burning spark were to ignite your entire firewood supply indoors."
        }
      ]
    }
  ],
  "text":" Building a Fire Safely Burn safe materials. Only burn natural materials in your fireplace; never introduce foreign substances, including cardboard, newspaper, or paper trash. These substances burn poorly, produce a lot of smoke, and release chemicals into the air. Only burn tinder (such as pine needles or tiny sticks), kindling (small sticks or pinecones), and fuel (large logs, up to about 14” long). Burning hardwood (such as maple and oak) will diminish the amount of soot and ash buildup in your chimney. Also avoid burning wood that is wet or still green, as it will produce large amounts of smoke and not burn well. Avoid using flammable liquids to start fires. You should never put gasoline into a fireplace. Gas is volatile, and could easily cause a fire to get out of control. If you're struggling to light a fire, use a small amount of lighter fluid instead, although it's best to just use matches and tinder. Flammable liquids are risky and raise the chances of a house fire. If your fires aren't starting consistently, hardware stores also sell small (rough 2” x 2”) fire-starter squares that will burn for about 15–20 minutes. Start the fire correctly. If you build your fire efficiently the first time, it will burn for longer, heat your home effectively, and result in minimal smoke escaping into your home. Start by laying your tinder at the bottom of the fire, followed by kindling. Lay the wood pieces in such a way that there will be room for airflow under the fire—without airflow, the fire will go out immediately. Finally, add two or three logs on top; you can add more logs once the initial couple are burning. When you add logs to the fire, make sure to set them gently on top of the already-burning logs or coals—if you throw new logs on, sparks and burning coals will fly off. Add logs one or two at a time, as you don't want to turn your quiet fire into a bonfire by adding too many logs at once. Before you place any wood in the fireplace, remember to open the damper. People often forget this step, and a closed damper will result in your fire filling your home with smoke. Clean out the ashes after every fire. Before lighting a new fire in the evening, you'll need to scoop out the ash from the previous fire. This will help keep your fireplace clean and attractive, and will prevent live coals from burning in your fireplace while you're away from the house. You can purchase an ash shovel at a hardware store. Also consider purchasing other common fireplace tools, such as brush and fireplace tongs or prong. The latter will allow you to move burning logs around in the fire, if they're at risk of falling out. Keep a fireplace screen in front of the fireplace when in use. A fireplace screen should be at least 3 feet (0.91 m) high, and most common models are be made of fine, crossed wire on a flexible, three-part frame. This screen will catch any live sparks that leap out of the fire, and will also prevent larger logs from falling out. A screen is a necessity if you have small children or animals in the house, as they could easily run or stumble into an open fire. If there are more durable models of fireplace grate available at your local hardware store, it may be wise to purchase a heavy grate in addition to (or instead of) a lighter screen. Maintaining your Fireplace Inspect your fireplace every two years. Parts of the fireplace can break or wear down, and it's important to note these before the fireplace malfunctions or causes an emergency fire. While the fireplace is cool, open the damper (seal at the top of the fireplace) and inspect the flue (opening connecting the fireplace to the chimney). The flue should be open and clear of obstructions. Examine the hearth to make sure no bricks are damaged or missing, and that the firebox—the interior of the fireplace—is not cracked or damaged. If you're more comfortable letting professionals inspect your fireplace and chimney, call a local chimney sweep. They will inspect both inside and outside of your house, and inform you if any cleaning or repairs are needed. Keep the chimney cap clean. The chimney cap is at the very peak of the chimney: a small, plate-sized lid that is attached to the top of your chimney pipe to make sure that no small animals or debris fall down the chimney. If it becomes clogged or broken, smoke will not be able to exit the chimney and could back up into your house. Make sure that the cap is in good condition, and is free from cracks, ash buildup, or birds' nests. Since you'll need to climb on top of your roof to do this, make sure to observe safety precautions. Firmly ground your ladder before you begin to ascend. Clean your chimney annually. Even if the chimney cap is clear, ash can still build up on the inside of the chimney pipe itself. This presents a risk, as excess buildup can catch on fire and lead to a dangerous and chimney fire. If your chimney has excess internal ash buildup, during summer months, smoky-smelling air can be drawn through the chimney into the house. To clean a chimney, you'll need a specific set of pipes and brushes that you should be able to purchase at your local hardware store. If you prefer not to clean your own chimney, a local cleaning or maintenance service should be able to do the job for you. Also inspect the chimney flashing (the seal between the chimney and roof). This should be tight and not show any signs of damage or wear. Be aware of signs of potential problems with your fireplace. Even if your fireplace seems to be in good shape and has been inspected regularly, you need to be aware of fireplace warning signs. You may smell smoke in the room while a fire is burning, notice damaged wallpaper on the wall by the fireplace (or “hot spots,” where the wall adjacent to the chimney is intensely hot in certain places), or begin to notice rust around the damper or firebox. If you see any of these signs, call a chimney sweep or local fireplace-inspection service before lighting your next fire. You may experience downdrafts when using your fireplace. A downdraft is caused by air rushing down your chimney and pushing smoke and ash out from the fireplace into your home. Your chimney cap should prevent downdrafts, but if they occur frequently, inspect the chimney cap and make sure there are no branches overhanging the top of the chimney, as these can interfere with proper airflow. Preventing Emergencies Keep a fire extinguisher near the fireplace. This will be your first line of defense if a burning log falls out of the fireplace, or a piece of furniture catches fire. Familiarize yourself with how the fire extinguisher works when you purchase it. Also check the expiration date; if your fire extinguisher has expired, purchase a new one at your local hardware store immediately. To extinguish a fire without using a fire extinguisher (say, if you need to leave the house or want to go to bed), you can “collapse” the fire on itself—push the logs down to remove the airflow under the blaze, which will smother the fire. This is not an immediate process and it may still take about 30 minutes for the fire to be reduced to coals, which you can then shovel extinguished ashes on top of to put out. Install smoke and carbon-monoxide detectors. In case of fire, always have a smoke alarm in each room of your house. Make sure that the detectors work by checking them once a month, and change the batteries annually. Also install carbon-monoxide detectors in your home. You may not need a carbon monoxide detector on every room, but you house should have one on every level or floor. If you have children, make sure they realize that these alarms are important devices and not to be tampered or played with. Keep the area clear. In order to reduce the risk of a house fire, keep the area within 5 feet (1.5 m) of your fireplace clear, otherwise you'll risk these items catching on fire. Don't set any furniture, animal beds, or pillows in this area. If you have a rug near the fireplace, make sure that it's nonflammable. If you store firewood and kindling inside your house, make sure that these flammable supplies are set back from the fireplace. It would cause immediate danger if a burning spark were to ignite your entire firewood supply indoors.",
  "tyn_model":[
    "fireplace",
    "logs",
    "tinder",
    "kindling",
    "fire extinguisher",
    "fire",
    "fireplace screen",
    "flue",
    "chimney sweep",
    "firewood",
    "cardboard",
    "newspaper",
    "fuel",
    "” long",
    "gasoline",
    "gas",
    "lighter fluid",
    "matches",
    "” x",
    "”)",
    "fire-starter",
    "—without",
    "coals",
    "—if",
    "ash shovel",
    "brush",
    "fireplace tongs",
    "fireplace grate",
    "hearth",
    "—the",
    "—is",
    "chimney",
    "ladder",
    "ash",
    "pipes",
    "brushes",
    "“hot",
    "” where",
    "fireplace-inspection service",
    "extinguisher",
    "“collapse",
    "” the",
    "—push",
    "smoke and",
    "carbon-monoxide detectors",
    "smoke alarm",
    "carbon-monoxide",
    "carbon monoxide detector",
    "rug"
  ],
  "tyn_section":[

  ]
}