{
  "title":"How to Make Gingerbread Cookies With Golden Syrup",
  "url":"https://www.wikihow.com/Make-Gingerbread-Cookies-With-Golden-Syrup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Add the golden syrup and sugars to a heavy-based pan.",
      "description":"Place the pan over low heat and stir through constantly until the sugars dissolve into the syrup completely."
    },
    {
      "headline":"Sprinkle in the spices and baking soda.",
      "description":"Mix through while the mixture continues to cook over low heat."
    },
    {
      "headline":"Remove from the heat once the mixture begins bubbling.",
      "description":"Preheat the oven to 170ºC. Line the baking tray with baking paper."
    },
    {
      "headline":"Add the butter in a large mixing bowl.",
      "description":"Pour over the hot mixture and mix together well. Leave for a few minutes to cool a bit."
    },
    {
      "headline":"Add the egg and mix through.",
      "description":"Gradually add in the sifted flour while stirring."
    },
    {
      "headline":"Take small amounts of the dough and roll each into a ball shape, about the size of a walnut.",
      "description":"Arrange on the baking tray. Flatten each ball a little with the ball of your hand."
    },
    {
      "headline":"Place the baking tray into the oven.",
      "description":"Bake for 10–12 minutes. Remove when ready and leave to cool on a wire cooling rack."
    },
    {
      "headline":"Ice when cooled.",
      "description":"Make the icing by adding 1 tablespoon of warm water to the icing sugar. Add small amounts to each cookie and leave to set."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Add the golden syrup and sugars to a heavy-based pan. Place the pan over low heat and stir through constantly until the sugars dissolve into the syrup completely. Sprinkle in the spices and baking soda. Mix through while the mixture continues to cook over low heat. Remove from the heat once the mixture begins bubbling. Preheat the oven to 170ºC. Line the baking tray with baking paper. Add the butter in a large mixing bowl. Pour over the hot mixture and mix together well. Leave for a few minutes to cool a bit. Add the egg and mix through. Gradually add in the sifted flour while stirring. Take small amounts of the dough and roll each into a ball shape, about the size of a walnut. Arrange on the baking tray. Flatten each ball a little with the ball of your hand. Place the baking tray into the oven. Bake for 10–12 minutes. Remove when ready and leave to cool on a wire cooling rack. Ice when cooled. Make the icing by adding 1 tablespoon of warm water to the icing sugar. Add small amounts to each cookie and leave to set. Finished. ",
  "tyn_model":[
    "baking tray",
    "sugars",
    "oven",
    "golden syrup",
    "heavy-based pan",
    "spices",
    "baking soda",
    "baking paper",
    "butter",
    "large mixing bowl",
    "flour",
    "warm water",
    "icing sugar"
  ],
  "tyn_section":[

  ]
}