{
  "title":"How to Make Russian Blinis with Curd",
  "url":"https://www.wikihow.com/Make-Russian-Blinis-with-Curd",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "steps":[
    {
      "headline":"Mix all the ingredients for the blinis in a bowl.",
      "description":""
    },
    {
      "headline":"Put a pan on low heat and heat some oil.",
      "description":""
    },
    {
      "headline":"Take always one scoop of the dough and spread it on the pan.",
      "description":""
    },
    {
      "headline":"Fry the blinis on both sides on low heat till all the dough is gone.",
      "description":""
    },
    {
      "headline":"Set aside and let cool.",
      "description":""
    },
    {
      "headline":"Mix the curd, the sugar and the nuts in a bowl.",
      "description":""
    },
    {
      "headline":"Take the cold blinis and put one or two tablespoons (depending on the size of your blinis) with the curd mix on them.",
      "description":""
    },
    {
      "headline":"Roll the blinis with the filling.",
      "description":""
    },
    {
      "headline":"Serve it hot or cold.",
      "description":"You can heat them in the oven or in the microwave for 3 minutes."
    },
    {
      "headline":"Serve with whipped cream, honey, jam or anything you like.",
      "description":""
    }
  ],
  "text":" Mix all the ingredients for the blinis in a bowl.  Put a pan on low heat and heat some oil.  Take always one scoop of the dough and spread it on the pan.  Fry the blinis on both sides on low heat till all the dough is gone.  Set aside and let cool.  Mix the curd, the sugar and the nuts in a bowl.  Take the cold blinis and put one or two tablespoons (depending on the size of your blinis) with the curd mix on them.  Roll the blinis with the filling.  Serve it hot or cold. You can heat them in the oven or in the microwave for 3 minutes. Serve with whipped cream, honey, jam or anything you like. ",
  "tyn_model":[
    "bowl",
    "curd",
    "pan",
    "oil",
    "sugar",
    "nuts",
    "whipped cream",
    "honey",
    "jam"
  ],
  "tyn_section":[

  ]
}