{
  "title":"How to Make Santa Pancakes",
  "url":"https://www.wikihow.com/Make-Santa-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "parts":[
    {
      "name":"Preparing Your Pancakes",
      "steps":[
        {
          "headline":"Make your batter.",
          "description":"The Santa aspect of your Santa pancakes is all in how you top and decorate them. So, to make the pancakes themselves, just follow your favorite recipe as you normally would. If you’re stuck for one, browse others on Wikihow, or simply follow this one for your batter:\nFor four pancakes, combine 1 cup (125 g) of flour, ½ teaspoon of baking powder, 1 tablespoon sugar, and ¼ teaspoon salt in a large mixing bowl. Then stir in 1 cup (237 ml) of milk and 1 large egg until the batter turns smooth."
        },
        {
          "headline":"Cook your pancakes.",
          "description":"First, lightly coat a large skillet with cooking oil. Turn the burner to medium-low heat. Once the skillet’s hot, ladle your batter into the skillet. Cook each pancake on one side until the top begins to bubble. Then flip it over with a spatula and cook the second side until it turns golden brown. For each Santa that you plan to make, you can ladle out a ¼ cup of batter for a standard-size pancake to use as Santa’s head. Additionally, you can make a second pancake of equal size to trim down to an undersized body. Or, you can ladle out a 1/4 cup for the upper torso and a smaller portion for the head for a more proportionally correct Santa."
        },
        {
          "headline":"Trim your body.",
          "description":"If you’ve made two pancakes for each Santa, with one meant to be his full body, transfer one pancake to a cutting board. Use a paring knife to trace an outline for Santa’s body. Discard the excess, or snack away on it while you repeat for any additional Santas. Alternatively, you could also save them to add to Santa’s face or body."
        }
      ]
    },
    {
      "name":"Creating Santa’s Face",
      "steps":[
        {
          "headline":"Arrange your pancakes on a plate.",
          "description":"If you’re using only one pancake per plate in order to make Santa’s head, set your pancake closer to one edge. Leave yourself plenty of room up top to create a large hat to fill your plate. If using two pancakes for a head and body respectively, do the same and place Santa’s feet as close to one edge as possible."
        },
        {
          "headline":"Give Santa some eyes.",
          "description":"For each pancake, set two chocolate chips where his eyes would be. Or, to make them stand out even more (and to add more flavor and vitamins to your meal), slice up a banana. Lay out a slice for each eye first, then top each with a chip. If you trimmed a second pancake down to make Santa’s body, you could also cut two circles out of that and set the chips on top of those instead of bananas."
        },
        {
          "headline":"Add a nose.",
          "description":"Use your favorite red fruit to add some color to his face. Trim a strawberry into a nose shape and set in between his eyes. Center a fresh raspberry or cherry in his face. Or, instead of fresh fruit, scoop out whole chunks from pie filling and use those. Again, if you have excess left from cutting an outline of Santa’s body, you could also use these to shape a nose if fruit isn’t your thing."
        },
        {
          "headline":"Go the extra mile with detail.",
          "description":"Use more banana slices or scrap pieces of pancake to shape ears on either side of his head. Load a liquid dropper with compote or red food coloring and give each cheek a drop of red to give Santa a blush from the wintry cold. Melt some extra chocolate chips and then draw a mouth, eyebrows, wrinkles, dimples, and/or laugh-lines with a toothpick. If you created a body, too, use a food brush to paint his boots, belt, and/or gloves with the chocolate while it’s still melted."
        }
      ]
    },
    {
      "name":"Making Santa’s Outfit",
      "steps":[
        {
          "headline":"Give your Santa a hat.",
          "description":"Brush compote or jam over the top of Santa’s head where his hat would cover it. Then arrange fresh red fruit like strawberries, raspberries, and/or cherries over it. Add more fruit to the plate above his head, shaping a red hat. Alternatively, you can just use cherry pie filling to simplify things. If you made a body, do the same for the red parts of his suit."
        },
        {
          "headline":"Detail with whipped cream.",
          "description":"Either use a spray can or fill a piping bag with whipped cream from a container. Outline the brow of his hat and give its tip a little pom-pom of white. Finish Santa’s face at the same time by giving him his beard. Detail his suit too if you made a body, with cuffs around his sleeves, a stripe along his waist, and another connecting his beard to his waist."
        },
        {
          "headline":"Add extra details.",
          "description":"Arrange mints leaves with small bits of red fruits to shape a Christmas tree if there’s free space on the plate. Dust powdered sugar over it and Santa’s boots. If you made a body, add chocolate chips to stand in for buttons on his suit."
        }
      ]
    }
  ],
  "text":" Preparing Your Pancakes Make your batter. The Santa aspect of your Santa pancakes is all in how you top and decorate them. So, to make the pancakes themselves, just follow your favorite recipe as you normally would. If you’re stuck for one, browse others on Wikihow, or simply follow this one for your batter:\nFor four pancakes, combine 1 cup (125 g) of flour, ½ teaspoon of baking powder, 1 tablespoon sugar, and ¼ teaspoon salt in a large mixing bowl. Then stir in 1 cup (237 ml) of milk and 1 large egg until the batter turns smooth. Cook your pancakes. First, lightly coat a large skillet with cooking oil. Turn the burner to medium-low heat. Once the skillet’s hot, ladle your batter into the skillet. Cook each pancake on one side until the top begins to bubble. Then flip it over with a spatula and cook the second side until it turns golden brown. For each Santa that you plan to make, you can ladle out a ¼ cup of batter for a standard-size pancake to use as Santa’s head. Additionally, you can make a second pancake of equal size to trim down to an undersized body. Or, you can ladle out a 1/4 cup for the upper torso and a smaller portion for the head for a more proportionally correct Santa. Trim your body. If you’ve made two pancakes for each Santa, with one meant to be his full body, transfer one pancake to a cutting board. Use a paring knife to trace an outline for Santa’s body. Discard the excess, or snack away on it while you repeat for any additional Santas. Alternatively, you could also save them to add to Santa’s face or body. Creating Santa’s Face Arrange your pancakes on a plate. If you’re using only one pancake per plate in order to make Santa’s head, set your pancake closer to one edge. Leave yourself plenty of room up top to create a large hat to fill your plate. If using two pancakes for a head and body respectively, do the same and place Santa’s feet as close to one edge as possible. Give Santa some eyes. For each pancake, set two chocolate chips where his eyes would be. Or, to make them stand out even more (and to add more flavor and vitamins to your meal), slice up a banana. Lay out a slice for each eye first, then top each with a chip. If you trimmed a second pancake down to make Santa’s body, you could also cut two circles out of that and set the chips on top of those instead of bananas. Add a nose. Use your favorite red fruit to add some color to his face. Trim a strawberry into a nose shape and set in between his eyes. Center a fresh raspberry or cherry in his face. Or, instead of fresh fruit, scoop out whole chunks from pie filling and use those. Again, if you have excess left from cutting an outline of Santa’s body, you could also use these to shape a nose if fruit isn’t your thing. Go the extra mile with detail. Use more banana slices or scrap pieces of pancake to shape ears on either side of his head. Load a liquid dropper with compote or red food coloring and give each cheek a drop of red to give Santa a blush from the wintry cold. Melt some extra chocolate chips and then draw a mouth, eyebrows, wrinkles, dimples, and/or laugh-lines with a toothpick. If you created a body, too, use a food brush to paint his boots, belt, and/or gloves with the chocolate while it’s still melted. Making Santa’s Outfit Give your Santa a hat. Brush compote or jam over the top of Santa’s head where his hat would cover it. Then arrange fresh red fruit like strawberries, raspberries, and/or cherries over it. Add more fruit to the plate above his head, shaping a red hat. Alternatively, you can just use cherry pie filling to simplify things. If you made a body, do the same for the red parts of his suit. Detail with whipped cream. Either use a spray can or fill a piping bag with whipped cream from a container. Outline the brow of his hat and give its tip a little pom-pom of white. Finish Santa’s face at the same time by giving him his beard. Detail his suit too if you made a body, with cuffs around his sleeves, a stripe along his waist, and another connecting his beard to his waist. Add extra details. Arrange mints leaves with small bits of red fruits to shape a Christmas tree if there’s free space on the plate. Dust powdered sugar over it and Santa’s boots. If you made a body, add chocolate chips to stand in for buttons on his suit.",
  "tyn_model":[
    "plate",
    "pancakes",
    "chocolate chips",
    "skillet",
    "banana",
    "compote",
    "whipped cream",
    "flour",
    "baking powder",
    "sugar",
    "salt",
    "large mixing bowl",
    "milk",
    "large skillet",
    "cooking oil",
    "spatula",
    "cutting board",
    "paring knife",
    "bananas",
    "strawberry",
    "raspberry",
    "cherry",
    "fruit",
    "pie filling",
    "pancake",
    "liquid dropper",
    "red food coloring",
    "toothpick",
    "food brush",
    "chocolate",
    "jam",
    "strawberries",
    "raspberries",
    "cherries",
    "cherry pie",
    "spray can",
    "piping bag",
    "powdered sugar"
  ],
  "tyn_section":[

  ]
}