{
  "title":"How to Make Cotton Candy Fudge",
  "url":"https://www.wikihow.com/Make-Cotton-Candy-Fudge",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Fudge"
  ],
  "methods":[
    {
      "name":"Making Easy Cotton Candy Fudge",
      "steps":[
        {
          "headline":"Line a baking pan with parchment paper.",
          "description":"Lay two pieces of parchment paper crosswise in a 9 by 9-inch (22.86 by 22.86-centimeter) baking pan so that the bottom and sides are covered. Leave some of the parchment paper hanging over the edges so that you can lift the fudge out later."
        },
        {
          "headline":"Put the candy melts and sweetened condensed milk into a microwave-safe bowl.",
          "description":"Use pink candy melts if you want pink fudge, and light blue candy melts if you want blue fudge. You can buy candy melts in the baking section of an arts and crafts store, in baking supply shops, and online. If you can't find any pink or blue candy melts, you can use plain white ones instead. If you still want your fudge to be colored, you will have to add in some food coloring later on."
        },
        {
          "headline":"Heat the condensed milk and candy melts in the microwave.",
          "description":"Put the bowl into the microwave, and cook for 1½ minutes on high. Keep an eye on the bowl, and don't let the candy melts burn."
        },
        {
          "headline":"Stir the mixture together.",
          "description":"Take the bowl out of the microwave using a pot holder. Set the bowl down on a heat-safe surface. Stir the condensed milk and candy melts together with a whisk. If the candy is still not melted, even after stirring it, microwave it at 15-second increments until it is melted. Be sure to stir between each increment."
        },
        {
          "headline":"Stir in the cotton candy flavoring oil.",
          "description":"You can usually find it with the other candy-making supplies in craft shops and baking supply shops. Be sure to scrape the bottom and sides of the bowl often. If you used plain white candy melts, add a few drops of pink or blue gel-based food coloring."
        },
        {
          "headline":"Pour the mixture into the prepared baking pan.",
          "description":"Use a rubber spatula to scrape everything out of the bowl. Spread the mixture evenly across the bottom of the pan."
        },
        {
          "headline":"Chill the mixture until it sets.",
          "description":"Place the baking pan in the refrigerator. Leave it there until the fudge sets. It will take about four hours."
        },
        {
          "headline":"Cut the fudge into small squares.",
          "description":"Once the fudge has set and turned solid, take the baking pan out of the fridge. Set it down on the counter, and use the overhanging parchment paper to lift the fudge out. Use a sharp knife to cut the fudge into 1-inch (2.5-centimeter) squares."
        }
      ]
    },
    {
      "name":"Making Basic Cotton Candy Fudge",
      "steps":[
        {
          "headline":"Line a baking pan with parchment paper.",
          "description":"Place two big sheets of parchment paper crosswise into a 9 by 13-inch  (22.86 by 33.02-centimeter) baking pan so that both the bottom and sides are covered. Leave some of the parchment paper hanging over the sides of the pan so that you can remove the fudge later."
        },
        {
          "headline":"Heat the sugar, butter, and heavy cream in a saucepan.",
          "description":"Cut the butter into small cubes, and put it into a saucepan. Add the sugar and the heavy cream. Stir everything together whisk, then cook over low heat until the butter melts and the sugar dissolves."
        },
        {
          "headline":"Bring the mixture to a boil for 4 minutes.",
          "description":"Once the sugar has dissolved and the butter melted, turn the heat up to medium. Allow the mixture to come to a boil, then allow it to cook for 4 minutes. Stir it often."
        },
        {
          "headline":"Add in the marshmallow cream and the chocolate chips.",
          "description":"Take the saucepan off the burner and set it down on a heat-safe surface. Stir in the marshmallow creme and white chocolate chips. Keep stirring until both the creme and chips have melted and the mixture is smooth."
        },
        {
          "headline":"Add the food coloring and flavoring oil into the saucepan.",
          "description":"The more food coloring you use, the brighter and more vibrant your fudge will turn out. If you can, try to use the gel-based food coloring and not the liquid one. Not only will the colors turn out better, but the texture as well."
        },
        {
          "headline":"Pour the mixture into the prepared baking sheet.",
          "description":"Use a rubber spatula to scrape the mixture out of the bowl and to spread it evenly across the baking sheet."
        },
        {
          "headline":"Allow the fudge to set in the refrigerator.",
          "description":"It will take about 2 to 4 hours for it to set."
        },
        {
          "headline":"Cut the fudge into squares before serving.",
          "description":"Take the baking pan out of the refrigerator and set it down on the counter. Use the overhanging parchment paper to lift the fudge out. Set the fudge down on the counter and cut it into 1-inch (2.54-centimeter) squares."
        }
      ]
    }
  ],
  "text":" Making Easy Cotton Candy Fudge Line a baking pan with parchment paper. Lay two pieces of parchment paper crosswise in a 9 by 9-inch (22.86 by 22.86-centimeter) baking pan so that the bottom and sides are covered. Leave some of the parchment paper hanging over the edges so that you can lift the fudge out later. Put the candy melts and sweetened condensed milk into a microwave-safe bowl. Use pink candy melts if you want pink fudge, and light blue candy melts if you want blue fudge. You can buy candy melts in the baking section of an arts and crafts store, in baking supply shops, and online. If you can't find any pink or blue candy melts, you can use plain white ones instead. If you still want your fudge to be colored, you will have to add in some food coloring later on. Heat the condensed milk and candy melts in the microwave. Put the bowl into the microwave, and cook for 1½ minutes on high. Keep an eye on the bowl, and don't let the candy melts burn. Stir the mixture together. Take the bowl out of the microwave using a pot holder. Set the bowl down on a heat-safe surface. Stir the condensed milk and candy melts together with a whisk. If the candy is still not melted, even after stirring it, microwave it at 15-second increments until it is melted. Be sure to stir between each increment. Stir in the cotton candy flavoring oil. You can usually find it with the other candy-making supplies in craft shops and baking supply shops. Be sure to scrape the bottom and sides of the bowl often. If you used plain white candy melts, add a few drops of pink or blue gel-based food coloring. Pour the mixture into the prepared baking pan. Use a rubber spatula to scrape everything out of the bowl. Spread the mixture evenly across the bottom of the pan. Chill the mixture until it sets. Place the baking pan in the refrigerator. Leave it there until the fudge sets. It will take about four hours. Cut the fudge into small squares. Once the fudge has set and turned solid, take the baking pan out of the fridge. Set it down on the counter, and use the overhanging parchment paper to lift the fudge out. Use a sharp knife to cut the fudge into 1-inch (2.5-centimeter) squares. Making Basic Cotton Candy Fudge Line a baking pan with parchment paper. Place two big sheets of parchment paper crosswise into a 9 by 13-inch  (22.86 by 33.02-centimeter) baking pan so that both the bottom and sides are covered. Leave some of the parchment paper hanging over the sides of the pan so that you can remove the fudge later. Heat the sugar, butter, and heavy cream in a saucepan. Cut the butter into small cubes, and put it into a saucepan. Add the sugar and the heavy cream. Stir everything together whisk, then cook over low heat until the butter melts and the sugar dissolves. Bring the mixture to a boil for 4 minutes. Once the sugar has dissolved and the butter melted, turn the heat up to medium. Allow the mixture to come to a boil, then allow it to cook for 4 minutes. Stir it often. Add in the marshmallow cream and the chocolate chips. Take the saucepan off the burner and set it down on a heat-safe surface. Stir in the marshmallow creme and white chocolate chips. Keep stirring until both the creme and chips have melted and the mixture is smooth. Add the food coloring and flavoring oil into the saucepan. The more food coloring you use, the brighter and more vibrant your fudge will turn out. If you can, try to use the gel-based food coloring and not the liquid one. Not only will the colors turn out better, but the texture as well. Pour the mixture into the prepared baking sheet. Use a rubber spatula to scrape the mixture out of the bowl and to spread it evenly across the baking sheet. Allow the fudge to set in the refrigerator. It will take about 2 to 4 hours for it to set. Cut the fudge into squares before serving. Take the baking pan out of the refrigerator and set it down on the counter. Use the overhanging parchment paper to lift the fudge out. Set the fudge down on the counter and cut it into 1-inch (2.54-centimeter) squares.",
  "tyn_model":[
    "parchment paper",
    "baking pan",
    "bowl",
    "food coloring",
    "microwave",
    "sugar",
    "butter",
    "saucepan",
    "candy melts",
    "refrigerator",
    "condensed milk",
    "rubber spatula",
    "heavy cream",
    "baking sheet",
    "sweetened condensed milk",
    "microwave-safe bowl",
    "whisk",
    "cotton candy flavoring oil",
    "baking supply shops",
    "fridge",
    "sharp knife",
    "marshmallow cream",
    "chocolate chips",
    "marshmallow creme",
    "white chocolate chips",
    "flavoring oil"
  ],
  "tyn_section":[

  ]
}