{
  "title":"How to Make Washi Tape Ornaments",
  "url":"https://www.wikihow.com/Make-Washi-Tape-Ornaments",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Fastening Tools"
  ],
  "methods":[
    {
      "name":"Decorating Blank Ornaments",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"An easy way to make washi tape ornaments is to simply apply washi tape to blank ornaments. This works well on smooth, round bulbs or other flat surface ornament blanks that can be found at many department and craft stores. For this type of project, you need:\nBlank ornaments of any color (avoid textures such as glitter)\nWashi tape of different colors and patterns (or you can decorate double-sided tape to use as washi tape instead)\nScissors\nRibbon or ornament hooks"
        },
        {
          "headline":"Prep your ornaments.",
          "description":"Help the washi tape hold longer by wiping down your ornament blanks to get rid of any dust or surface debris. Use a damp wipe or towel to wipe down each ornament and let them dry completely before applying the tape. You may also want to remove the metallic or plastic ornament caps at this time if you plan on doing a design that runs to the top of the ornament."
        },
        {
          "headline":"Plan your design.",
          "description":"Plan your design before you start putting on the tape. One minimalist design would be to run a single band of washi tape around the horizontal center of the bulb. You can also do horizontal or vertical stripes, or a more creative design. The only limit is your vision. If you have a patterned washi tape, consider cutting out individual parts of the pattern to create a more detailed design. For example, cut out individual dots instead of taping a whole row of dots. Use a colored pencil one shade darker than your ornament (or a wax pencil for clear ornaments) to sketch or outline your design before you start applying tape."
        },
        {
          "headline":"Tape your ornament.",
          "description":"Once you have your design ready, add the washi tape to your ornament. If you want to vary the edges of your tape, use scissors or pinking shears to create patterns and textured edges. If you have small tape pieces such as individual dots or flowers, use tweezers to help you apply the tape to the designated area. If you are creating multiple stripes or lines, try to have all the tape seams on the same side of the ornament so that you can face the side without seams outward."
        },
        {
          "headline":"Hang your ornament.",
          "description":"Once your washi tape ornament is ready, replace the cap and add a hook or ribbon to hang your ornament. Then, hang the ornament from your tree, around your house, or anywhere you think it will look good. While hooks work well for trees, ribbon works best for other areas such as from a mirror or on a nail."
        }
      ]
    },
    {
      "name":"Making Washi Tape Tag Ornaments",
      "steps":[
        {
          "headline":"Get your supplies ready.",
          "description":"Make paper tags that you can hang as ornaments or put onto gifts as to/from tags. For this project, you will need:\nConstruction paper or cardstock in a variety of colors\nWashi tape in different colors or patterns\nCraft glue or glue stick\nScissors\nRibbon\nDie cut punch in any shape (optional)\nPuffs, sequins, glitter, or any other additional decoration (optional)"
        },
        {
          "headline":"Create patterns.",
          "description":"This project is done easily by using two die cut punches: one in the shape of the tag you want and the other in the shape of the cut-out you want. However, it can be done without those by creating patterns. You will need two: one for the tag and one for the tag cut-out. Create a pattern for the tag in any shape that you want. These could be oval, square, rectangular with clipped edges, or anything else. Trace the pattern onto a sturdy paper or cardboard and carefully cut it out with scissors. Create a pattern for the cut-out. It can be any shape, though hearts, stars, and trees may be easiest, but it needs to be small enough to fit inside your tag and leave room for edges on each side. Trace the pattern onto a sturdy paper and cut it out using scissors."
        },
        {
          "headline":"Make your tag bases.",
          "description":"Take a piece of cardstock or construction paper and lay strips of washi tape along the length of the paper. Get the tape strips side-by-side or have them overlap slightly, but try to leave no paper showing. Once you have all your washi tape down, use the die cut punch or trace your tag pattern across the page, creating as many tags as you want. Then, cut out the tags."
        },
        {
          "headline":"Make your tag tops.",
          "description":"Using your die cut punch or tag pattern, create tops for your tags. These are where you will place your cut-outs, so that you can see through to the washi tape. The tag tops do not need to be taped, but should be a color of paper you want to display. Cut out as many tag tops as you have tag bottoms. Have fun by making tops in multiple colors."
        },
        {
          "headline":"Create your cut-outs.",
          "description":"Take your cut-out pattern and center it on your tag top. Then, using either scissors or your die cut punch, cut out a window in the shape of your cut-out from the top of the tag. Save the tag top, and dispose of our recycle the cut-out piece. Use a ruler and pencil to make sure your cut-out is centered and in the same place on every tag. Create variety by making multiple shapes of cut-outs."
        },
        {
          "headline":"Assemble your tag.",
          "description":"Place a thin, even layer of glue across the back side of the top of your tag. Line up your tag base and your tag top, and glue the two together with the washi tape side of the base facing the tag top. The end result should be a tag where the cut out in the tag top shows through to the pattern of the washi tape."
        },
        {
          "headline":"Decorate and hang.",
          "description":"Once your tag is assembled, decorate it as you see fit. You can use pens, sequins, glitter, paint, pom poms, or anything else you want. Then, punch a hole in the top of the tag and run ribbon through to be able to hang your tag. You don’t have to add additional decoration to the tag if you like the way the cut out and the tape look. The choice is up to you. Use twine instead of ribbon to give your tag ornament a more package-oriented motif."
        }
      ]
    },
    {
      "name":"Designing Washi Tape Cut Out Ornaments",
      "steps":[
        {
          "headline":"Choose your materials.",
          "description":"DIY ornaments by using acrylic cut-outs or making your own cut outs from cardboard and covering them in washi tape. For these ornaments, you will need:\nAcrylic cut-outs or cardboard to make your own cut-outs\nWashi tape in different colors and patterns\nScissors\nRibbon or string for hanging"
        },
        {
          "headline":"Make your cut-outs.",
          "description":"If you decide to make your own cut-outs, use thick paper such as cardstock to trace templates for the shapes you want for your ornaments. Trace the templates onto cardboard, and use scissors or an exacto knife to cut out the shape for your ornaments. Use the template repeatedly to ensure you get consistent shapes for your ornaments\nYour cut-outs can be as large or as small as you want. If you intend to use them on your tree, though, remember to make them small enough to fit comfortably between the tree branches."
        },
        {
          "headline":"Tape your cut-outs.",
          "description":"Decorate your cut outs with the washi tape. The design is up to you. You can cover up the whole cut out and make patterns with your tape, or you can add some tape in strategic places on your cardboard cut-outs for a shabby chic look. The choice is yours. Cut out individual components of a pattern from your tape to help you make more elaborate designs. For example, if you have washi tape with snowflakes on it, cut out individual flakes to customize your design."
        },
        {
          "headline":"Prepare to hang your ornaments.",
          "description":"Once you have decorated your cut-outs to your liking, punch a hole in the top and run ribbon or string through so that you can hang your ornament. If you cannot punch through an acrylic cut-out, hot glue a loop of ribbon or string onto the back of your shape. Be aware that your cardboard cut-outs may not stand up well to water or atmospheric moisture, so hang them indoors and away from the kitchen to get the most out of them."
        }
      ]
    }
  ],
  "text":" Decorating Blank Ornaments Gather your supplies. An easy way to make washi tape ornaments is to simply apply washi tape to blank ornaments. This works well on smooth, round bulbs or other flat surface ornament blanks that can be found at many department and craft stores. For this type of project, you need:\nBlank ornaments of any color (avoid textures such as glitter)\nWashi tape of different colors and patterns (or you can decorate double-sided tape to use as washi tape instead)\nScissors\nRibbon or ornament hooks Prep your ornaments. Help the washi tape hold longer by wiping down your ornament blanks to get rid of any dust or surface debris. Use a damp wipe or towel to wipe down each ornament and let them dry completely before applying the tape. You may also want to remove the metallic or plastic ornament caps at this time if you plan on doing a design that runs to the top of the ornament. Plan your design. Plan your design before you start putting on the tape. One minimalist design would be to run a single band of washi tape around the horizontal center of the bulb. You can also do horizontal or vertical stripes, or a more creative design. The only limit is your vision. If you have a patterned washi tape, consider cutting out individual parts of the pattern to create a more detailed design. For example, cut out individual dots instead of taping a whole row of dots. Use a colored pencil one shade darker than your ornament (or a wax pencil for clear ornaments) to sketch or outline your design before you start applying tape. Tape your ornament. Once you have your design ready, add the washi tape to your ornament. If you want to vary the edges of your tape, use scissors or pinking shears to create patterns and textured edges. If you have small tape pieces such as individual dots or flowers, use tweezers to help you apply the tape to the designated area. If you are creating multiple stripes or lines, try to have all the tape seams on the same side of the ornament so that you can face the side without seams outward. Hang your ornament. Once your washi tape ornament is ready, replace the cap and add a hook or ribbon to hang your ornament. Then, hang the ornament from your tree, around your house, or anywhere you think it will look good. While hooks work well for trees, ribbon works best for other areas such as from a mirror or on a nail. Making Washi Tape Tag Ornaments Get your supplies ready. Make paper tags that you can hang as ornaments or put onto gifts as to/from tags. For this project, you will need:\nConstruction paper or cardstock in a variety of colors\nWashi tape in different colors or patterns\nCraft glue or glue stick\nScissors\nRibbon\nDie cut punch in any shape (optional)\nPuffs, sequins, glitter, or any other additional decoration (optional) Create patterns. This project is done easily by using two die cut punches: one in the shape of the tag you want and the other in the shape of the cut-out you want. However, it can be done without those by creating patterns. You will need two: one for the tag and one for the tag cut-out. Create a pattern for the tag in any shape that you want. These could be oval, square, rectangular with clipped edges, or anything else. Trace the pattern onto a sturdy paper or cardboard and carefully cut it out with scissors. Create a pattern for the cut-out. It can be any shape, though hearts, stars, and trees may be easiest, but it needs to be small enough to fit inside your tag and leave room for edges on each side. Trace the pattern onto a sturdy paper and cut it out using scissors. Make your tag bases. Take a piece of cardstock or construction paper and lay strips of washi tape along the length of the paper. Get the tape strips side-by-side or have them overlap slightly, but try to leave no paper showing. Once you have all your washi tape down, use the die cut punch or trace your tag pattern across the page, creating as many tags as you want. Then, cut out the tags. Make your tag tops. Using your die cut punch or tag pattern, create tops for your tags. These are where you will place your cut-outs, so that you can see through to the washi tape. The tag tops do not need to be taped, but should be a color of paper you want to display. Cut out as many tag tops as you have tag bottoms. Have fun by making tops in multiple colors. Create your cut-outs. Take your cut-out pattern and center it on your tag top. Then, using either scissors or your die cut punch, cut out a window in the shape of your cut-out from the top of the tag. Save the tag top, and dispose of our recycle the cut-out piece. Use a ruler and pencil to make sure your cut-out is centered and in the same place on every tag. Create variety by making multiple shapes of cut-outs. Assemble your tag. Place a thin, even layer of glue across the back side of the top of your tag. Line up your tag base and your tag top, and glue the two together with the washi tape side of the base facing the tag top. The end result should be a tag where the cut out in the tag top shows through to the pattern of the washi tape. Decorate and hang. Once your tag is assembled, decorate it as you see fit. You can use pens, sequins, glitter, paint, pom poms, or anything else you want. Then, punch a hole in the top of the tag and run ribbon through to be able to hang your tag. You don’t have to add additional decoration to the tag if you like the way the cut out and the tape look. The choice is up to you. Use twine instead of ribbon to give your tag ornament a more package-oriented motif. Designing Washi Tape Cut Out Ornaments Choose your materials. DIY ornaments by using acrylic cut-outs or making your own cut outs from cardboard and covering them in washi tape. For these ornaments, you will need:\nAcrylic cut-outs or cardboard to make your own cut-outs\nWashi tape in different colors and patterns\nScissors\nRibbon or string for hanging Make your cut-outs. If you decide to make your own cut-outs, use thick paper such as cardstock to trace templates for the shapes you want for your ornaments. Trace the templates onto cardboard, and use scissors or an exacto knife to cut out the shape for your ornaments. Use the template repeatedly to ensure you get consistent shapes for your ornaments\nYour cut-outs can be as large or as small as you want. If you intend to use them on your tree, though, remember to make them small enough to fit comfortably between the tree branches. Tape your cut-outs. Decorate your cut outs with the washi tape. The design is up to you. You can cover up the whole cut out and make patterns with your tape, or you can add some tape in strategic places on your cardboard cut-outs for a shabby chic look. The choice is yours. Cut out individual components of a pattern from your tape to help you make more elaborate designs. For example, if you have washi tape with snowflakes on it, cut out individual flakes to customize your design. Prepare to hang your ornaments. Once you have decorated your cut-outs to your liking, punch a hole in the top and run ribbon or string through so that you can hang your ornament. If you cannot punch through an acrylic cut-out, hot glue a loop of ribbon or string onto the back of your shape. Be aware that your cardboard cut-outs may not stand up well to water or atmospheric moisture, so hang them indoors and away from the kitchen to get the most out of them.",
  "tyn_model":[
    "washi tape",
    "tape",
    "ribbon",
    "scissors",
    "cardboard",
    "die cut punch",
    "construction paper",
    "glue",
    "glitter",
    "colored pencil",
    "wax pencil",
    "tweezers",
    "hooks",
    "washi tape tag",
    "glue stick",
    "die cut punches",
    "ruler",
    "pencil",
    "pens",
    "paint",
    "twine",
    "exacto knife"
  ],
  "tyn_section":[

  ]
}