{
  "title":"How to Make Holiday Sides Ahead of Time",
  "url":"https://www.wikihow.com/Make-Holiday-Sides-Ahead-of-Time",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Cooking Glazed Carrots",
      "steps":[
        {
          "headline":"Boil the carrots and broth.",
          "description":"Place a large skillet on the stovetop and heat it over medium-high heat. When it’s hot, add the broth and carrots, and bring them to a boil. Cover the pan, reduce heat to low, and simmer gently for 10 to 15 minutes."
        },
        {
          "headline":"Reduce the mixture.",
          "description":"After simmering until the carrots are al dente, or tender-crisp, remove the cover. Keep the heat on low and let the mixture reduce for several minutes. The broth should cook off until the mixture is almost dry."
        },
        {
          "headline":"Add the remaining ingredients to the reduced carrots.",
          "description":"When most of the broth has evaporated, add the butter and honey. Turn the heat up slightly if necessary, so the mixture continues to simmer. Stir constantly and cook for a few minutes, until the mixture thickens and forms a glaze. Season with salt and pepper to taste."
        },
        {
          "headline":"Store the carrots.",
          "description":"You can prepare the carrots the day before your holiday or several hours before your guests arrive. Let the carrots cool a bit after cooking, then transfer them to an airtight container. Store them in the refrigerator until about 15 minutes before you're read to serve them."
        },
        {
          "headline":"Reheat, serve, and enjoy.",
          "description":"When you're ready to reheat the carrots for your meal, get a skillet hot over medium heat. Melt about a tablespoon (15 mL) of oil or butter to coat the pan, and warm the carrots for a couple minutes, stirring frequently. When they're warm, place the carrots on a platter or serving dish and, if desired, garnish them with fresh chopped chives."
        }
      ]
    },
    {
      "name":"Preparing Garlicky Green Beans",
      "steps":[
        {
          "headline":"Boil and blanch the green beans.",
          "description":"While not absolutely necessary to preparing the dish, blanching your green beans will help maintain a vibrant green color, especially if you’re refrigerating them overnight. Bring a large pot of water to a boil, add half of the green beans, and cook for about four minutes, until they’re tender-crisp. While they cook, prepare a large bowl of ice water and place a colander in it. When the green beans are finished boiling, use a slotted spoon to transfer them to the ice bath."
        },
        {
          "headline":"Transfer the blanched green beans to a towel-lined baking sheet.",
          "description":"Place kitchen towels on a baking sheet. Lift the colander to drain the beans, and use a slotted spoon to transfer them to the baking sheet. Use another towel to blot them dry. Repeat the boiling and blanching process with the remaining green beans."
        },
        {
          "headline":"Store the green beans.",
          "description":"You can boil and blanch the green beans the day before your holiday meal, or in the morning before your guests arrived. Transfer them to an airtight container after you've blanched and towel dried them. Store them in the refrigerator until 15 or 20 minutes before you're ready to serve them."
        },
        {
          "headline":"Reheat and serve your green beans.",
          "description":"When you're ready to reheat them, get a large skillet hot over medium heat. Add the olive oil, and when it’s hot, add the garlic and cook for about 30 seconds. Stir in the green beans, parsley, and tarragon and cook everything for a couple minutes, stirring frequently. Season to taste with salt and pepper, place on a platter or in a serving dish, and enjoy."
        }
      ]
    },
    {
      "name":"Making Cranberry Sauce",
      "steps":[
        {
          "headline":"Cook the cranberries, sugar, and water.",
          "description":"Place a saucepan on low heat. Combine the cranberries, sugar, and water in the pan and cook for about 5 minutes. The skins of the cranberries should begin to pop open."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"Keep the heat on low. After the cranberry skins pop open, add the chopped apple and citrus zests and juices. Cook for an additional 15 minutes."
        },
        {
          "headline":"Cool, refrigerate, and serve the cranberry sauce.",
          "description":"Remove the pan from heat and let it cool. Then transfer the sauce to an airtight container. Refrigerate overnight if you’ve prepared it the day before your holiday meal, or prepare and store frozen up to 3 weeks in advance. Place in a serving dish and serve chilled."
        }
      ]
    },
    {
      "name":"Baking a Classic Sweet Potato Casserole",
      "steps":[
        {
          "headline":"Bake sweet potatoes until they’re tender.",
          "description":"Preheat your oven to 400 degrees Fahrenheit, or 200 degrees Celsius. Place the washed sweet potatoes on a baking sheet or an oven-safe casserole dish for an hour. Then remove them from heat and let them cool for about 20 minutes."
        },
        {
          "headline":"Peel and mash the potatoes.",
          "description":"When they’re cool to the touch, peel the baked sweet potatoes using a peeler or sharp kitchen knife. When you've finished peeling, cut them into smaller chunks and mash them using a potato masher or kitchen mixer on medium setting."
        },
        {
          "headline":"Beat together the remaining ingredients.",
          "description":"Add the sugar, butter, milk, eggs, vanilla extract, and salt to the mashed sweet potatoes. Beat them together by hand or with an electric mixer on medium speed until they’re smooth. Spoon the mixture into a greased baking dish or oven-safe casserole dish. While you beat the ingredients, get your oven preheated to 350 degrees Fahrenheit or 175 degrees Celsius."
        },
        {
          "headline":"Bake the potato mixture then store.",
          "description":"Place the casserole or baking dish in your preheated oven and bake for 30 minutes. Remove from the oven and let it cool. When it’s cool to the touch, cover tightly and refrigerate overnight if you’re preparing the dish the day before your holiday meal."
        },
        {
          "headline":"Prepare the casserole toppings.",
          "description":"About a half hour before mealtime, remove your potato casserole from the refrigerator and preheat your oven to 350 degrees Fahrenheit or 175 degrees Celsius. Combine 1/4 cup (60 mL) chopped pecans, 1 tablespoon (15 mL) brown sugar, and 1 tablespoon (15 mL) melted butter in a small bowl. Sprinkle the pecan mixture over the potato casserole in rows about 2 inches (5 cm) apart and bake for 10 minutes."
        },
        {
          "headline":"Melt the marshmallows into the casserole then serve.",
          "description":"Add the marshmallows to the spaces in between the pecan mixture. Bake for an additional 10 minutes. Remove from the oven, let stand for 5 to 10 minutes, then serve and enjoy."
        }
      ]
    }
  ],
  "text":" Cooking Glazed Carrots Boil the carrots and broth. Place a large skillet on the stovetop and heat it over medium-high heat. When it’s hot, add the broth and carrots, and bring them to a boil. Cover the pan, reduce heat to low, and simmer gently for 10 to 15 minutes. Reduce the mixture. After simmering until the carrots are al dente, or tender-crisp, remove the cover. Keep the heat on low and let the mixture reduce for several minutes. The broth should cook off until the mixture is almost dry. Add the remaining ingredients to the reduced carrots. When most of the broth has evaporated, add the butter and honey. Turn the heat up slightly if necessary, so the mixture continues to simmer. Stir constantly and cook for a few minutes, until the mixture thickens and forms a glaze. Season with salt and pepper to taste. Store the carrots. You can prepare the carrots the day before your holiday or several hours before your guests arrive. Let the carrots cool a bit after cooking, then transfer them to an airtight container. Store them in the refrigerator until about 15 minutes before you're read to serve them. Reheat, serve, and enjoy. When you're ready to reheat the carrots for your meal, get a skillet hot over medium heat. Melt about a tablespoon (15 mL) of oil or butter to coat the pan, and warm the carrots for a couple minutes, stirring frequently. When they're warm, place the carrots on a platter or serving dish and, if desired, garnish them with fresh chopped chives. Preparing Garlicky Green Beans Boil and blanch the green beans. While not absolutely necessary to preparing the dish, blanching your green beans will help maintain a vibrant green color, especially if you’re refrigerating them overnight. Bring a large pot of water to a boil, add half of the green beans, and cook for about four minutes, until they’re tender-crisp. While they cook, prepare a large bowl of ice water and place a colander in it. When the green beans are finished boiling, use a slotted spoon to transfer them to the ice bath. Transfer the blanched green beans to a towel-lined baking sheet. Place kitchen towels on a baking sheet. Lift the colander to drain the beans, and use a slotted spoon to transfer them to the baking sheet. Use another towel to blot them dry. Repeat the boiling and blanching process with the remaining green beans. Store the green beans. You can boil and blanch the green beans the day before your holiday meal, or in the morning before your guests arrived. Transfer them to an airtight container after you've blanched and towel dried them. Store them in the refrigerator until 15 or 20 minutes before you're ready to serve them. Reheat and serve your green beans. When you're ready to reheat them, get a large skillet hot over medium heat. Add the olive oil, and when it’s hot, add the garlic and cook for about 30 seconds. Stir in the green beans, parsley, and tarragon and cook everything for a couple minutes, stirring frequently. Season to taste with salt and pepper, place on a platter or in a serving dish, and enjoy. Making Cranberry Sauce Cook the cranberries, sugar, and water. Place a saucepan on low heat. Combine the cranberries, sugar, and water in the pan and cook for about 5 minutes. The skins of the cranberries should begin to pop open. Add the remaining ingredients. Keep the heat on low. After the cranberry skins pop open, add the chopped apple and citrus zests and juices. Cook for an additional 15 minutes. Cool, refrigerate, and serve the cranberry sauce. Remove the pan from heat and let it cool. Then transfer the sauce to an airtight container. Refrigerate overnight if you’ve prepared it the day before your holiday meal, or prepare and store frozen up to 3 weeks in advance. Place in a serving dish and serve chilled. Baking a Classic Sweet Potato Casserole Bake sweet potatoes until they’re tender. Preheat your oven to 400 degrees Fahrenheit, or 200 degrees Celsius. Place the washed sweet potatoes on a baking sheet or an oven-safe casserole dish for an hour. Then remove them from heat and let them cool for about 20 minutes. Peel and mash the potatoes. When they’re cool to the touch, peel the baked sweet potatoes using a peeler or sharp kitchen knife. When you've finished peeling, cut them into smaller chunks and mash them using a potato masher or kitchen mixer on medium setting. Beat together the remaining ingredients. Add the sugar, butter, milk, eggs, vanilla extract, and salt to the mashed sweet potatoes. Beat them together by hand or with an electric mixer on medium speed until they’re smooth. Spoon the mixture into a greased baking dish or oven-safe casserole dish. While you beat the ingredients, get your oven preheated to 350 degrees Fahrenheit or 175 degrees Celsius. Bake the potato mixture then store. Place the casserole or baking dish in your preheated oven and bake for 30 minutes. Remove from the oven and let it cool. When it’s cool to the touch, cover tightly and refrigerate overnight if you’re preparing the dish the day before your holiday meal. Prepare the casserole toppings. About a half hour before mealtime, remove your potato casserole from the refrigerator and preheat your oven to 350 degrees Fahrenheit or 175 degrees Celsius. Combine 1/4 cup (60 mL) chopped pecans, 1 tablespoon (15 mL) brown sugar, and 1 tablespoon (15 mL) melted butter in a small bowl. Sprinkle the pecan mixture over the potato casserole in rows about 2 inches (5 cm) apart and bake for 10 minutes. Melt the marshmallows into the casserole then serve. Add the marshmallows to the spaces in between the pecan mixture. Bake for an additional 10 minutes. Remove from the oven, let stand for 5 to 10 minutes, then serve and enjoy.",
  "tyn_model":[
    "carrots",
    "green beans",
    "oven",
    "broth",
    "baking sheet",
    "sweet potatoes",
    "pan",
    "butter",
    "airtight container",
    "refrigerator",
    "water",
    "cranberries",
    "sugar",
    "large skillet",
    "salt and pepper",
    "colander",
    "slotted spoon",
    "cranberry sauce",
    "potato",
    "pecan",
    "honey",
    "skillet",
    "oil or butter",
    "chives",
    "ice water",
    "ice bath",
    "kitchen towels",
    "olive oil",
    "garlic",
    "parsley",
    "tarragon",
    "saucepan",
    "cranberry",
    "apple",
    "citrus",
    "serving dish",
    "sweet potato",
    "oven-safe casserole dish",
    "potatoes",
    "kitchen knife",
    "potato masher",
    "kitchen mixer",
    "milk",
    "eggs",
    "vanilla extract",
    "salt",
    "electric mixer",
    "baking dish or oven-safe casserole dish",
    "baking dish",
    "pecans",
    "brown sugar",
    "small bowl"
  ],
  "tyn_section":[

  ]
}