{
  "title":"How to Make Grain‐Free Cloud Bread",
  "url":"https://www.wikihow.com/Make-Grain%E2%80%90Free-Cloud-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads"
  ],
  "parts":[
    {
      "name":"Mixing the Ingredients",
      "steps":[
        {
          "headline":"Preheat your oven to 300 degrees F (148.8 C).",
          "description":"Before you begin preparing your dough, turn your oven to 300 degrees F (148.8 degrees C). Preheating the oven is essential when making bread and other baked goods.."
        },
        {
          "headline":"Separate the eggs.",
          "description":"Crack the three eggs into a small bowl. Then use a spoon to carefully scoop up the yolks and place them in a separate bowl. Do this carefully, making sure that the yolks stay intact and that you don’t transfer excess egg white into the bowl of egg yolks. Use a spoon that is at least the same size as the egg yolk so that the yolk doesn’t break when scooped up. Once you have scooped up the yolk, remove excess egg white clinging to the yolk by shaking the spoon very slightly from side to side. The egg white will fall away from the spoon, leaving just the yolk."
        },
        {
          "headline":"Combine the egg yolks, cream cheese and honey.",
          "description":"Pour the egg yolks and 3 tablespoons (44.1 ml) of cream cheese into a mixing bowl. Add 1 tablespoon (14.7 ml) of honey or another sweetener if you wish. Use a whisk to stir the ingredients together until they are combined."
        },
        {
          "headline":"Add cream of tartar to the egg whites.",
          "description":"Add ¼ teaspoon (1.2 ml) of cream of tartar to the bowl of egg whites. Begin to rapidly whip the mixture together with a fork or whisk. You can also use an electric mixer on a high setting if you want especially fluffy bread."
        },
        {
          "headline":"Whip until stiff peaks form.",
          "description":"Keep whipping the cream of tartar and egg whites together until the mixture forms stiff peaks,  a few minutes or so if whipping by hand and around 1 minute if whipping with an electric mixer."
        }
      ]
    },
    {
      "name":"Creating the Dough",
      "steps":[
        {
          "headline":"Combine the egg white mixture with the egg yolk mixture.",
          "description":"After you thoroughly mix the egg white mixture, pour the egg yolk mixture into the egg white mixture, scraping the bowl if necessary to get all the mixture out."
        },
        {
          "headline":"Fold the ingredients together.",
          "description":"Use a spatula or large spoon to fold the ingredients together, lifting up the mixture from underneath, then folding it over on itself. Fold the ingredients until they are just blended. Folding as opposed to rapidly mixing or churning will keep the dough light and airy as opposed to dense."
        },
        {
          "headline":"Prepare two baking sheets.",
          "description":"Spray two baking sheets with non-stick cooking spray or grease the sheets with butter. Greasing or spraying the baking sheets will stop the bread from sticking."
        },
        {
          "headline":"Scoop the mixture onto the baking sheet.",
          "description":"Use a large spoon to scoop the mixture into 10 equal-sized portions onto the baking sheets. Try to make roughly round portions that are approximately ¾ inch (1.9 cm)  thick and 4-5 inches (10-12.7 cm) in diameter."
        }
      ]
    },
    {
      "name":"Baking the Bread",
      "steps":[
        {
          "headline":"Bake the bread in the oven for 30 minutes.",
          "description":"Place the two baking sheets in the middle rack of the preheated oven. Bake the bread for about 30 minutes, until the tops are golden brown. Keep an eye on the bread. Some oven times vary, so be sure to pull out the baking sheets when the bread is golden brown on top."
        },
        {
          "headline":"Place the bread on a cooling rack.",
          "description":"Once the bread has finished cooking, take it off the baking sheets and place them on a cooling rack. You can also put the bread on a plate or counter if you don’t have a cooling rack, though it may be denser if you don’t use a cooling rack."
        },
        {
          "headline":"Serve and enjoy.",
          "description":"Serve the bread as soon as it’s cool enough to eat. When the bread is fresh out of the oven, it is crumbly and airy, similar to the consistency of a meringue. You can also eat the bread the next day; it will be chewier and denser, more similar to the consistency of regular bread."
        }
      ]
    }
  ],
  "text":" Mixing the Ingredients Preheat your oven to 300 degrees F (148.8 C). Before you begin preparing your dough, turn your oven to 300 degrees F (148.8 degrees C). Preheating the oven is essential when making bread and other baked goods.. Separate the eggs. Crack the three eggs into a small bowl. Then use a spoon to carefully scoop up the yolks and place them in a separate bowl. Do this carefully, making sure that the yolks stay intact and that you don’t transfer excess egg white into the bowl of egg yolks. Use a spoon that is at least the same size as the egg yolk so that the yolk doesn’t break when scooped up. Once you have scooped up the yolk, remove excess egg white clinging to the yolk by shaking the spoon very slightly from side to side. The egg white will fall away from the spoon, leaving just the yolk. Combine the egg yolks, cream cheese and honey. Pour the egg yolks and 3 tablespoons (44.1 ml) of cream cheese into a mixing bowl. Add 1 tablespoon (14.7 ml) of honey or another sweetener if you wish. Use a whisk to stir the ingredients together until they are combined. Add cream of tartar to the egg whites. Add ¼ teaspoon (1.2 ml) of cream of tartar to the bowl of egg whites. Begin to rapidly whip the mixture together with a fork or whisk. You can also use an electric mixer on a high setting if you want especially fluffy bread. Whip until stiff peaks form. Keep whipping the cream of tartar and egg whites together until the mixture forms stiff peaks,  a few minutes or so if whipping by hand and around 1 minute if whipping with an electric mixer. Creating the Dough Combine the egg white mixture with the egg yolk mixture. After you thoroughly mix the egg white mixture, pour the egg yolk mixture into the egg white mixture, scraping the bowl if necessary to get all the mixture out. Fold the ingredients together. Use a spatula or large spoon to fold the ingredients together, lifting up the mixture from underneath, then folding it over on itself. Fold the ingredients until they are just blended. Folding as opposed to rapidly mixing or churning will keep the dough light and airy as opposed to dense. Prepare two baking sheets. Spray two baking sheets with non-stick cooking spray or grease the sheets with butter. Greasing or spraying the baking sheets will stop the bread from sticking. Scoop the mixture onto the baking sheet. Use a large spoon to scoop the mixture into 10 equal-sized portions onto the baking sheets. Try to make roughly round portions that are approximately ¾ inch (1.9 cm)  thick and 4-5 inches (10-12.7 cm) in diameter. Baking the Bread Bake the bread in the oven for 30 minutes. Place the two baking sheets in the middle rack of the preheated oven. Bake the bread for about 30 minutes, until the tops are golden brown. Keep an eye on the bread. Some oven times vary, so be sure to pull out the baking sheets when the bread is golden brown on top. Place the bread on a cooling rack. Once the bread has finished cooking, take it off the baking sheets and place them on a cooling rack. You can also put the bread on a plate or counter if you don’t have a cooling rack, though it may be denser if you don’t use a cooling rack. Serve and enjoy. Serve the bread as soon as it’s cool enough to eat. When the bread is fresh out of the oven, it is crumbly and airy, similar to the consistency of a meringue. You can also eat the bread the next day; it will be chewier and denser, more similar to the consistency of regular bread.",
  "tyn_model":[
    "baking sheets",
    "oven",
    "spoon",
    "bread",
    "bowl",
    "eggs",
    "cream cheese",
    "honey",
    "cream of tartar",
    "electric mixer",
    "egg yolk",
    "large spoon",
    "mixing bowl",
    "whisk",
    "egg",
    "fork or whisk",
    "cream",
    "tartar",
    "egg whites",
    "egg white",
    "spatula",
    "non-stick cooking spray",
    "butter",
    "baking sheet",
    "cooling rack",
    "plate",
    "meringue"
  ],
  "tyn_section":[

  ]
}