{
  "title":"How to Recognize a Scammer on Animal Jam",
  "url":"https://www.wikihow.com/Recognize-a-Scammer-on-Animal-Jam",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Animal Jam",
    "Animal Jam Trading"
  ],
  "steps":[
    {
      "headline":"Understand what types of scams exist in the game.",
      "description":"There are a number of methods people can scam you - trust trading, wheel, glitches, hacks, etc. Most are more effective or easy to avoid than others, but knowing what types of scams there are can help you know when someone may be trying to scam you so you can avoid being scammed. Trust trading - this is one of the most common and long-time scams in the game. Back in the beta days of Animal Jam, it was extremely easy to scam someone by trust-trading because the trade system required one person to click accept once and their items would be traded. Nowadays, it is much harder to scam someone by trust trading, but unfortunately, many people still fall for this method of scamming when the scammer tempts them with giving them an extremely rare item in return. Wheel - wheel actually isn't really a scam. It's one of the few giveaway methods that are trustworthy and usually safe. However, people can scam you by telling you they'll give you multiple spots on the wheel if you give them a good item, when you really won't be given that higher chance of getting the prize. If someone offers you 'special' spots on a wheel and asks for items in return, decline. Lies - if you don't know the worth of an item, or if you are doing trade attempts, people will know you don't know what the item on your trade list is worth and they can trade you unders so they can get a bigger profit and scam you out of a lot of rarity. If you ask a stranger what an item is worth and they tell you, verify their words to make sure your item really is worth what they told you. Be aware of what everything is worth to avoid falling for lies. For example, if you don't know what a Founders' Hat is worth and you say you're doing attempts, people might try to offer you 1 good long instead of 2, and tell you that it's worth 1 when it actually isn't. Glitches and hacks - unfortunately, many of these scamming glitches are unpredictable and can happen as long as anyone with this glitch can access your trade list. This is a very rare method of scamming, but it is also one that cannot be avoided as easily as others, even if you're not the one trading your items. Glitches and hacks exist where a scammer might trade you a necklace for a black long you have on trade. Even if you decline, it will automatically accept and you'll lose your item. Another glitch is where someone can disguise a necklace or other cheap item as a headdress on their trade list, convince you that they'll accept a really low item for it, like a short collar, and then once the trade is accepted, the 'headdress' turns into the cheap item, thus the scammer lied to you. If you see anyone who is suspicious or can perform other hacks, take your items off your trade list so you can avoid these scamming hacks and glitches. Some are patched, but they can always leak through the game again one way or another."
    },
    {
      "headline":"Know the method to win when in a giveaway.",
      "description":"If it's trust, it's guaranteed a scam. Trust trading is pretty much never reliable because if the scammer wanted to truthfully giveaway items, they could do it much more simpler ways than by seeing who offers them the best trade, like whoever sends them a jag first gets a spike. If trust trading is involved, you know the person is trying to scam someone in the den."
    },
    {
      "headline":"See if the scammer is desperate to get you to accept trades.",
      "description":"Usually in trust trading, scammers make it very clear that in order for a trust trade to count, you have the accept the trade twice. Once someone trades them the rarest item they've gotten so far, and the person accepts back, instead of the scammer trading it back like they promise, they lock everyone out of the den and keep the item for themselves. If a giveaway host is making this very clear or they keep telling you to accept the trade twice and that they promise to give it back several times, they are trying to scam you out of desperation."
    },
    {
      "headline":"See if the person is bribing other people.",
      "description":"This includes promising to give someone a good spot on a wheel giveaway, for example, if that someone gives the scammer a good item. In return, the scammer will not give them an extra spot or even host the supposed wheel giveaway at all. Bribes that sound too good to be true are too good to be true. Other bribes, such as adding a good item to the supposed prize to get better trust trades, is another sign of obvious scamming."
    },
    {
      "headline":"Look for a backup account that seems closely associated with the host.",
      "description":"Usually, these are non member, but they can be member, and this is what tricks people most, since it is rare to find someone with 2 or more member accounts, so 2 member accounts would seem like completely different people more so than a member account and a non member backup-looking account that is closely associated with the member host (or vice versa). What is very common nowadays is that a scammer will first make their backup appear to be a different person. They will try to trick everyone into thinking that the giveaway is real by pretending their backup won one of the prizes, giving it to them, and possibly making the backup put it on trade or wear it to 'prove' that they really won, when it's really just the scammer's backup. If you find this pattern when a giveaway is happening, it's a guaranteed scam, especially if trust trading is involved at the same time."
    },
    {
      "headline":"Check the supposed scammer's trade list as well as their animals.",
      "description":"These two factors can give away whether they are a scammer or not, especially if the Jammer scamming is using a non member account. If their animals have very few, unrare, or no clothing on, and they have no items on their trade list but they're offering to give away rare items through any form of gifting or trading, they are trying to scam you. This could also be the other way. If someone has a new-looking account, non-member or member, with no clothing items on but rares on a trade list, it's probably a scam account. This hints that the account was newly made to scam and to take the brunt of suspension in case Animal Jam moderators find out what they did. By then, they'll already have traded their scammed items to their main and get away with it. So if you see a suspicious looking account like this and again they are offering to give away items in return for trust trades, gifts, etc. it's a scam. Ask for proof that the scammer has the items if they are not on trade. If the person leaves, pretends the items are on their 'main' account, or they make other excuses, they are trying to scam you and lying about having the items in the first place."
    },
    {
      "headline":"See if the supposed scammer is willing to trade the safe way.",
      "description":"A new trading method was developed to allow traders to trade for large items with more than 20 items without getting scammed. Since you can only trade up to 20 items for a rare, it's easy to get scammed when you're, say, trading 60 den betas for a black long. You can trade 40 den betas for necklaces first, and then the other person runs off without giving you the black long for the remaining 20 den betas, hence you get scammed. The safe way, however, would involve you trading 20 den betas for items of the same worth (like a purple long) three times. You would then trade those purple longs for the person's black long. In the end, they get the 60 den betas, you get the black long, and they still get to keep their purple longs. If someone is really reluctant or they're making excuses to avoid doing a large trade the safe way, plus they don't want to trade first, they're obviously trying to scam you. If a scammer really did want den betas for their black long and they had the extra items to perform the safe way, they would do it. Otherwise, it is an obvious scam attempt that should be avoided."
    },
    {
      "headline":"See if the person is trying to get you to flash trade them.",
      "description":"This is one way they can scam you through a scamming glitch or hack. You may think it's harmless if they ask you to flash them real quick, but really, they may have an auto-accept glitch, and all they'd need was to receive a trade from you. People who are unusually keen on trying to get you to trade them in such a way may be scammers or hackers."
    },
    {
      "headline":"See if someone tries to lie to you about the worth of your item.",
      "description":"If you know what an item is worth, to check if someone is trying to scam you, you can ask them what your item is worth. If they lie about it and say it's completely underneath what it is really worth so that that scammer can obtain the item, it's an obvious scam. This is especially the case when the scammer says it's worth an item that they have. For example, you may not know what a purple long is worth. If you were to ask, a scammer with a neon bow can lie to you and say it's worth a neon bow. If you didn't know the real worth and believed them, you'd accept and get scammed. Be aware what everything is worth before accepting a trade."
    },
    {
      "headline":"See if the host of a giveaway buddies you.",
      "description":"In most giveaways a person is planning to scam from, they will only buddy the rare people. To test whether someone is a scammer or not, take off all your animals' clothes and all your items off your trade list, or use an empty backup account. If the host tells everyone to buddy them, and they don't accept your buddy request, it's because your account appears unrare and it wouldn't be worth trying to scam you. This is a dead giveaway if a person is in it to scam someone or not, not to actually host a real giveaway."
    }
  ],
  "text":" Understand what types of scams exist in the game. There are a number of methods people can scam you - trust trading, wheel, glitches, hacks, etc. Most are more effective or easy to avoid than others, but knowing what types of scams there are can help you know when someone may be trying to scam you so you can avoid being scammed. Trust trading - this is one of the most common and long-time scams in the game. Back in the beta days of Animal Jam, it was extremely easy to scam someone by trust-trading because the trade system required one person to click accept once and their items would be traded. Nowadays, it is much harder to scam someone by trust trading, but unfortunately, many people still fall for this method of scamming when the scammer tempts them with giving them an extremely rare item in return. Wheel - wheel actually isn't really a scam. It's one of the few giveaway methods that are trustworthy and usually safe. However, people can scam you by telling you they'll give you multiple spots on the wheel if you give them a good item, when you really won't be given that higher chance of getting the prize. If someone offers you 'special' spots on a wheel and asks for items in return, decline. Lies - if you don't know the worth of an item, or if you are doing trade attempts, people will know you don't know what the item on your trade list is worth and they can trade you unders so they can get a bigger profit and scam you out of a lot of rarity. If you ask a stranger what an item is worth and they tell you, verify their words to make sure your item really is worth what they told you. Be aware of what everything is worth to avoid falling for lies. For example, if you don't know what a Founders' Hat is worth and you say you're doing attempts, people might try to offer you 1 good long instead of 2, and tell you that it's worth 1 when it actually isn't. Glitches and hacks - unfortunately, many of these scamming glitches are unpredictable and can happen as long as anyone with this glitch can access your trade list. This is a very rare method of scamming, but it is also one that cannot be avoided as easily as others, even if you're not the one trading your items. Glitches and hacks exist where a scammer might trade you a necklace for a black long you have on trade. Even if you decline, it will automatically accept and you'll lose your item. Another glitch is where someone can disguise a necklace or other cheap item as a headdress on their trade list, convince you that they'll accept a really low item for it, like a short collar, and then once the trade is accepted, the 'headdress' turns into the cheap item, thus the scammer lied to you. If you see anyone who is suspicious or can perform other hacks, take your items off your trade list so you can avoid these scamming hacks and glitches. Some are patched, but they can always leak through the game again one way or another. Know the method to win when in a giveaway. If it's trust, it's guaranteed a scam. Trust trading is pretty much never reliable because if the scammer wanted to truthfully giveaway items, they could do it much more simpler ways than by seeing who offers them the best trade, like whoever sends them a jag first gets a spike. If trust trading is involved, you know the person is trying to scam someone in the den. See if the scammer is desperate to get you to accept trades. Usually in trust trading, scammers make it very clear that in order for a trust trade to count, you have the accept the trade twice. Once someone trades them the rarest item they've gotten so far, and the person accepts back, instead of the scammer trading it back like they promise, they lock everyone out of the den and keep the item for themselves. If a giveaway host is making this very clear or they keep telling you to accept the trade twice and that they promise to give it back several times, they are trying to scam you out of desperation. See if the person is bribing other people. This includes promising to give someone a good spot on a wheel giveaway, for example, if that someone gives the scammer a good item. In return, the scammer will not give them an extra spot or even host the supposed wheel giveaway at all. Bribes that sound too good to be true are too good to be true. Other bribes, such as adding a good item to the supposed prize to get better trust trades, is another sign of obvious scamming. Look for a backup account that seems closely associated with the host. Usually, these are non member, but they can be member, and this is what tricks people most, since it is rare to find someone with 2 or more member accounts, so 2 member accounts would seem like completely different people more so than a member account and a non member backup-looking account that is closely associated with the member host (or vice versa). What is very common nowadays is that a scammer will first make their backup appear to be a different person. They will try to trick everyone into thinking that the giveaway is real by pretending their backup won one of the prizes, giving it to them, and possibly making the backup put it on trade or wear it to 'prove' that they really won, when it's really just the scammer's backup. If you find this pattern when a giveaway is happening, it's a guaranteed scam, especially if trust trading is involved at the same time. Check the supposed scammer's trade list as well as their animals. These two factors can give away whether they are a scammer or not, especially if the Jammer scamming is using a non member account. If their animals have very few, unrare, or no clothing on, and they have no items on their trade list but they're offering to give away rare items through any form of gifting or trading, they are trying to scam you. This could also be the other way. If someone has a new-looking account, non-member or member, with no clothing items on but rares on a trade list, it's probably a scam account. This hints that the account was newly made to scam and to take the brunt of suspension in case Animal Jam moderators find out what they did. By then, they'll already have traded their scammed items to their main and get away with it. So if you see a suspicious looking account like this and again they are offering to give away items in return for trust trades, gifts, etc. it's a scam. Ask for proof that the scammer has the items if they are not on trade. If the person leaves, pretends the items are on their 'main' account, or they make other excuses, they are trying to scam you and lying about having the items in the first place. See if the supposed scammer is willing to trade the safe way. A new trading method was developed to allow traders to trade for large items with more than 20 items without getting scammed. Since you can only trade up to 20 items for a rare, it's easy to get scammed when you're, say, trading 60 den betas for a black long. You can trade 40 den betas for necklaces first, and then the other person runs off without giving you the black long for the remaining 20 den betas, hence you get scammed. The safe way, however, would involve you trading 20 den betas for items of the same worth (like a purple long) three times. You would then trade those purple longs for the person's black long. In the end, they get the 60 den betas, you get the black long, and they still get to keep their purple longs. If someone is really reluctant or they're making excuses to avoid doing a large trade the safe way, plus they don't want to trade first, they're obviously trying to scam you. If a scammer really did want den betas for their black long and they had the extra items to perform the safe way, they would do it. Otherwise, it is an obvious scam attempt that should be avoided. See if the person is trying to get you to flash trade them. This is one way they can scam you through a scamming glitch or hack. You may think it's harmless if they ask you to flash them real quick, but really, they may have an auto-accept glitch, and all they'd need was to receive a trade from you. People who are unusually keen on trying to get you to trade them in such a way may be scammers or hackers. See if someone tries to lie to you about the worth of your item. If you know what an item is worth, to check if someone is trying to scam you, you can ask them what your item is worth. If they lie about it and say it's completely underneath what it is really worth so that that scammer can obtain the item, it's an obvious scam. This is especially the case when the scammer says it's worth an item that they have. For example, you may not know what a purple long is worth. If you were to ask, a scammer with a neon bow can lie to you and say it's worth a neon bow. If you didn't know the real worth and believed them, you'd accept and get scammed. Be aware what everything is worth before accepting a trade. See if the host of a giveaway buddies you. In most giveaways a person is planning to scam from, they will only buddy the rare people. To test whether someone is a scammer or not, take off all your animals' clothes and all your items off your trade list, or use an empty backup account. If the host tells everyone to buddy them, and they don't accept your buddy request, it's because your account appears unrare and it wouldn't be worth trying to scam you. This is a dead giveaway if a person is in it to scam someone or not, not to actually host a real giveaway.",
  "tyn_model":[
    "necklace",
    "animals",
    "wheel - wheel",
    "founders' hat",
    "animal jam",
    "necklaces",
    "betas"
  ],
  "tyn_section":[

  ]
}