{
  "title":"How to Eat More Spinach",
  "url":"https://www.wikihow.com/Eat-More-Spinach",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Eating Spinach for Breakfast",
      "steps":[
        {
          "headline":"Make a spinach smoothie.",
          "description":"Spinach can be incorporated into smoothies in a number of ways. You could hide a handful among fruits and chocolate powder for a smaller daily dose, or put it front and center in a nutritious green smoothie. For instance, you might put one cup (236 millilitres) of milk, one packed cup (30 grams) of spinach, one packed cup (30 grams) of kale, three ice cubes, three strawberries, one banana, and a spoonful of yogurt into your blender, then blend on high for thirty seconds. Drink your spinach smoothies immediately. The iron in spinach is easier to absorb when consumed along with the vitamin C you’ll get in fruit."
        },
        {
          "headline":"Make a spinach omelet.",
          "description":"Adding spinach to an omelet is easy and the result is delicious. For instance, in a cast-iron pan, sauté a handful of chopped onions in a tablespoon of oil on medium heat. While the onions are cooking, mix two eggs together until they achieve a relatively consistent appearance. Add a handful of spinach to the pan when the onions are translucent. Let the spinach and onions cook another minute. Pour the eggs into the pan. After three or four minutes, sprinkle the eggs with feta, salt, and pepper, to taste. Place the pan in the oven and let it cook until the edges brown. Remove the pan, fold the egg mixture over itself, and serve with catsup or salsa."
        },
        {
          "headline":"Make spinach pancakes.",
          "description":"For a savory breakfast, you could try spinach and ricotta cheese pancakes. To get started, pour about two tablespoons of oil into a pan or onto your griddle. Set the griddle or pan to medium heat. Drain one cup (250 grams) of ricotta or cottage cheese and whisk with a spatula until it is smooth. Add, two egg yolks, one finely-chopped green chili, 1/3 cup (120 grams) rice flour, ¾ teaspoon of chili flakes, and salt, to taste. Mix everything together until it becomes a relatively consistent batter. Spoon about three tablespoons of batter onto your pan or griddle. Cook for about three minutes, then flip and cook the other side for about three minutes, too. If the pancakes aren’t browning, cook them for a bit longer. Squeeze a lime wedge over the pancakes and top with salsa."
        }
      ]
    },
    {
      "name":"Enjoying Spinach in Comfort Foods",
      "steps":[
        {
          "headline":"Try spinach in mac ‘n cheese.",
          "description":"Adding a bit of green spinach in your mac ‘n cheese will make this classic dish even tastier. You could add a few roughly chopped handfuls to a prepackaged mac ‘n cheese when you mix in the powder. But you could also make a delicious spinach mac ‘n cheese from scratch. For instance, cook eight ounces (227 grams) of whole-wheat macaroni noodles. When it’s done, strain but reserve ¾ cup of water. In another pot, melt two tablespoons of butter over medium heat. Add two medium-sized, finely-chopped shallots and cook for about three minutes or until soft. Stir occasionally. Add three cloves of crushed garlic and cook for two minutes. Stir occasionally. Add three tablespoons flour and stir regularly. It will congeal and form a paste. Pour ½ cup (118 milliliters) milk and the pasta water you set aside earlier into the mix. Whisk constantly for four minutes. Add 2/3 cup (158 milliliters) shredded mozzarella, 1/3 cup sour cream, 2/3 cup shredded Swiss cheese, and one tablespoon grated parmesan. After the cheese has melted, add six packed cups of spinach and stir for one minute. Add the pasta, ¼ teaspoon pepper, one teaspoon salt, and nine ounces (255 grams) of roughly chopped artichoke hearts. Stir everything together and pour everything into a two-quart (1.89 liter) baking dish. Top with 1/3 cup (80 milliliters) shredded mozzarella and three tablespoons grated parmesan. Preheat the broiler, then place the dish in the oven for two minutes. Remove and allow to cool. Eat the delicious macaroni ‘n cheese."
        },
        {
          "headline":"Add spinach to quesadillas.",
          "description":"Chop a handful of spinach into fine, thin bits. Add half a cup (eight tablespoons) to your quesadilla before cooking. For instance, you might make a cheesy spinach quesadilla. In a nonstick skillet, mix together three ounces (85 grams) of baby spinach, four chopped green onions, one small chopped tomato, two tablespoons of lemon juice, one teaspoon cumin, and ¼ teaspoon garlic powder. Stir together over medium heat until the spinach wilts. Remove from heat, then add 1 cup (100 grams) of shredded Monterey Jack and ¼ cup (63 grams) ricotta. Stir together until the cheeses start to melt and become gooey. Put a six-inch (15 centimeter) soft flour tortilla shell on a plate. Spoon some of the gooey mixture over the top half of the circular tortilla. Fold the bottom half up over the top half. Place the folded tortilla on a griddle coated with cooking spray. Cook over medium heat for 1.5 minutes. Serve with sour cream."
        },
        {
          "headline":"Make a spinach pizza.",
          "description":"Adding spinach to pizza is a great way to get your daily dose. To get started, preheat your oven to 450 degrees Fahrenheit (232 degrees Celsius). Spray a large pan with cooking spray. Heat on medium high. Add ½ cup (75 grams) of diced onion, and two teaspoons of minced garlic. Cook for three minutes. Stir occasionally. Add spinach and cook for two minutes, until the spinach is wilted and dry. Stir occasionally. Place a 12-inch (30 centimeter) prebaked thin pizza crust on a baking sheet. Spoon ½ cup (115 grams) of tomato sauce over the crust and spread it into an even layer with the back of a large spoon. Alternately, you could skip the tomato sauce and make a “white pizza” by using a light layer of olive oil in place of the sauce. Mix ½ cup (50 grams) shredded mozzarella, ¾ cup (53 grams) shredded ricotta, and ¼ cup (20 grams) grated parmesan in a small bowl. Spread the cheese in an even layer across the surface of the pizza crust. Add the spinach, garlic, and onion mix onto the cheese. Spread everything out across the surface of the pizza in a relatively even layer. Add ½ cup (50 grams) mozzarella across the top in an even layer. Bake for about 15 minutes or until the crust is golden brown. Remove from oven and allow to cool ten minutes. Cut the pizza into eight equally-sized slices. Eat with friends."
        }
      ]
    },
    {
      "name":"Dining for Good Health",
      "steps":[
        {
          "headline":"Make a spinach pasta.",
          "description":"Sautee a cup (150 grams) of peas, a spoonful of diced garlic, and a handful of spinach in two tablespoons of olive oil. Add two cups (105 grams) of cooked macaroni noodles, a squeeze of lemon juice, and salt and pepper, to taste. If you’d like a richer pasta, you could add a ½ cup (115 grams) of creamy alfredo sauce to the mix. Top with shredded cheese or parmesan. Add sliced sausage, to taste."
        },
        {
          "headline":"Make a spinach salad.",
          "description":"A spinach salad might consist of mixed greens – lettuce, arugula, and/or kale – alongside spinach, or it might consist purely of spinach. Add salad toppings that you enjoy and consume. For instance, you might craft your spinach salad with four cups (900 grams) of spinach and top it with one tablespoon of Caesar dressing, ½ cup (15 grams) of croutons, six or seven sliced cucumbers, and four tomato wedges. You can also try adding dried fruit and crumbled feta cheese with a vinegar-based salad dressing."
        },
        {
          "headline":"Try a spinach soup.",
          "description":"Spinach can be added to any soup. Just throw a few handfuls into the soup of your choice, then heat the soup as you normally would. By the time it’s ready, your spinach will be wilted and delicious. Pea and lentil soups complement spinach well. Alternately, you could make a soup specifically intended for spinach content. For example, you might make a lentil spinach soup. Dice one onion and three carrots. Sauté them in a large pot over medium heat for seven minutes. Mince four cloves of garlic and rinse two cups (400 grams) of lentils. You can use green or brown lentils. Put the garlic in the stockpot along with 1.5 teaspoons cumin, one teaspoon smoked paprika, and ¼ teaspoon salt to the stockpot. Sauté for one minute. Add the lentils, one (15-ounce/425-gram) can of diced tomatoes, four cups (946 milliliters) vegetable broth, and three cups (710 milliliters) water to the pot. Bring to a boil, then reduce heat and simmer for 25 minutes. Add five ounces (142 grams) of roughly chopped spinach. Allow to simmer for five more minutes. Allow to cool slightly, then consume with friends."
        }
      ]
    }
  ],
  "text":" Eating Spinach for Breakfast Make a spinach smoothie. Spinach can be incorporated into smoothies in a number of ways. You could hide a handful among fruits and chocolate powder for a smaller daily dose, or put it front and center in a nutritious green smoothie. For instance, you might put one cup (236 millilitres) of milk, one packed cup (30 grams) of spinach, one packed cup (30 grams) of kale, three ice cubes, three strawberries, one banana, and a spoonful of yogurt into your blender, then blend on high for thirty seconds. Drink your spinach smoothies immediately. The iron in spinach is easier to absorb when consumed along with the vitamin C you’ll get in fruit. Make a spinach omelet. Adding spinach to an omelet is easy and the result is delicious. For instance, in a cast-iron pan, sauté a handful of chopped onions in a tablespoon of oil on medium heat. While the onions are cooking, mix two eggs together until they achieve a relatively consistent appearance. Add a handful of spinach to the pan when the onions are translucent. Let the spinach and onions cook another minute. Pour the eggs into the pan. After three or four minutes, sprinkle the eggs with feta, salt, and pepper, to taste. Place the pan in the oven and let it cook until the edges brown. Remove the pan, fold the egg mixture over itself, and serve with catsup or salsa. Make spinach pancakes. For a savory breakfast, you could try spinach and ricotta cheese pancakes. To get started, pour about two tablespoons of oil into a pan or onto your griddle. Set the griddle or pan to medium heat. Drain one cup (250 grams) of ricotta or cottage cheese and whisk with a spatula until it is smooth. Add, two egg yolks, one finely-chopped green chili, 1/3 cup (120 grams) rice flour, ¾ teaspoon of chili flakes, and salt, to taste. Mix everything together until it becomes a relatively consistent batter. Spoon about three tablespoons of batter onto your pan or griddle. Cook for about three minutes, then flip and cook the other side for about three minutes, too. If the pancakes aren’t browning, cook them for a bit longer. Squeeze a lime wedge over the pancakes and top with salsa. Enjoying Spinach in Comfort Foods Try spinach in mac ‘n cheese. Adding a bit of green spinach in your mac ‘n cheese will make this classic dish even tastier. You could add a few roughly chopped handfuls to a prepackaged mac ‘n cheese when you mix in the powder. But you could also make a delicious spinach mac ‘n cheese from scratch. For instance, cook eight ounces (227 grams) of whole-wheat macaroni noodles. When it’s done, strain but reserve ¾ cup of water. In another pot, melt two tablespoons of butter over medium heat. Add two medium-sized, finely-chopped shallots and cook for about three minutes or until soft. Stir occasionally. Add three cloves of crushed garlic and cook for two minutes. Stir occasionally. Add three tablespoons flour and stir regularly. It will congeal and form a paste. Pour ½ cup (118 milliliters) milk and the pasta water you set aside earlier into the mix. Whisk constantly for four minutes. Add 2/3 cup (158 milliliters) shredded mozzarella, 1/3 cup sour cream, 2/3 cup shredded Swiss cheese, and one tablespoon grated parmesan. After the cheese has melted, add six packed cups of spinach and stir for one minute. Add the pasta, ¼ teaspoon pepper, one teaspoon salt, and nine ounces (255 grams) of roughly chopped artichoke hearts. Stir everything together and pour everything into a two-quart (1.89 liter) baking dish. Top with 1/3 cup (80 milliliters) shredded mozzarella and three tablespoons grated parmesan. Preheat the broiler, then place the dish in the oven for two minutes. Remove and allow to cool. Eat the delicious macaroni ‘n cheese. Add spinach to quesadillas. Chop a handful of spinach into fine, thin bits. Add half a cup (eight tablespoons) to your quesadilla before cooking. For instance, you might make a cheesy spinach quesadilla. In a nonstick skillet, mix together three ounces (85 grams) of baby spinach, four chopped green onions, one small chopped tomato, two tablespoons of lemon juice, one teaspoon cumin, and ¼ teaspoon garlic powder. Stir together over medium heat until the spinach wilts. Remove from heat, then add 1 cup (100 grams) of shredded Monterey Jack and ¼ cup (63 grams) ricotta. Stir together until the cheeses start to melt and become gooey. Put a six-inch (15 centimeter) soft flour tortilla shell on a plate. Spoon some of the gooey mixture over the top half of the circular tortilla. Fold the bottom half up over the top half. Place the folded tortilla on a griddle coated with cooking spray. Cook over medium heat for 1.5 minutes. Serve with sour cream. Make a spinach pizza. Adding spinach to pizza is a great way to get your daily dose. To get started, preheat your oven to 450 degrees Fahrenheit (232 degrees Celsius). Spray a large pan with cooking spray. Heat on medium high. Add ½ cup (75 grams) of diced onion, and two teaspoons of minced garlic. Cook for three minutes. Stir occasionally. Add spinach and cook for two minutes, until the spinach is wilted and dry. Stir occasionally. Place a 12-inch (30 centimeter) prebaked thin pizza crust on a baking sheet. Spoon ½ cup (115 grams) of tomato sauce over the crust and spread it into an even layer with the back of a large spoon. Alternately, you could skip the tomato sauce and make a “white pizza” by using a light layer of olive oil in place of the sauce. Mix ½ cup (50 grams) shredded mozzarella, ¾ cup (53 grams) shredded ricotta, and ¼ cup (20 grams) grated parmesan in a small bowl. Spread the cheese in an even layer across the surface of the pizza crust. Add the spinach, garlic, and onion mix onto the cheese. Spread everything out across the surface of the pizza in a relatively even layer. Add ½ cup (50 grams) mozzarella across the top in an even layer. Bake for about 15 minutes or until the crust is golden brown. Remove from oven and allow to cool ten minutes. Cut the pizza into eight equally-sized slices. Eat with friends. Dining for Good Health Make a spinach pasta. Sautee a cup (150 grams) of peas, a spoonful of diced garlic, and a handful of spinach in two tablespoons of olive oil. Add two cups (105 grams) of cooked macaroni noodles, a squeeze of lemon juice, and salt and pepper, to taste. If you’d like a richer pasta, you could add a ½ cup (115 grams) of creamy alfredo sauce to the mix. Top with shredded cheese or parmesan. Add sliced sausage, to taste. Make a spinach salad. A spinach salad might consist of mixed greens – lettuce, arugula, and/or kale – alongside spinach, or it might consist purely of spinach. Add salad toppings that you enjoy and consume. For instance, you might craft your spinach salad with four cups (900 grams) of spinach and top it with one tablespoon of Caesar dressing, ½ cup (15 grams) of croutons, six or seven sliced cucumbers, and four tomato wedges. You can also try adding dried fruit and crumbled feta cheese with a vinegar-based salad dressing. Try a spinach soup. Spinach can be added to any soup. Just throw a few handfuls into the soup of your choice, then heat the soup as you normally would. By the time it’s ready, your spinach will be wilted and delicious. Pea and lentil soups complement spinach well. Alternately, you could make a soup specifically intended for spinach content. For example, you might make a lentil spinach soup. Dice one onion and three carrots. Sauté them in a large pot over medium heat for seven minutes. Mince four cloves of garlic and rinse two cups (400 grams) of lentils. You can use green or brown lentils. Put the garlic in the stockpot along with 1.5 teaspoons cumin, one teaspoon smoked paprika, and ¼ teaspoon salt to the stockpot. Sauté for one minute. Add the lentils, one (15-ounce/425-gram) can of diced tomatoes, four cups (946 milliliters) vegetable broth, and three cups (710 milliliters) water to the pot. Bring to a boil, then reduce heat and simmer for 25 minutes. Add five ounces (142 grams) of roughly chopped spinach. Allow to simmer for five more minutes. Allow to cool slightly, then consume with friends.",
  "tyn_model":[
    "spinach",
    "garlic",
    "salt",
    "oven",
    "griddle",
    "mozzarella",
    "eggs",
    "‘n cheese",
    "parmesan",
    "onion",
    "lentils",
    "milk",
    "kale",
    "onions",
    "oil",
    "pepper",
    "mac ‘n cheese",
    "water",
    "pot",
    "sour cream",
    "tomato",
    "lemon juice",
    "cumin",
    "ricotta",
    "cooking spray",
    "tomato sauce",
    "olive oil",
    "spinach salad",
    "stockpot",
    "spinach smoothie",
    "green smoothie",
    "ice cubes",
    "strawberries",
    "banana",
    "yogurt",
    "blender",
    "cast-iron pan",
    "feta",
    "catsup or salsa",
    "ricotta cheese",
    "pan",
    "ricotta or",
    "cottage cheese",
    "spatula",
    "green chili",
    "rice flour",
    "chili flakes",
    "lime wedge",
    "salsa",
    "whole-wheat macaroni noodles",
    "butter",
    "crushed garlic",
    "flour",
    "pasta water",
    "swiss cheese",
    "grated parmesan",
    "pasta",
    "artichoke hearts",
    "baking dish",
    "broiler",
    "quesadillas",
    "nonstick skillet",
    "baby spinach",
    "green onions",
    "garlic powder",
    "monterey jack",
    "soft flour tortilla",
    "plate",
    "large pan",
    "baking sheet",
    "large spoon",
    "“white",
    "” by",
    "small bowl",
    "spinach pasta",
    "peas",
    "macaroni noodles",
    "salt and pepper",
    "creamy alfredo sauce",
    "shredded cheese",
    "– lettuce",
    "arugula",
    "– alongside",
    "salad toppings",
    "caesar dressing",
    "croutons",
    "cucumbers",
    "feta cheese",
    "vinegar-based salad dressing",
    "spinach soup",
    "carrots",
    "large pot",
    "smoked paprika",
    "diced tomatoes",
    "vegetable broth"
  ],
  "tyn_section":[

  ]
}