{
  "title":"How to Make Spaghetti Squash Casserole",
  "url":"https://www.wikihow.com/Make-Spaghetti-Squash-Casserole",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Squash"
  ],
  "methods":[
    {
      "name":"Cheesy Spinach Spaghetti Squash Casserole",
      "steps":[
        {
          "headline":"Preheat the oven and roast the squash.",
          "description":"Turn the oven on to 400 degrees F (204 C). Carefully cut one 3-pound (1.36 kg) spaghetti squash in half lengthwise. Scoop out the seeds from each half and discard them. Drizzle the spaghetti squash flesh with 1 tablespoon of olive oil and place both halves cut-side down on a baking sheet. Bake the squash for 40 to 50 minutes. The spaghetti squash should be completely tender if you poke it with a fork. Use a rimmed baking sheet to prevent the oil from running off of the sheet as the squash cooks."
        },
        {
          "headline":"Stir together the cheesy spinach filling.",
          "description":"While the spaghetti squash roasts, make the filling. Get out a large bowl and stir together one 15-ounce (425 g) container of ricotta, 1 large egg, 4 cups (900 g) of chopped baby spinach, 1 chopped garlic clove, 1/8 teaspoon of ground nutmeg, 1 teaspoon of salt, and ⅛ teaspoon pepper. Taste the filling and add more salt or pepper according to your taste."
        },
        {
          "headline":"Combine the scraped spaghetti squash with the filling.",
          "description":"Remove the baked spaghetti squash from the oven and use a fork to scrape the spaghetti squash flesh. They should shred into thin strips that you can scoop out. Completely scrape both halves of the spaghetti squash and add the flesh to the bowl of filling. Stir the mixture until it's combined. You may want to wear an oven mitt while holding or handling the hot spaghetti squash."
        },
        {
          "headline":"Sprinkle the casserole with cheese and bake it.",
          "description":"Spoon the spaghetti squash mixture into an 8-inch (20 cm) square baking dish and spread it evenly. Sprinkle the top of the casserole with 2 cups (226 g) of shredded mozzarella cheese and bake it for 18 to 22 minutes. The casserole will be finished when it turns golden brown and bubbles. You should let it cool for a few minutes before dishing it up."
        }
      ]
    },
    {
      "name":"Beef Lasagna Spaghetti Squash Casserole",
      "steps":[
        {
          "headline":"Preheat the oven and roast the squash.",
          "description":"Grease a 2-quart baking dish and turn the oven on to 400 degrees F (204 C). Carefully cut one spaghetti squash in half lengthwise. Scoop out the seeds from each half and discard them. Drizzle the spaghetti squash flesh with 1 tablespoon of olive oil and place both halves cut-side down on a baking sheet. Bake the squash for 40 to 50 minutes. The spaghetti squash should be completely tender if you poke it with a fork."
        },
        {
          "headline":"Scrape and season the spaghetti squash.",
          "description":"Use a fork to scrape the spaghetti squash flesh into a mixing bowl. Add 1/2 teaspoon of dried basil and 1/4 teaspoon of ground thyme to the spaghetti squash. Stir the mixture to incorporate the seasonings. Set the spaghetti squash aside while you prepare the beef filling."
        },
        {
          "headline":"Cook the onion and ground beef.",
          "description":"Heat the remaining tablespoon of olive oil in a large skillet over medium heat. Once the oil shimmers, stir in one onion that's been diced and 2 pounds (907 g) of ground beef. Season the onion and beef with 1/2 teaspoon of kosher salt and cook it until the meat is completely browned, about 8 to 10 minutes. Stir the beef and onion frequently to prevent it from sticking to the pan. If the ground beef is greasy, consider draining the grease from the pan before using the meat in the casserole."
        },
        {
          "headline":"Stir in garlic and marinara sauce.",
          "description":"Stir 2 cloves of minced garlic and 1 1/2 cups (35 g) of marinara sauce into the sauteed beef and onion mixture. Cook the mixture for another minute over medium heat. You can use your favorite spaghetti sauce in this recipe or use a homemade marinara sauce."
        },
        {
          "headline":"Layer the spaghetti squash with the meet sauce and cheese.",
          "description":"Spread half of the seasoned spaghetti squash in the prepared baking dish. Spoon half of the meat sauce over the squash and sprinkle 3/4 cup (84 g) of shredded mozzarella cheese over the sauce. Spread the remaining spaghetti squash over the cheese and top that with the remaining meat sauce. Ensure that the sides of your baking dish are well greased so the casserole doesn't stick as it bakes."
        },
        {
          "headline":"Mix together a breadcrumb topping.",
          "description":"Get out a small bowl and combine 1/4 cup (25 g) of grated Parmesan cheese with 1/4 cup (25 g) of panko breadcrumbs. This will give the casserole a little extra crunch and creamy flavor. If you don't have panko breadcrumbs, you can use traditional breadcrumbs."
        },
        {
          "headline":"Sprinkle the casserole with the breadcrumb topping and bake it.",
          "description":"Turn the oven temperature down to 375 degrees F (190 C). Sprinkle the cheesy breadcrumb topping evenly over the top of the casserole. Cover the casserole with a sheet of aluminum foil and bake it for 20 minutes. Remove the foil and bake it for another 10 minutes. The casserole should be golden and bubbly. For a little extra spice, consider sprinkling red pepper flakes over the casserole."
        }
      ]
    },
    {
      "name":"Healthy Turkey Spaghetti Squash Casserole",
      "steps":[
        {
          "headline":"Preheat the oven and roast the squash.",
          "description":"Grease a 2-quart baking dish and turn the oven on to 400 degrees F (204 C). Carefully cut one spaghetti squash in half lengthwise. Scoop out the seeds from each half and discard them. Drizzle the spaghetti squash flesh with 1 tablespoon of olive oil and place both halves cut-side down on a baking sheet. Bake the squash for 40 to 50 minutes. The spaghetti squash should be completely tender if you poke it with a fork."
        },
        {
          "headline":"Saute the turkey and vegetables.",
          "description":"Heat 2 teaspoons of extra virgin olive oil in a large skillet over medium heat. Once the oil shimmers, add 1 pound (453 g) of lean ground turkey, 1 small diced red onion, 1 diced green bell pepper, 1 teaspoon of kosher salt and 1/2 teaspoon of black pepper. Stir and cook the turkey and vegetables until the meat is completely cooked. It should take about 8 minutes for the turkey to cook and the vegetables to soften."
        },
        {
          "headline":"Stir in tomatoes and seasonings.",
          "description":"Drain one 14.5-ounce (411 g) can of diced tomatoes with Italian spices and add the tomatoes to the meat mixture. You should also stir in 3 cloves of minced garlic, 1 teaspoon of Italian seasonings (like oregano, basil, and thyme), and 1/2 teaspoon of crushed red pepper flakes. Cook the mixture for about 4 minutes or until most of the liquid evaporates. You can use a combination Italian seasoning or just combine your favorite individual seasonings to equal 1 teaspoon."
        },
        {
          "headline":"Scrape and add the squash flesh.",
          "description":"Use a fork to scrape the cooked flesh of the spaghetti squash. Scoop the strands of squash into the turkey and vegetable mixture. Keep cooking it over medium heat for another minute or two. This will cook away any excess liquid. It's important to cook off the liquid in the casserole mixture before you bake it to prevent the casserole from becoming watery and soggy."
        },
        {
          "headline":"Add cheese and prepare the pan.",
          "description":"Turn the oven temperature down to 350 degrees F (176 C). Grease or spray an 8-inch (20 cm) square baking dish to prevent sticking. Stir 1/2 cup (56 g) of the grated part-skim mozzarella or provolone cheese into the turkey and spaghetti squash mixture. Don't worry if there's a little liquid still left in the mixture. Some of it should cook out as the casserole bakes."
        },
        {
          "headline":"Bake the healthy turkey spaghetti squash casserole.",
          "description":"Spoon the turkey and spaghetti squash mixture into the prepared pan. Bake the casserole for 20 minutes and then take it out of the oven. Sprinkle the remaining 1/2 cup (56 g) of the grated part-skim mozzarella or provolone cheese over the top and put the casserole back in the oven. Bake it for another 5 to 10 minutes. Remove the casserole and serve it with chopped parsley or basil as a garnish. If you want a crispy top, turn the broiler on to HI and place the cooked casserole below it for a couple of minutes."
        }
      ]
    }
  ],
  "text":" Cheesy Spinach Spaghetti Squash Casserole Preheat the oven and roast the squash. Turn the oven on to 400 degrees F (204 C). Carefully cut one 3-pound (1.36 kg) spaghetti squash in half lengthwise. Scoop out the seeds from each half and discard them. Drizzle the spaghetti squash flesh with 1 tablespoon of olive oil and place both halves cut-side down on a baking sheet. Bake the squash for 40 to 50 minutes. The spaghetti squash should be completely tender if you poke it with a fork. Use a rimmed baking sheet to prevent the oil from running off of the sheet as the squash cooks. Stir together the cheesy spinach filling. While the spaghetti squash roasts, make the filling. Get out a large bowl and stir together one 15-ounce (425 g) container of ricotta, 1 large egg, 4 cups (900 g) of chopped baby spinach, 1 chopped garlic clove, 1/8 teaspoon of ground nutmeg, 1 teaspoon of salt, and ⅛ teaspoon pepper. Taste the filling and add more salt or pepper according to your taste. Combine the scraped spaghetti squash with the filling. Remove the baked spaghetti squash from the oven and use a fork to scrape the spaghetti squash flesh. They should shred into thin strips that you can scoop out. Completely scrape both halves of the spaghetti squash and add the flesh to the bowl of filling. Stir the mixture until it's combined. You may want to wear an oven mitt while holding or handling the hot spaghetti squash. Sprinkle the casserole with cheese and bake it. Spoon the spaghetti squash mixture into an 8-inch (20 cm) square baking dish and spread it evenly. Sprinkle the top of the casserole with 2 cups (226 g) of shredded mozzarella cheese and bake it for 18 to 22 minutes. The casserole will be finished when it turns golden brown and bubbles. You should let it cool for a few minutes before dishing it up. Beef Lasagna Spaghetti Squash Casserole Preheat the oven and roast the squash. Grease a 2-quart baking dish and turn the oven on to 400 degrees F (204 C). Carefully cut one spaghetti squash in half lengthwise. Scoop out the seeds from each half and discard them. Drizzle the spaghetti squash flesh with 1 tablespoon of olive oil and place both halves cut-side down on a baking sheet. Bake the squash for 40 to 50 minutes. The spaghetti squash should be completely tender if you poke it with a fork. Scrape and season the spaghetti squash. Use a fork to scrape the spaghetti squash flesh into a mixing bowl. Add 1/2 teaspoon of dried basil and 1/4 teaspoon of ground thyme to the spaghetti squash. Stir the mixture to incorporate the seasonings. Set the spaghetti squash aside while you prepare the beef filling. Cook the onion and ground beef. Heat the remaining tablespoon of olive oil in a large skillet over medium heat. Once the oil shimmers, stir in one onion that's been diced and 2 pounds (907 g) of ground beef. Season the onion and beef with 1/2 teaspoon of kosher salt and cook it until the meat is completely browned, about 8 to 10 minutes. Stir the beef and onion frequently to prevent it from sticking to the pan. If the ground beef is greasy, consider draining the grease from the pan before using the meat in the casserole. Stir in garlic and marinara sauce. Stir 2 cloves of minced garlic and 1 1/2 cups (35 g) of marinara sauce into the sauteed beef and onion mixture. Cook the mixture for another minute over medium heat. You can use your favorite spaghetti sauce in this recipe or use a homemade marinara sauce. Layer the spaghetti squash with the meet sauce and cheese. Spread half of the seasoned spaghetti squash in the prepared baking dish. Spoon half of the meat sauce over the squash and sprinkle 3/4 cup (84 g) of shredded mozzarella cheese over the sauce. Spread the remaining spaghetti squash over the cheese and top that with the remaining meat sauce. Ensure that the sides of your baking dish are well greased so the casserole doesn't stick as it bakes. Mix together a breadcrumb topping. Get out a small bowl and combine 1/4 cup (25 g) of grated Parmesan cheese with 1/4 cup (25 g) of panko breadcrumbs. This will give the casserole a little extra crunch and creamy flavor. If you don't have panko breadcrumbs, you can use traditional breadcrumbs. Sprinkle the casserole with the breadcrumb topping and bake it. Turn the oven temperature down to 375 degrees F (190 C). Sprinkle the cheesy breadcrumb topping evenly over the top of the casserole. Cover the casserole with a sheet of aluminum foil and bake it for 20 minutes. Remove the foil and bake it for another 10 minutes. The casserole should be golden and bubbly. For a little extra spice, consider sprinkling red pepper flakes over the casserole. Healthy Turkey Spaghetti Squash Casserole Preheat the oven and roast the squash. Grease a 2-quart baking dish and turn the oven on to 400 degrees F (204 C). Carefully cut one spaghetti squash in half lengthwise. Scoop out the seeds from each half and discard them. Drizzle the spaghetti squash flesh with 1 tablespoon of olive oil and place both halves cut-side down on a baking sheet. Bake the squash for 40 to 50 minutes. The spaghetti squash should be completely tender if you poke it with a fork. Saute the turkey and vegetables. Heat 2 teaspoons of extra virgin olive oil in a large skillet over medium heat. Once the oil shimmers, add 1 pound (453 g) of lean ground turkey, 1 small diced red onion, 1 diced green bell pepper, 1 teaspoon of kosher salt and 1/2 teaspoon of black pepper. Stir and cook the turkey and vegetables until the meat is completely cooked. It should take about 8 minutes for the turkey to cook and the vegetables to soften. Stir in tomatoes and seasonings. Drain one 14.5-ounce (411 g) can of diced tomatoes with Italian spices and add the tomatoes to the meat mixture. You should also stir in 3 cloves of minced garlic, 1 teaspoon of Italian seasonings (like oregano, basil, and thyme), and 1/2 teaspoon of crushed red pepper flakes. Cook the mixture for about 4 minutes or until most of the liquid evaporates. You can use a combination Italian seasoning or just combine your favorite individual seasonings to equal 1 teaspoon. Scrape and add the squash flesh. Use a fork to scrape the cooked flesh of the spaghetti squash. Scoop the strands of squash into the turkey and vegetable mixture. Keep cooking it over medium heat for another minute or two. This will cook away any excess liquid. It's important to cook off the liquid in the casserole mixture before you bake it to prevent the casserole from becoming watery and soggy. Add cheese and prepare the pan. Turn the oven temperature down to 350 degrees F (176 C). Grease or spray an 8-inch (20 cm) square baking dish to prevent sticking. Stir 1/2 cup (56 g) of the grated part-skim mozzarella or provolone cheese into the turkey and spaghetti squash mixture. Don't worry if there's a little liquid still left in the mixture. Some of it should cook out as the casserole bakes. Bake the healthy turkey spaghetti squash casserole. Spoon the turkey and spaghetti squash mixture into the prepared pan. Bake the casserole for 20 minutes and then take it out of the oven. Sprinkle the remaining 1/2 cup (56 g) of the grated part-skim mozzarella or provolone cheese over the top and put the casserole back in the oven. Bake it for another 5 to 10 minutes. Remove the casserole and serve it with chopped parsley or basil as a garnish. If you want a crispy top, turn the broiler on to HI and place the cooked casserole below it for a couple of minutes.",
  "tyn_model":[
    "spaghetti squash",
    "oven",
    "fork",
    "turkey",
    "onion",
    "olive oil",
    "baking sheet",
    "garlic",
    "baking dish",
    "cheese",
    "ground beef",
    "marinara sauce",
    "vegetables",
    "cheesy spinach",
    "mozzarella cheese",
    "2-quart baking dish",
    "basil",
    "large skillet",
    "kosher salt",
    "beef",
    "meat sauce",
    "breadcrumb topping",
    "tomatoes",
    "seasonings",
    "provolone cheese",
    "large bowl",
    "ricotta",
    "egg",
    "baby spinach",
    "nutmeg",
    "salt",
    "⅛ teaspoon",
    "pepper",
    "salt or pepper",
    "bowl",
    "oven mitt",
    "mixing bowl",
    "ground thyme",
    "spaghetti sauce",
    "small bowl",
    "parmesan cheese",
    "panko breadcrumbs",
    "cheesy breadcrumb topping",
    "aluminum foil",
    "foil",
    "red pepper",
    "extra virgin olive oil",
    "ground turkey",
    "red onion",
    "green bell pepper",
    "black pepper",
    "diced tomatoes",
    "italian spices",
    "italian seasonings",
    "crushed red pepper",
    "italian seasoning",
    "squash",
    "vegetable",
    "broiler"
  ],
  "tyn_section":[

  ]
}