{
  "title":"How to Change the Dates on Images on Flickr",
  "url":"https://www.wikihow.com/Change-the-Dates-on-Images-on-Flickr",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Log onto your Flickr account.",
          "description":""
        },
        {
          "headline":"Go to the You option at the top of your screen and then select Organize.",
          "description":""
        },
        {
          "headline":"In the Organizer, locate the images that you want to redate.",
          "description":"You can do this a few ways:\nHave a folder where you keep them until their dates are fixed. Know the date that they were taken on and locate them that way. Search through your images, one by one."
        },
        {
          "headline":"Select them and add them to the window for editing.",
          "description":""
        },
        {
          "headline":"Choose Edit Date >> Change all to same day.",
          "description":""
        },
        {
          "headline":"Decide if you want the approximate (month and year) or exact (down to the second) date.",
          "description":""
        },
        {
          "headline":"Change your date.",
          "description":""
        },
        {
          "headline":"Continue with your organization.",
          "description":""
        }
      ]
    },
    {
      "name":"Alternate Method to Date Images",
      "steps":[
        {
          "headline":"In Organizer, double click on the image that you want to edit.",
          "description":""
        },
        {
          "headline":"Go to the Dates tab.",
          "description":"Choose the preferred method of dating. You can choose Some Time In..., Circa, or an actual month."
        }
      ]
    }
  ],
  "text":" Steps Log onto your Flickr account.  Go to the You option at the top of your screen and then select Organize.  In the Organizer, locate the images that you want to redate. You can do this a few ways:\nHave a folder where you keep them until their dates are fixed. Know the date that they were taken on and locate them that way. Search through your images, one by one. Select them and add them to the window for editing.  Choose Edit Date >> Change all to same day.  Decide if you want the approximate (month and year) or exact (down to the second) date.  Change your date.  Continue with your organization.  Alternate Method to Date Images In Organizer, double click on the image that you want to edit.  Go to the Dates tab. Choose the preferred method of dating. You can choose Some Time In..., Circa, or an actual month.",
  "tyn_model":[
    "flickr",
    "organizer"
  ],
  "tyn_section":[

  ]
}