{
  "title":"How to Select Blooming Houseplants",
  "url":"https://www.wikihow.com/Select-Blooming-Houseplants",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "methods":[
    {
      "name":"Choosing Plants Based on Indoor Light",
      "steps":[
        {
          "headline":"Go for African violets for areas with bright light.",
          "description":"African violets are easy to grow and bloom year-round. They come in many different varieties, blooming in different shades, often with white-edges on each bloom. They do well in filtered sunlight, such as by a window that gets direct sunlight. Put a sheer curtain up so the houseplant gets just enough light. If you have a bright window spot available, this is the plant for you. It will bloom constantly and produce colorful blooms to brighten up any room. You should water African violets when the soil feels less moist with tepid water. Water these houseplants at the base and do not get any water on their leaves."
        },
        {
          "headline":"Try hydrangeas for low light areas.",
          "description":"Hydrangeas do well in cooler conditions, such as a room with no direct sunlight but some bright light. They enjoy sitting in soil that is not too dry and require watering on a regular basis. They produce beautiful purple and blue blooms. They can also be put outside in the summer to bloom and kept indoors during winter to keep them away from frost."
        },
        {
          "headline":"Choose chrysanthemums for areas with bright light.",
          "description":"Chrysanthemums thrive in brightly lit areas, such as a room that gets direct sunlight. They come in a variety of colors and produce large blooms as long as they get enough direct sunlight on a constant basis. You will need to water chrysanthemums on a regular basis to ensure the soil is moist. You will also need to mist the leaves from time to time."
        },
        {
          "headline":"Go for azaleas if your home has bright light.",
          "description":"Azaleas do well in bright light, but not direct sunlight. Go for these plants if your home has a brightly lit room that is not too warm, as they do better in cooler conditions. A window that gets bright light would be ideal for azaleas. These plants can bloom for three to four weeks at a time. Azaleas require constant water checks to make sure the potting soil does not become too dry. Water the plant until water flows out of the bottom of the pot and get rid of the excess water."
        },
        {
          "headline":"Try a peace lily for low lit areas.",
          "description":"The peace lily is easy to care for and does well in low light. A spot in a room with less light and low humidity is ideal for this plant. The blooms are cream white and spoon-shaped. This bloom will appear heaviest in the summer months. This plant is easy to grow indoors and only needs moist soil to thrive. Keep in mind peace lilies can be toxic to children or pets if chewed or ingested."
        }
      ]
    },
    {
      "name":"Selecting Plants Based on Lifespan",
      "steps":[
        {
          "headline":"Try poinsettias for short term houseplants.",
          "description":"Poinsettias are ideal for short term houseplants that will bloom for two to six months. After the blooms fall off, they are often thrown away or used as foliage plants in an outdoor garden. They are popular during Christmas time but also make a lovely indoor houseplant for a sunny spot in your home. Poinsettias do well in warm conditions and need thorough watering on a regular basis."
        },
        {
          "headline":"Get hibiscus for a long lasting houseplant.",
          "description":"Hibiscus are tropical plants that make great additions to a warm, bright room. They produce large blooms, up to 8 inches in diameter and require lots of indoor light to bloom well. Hibiscus come in annual and perennial types. You will need to keep the soil moist with regular watering for the hibiscus to thrive."
        },
        {
          "headline":"Choose a flowering maple for consistent blooms.",
          "description":"Flowering maples have red, pink, yellow, or orange blooms that dangle from the branch. They can be grown as a tree, upright, with minimal pruning, or in a hanging basket. They do well in brightly lit areas and bloom on a constant basis. Flowering maples are perennials. If you notice the blooms starting to drop on the flowering maple, it may not be getting enough water."
        },
        {
          "headline":"Go for an anthurium for long lasting blooms.",
          "description":"Anthuriums can bloom for two months or more and are known to be hardy perennial plants. They produce blooms in pink, red, lavender, and white. You can also cut off the blooms and use them as indoor decoration. These plants need medium to bright light to thrive. They will survive in areas with less light but produce less blooms. Keep in mind anthuriums are poisonous if chewed or eaten by children or pets. Do not keep them indoors if you have pets or children in your home."
        }
      ]
    },
    {
      "name":"Shopping for Blooming Houseplants",
      "steps":[
        {
          "headline":"Check the leaves and foliage for any spots or yellow coloring.",
          "description":"Start by examining underneath the foliage, the leaves, and the stems of any brown or yellow spots. Note if the leaves look healthy, with green bright coloring. If the plants have yellow or brown leaves, wilted leaves, or spots on them, they are likely not very healthy. Avoid plants with leaves that look overly shiny or polished, as they may have been treated with chemicals or fertilizer."
        },
        {
          "headline":"Go for plants with new flowers or leaf buds.",
          "description":"Examine the selection at the grower and opt for plants that have buds or new young flowers. They are often healthier and better quality. They will also often bloom better and have more vibrant blooms."
        },
        {
          "headline":"Look for any signs of pests or disease.",
          "description":"You should also examine the plants for any signs of pest, such as pests crawling all over the plants or leaves that have bite marks or holes in them. You do not want to bring a plant with pests or disease into your home, as it may infect your other plants and kill them off. Make sure the plants look clean and well potted. They should look healthy in their pot when you buy them."
        },
        {
          "headline":"Discuss the maintenance of the houseplant with the grower.",
          "description":"If you are buying the houseplants from a grower at a nursery, talk to them about maintaining the plants indoors. Ask them for advice on watering the plants, giving the plants fertilizer, and making sure the plants bloom well. You should also talk to them about warning signs of declining health in the plants so you can nurse the plants back to health if needed. For example, you may ask the grower, “How often should I water the plants?” “What would be the best spot in my home for these plants?” and “What are the signs of disease or decline in these plants?”"
        },
        {
          "headline":"Opt for low maintenance plants.",
          "description":"If you do not have a lot of time to care for the houseplant, you may go for plants that will require only minimal care. Ask the grower about houseplants that will be easy to care for and require very little watering or attention. For example, an anthurium or a peace lily may be a good option for a low maintenance blooming houseplant. You should also avoid houseplants that are poisonous when chewed or swallowed if you have children and pets at home. You can ask the grower for recommendations on this as well."
        }
      ]
    }
  ],
  "text":" Choosing Plants Based on Indoor Light Go for African violets for areas with bright light. African violets are easy to grow and bloom year-round. They come in many different varieties, blooming in different shades, often with white-edges on each bloom. They do well in filtered sunlight, such as by a window that gets direct sunlight. Put a sheer curtain up so the houseplant gets just enough light. If you have a bright window spot available, this is the plant for you. It will bloom constantly and produce colorful blooms to brighten up any room. You should water African violets when the soil feels less moist with tepid water. Water these houseplants at the base and do not get any water on their leaves. Try hydrangeas for low light areas. Hydrangeas do well in cooler conditions, such as a room with no direct sunlight but some bright light. They enjoy sitting in soil that is not too dry and require watering on a regular basis. They produce beautiful purple and blue blooms. They can also be put outside in the summer to bloom and kept indoors during winter to keep them away from frost. Choose chrysanthemums for areas with bright light. Chrysanthemums thrive in brightly lit areas, such as a room that gets direct sunlight. They come in a variety of colors and produce large blooms as long as they get enough direct sunlight on a constant basis. You will need to water chrysanthemums on a regular basis to ensure the soil is moist. You will also need to mist the leaves from time to time. Go for azaleas if your home has bright light. Azaleas do well in bright light, but not direct sunlight. Go for these plants if your home has a brightly lit room that is not too warm, as they do better in cooler conditions. A window that gets bright light would be ideal for azaleas. These plants can bloom for three to four weeks at a time. Azaleas require constant water checks to make sure the potting soil does not become too dry. Water the plant until water flows out of the bottom of the pot and get rid of the excess water. Try a peace lily for low lit areas. The peace lily is easy to care for and does well in low light. A spot in a room with less light and low humidity is ideal for this plant. The blooms are cream white and spoon-shaped. This bloom will appear heaviest in the summer months. This plant is easy to grow indoors and only needs moist soil to thrive. Keep in mind peace lilies can be toxic to children or pets if chewed or ingested. Selecting Plants Based on Lifespan Try poinsettias for short term houseplants. Poinsettias are ideal for short term houseplants that will bloom for two to six months. After the blooms fall off, they are often thrown away or used as foliage plants in an outdoor garden. They are popular during Christmas time but also make a lovely indoor houseplant for a sunny spot in your home. Poinsettias do well in warm conditions and need thorough watering on a regular basis. Get hibiscus for a long lasting houseplant. Hibiscus are tropical plants that make great additions to a warm, bright room. They produce large blooms, up to 8 inches in diameter and require lots of indoor light to bloom well. Hibiscus come in annual and perennial types. You will need to keep the soil moist with regular watering for the hibiscus to thrive. Choose a flowering maple for consistent blooms. Flowering maples have red, pink, yellow, or orange blooms that dangle from the branch. They can be grown as a tree, upright, with minimal pruning, or in a hanging basket. They do well in brightly lit areas and bloom on a constant basis. Flowering maples are perennials. If you notice the blooms starting to drop on the flowering maple, it may not be getting enough water. Go for an anthurium for long lasting blooms. Anthuriums can bloom for two months or more and are known to be hardy perennial plants. They produce blooms in pink, red, lavender, and white. You can also cut off the blooms and use them as indoor decoration. These plants need medium to bright light to thrive. They will survive in areas with less light but produce less blooms. Keep in mind anthuriums are poisonous if chewed or eaten by children or pets. Do not keep them indoors if you have pets or children in your home. Shopping for Blooming Houseplants Check the leaves and foliage for any spots or yellow coloring. Start by examining underneath the foliage, the leaves, and the stems of any brown or yellow spots. Note if the leaves look healthy, with green bright coloring. If the plants have yellow or brown leaves, wilted leaves, or spots on them, they are likely not very healthy. Avoid plants with leaves that look overly shiny or polished, as they may have been treated with chemicals or fertilizer. Go for plants with new flowers or leaf buds. Examine the selection at the grower and opt for plants that have buds or new young flowers. They are often healthier and better quality. They will also often bloom better and have more vibrant blooms. Look for any signs of pests or disease. You should also examine the plants for any signs of pest, such as pests crawling all over the plants or leaves that have bite marks or holes in them. You do not want to bring a plant with pests or disease into your home, as it may infect your other plants and kill them off. Make sure the plants look clean and well potted. They should look healthy in their pot when you buy them. Discuss the maintenance of the houseplant with the grower. If you are buying the houseplants from a grower at a nursery, talk to them about maintaining the plants indoors. Ask them for advice on watering the plants, giving the plants fertilizer, and making sure the plants bloom well. You should also talk to them about warning signs of declining health in the plants so you can nurse the plants back to health if needed. For example, you may ask the grower, “How often should I water the plants?” “What would be the best spot in my home for these plants?” and “What are the signs of disease or decline in these plants?” Opt for low maintenance plants. If you do not have a lot of time to care for the houseplant, you may go for plants that will require only minimal care. Ask the grower about houseplants that will be easy to care for and require very little watering or attention. For example, an anthurium or a peace lily may be a good option for a low maintenance blooming houseplant. You should also avoid houseplants that are poisonous when chewed or swallowed if you have children and pets at home. You can ask the grower for recommendations on this as well.",
  "tyn_model":[
    "water",
    "hibiscus",
    "plants",
    "chrysanthemums",
    "azaleas",
    "peace lily",
    "poinsettias",
    "violets",
    "hydrangeas",
    "anthurium",
    "african violets",
    "potting soil",
    "pot",
    "lilies",
    "flowering maple",
    "maple",
    "anthuriums",
    "fertilizer",
    "“how",
    "” “",
    "” and",
    "“what",
    "” opt"
  ],
  "tyn_section":[

  ]
}