{
  "title":"How to Play Sock Wrestling",
  "url":"https://www.wikihow.com/Play-Sock-Wrestling",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Games for Children"
  ],
  "steps":[
    {
      "headline":"Find a suitable carpeted space.",
      "description":"It must be comfortable as players will be wrestling on the floor to get at one another's socks."
    },
    {
      "headline":"Check that all players have socks.",
      "description":"Those without socks will need to borrow clean socks from the host. You will need to pull your socks halfway off your foot to make it easier or have them pulled right up."
    },
    {
      "headline":"Pair off the players.",
      "description":"Have players choose a spot that gives each pair plenty of space to wrestle in."
    },
    {
      "headline":"Have the players count aloud together one, two, three.",
      "description":"At the count of three, each player starts trying to remove the other player's sock in their pair."
    },
    {
      "headline":"Keep an eye on the play.",
      "description":"If anybody gets too rough, caution them."
    },
    {
      "headline":"Declare the winner.",
      "description":"The winner can be the first person who gets the other person's socks off. If you're keen for a tournament, however, you could declare each winner from each pair and then continue to have them wrestle one another until a clear outright sock wrestler champion is found!"
    },
    {
      "headline":"Play another round!",
      "description":""
    }
  ],
  "text":" Find a suitable carpeted space. It must be comfortable as players will be wrestling on the floor to get at one another's socks. Check that all players have socks. Those without socks will need to borrow clean socks from the host. You will need to pull your socks halfway off your foot to make it easier or have them pulled right up. Pair off the players. Have players choose a spot that gives each pair plenty of space to wrestle in. Have the players count aloud together one, two, three. At the count of three, each player starts trying to remove the other player's sock in their pair. Keep an eye on the play. If anybody gets too rough, caution them. Declare the winner. The winner can be the first person who gets the other person's socks off. If you're keen for a tournament, however, you could declare each winner from each pair and then continue to have them wrestle one another until a clear outright sock wrestler champion is found! Play another round! ",
  "tyn_model":[
    "socks",
    "sock"
  ],
  "tyn_section":[

  ]
}