{
  "title":"How to Use Leftover Roast",
  "url":"https://www.wikihow.com/Use-Leftover-Roast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "methods":[
    {
      "name":"Making Light Meals Or Sides With Leftover Roast",
      "steps":[
        {
          "headline":"Make beef broth.",
          "description":"You can make a rich beef broth to have on its own or use the broth as a base for soups and stews. To make the broth, just saute large pieces of the leftover roast beef along with one diced onion. Once the onion is soft, add enough water to cover the meat. Bring this to a light boil and keep cooking until the water darkens. Taste the broth every once in a while to see when it's finished cooking. Once the broth tastes robust, turn off the heat and strain and serve it or use it in your recipe."
        },
        {
          "headline":"Turn it into white gravy.",
          "description":"Heat a little oil or the roast drippings in a saucepan and stir in a little flour to make a roux. Whisk in milk and keep whisking until the gravy thickens. Dice some of the leftover roast and add it to the gravy. Taste it and add salt and pepper until it suits your tastes. Serve this white gravy with fried chicken or biscuits. It makes a great breakfast or simple supper."
        },
        {
          "headline":"Toss together a roast beef salad.",
          "description":"If you're trying to eat a little healthier after a large roast, make a salad. Mix up your favorite salad and add leftover roast that you've cut into strips. For example, you could use the roast in a Nicoise salad, in a Cobb salad, or in a Thai salad. Add the meat cold or reheat it slightly so it's warm. Leftover roast is great in salads with strong flavors. Choose rich dressings or cheese to go with the meat. Try Caesar dressing and Parmesan or blue cheese."
        },
        {
          "headline":"Fry up a quick hash.",
          "description":"For a light meal or filling breakfast, dice potatoes, onion, and the leftover roast. Fry the potatoes in a little oil until they soften. Add the diced onion and roast. Continue to fry the hash until the potatoes are crispy, the onions are cooked, and the roast has heated up. Serve the hash with a little hot sauce or steak sauce. Season the hash with salt, pepper, or your favorite herb blends."
        },
        {
          "headline":"Add roast to a quiche or frittata.",
          "description":"Dice strips of the roast into small pieces and add them to your favorite quiche or frittata recipe. Consider adding chopped, cooked asparagus and Parmesan cheese for an even richer dish. Cook the quiche or frittata according to the recipe instructions. You don't need to reheat the roast before adding it to the quiche or frittata since the whole thing will bake in the oven."
        }
      ]
    },
    {
      "name":"Making Main Dishes With Leftover Roast",
      "steps":[
        {
          "headline":"Create your own casserole.",
          "description":"A filling casserole is a great way to use up a roasts and any leftover vegetables you may have in your fridge. Cook a simple sauce or use leftover gravy as a base for the casserole. Cut up leftover roast and stir it into the sauce along with cooked vegetables and pasta. Bake the casserole until it's hot and bubbly. If you'd like to base your casserole off of a recipe, try stroganoff. Toss together mushrooms, leftover roast, onions, sour cream and noodles. Bake the stroganoff and serve it with crusty bread."
        },
        {
          "headline":"Cook up a curry.",
          "description":"Heat a simmer sauce or make your favorite curry and stir in diced roast. You can also add coconut milk, bamboo shoots, and vegetables to round out the curry. Potatoes, eggplant, carrots, and carrots work well with leftover roast. Serve the curry along with one of these sides:\nJasmine rice\nNaan\nQuinoa\nBulgar"
        },
        {
          "headline":"Heat up a stir fry.",
          "description":"Assemble your favorite stir fry vegetables (like snow peas, snap peas, carrot strips, bell peppers, or bok choy). Saute the vegetables in a little oil until they soften. Stir in strips of leftover roast and cook them over high heat until they heat up. Season the stir fry with:\nSoy sauce\nHoney\nLemon juice\nCooking sherry"
        },
        {
          "headline":"Use the roast in burritos.",
          "description":"Shred the leftover roast using two forks. Heat the meat in a skillet or in the oven and season the meat with taco seasoning. Combine the meat with strips of bell pepper and onion. Cook the burrito filling until the vegetables soften. Fill flour tortillas with the meat and vegetable filling and roll the tortillas into burritos. You can serve the burritos after you roll them or heat the rolled burritos in the skillet to crisp them up."
        },
        {
          "headline":"Simmer the meat in a chili.",
          "description":"Chili is a great way to use up leftover roast if you don't have a lot of meat. Combine chunks of the leftover roast in a large sauce pot and add cans of diced tomatoes and beans. Simmer the chili mixture along with tomato sauce and chili seasonings. If you'd like to make a stew, just chunk up the leftover roast and simmer it with your choice of vegetables in a beef broth or stock. You can thicken the stew with a cornstarch and water."
        },
        {
          "headline":"Make sandwiches with the roast.",
          "description":"For a quick sandwich, place slices of the cold roast on your favorite bread with your favorite condiments. You could also make a hot sandwich by quickly frying strips of the leftover roast and placing it on your favorite bread. Lay a piece of cheese and sauteed onions over the meat and warm the entire sandwich in the oven until the cheese melts. Consider making these sandwiches with leftover roast:\nFrench dip\nSloppy joes\nSteak sandwiches"
        }
      ]
    }
  ],
  "text":" Making Light Meals Or Sides With Leftover Roast Make beef broth. You can make a rich beef broth to have on its own or use the broth as a base for soups and stews. To make the broth, just saute large pieces of the leftover roast beef along with one diced onion. Once the onion is soft, add enough water to cover the meat. Bring this to a light boil and keep cooking until the water darkens. Taste the broth every once in a while to see when it's finished cooking. Once the broth tastes robust, turn off the heat and strain and serve it or use it in your recipe. Turn it into white gravy. Heat a little oil or the roast drippings in a saucepan and stir in a little flour to make a roux. Whisk in milk and keep whisking until the gravy thickens. Dice some of the leftover roast and add it to the gravy. Taste it and add salt and pepper until it suits your tastes. Serve this white gravy with fried chicken or biscuits. It makes a great breakfast or simple supper. Toss together a roast beef salad. If you're trying to eat a little healthier after a large roast, make a salad. Mix up your favorite salad and add leftover roast that you've cut into strips. For example, you could use the roast in a Nicoise salad, in a Cobb salad, or in a Thai salad. Add the meat cold or reheat it slightly so it's warm. Leftover roast is great in salads with strong flavors. Choose rich dressings or cheese to go with the meat. Try Caesar dressing and Parmesan or blue cheese. Fry up a quick hash. For a light meal or filling breakfast, dice potatoes, onion, and the leftover roast. Fry the potatoes in a little oil until they soften. Add the diced onion and roast. Continue to fry the hash until the potatoes are crispy, the onions are cooked, and the roast has heated up. Serve the hash with a little hot sauce or steak sauce. Season the hash with salt, pepper, or your favorite herb blends. Add roast to a quiche or frittata. Dice strips of the roast into small pieces and add them to your favorite quiche or frittata recipe. Consider adding chopped, cooked asparagus and Parmesan cheese for an even richer dish. Cook the quiche or frittata according to the recipe instructions. You don't need to reheat the roast before adding it to the quiche or frittata since the whole thing will bake in the oven. Making Main Dishes With Leftover Roast Create your own casserole. A filling casserole is a great way to use up a roasts and any leftover vegetables you may have in your fridge. Cook a simple sauce or use leftover gravy as a base for the casserole. Cut up leftover roast and stir it into the sauce along with cooked vegetables and pasta. Bake the casserole until it's hot and bubbly. If you'd like to base your casserole off of a recipe, try stroganoff. Toss together mushrooms, leftover roast, onions, sour cream and noodles. Bake the stroganoff and serve it with crusty bread. Cook up a curry. Heat a simmer sauce or make your favorite curry and stir in diced roast. You can also add coconut milk, bamboo shoots, and vegetables to round out the curry. Potatoes, eggplant, carrots, and carrots work well with leftover roast. Serve the curry along with one of these sides:\nJasmine rice\nNaan\nQuinoa\nBulgar Heat up a stir fry. Assemble your favorite stir fry vegetables (like snow peas, snap peas, carrot strips, bell peppers, or bok choy). Saute the vegetables in a little oil until they soften. Stir in strips of leftover roast and cook them over high heat until they heat up. Season the stir fry with:\nSoy sauce\nHoney\nLemon juice\nCooking sherry Use the roast in burritos. Shred the leftover roast using two forks. Heat the meat in a skillet or in the oven and season the meat with taco seasoning. Combine the meat with strips of bell pepper and onion. Cook the burrito filling until the vegetables soften. Fill flour tortillas with the meat and vegetable filling and roll the tortillas into burritos. You can serve the burritos after you roll them or heat the rolled burritos in the skillet to crisp them up. Simmer the meat in a chili. Chili is a great way to use up leftover roast if you don't have a lot of meat. Combine chunks of the leftover roast in a large sauce pot and add cans of diced tomatoes and beans. Simmer the chili mixture along with tomato sauce and chili seasonings. If you'd like to make a stew, just chunk up the leftover roast and simmer it with your choice of vegetables in a beef broth or stock. You can thicken the stew with a cornstarch and water. Make sandwiches with the roast. For a quick sandwich, place slices of the cold roast on your favorite bread with your favorite condiments. You could also make a hot sandwich by quickly frying strips of the leftover roast and placing it on your favorite bread. Lay a piece of cheese and sauteed onions over the meat and warm the entire sandwich in the oven until the cheese melts. Consider making these sandwiches with leftover roast:\nFrench dip\nSloppy joes\nSteak sandwiches",
  "tyn_model":[
    "onion",
    "potatoes",
    "vegetables",
    "beef broth",
    "water",
    "oil",
    "oven",
    "chili",
    "roast beef",
    "onions",
    "curry",
    "carrots",
    "skillet",
    "broth",
    "white gravy",
    "saucepan",
    "flour",
    "milk",
    "salt and pepper",
    "fried chicken",
    "biscuits",
    "salad",
    "nicoise salad",
    "caesar dressing",
    "blue cheese",
    "hot sauce",
    "steak sauce",
    "salt, pepper",
    "asparagus",
    "parmesan cheese",
    "gravy",
    "pasta",
    "stroganoff",
    "mushrooms",
    "sour cream",
    "noodles",
    "simmer sauce",
    "coconut milk",
    "bamboo shoots",
    "eggplant",
    "jasmine rice",
    "naan",
    "quinoa",
    "bulgar",
    "stir fry",
    "stir fry vegetables",
    "snow peas",
    "snap peas",
    "carrot",
    "bell peppers",
    "bok choy",
    "soy sauce",
    "honey",
    "sherry",
    "burritos",
    "forks",
    "taco seasoning",
    "bell pepper",
    "flour tortillas",
    "large sauce pot",
    "diced tomatoes",
    "tomato sauce",
    "chili seasonings",
    "stock",
    "cornstarch",
    "cheese",
    "sauteed onions",
    "french dip",
    "sloppy joes"
  ],
  "tyn_section":[

  ]
}