{
  "title":"How to Make Fish Stew",
  "url":"https://www.wikihow.com/Make-Fish-Stew",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Making Quick Fish Stew",
      "steps":[
        {
          "headline":"Saute the onion, garlic, and parsley.",
          "description":"Pour 6 tablespoons of olive oil into a large saucepan or pot over medium-high heat. When the oil shimmers, add 1 medium chopped onion (about 1 1/2 cups). Stir and cook the onion for about 4 minutes or until it softens a little. Add 3 large cloves of minced garlic and cook it for one minute. Stir in 2/3 cup of fresh chopped parsley and cook the aromatic base for 2 more minutes. It's important not to add the garlic when you first put the onions in the pan. Garlic cooks very quickly, so you'll only want to add it right before you add the parsley and remaining stew ingredients."
        },
        {
          "headline":"Add the tomatoes and simmer the stew base.",
          "description":"Open one 14-ounce (411 g) can of tomatoes with their juices and add it to the saucepan. If you don't want to use canned tomatoes, you could use 1 1/2 cups of freshly chopped tomatoes (from about one medium-sized tomato). Stir in 2 teaspoons of tomato paste and let the stew simmer gently for 10 minutes. If you're buying canned diced tomatoes, ensure that they're packed in tomato juice."
        },
        {
          "headline":"Stir in and simmer the clam juice, dry white wine, and the fish.",
          "description":"Add 8 ounces (240 ml) of clam juice (or shellfish stock), 1/2 cup dry white wine (like Sauvignon blanc), and 1 1/2 pounds (680 g) of fish fillets cut into 2-inch (5 cm) pieces. Turn the heat up a little so the stew bubbles a bit and cook the stew for 3 to 5 minutes. The fish should be completely cooked and should flake a apart when you poke it with a fork. Avoid using a delicate fish like sole or tuna. Instead, consider using a firm fish like tilapia, halibut, cod, red snapper, or sea bass. You could also add shrimp, clams or scallops to make a seafood stew."
        },
        {
          "headline":"Taste and season the quick fish stew.",
          "description":"Add one pinch of dried oregano, one pinch of dried thyme, 1/8 teaspoon of hot sauce, and some salt and pepper. Taste the quick fish stew and adjust the seasonings to your liking. Serve the stew along with:\nCrusty bread\nRice\nRolls\nCrackers"
        }
      ]
    },
    {
      "name":"Making Spicy Fish Stew",
      "steps":[
        {
          "headline":"Blacken red bell peppers.",
          "description":"Place 3 large red bell peppers on a baking sheet and put them under a broiler. Heat the peppers until they blacken on all sides. You could also blacken each red bell pepper over a gas flame. Carefully use tongs to hold the bell pepper over the flame and turn it until it's blackened on all sides. You could also use orange or yellow bell peppers."
        },
        {
          "headline":"Peel, seed and chop the blackened peppers.",
          "description":"Put the blackened bell peppers into a paper bag. Close the bag and let the peppers rest for ten minutes. Remove them from the bag and rub the peels off using a paper towel. Cut the peppers to remove the seeds and chop the peppers into bite-sized pieces. You may need to rinse the blacked peppers to completely remove the seeds."
        },
        {
          "headline":"Cook the shallots.",
          "description":"Heat 5 tablespoons of extra-virgin olive oil in a large saucepan or pot over medium heat. When the oil shimmers, add 12 chopped shallots and cook them until they're soft. This should take about 12 minutes. Stir the shallots frequently and keep a close eye on them. They could burn easily since they're much smaller than onions."
        },
        {
          "headline":"Add chopped tomatoes, garlic, and red pepper.",
          "description":"Open two 14.5-ounce (411 g) cans of chopped tomatoes. Pour the tomatoes and their juice into the pot with the sauteed shallots. You should also stir in 2 minced garlic cloves and 3/4 of a teaspoon of dried crushed red pepper. Simmer the stew base for 10 minutes. Letting the stew base lightly bubble will help the flavors develop before you add the fish."
        },
        {
          "headline":"Stir in the cilantro, lemon peel, and fish.",
          "description":"Chop 1/2 cup (25 g) of fresh cilantro and stir it into the pot. You should also grate 1 teaspoon of lemon peel and add it. Cut 2 pounds (907 g) of halibut or cod fillets into 1-inch (2.5 cm) pieces and put it in the pot. Cook the stew for about 5 minutes. The fish should be just cooked throughout. Taste the spicy fish stew and add salt and pepper to taste."
        }
      ]
    },
    {
      "name":"Making Creamy Fish Stew",
      "steps":[
        {
          "headline":"Fry the bacon.",
          "description":"Chop 4 ounces (115 g) of slab bacon, sliced bacon, or salt pork into pieces. Place the meat in a large saucepan or pot and turn the heat on to medium. Stir the bacon and stir it occasionally to keep it from sticking. Once the bacon is browned (but not crispy), use a slotted spoon to remove it from the pan. Place the cooked bacon onto a plate lined with a paper towel. This will absorb the excess grease. It should take 8 to 10 minutes to cook the meat."
        },
        {
          "headline":"Saute the onion and celery.",
          "description":"Put 2 tablespoons of butter into the pot that has the meat drippings. Finely chop one large onion and four celery stalks (with the leaves) and add them to the pot. Sprinkle salt and pepper over the vegetables and cook them over medium heat for 5 to 8 minutes. The vegetables should soften and the onion should turn clear."
        },
        {
          "headline":"Bring the potatoes, clam juice, thyme and water to boil.",
          "description":"Peel 2 large Yukon Gold potatoes (about 1 pound or 450 g) and cut them into 1/2-inch (1.25 cm) pieces. Add the potatoes to the sauce pot along with 1 cup (240 ml) of clam juice or fish broth, 1 tablespoon of fresh thyme leaves, and one cup (240 ml) of water. Turn the heat to high so the stew boils. Turn the temperature down a little and simmer the stew for 10 to 15 minutes. The stew should bubble lightly so that the potatoes cook and become tender."
        },
        {
          "headline":"Add the fish and simmer the stew.",
          "description":"Sprinkle 1 1/2 pounds (680 g) of firm fish with salt and pepper and cut it into 2-inch (5 cm) pieces. Set the fish on the potatoes in the pot and cover the pot. Cook the stew on medium heat for 5 to 7 minutes so the fish cooks completely. You can use skinless cod, haddock or pollock for the creamy fish stew."
        },
        {
          "headline":"Stir in the half-and-half.",
          "description":"Add 4 cups (950 ml) of half-and-half into the creamy fish stew. Bring the stew to a light bubble to heat the half-and-half thoroughly. Taste the stew and add more salt and pepper according to your taste. Serve the creamy fish stew with crackers. Don't worry if the fish breaks down into small bits as you stir the stew."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Quick Fish Stew Saute the onion, garlic, and parsley. Pour 6 tablespoons of olive oil into a large saucepan or pot over medium-high heat. When the oil shimmers, add 1 medium chopped onion (about 1 1/2 cups). Stir and cook the onion for about 4 minutes or until it softens a little. Add 3 large cloves of minced garlic and cook it for one minute. Stir in 2/3 cup of fresh chopped parsley and cook the aromatic base for 2 more minutes. It's important not to add the garlic when you first put the onions in the pan. Garlic cooks very quickly, so you'll only want to add it right before you add the parsley and remaining stew ingredients. Add the tomatoes and simmer the stew base. Open one 14-ounce (411 g) can of tomatoes with their juices and add it to the saucepan. If you don't want to use canned tomatoes, you could use 1 1/2 cups of freshly chopped tomatoes (from about one medium-sized tomato). Stir in 2 teaspoons of tomato paste and let the stew simmer gently for 10 minutes. If you're buying canned diced tomatoes, ensure that they're packed in tomato juice. Stir in and simmer the clam juice, dry white wine, and the fish. Add 8 ounces (240 ml) of clam juice (or shellfish stock), 1/2 cup dry white wine (like Sauvignon blanc), and 1 1/2 pounds (680 g) of fish fillets cut into 2-inch (5 cm) pieces. Turn the heat up a little so the stew bubbles a bit and cook the stew for 3 to 5 minutes. The fish should be completely cooked and should flake a apart when you poke it with a fork. Avoid using a delicate fish like sole or tuna. Instead, consider using a firm fish like tilapia, halibut, cod, red snapper, or sea bass. You could also add shrimp, clams or scallops to make a seafood stew. Taste and season the quick fish stew. Add one pinch of dried oregano, one pinch of dried thyme, 1/8 teaspoon of hot sauce, and some salt and pepper. Taste the quick fish stew and adjust the seasonings to your liking. Serve the stew along with:\nCrusty bread\nRice\nRolls\nCrackers Making Spicy Fish Stew Blacken red bell peppers. Place 3 large red bell peppers on a baking sheet and put them under a broiler. Heat the peppers until they blacken on all sides. You could also blacken each red bell pepper over a gas flame. Carefully use tongs to hold the bell pepper over the flame and turn it until it's blackened on all sides. You could also use orange or yellow bell peppers. Peel, seed and chop the blackened peppers. Put the blackened bell peppers into a paper bag. Close the bag and let the peppers rest for ten minutes. Remove them from the bag and rub the peels off using a paper towel. Cut the peppers to remove the seeds and chop the peppers into bite-sized pieces. You may need to rinse the blacked peppers to completely remove the seeds. Cook the shallots. Heat 5 tablespoons of extra-virgin olive oil in a large saucepan or pot over medium heat. When the oil shimmers, add 12 chopped shallots and cook them until they're soft. This should take about 12 minutes. Stir the shallots frequently and keep a close eye on them. They could burn easily since they're much smaller than onions. Add chopped tomatoes, garlic, and red pepper. Open two 14.5-ounce (411 g) cans of chopped tomatoes. Pour the tomatoes and their juice into the pot with the sauteed shallots. You should also stir in 2 minced garlic cloves and 3/4 of a teaspoon of dried crushed red pepper. Simmer the stew base for 10 minutes. Letting the stew base lightly bubble will help the flavors develop before you add the fish. Stir in the cilantro, lemon peel, and fish. Chop 1/2 cup (25 g) of fresh cilantro and stir it into the pot. You should also grate 1 teaspoon of lemon peel and add it. Cut 2 pounds (907 g) of halibut or cod fillets into 1-inch (2.5 cm) pieces and put it in the pot. Cook the stew for about 5 minutes. The fish should be just cooked throughout. Taste the spicy fish stew and add salt and pepper to taste. Making Creamy Fish Stew Fry the bacon. Chop 4 ounces (115 g) of slab bacon, sliced bacon, or salt pork into pieces. Place the meat in a large saucepan or pot and turn the heat on to medium. Stir the bacon and stir it occasionally to keep it from sticking. Once the bacon is browned (but not crispy), use a slotted spoon to remove it from the pan. Place the cooked bacon onto a plate lined with a paper towel. This will absorb the excess grease. It should take 8 to 10 minutes to cook the meat. Saute the onion and celery. Put 2 tablespoons of butter into the pot that has the meat drippings. Finely chop one large onion and four celery stalks (with the leaves) and add them to the pot. Sprinkle salt and pepper over the vegetables and cook them over medium heat for 5 to 8 minutes. The vegetables should soften and the onion should turn clear. Bring the potatoes, clam juice, thyme and water to boil. Peel 2 large Yukon Gold potatoes (about 1 pound or 450 g) and cut them into 1/2-inch (1.25 cm) pieces. Add the potatoes to the sauce pot along with 1 cup (240 ml) of clam juice or fish broth, 1 tablespoon of fresh thyme leaves, and one cup (240 ml) of water. Turn the heat to high so the stew boils. Turn the temperature down a little and simmer the stew for 10 to 15 minutes. The stew should bubble lightly so that the potatoes cook and become tender. Add the fish and simmer the stew. Sprinkle 1 1/2 pounds (680 g) of firm fish with salt and pepper and cut it into 2-inch (5 cm) pieces. Set the fish on the potatoes in the pot and cover the pot. Cook the stew on medium heat for 5 to 7 minutes so the fish cooks completely. You can use skinless cod, haddock or pollock for the creamy fish stew. Stir in the half-and-half. Add 4 cups (950 ml) of half-and-half into the creamy fish stew. Bring the stew to a light bubble to heat the half-and-half thoroughly. Taste the stew and add more salt and pepper according to your taste. Serve the creamy fish stew with crackers. Don't worry if the fish breaks down into small bits as you stir the stew. Finished. ",
  "tyn_model":[
    "pot",
    "tomatoes",
    "fish",
    "peppers",
    "onion",
    "garlic",
    "bacon",
    "potatoes",
    "clam juice",
    "salt and pepper",
    "quick fish stew",
    "parsley",
    "large saucepan",
    "oil",
    "onions",
    "dry white wine",
    "cod",
    "crackers",
    "red bell peppers",
    "paper towel",
    "cilantro",
    "celery",
    "vegetables",
    "water",
    "half-and-half",
    "olive oil",
    "saucepan",
    "tomato paste",
    "tomato juice",
    "shellfish stock",
    "fork",
    "tuna",
    "tilapia",
    "halibut",
    "red snapper",
    "sea bass",
    "shrimp",
    "scallops",
    "seafood stew",
    "dried oregano",
    "dried thyme",
    "hot sauce",
    "salt",
    "pepper",
    "seasonings",
    "crusty bread",
    "rice",
    "baking sheet",
    "broiler",
    "red bell pepper",
    "gas flame",
    "bell peppers",
    "paper bag",
    "extra-virgin olive oil",
    "red pepper",
    "chopped tomatoes",
    "shallots",
    "crushed red pepper",
    "lemon",
    "lemon peel",
    "halibut or cod fillets",
    "fish stew",
    "slab bacon",
    "salt pork",
    "slotted spoon",
    "plate",
    "butter",
    "thyme",
    "sauce pot",
    "fish broth",
    "fresh thyme",
    "haddock",
    "pollock",
    "half"
  ],
  "tyn_section":[

  ]
}