{
  "title":"How to Play with Your Num Noms",
  "url":"https://www.wikihow.com/Play-with-Your-Num-Noms",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Toy Figurines and Accessories"
  ],
  "steps":[
    {
      "headline":"Buy your favorite Num Noms.",
      "description":"You can only find Series 1-3 Num Noms and Series 1 Num Noms Lights online at Amazon or eBay, but Series 4-5 Num Noms, as well as the Shimmer Series Num Noms, Series 2-4 Num Noms Lights, Num Noms Party Hair, Num Noms Sparkle Smoothies, and Num Noms Snackables Cereal, Dippers, Snow Cones, Silly Shakes, Melty Pops, Slime Kit Friends, Mystery Makeup, Birthday Cake Friends, and Slime Sundaes are currently available in such stores as Walmart, Target, Meijer, Kohl's, and even Michael's. Num Noms often come together in packs as a group and in mystery containers (contains 1 Num and 1 Nom) and there are even Num Noms playsets with Special Edition Num Noms!"
    },
    {
      "headline":"Check off the Num Noms you have.",
      "description":"Each Num Noms pack, container, or playset comes with a checklist so you can remember which Num Noms you have. And each Num Nom has a unique name, so you don't even have to name them!"
    },
    {
      "headline":"Feed your Num Noms.",
      "description":"They love to eat different foods and try new things. Make some pretend food no bigger than them or even share some of your real food with them!"
    },
    {
      "headline":"Play with your Num Noms.",
      "description":"In their webisodes and commercials, Num Noms are playful and adventurous, but can be mischievous. Make up fun adventures for your Num Noms and even take pictures! Num Noms love playing board games and video games, dancing to music, and watching fun videos. The Num Noms webisode series at www.numnoms.com is a good inspiration on brainstorming ideas on Num Nom adventures!"
    },
    {
      "headline":"\"Bathe\" your Num Noms.",
      "description":"If they ever get dirty, they could use a damp washcloth with soap."
    },
    {
      "headline":"Make a bed for each Num Nom, then tuck them in.",
      "description":"A small box is a good idea for a bed and you can use a baby blanket or other soft piece of fabric for the bedding. A smaller piece of fabric could be the Num Noms' blanket. You can read them a bedtime story or play a lullaby and watch your Num Noms nod off to sleep."
    },
    {
      "headline":"Take your Num Noms almost everywhere you go.",
      "description":"Bring them on vacation or on your errands. If you take them to school, make sure you keep them in your backpack so the teacher doesn't see them."
    },
    {
      "headline":"Finished!",
      "description":""
    }
  ],
  "text":" Buy your favorite Num Noms. You can only find Series 1-3 Num Noms and Series 1 Num Noms Lights online at Amazon or eBay, but Series 4-5 Num Noms, as well as the Shimmer Series Num Noms, Series 2-4 Num Noms Lights, Num Noms Party Hair, Num Noms Sparkle Smoothies, and Num Noms Snackables Cereal, Dippers, Snow Cones, Silly Shakes, Melty Pops, Slime Kit Friends, Mystery Makeup, Birthday Cake Friends, and Slime Sundaes are currently available in such stores as Walmart, Target, Meijer, Kohl's, and even Michael's. Num Noms often come together in packs as a group and in mystery containers (contains 1 Num and 1 Nom) and there are even Num Noms playsets with Special Edition Num Noms! Check off the Num Noms you have. Each Num Noms pack, container, or playset comes with a checklist so you can remember which Num Noms you have. And each Num Nom has a unique name, so you don't even have to name them! Feed your Num Noms. They love to eat different foods and try new things. Make some pretend food no bigger than them or even share some of your real food with them! Play with your Num Noms. In their webisodes and commercials, Num Noms are playful and adventurous, but can be mischievous. Make up fun adventures for your Num Noms and even take pictures! Num Noms love playing board games and video games, dancing to music, and watching fun videos. The Num Noms webisode series at www.numnoms.com is a good inspiration on brainstorming ideas on Num Nom adventures! \"Bathe\" your Num Noms. If they ever get dirty, they could use a damp washcloth with soap. Make a bed for each Num Nom, then tuck them in. A small box is a good idea for a bed and you can use a baby blanket or other soft piece of fabric for the bedding. A smaller piece of fabric could be the Num Noms' blanket. You can read them a bedtime story or play a lullaby and watch your Num Noms nod off to sleep. Take your Num Noms almost everywhere you go. Bring them on vacation or on your errands. If you take them to school, make sure you keep them in your backpack so the teacher doesn't see them. Finished! ",
  "tyn_model":[
    "num noms sparkle smoothies",
    "num noms snackables cereal",
    "dippers",
    "snow cones",
    "melty pops",
    "slime kit",
    "mystery makeup",
    "birthday cake",
    "slime sundaes",
    "num noms playsets",
    "soap",
    "baby blanket",
    "fabric",
    "blanket"
  ],
  "tyn_section":[

  ]
}