{
  "title":"How to Make Goat Cheese Cheesecake",
  "url":"https://www.wikihow.com/Make-Goat-Cheese-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 350 degrees F (180 degrees C).",
      "description":""
    },
    {
      "headline":"Mix the graham cracker crumbs with butter in a small bowl until thoroughly blended.",
      "description":"Press crumbs firmly on bottom of a greased 9-inch spring form pan with your fingers."
    },
    {
      "headline":"Beat the cream cheese in a large bowl with an electric mixer until thick, smooth and creamy.",
      "description":"This will take around 5 minutes."
    },
    {
      "headline":"Beat in 1 cup of the sour cream, the goat cheese, eggs and sugar, and continue beating until mixture is very smooth and creamy.",
      "description":"This will take 4 to 5 minutes."
    },
    {
      "headline":"Beat in vanilla and lime juice until thoroughly mixed together and then for another 2 minutes.",
      "description":""
    },
    {
      "headline":"Pour filling over crust and smooth top.",
      "description":""
    },
    {
      "headline":"Bake until filling is brown and springy-firm, about 1 1/2 hours.",
      "description":""
    },
    {
      "headline":"Remove from oven and allow to cool to room temperature.",
      "description":""
    },
    {
      "headline":"Refrigerate at least 6 hours.",
      "description":""
    },
    {
      "headline":"Combine the Grand Marnier with the remaining 1/2 cup sour cream in a small bowl and beat with an electric mixer on medium speed until smooth and creamy.",
      "description":"This will take about 2 minutes."
    },
    {
      "headline":"Spread on top of cooled cake.",
      "description":""
    },
    {
      "headline":"Remove cheesecake from refrigerator 2 hours before serving.",
      "description":"To serve, cut cake in wedges with a warm knife."
    }
  ],
  "text":" Preheat oven to 350 degrees F (180 degrees C).  Mix the graham cracker crumbs with butter in a small bowl until thoroughly blended. Press crumbs firmly on bottom of a greased 9-inch spring form pan with your fingers. Beat the cream cheese in a large bowl with an electric mixer until thick, smooth and creamy. This will take around 5 minutes. Beat in 1 cup of the sour cream, the goat cheese, eggs and sugar, and continue beating until mixture is very smooth and creamy. This will take 4 to 5 minutes. Beat in vanilla and lime juice until thoroughly mixed together and then for another 2 minutes.  Pour filling over crust and smooth top.  Bake until filling is brown and springy-firm, about 1 1/2 hours.  Remove from oven and allow to cool to room temperature.  Refrigerate at least 6 hours.  Combine the Grand Marnier with the remaining 1/2 cup sour cream in a small bowl and beat with an electric mixer on medium speed until smooth and creamy. This will take about 2 minutes. Spread on top of cooled cake.  Remove cheesecake from refrigerator 2 hours before serving. To serve, cut cake in wedges with a warm knife.",
  "tyn_model":[
    "small bowl",
    "electric mixer",
    "sour cream",
    "graham cracker crumbs",
    "butter",
    "cream cheese",
    "large bowl",
    "goat cheese",
    "eggs",
    "sugar",
    "vanilla",
    "lime",
    "oven",
    "grand marnier",
    "refrigerator",
    "cake",
    "knife"
  ],
  "tyn_section":[

  ]
}