{
  "title":"How to Figure out Which DS to Buy",
  "url":"https://www.wikihow.com/Figure-out-Which-DS-to-Buy",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS"
  ],
  "methods":[
    {
      "name":"Nintendo DS",
      "steps":[
        {
          "headline":"This is the very first DS Nintendo made.",
          "description":""
        },
        {
          "headline":"The DS is the cheapest out of the 4.",
          "description":"However,this DS is retired"
        },
        {
          "headline":"It comes with PictoChat, an option to chat with your friends as 65 feet (19.8 m) away, or less and DS Download Play, where you can play certain games with your friends that have that functionality.",
          "description":""
        },
        {
          "headline":"You are able to play GBA games in the second slot.",
          "description":"This is perfect for Pokémon games to trade over Pokémon from a GBA game to a DS game."
        },
        {
          "headline":"The stylus is located on the bottom, nearby the DS game slot.",
          "description":""
        }
      ]
    },
    {
      "name":"Nintendo DS Lite",
      "steps":[
        {
          "headline":"This is the second DS Nintendo made.",
          "description":""
        },
        {
          "headline":"This DS is discontinued.",
          "description":""
        },
        {
          "headline":"It comes with PictoChat, DS Download Play, and a GBA slot as well.",
          "description":""
        },
        {
          "headline":"This DS is lighter than the original DS.",
          "description":""
        },
        {
          "headline":"The Power button is now found on side instead of inside the DS.",
          "description":"The microphone is now found on the middle hinge."
        },
        {
          "headline":"The stylus is now located on the bottom right side of the DS.",
          "description":""
        }
      ]
    },
    {
      "name":"Nintendo DSi",
      "steps":[
        {
          "headline":"The DSi is the third DS console to be made by Nintendo.",
          "description":"Many new features were added with the release of this DS."
        },
        {
          "headline":"This price of this DSi is 99.99, but it may differ online.",
          "description":""
        },
        {
          "headline":"The model is thinner and lighter than the previous DS models.",
          "description":""
        },
        {
          "headline":"The main screen is set up similar to the Wii home menu with box panels shown on the touch screen and pictures that you have chosen to show on the main screen at the top.",
          "description":""
        },
        {
          "headline":"You can take pictures, play around with sounds that you recorded using the microphone,  buy games using DSi Points and use Flipnote Studio.",
          "description":""
        },
        {
          "headline":"DS Download Play and PictoChat are still on this model.",
          "description":""
        },
        {
          "headline":"You now have an Internet browser, downloadable free of charge from the Nintendo DSi shop on this DS.",
          "description":"You don't have to have the pack now to have Internet."
        },
        {
          "headline":"You cannot play GBA games on this DSi.",
          "description":"Nintendo has replaced that feature with the option to buy games from the DSi shop using points."
        },
        {
          "headline":"In PictoChat, you can now also draw in rainbow colors besides black.",
          "description":""
        }
      ]
    },
    {
      "name":"Nintendo DSi XL",
      "steps":[
        {
          "headline":"This DS can take pictures, play with sound, has DS Download Play, Pictochat, and now comes installed with a couple of features:",
          "description":"Photo Clock Brain Age Express: Arts & Letters Brain Age Express: Math Nintendo DSi Browser Flipnote Studio"
        },
        {
          "headline":"This is also the biggest DS so far.",
          "description":"It is 18% bigger than the DSi."
        },
        {
          "headline":"You cannot play GBA games on the DSi XL either.",
          "description":""
        }
      ]
    }
  ],
  "text":" Nintendo DS This is the very first DS Nintendo made.  The DS is the cheapest out of the 4. However,this DS is retired It comes with PictoChat, an option to chat with your friends as 65 feet (19.8 m) away, or less and DS Download Play, where you can play certain games with your friends that have that functionality.  You are able to play GBA games in the second slot. This is perfect for Pokémon games to trade over Pokémon from a GBA game to a DS game. The stylus is located on the bottom, nearby the DS game slot.  Nintendo DS Lite This is the second DS Nintendo made.  This DS is discontinued.  It comes with PictoChat, DS Download Play, and a GBA slot as well.  This DS is lighter than the original DS.  The Power button is now found on side instead of inside the DS. The microphone is now found on the middle hinge. The stylus is now located on the bottom right side of the DS.  Nintendo DSi The DSi is the third DS console to be made by Nintendo. Many new features were added with the release of this DS. This price of this DSi is 99.99, but it may differ online.  The model is thinner and lighter than the previous DS models.  The main screen is set up similar to the Wii home menu with box panels shown on the touch screen and pictures that you have chosen to show on the main screen at the top.  You can take pictures, play around with sounds that you recorded using the microphone,  buy games using DSi Points and use Flipnote Studio.  DS Download Play and PictoChat are still on this model.  You now have an Internet browser, downloadable free of charge from the Nintendo DSi shop on this DS. You don't have to have the pack now to have Internet. You cannot play GBA games on this DSi. Nintendo has replaced that feature with the option to buy games from the DSi shop using points. In PictoChat, you can now also draw in rainbow colors besides black.  Nintendo DSi XL This DS can take pictures, play with sound, has DS Download Play, Pictochat, and now comes installed with a couple of features: Photo Clock Brain Age Express: Arts & Letters Brain Age Express: Math Nintendo DSi Browser Flipnote Studio This is also the biggest DS so far. It is 18% bigger than the DSi. You cannot play GBA games on the DSi XL either. ",
  "tyn_model":[
    "ds",
    "stylus",
    "nintendo ds lite",
    "microphone",
    "nintendo dsi",
    "flipnote studio",
    "nintendo dsi shop",
    "nintendo dsi xl",
    "ds download play, pictochat,",
    "nintendo dsi browser"
  ],
  "tyn_section":[

  ]
}