{
  "title":"How to Consider the Factors when Planning Meals",
  "url":"https://www.wikihow.com/Consider-the-Factors-when-Planning-Meals",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Addressing Dietary Requirements",
      "steps":[
        {
          "headline":"Include a variety of foods from the major food groups.",
          "description":"A balanced diet requires eating a variety of fruits, vegetables, whole grains, low-fat dairy products, and lean protein (this includes beans and other legumes, nuts and seeds). Most of the foods you eat every day should fit into one of these categories. Try to make plant-derived foods such as whole grains, vegetables and fruits the foundation of every meal. After establishing a basis of plant-derived foods for a meal, then add in a moderate amount of low-fat dairy and lean protein items."
        },
        {
          "headline":"Use a variety of ingredients, flavors and textures.",
          "description":"Since calories, nutrients and fiber content of foods in the same food group can differ dramatically, good nutrition depends on getting a variety of different foods from within the food groups. Mix up it by using an assortment of colors, shapes, flavors and textures. The diversity in your choices will also make meals more interesting and appealing for everyone."
        },
        {
          "headline":"Take proper portion sizes into account.",
          "description":"When people are faced with overly large portions, they tend to overeat. Check the packages of foods you’re preparing to  about serving sizes and follow the guidelines. Unless you intend to make a lot of food so that there will be leftovers, try to follow basic serving size guidelines. One serving of meat or fish is approximately 3 ounces. One serving of dairy is approximately 1 cup. One serving of vegetables is approximately 1 cup raw and ½ cup cooked. One serving of whole grains is 1 slice of bread, 1 cup of dry cereal, and ½ cup cooked rice, cereal and pasta. One serving of fruit is 1 medium sized fresh piece (approximately the size of a baseball) and ¼ cup dried."
        },
        {
          "headline":"Avoid foods that are very high in fat, sugar, calories and sodium.",
          "description":"While they can’t be eliminated completely, a healthy, balanced diet includes a very low percentage of these types of foods. Our bodies need fat, but try to mostly choose healthy fats for your meals. A few healthy fat options are avocados, salmon, albacore tuna, nuts and peanut butter."
        },
        {
          "headline":"Address the dietary needs of different age groups.",
          "description":"Teenagers and adults over the age of 50 need a lot of calcium in their diets. Small children, adolescent girls, and women of childbearing age need plenty of iron, which you can get from lean meats and cereals (with added nutrients). Women trying to become pregnant need extra folic acid. Elderly adults need to take in extra vitamin D."
        }
      ]
    },
    {
      "name":"Accommodating Lifestyle and Allergy Concerns",
      "steps":[
        {
          "headline":"Find out if anyone is vegetarian or vegan.",
          "description":"Vegetarians do not eat meat, poultry, or seafood. Some vegetarians don’t eat dairy, so make sure to get the details from them if you’re feeding a vegetarian. Vegans don’t eat meat, poultry, or seafood, or any other animal products (including milk and eggs). Since their diets are somewhat restricted, vegans and vegetarians need a lot of variety in their food choices in order to meet their nutrition needs. Some food options that are popular among vegetarians and vegans are kale, grains, nuts, legumes, and beans."
        },
        {
          "headline":"Inquire about food allergies and intolerances.",
          "description":"Some people have negative, sometimes even life-threatening, reactions to specific kinds of foods, so make sure to ask about them. The Mayo Clinic names eggs, milk, peanuts, shellfish, tree nuts, soy and fish as some of the most common food allergens. Wheat is another big one. Common food intolerances are lactose (which is in milk products), MSG and gluten (which is in bread, pasta, and many wheat products)."
        },
        {
          "headline":"Find out if anyone is on a special diet for other health reasons.",
          "description":"People with heart disease, high cholesterol levels and high blood pressure need to avoid certain foods to maintain good health. Some of the major foods they should avoid are processed meats, highly refined and processed carbohydrates, and sodas and other types of sugary drinks. Diabetics also need to avoid certain foods to maintain proper insulin levels, so be sure to ask about this one, too."
        },
        {
          "headline":"Inquire about religion-related food restrictions.",
          "description":"Some people don’t eat certain foods because of their religion. There are many different types of religions with food restrictions, and the restrictions themselves vary from religion to religion. Some religions have food restrictions only at certain times of the year, so be sure to ask about the details."
        }
      ]
    },
    {
      "name":"Sticking To a Budget",
      "steps":[
        {
          "headline":"Plan ahead.",
          "description":"The best way to stick to a budget is to plan your meals one week in advance. Decide which meals you want to make for the upcoming week and make a detailed grocery list of needed ingredients. Be sure to take the list with you when you go shopping, so that you’ll only pick up the items that you need."
        },
        {
          "headline":"Check out current grocery store sales.",
          "description":"As you’re planning your meals, take into account which food products are on sale and where, and do your shopping at those places. By sticking to your shopping list and creating planned meals around sales, you can save even more money. Don’t forget to check the newspaper for coupons and additional ways to save."
        },
        {
          "headline":"Use seasonal fruits and vegetables.",
          "description":"Not only will seasonal fruits and veggies be easier to find, they will also be available in abundance for a much lower price than usual. When they’re in season, fruits and veggies tend to be at their tastiest, making them ideal foods to stock up on. When fruit and vegetables aren’t in season, buy canned or frozen varieties, which are generally cheaper while still offering great nutritional benefits. Along with your local grocery stores’ produce section, also check out any farmer’s markets in your area for even more options and organic produce at a low price."
        },
        {
          "headline":"Incorporate foods that you already have and buy low-cost items.",
          "description":"Check out what’s currently in your pantry. For instance, do you have some canned food items pushed to the very back of your pantry that have been in there awhile? Plan a few meals around those. According to the USDA, the least-expensive vegetables are eggplants, lettuce, carrots and tomatillos. The least-expensive fruits are apples, peaches, pineapples, pears, bananas and watermelon. For low-cost sources of protein, opt for canned tuna, ground beef and eggs."
        }
      ]
    },
    {
      "name":"Checking Availability of Ingredients and Resources",
      "steps":[
        {
          "headline":"Plan according to how much time you have to cook.",
          "description":"Take into account how much time you have each day to cook. For instance, if you work 8 or more hours per day, you’re going to have less time available for preparing meals. Plan meals that are faster and easier to prepare. Invest in a crock pot. You do a quick prep the night before, toss everything in the crock pot the next morning, turn it on and you're done! When you arrive back home later that evening, your meal will be waiting for you. Cook large batches and freeze portions for later meals. Use canned items, like beans, for a quicker meal prep. No hours of soaking required. When you're short on time, use frozen vegetables instead of fresh. Frozen veggies are still nutritious, and you'll save tons of prep time. Explore new recipes that incorporate baking, grilling and sauteing. Baking casseroles, for example, generally requires a short prep time and once you pop it in the oven, you don't have to babysit it."
        },
        {
          "headline":"Make sure you have the right equipment.",
          "description":"Be certain that you have the cookware, utensils, dishes and other items required for the meals you’re planning on hand before you buy all of the ingredients to make them. If you are planning large meals with the intention of having leftovers, make sure you have enough storage containers and Tupperware to accommodate everything."
        },
        {
          "headline":"Confirm that the ingredients can be easily attained.",
          "description":"Avoid recipes that require fruits and vegetables that are out of season. Also avoid recipes that require gourmet ingredients or any other hard-to-find items. If you’re planning large meals, make sure the ingredients you need can be easily obtained in large quantities."
        },
        {
          "headline":"Avoid elaborate food preparation unless you have help.",
          "description":"If you’re cooking alone, don’t plan elaborate or complex meals that require a lot of preparation. Plan meals that you can easily handle yourself, unless you have people around in your house that can assist you."
        }
      ]
    }
  ],
  "text":" Addressing Dietary Requirements Include a variety of foods from the major food groups. A balanced diet requires eating a variety of fruits, vegetables, whole grains, low-fat dairy products, and lean protein (this includes beans and other legumes, nuts and seeds). Most of the foods you eat every day should fit into one of these categories. Try to make plant-derived foods such as whole grains, vegetables and fruits the foundation of every meal. After establishing a basis of plant-derived foods for a meal, then add in a moderate amount of low-fat dairy and lean protein items. Use a variety of ingredients, flavors and textures. Since calories, nutrients and fiber content of foods in the same food group can differ dramatically, good nutrition depends on getting a variety of different foods from within the food groups. Mix up it by using an assortment of colors, shapes, flavors and textures. The diversity in your choices will also make meals more interesting and appealing for everyone. Take proper portion sizes into account. When people are faced with overly large portions, they tend to overeat. Check the packages of foods you’re preparing to  about serving sizes and follow the guidelines. Unless you intend to make a lot of food so that there will be leftovers, try to follow basic serving size guidelines. One serving of meat or fish is approximately 3 ounces. One serving of dairy is approximately 1 cup. One serving of vegetables is approximately 1 cup raw and ½ cup cooked. One serving of whole grains is 1 slice of bread, 1 cup of dry cereal, and ½ cup cooked rice, cereal and pasta. One serving of fruit is 1 medium sized fresh piece (approximately the size of a baseball) and ¼ cup dried. Avoid foods that are very high in fat, sugar, calories and sodium. While they can’t be eliminated completely, a healthy, balanced diet includes a very low percentage of these types of foods. Our bodies need fat, but try to mostly choose healthy fats for your meals. A few healthy fat options are avocados, salmon, albacore tuna, nuts and peanut butter. Address the dietary needs of different age groups. Teenagers and adults over the age of 50 need a lot of calcium in their diets. Small children, adolescent girls, and women of childbearing age need plenty of iron, which you can get from lean meats and cereals (with added nutrients). Women trying to become pregnant need extra folic acid. Elderly adults need to take in extra vitamin D. Accommodating Lifestyle and Allergy Concerns Find out if anyone is vegetarian or vegan. Vegetarians do not eat meat, poultry, or seafood. Some vegetarians don’t eat dairy, so make sure to get the details from them if you’re feeding a vegetarian. Vegans don’t eat meat, poultry, or seafood, or any other animal products (including milk and eggs). Since their diets are somewhat restricted, vegans and vegetarians need a lot of variety in their food choices in order to meet their nutrition needs. Some food options that are popular among vegetarians and vegans are kale, grains, nuts, legumes, and beans. Inquire about food allergies and intolerances. Some people have negative, sometimes even life-threatening, reactions to specific kinds of foods, so make sure to ask about them. The Mayo Clinic names eggs, milk, peanuts, shellfish, tree nuts, soy and fish as some of the most common food allergens. Wheat is another big one. Common food intolerances are lactose (which is in milk products), MSG and gluten (which is in bread, pasta, and many wheat products). Find out if anyone is on a special diet for other health reasons. People with heart disease, high cholesterol levels and high blood pressure need to avoid certain foods to maintain good health. Some of the major foods they should avoid are processed meats, highly refined and processed carbohydrates, and sodas and other types of sugary drinks. Diabetics also need to avoid certain foods to maintain proper insulin levels, so be sure to ask about this one, too. Inquire about religion-related food restrictions. Some people don’t eat certain foods because of their religion. There are many different types of religions with food restrictions, and the restrictions themselves vary from religion to religion. Some religions have food restrictions only at certain times of the year, so be sure to ask about the details. Sticking To a Budget Plan ahead. The best way to stick to a budget is to plan your meals one week in advance. Decide which meals you want to make for the upcoming week and make a detailed grocery list of needed ingredients. Be sure to take the list with you when you go shopping, so that you’ll only pick up the items that you need. Check out current grocery store sales. As you’re planning your meals, take into account which food products are on sale and where, and do your shopping at those places. By sticking to your shopping list and creating planned meals around sales, you can save even more money. Don’t forget to check the newspaper for coupons and additional ways to save. Use seasonal fruits and vegetables. Not only will seasonal fruits and veggies be easier to find, they will also be available in abundance for a much lower price than usual. When they’re in season, fruits and veggies tend to be at their tastiest, making them ideal foods to stock up on. When fruit and vegetables aren’t in season, buy canned or frozen varieties, which are generally cheaper while still offering great nutritional benefits. Along with your local grocery stores’ produce section, also check out any farmer’s markets in your area for even more options and organic produce at a low price. Incorporate foods that you already have and buy low-cost items. Check out what’s currently in your pantry. For instance, do you have some canned food items pushed to the very back of your pantry that have been in there awhile? Plan a few meals around those. According to the USDA, the least-expensive vegetables are eggplants, lettuce, carrots and tomatillos. The least-expensive fruits are apples, peaches, pineapples, pears, bananas and watermelon. For low-cost sources of protein, opt for canned tuna, ground beef and eggs. Checking Availability of Ingredients and Resources Plan according to how much time you have to cook. Take into account how much time you have each day to cook. For instance, if you work 8 or more hours per day, you’re going to have less time available for preparing meals. Plan meals that are faster and easier to prepare. Invest in a crock pot. You do a quick prep the night before, toss everything in the crock pot the next morning, turn it on and you're done! When you arrive back home later that evening, your meal will be waiting for you. Cook large batches and freeze portions for later meals. Use canned items, like beans, for a quicker meal prep. No hours of soaking required. When you're short on time, use frozen vegetables instead of fresh. Frozen veggies are still nutritious, and you'll save tons of prep time. Explore new recipes that incorporate baking, grilling and sauteing. Baking casseroles, for example, generally requires a short prep time and once you pop it in the oven, you don't have to babysit it. Make sure you have the right equipment. Be certain that you have the cookware, utensils, dishes and other items required for the meals you’re planning on hand before you buy all of the ingredients to make them. If you are planning large meals with the intention of having leftovers, make sure you have enough storage containers and Tupperware to accommodate everything. Confirm that the ingredients can be easily attained. Avoid recipes that require fruits and vegetables that are out of season. Also avoid recipes that require gourmet ingredients or any other hard-to-find items. If you’re planning large meals, make sure the ingredients you need can be easily obtained in large quantities. Avoid elaborate food preparation unless you have help. If you’re cooking alone, don’t plan elaborate or complex meals that require a lot of preparation. Plan meals that you can easily handle yourself, unless you have people around in your house that can assist you.",
  "tyn_model":[
    "vegetables",
    "nuts",
    "fruits",
    "veggies",
    "grains",
    "fish",
    "cereal",
    "fruit",
    "tuna",
    "poultry",
    "beans",
    "eggs",
    "low-fat dairy products",
    "plant-derived foods",
    "low-fat dairy",
    "food",
    "dairy",
    "bread",
    "pasta",
    "avocados",
    "salmon",
    "peanut butter",
    "calcium",
    "iron",
    "cereals",
    "seafood",
    "kale",
    "legumes",
    "milk",
    "peanuts",
    "shellfish",
    "wheat",
    "gluten",
    "’ produce",
    "produce",
    "foods",
    "eggplants",
    "lettuce",
    "carrots",
    "apples",
    "peaches",
    "pineapples",
    "pears",
    "bananas",
    "watermelon",
    "ground beef",
    "crock pot",
    "crock",
    "pot",
    "oven",
    "cookware",
    "dishes",
    "tupperware"
  ],
  "tyn_section":[

  ]
}