{
  "title":"How to Drive Props in Garry's Mod",
  "url":"https://www.wikihow.com/Drive-Props-in-Garry%27s-Mod",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Garry's Mod"
  ],
  "methods":[
    {
      "name":"Combining a Drivable and Non-Drivable Vehicle Using \"No Collide\"",
      "steps":[
        {
          "headline":"Go to the Spawn Menu by pressing Q.",
          "description":"Then select Half-Life 2 > Vehicles (or any other tab with vehicle props), and spawn it."
        },
        {
          "headline":"Spawn a drivable vehicle by going to the Spawn Menu > Vehicles.",
          "description":"Then spawn a car of any kind (i.g. TDM cars)."
        },
        {
          "headline":"Go to the Tools tab in the Spawn menu.",
          "description":"When in the Tools tab, select the No-Collide Tool."
        },
        {
          "headline":"Using No-Collide, right-click on the prop.",
          "description":"Then click on the drivable car. That should combine them without any problems."
        },
        {
          "headline":"Select the Physics Gun and put the prop car inside the drivable car.",
          "description":"Make sure that both driver's seats are aligned."
        },
        {
          "headline":"Use the Weld Tool and weld the 2 cars together (Spawn Menu > Tools > Weld).",
          "description":""
        },
        {
          "headline":"Use the Color Tool (Spawn Menu > Tools > Color) and make the drivable car 100% transparent.",
          "description":""
        }
      ]
    },
    {
      "name":"Using an Addon",
      "steps":[
        {
          "headline":"Press ⇧ Shift+Tab ↹ to open the Steam overlay.",
          "description":"Then click on the Web Browser button."
        },
        {
          "headline":"Go to Pause Menu > Addons > Open Workshop.",
          "description":""
        },
        {
          "headline":"Use the Search Bar to search for addons that might help you out.",
          "description":"Try searching \"Driveable Props Tool\" or similar searches like it."
        }
      ]
    }
  ],
  "text":" Combining a Drivable and Non-Drivable Vehicle Using \"No Collide\" Go to the Spawn Menu by pressing Q. Then select Half-Life 2 > Vehicles (or any other tab with vehicle props), and spawn it. Spawn a drivable vehicle by going to the Spawn Menu > Vehicles. Then spawn a car of any kind (i.g. TDM cars). Go to the Tools tab in the Spawn menu. When in the Tools tab, select the No-Collide Tool. Using No-Collide, right-click on the prop. Then click on the drivable car. That should combine them without any problems. Select the Physics Gun and put the prop car inside the drivable car. Make sure that both driver's seats are aligned. Use the Weld Tool and weld the 2 cars together (Spawn Menu > Tools > Weld).  Use the Color Tool (Spawn Menu > Tools > Color) and make the drivable car 100% transparent.  Using an Addon Press ⇧ Shift+Tab ↹ to open the Steam overlay. Then click on the Web Browser button. Go to Pause Menu > Addons > Open Workshop.  Use the Search Bar to search for addons that might help you out. Try searching \"Driveable Props Tool\" or similar searches like it.",
  "tyn_model":[
    "half-life 2",
    "car",
    "physics gun",
    "⇧ shift+tab",
    "↹ to",
    "web browser",
    "driveable props"
  ],
  "tyn_section":[

  ]
}