{
  "title":"How to Make Your Bedroom Asthma Friendly",
  "url":"https://www.wikihow.com/Make-Your-Bedroom-Asthma-Friendly",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Removing Dust and Dust Mites",
      "steps":[
        {
          "headline":"Vacuum your bedroom once a week.",
          "description":"Use a vacuum that employs a HEPA filter or another small-pore, multi-layered vacuum bag designed to help trap allergens. Vacuums with motorized heads are also recommended, as they are better at capturing the dust that the vacuum agitates. Be sure to get into every nook and cranny in your room each time you vacuum. Vacuum any carpeted areas in your home twice a week, making sure to slowly vacuum the entire surface. If someone who is not asthmatic is able to do so for you, have them do so when you are not around. If you must do the vacuuming yourself, wear a face mask while you do so. If you have the option, get rid of the carpeting and have hardwood floors in your bedroom."
        },
        {
          "headline":"Dust your bedroom once a week.",
          "description":"Ideally, use a damp microfiber cloth to dust every hard horizontal surface in the room. The dampness of the cloth helps you capture particles, as opposed to simply agitating them back into the air. Don't forget hidden and hard to reach spots. For instance, if you keep items on shelves, remove them to dust behind them — and dust the item itself, too."
        },
        {
          "headline":"Remove carpeting from your bedroom.",
          "description":"Carpeting, especially wall-to-wall carpeting, should be removed from any room in which an asthmatic person sleeps. In fact, you may want to remove wall-to-wall carpeting from your entire home, as carpeting is a haven for the allergens that can trigger your asthma. Replace with wood, vinyl, or tile flooring, and mop the floor weekly. Wash any small rugs once a week in hot water."
        },
        {
          "headline":"Wash window coverings regularly.",
          "description":"Any window coverings you use in your bedroom should be easy to remove and wash. Simple coverings that do not need to be dry cleaned are ideal. Wash in hot water. Remove blinds from your bedroom, as they are especially proficient at catching and collecting dust. Avoid coverings with heavy material or deep folds, such as Venetian blinds."
        },
        {
          "headline":"Reduce clutter.",
          "description":"Remove anything upholstered — such as furniture or pillows — from your bedroom. Further, do not use your bedroom for storage. Boxes of knickknacks and stacks of books often collect particles that can trigger your asthma. Even picture frames and houseplants are best kept in another room. Do not leave piles of clothes around your room. If there is a closet in your bedroom, use it only for clothing. Always dust and vacuum the closet whenever cleaning the bedroom. Never hang clothes in your bedroom or closet before they are fully dry."
        },
        {
          "headline":"Keep walls free of adornment.",
          "description":"Anything hung on the wall of your bedroom risks gathering dust and other potential triggers. This includes things like frames, wreaths, tapestries, and even posters. Structural adornments such as shelves are particularly problematic, as they are effectively dust collectors. In short, the less on your walls, the better."
        },
        {
          "headline":"Keep your pets out of your bedroom.",
          "description":"Not only may your pet be a source of asthma triggers, they may also carry triggers into your bedroom. Pet dander also provides ample food for dust mites. Put their bed outside your room and never allow them on your bed. Brush and groom your pets outdoors and wash them weekly."
        }
      ]
    },
    {
      "name":"Using Allergen-Reducing Bedding",
      "steps":[
        {
          "headline":"Select bedding and pillows made from synthetic materials.",
          "description":"Feather, wool, foam, and down pillows and blankets are rife with potential asthma triggers. Sheets and pillows should be made with Dacron or another synthetic fiber."
        },
        {
          "headline":"Sleep on a bed with wooden or metal frames.",
          "description":"The more soft materials in your bedroom, the more surfaces where dust and dust mites can settle. You may even be able to forego a box spring by employing a solid frame that fully supports your mattress. Avoid using a headboard, as this would be another surface where dust might collect."
        },
        {
          "headline":"Wash and dry bedding in hot water.",
          "description":"Every other week, wash all of your bedding in water that is at least 130°F (54.4°C). Cold water will not kill dust mites. Dry bedding on high heat as well. Never line dry your bedding outdoors, as it may collect pollen that could trigger your asthma. If children regularly sleep in your room, wash and dry any stuffed animal companions in the same manner, once a week. Alternatively, seal the stuffed animal in a plastic bag and place it in the freezer for at least five hours to kill dust mites."
        },
        {
          "headline":"Use mite-proof covers.",
          "description":"Get a mite proof cover for your pillows, your mattress, and even your box spring. You can find these covers at home goods stores or online. While these covers do not need to be washed, wipe them down with your sheets each time you remove the sheets for cleaning. Covers may be labeled either “dust proof” or “mite proof,” and seal around each item via zipper. If your asthma is especially sensitive to dust mites, tape over the zippers with electrical or duct tape."
        }
      ]
    },
    {
      "name":"Maintaining High Air Quality",
      "steps":[
        {
          "headline":"Never allow smoking in your home.",
          "description":"You probably know this one already. Smoke is an extremely common cause of asthma attacks. Don’t allow smoking of any type, anywhere in your home. Similarly, don’t light incense or anything else that produces smoke either."
        },
        {
          "headline":"Heat your home with an electric or gas furnace.",
          "description":"Be sure to change the air filter on the furnace once a month. Add filters to the furnace outlets in your bedroom, and change them biweekly. You can use about ten layers of muslin or cheesecloth to make your own filter for this purpose. Wood stoves and kerosene heaters can create asthma triggers, especially when used in your bedroom."
        },
        {
          "headline":"Air condition with window units or central air.",
          "description":"Whichever type of air conditioning you use, be sure to change and/or clean filters monthly. Avoid using fans of any type in your room, as they may keep asthma triggers suspended in the air. Keep bedroom windows closed, especially during seasons where you’re asthma is triggered outdoors."
        },
        {
          "headline":"Use a dehumidifier.",
          "description":"Especially if you live in a home with a basement, it can help to run a dehumidifier, especially during more humid parts of the year. Since dust mites are more prevalent in high humidity, keep your home below 50% humidity. Avoid using a humidifier, especially in your bedroom, as this can contribute to both mold and increased dust mites, both of which might trigger your asthma."
        }
      ]
    }
  ],
  "text":" Removing Dust and Dust Mites Vacuum your bedroom once a week. Use a vacuum that employs a HEPA filter or another small-pore, multi-layered vacuum bag designed to help trap allergens. Vacuums with motorized heads are also recommended, as they are better at capturing the dust that the vacuum agitates. Be sure to get into every nook and cranny in your room each time you vacuum. Vacuum any carpeted areas in your home twice a week, making sure to slowly vacuum the entire surface. If someone who is not asthmatic is able to do so for you, have them do so when you are not around. If you must do the vacuuming yourself, wear a face mask while you do so. If you have the option, get rid of the carpeting and have hardwood floors in your bedroom. Dust your bedroom once a week. Ideally, use a damp microfiber cloth to dust every hard horizontal surface in the room. The dampness of the cloth helps you capture particles, as opposed to simply agitating them back into the air. Don't forget hidden and hard to reach spots. For instance, if you keep items on shelves, remove them to dust behind them — and dust the item itself, too. Remove carpeting from your bedroom. Carpeting, especially wall-to-wall carpeting, should be removed from any room in which an asthmatic person sleeps. In fact, you may want to remove wall-to-wall carpeting from your entire home, as carpeting is a haven for the allergens that can trigger your asthma. Replace with wood, vinyl, or tile flooring, and mop the floor weekly. Wash any small rugs once a week in hot water. Wash window coverings regularly. Any window coverings you use in your bedroom should be easy to remove and wash. Simple coverings that do not need to be dry cleaned are ideal. Wash in hot water. Remove blinds from your bedroom, as they are especially proficient at catching and collecting dust. Avoid coverings with heavy material or deep folds, such as Venetian blinds. Reduce clutter. Remove anything upholstered — such as furniture or pillows — from your bedroom. Further, do not use your bedroom for storage. Boxes of knickknacks and stacks of books often collect particles that can trigger your asthma. Even picture frames and houseplants are best kept in another room. Do not leave piles of clothes around your room. If there is a closet in your bedroom, use it only for clothing. Always dust and vacuum the closet whenever cleaning the bedroom. Never hang clothes in your bedroom or closet before they are fully dry. Keep walls free of adornment. Anything hung on the wall of your bedroom risks gathering dust and other potential triggers. This includes things like frames, wreaths, tapestries, and even posters. Structural adornments such as shelves are particularly problematic, as they are effectively dust collectors. In short, the less on your walls, the better. Keep your pets out of your bedroom. Not only may your pet be a source of asthma triggers, they may also carry triggers into your bedroom. Pet dander also provides ample food for dust mites. Put their bed outside your room and never allow them on your bed. Brush and groom your pets outdoors and wash them weekly. Using Allergen-Reducing Bedding Select bedding and pillows made from synthetic materials. Feather, wool, foam, and down pillows and blankets are rife with potential asthma triggers. Sheets and pillows should be made with Dacron or another synthetic fiber. Sleep on a bed with wooden or metal frames. The more soft materials in your bedroom, the more surfaces where dust and dust mites can settle. You may even be able to forego a box spring by employing a solid frame that fully supports your mattress. Avoid using a headboard, as this would be another surface where dust might collect. Wash and dry bedding in hot water. Every other week, wash all of your bedding in water that is at least 130°F (54.4°C). Cold water will not kill dust mites. Dry bedding on high heat as well. Never line dry your bedding outdoors, as it may collect pollen that could trigger your asthma. If children regularly sleep in your room, wash and dry any stuffed animal companions in the same manner, once a week. Alternatively, seal the stuffed animal in a plastic bag and place it in the freezer for at least five hours to kill dust mites. Use mite-proof covers. Get a mite proof cover for your pillows, your mattress, and even your box spring. You can find these covers at home goods stores or online. While these covers do not need to be washed, wipe them down with your sheets each time you remove the sheets for cleaning. Covers may be labeled either “dust proof” or “mite proof,” and seal around each item via zipper. If your asthma is especially sensitive to dust mites, tape over the zippers with electrical or duct tape. Maintaining High Air Quality Never allow smoking in your home. You probably know this one already. Smoke is an extremely common cause of asthma attacks. Don’t allow smoking of any type, anywhere in your home. Similarly, don’t light incense or anything else that produces smoke either. Heat your home with an electric or gas furnace. Be sure to change the air filter on the furnace once a month. Add filters to the furnace outlets in your bedroom, and change them biweekly. You can use about ten layers of muslin or cheesecloth to make your own filter for this purpose. Wood stoves and kerosene heaters can create asthma triggers, especially when used in your bedroom. Air condition with window units or central air. Whichever type of air conditioning you use, be sure to change and/or clean filters monthly. Avoid using fans of any type in your room, as they may keep asthma triggers suspended in the air. Keep bedroom windows closed, especially during seasons where you’re asthma is triggered outdoors. Use a dehumidifier. Especially if you live in a home with a basement, it can help to run a dehumidifier, especially during more humid parts of the year. Since dust mites are more prevalent in high humidity, keep your home below 50% humidity. Avoid using a humidifier, especially in your bedroom, as this can contribute to both mold and increased dust mites, both of which might trigger your asthma.",
  "tyn_model":[
    "vacuum",
    "water",
    "carpeting",
    "window coverings",
    "furnace",
    "dehumidifier",
    "vacuum bag",
    "vacuums",
    "face mask",
    "microfiber cloth",
    "— and",
    "— such",
    "— from",
    "shelves",
    "pillows",
    "blankets",
    "freezer",
    "sheets",
    "“dust",
    "” or",
    "“mite",
    "” and",
    "electrical or duct tape",
    "electric or gas furnace",
    "air filter",
    "muslin",
    "kerosene heaters",
    "air conditioning",
    "filters",
    "fans",
    "humidifier"
  ],
  "tyn_section":[

  ]
}