{
  "title":"How to Choose Tortillas",
  "url":"https://www.wikihow.com/Choose-Tortillas",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine"
  ],
  "methods":[
    {
      "name":"Selecting Tortillas Based on Freshness and Brand",
      "steps":[
        {
          "headline":"Check the expiration date.",
          "description":"When choosing a specific package of tortillas, always check the expiration date (or the “sell by date”) before purchasing. If the expiration date is soon—or if the tortillas have already expired—put them back and search for another package, whose expiration date is farther off. It goes without saying that if a package of tortillas is moldy, or if the tortillas are clearly stale, you should not purchase it. If you find that you’ve already purchased a moldy, stale, or expired bag of tortillas, you should be able to take it back to the store where you purchased it, and receive a full refund or store credit."
        },
        {
          "headline":"Consider how long you want to keep the tortillas.",
          "description":"If you’re not planning to eat the entire package of tortillas in the day or two after you purchase it, you’ll need to think about how long the tortillas are likely to be sitting in your pantry. Corn tortillas generally have a great shelf life than their flour counterparts, so if the longevity of the unused tortillas matters, corn may be the more economic option. As a rule of thumb:\nCorn tortillas generally last up to 10 days after the “best by” date if stored in a pantry, up to 8 weeks after the “best by” date if stored in the refrigerator, and up to 8 months after the “best by” date if stored in the freezer. Flour tortillas can last up to seven days after the “best by” date if stored in a pantry, up to four weeks after the “best by” date if stored in the refrigerator, and up to eight months after the “best by” date if stored in the freezer."
        },
        {
          "headline":"Decide between popular grocery-store tortilla brands.",
          "description":"Local grocery stores sell many popular brands of tortillas, which will have small differences in taste, consistency, texture, and other qualities. To decide which you prefer, you could compare two or three in a single sitting, or try a variety of brands over time. Popular tortilla brands include: Mission, Don Marcos, Piñata, and Cruz. If you’re dissatisfied with the tortilla offerings at large chain grocery stores, you’ll be able to find a greater variety of tortilla brands if you look at a health food store or an organic retail store. If you’d like to find more authentic tortillas than those sold in large chain grocery stores, look online to see if there is a farmer’s market or Mexican grocery store in your area."
        }
      ]
    },
    {
      "name":"Deciding Between Flour and Corn",
      "steps":[
        {
          "headline":"Consider the dish you’re making.",
          "description":"Flour tortillas are typically larger than their corn-based counterparts, and are consequently used for burritos, as they’re able to hold more meat, cheese, and beans, without bursting open. Conversely, corn tortillas are often used for soft tacos, which are folded, but not wrapped shut, and almost always used to make enchiladas, in which the tortillas are layered atop one another. The consistency of the tortillas also plays a role. Flour tortillas are smoother and more flexible, while corn tortillas have a slightly grainy texture and can be brittle. When corn tortillas become stale, they can be fried and used as tortilla chips, or used to make taquitos."
        },
        {
          "headline":"Choose corn tortillas for a healthier meal.",
          "description":"Corn tortillas are made from corn, which is a whole grain. Whole grains provide many nutritional benefits, including high amounts of fiber and various vitamins and minerals. Flour tortillas—made from flour, which is a refined and processed grain—do not provide these benefits. Additionally, since corn tortillas are typically smaller than flour tortillas, you’ll consume fewer calories by eating a single corn tortilla than you would eating a single flour tortilla."
        },
        {
          "headline":"Determine which flavor you prefer.",
          "description":"Ultimately, the decision between flour or corn tortillas may come down to a simple taste preference. Flour tortillas have a soft texture and a sweet taste, which tends to be mild. Corn tortillas have a more chewy texture, and also have a more pronounced flavor of roasted corn. If you’re unfamiliar with the differences in their flavor, buy a package of corn tortillas and a package of flour tortillas at your local grocery store."
        },
        {
          "headline":"Look for spinach or whole wheat tortillas.",
          "description":"Although flour and corn tortillas are by far the most common and the most popular types, there are various other types of tortillas which offer new tastes and, in some cases, health benefits. Check your local grocery store—or a health food store—for spinach tortillas. Many commercial brands also offer whole grain tortillas or wheat flour tortillas. Whole grain tortillas are healthier options than generic white flour tortillas, as they’ll contain more healthy nutrients. While spinach tortillas have an appealing taste, they do not offer substantially more health benefits than regular flour tortillas. Spinach tortillas are typically made from white flour, and spinach powder and green food dye are added to them."
        }
      ]
    },
    {
      "name":"Choosing the Number and Size of Tortillas",
      "steps":[
        {
          "headline":"Buy an appropriate number of tortillas for your dining plans.",
          "description":"Tortillas are commonly sold in packages of 8, 10, and 12, but it’s not unusual to find packages of flour tortillas that contain 20 tortillas, and packages of corn tortillas that contain up to 30. In order to avoid wasting food and spending money needlessly, calculate how many tortillas you need in advance. For example, if you’re making enchiladas for a party, you may need two dozen (or more) corn tortillas. If you’re just planning to take burritos for lunch over the course of a week, you only need to buy a small package of eight."
        },
        {
          "headline":"Plan ahead for future tortilla-based meals.",
          "description":"If you’re planning to eat Mexican or Latin American food for a long period of time (for example, a month or more), you may decide to buy a large package of tortillas in advance preparation. In terms of cost effectiveness, buying a larger package of tortillas will result in a lower cost per-tortilla. If you’re undecided about how many tortillas you’ll need, buy two moderate sized packages (for example, containing 10 or 12 tortillas). Use one package immediately, and keep the other in the freezer in case you need more tortillas than the first package contained. When you need to thaw the second package of tortillas, pull it out of the freezer a day or so in advance. If you put the package of tortillas in the refrigerator overnight, the individual tortillas should be thawed by morning. If you need to thaw tortillas more quickly, take the frozen tortillas out of the plastic bag, wrap them in a paper towel, and microwave for about 45 seconds. If the tortillas aren’t thawed after 45 seconds, microwave more as needed."
        },
        {
          "headline":"Purchase an appropriate size of tortilla, based on how you’ll be filling it.",
          "description":"Common tortilla sizes include 4-inch (for corn tortillas) and 7- or 12-inch (for flour tortillas), although tortillas can be sold in sizes reaching up to 24 inches. Plan to purchase a size of tortilla that will match your culinary needs: the tortilla should be larger enough for you to fill it with as much food as you please (for example, if you’re making a burrito), but not so large that you end up throwing part of it away. If you’re making soft tacos or enchiladas, first try using a small size of corn tortilla. If you’re making burritos, first try making them with a standard size of flour tortilla; you can then decide to purchase smaller or larger tortillas in the future, as needed."
        },
        {
          "headline":"Use larger tortillas to make wraps.",
          "description":"Tortillas are commonly used to make wraps, which combine sandwich or salad ingredients into a neatly packaged burrito-like form. Since wraps can include large amounts of several different ingredients, plan to use a large tortilla when making a wrap. If you’d like to try making a wrap but are unfamiliar with common varieties, typical wraps include:\nChicken Caesar wraps, including lettuce, grilled chicken, Caesar dressing, and shredded parmesan cheese. Buffalo chicken wraps, including lettuce, buffalo chicken, buffalo sauce, shredded cheddar cheese, and blue cheese dressing. A sandwich wrap, including your choice of sliced deli meats, cheeses, and mustard or sandwich oil."
        }
      ]
    }
  ],
  "text":" Selecting Tortillas Based on Freshness and Brand Check the expiration date. When choosing a specific package of tortillas, always check the expiration date (or the “sell by date”) before purchasing. If the expiration date is soon—or if the tortillas have already expired—put them back and search for another package, whose expiration date is farther off. It goes without saying that if a package of tortillas is moldy, or if the tortillas are clearly stale, you should not purchase it. If you find that you’ve already purchased a moldy, stale, or expired bag of tortillas, you should be able to take it back to the store where you purchased it, and receive a full refund or store credit. Consider how long you want to keep the tortillas. If you’re not planning to eat the entire package of tortillas in the day or two after you purchase it, you’ll need to think about how long the tortillas are likely to be sitting in your pantry. Corn tortillas generally have a great shelf life than their flour counterparts, so if the longevity of the unused tortillas matters, corn may be the more economic option. As a rule of thumb:\nCorn tortillas generally last up to 10 days after the “best by” date if stored in a pantry, up to 8 weeks after the “best by” date if stored in the refrigerator, and up to 8 months after the “best by” date if stored in the freezer. Flour tortillas can last up to seven days after the “best by” date if stored in a pantry, up to four weeks after the “best by” date if stored in the refrigerator, and up to eight months after the “best by” date if stored in the freezer. Decide between popular grocery-store tortilla brands. Local grocery stores sell many popular brands of tortillas, which will have small differences in taste, consistency, texture, and other qualities. To decide which you prefer, you could compare two or three in a single sitting, or try a variety of brands over time. Popular tortilla brands include: Mission, Don Marcos, Piñata, and Cruz. If you’re dissatisfied with the tortilla offerings at large chain grocery stores, you’ll be able to find a greater variety of tortilla brands if you look at a health food store or an organic retail store. If you’d like to find more authentic tortillas than those sold in large chain grocery stores, look online to see if there is a farmer’s market or Mexican grocery store in your area. Deciding Between Flour and Corn Consider the dish you’re making. Flour tortillas are typically larger than their corn-based counterparts, and are consequently used for burritos, as they’re able to hold more meat, cheese, and beans, without bursting open. Conversely, corn tortillas are often used for soft tacos, which are folded, but not wrapped shut, and almost always used to make enchiladas, in which the tortillas are layered atop one another. The consistency of the tortillas also plays a role. Flour tortillas are smoother and more flexible, while corn tortillas have a slightly grainy texture and can be brittle. When corn tortillas become stale, they can be fried and used as tortilla chips, or used to make taquitos. Choose corn tortillas for a healthier meal. Corn tortillas are made from corn, which is a whole grain. Whole grains provide many nutritional benefits, including high amounts of fiber and various vitamins and minerals. Flour tortillas—made from flour, which is a refined and processed grain—do not provide these benefits. Additionally, since corn tortillas are typically smaller than flour tortillas, you’ll consume fewer calories by eating a single corn tortilla than you would eating a single flour tortilla. Determine which flavor you prefer. Ultimately, the decision between flour or corn tortillas may come down to a simple taste preference. Flour tortillas have a soft texture and a sweet taste, which tends to be mild. Corn tortillas have a more chewy texture, and also have a more pronounced flavor of roasted corn. If you’re unfamiliar with the differences in their flavor, buy a package of corn tortillas and a package of flour tortillas at your local grocery store. Look for spinach or whole wheat tortillas. Although flour and corn tortillas are by far the most common and the most popular types, there are various other types of tortillas which offer new tastes and, in some cases, health benefits. Check your local grocery store—or a health food store—for spinach tortillas. Many commercial brands also offer whole grain tortillas or wheat flour tortillas. Whole grain tortillas are healthier options than generic white flour tortillas, as they’ll contain more healthy nutrients. While spinach tortillas have an appealing taste, they do not offer substantially more health benefits than regular flour tortillas. Spinach tortillas are typically made from white flour, and spinach powder and green food dye are added to them. Choosing the Number and Size of Tortillas Buy an appropriate number of tortillas for your dining plans. Tortillas are commonly sold in packages of 8, 10, and 12, but it’s not unusual to find packages of flour tortillas that contain 20 tortillas, and packages of corn tortillas that contain up to 30. In order to avoid wasting food and spending money needlessly, calculate how many tortillas you need in advance. For example, if you’re making enchiladas for a party, you may need two dozen (or more) corn tortillas. If you’re just planning to take burritos for lunch over the course of a week, you only need to buy a small package of eight. Plan ahead for future tortilla-based meals. If you’re planning to eat Mexican or Latin American food for a long period of time (for example, a month or more), you may decide to buy a large package of tortillas in advance preparation. In terms of cost effectiveness, buying a larger package of tortillas will result in a lower cost per-tortilla. If you’re undecided about how many tortillas you’ll need, buy two moderate sized packages (for example, containing 10 or 12 tortillas). Use one package immediately, and keep the other in the freezer in case you need more tortillas than the first package contained. When you need to thaw the second package of tortillas, pull it out of the freezer a day or so in advance. If you put the package of tortillas in the refrigerator overnight, the individual tortillas should be thawed by morning. If you need to thaw tortillas more quickly, take the frozen tortillas out of the plastic bag, wrap them in a paper towel, and microwave for about 45 seconds. If the tortillas aren’t thawed after 45 seconds, microwave more as needed. Purchase an appropriate size of tortilla, based on how you’ll be filling it. Common tortilla sizes include 4-inch (for corn tortillas) and 7- or 12-inch (for flour tortillas), although tortillas can be sold in sizes reaching up to 24 inches. Plan to purchase a size of tortilla that will match your culinary needs: the tortilla should be larger enough for you to fill it with as much food as you please (for example, if you’re making a burrito), but not so large that you end up throwing part of it away. If you’re making soft tacos or enchiladas, first try using a small size of corn tortilla. If you’re making burritos, first try making them with a standard size of flour tortilla; you can then decide to purchase smaller or larger tortillas in the future, as needed. Use larger tortillas to make wraps. Tortillas are commonly used to make wraps, which combine sandwich or salad ingredients into a neatly packaged burrito-like form. Since wraps can include large amounts of several different ingredients, plan to use a large tortilla when making a wrap. If you’d like to try making a wrap but are unfamiliar with common varieties, typical wraps include:\nChicken Caesar wraps, including lettuce, grilled chicken, Caesar dressing, and shredded parmesan cheese. Buffalo chicken wraps, including lettuce, buffalo chicken, buffalo sauce, shredded cheddar cheese, and blue cheese dressing. A sandwich wrap, including your choice of sliced deli meats, cheeses, and mustard or sandwich oil.",
  "tyn_model":[
    "tortillas",
    "corn tortillas",
    "tortilla",
    "flour",
    "“best",
    "” date",
    "flour tortillas",
    "—or",
    "corn",
    "refrigerator",
    "freezer",
    "corn tortilla",
    "spinach tortillas",
    "microwave",
    "lettuce",
    "“sell",
    "”)",
    "—put",
    "piñata",
    "tortilla chips",
    "—made",
    "—do",
    "flour tortilla",
    "whole wheat tortillas",
    "health food store",
    "—for",
    "wheat flour tortillas",
    "white flour tortillas",
    "spinach powder",
    "green food dye",
    "burritos",
    "plastic bag",
    "paper towel",
    "grilled chicken",
    "caesar dressing",
    "shredded parmesan cheese",
    "buffalo chicken wraps",
    "buffalo chicken",
    "buffalo sauce",
    "shredded cheddar cheese",
    "blue cheese dressing",
    "sandwich wrap",
    "mustard or sandwich oil"
  ],
  "tyn_section":[

  ]
}