{
  "title":"How to Make Galaxy Bark",
  "url":"https://www.wikihow.com/Make-Galaxy-Bark",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Sugar Treats"
  ],
  "steps":[
    {
      "headline":"Melt the black candy melts.",
      "description":"In a microwave-safe bowl, heat up the black candy melts until they completely melt, stirring with a spoon every 30 seconds."
    },
    {
      "headline":"Line a 9 x 13 baking pan with foil.",
      "description":"Pour the melted black candy melts on the baking pan."
    },
    {
      "headline":"Melt the rest of the candy melt colors in the microwave.",
      "description":"Repeat the same process you did for the black candy melts."
    },
    {
      "headline":"Dollop the melted candy melt colors onto the black layer.",
      "description":""
    },
    {
      "headline":"Using a knife, gently swirl the colors around to make it look like a galaxy.",
      "description":""
    },
    {
      "headline":"Sprinkle the star-shaped sprinkles all over the bark.",
      "description":""
    },
    {
      "headline":"Allow the galaxy bark to harden for about 1-2 hours.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Sprinkle the edible glitter all over the bark. Slice it into pieces using a knife and serve on a serving plate. Enjoy!"
    }
  ],
  "text":" Melt the black candy melts. In a microwave-safe bowl, heat up the black candy melts until they completely melt, stirring with a spoon every 30 seconds. Line a 9 x 13 baking pan with foil. Pour the melted black candy melts on the baking pan. Melt the rest of the candy melt colors in the microwave. Repeat the same process you did for the black candy melts. Dollop the melted candy melt colors onto the black layer.  Using a knife, gently swirl the colors around to make it look like a galaxy.  Sprinkle the star-shaped sprinkles all over the bark.  Allow the galaxy bark to harden for about 1-2 hours.  Serve. Sprinkle the edible glitter all over the bark. Slice it into pieces using a knife and serve on a serving plate. Enjoy!",
  "tyn_model":[
    "candy melt",
    "knife",
    "microwave-safe bowl",
    "spoon",
    "9 x 13 baking pan",
    "foil",
    "baking pan",
    "microwave",
    "edible glitter",
    "serving plate"
  ],
  "tyn_section":[

  ]
}