{
  "title":"How to Make Red Velvet Banana Bread",
  "url":"https://www.wikihow.com/Make-Red-Velvet-Banana-Bread",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350° Fahrenheit (176° Celsius).",
      "description":""
    },
    {
      "headline":"Grease a loaf pan with non-stick greasing spray.",
      "description":""
    },
    {
      "headline":"In a large bowl, mash the ripe bananas with a potato masher until well-mashed.",
      "description":""
    },
    {
      "headline":"Pour the melted butter and mix with a whisk.",
      "description":""
    },
    {
      "headline":"Pour the cake mix and add the buttermilk.",
      "description":"Mix until well combined."
    },
    {
      "headline":"Crack in both eggs and mix until the batter is smooth and creamy.",
      "description":""
    },
    {
      "headline":"Pour the batter into the loaf pan and scrape it out using a rubber spatula.",
      "description":""
    },
    {
      "headline":"Bake the banana bread for about 45-50 minutes, until lightly golden brown on the top.",
      "description":""
    },
    {
      "headline":"Allow the loaf to cool on a wire rack for about 10 minutes.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Slice the banana bread into slices and place them onto serving plate. Garnish with any desired toppings such as whipped cream or chocolate chips. Enjoy!"
    }
  ],
  "text":" Preheat the oven to 350° Fahrenheit (176° Celsius).  Grease a loaf pan with non-stick greasing spray.  In a large bowl, mash the ripe bananas with a potato masher until well-mashed.  Pour the melted butter and mix with a whisk.  Pour the cake mix and add the buttermilk. Mix until well combined. Crack in both eggs and mix until the batter is smooth and creamy.  Pour the batter into the loaf pan and scrape it out using a rubber spatula.  Bake the banana bread for about 45-50 minutes, until lightly golden brown on the top.  Allow the loaf to cool on a wire rack for about 10 minutes.  Serve. Slice the banana bread into slices and place them onto serving plate. Garnish with any desired toppings such as whipped cream or chocolate chips. Enjoy!",
  "tyn_model":[
    "loaf pan",
    "banana bread",
    "oven",
    "non-stick greasing spray",
    "large bowl",
    "bananas",
    "potato masher",
    "butter",
    "whisk",
    "cake mix",
    "buttermilk",
    "eggs",
    "rubber spatula",
    "wire rack",
    "whipped cream",
    "chocolate chips"
  ],
  "tyn_section":[

  ]
}