{
  "title":"How to Make Star Fruit Upside Down Cake",
  "url":"https://www.wikihow.com/Make-Star-Fruit-Upside-Down-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Fruit Cakes"
  ],
  "steps":[
    {
      "headline":"Place a rack in the middle of the oven.",
      "description":""
    },
    {
      "headline":"Preheat the oven to 360 °F (182 °C).",
      "description":""
    },
    {
      "headline":"In the skillet, over medium heat, combine 1/3 cup sugar and 3-4 Tablespoons water, stirring until sugar dissolves.",
      "description":""
    },
    {
      "headline":"Increase the heat and bring the syrup to a boil without stirring, until the syrup is golden amber, about 4 minutes.",
      "description":"Brush down sides of skillet with a wet pastry brush to dissolve any stray sugar crystals."
    },
    {
      "headline":"When the syrup is a light golden color, remove it from the heat and stir in 2 Tablespoons butter.",
      "description":"Set aside."
    },
    {
      "headline":"Cut off the pointy tip of the star fruit, then slice about ⁄8 inch (0.3 cm) thick.",
      "description":"Remove large seeds with the point of your knife."
    },
    {
      "headline":"Arrange the stars in the skillet on top of the syrup.",
      "description":"Fit the stars together without overlapping."
    },
    {
      "headline":"Whisk together flour, polenta, baking powder, and salt and set aside.",
      "description":""
    },
    {
      "headline":"In a second bowl make the batter.",
      "description":"Beat the remaining 3/4 cup sugar, remaining butter, and two egg yolks together until light and doubled in volume."
    },
    {
      "headline":"Stir in  flavoring or zest.",
      "description":""
    },
    {
      "headline":"Add flour mixture alternately with 1 tablespoon milk at a time, beating after each addition only until combined.",
      "description":""
    },
    {
      "headline":"In a large clean bowl beat egg whites until soft peaks form.",
      "description":""
    },
    {
      "headline":"Beat in remaining 1 Tablespoon sugar until egg whites are stiff but not dry.",
      "description":""
    },
    {
      "headline":"Fold about 1/3 of the egg whites into the batter to lighten the batter; then fold in remaining egg whites in 2-3 additions.",
      "description":""
    },
    {
      "headline":"Drop the batter in large dollops on top of the star fruit slices in the skillet, then spread batter evenly over the fruit using the back of the spatula.",
      "description":""
    },
    {
      "headline":"Bake the cake, in the skillet, for about 45 minutes, or until a cake tester inserted into center comes out clean.",
      "description":"Allow to cool in the skillet on top of the stove for about 10 minutes."
    },
    {
      "headline":"Run a thin spatula around the edges of the cake to loosen.",
      "description":""
    },
    {
      "headline":"Now for the tricky part: Center a plate with about a 12-inch diameter upside down over the 10-inch diameter skillet.",
      "description":"Using oven mitts, hold the plate and skillet firmly together and invert, so that the plate in now underneath and the skillet on top."
    },
    {
      "headline":"Allow cake to slide down onto the plate, then remove the skillet.",
      "description":"Rearrange any stars that have slipped out of place."
    },
    {
      "headline":"Cool cake completely at room temperature before serving.",
      "description":""
    },
    {
      "headline":"Serve slices of cake with whipped cream or for a more gourmet touch, serve with whipped crème fraîche.",
      "description":""
    }
  ],
  "text":" Place a rack in the middle of the oven.  Preheat the oven to 360 °F (182 °C).  In the skillet, over medium heat, combine 1/3 cup sugar and 3-4 Tablespoons water, stirring until sugar dissolves.  Increase the heat and bring the syrup to a boil without stirring, until the syrup is golden amber, about 4 minutes. Brush down sides of skillet with a wet pastry brush to dissolve any stray sugar crystals. When the syrup is a light golden color, remove it from the heat and stir in 2 Tablespoons butter. Set aside. Cut off the pointy tip of the star fruit, then slice about ⁄8 inch (0.3 cm) thick. Remove large seeds with the point of your knife. Arrange the stars in the skillet on top of the syrup. Fit the stars together without overlapping. Whisk together flour, polenta, baking powder, and salt and set aside.  In a second bowl make the batter. Beat the remaining 3/4 cup sugar, remaining butter, and two egg yolks together until light and doubled in volume. Stir in  flavoring or zest.  Add flour mixture alternately with 1 tablespoon milk at a time, beating after each addition only until combined.  In a large clean bowl beat egg whites until soft peaks form.  Beat in remaining 1 Tablespoon sugar until egg whites are stiff but not dry.  Fold about 1/3 of the egg whites into the batter to lighten the batter; then fold in remaining egg whites in 2-3 additions.  Drop the batter in large dollops on top of the star fruit slices in the skillet, then spread batter evenly over the fruit using the back of the spatula.  Bake the cake, in the skillet, for about 45 minutes, or until a cake tester inserted into center comes out clean. Allow to cool in the skillet on top of the stove for about 10 minutes. Run a thin spatula around the edges of the cake to loosen.  Now for the tricky part: Center a plate with about a 12-inch diameter upside down over the 10-inch diameter skillet. Using oven mitts, hold the plate and skillet firmly together and invert, so that the plate in now underneath and the skillet on top. Allow cake to slide down onto the plate, then remove the skillet. Rearrange any stars that have slipped out of place. Cool cake completely at room temperature before serving.  Serve slices of cake with whipped cream or for a more gourmet touch, serve with whipped crème fraîche. ",
  "tyn_model":[
    "skillet",
    "sugar",
    "plate",
    "oven",
    "butter",
    "flour",
    "spatula",
    "water",
    "wet pastry brush",
    "baking powder",
    "salt",
    "bowl",
    "milk",
    "large clean bowl",
    "star fruit",
    "cake tester",
    "stove",
    "oven mitts",
    "cake",
    "whipped cream",
    "whipped crème fraîche"
  ],
  "tyn_section":[

  ]
}