{
  "title":"How to Use Sambal Oelek",
  "url":"https://www.wikihow.com/Use-Sambal-Oelek",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Indonesian Dishes"
  ],
  "methods":[
    {
      "name":"Using Sambal Oelek in Everyday Meals",
      "steps":[
        {
          "headline":"Use it wherever you’d use hot sauce.",
          "description":"Sambal oelek goes wherever hot sauce goes. Try using it to dip fries, as a topping for cooked meat, or to spice up your tomato sauce. If you like to use hot sauce when you make scrambled eggs, try whisking in some sambal oelek instead. A little goes a long way, so even a half teaspoon or so will add lots of heat to your meal. You can store open containers in the fridge for a few months."
        },
        {
          "headline":"Marinate meat with sambal oelek.",
          "description":"Sambal oelek can be a marinade on its own or be used as a component in a marinade. You can salt your cut of meat first, rub it down a couple tablespoons with sambal oelek, and refrigerate it for a few hours or overnight. Try adding garlic, mint or other herbs, and a flavored vinegar for a more complex marinade. Sambal oelek is an especially tasty in marinades for lamb."
        },
        {
          "headline":"Add it to soups and stir fries.",
          "description":"Spice up your soups and stir fries by adding a tablespoon of sambal oelek either during the cooking process or as an attractive garnish. When preparing a stir fry, add it when you’re nearly done cooking, letting it sizzle in for about a minute. With a gorgeous color and consistency, it’ll also make an attractive and flavorful garnish for any soup or noodle dish. If you’re serving soup to your guests, try including a small bowl of sambal oelek on the side for garnish, just in case your guests can’t handle the heat."
        },
        {
          "headline":"Spice up dips with sambal oelek.",
          "description":"Making unique, flavorful dips for chips, fries, or veggie sticks is easy. Try mixing a cup (240 mL) of sour cream with one tablespoon plus one teaspoon of sambal oelek. Season the dip with coarse salt to your liking, and serve it as a casual finger food at your next event. You can prepare the dip ahead of time and refrigerate it for up to two days before serving it."
        }
      ]
    },
    {
      "name":"Trying Tasty Recipes",
      "steps":[
        {
          "headline":"Bake hot chicken wings.",
          "description":"Rub the spices into the wings using a mixing bowl or by tossing them in a large freezer bag, then refrigerate them, sealed, for at least an hour. Line them up skin side down on greased sheet pans, and bake them in an oven preheated to 400 degrees F (204 C) for 25 minutes. Flip the wings, turn the oven up to 425 degrees F (218 C), and bake until they’re crispy, or another 20 to 25 minutes. Be sure not to crowd the wings on the sheet pan, or they’ll steam instead of bake. Prepare your wing sauce while the wings are baking. Bring the ingredients to a simmer in a small sauce pan. When the wings are finished, remove them from the oven, place them in a large mixing bowl, and toss the sauce over them evenly."
        },
        {
          "headline":"Prepare a sweet and spicy rojak salad.",
          "description":"Press the tofu into clean clothes or towels to release moisture, cut it into bite-sized cubes, and fry them on all sides in an oil coated skillet over medium-high heat. Transfer them to a towel-lined plate, then whisk together the tamarind, vinegar, sugar, sambal, and salt to make the dressing. Toss all the other ingredients together along with the tofu and dressing to complete the salad. If you’re serving the salad right away, try making the dressing in the same bowl that you’ll use to assemble the salad. It’ll be easier to evenly cover the ingredients with the dressing, and you’ll have one less bowl to wash."
        },
        {
          "headline":"Cook a simple veggie stir fry.",
          "description":"Heat oil in a large frying pan or wok, then cook the onions until they’re soft. Add the mushrooms then, after they’ve softened, add the garlic, soy sauce, and sambal and cook for two minutes. Next add the broccoli, cook them for two minutes, then the peppers, and after a couple minutes, finish by adding the zucchini. Be sure to stir constantly to distribute flavors and evenly cook the veggies. When it’s done, serve over your choice of rice or noodles. When you make a stir fry, it’s important to have all of your ingredients assembled and ready to cook. You won’t have time to walk away from the sizzling pan to grab or slice something."
        },
        {
          "headline":"Make a chili and cucumber margarita.",
          "description":"Combine 1/2 cup (120 mL) of peeled, seeded, and diced cucumber with a tablespoon of sambal oelek. Chill the mixture in the refrigerator for 4 hours, then mix 1 to 2 tablespoons into your favorite refreshing beverage, like a margarita. To make four margarita servings, mix 1 1/4 cup (300 mL) fresh squeezed lime juice, 1 cup (240 mL) blanco tequila, and 1/3 cup (80 mL) each of orange liqueur and fine grain sugar. You can also boil equal parts sugar and water together to make a simple syrup instead of using fine grain sugar. For a non-alcoholic beverage, try substituting the tequila with soda water, lime soda, or seltzer."
        }
      ]
    },
    {
      "name":"Making Your Own Sambal Oelek",
      "steps":[
        {
          "headline":"Grab your ingredients and equipment.",
          "description":"Assemble your ingredients and grab a mortar and pestle. If you don’t have a mortar and pestle, you can use a food processor large enough to accommodate a pound (454 grams) of chilies. Using a mortar and pestle is the traditional method. Oelek, or ulek, refers to the pestle that’s used to grind the chilies."
        },
        {
          "headline":"Grind or blend red chilies with salt.",
          "description":"Place the chilies and salt in your mortar or in the work bowl of your food processor. Use your pestle to grind the chilies until they form a paste, working in batches as large as your mortar can handle. If you’re using a processor, pulse the chilies and pause to scrape the sides of the bowl as necessary."
        },
        {
          "headline":"Add rice vinegar, lime juice, and garlic for more complex flavor.",
          "description":"While authentic sambal oelek is a simple celebration of raw chili flavor, you can customize your condiment to your own tastes. Experiment with varying levels of sweetness and acidity to find your favorite flavors. Try adding a couple tablespoons of vinegar and lime juice for more acidity. These will also help you sambal stay fresh longer. Add sweetness with one or two tablespoons of brown or palm sugar. You can also mince a few cloves of garlic and add it to your sambal (just keep in mind authentic sambal oelek does not contain garlic)."
        }
      ]
    }
  ],
  "text":" Using Sambal Oelek in Everyday Meals Use it wherever you’d use hot sauce. Sambal oelek goes wherever hot sauce goes. Try using it to dip fries, as a topping for cooked meat, or to spice up your tomato sauce. If you like to use hot sauce when you make scrambled eggs, try whisking in some sambal oelek instead. A little goes a long way, so even a half teaspoon or so will add lots of heat to your meal. You can store open containers in the fridge for a few months. Marinate meat with sambal oelek. Sambal oelek can be a marinade on its own or be used as a component in a marinade. You can salt your cut of meat first, rub it down a couple tablespoons with sambal oelek, and refrigerate it for a few hours or overnight. Try adding garlic, mint or other herbs, and a flavored vinegar for a more complex marinade. Sambal oelek is an especially tasty in marinades for lamb. Add it to soups and stir fries. Spice up your soups and stir fries by adding a tablespoon of sambal oelek either during the cooking process or as an attractive garnish. When preparing a stir fry, add it when you’re nearly done cooking, letting it sizzle in for about a minute. With a gorgeous color and consistency, it’ll also make an attractive and flavorful garnish for any soup or noodle dish. If you’re serving soup to your guests, try including a small bowl of sambal oelek on the side for garnish, just in case your guests can’t handle the heat. Spice up dips with sambal oelek. Making unique, flavorful dips for chips, fries, or veggie sticks is easy. Try mixing a cup (240 mL) of sour cream with one tablespoon plus one teaspoon of sambal oelek. Season the dip with coarse salt to your liking, and serve it as a casual finger food at your next event. You can prepare the dip ahead of time and refrigerate it for up to two days before serving it. Trying Tasty Recipes Bake hot chicken wings. Rub the spices into the wings using a mixing bowl or by tossing them in a large freezer bag, then refrigerate them, sealed, for at least an hour. Line them up skin side down on greased sheet pans, and bake them in an oven preheated to 400 degrees F (204 C) for 25 minutes. Flip the wings, turn the oven up to 425 degrees F (218 C), and bake until they’re crispy, or another 20 to 25 minutes. Be sure not to crowd the wings on the sheet pan, or they’ll steam instead of bake. Prepare your wing sauce while the wings are baking. Bring the ingredients to a simmer in a small sauce pan. When the wings are finished, remove them from the oven, place them in a large mixing bowl, and toss the sauce over them evenly. Prepare a sweet and spicy rojak salad. Press the tofu into clean clothes or towels to release moisture, cut it into bite-sized cubes, and fry them on all sides in an oil coated skillet over medium-high heat. Transfer them to a towel-lined plate, then whisk together the tamarind, vinegar, sugar, sambal, and salt to make the dressing. Toss all the other ingredients together along with the tofu and dressing to complete the salad. If you’re serving the salad right away, try making the dressing in the same bowl that you’ll use to assemble the salad. It’ll be easier to evenly cover the ingredients with the dressing, and you’ll have one less bowl to wash. Cook a simple veggie stir fry. Heat oil in a large frying pan or wok, then cook the onions until they’re soft. Add the mushrooms then, after they’ve softened, add the garlic, soy sauce, and sambal and cook for two minutes. Next add the broccoli, cook them for two minutes, then the peppers, and after a couple minutes, finish by adding the zucchini. Be sure to stir constantly to distribute flavors and evenly cook the veggies. When it’s done, serve over your choice of rice or noodles. When you make a stir fry, it’s important to have all of your ingredients assembled and ready to cook. You won’t have time to walk away from the sizzling pan to grab or slice something. Make a chili and cucumber margarita. Combine 1/2 cup (120 mL) of peeled, seeded, and diced cucumber with a tablespoon of sambal oelek. Chill the mixture in the refrigerator for 4 hours, then mix 1 to 2 tablespoons into your favorite refreshing beverage, like a margarita. To make four margarita servings, mix 1 1/4 cup (300 mL) fresh squeezed lime juice, 1 cup (240 mL) blanco tequila, and 1/3 cup (80 mL) each of orange liqueur and fine grain sugar. You can also boil equal parts sugar and water together to make a simple syrup instead of using fine grain sugar. For a non-alcoholic beverage, try substituting the tequila with soda water, lime soda, or seltzer. Making Your Own Sambal Oelek Grab your ingredients and equipment. Assemble your ingredients and grab a mortar and pestle. If you don’t have a mortar and pestle, you can use a food processor large enough to accommodate a pound (454 grams) of chilies. Using a mortar and pestle is the traditional method. Oelek, or ulek, refers to the pestle that’s used to grind the chilies. Grind or blend red chilies with salt. Place the chilies and salt in your mortar or in the work bowl of your food processor. Use your pestle to grind the chilies until they form a paste, working in batches as large as your mortar can handle. If you’re using a processor, pulse the chilies and pause to scrape the sides of the bowl as necessary. Add rice vinegar, lime juice, and garlic for more complex flavor. While authentic sambal oelek is a simple celebration of raw chili flavor, you can customize your condiment to your own tastes. Experiment with varying levels of sweetness and acidity to find your favorite flavors. Try adding a couple tablespoons of vinegar and lime juice for more acidity. These will also help you sambal stay fresh longer. Add sweetness with one or two tablespoons of brown or palm sugar. You can also mince a few cloves of garlic and add it to your sambal (just keep in mind authentic sambal oelek does not contain garlic).",
  "tyn_model":[
    "sambal oelek",
    "garlic",
    "mortar",
    "oven",
    "salt",
    "chilies",
    "hot sauce",
    "tofu",
    "vinegar",
    "sugar",
    "sambal",
    "cucumber",
    "fine grain sugar",
    "food processor",
    "pestle",
    "lime juice",
    "tomato sauce",
    "flavored vinegar",
    "stir fries",
    "sour cream",
    "coarse salt",
    "chicken wings",
    "mixing bowl",
    "freezer bag",
    "sheet pans",
    "sheet pan",
    "small sauce pan",
    "large mixing bowl",
    "oil coated skillet",
    "tamarind",
    "bowl",
    "oil",
    "large frying pan",
    "wok",
    "onions",
    "mushrooms",
    "soy sauce",
    "broccoli",
    "peppers",
    "zucchini",
    "stir fry",
    "refrigerator",
    "fresh squeezed lime juice",
    "blanco tequila",
    "orange liqueur",
    "water",
    "simple syrup",
    "tequila",
    "soda water",
    "lime soda",
    "processor",
    "rice vinegar",
    "brown or palm sugar",
    "oelek"
  ],
  "tyn_section":[

  ]
}