{
  "title":"How to Create Extra Storage in a Bedroom",
  "url":"https://www.wikihow.com/Create-Extra-Storage-in-a-Bedroom",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Home Organization"
  ],
  "methods":[
    {
      "name":"Using Furniture as Storage Space",
      "steps":[
        {
          "headline":"Select furniture that is also storage.",
          "description":"Instead of just placing comfortable chairs or extra seating in your bedroom, choose pieces that also have storage space. For example, pick a chair that has an ottoman. These usually match the chair and you won't even be able to see that it's storage. You could also use a chest or trunk. Chests or trunks are great for long-term storage, since you can still place things on top of the trunk. For example, store winter clothes in the trunk and use the top of the trunk to display photos, books, or accessories. You can also place a long bench at the end of your bed that has extra storage for bedding."
        },
        {
          "headline":"Use wardrobes or armoires.",
          "description":"Wardrobes or armoires are a beautiful way to add interesting furniture to your room. Most of them open up to include space for hanging clothes, shelving, and small drawers. You can find some with full-length mirrors. You can get one with a large mirror on the front. This can reflect light and make your room appear larger."
        },
        {
          "headline":"Get a dresser with plenty of drawers.",
          "description":"If you don't have a closet, you'll need an organized space to hold your clothes. Purchase a dresser that will hold all of the clothes you'll need for the season. If you need to, you could store unseasonable clothing in storage in another room. Test the dresser drawers before you buy the dresser. Ensure that they open easily and close completely."
        },
        {
          "headline":"Pick a nightstand with storage.",
          "description":"Consider swapping out your bedside table for a nightstand that has storage. You can easily find nightstands that include storage compartments and small drawers. Many even have charging spaces for your technological devices. If you don't have enough space for a nightstand, install small storage cubes vertically, so you can make the most of the space."
        },
        {
          "headline":"Select a bed with built-in storage.",
          "description":"Many bed options have room for storage below them. Some also have built-in drawers underneath them. This is a great place to store extra bedding or off-season clothing. You could also purchase a headboard with shelving for storing books, knickknacks, and other items."
        }
      ]
    },
    {
      "name":"Using Shelving",
      "steps":[
        {
          "headline":"Install floating shelves.",
          "description":"If you don't have a lot of floor space for storage furniture, you can easily install floating shelves on your walls. Decide what you'd like to hang, so you can purchase shelving that makes sense for the items. For example, if you want to store shoes, you can install long strips of shelving that you can hang the shoes from. If you don't have space for a bedside table, consider installing two floating cabinet shelves on top of each other. You can install them in the corner next to your bed, so you have somewhere to put your things. For example, you could use floating bedside storage for a small lamp, a clock, your cell phone, and a pair of glasses."
        },
        {
          "headline":"Prop a ladder against the wall for shelving.",
          "description":"Purchase a decorative ladder that you can lean against one of your bedroom walls. Storage ladders usually have wide steps and are only half of a ladder, so they must be put up against a wall. You can store clothing, blankets, books, plants, or accessories on the ladder. You can find sleek, minimal storage ladders or rustic wooden ladders. Try to find one that matches the look of your bedroom. Look for decorative ladders at home improvement stores, home goods stores, or online. Keep in mind that these are for decorative purposes and can become a hazard if used improperly."
        },
        {
          "headline":"Build shelving around your headboard.",
          "description":"You can easily create storage space on the wall near your headboard. Install shelves around the headboard to hold books, picture frames, knickknacks, and other items. This is a great way to get storage, especially if you don't have room for a nightstand. Consider installing shelving along the perimeter of your room. Install the shelving on the walls about 12 inches (30.5 cm) below the ceiling."
        },
        {
          "headline":"Place shelving units below the windows.",
          "description":"Measure your windows and purchase shelving that will fit directly below them. If you have small windows, you may be able to fit a large cabinet or dresser below the window. If you have large windows, you may only be able to fit short storage cubes. Try not to block the windows, so your room can still get natural light. Look for storage benches that you could fit under the window. This will give you somewhere to sit and a place to store things."
        }
      ]
    },
    {
      "name":"Creating Storage in a Small Bedroom",
      "steps":[
        {
          "headline":"Organize your closet effectively.",
          "description":"If you're only hanging things in your closet, you could probably be using the space better. Move the hanging items to one side and then place a shelving unit into the closet. Use shelves, baskets, and small drawers to arrange your clothing. Try to include all of the space in the closet, even the floor and the ceiling. You can install ceiling racks that hang down. If you don't have much hanging space in your closet, consider placing an open clothes rack in the bedroom itself. To maximize space, you can hang items on a vertical clothes pole instead of a horizontal one."
        },
        {
          "headline":"Use the space behind your doors.",
          "description":"You may have a mirror hanging behind your bedroom door. If you don't (or it's a small mirror), install small racks or pegs, so you can hang things behind the door. For example, hang pegs so you can store your laundry hamper or jackets. Don't forget to use your closet doors for storage too. This works best if your closet doors open out, rather than slide across. You can also use hooks that hang over the doors to store jackets, purses, robes, and scarves as well. Additionally, you can use a pocketed shower curtain or shoe organizer to store small items like socks, scarves, and jewelry on the back of a door."
        },
        {
          "headline":"Store things under your bed.",
          "description":"You can purchase long, short storage boxes or clear bins to put underneath your bed. This is a great way to store things that you don't need to access on a daily basis. Consider storing unseasonable clothing or outerwear under your bed in zippered storage boxes or canvas storage bags. You can even buy beds that have built-in shelving below them. These are sometimes sold as captain's beds which are raised up on storage platforms."
        },
        {
          "headline":"Hang your accessories on the wall.",
          "description":"Instead of storing your small accessories in boxes that are difficult to get to, place them in plain sight. Frame pegboard or cork board and hang it on the wall. You can arrange and display jewelry, ties, scarves, or cuff links from the pegboard or cork board. Consider painting the frame to match the colors in your room. You can hang several of these in different sizes throughout your bedroom."
        },
        {
          "headline":"Add bookcases for additional storage.",
          "description":"Bookcases can hold way more than just books! You can use them to hold and organize items like clothes, shoes, office supplies, and more. Bookcases with cubes are particularly useful for organizing small items. You can also use them to display artwork, picture frames, and knickknacks."
        }
      ]
    }
  ],
  "text":" Using Furniture as Storage Space Select furniture that is also storage. Instead of just placing comfortable chairs or extra seating in your bedroom, choose pieces that also have storage space. For example, pick a chair that has an ottoman. These usually match the chair and you won't even be able to see that it's storage. You could also use a chest or trunk. Chests or trunks are great for long-term storage, since you can still place things on top of the trunk. For example, store winter clothes in the trunk and use the top of the trunk to display photos, books, or accessories. You can also place a long bench at the end of your bed that has extra storage for bedding. Use wardrobes or armoires. Wardrobes or armoires are a beautiful way to add interesting furniture to your room. Most of them open up to include space for hanging clothes, shelving, and small drawers. You can find some with full-length mirrors. You can get one with a large mirror on the front. This can reflect light and make your room appear larger. Get a dresser with plenty of drawers. If you don't have a closet, you'll need an organized space to hold your clothes. Purchase a dresser that will hold all of the clothes you'll need for the season. If you need to, you could store unseasonable clothing in storage in another room. Test the dresser drawers before you buy the dresser. Ensure that they open easily and close completely. Pick a nightstand with storage. Consider swapping out your bedside table for a nightstand that has storage. You can easily find nightstands that include storage compartments and small drawers. Many even have charging spaces for your technological devices. If you don't have enough space for a nightstand, install small storage cubes vertically, so you can make the most of the space. Select a bed with built-in storage. Many bed options have room for storage below them. Some also have built-in drawers underneath them. This is a great place to store extra bedding or off-season clothing. You could also purchase a headboard with shelving for storing books, knickknacks, and other items. Using Shelving Install floating shelves. If you don't have a lot of floor space for storage furniture, you can easily install floating shelves on your walls. Decide what you'd like to hang, so you can purchase shelving that makes sense for the items. For example, if you want to store shoes, you can install long strips of shelving that you can hang the shoes from. If you don't have space for a bedside table, consider installing two floating cabinet shelves on top of each other. You can install them in the corner next to your bed, so you have somewhere to put your things. For example, you could use floating bedside storage for a small lamp, a clock, your cell phone, and a pair of glasses. Prop a ladder against the wall for shelving. Purchase a decorative ladder that you can lean against one of your bedroom walls. Storage ladders usually have wide steps and are only half of a ladder, so they must be put up against a wall. You can store clothing, blankets, books, plants, or accessories on the ladder. You can find sleek, minimal storage ladders or rustic wooden ladders. Try to find one that matches the look of your bedroom. Look for decorative ladders at home improvement stores, home goods stores, or online. Keep in mind that these are for decorative purposes and can become a hazard if used improperly. Build shelving around your headboard. You can easily create storage space on the wall near your headboard. Install shelves around the headboard to hold books, picture frames, knickknacks, and other items. This is a great way to get storage, especially if you don't have room for a nightstand. Consider installing shelving along the perimeter of your room. Install the shelving on the walls about 12 inches (30.5 cm) below the ceiling. Place shelving units below the windows. Measure your windows and purchase shelving that will fit directly below them. If you have small windows, you may be able to fit a large cabinet or dresser below the window. If you have large windows, you may only be able to fit short storage cubes. Try not to block the windows, so your room can still get natural light. Look for storage benches that you could fit under the window. This will give you somewhere to sit and a place to store things. Creating Storage in a Small Bedroom Organize your closet effectively. If you're only hanging things in your closet, you could probably be using the space better. Move the hanging items to one side and then place a shelving unit into the closet. Use shelves, baskets, and small drawers to arrange your clothing. Try to include all of the space in the closet, even the floor and the ceiling. You can install ceiling racks that hang down. If you don't have much hanging space in your closet, consider placing an open clothes rack in the bedroom itself. To maximize space, you can hang items on a vertical clothes pole instead of a horizontal one. Use the space behind your doors. You may have a mirror hanging behind your bedroom door. If you don't (or it's a small mirror), install small racks or pegs, so you can hang things behind the door. For example, hang pegs so you can store your laundry hamper or jackets. Don't forget to use your closet doors for storage too. This works best if your closet doors open out, rather than slide across. You can also use hooks that hang over the doors to store jackets, purses, robes, and scarves as well. Additionally, you can use a pocketed shower curtain or shoe organizer to store small items like socks, scarves, and jewelry on the back of a door. Store things under your bed. You can purchase long, short storage boxes or clear bins to put underneath your bed. This is a great way to store things that you don't need to access on a daily basis. Consider storing unseasonable clothing or outerwear under your bed in zippered storage boxes or canvas storage bags. You can even buy beds that have built-in shelving below them. These are sometimes sold as captain's beds which are raised up on storage platforms. Hang your accessories on the wall. Instead of storing your small accessories in boxes that are difficult to get to, place them in plain sight. Frame pegboard or cork board and hang it on the wall. You can arrange and display jewelry, ties, scarves, or cuff links from the pegboard or cork board. Consider painting the frame to match the colors in your room. You can hang several of these in different sizes throughout your bedroom. Add bookcases for additional storage. Bookcases can hold way more than just books! You can use them to hold and organize items like clothes, shoes, office supplies, and more. Bookcases with cubes are particularly useful for organizing small items. You can also use them to display artwork, picture frames, and knickknacks.",
  "tyn_model":[
    "ladder",
    "mirror",
    "dresser",
    "shelves",
    "shelving",
    "bookcases",
    "furniture",
    "wardrobes",
    "ladders",
    "chair",
    "ottoman",
    "chest",
    "chests",
    "mirrors",
    "dresser drawers",
    "bed",
    "clock",
    "storage ladders",
    "decorative ladders",
    "home improvement stores",
    "home goods stores",
    "cabinet",
    "storage benches",
    "shelving unit",
    "baskets",
    "clothing",
    "shower curtain",
    "shoe organizer",
    "beds",
    "books",
    "cubes"
  ],
  "tyn_section":[

  ]
}