{
  "title":"How to Make Coconut Quinoa",
  "url":"https://www.wikihow.com/Make-Coconut-Quinoa",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Cereal Grains"
  ],
  "methods":[
    {
      "name":"Making Basic Coconut Quinoa",
      "steps":[
        {
          "headline":"Toast the quinoa.",
          "description":"Start by heating the oil in a medium sized saucepan on medium heat. Then, throw in the quinoa and toast it for five minutes. You should stir it around to make sure the quinoa is coated in oil and gets brown but not burnt."
        },
        {
          "headline":"Cook the coconut quinoa.",
          "description":"Add the salt, a cup and a half of water and the coconut milk. Once the mixture comes to a boil, turn it down to a simmer. Simmer it for twenty to twenty five minutes, or until the liquid is absorbed. Leave it, off the burner, to rest for ten minutes and then serve it."
        },
        {
          "headline":"Add maple syrup to the basic coconut quinoa.",
          "description":"Put the ingredients in a medium sized saucepan. Once it has come to a boil, turn it down to a simmer. Let it simmer until all of the liquid is absorbed, which should take around ten minutes. If you have a rice cooker, you can just throw all of the ingredients inside and set it to white rice setting. This wonderful recipe can be served alongside Asian inspired, salty or spicy dishes. It can also be served on its own."
        }
      ]
    },
    {
      "name":"Making Coconut Quinoa with Blueberries",
      "steps":[
        {
          "headline":"Cook the coconut quinoa.",
          "description":"Put a saucepan on high heat. Throw in the quinoa, one cup of the coconut milk, half a cup of water, half a teaspoon of vanilla powder and all of the cinnamon. Bring the mixture to a boil. Once it boils, immediately turn it down to a simmer. Let it simmer for twelve minutes, which should allow the liquid to be absorbed into the quinoa. Finally, stir in two teaspoons of honey and the rest of the coconut milk."
        },
        {
          "headline":"Make the blueberry sauce for the porridge.",
          "description":"Put a saucepan on medium to low heat. Put the blueberries, two tablespoons of water, the rest of the vanilla and a teaspoon of honey. Cook the mixture for six minutes. If it is winter, you can get frozen blueberries in the freezer section of your grocery store. If it is summer, make an outing of it and go blueberry picking."
        },
        {
          "headline":"Mix the nuts.",
          "description":"Stir the coconut chips, pistachios, chia seeds and coconut sugar in a little bowl. Optionally, you could throw in a few chia seeds or other seeds or nuts of your choice. It tastes great with most kinds of nuts and seeds. Consider adding the following healthy nuts to the existing recipe:\nConsider adding some Brazil nuts, which are a great source of selenium. Throw in some almonds, which are a great source of riboflavin, vitamin E, and magnesium. They also have lots of protein. Put in some pistachios, which have lots of healthy fat."
        },
        {
          "headline":"Serve the porridge.",
          "description":"Serve a few ladles of quinoa into the serving bowls. Put some almond butter on top. Pour the blueberry mixture on top. Finally, sprinkle some sliced banana and the nut mixture."
        }
      ]
    },
    {
      "name":"Making Coconut Curry",
      "steps":[
        {
          "headline":"Get out your slow cooker.",
          "description":"In a slow cooker, add a cup of water. Then, add all of the ingredients. Mix the ingredients around until everything looks well mixed. If you don't have a slow cooker, consider getting one. You should look for one that distributes heat evenly and has a removable insert, since it will be easier to wash. They make cooking easier, since you can get other things done while you are making your curry. If you have more time on your hands, you could cook the chick peas from scratch instead of using a can."
        },
        {
          "headline":"Turn on the slow cooker.",
          "description":"If you cook it on low, it will take five hours. If you cook it on a higher setting, it will cook in three or four hours. You should check it after three hours. Root vegetables take longer to cook so put them on the bottom of the pot closer to the heat source. If your slow cooker has the heat element only on the bottom or top, as opposed to all around the sides, you will need to stir it more often. If you want a darker curry, you could cook the ginger, garlic and onion a bit before putting them in your slow cooker. If you prefer a lighter curry, put them in raw at the same time as all your ingredients. If you prefer a spicier curry, you could add another tablespoon each of ginger and turmeric."
        },
        {
          "headline":"Check to see if it is done.",
          "description":"You will know it is done when the potatoes are fully cooked and the curry looks nice and thick. If it is still somewhat watery, it needs to keep cooking. The best way to check is to taste the potatoes to see if they are done all the way through. It should be warm and spicy."
        }
      ]
    }
  ],
  "text":" Making Basic Coconut Quinoa Toast the quinoa. Start by heating the oil in a medium sized saucepan on medium heat. Then, throw in the quinoa and toast it for five minutes. You should stir it around to make sure the quinoa is coated in oil and gets brown but not burnt. Cook the coconut quinoa. Add the salt, a cup and a half of water and the coconut milk. Once the mixture comes to a boil, turn it down to a simmer. Simmer it for twenty to twenty five minutes, or until the liquid is absorbed. Leave it, off the burner, to rest for ten minutes and then serve it. Add maple syrup to the basic coconut quinoa. Put the ingredients in a medium sized saucepan. Once it has come to a boil, turn it down to a simmer. Let it simmer until all of the liquid is absorbed, which should take around ten minutes. If you have a rice cooker, you can just throw all of the ingredients inside and set it to white rice setting. This wonderful recipe can be served alongside Asian inspired, salty or spicy dishes. It can also be served on its own. Making Coconut Quinoa with Blueberries Cook the coconut quinoa. Put a saucepan on high heat. Throw in the quinoa, one cup of the coconut milk, half a cup of water, half a teaspoon of vanilla powder and all of the cinnamon. Bring the mixture to a boil. Once it boils, immediately turn it down to a simmer. Let it simmer for twelve minutes, which should allow the liquid to be absorbed into the quinoa. Finally, stir in two teaspoons of honey and the rest of the coconut milk. Make the blueberry sauce for the porridge. Put a saucepan on medium to low heat. Put the blueberries, two tablespoons of water, the rest of the vanilla and a teaspoon of honey. Cook the mixture for six minutes. If it is winter, you can get frozen blueberries in the freezer section of your grocery store. If it is summer, make an outing of it and go blueberry picking. Mix the nuts. Stir the coconut chips, pistachios, chia seeds and coconut sugar in a little bowl. Optionally, you could throw in a few chia seeds or other seeds or nuts of your choice. It tastes great with most kinds of nuts and seeds. Consider adding the following healthy nuts to the existing recipe:\nConsider adding some Brazil nuts, which are a great source of selenium. Throw in some almonds, which are a great source of riboflavin, vitamin E, and magnesium. They also have lots of protein. Put in some pistachios, which have lots of healthy fat. Serve the porridge. Serve a few ladles of quinoa into the serving bowls. Put some almond butter on top. Pour the blueberry mixture on top. Finally, sprinkle some sliced banana and the nut mixture. Making Coconut Curry Get out your slow cooker. In a slow cooker, add a cup of water. Then, add all of the ingredients. Mix the ingredients around until everything looks well mixed. If you don't have a slow cooker, consider getting one. You should look for one that distributes heat evenly and has a removable insert, since it will be easier to wash. They make cooking easier, since you can get other things done while you are making your curry. If you have more time on your hands, you could cook the chick peas from scratch instead of using a can. Turn on the slow cooker. If you cook it on low, it will take five hours. If you cook it on a higher setting, it will cook in three or four hours. You should check it after three hours. Root vegetables take longer to cook so put them on the bottom of the pot closer to the heat source. If your slow cooker has the heat element only on the bottom or top, as opposed to all around the sides, you will need to stir it more often. If you want a darker curry, you could cook the ginger, garlic and onion a bit before putting them in your slow cooker. If you prefer a lighter curry, put them in raw at the same time as all your ingredients. If you prefer a spicier curry, you could add another tablespoon each of ginger and turmeric. Check to see if it is done. You will know it is done when the potatoes are fully cooked and the curry looks nice and thick. If it is still somewhat watery, it needs to keep cooking. The best way to check is to taste the potatoes to see if they are done all the way through. It should be warm and spicy.",
  "tyn_model":[
    "slow cooker",
    "coconut quinoa",
    "quinoa",
    "nuts",
    "water",
    "saucepan",
    "coconut milk",
    "oil",
    "honey",
    "blueberries",
    "pistachios",
    "ginger",
    "potatoes",
    "salt",
    "syrup",
    "medium sized saucepan",
    "rice cooker",
    "white rice",
    "vanilla powder",
    "cinnamon",
    "blueberry sauce",
    "vanilla",
    "blueberry picking",
    "coconut chips",
    "coconut sugar",
    "chia seeds",
    "almonds",
    "porridge",
    "almond butter",
    "blueberry",
    "banana",
    "chick peas",
    "vegetables",
    "pot",
    "garlic",
    "onion",
    "turmeric"
  ],
  "tyn_section":[

  ]
}