{
  "title":"How to Cook with Apple Cider Vinegar",
  "url":"https://www.wikihow.com/Cook-with-Apple-Cider-Vinegar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Flavored Vinegars"
  ],
  "methods":[
    {
      "name":"Pickling with Apple Cider Vinegar",
      "steps":[
        {
          "headline":"Make the brine.",
          "description":"In a large pot, combine the vinegar, water, and salt. Place the pot on your stovetop and bring it to a boil. Simmer the brine for five minutes and then remove it from the heat. Allow it to cool for a few minutes."
        },
        {
          "headline":"Place the dill and cucumbers in a jar.",
          "description":"Thoroughly wash and dry the cucumbers and dill. Then place the pickles upright in a large mason jar. The pickles should come within ½ inch (1.27 cm) of the top of the jar. Finally, insert the dill sprigs in amongst the pickles. You can also slice the cucumbers and pickle them as spears. You can also add cloves of garlic, onion, or other vegetables to the jar for some added flavor."
        },
        {
          "headline":"Fill the jar with brine.",
          "description":"Once you have your cucumbers arranged, fill the jar to the top with brine. Be sure to tap the jar a few times on a flat surface to remove any air bubbles. Without canning, the pickles will be good for a few weeks. However, if you properly can them and do not open them, the pickles can stay good for a few years. Let the pickles set for at least 48 hours to get the best flavor."
        }
      ]
    },
    {
      "name":"Making Dressing and Marinade",
      "steps":[
        {
          "headline":"Chop up the garlic.",
          "description":"With a knife and cutting board, dice up two cloves of garlic. Make sure that you chop the garlic very finely. You do not want large chunks of garlic in your dressing. For a less intense flavor, you might consider using shallots."
        },
        {
          "headline":"Whisk the ingredients together.",
          "description":"In a medium-sized bowl, combine all of the ingredients. Then whisk them together. Make sure that you combine the oil and vinegar thoroughly. Taste the dressing and add more salt and pepper if needed."
        },
        {
          "headline":"Drizzle on salad.",
          "description":"Lightly pour some of the dressing on your leafy salad. This dressing pairs well with most leafy greens, particularly kale or arugula. In addition, apple slices and fresh walnuts also go well with the dressing."
        },
        {
          "headline":"Marinate meat and vegetables.",
          "description":"After whisking everything together, let the marinade sit for about thirty minutes, stirring occasionally. Once it is set, add your meats and veggies and let it marinate for a few hours. You can leave it all in the same bowl that you mixed it in and simply cover it up, or you can place the meat, veggies, and marinade in a large freezer bag. Finally, cook the meat and veggies. With marinades, you can substitute apple cider vinegar for wine or balsamic vinegar. It balances out the savory flavors of the meats and vegetables with a hint of tang and sweetness."
        },
        {
          "headline":"Make a more complex marinade.",
          "description":"If you want to add some extra flavor to your marinade, consider including some additional ingredients. These can be things like Worcestershire sauce, soy sauce, hot sauce, red pepper flakes, onion flakes, or garlic powder. Particularly with chicken and pork, these ingredients will make the meat more flavorful."
        }
      ]
    },
    {
      "name":"Adding Apple Cider Vinegar to Other Dishes",
      "steps":[
        {
          "headline":"Add fluff to cakes and cookies.",
          "description":"Vinegar is a common ingredient in many desserts. Because it creates carbon dioxide bubbles when it reacts with baking soda, bakers use vinegar to give cakes and other baked goods extra fluffiness. Bakers tend to choose apple cider vinegar because of its sweet and fruity flavor. In addition, all of the vinegar flavor cooks out of the finished product."
        },
        {
          "headline":"Balance out saltiness.",
          "description":"If you make a sauce, soup, or gravy that is particularly salty, you can add a little apple cider vinegar to help balance out the dish. Just a splash of apple cider vinegar while the sauce simmers will cut the saltiness and add a hint of sweetness. You can even use it to cut the saltiness of cheese sauces."
        },
        {
          "headline":"Pour some in your drinks.",
          "description":"If you want to add some zest to a drink, consider adding a splash of apple cider vinegar. It will add a little bite and a little tartness to whatever you are drinking. Consider adding a splash to your morning smoothie or your afternoon tea. If you like to detox, apple cider is a common ingredient in many detox drink recipes."
        },
        {
          "headline":"Firm up a poached egg.",
          "description":"If you prefer your poached eggs to be firm, add a little apple cider vinegar to your water. Once the water comes to a boil, a splash of vinegar should do the trick. The vinegar helps the whites firm up faster while keeping the yolk nice and runny."
        }
      ]
    }
  ],
  "text":" Pickling with Apple Cider Vinegar Make the brine. In a large pot, combine the vinegar, water, and salt. Place the pot on your stovetop and bring it to a boil. Simmer the brine for five minutes and then remove it from the heat. Allow it to cool for a few minutes. Place the dill and cucumbers in a jar. Thoroughly wash and dry the cucumbers and dill. Then place the pickles upright in a large mason jar. The pickles should come within ½ inch (1.27 cm) of the top of the jar. Finally, insert the dill sprigs in amongst the pickles. You can also slice the cucumbers and pickle them as spears. You can also add cloves of garlic, onion, or other vegetables to the jar for some added flavor. Fill the jar with brine. Once you have your cucumbers arranged, fill the jar to the top with brine. Be sure to tap the jar a few times on a flat surface to remove any air bubbles. Without canning, the pickles will be good for a few weeks. However, if you properly can them and do not open them, the pickles can stay good for a few years. Let the pickles set for at least 48 hours to get the best flavor. Making Dressing and Marinade Chop up the garlic. With a knife and cutting board, dice up two cloves of garlic. Make sure that you chop the garlic very finely. You do not want large chunks of garlic in your dressing. For a less intense flavor, you might consider using shallots. Whisk the ingredients together. In a medium-sized bowl, combine all of the ingredients. Then whisk them together. Make sure that you combine the oil and vinegar thoroughly. Taste the dressing and add more salt and pepper if needed. Drizzle on salad. Lightly pour some of the dressing on your leafy salad. This dressing pairs well with most leafy greens, particularly kale or arugula. In addition, apple slices and fresh walnuts also go well with the dressing. Marinate meat and vegetables. After whisking everything together, let the marinade sit for about thirty minutes, stirring occasionally. Once it is set, add your meats and veggies and let it marinate for a few hours. You can leave it all in the same bowl that you mixed it in and simply cover it up, or you can place the meat, veggies, and marinade in a large freezer bag. Finally, cook the meat and veggies. With marinades, you can substitute apple cider vinegar for wine or balsamic vinegar. It balances out the savory flavors of the meats and vegetables with a hint of tang and sweetness. Make a more complex marinade. If you want to add some extra flavor to your marinade, consider including some additional ingredients. These can be things like Worcestershire sauce, soy sauce, hot sauce, red pepper flakes, onion flakes, or garlic powder. Particularly with chicken and pork, these ingredients will make the meat more flavorful. Adding Apple Cider Vinegar to Other Dishes Add fluff to cakes and cookies. Vinegar is a common ingredient in many desserts. Because it creates carbon dioxide bubbles when it reacts with baking soda, bakers use vinegar to give cakes and other baked goods extra fluffiness. Bakers tend to choose apple cider vinegar because of its sweet and fruity flavor. In addition, all of the vinegar flavor cooks out of the finished product. Balance out saltiness. If you make a sauce, soup, or gravy that is particularly salty, you can add a little apple cider vinegar to help balance out the dish. Just a splash of apple cider vinegar while the sauce simmers will cut the saltiness and add a hint of sweetness. You can even use it to cut the saltiness of cheese sauces. Pour some in your drinks. If you want to add some zest to a drink, consider adding a splash of apple cider vinegar. It will add a little bite and a little tartness to whatever you are drinking. Consider adding a splash to your morning smoothie or your afternoon tea. If you like to detox, apple cider is a common ingredient in many detox drink recipes. Firm up a poached egg. If you prefer your poached eggs to be firm, add a little apple cider vinegar to your water. Once the water comes to a boil, a splash of vinegar should do the trick. The vinegar helps the whites firm up faster while keeping the yolk nice and runny.",
  "tyn_model":[
    "apple cider vinegar",
    "vinegar",
    "garlic",
    "cucumbers",
    "water",
    "dill",
    "jar",
    "brine",
    "large pot",
    "salt",
    "mason jar",
    "onion",
    "canning",
    "marinade",
    "knife",
    "shallots",
    "oil",
    "dressing",
    "salt and pepper",
    "arugula",
    "walnuts",
    "bowl",
    "freezer bag",
    "wine",
    "balsamic vinegar",
    "worcestershire sauce",
    "soy sauce",
    "hot sauce",
    "red pepper flakes",
    "onion flakes",
    "garlic powder",
    "baking soda",
    "apple cider",
    "poached egg"
  ],
  "tyn_section":[

  ]
}