{
  "title":"How to Make Chicken Stroganoff",
  "url":"https://www.wikihow.com/Make-Chicken-Stroganoff",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "methods":[
    {
      "name":"Making a Basic Chicken Stroganoff",
      "steps":[
        {
          "headline":"Boil a large pot of salted water.",
          "description":"Add 12 ounces (340 grams) of wide egg noodles. Reduce heat to low while the noodles continue boiling. Check the noodles every five to ten minutes and turn the heat off if they are cooked thoroughly. To test whether an egg noodle is done, scoop one out with a fork. Blow on it lightly for a few seconds, then take a bite. If it is chewy and soft, turn the heat off and drain the noodles using a colander. If all you have on hand is linguine noodles, those are fine to substitute. You could also use macaroni noodles."
        },
        {
          "headline":"Melt two tablespoons of butter in a large skillet.",
          "description":"Add one small, chopped onion. Cook over medium-high for about two minutes. Then add four ounces (115 grams) of white mushrooms. Cook for two more minutes. Add one tablespoon of butter."
        },
        {
          "headline":"Add the chicken.",
          "description":"Cut 1.25 pounds (565 grams) of skinless, boneless chicken into chunks. Place the chicken chunks in the skillet. Season the chicken with two tablespoons flour, one teaspoon paprika, one teaspoon salt, and ¼ teaspoon pepper. Stir the chicken and other ingredients with a wooden spoon for about three minutes."
        },
        {
          "headline":"Pour one cup (240 milliliters) chicken broth into the mix.",
          "description":"Continue to heat the skillet on medium-high so that the broth comes to a simmer. Cook for about five minutes until it reduces (thickens)."
        },
        {
          "headline":"Plate the chicken stroganoff.",
          "description":"Scoop some of the egg noodles into a bowl using a slotted spoon or pasta server. Ladle the chicken stroganoff sauce over the noodles. Allow to cool for a minute, then consume."
        }
      ]
    },
    {
      "name":"Making a Creamy Tomato Chicken Stroganoff",
      "steps":[
        {
          "headline":"Prepare your chicken.",
          "description":"Cut 14 ounces (397 grams) of boneless, skinless chicken thighs into chunks. Season the chicken with salt and pepper, to taste, and sprinkle with two tablespoons of flour. Melt one tablespoon of butter over a skillet and add the chicken chunks. Place the chicken chunks in a single layer. Don’t allow them to pile up on each other. After five minutes of frying, turn the chicken chunks over and allow them to fry on their opposite side for another five minutes."
        },
        {
          "headline":"Prepare your mushrooms and onions.",
          "description":"Once the chicken is finished, place it in a bowl. Put 8.8 ounces (250 grams) of sliced button mushrooms in the pan and sauté them for five minutes. Flip them over on their opposite side for another five minutes. Add one small diced onion and sauté it along with the mushrooms."
        },
        {
          "headline":"Deglaze the pan.",
          "description":"Deglazing is the process of diluting or removing food residue before making a sauce. To deglaze the pan in anticipation of making chicken stroganoff, pour ¼ cup (60 milliliters) of vermouth in the skillet along with the onions and mushrooms. Turn up the heat and allow the vermouth to boil until it is almost entirely evaporated."
        },
        {
          "headline":"Make the stroganoff sauce.",
          "description":"Pour one cup (240 milliliters) of chicken stock, one tablespoon of tomato paste, one bay leaf, and five sprigs of thyme, and the fried chicken you plated earlier. Cover over medium-low heat for 10 minutes. After 10 minutes, remove the lid and allow to simmer for another 10 minutes. The sauce should be thick and red."
        },
        {
          "headline":"Add the sour cream.",
          "description":"Slowly scoop spoonfuls of the chicken sauce into 1/3 cup (80 milliliters) of sour cream. Continue to add the chicken sauce to the sour cream until the mixture is lukewarm. Then, transfer the diluted sour cream into the skillet with the rest of the chicken, mushroom, and sauce. Stir to combine. Once the sour cream has been mixed into the sauce, serve the chicken stroganoff. This chicken stroganoff tastes great over rice, egg noodles, or another pasta of your choice. Add salt and pepper to taste."
        }
      ]
    },
    {
      "name":"Making a Vegetable Chicken Stroganoff",
      "steps":[
        {
          "headline":"Sauté the chicken.",
          "description":"Slice 1.2 kilograms (42 ounces) of boneless, skinless chicken into strips. Roll the chicken strips across a plate dusted in a light coat of flour. Heat 50 grams (1.75 ounces) of butter in a skillet. Place the chicken strips in the skillet. Allow them to sauté for five to 10 minutes, then turn them over and allow the opposite side to sauté."
        },
        {
          "headline":"Sauté the green onions.",
          "description":"Once your chicken has finished sautéing, remove it and set it on a plate. Chop six green onions. Dump them in the skillet and sauté them until brown."
        },
        {
          "headline":"Add the remaining veggies.",
          "description":"Once your onions are browned, add two carrots chopped into thin slices. Pour one cup (240 milliliters) of vegetable soup, 200 cubic centimeters (0.85 cups) of cream, ½ cup (118 milliliters) white wine, one teaspoon paprika, and salt and pepper, to taste. Cook everything over medium heat. When it begins to boil, lower the heat."
        },
        {
          "headline":"Add the chicken.",
          "description":"After about five minutes, add 200 grams (seven ounces) of peas. Wait about 10 minutes and check the chicken. When it is tender, reduce heat to the lowest setting."
        },
        {
          "headline":"Prepare the mushrooms.",
          "description":"In a separate skillet, pour one to two tablespoons of vegetable oil. Slice 300 grams (10.5 ounces) of white mushrooms in thin slices. Add salt and pepper, to taste. Sautee them in the skillet over medium-high heat."
        },
        {
          "headline":"Plate the chicken stroganoff.",
          "description":"To plate the vegetable chicken stroganoff, fill half a bowl with rice. Scoop the stroganoff mix into the other half of the bowl. Then place the mushrooms over the rice. Enjoy your tasty chicken stroganoff."
        }
      ]
    },
    {
      "name":"Choosing How to Plate Your Chicken Stroganoff",
      "steps":[
        {
          "headline":"Use egg noodles.",
          "description":"Egg noodles are the traditional choice when making chicken stroganoff. If you are interested in a tried-and-true classic, stick to the simple egg noodle."
        },
        {
          "headline":"Try a whole-grain pasta.",
          "description":"Whole-grain pastas are healthier than refined pastas because they contain more fiber, vitamins, and minerals. Plus, whole grains make you feel fuller, which will keep you from adding unnecessary calories to your diet. You can use any shape of whole-grain pasta. Choose the shape that is most delicious to you."
        },
        {
          "headline":"Serve your chicken stroganoff with rice.",
          "description":"Instead of some sort of pasta, try serving your chicken stroganoff over rice. Use brown rice instead of white. Compared to white rice, brown rice still has its hull and bran, the parts of the rice grain that contain important nutrients and proteins. You could also try a similar grain like amaranth or quinoa."
        }
      ]
    }
  ],
  "text":" Making a Basic Chicken Stroganoff Boil a large pot of salted water. Add 12 ounces (340 grams) of wide egg noodles. Reduce heat to low while the noodles continue boiling. Check the noodles every five to ten minutes and turn the heat off if they are cooked thoroughly. To test whether an egg noodle is done, scoop one out with a fork. Blow on it lightly for a few seconds, then take a bite. If it is chewy and soft, turn the heat off and drain the noodles using a colander. If all you have on hand is linguine noodles, those are fine to substitute. You could also use macaroni noodles. Melt two tablespoons of butter in a large skillet. Add one small, chopped onion. Cook over medium-high for about two minutes. Then add four ounces (115 grams) of white mushrooms. Cook for two more minutes. Add one tablespoon of butter. Add the chicken. Cut 1.25 pounds (565 grams) of skinless, boneless chicken into chunks. Place the chicken chunks in the skillet. Season the chicken with two tablespoons flour, one teaspoon paprika, one teaspoon salt, and ¼ teaspoon pepper. Stir the chicken and other ingredients with a wooden spoon for about three minutes. Pour one cup (240 milliliters) chicken broth into the mix. Continue to heat the skillet on medium-high so that the broth comes to a simmer. Cook for about five minutes until it reduces (thickens). Plate the chicken stroganoff. Scoop some of the egg noodles into a bowl using a slotted spoon or pasta server. Ladle the chicken stroganoff sauce over the noodles. Allow to cool for a minute, then consume. Making a Creamy Tomato Chicken Stroganoff Prepare your chicken. Cut 14 ounces (397 grams) of boneless, skinless chicken thighs into chunks. Season the chicken with salt and pepper, to taste, and sprinkle with two tablespoons of flour. Melt one tablespoon of butter over a skillet and add the chicken chunks. Place the chicken chunks in a single layer. Don’t allow them to pile up on each other. After five minutes of frying, turn the chicken chunks over and allow them to fry on their opposite side for another five minutes. Prepare your mushrooms and onions. Once the chicken is finished, place it in a bowl. Put 8.8 ounces (250 grams) of sliced button mushrooms in the pan and sauté them for five minutes. Flip them over on their opposite side for another five minutes. Add one small diced onion and sauté it along with the mushrooms. Deglaze the pan. Deglazing is the process of diluting or removing food residue before making a sauce. To deglaze the pan in anticipation of making chicken stroganoff, pour ¼ cup (60 milliliters) of vermouth in the skillet along with the onions and mushrooms. Turn up the heat and allow the vermouth to boil until it is almost entirely evaporated. Make the stroganoff sauce. Pour one cup (240 milliliters) of chicken stock, one tablespoon of tomato paste, one bay leaf, and five sprigs of thyme, and the fried chicken you plated earlier. Cover over medium-low heat for 10 minutes. After 10 minutes, remove the lid and allow to simmer for another 10 minutes. The sauce should be thick and red. Add the sour cream. Slowly scoop spoonfuls of the chicken sauce into 1/3 cup (80 milliliters) of sour cream. Continue to add the chicken sauce to the sour cream until the mixture is lukewarm. Then, transfer the diluted sour cream into the skillet with the rest of the chicken, mushroom, and sauce. Stir to combine. Once the sour cream has been mixed into the sauce, serve the chicken stroganoff. This chicken stroganoff tastes great over rice, egg noodles, or another pasta of your choice. Add salt and pepper to taste. Making a Vegetable Chicken Stroganoff Sauté the chicken. Slice 1.2 kilograms (42 ounces) of boneless, skinless chicken into strips. Roll the chicken strips across a plate dusted in a light coat of flour. Heat 50 grams (1.75 ounces) of butter in a skillet. Place the chicken strips in the skillet. Allow them to sauté for five to 10 minutes, then turn them over and allow the opposite side to sauté. Sauté the green onions. Once your chicken has finished sautéing, remove it and set it on a plate. Chop six green onions. Dump them in the skillet and sauté them until brown. Add the remaining veggies. Once your onions are browned, add two carrots chopped into thin slices. Pour one cup (240 milliliters) of vegetable soup, 200 cubic centimeters (0.85 cups) of cream, ½ cup (118 milliliters) white wine, one teaspoon paprika, and salt and pepper, to taste. Cook everything over medium heat. When it begins to boil, lower the heat. Add the chicken. After about five minutes, add 200 grams (seven ounces) of peas. Wait about 10 minutes and check the chicken. When it is tender, reduce heat to the lowest setting. Prepare the mushrooms. In a separate skillet, pour one to two tablespoons of vegetable oil. Slice 300 grams (10.5 ounces) of white mushrooms in thin slices. Add salt and pepper, to taste. Sautee them in the skillet over medium-high heat. Plate the chicken stroganoff. To plate the vegetable chicken stroganoff, fill half a bowl with rice. Scoop the stroganoff mix into the other half of the bowl. Then place the mushrooms over the rice. Enjoy your tasty chicken stroganoff. Choosing How to Plate Your Chicken Stroganoff Use egg noodles. Egg noodles are the traditional choice when making chicken stroganoff. If you are interested in a tried-and-true classic, stick to the simple egg noodle. Try a whole-grain pasta. Whole-grain pastas are healthier than refined pastas because they contain more fiber, vitamins, and minerals. Plus, whole grains make you feel fuller, which will keep you from adding unnecessary calories to your diet. You can use any shape of whole-grain pasta. Choose the shape that is most delicious to you. Serve your chicken stroganoff with rice. Instead of some sort of pasta, try serving your chicken stroganoff over rice. Use brown rice instead of white. Compared to white rice, brown rice still has its hull and bran, the parts of the rice grain that contain important nutrients and proteins. You could also try a similar grain like amaranth or quinoa.",
  "tyn_model":[
    "chicken",
    "skillet",
    "mushrooms",
    "sour cream",
    "rice",
    "butter",
    "bowl",
    "salt and pepper",
    "flour",
    "chicken stroganoff",
    "onions",
    "onion",
    "paprika",
    "vermouth",
    "chicken sauce",
    "plate",
    "green onions",
    "pasta",
    "brown rice",
    "large pot",
    "salted water",
    "fork",
    "colander",
    "large skillet",
    "white mushrooms",
    "salt",
    "pepper",
    "wooden spoon",
    "chicken broth",
    "slotted spoon",
    "pasta server",
    "chicken stroganoff sauce",
    "chicken thighs",
    "button mushrooms",
    "pan",
    "stroganoff sauce",
    "chicken stock",
    "tomato paste",
    "bay leaf",
    "thyme",
    "fried chicken",
    "mushroom",
    "carrots",
    "vegetable soup",
    "cream",
    "white wine",
    "peas",
    "vegetable oil",
    "vegetable chicken stroganoff",
    "stroganoff",
    "egg noodles",
    "noodles",
    "egg noodle",
    "amaranth",
    "quinoa"
  ],
  "tyn_section":[

  ]
}