{
  "title":"How to Get Better at Minecraft Skywars",
  "url":"https://www.wikihow.com/Get-Better-at-Minecraft-Skywars",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft",
    "Minecraft Servers",
    "Minecraft Minigames"
  ],
  "steps":[
    {
      "headline":"Join a game.",
      "description":"You can go into the SW Lobby and chose a game mode, such as Teams Insane, Solo Insane, and more."
    },
    {
      "headline":"Use the Armorsmith kit.",
      "description":"With this kit you get a Diamond helmet, a Sharpness/Protection book, an anvil and 64 bottles of Enchanting. This gives you the ability to enchant items at the start, making your gear better than most other people in the game. However, on the map Shire, people will attempt to jump you so use a kit with a sword."
    },
    {
      "headline":"Throw your bottles of enchanting on the floor.",
      "description":"Just watch out for people trying to shoot you. This will make you take damage."
    },
    {
      "headline":"Once you are prepared, build across with your blocks.",
      "description":"But make sure nobody else is trying to egg you off! Look around."
    },
    {
      "headline":"If anyone is around, build a wall around your bridge.",
      "description":"If there's nobody else around, ignore this step."
    },
    {
      "headline":"Get over to the middle.",
      "description":"Look for anyone building across and knock them off. This will get rid of a bunch of potential threats."
    },
    {
      "headline":"Watch out for enemies!",
      "description":"If you think you can take them on, chase them. If you think their gear is better, stay away."
    },
    {
      "headline":"Loot mid.",
      "description":"The middle often gives you Iron and Diamond armor (in Normal) and OP Armor (in Insane). If it's already looted, wait for refill and camp somewhere. Maybe make a fortress!"
    },
    {
      "headline":"Fight off everyone else with your gear.",
      "description":"A good tip is to use a PvP texture pack such as Huahwi's Infinite x16 Edit, and set your attack keybind to something simpler like R (for laptops)."
    },
    {
      "headline":"When you get your first kill, as long as you didn't egg the person you killed off, they drop their gear.",
      "description":"If they have anything better than you, make sure nobody is trying to \"clean-up\" and get the useful gear!"
    },
    {
      "headline":"Once you have fought off every single player, you have won!",
      "description":"Good job!"
    }
  ],
  "text":" Join a game. You can go into the SW Lobby and chose a game mode, such as Teams Insane, Solo Insane, and more. Use the Armorsmith kit. With this kit you get a Diamond helmet, a Sharpness/Protection book, an anvil and 64 bottles of Enchanting. This gives you the ability to enchant items at the start, making your gear better than most other people in the game. However, on the map Shire, people will attempt to jump you so use a kit with a sword. Throw your bottles of enchanting on the floor. Just watch out for people trying to shoot you. This will make you take damage. Once you are prepared, build across with your blocks. But make sure nobody else is trying to egg you off! Look around. If anyone is around, build a wall around your bridge. If there's nobody else around, ignore this step. Get over to the middle. Look for anyone building across and knock them off. This will get rid of a bunch of potential threats. Watch out for enemies! If you think you can take them on, chase them. If you think their gear is better, stay away. Loot mid. The middle often gives you Iron and Diamond armor (in Normal) and OP Armor (in Insane). If it's already looted, wait for refill and camp somewhere. Maybe make a fortress! Fight off everyone else with your gear. A good tip is to use a PvP texture pack such as Huahwi's Infinite x16 Edit, and set your attack keybind to something simpler like R (for laptops). When you get your first kill, as long as you didn't egg the person you killed off, they drop their gear. If they have anything better than you, make sure nobody is trying to \"clean-up\" and get the useful gear! Once you have fought off every single player, you have won! Good job!",
  "tyn_model":[
    "enchanting",
    "armorsmith kit",
    "anvil",
    "sword",
    "blocks"
  ],
  "tyn_section":[

  ]
}