{
  "title":"How to Make Healthy Ramen",
  "url":"https://www.wikihow.com/Make-Healthy-Ramen",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Ramen Dishes"
  ],
  "methods":[
    {
      "name":"Making Healthy Chicken Ramen",
      "steps":[
        {
          "headline":"Bring two eggs to a boil.",
          "description":"Healthy chicken ramen has a classic chicken broth-based flavor that is reminiscent of instant ramen, but tastes fresher and is much healthier. Begin by adding two whole eggs in their shells, to a medium sized pot. Add enough water to cover the eggs by 1 inch (2.54 cm), and heat them on medium heat until the water reaches a boil."
        },
        {
          "headline":"Let the eggs sit for 7 minutes in the water.",
          "description":"Once the water reaches a boil, take the pot of eggs off the stovetop. Let the eggs sit uncovered for seven minutes, then take the eggs out of the water using tongs or a large spoon and place them in a bowl of ice water. Only keep the eggs in the water for 7 minutes. If you leave them in longer, the eggs will become hardboiled as opposed to soft boiled. Soft boiled eggs are better in ramen because they have somewhat runny yolks, which add to the flavor of the broth."
        },
        {
          "headline":"Bring chicken broth and soy sauce to a boil.",
          "description":"In a medium sized saucepan, add the 4 cups (946.36 ml) of chicken broth and 1 ½ teaspoons (7.39 ml) soy sauce. Heat on medium heat until the mixture reaches a boil."
        },
        {
          "headline":"Cook chicken breasts in the broth.",
          "description":"Once the broth reaches a boil, drop the two chicken breasts in the broth and cook for 8-10 minutes until the chicken is fully cooked. Then remove the chicken breasts and let them cool."
        },
        {
          "headline":"Shred the chicken.",
          "description":"Once the chicken breasts have fully cooled, shred the chicken into small strips using your fingers. Then add the cooked chicken strips back to the broth and stir to mix them in."
        },
        {
          "headline":"Prepare the vegetables.",
          "description":"Once you shred the chicken, slice the cabbage into thin, 2 inch long (5.08 cm) strips and shred the carrots into thin shreds using a vegetable peeler. Cut the green onion into ½ inch (1.26 cm) rounds and peel the two soft boiled eggs of their shell, then cut them in half."
        },
        {
          "headline":"Add the ramen noodles and cook for 3-5 minutes.",
          "description":"After returning the shredded chicken back to the broth, add the ramen noodles to the pot and cook according to the package, likely from 3-5 minutes. Then remove the soup from the heat."
        },
        {
          "headline":"Garnish and serve the ramen.",
          "description":"After taking the ramen off the heat, add in sliced cabbage and carrots. Pour the ramen into bowls, adding one egg half and a sprinkle of green onion to each bowl. Add chili oil if you want extra spice and flavor, then serve the ramen while hot."
        }
      ]
    },
    {
      "name":"Making Healthy Kimchi Ramen",
      "steps":[
        {
          "headline":"Chop the green onions and kimchi.",
          "description":"Healthy kimchi ramen is a Korean style ramen that is flavored by the spicy and sweetly sour taste of kimchi. Begin preparing this ramen by chopping the green onions on the round into ½ inch (1.26 cm) pieces. Measure out 3/4 cup (180 ml) of kimchi, then slice any particularly large chunks of kimchi into pieces that are about 1 ½ inches (3.81 cm) by 1 inch (2.54 cm)."
        },
        {
          "headline":"Soft boil two eggs.",
          "description":"Place two whole eggs (including shell) in a medium sized pot and add enough water to cover the eggs by 1 inch (2.54 cm). Place the pot on medium heat until the water reaches a boil. Then take the pot off the heat and let the eggs sit in the hot water for 7 minutes. After 7 minutes, take the eggs out of the water using tongs or a large spoon and let the eggs cool. Once the eggs have cooled, peel the shells off the eggs and cut the two eggs in half. Soft boiled eggs are a traditional addition to ramen, and are preferable to hard boiled eggs because their runny yolks add flavor and thickness to the broth."
        },
        {
          "headline":"Bring the chicken stock, kimchi, miso and soy sauce to a boil.",
          "description":"Place the chicken stock, ½ cup (118.29 ml) kimchi, white miso and soy sauce in a large pot. Mix the ingredients together, then place the pot on medium heat and bring the broth to a boil."
        },
        {
          "headline":"Add the ramen noodles and cook for 5 minutes.",
          "description":"Once the broth has reached a boil, add the ramen noodles and cook according to the packaging, about five minutes, until the noodles are soft."
        },
        {
          "headline":"Divide the ramen between bowls and serve.",
          "description":"After the noodles have finished cooking, use a ladle to divide the noodles and broth between the bowls you will serve it in. Then garnish each bowl with one egg half, a handful of scallions and more kimchi. Serve immediately while the ramen is hot!"
        }
      ]
    },
    {
      "name":"Making Low Fat Instant Ramen",
      "steps":[
        {
          "headline":"Heat water and half of the ramen flavoring.",
          "description":"If you really enjoy the taste of your favorite instant ramen but want to cut the fat and MSG, you can easily doctor the way you make it to make it healthier. Begin by adding 1 ½ cups (354.88 ml) water and ½ of the package of instant ramen flavor powder to a pot. Place the pot on the stove over medium-high heat and bring the mixture to a boil."
        },
        {
          "headline":"Add the ramen to the boiling broth.",
          "description":"Once the broth begins to boil, add the instant ramen noodles and reduce the heat to medium. Then cook the noodles for 2 minutes, stirring occasionally, until the noodles are partially cooked."
        },
        {
          "headline":"Strain out the ramen noodles.",
          "description":"Once the ramen noodles have cooked for 2 minutes, pour the pot of noodles and broth into a colander to drain the noodles. Then wipe the residual oil out from the pot. You will only use ½ of the packet of ramen seasoning to cut the MSG and fat from the ramen. Cooking the noodles with some of the ramen seasoning infuses them with flavor, but you should drain the broth from the noodles because you will only use ½ of the flavoring to make the ramen."
        },
        {
          "headline":"Heat the water, the rest of the ramen seasoning and the ramen flakes.",
          "description":"In the same pot you used to cook the ramen noodles, add 1 ¼ cups (295.73 ml) of water, the rest of the ramen powder and the ramen flakes from the packet over high heat."
        },
        {
          "headline":"Beat and add the egg.",
          "description":"Crack the egg into a small bowl and beat it lightly with a fork. Once the ramen starts to boil, use a whisk to stir the broth around in a circle. Once the broth gains circular momentum, slowly pour the egg into the broth. Adding the egg into swirling water poaches the egg. The circular motion of the broth allows the egg white to envelope the yolk and start to slowly cook. The cooked egg will still have a runny yolk when cut into, which will enrich the broth of the soup and add extra flavor and thickness."
        },
        {
          "headline":"Add the noodles.",
          "description":"Once you add the egg and see it starting to cook and solidify, add in the partially cooked ramen noodles. Cook another two minutes or so until the noodles are done."
        },
        {
          "headline":"Add garnish and extra flavor to the soup.",
          "description":"After the noodles have finished cooking, add in hot chili oil, soy sauce, miso paste or your favorite flavorings to taste. Then divide the ramen between bowls, making sure each serving gets an egg, garnish with chopped green onion, and serve while hot. Using only ½ of the ramen flavoring cuts back on fat and MSG. Add flavors as you see fit if you feel the ramen isn't flavorful enough. Hot chili oil is a traditional addition to ramen, and adds spiciness and flavor. Soy sauce adds a darker taste to ramen that gives the soup more depth, while miso paste gives it a nuanced, slightly salty flavor. Once you break the poached egg, the yolk will run into the broth to add flavor as well."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Healthy Chicken Ramen Bring two eggs to a boil. Healthy chicken ramen has a classic chicken broth-based flavor that is reminiscent of instant ramen, but tastes fresher and is much healthier. Begin by adding two whole eggs in their shells, to a medium sized pot. Add enough water to cover the eggs by 1 inch (2.54 cm), and heat them on medium heat until the water reaches a boil. Let the eggs sit for 7 minutes in the water. Once the water reaches a boil, take the pot of eggs off the stovetop. Let the eggs sit uncovered for seven minutes, then take the eggs out of the water using tongs or a large spoon and place them in a bowl of ice water. Only keep the eggs in the water for 7 minutes. If you leave them in longer, the eggs will become hardboiled as opposed to soft boiled. Soft boiled eggs are better in ramen because they have somewhat runny yolks, which add to the flavor of the broth. Bring chicken broth and soy sauce to a boil. In a medium sized saucepan, add the 4 cups (946.36 ml) of chicken broth and 1 ½ teaspoons (7.39 ml) soy sauce. Heat on medium heat until the mixture reaches a boil. Cook chicken breasts in the broth. Once the broth reaches a boil, drop the two chicken breasts in the broth and cook for 8-10 minutes until the chicken is fully cooked. Then remove the chicken breasts and let them cool. Shred the chicken. Once the chicken breasts have fully cooled, shred the chicken into small strips using your fingers. Then add the cooked chicken strips back to the broth and stir to mix them in. Prepare the vegetables. Once you shred the chicken, slice the cabbage into thin, 2 inch long (5.08 cm) strips and shred the carrots into thin shreds using a vegetable peeler. Cut the green onion into ½ inch (1.26 cm) rounds and peel the two soft boiled eggs of their shell, then cut them in half. Add the ramen noodles and cook for 3-5 minutes. After returning the shredded chicken back to the broth, add the ramen noodles to the pot and cook according to the package, likely from 3-5 minutes. Then remove the soup from the heat. Garnish and serve the ramen. After taking the ramen off the heat, add in sliced cabbage and carrots. Pour the ramen into bowls, adding one egg half and a sprinkle of green onion to each bowl. Add chili oil if you want extra spice and flavor, then serve the ramen while hot. Making Healthy Kimchi Ramen Chop the green onions and kimchi. Healthy kimchi ramen is a Korean style ramen that is flavored by the spicy and sweetly sour taste of kimchi. Begin preparing this ramen by chopping the green onions on the round into ½ inch (1.26 cm) pieces. Measure out 3/4 cup (180 ml) of kimchi, then slice any particularly large chunks of kimchi into pieces that are about 1 ½ inches (3.81 cm) by 1 inch (2.54 cm). Soft boil two eggs. Place two whole eggs (including shell) in a medium sized pot and add enough water to cover the eggs by 1 inch (2.54 cm). Place the pot on medium heat until the water reaches a boil. Then take the pot off the heat and let the eggs sit in the hot water for 7 minutes. After 7 minutes, take the eggs out of the water using tongs or a large spoon and let the eggs cool. Once the eggs have cooled, peel the shells off the eggs and cut the two eggs in half. Soft boiled eggs are a traditional addition to ramen, and are preferable to hard boiled eggs because their runny yolks add flavor and thickness to the broth. Bring the chicken stock, kimchi, miso and soy sauce to a boil. Place the chicken stock, ½ cup (118.29 ml) kimchi, white miso and soy sauce in a large pot. Mix the ingredients together, then place the pot on medium heat and bring the broth to a boil. Add the ramen noodles and cook for 5 minutes. Once the broth has reached a boil, add the ramen noodles and cook according to the packaging, about five minutes, until the noodles are soft. Divide the ramen between bowls and serve. After the noodles have finished cooking, use a ladle to divide the noodles and broth between the bowls you will serve it in. Then garnish each bowl with one egg half, a handful of scallions and more kimchi. Serve immediately while the ramen is hot! Making Low Fat Instant Ramen Heat water and half of the ramen flavoring. If you really enjoy the taste of your favorite instant ramen but want to cut the fat and MSG, you can easily doctor the way you make it to make it healthier. Begin by adding 1 ½ cups (354.88 ml) water and ½ of the package of instant ramen flavor powder to a pot. Place the pot on the stove over medium-high heat and bring the mixture to a boil. Add the ramen to the boiling broth. Once the broth begins to boil, add the instant ramen noodles and reduce the heat to medium. Then cook the noodles for 2 minutes, stirring occasionally, until the noodles are partially cooked. Strain out the ramen noodles. Once the ramen noodles have cooked for 2 minutes, pour the pot of noodles and broth into a colander to drain the noodles. Then wipe the residual oil out from the pot. You will only use ½ of the packet of ramen seasoning to cut the MSG and fat from the ramen. Cooking the noodles with some of the ramen seasoning infuses them with flavor, but you should drain the broth from the noodles because you will only use ½ of the flavoring to make the ramen. Heat the water, the rest of the ramen seasoning and the ramen flakes. In the same pot you used to cook the ramen noodles, add 1 ¼ cups (295.73 ml) of water, the rest of the ramen powder and the ramen flakes from the packet over high heat. Beat and add the egg. Crack the egg into a small bowl and beat it lightly with a fork. Once the ramen starts to boil, use a whisk to stir the broth around in a circle. Once the broth gains circular momentum, slowly pour the egg into the broth. Adding the egg into swirling water poaches the egg. The circular motion of the broth allows the egg white to envelope the yolk and start to slowly cook. The cooked egg will still have a runny yolk when cut into, which will enrich the broth of the soup and add extra flavor and thickness. Add the noodles. Once you add the egg and see it starting to cook and solidify, add in the partially cooked ramen noodles. Cook another two minutes or so until the noodles are done. Add garnish and extra flavor to the soup. After the noodles have finished cooking, add in hot chili oil, soy sauce, miso paste or your favorite flavorings to taste. Then divide the ramen between bowls, making sure each serving gets an egg, garnish with chopped green onion, and serve while hot. Using only ½ of the ramen flavoring cuts back on fat and MSG. Add flavors as you see fit if you feel the ramen isn't flavorful enough. Hot chili oil is a traditional addition to ramen, and adds spiciness and flavor. Soy sauce adds a darker taste to ramen that gives the soup more depth, while miso paste gives it a nuanced, slightly salty flavor. Once you break the poached egg, the yolk will run into the broth to add flavor as well. Finished. ",
  "tyn_model":[
    "ramen",
    "water",
    "pot",
    "broth",
    "soy sauce",
    "eggs",
    "ramen noodles",
    "kimchi",
    "chicken broth",
    "chicken",
    "green onion",
    "ramen seasoning",
    "medium sized pot",
    "chicken breasts",
    "cabbage",
    "carrots",
    "chili oil",
    "green onions",
    "chicken stock",
    "miso paste",
    "bowl",
    "ice water",
    "medium sized saucepan",
    "vegetables",
    "vegetable peeler",
    "large spoon",
    "miso",
    "white miso",
    "large pot",
    "bowls",
    "ladle",
    "scallions",
    "instant ramen",
    "instant ramen flavor powder",
    "stove",
    "instant ramen noodles",
    "colander",
    "ramen flakes",
    "egg",
    "fork",
    "whisk",
    "noodles",
    "hot chili oil"
  ],
  "tyn_section":[

  ]
}