{
  "title":"How to Discourage Uninvited House Guests",
  "url":"https://www.wikihow.com/Discourage-Uninvited-House-Guests",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "House Guests"
  ],
  "methods":[
    {
      "name":"Communicating with Them",
      "steps":[
        {
          "headline":"Ask them to leave.",
          "description":"The simplest and most straightforward way of discouraging their continued stay is to just ask them to leave. By asking them to leave, you’ll explicitly communicate the fact that they are indeed uninvited. Be firm. Let them know that you are serious. Say, for example, “John, I’d like you to leave by the end of the week.”\nTry to be polite. For example, say “We’ve really enjoyed having you stay with us, but its best for everyone if you move on to your next destination.”\nIf the person refuses, you may need to resort to legal means."
        },
        {
          "headline":"Remind them about any pre-existing arrangements.",
          "description":"If you made an arrangement with the person before they came into your home, then bring this up to them. This may help them to see that they are infringing on your space and decide to move on. For example, you could say something like, “Remember when you first arrived and I said that I had a busy week ahead of me, but you assured me that you would only be here for the weekend?”"
        },
        {
          "headline":"Tell them you have other obligations to attend to.",
          "description":"A great way to get your guest to leave is to tell them that your life is getting in the way of being a good host to them. In the end, they may take the hint and pack their bags. Let them know that your work and family life are so busy that you can’t be the type of host you want to be at the moment. They should consider visiting again in the future. Tell them that other house guests will be arriving soon. For example, let them know that your in-laws are coming to visit and need to stay in the room they are staying in. Say “John, I’m so sorry, but my in-laws are coming to stay for a week starting Friday, we’ve got to have our guest room available to them.”\nShare your plans to begin a home improvement project on the room they are staying in. For example, tell them you’re about to convert it into a home office or a gym. If you’re serious about it, you may even want to hire a contractor to go and take measurements of the space."
        },
        {
          "headline":"Request monetary contributions.",
          "description":"One of the realities of hosting is that your guests will undoubtedly cost you money. Because of this, it seems obvious that you should request contributions of your guest if they overstay their welcome. However, if you just want them to leave then this might not be the best option. If you are okay with them staying longer if they help to cover the costs of their stay, then there are a couple of things you can try. Explain to them the cost of them staying. Detail the cost of extra water, power, and any other resources they are using. Set your nightly or weekly rate above low-cost alternatives. For example, if an extended stay charges $200 a week, you should ask $250. Understand that this might not work for some people, like parents or older relatives. Requesting money is best reserved for younger relatives, siblings, and children."
        },
        {
          "headline":"Ask them to do chores.",
          "description":"In addition to monetary contributions, your guest should also pitch in and take care of some household chores. This should make a lot of sense, as someone who lives in a home should take part in taking care of the home. Some chores might include:\nLawncare\nTaking the trash out\nWashing dishes\nGeneral household cleaning."
        }
      ]
    },
    {
      "name":"Taking Concrete Action",
      "steps":[
        {
          "headline":"Avoid feeding them.",
          "description":"While it may seem polite to invite your house guest to dine with you, you may be inadvertently inviting them to stay. Instead, avoid dining with them or feeding them at all. If possible, dine out in the company of friends and family. Don’t inform them if you are cooking a meal. Stop stocking your pantry and refrigerator with snack food that they like to eat. In fact, if you notice they’re munching on something, make it disappear."
        },
        {
          "headline":"Disengage from them.",
          "description":"It may seem tempting to spend time with your house guest or to invite them to fun activities. But while you may be having fun, you are also sending the signal that they should stick around. Instead, avoid engaging or spending time with the person. Don’t announce recreational activities that you are involved in. They may invite themselves to join you. Watch TV in your own room or away from them. If you watch TV in the living room, your guest may take the time to hang out with you."
        },
        {
          "headline":"Take small steps to make your home less inviting.",
          "description":"There are small things you can do to make your home a whole lot less attractive to stay at. And while these things might seem small to you, they might be enough to get your house guest to reconsider their living plans. Feel free to turn on the TV early in the morning or entertain guests late into the night. If the house guest does not respect you enough to leave, you shouldn’t go out of your way to make your home inviting."
        }
      ]
    },
    {
      "name":"Keeping Them Away in the First Place",
      "steps":[
        {
          "headline":"Never volunteer the fact that you have a spare room.",
          "description":"One of the worst things you can do is to let potentially unwanted house guests know that you have a guest room open. Thus, you should not advertise the fact that you can host people. Only tell close friends or family about your guest room. Don’t invite someone to stay, or even suggest it, unless you really mean it. Avoid bragging about or talking about your house around people you don’t want staying with you."
        },
        {
          "headline":"Let them know that your place is not comfortable or relaxing.",
          "description":"A good way to head off an uninvited house guest is to share with them the fact that your home is not really welcoming. By letting them know that your home is often chaotic, they’ll see it as an undesirable place to stay. Share the fact that your small children are noisy. Talk about how your place is cluttered and needs to be cleaned. Tell them about your aggressive dogs."
        },
        {
          "headline":"Don’t make yourself or your home available when they’re in town.",
          "description":"If someone is coming into town who you know will try to invite themselves to your home, make yourself scarce. By not being around, you’ll make it very hard for them to settle in as a houseguest. Tell them you are going out of town. Let your family know you will be out of town or on vacation during the holidays. Make plans so you will be busy when they are around. If you must meet a person who is visiting from out of town, make sure to do so at a neutral location, like a restaurant or coffee house. Don’t invite them to your home. They may invite themselves to stay."
        },
        {
          "headline":"Lie if you must.",
          "description":"Depending on the situation, you might have to resort to lying to a potential house guest. While lying seems like a drastic step to take, you might need to do it to avoid an awful and uninvited house guest. Try to bend the truth instead of creating a big lie. You don't want to get caught in the middle of your own lie. For example, instead of saying one of your kids is deathly ill, say they have a very contagious cold. Use future plans to deter them from staying. For instance, if you plan on remodeling the house in six months, tell them you're about to start now. In the end, you can always tell them you pushed it back. Remember that the person will likely communicate with others that you know, so make sure you don't create a lie that you'll be caught in. Before you lie, consider that telling the truth and outright refusing to host the person might be a better option."
        },
        {
          "headline":"Be clear about your terms.",
          "description":"If you are willing to let someone stay in your home for a short period of time, then make sure to clearly communicate your terms for their stay with them. Do this before their stay begins. For example, you may want to place a specific time limit on their stay, such as by saying they can stay up to two nights and must leave by 11am on the second morning of their stay."
        }
      ]
    }
  ],
  "text":" Communicating with Them Ask them to leave. The simplest and most straightforward way of discouraging their continued stay is to just ask them to leave. By asking them to leave, you’ll explicitly communicate the fact that they are indeed uninvited. Be firm. Let them know that you are serious. Say, for example, “John, I’d like you to leave by the end of the week.”\nTry to be polite. For example, say “We’ve really enjoyed having you stay with us, but its best for everyone if you move on to your next destination.”\nIf the person refuses, you may need to resort to legal means. Remind them about any pre-existing arrangements. If you made an arrangement with the person before they came into your home, then bring this up to them. This may help them to see that they are infringing on your space and decide to move on. For example, you could say something like, “Remember when you first arrived and I said that I had a busy week ahead of me, but you assured me that you would only be here for the weekend?” Tell them you have other obligations to attend to. A great way to get your guest to leave is to tell them that your life is getting in the way of being a good host to them. In the end, they may take the hint and pack their bags. Let them know that your work and family life are so busy that you can’t be the type of host you want to be at the moment. They should consider visiting again in the future. Tell them that other house guests will be arriving soon. For example, let them know that your in-laws are coming to visit and need to stay in the room they are staying in. Say “John, I’m so sorry, but my in-laws are coming to stay for a week starting Friday, we’ve got to have our guest room available to them.”\nShare your plans to begin a home improvement project on the room they are staying in. For example, tell them you’re about to convert it into a home office or a gym. If you’re serious about it, you may even want to hire a contractor to go and take measurements of the space. Request monetary contributions. One of the realities of hosting is that your guests will undoubtedly cost you money. Because of this, it seems obvious that you should request contributions of your guest if they overstay their welcome. However, if you just want them to leave then this might not be the best option. If you are okay with them staying longer if they help to cover the costs of their stay, then there are a couple of things you can try. Explain to them the cost of them staying. Detail the cost of extra water, power, and any other resources they are using. Set your nightly or weekly rate above low-cost alternatives. For example, if an extended stay charges $200 a week, you should ask $250. Understand that this might not work for some people, like parents or older relatives. Requesting money is best reserved for younger relatives, siblings, and children. Ask them to do chores. In addition to monetary contributions, your guest should also pitch in and take care of some household chores. This should make a lot of sense, as someone who lives in a home should take part in taking care of the home. Some chores might include:\nLawncare\nTaking the trash out\nWashing dishes\nGeneral household cleaning. Taking Concrete Action Avoid feeding them. While it may seem polite to invite your house guest to dine with you, you may be inadvertently inviting them to stay. Instead, avoid dining with them or feeding them at all. If possible, dine out in the company of friends and family. Don’t inform them if you are cooking a meal. Stop stocking your pantry and refrigerator with snack food that they like to eat. In fact, if you notice they’re munching on something, make it disappear. Disengage from them. It may seem tempting to spend time with your house guest or to invite them to fun activities. But while you may be having fun, you are also sending the signal that they should stick around. Instead, avoid engaging or spending time with the person. Don’t announce recreational activities that you are involved in. They may invite themselves to join you. Watch TV in your own room or away from them. If you watch TV in the living room, your guest may take the time to hang out with you. Take small steps to make your home less inviting. There are small things you can do to make your home a whole lot less attractive to stay at. And while these things might seem small to you, they might be enough to get your house guest to reconsider their living plans. Feel free to turn on the TV early in the morning or entertain guests late into the night. If the house guest does not respect you enough to leave, you shouldn’t go out of your way to make your home inviting. Keeping Them Away in the First Place Never volunteer the fact that you have a spare room. One of the worst things you can do is to let potentially unwanted house guests know that you have a guest room open. Thus, you should not advertise the fact that you can host people. Only tell close friends or family about your guest room. Don’t invite someone to stay, or even suggest it, unless you really mean it. Avoid bragging about or talking about your house around people you don’t want staying with you. Let them know that your place is not comfortable or relaxing. A good way to head off an uninvited house guest is to share with them the fact that your home is not really welcoming. By letting them know that your home is often chaotic, they’ll see it as an undesirable place to stay. Share the fact that your small children are noisy. Talk about how your place is cluttered and needs to be cleaned. Tell them about your aggressive dogs. Don’t make yourself or your home available when they’re in town. If someone is coming into town who you know will try to invite themselves to your home, make yourself scarce. By not being around, you’ll make it very hard for them to settle in as a houseguest. Tell them you are going out of town. Let your family know you will be out of town or on vacation during the holidays. Make plans so you will be busy when they are around. If you must meet a person who is visiting from out of town, make sure to do so at a neutral location, like a restaurant or coffee house. Don’t invite them to your home. They may invite themselves to stay. Lie if you must. Depending on the situation, you might have to resort to lying to a potential house guest. While lying seems like a drastic step to take, you might need to do it to avoid an awful and uninvited house guest. Try to bend the truth instead of creating a big lie. You don't want to get caught in the middle of your own lie. For example, instead of saying one of your kids is deathly ill, say they have a very contagious cold. Use future plans to deter them from staying. For instance, if you plan on remodeling the house in six months, tell them you're about to start now. In the end, you can always tell them you pushed it back. Remember that the person will likely communicate with others that you know, so make sure you don't create a lie that you'll be caught in. Before you lie, consider that telling the truth and outright refusing to host the person might be a better option. Be clear about your terms. If you are willing to let someone stay in your home for a short period of time, then make sure to clearly communicate your terms for their stay with them. Do this before their stay begins. For example, you may want to place a specific time limit on their stay, such as by saying they can stay up to two nights and must leave by 11am on the second morning of their stay.",
  "tyn_model":[
    "”\n",
    "“john",
    "“we",
    "“remember",
    "” tell",
    "water",
    "dishes",
    "refrigerator",
    "tv"
  ],
  "tyn_section":[

  ]
}