{
  "title":"How to Expand Your Painting Repertoire with Pointillism",
  "url":"https://www.wikihow.com/Expand-Your-Painting-Repertoire-with-Pointillism",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles"
  ],
  "methods":[
    {
      "name":"Doing Pointillism with Pencils and Markers",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"You will need a sheet of watercolor paper from a pad for practice. You'll also need an ordinary number 2 pencil, colored markers in various shades, including neutrals, grays, browns and black."
        },
        {
          "headline":"Begin exploring pointillism with an ordinary pencil.",
          "description":"On scrap paper, create a series of dots close together to form a dark area. Hold the paper away from you and see if they are close enough to appear as a spot of black. Now, space them further apart and make them a lighter tone to form a gray area. Continue playing with dots making them further apart until they fade to white."
        },
        {
          "headline":"For comparison, make a swatch of shading as you normally would if you were drawing.",
          "description":"Angle your pencil slightly and rub to make a patch of gray tone. Then, lighten it as you work paler and paler until it goes to white."
        },
        {
          "headline":"Try the same thing using a black marker.",
          "description":""
        },
        {
          "headline":"Use colored markers in yellow and blue or red and blue.",
          "description":"Try mixing the dots to see if you can create green and violet when viewed at a distance."
        }
      ]
    },
    {
      "name":"Doing Pointillism with Paint",
      "steps":[
        {
          "headline":"Do pointillism using watercolor.",
          "description":"Gather your watercolors and other supplies. Use a set containing dry pads or watercolors in tubes in primary colors and black. Also, prepare a work space, large container of water, and tissues."
        },
        {
          "headline":"Make a special brush.",
          "description":"Trim the bristles of a cheap easel painting brush to ½ inch long. First tape around the bristles to secure them and cut through with ordinary scissors. Remove tape."
        },
        {
          "headline":"Find an image for your painting.",
          "description":"This can be a flower, animal, bird, fish, or plan to do an abstract design."
        },
        {
          "headline":"Draw your design, in pencil, on watercolor paper.",
          "description":"Keep it simple."
        },
        {
          "headline":"Paint the design.",
          "description":"Touch the brush to an area of paint and on practice paper. When you stamp the brush aim for getting individual dots of color. Practice until you achieve this dotted effect."
        },
        {
          "headline":"Stipple color onto your design in any order you please.",
          "description":"One method is to do the dark areas first."
        },
        {
          "headline":"Keep in mind however you choose to do it is OK.",
          "description":"Enjoy the process of painting with tiny dots. Another way is to under paint an area with a watercolor wash.  Use a normal watercolor brush for this. Allow it to dry and then use your special stippling brush to paint dots over the colored area."
        },
        {
          "headline":"Set the finished piece away from you.",
          "description":"See whether the colors merge from a distance. You might consider going back in and reworking an area with larger dots. Do this by using a small, pointed brush and painting each dot individually."
        }
      ]
    }
  ],
  "text":" Doing Pointillism with Pencils and Markers Gather your supplies. You will need a sheet of watercolor paper from a pad for practice. You'll also need an ordinary number 2 pencil, colored markers in various shades, including neutrals, grays, browns and black. Begin exploring pointillism with an ordinary pencil. On scrap paper, create a series of dots close together to form a dark area. Hold the paper away from you and see if they are close enough to appear as a spot of black. Now, space them further apart and make them a lighter tone to form a gray area. Continue playing with dots making them further apart until they fade to white. For comparison, make a swatch of shading as you normally would if you were drawing. Angle your pencil slightly and rub to make a patch of gray tone. Then, lighten it as you work paler and paler until it goes to white. Try the same thing using a black marker.  Use colored markers in yellow and blue or red and blue. Try mixing the dots to see if you can create green and violet when viewed at a distance. Doing Pointillism with Paint Do pointillism using watercolor. Gather your watercolors and other supplies. Use a set containing dry pads or watercolors in tubes in primary colors and black. Also, prepare a work space, large container of water, and tissues. Make a special brush. Trim the bristles of a cheap easel painting brush to ½ inch long. First tape around the bristles to secure them and cut through with ordinary scissors. Remove tape. Find an image for your painting. This can be a flower, animal, bird, fish, or plan to do an abstract design. Draw your design, in pencil, on watercolor paper. Keep it simple. Paint the design. Touch the brush to an area of paint and on practice paper. When you stamp the brush aim for getting individual dots of color. Practice until you achieve this dotted effect. Stipple color onto your design in any order you please. One method is to do the dark areas first. Keep in mind however you choose to do it is OK. Enjoy the process of painting with tiny dots. Another way is to under paint an area with a watercolor wash.  Use a normal watercolor brush for this. Allow it to dry and then use your special stippling brush to paint dots over the colored area. Set the finished piece away from you. See whether the colors merge from a distance. You might consider going back in and reworking an area with larger dots. Do this by using a small, pointed brush and painting each dot individually.",
  "tyn_model":[
    "watercolor paper",
    "colored markers",
    "watercolors",
    "tape",
    "pencils",
    "ordinary pencil",
    "scrap paper",
    "paper",
    "pencil",
    "black marker",
    "watercolor",
    "water",
    "tissues",
    "easel painting brush",
    "scissors",
    "paint",
    "practice paper",
    "watercolor wash",
    "watercolor brush"
  ],
  "tyn_section":[

  ]
}