{
  "title":"How to Clean a Home in Under an Hour",
  "url":"https://www.wikihow.com/Clean-a-Home-in-Under-an-Hour",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "Speed Cleaning"
  ],
  "steps":[
    {
      "headline":"Set the timer for an hour.",
      "description":""
    },
    {
      "headline":"Start off with your living room.",
      "description":"This is probably the most important place to clean because everyone is passing through it."
    },
    {
      "headline":"Wipe down.",
      "description":"If you have any tables in your living room, now is the time to wipe them down. Take a clean rag, spray the appropriate cleaner on the table (for example, not bleach on wood and glass tables.) and wipe down."
    },
    {
      "headline":"Dust down any pictures you have.",
      "description":"Nobody likes looking at a dusty family portrait!"
    },
    {
      "headline":"Wash the spots.",
      "description":"If you have any spills or stains on the wall, get a spot washer and gently rub with a rag until the spot goes away."
    },
    {
      "headline":"Pick up anything on the floor.",
      "description":"Make sure you, or your spouse and kids don't step on anything."
    },
    {
      "headline":"Vacuum the floor.",
      "description":"If you have any spots or stains on your carpet, now is the time to clean them. Get a carpet cleaner, and spray on stain according to directions."
    },
    {
      "headline":"Start on the Kitchen.",
      "description":"It should be about 20-30 minutes left on the timer."
    },
    {
      "headline":"Oven clean.",
      "description":"Take an oven cleaner, and apply to oven according to instructions."
    },
    {
      "headline":"Counters.",
      "description":"Clear off any items, or food from the counter and wipe. ( also with the tables, use correct cleaner."
    },
    {
      "headline":"Sweep.",
      "description":"Once done wiping the counters, sweep the floor of particles from the counter."
    },
    {
      "headline":"Start cleaning your bathroom.",
      "description":"There should be about 15-20 minutes left now."
    },
    {
      "headline":"Mirror.",
      "description":"If your bathroom has a mirror, use a glass cleaner and wipe it down with a rag."
    },
    {
      "headline":"Toilet.",
      "description":"Apply a toilet bowl cleaner to the toilet bowl, and let sit according to directions. While that is soaking, take a clean rag (used for toilet only!) and wipe the outside of the toilet to remove any debris."
    },
    {
      "headline":"Shower.",
      "description":"Apply shower cleaner to shower and let sit. When rinsing out, scrub away debris to leave shower looking clean."
    },
    {
      "headline":"Now, you should have about 5-10 minutes left.",
      "description":"Quickly pick up anything on the floor in your room, and make the bed."
    },
    {
      "headline":"Enjoy your clean home!",
      "description":""
    }
  ],
  "text":" Set the timer for an hour.  Start off with your living room. This is probably the most important place to clean because everyone is passing through it. Wipe down. If you have any tables in your living room, now is the time to wipe them down. Take a clean rag, spray the appropriate cleaner on the table (for example, not bleach on wood and glass tables.) and wipe down. Dust down any pictures you have. Nobody likes looking at a dusty family portrait! Wash the spots. If you have any spills or stains on the wall, get a spot washer and gently rub with a rag until the spot goes away. Pick up anything on the floor. Make sure you, or your spouse and kids don't step on anything. Vacuum the floor. If you have any spots or stains on your carpet, now is the time to clean them. Get a carpet cleaner, and spray on stain according to directions. Start on the Kitchen. It should be about 20-30 minutes left on the timer. Oven clean. Take an oven cleaner, and apply to oven according to instructions. Counters. Clear off any items, or food from the counter and wipe. ( also with the tables, use correct cleaner. Sweep. Once done wiping the counters, sweep the floor of particles from the counter. Start cleaning your bathroom. There should be about 15-20 minutes left now. Mirror. If your bathroom has a mirror, use a glass cleaner and wipe it down with a rag. Toilet. Apply a toilet bowl cleaner to the toilet bowl, and let sit according to directions. While that is soaking, take a clean rag (used for toilet only!) and wipe the outside of the toilet to remove any debris. Shower. Apply shower cleaner to shower and let sit. When rinsing out, scrub away debris to leave shower looking clean. Now, you should have about 5-10 minutes left. Quickly pick up anything on the floor in your room, and make the bed. Enjoy your clean home! ",
  "tyn_model":[
    "rag",
    "cleaner",
    "oven",
    "bleach",
    "spot washer",
    "carpet cleaner",
    "oven cleaner",
    "mirror",
    "glass cleaner",
    "toilet bowl cleaner",
    "toilet bowl",
    "toilet",
    "shower",
    "shower cleaner"
  ],
  "tyn_section":[

  ]
}