{
  "title":"How to Make Peanut Butter Banana Oatmeal Cookies",
  "url":"https://www.wikihow.com/Make-Peanut-Butter-Banana-Oatmeal-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Nut Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Prepare your ingredients and supplies.",
      "description":"Preheat the oven to 350 degrees Fahrenheit. Place parchment paper over the cookie sheet or grease the cookie sheet so the cookies will not stick after cooking."
    },
    {
      "headline":"Peel 4 bananas.",
      "description":"Put the bananas in a big mixing bowl. Take a fork or potato masher and mash the bananas until there are little to no clumps."
    },
    {
      "headline":"Add 1 1/2 cups of flour into the mixing bowl.",
      "description":"Mix the flour and bananas with a fork."
    },
    {
      "headline":"Add 1/2 tsp of baking soda, 1/2 tsp of baking powder and 1/4 tsp of salt into the mixture.",
      "description":"Mix all ingredients with a fork."
    },
    {
      "headline":"Add 1 1/2 cups of rolled oats, 1 cup of smooth peanut butter, 1/2 cup of brown sugar and 1/4 cup of cane sugar into the mixing bowl.",
      "description":"Mix all ingredients with a fork."
    },
    {
      "headline":"Cut 1/4 slice of butter.",
      "description":"In order to properly cut a 1/4 cup of butter, use the measurements on the wrapper of a block of butter. If there are no measurements on the wrapper, scoop 4 tablespoons (59.1 ml) of butter. If using sticks of butter, use 1/2 a stick of butter. Put the butter in a glass measuring cup."
    },
    {
      "headline":"Microwave the slice of butter.",
      "description":"Set the microwave for 15 seconds. When the microwave notifies you that the butter is finished microwaving, carefully take the cup of butter out of the microwave with oven mitts."
    },
    {
      "headline":"Take the 1/4 cup of melted butter and pour it into the mixing bowl.",
      "description":"Mix all of the ingredients with a fork."
    },
    {
      "headline":"Add 2 tsp of vanilla.",
      "description":"Mix all of the ingredients with a fork. If using a hand mixer, now would be the time to use it. Turn on the hand mixer and put it in the batter. Turn the mixer on a low speed and gradually increase the speed while mixing. Mix until there are little to no clumps. Before taking the mixer out of the batter, be sure to turn the speed to 0."
    },
    {
      "headline":"Make sure hands are clean.",
      "description":"Take 2 tablespoons (29.6 ml) of batter and mould it into a ball. Next, keep the ball of batter sitting in one hand and use the other hand to perform circular motions on the ball. This will smoothen the ball of batter."
    },
    {
      "headline":"Take the ball of batter and roll it into a small bowl of oats.",
      "description":"Roll the ball of batter into the bowl of oats until the batter is covered with oats."
    },
    {
      "headline":"Take the oat covered ball of batter and place it on a cookie sheet.",
      "description":"Next, use a fork and flatten the ball once vertically. Finally, horizontally flatten the ball again until the ball is flat but still circular."
    },
    {
      "headline":"Repeat this process for each cookie until all of the batter is used.",
      "description":""
    },
    {
      "headline":"Bake your cookies.",
      "description":"Take the cookie sheet, which has all 38 flattened, circular batter on it, and put it into the oven. Let the cookies bake in the oven for 12-15 minutes at 350 degrees Fahrenheit."
    },
    {
      "headline":"Take the cookie sheets out of the oven once they are finished baking.",
      "description":"Wait until they cool before eating the cookies."
    }
  ],
  "text":" Prepare your ingredients and supplies. Preheat the oven to 350 degrees Fahrenheit. Place parchment paper over the cookie sheet or grease the cookie sheet so the cookies will not stick after cooking. Peel 4 bananas. Put the bananas in a big mixing bowl. Take a fork or potato masher and mash the bananas until there are little to no clumps. Add 1 1/2 cups of flour into the mixing bowl. Mix the flour and bananas with a fork. Add 1/2 tsp of baking soda, 1/2 tsp of baking powder and 1/4 tsp of salt into the mixture. Mix all ingredients with a fork. Add 1 1/2 cups of rolled oats, 1 cup of smooth peanut butter, 1/2 cup of brown sugar and 1/4 cup of cane sugar into the mixing bowl. Mix all ingredients with a fork. Cut 1/4 slice of butter. In order to properly cut a 1/4 cup of butter, use the measurements on the wrapper of a block of butter. If there are no measurements on the wrapper, scoop 4 tablespoons (59.1 ml) of butter. If using sticks of butter, use 1/2 a stick of butter. Put the butter in a glass measuring cup. Microwave the slice of butter. Set the microwave for 15 seconds. When the microwave notifies you that the butter is finished microwaving, carefully take the cup of butter out of the microwave with oven mitts. Take the 1/4 cup of melted butter and pour it into the mixing bowl. Mix all of the ingredients with a fork. Add 2 tsp of vanilla. Mix all of the ingredients with a fork. If using a hand mixer, now would be the time to use it. Turn on the hand mixer and put it in the batter. Turn the mixer on a low speed and gradually increase the speed while mixing. Mix until there are little to no clumps. Before taking the mixer out of the batter, be sure to turn the speed to 0. Make sure hands are clean. Take 2 tablespoons (29.6 ml) of batter and mould it into a ball. Next, keep the ball of batter sitting in one hand and use the other hand to perform circular motions on the ball. This will smoothen the ball of batter. Take the ball of batter and roll it into a small bowl of oats. Roll the ball of batter into the bowl of oats until the batter is covered with oats. Take the oat covered ball of batter and place it on a cookie sheet. Next, use a fork and flatten the ball once vertically. Finally, horizontally flatten the ball again until the ball is flat but still circular. Repeat this process for each cookie until all of the batter is used.  Bake your cookies. Take the cookie sheet, which has all 38 flattened, circular batter on it, and put it into the oven. Let the cookies bake in the oven for 12-15 minutes at 350 degrees Fahrenheit. Take the cookie sheets out of the oven once they are finished baking. Wait until they cool before eating the cookies.",
  "tyn_model":[
    "butter",
    "fork",
    "oven",
    "cookie sheet",
    "bananas",
    "mixing bowl",
    "microwave",
    "mixer",
    "batter",
    "oats",
    "flour",
    "parchment paper",
    "big mixing",
    "fork or potato masher",
    "baking soda",
    "baking powder",
    "salt",
    "rolled oats",
    "smooth peanut butter",
    "brown sugar",
    "cane sugar",
    "glass measuring cup",
    "oven mitts",
    "vanilla",
    "hand mixer",
    "bowl",
    "oat",
    "cookie sheets"
  ],
  "tyn_section":[

  ]
}