{
  "title":"How to Make Paleo Meatloaf",
  "url":"https://www.wikihow.com/Make-Paleo-Meatloaf",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes"
  ],
  "parts":[
    {
      "name":"Cooking the Vegetables",
      "steps":[
        {
          "headline":"Cut the onions, peppers, and garlic.",
          "description":"These ingredients will all be sautéed in the olive oil together, so you’ll need to first cut them into small pieces. Aim for pieces the size of your pinky fingernail. You’ll be using a sharp kitchen knife or chef’s knife for this step, so be careful not to cut your fingers. If you prefer not to mince garlic, you could also use a garlic press to crush it into small pieces."
        },
        {
          "headline":"Thaw the spinach.",
          "description":"Pull out the 10-ounce package of frozen spinach to let it thaw. You can simply leave the spinach sitting on the counter in room-temperature air; it should take about 4–6 hours to thaw. If you’re short on time, you can submerge the packet in a bowl of warm water and let the heat from the water thaw the spinach. Alternately, if you plan ahead the night before, you can take the frozen spinach from the freezer and put it in the fridge, where it will thaw overnight."
        },
        {
          "headline":"Sautee the onions and peppers in a pan.",
          "description":"Pour your 2 tablespoons of olive oil into a large frying pan, and let the oil heat up. Once it’s ready, combine all three sliced ingredients in the pan and let them cook in the oil. Use a wooden spoon to stir the onions, peppers, and garlic frequently, so that they do not stick to the bottom of the pan and burn."
        },
        {
          "headline":"Add the garlic, spinach, and spices to the sautéing mixture.",
          "description":"Once the onions and red peppers have fully sautéed, you can add the minced garlic, package of spinach, and the spices (chili powder, salt, oregano, thyme, and cayenne powder) to the pan. Stir all of the ingredients well, giving them time to continue to sautée in the oil. Once all of the vegetables are well sautéed and have become tender, remove the pan from the heat. Set the vegetables aside for now."
        }
      ]
    },
    {
      "name":"Creating the Meat Mixture",
      "steps":[
        {
          "headline":"Place the raw ground beef (or raw ground turkey) into a large bowl.",
          "description":"The ground beef (or turkey) should be thawed and room temperature. Place all 2 pounds into a large kitchen bowl, and knead it a few times with your hands to make sure it’s fully thawed and malleable. If you didn’t give yourself sufficient time to plan ahead and find that the ground meat is still frozen, you can place the meat (still in an airtight container) in a large bowl of warm water to accelerate the thawing process. Alternately, you can take the frozen or partially thawed ground meat, open it and set it on a plate, and thaw the meat in the microwave."
        },
        {
          "headline":"Whisk the eggs.",
          "description":"Crack your 3 eggs into a small bowl and, using a kitchen whisk, mix the eggs for at least a full minute. When whisking the eggs, move the whisk in vigorous, circular strokes. Make sure to fully blend the egg yolks and the whites; the whisked eggs shouldn’t contain any thick lumps of yellow yolk. When fully whisked, the eggs should be pale yellow and frothy."
        },
        {
          "headline":"Pour the whisked eggs and almond flour over the meat.",
          "description":"Once you have these three ingredients in the bowl, use your hands to mix the eggs and flour into the ground meat. Do this gently, but make sure that the eggs and flour are fully mixed in. When you’re finished mixing the eggs, flour, and ground meat together, there should not be a puddle of liquid egg in the bottom of the bowl, and the flour should be mixed evenly throughout. Be sure to wash your hands after this step, as they’ll be covered with raw beef and eggs."
        },
        {
          "headline":"Add the vegetables to the meat mixture.",
          "description":"Once you’ve completed the previous step, retrieve the frying pan with vegetables and pour this mixture into the meat, egg, and flour mixture. You may need to scrape the frying pan with your wooden spoon if some of the sautéed vegetables are stuck to the pan. Then, using your hands, mix the veggies fully into the meat. Depending on how much time has passed since you took the frying pan off of the stove, the vegetables may still be hot after having been sautéed. If this is the case, after you pour the vegetables into the bowl with the meat, give them 5–10 minutes to cool off."
        }
      ]
    },
    {
      "name":"Baking the Meatloaf",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F.",
          "description":"You can plan ahead and do this in advance so that your oven is up to the necessary temperature by the time your meatloaf is ready to be baked. Set your oven precisely and let it reach 350°F before inserting the meatloaf. If you put the meatloaf in the oven before it’s fully heated, the meatloaf may come out undercooked."
        },
        {
          "headline":"Form the mixture into a loaf.",
          "description":"Still using your hands, press the meat and vegetable mixture into a loaf shape. You’ll need to compress the mixture and “pack” it together so that the loaf maintains its shape and coheres. Depending on the size of your meatloaf pan, the finished loaf will likely be about 10” long, 4” wide, and 3” high."
        },
        {
          "headline":"Place the loaf in a nonstick meatloaf pan.",
          "description":"Pick up the unbaked loaf and gently transfer it into your pan. The loaf should be a little smaller than the pan and fit comfortably inside, so that the meatloaf has room to expand as it cooks. If your pan is not coated with a nonstick surface, you may need to coat it with a nonstick spray so that the meatloaf doesn’t stick to the pan. A meatloaf pan is typically made of stainless steel, has elevated ribs or bumps along the bottom, and has two handles on the sides. If you need to purchase a pan for this recipe, check your local kitchen-supply store. Some larger supermarkets may also sell meatloaf pans."
        },
        {
          "headline":"Pour your BBQ sauce over the top and sides of the meatloaf.",
          "description":"This will function something like a marinade, and allow the meatloaf to avoid the moisture and the flavor of the BBQ sauce while cooking in the oven. Make sure to coat the meatloaf evenly with sauce; you don’t want any uncovered patches on the side or top of the loaf. It’s alright to use a little over a half of a cup of BBQ sauce for this step; it won’t harm the meatloaf."
        },
        {
          "headline":"Bake the meatloaf for an hour at 350°F.",
          "description":"Keep an eye on your meatloaf as it nears the 1-hour mark; if it’s not quite finished, you can leave it in the oven for 15 or 20 more minutes. The meatloaf should reach an internal temperature of 155°F; you can measure this by inserting a meat thermometer into the center of the loaf while it’s in the oven."
        },
        {
          "headline":"Let it cool for 10 minutes before serving.",
          "description":"Once the meatloaf has reached 155°F and is finished baking, remove the pan from the oven and set it on a heat-resistant surface, such as a countertop. Let the meatloaf cool for about 10 minutes, then serve the loaf and top each slice with more BBQ sauce or ketchup."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cooking the Vegetables Cut the onions, peppers, and garlic. These ingredients will all be sautéed in the olive oil together, so you’ll need to first cut them into small pieces. Aim for pieces the size of your pinky fingernail. You’ll be using a sharp kitchen knife or chef’s knife for this step, so be careful not to cut your fingers. If you prefer not to mince garlic, you could also use a garlic press to crush it into small pieces. Thaw the spinach. Pull out the 10-ounce package of frozen spinach to let it thaw. You can simply leave the spinach sitting on the counter in room-temperature air; it should take about 4–6 hours to thaw. If you’re short on time, you can submerge the packet in a bowl of warm water and let the heat from the water thaw the spinach. Alternately, if you plan ahead the night before, you can take the frozen spinach from the freezer and put it in the fridge, where it will thaw overnight. Sautee the onions and peppers in a pan. Pour your 2 tablespoons of olive oil into a large frying pan, and let the oil heat up. Once it’s ready, combine all three sliced ingredients in the pan and let them cook in the oil. Use a wooden spoon to stir the onions, peppers, and garlic frequently, so that they do not stick to the bottom of the pan and burn. Add the garlic, spinach, and spices to the sautéing mixture. Once the onions and red peppers have fully sautéed, you can add the minced garlic, package of spinach, and the spices (chili powder, salt, oregano, thyme, and cayenne powder) to the pan. Stir all of the ingredients well, giving them time to continue to sautée in the oil. Once all of the vegetables are well sautéed and have become tender, remove the pan from the heat. Set the vegetables aside for now. Creating the Meat Mixture Place the raw ground beef (or raw ground turkey) into a large bowl. The ground beef (or turkey) should be thawed and room temperature. Place all 2 pounds into a large kitchen bowl, and knead it a few times with your hands to make sure it’s fully thawed and malleable. If you didn’t give yourself sufficient time to plan ahead and find that the ground meat is still frozen, you can place the meat (still in an airtight container) in a large bowl of warm water to accelerate the thawing process. Alternately, you can take the frozen or partially thawed ground meat, open it and set it on a plate, and thaw the meat in the microwave. Whisk the eggs. Crack your 3 eggs into a small bowl and, using a kitchen whisk, mix the eggs for at least a full minute. When whisking the eggs, move the whisk in vigorous, circular strokes. Make sure to fully blend the egg yolks and the whites; the whisked eggs shouldn’t contain any thick lumps of yellow yolk. When fully whisked, the eggs should be pale yellow and frothy. Pour the whisked eggs and almond flour over the meat. Once you have these three ingredients in the bowl, use your hands to mix the eggs and flour into the ground meat. Do this gently, but make sure that the eggs and flour are fully mixed in. When you’re finished mixing the eggs, flour, and ground meat together, there should not be a puddle of liquid egg in the bottom of the bowl, and the flour should be mixed evenly throughout. Be sure to wash your hands after this step, as they’ll be covered with raw beef and eggs. Add the vegetables to the meat mixture. Once you’ve completed the previous step, retrieve the frying pan with vegetables and pour this mixture into the meat, egg, and flour mixture. You may need to scrape the frying pan with your wooden spoon if some of the sautéed vegetables are stuck to the pan. Then, using your hands, mix the veggies fully into the meat. Depending on how much time has passed since you took the frying pan off of the stove, the vegetables may still be hot after having been sautéed. If this is the case, after you pour the vegetables into the bowl with the meat, give them 5–10 minutes to cool off. Baking the Meatloaf Preheat your oven to 350°F. You can plan ahead and do this in advance so that your oven is up to the necessary temperature by the time your meatloaf is ready to be baked. Set your oven precisely and let it reach 350°F before inserting the meatloaf. If you put the meatloaf in the oven before it’s fully heated, the meatloaf may come out undercooked. Form the mixture into a loaf. Still using your hands, press the meat and vegetable mixture into a loaf shape. You’ll need to compress the mixture and “pack” it together so that the loaf maintains its shape and coheres. Depending on the size of your meatloaf pan, the finished loaf will likely be about 10” long, 4” wide, and 3” high. Place the loaf in a nonstick meatloaf pan. Pick up the unbaked loaf and gently transfer it into your pan. The loaf should be a little smaller than the pan and fit comfortably inside, so that the meatloaf has room to expand as it cooks. If your pan is not coated with a nonstick surface, you may need to coat it with a nonstick spray so that the meatloaf doesn’t stick to the pan. A meatloaf pan is typically made of stainless steel, has elevated ribs or bumps along the bottom, and has two handles on the sides. If you need to purchase a pan for this recipe, check your local kitchen-supply store. Some larger supermarkets may also sell meatloaf pans. Pour your BBQ sauce over the top and sides of the meatloaf. This will function something like a marinade, and allow the meatloaf to avoid the moisture and the flavor of the BBQ sauce while cooking in the oven. Make sure to coat the meatloaf evenly with sauce; you don’t want any uncovered patches on the side or top of the loaf. It’s alright to use a little over a half of a cup of BBQ sauce for this step; it won’t harm the meatloaf. Bake the meatloaf for an hour at 350°F. Keep an eye on your meatloaf as it nears the 1-hour mark; if it’s not quite finished, you can leave it in the oven for 15 or 20 more minutes. The meatloaf should reach an internal temperature of 155°F; you can measure this by inserting a meat thermometer into the center of the loaf while it’s in the oven. Let it cool for 10 minutes before serving. Once the meatloaf has reached 155°F and is finished baking, remove the pan from the oven and set it on a heat-resistant surface, such as a countertop. Let the meatloaf cool for about 10 minutes, then serve the loaf and top each slice with more BBQ sauce or ketchup. Finished. ",
  "tyn_model":[
    "eggs",
    "vegetables",
    "oven",
    "spinach",
    "garlic",
    "flour",
    "onions",
    "bowl",
    "bbq sauce",
    "peppers",
    "water",
    "oil",
    "pan",
    "frying pan",
    "olive oil",
    "wooden spoon",
    "spices",
    "ground beef",
    "egg",
    "meat",
    "meatloaf pan",
    "kitchen knife",
    "chef’s knife",
    "garlic press",
    "frozen spinach",
    "large frying",
    "red peppers",
    "chili powder",
    "salt",
    "cayenne powder",
    "ground turkey",
    "large bowl",
    "large kitchen bowl",
    "airtight container",
    "plate",
    "microwave",
    "small bowl",
    "kitchen whisk",
    "whisk",
    "almond flour",
    "ground meat",
    "beef",
    "stove",
    "loaf",
    "vegetable",
    "“pack",
    "” it",
    "” long",
    "” wide",
    "” high",
    "nonstick meatloaf pan",
    "nonstick spray",
    "meatloaf pans",
    "meat thermometer",
    "ketchup"
  ],
  "tyn_section":[

  ]
}