{
  "title":"How to Make Milk Toast",
  "url":"https://www.wikihow.com/Make-Milk-Toast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Toast"
  ],
  "steps":[
    {
      "headline":"Gather your ingredients and equipment needed.",
      "description":"The ingredients are listed above in the \"Ingredients\" section and the equipment is listed below in the \"Things You'll Need\" section."
    },
    {
      "headline":"Measure out the sugar and cinnamon and put them both into a small bowl.",
      "description":"Mix them together with a spoon."
    },
    {
      "headline":"Measure out a cup of milk and pour in a mug.",
      "description":""
    },
    {
      "headline":"Put it in the microwave for 1 minute and 30 seconds.",
      "description":""
    },
    {
      "headline":"Toast the two slices of bread in a toaster for about 3 minutes or until they turn into a golden brown color.",
      "description":""
    },
    {
      "headline":"Spread a teaspoon of butter onto each slice of toast with a butter knife.",
      "description":""
    },
    {
      "headline":"Use a spoon or clean fingers to sprinkle the cinnamon sugar mix over the buttered slices of toast.",
      "description":""
    },
    {
      "headline":"Cut each slice of toast into bite size pieces with a knife.",
      "description":"For each slice, cut 3 horizontal sections and 3 vertical sections making 9 equal pieces."
    },
    {
      "headline":"Place the toast pieces in a bigger bowl.",
      "description":""
    },
    {
      "headline":"Pour in the mug of warm milk over the toast pieces and serve!",
      "description":""
    }
  ],
  "text":" Gather your ingredients and equipment needed. The ingredients are listed above in the \"Ingredients\" section and the equipment is listed below in the \"Things You'll Need\" section. Measure out the sugar and cinnamon and put them both into a small bowl. Mix them together with a spoon. Measure out a cup of milk and pour in a mug.  Put it in the microwave for 1 minute and 30 seconds.  Toast the two slices of bread in a toaster for about 3 minutes or until they turn into a golden brown color.  Spread a teaspoon of butter onto each slice of toast with a butter knife.  Use a spoon or clean fingers to sprinkle the cinnamon sugar mix over the buttered slices of toast.  Cut each slice of toast into bite size pieces with a knife. For each slice, cut 3 horizontal sections and 3 vertical sections making 9 equal pieces. Place the toast pieces in a bigger bowl.  Pour in the mug of warm milk over the toast pieces and serve! ",
  "tyn_model":[
    "spoon",
    "milk",
    "sugar",
    "cinnamon",
    "small bowl",
    "mug",
    "microwave",
    "toaster",
    "butter",
    "butter knife",
    "cinnamon sugar",
    "knife",
    "bowl"
  ],
  "tyn_section":[

  ]
}