{
  "title":"How to Make Pomegranate Chutney",
  "url":"https://www.wikihow.com/Make-Pomegranate-Chutney",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Chutney"
  ],
  "methods":[
    {
      "name":"Making Fast Pomegranate Chutney",
      "steps":[
        {
          "headline":"Heat the currant jelly.",
          "description":"Measure 1/2 cup (165 g) of red currant jelly into a small microwave-safe bowl. Microwave the jelly for about 20 seconds at full power. Carefully remove the jelly from the microwave and stir it. It should be become runny. You could also use your favorite jelly or try cherry or apricot jelly for this chutney."
        },
        {
          "headline":"Chop the onion, ginger, and chili.",
          "description":"Wash a small bunch of green onions and a jalapeno. Use a sharp knife to carefully chop the green onions (including the tops) in order to get 1/3 cup (33 g). Finely chop the jalapeno chili, so you get 1 tablespoon. You should also mince 1 tablespoon of fresh ginger. Place the onion, ginger, and chili in a serving bowl. For more of a spicy kick, add a little more jalapeno."
        },
        {
          "headline":"Combine the fast pomegranate chutney.",
          "description":"Pour the liquid red currant jelly into the serving bowl along with the remaining chutney ingredients. Stir the chutney well, so the ingredients are coated with the jelly. Let the chutney rest for 15 minutes before you serve it. You'll need to stir in:\n1 cup (174 g) of pomegranate seeds\n1/2 teaspoon of ground coriander\n1 tablespoon of lemon juice\nSalt and pepper to taste"
        }
      ]
    },
    {
      "name":"Making Cranberry Pomegranate Chutney",
      "steps":[
        {
          "headline":"Saute the aromatics spices and shallot.",
          "description":"Pour 2 teaspoons of extra virgin olive oil into a large saucepan or skillet over medium-high heat. Once the oil shimmers, stir in 1 medium minced shallot and the aromatic spices. Saute them for 2 to 3 minutes, so the shallot softens a little. You'll need to stir in:\n2 teaspoons of freshly grated ginger,\n2 teaspoons of freshly grated ginger\n1/2 teaspoon of ground cardamom\n1/4 teaspoon of ground cloves\n1/4 teaspoon of fine salt"
        },
        {
          "headline":"Stir in the liquid ingredients and the cranberries.",
          "description":"Pour in 2 cups (473 ml) of pomegranate juice, 1/2 cup (170 g) of agave, 1/4 cup (60 ml) of apple cider vinegar, 2 tablespoons of pomegranate molasses, and 2 12-ounce (340 g) bags of fresh cranberries. Stir the chutney and bring it to a boil. You can also use frozen cranberries, but ensure that they're thawed before you use them in the chutney."
        },
        {
          "headline":"Simmer the cranberry pomegranate chutney.",
          "description":"Turn the heat to medium and let the chutney bubble gently for about 15 to 20 minutes. The cranberries should pop and the chutney will thicken up. You may need to adjust the heat, so the chutney doesn't boil. Stir the chutney frequently so it doesn't stick to the bottom of the saucepan."
        },
        {
          "headline":"Stir in the pomegranate seeds.",
          "description":"Add 1 cup (174 g) of fresh pomegranate seeds to the chutney. Stir them well and turn off the heat. Transfer the chutney to a serving dish or jars (if you plan on canning them). Chill the pomegranate chutney until you're ready to serve it. Fresh pomegranate seeds are also sold as arils."
        }
      ]
    },
    {
      "name":"Making Indian Pomegranate Chutney",
      "steps":[
        {
          "headline":"Chop the herbs and onion.",
          "description":"Wash fresh mint and cilantro. Use a sharp knife to roughly chop the mint leaves in order to get 2 cups (50 g). Chop the cilantro to get 1 cup (50 g). You should also slice about half of an onion in order to get 1/2 cup (75 g) of sliced onion. Place the herbs and onion in a blender or food processor. Cilantro is also called coriander (or dhania)."
        },
        {
          "headline":"Measure out the remaining ingredients.",
          "description":"Get out the rest of the chutney ingredients and use measuring spoons to gather the proper amounts. You'll need 1 tablespoon of dried pomegranate seeds, 1 1/2 tablespoons of lemon juice, 1 tablespoon of sugar, and 2 tablespoons of chopped green chilies. Ensure that you use dried pomegranate seeds (also called anardana ) instead of the fresh arils."
        },
        {
          "headline":"Puree the Indian pomegranate chutney.",
          "description":"Place all of the chutney ingredients into a blender or food processor. Put the lid on the blender and puree the chutney until it's completely smooth. You might need to add a few tablespoons of water to the chutney to help it process. Keep the chutney refrigerated until you're ready to serve it. Add salt to taste before you serve the chutney."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Fast Pomegranate Chutney Heat the currant jelly. Measure 1/2 cup (165 g) of red currant jelly into a small microwave-safe bowl. Microwave the jelly for about 20 seconds at full power. Carefully remove the jelly from the microwave and stir it. It should be become runny. You could also use your favorite jelly or try cherry or apricot jelly for this chutney. Chop the onion, ginger, and chili. Wash a small bunch of green onions and a jalapeno. Use a sharp knife to carefully chop the green onions (including the tops) in order to get 1/3 cup (33 g). Finely chop the jalapeno chili, so you get 1 tablespoon. You should also mince 1 tablespoon of fresh ginger. Place the onion, ginger, and chili in a serving bowl. For more of a spicy kick, add a little more jalapeno. Combine the fast pomegranate chutney. Pour the liquid red currant jelly into the serving bowl along with the remaining chutney ingredients. Stir the chutney well, so the ingredients are coated with the jelly. Let the chutney rest for 15 minutes before you serve it. You'll need to stir in:\n1 cup (174 g) of pomegranate seeds\n1/2 teaspoon of ground coriander\n1 tablespoon of lemon juice\nSalt and pepper to taste Making Cranberry Pomegranate Chutney Saute the aromatics spices and shallot. Pour 2 teaspoons of extra virgin olive oil into a large saucepan or skillet over medium-high heat. Once the oil shimmers, stir in 1 medium minced shallot and the aromatic spices. Saute them for 2 to 3 minutes, so the shallot softens a little. You'll need to stir in:\n2 teaspoons of freshly grated ginger,\n2 teaspoons of freshly grated ginger\n1/2 teaspoon of ground cardamom\n1/4 teaspoon of ground cloves\n1/4 teaspoon of fine salt Stir in the liquid ingredients and the cranberries. Pour in 2 cups (473 ml) of pomegranate juice, 1/2 cup (170 g) of agave, 1/4 cup (60 ml) of apple cider vinegar, 2 tablespoons of pomegranate molasses, and 2 12-ounce (340 g) bags of fresh cranberries. Stir the chutney and bring it to a boil. You can also use frozen cranberries, but ensure that they're thawed before you use them in the chutney. Simmer the cranberry pomegranate chutney. Turn the heat to medium and let the chutney bubble gently for about 15 to 20 minutes. The cranberries should pop and the chutney will thicken up. You may need to adjust the heat, so the chutney doesn't boil. Stir the chutney frequently so it doesn't stick to the bottom of the saucepan. Stir in the pomegranate seeds. Add 1 cup (174 g) of fresh pomegranate seeds to the chutney. Stir them well and turn off the heat. Transfer the chutney to a serving dish or jars (if you plan on canning them). Chill the pomegranate chutney until you're ready to serve it. Fresh pomegranate seeds are also sold as arils. Making Indian Pomegranate Chutney Chop the herbs and onion. Wash fresh mint and cilantro. Use a sharp knife to roughly chop the mint leaves in order to get 2 cups (50 g). Chop the cilantro to get 1 cup (50 g). You should also slice about half of an onion in order to get 1/2 cup (75 g) of sliced onion. Place the herbs and onion in a blender or food processor. Cilantro is also called coriander (or dhania). Measure out the remaining ingredients. Get out the rest of the chutney ingredients and use measuring spoons to gather the proper amounts. You'll need 1 tablespoon of dried pomegranate seeds, 1 1/2 tablespoons of lemon juice, 1 tablespoon of sugar, and 2 tablespoons of chopped green chilies. Ensure that you use dried pomegranate seeds (also called anardana ) instead of the fresh arils. Puree the Indian pomegranate chutney. Place all of the chutney ingredients into a blender or food processor. Put the lid on the blender and puree the chutney until it's completely smooth. You might need to add a few tablespoons of water to the chutney to help it process. Keep the chutney refrigerated until you're ready to serve it. Add salt to taste before you serve the chutney. Finished. ",
  "tyn_model":[
    "onion",
    "pomegranate seeds",
    "cranberries",
    "ginger",
    "pomegranate chutney",
    "cilantro",
    "blender",
    "red currant jelly",
    "chili",
    "green onions",
    "jalapeno",
    "sharp knife",
    "serving bowl",
    "lemon juice",
    "shallot",
    "herbs",
    "mint",
    "food processor",
    "currant jelly",
    "microwave-safe bowl",
    "microwave",
    "jelly",
    "jalapeno chili",
    "fresh ginger",
    "chutney",
    "ground coriander",
    "extra virgin olive oil",
    "large saucepan",
    "skillet",
    "aromatic spices",
    "freshly grated ginger",
    "ground cardamom",
    "ground cloves",
    "fine salt",
    "pomegranate juice",
    "agave",
    "apple cider vinegar",
    "pomegranate molasses",
    "cranberry pomegranate chutney",
    "saucepan",
    "coriander",
    "measuring spoons",
    "sugar",
    "green chilies",
    "water",
    "salt"
  ],
  "tyn_section":[

  ]
}