{
  "title":"How to Get Hallowed Armor in Terraria",
  "url":"https://www.wikihow.com/Get-Hallowed-Armor-in-Terraria",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Terraria"
  ],
  "steps":[
    {
      "headline":"Find the correct ores.",
      "description":"To begin, you will need lots of adamantite, mythril, and cobalt. Look below for where to find these ores:\nCobalt: Anywhere you can find metals such as iron or silver. Mythril: Somewhat deeper than gold, in the deep caverns. Adamantite: Extremely deep, directly above the underworld."
    },
    {
      "headline":"Make these armor combinations, assuming you can:",
      "description":"Adamantite breastplate, helmet, and leggings. Mythril breastplate, helmet, and leggings. Cobalt breastplate, helmet, and leggings"
    },
    {
      "headline":"Add all the pieces of armor together at a mythril anvil.",
      "description":"These are what to add:\nAdamantite chestplate + adamantite helmet + adamantite leggings. Mythril chestplate + mythril helmet + mythril leggings. Cobalt chestplate + cobalt helmet+ cobalt leggings."
    },
    {
      "headline":"Done!",
      "description":"Now put on your armor."
    }
  ],
  "text":" Find the correct ores. To begin, you will need lots of adamantite, mythril, and cobalt. Look below for where to find these ores:\nCobalt: Anywhere you can find metals such as iron or silver. Mythril: Somewhat deeper than gold, in the deep caverns. Adamantite: Extremely deep, directly above the underworld. Make these armor combinations, assuming you can: Adamantite breastplate, helmet, and leggings. Mythril breastplate, helmet, and leggings. Cobalt breastplate, helmet, and leggings Add all the pieces of armor together at a mythril anvil. These are what to add:\nAdamantite chestplate + adamantite helmet + adamantite leggings. Mythril chestplate + mythril helmet + mythril leggings. Cobalt chestplate + cobalt helmet+ cobalt leggings. Done! Now put on your armor.",
  "tyn_model":[
    "adamantite",
    "cobalt",
    "mythril",
    "armor",
    "helmet",
    "mythril anvil",
    "adamantite helmet",
    "adamantite leggings",
    "mythril helmet",
    "mythril leggings",
    "cobalt helmet+",
    "cobalt leggings"
  ],
  "tyn_section":[

  ]
}