{
  "title":"How to Have a Vegetarian Valentine's Day",
  "url":"https://www.wikihow.com/Have-a-Vegetarian-Valentine%27s-Day",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian"
  ],
  "methods":[
    {
      "name":"Making Vegetarian Valentine’s Day Meals at Home",
      "steps":[
        {
          "headline":"Prepare vegetarian lasagna.",
          "description":"If you’re looking for a hearty meal option for Valentine’s Day, make a vegetarian lasagna with a few staple ingredients. This dish can be prepared ahead of time and then frozen so all you have to do on Valentine’s Day is pop it in the oven to cook. Serve it with a side salad and you have a delicious, simple veggie only meal. If you’d prefer to make a lighter pasta dish for Valentine’s Day, try making a vegetarian pasta. You can make vegetarian pasta with frozen vegetables or use fresh vegetables instead. Make your own tomato sauce or buy tomato sauce premade."
        },
        {
          "headline":"Make veggie burgers.",
          "description":"Veggie burgers are a great option for a simple yet filling Valentine’s Day meal. You can make veggie burgers with black beans, lentils, or tempeh. Add seasonings like garlic, soy sauce, salt, and ground cumin to give the veggie burgers flavor. Serve the veggie burgers on a bun with toppings like pickles, ketchup, mustard, lettuce, and sliced tomatoes. Add a side salad or homemade french fries for a complete, veggie meal."
        },
        {
          "headline":"Whip up a vegetable curry.",
          "description":"A yummy vegetable curry is a good option for a meal that is quick and easy to make. Start with a garlic and onion base. Then, add vegetables like potatoes, carrots, eggplant, and zucchini as well as spices like cumin, coriander, turmeric, paprika, salt, and chopped chilies. Finish with vegetable stock. You can also make an Indian curry made with baby potatoes and tomatoes, known as Aloo Dum. Serve the vegetable curry with a side of brown rice or naan bread."
        },
        {
          "headline":"Make a veggie stir fry.",
          "description":"A veggie stir fry is another good quick meal option. Pack the stir fry with vegetables like mushrooms, broccoli, cauliflower, and snow peas. Use a sauce made of soy sauce, ground ginger, garlic powder, water, and cornstarch. Finish the dish with toppings like cashews or cilantro. Serve the veggie stir fry with rice or noodles on the side."
        },
        {
          "headline":"Prepare a vegetable soup.",
          "description":"For a light but filling meal option, make a vegetable soup for Valentine’s Day. Use vegetable stock instead of chicken or beef stock to make the soup vegetarian. Put vegetables like carrots, potatoes, celery, green beans, and corn in the soup. Season the soup with garlic, salt, pepper, and fresh herbs like dill or thyme. Another option is to make a barley and vegetable soup. Serve the vegetable soup with slices of bread or a side salad."
        },
        {
          "headline":"Prepare a savory vegetable tart.",
          "description":"A savory vegetable tart made with ricotta and tomato can be a great meal option, especially for a meal that is light and easy to prepare. Use pre-made puff pastry for the crust or make your own pie crust. Then, fill the crust with ricotta cheese, tomato, parmesan cheese, and spices like nutmeg and oregano. Serve the tart with a side salad for a fresh, hearty vegetarian meal."
        },
        {
          "headline":"Make a vegetarian chili.",
          "description":"Vegetarian chili is a good one pot meal for Valentine’s Day. Use vegetarian beef or chicken sausages, tofu, or textured vegetable protein for added protein in the chili. Throw in vegetables like tomatoes, red peppers, and mushrooms into the chili. Add beans like black beans or pinto beans as well as spices like cumin, cayenne pepper, oregano, and chili powder. Serve the vegetarian chili with bread or homemade cornbread on the side."
        }
      ]
    },
    {
      "name":"Going Out for a Vegetarian Valentine’s Day Meal",
      "steps":[
        {
          "headline":"Find a vegetarian restaurant in your area.",
          "description":"If you would prefer someone else make your Valentine’s Day meal, look for a vegetarian restaurant in your area. Search online for top vegetarian restaurants and read reviews to ensure the food is flavorful, high quality, and vegetarian friendly. Ask vegetarian friends for restaurant recommendations in your area, such as a spot where they had a great, romantic meal that was vegetarian. You can also look at the menu for vegetarian restaurants in your area to make sure there are menu items that sound appetizing. If your date is not vegetarian, you may send them the restaurant menu in advance to ensure they like the menu and can find something to eat at the restaurant."
        },
        {
          "headline":"Check for vegetarian options on the restaurant’s menu.",
          "description":"If you cannot find a vegetarian restaurant in your area, check for restaurants that serve vegetarian dishes. Look on their menu for the “v” or “vegetarian” note by a menu item, as this means you can get the dish prepared vegetarian. Many restaurants will have a few non-meat items for vegetarian diners. Look at cuisines that usually have a lot of vegetarian food options, such as Mexican food, Thai food, Indian food, and Middle Eastern food. Search for restaurants that serve these types of foods for more vegetarian options."
        },
        {
          "headline":"Request a vegetarian meal at a restaurant.",
          "description":"Do not be afraid to contact the restaurant in advance and find out if they will prepare a vegetarian meal for you. Call them and speak to the wait staff or the chef. Ask about getting a vegetarian meal prepared for your dinner. Talk to them about your options for food already on the menu or the possibility of a special meal for you that is non-meat. Make sure you arrange the special meal beforehand, such as when you place your reservation for dinner. This will ensure your meal will be ready and easy to make once you arrive with your date for dinner."
        },
        {
          "headline":"Ask to modify an existing dish on the menu.",
          "description":"Some chefs will offer to modify an existing dish so it is vegetarian, such as swapping out an animal protein like chicken or beef for a plant protein like beans or legumes. Look over the menu at the restaurant and identify any items that can be modified to be vegetarian. Ask the chef if there are existing dishes they can adjust to be vegetarian. Keep in mind many restaurants will offer to do this for, even if you do not request it ahead of time. Most restaurants will have menu items that are easy to adapt for a vegetarian."
        }
      ]
    },
    {
      "name":"Choosing Vegetarian Sweets",
      "steps":[
        {
          "headline":"Look for chocolates that do not contain dairy products.",
          "description":"Some vegetarians do not eat dairy products, as milk, butter, and cream all come from animals. If you do not want to have sweets that contain dairy, you will need to buy chocolates for Valentine's Day that are marked \"dairy free.\" Look for boxed chocolates that are dairy free at your local supermarket or online. You may need to visit a specialty chocolate shop for dairy free chocolates and sweets. Often, dairy free sweets are made with coconut oil, rather than butter or cream, and pure dark cocoa, rather than milk chocolate."
        },
        {
          "headline":"Check the restaurant menu for vegan desserts.",
          "description":"If you are going out to eat, check the menu to see if there are any vegan desserts available. Most vegetarian restaurants will offer desserts that do not contain animal products. There may also be an existing dessert on the menu that can be modified to be vegan or dairy free. Many ethnic restaurants will offer vegan desserts, such as mango pudding made with coconut milk at an Indian restaurant."
        },
        {
          "headline":"Prepare vegan sweets at home.",
          "description":"If you are whipping up a vegetarian Valentine's Day meal at home and want to end with a yummy dessert, make vegan sweets. Prepare a vegan moist orange cake or a vegan mint chocolate cake. Make a vegan cheesecake or vegan cupcakes finished off with pink, Valentine's Day themed icing. You can also try adapting an existing recipe so it is dairy free or vegan. You may use substitutes like vegan butter or coconut oil to do this."
        }
      ]
    }
  ],
  "text":" Making Vegetarian Valentine’s Day Meals at Home Prepare vegetarian lasagna. If you’re looking for a hearty meal option for Valentine’s Day, make a vegetarian lasagna with a few staple ingredients. This dish can be prepared ahead of time and then frozen so all you have to do on Valentine’s Day is pop it in the oven to cook. Serve it with a side salad and you have a delicious, simple veggie only meal. If you’d prefer to make a lighter pasta dish for Valentine’s Day, try making a vegetarian pasta. You can make vegetarian pasta with frozen vegetables or use fresh vegetables instead. Make your own tomato sauce or buy tomato sauce premade. Make veggie burgers. Veggie burgers are a great option for a simple yet filling Valentine’s Day meal. You can make veggie burgers with black beans, lentils, or tempeh. Add seasonings like garlic, soy sauce, salt, and ground cumin to give the veggie burgers flavor. Serve the veggie burgers on a bun with toppings like pickles, ketchup, mustard, lettuce, and sliced tomatoes. Add a side salad or homemade french fries for a complete, veggie meal. Whip up a vegetable curry. A yummy vegetable curry is a good option for a meal that is quick and easy to make. Start with a garlic and onion base. Then, add vegetables like potatoes, carrots, eggplant, and zucchini as well as spices like cumin, coriander, turmeric, paprika, salt, and chopped chilies. Finish with vegetable stock. You can also make an Indian curry made with baby potatoes and tomatoes, known as Aloo Dum. Serve the vegetable curry with a side of brown rice or naan bread. Make a veggie stir fry. A veggie stir fry is another good quick meal option. Pack the stir fry with vegetables like mushrooms, broccoli, cauliflower, and snow peas. Use a sauce made of soy sauce, ground ginger, garlic powder, water, and cornstarch. Finish the dish with toppings like cashews or cilantro. Serve the veggie stir fry with rice or noodles on the side. Prepare a vegetable soup. For a light but filling meal option, make a vegetable soup for Valentine’s Day. Use vegetable stock instead of chicken or beef stock to make the soup vegetarian. Put vegetables like carrots, potatoes, celery, green beans, and corn in the soup. Season the soup with garlic, salt, pepper, and fresh herbs like dill or thyme. Another option is to make a barley and vegetable soup. Serve the vegetable soup with slices of bread or a side salad. Prepare a savory vegetable tart. A savory vegetable tart made with ricotta and tomato can be a great meal option, especially for a meal that is light and easy to prepare. Use pre-made puff pastry for the crust or make your own pie crust. Then, fill the crust with ricotta cheese, tomato, parmesan cheese, and spices like nutmeg and oregano. Serve the tart with a side salad for a fresh, hearty vegetarian meal. Make a vegetarian chili. Vegetarian chili is a good one pot meal for Valentine’s Day. Use vegetarian beef or chicken sausages, tofu, or textured vegetable protein for added protein in the chili. Throw in vegetables like tomatoes, red peppers, and mushrooms into the chili. Add beans like black beans or pinto beans as well as spices like cumin, cayenne pepper, oregano, and chili powder. Serve the vegetarian chili with bread or homemade cornbread on the side. Going Out for a Vegetarian Valentine’s Day Meal Find a vegetarian restaurant in your area. If you would prefer someone else make your Valentine’s Day meal, look for a vegetarian restaurant in your area. Search online for top vegetarian restaurants and read reviews to ensure the food is flavorful, high quality, and vegetarian friendly. Ask vegetarian friends for restaurant recommendations in your area, such as a spot where they had a great, romantic meal that was vegetarian. You can also look at the menu for vegetarian restaurants in your area to make sure there are menu items that sound appetizing. If your date is not vegetarian, you may send them the restaurant menu in advance to ensure they like the menu and can find something to eat at the restaurant. Check for vegetarian options on the restaurant’s menu. If you cannot find a vegetarian restaurant in your area, check for restaurants that serve vegetarian dishes. Look on their menu for the “v” or “vegetarian” note by a menu item, as this means you can get the dish prepared vegetarian. Many restaurants will have a few non-meat items for vegetarian diners. Look at cuisines that usually have a lot of vegetarian food options, such as Mexican food, Thai food, Indian food, and Middle Eastern food. Search for restaurants that serve these types of foods for more vegetarian options. Request a vegetarian meal at a restaurant. Do not be afraid to contact the restaurant in advance and find out if they will prepare a vegetarian meal for you. Call them and speak to the wait staff or the chef. Ask about getting a vegetarian meal prepared for your dinner. Talk to them about your options for food already on the menu or the possibility of a special meal for you that is non-meat. Make sure you arrange the special meal beforehand, such as when you place your reservation for dinner. This will ensure your meal will be ready and easy to make once you arrive with your date for dinner. Ask to modify an existing dish on the menu. Some chefs will offer to modify an existing dish so it is vegetarian, such as swapping out an animal protein like chicken or beef for a plant protein like beans or legumes. Look over the menu at the restaurant and identify any items that can be modified to be vegetarian. Ask the chef if there are existing dishes they can adjust to be vegetarian. Keep in mind many restaurants will offer to do this for, even if you do not request it ahead of time. Most restaurants will have menu items that are easy to adapt for a vegetarian. Choosing Vegetarian Sweets Look for chocolates that do not contain dairy products. Some vegetarians do not eat dairy products, as milk, butter, and cream all come from animals. If you do not want to have sweets that contain dairy, you will need to buy chocolates for Valentine's Day that are marked \"dairy free.\" Look for boxed chocolates that are dairy free at your local supermarket or online. You may need to visit a specialty chocolate shop for dairy free chocolates and sweets. Often, dairy free sweets are made with coconut oil, rather than butter or cream, and pure dark cocoa, rather than milk chocolate. Check the restaurant menu for vegan desserts. If you are going out to eat, check the menu to see if there are any vegan desserts available. Most vegetarian restaurants will offer desserts that do not contain animal products. There may also be an existing dessert on the menu that can be modified to be vegan or dairy free. Many ethnic restaurants will offer vegan desserts, such as mango pudding made with coconut milk at an Indian restaurant. Prepare vegan sweets at home. If you are whipping up a vegetarian Valentine's Day meal at home and want to end with a yummy dessert, make vegan sweets. Prepare a vegan moist orange cake or a vegan mint chocolate cake. Make a vegan cheesecake or vegan cupcakes finished off with pink, Valentine's Day themed icing. You can also try adapting an existing recipe so it is dairy free or vegan. You may use substitutes like vegan butter or coconut oil to do this.",
  "tyn_model":[
    "sweets",
    "garlic",
    "salt",
    "tomatoes",
    "vegetable curry",
    "vegetable soup",
    "chocolates",
    "lasagna",
    "tomato sauce",
    "soy sauce",
    "potatoes",
    "vegetable stock",
    "mushrooms",
    "vegetable tart",
    "tomato",
    "vegetarian chili",
    "coconut oil",
    "desserts",
    "oven",
    "black beans",
    "lentils",
    "tempeh",
    "pickles",
    "ketchup",
    "mustard",
    "lettuce",
    "french fries",
    "vegetables",
    "carrots",
    "eggplant",
    "zucchini",
    "cumin",
    "coriander",
    "turmeric",
    "paprika",
    "baby potatoes",
    "brown rice",
    "naan bread",
    "broccoli",
    "cauliflower",
    "snow peas",
    "ground ginger",
    "garlic powder",
    "water",
    "cornstarch",
    "beef stock",
    "celery",
    "green beans",
    "corn",
    "pepper",
    "ricotta",
    "puff pastry",
    "pie crust",
    "ricotta cheese",
    "parmesan cheese",
    "nutmeg",
    "tofu",
    "red peppers",
    "oregano",
    "chili powder",
    "“v",
    "” or",
    "“vegetarian",
    "” note",
    "milk",
    "butter",
    "cream",
    "chocolate",
    "milk chocolate",
    "dessert",
    "coconut milk",
    "orange cake",
    "chocolate cake",
    "vegan butter"
  ],
  "tyn_section":[

  ]
}