{
  "title":"How to Reuse Empty Water Bottles",
  "url":"https://www.wikihow.com/Reuse-Empty-Water-Bottles",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Reusing Refillable Water Bottles",
      "steps":[
        {
          "headline":"Use a BPA-free bottle.",
          "description":"If you plan on refilling your empty water bottle to drink from it again, using a BPA-free bottle is your safest bet. Water bottles are made from a variety of plastics, and these plastics, like BPA, can leach. Exposure to BPA has been linked with diabetes and cardiovascular disease in humans. A more suitable alternative for a refillable water bottle would be a stainless steel or glass bottle. These do not leach."
        },
        {
          "headline":"Determine whether your bottle was meant for reuse.",
          "description":"A bottle meant for reuse will typically have a wide opening that will allow you to clean the bottle easily. Refrain from drinking from a refilled, disposable plastic water bottle. Disposable plastic bottles are hard to clean, so they can easily host bacterial growth. They also contain chemicals which could cause cancer or reproductive health problems."
        },
        {
          "headline":"Wash your bottle thoroughly.",
          "description":"You should use hot soapy water to clean your bottle. Do this at least every two days to minimize bacterial contamination. As long as you clean your bottle, you should not have to worry about chemicals from a non-BPA bottle leaching into your water."
        },
        {
          "headline":"Dry your bottle.",
          "description":"Let your bottle air dry. You can also use a dishwasher to dry your refillable water bottle as long as the bottle does not contain BPA, since heat will increase the rate at which chemicals leach from the plastic."
        }
      ]
    },
    {
      "name":"Reusing Empty Bottles for Crafts",
      "steps":[
        {
          "headline":"Make an Earring Holder.",
          "description":"Glue the bottle caps together with a hot glue gun into a design of your choosing, like a flower or a star. Then, use a small nail and a hammer to punch two holes in each cap. A ball-point pen, if pressed hard enough into the plastic, can also be used to create holes in the caps. Secure the hooks of the earrings in the holes. Never leave a hot glue gun unattended, especially if you have children or pets."
        },
        {
          "headline":"Design a candle holder.",
          "description":"Cut the base of a 2-liter empty water bottle with a utility knife and fill it up to the top with sand, pebbles, or gemstones. Nestle a small votive candle in the middle of this container for your personalized candle holder."
        },
        {
          "headline":"Make candy dishes or desk organizers.",
          "description":"This works best with a 1-liter water bottle. All you have to do is cut off the bottom of the bottle with a utility knife so that the bottom is only an inch or two tall. Line the part you cut with felt so that you don’t accidentally cut yourself with the sharp plastic, and decorate away. Fill the dish with candy or with office supplies like push pins or rubber bands."
        },
        {
          "headline":"Create food containers.",
          "description":"This works best with a 1-liter water bottle. To turn your empty water bottles into food containers, simply take two bottles of different heights and cut them through the middle with a utility knife. Then, fill up the longer base with rice, beans, sugar, or any non-perishable food and cover it with the base of the other bottle. You can cut water bottles with scissors or a utility knife. Keep a steady grip on the bottle and rotate it slowly. Be careful not to injure yourself."
        },
        {
          "headline":"Make a watering can.",
          "description":"This will work best with a larger bottle that has a handle, such as a gallon bottle. All you have to do is poke about 10-15 holes in the bottle cap, fill up the bottle with water, and tightly seal the cap. You can use a nail and a hammer to make the holes."
        }
      ]
    },
    {
      "name":"Decorating Your Home with Reused Bottles",
      "steps":[
        {
          "headline":"Create a plastic bottle cap mosaic.",
          "description":"First, choose a design you would like to create. Then, collect bottle caps. Most water bottle caps are white, so you can paint them different colors to have variety. The last step will be to glue the caps to a large sheet of paper. Hang the design where you wish for a colorful decoration."
        },
        {
          "headline":"Make a flower vase.",
          "description":"This is a great way to decorate your home, and it also makes for a fantastic DIY gift. To create a flower vase, cut off the top part of the bottle with a utility knife. Glue colorful wrapping paper, white paper, or felt to the bottom half. Decorate the bottom with stickers, markers, or other supplies if you wish. Fill the bottle up with water and place flowers inside."
        },
        {
          "headline":"Make plastic light covers.",
          "description":"These can illuminate your home or backyard in fun ways and are relatively easy to create. To make these, simply cut off the bottom portions of several (5-10) empty 1 liter water bottles with scissors or a utility knife. Paint the top halves of the bottles with acrylic or transparent glass paint or decorate with washi tape in a design of your choice. Remove the caps and slip the bulbs of string lights into the bottle openings, one bulb per bottle. Using the knife, poke a small hole near the opening and pass craft wire through it. Twist the craft wire with the string light wire to hold the light in place."
        }
      ]
    }
  ],
  "text":" Reusing Refillable Water Bottles Use a BPA-free bottle. If you plan on refilling your empty water bottle to drink from it again, using a BPA-free bottle is your safest bet. Water bottles are made from a variety of plastics, and these plastics, like BPA, can leach. Exposure to BPA has been linked with diabetes and cardiovascular disease in humans. A more suitable alternative for a refillable water bottle would be a stainless steel or glass bottle. These do not leach. Determine whether your bottle was meant for reuse. A bottle meant for reuse will typically have a wide opening that will allow you to clean the bottle easily. Refrain from drinking from a refilled, disposable plastic water bottle. Disposable plastic bottles are hard to clean, so they can easily host bacterial growth. They also contain chemicals which could cause cancer or reproductive health problems. Wash your bottle thoroughly. You should use hot soapy water to clean your bottle. Do this at least every two days to minimize bacterial contamination. As long as you clean your bottle, you should not have to worry about chemicals from a non-BPA bottle leaching into your water. Dry your bottle. Let your bottle air dry. You can also use a dishwasher to dry your refillable water bottle as long as the bottle does not contain BPA, since heat will increase the rate at which chemicals leach from the plastic. Reusing Empty Bottles for Crafts Make an Earring Holder. Glue the bottle caps together with a hot glue gun into a design of your choosing, like a flower or a star. Then, use a small nail and a hammer to punch two holes in each cap. A ball-point pen, if pressed hard enough into the plastic, can also be used to create holes in the caps. Secure the hooks of the earrings in the holes. Never leave a hot glue gun unattended, especially if you have children or pets. Design a candle holder. Cut the base of a 2-liter empty water bottle with a utility knife and fill it up to the top with sand, pebbles, or gemstones. Nestle a small votive candle in the middle of this container for your personalized candle holder. Make candy dishes or desk organizers. This works best with a 1-liter water bottle. All you have to do is cut off the bottom of the bottle with a utility knife so that the bottom is only an inch or two tall. Line the part you cut with felt so that you don’t accidentally cut yourself with the sharp plastic, and decorate away. Fill the dish with candy or with office supplies like push pins or rubber bands. Create food containers. This works best with a 1-liter water bottle. To turn your empty water bottles into food containers, simply take two bottles of different heights and cut them through the middle with a utility knife. Then, fill up the longer base with rice, beans, sugar, or any non-perishable food and cover it with the base of the other bottle. You can cut water bottles with scissors or a utility knife. Keep a steady grip on the bottle and rotate it slowly. Be careful not to injure yourself. Make a watering can. This will work best with a larger bottle that has a handle, such as a gallon bottle. All you have to do is poke about 10-15 holes in the bottle cap, fill up the bottle with water, and tightly seal the cap. You can use a nail and a hammer to make the holes. Decorating Your Home with Reused Bottles Create a plastic bottle cap mosaic. First, choose a design you would like to create. Then, collect bottle caps. Most water bottle caps are white, so you can paint them different colors to have variety. The last step will be to glue the caps to a large sheet of paper. Hang the design where you wish for a colorful decoration. Make a flower vase. This is a great way to decorate your home, and it also makes for a fantastic DIY gift. To create a flower vase, cut off the top part of the bottle with a utility knife. Glue colorful wrapping paper, white paper, or felt to the bottom half. Decorate the bottom with stickers, markers, or other supplies if you wish. Fill the bottle up with water and place flowers inside. Make plastic light covers. These can illuminate your home or backyard in fun ways and are relatively easy to create. To make these, simply cut off the bottom portions of several (5-10) empty 1 liter water bottles with scissors or a utility knife. Paint the top halves of the bottles with acrylic or transparent glass paint or decorate with washi tape in a design of your choice. Remove the caps and slip the bulbs of string lights into the bottle openings, one bulb per bottle. Using the knife, poke a small hole near the opening and pass craft wire through it. Twist the craft wire with the string light wire to hold the light in place.",
  "tyn_model":[
    "water bottle",
    "utility knife",
    "water bottles",
    "water",
    "bottle",
    "hot glue gun",
    "hammer",
    "scissors",
    "craft wire",
    "stainless steel or glass bottle",
    "-point pen",
    "candle holder",
    "votive candle",
    "candy dishes",
    "1-liter water bottle",
    "push pins",
    "food containers",
    "sugar",
    "watering can",
    "plastic bottle cap",
    "bottle caps",
    "water bottle caps",
    "paper",
    "flower vase",
    "glue",
    "wrapping paper",
    "white paper",
    "markers",
    "flowers",
    "acrylic or transparent glass paint",
    "washi tape",
    "knife",
    "string light wire"
  ],
  "tyn_section":[

  ]
}