{
  "title":"How to Stop a Salt Crystal Lamp from Melting",
  "url":"https://www.wikihow.com/Stop-a-Salt-Crystal-Lamp-from-Melting",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Lamps and Lampshades"
  ],
  "methods":[
    {
      "name":"Keeping The Lamp Dry",
      "steps":[
        {
          "headline":"Place the lamp in a dry area.",
          "description":"Since the lamp is made of salt, it will absorb water and may start melting if it is placed in areas of near sources of water. Keep the lamp in dry places. Don’t place it near showers, bathtubs, dishwashers, or washing machines."
        },
        {
          "headline":"Reduce the humidity in your home.",
          "description":"Extra humidity in your home may cause the salt lamp to melt. To help with this, you may want to use a dehumidifier in your home to reduce the moisture in the air. This may be especially important if you live in a humid climate."
        },
        {
          "headline":"Put the lamp away when using appliances that create steam.",
          "description":"Since humidity is the main thing that melts a salt crystal lamp, you may want to put the lamp away into a dry closet or room when using anything that creates steam. For example, you may want to move it somewhere different if you are boiling water on the stove, taking a shower, or washing laundry."
        },
        {
          "headline":"Dry the lamp often.",
          "description":"Make it a habit to wipe down your lamp to remove excess moisture. Use a cloth, towel, or other item that won’t leave lint behind on the lamp. If you don’t want to do this every few days, wait until you notice moisture on the lamp."
        }
      ]
    },
    {
      "name":"Taking Care of the Lamp",
      "steps":[
        {
          "headline":"Clean the lamp with a damp cloth.",
          "description":"Though you may be worried about wiping down or cleaning your lamp with any moisture, you can easily do this without melting your lamp. Use a damp cloth or sponge, making sure to squeeze out as much water as possible. Wipe away any dust or other debris. Pat dry. Turn the lamp back on afterwards. The heat will evaporate any moisture. Don’t submerge the lamp in water. Also don’t use any cleaning products on the lamp."
        },
        {
          "headline":"Keep the lamp on all the time.",
          "description":"If you have problems with your lamp starting to melt, try leaving it on all the time. The heat will help evaporate any moisture collected on the lamp, which can help slow the melting and dripping process. If you don't want to keep it on, place a plastic bag or some other protection over it to reduce the moisture."
        },
        {
          "headline":"Place a protective layer underneath your lamp.",
          "description":"If you cannot get the lamp to stop melting, then place it on top of something to protect your furniture. This may be a coaster, saucer, plastic placemat, or something else that will stop the moisture from ruining your furniture."
        }
      ]
    },
    {
      "name":"Checking the Bulb",
      "steps":[
        {
          "headline":"Use the proper bulb.",
          "description":"Salt crystal lamps are supposed to evaporate any water on the surface of the lamp. If it doesn’t evaporate properly, it can start to drip and give the illusion of melting. The bulb should make the lamp warm to touch, but not hot. For lamps 10 pounds or less, a 15-watt bulb should be strong enough. Use a 25-watt bulb for a 10 to 20 pound lamp, and for a lamp more than 20 pounds, use a 40 to 60-watt bulb."
        },
        {
          "headline":"Monitor the bulb.",
          "description":"If your salt crystal lamp melts and drips moisture, check the bulb. If the lamp is melting inside, it may leak into the bulb and cause problems. Notice if the bulb flickers, malfunctions, or gives any other problems."
        },
        {
          "headline":"Replace the bulb.",
          "description":"If you are having trouble with moisture on your lamp, replace the bulb. You may not have the correct bulb. Make sure the bulb you are using is a heat-producing bulb. You should be able to buy replacement bulbs that are just like the one that came in your lamp at any home improvement store. If the same thing happens, your lamp may be defective due to damage from the water."
        }
      ]
    }
  ],
  "text":" Keeping The Lamp Dry Place the lamp in a dry area. Since the lamp is made of salt, it will absorb water and may start melting if it is placed in areas of near sources of water. Keep the lamp in dry places. Don’t place it near showers, bathtubs, dishwashers, or washing machines. Reduce the humidity in your home. Extra humidity in your home may cause the salt lamp to melt. To help with this, you may want to use a dehumidifier in your home to reduce the moisture in the air. This may be especially important if you live in a humid climate. Put the lamp away when using appliances that create steam. Since humidity is the main thing that melts a salt crystal lamp, you may want to put the lamp away into a dry closet or room when using anything that creates steam. For example, you may want to move it somewhere different if you are boiling water on the stove, taking a shower, or washing laundry. Dry the lamp often. Make it a habit to wipe down your lamp to remove excess moisture. Use a cloth, towel, or other item that won’t leave lint behind on the lamp. If you don’t want to do this every few days, wait until you notice moisture on the lamp. Taking Care of the Lamp Clean the lamp with a damp cloth. Though you may be worried about wiping down or cleaning your lamp with any moisture, you can easily do this without melting your lamp. Use a damp cloth or sponge, making sure to squeeze out as much water as possible. Wipe away any dust or other debris. Pat dry. Turn the lamp back on afterwards. The heat will evaporate any moisture. Don’t submerge the lamp in water. Also don’t use any cleaning products on the lamp. Keep the lamp on all the time. If you have problems with your lamp starting to melt, try leaving it on all the time. The heat will help evaporate any moisture collected on the lamp, which can help slow the melting and dripping process. If you don't want to keep it on, place a plastic bag or some other protection over it to reduce the moisture. Place a protective layer underneath your lamp. If you cannot get the lamp to stop melting, then place it on top of something to protect your furniture. This may be a coaster, saucer, plastic placemat, or something else that will stop the moisture from ruining your furniture. Checking the Bulb Use the proper bulb. Salt crystal lamps are supposed to evaporate any water on the surface of the lamp. If it doesn’t evaporate properly, it can start to drip and give the illusion of melting. The bulb should make the lamp warm to touch, but not hot. For lamps 10 pounds or less, a 15-watt bulb should be strong enough. Use a 25-watt bulb for a 10 to 20 pound lamp, and for a lamp more than 20 pounds, use a 40 to 60-watt bulb. Monitor the bulb. If your salt crystal lamp melts and drips moisture, check the bulb. If the lamp is melting inside, it may leak into the bulb and cause problems. Notice if the bulb flickers, malfunctions, or gives any other problems. Replace the bulb. If you are having trouble with moisture on your lamp, replace the bulb. You may not have the correct bulb. Make sure the bulb you are using is a heat-producing bulb. You should be able to buy replacement bulbs that are just like the one that came in your lamp at any home improvement store. If the same thing happens, your lamp may be defective due to damage from the water.",
  "tyn_model":[
    "lamp",
    "water",
    "bulb",
    "salt crystal lamp",
    "salt",
    "salt lamp",
    "dehumidifier",
    "sponge",
    "plastic bag",
    "coaster",
    "saucer",
    "salt crystal lamps"
  ],
  "tyn_section":[

  ]
}