{
  "title":"How to Clean Pottery",
  "url":"https://www.wikihow.com/Clean-Pottery",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Clay Projects",
    "Pottery"
  ],
  "methods":[
    {
      "name":"Removing Dust",
      "steps":[
        {
          "headline":"Wipe off dust with a dry cloth.",
          "description":"Use a clean, lint-free dusting cloth. Rub it gently and carefully along the surface of the object. Move to an unsoiled area of the cloth when the fabric gets dirty. Try a cotton cloth, or a fabric from nylon fibers made specifically for wiping away dust."
        },
        {
          "headline":"Use suction.",
          "description":"Place your object on a padded surface. Hold the nozzle of a vacuum about an inch away from the pottery. Apply suction as you brush the object’s surface with a soft paintbrush. If possible, use a vacuum cleaner that has a high-efficiency particulate air filter (HEPA) and modifiable suction. Use less suction for tiny or very delicate items."
        },
        {
          "headline":"Use forced air.",
          "description":"Use a hairdryer on a low, cool setting. Rub a soft, lint-free cloth or a soft brush over your pottery as you blow it with air. Try a can of compressed air to get into crevices."
        }
      ]
    },
    {
      "name":"Removing Marks",
      "steps":[
        {
          "headline":"Spot treat with alcohol.",
          "description":"Wet a cotton cloth with rubbing alcohol. Alternately, dip the cloth in a solution of ten parts denatured alcohol, eight parts water (distilled or deionized) and one part non-detergent household ammonia. Wipe the wet cloth over stains, grease or dirt build-up. Perform this step on stubborn stains before proceeding to soak the item in soap and water. Ammonia can cause a chemical reaction to surfaces with unstable glazing. If in doubt, don’t use ammonia. Make sure to wear gloves!"
        },
        {
          "headline":"Remove adhesive marks.",
          "description":"Dampen a cloth with acetone, De-Solv-it spray, or Goo Gone. Rub the moistened cloth on any areas with glue or sticker marks. Follow this up by buffing with a soft cloth. Make sure to wear gloves. Don’t try this technique on any areas where your pottery has been repaired."
        },
        {
          "headline":"Treat silver marks.",
          "description":"Put a bit of metal polish, such as Noxon, on a rag. Rub the moistened rag on the markings. Apply significant pressure as you rub. Buff the pottery clean with a dry part of the rag. Alternately, try using “Barkeeper’s Friend” with warm water and a sponge, or use a pencil eraser."
        },
        {
          "headline":"Clean mineral deposits.",
          "description":"Soak your pottery in white vinegar for at least a day or two. Rub the mineral buildup daily using a butter knife to gently break up buildup. Wash the pottery with soap and warm water once you’ve achieved clean pottery. Soak the pottery in tap water to get rid of the vinegar odor. Try this for lime, calcium or rust stains."
        },
        {
          "headline":"Treat darkened crazing.",
          "description":"Wet clean rags with 40% hydrogen peroxide. Wrap your pottery with the rags. Place the wrapped pottery in a sealed bag. Re-soak the rags every few days. The process is complete when the crazing has lightened to your satisfaction."
        }
      ]
    },
    {
      "name":"Soaking in Soapy Water",
      "steps":[
        {
          "headline":"Examine the pottery closely.",
          "description":"Hold a magnifying glass up to your pottery in natural daylight. Look for cracks, peeling glaze, and prior repairs. Don’t use a wet cleaning method if your pottery has any of these issues. Avoid wet cleaning if your pottery is hand painted. Painted pottery may have been sealed with a spray glaze which is not tough like kiln-fired glazes."
        },
        {
          "headline":"Seal up any air holes.",
          "description":"Plug the air hole in the bottom of a figurine, if applicable. Use a piece of tape if the object is unglazed. Otherwise, use a plastic bag or other waterproof object. Make sure that the ventilation hole is completely blocked off. When you soak a figurine with air holes, you want to avoid getting water inside of the figurine. This can result in long-term structural damage to some ceramics."
        },
        {
          "headline":"Soak the pottery in soap and water.",
          "description":"Line a sink or large container with at least one thick bath towel. Fill your container with warm water and add mild dishwashing detergent. Submerge your pottery for just a few seconds. Clean any problem areas with a soft washcloth. Putting bath towels down can prevent your pottery from cracking if you accidentally drop it when your hands are soapy."
        }
      ]
    }
  ],
  "text":" Removing Dust Wipe off dust with a dry cloth. Use a clean, lint-free dusting cloth. Rub it gently and carefully along the surface of the object. Move to an unsoiled area of the cloth when the fabric gets dirty. Try a cotton cloth, or a fabric from nylon fibers made specifically for wiping away dust. Use suction. Place your object on a padded surface. Hold the nozzle of a vacuum about an inch away from the pottery. Apply suction as you brush the object’s surface with a soft paintbrush. If possible, use a vacuum cleaner that has a high-efficiency particulate air filter (HEPA) and modifiable suction. Use less suction for tiny or very delicate items. Use forced air. Use a hairdryer on a low, cool setting. Rub a soft, lint-free cloth or a soft brush over your pottery as you blow it with air. Try a can of compressed air to get into crevices. Removing Marks Spot treat with alcohol. Wet a cotton cloth with rubbing alcohol. Alternately, dip the cloth in a solution of ten parts denatured alcohol, eight parts water (distilled or deionized) and one part non-detergent household ammonia. Wipe the wet cloth over stains, grease or dirt build-up. Perform this step on stubborn stains before proceeding to soak the item in soap and water. Ammonia can cause a chemical reaction to surfaces with unstable glazing. If in doubt, don’t use ammonia. Make sure to wear gloves! Remove adhesive marks. Dampen a cloth with acetone, De-Solv-it spray, or Goo Gone. Rub the moistened cloth on any areas with glue or sticker marks. Follow this up by buffing with a soft cloth. Make sure to wear gloves. Don’t try this technique on any areas where your pottery has been repaired. Treat silver marks. Put a bit of metal polish, such as Noxon, on a rag. Rub the moistened rag on the markings. Apply significant pressure as you rub. Buff the pottery clean with a dry part of the rag. Alternately, try using “Barkeeper’s Friend” with warm water and a sponge, or use a pencil eraser. Clean mineral deposits. Soak your pottery in white vinegar for at least a day or two. Rub the mineral buildup daily using a butter knife to gently break up buildup. Wash the pottery with soap and warm water once you’ve achieved clean pottery. Soak the pottery in tap water to get rid of the vinegar odor. Try this for lime, calcium or rust stains. Treat darkened crazing. Wet clean rags with 40% hydrogen peroxide. Wrap your pottery with the rags. Place the wrapped pottery in a sealed bag. Re-soak the rags every few days. The process is complete when the crazing has lightened to your satisfaction. Soaking in Soapy Water Examine the pottery closely. Hold a magnifying glass up to your pottery in natural daylight. Look for cracks, peeling glaze, and prior repairs. Don’t use a wet cleaning method if your pottery has any of these issues. Avoid wet cleaning if your pottery is hand painted. Painted pottery may have been sealed with a spray glaze which is not tough like kiln-fired glazes. Seal up any air holes. Plug the air hole in the bottom of a figurine, if applicable. Use a piece of tape if the object is unglazed. Otherwise, use a plastic bag or other waterproof object. Make sure that the ventilation hole is completely blocked off. When you soak a figurine with air holes, you want to avoid getting water inside of the figurine. This can result in long-term structural damage to some ceramics. Soak the pottery in soap and water. Line a sink or large container with at least one thick bath towel. Fill your container with warm water and add mild dishwashing detergent. Submerge your pottery for just a few seconds. Clean any problem areas with a soft washcloth. Putting bath towels down can prevent your pottery from cracking if you accidentally drop it when your hands are soapy.",
  "tyn_model":[
    "water",
    "soap",
    "ammonia",
    "rag",
    "vacuum",
    "vacuum cleaner",
    "hairdryer",
    "compressed air",
    "alcohol",
    "cotton cloth",
    "rubbing alcohol",
    "household ammonia",
    "acetone",
    "de-solv-it spray",
    "goo gone",
    "metal polish",
    "noxon",
    "“barkeeper",
    "” with",
    "sponge",
    "pencil eraser",
    "white vinegar",
    "butter knife",
    "tap water",
    "hydrogen peroxide",
    "soapy water",
    "magnifying glass",
    "tape",
    "bath towel",
    "dishwashing detergent",
    "bath towels"
  ],
  "tyn_section":[

  ]
}