{
  "title":"How to Make Egyptian Molokhia Soup",
  "url":"https://www.wikihow.com/Make-Egyptian-Molokhia-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Soups"
  ],
  "steps":[
    {
      "headline":"Prepare the molokhia leaves.",
      "description":"Wash the molokhia leaves carefully and set them aside. Chop the molokhia into small pieces. If fresh leaves aren’t available, frozen molokhia can be used instead."
    },
    {
      "headline":"Prepare the chicken and clean it thoroughly.",
      "description":""
    },
    {
      "headline":"Put the chicken in a pot filled with water and cook until the water starts boiling.",
      "description":""
    },
    {
      "headline":"Dice the onions and add it to the pot.",
      "description":""
    },
    {
      "headline":"Add one tablespoon of salt, the cilantro, the garlic cloves, and the cinnamon stick to add flavor to the chicken.",
      "description":""
    },
    {
      "headline":"Add cardamom to the pot and let the chicken boil for about an hour.",
      "description":""
    },
    {
      "headline":"Place the chicken in a roasting pan (save the broth), and place the pan in the oven until it’s roasted.",
      "description":""
    },
    {
      "headline":"Add the chopped two cloves of garlic and fry it with two tablespoons of corn oil, until the garlic’s color becomes golden brown.",
      "description":""
    },
    {
      "headline":"Add the chicken broth, chopped molokhia, and the chopped garlic to the pot.",
      "description":""
    },
    {
      "headline":"Season the soup with the black pepper and bring it to a simmer.",
      "description":"Let it boil for about thirty minutes."
    },
    {
      "headline":"Add the tomato to make the soup’s texture less gooey, if desired.",
      "description":""
    },
    {
      "headline":"Chop another two cloves of garlic into small pieces and chop the cilantro.",
      "description":"Add them to a frying pan."
    },
    {
      "headline":"Measure and pour two tablespoons of corn oil into the pan and fry the garlic until it's golden brown.",
      "description":""
    },
    {
      "headline":"Place the chopped garlic and cilantro to the molokhia soup.",
      "description":"Allow the soup to boil for a couple of minutes until the vegetables are soft and have fully cooked."
    },
    {
      "headline":"Make white rice and/or roasted pita bread in the oven to serve it along with the chicken and molokhia soup.",
      "description":"Bake the pita at 400 °F (204 °C) for 7 minutes or until the pita is lightly brown"
    },
    {
      "headline":"Serve.",
      "description":"Enjoy!"
    }
  ],
  "text":" Prepare the molokhia leaves. Wash the molokhia leaves carefully and set them aside. Chop the molokhia into small pieces. If fresh leaves aren’t available, frozen molokhia can be used instead. Prepare the chicken and clean it thoroughly.  Put the chicken in a pot filled with water and cook until the water starts boiling.  Dice the onions and add it to the pot.  Add one tablespoon of salt, the cilantro, the garlic cloves, and the cinnamon stick to add flavor to the chicken.  Add cardamom to the pot and let the chicken boil for about an hour.  Place the chicken in a roasting pan (save the broth), and place the pan in the oven until it’s roasted.  Add the chopped two cloves of garlic and fry it with two tablespoons of corn oil, until the garlic’s color becomes golden brown.  Add the chicken broth, chopped molokhia, and the chopped garlic to the pot.  Season the soup with the black pepper and bring it to a simmer. Let it boil for about thirty minutes. Add the tomato to make the soup’s texture less gooey, if desired.  Chop another two cloves of garlic into small pieces and chop the cilantro. Add them to a frying pan. Measure and pour two tablespoons of corn oil into the pan and fry the garlic until it's golden brown.  Place the chopped garlic and cilantro to the molokhia soup. Allow the soup to boil for a couple of minutes until the vegetables are soft and have fully cooked. Make white rice and/or roasted pita bread in the oven to serve it along with the chicken and molokhia soup. Bake the pita at 400 °F (204 °C) for 7 minutes or until the pita is lightly brown Serve. Enjoy!",
  "tyn_model":[
    "garlic",
    "pot",
    "cilantro",
    "chicken",
    "water",
    "oven",
    "corn oil",
    "onions",
    "salt",
    "cinnamon",
    "cardamom",
    "roasting pan",
    "chicken broth",
    "molokhia",
    "black pepper",
    "tomato",
    "frying pan",
    "white rice",
    "roasted pita bread"
  ],
  "tyn_section":[

  ]
}