{
  "title":"How to Use Macrame in Home Decor",
  "url":"https://www.wikihow.com/Use-Macrame-in-Home-Decor",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "methods":[
    {
      "name":"Hanging Macrame Wall Art",
      "steps":[
        {
          "headline":"Mount a macrame tapestry.",
          "description":"A tapestry can add an element of hand-spun elegance to any room in your home. Use tapestries to make blank, uninteresting sections of wall more eye-catching. You could even hang one above the headboard of your bed or behind the sofa in the living room to tie the room together. Attach the tapestry to a wooden dowel (or a slender tree limb, for more of a natural look) to make it easier to hang and keep it from sagging. Make one-of-a-kind macrame wall art the focal point of your living room wall. EXPERT TIP\tUsing macramé as a decorative wall hanging is a popular option because it allows you to really appreciate the design. Lindsey Campbell\t\t\t\t\tWeaving Instructor and Artist\t\t\t\t\t\t\t\tLindsey Campbell is an artist and instructor behind Hello Hydrangea, a modern fiber company specializing in custom home decor and weaving supplies. She has taught over 2500 students how to weave craft through her online video classes. Lindsey's work has been featured in Design*Sponge, Huffington Post, and Vintage Revivals, and she has designed products for JoAnns Crafts, Anthropologie, and Nordstrom. Lindsey CampbellWeaving Instructor and Artist"
        },
        {
          "headline":"Design a unique dreamcatcher.",
          "description":"The classic dreamcatcher is a staple of many homes, and represents peace, restfulness and positivity. Rather than displaying an ordinary dreamcatcher woven from wire, try out a softer approach with the macrame version. The gentle fabric braids will bring you even more of a sense of comfort when you stop to admire it. Put the finishing touches on your dreamcatcher using beads, feathers and other decorative touches. Dreamcatchers are one of the simpler projects you can start with if you’re just learning how to macrame."
        },
        {
          "headline":"Make macrame curtains.",
          "description":"Replace boring window covers with floor-length macrame drapes. You could choose a dense weave for privacy, or go for a loose fringe to beautify your window space while still admitting a soft glow of light. You could even rig your macrame curtains up to runners so that you can draw and open them as you please."
        },
        {
          "headline":"Put up a room divider.",
          "description":"Hanging room dividers are typically made with noisy beads, but a macrame version can help create privacy without all that irritating clacking. Rather than keeping the doors in your home shut, simply tack the divider to the door frame to make your living space feel more open and inviting. Tie a couple beads onto the end of each strand to give the cords some weight so that they’ll return to their original position. Use partitions to cover entryways and create separation between rooms that are close together."
        }
      ]
    },
    {
      "name":"Decorating Furniture with Macrame",
      "steps":[
        {
          "headline":"Embellish ordinary lampshades.",
          "description":"Take a dusty old lampshade from dull to delightful with a simple macrame cover. These covers can easily be knotted to fit shades of different shapes and sizes, meaning any light in your home can benefit from a custom fit. Make your own DIY lampshades by knotting the cord around a wire frame that’s been shaped to fit over a lamp or ceiling light. Incorporate shells, beads or tassels to add complexity to your lampshades."
        },
        {
          "headline":"Weave clever furniture covers.",
          "description":"If you’re unhappy with the look of your loveseat or recliner but aren’t in a position to buy a new one, some macrame accents may be just what you need to make you fall in love with your seating situation again. Drape an enchanting pattern over the back of the piece to give it a whole new decorative appeal. You could even resurface a worn out seat or foot stool with a new handmade finish."
        },
        {
          "headline":"Make your own pillows and blankets.",
          "description":"Top your sofa or favorite easy chair with an assortment of throw pillows you designed yourself. Keep a cozy throw blanket or two handy for when you have company. Choose a softer fabric for your furniture accessories to ensure optimum comfort. You can use ordinary macrame cord for these projects or draw on recycled materials, like old t-shirts. Create themed sets of blankets and pillows using different knotting patterns and color combinations."
        },
        {
          "headline":"Lay out a macrame table runner.",
          "description":"For long or spacious dining tables that look awfully empty, use a knit runner to break up negative space. You can then use the runner as a place to arrange flowers, candles or a centerpiece while leaving the place settings free for serving home cooked meals. Leave a long fringe on both ends of the table runner for an elegant drape. Bring out your macrame table runner for springtime events or whenever you need to inject a little brightness and ornamentation into your dining area. EXPERT TIP\tWhen you use macrame as a table runner, you can see the design from a closer angle, so you can really show it off. Lindsey Campbell\t\t\t\t\tWeaving Instructor and Artist\t\t\t\t\t\t\t\tLindsey Campbell is an artist and instructor behind Hello Hydrangea, a modern fiber company specializing in custom home decor and weaving supplies. She has taught over 2500 students how to weave craft through her online video classes. Lindsey's work has been featured in Design*Sponge, Huffington Post, and Vintage Revivals, and she has designed products for JoAnns Crafts, Anthropologie, and Nordstrom. Lindsey CampbellWeaving Instructor and Artist"
        },
        {
          "headline":"Outline a mirror or portrait.",
          "description":"Hide an uninspired frame with a tight macrame wrap. Textile frames provide a pleasant contrast to the focal point of the frame, and they go perfectly in homes decked out with rustic or vintage decor. Be sure to remove the glass and backing from the frame before trying to tie the cord into place."
        }
      ]
    },
    {
      "name":"Creating Crafty Containers",
      "steps":[
        {
          "headline":"Make hanging planters.",
          "description":"This bohemian gardening solution is a hit among contemporary interior designers. The macrame weaves are shaped into nets to nestle lightweight planters in, then suspended from the ceiling at various heights. Hanging planters are a wonderful method of presentation for home gardening projects, and can also free up valuable space around your porch or patio. Hanging macrame containers aren’t just for plants—they can also be useful for tea lights, bird feeders, or even craft art and decorations. Make sure the cord and knotting style you implement are strong enough to hold objects with a little weight."
        },
        {
          "headline":"Wrap a vase or candle holder.",
          "description":"Give plain display pieces some much-needed flair by enveloping them in a web-like exterior. The macrame can cover the entire outside of the piece, or encircle the center in a sleek band. You’ll quickly turn old, outdated items into conversation starters. Wrap and hang unused glass bottles or mason jars to convert them into minimalistic miniature flower vases. The same thing can be done for bins, jars, kitchen storage canisters and any number of similarly shaped containers."
        },
        {
          "headline":"Create custom baskets.",
          "description":"Fabric construction can make almost anything more charming, including simple storage containers. Wind sturdy cord around a premade basket frame to give it a tight structure, or make the whole thing from scratch. When you’re done, you’ll have a quaint carrier perfect for holding fresh fruit, bath accessories or the daily mail. Use a firm type of cord that will be able to hold up to frequent handling while retaining its shape. Include handles to make your baskets easier to tote from place to place."
        }
      ]
    }
  ],
  "text":" Hanging Macrame Wall Art Mount a macrame tapestry. A tapestry can add an element of hand-spun elegance to any room in your home. Use tapestries to make blank, uninteresting sections of wall more eye-catching. You could even hang one above the headboard of your bed or behind the sofa in the living room to tie the room together. Attach the tapestry to a wooden dowel (or a slender tree limb, for more of a natural look) to make it easier to hang and keep it from sagging. Make one-of-a-kind macrame wall art the focal point of your living room wall. EXPERT TIP\tUsing macramé as a decorative wall hanging is a popular option because it allows you to really appreciate the design. Lindsey Campbell\t\t\t\t\tWeaving Instructor and Artist\t\t\t\t\t\t\t\tLindsey Campbell is an artist and instructor behind Hello Hydrangea, a modern fiber company specializing in custom home decor and weaving supplies. She has taught over 2500 students how to weave craft through her online video classes. Lindsey's work has been featured in Design*Sponge, Huffington Post, and Vintage Revivals, and she has designed products for JoAnns Crafts, Anthropologie, and Nordstrom. Lindsey CampbellWeaving Instructor and Artist Design a unique dreamcatcher. The classic dreamcatcher is a staple of many homes, and represents peace, restfulness and positivity. Rather than displaying an ordinary dreamcatcher woven from wire, try out a softer approach with the macrame version. The gentle fabric braids will bring you even more of a sense of comfort when you stop to admire it. Put the finishing touches on your dreamcatcher using beads, feathers and other decorative touches. Dreamcatchers are one of the simpler projects you can start with if you’re just learning how to macrame. Make macrame curtains. Replace boring window covers with floor-length macrame drapes. You could choose a dense weave for privacy, or go for a loose fringe to beautify your window space while still admitting a soft glow of light. You could even rig your macrame curtains up to runners so that you can draw and open them as you please. Put up a room divider. Hanging room dividers are typically made with noisy beads, but a macrame version can help create privacy without all that irritating clacking. Rather than keeping the doors in your home shut, simply tack the divider to the door frame to make your living space feel more open and inviting. Tie a couple beads onto the end of each strand to give the cords some weight so that they’ll return to their original position. Use partitions to cover entryways and create separation between rooms that are close together. Decorating Furniture with Macrame Embellish ordinary lampshades. Take a dusty old lampshade from dull to delightful with a simple macrame cover. These covers can easily be knotted to fit shades of different shapes and sizes, meaning any light in your home can benefit from a custom fit. Make your own DIY lampshades by knotting the cord around a wire frame that’s been shaped to fit over a lamp or ceiling light. Incorporate shells, beads or tassels to add complexity to your lampshades. Weave clever furniture covers. If you’re unhappy with the look of your loveseat or recliner but aren’t in a position to buy a new one, some macrame accents may be just what you need to make you fall in love with your seating situation again. Drape an enchanting pattern over the back of the piece to give it a whole new decorative appeal. You could even resurface a worn out seat or foot stool with a new handmade finish. Make your own pillows and blankets. Top your sofa or favorite easy chair with an assortment of throw pillows you designed yourself. Keep a cozy throw blanket or two handy for when you have company. Choose a softer fabric for your furniture accessories to ensure optimum comfort. You can use ordinary macrame cord for these projects or draw on recycled materials, like old t-shirts. Create themed sets of blankets and pillows using different knotting patterns and color combinations. Lay out a macrame table runner. For long or spacious dining tables that look awfully empty, use a knit runner to break up negative space. You can then use the runner as a place to arrange flowers, candles or a centerpiece while leaving the place settings free for serving home cooked meals. Leave a long fringe on both ends of the table runner for an elegant drape. Bring out your macrame table runner for springtime events or whenever you need to inject a little brightness and ornamentation into your dining area. EXPERT TIP\tWhen you use macrame as a table runner, you can see the design from a closer angle, so you can really show it off. Lindsey Campbell\t\t\t\t\tWeaving Instructor and Artist\t\t\t\t\t\t\t\tLindsey Campbell is an artist and instructor behind Hello Hydrangea, a modern fiber company specializing in custom home decor and weaving supplies. She has taught over 2500 students how to weave craft through her online video classes. Lindsey's work has been featured in Design*Sponge, Huffington Post, and Vintage Revivals, and she has designed products for JoAnns Crafts, Anthropologie, and Nordstrom. Lindsey CampbellWeaving Instructor and Artist Outline a mirror or portrait. Hide an uninspired frame with a tight macrame wrap. Textile frames provide a pleasant contrast to the focal point of the frame, and they go perfectly in homes decked out with rustic or vintage decor. Be sure to remove the glass and backing from the frame before trying to tie the cord into place. Creating Crafty Containers Make hanging planters. This bohemian gardening solution is a hit among contemporary interior designers. The macrame weaves are shaped into nets to nestle lightweight planters in, then suspended from the ceiling at various heights. Hanging planters are a wonderful method of presentation for home gardening projects, and can also free up valuable space around your porch or patio. Hanging macrame containers aren’t just for plants—they can also be useful for tea lights, bird feeders, or even craft art and decorations. Make sure the cord and knotting style you implement are strong enough to hold objects with a little weight. Wrap a vase or candle holder. Give plain display pieces some much-needed flair by enveloping them in a web-like exterior. The macrame can cover the entire outside of the piece, or encircle the center in a sleek band. You’ll quickly turn old, outdated items into conversation starters. Wrap and hang unused glass bottles or mason jars to convert them into minimalistic miniature flower vases. The same thing can be done for bins, jars, kitchen storage canisters and any number of similarly shaped containers. Create custom baskets. Fabric construction can make almost anything more charming, including simple storage containers. Wind sturdy cord around a premade basket frame to give it a tight structure, or make the whole thing from scratch. When you’re done, you’ll have a quaint carrier perfect for holding fresh fruit, bath accessories or the daily mail. Use a firm type of cord that will be able to hold up to frequent handling while retaining its shape. Include handles to make your baskets easier to tote from place to place.",
  "tyn_model":[
    "beads",
    "tapestry",
    "modern fiber",
    "macrame curtains",
    "blankets",
    "macrame table runner",
    "table runner",
    "macrame",
    "planters",
    "baskets",
    "macrame tapestry",
    "tapestries",
    "dowel",
    "macramé",
    "feathers",
    "lampshades",
    "lampshade",
    "macrame cover",
    "throw pillows",
    "throw blanket",
    "pillows",
    "runner",
    "mirror",
    "macrame wrap",
    "glass",
    "hanging planters",
    "macrame weaves",
    "nets",
    "hanging macrame containers",
    "—they",
    "vase",
    "candle holder",
    "glass bottles",
    "mason jars",
    "bins",
    "jars",
    "fabric",
    "cord"
  ],
  "tyn_section":[

  ]
}