{
  "title":"How to Make a Flourless Chocolate Cake",
  "url":"https://www.wikihow.com/Make-a-Flourless-Chocolate-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "parts":[
    {
      "name":"Making the Cake",
      "steps":[
        {
          "headline":"Preheat the oven to 375°F.",
          "description":""
        },
        {
          "headline":"Spray a 9-inch spring form pan with nonstick cooking spray, then line the bottom with a circle of parchment paper.",
          "description":"Spray the paper with cooking spray, too, then set the pan aside."
        },
        {
          "headline":"Place two-thirds (8 ounces) of the chocolate and 1 cup (2 sticks) of the butter (cut into chunks) in a medium saucepan over medium low heat.",
          "description":""
        },
        {
          "headline":"Stirring often, melt the chocolate with butter until completely blended.",
          "description":"Make sure it does not burn."
        },
        {
          "headline":"Remove from heat and transfer to a large bowl.",
          "description":"Use a rubber spatula to scrap the saucepan so all of the chocolate is transferred."
        },
        {
          "headline":"Add sugar and mix well.",
          "description":""
        },
        {
          "headline":"Add eggs one at a time, whisking well after each addition.",
          "description":""
        },
        {
          "headline":"Add sifted cocoa and mix until blended.",
          "description":""
        },
        {
          "headline":"Pour batter into prepared spring form pan.",
          "description":""
        },
        {
          "headline":"Bake for 35 to 40 minutes, or until cake has risen and top has formed a thin crust.",
          "description":"The cake should be just firm in the center when done. Stick a tooth pick in the center of the cake, if it comes out clean the cake is done."
        }
      ]
    },
    {
      "name":"Cooling and Glazing",
      "steps":[
        {
          "headline":"Cool for 10 minutes on a wire rack.",
          "description":""
        },
        {
          "headline":"Invert onto a plate and remove sides of spring form pan.",
          "description":""
        },
        {
          "headline":"Remove and discard parchment paper.",
          "description":"Set cake aside to cool completely on the plate."
        },
        {
          "headline":"Meanwhile, make the chocolate glaze.",
          "description":"Melt remaining 4 ounces chocolate and 3 tablespoons butter in a small saucepan over medium low heat, stirring until smooth."
        },
        {
          "headline":"Remove from heat, then stir in milk, honey and vanilla.",
          "description":"Set aside to cool slightly."
        },
        {
          "headline":"When cake has cooled, pour glaze onto the center.",
          "description":"Using a spatula or the back of a spoon, very gently smooth glaze along the top and sides of the cake."
        },
        {
          "headline":"While glaze is still warm, add raspberries to the top.",
          "description":""
        },
        {
          "headline":"Chill cake in a refrigerator, uncovered, for 30 to 60 minutes before serving to set the glaze and make the cake easier to slice.",
          "description":""
        },
        {
          "headline":"Serve and enjoy.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Cake Preheat the oven to 375°F.  Spray a 9-inch spring form pan with nonstick cooking spray, then line the bottom with a circle of parchment paper. Spray the paper with cooking spray, too, then set the pan aside. Place two-thirds (8 ounces) of the chocolate and 1 cup (2 sticks) of the butter (cut into chunks) in a medium saucepan over medium low heat.  Stirring often, melt the chocolate with butter until completely blended. Make sure it does not burn. Remove from heat and transfer to a large bowl. Use a rubber spatula to scrap the saucepan so all of the chocolate is transferred. Add sugar and mix well.  Add eggs one at a time, whisking well after each addition.  Add sifted cocoa and mix until blended.  Pour batter into prepared spring form pan.  Bake for 35 to 40 minutes, or until cake has risen and top has formed a thin crust. The cake should be just firm in the center when done. Stick a tooth pick in the center of the cake, if it comes out clean the cake is done. Cooling and Glazing Cool for 10 minutes on a wire rack.  Invert onto a plate and remove sides of spring form pan.  Remove and discard parchment paper. Set cake aside to cool completely on the plate. Meanwhile, make the chocolate glaze. Melt remaining 4 ounces chocolate and 3 tablespoons butter in a small saucepan over medium low heat, stirring until smooth. Remove from heat, then stir in milk, honey and vanilla. Set aside to cool slightly. When cake has cooled, pour glaze onto the center. Using a spatula or the back of a spoon, very gently smooth glaze along the top and sides of the cake. While glaze is still warm, add raspberries to the top.  Chill cake in a refrigerator, uncovered, for 30 to 60 minutes before serving to set the glaze and make the cake easier to slice.  Serve and enjoy. ",
  "tyn_model":[
    "chocolate",
    "butter",
    "parchment paper",
    "spring form pan",
    "plate",
    "oven",
    "nonstick cooking spray",
    "cooking spray",
    "medium saucepan",
    "large bowl",
    "rubber spatula",
    "saucepan",
    "sugar",
    "eggs",
    "cocoa",
    "tooth pick",
    "wire rack",
    "small saucepan",
    "milk",
    "honey",
    "vanilla",
    "spatula",
    "spoon",
    "raspberries",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}