{
  "title":"How to Beat Anyone at Any Two Player Game",
  "url":"https://www.wikihow.com/Beat-Anyone-at-Any-Two-Player-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Electronic Game Strategies"
  ],
  "steps":[
    {
      "headline":"Bluff.",
      "description":"Say how good you are at playing the game and try to make your opponent think that they are never going to beat you. If you force your opponent into believing this, they are going to play the game in such a way as to give you an immediate mind advantage."
    },
    {
      "headline":"Take Control.",
      "description":"If it's an action game like shooting, always get to the good guns first but if your opponent gets the good weapons that's your cue to get a good place to hide."
    },
    {
      "headline":"Defend and Attack.",
      "description":"If it's a fighting game always block as many of their blows as possible and attack when possible. If it's a close combat/fighting game such as boxing or wrestling always use moves and punches that you can use from a distance so you can easily move off block straight after you attack."
    },
    {
      "headline":"Watch your maps.",
      "description":"If it's a racing or free roam game, then look for any maps that may be onscreen, as they can tell you of hiding places or other players."
    },
    {
      "headline":"Concentrate.",
      "description":"Always stay focused on the game and not on anything else."
    },
    {
      "headline":"Call Time.",
      "description":"Pause the game at crucial moments when you need to. Take the opportunity to regroup and rethink."
    },
    {
      "headline":"Perhaps you could offer to take a short break, that way you could reassess the scenario, that way when you come back you will be ready with your next move already planned.",
      "description":""
    },
    {
      "headline":"Distract.",
      "description":"Distract your opponent as much as you can. If you have a certain skill in which you're able to talk while focusing on the game, do it. Talk about things you know about that person so your opponent is into what you're saying. If you're really low, you can play dirty and wave your hand in front of your opponent's face, or pretend like there's a fly buzzing around. Be warned that the other player may get upset if you damage their controller, or they know that you're intentionally sabotaging their gameplay"
    }
  ],
  "text":" Bluff. Say how good you are at playing the game and try to make your opponent think that they are never going to beat you. If you force your opponent into believing this, they are going to play the game in such a way as to give you an immediate mind advantage. Take Control. If it's an action game like shooting, always get to the good guns first but if your opponent gets the good weapons that's your cue to get a good place to hide. Defend and Attack. If it's a fighting game always block as many of their blows as possible and attack when possible. If it's a close combat/fighting game such as boxing or wrestling always use moves and punches that you can use from a distance so you can easily move off block straight after you attack. Watch your maps. If it's a racing or free roam game, then look for any maps that may be onscreen, as they can tell you of hiding places or other players. Concentrate. Always stay focused on the game and not on anything else. Call Time. Pause the game at crucial moments when you need to. Take the opportunity to regroup and rethink. Perhaps you could offer to take a short break, that way you could reassess the scenario, that way when you come back you will be ready with your next move already planned.  Distract. Distract your opponent as much as you can. If you have a certain skill in which you're able to talk while focusing on the game, do it. Talk about things you know about that person so your opponent is into what you're saying. If you're really low, you can play dirty and wave your hand in front of your opponent's face, or pretend like there's a fly buzzing around. Be warned that the other player may get upset if you damage their controller, or they know that you're intentionally sabotaging their gameplay",
  "tyn_model":[
    "controller"
  ],
  "tyn_section":[

  ]
}