{
  "title":"How to Make Beef Chili",
  "url":"https://www.wikihow.com/Make-Beef-Chili",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Chili Dishes"
  ],
  "steps":[
    {
      "headline":"Peel and coarsely chop 1 large white onion.",
      "description":""
    },
    {
      "headline":"Remove stem and seeds from the 2 green peppers.",
      "description":"Coarsely chop the peppers to prepare them for cooking."
    },
    {
      "headline":"Place pot over medium heat and add ground beef to the pot.",
      "description":""
    },
    {
      "headline":"Brown and drain ground beef (approximately 5 minutes).",
      "description":""
    },
    {
      "headline":"Add chopped onion and cook until onion is almost clear in color  (5 minutes).",
      "description":""
    },
    {
      "headline":"Add chopped green peppers and cook for 5 minutes.",
      "description":"Stir frequently."
    },
    {
      "headline":"Open cans of diced tomatoes, tomato sauce, and kidney beans.",
      "description":"Drain the kidney beans and add contents of all cans to the pot."
    },
    {
      "headline":"Add chili powder and cayenne pepper to pot and stir well.",
      "description":""
    },
    {
      "headline":"Reduce heat to low and simmer chili for 2 to 3 hours.",
      "description":"Stir occasionally."
    },
    {
      "headline":"Add your favorite shredded cheese and enjoy with sliced Italian or French bread.",
      "description":""
    }
  ],
  "text":" Peel and coarsely chop 1 large white onion.  Remove stem and seeds from the 2 green peppers. Coarsely chop the peppers to prepare them for cooking. Place pot over medium heat and add ground beef to the pot.  Brown and drain ground beef (approximately 5 minutes).  Add chopped onion and cook until onion is almost clear in color  (5 minutes).  Add chopped green peppers and cook for 5 minutes. Stir frequently. Open cans of diced tomatoes, tomato sauce, and kidney beans. Drain the kidney beans and add contents of all cans to the pot. Add chili powder and cayenne pepper to pot and stir well.  Reduce heat to low and simmer chili for 2 to 3 hours. Stir occasionally. Add your favorite shredded cheese and enjoy with sliced Italian or French bread. ",
  "tyn_model":[
    "pot",
    "green peppers",
    "ground beef",
    "kidney beans",
    "white onion",
    "onion",
    "diced tomatoes",
    "tomato sauce",
    "chili powder",
    "cayenne pepper",
    "chili",
    "shredded cheese"
  ],
  "tyn_section":[

  ]
}