{
  "title":"How to Hang a Porch Swing",
  "url":"https://www.wikihow.com/Hang-a-Porch-Swing",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "methods":[
    {
      "name":"Measuring and Selecting Materials",
      "steps":[
        {
          "headline":"Choose your swing.",
          "description":"There are several types of swings available. For instance, you might choose a wicker porch swing, a metal porch swing, or a wooden porch swing. You can get porch swings in a rainbow of colors, so choose a color that suits your porch and pleases the eye. There is no functional difference associated with the different types of colors or materials of the porch swing. Your choice of swing is entirely based on your personal preference."
        },
        {
          "headline":"Choose between steel chains or rope.",
          "description":"Chains of stainless or galvanized steel are the most common option. However, if you’d rather have a hanging porch swing with a more rustic look, you could use marine-grade braided nylon rope or polyester rope. Your ropes or chains will likely need to be at least seven feet long. If you use rope, ensure it is at least ¾’’ (19 millimeters) thick. Whatever you choose, ensure you obtain two equal lengths of each, one for each end of your porch swing. If you choose to hang your swing with rope, check it regularly for signs of wear like fraying threads."
        },
        {
          "headline":"Give your swing lots of space.",
          "description":"You should plan on your porch swing moving through an arc that extends through about four feet of space. In other words, hang your porch swing at a spot with at least three feet of space in front and in back of it. Use a measuring tape to determine where your porch swing would fit best. If you’re hanging a prefabricated A-frame porch swing, you won’t need to look for beams and joists in your porch ceiling, but you will still need to ensure your porch is deep enough to accommodate the A-frame. Compare the frame’s depth against your porch’s before purchasing."
        }
      ]
    },
    {
      "name":"Installing the Necessary Hardware",
      "steps":[
        {
          "headline":"Attach the swing hooks.",
          "description":"If your porch swing didn’t come with swing hooks, you’ll need to attach some. The precise location where you’ll need to attach the swing hook depends upon the design of your porch swing. Generally, you should locate the point where the vertically-oriented front of the armrest intersects with the horizontally-oriented front-most edge of the actual seat. Install one swing hook facing out from the side of the porch swing, then install another at the corresponding point on the opposite side of the swing. Place the next two swing hooks on the porch swing at two points located at the same height as the swing hooks you’ve already connected, but place them toward the rear of the seat where the seat intersects the back. Drill pilot holes before screwing the swing hooks into the porch swing itself. Use a drill bit with a diameter just a bit smaller than that of the pointed end of the swing hook to drill your pilot hole. This is an important step that can prevent your porch swing from splintering. When you’re ready, screw the swing hooks into the porch swing by hand."
        },
        {
          "headline":"Drill screw-eyes into unfinished porch ceilings.",
          "description":"The screw-eye is a metal loop. After installing two screw eyes, you’ll loop the rope or chain attached to the arms of the swing into it. Drive your screw-eye into a thick beam or joist at the place you wish to locate your porch swing. Locate a thick beam or joist (at least two inches wide and five inches thick) that can support a screw-eye. Once you’ve located the joist or beam where you wish to install your porch swing, drill a pilot hole into it with a drill at the point from which you wish to hang the porch swing. This is an important step that can prevent your beam from splintering. Turn the eye-screw into the hole as far as it will go, then pass a screwdriver through the circle of the eye-screw so that its central point is just below the hole into which you drove it. Place one hand on the handle of the screwdriver and place one hand on the other end of the screwdriver. Push up hard with the screwdriver against the eye-screw to jam it tightly into its hole. Install another screw-eye in another joist or beam at a distance from the first that is roughly equivalent to the length of the porch swing. Use screw-eyes with a four-inch shaft and a socket with a diameter that can accommodate the rope or chain you’ve selected to hang your porch swing."
        },
        {
          "headline":"Use eyebolts in homes with finished ceilings.",
          "description":"In homes with finished porch ceilings, you won’t be able to use a screw-eye. Instead, you’ll use an eyebolt. Cut away part of the roof above the porch swing to access the joists and beams that can support the eye-screw. Predrill a hole through the joist. The drill tip should come out straight through the ceiling of your porch. Slide a six-inch machine-threaded eyebolt up through the porch ceiling and have a friend on the other end (on the porch roof) secure it with a nut. Install another eyebolt in another joist or beam at a distance from the first that is roughly equivalent to the length of the porch swing. Repair the roof when finished. This technique is most common in older homes."
        }
      ]
    },
    {
      "name":"Finishing the Assembly",
      "steps":[
        {
          "headline":"Hang the swing.",
          "description":"Connect a rope or chain to the front swing hook, then loop it up through the corresponding eyebolt or screw-eye on your porch ceiling. Connect the end of your rope or chain to the second swing hook on the same side of the porch swing that you connected the other end of your rope or chain. For instance, if you’re facing your porch swing and attempting to hang it, connect a chain to the front-left swing hook, loop it through the eyebolt, then connect the end that passed through the eyebolt onto the swing hook located at the back-left of the swing porch. Repeat on the opposite side. If your porch swing is heavy, have a friend help you lift the porch swing up to the height at which you wish to hang it before attaching it to the ceiling."
        },
        {
          "headline":"Test your swing.",
          "description":"Give it a push. If it moves properly back and forth, you’ve succeeded in hanging your porch swing. If you find that one end is not quite even with the other, leading to an off-kilter appearance, adjust the chain’s location on one or the other sides. For instance, if the right side of your porch swing is lower than the left, you’ll need to shorten the length of chain connecting the two swing screws on the right side. Alternately, you could extend the length of chain between the two swing screws on the left side so that it sits lower."
        },
        {
          "headline":"Attach comfort springs.",
          "description":"For an extra-smooth porch swing experience, attach comfort springs to each eyebolt or screw-eye, then attach your chain to the end of comfort spring. The comfort springs provide a bit of bounce on your porch swing and make its motion more fluid."
        }
      ]
    }
  ],
  "text":" Measuring and Selecting Materials Choose your swing. There are several types of swings available. For instance, you might choose a wicker porch swing, a metal porch swing, or a wooden porch swing. You can get porch swings in a rainbow of colors, so choose a color that suits your porch and pleases the eye. There is no functional difference associated with the different types of colors or materials of the porch swing. Your choice of swing is entirely based on your personal preference. Choose between steel chains or rope. Chains of stainless or galvanized steel are the most common option. However, if you’d rather have a hanging porch swing with a more rustic look, you could use marine-grade braided nylon rope or polyester rope. Your ropes or chains will likely need to be at least seven feet long. If you use rope, ensure it is at least ¾’’ (19 millimeters) thick. Whatever you choose, ensure you obtain two equal lengths of each, one for each end of your porch swing. If you choose to hang your swing with rope, check it regularly for signs of wear like fraying threads. Give your swing lots of space. You should plan on your porch swing moving through an arc that extends through about four feet of space. In other words, hang your porch swing at a spot with at least three feet of space in front and in back of it. Use a measuring tape to determine where your porch swing would fit best. If you’re hanging a prefabricated A-frame porch swing, you won’t need to look for beams and joists in your porch ceiling, but you will still need to ensure your porch is deep enough to accommodate the A-frame. Compare the frame’s depth against your porch’s before purchasing. Installing the Necessary Hardware Attach the swing hooks. If your porch swing didn’t come with swing hooks, you’ll need to attach some. The precise location where you’ll need to attach the swing hook depends upon the design of your porch swing. Generally, you should locate the point where the vertically-oriented front of the armrest intersects with the horizontally-oriented front-most edge of the actual seat. Install one swing hook facing out from the side of the porch swing, then install another at the corresponding point on the opposite side of the swing. Place the next two swing hooks on the porch swing at two points located at the same height as the swing hooks you’ve already connected, but place them toward the rear of the seat where the seat intersects the back. Drill pilot holes before screwing the swing hooks into the porch swing itself. Use a drill bit with a diameter just a bit smaller than that of the pointed end of the swing hook to drill your pilot hole. This is an important step that can prevent your porch swing from splintering. When you’re ready, screw the swing hooks into the porch swing by hand. Drill screw-eyes into unfinished porch ceilings. The screw-eye is a metal loop. After installing two screw eyes, you’ll loop the rope or chain attached to the arms of the swing into it. Drive your screw-eye into a thick beam or joist at the place you wish to locate your porch swing. Locate a thick beam or joist (at least two inches wide and five inches thick) that can support a screw-eye. Once you’ve located the joist or beam where you wish to install your porch swing, drill a pilot hole into it with a drill at the point from which you wish to hang the porch swing. This is an important step that can prevent your beam from splintering. Turn the eye-screw into the hole as far as it will go, then pass a screwdriver through the circle of the eye-screw so that its central point is just below the hole into which you drove it. Place one hand on the handle of the screwdriver and place one hand on the other end of the screwdriver. Push up hard with the screwdriver against the eye-screw to jam it tightly into its hole. Install another screw-eye in another joist or beam at a distance from the first that is roughly equivalent to the length of the porch swing. Use screw-eyes with a four-inch shaft and a socket with a diameter that can accommodate the rope or chain you’ve selected to hang your porch swing. Use eyebolts in homes with finished ceilings. In homes with finished porch ceilings, you won’t be able to use a screw-eye. Instead, you’ll use an eyebolt. Cut away part of the roof above the porch swing to access the joists and beams that can support the eye-screw. Predrill a hole through the joist. The drill tip should come out straight through the ceiling of your porch. Slide a six-inch machine-threaded eyebolt up through the porch ceiling and have a friend on the other end (on the porch roof) secure it with a nut. Install another eyebolt in another joist or beam at a distance from the first that is roughly equivalent to the length of the porch swing. Repair the roof when finished. This technique is most common in older homes. Finishing the Assembly Hang the swing. Connect a rope or chain to the front swing hook, then loop it up through the corresponding eyebolt or screw-eye on your porch ceiling. Connect the end of your rope or chain to the second swing hook on the same side of the porch swing that you connected the other end of your rope or chain. For instance, if you’re facing your porch swing and attempting to hang it, connect a chain to the front-left swing hook, loop it through the eyebolt, then connect the end that passed through the eyebolt onto the swing hook located at the back-left of the swing porch. Repeat on the opposite side. If your porch swing is heavy, have a friend help you lift the porch swing up to the height at which you wish to hang it before attaching it to the ceiling. Test your swing. Give it a push. If it moves properly back and forth, you’ve succeeded in hanging your porch swing. If you find that one end is not quite even with the other, leading to an off-kilter appearance, adjust the chain’s location on one or the other sides. For instance, if the right side of your porch swing is lower than the left, you’ll need to shorten the length of chain connecting the two swing screws on the right side. Alternately, you could extend the length of chain between the two swing screws on the left side so that it sits lower. Attach comfort springs. For an extra-smooth porch swing experience, attach comfort springs to each eyebolt or screw-eye, then attach your chain to the end of comfort spring. The comfort springs provide a bit of bounce on your porch swing and make its motion more fluid.",
  "tyn_model":[
    "porch swing",
    "rope",
    "screw-",
    "chain",
    "screwdriver",
    "drill",
    "comfort springs",
    "swing hooks",
    "porch swings",
    "’’ (",
    "measuring tape",
    "hooks",
    "swing hook",
    "screw-eye",
    "screw eyes",
    "nut",
    "comfort spring"
  ],
  "tyn_section":[

  ]
}