{
  "title":"How to Use Cacao Nibs",
  "url":"https://www.wikihow.com/Use-Cacao-Nibs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Making Chocolate"
  ],
  "methods":[
    {
      "name":"Adding Cacao Nibs to Sweets",
      "steps":[
        {
          "headline":"Sprinkle them on baked goods before cooking.",
          "description":"Cacao nibs have a unique bitter flavour, similar to dark chocolate, but with no added sugars. By sprinkling them on the top of baked goods, you will be able to taste the flavour of the nibs without being overwhelmed. The sweet flavour from the baked goods will soften the intensity."
        },
        {
          "headline":"Substitute nuts or chocolate for cacao nibs.",
          "description":"If you are making chocolate chip cookies, or banana nut muffins, try substituting the chocolate chips or nuts for cacao nibs. You could also try adding them to brittle instead of, or in addition to, nuts."
        },
        {
          "headline":"Add cacao nibs to ice cream.",
          "description":"Try using cacao nibs as an ice cream topping. The bitter taste of the cacao nibs will complement nicely with the sweet flavor of the ice cream. You can also combine with additional toppings, such as berries and nuts to make a tasty dessert."
        },
        {
          "headline":"Try candied cacao nibs.",
          "description":"Candied cacao nibs are coated in a caramelized sugar. These treats can be a delicious stand alone snack, or you can try adding them to baked goods, such as truffles, brownies, and cakes. In order to make candied cacao nibs:\nCombine ½ a cup (118 ml) of granulated sugar, 2 tablespoons of water, and 1 tablespoon of corn syrup in a small saucepan. Place the saucepan on the stove on medium heat and stir until the sugar dissolves. Bring the mixture to a boil and then insert a thermometer and continue to cook (without stirring) until the mixture reaches 330 F (165 C). Remove the pan from the heat and add 1 cup (237 ml) of cacao nibs. Once the nibs are thoroughly coated, add 1 tablespoon of unsalted butter. Then line a baking sheet with tinfoil and scoop the candied mixture onto the tinfoil. Spread out evenly across the baking sheet. Let the candied cacao cool at room temperature until it has hardened. Then you can break into bits and enjoy!"
        }
      ]
    },
    {
      "name":"Including Cacao Nibs in Your Breakfast",
      "steps":[
        {
          "headline":"Try adding them to pancakes.",
          "description":"Once you have created the batter for your pancakes, stir in 1 tablespoon of cacao nibs. This will give a rich flavor of unsweetened chocolate that will come to life when combined with syrup. You can also sprinkle a few additional nibs onto the pancakes before serving, if you desire."
        },
        {
          "headline":"Include cacao nibs in granola.",
          "description":"Eating a bowl of granola mixed with yogurt and berries is a great and healthy way to start off the day. Simply add ½ cup (118 ml) of cacao nibs to the dry ingredients of your homemade granola. With 100% natural ingredients you can create a delicious granola using cacao nibs to give a creamy chocolaty flavor, without any added sugars."
        },
        {
          "headline":"Make a cacao nib breakfast smoothie.",
          "description":"Smoothies are a fast and easy way to start the day and you can easily incorporate cacao nibs into your favorite recipe. Simply add 2 tablespoons of cacao nibs to the blender and mix with your favorite smoothie ingredients. For a delicious combination of flavors try blending: 2 tablespoons of cacao nibs, 1 frozen banana (peeled), ½ cup (118 ml) of coffee (brewed and cooled), 4 tablespoons of coconut milk, 1 ½ tablespoons of agave, and a handful of ice."
        }
      ]
    },
    {
      "name":"Using Cacao Nibs in Savoury Meals",
      "steps":[
        {
          "headline":"Pair cacao nibs with grilled meats.",
          "description":"Cacao nibs can also be paired with savoury meals, such as meats. You can try crushing cacao nibs and then mixing them with other spices, such as pepper, salt, garlic powder, and paprika to create a steak rub."
        },
        {
          "headline":"Try adding cacao nibs to salad.",
          "description":"Cacao nibs can add depth and flavour to your salad. Using a base of mixed greens or arugula, create a salad by adding cacao nibs, pomegranate seeds, goats cheese, fennel, and olives. Top the salad with a simple vinaigrette."
        },
        {
          "headline":"Make a pesto using cacao nibs.",
          "description":"Pesto is a delicious spread that can be put onto a nice piece of bread or crostini and served as an appetizer. Create a cacao nib pesto by combining crushed cacao nibs with olive oil, crushed olives, and a few chopped basil leaves."
        }
      ]
    }
  ],
  "text":" Adding Cacao Nibs to Sweets Sprinkle them on baked goods before cooking. Cacao nibs have a unique bitter flavour, similar to dark chocolate, but with no added sugars. By sprinkling them on the top of baked goods, you will be able to taste the flavour of the nibs without being overwhelmed. The sweet flavour from the baked goods will soften the intensity. Substitute nuts or chocolate for cacao nibs. If you are making chocolate chip cookies, or banana nut muffins, try substituting the chocolate chips or nuts for cacao nibs. You could also try adding them to brittle instead of, or in addition to, nuts. Add cacao nibs to ice cream. Try using cacao nibs as an ice cream topping. The bitter taste of the cacao nibs will complement nicely with the sweet flavor of the ice cream. You can also combine with additional toppings, such as berries and nuts to make a tasty dessert. Try candied cacao nibs. Candied cacao nibs are coated in a caramelized sugar. These treats can be a delicious stand alone snack, or you can try adding them to baked goods, such as truffles, brownies, and cakes. In order to make candied cacao nibs:\nCombine ½ a cup (118 ml) of granulated sugar, 2 tablespoons of water, and 1 tablespoon of corn syrup in a small saucepan. Place the saucepan on the stove on medium heat and stir until the sugar dissolves. Bring the mixture to a boil and then insert a thermometer and continue to cook (without stirring) until the mixture reaches 330 F (165 C). Remove the pan from the heat and add 1 cup (237 ml) of cacao nibs. Once the nibs are thoroughly coated, add 1 tablespoon of unsalted butter. Then line a baking sheet with tinfoil and scoop the candied mixture onto the tinfoil. Spread out evenly across the baking sheet. Let the candied cacao cool at room temperature until it has hardened. Then you can break into bits and enjoy! Including Cacao Nibs in Your Breakfast Try adding them to pancakes. Once you have created the batter for your pancakes, stir in 1 tablespoon of cacao nibs. This will give a rich flavor of unsweetened chocolate that will come to life when combined with syrup. You can also sprinkle a few additional nibs onto the pancakes before serving, if you desire. Include cacao nibs in granola. Eating a bowl of granola mixed with yogurt and berries is a great and healthy way to start off the day. Simply add ½ cup (118 ml) of cacao nibs to the dry ingredients of your homemade granola. With 100% natural ingredients you can create a delicious granola using cacao nibs to give a creamy chocolaty flavor, without any added sugars. Make a cacao nib breakfast smoothie. Smoothies are a fast and easy way to start the day and you can easily incorporate cacao nibs into your favorite recipe. Simply add 2 tablespoons of cacao nibs to the blender and mix with your favorite smoothie ingredients. For a delicious combination of flavors try blending: 2 tablespoons of cacao nibs, 1 frozen banana (peeled), ½ cup (118 ml) of coffee (brewed and cooled), 4 tablespoons of coconut milk, 1 ½ tablespoons of agave, and a handful of ice. Using Cacao Nibs in Savoury Meals Pair cacao nibs with grilled meats. Cacao nibs can also be paired with savoury meals, such as meats. You can try crushing cacao nibs and then mixing them with other spices, such as pepper, salt, garlic powder, and paprika to create a steak rub. Try adding cacao nibs to salad. Cacao nibs can add depth and flavour to your salad. Using a base of mixed greens or arugula, create a salad by adding cacao nibs, pomegranate seeds, goats cheese, fennel, and olives. Top the salad with a simple vinaigrette. Make a pesto using cacao nibs. Pesto is a delicious spread that can be put onto a nice piece of bread or crostini and served as an appetizer. Create a cacao nib pesto by combining crushed cacao nibs with olive oil, crushed olives, and a few chopped basil leaves.",
  "tyn_model":[
    "cacao nibs",
    "nuts",
    "granola",
    "ice cream",
    "baked goods",
    "chocolate",
    "berries",
    "baking sheet",
    "tinfoil",
    "cacao",
    "cacao nib",
    "olives",
    "chocolate chip cookies",
    "banana nut muffins",
    "chocolate chips",
    "granulated sugar",
    "water",
    "corn syrup",
    "small saucepan",
    "saucepan",
    "stove",
    "sugar",
    "thermometer",
    "pan",
    "unsalted butter",
    "yogurt",
    "blender",
    "banana",
    "coffee",
    "coconut milk",
    "agave",
    "ice",
    "spices",
    "pepper",
    "salt",
    "garlic powder",
    "paprika",
    "arugula",
    "pomegranate seeds",
    "goats cheese",
    "fennel",
    "pesto",
    "olive oil",
    "basil"
  ],
  "tyn_section":[

  ]
}