{
  "title":"How to Clean a Bathroom Sink Drain",
  "url":"https://www.wikihow.com/Clean-a-Bathroom-Sink-Drain",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Cleaning the Drain Regularly",
      "steps":[
        {
          "headline":"Remove debris from the drain weekly.",
          "description":"To prevent buildups, remove any pop-up stoppers or drain guards on your sink and discard the debris that they’ve collected. Rinse them before replacing them. Most bathroom sinks feature an adjustable metal stopper than can be used to plug the sink. These can be removed by pulling them out of the drain. If your sink stopper is used by pushing and pulling a rod behind the faucet or is otherwise attached, remove the nut on the back of the drain pipe, pull out the retaining rod, then remove the stopper. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tClean your drain once a week whether it's removeable or not. Chris Willatt, owner of Alpine Maids, says: \"Once a week, clean all the hair out of the drain. If your drain is removeable, you can put it in the dishwasher to get it really clean, then use a scrub brush or a magic eraser to get the buildup off the bottom. If it's not a removeable drain, scrub it thoroughly with a brush.\""
        },
        {
          "headline":"Use a non-corrosive drain cleaner when necessary.",
          "description":"Your bathroom sink collects bacteria that can contribute to unwanted scents and deposits within the drain. To kill this bacteria, use a biodegradable, non-corrosive pipe-cleaner once a month. Hydrogen peroxide is a great option that can be poured directly down the drain. Note that many well-advertised drain cleaners are full of chemicals that pose a risk to both your health and your pipes. Follow the directions on any natural, store-bought cleaning products. Bleach and antibacterial products are not recommended. They are unnecessary and can potentially damage plumbing systems. This is especially important if you have a septic tank."
        },
        {
          "headline":"Clean your drain monthly with household products.",
          "description":"Instead of a packaged drain cleaner, use salt, baking soda, vinegar, and/or lemon juice to deodorize and clean your sink. Mix whichever of these you have on hand into about a cup of solution and pour it into the drain. Let it sit for an hour before flushing hot water down the drain."
        }
      ]
    },
    {
      "name":"Unclogging a Bathroom Sink",
      "steps":[
        {
          "headline":"Pour boiling water down the drain.",
          "description":"To remove stubborn buildups, start by boiling about ½ gallon (roughly 2 liters) of water and carefully pouring it down the drain. High temperature water will begin to break apart and dislodge the blockage."
        },
        {
          "headline":"Plunge the drain.",
          "description":"Encourage the buildup to proceed down the drain by plunging the drain 5 or 6 times. While this may not fully remove the buildup, it will help loosen it further. Use a plunger that can create an airtight seal over the opening of the drain."
        },
        {
          "headline":"Put baking soda in the drain.",
          "description":"Slowly pour about 1 cup (220 grams) of baking soda into drain. Allow the baking soda to sit for a few minutes. Not only will the baking soda absorb unpleasant odors, it will help physically break apart the buildup."
        },
        {
          "headline":"Add vinegar.",
          "description":"Pour 1 cup (240 ml) of distilled white vinegar into the drain after waiting a few minutes. The baking soda and vinegar will react with one another and begin to foam. Cover the drain, as this will encourage the baking soda and vinegar mixture to work it’s way into the clogged portion of the drain and break down the remaining blockage. Allow the mixture to sit in the drain for an hour or so. Vinegar is also a natural deodorizer. Together, this mixture will also help remove any odor the deposit caused. Cider vinegar or lemon juice will work in lieu of white vinegar. After allowing the mixture to sit, rinse again with hot water. Repeat the process to eliminate residual odors."
        },
        {
          "headline":"Snake the drain.",
          "description":"Stubborn deposits may require more physical disruption. Get a drain snake from your local hardware store. These are essentially long, thin strips of plastic with hooks on either side. Use it to break up and push or pull away any deposits that have clogged your drain. Keep inserting and removing the snake until no hair or clumps are attached to it when you pull it out. Alternatively, you can bend a metal coat hanger so it has a hook at 1 end and use that. If it gets stuck, pull it out with a pair of needle-nose pliers. Follow this with a baking soda and vinegar soak to remove unpleasant odors."
        }
      ]
    },
    {
      "name":"Keeping Your Drain in Good Condition",
      "steps":[
        {
          "headline":"Keep trash out of the sink drain.",
          "description":"Perhaps the most important part of keeping your drain clean is being mindful of what you put in it. This is especially true for bathroom sink drains, which will inevitably accumulate natural detritus, such as hair. As a rule of thumb, if you’re unsure whether it’s okay to go down the drain, throw it away instead. Avoid washing dishes or disposing of any food products in the bathroom sink. Don’t dispose of personal care products, such as cotton balls, dental floss, or bits of toilet paper in the sink drain. Take care not to let the small round liner underneath the lid of personal care products go down the drain."
        },
        {
          "headline":"Use less soap and other products.",
          "description":"Even soap and other things that you regularly dispose of in your bathroom sink, such as toothpaste and shaving cream, can contribute to build up in your drain. As such, get in the habit of using smaller amounts of these products. A small dollop of toothpaste is plenty, and a single pump of hand soap is sufficient to wash your hands. Let the water run down the drain for a few seconds after using soap or toothpaste so it gets flushed away."
        },
        {
          "headline":"Avoid commercial drain cleaners.",
          "description":"There are a lot of reasons not to use commercial drain cleaners that rely on chemicals. They can corrode your pipes and damage other components of your fixtures and plumbing system. They are also toxic, and can work their way into the ground water in your area."
        }
      ]
    }
  ],
  "text":" Cleaning the Drain Regularly Remove debris from the drain weekly. To prevent buildups, remove any pop-up stoppers or drain guards on your sink and discard the debris that they’ve collected. Rinse them before replacing them. Most bathroom sinks feature an adjustable metal stopper than can be used to plug the sink. These can be removed by pulling them out of the drain. If your sink stopper is used by pushing and pulling a rod behind the faucet or is otherwise attached, remove the nut on the back of the drain pipe, pull out the retaining rod, then remove the stopper. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tClean your drain once a week whether it's removeable or not. Chris Willatt, owner of Alpine Maids, says: \"Once a week, clean all the hair out of the drain. If your drain is removeable, you can put it in the dishwasher to get it really clean, then use a scrub brush or a magic eraser to get the buildup off the bottom. If it's not a removeable drain, scrub it thoroughly with a brush.\" Use a non-corrosive drain cleaner when necessary. Your bathroom sink collects bacteria that can contribute to unwanted scents and deposits within the drain. To kill this bacteria, use a biodegradable, non-corrosive pipe-cleaner once a month. Hydrogen peroxide is a great option that can be poured directly down the drain. Note that many well-advertised drain cleaners are full of chemicals that pose a risk to both your health and your pipes. Follow the directions on any natural, store-bought cleaning products. Bleach and antibacterial products are not recommended. They are unnecessary and can potentially damage plumbing systems. This is especially important if you have a septic tank. Clean your drain monthly with household products. Instead of a packaged drain cleaner, use salt, baking soda, vinegar, and/or lemon juice to deodorize and clean your sink. Mix whichever of these you have on hand into about a cup of solution and pour it into the drain. Let it sit for an hour before flushing hot water down the drain. Unclogging a Bathroom Sink Pour boiling water down the drain. To remove stubborn buildups, start by boiling about ½ gallon (roughly 2 liters) of water and carefully pouring it down the drain. High temperature water will begin to break apart and dislodge the blockage. Plunge the drain. Encourage the buildup to proceed down the drain by plunging the drain 5 or 6 times. While this may not fully remove the buildup, it will help loosen it further. Use a plunger that can create an airtight seal over the opening of the drain. Put baking soda in the drain. Slowly pour about 1 cup (220 grams) of baking soda into drain. Allow the baking soda to sit for a few minutes. Not only will the baking soda absorb unpleasant odors, it will help physically break apart the buildup. Add vinegar. Pour 1 cup (240 ml) of distilled white vinegar into the drain after waiting a few minutes. The baking soda and vinegar will react with one another and begin to foam. Cover the drain, as this will encourage the baking soda and vinegar mixture to work it’s way into the clogged portion of the drain and break down the remaining blockage. Allow the mixture to sit in the drain for an hour or so. Vinegar is also a natural deodorizer. Together, this mixture will also help remove any odor the deposit caused. Cider vinegar or lemon juice will work in lieu of white vinegar. After allowing the mixture to sit, rinse again with hot water. Repeat the process to eliminate residual odors. Snake the drain. Stubborn deposits may require more physical disruption. Get a drain snake from your local hardware store. These are essentially long, thin strips of plastic with hooks on either side. Use it to break up and push or pull away any deposits that have clogged your drain. Keep inserting and removing the snake until no hair or clumps are attached to it when you pull it out. Alternatively, you can bend a metal coat hanger so it has a hook at 1 end and use that. If it gets stuck, pull it out with a pair of needle-nose pliers. Follow this with a baking soda and vinegar soak to remove unpleasant odors. Keeping Your Drain in Good Condition Keep trash out of the sink drain. Perhaps the most important part of keeping your drain clean is being mindful of what you put in it. This is especially true for bathroom sink drains, which will inevitably accumulate natural detritus, such as hair. As a rule of thumb, if you’re unsure whether it’s okay to go down the drain, throw it away instead. Avoid washing dishes or disposing of any food products in the bathroom sink. Don’t dispose of personal care products, such as cotton balls, dental floss, or bits of toilet paper in the sink drain. Take care not to let the small round liner underneath the lid of personal care products go down the drain. Use less soap and other products. Even soap and other things that you regularly dispose of in your bathroom sink, such as toothpaste and shaving cream, can contribute to build up in your drain. As such, get in the habit of using smaller amounts of these products. A small dollop of toothpaste is plenty, and a single pump of hand soap is sufficient to wash your hands. Let the water run down the drain for a few seconds after using soap or toothpaste so it gets flushed away. Avoid commercial drain cleaners. There are a lot of reasons not to use commercial drain cleaners that rely on chemicals. They can corrode your pipes and damage other components of your fixtures and plumbing system. They are also toxic, and can work their way into the ground water in your area.",
  "tyn_model":[
    "baking soda",
    "vinegar",
    "water",
    "drain cleaners",
    "soap",
    "toothpaste",
    "stopper",
    "drain cleaner",
    "lemon juice",
    "sink stopper",
    "drain pipe",
    "alpine maids,",
    "alpine maids has",
    "alpine maids",
    "scrub brush",
    "magic eraser",
    "pipe-cleaner",
    "hydrogen peroxide",
    "bleach",
    "salt",
    "plunger",
    "distilled white vinegar",
    "cider vinegar",
    "white vinegar",
    "hot water",
    "drain snake",
    "needle-nose pliers",
    "dental floss",
    "toilet paper",
    "personal care products",
    "shaving cream",
    "hand soap"
  ],
  "tyn_section":[

  ]
}