{
  "title":"How to Make Puff Pancakes",
  "url":"https://www.wikihow.com/Make-Puff-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "methods":[
    {
      "name":"Making Sweet Puff Pancakes",
      "steps":[
        {
          "headline":"Preheat your oven to 400°F (205°C).",
          "description":"Add the butter into a cast-iron skillet and place it into the oven. The butter will melt as the oven heats up. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/8\\/8c\\/Make-Puff-Pancakes-Step-1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/8\\/8c\\/Make-Puff-Pancakes-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":760,\"bigHeight\":508,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Mix the eggs and milk together.",
          "description":"Heat the milk in the microwave for 20 to 30 seconds first, then pour it into a large mixing bowl. Whisk the eggs into the milk until the mixture is pale yellow and no streaks remain. This will take about 1 minute."
        },
        {
          "headline":"Beat in the flour, sugar, vanilla extract, and salt.",
          "description":"Keep beating until most of the lumps are gone, about 30 more seconds. The mixture will still be a little lumpy, which is fine. If you aren't a fan of vanilla, reduce the amount to ½ teaspoon. Add ½ teaspoon of ground cinnamon into the batter for extra flavor!"
        },
        {
          "headline":"Swirl the butter in the pan.",
          "description":"Using an oven mitt, take the skillet out of the oven. Swirl it around to distribute the melted butter across the bottom. This will grease the man and make the pancake easier to serve."
        },
        {
          "headline":"Stir the melted butter into the batter.",
          "description":"Once the pan is coated, pour the rest of the melted butter into the batter. Set the skillet aside and beat the batter well."
        },
        {
          "headline":"Pour the batter into the skillet.",
          "description":"Tilt the skillet around so that the batter coats the bottom evenly."
        },
        {
          "headline":"Bake the pancake for 20 to 25 minutes.",
          "description":"It is ready when it turns puffy in the middle and golden-brown around the sides."
        },
        {
          "headline":"Prepare the blueberry topping while the pancake bakes.",
          "description":"Place the blue berries into a bowl. Add the sugar and lemon zest. Stir the mixture until the blueberries are evenly coated, then set the bowl aside. By the time the pancake is done baking, the blueberries will be ready. Don't like blueberries? Mix together 1 pound (450 grams) of sliced strawberries and 2 tablespoons (15 grams) of powdered sugar instead. Don't like any berries? You can skip this step and serve the pancake with powdered sugar or whipped cream in the end."
        },
        {
          "headline":"Allow the pancake to cool for a few minutes on a wire cooling rack.",
          "description":"Using an oven mitt, take the skillet out of the oven and set it down onto a heat-safe surface. Slide a spatula under the pancake and transfer it onto a wire cooling rack. Let the pancake cool for a few minutes. This will allow the steam to escape. If you let the pancake cool in the pan, the steam will get trapped under the pancake and make it soggy."
        },
        {
          "headline":"Cut the pancake into wedges before serving it.",
          "description":"Once the pancake has cooled enough to touch, transfer it to a cutting board. Cut it into four wedges, then place each wedge onto a plate. For an added touch, sprinkle the wedges with some powdered sugar. Serve the blueberries (or strawberries) on top or next to the pancake."
        }
      ]
    },
    {
      "name":"Making Savory Puff Pancakes",
      "steps":[
        {
          "headline":"Preheat your oven to 425°F (219°C).",
          "description":"Move the rack to the second lowest position. Place the butter into an 8-inch (20.32-centimeter) baking dish, then place the dish into the oven. The butter will melt as the oven heats up."
        },
        {
          "headline":"Beat the milk and eggs together.",
          "description":"Heat the milk up in the microwave for 20 to 30 seconds first. Pour it into a mixing bowl and add the eggs. Whisk the two together until the mixture turns a pale yellow color and no streaks remain."
        },
        {
          "headline":"Whisk in the dry ingredients.",
          "description":"Add in the flour, salt, pepper, garlic powder, and onion powder. Whisk everything together until most of the lumps are gone. Hold off on the cheese and scallions for right now."
        },
        {
          "headline":"Swirl the butter in the baking dish.",
          "description":"Once the butter has melted, take the baking dish out of the oven using an oven mitt. Swirl the butter across the bottom and sides of the dish. This will grease the dish and make the pancake easier to serve later on."
        },
        {
          "headline":"Stir the butter into the batter.",
          "description":"Once you have the dish greased, pour the rest of the butter into the batter. Stir it in well with a whisk."
        },
        {
          "headline":"Pour the batter into the baking dish.",
          "description":"Make sure that it is evenly spread across the bottom of the baking dish. Use a rubber spatula to scrape the bowl clean so that you don't waste any batter."
        },
        {
          "headline":"Top the pancake with shredded cheese.",
          "description":"This will give the pancake a tasty, crunchy layer on top. Don't add the scallions just yet, however!"
        },
        {
          "headline":"Bake the pancake for 20 to 23 minutes.",
          "description":"It is ready when the edges turn puffy and the cheese becomes bubbly."
        },
        {
          "headline":"Transfer the pancake to a wire cooling rack.",
          "description":"Once the pancake is done baking, take the baking dish out of the oven using an oven mitt and set it down onto a heat-safe surface. Use a spatula to take the pancake out of the baking dish and set it down onto a wire cooling rack. Let it cool for a few minutes."
        },
        {
          "headline":"Cut the pancake into wedges and garnish it before serving.",
          "description":"Cut the pancake into four wedges first. Place each wedge onto a plate, then garnish them with the chopped scallions. Serve the pancakes immediately."
        }
      ]
    }
  ],
  "text":" Making Sweet Puff Pancakes Preheat your oven to 400°F (205°C). Add the butter into a cast-iron skillet and place it into the oven. The butter will melt as the oven heats up. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/8\\/8c\\/Make-Puff-Pancakes-Step-1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/8\\/8c\\/Make-Puff-Pancakes-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":760,\"bigHeight\":508,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Mix the eggs and milk together. Heat the milk in the microwave for 20 to 30 seconds first, then pour it into a large mixing bowl. Whisk the eggs into the milk until the mixture is pale yellow and no streaks remain. This will take about 1 minute. Beat in the flour, sugar, vanilla extract, and salt. Keep beating until most of the lumps are gone, about 30 more seconds. The mixture will still be a little lumpy, which is fine. If you aren't a fan of vanilla, reduce the amount to ½ teaspoon. Add ½ teaspoon of ground cinnamon into the batter for extra flavor! Swirl the butter in the pan. Using an oven mitt, take the skillet out of the oven. Swirl it around to distribute the melted butter across the bottom. This will grease the man and make the pancake easier to serve. Stir the melted butter into the batter. Once the pan is coated, pour the rest of the melted butter into the batter. Set the skillet aside and beat the batter well. Pour the batter into the skillet. Tilt the skillet around so that the batter coats the bottom evenly. Bake the pancake for 20 to 25 minutes. It is ready when it turns puffy in the middle and golden-brown around the sides. Prepare the blueberry topping while the pancake bakes. Place the blue berries into a bowl. Add the sugar and lemon zest. Stir the mixture until the blueberries are evenly coated, then set the bowl aside. By the time the pancake is done baking, the blueberries will be ready. Don't like blueberries? Mix together 1 pound (450 grams) of sliced strawberries and 2 tablespoons (15 grams) of powdered sugar instead. Don't like any berries? You can skip this step and serve the pancake with powdered sugar or whipped cream in the end. Allow the pancake to cool for a few minutes on a wire cooling rack. Using an oven mitt, take the skillet out of the oven and set it down onto a heat-safe surface. Slide a spatula under the pancake and transfer it onto a wire cooling rack. Let the pancake cool for a few minutes. This will allow the steam to escape. If you let the pancake cool in the pan, the steam will get trapped under the pancake and make it soggy. Cut the pancake into wedges before serving it. Once the pancake has cooled enough to touch, transfer it to a cutting board. Cut it into four wedges, then place each wedge onto a plate. For an added touch, sprinkle the wedges with some powdered sugar. Serve the blueberries (or strawberries) on top or next to the pancake. Making Savory Puff Pancakes Preheat your oven to 425°F (219°C). Move the rack to the second lowest position. Place the butter into an 8-inch (20.32-centimeter) baking dish, then place the dish into the oven. The butter will melt as the oven heats up. Beat the milk and eggs together. Heat the milk up in the microwave for 20 to 30 seconds first. Pour it into a mixing bowl and add the eggs. Whisk the two together until the mixture turns a pale yellow color and no streaks remain. Whisk in the dry ingredients. Add in the flour, salt, pepper, garlic powder, and onion powder. Whisk everything together until most of the lumps are gone. Hold off on the cheese and scallions for right now. Swirl the butter in the baking dish. Once the butter has melted, take the baking dish out of the oven using an oven mitt. Swirl the butter across the bottom and sides of the dish. This will grease the dish and make the pancake easier to serve later on. Stir the butter into the batter. Once you have the dish greased, pour the rest of the butter into the batter. Stir it in well with a whisk. Pour the batter into the baking dish. Make sure that it is evenly spread across the bottom of the baking dish. Use a rubber spatula to scrape the bowl clean so that you don't waste any batter. Top the pancake with shredded cheese. This will give the pancake a tasty, crunchy layer on top. Don't add the scallions just yet, however! Bake the pancake for 20 to 23 minutes. It is ready when the edges turn puffy and the cheese becomes bubbly. Transfer the pancake to a wire cooling rack. Once the pancake is done baking, take the baking dish out of the oven using an oven mitt and set it down onto a heat-safe surface. Use a spatula to take the pancake out of the baking dish and set it down onto a wire cooling rack. Let it cool for a few minutes. Cut the pancake into wedges and garnish it before serving. Cut the pancake into four wedges first. Place each wedge onto a plate, then garnish them with the chopped scallions. Serve the pancakes immediately.",
  "tyn_model":[
    "butter",
    "oven",
    "baking dish",
    "milk",
    "skillet",
    "eggs",
    "oven mitt",
    "blueberries",
    "bowl",
    "powdered sugar",
    "scallions",
    "flour",
    "sugar",
    "salt",
    "strawberries",
    "spatula",
    "plate",
    "cheese",
    "sweet puff pancakes",
    "cast-iron skillet",
    "large mixing bowl",
    "vanilla extract",
    "vanilla",
    "ground cinnamon",
    "blueberry topping",
    "blue berries",
    "lemon",
    "berries",
    "whipped cream",
    "cutting board",
    "microwave",
    "mixing bowl",
    "pepper",
    "garlic powder",
    "onion powder",
    "whisk",
    "rubber spatula"
  ],
  "tyn_section":[

  ]
}