{
  "title":"How to Make a Peanut Butter Mug Cake",
  "url":"https://www.wikihow.com/Make-a-Peanut-Butter-Mug-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "methods":[
    {
      "name":"Basic Peanut Butter Mug Cake",
      "steps":[
        {
          "headline":"Stir the flour, sugar, baking powder, and egg in a mug.",
          "description":"Use a mixing utensil such as a whisk or a fork to beat the ingredients together."
        },
        {
          "headline":"Add the peanut butter, milk, and vegetable oil.",
          "description":"Combine once more and mix until the ingredients are fully incorporated and the batter is smooth."
        },
        {
          "headline":"Microwave the batter for about a minute or two.",
          "description":"Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed."
        },
        {
          "headline":"Remove the mug cake from the microwave and allow it to cool.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Add chocolate chips, mini cookies, chocolate or caramel syrup, whipped cream, jelly, nuts, and/or coconut flakes. Enjoy!"
        }
      ]
    },
    {
      "name":"Chocolate Peanut Butter Mug Cake",
      "steps":[
        {
          "headline":"Stir the dry ingredients in a mug.",
          "description":"Combine the flour, sugar, cocoa powder, baking powder, and salt until properly combined."
        },
        {
          "headline":"Fold in the peanut butter, milk, and vegetable oil.",
          "description":"Mix once more with a utensil such as a whisk or a fork. Beat until the batter is smooth."
        },
        {
          "headline":"Microwave the batter for about a minute or so.",
          "description":"Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed."
        },
        {
          "headline":"Remove the mug cake from the microwave and allow it to cool.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Add chocolate chips, mini cookies, chocolate or caramel syrup, whipped cream, jelly, nuts, and/or coconut flakes. Enjoy!"
        }
      ]
    },
    {
      "name":"3 Ingredient Peanut Butter Mug Cake",
      "steps":[
        {
          "headline":"Mix the peanut butter, sugar, and egg in a mug.",
          "description":"Use a mixing utensil such as a whisk or a fork to beat the ingredients together."
        },
        {
          "headline":"Microwave the batter for about a minute or so.",
          "description":"Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed."
        },
        {
          "headline":"Remove the mug cake from the microwave and allow it to cool.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Add chocolate chips, mini cookies, chocolate or caramel syrup, whipped cream, jelly, nuts, and/or coconut flakes. Enjoy!"
        }
      ]
    },
    {
      "name":"Vegan Peanut Butter Mug Cake",
      "steps":[
        {
          "headline":"Combine all the ingredients in a mug.",
          "description":"Use a mixing utensil such as a whisk or a fork to beat the ingredients together."
        },
        {
          "headline":"Microwave the batter for about a minute or so.",
          "description":"Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed."
        },
        {
          "headline":"Remove the mug cake from the microwave and allow it to cool.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Add chocolate chips, chocolate or caramel syrup, coconut cream, jelly, nuts, and/or coconut flakes. Enjoy!"
        }
      ]
    }
  ],
  "text":" Basic Peanut Butter Mug Cake Stir the flour, sugar, baking powder, and egg in a mug. Use a mixing utensil such as a whisk or a fork to beat the ingredients together. Add the peanut butter, milk, and vegetable oil. Combine once more and mix until the ingredients are fully incorporated and the batter is smooth. Microwave the batter for about a minute or two. Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed. Remove the mug cake from the microwave and allow it to cool.  Serve. Add chocolate chips, mini cookies, chocolate or caramel syrup, whipped cream, jelly, nuts, and/or coconut flakes. Enjoy! Chocolate Peanut Butter Mug Cake Stir the dry ingredients in a mug. Combine the flour, sugar, cocoa powder, baking powder, and salt until properly combined. Fold in the peanut butter, milk, and vegetable oil. Mix once more with a utensil such as a whisk or a fork. Beat until the batter is smooth. Microwave the batter for about a minute or so. Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed. Remove the mug cake from the microwave and allow it to cool.  Serve. Add chocolate chips, mini cookies, chocolate or caramel syrup, whipped cream, jelly, nuts, and/or coconut flakes. Enjoy! 3 Ingredient Peanut Butter Mug Cake Mix the peanut butter, sugar, and egg in a mug. Use a mixing utensil such as a whisk or a fork to beat the ingredients together. Microwave the batter for about a minute or so. Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed. Remove the mug cake from the microwave and allow it to cool.  Serve. Add chocolate chips, mini cookies, chocolate or caramel syrup, whipped cream, jelly, nuts, and/or coconut flakes. Enjoy! Vegan Peanut Butter Mug Cake Combine all the ingredients in a mug. Use a mixing utensil such as a whisk or a fork to beat the ingredients together. Microwave the batter for about a minute or so. Depending on your microwave and microwave setting, the mug cake may take a longer or shorter period of time to fully cook. To avoid over-cooking the cake, check the mug cake every thirty seconds to see if it's done by poking a toothpick in the middle of it. If the toothpick comes out dry, the mug cake is ready to be removed. Remove the mug cake from the microwave and allow it to cool.  Serve. Add chocolate chips, chocolate or caramel syrup, coconut cream, jelly, nuts, and/or coconut flakes. Enjoy!",
  "tyn_model":[
    "microwave",
    "mug cake",
    "mug",
    "whisk",
    "chocolate chips",
    "chocolate or caramel syrup",
    "nuts",
    "coconut flakes",
    "sugar",
    "peanut butter",
    "whipped cream",
    "jelly",
    "fork",
    "peanut butter mug cake",
    "flour",
    "baking powder",
    "mixing utensil",
    "milk",
    "vegetable oil",
    "chocolate peanut butter mug",
    "cocoa powder",
    "salt",
    "peanut butter mug",
    "coconut cream"
  ],
  "tyn_section":[

  ]
}