{
  "title":"How to Prevent Mozzarella from Getting Watery",
  "url":"https://www.wikihow.com/Prevent-Mozzarella-from-Getting-Watery",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "methods":[
    {
      "name":"Removing Moisture from Mozzarella",
      "steps":[
        {
          "headline":"Soak up moisture with paper towels.",
          "description":"Place three unfolded kitchen towels on the countertop. Put your mozzarella on top of the towels. Place an additional three kitchen towels on top of the cheese. Use gentle pressure to press the moisture out of the mozzarella. Repeat until you have removed the desired amount of moisture."
        },
        {
          "headline":"Strain fresh mozzarella.",
          "description":"If you decide to use fresh mozzarella, you can remove some of the moisture by straining it. Slice or tear the mozzarella into pieces. Put the pieces of mozzarella into a strainer or sieve. Place the strainer over a sink or bowl that can catch the moisture. Strain for at least 30 minutes."
        },
        {
          "headline":"Freeze the mozzarella.",
          "description":"You can remove moisture from mozzarella by freezing it. If you are freezing fresh mozzarella that is packaged with liquid, remove the original packaging and wrap it in plastic. Freeze the cheese for 10 days, and then thaw in a strainer or on towels to absorb the moisture."
        }
      ]
    },
    {
      "name":"Cooking with Mozzarella",
      "steps":[
        {
          "headline":"Go easy on the cheese.",
          "description":"If you use too much mozzarella while cooking, you could end up with a soggy mess. This is especially true if you are baking mozzarella on bread or crust, like when you make a pizza. Instead of loading up on cheese, try a smaller amount than you might be tempted to use."
        },
        {
          "headline":"Mix the mozzarella with another cheese.",
          "description":"One way to avoid watery mozzarella is to mix it with another cheese while cooking. For example, if you are baking a pizza, you can mix mozzarella with a harder cheese like parmesan. This will result in a less watery layer of cheese than if you use only mozzarella."
        },
        {
          "headline":"Bake pizza dough first.",
          "description":"If you are making a pizza, you can prevent your mozzarella from getting too watery by baking the crust for a few minutes before adding the mozzarella. Try placing the sauce on your crust and baking the crust and sauce for about 5 minutes. Then remove the pizza from the oven and add the cheese. Finish baking the pizza."
        }
      ]
    },
    {
      "name":"Using Different Types of Mozzarella",
      "steps":[
        {
          "headline":"Try using low-moisture mozzarella.",
          "description":"If you are using mozzarella in a dish that needs to be cooked, such as a pizza, you can opt for a low moisture variety of mozzarella. Low moisture mozzarella is generally dry to the touch, and should exude less moisture as it is cooked. You can find it next to other varieties of mozzarella at your local grocery. Low-moisture mozzarella can be purchased already shredded or in a block."
        },
        {
          "headline":"Consider a low-fat mozzarella.",
          "description":"Low-fat mozzarella will exude less oil than a full-fat variety. If you are cooking with mozzarella, a low-fat variety can be less watery than full-fat mozzarella. This can be a good choice in dishes like pizza and lasagna where watery mozzarella can be problematic. Keep in mind that low-fat mozzarella might not melt as well as a full-fat variety."
        },
        {
          "headline":"Avoid buffalo mozzarella.",
          "description":"Traditional buffalo mozzarella, also known as mozzarella di bufala, is an Italian cheese made with buffalo milk. This variety of mozzarella has a high water and fat content, which contributes to its watery texture. When cooked, this variety becomes quite watery."
        }
      ]
    }
  ],
  "text":" Removing Moisture from Mozzarella Soak up moisture with paper towels. Place three unfolded kitchen towels on the countertop. Put your mozzarella on top of the towels. Place an additional three kitchen towels on top of the cheese. Use gentle pressure to press the moisture out of the mozzarella. Repeat until you have removed the desired amount of moisture. Strain fresh mozzarella. If you decide to use fresh mozzarella, you can remove some of the moisture by straining it. Slice or tear the mozzarella into pieces. Put the pieces of mozzarella into a strainer or sieve. Place the strainer over a sink or bowl that can catch the moisture. Strain for at least 30 minutes. Freeze the mozzarella. You can remove moisture from mozzarella by freezing it. If you are freezing fresh mozzarella that is packaged with liquid, remove the original packaging and wrap it in plastic. Freeze the cheese for 10 days, and then thaw in a strainer or on towels to absorb the moisture. Cooking with Mozzarella Go easy on the cheese. If you use too much mozzarella while cooking, you could end up with a soggy mess. This is especially true if you are baking mozzarella on bread or crust, like when you make a pizza. Instead of loading up on cheese, try a smaller amount than you might be tempted to use. Mix the mozzarella with another cheese. One way to avoid watery mozzarella is to mix it with another cheese while cooking. For example, if you are baking a pizza, you can mix mozzarella with a harder cheese like parmesan. This will result in a less watery layer of cheese than if you use only mozzarella. Bake pizza dough first. If you are making a pizza, you can prevent your mozzarella from getting too watery by baking the crust for a few minutes before adding the mozzarella. Try placing the sauce on your crust and baking the crust and sauce for about 5 minutes. Then remove the pizza from the oven and add the cheese. Finish baking the pizza. Using Different Types of Mozzarella Try using low-moisture mozzarella. If you are using mozzarella in a dish that needs to be cooked, such as a pizza, you can opt for a low moisture variety of mozzarella. Low moisture mozzarella is generally dry to the touch, and should exude less moisture as it is cooked. You can find it next to other varieties of mozzarella at your local grocery. Low-moisture mozzarella can be purchased already shredded or in a block. Consider a low-fat mozzarella. Low-fat mozzarella will exude less oil than a full-fat variety. If you are cooking with mozzarella, a low-fat variety can be less watery than full-fat mozzarella. This can be a good choice in dishes like pizza and lasagna where watery mozzarella can be problematic. Keep in mind that low-fat mozzarella might not melt as well as a full-fat variety. Avoid buffalo mozzarella. Traditional buffalo mozzarella, also known as mozzarella di bufala, is an Italian cheese made with buffalo milk. This variety of mozzarella has a high water and fat content, which contributes to its watery texture. When cooked, this variety becomes quite watery.",
  "tyn_model":[
    "mozzarella",
    "strainer",
    "kitchen towels",
    "cheese",
    "paper towels",
    "sieve",
    "parmesan",
    "oven",
    "low-fat",
    "low-fat mozzarella",
    "buffalo milk"
  ],
  "tyn_section":[

  ]
}