{
  "title":"How to Make Pasta with Alfredo Sauce from a Jar",
  "url":"https://www.wikihow.com/Make-Pasta-with-Alfredo-Sauce-from-a-Jar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Pasta Sauce Recipes"
  ],
  "parts":[
    {
      "name":"Cooking the Pasta",
      "steps":[
        {
          "headline":"Decide how much pasta you need.",
          "description":"The average serving size is 2 ounces of pasta per person. That's about half a handful of dried fettuccine noodles, or half a cup of dried macaroni. Decide how much pasta you want to cook and measure it out from the box. If you find it easier to cook the whole box, that's fine, too. You can always eat leftovers later. The type of pasta you choose is completely up to you. Fettuccine noodles, which are like wide, flat spaghetti noodles, are commonly paired with Alfredo sauce. However, any type of pasta will taste great, so feel free to use whatever you have on hand."
        },
        {
          "headline":"Fill a tall pot with water and bring it to a boil over high heat.",
          "description":"When it comes to making pasta, it doesn't matter how much water you use; you just need enough to submerge the pasta. Err on the safe side and fill the pot about 3/4 full to make sure you have enough. You want it to come to a full, rolling boil before you add the pasta. If you want, you can salt the water to help flavor the pasta. Add a few shakes of salt from your salt shaker. You can also add salt later, after the pasta has cooked, or just enjoy the saltiness of the Alfredo sauce."
        },
        {
          "headline":"Add the pasta to the boiling water.",
          "description":"Drop the dried pasta into the water, and it will immediately begin cooking."
        },
        {
          "headline":"Cook the pasta for the amount of time indicated on the package.",
          "description":"Different types of pasta require different cooking times. In general, it should take eight to ten minutes to finish cooking your pasta. Most people enjoy their pasta \"al dente,\" which means it still has a bit of bite to it, rather than being completely mushy. You can check to see if the pasta is ready by using a fork to pull out a piece and tasting it. If you like the texture, remove it from heat. Or smack a piece of pasta against the wall or another surface. If it sticks, it's ready."
        },
        {
          "headline":"Remove the pasta from heat.",
          "description":"Turn off the heat and place the pasta on a different burner so it stops cooking."
        }
      ]
    },
    {
      "name":"Mixing the Pasta and Sauce",
      "steps":[
        {
          "headline":"Figure out how much Alfredo sauce to use.",
          "description":"You'll need the same number of sauce servings as pasta servings. For example, if you made enough pasta for two people, heat enough sauce for two people. Check the nutrition label on the sauce jar to find out how much sauce is in one serving; it should be about 1/4 to 1/2 cup per person."
        },
        {
          "headline":"Pour the sauce into a medium pan or pot.",
          "description":"The pot you use needs to be large enough to fit both the Alfredo sauce and the pasta, so choose accordingly."
        },
        {
          "headline":"Heat the sauce over medium heat.",
          "description":"Place the pan on a burner, turn the burner to medium, and let the sauce begin to heat. Stir it occasionally using a spatula or spoon to keep it from scorching on the bottom. It should take about five minutes to heat. Taste the sauce to see if it's hot before going to the next step."
        },
        {
          "headline":"Add the pasta to the sauce.",
          "description":"Lift the pasta from the pasta pot to the Alfredo pan to mix them together. You can use tongs or a pronged pasta spoon to do the job. Keep going until all of the pasta has been moved from the pot to the pan with the sauce."
        },
        {
          "headline":"Stir it together and cook for three more minutes.",
          "description":"This will give the pasta and the sauce time to combine and take on a nice texture. After three minutes are up, remove the pan from heat."
        }
      ]
    },
    {
      "name":"Serving the Pasta",
      "steps":[
        {
          "headline":"Scoop the pasta and sauce onto a plate.",
          "description":"You could also pour it into a bowl and have everyone serve themselves."
        },
        {
          "headline":"Add toppings if desired.",
          "description":"Grated parmesan cheese and chopped parsley taste wonderful with pasta and Alfredo sauce. Add as many toppings as you want, or just eat it plain. Season with additional salt and pepper to taste."
        },
        {
          "headline":"Enjoy with bread and salad.",
          "description":"Make your pasta dish into a complete meal by serving it with some garlic bread and a salad on the side."
        }
      ]
    }
  ],
  "text":" Cooking the Pasta Decide how much pasta you need. The average serving size is 2 ounces of pasta per person. That's about half a handful of dried fettuccine noodles, or half a cup of dried macaroni. Decide how much pasta you want to cook and measure it out from the box. If you find it easier to cook the whole box, that's fine, too. You can always eat leftovers later. The type of pasta you choose is completely up to you. Fettuccine noodles, which are like wide, flat spaghetti noodles, are commonly paired with Alfredo sauce. However, any type of pasta will taste great, so feel free to use whatever you have on hand. Fill a tall pot with water and bring it to a boil over high heat. When it comes to making pasta, it doesn't matter how much water you use; you just need enough to submerge the pasta. Err on the safe side and fill the pot about 3/4 full to make sure you have enough. You want it to come to a full, rolling boil before you add the pasta. If you want, you can salt the water to help flavor the pasta. Add a few shakes of salt from your salt shaker. You can also add salt later, after the pasta has cooked, or just enjoy the saltiness of the Alfredo sauce. Add the pasta to the boiling water. Drop the dried pasta into the water, and it will immediately begin cooking. Cook the pasta for the amount of time indicated on the package. Different types of pasta require different cooking times. In general, it should take eight to ten minutes to finish cooking your pasta. Most people enjoy their pasta \"al dente,\" which means it still has a bit of bite to it, rather than being completely mushy. You can check to see if the pasta is ready by using a fork to pull out a piece and tasting it. If you like the texture, remove it from heat. Or smack a piece of pasta against the wall or another surface. If it sticks, it's ready. Remove the pasta from heat. Turn off the heat and place the pasta on a different burner so it stops cooking. Mixing the Pasta and Sauce Figure out how much Alfredo sauce to use. You'll need the same number of sauce servings as pasta servings. For example, if you made enough pasta for two people, heat enough sauce for two people. Check the nutrition label on the sauce jar to find out how much sauce is in one serving; it should be about 1/4 to 1/2 cup per person. Pour the sauce into a medium pan or pot. The pot you use needs to be large enough to fit both the Alfredo sauce and the pasta, so choose accordingly. Heat the sauce over medium heat. Place the pan on a burner, turn the burner to medium, and let the sauce begin to heat. Stir it occasionally using a spatula or spoon to keep it from scorching on the bottom. It should take about five minutes to heat. Taste the sauce to see if it's hot before going to the next step. Add the pasta to the sauce. Lift the pasta from the pasta pot to the Alfredo pan to mix them together. You can use tongs or a pronged pasta spoon to do the job. Keep going until all of the pasta has been moved from the pot to the pan with the sauce. Stir it together and cook for three more minutes. This will give the pasta and the sauce time to combine and take on a nice texture. After three minutes are up, remove the pan from heat. Serving the Pasta Scoop the pasta and sauce onto a plate. You could also pour it into a bowl and have everyone serve themselves. Add toppings if desired. Grated parmesan cheese and chopped parsley taste wonderful with pasta and Alfredo sauce. Add as many toppings as you want, or just eat it plain. Season with additional salt and pepper to taste. Enjoy with bread and salad. Make your pasta dish into a complete meal by serving it with some garlic bread and a salad on the side.",
  "tyn_model":[
    "pasta",
    "alfredo sauce",
    "pot",
    "water",
    "fettuccine noodles",
    "salt",
    "macaroni",
    "salt shaker",
    "fork",
    "sauce",
    "medium pan",
    "burner",
    "spatula",
    "spoon",
    "pasta pot",
    "alfredo pan",
    "pasta spoon",
    "pan",
    "plate",
    "bowl",
    "parmesan cheese",
    "parsley",
    "salt and pepper",
    "garlic bread",
    "salad"
  ],
  "tyn_section":[

  ]
}