{
  "title":"How to Make Carrot Cake Pancakes",
  "url":"https://www.wikihow.com/Make-Carrot-Cake-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "parts":[
    {
      "name":"Preparing the Batter",
      "steps":[
        {
          "headline":"Grate the carrots, then set them aside.",
          "description":"You can do it by hand or with a food processor. If you are using a food processor, start by using the grating attachment, then pulse 10 times using the regular blade. Don't over-do it however, you don't want them to be mushy. Set the carrots aside when you are done."
        },
        {
          "headline":"Whisk together the dry ingredients, except for the sugar.",
          "description":"Pour the flour into a large mixing bowl. Add the baking powder, baking soda, salt, cinnamon, nutmeg, and ginger. Whisk everything together until evenly combined."
        },
        {
          "headline":"Stir in some extras.",
          "description":"If you want to make your pancakes for hearty, add in some nuts and/or raisins. This is not completely necessary, but it will give them extra crunch and texture."
        },
        {
          "headline":"Mix together the sugar and wet ingredients.",
          "description":"Pour the buttermilk into a small mixing bowl. Add the grated carrots, egg, sugar, and vanilla extract. Whisk everything together until the color and texture are even and no streaks remain. Be sure to scrape the bottom and sides of the bowl often so that everything mixes evenly."
        },
        {
          "headline":"Combine the wet and dry mixtures.",
          "description":"Pour the wet mixture into the dry mixture. Use a rubber spatula to scrape the bowl clean so that you don't waste anything. Stir the two mixtures together until just combined, scraping the bottom and sides of the bowl often."
        },
        {
          "headline":"Let the batter rest for 5 minutes.",
          "description":"Carrot cake pancakes taste great when served with a cream cheese or maple cream cheese topping. If you want to make the topping, take these five minutes to prepare it."
        }
      ]
    },
    {
      "name":"Frying the Pancakes",
      "steps":[
        {
          "headline":"Preheat your oven to 200°F (94°C).",
          "description":"Move the rack to the upper third of the oven. As you fry the pancakes, you will place them into the oven. This will help keep them warm while you fry the rest. If you oven won't go that low, set it to the lowest temperature possible instead."
        },
        {
          "headline":"Melt some butter in a cast-ion skillet.",
          "description":"Place a skillet on the stove and turn the heat to medium. Place 1 tablespoon of butter into the skillet and let it melt. Use a spatula to help coat the skillet with melted butter. If you don't have a skillet, you can use a griddle instead."
        },
        {
          "headline":"Ladle some batter onto the skillet.",
          "description":"You will need about 2 tablespoons (30 milliliters) of batter per pancake. How many pancakes you can fit onto your skillet depends on how big it is. Be careful not to crowd the skillet, however."
        },
        {
          "headline":"Fry the pancakes.",
          "description":"Let the pancakes cook until bubbles form and they are golden-brown underneath. This will take about 2 minutes. Flip the pancakes over, and let them cook for another 1 to 2 minutes, or until they are golden-brown on both sides."
        },
        {
          "headline":"Transfer the finished pancakes to the oven as you fry more.",
          "description":"Once the pancakes are done, transfer them to a baking sheet, and place them into the warm oven. Keep making more pancakes until you run out of batter, adding more butter to the pan as needed. As you finish frying each batch of pancakes, be sure to store them in the oven."
        },
        {
          "headline":"Serve the pancakes.",
          "description":"Once you have fried all of the pancakes, take them out of the oven and place them onto serving plates or a large platter. Serve them with a cream cheese topping or a maple cream cheese topping."
        }
      ]
    },
    {
      "name":"Making a Cream Cheese Topping (Option 1)",
      "steps":[
        {
          "headline":"Beat the cream cheese.",
          "description":"Place the cream cheese into a small mixing bowl. Beat it with a handheld mixer until it is smooth and fluffy. You can also use a whisk attachment on your food processor instead."
        },
        {
          "headline":"Add in the powdered sugar, milk, vanilla extract, and cinnamon.",
          "description":"Start with 2 tablespoons (30 milliliters) of milk. You can add more later if the topping is too thick for you."
        },
        {
          "headline":"Whisk everything together.",
          "description":"Keep whisking until the mixture is smooth and there are no more streaks. Be sure to scrape the bottom and sides of the bowl often so that nothing gets left behind."
        },
        {
          "headline":"Adjust the consistency, if desired.",
          "description":"If the topping is too thick for your liking, add the last tablespoon (15 milliliters) of milk. If it is not thick enough add in some more powdered sugar or cream cheese. Be sure to whisk the topping well after each adjustment that you make."
        }
      ]
    },
    {
      "name":"Making a Maple Cream Cheese Topping (Option 2)",
      "steps":[
        {
          "headline":"Whisk the cream cheese.",
          "description":"Scoop the cream cheese into a small bowl. Whisk it until it is soft and smooth and no lumps remain. You can do this by hand or in a food processor with a whisk attachment."
        },
        {
          "headline":"Add the maple syrup, milk, vanilla extract, and cinnamon.",
          "description":"Make sure that you are using real maple syrup and not the \"pancake syrup\" substitute. You can tell the difference by looking at the ingredient label. If it says \"corn syrup\" on it, it's not real maple syrup."
        },
        {
          "headline":"Whisk everything together once more.",
          "description":"Keep mixing until the mixture is smooth and without any streaks. Be sure to scrape the bottom and sides of the bowl so that everything mixes evenly."
        },
        {
          "headline":"Adjust the consistency, if desired.",
          "description":"If you want the topping to be thinner, add in some more milk. If you want it to be thicker, add in more cream cheese. If it is not sweet enough for you, try some more maple syrup. Be sure to whisk well after each addition."
        }
      ]
    }
  ],
  "text":" Preparing the Batter Grate the carrots, then set them aside. You can do it by hand or with a food processor. If you are using a food processor, start by using the grating attachment, then pulse 10 times using the regular blade. Don't over-do it however, you don't want them to be mushy. Set the carrots aside when you are done. Whisk together the dry ingredients, except for the sugar. Pour the flour into a large mixing bowl. Add the baking powder, baking soda, salt, cinnamon, nutmeg, and ginger. Whisk everything together until evenly combined. Stir in some extras. If you want to make your pancakes for hearty, add in some nuts and/or raisins. This is not completely necessary, but it will give them extra crunch and texture. Mix together the sugar and wet ingredients. Pour the buttermilk into a small mixing bowl. Add the grated carrots, egg, sugar, and vanilla extract. Whisk everything together until the color and texture are even and no streaks remain. Be sure to scrape the bottom and sides of the bowl often so that everything mixes evenly. Combine the wet and dry mixtures. Pour the wet mixture into the dry mixture. Use a rubber spatula to scrape the bowl clean so that you don't waste anything. Stir the two mixtures together until just combined, scraping the bottom and sides of the bowl often. Let the batter rest for 5 minutes. Carrot cake pancakes taste great when served with a cream cheese or maple cream cheese topping. If you want to make the topping, take these five minutes to prepare it. Frying the Pancakes Preheat your oven to 200°F (94°C). Move the rack to the upper third of the oven. As you fry the pancakes, you will place them into the oven. This will help keep them warm while you fry the rest. If you oven won't go that low, set it to the lowest temperature possible instead. Melt some butter in a cast-ion skillet. Place a skillet on the stove and turn the heat to medium. Place 1 tablespoon of butter into the skillet and let it melt. Use a spatula to help coat the skillet with melted butter. If you don't have a skillet, you can use a griddle instead. Ladle some batter onto the skillet. You will need about 2 tablespoons (30 milliliters) of batter per pancake. How many pancakes you can fit onto your skillet depends on how big it is. Be careful not to crowd the skillet, however. Fry the pancakes. Let the pancakes cook until bubbles form and they are golden-brown underneath. This will take about 2 minutes. Flip the pancakes over, and let them cook for another 1 to 2 minutes, or until they are golden-brown on both sides. Transfer the finished pancakes to the oven as you fry more. Once the pancakes are done, transfer them to a baking sheet, and place them into the warm oven. Keep making more pancakes until you run out of batter, adding more butter to the pan as needed. As you finish frying each batch of pancakes, be sure to store them in the oven. Serve the pancakes. Once you have fried all of the pancakes, take them out of the oven and place them onto serving plates or a large platter. Serve them with a cream cheese topping or a maple cream cheese topping. Making a Cream Cheese Topping (Option 1) Beat the cream cheese. Place the cream cheese into a small mixing bowl. Beat it with a handheld mixer until it is smooth and fluffy. You can also use a whisk attachment on your food processor instead. Add in the powdered sugar, milk, vanilla extract, and cinnamon. Start with 2 tablespoons (30 milliliters) of milk. You can add more later if the topping is too thick for you. Whisk everything together. Keep whisking until the mixture is smooth and there are no more streaks. Be sure to scrape the bottom and sides of the bowl often so that nothing gets left behind. Adjust the consistency, if desired. If the topping is too thick for your liking, add the last tablespoon (15 milliliters) of milk. If it is not thick enough add in some more powdered sugar or cream cheese. Be sure to whisk the topping well after each adjustment that you make. Making a Maple Cream Cheese Topping (Option 2) Whisk the cream cheese. Scoop the cream cheese into a small bowl. Whisk it until it is soft and smooth and no lumps remain. You can do this by hand or in a food processor with a whisk attachment. Add the maple syrup, milk, vanilla extract, and cinnamon. Make sure that you are using real maple syrup and not the \"pancake syrup\" substitute. You can tell the difference by looking at the ingredient label. If it says \"corn syrup\" on it, it's not real maple syrup. Whisk everything together once more. Keep mixing until the mixture is smooth and without any streaks. Be sure to scrape the bottom and sides of the bowl so that everything mixes evenly. Adjust the consistency, if desired. If you want the topping to be thinner, add in some more milk. If you want it to be thicker, add in more cream cheese. If it is not sweet enough for you, try some more maple syrup. Be sure to whisk well after each addition.",
  "tyn_model":[
    "cream cheese",
    "oven",
    "skillet",
    "bowl",
    "milk",
    "food processor",
    "butter",
    "maple syrup",
    "carrots",
    "sugar",
    "cinnamon",
    "small mixing bowl",
    "cream cheese topping",
    "whisk",
    "powdered sugar",
    "vanilla extract",
    "flour",
    "large mixing bowl",
    "baking powder",
    "baking soda",
    "salt",
    "nutmeg",
    "ginger",
    "nuts",
    "raisins",
    "buttermilk",
    "egg",
    "vanilla",
    "rubber spatula",
    "carrot cake pancakes",
    "cast-ion skillet",
    "stove",
    "spatula",
    "griddle",
    "baking sheet",
    "serving plates",
    "handheld mixer",
    "small bowl",
    "pancake syrup",
    "corn syrup"
  ],
  "tyn_section":[

  ]
}