{
  "title":"How to Clean Cement",
  "url":"https://www.wikihow.com/Clean-Cement",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Doing a Routine Cleaning",
      "steps":[
        {
          "headline":"Sweep away and dirt or debris.",
          "description":"Any loose dirt, debris, or dust should be swept from cement floors or walls before you begin cleaning. Use a broom to sweep the cement as clean as you can before applying a cleaner. When sweeping down a cement wall, lay down a tarp to catch loose dirt, debris, and dust."
        },
        {
          "headline":"Put on protective gear if necessary.",
          "description":"When using chemical cleaners, such as degreasers, gloves and goggles are generally necessary. You should also wear older clothing, regardless of what kind of cleaner you're using, as cleaning cement may get messy."
        },
        {
          "headline":"Prepare a cleaning solution.",
          "description":"Mildly dirty cement can be cleaned with mild laundry detergent diluted with warm water. In a bucket, mix a third cup of your detergent with a gallon of water. When using degreaser, consult the label to figure out the proper degreaser to water ratio."
        },
        {
          "headline":"Pour the solution on the concrete.",
          "description":"It's best to work in sections, especially when cleaning a large amount of cement. Pour enough of your cleaner over the cement you're working on to get it thoroughly wet. For very dirty concrete, allow the cleaner to sit for a few minutes before proceeding to clean it."
        },
        {
          "headline":"Scrub the concrete.",
          "description":"Use a deck brush to scrub your cleaner into the cement. Work the cleaner in until you've removed any troublesome layers of dirt and dust, and any obvious stains or set in dirt. For very dirty floors, let the cleaner sit for five to ten minutes after scrubbing it once. Then, repeat the process."
        },
        {
          "headline":"Rinse with a hose or pressure washer.",
          "description":"A pressure washer is the best means to remove a cleaner from cement. These can be rented at most hardware stores. If you do not have a pressure washer, a high pressure hose can be used to rinse the cement. Spray down the cement with clean water to remove any traces of your cleaner. Make sure to keep spraying your cement until water runs clear. Any cleaner reside can damage the cement over time."
        }
      ]
    },
    {
      "name":"Targeting Stains and Grease",
      "steps":[
        {
          "headline":"Use an alkaline degreaser for oil and grease.",
          "description":"Oil and grease, often found on garage floors, should be cleaned with an alkaline degreaser. You can purchase this online or at a hardware store. Consult the label to see how much water to use to dilute your degreaser. Apply to oil and grease stains and then rinse it out completely using water. Make sure to wear goggles and gloves when applying degreaser."
        },
        {
          "headline":"Look for chemical strippers to remove graffiti.",
          "description":"In general, chemical strippers should not be used on cement. In the event of graffiti, however, such cleaning solutions are necessary. Go for citrus-based strippers, as these are the mildest. Apply these cleaners to the graffiti and allow them to sit in for several hours before rinsing them out. Use protective gear when working with chemical cleaners. Apply an acid neutralizer, which you can buy at a hardware store, according to package directions after using a chemical stripper."
        },
        {
          "headline":"Remove rust stains.",
          "description":"Rust stains are difficult to remove and sometimes require professional cleaning. Cleaners with oxalic acid are usually used to remove rust stains. Apply these according to package instructions, making sure to wear goggles and gloves. As removing concrete can be difficult, it's usually best to seek professional help if you have concrete built up on your cement."
        }
      ]
    },
    {
      "name":"Avoiding Common Mistakes",
      "steps":[
        {
          "headline":"Start with less toxic cleaners.",
          "description":"In general, the least toxic cleaner is best for cement. Start with a mild cleanser, like detergent, and work your way up to chemical cleaners if necessary. Chemicals can wear cement down, so they should be avoided unless absolutely necessary."
        },
        {
          "headline":"Do not pour water into acid.",
          "description":"When using an acid-based cleaner, never pour add the acid to a bucket first and then the water. You should add the water followed by the acid. Doing so the other way around can cause a dangerous reaction."
        },
        {
          "headline":"Use a deck brush over a push broom.",
          "description":"Many people use push brooms to target cement floors. However, push brushes are actually less effective than deck brushes. The bristles are too long to effectively remove dirt and debris from cement. If you don't have a deck brush, buy one at a hardware store."
        }
      ]
    }
  ],
  "text":" Doing a Routine Cleaning Sweep away and dirt or debris. Any loose dirt, debris, or dust should be swept from cement floors or walls before you begin cleaning. Use a broom to sweep the cement as clean as you can before applying a cleaner. When sweeping down a cement wall, lay down a tarp to catch loose dirt, debris, and dust. Put on protective gear if necessary. When using chemical cleaners, such as degreasers, gloves and goggles are generally necessary. You should also wear older clothing, regardless of what kind of cleaner you're using, as cleaning cement may get messy. Prepare a cleaning solution. Mildly dirty cement can be cleaned with mild laundry detergent diluted with warm water. In a bucket, mix a third cup of your detergent with a gallon of water. When using degreaser, consult the label to figure out the proper degreaser to water ratio. Pour the solution on the concrete. It's best to work in sections, especially when cleaning a large amount of cement. Pour enough of your cleaner over the cement you're working on to get it thoroughly wet. For very dirty concrete, allow the cleaner to sit for a few minutes before proceeding to clean it. Scrub the concrete. Use a deck brush to scrub your cleaner into the cement. Work the cleaner in until you've removed any troublesome layers of dirt and dust, and any obvious stains or set in dirt. For very dirty floors, let the cleaner sit for five to ten minutes after scrubbing it once. Then, repeat the process. Rinse with a hose or pressure washer. A pressure washer is the best means to remove a cleaner from cement. These can be rented at most hardware stores. If you do not have a pressure washer, a high pressure hose can be used to rinse the cement. Spray down the cement with clean water to remove any traces of your cleaner. Make sure to keep spraying your cement until water runs clear. Any cleaner reside can damage the cement over time. Targeting Stains and Grease Use an alkaline degreaser for oil and grease. Oil and grease, often found on garage floors, should be cleaned with an alkaline degreaser. You can purchase this online or at a hardware store. Consult the label to see how much water to use to dilute your degreaser. Apply to oil and grease stains and then rinse it out completely using water. Make sure to wear goggles and gloves when applying degreaser. Look for chemical strippers to remove graffiti. In general, chemical strippers should not be used on cement. In the event of graffiti, however, such cleaning solutions are necessary. Go for citrus-based strippers, as these are the mildest. Apply these cleaners to the graffiti and allow them to sit in for several hours before rinsing them out. Use protective gear when working with chemical cleaners. Apply an acid neutralizer, which you can buy at a hardware store, according to package directions after using a chemical stripper. Remove rust stains. Rust stains are difficult to remove and sometimes require professional cleaning. Cleaners with oxalic acid are usually used to remove rust stains. Apply these according to package instructions, making sure to wear goggles and gloves. As removing concrete can be difficult, it's usually best to seek professional help if you have concrete built up on your cement. Avoiding Common Mistakes Start with less toxic cleaners. In general, the least toxic cleaner is best for cement. Start with a mild cleanser, like detergent, and work your way up to chemical cleaners if necessary. Chemicals can wear cement down, so they should be avoided unless absolutely necessary. Do not pour water into acid. When using an acid-based cleaner, never pour add the acid to a bucket first and then the water. You should add the water followed by the acid. Doing so the other way around can cause a dangerous reaction. Use a deck brush over a push broom. Many people use push brooms to target cement floors. However, push brushes are actually less effective than deck brushes. The bristles are too long to effectively remove dirt and debris from cement. If you don't have a deck brush, buy one at a hardware store.",
  "tyn_model":[
    "water",
    "cleaner",
    "concrete",
    "cement",
    "deck brush",
    "pressure washer",
    "bucket",
    "hose",
    "alkaline degreaser",
    "chemical strippers",
    "cleaners",
    "chemical cleaners",
    "broom",
    "tarp",
    "laundry detergent",
    "degreaser",
    "acid neutralizer",
    "chemical stripper",
    "oxalic acid",
    "detergent",
    "acid-based cleaner",
    "push broom",
    "push brooms",
    "push brushes",
    "deck brushes"
  ],
  "tyn_section":[

  ]
}