{
  "title":"How to Clean a Toaster Oven",
  "url":"https://www.wikihow.com/Clean-a-Toaster-Oven",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "methods":[
    {
      "name":"Engaging in Basic Cleaning",
      "steps":[
        {
          "headline":"Dump the crumbs out of the oven.",
          "description":"Unplug the toaster oven and open its door. Holding your toaster oven securely over the trash bin, tilt the open side of it toward the bin. Tap it on the back once or twice to shake loose crumbs that might be lodged within."
        },
        {
          "headline":"Remove the rack and pans.",
          "description":"The rack or racks of your toaster oven should slide out easily. Remove them to the sink and squirt them with an all-purpose cleaner. Likewise, remove the pan that collects crumbs in the bottom of the toaster oven and dump its contents into the rubbish bin, then place the pan in the sink."
        },
        {
          "headline":"Sponge down the parts.",
          "description":"Use a sponge to remove any charring or grime that may be covering the racks or the pan. Place them in your drying rack after you’ve finished washing them. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tAG\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrii Gurskyi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\t\t\t\t\tAndrii Gurskyi is the owner and founder of Rainbow Cleaning Service, a New York City cleaning company specializing in apartments, homes, and moving cleanup using non-toxic and artificial fragrance free cleaning solutions. Founded in 2010, Andrii and Rainbow Cleaning Service has served over 35,000 customers. AG\t\t\t\t\tAndrii Gurskyi\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\tThe simplest solution is to use vinegar, warm water, and dish soap. Apply the mixture and use a regular brush or sponge to clean the toaster oven. If you wipe down the toaster oven after every time you use it, you won't have to worry about it becoming extremely dirty. If it is very dirty, you can use stronger chemicals like Easy-Off."
        },
        {
          "headline":"Wipe the inside down with an all-purpose cleaner.",
          "description":"Spray a scrubber sponge with a nontoxic all-purpose cleaner. Wipe the sides and bottom of the inside of the toaster oven. Do not wipe down the heating elements (typically located at the back of the toaster oven) with your sponge. Do not spray the inside of the toaster oven directly."
        },
        {
          "headline":"Allow the oven to dry.",
          "description":"While all the racks and pans of your toaster oven are drying, keep the door of your toaster oven open after you’ve cleaned the inside. This will allow it to air dry."
        },
        {
          "headline":"Wipe the glass door.",
          "description":"Prepare a mixture that is equal parts vinegar and water. For instance, you might mix two table spoons of water and two tablespoons of white distilled vinegar. Dampen your dishcloth with this liquid, then wipe down the glass door of your toaster oven."
        },
        {
          "headline":"Clean the outside.",
          "description":"For the outside of your toaster oven’s glass door, you can just spray a glass cleaner or an all-purpose cleaner on it and wipe it down with a dry dishcloth. If you have a painted steel or plastic exterior to your toaster oven, clean it with a rag dampened with soapy water. If the exterior of your appliance is chrome, \nUse a microfiber cloth to dry the outside of the toaster oven."
        }
      ]
    },
    {
      "name":"Tackling Serious Grime",
      "steps":[
        {
          "headline":"Clean the easy-to-remove grime first.",
          "description":"Spray a scrubber sponge with a nontoxic all-purpose cleaner. Wipe the sides and bottom of the inside of the toaster oven. Do not wipe down the heating elements (typically located at the back of the toaster oven) with your sponge. Do not spray the inside of the toaster oven directly."
        },
        {
          "headline":"Remove stubborn grime with baking soda.",
          "description":"If you’re having a hard time removing a grease stain or baked-on food, make a paste by mixing three tablespoons baking soda with one tablespoon ammonia. Coat the scrubber side of your sponge with the paste, then move your hand firmly in a circular or zigzag motion on and around the area you’re trying to clean. You can make a similar paste by mixing one tablespoon lemon juice with two tablespoons cream of tartar. This strategy also works well on steel grates or mesh inside the oven."
        },
        {
          "headline":"Wipe away grease.",
          "description":"Moisten a dishcloth and wring it out so it is damp, but not dripping. Sprinkle some baking soda on the cloth. Use this treatment to wipe down greasy surfaces inside the toaster oven or on the drip pan."
        },
        {
          "headline":"Clean baked-on food with a nylon scrubber.",
          "description":"If you encounter food that has charred into a black or brown mess on the sides of bottom of the toaster oven, use a nylon scrubber dipped in soapy water to remove it. Do not allow the water to drip within the toaster oven."
        },
        {
          "headline":"Clean the heating element gently.",
          "description":"Use a dishcloth to clean the heating element. If any unwanted material has accumulated on the heating element itself, you can use a mixture of one tablespoon baking soda and one tablespoon water to make a paste. Apply the paste to the heating element and scrub it gently using a toothbrush or dishcloth. Do not scour or vigorously scrub the heating element. Make sure that if you apply paste to the heating element that you scrub it clean before using the toaster oven again, or leftover residue will burn."
        }
      ]
    },
    {
      "name":"Maintaining Your Toaster Oven",
      "steps":[
        {
          "headline":"Engage in light cleaning frequently.",
          "description":"Wipe down small grease spills or dirt in the toaster oven as soon as you notice them. You can simply use a damp dishtowel or sponge to wipe down these small stains and spills. This will prevent buildup and help you limit the amount of cleaning you need to do all at once."
        },
        {
          "headline":"Give your toaster oven a deeper cleaning as needed.",
          "description":"There is no regular schedule to which you need to adhere when deciding how often you ought to clean your toaster oven. The more often you clean your toaster oven, however, the more often you’ll likely need to clean it. When you see or smell smoke from your toaster oven, or when you see food caked onto the oven, give it a more thorough cleaning. If you see grease or significant volume of crumbs in your toaster oven’s drip pan, remove the liner and/or pan and clean them, as needed."
        },
        {
          "headline":"Don’t store things on your toaster oven.",
          "description":"It can be hard to resist placing bread, bagels, or other kitchen staples on top of the toaster oven to conserve space and ensure convenience. However, when toaster oven heats up, it can cause the color on these bags to transfer onto the toaster oven. Depending on how hot the exterior of your toaster oven gets, it could even melt the whole bag. To avoid this, don’t stash anything on top of the toaster oven. Use a spot of nail polish remover to wipe off spots of discoloration caused by plastic bags that have transferred their color to the toaster oven."
        },
        {
          "headline":"Lay down an oven liner.",
          "description":"Cut a heavy-duty reusable nonstick oven liner to the size of your toaster oven’s drip pan. Place the liner in the pan. This will prevent you from having to clean the drip tray as vigorously next time you clean the oven. Replace the liner when you clean your toaster oven."
        }
      ]
    }
  ],
  "text":" Engaging in Basic Cleaning Dump the crumbs out of the oven. Unplug the toaster oven and open its door. Holding your toaster oven securely over the trash bin, tilt the open side of it toward the bin. Tap it on the back once or twice to shake loose crumbs that might be lodged within. Remove the rack and pans. The rack or racks of your toaster oven should slide out easily. Remove them to the sink and squirt them with an all-purpose cleaner. Likewise, remove the pan that collects crumbs in the bottom of the toaster oven and dump its contents into the rubbish bin, then place the pan in the sink. Sponge down the parts. Use a sponge to remove any charring or grime that may be covering the racks or the pan. Place them in your drying rack after you’ve finished washing them. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tAG\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrii Gurskyi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\t\t\t\t\tAndrii Gurskyi is the owner and founder of Rainbow Cleaning Service, a New York City cleaning company specializing in apartments, homes, and moving cleanup using non-toxic and artificial fragrance free cleaning solutions. Founded in 2010, Andrii and Rainbow Cleaning Service has served over 35,000 customers. AG\t\t\t\t\tAndrii Gurskyi\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\tThe simplest solution is to use vinegar, warm water, and dish soap. Apply the mixture and use a regular brush or sponge to clean the toaster oven. If you wipe down the toaster oven after every time you use it, you won't have to worry about it becoming extremely dirty. If it is very dirty, you can use stronger chemicals like Easy-Off. Wipe the inside down with an all-purpose cleaner. Spray a scrubber sponge with a nontoxic all-purpose cleaner. Wipe the sides and bottom of the inside of the toaster oven. Do not wipe down the heating elements (typically located at the back of the toaster oven) with your sponge. Do not spray the inside of the toaster oven directly. Allow the oven to dry. While all the racks and pans of your toaster oven are drying, keep the door of your toaster oven open after you’ve cleaned the inside. This will allow it to air dry. Wipe the glass door. Prepare a mixture that is equal parts vinegar and water. For instance, you might mix two table spoons of water and two tablespoons of white distilled vinegar. Dampen your dishcloth with this liquid, then wipe down the glass door of your toaster oven. Clean the outside. For the outside of your toaster oven’s glass door, you can just spray a glass cleaner or an all-purpose cleaner on it and wipe it down with a dry dishcloth. If you have a painted steel or plastic exterior to your toaster oven, clean it with a rag dampened with soapy water. If the exterior of your appliance is chrome, \nUse a microfiber cloth to dry the outside of the toaster oven. Tackling Serious Grime Clean the easy-to-remove grime first. Spray a scrubber sponge with a nontoxic all-purpose cleaner. Wipe the sides and bottom of the inside of the toaster oven. Do not wipe down the heating elements (typically located at the back of the toaster oven) with your sponge. Do not spray the inside of the toaster oven directly. Remove stubborn grime with baking soda. If you’re having a hard time removing a grease stain or baked-on food, make a paste by mixing three tablespoons baking soda with one tablespoon ammonia. Coat the scrubber side of your sponge with the paste, then move your hand firmly in a circular or zigzag motion on and around the area you’re trying to clean. You can make a similar paste by mixing one tablespoon lemon juice with two tablespoons cream of tartar. This strategy also works well on steel grates or mesh inside the oven. Wipe away grease. Moisten a dishcloth and wring it out so it is damp, but not dripping. Sprinkle some baking soda on the cloth. Use this treatment to wipe down greasy surfaces inside the toaster oven or on the drip pan. Clean baked-on food with a nylon scrubber. If you encounter food that has charred into a black or brown mess on the sides of bottom of the toaster oven, use a nylon scrubber dipped in soapy water to remove it. Do not allow the water to drip within the toaster oven. Clean the heating element gently. Use a dishcloth to clean the heating element. If any unwanted material has accumulated on the heating element itself, you can use a mixture of one tablespoon baking soda and one tablespoon water to make a paste. Apply the paste to the heating element and scrub it gently using a toothbrush or dishcloth. Do not scour or vigorously scrub the heating element. Make sure that if you apply paste to the heating element that you scrub it clean before using the toaster oven again, or leftover residue will burn. Maintaining Your Toaster Oven Engage in light cleaning frequently. Wipe down small grease spills or dirt in the toaster oven as soon as you notice them. You can simply use a damp dishtowel or sponge to wipe down these small stains and spills. This will prevent buildup and help you limit the amount of cleaning you need to do all at once. Give your toaster oven a deeper cleaning as needed. There is no regular schedule to which you need to adhere when deciding how often you ought to clean your toaster oven. The more often you clean your toaster oven, however, the more often you’ll likely need to clean it. When you see or smell smoke from your toaster oven, or when you see food caked onto the oven, give it a more thorough cleaning. If you see grease or significant volume of crumbs in your toaster oven’s drip pan, remove the liner and/or pan and clean them, as needed. Don’t store things on your toaster oven. It can be hard to resist placing bread, bagels, or other kitchen staples on top of the toaster oven to conserve space and ensure convenience. However, when toaster oven heats up, it can cause the color on these bags to transfer onto the toaster oven. Depending on how hot the exterior of your toaster oven gets, it could even melt the whole bag. To avoid this, don’t stash anything on top of the toaster oven. Use a spot of nail polish remover to wipe off spots of discoloration caused by plastic bags that have transferred their color to the toaster oven. Lay down an oven liner. Cut a heavy-duty reusable nonstick oven liner to the size of your toaster oven’s drip pan. Place the liner in the pan. This will prevent you from having to clean the drip tray as vigorously next time you clean the oven. Replace the liner when you clean your toaster oven.",
  "tyn_model":[
    "toaster oven",
    "sponge",
    "all-purpose cleaner",
    "oven",
    "water",
    "baking soda",
    "vinegar",
    "scrubber sponge",
    "soapy water",
    "nylon scrubber",
    "liner",
    "trash bin",
    "pans",
    "drying rack",
    "rainbow cleaning service",
    "rainbow cleaning",
    "warm water",
    "dish soap",
    "table spoons",
    "white distilled vinegar",
    "glass cleaner",
    "rag",
    "microfiber cloth",
    "ammonia",
    "scrubber",
    "lemon juice",
    "cream of tartar",
    "dishcloth and",
    "dishcloth",
    "dishtowel",
    "nail polish remover",
    "oven liner",
    "heavy-duty reusable nonstick oven liner"
  ],
  "tyn_section":[

  ]
}