{
  "title":"How to Make Butternut Squash Rice",
  "url":"https://www.wikihow.com/Make-Butternut-Squash-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "methods":[
    {
      "name":"Making Butternut Squash Basmati Rice",
      "steps":[
        {
          "headline":"Melt the butter.",
          "description":"Place the butter in a medium saucepan. Put the saucepan on your stovetop. Turn the burner to medium heat and thoroughly melt the butter."
        },
        {
          "headline":"Add the spices.",
          "description":"Once the butter is melted, turn the heat to high. Then add the cumin seeds and the mustard seeds. Cook over high heat until the mustard seeds begin to pop. This will take about 30 seconds."
        },
        {
          "headline":"Stir in the rice and squash.",
          "description":"Once the mustard seeds begin popping, add the diced butternut squash. Then add the basmati rice. Stir to coat with the butter."
        },
        {
          "headline":"Add the water and salt.",
          "description":"After the squash and rice are coated with butter, add the water and salt. Bring the mixture to a boil."
        },
        {
          "headline":"Reduce the heat.",
          "description":"Once the mixture begins to boil, reduce the heat to low. Cover the saucepan with a tight fitting lid."
        },
        {
          "headline":"Cook for 15 minutes.",
          "description":"Cook the butternut squash basmati rice on low for about 15 minutes, or until the water is completely absorbed and the squash is tender. Remove from the heat."
        },
        {
          "headline":"Let stand for 15 minutes.",
          "description":"After you remove the butternut squash basmati rice from the stovetop, you will need to let it stand for about 5 minutes. After you let it stand, use a fork to fluff the rice. Serve immediately."
        }
      ]
    },
    {
      "name":"Making Butternut Squash Risotto",
      "steps":[
        {
          "headline":"Prepare the oven.",
          "description":"Make sure your oven racks are placed in the lower third and upper third positions inside the oven. You will be baking the risotto on the lower rack and the squash on the upper rack at the same time. Then preheat the oven to 375 degrees Fahrenheit or 190 degrees Celsius."
        },
        {
          "headline":"Prep a baking sheet.",
          "description":"You will be baking the butternut squash on a large, rimmed baking sheet. Tear off a piece of parchment paper that is slightly smaller than the baking sheet. Place the parchment paper on the baking sheet. Set the baking sheet aside."
        },
        {
          "headline":"Cook the onion and garlic.",
          "description":"Heat 1 tablespoon of olive oil in a medium or large Dutch oven over medium heat. Add the onion and a pinch of salt. Cook until the onion is translucent, or about 5 minutes. Add the garlic and cook for an additional 1-2 minutes."
        },
        {
          "headline":"Add 3 cups (720 mL) broth and 1 cup (240 mL) water.",
          "description":"Cover the Dutch oven. Bring the liquids to a boil over medium-high heat. Remove from heat."
        },
        {
          "headline":"Add the rice.",
          "description":"After you bring the liquids to a boil and remove the Dutch oven from the heat, you will add the rice. Place the rice in the Dutch oven. Stir to combine using a wooden spoon."
        },
        {
          "headline":"Bake for 65-70 minutes.",
          "description":"After you stir in the rice, put the lid on the Dutch oven. Place the Dutch oven on the lowest oven rack. Bake for about 65-70 minutes, or until rice is done and a little bit dry. Remove from oven."
        },
        {
          "headline":"Bake the butternut squash.",
          "description":"Right after you place the rice in the oven, toss the squash with 2 tablespoons of olive oil in a large bowl. Then place the squash in a single layer on the parchment papered baking sheet. Sprinkle with salt and pepper. Bake on the top oven rack for 50-60 minutes. Remove from oven. You can start testing the squash with a fork at about 40 minutes for tenderness. The squash is done when you can easily pierce it with a fork."
        },
        {
          "headline":"Fry the sage while you bake the squash and rice.",
          "description":"Heat 1 tablespoon olive oil over medium heat in a large or medium skillet. When the oil begins to shimmer, add the sage. Toss to coat. Fry until the sage is dark green and crispy, but not brown. This should take 2-5 seconds. Transfer to a plate covered with a paper towel and sprinkle with salt."
        },
        {
          "headline":"Add the remaining broth, cheese, wine, and butter to the rice.",
          "description":"After you remove the Dutch oven from the oven, add the final cup (240 mL) of broth to the rice. Then add the Parmesan, wine, and butter. Use the wooden spoon to combine the ingredients. Stir for 2-3 minutes, or until the rice is creamy."
        },
        {
          "headline":"Stir in the salt, pepper, and squash.",
          "description":"Then add a pinch of red pepper flakes. Add more salt and pepper if desired. You can also add more red pepper flakes if you desire a spicier rice dish."
        },
        {
          "headline":"Serve with sage leaves.",
          "description":"Serve the risotto in individual bowls. Top each bowl with a sprinkle of fried sage. Enjoy!"
        }
      ]
    }
  ],
  "text":" Making Butternut Squash Basmati Rice Melt the butter. Place the butter in a medium saucepan. Put the saucepan on your stovetop. Turn the burner to medium heat and thoroughly melt the butter. Add the spices. Once the butter is melted, turn the heat to high. Then add the cumin seeds and the mustard seeds. Cook over high heat until the mustard seeds begin to pop. This will take about 30 seconds. Stir in the rice and squash. Once the mustard seeds begin popping, add the diced butternut squash. Then add the basmati rice. Stir to coat with the butter. Add the water and salt. After the squash and rice are coated with butter, add the water and salt. Bring the mixture to a boil. Reduce the heat. Once the mixture begins to boil, reduce the heat to low. Cover the saucepan with a tight fitting lid. Cook for 15 minutes. Cook the butternut squash basmati rice on low for about 15 minutes, or until the water is completely absorbed and the squash is tender. Remove from the heat. Let stand for 15 minutes. After you remove the butternut squash basmati rice from the stovetop, you will need to let it stand for about 5 minutes. After you let it stand, use a fork to fluff the rice. Serve immediately. Making Butternut Squash Risotto Prepare the oven. Make sure your oven racks are placed in the lower third and upper third positions inside the oven. You will be baking the risotto on the lower rack and the squash on the upper rack at the same time. Then preheat the oven to 375 degrees Fahrenheit or 190 degrees Celsius. Prep a baking sheet. You will be baking the butternut squash on a large, rimmed baking sheet. Tear off a piece of parchment paper that is slightly smaller than the baking sheet. Place the parchment paper on the baking sheet. Set the baking sheet aside. Cook the onion and garlic. Heat 1 tablespoon of olive oil in a medium or large Dutch oven over medium heat. Add the onion and a pinch of salt. Cook until the onion is translucent, or about 5 minutes. Add the garlic and cook for an additional 1-2 minutes. Add 3 cups (720 mL) broth and 1 cup (240 mL) water. Cover the Dutch oven. Bring the liquids to a boil over medium-high heat. Remove from heat. Add the rice. After you bring the liquids to a boil and remove the Dutch oven from the heat, you will add the rice. Place the rice in the Dutch oven. Stir to combine using a wooden spoon. Bake for 65-70 minutes. After you stir in the rice, put the lid on the Dutch oven. Place the Dutch oven on the lowest oven rack. Bake for about 65-70 minutes, or until rice is done and a little bit dry. Remove from oven. Bake the butternut squash. Right after you place the rice in the oven, toss the squash with 2 tablespoons of olive oil in a large bowl. Then place the squash in a single layer on the parchment papered baking sheet. Sprinkle with salt and pepper. Bake on the top oven rack for 50-60 minutes. Remove from oven. You can start testing the squash with a fork at about 40 minutes for tenderness. The squash is done when you can easily pierce it with a fork. Fry the sage while you bake the squash and rice. Heat 1 tablespoon olive oil over medium heat in a large or medium skillet. When the oil begins to shimmer, add the sage. Toss to coat. Fry until the sage is dark green and crispy, but not brown. This should take 2-5 seconds. Transfer to a plate covered with a paper towel and sprinkle with salt. Add the remaining broth, cheese, wine, and butter to the rice. After you remove the Dutch oven from the oven, add the final cup (240 mL) of broth to the rice. Then add the Parmesan, wine, and butter. Use the wooden spoon to combine the ingredients. Stir for 2-3 minutes, or until the rice is creamy. Stir in the salt, pepper, and squash. Then add a pinch of red pepper flakes. Add more salt and pepper if desired. You can also add more red pepper flakes if you desire a spicier rice dish. Serve with sage leaves. Serve the risotto in individual bowls. Top each bowl with a sprinkle of fried sage. Enjoy!",
  "tyn_model":[
    "rice",
    "butter",
    "oven",
    "dutch oven",
    "butternut squash",
    "squash",
    "salt",
    "baking sheet",
    "sage",
    "water",
    "olive oil",
    "broth",
    "saucepan",
    "mustard seeds",
    "basmati rice",
    "parchment paper",
    "onion",
    "garlic",
    "wooden spoon",
    "oven rack",
    "salt and pepper",
    "wine",
    "red pepper",
    "medium saucepan",
    "burner",
    "spices",
    "cumin seeds",
    "butternut squash basmati rice",
    "stovetop",
    "fork",
    "butternut squash risotto",
    "large bowl",
    "parchment papered baking sheet",
    "large or medium skillet",
    "oil",
    "plate",
    "cheese",
    "parmesan",
    "pepper"
  ],
  "tyn_section":[

  ]
}