{
  "title":"How to Clean Porcelain Grill Grates",
  "url":"https://www.wikihow.com/Clean-Porcelain-Grill-Grates",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Using a Grill Brush",
      "steps":[
        {
          "headline":"Get a soft bristle brush and a scouring pad.",
          "description":"Porcelain grill grates can chip easily if you use a metal or wire bristle brush. Avoid this by using a soft bristle brush, such as a brush made with nylon bristles. This way, the porcelain is not at risk of getting damaged when you clean it. A medium bristle toothbrush and a scouring pad will also be helpful for removing grime from smaller areas. You can get a standard square head soft bristle grill brush or try a grill brush with a rounded head. A soft bristle grill brush with a rounded head can make it easier to clean the grates."
        },
        {
          "headline":"Heat up the grill.",
          "description":"The grill will be easier to clean when it is warm. Heat up the grill to burn off any excess food on the grill grates. Then turn off the grill and let it cool for a few minutes so the brush bristles won’t melt."
        },
        {
          "headline":"Clean the grill grates.",
          "description":"Take the soft bristle brush and run it diagonally along the grates. Do this in smooth, fluid motions from the bottom to the top of the grates. Running the brush diagonally over the grates, rather than straight over the grates will make it easier to remove food and grease on the grates. Keep the brush flat to avoid the head from damaging the grates. Do one pass over the grates with the brush in a diagonal motion. If there are any really greasy or sticky parts of the grill, lightly go over the area a few times with the brush. Do not scrub too hard on the grates as this can damage them. Use the scouring pad or toothbrush to get small or hard-to-reach areas. If the grill grates can be flipped over, use an oven mitt or heat-proof gloves to flip over the grates and clean the other side with the grill brush."
        },
        {
          "headline":"Repeat after each use of the grill.",
          "description":"A key to keeping the grill grates clean is to clean them each time you are done cooking. After removing the food and turning off the heat, clean the grates with the brush while they are still warm. Then, apply a light cooking oil or grease to the grates so the grill is ready for the next use."
        }
      ]
    },
    {
      "name":"Using Household Products",
      "steps":[
        {
          "headline":"Clean the grates with tin foil.",
          "description":"If you do not have access to a grill brush, you can use household products like tin foil to clean the grates. Ball up aluminum foil, making a ball large enough to fit over your fingers. Then, run the aluminum foil over the grates to remove any debris and clean them. Clean the grates with tin foil when they are cool or not too hot to prevent burning your fingers. Make sure there is enough tin foil on your fingers to create a buffer between your fingers and the grates."
        },
        {
          "headline":"Apply a baking soda solution to remove grease.",
          "description":"If your porcelain grill grates are really dirty, you can try applying a baking soda solution to them. Make a paste by combining ½ cup (90 g) of baking soda with ⁄4 cup (59 ml) of warm water. Apply the paste to the grill grates. Let it sit for 20 minutes and then clean it off with a soft bristle grill brush. Make sure you get all of the paste off before you cook anything on the grill, and clean the brush when you’re done. You could remove the grates and let the solution soak overnight, if necessary, in a sink or tub. Rinse the solution off then replace the grates and clean them with a grill brush."
        },
        {
          "headline":"Use water on the grates.",
          "description":"If the grime and grease on the grates do not come off with just a brush, you can try dipping the grill brush in water and using it to clean the grates. A wet grill brush can help to remove debris on the grates effectively. Let the grill grates heat up. Then, dip the grill brush in a bucket of water to get it wet. Run the wet grill brush over the grates in a diagonal motion, starting from the bottom of the grate and going upward. Dip the grill brush back in the bucket of water to rinse it and continue to clean any other areas on the grates with the wet brush."
        }
      ]
    },
    {
      "name":"Applying a Professional Grill Cleaner",
      "steps":[
        {
          "headline":"Get a cleaner that is safe for use on porcelain.",
          "description":"It’s a good rule of thumb to do a deep clean on your grill twice a year. If your porcelain grill grates are really dirty, use a professional grill cleaner for a deep clean. Read the label on professional cleaners to ensure they are safe for use on porcelain grill grates. Most manufacturers will state if they are safe for use on porcelain grates. You can buy a professional grill cleaner online or at your local hardware store. Most grill cleaners come in a spray bottle for easy application."
        },
        {
          "headline":"Apply the cleaner.",
          "description":"Let the grill cool down or apply the cleaner when it has been shut off overnight. Spray the cleaner all over the grates and let it sit. Then, use a clean grill brush to gently remove any dirt or food debris on the grates. If the grates are really dirty, you may have to do a few passes with the grill brush. If there is a lot of deep grime caked onto the grates, you can also try spraying the grill cleaner and leaving it on overnight. Then, clean it off with the grill brush the following day."
        },
        {
          "headline":"Remove excess cleaner before using the grill.",
          "description":"Wipe down the grill grates with a clean soft cloth or paper towels. This will ensure there is no excess cleaner on the grill grates so your food doesn’t end up tasting like cleaner when you grill it. Another option is to heat up the grill before you start grilling to burn off any excess cleaner."
        }
      ]
    }
  ],
  "text":" Using a Grill Brush Get a soft bristle brush and a scouring pad. Porcelain grill grates can chip easily if you use a metal or wire bristle brush. Avoid this by using a soft bristle brush, such as a brush made with nylon bristles. This way, the porcelain is not at risk of getting damaged when you clean it. A medium bristle toothbrush and a scouring pad will also be helpful for removing grime from smaller areas. You can get a standard square head soft bristle grill brush or try a grill brush with a rounded head. A soft bristle grill brush with a rounded head can make it easier to clean the grates. Heat up the grill. The grill will be easier to clean when it is warm. Heat up the grill to burn off any excess food on the grill grates. Then turn off the grill and let it cool for a few minutes so the brush bristles won’t melt. Clean the grill grates. Take the soft bristle brush and run it diagonally along the grates. Do this in smooth, fluid motions from the bottom to the top of the grates. Running the brush diagonally over the grates, rather than straight over the grates will make it easier to remove food and grease on the grates. Keep the brush flat to avoid the head from damaging the grates. Do one pass over the grates with the brush in a diagonal motion. If there are any really greasy or sticky parts of the grill, lightly go over the area a few times with the brush. Do not scrub too hard on the grates as this can damage them. Use the scouring pad or toothbrush to get small or hard-to-reach areas. If the grill grates can be flipped over, use an oven mitt or heat-proof gloves to flip over the grates and clean the other side with the grill brush. Repeat after each use of the grill. A key to keeping the grill grates clean is to clean them each time you are done cooking. After removing the food and turning off the heat, clean the grates with the brush while they are still warm. Then, apply a light cooking oil or grease to the grates so the grill is ready for the next use. Using Household Products Clean the grates with tin foil. If you do not have access to a grill brush, you can use household products like tin foil to clean the grates. Ball up aluminum foil, making a ball large enough to fit over your fingers. Then, run the aluminum foil over the grates to remove any debris and clean them. Clean the grates with tin foil when they are cool or not too hot to prevent burning your fingers. Make sure there is enough tin foil on your fingers to create a buffer between your fingers and the grates. Apply a baking soda solution to remove grease. If your porcelain grill grates are really dirty, you can try applying a baking soda solution to them. Make a paste by combining ½ cup (90 g) of baking soda with ⁄4 cup (59 ml) of warm water. Apply the paste to the grill grates. Let it sit for 20 minutes and then clean it off with a soft bristle grill brush. Make sure you get all of the paste off before you cook anything on the grill, and clean the brush when you’re done. You could remove the grates and let the solution soak overnight, if necessary, in a sink or tub. Rinse the solution off then replace the grates and clean them with a grill brush. Use water on the grates. If the grime and grease on the grates do not come off with just a brush, you can try dipping the grill brush in water and using it to clean the grates. A wet grill brush can help to remove debris on the grates effectively. Let the grill grates heat up. Then, dip the grill brush in a bucket of water to get it wet. Run the wet grill brush over the grates in a diagonal motion, starting from the bottom of the grate and going upward. Dip the grill brush back in the bucket of water to rinse it and continue to clean any other areas on the grates with the wet brush. Applying a Professional Grill Cleaner Get a cleaner that is safe for use on porcelain. It’s a good rule of thumb to do a deep clean on your grill twice a year. If your porcelain grill grates are really dirty, use a professional grill cleaner for a deep clean. Read the label on professional cleaners to ensure they are safe for use on porcelain grill grates. Most manufacturers will state if they are safe for use on porcelain grates. You can buy a professional grill cleaner online or at your local hardware store. Most grill cleaners come in a spray bottle for easy application. Apply the cleaner. Let the grill cool down or apply the cleaner when it has been shut off overnight. Spray the cleaner all over the grates and let it sit. Then, use a clean grill brush to gently remove any dirt or food debris on the grates. If the grates are really dirty, you may have to do a few passes with the grill brush. If there is a lot of deep grime caked onto the grates, you can also try spraying the grill cleaner and leaving it on overnight. Then, clean it off with the grill brush the following day. Remove excess cleaner before using the grill. Wipe down the grill grates with a clean soft cloth or paper towels. This will ensure there is no excess cleaner on the grill grates so your food doesn’t end up tasting like cleaner when you grill it. Another option is to heat up the grill before you start grilling to burn off any excess cleaner.",
  "tyn_model":[
    "grill brush",
    "grill",
    "grill grates",
    "water",
    "tin foil",
    "scouring pad",
    "baking soda",
    "grill cleaner",
    "cleaner",
    "brush",
    "aluminum foil",
    "soft bristle grill brush",
    "soft bristle brush",
    "toothbrush",
    "oven mitt",
    "heat-proof gloves",
    "cooking oil",
    "bucket",
    "porcelain grill grates",
    "professional grill cleaner",
    "grill cleaners",
    "paper towels"
  ],
  "tyn_section":[

  ]
}