{
  "title":"How to Save Money when Buying a Smartphone",
  "url":"https://www.wikihow.com/Save-Money-when-Buying-a-Smartphone",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Choosing a Purchasing Option",
      "steps":[
        {
          "headline":"Shop for smartphones online.",
          "description":"Online retailers will often offer phones for far lower costs than brick-and-mortar stores or major carriers. Examples of popular websites to purchase smartphones include Amazon, Flipkart, and eBay. These websites offer immense selection and have convenient search features. When searching online, use the features you know you want to help narrow your results. For instance, most sites will allow you to use filters to narrow it down to phones that contain a specified amount of storage with a camera above a certain number of megapixels. Check the website’s return policy before purchasing a phone online. Do not buy from a website that does not accept returns or that charges a restocking fee."
        },
        {
          "headline":"Pay for your phone in monthly installments.",
          "description":"Whether you buy your smartphone online or in person, you can likely pay off the cost in monthly installments. This will allow you to prevent paying a large lump sum upfront. Note that many retailers will allow you to pay off your phone in installments without signing a service contract. This is different from major carriers, which have business models that revolve around locking your into a contract. Avoid interest if possible. If interest is charged on the amount you owe each month, you’ll wind up paying more for your phone in the end. Even online retailers like eBay offer ways to purchase a phone on installments. The website's BillMeLater option allows you to make monthly payment, though it does cost interest. Amazon offers installment payment plans for Amazon products only."
        },
        {
          "headline":"Buy a last-generation or “mid-range” phone from manufacturers.",
          "description":"The expensive smartphones you see advertisements for aren’t the only ones available. In fact, phone manufacturers are making more and more high quality phones for more affordable prices. Some mid-range, or \"affordable flagship\" phones aren’t even available on contracts and can only be purchased online, directly from the manufacturer. Last generation phones can usually be purchased from all sorts of retailers, including major carriers. These are often much cheaper than the newest models, and may not differ substantially. For instance, the newer model may have a better camera, but if this isn't important to you, the last generation may be a better choice. Websites like GottaBeMobile keep track of the best deals, but they don’t sell the phones directly."
        }
      ]
    },
    {
      "name":"Buying an Unlocked Phone",
      "steps":[
        {
          "headline":"Consider purchasing an unlocked phone.",
          "description":"The main advantages of purchasing an unlocked phone revolve around avoiding a contract with a major carrier. These include access to cheaper service options and freedom to upgrade your phone whenever you want. In other words, purchasing an unlocked phone may allow you to pay less for service and avoid fees the next time you decide to upgrade your device. You’ll also be able to sell an unlocked phone for more than a phone that was sold to you be a major carrier. While you can get unlocked phones from popular brands like Apple and Samsung, look for options from other brands too, such as  HTC, Moto, ZTE, and OnePlus."
        },
        {
          "headline":"Check an unlocked phone’s network compatibility.",
          "description":"Some phones will not work with the service provider you plan to use. You can look up a device’s specs on the manufacturer's website or the device itself (usually in a “Network and Connectivity” section). Specifically, you’re looking for the bands and frequencies that the device needs to run. Check the service provider you hope to use to ensure that the bands and frequencies they provide service for match those of the phone you're considering. In the U.S., unlocked phones will more frequently work with AT&T and T-Mobile, but are less likely to work with Verizon and Sprint. Amazon listings often include info on a phone’s compatibility with major carriers."
        },
        {
          "headline":"Select a carrier or wireless service.",
          "description":"Your service options are limited by the type of unlocked phone you select. However, you will likely still have the option between getting service from a major carrier or a more affordable option. Most carriers, including major carriers like AT&T and T-Mobile and budget options like Boost Mobile, Cricket Wireless, and MetroPCS will allow you to purchase service through them and insert a carrier-specific SIM card into your phone to activate your service plan. Note that Sprint charges a fee to get service on an unlocked phone."
        }
      ]
    },
    {
      "name":"Considering Other Ways to Save",
      "steps":[
        {
          "headline":"Determine what specific features you’ll actually need.",
          "description":"There are many different types of smartphones available with all sorts of different features. They come in a wide range of different costs too. Decide what features you will actually use to determine what types of features you don't need. For instance, while two different phones may both have a camera, the quality of the camera lenses (especially in terms of megapixels) may differ substantially. Another important specification is storage. If you want to store photos, music, and more on your phone, you’ll need a phone with more storage, which will increase its cost."
        },
        {
          "headline":"Trade in your old phone.",
          "description":"Many retailers will offer financial incentive to trade-in your old phone. You can also sell your old phone to a third party to offset the purchase of your new phone. You can usually get the most money for an old phone from websites that will quote you a price, send you a postage-paid box, and send you money when they receive your phone. Specific online programs include Gazelle, Amazon, NextWorth, uSell, and EcoATM. Stores that will buy back your phone include Best Buy and Radioshack. Be sure to check multiple stores/websites and get the most money for your old phone."
        },
        {
          "headline":"Buy a refurbished phone.",
          "description":"Refurbished smartphones are often indistinguishable from new ones, and can costs hundreds of dollars less. You can get refurbished phones from carriers or retailers. Note that some refurbished phones are labeled “certified like-new.”"
        },
        {
          "headline":"Compare options from multiple carriers.",
          "description":"If you know you want to purchase your phone through a carrier, compare the overall cost of the phone and service from several different carriers. Often, carriers will try to lure you into a contract by making the phone seem inexpensive. It's important to understand that the cost of the phone is often built into the contract. For instance, one carrier may offer the phone for \"free\" with a two year service contract, but charge $80/month for service. Meanwhile, another may charge you $300 for the phone if you sign a two year contract that costs $40/month. In the long run, the second option costs less ($300+$960 over two years = $1,260, compared to $1,920 over two years), though you have to pay more up front."
        }
      ]
    }
  ],
  "text":" Choosing a Purchasing Option Shop for smartphones online. Online retailers will often offer phones for far lower costs than brick-and-mortar stores or major carriers. Examples of popular websites to purchase smartphones include Amazon, Flipkart, and eBay. These websites offer immense selection and have convenient search features. When searching online, use the features you know you want to help narrow your results. For instance, most sites will allow you to use filters to narrow it down to phones that contain a specified amount of storage with a camera above a certain number of megapixels. Check the website’s return policy before purchasing a phone online. Do not buy from a website that does not accept returns or that charges a restocking fee. Pay for your phone in monthly installments. Whether you buy your smartphone online or in person, you can likely pay off the cost in monthly installments. This will allow you to prevent paying a large lump sum upfront. Note that many retailers will allow you to pay off your phone in installments without signing a service contract. This is different from major carriers, which have business models that revolve around locking your into a contract. Avoid interest if possible. If interest is charged on the amount you owe each month, you’ll wind up paying more for your phone in the end. Even online retailers like eBay offer ways to purchase a phone on installments. The website's BillMeLater option allows you to make monthly payment, though it does cost interest. Amazon offers installment payment plans for Amazon products only. Buy a last-generation or “mid-range” phone from manufacturers. The expensive smartphones you see advertisements for aren’t the only ones available. In fact, phone manufacturers are making more and more high quality phones for more affordable prices. Some mid-range, or \"affordable flagship\" phones aren’t even available on contracts and can only be purchased online, directly from the manufacturer. Last generation phones can usually be purchased from all sorts of retailers, including major carriers. These are often much cheaper than the newest models, and may not differ substantially. For instance, the newer model may have a better camera, but if this isn't important to you, the last generation may be a better choice. Websites like GottaBeMobile keep track of the best deals, but they don’t sell the phones directly. Buying an Unlocked Phone Consider purchasing an unlocked phone. The main advantages of purchasing an unlocked phone revolve around avoiding a contract with a major carrier. These include access to cheaper service options and freedom to upgrade your phone whenever you want. In other words, purchasing an unlocked phone may allow you to pay less for service and avoid fees the next time you decide to upgrade your device. You’ll also be able to sell an unlocked phone for more than a phone that was sold to you be a major carrier. While you can get unlocked phones from popular brands like Apple and Samsung, look for options from other brands too, such as  HTC, Moto, ZTE, and OnePlus. Check an unlocked phone’s network compatibility. Some phones will not work with the service provider you plan to use. You can look up a device’s specs on the manufacturer's website or the device itself (usually in a “Network and Connectivity” section). Specifically, you’re looking for the bands and frequencies that the device needs to run. Check the service provider you hope to use to ensure that the bands and frequencies they provide service for match those of the phone you're considering. In the U.S., unlocked phones will more frequently work with AT&T and T-Mobile, but are less likely to work with Verizon and Sprint. Amazon listings often include info on a phone’s compatibility with major carriers. Select a carrier or wireless service. Your service options are limited by the type of unlocked phone you select. However, you will likely still have the option between getting service from a major carrier or a more affordable option. Most carriers, including major carriers like AT&T and T-Mobile and budget options like Boost Mobile, Cricket Wireless, and MetroPCS will allow you to purchase service through them and insert a carrier-specific SIM card into your phone to activate your service plan. Note that Sprint charges a fee to get service on an unlocked phone. Considering Other Ways to Save Determine what specific features you’ll actually need. There are many different types of smartphones available with all sorts of different features. They come in a wide range of different costs too. Decide what features you will actually use to determine what types of features you don't need. For instance, while two different phones may both have a camera, the quality of the camera lenses (especially in terms of megapixels) may differ substantially. Another important specification is storage. If you want to store photos, music, and more on your phone, you’ll need a phone with more storage, which will increase its cost. Trade in your old phone. Many retailers will offer financial incentive to trade-in your old phone. You can also sell your old phone to a third party to offset the purchase of your new phone. You can usually get the most money for an old phone from websites that will quote you a price, send you a postage-paid box, and send you money when they receive your phone. Specific online programs include Gazelle, Amazon, NextWorth, uSell, and EcoATM. Stores that will buy back your phone include Best Buy and Radioshack. Be sure to check multiple stores/websites and get the most money for your old phone. Buy a refurbished phone. Refurbished smartphones are often indistinguishable from new ones, and can costs hundreds of dollars less. You can get refurbished phones from carriers or retailers. Note that some refurbished phones are labeled “certified like-new.” Compare options from multiple carriers. If you know you want to purchase your phone through a carrier, compare the overall cost of the phone and service from several different carriers. Often, carriers will try to lure you into a contract by making the phone seem inexpensive. It's important to understand that the cost of the phone is often built into the contract. For instance, one carrier may offer the phone for \"free\" with a two year service contract, but charge $80/month for service. Meanwhile, another may charge you $300 for the phone if you sign a two year contract that costs $40/month. In the long run, the second option costs less ($300+$960 over two years = $1,260, compared to $1,920 over two years), though you have to pay more up front.",
  "tyn_model":[
    "phone",
    "phones",
    "smartphones",
    "smartphone",
    "“mid",
    "” phone",
    "phone manufacturers",
    "“network",
    "” section",
    "amazon",
    "“certified",
    "” compare",
    "carriers",
    "carrier"
  ],
  "tyn_section":[

  ]
}