{
  "title":"How to Clean a Nespresso Machine",
  "url":"https://www.wikihow.com/Clean-a-Nespresso-Machine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Coffee Accessories"
  ],
  "methods":[
    {
      "name":"Doing Routine Cleaning",
      "steps":[
        {
          "headline":"Clean the drip tray daily.",
          "description":"Each day, remove the drip tray from your Nespresso machine and wash it. Use dish detergent and a clean cloth. If there is any buildup in the drip tray, make sure to scrub it away. Rinse the drip tray with warm water and let it air dry. Also clean the capsule container the same way. Without proper cleaning, your drip tray will grow bacteria and mold."
        },
        {
          "headline":"Wash the water tank daily.",
          "description":"While you are cleaning your drip tray, remove the water tank and the lid from the machine. Wash both parts with mild dishwashing detergent. Rinse with warm water, making sure to remove all suds. If you don’t use your Nespresso machine daily, consider washing the lid and water tank every few days. Let the lid and water tank air dry before reassembling. You can also dry it with a clean cloth. Avoid letting water sit in the water tank. It can start growing mold or bacteria."
        },
        {
          "headline":"Wipe the capsule detector lens with a soft cloth.",
          "description":"Take a dry soft cloth to gently wipe the capsule detector lens. There is no need to use water or soap. You just want to wipe away any smudges on the lens. The detector lens is located inside the machine. You can get to it once you remove the maintenance module, which is attached to the drip tray and holds the cups."
        },
        {
          "headline":"Wipe down the external parts regularly.",
          "description":"The coffee outlet and outside cover of the machine should be wiped down often. Consider doing this multiple times each week. Use a clean damp cloth to wipe down the machine. The coffee outlet is the place where the coffee drains into your cup. Use the cloth to wipe away any buildup. Wipe down the outside edges and the inside walls where the capsule holder goes."
        },
        {
          "headline":"Avoid strong cleaners on your Nespresso machine.",
          "description":"When cleaning this machine, never use strong or abrasive cleaners. Use only mild, odorless detergents. Don’t use sponges when cleaning. Only use soft cloths. Never submerge any of the parts in water or other liquid."
        }
      ]
    },
    {
      "name":"Descaling Your Machine",
      "steps":[
        {
          "headline":"Descale your machine every three months.",
          "description":"Your Nespresso machine will need to be descaled about every three months. If you drink a lot of coffee, you should descale it every 300 capsules. Some models have a light on the machine that blinks when you need to descale. If you connect your machine to the online app, the app will tell you when your machine needs to be descaled."
        },
        {
          "headline":"Ready the machine.",
          "description":"Before you begin, make sure you empty the capsule container of all capsules. You should also empty the drip tray. Replace them back into the machine. Then, turn the machine on."
        },
        {
          "headline":"Put your machine into descaling mode.",
          "description":"Depending on your model, you will press different buttons to start the descaling mode. The buttons will blink, and the machine will beep when you can let go. This lets you know you are in the descaling mode. The VertuoLine has one button you need to hold for around seven seconds. The Pixie, Inissia, and CitiZ models have two flashing buttons you hold at the same time for approximately three seconds. For the Prodigio, press the three coffee buttons at the same time. Hold them for three to six seconds."
        },
        {
          "headline":"Fill the tank with descaling solution.",
          "description":"Pour one container of Nespresso descaling solution into the water tank. Then, add half a liter of water. Close the slider and place a container large enough to catch all of the water from the water tank under the coffee outlet. You can buy the descaling solution from the Nespresso website."
        },
        {
          "headline":"Make your own descaling solution.",
          "description":"If you don’t want to buy a commercial descaling solution, you can make your own. Run the homemade solution through the machine just like commercial solution. Before using a homemade solution, make sure to check the instruction manual or call the manufacturer to make sure it is safe. You can make a solution with citric acid. Use 1 part citric acid to 20 parts water. You can also use lemon juice or vinegar. Mix equal parts of either liquid with equal parts water. If you use citric acid or lemon juice, rinse the machine twice before making coffee. If you use vinegar, run five rinse cycles."
        },
        {
          "headline":"Begin the descaling process.",
          "description":"Press any of the blinking coffee buttons. This begins descaling your machine. The machine will run the water through the machine and expel the water into the container under the coffee outlet. When the machine stops pushing the water through the outlet, it is done."
        },
        {
          "headline":"Repeat the descaling process.",
          "description":"Pour the water in the container back into the water tank to go through the descaling process again. Once again, press one of the blinking buttons to start the machine. The machine will do the same thing as before. When it is finished, it will stop running and the water will be back in the container."
        },
        {
          "headline":"Rinse all the parts.",
          "description":"Toss out the solution that ran through the machine. Remove the water tank, drip tray, and cup support. Rinse them thoroughly with warm water. Make sure all of the residue from the descaling solutions is completely rinsed from the parts. Reassemble the machine once you’ve rinsed and dried the parts."
        },
        {
          "headline":"Rinse the machine.",
          "description":"Fill the water tank with clean water and place the container back under the coffee outlet. Click one of the blinking lights to make the machine run the clean water through it. This rinses the solution from the machine. Pour out the water. Place clean water into the water tank and hit the blinking lights to repeat the rinsing process once more."
        },
        {
          "headline":"Exit descaling mode.",
          "description":"After you have rinsed the machine with clean water twice, you are done with the descaling process. Press all the coffee buttons until the machine beeps. This lets you know you have exited descaling mode. Let the machine dry for at least 10 minutes before you use again."
        }
      ]
    }
  ],
  "text":" Doing Routine Cleaning Clean the drip tray daily. Each day, remove the drip tray from your Nespresso machine and wash it. Use dish detergent and a clean cloth. If there is any buildup in the drip tray, make sure to scrub it away. Rinse the drip tray with warm water and let it air dry. Also clean the capsule container the same way. Without proper cleaning, your drip tray will grow bacteria and mold. Wash the water tank daily. While you are cleaning your drip tray, remove the water tank and the lid from the machine. Wash both parts with mild dishwashing detergent. Rinse with warm water, making sure to remove all suds. If you don’t use your Nespresso machine daily, consider washing the lid and water tank every few days. Let the lid and water tank air dry before reassembling. You can also dry it with a clean cloth. Avoid letting water sit in the water tank. It can start growing mold or bacteria. Wipe the capsule detector lens with a soft cloth. Take a dry soft cloth to gently wipe the capsule detector lens. There is no need to use water or soap. You just want to wipe away any smudges on the lens. The detector lens is located inside the machine. You can get to it once you remove the maintenance module, which is attached to the drip tray and holds the cups. Wipe down the external parts regularly. The coffee outlet and outside cover of the machine should be wiped down often. Consider doing this multiple times each week. Use a clean damp cloth to wipe down the machine. The coffee outlet is the place where the coffee drains into your cup. Use the cloth to wipe away any buildup. Wipe down the outside edges and the inside walls where the capsule holder goes. Avoid strong cleaners on your Nespresso machine. When cleaning this machine, never use strong or abrasive cleaners. Use only mild, odorless detergents. Don’t use sponges when cleaning. Only use soft cloths. Never submerge any of the parts in water or other liquid. Descaling Your Machine Descale your machine every three months. Your Nespresso machine will need to be descaled about every three months. If you drink a lot of coffee, you should descale it every 300 capsules. Some models have a light on the machine that blinks when you need to descale. If you connect your machine to the online app, the app will tell you when your machine needs to be descaled. Ready the machine. Before you begin, make sure you empty the capsule container of all capsules. You should also empty the drip tray. Replace them back into the machine. Then, turn the machine on. Put your machine into descaling mode. Depending on your model, you will press different buttons to start the descaling mode. The buttons will blink, and the machine will beep when you can let go. This lets you know you are in the descaling mode. The VertuoLine has one button you need to hold for around seven seconds. The Pixie, Inissia, and CitiZ models have two flashing buttons you hold at the same time for approximately three seconds. For the Prodigio, press the three coffee buttons at the same time. Hold them for three to six seconds. Fill the tank with descaling solution. Pour one container of Nespresso descaling solution into the water tank. Then, add half a liter of water. Close the slider and place a container large enough to catch all of the water from the water tank under the coffee outlet. You can buy the descaling solution from the Nespresso website. Make your own descaling solution. If you don’t want to buy a commercial descaling solution, you can make your own. Run the homemade solution through the machine just like commercial solution. Before using a homemade solution, make sure to check the instruction manual or call the manufacturer to make sure it is safe. You can make a solution with citric acid. Use 1 part citric acid to 20 parts water. You can also use lemon juice or vinegar. Mix equal parts of either liquid with equal parts water. If you use citric acid or lemon juice, rinse the machine twice before making coffee. If you use vinegar, run five rinse cycles. Begin the descaling process. Press any of the blinking coffee buttons. This begins descaling your machine. The machine will run the water through the machine and expel the water into the container under the coffee outlet. When the machine stops pushing the water through the outlet, it is done. Repeat the descaling process. Pour the water in the container back into the water tank to go through the descaling process again. Once again, press one of the blinking buttons to start the machine. The machine will do the same thing as before. When it is finished, it will stop running and the water will be back in the container. Rinse all the parts. Toss out the solution that ran through the machine. Remove the water tank, drip tray, and cup support. Rinse them thoroughly with warm water. Make sure all of the residue from the descaling solutions is completely rinsed from the parts. Reassemble the machine once you’ve rinsed and dried the parts. Rinse the machine. Fill the water tank with clean water and place the container back under the coffee outlet. Click one of the blinking lights to make the machine run the clean water through it. This rinses the solution from the machine. Pour out the water. Place clean water into the water tank and hit the blinking lights to repeat the rinsing process once more. Exit descaling mode. After you have rinsed the machine with clean water twice, you are done with the descaling process. Press all the coffee buttons until the machine beeps. This lets you know you have exited descaling mode. Let the machine dry for at least 10 minutes before you use again.",
  "tyn_model":[
    "water",
    "nespresso machine",
    "citric acid",
    "drip tray",
    "cleaners",
    "lemon juice",
    "vinegar",
    "dish detergent",
    "dishwashing detergent",
    "cloth",
    "detergents",
    "sponges",
    "machine",
    "nespresso descaling solution",
    "nespresso website",
    "container"
  ],
  "tyn_section":[

  ]
}