{
  "title":"How to Prepare Shrimp in Healthy Ways",
  "url":"https://www.wikihow.com/Prepare-Shrimp-in-Healthy-Ways",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Prawns and Shrimp"
  ],
  "methods":[
    {
      "name":"Cooking Shrimp in a Healthy Way",
      "steps":[
        {
          "headline":"Steam your shrimp.",
          "description":"Steaming your shrimp does not add any extra calories and fat through cooking oils. To steam your shrimp, place your shrimp in a covered basket with small holes. Place this basket above a pot of boiling water. The heat from the steam will cook the shrimp. Steaming takes about five to six minutes. Shrimp will turn a pinkish color when they're done. Any prep work, such as shelling or seasoning the shrimp, should be done prior to steaming them."
        },
        {
          "headline":"Grill your shrimp.",
          "description":"Grilling shrimp also limits additives. First, brush the shrimp with oil or a non-stick spray. Place your shrimp near the edge of the grill. After a few minutes, your shrimp will start to release some moisture. At this point, flip your shrimp and allow them to cook for a few minutes on the other side. You can use grilling skewers or a grill basket to prevent your shrimp from falling through the grill grates."
        },
        {
          "headline":"Saute your shrimp.",
          "description":"While sauteeing shrimp calls for the use of oil, heart healthy oils like olive oil will keep your dish healthy. Olive oil can also add some flavor. Heat up your oil in a pan over medium heat and then add the shrimp. Cook the shrimp for two to three minutes on each side. When done, the shrimp should be a bright, pink shade. While olive oil is healthy, it is high in calories. Make sure to only use a small amount of oil while cooking your shrimp. The precise amount depends on how many shrimp you're grilling, as more shrimp need more oil, but try to stick to only one to two tablespoons."
        },
        {
          "headline":"Boil your shrimp.",
          "description":"Boiling your shrimp only requires water and a bit of salt, so it does not add calories to the shrimp. Add your water and shrimp to a pot. Bring it to a boil. Allow it to boil for only two minutes before removing the pot from the heat. Cover the pot and let it sit for five to ten minutes before serving your shrimp. Smaller shrimp only need about five minutes to cook, while larger ones should cook for closer to ten minutes."
        }
      ]
    },
    {
      "name":"Serving Shrimp in Healthy Recipes",
      "steps":[
        {
          "headline":"Add shrimp to a veggie stir fry.",
          "description":"Vegetables cooked with a little olive oil and flavoring over the stove is a great, nutritious dish for dinner or lunch. Toss in a few shrimp and cook them with your stir fry. This will add some protein and result in a healthy meal that includes shrimp. Remember to limit your use of oil, as it's high calorie. You can add any flavor profile you want to a stir fry, so experiment with different spices."
        },
        {
          "headline":"Eat shrimp with salads.",
          "description":"A salad is a healthy choice for a lunch. Adding shrimp to a salad can give it a protein boost, resulting in a meal that will keep you full longer. This cuts down on snacking throughout the day. Do not overdo it with salad dressing. Stick to things like vinaigrettes over creamy, high calorie dressings."
        },
        {
          "headline":"Have shrimp tacos.",
          "description":"If you serve tacos with whole wheat, low calorie tortillas, shrimp tacos can be a healthy choice for any meal. Add healthy foods to the tacos, such as peppers, avocados, and lettuce. If you add things like cheese and salsa, keep it minimal to avoid extra fat, salt, and calories."
        },
        {
          "headline":"Eat shrimp with cucumber noodles.",
          "description":"Shrimp can make an excellent addition to a noodle bowl. However, avoid starchy noodles that are high in calories. Instead, opt for noodles made out of thin strands of sliced cucumber. These will give your noodle dish an extra crunch and added nutrition. Flavor your noodle bowl with toppings like soy or peanut sauce. Add vegetables to your noodle bowl to make it extra healthy."
        },
        {
          "headline":"Find healthier ways to bread shrimp.",
          "description":"Many people prefer to bread shrimp. Breading shrimp can add unnecessary carbs, starch, and calories. Instead of using conventional breadcrumbs, try using healthier options like cornflakes, coconut crumbs, oats, rosemary, or dried herbs. These will add flavor and crunch but provide more nutrients than simple breadcrumbs. You can also try whole wheat breadcrumbs."
        }
      ]
    },
    {
      "name":"Avoiding Unhealthy Practices",
      "steps":[
        {
          "headline":"Wash your hands before and after handling your shrimp.",
          "description":"When handling raw meat, wash your hands under running water first. This will keep you from adding bacteria to the shrimp. You should also wash your hands thoroughly after handling raw shrimp to prevent the spread of foodborne illnesses."
        },
        {
          "headline":"Peel and de-vein your shrimp.",
          "description":"If your shrimp is not already peeled and de-veined when you purchase it, do this at home prior to cooking. Peel a shrimp by hand by removing its legs and then peeling off the shell. You should be able to see the thin blue vein running through the shrimp. Make a shallow cut near the top of the shrimp, grab onto the vein, and gently pull it out. Eating the vein is not harmful, and you can skip de-veining in a rush. However, many people dislike the taste and texture of the vein."
        },
        {
          "headline":"Pick out the right shrimp.",
          "description":"When choosing shrimp at the supermarket, make sure you choose the best shrimp. Fresher shrimp will taste better and be healthier overall. Avoid shrimp that gives off a fishy odor or an ammonia-like smell. Fresh shrimp should be translucent and shiny. Avoid mushy, slimy shrimp."
        },
        {
          "headline":"Opt for healthy cooking oils.",
          "description":"When cooking with oils, make sure to opt for healthy oils. Oils high in fat and calories can make a shrimp dish less healthy. Avoid vegetable oil when cooking. Instead, go for olive, soy bean, sunflower, peanut, corn, or canola oil."
        }
      ]
    }
  ],
  "text":" Cooking Shrimp in a Healthy Way Steam your shrimp. Steaming your shrimp does not add any extra calories and fat through cooking oils. To steam your shrimp, place your shrimp in a covered basket with small holes. Place this basket above a pot of boiling water. The heat from the steam will cook the shrimp. Steaming takes about five to six minutes. Shrimp will turn a pinkish color when they're done. Any prep work, such as shelling or seasoning the shrimp, should be done prior to steaming them. Grill your shrimp. Grilling shrimp also limits additives. First, brush the shrimp with oil or a non-stick spray. Place your shrimp near the edge of the grill. After a few minutes, your shrimp will start to release some moisture. At this point, flip your shrimp and allow them to cook for a few minutes on the other side. You can use grilling skewers or a grill basket to prevent your shrimp from falling through the grill grates. Saute your shrimp. While sauteeing shrimp calls for the use of oil, heart healthy oils like olive oil will keep your dish healthy. Olive oil can also add some flavor. Heat up your oil in a pan over medium heat and then add the shrimp. Cook the shrimp for two to three minutes on each side. When done, the shrimp should be a bright, pink shade. While olive oil is healthy, it is high in calories. Make sure to only use a small amount of oil while cooking your shrimp. The precise amount depends on how many shrimp you're grilling, as more shrimp need more oil, but try to stick to only one to two tablespoons. Boil your shrimp. Boiling your shrimp only requires water and a bit of salt, so it does not add calories to the shrimp. Add your water and shrimp to a pot. Bring it to a boil. Allow it to boil for only two minutes before removing the pot from the heat. Cover the pot and let it sit for five to ten minutes before serving your shrimp. Smaller shrimp only need about five minutes to cook, while larger ones should cook for closer to ten minutes. Serving Shrimp in Healthy Recipes Add shrimp to a veggie stir fry. Vegetables cooked with a little olive oil and flavoring over the stove is a great, nutritious dish for dinner or lunch. Toss in a few shrimp and cook them with your stir fry. This will add some protein and result in a healthy meal that includes shrimp. Remember to limit your use of oil, as it's high calorie. You can add any flavor profile you want to a stir fry, so experiment with different spices. Eat shrimp with salads. A salad is a healthy choice for a lunch. Adding shrimp to a salad can give it a protein boost, resulting in a meal that will keep you full longer. This cuts down on snacking throughout the day. Do not overdo it with salad dressing. Stick to things like vinaigrettes over creamy, high calorie dressings. Have shrimp tacos. If you serve tacos with whole wheat, low calorie tortillas, shrimp tacos can be a healthy choice for any meal. Add healthy foods to the tacos, such as peppers, avocados, and lettuce. If you add things like cheese and salsa, keep it minimal to avoid extra fat, salt, and calories. Eat shrimp with cucumber noodles. Shrimp can make an excellent addition to a noodle bowl. However, avoid starchy noodles that are high in calories. Instead, opt for noodles made out of thin strands of sliced cucumber. These will give your noodle dish an extra crunch and added nutrition. Flavor your noodle bowl with toppings like soy or peanut sauce. Add vegetables to your noodle bowl to make it extra healthy. Find healthier ways to bread shrimp. Many people prefer to bread shrimp. Breading shrimp can add unnecessary carbs, starch, and calories. Instead of using conventional breadcrumbs, try using healthier options like cornflakes, coconut crumbs, oats, rosemary, or dried herbs. These will add flavor and crunch but provide more nutrients than simple breadcrumbs. You can also try whole wheat breadcrumbs. Avoiding Unhealthy Practices Wash your hands before and after handling your shrimp. When handling raw meat, wash your hands under running water first. This will keep you from adding bacteria to the shrimp. You should also wash your hands thoroughly after handling raw shrimp to prevent the spread of foodborne illnesses. Peel and de-vein your shrimp. If your shrimp is not already peeled and de-veined when you purchase it, do this at home prior to cooking. Peel a shrimp by hand by removing its legs and then peeling off the shell. You should be able to see the thin blue vein running through the shrimp. Make a shallow cut near the top of the shrimp, grab onto the vein, and gently pull it out. Eating the vein is not harmful, and you can skip de-veining in a rush. However, many people dislike the taste and texture of the vein. Pick out the right shrimp. When choosing shrimp at the supermarket, make sure you choose the best shrimp. Fresher shrimp will taste better and be healthier overall. Avoid shrimp that gives off a fishy odor or an ammonia-like smell. Fresh shrimp should be translucent and shiny. Avoid mushy, slimy shrimp. Opt for healthy cooking oils. When cooking with oils, make sure to opt for healthy oils. Oils high in fat and calories can make a shrimp dish less healthy. Avoid vegetable oil when cooking. Instead, go for olive, soy bean, sunflower, peanut, corn, or canola oil.",
  "tyn_model":[
    "shrimp",
    "oil",
    "pot",
    "water",
    "olive oil",
    "salad",
    "noodle bowl",
    "non-stick spray",
    "grill",
    "grilling skewers",
    "grill basket",
    "grill grates",
    "pan",
    "salt",
    "stir fry",
    "salad dressing",
    "peppers",
    "avocados",
    "lettuce",
    "salsa",
    "cucumber noodles",
    "noodles",
    "cucumber",
    "vegetables",
    "cornflakes",
    "oats",
    "rosemary",
    "herbs",
    "oils",
    "vegetable oil",
    "olive",
    "canola oil"
  ],
  "tyn_section":[

  ]
}