{
  "title":"How to Make a Vegetarian Cassoulet",
  "url":"https://www.wikihow.com/Make-a-Vegetarian-Cassoulet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian"
  ],
  "steps":[
    {
      "headline":"Heat oven to 140 °C (284 °F).",
      "description":""
    },
    {
      "headline":"Heat olive oil or butter in a large frying pan (about 1T worth).",
      "description":"Fry onions, garlic, carrot, celery (extra vegetables can also be added at this stage)."
    },
    {
      "headline":"Add beans, tomatoes, stock and chopped herbs (except parsley) and stir well.",
      "description":"Taste for seasoning, it will get a little saltier as the stock evaporates, but you are looking for the strength of garlic and herbs."
    },
    {
      "headline":"Place into a large casserole dish and top with the breadcrumbs and sprinkle with about 1T melted butter or oil.",
      "description":""
    },
    {
      "headline":"Bake for an hour up to 1 1/2 hrs.",
      "description":"Traditionally, the crust is broken up occasionally through the baking time so its not stirred in but agitated gently with a fork and baked again to become a thicker and more golden crust. The crust can be the best part."
    },
    {
      "headline":"When the beans are tender and the stock is mostly all absorbed, sprinkle with the chopped parsley.",
      "description":"It does add to the flavour as well as looking nice."
    },
    {
      "headline":"Serve and enjoy, ensuring everyone gets a bit of the crust top.",
      "description":""
    }
  ],
  "text":" Heat oven to 140 °C (284 °F).  Heat olive oil or butter in a large frying pan (about 1T worth). Fry onions, garlic, carrot, celery (extra vegetables can also be added at this stage). Add beans, tomatoes, stock and chopped herbs (except parsley) and stir well. Taste for seasoning, it will get a little saltier as the stock evaporates, but you are looking for the strength of garlic and herbs. Place into a large casserole dish and top with the breadcrumbs and sprinkle with about 1T melted butter or oil.  Bake for an hour up to 1 1/2 hrs. Traditionally, the crust is broken up occasionally through the baking time so its not stirred in but agitated gently with a fork and baked again to become a thicker and more golden crust. The crust can be the best part. When the beans are tender and the stock is mostly all absorbed, sprinkle with the chopped parsley. It does add to the flavour as well as looking nice. Serve and enjoy, ensuring everyone gets a bit of the crust top. ",
  "tyn_model":[
    "stock",
    "garlic",
    "beans",
    "herbs",
    "oven",
    "olive oil",
    "butter",
    "large frying pan",
    "onions",
    "carrot",
    "celery",
    "tomatoes",
    "large casserole dish",
    "melted butter",
    "oil",
    "fork",
    "parsley"
  ],
  "tyn_section":[

  ]
}