{
  "title":"How to Make a Beetroot and Chicken Salad",
  "url":"https://www.wikihow.com/Make-a-Beetroot-and-Chicken-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Chicken Salads"
  ],
  "steps":[
    {
      "headline":"Gather your ingredients.",
      "description":"Preheat your oven to 392°F (200°C)."
    },
    {
      "headline":"Place the beetroots in a roasting pan.",
      "description":"Drizzle them with 2 teaspoons of the olive oil."
    },
    {
      "headline":"Bake the beetroots in the oven for 20 minutes, or until they are tender.",
      "description":""
    },
    {
      "headline":"Remove them from the oven.",
      "description":"Set them aside, so that they can slightly cool."
    },
    {
      "headline":"While the beetroots are cooling, preheat a char-grill pan on high.",
      "description":""
    },
    {
      "headline":"Peel the beetroots once you can touch them.",
      "description":"Cut them into quarters."
    },
    {
      "headline":"On a separate plate, season the chicken fillets with salt and pepper.",
      "description":""
    },
    {
      "headline":"Cook the chicken on the preheated grill for 4-5 minutes on each side, or until the meat is thoroughly cooked.",
      "description":""
    },
    {
      "headline":"Transfer the chicken back onto its original plate.",
      "description":"Cover it with aluminum foil."
    },
    {
      "headline":"Set it aside for 5 minutes.",
      "description":"Then use a sharp knife to cut the meat into thick slices."
    },
    {
      "headline":"Place the reserved beetroot leaves, the radicchio treviso, the spinach leaves, and the hazelnuts in a large bowl.",
      "description":"Gently toss the ingredients until everything is combined."
    },
    {
      "headline":"Whisk together the vinegar, the remaining oil, the mustard, and a little bit of salt and pepper.",
      "description":""
    },
    {
      "headline":"Drizzle this dressing over the salad mixture in the large bowl.",
      "description":"Gently toss the ingredients until everything is combined."
    },
    {
      "headline":"Serve the salad evenly among the serving plates.",
      "description":"Top it with the chicken and beetroot, and then sprinkle on the goat's cheese."
    }
  ],
  "text":" Gather your ingredients. Preheat your oven to 392°F (200°C). Place the beetroots in a roasting pan. Drizzle them with 2 teaspoons of the olive oil. Bake the beetroots in the oven for 20 minutes, or until they are tender.  Remove them from the oven. Set them aside, so that they can slightly cool. While the beetroots are cooling, preheat a char-grill pan on high.  Peel the beetroots once you can touch them. Cut them into quarters. On a separate plate, season the chicken fillets with salt and pepper.  Cook the chicken on the preheated grill for 4-5 minutes on each side, or until the meat is thoroughly cooked.  Transfer the chicken back onto its original plate. Cover it with aluminum foil. Set it aside for 5 minutes. Then use a sharp knife to cut the meat into thick slices. Place the reserved beetroot leaves, the radicchio treviso, the spinach leaves, and the hazelnuts in a large bowl. Gently toss the ingredients until everything is combined. Whisk together the vinegar, the remaining oil, the mustard, and a little bit of salt and pepper.  Drizzle this dressing over the salad mixture in the large bowl. Gently toss the ingredients until everything is combined. Serve the salad evenly among the serving plates. Top it with the chicken and beetroot, and then sprinkle on the goat's cheese.",
  "tyn_model":[
    "chicken",
    "oven",
    "beetroot",
    "large bowl",
    "roasting pan",
    "olive oil",
    "char-grill pan",
    "plate",
    "salt and pepper",
    "grill",
    "aluminum foil",
    "radicchio treviso",
    "spinach",
    "hazelnuts",
    "vinegar",
    "oil",
    "mustard",
    "salt",
    "pepper",
    "serving plates",
    "goat's cheese"
  ],
  "tyn_section":[

  ]
}