{
  "title":"How to Make Chicken Fried Steak With Milk Gravy",
  "url":"https://www.wikihow.com/Make-Chicken-Fried-Steak-With-Milk-Gravy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb",
    "Steak Dishes"
  ],
  "methods":[
    {
      "name":"Steak",
      "steps":[
        {
          "headline":"Add a 2 cups or so flour to a resealable food storage bag.",
          "description":""
        },
        {
          "headline":"Sprinkle salt and pepper into the flour.",
          "description":"Figure about a teaspoon of salt and 1/4 to 1/2 teaspoon pepper."
        },
        {
          "headline":"Seal bag and shake the flour mixture to combine the ingredients.",
          "description":""
        },
        {
          "headline":"Pound round steak until thin.",
          "description":""
        },
        {
          "headline":"Heat vegetable shortening or oil over medium-high heat.",
          "description":""
        },
        {
          "headline":"Add steaks to the seasoned flour mixture.",
          "description":"Shake to coat."
        },
        {
          "headline":"Brown the steaks and remove to a platter.",
          "description":""
        },
        {
          "headline":"Add about 1/2 cup water (or use the amount of water called for in your pressure cooker manual).",
          "description":""
        },
        {
          "headline":"Add the steaks.",
          "description":""
        },
        {
          "headline":"Bring the pressure cooker up to pressure.",
          "description":""
        },
        {
          "headline":"Cook the steaks at 15 pounds pressure for about 15 minutes.",
          "description":"This timing is for 2,400 elevation. You may have to adjust your timing based on your elevation."
        },
        {
          "headline":"Release the pressure immediately using the directions in your pressure cooker manual.",
          "description":""
        },
        {
          "headline":"Remove steaks to a warm platter.",
          "description":"Keep warm."
        }
      ]
    },
    {
      "name":"Gravy",
      "steps":[
        {
          "headline":"Heat milk.",
          "description":""
        },
        {
          "headline":"Measure out meat drippings.",
          "description":"Add enough fat to make 1/4 cup."
        },
        {
          "headline":"Add 1/4 cup flour to the meat drippings.",
          "description":""
        },
        {
          "headline":"Add the salt.",
          "description":""
        },
        {
          "headline":"Whisk until the flour mixture is smooth.",
          "description":""
        },
        {
          "headline":"Cook over low to medium heat until the mixture is smooth.",
          "description":"This should take about 1 minute."
        },
        {
          "headline":"Whisk in the hot milk.",
          "description":""
        },
        {
          "headline":"Cook until the gravy is smooth and thickened.",
          "description":"The gravy should boil 1 minute to thicken the mixture."
        },
        {
          "headline":"Serve gravy with steaks.",
          "description":""
        }
      ]
    }
  ],
  "text":" Steak Add a 2 cups or so flour to a resealable food storage bag.  Sprinkle salt and pepper into the flour. Figure about a teaspoon of salt and 1/4 to 1/2 teaspoon pepper. Seal bag and shake the flour mixture to combine the ingredients.  Pound round steak until thin.  Heat vegetable shortening or oil over medium-high heat.  Add steaks to the seasoned flour mixture. Shake to coat. Brown the steaks and remove to a platter.  Add about 1/2 cup water (or use the amount of water called for in your pressure cooker manual).  Add the steaks.  Bring the pressure cooker up to pressure.  Cook the steaks at 15 pounds pressure for about 15 minutes. This timing is for 2,400 elevation. You may have to adjust your timing based on your elevation. Release the pressure immediately using the directions in your pressure cooker manual.  Remove steaks to a warm platter. Keep warm. Gravy Heat milk.  Measure out meat drippings. Add enough fat to make 1/4 cup. Add 1/4 cup flour to the meat drippings.  Add the salt.  Whisk until the flour mixture is smooth.  Cook over low to medium heat until the mixture is smooth. This should take about 1 minute. Whisk in the hot milk.  Cook until the gravy is smooth and thickened. The gravy should boil 1 minute to thicken the mixture. Serve gravy with steaks. ",
  "tyn_model":[
    "flour",
    "salt",
    "pressure cooker",
    "pepper",
    "water",
    "milk",
    "resealable food storage bag",
    "vegetable shortening",
    "oil",
    "gravy",
    "steaks"
  ],
  "tyn_section":[

  ]
}