{
  "title":"How to Clean Corningware",
  "url":"https://www.wikihow.com/Clean-Corningware",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Cookware"
  ],
  "methods":[
    {
      "name":"Using a Corningware Cleaner",
      "steps":[
        {
          "headline":"Fill your dish with the cleaner and hot water.",
          "description":"Squeeze a small amount of the specially formulated Corningware cleaner into the water per the instructions on the bottle. Let the cleaner set for 30 minutes to 1 hour. The temperature of the water should be around 105 to 115 degrees Fahrenheit (40 to 46 degrees Celsius). You can purchase specially formulated Corningware cleaners online."
        },
        {
          "headline":"Scrub the Corningware.",
          "description":"After the cleaner has set, use a non-abrasive cleaning pad, like a plastic or nylon mesh pad, to scrub your Corningware. Scrub until all the baked-on food and grease is removed. Repeat steps one and two for hard-to-remove stains."
        },
        {
          "headline":"Clean your dish with a dishwashing detergent.",
          "description":"For an additional clean, squeeze a small amount of detergent into your dish with some warm water. Scrub your dish with a nylon mesh pad to remove any remaining residue before you rinse and dry it. Cleaning your Corningware with a dishwashing detergent is optional and may not be necessary."
        },
        {
          "headline":"Rinse and dry your Corningware.",
          "description":"Do this once you have removed all of the stains. Rinse the Corningware with warm water until all the soap and residue are removed. Then let it air dry on a drying rack, or wipe it with a clean, dry towel."
        }
      ]
    },
    {
      "name":"Cleaning Your Corningware with Oven Cleaner",
      "steps":[
        {
          "headline":"Spray your dish with the oven cleaner.",
          "description":"To protect your hands, wear nylon gloves or another pair of protective gloves. Cover the entire dish with the spray, concentrating on the stained areas. You may want to spray your dish outside to avoid getting oven cleaner on any surfaces in your kitchen. You can find oven cleaners at your local hardware or grocery store."
        },
        {
          "headline":"Place your dish inside a garbage bag.",
          "description":"Secure the bag with a knot or a twist tie. Let the spray set overnight. Place the bag in a shaded area outside; do not place it in the sun."
        },
        {
          "headline":"Open the bag outside.",
          "description":"Make sure the opening of the bag is pointing away from your face before you open it. This way you can avoid breathing in any noxious fumes that have built up in the bag overnight. Then pre-rinse your Corningware outside with a gardening hose."
        },
        {
          "headline":"Wash your dish with soap and water.",
          "description":"Place your Corningware in the sink. Fill it with hot water. Squeeze an appropriate amount of dish soap into the water. Use a plastic or nylon mesh pad to scrub and remove any remaining food, grease, and oven cleaner. Do not use metal pads to scrub your Corningware; these will scratch it."
        },
        {
          "headline":"Rinse and dry.",
          "description":"Once your Corningware is clean, rinse it with warm water until all the soap and residue are removed. Dry it with a clean, dry cloth, or place it on a drying rack to air dry."
        }
      ]
    },
    {
      "name":"Using a Baking Soda Solution",
      "steps":[
        {
          "headline":"Place your Corningware in the sink.",
          "description":"Only fill it halfway with hot water. Then squeeze an appropriate amount of dish soap into the water. Continue to fill it with hot water until it is full and a soapy solution has formed. The water should be at least 105 degrees Fahrenheit (40 degrees Celsius)."
        },
        {
          "headline":"Pour in one to two tablespoons (15 to 30 ml) of baking soda.",
          "description":"Mix the baking soda in until it is well-combined. Then let the solution set for 30 minutes to 1 hour, or overnight."
        },
        {
          "headline":"Scrub your Corningware with a soft mesh pad.",
          "description":"You may use a plastic or nylon mesh pad. Scrub until all the baked-on food, grease, and stains are removed. If some stains remain, then repeat steps one through three again."
        },
        {
          "headline":"Rinse and dry your Corningware thoroughly.",
          "description":"Rinse your dish with warm water until all the soap, residue, and grime are removed. Once it is thoroughly rinsed, dry your Corningware with a clean towel, or place it on drying rack to air dry."
        }
      ]
    }
  ],
  "text":" Using a Corningware Cleaner Fill your dish with the cleaner and hot water. Squeeze a small amount of the specially formulated Corningware cleaner into the water per the instructions on the bottle. Let the cleaner set for 30 minutes to 1 hour. The temperature of the water should be around 105 to 115 degrees Fahrenheit (40 to 46 degrees Celsius). You can purchase specially formulated Corningware cleaners online. Scrub the Corningware. After the cleaner has set, use a non-abrasive cleaning pad, like a plastic or nylon mesh pad, to scrub your Corningware. Scrub until all the baked-on food and grease is removed. Repeat steps one and two for hard-to-remove stains. Clean your dish with a dishwashing detergent. For an additional clean, squeeze a small amount of detergent into your dish with some warm water. Scrub your dish with a nylon mesh pad to remove any remaining residue before you rinse and dry it. Cleaning your Corningware with a dishwashing detergent is optional and may not be necessary. Rinse and dry your Corningware. Do this once you have removed all of the stains. Rinse the Corningware with warm water until all the soap and residue are removed. Then let it air dry on a drying rack, or wipe it with a clean, dry towel. Cleaning Your Corningware with Oven Cleaner Spray your dish with the oven cleaner. To protect your hands, wear nylon gloves or another pair of protective gloves. Cover the entire dish with the spray, concentrating on the stained areas. You may want to spray your dish outside to avoid getting oven cleaner on any surfaces in your kitchen. You can find oven cleaners at your local hardware or grocery store. Place your dish inside a garbage bag. Secure the bag with a knot or a twist tie. Let the spray set overnight. Place the bag in a shaded area outside; do not place it in the sun. Open the bag outside. Make sure the opening of the bag is pointing away from your face before you open it. This way you can avoid breathing in any noxious fumes that have built up in the bag overnight. Then pre-rinse your Corningware outside with a gardening hose. Wash your dish with soap and water. Place your Corningware in the sink. Fill it with hot water. Squeeze an appropriate amount of dish soap into the water. Use a plastic or nylon mesh pad to scrub and remove any remaining food, grease, and oven cleaner. Do not use metal pads to scrub your Corningware; these will scratch it. Rinse and dry. Once your Corningware is clean, rinse it with warm water until all the soap and residue are removed. Dry it with a clean, dry cloth, or place it on a drying rack to air dry. Using a Baking Soda Solution Place your Corningware in the sink. Only fill it halfway with hot water. Then squeeze an appropriate amount of dish soap into the water. Continue to fill it with hot water until it is full and a soapy solution has formed. The water should be at least 105 degrees Fahrenheit (40 degrees Celsius). Pour in one to two tablespoons (15 to 30 ml) of baking soda. Mix the baking soda in until it is well-combined. Then let the solution set for 30 minutes to 1 hour, or overnight. Scrub your Corningware with a soft mesh pad. You may use a plastic or nylon mesh pad. Scrub until all the baked-on food, grease, and stains are removed. If some stains remain, then repeat steps one through three again. Rinse and dry your Corningware thoroughly. Rinse your dish with warm water until all the soap, residue, and grime are removed. Once it is thoroughly rinsed, dry your Corningware with a clean towel, or place it on drying rack to air dry.",
  "tyn_model":[
    "water",
    "corningware with",
    "oven cleaner",
    "corningware.",
    "baking soda",
    "corningware cleaner",
    "dishwashing detergent",
    "corningware in",
    "dish soap",
    "hot water",
    "corningware cleaners",
    "nylon mesh pad",
    "nylon gloves",
    "protective gloves",
    "oven cleaners",
    "garbage bag",
    "corningware outside",
    "soap",
    "corningware thoroughly",
    "dish"
  ],
  "tyn_section":[

  ]
}