{
  "title":"How to Clean Raw Denim",
  "url":"https://www.wikihow.com/Clean-Raw-Denim",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Clothes"
  ],
  "methods":[
    {
      "name":"Cleaning Raw Denim Between Washes",
      "steps":[
        {
          "headline":"Avoid washing your denim for as long as possible.",
          "description":"Raw denim has not been pre-washed. Instead, you break it in and soften it with wear. If you wash raw denim, the indigo dye bleeds out and it can alter the perfect fit you have broken in. Instead, wear your jeans as long as you can without washing them. Try to go at least six months without washing your raw denim. Some people go months without washing their raw denim, while others go years."
        },
        {
          "headline":"Use a deodorizing spray.",
          "description":"Between washes, you may want to freshen up the denim, especially if you wear it often. Try a deodorizing spray or a denim spray. These sprays can help remove odors and freshen up any staleness. You can buy denim refreshing sprays online through a variety of retailers. If you want to use a regular deodorizing spray, brands like Febreze and Renuzit will work."
        },
        {
          "headline":"Try an essential oil mist.",
          "description":"Lavender or tea tree essential oils may help remove smells and kill bacteria after you’ve worn your raw denim for awhile. Mix two of drops of either essential oil with one ounce (28 grams) of water in a spray bottle. Spray the mist along the areas that may hold odors, like the inside seam of jeans. Make sure not to use too much. If you use too much, the smell with be too strong. Only use a few pumps of the spray bottle."
        },
        {
          "headline":"Try a baby wipe.",
          "description":"A baby cleaning wipe may also help remove odors and bacteria. Baby wipes have antiseptic qualities, so wipe along areas that may hold bacteria or where you have sweated. The wipes can remove stains or spills on the denim. You can get unscented baby wipes, so if you don’t want to smell like lavender or tea tree oil, this may be a better option."
        },
        {
          "headline":"Freeze your denim.",
          "description":"Freezing your denim between wears may help freshen it and reduce odors. Place your raw denim in the freezer for a few hours, or leave it overnight. Remove the denim a few hours before you plan to wear it."
        }
      ]
    },
    {
      "name":"Hand-Washing the Denim",
      "steps":[
        {
          "headline":"Wash the denim by hand the first time you wash them.",
          "description":"When you need to wash your raw denim, consider hand washing it. Soaking the denim in the bathtub and washing it by hand can protect it from the harsh cycles of a washing machine. It can also protect it from shrinking. Handwashing is the best option for the first time you wash the raw denim."
        },
        {
          "headline":"Soak the raw denim in cold water.",
          "description":"Every time you wash your raw denim, turn them inside out. This helps reduce the color bleeding. Cover the denim completely in cold to lukewarm water. If the jeans float and won’t submerge completely under water, use something to hold them down in the water."
        },
        {
          "headline":"Soak with a denim wash for an hour.",
          "description":"Use a specific denim wash detergent to clean the denim. This product will be gentle on your raw denim and not mess it up. Let the denim soak in the detergent and water for at least an hour. You may want to dunk the jeans a few times or move the water around. If you don’t have denim wash, you can use a color protecting gentle detergent."
        },
        {
          "headline":"Rinse the denim.",
          "description":"After the hour, rinse the denim with cold water. Refill the tub with cold water and let the denim soak in the clean water for around 10 minutes. This should remove all soap or solution. Don’t wring the denim because that may cause damage to the material."
        },
        {
          "headline":"Let the denim air dry.",
          "description":"Remove the jeans from the water. Turn them right side out. Hang them on a surface that will allow them to drip and air dry. Make sure to place them in an area that can catch the dyed water, like outside, or place a bucket underneath them. You may also lay them flat. Leave them until they are completely dry. You may use a towel to blot the excess moisture. Just be aware that the dye may fade and towel fibers may transfer onto the denim. If you want to wring the water out, do it very carefully so as not to damage the denim. Lay out flat afterwards."
        }
      ]
    },
    {
      "name":"Washing the Denim in the Machine",
      "steps":[
        {
          "headline":"Turn the jeans inside out.",
          "description":"If you have already hand-washed your raw denim once, you can wash them in the washing machine. Turn them inside out before putting them in the machine. This will help retain the color and integrity of the fabric."
        },
        {
          "headline":"Use the gentle cycle with cold water.",
          "description":"Choose the slowest and most gentle cycle on your washing machine. Only use cold water to wash your denim. Use a denim wash detergent instead of regular laundry detergent."
        },
        {
          "headline":"Wash the denim alone.",
          "description":"When you finally make the decision to wash your raw denim, do not wash it with other items. Instead, place the denim in the washing machine alone. Raw denim has indigo dye that has not been treated not to fade. If you put it with other clothes, it will more than likely fade. The friction from the other clothes can ruin the raw denim."
        },
        {
          "headline":"Let the denim air dry.",
          "description":"After the cycle ends, turn them right side out. Place the denim on a surface where they can drip and air dry. Place something like a bucket under the denim to catch the water, or place them outdoors. Make sure they are not in direct sunlight. This may cause fading. Leave them until they are completely dry. If you decide to wring the water out, do it gently. Wringing too hard can damage the denim. Lay the denim flat afterwards so it doesn't wrinkle."
        }
      ]
    }
  ],
  "text":" Cleaning Raw Denim Between Washes Avoid washing your denim for as long as possible. Raw denim has not been pre-washed. Instead, you break it in and soften it with wear. If you wash raw denim, the indigo dye bleeds out and it can alter the perfect fit you have broken in. Instead, wear your jeans as long as you can without washing them. Try to go at least six months without washing your raw denim. Some people go months without washing their raw denim, while others go years. Use a deodorizing spray. Between washes, you may want to freshen up the denim, especially if you wear it often. Try a deodorizing spray or a denim spray. These sprays can help remove odors and freshen up any staleness. You can buy denim refreshing sprays online through a variety of retailers. If you want to use a regular deodorizing spray, brands like Febreze and Renuzit will work. Try an essential oil mist. Lavender or tea tree essential oils may help remove smells and kill bacteria after you’ve worn your raw denim for awhile. Mix two of drops of either essential oil with one ounce (28 grams) of water in a spray bottle. Spray the mist along the areas that may hold odors, like the inside seam of jeans. Make sure not to use too much. If you use too much, the smell with be too strong. Only use a few pumps of the spray bottle. Try a baby wipe. A baby cleaning wipe may also help remove odors and bacteria. Baby wipes have antiseptic qualities, so wipe along areas that may hold bacteria or where you have sweated. The wipes can remove stains or spills on the denim. You can get unscented baby wipes, so if you don’t want to smell like lavender or tea tree oil, this may be a better option. Freeze your denim. Freezing your denim between wears may help freshen it and reduce odors. Place your raw denim in the freezer for a few hours, or leave it overnight. Remove the denim a few hours before you plan to wear it. Hand-Washing the Denim Wash the denim by hand the first time you wash them. When you need to wash your raw denim, consider hand washing it. Soaking the denim in the bathtub and washing it by hand can protect it from the harsh cycles of a washing machine. It can also protect it from shrinking. Handwashing is the best option for the first time you wash the raw denim. Soak the raw denim in cold water. Every time you wash your raw denim, turn them inside out. This helps reduce the color bleeding. Cover the denim completely in cold to lukewarm water. If the jeans float and won’t submerge completely under water, use something to hold them down in the water. Soak with a denim wash for an hour. Use a specific denim wash detergent to clean the denim. This product will be gentle on your raw denim and not mess it up. Let the denim soak in the detergent and water for at least an hour. You may want to dunk the jeans a few times or move the water around. If you don’t have denim wash, you can use a color protecting gentle detergent. Rinse the denim. After the hour, rinse the denim with cold water. Refill the tub with cold water and let the denim soak in the clean water for around 10 minutes. This should remove all soap or solution. Don’t wring the denim because that may cause damage to the material. Let the denim air dry. Remove the jeans from the water. Turn them right side out. Hang them on a surface that will allow them to drip and air dry. Make sure to place them in an area that can catch the dyed water, like outside, or place a bucket underneath them. You may also lay them flat. Leave them until they are completely dry. You may use a towel to blot the excess moisture. Just be aware that the dye may fade and towel fibers may transfer onto the denim. If you want to wring the water out, do it very carefully so as not to damage the denim. Lay out flat afterwards. Washing the Denim in the Machine Turn the jeans inside out. If you have already hand-washed your raw denim once, you can wash them in the washing machine. Turn them inside out before putting them in the machine. This will help retain the color and integrity of the fabric. Use the gentle cycle with cold water. Choose the slowest and most gentle cycle on your washing machine. Only use cold water to wash your denim. Use a denim wash detergent instead of regular laundry detergent. Wash the denim alone. When you finally make the decision to wash your raw denim, do not wash it with other items. Instead, place the denim in the washing machine alone. Raw denim has indigo dye that has not been treated not to fade. If you put it with other clothes, it will more than likely fade. The friction from the other clothes can ruin the raw denim. Let the denim air dry. After the cycle ends, turn them right side out. Place the denim on a surface where they can drip and air dry. Place something like a bucket under the denim to catch the water, or place them outdoors. Make sure they are not in direct sunlight. This may cause fading. Leave them until they are completely dry. If you decide to wring the water out, do it gently. Wringing too hard can damage the denim. Lay the denim flat afterwards so it doesn't wrinkle.",
  "tyn_model":[
    "denim",
    "water",
    "deodorizing spray",
    "essential oil",
    "spray bottle",
    "baby wipes",
    "denim wash",
    "denim wash detergent",
    "bucket",
    "washing machine",
    "indigo dye",
    "jeans",
    "denim spray",
    "denim refreshing sprays",
    "febreze",
    "tea tree essential oils",
    "baby wipe",
    "baby cleaning wipe",
    "tea tree oil",
    "freezer",
    "gentle detergent",
    "tub",
    "towel",
    "laundry detergent"
  ],
  "tyn_section":[

  ]
}