{
  "title":"How to Clean Rubber Floor Mats",
  "url":"https://www.wikihow.com/Clean-Rubber-Floor-Mats",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Cleaning Automobile Floor Mats",
      "steps":[
        {
          "headline":"Shake off dirt.",
          "description":"The easiest way to get most of the dirt and debris off of your rubber floor mats is to take them out of your car and shake them off. This will remove all loose dirt. You may need to beat them on the ground a few times to get all the dirt off."
        },
        {
          "headline":"Scrape off caked on dirt.",
          "description":"Mud and dirt may dry on the rubber floor mats and be stubborn to get off. Take your floor mats out of your car and place them on the ground. Use a brush or scraper to get all caked on dirt, mud, or debris. Brush the loose dirt off the floor mat."
        },
        {
          "headline":"Vacuum all loose dirt.",
          "description":"Clean loose dirt, debris, and sand from the rubber floor mats by vacuuming the mat. You can use a hand vacuum or go to the car wash and use one of their vacuums. You can leave the mats in your car or pull them out and lay them on the ground. You can do this after you’ve shaken the floor mats or do this instead of shaking the mats."
        },
        {
          "headline":"Cover the floor mat in cleaner.",
          "description":"If vacuuming or shaking the floor mat doesn’t clean everything, you need to wash it. Pour or spray cleaner onto the rubber floor mat. Let the cleaner set for a few minutes. You can use a rubber cleaner or any type of soap detergent."
        },
        {
          "headline":"Scrub stains with a stiff-bristled brush.",
          "description":"Some stains may require more pressure than others. You may also use a cloth rag to wipe away any stains and dirt."
        },
        {
          "headline":"Rinse the mats with a hose.",
          "description":"If you have a hose that has higher pressure, use it. Rinse away the soap completely. You may need to rinse multiple times. Car washes generally have a high-pressure hose you can use to rinse your floor mats."
        },
        {
          "headline":"Allow the mats to dry completely.",
          "description":"Let the mats dry completely before you place them on your carpet. Use a towel to dry them, or let them air dry overnight. Wet mats can cause the carpet in your car to mold. Avoid drying the mats in direct sunlight since it could cause the rubber to fade or crack prematurely."
        }
      ]
    },
    {
      "name":"Cleaning Commercial Rubber Floor Mats",
      "steps":[
        {
          "headline":"Sweep loose debris off the mat.",
          "description":"Use a broom to sweep all loose dirt, mud, and debris off of the rubber mat. If it is a large mat, use a push broom. If there is a lot of debris on the mat, you may need to sweep it multiple times."
        },
        {
          "headline":"Use a hose to wash the mat.",
          "description":"Take a garden hose and spray the mat with water. Use moderate to high pressure. Avoid using pressure washers since they can damage the rubber mat."
        },
        {
          "headline":"Scrub stains with a brush and soap.",
          "description":"If there are particularly stubborn stains, you may need to use a cloth rag or brush. Scrub the stain with the rag or brush until the dirt is removed. If the stain won’t come up, use a bit of soap or water-based spray cleaner. Don’t use solvent-based cleaners. They can weaken the rubber."
        },
        {
          "headline":"Rinse the mats with water.",
          "description":"Use the hose to rinse the soap from the mat. Use the broom to remove excess water and any leftover debris from the mat."
        },
        {
          "headline":"Let the mats air dry.",
          "description":"Pick up the mat and hang it up to dry. Make sure to leave it long enough that it completely dries so it doesn’t start to mold."
        }
      ]
    },
    {
      "name":"Maintaining Rubber Floor Mats",
      "steps":[
        {
          "headline":"Clean the floor beneath the mats.",
          "description":"Remove the rubber floor mats at least once each week. Cleaning the floor beneath the mat to make sure the rubber can grip the floor easily. For carpet, vacuum the floor underneath. For tile, mop underneath the mat. Don’t use any rubber or vinyl protectant that repels water since it could make the floor mats slippery and unsafe."
        },
        {
          "headline":"Clean up spills and stains immediately.",
          "description":"The moment something spills or gets tracked onto the mat, try to clean it up. Use a towel or other cloth to wipe up liquid so it doesn't sit on the rubber. Wiping up anything that gets on the mat can help cleaning them later easier."
        },
        {
          "headline":"Clean the mats often.",
          "description":"Sweep, vacuum, or shake rubber floor mats every few days to remove dirt and debris. Make sure to clean the mats when they get dirty. They will need washing more often during rain or snow because more dirt and mud will be tracked on them. Try to maintain a routine cleaning schedule. Depending on how often your floor mats get dirty, consider doing a full cleaning every few weeks to a month."
        }
      ]
    }
  ],
  "text":" Cleaning Automobile Floor Mats Shake off dirt. The easiest way to get most of the dirt and debris off of your rubber floor mats is to take them out of your car and shake them off. This will remove all loose dirt. You may need to beat them on the ground a few times to get all the dirt off. Scrape off caked on dirt. Mud and dirt may dry on the rubber floor mats and be stubborn to get off. Take your floor mats out of your car and place them on the ground. Use a brush or scraper to get all caked on dirt, mud, or debris. Brush the loose dirt off the floor mat. Vacuum all loose dirt. Clean loose dirt, debris, and sand from the rubber floor mats by vacuuming the mat. You can use a hand vacuum or go to the car wash and use one of their vacuums. You can leave the mats in your car or pull them out and lay them on the ground. You can do this after you’ve shaken the floor mats or do this instead of shaking the mats. Cover the floor mat in cleaner. If vacuuming or shaking the floor mat doesn’t clean everything, you need to wash it. Pour or spray cleaner onto the rubber floor mat. Let the cleaner set for a few minutes. You can use a rubber cleaner or any type of soap detergent. Scrub stains with a stiff-bristled brush. Some stains may require more pressure than others. You may also use a cloth rag to wipe away any stains and dirt. Rinse the mats with a hose. If you have a hose that has higher pressure, use it. Rinse away the soap completely. You may need to rinse multiple times. Car washes generally have a high-pressure hose you can use to rinse your floor mats. Allow the mats to dry completely. Let the mats dry completely before you place them on your carpet. Use a towel to dry them, or let them air dry overnight. Wet mats can cause the carpet in your car to mold. Avoid drying the mats in direct sunlight since it could cause the rubber to fade or crack prematurely. Cleaning Commercial Rubber Floor Mats Sweep loose debris off the mat. Use a broom to sweep all loose dirt, mud, and debris off of the rubber mat. If it is a large mat, use a push broom. If there is a lot of debris on the mat, you may need to sweep it multiple times. Use a hose to wash the mat. Take a garden hose and spray the mat with water. Use moderate to high pressure. Avoid using pressure washers since they can damage the rubber mat. Scrub stains with a brush and soap. If there are particularly stubborn stains, you may need to use a cloth rag or brush. Scrub the stain with the rag or brush until the dirt is removed. If the stain won’t come up, use a bit of soap or water-based spray cleaner. Don’t use solvent-based cleaners. They can weaken the rubber. Rinse the mats with water. Use the hose to rinse the soap from the mat. Use the broom to remove excess water and any leftover debris from the mat. Let the mats air dry. Pick up the mat and hang it up to dry. Make sure to leave it long enough that it completely dries so it doesn’t start to mold. Maintaining Rubber Floor Mats Clean the floor beneath the mats. Remove the rubber floor mats at least once each week. Cleaning the floor beneath the mat to make sure the rubber can grip the floor easily. For carpet, vacuum the floor underneath. For tile, mop underneath the mat. Don’t use any rubber or vinyl protectant that repels water since it could make the floor mats slippery and unsafe. Clean up spills and stains immediately. The moment something spills or gets tracked onto the mat, try to clean it up. Use a towel or other cloth to wipe up liquid so it doesn't sit on the rubber. Wiping up anything that gets on the mat can help cleaning them later easier. Clean the mats often. Sweep, vacuum, or shake rubber floor mats every few days to remove dirt and debris. Make sure to clean the mats when they get dirty. They will need washing more often during rain or snow because more dirt and mud will be tracked on them. Try to maintain a routine cleaning schedule. Depending on how often your floor mats get dirty, consider doing a full cleaning every few weeks to a month.",
  "tyn_model":[
    "hose",
    "soap",
    "mud",
    "vacuum",
    "water",
    "floor mats",
    "towel",
    "broom",
    "dirt",
    "brush",
    "sand",
    "vacuums",
    "cleaner",
    "spray cleaner",
    "rubber cleaner",
    "soap detergent",
    "washes",
    "rubber mat",
    "push broom",
    "garden hose",
    "cloth rag or brush",
    "water-based spray cleaner",
    "rubber or vinyl protectant"
  ],
  "tyn_section":[

  ]
}