{
  "title":"How to Clean a Baking Stone",
  "url":"https://www.wikihow.com/Clean-a-Baking-Stone",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Performing Routine Cleaning",
      "steps":[
        {
          "headline":"Cool your baking stone overnight.",
          "description":"Make sure to set aside enough time for your stone to cool after you've used it. Never attempt to clean a hot or warm stone. This is important, as cold water could cause a warm or hot stone to crack. Never pour cool or cold water on a baking stone that has just come out of the oven."
        },
        {
          "headline":"Scrape the stone.",
          "description":"Use a nylon scraper to remove all debris from the stone. Slide it down the stone systematically. Pay special attention to any crust, pieces of baked goods, or pizza that might have burned on to the stone. Make sure the scraper is sharp. You may need to purchase and use a new scraper after you’ve used one a lot. You can buy a nylon or plastic scraper at a box store or home improvement store."
        },
        {
          "headline":"Soak your stone in warm water for 10 to 20 minutes.",
          "description":"Clean your sink or a basin and fill it with warm water. Slowly slide the stone into the water and allow it to sit. The warm water will loosen any food remnants or other debris on the surface of the stone. If you can’t submerge the entire stone, make sure to rotate it periodically so the entire stone spends time under water. Avoid letting the stone sit for too long. If the stone absorbs and retains too much moisture, it could crack next time you put it in the oven."
        },
        {
          "headline":"Scrub the stone with a cotton cloth.",
          "description":"After you've soaked the baking stone, scrub the surface with a cotton cloth. Pay special attention to any debris that may have been leftover after you scraped the stone. Almost all debris should come off after the stone has soaked."
        },
        {
          "headline":"Rinse the stone.",
          "description":"Gently place the stone in your sink and rinse it with cool water. Make sure you wash any debris off. If you need to use a cotton cloth to wipe the stone down again, feel free to do so."
        },
        {
          "headline":"Allow the stone to air-dry overnight.",
          "description":"Before using the stone again, you'll need to make sure that it has dried completely. The best way to do this is to sit the stone out overnight and allow it to dry. That way, when you wake in the morning, your stone will likely be ready to use. Pat the stone gently with a dry cloth before allowing it to sit overnight."
        }
      ]
    },
    {
      "name":"Using Baking Soda",
      "steps":[
        {
          "headline":"Create a baking soda paste.",
          "description":"In a small bowl, pour ½ cup (170 grams) of baking soda and 3 tablespoons (15 ml) of warm water. Mix the baking soda and water vigorously. The mixture should resemble a paste-like substance after a little mixing. You should only use cooking grade baking soda. Avoid using laundry baking soda or baking soda with any sort of scent."
        },
        {
          "headline":"Spread the paste.",
          "description":"Spread the baking soda paste over the entire surface of the baking stone. Make sure to pay special attention to dirty spots. Allow the paste to sit for 5 to 10 minutes. The paste might appear to dry after 5 minutes – this is okay."
        },
        {
          "headline":"Scrub the paste into the surface of the stone.",
          "description":"After you let it sit, take a clean cloth and scrub in small circles. In addition to the chemical reaction created by the baking soda, its abrasive character should help remove debris and stains. Use a toothbrush if you need more abrasive power."
        },
        {
          "headline":"Remove the paste with your scraper.",
          "description":"Take the plastic or nylon scraper and work systematically to remove the paste from your baking stone. Make sure to get as much as you can, as you’ll need to remove it all before you use the stone in the oven."
        },
        {
          "headline":"Rinse and wipe down the stone.",
          "description":"After you've scraped off any remaining paste, you'll need to rinse and wipe the stone again. Do this by running the stone under cool water and wiping it with a damp cloth."
        },
        {
          "headline":"Allow the stone to air-dry overnight after cleaning.",
          "description":"You'll need to let the stone sit out and dry for at least one night before you use it again. This is important as the stone could crack if you put it in the oven when it is still wet. Think about patting the stone with a dry cloth before letting it sit overnight."
        }
      ]
    },
    {
      "name":"Avoiding Damage to Your Stone",
      "steps":[
        {
          "headline":"Allow your stone to dry fully before using it.",
          "description":"Whenever your stone gets wet, you should allow a lot of time to lapse before you use it in the oven. This is important, as wet stones could crack in the oven. Pat your stone with a clean cloth after wetting it. Place your stone on a drying rack overnight. Check to see your stone is wet before you use it. If it is, put it aside for another 6 to 12 hours."
        },
        {
          "headline":"Don’t leave your stone in the oven during the self-cleaning cycle.",
          "description":"While you may think that extreme heat in the oven will burn off debris and help clean your stone, you could wind up damaging or splitting your stone. Always check inside your oven before starting a self-cleaning cycle."
        },
        {
          "headline":"Avoid using soap.",
          "description":"You should never use soap to clean your baking stone. Because baking stones are permeable, they will absorb soap into them. Soap will be very difficult to get out and may alter the taste of baked goods you make in the future. Don’t place your baking stone in the dish washer. Try not to put your baking stone in the sink with other dirty dishes."
        }
      ]
    }
  ],
  "text":" Performing Routine Cleaning Cool your baking stone overnight. Make sure to set aside enough time for your stone to cool after you've used it. Never attempt to clean a hot or warm stone. This is important, as cold water could cause a warm or hot stone to crack. Never pour cool or cold water on a baking stone that has just come out of the oven. Scrape the stone. Use a nylon scraper to remove all debris from the stone. Slide it down the stone systematically. Pay special attention to any crust, pieces of baked goods, or pizza that might have burned on to the stone. Make sure the scraper is sharp. You may need to purchase and use a new scraper after you’ve used one a lot. You can buy a nylon or plastic scraper at a box store or home improvement store. Soak your stone in warm water for 10 to 20 minutes. Clean your sink or a basin and fill it with warm water. Slowly slide the stone into the water and allow it to sit. The warm water will loosen any food remnants or other debris on the surface of the stone. If you can’t submerge the entire stone, make sure to rotate it periodically so the entire stone spends time under water. Avoid letting the stone sit for too long. If the stone absorbs and retains too much moisture, it could crack next time you put it in the oven. Scrub the stone with a cotton cloth. After you've soaked the baking stone, scrub the surface with a cotton cloth. Pay special attention to any debris that may have been leftover after you scraped the stone. Almost all debris should come off after the stone has soaked. Rinse the stone. Gently place the stone in your sink and rinse it with cool water. Make sure you wash any debris off. If you need to use a cotton cloth to wipe the stone down again, feel free to do so. Allow the stone to air-dry overnight. Before using the stone again, you'll need to make sure that it has dried completely. The best way to do this is to sit the stone out overnight and allow it to dry. That way, when you wake in the morning, your stone will likely be ready to use. Pat the stone gently with a dry cloth before allowing it to sit overnight. Using Baking Soda Create a baking soda paste. In a small bowl, pour ½ cup (170 grams) of baking soda and 3 tablespoons (15 ml) of warm water. Mix the baking soda and water vigorously. The mixture should resemble a paste-like substance after a little mixing. You should only use cooking grade baking soda. Avoid using laundry baking soda or baking soda with any sort of scent. Spread the paste. Spread the baking soda paste over the entire surface of the baking stone. Make sure to pay special attention to dirty spots. Allow the paste to sit for 5 to 10 minutes. The paste might appear to dry after 5 minutes – this is okay. Scrub the paste into the surface of the stone. After you let it sit, take a clean cloth and scrub in small circles. In addition to the chemical reaction created by the baking soda, its abrasive character should help remove debris and stains. Use a toothbrush if you need more abrasive power. Remove the paste with your scraper. Take the plastic or nylon scraper and work systematically to remove the paste from your baking stone. Make sure to get as much as you can, as you’ll need to remove it all before you use the stone in the oven. Rinse and wipe down the stone. After you've scraped off any remaining paste, you'll need to rinse and wipe the stone again. Do this by running the stone under cool water and wiping it with a damp cloth. Allow the stone to air-dry overnight after cleaning. You'll need to let the stone sit out and dry for at least one night before you use it again. This is important as the stone could crack if you put it in the oven when it is still wet. Think about patting the stone with a dry cloth before letting it sit overnight. Avoiding Damage to Your Stone Allow your stone to dry fully before using it. Whenever your stone gets wet, you should allow a lot of time to lapse before you use it in the oven. This is important, as wet stones could crack in the oven. Pat your stone with a clean cloth after wetting it. Place your stone on a drying rack overnight. Check to see your stone is wet before you use it. If it is, put it aside for another 6 to 12 hours. Don’t leave your stone in the oven during the self-cleaning cycle. While you may think that extreme heat in the oven will burn off debris and help clean your stone, you could wind up damaging or splitting your stone. Always check inside your oven before starting a self-cleaning cycle. Avoid using soap. You should never use soap to clean your baking stone. Because baking stones are permeable, they will absorb soap into them. Soap will be very difficult to get out and may alter the taste of baked goods you make in the future. Don’t place your baking stone in the dish washer. Try not to put your baking stone in the sink with other dirty dishes.",
  "tyn_model":[
    "water",
    "oven",
    "baking soda",
    "baking stone",
    "scraper",
    "cotton cloth",
    "soap",
    "nylon scraper",
    "basin",
    "cooking grade baking soda",
    "– this",
    "plastic or nylon scraper",
    "dish washer"
  ],
  "tyn_section":[

  ]
}