{
  "title":"How to Root Tomato Suckers",
  "url":"https://www.wikihow.com/Root-Tomato-Suckers",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "methods":[
    {
      "name":"Keeping the Sucker in Water",
      "steps":[
        {
          "headline":"Choose a healthy 6-inch sucker.",
          "description":"These are the best sized tomato suckers for rooting. You can usually find them growing between a main production stem and a leaf. Make sure they’re healthy and visually free from disease. Ideally, it shouldn’t be flowering."
        },
        {
          "headline":"Cut the sucker.",
          "description":"Place a pair of shears at the base of the sucker, right where it meets the main stem. Clip quickly and firmly to cut it cleanly. After shearing, you can scrape the sides of the stem with a knife. Some gardeners believe this might make the roots grow more quickly, but it isn’t necessary. Make sure you’re using clean shears. That way you’ll avoid spreading disease between your plants. Shear off the sucker’s lower leaves."
        },
        {
          "headline":"Place the sucker in a jar filled with warm water.",
          "description":"Being transplanted to a water jar is a big shock for a plant, and it may wilt for the first few days. Make sure to keep it out of direct sunlight initially, so that it has time to recover. After this period, you can place it in a sunny spot, like a windowsill. Don’t leave the cutting outside; it needs protection from the elements. Change the water every few days, always using warm water."
        },
        {
          "headline":"Transplant the tomato sucker after about one to two weeks.",
          "description":"This should be sufficient time for new roots to have sprouted. Looking through the jar will allow you to keep track of the sprouting roots. When you see about an inch (2.5cm) of roots you can transplant the tomato sucker to your garden. Otherwise, let the plant root for a few more days, checking it occasionally. If you want to transplant the tomato sucker to a larger pot instead of your garden, make sure it’s opaque. Direct sunlight can kill roots over time."
        }
      ]
    },
    {
      "name":"Transplanting the Sucker in Soil",
      "steps":[
        {
          "headline":"Shear a 6 inch sucker.",
          "description":"This is the ideal length for rooting a new tomato plant. You can find healthy suckers of this size between a main production stem and a leaf. Place the shears at the base of the sucker, against the main stem. Cut it cleanly and firmly, then use a knife to cut the bottom of the sucker at a 45 degree angle. If you want to give the sucker some extra rooting help, you can scrape the sides of the stem with a knife. Make sure you’re using clean shears. That way you’ll avoid spreading disease between your plants."
        },
        {
          "headline":"Plant your tomato cutting in a transparent cup filled with soil.",
          "description":"Eight ounce (237ml) cups are the perfect size for this. Transparent cups will allow you to see the roots once they sprout, so you can more accurately gauge their progress. You can use any garden soil for this step, though regular soil from your lawn may not be the best choice. Poke holes in the bottom of the cup. This will allow water to drain from the cup, and air will flow more freely, promoting the growth of healthy roots. You should place the transparent cup on a windowsill. This will give it enough light to grow without shocking the roots with too much sunlight."
        },
        {
          "headline":"Water the soil thoroughly.",
          "description":"Because a rootless cutting doesn’t draw water from soil as effectively, it’s important to provide it with an abundance of water. You want the soil to be consistently moist but not sopping wet. When you water your cuttings, give enough water so that water comes out of the drainage holes. Using soil with good drainage is key to a healthy plant. You should place your cup on a surface that won’t be damaged by dripping water, or place a tray underneath your cup."
        },
        {
          "headline":"Place a clear plastic baggie over the plant.",
          "description":"It should be large enough to cover the plant with plenty of free space; you should leave about 4 inches (10 cm) of clearance between the sucker’s leaves and the top of the plastic bag. Leave it unsealed. The baggie will retain the moisture released by the plant’s leaves, which the plant will then reabsorb. This will help it stay alive as it roots. Don’t be alarmed if the plant looks to be wilting in the first couple of days. It will recover."
        },
        {
          "headline":"Transplant the tomato sucker after about a week.",
          "description":"This should be sufficient time for new roots to have sprouted. Simply look through the side of the translucent cup to check for roots. If you see roots, transplant the tomato sucker to your garden. Otherwise, let the plant root for a few more days, checking for roots occasionally. Don't automatically place your plant outside. Instead, you need to harden it off first. This means that you will place the plant outside for a few hours each day, slowly increasing the length of time it spends outside. Continue this process over the course of a week to protect the plant. If you want to transplant the tomato sucker to a larger pot, make sure it’s opaque. Direct sunlight can kill roots."
        }
      ]
    }
  ],
  "text":" Keeping the Sucker in Water Choose a healthy 6-inch sucker. These are the best sized tomato suckers for rooting. You can usually find them growing between a main production stem and a leaf. Make sure they’re healthy and visually free from disease. Ideally, it shouldn’t be flowering. Cut the sucker. Place a pair of shears at the base of the sucker, right where it meets the main stem. Clip quickly and firmly to cut it cleanly. After shearing, you can scrape the sides of the stem with a knife. Some gardeners believe this might make the roots grow more quickly, but it isn’t necessary. Make sure you’re using clean shears. That way you’ll avoid spreading disease between your plants. Shear off the sucker’s lower leaves. Place the sucker in a jar filled with warm water. Being transplanted to a water jar is a big shock for a plant, and it may wilt for the first few days. Make sure to keep it out of direct sunlight initially, so that it has time to recover. After this period, you can place it in a sunny spot, like a windowsill. Don’t leave the cutting outside; it needs protection from the elements. Change the water every few days, always using warm water. Transplant the tomato sucker after about one to two weeks. This should be sufficient time for new roots to have sprouted. Looking through the jar will allow you to keep track of the sprouting roots. When you see about an inch (2.5cm) of roots you can transplant the tomato sucker to your garden. Otherwise, let the plant root for a few more days, checking it occasionally. If you want to transplant the tomato sucker to a larger pot instead of your garden, make sure it’s opaque. Direct sunlight can kill roots over time. Transplanting the Sucker in Soil Shear a 6 inch sucker. This is the ideal length for rooting a new tomato plant. You can find healthy suckers of this size between a main production stem and a leaf. Place the shears at the base of the sucker, against the main stem. Cut it cleanly and firmly, then use a knife to cut the bottom of the sucker at a 45 degree angle. If you want to give the sucker some extra rooting help, you can scrape the sides of the stem with a knife. Make sure you’re using clean shears. That way you’ll avoid spreading disease between your plants. Plant your tomato cutting in a transparent cup filled with soil. Eight ounce (237ml) cups are the perfect size for this. Transparent cups will allow you to see the roots once they sprout, so you can more accurately gauge their progress. You can use any garden soil for this step, though regular soil from your lawn may not be the best choice. Poke holes in the bottom of the cup. This will allow water to drain from the cup, and air will flow more freely, promoting the growth of healthy roots. You should place the transparent cup on a windowsill. This will give it enough light to grow without shocking the roots with too much sunlight. Water the soil thoroughly. Because a rootless cutting doesn’t draw water from soil as effectively, it’s important to provide it with an abundance of water. You want the soil to be consistently moist but not sopping wet. When you water your cuttings, give enough water so that water comes out of the drainage holes. Using soil with good drainage is key to a healthy plant. You should place your cup on a surface that won’t be damaged by dripping water, or place a tray underneath your cup. Place a clear plastic baggie over the plant. It should be large enough to cover the plant with plenty of free space; you should leave about 4 inches (10 cm) of clearance between the sucker’s leaves and the top of the plastic bag. Leave it unsealed. The baggie will retain the moisture released by the plant’s leaves, which the plant will then reabsorb. This will help it stay alive as it roots. Don’t be alarmed if the plant looks to be wilting in the first couple of days. It will recover. Transplant the tomato sucker after about a week. This should be sufficient time for new roots to have sprouted. Simply look through the side of the translucent cup to check for roots. If you see roots, transplant the tomato sucker to your garden. Otherwise, let the plant root for a few more days, checking for roots occasionally. Don't automatically place your plant outside. Instead, you need to harden it off first. This means that you will place the plant outside for a few hours each day, slowly increasing the length of time it spends outside. Continue this process over the course of a week to protect the plant. If you want to transplant the tomato sucker to a larger pot, make sure it’s opaque. Direct sunlight can kill roots.",
  "tyn_model":[
    "water",
    "tomato sucker",
    "shears",
    "sucker",
    "knife",
    "jar",
    "tomato",
    "tomato suckers",
    "water jar",
    "soil shear",
    "transparent cup",
    "soil",
    "tray",
    "clear plastic baggie",
    "plastic bag",
    "pot"
  ],
  "tyn_section":[

  ]
}