{
  "title":"How to Make an Evacuation Kit for Your Cat",
  "url":"https://www.wikihow.com/Make-an-Evacuation-Kit-for-Your-Cat",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Gathering Supplies",
      "steps":[
        {
          "headline":"Collect two weeks’ worth of food and water.",
          "description":"The most important component of your cat’s evacuation kit is a supply of food and water. When determining the amount of food and water your cat will need, estimate about 14 quarts of water (448 ounces), plus your cat’s usual daily food intake multiplied by 14. Don’t forget to include extra food and water dishes. Having the food and water won’t help your cat if they have no way to consume it! If your cat’s food usually comes in metal containers, don’t forget a can opener."
        },
        {
          "headline":"Add restraints.",
          "description":"Your cat might not normally wear a harness, collar, or leash, but these are good things to include in your evacuation kit. Your cat may get nervous in new or unfamiliar places and situations created by an emergency, and these supplies can help keep your cat restrained. If your cat becomes very panicked in unfamiliar situations, you might want to consider including a pair of leather gloves with these supplies to protect your hands from scratches."
        },
        {
          "headline":"Get a cat carrier.",
          "description":"If you don’t already have a carrier for your cat, you should get one to include with your cat’s evacuation kit. The carrier should have your name, cat’s name and description, and your phone number and address listed on it. Include an alternate phone number in case you’re not at home and someone finds your cat and needs to contact you. You should also include your cat’s insurance policy number and microchip or tattoo ID if applicable."
        },
        {
          "headline":"Make a copy of your cat’s records.",
          "description":"This should include vaccination certifications, your and your vet’s phone numbers, a copy of your cat's insurance, and your ownership papers (if you have any). You can also include a current picture of your cat, which will help identify you as the cat's owner if someone else finds it."
        },
        {
          "headline":"Put aside extras of your cat’s medications.",
          "description":"You should also put aside a two-week supply of any medications that your cat takes. You can also include one dose of preventative heart worm medication. This is especially important since in the event of an emergency, your cat might be around other animals or in an unfamiliar place where contracting heart worm is more likely. If your cat’s medications need to be refrigerated, include a few chemical ice packs in your kit. Cracking these packs when they’re ready for use will give you an ice pack without the need to keep anything frozen."
        },
        {
          "headline":"Add some supplies for your cat’s comfort.",
          "description":"In the event of an emergency, your cat will be outside of its comfort zone. Including some familiar toys, a blanket, and grooming supplies like a brush and nail clippers can help keep your cat comfortable in an emergency. A pheromone spray like Feliway can also contribute to your cat’s comfort. Spraying it on your cat’s toys and blanket, and in the areas where they’re staying during the emergency, sends your cat a signal that they are in a safe place."
        },
        {
          "headline":"Don’t forget litter supplies.",
          "description":"Some pet stores and websites sell litter sets specifically for emergencies. They often include a collapsible litter pan and a small scoop. You can create your own by purchasing a small litter pan and scoop and including paper towel, garbage bags and a disinfectant to keep your cat’s litter box clean during an emergency. Don’t forget the actual litter, either."
        }
      ]
    },
    {
      "name":"Assembling Your Kit",
      "steps":[
        {
          "headline":"Store food and treats in airtight containers.",
          "description":"The food and treats in your emergency kit might sit for a really long time before you ever need it. Storing them in airtight containers prevents them from going bad and ensures you have fresh supplies regardless of when an emergency hits."
        },
        {
          "headline":"Store water in a dark, cool place.",
          "description":"Your cat’s emergency water supply should be stored in an airtight container. It should also be stored somewhere dark and cool to prevent mold growing in it."
        },
        {
          "headline":"Store medication in a waterproof container.",
          "description":"A waterproof container will protect your cat’s meds from getting soggy or becoming useless if the emergency you have to deal with is a flood."
        },
        {
          "headline":"Print a list of supplies to tape to your kit.",
          "description":"Once you’ve assembled and properly stored all of your evacuation kit items, print up a list of the supplies in your kit. This will help you keep track of what’s in the kit, and will also prevent you from forgetting what’s in there in the first place!"
        },
        {
          "headline":"Print a calendar for supply rotation.",
          "description":"Printing out a calendar that shows when which supplies should be rotated will help prevent you from having bad food or medication in your cat’s kit. You should check the calendar once a month to ensure everything stays fresh. Food should be rotated out every three months, water and medication should be rotated every two months."
        },
        {
          "headline":"Put paperwork and records in a waterproof pouch.",
          "description":"You don’t want your cat’s paperwork to get soaked in the rain or ruined by a flood, so consider storing it in a waterproof pouch. Many sporting goods stores have these types of bags – they’re usually advertised as being useful for rafting or camping trips. You can also just use a large plastic storage bag."
        },
        {
          "headline":"Put everything in a plastic tub.",
          "description":"Once you’ve collected all of your supplies and put them in their respective containers, put everything into a larger plastic tub. You can also use a bag for storing everything, but a plastic tub will protect your cat’s kit from the elements better than a bag might."
        }
      ]
    },
    {
      "name":"Making Additional Evacuation Plans",
      "steps":[
        {
          "headline":"Store your kit near an exit.",
          "description":"If the time comes that you need to use your kit, you don’t want to be rooting around in your attic or the back of a closet for it. Store it as close to the exit of your home as possible."
        },
        {
          "headline":"Post a rescue alert sticker.",
          "description":"If the emergency is a fire or something else that might bring rescue workers to your home, make sure you post a rescue alert sticker. These are available from the ASPCA and will notify the rescue workers that there are pets in the home."
        },
        {
          "headline":"Ask someone nearby to serve as interim caregiver.",
          "description":"Ask someone you trust if they’d be willing to serve as an interim care giver in the event of an emergency. This allows your cat to be cared for, even if you end up in a shelter that does not accept animals. The person you ask should live close to you."
        },
        {
          "headline":"Select a shelter-in-place room.",
          "description":"It’s possible that the emergency you encounter will require you to stay in your home. In this case, you’ll need to choose a shelter-in-place room where both you and your cat will be comfortable. The room you choose should not have any windows (in case of strong winds) and should be near the interior of your home."
        },
        {
          "headline":"Microchip your cat.",
          "description":"Microchipping your cat can be expensive, but having a chip can help you locate your cat if they get lost during an emergency. You’d need to contact the chip company and ask them to track your cat."
        }
      ]
    },
    {
      "name":"Making a Last Minute Kit",
      "steps":[
        {
          "headline":"Choose a large bag.",
          "description":"You might not have the time or storage space to put a large evacuation kit together ahead of time. If this is the case and you find yourself in an emergency situation, choose the largest bag you have at your disposal."
        },
        {
          "headline":"Add food and bottled water.",
          "description":"You should add food and water to the bag first, since these are the most important for your cat. Grab what food you have at hand - either a bag of dry food or several cans of wet food. You should also add several bottles of water. Also include your cat's water and food bowls."
        },
        {
          "headline":"Include your cat's paperwork.",
          "description":"Any paperwork you have for your cat - vaccine, owner, or insurance paperwork - should also go in the bag. If you don't plan on making your kit ahead of time, at least keep this paperwork in one place so it's easy to take if you need it."
        },
        {
          "headline":"Add toys.",
          "description":"Your cat probably has a few go-to toys that are its favorites. When you're putting together a last minute evacuation kit, include these in your bag. They'll give your cat something familiar in what can be an unfamiliar and sometimes scary situation."
        },
        {
          "headline":"Include litter supplies.",
          "description":"You might not have time to get an extra or travel litter pan during an emergency, but you probably have a container of litter and a scoop at home. Include these, along with any container that is big enough for your cat to use as a litter box. The container should be at least big enough for your cat to stand up in."
        },
        {
          "headline":"Add towels.",
          "description":"Towels will keep your cat comfortable and warm in an emergency. You can also use them to swaddle your cat if you don't have an actual cat carrier."
        }
      ]
    }
  ],
  "text":" Gathering Supplies Collect two weeks’ worth of food and water. The most important component of your cat’s evacuation kit is a supply of food and water. When determining the amount of food and water your cat will need, estimate about 14 quarts of water (448 ounces), plus your cat’s usual daily food intake multiplied by 14. Don’t forget to include extra food and water dishes. Having the food and water won’t help your cat if they have no way to consume it! If your cat’s food usually comes in metal containers, don’t forget a can opener. Add restraints. Your cat might not normally wear a harness, collar, or leash, but these are good things to include in your evacuation kit. Your cat may get nervous in new or unfamiliar places and situations created by an emergency, and these supplies can help keep your cat restrained. If your cat becomes very panicked in unfamiliar situations, you might want to consider including a pair of leather gloves with these supplies to protect your hands from scratches. Get a cat carrier. If you don’t already have a carrier for your cat, you should get one to include with your cat’s evacuation kit. The carrier should have your name, cat’s name and description, and your phone number and address listed on it. Include an alternate phone number in case you’re not at home and someone finds your cat and needs to contact you. You should also include your cat’s insurance policy number and microchip or tattoo ID if applicable. Make a copy of your cat’s records. This should include vaccination certifications, your and your vet’s phone numbers, a copy of your cat's insurance, and your ownership papers (if you have any). You can also include a current picture of your cat, which will help identify you as the cat's owner if someone else finds it. Put aside extras of your cat’s medications. You should also put aside a two-week supply of any medications that your cat takes. You can also include one dose of preventative heart worm medication. This is especially important since in the event of an emergency, your cat might be around other animals or in an unfamiliar place where contracting heart worm is more likely. If your cat’s medications need to be refrigerated, include a few chemical ice packs in your kit. Cracking these packs when they’re ready for use will give you an ice pack without the need to keep anything frozen. Add some supplies for your cat’s comfort. In the event of an emergency, your cat will be outside of its comfort zone. Including some familiar toys, a blanket, and grooming supplies like a brush and nail clippers can help keep your cat comfortable in an emergency. A pheromone spray like Feliway can also contribute to your cat’s comfort. Spraying it on your cat’s toys and blanket, and in the areas where they’re staying during the emergency, sends your cat a signal that they are in a safe place. Don’t forget litter supplies. Some pet stores and websites sell litter sets specifically for emergencies. They often include a collapsible litter pan and a small scoop. You can create your own by purchasing a small litter pan and scoop and including paper towel, garbage bags and a disinfectant to keep your cat’s litter box clean during an emergency. Don’t forget the actual litter, either. Assembling Your Kit Store food and treats in airtight containers. The food and treats in your emergency kit might sit for a really long time before you ever need it. Storing them in airtight containers prevents them from going bad and ensures you have fresh supplies regardless of when an emergency hits. Store water in a dark, cool place. Your cat’s emergency water supply should be stored in an airtight container. It should also be stored somewhere dark and cool to prevent mold growing in it. Store medication in a waterproof container. A waterproof container will protect your cat’s meds from getting soggy or becoming useless if the emergency you have to deal with is a flood. Print a list of supplies to tape to your kit. Once you’ve assembled and properly stored all of your evacuation kit items, print up a list of the supplies in your kit. This will help you keep track of what’s in the kit, and will also prevent you from forgetting what’s in there in the first place! Print a calendar for supply rotation. Printing out a calendar that shows when which supplies should be rotated will help prevent you from having bad food or medication in your cat’s kit. You should check the calendar once a month to ensure everything stays fresh. Food should be rotated out every three months, water and medication should be rotated every two months. Put paperwork and records in a waterproof pouch. You don’t want your cat’s paperwork to get soaked in the rain or ruined by a flood, so consider storing it in a waterproof pouch. Many sporting goods stores have these types of bags – they’re usually advertised as being useful for rafting or camping trips. You can also just use a large plastic storage bag. Put everything in a plastic tub. Once you’ve collected all of your supplies and put them in their respective containers, put everything into a larger plastic tub. You can also use a bag for storing everything, but a plastic tub will protect your cat’s kit from the elements better than a bag might. Making Additional Evacuation Plans Store your kit near an exit. If the time comes that you need to use your kit, you don’t want to be rooting around in your attic or the back of a closet for it. Store it as close to the exit of your home as possible. Post a rescue alert sticker. If the emergency is a fire or something else that might bring rescue workers to your home, make sure you post a rescue alert sticker. These are available from the ASPCA and will notify the rescue workers that there are pets in the home. Ask someone nearby to serve as interim caregiver. Ask someone you trust if they’d be willing to serve as an interim care giver in the event of an emergency. This allows your cat to be cared for, even if you end up in a shelter that does not accept animals. The person you ask should live close to you. Select a shelter-in-place room. It’s possible that the emergency you encounter will require you to stay in your home. In this case, you’ll need to choose a shelter-in-place room where both you and your cat will be comfortable. The room you choose should not have any windows (in case of strong winds) and should be near the interior of your home. Microchip your cat. Microchipping your cat can be expensive, but having a chip can help you locate your cat if they get lost during an emergency. You’d need to contact the chip company and ask them to track your cat. Making a Last Minute Kit Choose a large bag. You might not have the time or storage space to put a large evacuation kit together ahead of time. If this is the case and you find yourself in an emergency situation, choose the largest bag you have at your disposal. Add food and bottled water. You should add food and water to the bag first, since these are the most important for your cat. Grab what food you have at hand - either a bag of dry food or several cans of wet food. You should also add several bottles of water. Also include your cat's water and food bowls. Include your cat's paperwork. Any paperwork you have for your cat - vaccine, owner, or insurance paperwork - should also go in the bag. If you don't plan on making your kit ahead of time, at least keep this paperwork in one place so it's easy to take if you need it. Add toys. Your cat probably has a few go-to toys that are its favorites. When you're putting together a last minute evacuation kit, include these in your bag. They'll give your cat something familiar in what can be an unfamiliar and sometimes scary situation. Include litter supplies. You might not have time to get an extra or travel litter pan during an emergency, but you probably have a container of litter and a scoop at home. Include these, along with any container that is big enough for your cat to use as a litter box. The container should be at least big enough for your cat to stand up in. Add towels. Towels will keep your cat comfortable and warm in an emergency. You can also use them to swaddle your cat if you don't have an actual cat carrier.",
  "tyn_model":[
    "water",
    "food",
    "litter pan",
    "plastic tub",
    "cat carrier",
    "blanket",
    "litter supplies",
    "litter",
    "treats",
    "waterproof container",
    "calendar",
    "waterproof pouch",
    "bag",
    "towels",
    "’ worth",
    "can opener",
    "ice packs",
    "ice pack",
    "pheromone spray",
    "litter sets",
    "paper towel",
    "garbage bags",
    "airtight containers",
    "airtight container",
    "medication",
    "– they",
    "cat",
    "animals",
    "bottled water",
    "toys",
    "litter box"
  ],
  "tyn_section":[

  ]
}