{
  "title":"How to Do Spring Cleaning with Kids",
  "url":"https://www.wikihow.com/Do-Spring-Cleaning-with-Kids",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Organizing Your Cleaning Schedule",
      "steps":[
        {
          "headline":"Tell your child in advance about your cleaning schedule.",
          "description":"Announce the day and which tasks you'll be tackling. Give specific examples of what you'll be doing and what the positive outcomes will be. For example, you could say to a child under 10, “Next Sunday we'll be making more space for your summer toys in the garage. We'll be taking out old stuff and reorganizing so you can find your toys and bikes more easily. Then we can take a bike ride!”\nFor a tween or teenager, emphasize responsibility, such as by saying, “We will clean the dining room this weekend. You'll be in charge of polishing the furniture and the silver.”"
        },
        {
          "headline":"Set aside a morning for cleaning with younger children.",
          "description":"For a small child, set aside one morning each week for a small spring cleaning project. Talk to your child about what you will do together to complete each project. Little kids have short attention spans, so break down the project into smaller tasks. For example, say, “We'll be cleaning the playroom next week. First we will put your toys away, then we will vacuum the rug.”"
        },
        {
          "headline":"Plan major tasks for your older child.",
          "description":"For example, assign your teen landscaping projects, like weeding and seeding the garden, building rock walls and garden trellises, and spreading mulch. Let them help you schedule the order in which tasks should be completed and when they plan to do them."
        },
        {
          "headline":"Make lists or chore charts.",
          "description":"Write down specific tasks for your child to accomplish. Add a column for them to check off when they've completed each task. To make it more fun and engaging, ask your younger child to decorate their list or chart. Upload a task list to your tween or teen's cell phone. Buy stickers for young children to put in the check boxes when each task is complete. Allow your child to choose the sticker as a reward. Draw pictures to represent the tasks for a toddler. You could also cut and paste pictures instead of drawing. Laminate and post the chore chart in an area where your child will see it often. Use a dry-erase marker to check off completed tasks, or let young children move Velcro images of tasks to a “completed” column."
        },
        {
          "headline":"Give clear directions.",
          "description":"Be very specific about your expectations instead of saying something general like “dust the living room.” Tell your child exactly what they are to do. Break the directions down into steps if possible. For example, say: “Take your duster and brush it over all of the shelves in the bookcase. Next, dust with your duster on top of and around the TV.”\nThe first time you teach your child to do a task, you should model it for them. Explain what you are doing and why, such as, “Now I am moving the lamp so I can dust the table underneath it.”\nFor more complicated chores, write down step-by-step instructions, including the tools and cleaning products needed for the job. For example, give your teen written instructions on how to clean the grout in the bathrooms, and list the scrub brushes and cleaners needed to get the job done."
        }
      ]
    },
    {
      "name":"Motivating Your Kids",
      "steps":[
        {
          "headline":"Work as a team.",
          "description":"Begin each task with your child. Show them what you want done and demonstrate cleaning techniques. Keep an upbeat attitude and emphasize the importance of teamwork. Use this time to model behavior about teamwork and about the importance of cleaning. Divide tasks in each room. For example, you can clean the tops of mirrors and windows while your young child cleans the lower half with you. You and your older child can work together to determine the tasks needed to clean each room and each choose the jobs you can do best. Give a tween or teen the more exciting jobs, like repainting a fence."
        },
        {
          "headline":"Use a timer.",
          "description":"Break tasks down into smaller chunks that can be accomplished quickly. For example, when cleaning bedrooms, start by making beds. Assign your child one short task at a time, then set a timer. Tell them that if they complete the task before the timer goes off, they can have a reward like extra play time or an extra sticker on their chore chart. Find age appropriate rewards. For example, let a tween spend time on their phone or the computer if they finish before the timer goes off."
        },
        {
          "headline":"Play music.",
          "description":"Find upbeat music to play while you clean. Let your child help you choose the songs. Ask your tween or teen to create a playlist. Sing along and take dance breaks to motivate yourselves. Time them with music. Tell your child that if they finish a task before the song ends, they can take a dance break."
        },
        {
          "headline":"Give your older child more autonomy.",
          "description":"Taking responsibility for a major cleaning job will motivate an older child. Assign your tween or teenager an important chore, like vacuuming all of the furniture, shampooing the carpets, or polishing the floors. Give them a few tips and the tools for the job, then tell them that you trust them to get the job done. Set a deadline and let them work at their own pace. Praise them as they are working and when they've completed the job. Reward them with a slightly later curfew, extra driving privileges, a book, or a trip to Starbucks."
        }
      ]
    },
    {
      "name":"Making it Fun",
      "steps":[
        {
          "headline":"Give your child a cleaning kit.",
          "description":"Put together a set of cleaning tools for your child. For children under 10, include child-safe cleaners, like spray bottles with water and vinegar. Try to find smaller feather dusters, child-sized aprons and cleaning gloves, and make rags from brightly colored old clothes. Put everything together in their own cleaning caddy. Include all safety gear they may need, like gloves or goggles. Let them decorate spray bottles and the caddy. Include their own handheld vacuum and other grown-up tools for an older child. If you're making cleaning products from scratch, let your older child find, measure, and mix the ingredients."
        },
        {
          "headline":"Play games with a child under 10.",
          "description":"Try the color game, where children have to clean things that are a color you shout out. For example, they need to pick up all blue toys and books when you call out “blue.”\nOr, play follow the leader, where the leader walks through a room dusting and putting things away while the other player(s) follow along and do similar tasks. Change leaders for every room you will clean."
        },
        {
          "headline":"Make dusting fun.",
          "description":"Give your child old socks and have them skate around hardwood floors to collect dust bunnies. Let them pull books out of the bookshelves and dust the shelves and then reorganize the books on the shelves. Hide stickers or treats around places you've asked your child to dust and let them collect all of the stickers or treats as they dust. Hide a gift card or money for a tween or teen to find. Give your tween or teen a ladder and ask them to dust ceiling fans and other high areas."
        },
        {
          "headline":"Do detective work in the kitchen.",
          "description":"Tell your child they are your kitchen detective. Have an older child search for expired foods in the pantry and refrigerator. Next, ask them to sort them into garbage, recycling, or trash and to dispose of the expired food accordingly. Ask a younger child sort and alphabetize cans in the pantry or spices in the spice rack."
        },
        {
          "headline":"Have a garage sale.",
          "description":"Collect all of the old things you're ready to get rid of after your spring cleaning. Decide which you should donate and which you can sell. Have your child help you make colorful signs for your sale and post them in your neighborhood. Ask your teen to create and post a flyer online through social media if they use it. Price items together with your tween or teen. Ask your child to help you display the items and put price stickers on them. An older child can help collect money and make change. Older and younger children can help demonstrate items to potential customers. Reward your child with some of the profits, either as cash or with a trip to a restaurant, ice cream parlor, arcade, or other fun destination."
        }
      ]
    }
  ],
  "text":" Organizing Your Cleaning Schedule Tell your child in advance about your cleaning schedule. Announce the day and which tasks you'll be tackling. Give specific examples of what you'll be doing and what the positive outcomes will be. For example, you could say to a child under 10, “Next Sunday we'll be making more space for your summer toys in the garage. We'll be taking out old stuff and reorganizing so you can find your toys and bikes more easily. Then we can take a bike ride!”\nFor a tween or teenager, emphasize responsibility, such as by saying, “We will clean the dining room this weekend. You'll be in charge of polishing the furniture and the silver.” Set aside a morning for cleaning with younger children. For a small child, set aside one morning each week for a small spring cleaning project. Talk to your child about what you will do together to complete each project. Little kids have short attention spans, so break down the project into smaller tasks. For example, say, “We'll be cleaning the playroom next week. First we will put your toys away, then we will vacuum the rug.” Plan major tasks for your older child. For example, assign your teen landscaping projects, like weeding and seeding the garden, building rock walls and garden trellises, and spreading mulch. Let them help you schedule the order in which tasks should be completed and when they plan to do them. Make lists or chore charts. Write down specific tasks for your child to accomplish. Add a column for them to check off when they've completed each task. To make it more fun and engaging, ask your younger child to decorate their list or chart. Upload a task list to your tween or teen's cell phone. Buy stickers for young children to put in the check boxes when each task is complete. Allow your child to choose the sticker as a reward. Draw pictures to represent the tasks for a toddler. You could also cut and paste pictures instead of drawing. Laminate and post the chore chart in an area where your child will see it often. Use a dry-erase marker to check off completed tasks, or let young children move Velcro images of tasks to a “completed” column. Give clear directions. Be very specific about your expectations instead of saying something general like “dust the living room.” Tell your child exactly what they are to do. Break the directions down into steps if possible. For example, say: “Take your duster and brush it over all of the shelves in the bookcase. Next, dust with your duster on top of and around the TV.”\nThe first time you teach your child to do a task, you should model it for them. Explain what you are doing and why, such as, “Now I am moving the lamp so I can dust the table underneath it.”\nFor more complicated chores, write down step-by-step instructions, including the tools and cleaning products needed for the job. For example, give your teen written instructions on how to clean the grout in the bathrooms, and list the scrub brushes and cleaners needed to get the job done. Motivating Your Kids Work as a team. Begin each task with your child. Show them what you want done and demonstrate cleaning techniques. Keep an upbeat attitude and emphasize the importance of teamwork. Use this time to model behavior about teamwork and about the importance of cleaning. Divide tasks in each room. For example, you can clean the tops of mirrors and windows while your young child cleans the lower half with you. You and your older child can work together to determine the tasks needed to clean each room and each choose the jobs you can do best. Give a tween or teen the more exciting jobs, like repainting a fence. Use a timer. Break tasks down into smaller chunks that can be accomplished quickly. For example, when cleaning bedrooms, start by making beds. Assign your child one short task at a time, then set a timer. Tell them that if they complete the task before the timer goes off, they can have a reward like extra play time or an extra sticker on their chore chart. Find age appropriate rewards. For example, let a tween spend time on their phone or the computer if they finish before the timer goes off. Play music. Find upbeat music to play while you clean. Let your child help you choose the songs. Ask your tween or teen to create a playlist. Sing along and take dance breaks to motivate yourselves. Time them with music. Tell your child that if they finish a task before the song ends, they can take a dance break. Give your older child more autonomy. Taking responsibility for a major cleaning job will motivate an older child. Assign your tween or teenager an important chore, like vacuuming all of the furniture, shampooing the carpets, or polishing the floors. Give them a few tips and the tools for the job, then tell them that you trust them to get the job done. Set a deadline and let them work at their own pace. Praise them as they are working and when they've completed the job. Reward them with a slightly later curfew, extra driving privileges, a book, or a trip to Starbucks. Making it Fun Give your child a cleaning kit. Put together a set of cleaning tools for your child. For children under 10, include child-safe cleaners, like spray bottles with water and vinegar. Try to find smaller feather dusters, child-sized aprons and cleaning gloves, and make rags from brightly colored old clothes. Put everything together in their own cleaning caddy. Include all safety gear they may need, like gloves or goggles. Let them decorate spray bottles and the caddy. Include their own handheld vacuum and other grown-up tools for an older child. If you're making cleaning products from scratch, let your older child find, measure, and mix the ingredients. Play games with a child under 10. Try the color game, where children have to clean things that are a color you shout out. For example, they need to pick up all blue toys and books when you call out “blue.”\nOr, play follow the leader, where the leader walks through a room dusting and putting things away while the other player(s) follow along and do similar tasks. Change leaders for every room you will clean. Make dusting fun. Give your child old socks and have them skate around hardwood floors to collect dust bunnies. Let them pull books out of the bookshelves and dust the shelves and then reorganize the books on the shelves. Hide stickers or treats around places you've asked your child to dust and let them collect all of the stickers or treats as they dust. Hide a gift card or money for a tween or teen to find. Give your tween or teen a ladder and ask them to dust ceiling fans and other high areas. Do detective work in the kitchen. Tell your child they are your kitchen detective. Have an older child search for expired foods in the pantry and refrigerator. Next, ask them to sort them into garbage, recycling, or trash and to dispose of the expired food accordingly. Ask a younger child sort and alphabetize cans in the pantry or spices in the spice rack. Have a garage sale. Collect all of the old things you're ready to get rid of after your spring cleaning. Decide which you should donate and which you can sell. Have your child help you make colorful signs for your sale and post them in your neighborhood. Ask your teen to create and post a flyer online through social media if they use it. Price items together with your tween or teen. Ask your child to help you display the items and put price stickers on them. An older child can help collect money and make change. Older and younger children can help demonstrate items to potential customers. Reward your child with some of the profits, either as cash or with a trip to a restaurant, ice cream parlor, arcade, or other fun destination.",
  "tyn_model":[
    "”\n",
    "“we",
    "duster",
    "spray bottles",
    "“next",
    "” set",
    "” plan",
    "mulch",
    "stickers",
    "dry-erase marker",
    "“completed",
    "” column",
    "“dust",
    "” tell",
    "“take",
    "“now",
    "lamp",
    "cleaning products",
    "grout",
    "scrub brushes",
    "timer",
    "music",
    "cleaning kit",
    "water",
    "vinegar",
    "cleaning gloves",
    "vacuum",
    "“blue",
    "ladder",
    "refrigerator",
    "spices",
    "spice rack",
    "ice cream parlor"
  ],
  "tyn_section":[

  ]
}