{
  "title":"How to Use Oregano Oil",
  "url":"https://www.wikihow.com/Use-Oregano-Oil",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Cooking with Oregano Oil",
      "steps":[
        {
          "headline":"Add it to pizza and spaghetti sauce.",
          "description":"Because oregano oil has a very strong taste, start with a toothpick-sized amount. Dip a toothpick in the oil. To mix in the oil, stir the sauce with the toothpick. After you have stirred in the oil, taste the sauce and add more oil as needed. You can use as much as a drop of oil when adding it to pizza and spaghetti sauce. You can also add oregano oil to roasts. Add a drop of oil to your roast before you cook it."
        },
        {
          "headline":"Make a veggie dip.",
          "description":"Combine 1 cup (240 ml) of mayo, 1 cup of sour cream, 1 teaspoon  (5 ml) of Worcestershire sauce, 1 drop of basil essential oil, and 1 drop of oregano essential oil. Add salt and pepper to taste. Mix the ingredients together until they are well-combined. Refrigerate the dip for 30 minutes to 1 hour before serving it with your favorite assortment of veggies."
        },
        {
          "headline":"Try an Italian bread dip.",
          "description":"Mix together ¼ cup (60 ml) of extra virgin olive oil, 1 to 3 tablespoons (15 to 45 ml) of balsamic vinegar, 1 tablespoon of Parmesan cheese, ½ teaspoon (2.5 ml) of Italian seasoning, and 1 to 2 drops of oregano oil to taste. Add salt and pepper to taste. Mix the ingredients together until they are well combined. Dip your bread in the oil and enjoy. Additionally, you can use this dip as a salad dressing."
        }
      ]
    },
    {
      "name":"Using Oregano Oil to Treat and Soothe",
      "steps":[
        {
          "headline":"Apply it topically.",
          "description":"Combine one part oregano oil to three parts olive oil or coconut oil (or a carrier oil of your choice). Dip the cotton swab in the ointment and apply it onto rashes and insect bites to alleviate itching. You can also soothe and clear skin blemishes with the oregano ointment. Additionally, you can massage the ointment into the bottom of your feet to boost your immune system. For toenail fungus or wart/mole removal, combine one part oregano oil to one part carrier oil. Use a cotton swab to apply the ointment onto affected areas."
        },
        {
          "headline":"Add a drop to ½ cup (120 ml) of water.",
          "description":"Drink the water to relieve a sore throat, toothache, and menstrual cramps. Drinking oregano oil infused water can also aid in digestion and boost your immune system. You can do this up to four times daily for no more than 10 days. Alternatively, you can hold a sip of water in the back of your throat. Add two drops of oil to the water in the back your throat. Swallow the water and chase it with a few sips of fresh water."
        },
        {
          "headline":"Take a supplement.",
          "description":"A daily dosage of 600 mg of oregano oil can help fight harmful organisms in your body. Additionally, to support healthy respiratory function, add one or two drops to a veggie capsule. For the best results, consult your physician first before supplementing your diet with oregano oil. Do not take the supplements for more than 10 days."
        },
        {
          "headline":"Make a steam tent.",
          "description":"Bring a pot of water to a boil and turn off the heat. Add one to four drops of oregano oil to the water while it is hot. Stand over the pot of water. Drape a towel over your head, shoulders and the pot. Breathe in the steam from a comfortable distance for 15 minutes or until the steam stops. Only use one drop of oil if you are treating your child’s allergy or cold symptoms. The combination of oregano oil and steam is great for relieving cold and allergy symptoms."
        },
        {
          "headline":"Use it for aromatherapy.",
          "description":"Place one to two drops of the oregano oil into your diffuser’s water reservoir, or per the instructions on the instruction manual. Turn your diffuser on and enjoy the calming benefits of oregano oil. Using oregano oil for aromatherapy can promote a balanced mood, reduce stress, and curb emotional abnormalities."
        }
      ]
    },
    {
      "name":"Cleaning with Oregano Oil",
      "steps":[
        {
          "headline":"Fill a bucket with four cups (960 ml) of water.",
          "description":"Add in four drops of oregano oil, 10 drops of lemon oil, and ¼ cup (60 ml) of white, distilled vinegar. Mix the ingredients together until they are well-combined. Alternatively, fill a 16-ounce spray bottle with water. Add in 10 drops of oregano oil. Shake the bottle to combine the ingredients."
        },
        {
          "headline":"Apply the solution onto dirty surfaces.",
          "description":"Spray or pour the solution onto the dirty surfaces until they are completely covered. Let the solution set for three to five minutes. Use oregano oil to clean surfaces that have come into contact with cooked or raw food like kitchen counters and tables. For other cleaning purposes, test the solution on a small spot for any unwanted effects before using it."
        },
        {
          "headline":"Wipe clean.",
          "description":"Use a clean cloth or rag to wipe the surface clean. Try to avoid getting the solution on your hands and skin. The oregano oil may cause a burning sensation if it gets onto your skin. If the solution gets onto your skin, wash the affected area thoroughly with soap and cold water."
        }
      ]
    }
  ],
  "text":" Cooking with Oregano Oil Add it to pizza and spaghetti sauce. Because oregano oil has a very strong taste, start with a toothpick-sized amount. Dip a toothpick in the oil. To mix in the oil, stir the sauce with the toothpick. After you have stirred in the oil, taste the sauce and add more oil as needed. You can use as much as a drop of oil when adding it to pizza and spaghetti sauce. You can also add oregano oil to roasts. Add a drop of oil to your roast before you cook it. Make a veggie dip. Combine 1 cup (240 ml) of mayo, 1 cup of sour cream, 1 teaspoon  (5 ml) of Worcestershire sauce, 1 drop of basil essential oil, and 1 drop of oregano essential oil. Add salt and pepper to taste. Mix the ingredients together until they are well-combined. Refrigerate the dip for 30 minutes to 1 hour before serving it with your favorite assortment of veggies. Try an Italian bread dip. Mix together ¼ cup (60 ml) of extra virgin olive oil, 1 to 3 tablespoons (15 to 45 ml) of balsamic vinegar, 1 tablespoon of Parmesan cheese, ½ teaspoon (2.5 ml) of Italian seasoning, and 1 to 2 drops of oregano oil to taste. Add salt and pepper to taste. Mix the ingredients together until they are well combined. Dip your bread in the oil and enjoy. Additionally, you can use this dip as a salad dressing. Using Oregano Oil to Treat and Soothe Apply it topically. Combine one part oregano oil to three parts olive oil or coconut oil (or a carrier oil of your choice). Dip the cotton swab in the ointment and apply it onto rashes and insect bites to alleviate itching. You can also soothe and clear skin blemishes with the oregano ointment. Additionally, you can massage the ointment into the bottom of your feet to boost your immune system. For toenail fungus or wart/mole removal, combine one part oregano oil to one part carrier oil. Use a cotton swab to apply the ointment onto affected areas. Add a drop to ½ cup (120 ml) of water. Drink the water to relieve a sore throat, toothache, and menstrual cramps. Drinking oregano oil infused water can also aid in digestion and boost your immune system. You can do this up to four times daily for no more than 10 days. Alternatively, you can hold a sip of water in the back of your throat. Add two drops of oil to the water in the back your throat. Swallow the water and chase it with a few sips of fresh water. Take a supplement. A daily dosage of 600 mg of oregano oil can help fight harmful organisms in your body. Additionally, to support healthy respiratory function, add one or two drops to a veggie capsule. For the best results, consult your physician first before supplementing your diet with oregano oil. Do not take the supplements for more than 10 days. Make a steam tent. Bring a pot of water to a boil and turn off the heat. Add one to four drops of oregano oil to the water while it is hot. Stand over the pot of water. Drape a towel over your head, shoulders and the pot. Breathe in the steam from a comfortable distance for 15 minutes or until the steam stops. Only use one drop of oil if you are treating your child’s allergy or cold symptoms. The combination of oregano oil and steam is great for relieving cold and allergy symptoms. Use it for aromatherapy. Place one to two drops of the oregano oil into your diffuser’s water reservoir, or per the instructions on the instruction manual. Turn your diffuser on and enjoy the calming benefits of oregano oil. Using oregano oil for aromatherapy can promote a balanced mood, reduce stress, and curb emotional abnormalities. Cleaning with Oregano Oil Fill a bucket with four cups (960 ml) of water. Add in four drops of oregano oil, 10 drops of lemon oil, and ¼ cup (60 ml) of white, distilled vinegar. Mix the ingredients together until they are well-combined. Alternatively, fill a 16-ounce spray bottle with water. Add in 10 drops of oregano oil. Shake the bottle to combine the ingredients. Apply the solution onto dirty surfaces. Spray or pour the solution onto the dirty surfaces until they are completely covered. Let the solution set for three to five minutes. Use oregano oil to clean surfaces that have come into contact with cooked or raw food like kitchen counters and tables. For other cleaning purposes, test the solution on a small spot for any unwanted effects before using it. Wipe clean. Use a clean cloth or rag to wipe the surface clean. Try to avoid getting the solution on your hands and skin. The oregano oil may cause a burning sensation if it gets onto your skin. If the solution gets onto your skin, wash the affected area thoroughly with soap and cold water.",
  "tyn_model":[
    "oregano oil",
    "water",
    "oil",
    "cotton swab",
    "spaghetti sauce",
    "mayo",
    "sour cream",
    "worcestershire sauce",
    "basil essential oil",
    "oregano essential oil",
    "salt",
    "pepper",
    "extra virgin olive oil",
    "balsamic vinegar",
    "parmesan cheese",
    "italian seasoning",
    "salt and pepper",
    "salad dressing",
    "olive oil",
    "coconut oil",
    "oregano ointment",
    "carrier oil",
    "fresh water",
    "towel",
    "pot",
    "lemon oil",
    "white, distilled vinegar",
    "spray bottle",
    "soap"
  ],
  "tyn_section":[

  ]
}