{
  "title":"How to Clean a Washing Machine Drain",
  "url":"https://www.wikihow.com/Clean-a-Washing-Machine-Drain",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Using Drain Cleaners",
      "steps":[
        {
          "headline":"Find the drain.",
          "description":"Usually the drain of a washing machine is a pipe behind the machine that the hose on the machine pours into. The hose is sometimes attached tightly to the drain or the hose may simply be pushed inside of it. When identifying where the drain is, you will need to differentiate it from the hot and cold water lines coming into the washer. The hot and cold water lines should be smaller than the drain pipe and they may be marked with the colors red and blue, to show which is hot and which is cold."
        },
        {
          "headline":"Pour hot water down the drain.",
          "description":"If your washing machine is draining slowly but it is not completely clogged, you can try simply pouring very hot water down the drain to clear it out. This can release built up soap and scum that is narrowing your drainage pipe. If you run your washer on hot most of the time, then this may not work for your drainage problem, as you have been doing this repeatedly. However, if you only run cold cycles, then pouring hot water down the drain may be worth a try. In areas that freeze during the winter, drainage pipes can freeze and get blocked up with ice. If your area is frozen and you think you have a clogged drain, try pouring hot water down the drain to get rid of any ice that may have accumulated."
        },
        {
          "headline":"Buy a commercial drain cleaner.",
          "description":"If your washing machine drain is clogged, one way to clear it is to use a commercial drain cleaner. In general, these products can be very helpful for minor clogs but have limitations when it comes to unclogging a completely clogged pipe. When buying a commercial drain cleaner, be sure to get one that is safe to use with your specific type of pipes and your type of drainage system. Some strong products that contain sulfuric acid can actually damage PVC pipes and they are generally not good for the environment as well."
        },
        {
          "headline":"Detach the drain.",
          "description":"To use a commercial drain cleaner, you will need to detach the drain line from the machine and put the cleaner straight into the drain. On some machines you can simply pull the tube coming off the machine out of the drainage pipe. On some, however, you will need to unscrew the drainage tube from the machine at the bottom of the back of the machine. If you are doing this, be prepared for some water to come out of the machine and the hose to the drain."
        },
        {
          "headline":"Follow the directions on the packaging.",
          "description":"This usually begins by pouring the product down your drain with some very hot water. Then you will need to wait a specified amount of time for the product to do its work. Finally, you will need to flush the drain once the product has had time to clear it. Be sure to rinse out the drain cleaner after the specified amount of time. Leaving it on too long can damage the pipes."
        }
      ]
    },
    {
      "name":"Snaking a Drain",
      "steps":[
        {
          "headline":"Detach the drain hose from the machine.",
          "description":"If the clog you are trying to dislodge is not disrupted by chemicals, then you will need to use a snake to get rid of it. This requires that you detach the hose from the machine so you can get the snake down it. The drainage hose meets the machine at the back of your washing machine. There  should be a clamp that attaches the two where you can use a screw driver to detach them. Remember that some water will likely come out of the machine and the hose when you detach the hose, so have a bucket and some towels ready. This is especially true if the drain is so clogged that there is standing water in the machine."
        },
        {
          "headline":"Put a snake down the drain.",
          "description":"Once you have the drain pipe free, you can insert the snake down into it. A snake is a tool the consists of a long, sturdy wire that goes down a pipe and a handle at the end that rotates it. The key is to push the snake down the pipe and feel for clogs as you go. Once you feel resistance, you should turn the handle clockwise on the snake to rotate it in the pipe so it grabs any clogging debris. There are several lengths of snakes to choose from. Medium-length snakes that are about 50 to 75 feet (15 to 23 m) long tend to work well for home owners working on a variety of clogs, as they can get clogs pretty far down a pipe but they are easier to work with than longer, bigger snakes."
        },
        {
          "headline":"Snake the drain until all resistance is gone.",
          "description":"It may take several turns of the handle on the snake to get a clogged area attached to the snake. Once you have turned it several times, pull the snake out and clean off all debris. Then insert the snake again to clear out any additional debris. You may also want to push the snake further down the drain after you clear one area, just to make sure there are not other clogged spots. As you turn the handle you may want to move the snake a little in and out of the pipe. This will help the snake to grab onto any debris in the pipe and pull it free. Once you think you have the drain clear, pull the snake out of the pipe. To check that the clog is gone, you can pour water down it before reattaching it to your washing machine."
        },
        {
          "headline":"Reattach the hose.",
          "description":"Once you are sure that the clog is gone you should reattach the hose to the machine. Be sure to attach the drainage hose to the machine really well, as this is a spot that tends to leak on a washing machine. Fill the washing machine and drain it with no clothes in it to make sure you fixed the drainage issue. You should also look at the connection point between the machine and the drainage hose for any leaks."
        }
      ]
    }
  ],
  "text":" Using Drain Cleaners Find the drain. Usually the drain of a washing machine is a pipe behind the machine that the hose on the machine pours into. The hose is sometimes attached tightly to the drain or the hose may simply be pushed inside of it. When identifying where the drain is, you will need to differentiate it from the hot and cold water lines coming into the washer. The hot and cold water lines should be smaller than the drain pipe and they may be marked with the colors red and blue, to show which is hot and which is cold. Pour hot water down the drain. If your washing machine is draining slowly but it is not completely clogged, you can try simply pouring very hot water down the drain to clear it out. This can release built up soap and scum that is narrowing your drainage pipe. If you run your washer on hot most of the time, then this may not work for your drainage problem, as you have been doing this repeatedly. However, if you only run cold cycles, then pouring hot water down the drain may be worth a try. In areas that freeze during the winter, drainage pipes can freeze and get blocked up with ice. If your area is frozen and you think you have a clogged drain, try pouring hot water down the drain to get rid of any ice that may have accumulated. Buy a commercial drain cleaner. If your washing machine drain is clogged, one way to clear it is to use a commercial drain cleaner. In general, these products can be very helpful for minor clogs but have limitations when it comes to unclogging a completely clogged pipe. When buying a commercial drain cleaner, be sure to get one that is safe to use with your specific type of pipes and your type of drainage system. Some strong products that contain sulfuric acid can actually damage PVC pipes and they are generally not good for the environment as well. Detach the drain. To use a commercial drain cleaner, you will need to detach the drain line from the machine and put the cleaner straight into the drain. On some machines you can simply pull the tube coming off the machine out of the drainage pipe. On some, however, you will need to unscrew the drainage tube from the machine at the bottom of the back of the machine. If you are doing this, be prepared for some water to come out of the machine and the hose to the drain. Follow the directions on the packaging. This usually begins by pouring the product down your drain with some very hot water. Then you will need to wait a specified amount of time for the product to do its work. Finally, you will need to flush the drain once the product has had time to clear it. Be sure to rinse out the drain cleaner after the specified amount of time. Leaving it on too long can damage the pipes. Snaking a Drain Detach the drain hose from the machine. If the clog you are trying to dislodge is not disrupted by chemicals, then you will need to use a snake to get rid of it. This requires that you detach the hose from the machine so you can get the snake down it. The drainage hose meets the machine at the back of your washing machine. There  should be a clamp that attaches the two where you can use a screw driver to detach them. Remember that some water will likely come out of the machine and the hose when you detach the hose, so have a bucket and some towels ready. This is especially true if the drain is so clogged that there is standing water in the machine. Put a snake down the drain. Once you have the drain pipe free, you can insert the snake down into it. A snake is a tool the consists of a long, sturdy wire that goes down a pipe and a handle at the end that rotates it. The key is to push the snake down the pipe and feel for clogs as you go. Once you feel resistance, you should turn the handle clockwise on the snake to rotate it in the pipe so it grabs any clogging debris. There are several lengths of snakes to choose from. Medium-length snakes that are about 50 to 75 feet (15 to 23 m) long tend to work well for home owners working on a variety of clogs, as they can get clogs pretty far down a pipe but they are easier to work with than longer, bigger snakes. Snake the drain until all resistance is gone. It may take several turns of the handle on the snake to get a clogged area attached to the snake. Once you have turned it several times, pull the snake out and clean off all debris. Then insert the snake again to clear out any additional debris. You may also want to push the snake further down the drain after you clear one area, just to make sure there are not other clogged spots. As you turn the handle you may want to move the snake a little in and out of the pipe. This will help the snake to grab onto any debris in the pipe and pull it free. Once you think you have the drain clear, pull the snake out of the pipe. To check that the clog is gone, you can pour water down it before reattaching it to your washing machine. Reattach the hose. Once you are sure that the clog is gone you should reattach the hose to the machine. Be sure to attach the drainage hose to the machine really well, as this is a spot that tends to leak on a washing machine. Fill the washing machine and drain it with no clothes in it to make sure you fixed the drainage issue. You should also look at the connection point between the machine and the drainage hose for any leaks.",
  "tyn_model":[
    "water",
    "hose",
    "snake",
    "drain cleaner",
    "washing machine",
    "drainage hose",
    "snakes",
    "washer",
    "hot water",
    "cleaner",
    "drain hose",
    "screw driver",
    "bucket",
    "towels",
    "wire",
    "drain"
  ],
  "tyn_section":[

  ]
}