{
  "title":"How to Clean Baking Sheets",
  "url":"https://www.wikihow.com/Clean-Baking-Sheets",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Cookware"
  ],
  "methods":[
    {
      "name":"Using Baking Soda and Hydrogen Peroxide",
      "steps":[
        {
          "headline":"Sprinkle baking soda across the baking sheet.",
          "description":"To start, take some baking soda from your pantry. Sprinkle a light layer on your baking sheet. Make sure the full surface of the sheet is covered in a layer of baking soda to start."
        },
        {
          "headline":"Add a layer of hydrogen peroxide.",
          "description":"After adding your baking soda, pour a layer of hydrogen peroxide over the baking soda. If you don't have hydrogen peroxide, you can purchase it at any drug store."
        },
        {
          "headline":"Add a second layer of baking soda.",
          "description":"Sprinkle another layer of baking soda on the baking sheet. Makes sure to cover the full surface with a light dusting of baking soda. This will ensure the baking sheet comes clean."
        },
        {
          "headline":"Let the mixture sit for two hours.",
          "description":"The baking soda and hydrogen peroxide needs to soak into the sheet to break down dirt and debris. Let the sheet sit for about two hours. Place in on a flat surface where it will not be disturbed. If you have young children or pets, keep the baking sheet out of their reach."
        },
        {
          "headline":"Wipe down your pan.",
          "description":"Take a coarse sponge or rag. Wipe the baking soda and hydrogen peroxide off the pan. Built up debris should come off easily after the pan was soaked. If there is any lingering baking soda after scrubbing down the pan, you can rinse it off with clean water."
        }
      ]
    },
    {
      "name":"Using Ammonia and Steel Wool",
      "steps":[
        {
          "headline":"Place the baking sheet in the bag with half a cup of ammonia.",
          "description":"Take a plastic bag big enough to hold the baking sheet. Pour half a cup of ammonia in the bag. Seal the bag completely."
        },
        {
          "headline":"Set the pan outside for a day.",
          "description":"The ammonia will take about a day to break down the debris on a baking sheet. Place the sheet somewhere outside, such as your porch or balcony, where it will be exposed to sunlight. This helps the ammonia break down grease and stains on the pan. Ammonia is toxic, so keep the pan out of reach of animals and children."
        },
        {
          "headline":"Scrub down the pan with steel wool.",
          "description":"After a day has passed, remove the pan from the bag. Use a steel wool sponge to scrub down the pan. This should remove any built up dirt, debris, and grease."
        },
        {
          "headline":"Rinse the pan completely.",
          "description":"It is very important to rinse ammonia off completely before using your pan again. Rinse your pan under running water or using a clean, wet rag. Make sure you get all remaining traces of ammonia off of the pan before using it again."
        }
      ]
    },
    {
      "name":"Avoiding Common Mistakes",
      "steps":[
        {
          "headline":"Do a spot test before applying any cleaner.",
          "description":"Not every baking sheet will respond well to a given cleaner. Before applying any cleaner to your sheet, test out the cleaner on a small portion of the baking sheet. Make sure there is no discoloration or damage."
        },
        {
          "headline":"Take safety precautions when using ammonia.",
          "description":"Ammonia is toxic, so wear protective gloves when handling it. You should also handle ammonia in a well-ventilated area to prevent breathing in the fumes. If possible, handle ammonia outside."
        },
        {
          "headline":"Use parchment paper when baking.",
          "description":"In the future, line your sheet with parchment paper before using it. This will protect the pan from grease and food residue. After using the pan, you will simply have to remove the dirty parchment paper."
        }
      ]
    }
  ],
  "text":" Using Baking Soda and Hydrogen Peroxide Sprinkle baking soda across the baking sheet. To start, take some baking soda from your pantry. Sprinkle a light layer on your baking sheet. Make sure the full surface of the sheet is covered in a layer of baking soda to start. Add a layer of hydrogen peroxide. After adding your baking soda, pour a layer of hydrogen peroxide over the baking soda. If you don't have hydrogen peroxide, you can purchase it at any drug store. Add a second layer of baking soda. Sprinkle another layer of baking soda on the baking sheet. Makes sure to cover the full surface with a light dusting of baking soda. This will ensure the baking sheet comes clean. Let the mixture sit for two hours. The baking soda and hydrogen peroxide needs to soak into the sheet to break down dirt and debris. Let the sheet sit for about two hours. Place in on a flat surface where it will not be disturbed. If you have young children or pets, keep the baking sheet out of their reach. Wipe down your pan. Take a coarse sponge or rag. Wipe the baking soda and hydrogen peroxide off the pan. Built up debris should come off easily after the pan was soaked. If there is any lingering baking soda after scrubbing down the pan, you can rinse it off with clean water. Using Ammonia and Steel Wool Place the baking sheet in the bag with half a cup of ammonia. Take a plastic bag big enough to hold the baking sheet. Pour half a cup of ammonia in the bag. Seal the bag completely. Set the pan outside for a day. The ammonia will take about a day to break down the debris on a baking sheet. Place the sheet somewhere outside, such as your porch or balcony, where it will be exposed to sunlight. This helps the ammonia break down grease and stains on the pan. Ammonia is toxic, so keep the pan out of reach of animals and children. Scrub down the pan with steel wool. After a day has passed, remove the pan from the bag. Use a steel wool sponge to scrub down the pan. This should remove any built up dirt, debris, and grease. Rinse the pan completely. It is very important to rinse ammonia off completely before using your pan again. Rinse your pan under running water or using a clean, wet rag. Make sure you get all remaining traces of ammonia off of the pan before using it again. Avoiding Common Mistakes Do a spot test before applying any cleaner. Not every baking sheet will respond well to a given cleaner. Before applying any cleaner to your sheet, test out the cleaner on a small portion of the baking sheet. Make sure there is no discoloration or damage. Take safety precautions when using ammonia. Ammonia is toxic, so wear protective gloves when handling it. You should also handle ammonia in a well-ventilated area to prevent breathing in the fumes. If possible, handle ammonia outside. Use parchment paper when baking. In the future, line your sheet with parchment paper before using it. This will protect the pan from grease and food residue. After using the pan, you will simply have to remove the dirty parchment paper.",
  "tyn_model":[
    "baking soda",
    "ammonia",
    "baking sheet",
    "hydrogen peroxide",
    "parchment paper",
    "water",
    "sponge",
    "plastic bag",
    "steel wool",
    "steel wool sponge",
    "pan"
  ],
  "tyn_section":[

  ]
}