{
  "title":"How to Make Chickpea and Pumpkin Burgers",
  "url":"https://www.wikihow.com/Make-Chickpea-and-Pumpkin-Burgers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian"
  ],
  "parts":[
    {
      "name":"Preparing the Pumpkin and Chickpeas",
      "steps":[
        {
          "headline":"Mash the cooked pumpkin.",
          "description":"After cooking the pumpkin until soft, remove from the heat and drain it. Once drained, either leave in the saucepan or transfer to a bowl, then mash. Set aside until needed shortly."
        },
        {
          "headline":"Prepare the chickpeas.",
          "description":"Tip them into a food processor or food blender. Process or blend the chickpeas to the consistency of big breadcrumbs. They should not be over-processed, which means avoid turning them into a paste. They need to be of a rougher texture to help keep the burger in shape and to give some appropriate \"crunch\" to the burger."
        },
        {
          "headline":"Transfer the breadcrumb-sized chickpea mixture from the processor or blender to the mixing bowl.",
          "description":"This mixture now serves as the base from which the burgers are made."
        }
      ]
    },
    {
      "name":"Making the Burgers",
      "steps":[
        {
          "headline":"Prepare the baking sheet.",
          "description":"Place a silicone mat or a layer of parchment paper over the baking sheet. This will help prevent sticking on the sheet when the burgers are baked. If you're frying the burgers, still do this step, as it will help the refrigeration process."
        },
        {
          "headline":"Add the chopped vegetables to the chickpea mixture.",
          "description":"Add the mashed pumpkin and stir through gently. Finish by adding the herbs and egg white, mixing in by stirring."
        },
        {
          "headline":"Continue mixing the burger mix.",
          "description":"Use your hands when it begins to thicken, as this will make it easier. When it begins to stick together, the burger mix is ready for shaping."
        },
        {
          "headline":"Shape the burgers.",
          "description":"Using your hands and fingers, take a couple of tablespoons of the burger mix and shape into a burger round. Pat it down to flatten it evenly across the top and bottom. Place onto the baking sheet. Repeat until all burgers have been shaped. This should make about 6 burgers in total."
        },
        {
          "headline":"Place the sheet of prepared burgers into the refrigerator.",
          "description":"Do not skip this step, as the chilling helps to keep the burgers in shape during cooking. Leave for one hour minimum (longer is fine too). It is a good idea to cover the burgers with a layer of wax paper or food wrap to prevent spills or smells from harming the burgers as they chill. Remove any such cover before baking."
        },
        {
          "headline":"Decide on baking or frying the burgers.",
          "description":"Both methods are appropriate but produce a different texture. The fried burgers will be oilier and cook faster but both should be crunchy on the outside when done. If frying, place a teaspoon or more of olive oil into the base of a frying pan. Heat until the oil is hot. Add the burgers. Cook on one side for a few minutes, then flip over and cook the other side. If baking, place the burgers already on the baking sheet into an oven preheated to 180ºC/350ºF and bake for 15 to 20 minutes. Test the burger is cooked before turning off the oven; if it needs a bit more, just return and bake in 5 minute increments, testing each time."
        },
        {
          "headline":"Remove the burgers from the heat source (stovetop or oven).",
          "description":"Handle the burgers using tongs or a spatula, as they are still hot. Turn into burgers (see next), or serve as part of a main meal, as patties with a side dish or two."
        }
      ]
    },
    {
      "name":"Putting the Burgers Together",
      "steps":[
        {
          "headline":"Cut the burger buns in half.",
          "description":"Place onto each individual plate the burger is to be served on. When cutting the burger buns, be more generous with the base half than the top half, to ensure that the burger is stable and easy to handle."
        },
        {
          "headline":"Squirt some sauce on the base of the first bottom bun half.",
          "description":"Add the burger to the base. Place a cheese slice on top (if using) and tomato slice. Then add the shredded lettuce and grated cheese. Place the top of the bun onto the last layer added."
        },
        {
          "headline":"Serve immediately.",
          "description":"If you've made French fries or another accompaniment, add before serving. Bon appétit!"
        }
      ]
    }
  ],
  "text":" Preparing the Pumpkin and Chickpeas Mash the cooked pumpkin. After cooking the pumpkin until soft, remove from the heat and drain it. Once drained, either leave in the saucepan or transfer to a bowl, then mash. Set aside until needed shortly. Prepare the chickpeas. Tip them into a food processor or food blender. Process or blend the chickpeas to the consistency of big breadcrumbs. They should not be over-processed, which means avoid turning them into a paste. They need to be of a rougher texture to help keep the burger in shape and to give some appropriate \"crunch\" to the burger. Transfer the breadcrumb-sized chickpea mixture from the processor or blender to the mixing bowl. This mixture now serves as the base from which the burgers are made. Making the Burgers Prepare the baking sheet. Place a silicone mat or a layer of parchment paper over the baking sheet. This will help prevent sticking on the sheet when the burgers are baked. If you're frying the burgers, still do this step, as it will help the refrigeration process. Add the chopped vegetables to the chickpea mixture. Add the mashed pumpkin and stir through gently. Finish by adding the herbs and egg white, mixing in by stirring. Continue mixing the burger mix. Use your hands when it begins to thicken, as this will make it easier. When it begins to stick together, the burger mix is ready for shaping. Shape the burgers. Using your hands and fingers, take a couple of tablespoons of the burger mix and shape into a burger round. Pat it down to flatten it evenly across the top and bottom. Place onto the baking sheet. Repeat until all burgers have been shaped. This should make about 6 burgers in total. Place the sheet of prepared burgers into the refrigerator. Do not skip this step, as the chilling helps to keep the burgers in shape during cooking. Leave for one hour minimum (longer is fine too). It is a good idea to cover the burgers with a layer of wax paper or food wrap to prevent spills or smells from harming the burgers as they chill. Remove any such cover before baking. Decide on baking or frying the burgers. Both methods are appropriate but produce a different texture. The fried burgers will be oilier and cook faster but both should be crunchy on the outside when done. If frying, place a teaspoon or more of olive oil into the base of a frying pan. Heat until the oil is hot. Add the burgers. Cook on one side for a few minutes, then flip over and cook the other side. If baking, place the burgers already on the baking sheet into an oven preheated to 180ºC/350ºF and bake for 15 to 20 minutes. Test the burger is cooked before turning off the oven; if it needs a bit more, just return and bake in 5 minute increments, testing each time. Remove the burgers from the heat source (stovetop or oven). Handle the burgers using tongs or a spatula, as they are still hot. Turn into burgers (see next), or serve as part of a main meal, as patties with a side dish or two. Putting the Burgers Together Cut the burger buns in half. Place onto each individual plate the burger is to be served on. When cutting the burger buns, be more generous with the base half than the top half, to ensure that the burger is stable and easy to handle. Squirt some sauce on the base of the first bottom bun half. Add the burger to the base. Place a cheese slice on top (if using) and tomato slice. Then add the shredded lettuce and grated cheese. Place the top of the bun onto the last layer added. Serve immediately. If you've made French fries or another accompaniment, add before serving. Bon appétit!",
  "tyn_model":[
    "baking sheet",
    "pumpkin",
    "oven",
    "chickpeas",
    "chickpea",
    "saucepan",
    "bowl",
    "food processor",
    "food blender",
    "processor",
    "blender",
    "mixing bowl",
    "silicone mat",
    "parchment paper",
    "vegetables",
    "herbs",
    "refrigerator",
    "wax paper",
    "food wrap",
    "olive oil",
    "frying pan",
    "oil",
    "spatula",
    "burger buns",
    "cheese",
    "tomato",
    "lettuce",
    "french fries"
  ],
  "tyn_section":[

  ]
}