{
  "title":"How to Lie in a Hammock",
  "url":"https://www.wikihow.com/Lie-in-a-Hammock",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Outdoor Living Spaces",
    "Hammocks"
  ],
  "steps":[
    {
      "headline":"Check the hammock tension.",
      "description":"There should be a decent dip or hang in the hammock––it shouldn't be too tight and it should appear comfortable to you. Also check that it has been suspended properly (if you have hung it yourself, you should already know this)."
    },
    {
      "headline":"Place your hands on one side of the hammock to steady yourself, then sit down.",
      "description":"Try to make sure that your butt is in the center of the hammock. Never try lying down in a hammock first––sitting is the best way to get into it."
    },
    {
      "headline":"Quickly swing your legs over the side and up onto the hammock.",
      "description":""
    },
    {
      "headline":"Find your center of balance.",
      "description":"Depending on your weight and if you're on a hill, your center of balance won't always be in the exact middle. Shift your weight left or right to decide."
    },
    {
      "headline":"Lie in the hammock.",
      "description":"Most people find that the back or side positions are the most comfortable when lying in a hammock. Stomach sleeping or resting doesn't tend to be as comfortable but you could try it before assuming it won't work for you. Most important of all, unless you're in a taut spreader bar hammock, you should find yourself lying diagonally and not straight. This is important because it lets you lie in the hammock for hours without back discomfort, with plenty of support and space."
    }
  ],
  "text":" Check the hammock tension. There should be a decent dip or hang in the hammock––it shouldn't be too tight and it should appear comfortable to you. Also check that it has been suspended properly (if you have hung it yourself, you should already know this). Place your hands on one side of the hammock to steady yourself, then sit down. Try to make sure that your butt is in the center of the hammock. Never try lying down in a hammock first––sitting is the best way to get into it. Quickly swing your legs over the side and up onto the hammock.  Find your center of balance. Depending on your weight and if you're on a hill, your center of balance won't always be in the exact middle. Shift your weight left or right to decide. Lie in the hammock. Most people find that the back or side positions are the most comfortable when lying in a hammock. Stomach sleeping or resting doesn't tend to be as comfortable but you could try it before assuming it won't work for you. Most important of all, unless you're in a taut spreader bar hammock, you should find yourself lying diagonally and not straight. This is important because it lets you lie in the hammock for hours without back discomfort, with plenty of support and space.",
  "tyn_model":[
    "hammock",
    "spreader bar hammock"
  ],
  "tyn_section":[

  ]
}