{
  "title":"How to Level Your Refrigerator",
  "url":"https://www.wikihow.com/Level-Your-Refrigerator",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "methods":[
    {
      "name":"Adjusting Leveling Legs",
      "steps":[
        {
          "headline":"Remove the grille over the legs.",
          "description":"At the very bottom of the refrigerator, you may see a covering over the legs. Many times, this grille can be removed by pulling with your hands. Some grilles will be attached by clips or screws you’ll have to undo first. Consult your owner’s manual for advice when you’re unsure of how to remove the grille."
        },
        {
          "headline":"Examine the legs.",
          "description":"Check the legs first for screws or bolts that you’ll need to adjust. While some legs can be rotated freely, some require a wrench or a screwdriver. Refrigerators made by GE, for example, require a flat blade screwdriver."
        },
        {
          "headline":"Rotate the legs.",
          "description":"Look along the top and bottoms of the legs. You’ll either see a slot near the top or a screw or bolt near the bottom. Use a flat-head screwdriver on the slots and an adjustable wrench or pliers on the bolt. Turn clockwise to raise the refrigerator. Turn counterclockwise to lower the refrigerator. Try to get the refrigerator level from left to right. Legs without fasteners, such as those on Whirlpool refrigerators, can be turned to the right to lower the refrigerator and to the left to raise it. If you cannot reach the legs to adjust them, you’ll need someone to lean the refrigerator to the back. Be very careful and don’t tilt it back too far."
        },
        {
          "headline":"Measure the refrigerator’s tilt with a level.",
          "description":"Place the level on the top of the refrigerator behind the door. The level will be flat if the refrigerator is even from left to right. Adjust the legs to get the refrigerator even from left to right."
        },
        {
          "headline":"Measure the refrigerator’s slope.",
          "description":"Place the level against the bottom of the refrigerator. It should slope slightly to the back. Make sure the front is .25 inches (6.35 mm) higher than the back. Make adjustments to the front legs as necessary."
        },
        {
          "headline":"Replace the grille.",
          "description":"Push the grille back onto the bottom of the refrigerator. Replace any clips or screws."
        }
      ]
    },
    {
      "name":"Adjusting Rollers",
      "steps":[
        {
          "headline":"Remove the grille over the legs.",
          "description":"Find the grille at the bottom of the refrigerator. Look for screws that need to be undone. Unscrew it or pull the grille off with your hands. Consult your owner’s manual for advice when you’re unsure on how to remove the grille."
        },
        {
          "headline":"Adjust the screws.",
          "description":"Each roller will have a screw on it. You will need pliers or a wrench for a ⅜ inch (9.5 mm) screw. Turn the screw clockwise to raise the legs. Turn the screw counterclockwise to lower them."
        },
        {
          "headline":"Measure the refrigerator’s tilt with a level.",
          "description":"Place the level on the very top of the refrigerator behind the door. When the rollers are adjusted properly, the level will be flat from left to right. Adjust the legs so the refrigerator rests evenly."
        },
        {
          "headline":"Measure the refrigerator’s slope.",
          "description":"Next, place the level against the bottom of the refrigerator. The refrigerator should slope to the back. Adjust the rollers so the front end is .25 inches (6.35 mm) higher than the back end. Adjust the rollers as necessary."
        },
        {
          "headline":"Replace the grille.",
          "description":"Push the grille back onto the bottom of the refrigerator. Replace any clips or screws."
        }
      ]
    }
  ],
  "text":" Adjusting Leveling Legs Remove the grille over the legs. At the very bottom of the refrigerator, you may see a covering over the legs. Many times, this grille can be removed by pulling with your hands. Some grilles will be attached by clips or screws you’ll have to undo first. Consult your owner’s manual for advice when you’re unsure of how to remove the grille. Examine the legs. Check the legs first for screws or bolts that you’ll need to adjust. While some legs can be rotated freely, some require a wrench or a screwdriver. Refrigerators made by GE, for example, require a flat blade screwdriver. Rotate the legs. Look along the top and bottoms of the legs. You’ll either see a slot near the top or a screw or bolt near the bottom. Use a flat-head screwdriver on the slots and an adjustable wrench or pliers on the bolt. Turn clockwise to raise the refrigerator. Turn counterclockwise to lower the refrigerator. Try to get the refrigerator level from left to right. Legs without fasteners, such as those on Whirlpool refrigerators, can be turned to the right to lower the refrigerator and to the left to raise it. If you cannot reach the legs to adjust them, you’ll need someone to lean the refrigerator to the back. Be very careful and don’t tilt it back too far. Measure the refrigerator’s tilt with a level. Place the level on the top of the refrigerator behind the door. The level will be flat if the refrigerator is even from left to right. Adjust the legs to get the refrigerator even from left to right. Measure the refrigerator’s slope. Place the level against the bottom of the refrigerator. It should slope slightly to the back. Make sure the front is .25 inches (6.35 mm) higher than the back. Make adjustments to the front legs as necessary. Replace the grille. Push the grille back onto the bottom of the refrigerator. Replace any clips or screws. Adjusting Rollers Remove the grille over the legs. Find the grille at the bottom of the refrigerator. Look for screws that need to be undone. Unscrew it or pull the grille off with your hands. Consult your owner’s manual for advice when you’re unsure on how to remove the grille. Adjust the screws. Each roller will have a screw on it. You will need pliers or a wrench for a ⅜ inch (9.5 mm) screw. Turn the screw clockwise to raise the legs. Turn the screw counterclockwise to lower them. Measure the refrigerator’s tilt with a level. Place the level on the very top of the refrigerator behind the door. When the rollers are adjusted properly, the level will be flat from left to right. Adjust the legs so the refrigerator rests evenly. Measure the refrigerator’s slope. Next, place the level against the bottom of the refrigerator. The refrigerator should slope to the back. Adjust the rollers so the front end is .25 inches (6.35 mm) higher than the back end. Adjust the rollers as necessary. Replace the grille. Push the grille back onto the bottom of the refrigerator. Replace any clips or screws.",
  "tyn_model":[
    "refrigerator",
    "level",
    "wrench",
    "pliers",
    "screwdriver",
    "flat blade screwdriver",
    "screw",
    "flat-head screwdriver",
    "adjustable wrench",
    "roller",
    "⅜ inch"
  ],
  "tyn_section":[

  ]
}