{
  "title":"How to Eat Heartsease",
  "url":"https://www.wikihow.com/Eat-Heartsease",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Adding Fresh Petals to Meals",
      "steps":[
        {
          "headline":"Pick the flowers.",
          "description":"Heartsease flowers are best harvested in the spring. Pick the entire aerial portion of the flower (i.e. all parts of the flower that are above ground and exposed to the air). Gently remove the petals one by one."
        },
        {
          "headline":"Chill the petals in cold water.",
          "description":"Fill a medium-sized bowl with cold water. Scatter the petals into the bowl. Let them chill for 5-10 minutes until they swell up slightly. Remove the petals from the bowl and place them on a paper towel for several minutes to dry, then use them immediately."
        },
        {
          "headline":"Garnish your meals with petals.",
          "description":"Use petals to garnish salads, soups, vegetables, or other dishes. Use the petals as soon as possible, as they will deteriorate quickly. If you do not use heartsease petals within a week after harvesting them, freeze them for future use."
        },
        {
          "headline":"Eat heartsease sparingly.",
          "description":"While heartsease petals are non-toxic and have numerous medicinal properties, they should be consumed in modest quantities. Eating large quantities of the flower, especially if you are consuming it for the first time, may cause digestive upset. Introduce heartsease as a small garnish on other foods, then work up to eating more of it."
        }
      ]
    },
    {
      "name":"Making Candied Heartsease Petals",
      "steps":[
        {
          "headline":"Set up the tools and ingredients.",
          "description":"Spread fresh heartsease petals out onto a piece of parchment paper. In separate bowls, add egg whites and caster sugar (i.e. super fine sugar). Place a small, clean, soft bristled painting brush, small spoon, and tweezers nearby."
        },
        {
          "headline":"Coat the petals in egg white.",
          "description":"Dip the brush into the egg whites and coat the tops of each flower. Make sure to coat the entire surface, as any uncovered portions may rot. Using the small spoon, sprinkle the petals with the sugar."
        },
        {
          "headline":"Repeat the process for the underside of the petals.",
          "description":"Using the tweezers, flip each petal over gently. Repeat the process, brushing egg yolk over the back of each petal. Sprinkle with sugar."
        },
        {
          "headline":"Dry the petals.",
          "description":"Leave the heartsease petals on the parchment paper to dry. Alternatively, place them on a baking rack to dry (gently, using the tweezers). Leave the petals for two to three hours to dry. Store crystallized petals in an airtight jar or container for up to a year."
        }
      ]
    },
    {
      "name":"Cooking Heartsease Petal Soup",
      "steps":[
        {
          "headline":"Add two tablespoons of butter to a medium-sized pot.",
          "description":"Melt the butter over medium heat. Once melted, add 4 cups of fresh heartsease petals, one small onion (chopped), and one or two cloves of garlic."
        },
        {
          "headline":"Cover and cook the ingredients.",
          "description":"Place a cover on the pot and cook the ingredients. Stir the mixture every minute or two. Once the onions are soft, lower the heat."
        },
        {
          "headline":"Add stock and seasonings.",
          "description":"Add one and a half cups of vegetable stock to the pot. Stir the mixture until it is blended and the stock is heated. Add salt and pepper as desired."
        },
        {
          "headline":"Blend and garnish the soup.",
          "description":"If you want a pureed soup, blend the soup with an immersion blender or counter top blender. Pour it into bowls to serve. Sprinkle with decorative heartsease petals. If you do not wish to blend the soup, serve it as is."
        }
      ]
    },
    {
      "name":"Preparing Heartsease Honey",
      "steps":[
        {
          "headline":"Collect heartsease petals.",
          "description":"When the flowers open, harvest the heartsease. Gently remove the petals. Measure out two cups of them."
        },
        {
          "headline":"Blend together the ingredients.",
          "description":"In a blender, mix the heartsease petals and one cup of raw honey. Cut a lemon in half and squeeze the juice from both parts into the blender. Blend the ingredients together until the honey is smooth."
        },
        {
          "headline":"Store the honey.",
          "description":"Transfer the honey into a jar using a spatula. Seal the jar tightly. To keep the honey for as long as possible, store it in the  freezer and thaw it out for future use."
        }
      ]
    }
  ],
  "text":" Adding Fresh Petals to Meals Pick the flowers. Heartsease flowers are best harvested in the spring. Pick the entire aerial portion of the flower (i.e. all parts of the flower that are above ground and exposed to the air). Gently remove the petals one by one. Chill the petals in cold water. Fill a medium-sized bowl with cold water. Scatter the petals into the bowl. Let them chill for 5-10 minutes until they swell up slightly. Remove the petals from the bowl and place them on a paper towel for several minutes to dry, then use them immediately. Garnish your meals with petals. Use petals to garnish salads, soups, vegetables, or other dishes. Use the petals as soon as possible, as they will deteriorate quickly. If you do not use heartsease petals within a week after harvesting them, freeze them for future use. Eat heartsease sparingly. While heartsease petals are non-toxic and have numerous medicinal properties, they should be consumed in modest quantities. Eating large quantities of the flower, especially if you are consuming it for the first time, may cause digestive upset. Introduce heartsease as a small garnish on other foods, then work up to eating more of it. Making Candied Heartsease Petals Set up the tools and ingredients. Spread fresh heartsease petals out onto a piece of parchment paper. In separate bowls, add egg whites and caster sugar (i.e. super fine sugar). Place a small, clean, soft bristled painting brush, small spoon, and tweezers nearby. Coat the petals in egg white. Dip the brush into the egg whites and coat the tops of each flower. Make sure to coat the entire surface, as any uncovered portions may rot. Using the small spoon, sprinkle the petals with the sugar. Repeat the process for the underside of the petals. Using the tweezers, flip each petal over gently. Repeat the process, brushing egg yolk over the back of each petal. Sprinkle with sugar. Dry the petals. Leave the heartsease petals on the parchment paper to dry. Alternatively, place them on a baking rack to dry (gently, using the tweezers). Leave the petals for two to three hours to dry. Store crystallized petals in an airtight jar or container for up to a year. Cooking Heartsease Petal Soup Add two tablespoons of butter to a medium-sized pot. Melt the butter over medium heat. Once melted, add 4 cups of fresh heartsease petals, one small onion (chopped), and one or two cloves of garlic. Cover and cook the ingredients. Place a cover on the pot and cook the ingredients. Stir the mixture every minute or two. Once the onions are soft, lower the heat. Add stock and seasonings. Add one and a half cups of vegetable stock to the pot. Stir the mixture until it is blended and the stock is heated. Add salt and pepper as desired. Blend and garnish the soup. If you want a pureed soup, blend the soup with an immersion blender or counter top blender. Pour it into bowls to serve. Sprinkle with decorative heartsease petals. If you do not wish to blend the soup, serve it as is. Preparing Heartsease Honey Collect heartsease petals. When the flowers open, harvest the heartsease. Gently remove the petals. Measure out two cups of them. Blend together the ingredients. In a blender, mix the heartsease petals and one cup of raw honey. Cut a lemon in half and squeeze the juice from both parts into the blender. Blend the ingredients together until the honey is smooth. Store the honey. Transfer the honey into a jar using a spatula. Seal the jar tightly. To keep the honey for as long as possible, store it in the  freezer and thaw it out for future use.",
  "tyn_model":[
    "honey",
    "heartsease petals",
    "sugar",
    "cold water",
    "bowl",
    "heartsease",
    "parchment paper",
    "small spoon",
    "tweezers",
    "butter",
    "pot",
    "stock",
    "blender",
    "petals",
    "candied heartsease petals",
    "egg whites",
    "caster sugar",
    "painting brush",
    "egg white",
    "airtight jar",
    "cooking heartsease petal soup",
    "medium-sized pot",
    "onion",
    "garlic",
    "onions",
    "seasonings",
    "vegetable stock",
    "salt",
    "pepper",
    "immersion blender",
    "counter top blender",
    "heartsease honey",
    "lemon",
    "jar",
    "spatula",
    "freezer"
  ],
  "tyn_section":[

  ]
}