{
  "title":"How to Make a Taco Casserole",
  "url":"https://www.wikihow.com/Make-a-Taco-Casserole",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Taco Dishes"
  ],
  "methods":[
    {
      "name":"Making a Basic Taco Casserole",
      "steps":[
        {
          "headline":"Preheat your oven to 375°F (191°C).",
          "description":"Crush enough tortilla chips to fill 2 cups (126 grams) and place them in the bottom of an 8-inch (20.32-centimeter), lightly greased casserole dish. How many chips you end up using depends on how big they are. For example, you'll need more tortilla strips than the regular, triangular type. You can grease the casserole dish with cooking spray, oil, or butter."
        },
        {
          "headline":"Brown the ground beef, then drain the excess fat away.",
          "description":"Lightly oil a 12-inch (30.48-centimeter) skillet, and let it get hot over medium-high heat. Add the beef, and cook it until it is lightly browned. Drain any excess fat."
        },
        {
          "headline":"Add the taco seasoning and continue to cook the beef.",
          "description":"Mix the taco seasoning into the beef, then let it cook for about 5 to 7 minutes. It is ready when the beef is completely cooked through."
        },
        {
          "headline":"Heat the beans in a saucepan over medium heat.",
          "description":"Since the beans are already cooked, you simply need to heat them long enough until they are hot. This should only take about 5 minutes. Save time by doing this while the beef is cooking."
        },
        {
          "headline":"Stir the salsa and half of the cheese into the beans.",
          "description":"Keep stirring the beans, salsa, and cheese until everything is evenly combined. Save the rest of the cheese for later."
        },
        {
          "headline":"Layer the chips, beans, beef, and cheese into the dish.",
          "description":"If you have not already, crush the tortilla chips, and spread them across the bottom of the casserole dish. Spread the beans on top, then the beef. Finish off with the rest of the cheese."
        },
        {
          "headline":"Garnish the casserole with green onions and black olives.",
          "description":"If you don't like those two things, you can leave them out as well. You can also try other toppings, such as diced onions or bell peppers instead."
        },
        {
          "headline":"Bake the casserole for 20 to 30 minutes.",
          "description":"It is ready when the cheese melts and the mixture inside is bubbly. You do not need to cover the casserole while it is baking."
        },
        {
          "headline":"Top the casserole with chopped tomatoes before serving it.",
          "description":"You can also add some chopped up lettuce or crushed tortilla chips. Let the casserole cool for about 1 to 2 minutes before digging in."
        }
      ]
    },
    {
      "name":"Making a Vegetarian Taco Casserole",
      "steps":[
        {
          "headline":"Preheat your oven to 400°F (205°C).",
          "description":"Grease a 9 by 13-inch (22.86 by 33.02-centimeter) casserole dish using cooking spray, oil, or butter. Set the dish aside when you are done."
        },
        {
          "headline":"Roast the peppers and the onion in a skillet over high heat.",
          "description":"Heat some oil in a large skillet over high heat. Add the peppers and onion and half of the chili and cumin. Stir to combine with a wooden spoon, then cook until the peppers and onion turn golden-brown. Transfer them to a bowl. Use enough oil to coat the vegetables, but not so much that it pools. About 1 to 2 tablespoons (15 to 30 milliliters) will be enough. A mild-tasting oil, such as canola or vegetable, will work the best. You can also use a more flavorful one, however, such as avocado or coconut."
        },
        {
          "headline":"Roast the corn in the same skillet.",
          "description":"Add another 1 to 2 tablespoons (15 to 30 milliliters) of oil to the skillet and let it get hot. Add the corn and the rest of the chili and cumin. Stir the corn, then cook it until it turns a golden-brown color. Scrape the corn into the bowl with the peppers and onion."
        },
        {
          "headline":"Season the vegetables.",
          "description":"Add about 1 teaspoon of salt to the peppers, onions, and corn. Toss them together to coat, then set the bowl aside."
        },
        {
          "headline":"Spread some of the sauce across the bottom of the dish.",
          "description":"Pour about a third of the enchilada sauce into the bottom of your prepared casserole dish. Use a wooden spoon or a rubber spatula to spread it around; it doesn't have to be perfect. Save the rest of the sauce for the rest of the casserole."
        },
        {
          "headline":"Begin layering the casserole.",
          "description":"Spread half of the tortilla strips across the bottom of the casserole dish. Spread all of the beans on top in an even layer, then add half of the roasted vegetables, sauce, and cheese. Save the rest of the veggies, sauce, and cheese for the next layer. If the beans are difficult to spread, you can mix some water into them. You need just enough to thin them out. About 1 to 2 tablespoons (15 to 30 milliliters) will be plenty."
        },
        {
          "headline":"Repeat your layers.",
          "description":"Gently lay the rest of the tortilla strips on top of the cheese layer. Add the rest of the roasted veggies, sauce, and cheese on top. Make sure that you spread the ingredients evenly in each layer."
        },
        {
          "headline":"Cover the casserole with foil, then back it for 15 to 20 minutes.",
          "description":"It's ready when the cheese melts and the sauce starts to bubble."
        },
        {
          "headline":"Garnish the casserole before serving it.",
          "description":"Just about anything that you'd put on a taco, burrito, or nacho bowl will work here. Cilantro, guacamole, or sour cream are all delicious options."
        }
      ]
    },
    {
      "name":"Making a Taco Casserole with Pasta",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (177°C).",
          "description":"Grease the inside of a 7 by 11-inch (17.78 by 27.94 -centimeter) casserole dish with cooking spray, oil, or butter, then set it aside."
        },
        {
          "headline":"Cook the pasta according to the directions on the package.",
          "description":"Use a shape that is able to hold lots of sauce, such as bow ties, shells, or elbows. Don't use spaghetti noodles. Most types of pasta will be ready in about 8 minutes."
        },
        {
          "headline":"Brown the beef and onion over medium heat.",
          "description":"Heat a little oil in a large skillet over medium heat. Once the oil gets hot, add the beef and onion. Cook them until the beef is no longer pink inside, stirring occasionally. Drain the excess fat away. Save time by cooking the beef and onion at the same time as the pasta."
        },
        {
          "headline":"Add the cheese, salsa, tomatoes, and taco seasoning to the beef.",
          "description":"Stir everything together with a wooden spoon to combine. Be sure to scrape the bottom of the skillet often to ensure that everything mixes in evenly."
        },
        {
          "headline":"Stir in the pasta.",
          "description":"By now, the pasta should be finished cooking. If you have not yet already, drain the pasta. Shake it to get rid of any excess water, then stir it into the beef mixture."
        },
        {
          "headline":"Spread the mixture across the bottom of your prepared baking dish.",
          "description":"Use a rubber spatula or a wooden spoon to help the mixture get into the corners of the baking dish. Cover the dish with aluminum foil."
        },
        {
          "headline":"Bake the casserole.",
          "description":"After 20 minutes, take it out of the oven, uncover it, and sprinkle the crushed tortilla chips on top. Cover the casserole back up, and bake it for 10 minutes more. It's ready when it's heated through."
        },
        {
          "headline":"Serve the casserole.",
          "description":"You can serve it as is, or you can garnish it further with a sprinkle of cilantro. Anything that you'd put in a taco or on a plate of nachos is a good bet. Sour cream, cilantro, or sliced black olives would work especially well here."
        }
      ]
    }
  ],
  "text":" Making a Basic Taco Casserole Preheat your oven to 375°F (191°C). Crush enough tortilla chips to fill 2 cups (126 grams) and place them in the bottom of an 8-inch (20.32-centimeter), lightly greased casserole dish. How many chips you end up using depends on how big they are. For example, you'll need more tortilla strips than the regular, triangular type. You can grease the casserole dish with cooking spray, oil, or butter. Brown the ground beef, then drain the excess fat away. Lightly oil a 12-inch (30.48-centimeter) skillet, and let it get hot over medium-high heat. Add the beef, and cook it until it is lightly browned. Drain any excess fat. Add the taco seasoning and continue to cook the beef. Mix the taco seasoning into the beef, then let it cook for about 5 to 7 minutes. It is ready when the beef is completely cooked through. Heat the beans in a saucepan over medium heat. Since the beans are already cooked, you simply need to heat them long enough until they are hot. This should only take about 5 minutes. Save time by doing this while the beef is cooking. Stir the salsa and half of the cheese into the beans. Keep stirring the beans, salsa, and cheese until everything is evenly combined. Save the rest of the cheese for later. Layer the chips, beans, beef, and cheese into the dish. If you have not already, crush the tortilla chips, and spread them across the bottom of the casserole dish. Spread the beans on top, then the beef. Finish off with the rest of the cheese. Garnish the casserole with green onions and black olives. If you don't like those two things, you can leave them out as well. You can also try other toppings, such as diced onions or bell peppers instead. Bake the casserole for 20 to 30 minutes. It is ready when the cheese melts and the mixture inside is bubbly. You do not need to cover the casserole while it is baking. Top the casserole with chopped tomatoes before serving it. You can also add some chopped up lettuce or crushed tortilla chips. Let the casserole cool for about 1 to 2 minutes before digging in. Making a Vegetarian Taco Casserole Preheat your oven to 400°F (205°C). Grease a 9 by 13-inch (22.86 by 33.02-centimeter) casserole dish using cooking spray, oil, or butter. Set the dish aside when you are done. Roast the peppers and the onion in a skillet over high heat. Heat some oil in a large skillet over high heat. Add the peppers and onion and half of the chili and cumin. Stir to combine with a wooden spoon, then cook until the peppers and onion turn golden-brown. Transfer them to a bowl. Use enough oil to coat the vegetables, but not so much that it pools. About 1 to 2 tablespoons (15 to 30 milliliters) will be enough. A mild-tasting oil, such as canola or vegetable, will work the best. You can also use a more flavorful one, however, such as avocado or coconut. Roast the corn in the same skillet. Add another 1 to 2 tablespoons (15 to 30 milliliters) of oil to the skillet and let it get hot. Add the corn and the rest of the chili and cumin. Stir the corn, then cook it until it turns a golden-brown color. Scrape the corn into the bowl with the peppers and onion. Season the vegetables. Add about 1 teaspoon of salt to the peppers, onions, and corn. Toss them together to coat, then set the bowl aside. Spread some of the sauce across the bottom of the dish. Pour about a third of the enchilada sauce into the bottom of your prepared casserole dish. Use a wooden spoon or a rubber spatula to spread it around; it doesn't have to be perfect. Save the rest of the sauce for the rest of the casserole. Begin layering the casserole. Spread half of the tortilla strips across the bottom of the casserole dish. Spread all of the beans on top in an even layer, then add half of the roasted vegetables, sauce, and cheese. Save the rest of the veggies, sauce, and cheese for the next layer. If the beans are difficult to spread, you can mix some water into them. You need just enough to thin them out. About 1 to 2 tablespoons (15 to 30 milliliters) will be plenty. Repeat your layers. Gently lay the rest of the tortilla strips on top of the cheese layer. Add the rest of the roasted veggies, sauce, and cheese on top. Make sure that you spread the ingredients evenly in each layer. Cover the casserole with foil, then back it for 15 to 20 minutes. It's ready when the cheese melts and the sauce starts to bubble. Garnish the casserole before serving it. Just about anything that you'd put on a taco, burrito, or nacho bowl will work here. Cilantro, guacamole, or sour cream are all delicious options. Making a Taco Casserole with Pasta Preheat your oven to 350°F (177°C). Grease the inside of a 7 by 11-inch (17.78 by 27.94 -centimeter) casserole dish with cooking spray, oil, or butter, then set it aside. Cook the pasta according to the directions on the package. Use a shape that is able to hold lots of sauce, such as bow ties, shells, or elbows. Don't use spaghetti noodles. Most types of pasta will be ready in about 8 minutes. Brown the beef and onion over medium heat. Heat a little oil in a large skillet over medium heat. Once the oil gets hot, add the beef and onion. Cook them until the beef is no longer pink inside, stirring occasionally. Drain the excess fat away. Save time by cooking the beef and onion at the same time as the pasta. Add the cheese, salsa, tomatoes, and taco seasoning to the beef. Stir everything together with a wooden spoon to combine. Be sure to scrape the bottom of the skillet often to ensure that everything mixes in evenly. Stir in the pasta. By now, the pasta should be finished cooking. If you have not yet already, drain the pasta. Shake it to get rid of any excess water, then stir it into the beef mixture. Spread the mixture across the bottom of your prepared baking dish. Use a rubber spatula or a wooden spoon to help the mixture get into the corners of the baking dish. Cover the dish with aluminum foil. Bake the casserole. After 20 minutes, take it out of the oven, uncover it, and sprinkle the crushed tortilla chips on top. Cover the casserole back up, and bake it for 10 minutes more. It's ready when it's heated through. Serve the casserole. You can serve it as is, or you can garnish it further with a sprinkle of cilantro. Anything that you'd put in a taco or on a plate of nachos is a good bet. Sour cream, cilantro, or sliced black olives would work especially well here.",
  "tyn_model":[
    "oil",
    "beef",
    "cheese",
    "casserole dish",
    "skillet",
    "beans",
    "peppers",
    "corn",
    "oven",
    "tortilla chips",
    "wooden spoon",
    "cooking spray",
    "butter",
    "taco seasoning",
    "onion",
    "bowl",
    "pasta",
    "salsa",
    "black olives",
    "tomatoes",
    "large skillet",
    "chili",
    "cumin",
    "water",
    "sour cream",
    "baking dish",
    "cilantro",
    "tortilla strips",
    "ground beef",
    "saucepan",
    "green onions",
    "diced onions",
    "bell peppers",
    "canola",
    "vegetables",
    "salt",
    "onions",
    "enchilada sauce",
    "veggies",
    "sauce",
    "roasted veggies",
    "foil",
    "guacamole",
    "spaghetti noodles",
    "rubber spatula",
    "aluminum foil"
  ],
  "tyn_section":[

  ]
}