{
  "title":"How to Clean a Quilt",
  "url":"https://www.wikihow.com/Clean-a-Quilt",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Quilting",
    "Quilt Care"
  ],
  "methods":[
    {
      "name":"Washing a Quilt",
      "steps":[
        {
          "headline":"Inspect the quilt.",
          "description":"Look for a care tag with guidelines for washing and drying. If there is one, follow the instructions provided. Check the quilt for embellishments, appliques, and loose seams or lace. See if there are any highly saturated or contrasting colors, hand dying, or batiks. Quilts with embellishments shouldn’t be washed in a washing machine. Loose seams should be repaired before washing the quilt. Quilts with vivid colors may bleed. Test the fabric with white cotton fabric dipped in hot water. Rub the quilt’s highly saturated area and see if any color comes off. If so, use a color catcher product in the washing machine."
        },
        {
          "headline":"Select an appropriate detergent.",
          "description":"Choose a liquid-based detergent that is colorless and unscented, without any fabric softener, brighteners, or bleach. You can purchase special laundry soap specifically for quilts, if desired. Alternately, use baby shampoo instead of laundry detergent. For example, castile soap is safe to use on quilts."
        },
        {
          "headline":"Use cold water and a short, gentle cycle.",
          "description":"Alternately, if your quilt is delicate or not cotton-based, you can hand wash it in a large tub. Let the detergent completely dissolve, then stir the quilt gently in the water. Never use hot water to wash a handmade quilt. Don’t use the normal wash and spin cycles of your washing machine. If your quilt is yellowed or has an odor such as smoke, soak it overnight first in cold water. You may want to wash the quilt in cold water a second time, without any detergent, to ensure that no detergent residue remains on the fabric."
        },
        {
          "headline":"Add vinegar to the wash, if desired.",
          "description":"Pour half a cup (125 mL) of distilled white vinegar into your wash cycle. This will help keep the colors of your quilt bright."
        }
      ]
    },
    {
      "name":"Drying a Quilt",
      "steps":[
        {
          "headline":"Transfer the wet quilt carefully to its drying location.",
          "description":"Support the weight of the wet quilt as you transport it. Hold it like a baby, and don’t pull on any one section of the fabric. If the weight isn’t properly supported, threads in the quilt may pop."
        },
        {
          "headline":"Tumble dry on low with clothing, if desired.",
          "description":"This works for new, well-made, quality fabric quilts. You can dry the quilt completely. Alternately, dry it partially and then lay it flat on a rack or outside to dry. Don’t iron your quilt, or put it in direct sunlight."
        },
        {
          "headline":"Air out the quilt outdoors.",
          "description":"You can air out your quilt outside to dry it, if it’s dusty, or if it has an odor. Find an area in the shade, since direct sunlight can fade fabric. Hang it on a balcony or clothesline, or spread it out on the ground. If you spread it on the ground, place a bedsheet underneath it and another on top of it. Weigh the corners down. You can also air dry a quilt on a balcony by laying down a mattress pad and spreading the quilt out on top of it. If birds are a concern, spread another mattress pad on top. Turn the quilt over when the top is nearly dry."
        },
        {
          "headline":"Air-dry the quilt indoors.",
          "description":"If the weather isn’t appropriate for outdoor drying, line dry the quilt by placing it flat on a rack. Alternately, place a few mattress pads on a bed (at least one of them should be waterproof). Set up a fan to blow horizontally towards the quilt for about a day."
        }
      ]
    },
    {
      "name":"Maintaining a Clean Quilt",
      "steps":[
        {
          "headline":"Wash your quilt only when necessary.",
          "description":"Washing your quilt only when it’s soiled will extend its life. Wash your quilt once per year, even if you use it daily. In between washings, air it outside on a drying rack. If your quilt is a decorative accent that is hardly used, opt for airing it out a few times a year instead of cleaning it. You may need to wash the quilt more often than annually if it’s used by children, pets, or if someone in the home has allergies."
        },
        {
          "headline":"Freshen the scent of your quilt without washing it.",
          "description":"Try placing the quilt in a sealed bag with a bar of soap for a day or two. Alternately, you can try using a fabric freshener product; just make sure to spot test a small, inconspicuous area first for color-fastness."
        },
        {
          "headline":"Spot clean your quilt, as needed.",
          "description":"You can treat stains by gently dabbing them with white vinegar or a quilt soap, diluted with distilled water. Make sure to blot and not rub the stain. Put a white cloth below the quilt, then flush the area with cold water. Don’t use any soap or detergent that contains bleach. If the markings are lines from the quilting process, you can brush off white lines or dab them with a damp cloth. Gray lines are usually pencil and you can remove them gently with a gum eraser."
        },
        {
          "headline":"Use a lint roller or vacuum, as needed.",
          "description":"Rub a lint roller across the whole front and back of the quilt. This will remove lint, pet hair, thread tails and loose threads. If your quilt isn’t very delicate, you can vacuum it on the lowest setting, using a brush attachment covered with pantyhose."
        },
        {
          "headline":"Store your quilt in a fabric bag in a dark, dry location.",
          "description":"If your quilt is not in use, place it in a cotton or muslin bag. Make sure the quilt is clean before storing it. Remove and refold it monthly. Air out your quilt when you take it out of storage, outside or in a drier (on the low, tumble setting). For example, try storing your quilt in a cotton pillowcase."
        }
      ]
    }
  ],
  "text":" Washing a Quilt Inspect the quilt. Look for a care tag with guidelines for washing and drying. If there is one, follow the instructions provided. Check the quilt for embellishments, appliques, and loose seams or lace. See if there are any highly saturated or contrasting colors, hand dying, or batiks. Quilts with embellishments shouldn’t be washed in a washing machine. Loose seams should be repaired before washing the quilt. Quilts with vivid colors may bleed. Test the fabric with white cotton fabric dipped in hot water. Rub the quilt’s highly saturated area and see if any color comes off. If so, use a color catcher product in the washing machine. Select an appropriate detergent. Choose a liquid-based detergent that is colorless and unscented, without any fabric softener, brighteners, or bleach. You can purchase special laundry soap specifically for quilts, if desired. Alternately, use baby shampoo instead of laundry detergent. For example, castile soap is safe to use on quilts. Use cold water and a short, gentle cycle. Alternately, if your quilt is delicate or not cotton-based, you can hand wash it in a large tub. Let the detergent completely dissolve, then stir the quilt gently in the water. Never use hot water to wash a handmade quilt. Don’t use the normal wash and spin cycles of your washing machine. If your quilt is yellowed or has an odor such as smoke, soak it overnight first in cold water. You may want to wash the quilt in cold water a second time, without any detergent, to ensure that no detergent residue remains on the fabric. Add vinegar to the wash, if desired. Pour half a cup (125 mL) of distilled white vinegar into your wash cycle. This will help keep the colors of your quilt bright. Drying a Quilt Transfer the wet quilt carefully to its drying location. Support the weight of the wet quilt as you transport it. Hold it like a baby, and don’t pull on any one section of the fabric. If the weight isn’t properly supported, threads in the quilt may pop. Tumble dry on low with clothing, if desired. This works for new, well-made, quality fabric quilts. You can dry the quilt completely. Alternately, dry it partially and then lay it flat on a rack or outside to dry. Don’t iron your quilt, or put it in direct sunlight. Air out the quilt outdoors. You can air out your quilt outside to dry it, if it’s dusty, or if it has an odor. Find an area in the shade, since direct sunlight can fade fabric. Hang it on a balcony or clothesline, or spread it out on the ground. If you spread it on the ground, place a bedsheet underneath it and another on top of it. Weigh the corners down. You can also air dry a quilt on a balcony by laying down a mattress pad and spreading the quilt out on top of it. If birds are a concern, spread another mattress pad on top. Turn the quilt over when the top is nearly dry. Air-dry the quilt indoors. If the weather isn’t appropriate for outdoor drying, line dry the quilt by placing it flat on a rack. Alternately, place a few mattress pads on a bed (at least one of them should be waterproof). Set up a fan to blow horizontally towards the quilt for about a day. Maintaining a Clean Quilt Wash your quilt only when necessary. Washing your quilt only when it’s soiled will extend its life. Wash your quilt once per year, even if you use it daily. In between washings, air it outside on a drying rack. If your quilt is a decorative accent that is hardly used, opt for airing it out a few times a year instead of cleaning it. You may need to wash the quilt more often than annually if it’s used by children, pets, or if someone in the home has allergies. Freshen the scent of your quilt without washing it. Try placing the quilt in a sealed bag with a bar of soap for a day or two. Alternately, you can try using a fabric freshener product; just make sure to spot test a small, inconspicuous area first for color-fastness. Spot clean your quilt, as needed. You can treat stains by gently dabbing them with white vinegar or a quilt soap, diluted with distilled water. Make sure to blot and not rub the stain. Put a white cloth below the quilt, then flush the area with cold water. Don’t use any soap or detergent that contains bleach. If the markings are lines from the quilting process, you can brush off white lines or dab them with a damp cloth. Gray lines are usually pencil and you can remove them gently with a gum eraser. Use a lint roller or vacuum, as needed. Rub a lint roller across the whole front and back of the quilt. This will remove lint, pet hair, thread tails and loose threads. If your quilt isn’t very delicate, you can vacuum it on the lowest setting, using a brush attachment covered with pantyhose. Store your quilt in a fabric bag in a dark, dry location. If your quilt is not in use, place it in a cotton or muslin bag. Make sure the quilt is clean before storing it. Remove and refold it monthly. Air out your quilt when you take it out of storage, outside or in a drier (on the low, tumble setting). For example, try storing your quilt in a cotton pillowcase.",
  "tyn_model":[
    "quilt",
    "water",
    "fabric",
    "mattress pad",
    "lint roller",
    "vacuum",
    "color catcher product",
    "fabric softener,",
    "laundry soap",
    "baby shampoo",
    "laundry detergent",
    "castile soap",
    "vinegar",
    "distilled white vinegar",
    "clothing",
    "iron",
    "bedsheet",
    "air dry",
    "mattress pads",
    "fan",
    "soap",
    "fabric freshener product",
    "white vinegar",
    "quilt soap",
    "distilled water",
    "gum eraser",
    "fabric bag"
  ],
  "tyn_section":[

  ]
}