{
  "title":"How to Harvest Heartsease",
  "url":"https://www.wikihow.com/Harvest-Heartsease",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Harvest and Storage"
  ],
  "methods":[
    {
      "name":"Growing Heartsease",
      "steps":[
        {
          "headline":"Prepare the flower beds in spring.",
          "description":"At least a month before you intend to sow your seeds, choose a spot in your garden where you will plant the heartsease seeds and turn over the soil. Using a sturdy metal shovel, invert the first layer of earth, digging about ten inches into the soil. Cover the area with a plastic sheet or fleece (available in gardening or hardware stores) to keep the soil warm and prevent weeds."
        },
        {
          "headline":"Uncover and rake the earth.",
          "description":"When you are ready to sow the heartsease seeds, remove the covering. Rake the soil to even out the surface and remove weeds and debris. Water the soil so that its moist before you sow the seeds. For best results, sow heartsease seeds in the springtime around April."
        },
        {
          "headline":"Create a drill in the soil.",
          "description":"A drill is a shallow depression on the top of the soil in which to sow seeds. Use a long, solid object (e.g. a cane) to gently push down into the first inch or so of the earth. Do not go too deep, as heartsease seeds will have trouble growing if they're too far below the surface."
        },
        {
          "headline":"Sow the seeds.",
          "description":"Purchase heartsease seeds from a gardening store, or online. Scatter the seeds every 2-3 inches along the drill. Gently rake earth back into the drill, covering the seeds. Make and sow as many drills as you desire, based on your available space."
        },
        {
          "headline":"Cover and let germinate.",
          "description":"The germination process usually takes about 16 days. After the 16 days, check up on the growth progress of the heartsease seedlings. Water the seeds during dry spells."
        },
        {
          "headline":"Replant the seedlings.",
          "description":"After approximately 16 days, or when seedlings have grown to several inches tall, replant them in your flower bed. Using a spade, gently dig up the seedlings. Replant them approximately 6 inches apart, preferably in an area in sun or partial shade. You may also purchase heartsease seedlings from local nurseries or gardening stores to plant. Heartsease seedlings can also be planted in decorative planters or pots. You can also start your heartsease indoors in pots and then move them outside once they're around 4 inches (10 cm) tall."
        }
      ]
    },
    {
      "name":"Collecting and Maintaining Heartsease",
      "steps":[
        {
          "headline":"Pick the flowers.",
          "description":"Pick heartsease when they first open. Harvest the flowers in a \"haircut\" style, using scissors to remove flowers from the stems of the plant. Choose a sunny day during the late morning or afternoon, as heartsease flowers will droop their heads for protection in wet weather or at night. The plant typically flowers from May to September and will continue flowering after you pick the blooms."
        },
        {
          "headline":"Prepare fresh petals right away to eat them.",
          "description":"If you wish to add fresh heartsease petals to soups, salads, or other meals, pick the flowers right before using them. Gently remove the petals and place them in a bowl of cold water for 10-15 minutes to plump up. Use them right away as a colorful garnish."
        },
        {
          "headline":"Dry heartsease.",
          "description":"Pick heartsease flowers and remove the leaves from the stems. Bundle flowers together and hang them upside down in a warm, dry, dark area (e.g. an attic). Leave them there for two to three weeks to dry completely. To make tea, which is often brewed and consumed for heartsease’s medicinal properties (e.g. as an expectorant or diuretic), dry heartsease flowers for immediate use or storage."
        },
        {
          "headline":"Deadhead the crop.",
          "description":"Deadheading your flower crop will delay the plants from setting seed and cause them to re-flower, encouraging new blooms. Using gardening sheers or strong scissors, cut away stems of flowers that have already bloomed and grown to their fullest. Cut flowers just above the leaf nodes. Harvesting flowers will achieve the same effect, but deadheading is a wise move if do not intend to harvest all of the heartsease that you grow."
        }
      ]
    }
  ],
  "text":" Growing Heartsease Prepare the flower beds in spring. At least a month before you intend to sow your seeds, choose a spot in your garden where you will plant the heartsease seeds and turn over the soil. Using a sturdy metal shovel, invert the first layer of earth, digging about ten inches into the soil. Cover the area with a plastic sheet or fleece (available in gardening or hardware stores) to keep the soil warm and prevent weeds. Uncover and rake the earth. When you are ready to sow the heartsease seeds, remove the covering. Rake the soil to even out the surface and remove weeds and debris. Water the soil so that its moist before you sow the seeds. For best results, sow heartsease seeds in the springtime around April. Create a drill in the soil. A drill is a shallow depression on the top of the soil in which to sow seeds. Use a long, solid object (e.g. a cane) to gently push down into the first inch or so of the earth. Do not go too deep, as heartsease seeds will have trouble growing if they're too far below the surface. Sow the seeds. Purchase heartsease seeds from a gardening store, or online. Scatter the seeds every 2-3 inches along the drill. Gently rake earth back into the drill, covering the seeds. Make and sow as many drills as you desire, based on your available space. Cover and let germinate. The germination process usually takes about 16 days. After the 16 days, check up on the growth progress of the heartsease seedlings. Water the seeds during dry spells. Replant the seedlings. After approximately 16 days, or when seedlings have grown to several inches tall, replant them in your flower bed. Using a spade, gently dig up the seedlings. Replant them approximately 6 inches apart, preferably in an area in sun or partial shade. You may also purchase heartsease seedlings from local nurseries or gardening stores to plant. Heartsease seedlings can also be planted in decorative planters or pots. You can also start your heartsease indoors in pots and then move them outside once they're around 4 inches (10 cm) tall. Collecting and Maintaining Heartsease Pick the flowers. Pick heartsease when they first open. Harvest the flowers in a \"haircut\" style, using scissors to remove flowers from the stems of the plant. Choose a sunny day during the late morning or afternoon, as heartsease flowers will droop their heads for protection in wet weather or at night. The plant typically flowers from May to September and will continue flowering after you pick the blooms. Prepare fresh petals right away to eat them. If you wish to add fresh heartsease petals to soups, salads, or other meals, pick the flowers right before using them. Gently remove the petals and place them in a bowl of cold water for 10-15 minutes to plump up. Use them right away as a colorful garnish. Dry heartsease. Pick heartsease flowers and remove the leaves from the stems. Bundle flowers together and hang them upside down in a warm, dry, dark area (e.g. an attic). Leave them there for two to three weeks to dry completely. To make tea, which is often brewed and consumed for heartsease’s medicinal properties (e.g. as an expectorant or diuretic), dry heartsease flowers for immediate use or storage. Deadhead the crop. Deadheading your flower crop will delay the plants from setting seed and cause them to re-flower, encouraging new blooms. Using gardening sheers or strong scissors, cut away stems of flowers that have already bloomed and grown to their fullest. Cut flowers just above the leaf nodes. Harvesting flowers will achieve the same effect, but deadheading is a wise move if do not intend to harvest all of the heartsease that you grow.",
  "tyn_model":[
    "heartsease",
    "drill",
    "water",
    "flowers",
    "heartsease seeds",
    "scissors",
    "shovel",
    "fleece",
    "cane",
    "earth",
    "spade",
    "heartsease seedlings",
    "heartsease petals",
    "bowl",
    "tea",
    "heartsease flowers",
    "gardening sheers"
  ],
  "tyn_section":[

  ]
}