{
  "title":"How to Make Paper Magnolias",
  "url":"https://www.wikihow.com/Make-Paper-Magnolias",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Origami"
  ],
  "parts":[
    {
      "name":"Making the Stamens",
      "steps":[
        {
          "headline":"Cut two strips out of white and yellow crepe paper.",
          "description":"You will need one yellow strip and one white strip. The strips should be about 1 inch (2.54 centimeters) wide. You can also use tissue paper instead."
        },
        {
          "headline":"Cut a fringe into the long edge of both of the narrow strips.",
          "description":"Have the fringe stop about ¼ inch (0.64 centimeters) from the opposite long edge. Try to make the fringe as fine and narrow as you can."
        },
        {
          "headline":"Curl the top edge of the yellow fringe.",
          "description":"You can bend it over the edge of a table, skewer, pen, dowel, straw, etc. Leave the white fringe straight."
        },
        {
          "headline":"Hot glue the yellow fringe to a small Styrofoam ball.",
          "description":"Roll one of the narrow ends of the yellow fringe a few times into a tight tube first, with the curved edge sticking inward. Hot glue it to the top of a 1-inch (2.54-centimeter) Styrofoam ball."
        },
        {
          "headline":"Continue gluing the yellow fringe around the ball.",
          "description":"Move the fringe downward as you wrap it so that it forms an overlapping spiral. Stop when you are about 1/2 to 2/3 of the way down the ball. Cut the rest of the fringe off. Hot glue a little bit at a time so that the glue doesn't set too fast."
        },
        {
          "headline":"Cover the rest of the ball with the white fringe.",
          "description":"Start wrapping and gluing the white fringe where you ended the yellow one. Wrap the fringe in a downward, overlapping spiral. Stop at the bottom of the ball, then cut off the excess."
        },
        {
          "headline":"Stick the ball onto a wire florist's stem.",
          "description":"Make sure that the white side is facing down, and the yellow side is facing up. Press it just far enough down so that it is secure, but not so far that the wire sticks out. If you can't find a wire stem, you can paint a wooden skewer green, and use that instead. Don't use a pipe cleaner; it's too fuzzy. Don't use the wire that comes on a spool. It's too thin and flimsy."
        }
      ]
    },
    {
      "name":"Shaping the Petals",
      "steps":[
        {
          "headline":"Cut 6 to 9 teardrop-shaped petals out of white crepe paper.",
          "description":"Make the petals about 7 inches (17.78 centimeters) tall and 2½ inches (6.35 centimeters) wide. Make sure that the grain goes with the length of the petal, not against it, otherwise, your petal won't stretch right. Your petals should look like they have vertical stripes running through them. If you can't find crepe paper, use regular paper or tissue paper instead. You can make the petals all the same size, or make them three different sizes. Make sure that each set has three petals."
        },
        {
          "headline":"Shape the petals.",
          "description":"Gently stretch the middle part of the white petals. You want a bowl or cup shape. Leave the top and bottom ends of the petals intact. If you are using regular paper or tissue paper, you won't be able to stretch it. Instead, curl the top of the petal inward with a pen or brush handle."
        },
        {
          "headline":"Tape three petals to the stem, just below the ball.",
          "description":"Arrange three petals, cupped side facing in, around the wire stem, just below the fringed ball. Wrap florist's tape around the tabbed, bottom part of the petals to secure them to the wire. If you are using different-sized petals, start with the smallest set first."
        },
        {
          "headline":"Add 1 to 2 more layers of petals.",
          "description":"Off-set each layer of petals, so that the second row of petals is between the gaps on the first row. The third row should be even with the first row. When you look down at the flower, there are no gaps showing. Each layer should have three petals. If you are using different sizes for the petals, save the largest ones for the last row."
        }
      ]
    },
    {
      "name":"Adding the Leaves and Stem Covering",
      "steps":[
        {
          "headline":"Cut 3 almond shapes out of green crepe paper for the leaves.",
          "description":"As with the flowers, the grain needs to go down the length of your leaves. You want the leaves to look like they have vertical stripes. If you can't find green crepe paper, you can use regular paper or tissue paper instead."
        },
        {
          "headline":"Shape the leaves.",
          "description":"Gently stretch the leaves at the center, just as you did with the petals. Stretch them just far enough to get a pod shape, with the top and bottom ends pinched. If you used regular or tissue paper, you don't be able to stretch them. Instead, curl both of the side edges inward with a pen or brush handle. Next, fold them in half lengthwise to make a crease."
        },
        {
          "headline":"Tape two leaves just below petals.",
          "description":"Place two leaves against the stem, just below the petals. Wrap some florist's tape around the bottom point of each leaf to secure it to the stem. Don't tear off the tape yet. The leaves can be right next to each other, or straight across from each other."
        },
        {
          "headline":"Cover the stem with a few inches/centimeters of florist's tape.",
          "description":"Overlap the tape with each turn so that the wire does not show. Stop when you are about 3 inches (7.62 centimeters) down. Tear off the tape."
        },
        {
          "headline":"Add the final leaf.",
          "description":"Hold the bottom of the leaf against the stem. Secure it to the stem with florist's tape. Don't tear off the tape just yet."
        },
        {
          "headline":"Finish covering the stem with florist's tape.",
          "description":"Wrap the florist's tape around the stem until you reach the bottom. Overlap the tape with each wrap as you go so that no wire is showing."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Stamens Cut two strips out of white and yellow crepe paper. You will need one yellow strip and one white strip. The strips should be about 1 inch (2.54 centimeters) wide. You can also use tissue paper instead. Cut a fringe into the long edge of both of the narrow strips. Have the fringe stop about ¼ inch (0.64 centimeters) from the opposite long edge. Try to make the fringe as fine and narrow as you can. Curl the top edge of the yellow fringe. You can bend it over the edge of a table, skewer, pen, dowel, straw, etc. Leave the white fringe straight. Hot glue the yellow fringe to a small Styrofoam ball. Roll one of the narrow ends of the yellow fringe a few times into a tight tube first, with the curved edge sticking inward. Hot glue it to the top of a 1-inch (2.54-centimeter) Styrofoam ball. Continue gluing the yellow fringe around the ball. Move the fringe downward as you wrap it so that it forms an overlapping spiral. Stop when you are about 1/2 to 2/3 of the way down the ball. Cut the rest of the fringe off. Hot glue a little bit at a time so that the glue doesn't set too fast. Cover the rest of the ball with the white fringe. Start wrapping and gluing the white fringe where you ended the yellow one. Wrap the fringe in a downward, overlapping spiral. Stop at the bottom of the ball, then cut off the excess. Stick the ball onto a wire florist's stem. Make sure that the white side is facing down, and the yellow side is facing up. Press it just far enough down so that it is secure, but not so far that the wire sticks out. If you can't find a wire stem, you can paint a wooden skewer green, and use that instead. Don't use a pipe cleaner; it's too fuzzy. Don't use the wire that comes on a spool. It's too thin and flimsy. Shaping the Petals Cut 6 to 9 teardrop-shaped petals out of white crepe paper. Make the petals about 7 inches (17.78 centimeters) tall and 2½ inches (6.35 centimeters) wide. Make sure that the grain goes with the length of the petal, not against it, otherwise, your petal won't stretch right. Your petals should look like they have vertical stripes running through them. If you can't find crepe paper, use regular paper or tissue paper instead. You can make the petals all the same size, or make them three different sizes. Make sure that each set has three petals. Shape the petals. Gently stretch the middle part of the white petals. You want a bowl or cup shape. Leave the top and bottom ends of the petals intact. If you are using regular paper or tissue paper, you won't be able to stretch it. Instead, curl the top of the petal inward with a pen or brush handle. Tape three petals to the stem, just below the ball. Arrange three petals, cupped side facing in, around the wire stem, just below the fringed ball. Wrap florist's tape around the tabbed, bottom part of the petals to secure them to the wire. If you are using different-sized petals, start with the smallest set first. Add 1 to 2 more layers of petals. Off-set each layer of petals, so that the second row of petals is between the gaps on the first row. The third row should be even with the first row. When you look down at the flower, there are no gaps showing. Each layer should have three petals. If you are using different sizes for the petals, save the largest ones for the last row. Adding the Leaves and Stem Covering Cut 3 almond shapes out of green crepe paper for the leaves. As with the flowers, the grain needs to go down the length of your leaves. You want the leaves to look like they have vertical stripes. If you can't find green crepe paper, you can use regular paper or tissue paper instead. Shape the leaves. Gently stretch the leaves at the center, just as you did with the petals. Stretch them just far enough to get a pod shape, with the top and bottom ends pinched. If you used regular or tissue paper, you don't be able to stretch them. Instead, curl both of the side edges inward with a pen or brush handle. Next, fold them in half lengthwise to make a crease. Tape two leaves just below petals. Place two leaves against the stem, just below the petals. Wrap some florist's tape around the bottom point of each leaf to secure it to the stem. Don't tear off the tape yet. The leaves can be right next to each other, or straight across from each other. Cover the stem with a few inches/centimeters of florist's tape. Overlap the tape with each turn so that the wire does not show. Stop when you are about 3 inches (7.62 centimeters) down. Tear off the tape. Add the final leaf. Hold the bottom of the leaf against the stem. Secure it to the stem with florist's tape. Don't tear off the tape just yet. Finish covering the stem with florist's tape. Wrap the florist's tape around the stem until you reach the bottom. Overlap the tape with each wrap as you go so that no wire is showing. Finished. ",
  "tyn_model":[
    "florist's tape",
    "tissue paper",
    "crepe paper",
    "regular paper",
    "glue",
    "styrofoam ball",
    "hot glue",
    "wire",
    "pen or brush",
    "skewer",
    "pen",
    "dowel",
    "straw",
    "wire florist",
    "wire stem",
    "wooden skewer",
    "pipe cleaner",
    "white crepe paper",
    "green crepe paper",
    "regular or tissue paper",
    "tape"
  ],
  "tyn_section":[

  ]
}