{
  "title":"How to Hang Removable Wallpaper",
  "url":"https://www.wikihow.com/Hang-Removable-Wallpaper",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Interior Walls",
    "Wallpaper"
  ],
  "parts":[
    {
      "name":"Measuring and Aligning the Wallpaper",
      "steps":[
        {
          "headline":"Determine how many rolls of wallpaper you need.",
          "description":"Start by measuring the wall (or walls) you want to redesign, then divide that number by the width of a single panel of wallpaper (the distance from one side to the other when you hold it vertically). This will give you an accurate approximation of how many rolls will be required to completely cover the wall. Measure at least twice. That way, you can be absolutely certain that the measurements you’re using are correct. It’s a good idea to buy roughly 15% more paper than you think you’ll need to leave a little wiggle room for mistakes and last minute patch ups. Most temporary wallpaper panels will be between 36-48 inches tall and 18−24 inches (−61 cm) wide."
        },
        {
          "headline":"Wipe the wall lightly with a damp cloth.",
          "description":"Before you begin hanging, go over the wall from top to bottom to prepare it. This will clear away any dirt or greasy residue and help the adhesive backing of the wallpaper stick. Give the wall time to dry completely before you begin hanging the wallpaper. A preliminary cleaning is recommended any time you’re hanging wallpaper, but will be especially important in rooms where there may be heavier buildup on the walls, such as the kitchen or bathroom. Don’t forget to remove any light switches, plate covers and other protruding objects from the wall prior to diving into the project."
        },
        {
          "headline":"Pick a place to start.",
          "description":"Depending on the size of the room, you can either work directly from one end of the wall to the other or start from the center and move outwards. To create a more seamless finish, the section where you start should be the focal point of the room. Starting from the corner will keep you from having to cut the paper to fit bare spots later on, while starting from the center highlights the smoothest, cleanest section of the pattern right in the middle of the wall."
        },
        {
          "headline":"Mark the corners of the wall at right angles.",
          "description":"Use a level to find the wall’s precise vertical and horizontal planes and trace along the outer edge with a pencil. Try to make this mark as close to the molding as you can—it will serve as a consistent reference point all the way across the wall. This is the best way to ensure that the wallpaper will go on straight, since there may be slight imperfections in the molding. Be careful not to draw the line so dark that it’s visible through the wallpaper."
        }
      ]
    },
    {
      "name":"Applying the Wallpaper",
      "steps":[
        {
          "headline":"Stick the edge of the first panel to the upper section of the wall.",
          "description":"Peel the first 2-3 inches of wallpaper away from the paper backing. Line up the free edge with the pencil mark you just made and run your thumb along the edge to secure it. From here, you can begin smoothing on the rest of the panel without worrying about it being crooked. Double check that the edge of the paper is flush with the molding and totally straight before sticking it down."
        },
        {
          "headline":"Press the wallpaper into place.",
          "description":"Pull the backing away from the roll as you go, working your way down the wall a little at a time. After every few feet, slide your hand over the panel, applying enough pressure to make sure the adhesive holds. Repeat the process with the remaining panels until the wall is completely covered. It can help to have a second person tack on the wallpaper as you peel away the backing, or vice versa. Smooth the panel from the center outwards. This will push air bubbles to the edges, making them easier to erase."
        },
        {
          "headline":"Trim leftover panels to fill in bare spots.",
          "description":"Measure the exposed area, then cut a leftover panel to the corresponding width using a pair of scissors or X-acto knife. Do your best to line up the edges of the individual panels. Cut the wallpaper where the pattern repeats to make the edges easier to blend. Wallpapers with small, busy patterns will generally make misalignments less obvious. If you’re hanging the wallpaper on a particularly tall section of wall, it may be necessary to trim the paper to fit at the bottom as well."
        },
        {
          "headline":"Smooth the wallpaper down.",
          "description":"Once the wall is covered, use a dry squeegee or craft brayer to make sure each panel is lying perfectly flat. Be sure to work out any visible air bubbles or creases. By the time you’re finished, your wall will have been transformed with minimal time and effort. Deal with large or stubborn air pockets by deflating them with a safety pin, then smooth out the surrounding area. Use an X-acto knife to cut openings for light switches and wall outlets."
        }
      ]
    },
    {
      "name":"Removing the Wallpaper",
      "steps":[
        {
          "headline":"Loosen the upper corners of each panel.",
          "description":"Use a fingernail to pry away the edges of the wallpaper where they meet the molding. Keep peeling slowly until you have enough to grab onto. As when you were applying the wallpaper, focus on one panel at a time. You may need to use a putty knife, scraper or similar tool to get the edges started."
        },
        {
          "headline":"Peel off the wallpaper.",
          "description":"Pull the paper down and away from the wall in one smooth motion. Because of the low-strength adhesive used to secure removable wallpaper, you should be able to easily strip each section in a single piece. Crumple up the used panels and throw them away. It’s that easy! Peel the paper from the top, rather than the bottom or sides, so that you’re working with gravity. Should any tearing occur, rip off the piece and proceed carefully to prevent further damage."
        },
        {
          "headline":"Wipe the wall clean.",
          "description":"Take a damp washcloth to the wall everywhere that the wallpaper touched. Let the surface dry completely before making any other modifications. It will then be clean and ready to adorn with the next pattern that catches your eye. When removed correctly, temporary wallpapers shouldn’t leave behind stains, glue marks or any other kind of residue. Even so, it won't hurt to give the wall a quick once-over. If the panels are still in good condition, consider finding uses for them in other rooms of your home."
        }
      ]
    }
  ],
  "text":" Measuring and Aligning the Wallpaper Determine how many rolls of wallpaper you need. Start by measuring the wall (or walls) you want to redesign, then divide that number by the width of a single panel of wallpaper (the distance from one side to the other when you hold it vertically). This will give you an accurate approximation of how many rolls will be required to completely cover the wall. Measure at least twice. That way, you can be absolutely certain that the measurements you’re using are correct. It’s a good idea to buy roughly 15% more paper than you think you’ll need to leave a little wiggle room for mistakes and last minute patch ups. Most temporary wallpaper panels will be between 36-48 inches tall and 18−24 inches (−61 cm) wide. Wipe the wall lightly with a damp cloth. Before you begin hanging, go over the wall from top to bottom to prepare it. This will clear away any dirt or greasy residue and help the adhesive backing of the wallpaper stick. Give the wall time to dry completely before you begin hanging the wallpaper. A preliminary cleaning is recommended any time you’re hanging wallpaper, but will be especially important in rooms where there may be heavier buildup on the walls, such as the kitchen or bathroom. Don’t forget to remove any light switches, plate covers and other protruding objects from the wall prior to diving into the project. Pick a place to start. Depending on the size of the room, you can either work directly from one end of the wall to the other or start from the center and move outwards. To create a more seamless finish, the section where you start should be the focal point of the room. Starting from the corner will keep you from having to cut the paper to fit bare spots later on, while starting from the center highlights the smoothest, cleanest section of the pattern right in the middle of the wall. Mark the corners of the wall at right angles. Use a level to find the wall’s precise vertical and horizontal planes and trace along the outer edge with a pencil. Try to make this mark as close to the molding as you can—it will serve as a consistent reference point all the way across the wall. This is the best way to ensure that the wallpaper will go on straight, since there may be slight imperfections in the molding. Be careful not to draw the line so dark that it’s visible through the wallpaper. Applying the Wallpaper Stick the edge of the first panel to the upper section of the wall. Peel the first 2-3 inches of wallpaper away from the paper backing. Line up the free edge with the pencil mark you just made and run your thumb along the edge to secure it. From here, you can begin smoothing on the rest of the panel without worrying about it being crooked. Double check that the edge of the paper is flush with the molding and totally straight before sticking it down. Press the wallpaper into place. Pull the backing away from the roll as you go, working your way down the wall a little at a time. After every few feet, slide your hand over the panel, applying enough pressure to make sure the adhesive holds. Repeat the process with the remaining panels until the wall is completely covered. It can help to have a second person tack on the wallpaper as you peel away the backing, or vice versa. Smooth the panel from the center outwards. This will push air bubbles to the edges, making them easier to erase. Trim leftover panels to fill in bare spots. Measure the exposed area, then cut a leftover panel to the corresponding width using a pair of scissors or X-acto knife. Do your best to line up the edges of the individual panels. Cut the wallpaper where the pattern repeats to make the edges easier to blend. Wallpapers with small, busy patterns will generally make misalignments less obvious. If you’re hanging the wallpaper on a particularly tall section of wall, it may be necessary to trim the paper to fit at the bottom as well. Smooth the wallpaper down. Once the wall is covered, use a dry squeegee or craft brayer to make sure each panel is lying perfectly flat. Be sure to work out any visible air bubbles or creases. By the time you’re finished, your wall will have been transformed with minimal time and effort. Deal with large or stubborn air pockets by deflating them with a safety pin, then smooth out the surrounding area. Use an X-acto knife to cut openings for light switches and wall outlets. Removing the Wallpaper Loosen the upper corners of each panel. Use a fingernail to pry away the edges of the wallpaper where they meet the molding. Keep peeling slowly until you have enough to grab onto. As when you were applying the wallpaper, focus on one panel at a time. You may need to use a putty knife, scraper or similar tool to get the edges started. Peel off the wallpaper. Pull the paper down and away from the wall in one smooth motion. Because of the low-strength adhesive used to secure removable wallpaper, you should be able to easily strip each section in a single piece. Crumple up the used panels and throw them away. It’s that easy! Peel the paper from the top, rather than the bottom or sides, so that you’re working with gravity. Should any tearing occur, rip off the piece and proceed carefully to prevent further damage. Wipe the wall clean. Take a damp washcloth to the wall everywhere that the wallpaper touched. Let the surface dry completely before making any other modifications. It will then be clean and ready to adorn with the next pattern that catches your eye. When removed correctly, temporary wallpapers shouldn’t leave behind stains, glue marks or any other kind of residue. Even so, it won't hurt to give the wall a quick once-over. If the panels are still in good condition, consider finding uses for them in other rooms of your home.",
  "tyn_model":[
    "wallpaper",
    "paper",
    "x-acto knife",
    "wallpapers",
    "level",
    "pencil",
    "—it",
    "adhesive",
    "backing",
    "scissors",
    "dry squeegee",
    "craft brayer",
    "putty knife",
    "washcloth"
  ],
  "tyn_section":[

  ]
}