{
  "title":"How to Roast Rhubarb",
  "url":"https://www.wikihow.com/Roast-Rhubarb",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Cruciferous Vegetables"
  ],
  "methods":[
    {
      "name":"Making Simple Roasted Rhubarb",
      "steps":[
        {
          "headline":"Slice the rhubarb.",
          "description":"Wash 1 pound (453 g) of fresh rhubarb. Use a sharp knife to cut off and discard the ends. Slice the rhubarb into 1/2-inch (12-mm) pieces. Place the rhubarb in a large roasting dish. For a pretty presentation, you can slice the rhubarb diagonally."
        },
        {
          "headline":"Stir in sugar.",
          "description":"Measure 1 cup (200 g) of granulated sugar and pour it over the rhubarb in the pan. Use a large spoon to stir the mixture until the rhubarb pieces are completely coated in the sugar."
        },
        {
          "headline":"Chill the sugared rhubarb for at least 2 hours.",
          "description":"Place the pan of rhubarb into the refrigerator and chill it for at least 2 hours. You should notice the rhubarb releasing liquid. This will turn syrupy as the sugar dissolves. If you'd like to prepare the rhubarb ahead of time, you could chill it overnight."
        },
        {
          "headline":"Preheat the oven and stir the rhubarb.",
          "description":"Turn the oven on to 300 degrees F (150 C). Remove the chilled rhubarb from the refrigerator and stir the mixture. Tear off a sheet of parchment paper and moisten it with a little water. Place the paper over the baking pan. The parchment will keep the rhubarb from drying out as it roasts."
        },
        {
          "headline":"Roast the rhubarb for 30 minutes.",
          "description":"Put the covered pan of rhubarb in the preheated oven. Roast the rhubarb for about 30 minutes. The rhubarb will be completely tender once it's finished roasting. Set the pan on a wire rack and let the rhubarb cool. You can store leftover roasted rhubarb in an airtight container in the refrigerator for up to one week."
        }
      ]
    },
    {
      "name":"Making Orange and Vanilla Roasted Rhubarb",
      "steps":[
        {
          "headline":"Preheat the oven and slice the rhubarb.",
          "description":"Turn the oven on to 350 degrees F (180 C). Wash 1 pound (453 g) of rhubarb and trim off the ends. Slice the rhubarb into pieces that are 2 to 4 inches (5 to 10 cm) long. Spread the rhubarb in a large baking dish. The rhubarb should be in a single layer in the dish, so they bake evenly."
        },
        {
          "headline":"Cover the rhubarb with sugar, orange zest, and vanilla.",
          "description":"Evenly pour 1/2 cup (100 g) of sugar over the rhubarb in the dish. Zest 1 orange and scatter the zest over the sugared rhubarb. Lay 2 vanilla beans over the rhubarb. If you don't have vanilla beans, you can stir 1 to 2 tablespoons of vanilla extract into the roasted rhubarb after it's cooked."
        },
        {
          "headline":"Cover the pan and roast the rhubarb.",
          "description":"Cover the pan with aluminum foil or a lid and put the rhubarb in the preheated oven. Roast the rhubarb for 20 minutes. The rhubarb should be completely soft, but still hold their shape once they've finished cooking."
        },
        {
          "headline":"Remove the vanilla beans and cool the roasted rhubarb.",
          "description":"Remove the pan from the oven and set it on a wire rack. Remove the foil or lid and carefully take out the vanilla beans. Serve the roasted rhubarb while it's warm or chill it before serving. You can store leftover roasted rhubarb in an airtight container in the refrigerator for up to one week."
        }
      ]
    },
    {
      "name":"Making Honey Roasted Rhubarb",
      "steps":[
        {
          "headline":"Preheat the oven and slice the rhubarb.",
          "description":"Turn the oven on to 300 degrees F (150 C). Wash 2 1/4 pounds (1 kg)  of rhubarb and trim off the ends. Slice the rhubarb into pieces that are 2 to 4 inches (5 to 10 cm) long. Spread the rhubarb in a large baking dish. The rhubarb should be in a single layer in the dish, so they bake evenly."
        },
        {
          "headline":"Add orange and honey.",
          "description":"Zest 1 orange and sprinkle it over the rhubarb. Juice the orange and pour the juice in the pan with the rhubarb. Drizzle 4 tablespoons (85 g) of honey over the rhubarb. Use a spoon to stir the rhubarb mixture until it's combined. Try to use an organic orange in this recipe, since you'll be using the zest."
        },
        {
          "headline":"Cover the pan and roast the rhubarb.",
          "description":"Lay a sheet of aluminum foil loosely over the pan. Put the rhubarb in the preheated oven and bake it for 30 minutes. Remove the pan and stir it gently. Return the pan to the oven and roast the rhubarb for 15 to 30 more minutes. Remove the pan to a wire rack to cool. Avoid stirring the rhubarb more than once, since the rhubarb could lose its shape. You can store leftover roasted rhubarb in its syrup in an airtight container in the refrigerator for up to one week."
        }
      ]
    }
  ],
  "text":" Making Simple Roasted Rhubarb Slice the rhubarb. Wash 1 pound (453 g) of fresh rhubarb. Use a sharp knife to cut off and discard the ends. Slice the rhubarb into 1/2-inch (12-mm) pieces. Place the rhubarb in a large roasting dish. For a pretty presentation, you can slice the rhubarb diagonally. Stir in sugar. Measure 1 cup (200 g) of granulated sugar and pour it over the rhubarb in the pan. Use a large spoon to stir the mixture until the rhubarb pieces are completely coated in the sugar. Chill the sugared rhubarb for at least 2 hours. Place the pan of rhubarb into the refrigerator and chill it for at least 2 hours. You should notice the rhubarb releasing liquid. This will turn syrupy as the sugar dissolves. If you'd like to prepare the rhubarb ahead of time, you could chill it overnight. Preheat the oven and stir the rhubarb. Turn the oven on to 300 degrees F (150 C). Remove the chilled rhubarb from the refrigerator and stir the mixture. Tear off a sheet of parchment paper and moisten it with a little water. Place the paper over the baking pan. The parchment will keep the rhubarb from drying out as it roasts. Roast the rhubarb for 30 minutes. Put the covered pan of rhubarb in the preheated oven. Roast the rhubarb for about 30 minutes. The rhubarb will be completely tender once it's finished roasting. Set the pan on a wire rack and let the rhubarb cool. You can store leftover roasted rhubarb in an airtight container in the refrigerator for up to one week. Making Orange and Vanilla Roasted Rhubarb Preheat the oven and slice the rhubarb. Turn the oven on to 350 degrees F (180 C). Wash 1 pound (453 g) of rhubarb and trim off the ends. Slice the rhubarb into pieces that are 2 to 4 inches (5 to 10 cm) long. Spread the rhubarb in a large baking dish. The rhubarb should be in a single layer in the dish, so they bake evenly. Cover the rhubarb with sugar, orange zest, and vanilla. Evenly pour 1/2 cup (100 g) of sugar over the rhubarb in the dish. Zest 1 orange and scatter the zest over the sugared rhubarb. Lay 2 vanilla beans over the rhubarb. If you don't have vanilla beans, you can stir 1 to 2 tablespoons of vanilla extract into the roasted rhubarb after it's cooked. Cover the pan and roast the rhubarb. Cover the pan with aluminum foil or a lid and put the rhubarb in the preheated oven. Roast the rhubarb for 20 minutes. The rhubarb should be completely soft, but still hold their shape once they've finished cooking. Remove the vanilla beans and cool the roasted rhubarb. Remove the pan from the oven and set it on a wire rack. Remove the foil or lid and carefully take out the vanilla beans. Serve the roasted rhubarb while it's warm or chill it before serving. You can store leftover roasted rhubarb in an airtight container in the refrigerator for up to one week. Making Honey Roasted Rhubarb Preheat the oven and slice the rhubarb. Turn the oven on to 300 degrees F (150 C). Wash 2 1/4 pounds (1 kg)  of rhubarb and trim off the ends. Slice the rhubarb into pieces that are 2 to 4 inches (5 to 10 cm) long. Spread the rhubarb in a large baking dish. The rhubarb should be in a single layer in the dish, so they bake evenly. Add orange and honey. Zest 1 orange and sprinkle it over the rhubarb. Juice the orange and pour the juice in the pan with the rhubarb. Drizzle 4 tablespoons (85 g) of honey over the rhubarb. Use a spoon to stir the rhubarb mixture until it's combined. Try to use an organic orange in this recipe, since you'll be using the zest. Cover the pan and roast the rhubarb. Lay a sheet of aluminum foil loosely over the pan. Put the rhubarb in the preheated oven and bake it for 30 minutes. Remove the pan and stir it gently. Return the pan to the oven and roast the rhubarb for 15 to 30 more minutes. Remove the pan to a wire rack to cool. Avoid stirring the rhubarb more than once, since the rhubarb could lose its shape. You can store leftover roasted rhubarb in its syrup in an airtight container in the refrigerator for up to one week.",
  "tyn_model":[
    "rhubarb",
    "oven",
    "sugar",
    "refrigerator",
    "orange",
    "vanilla beans",
    "airtight container",
    "large baking dish",
    "aluminum foil",
    "honey",
    "sharp knife",
    "large roasting dish",
    "granulated sugar",
    "large spoon",
    "parchment paper",
    "water",
    "baking pan",
    "parchment",
    "preheated oven",
    "orange and vanilla",
    "orange zest",
    "vanilla",
    "dish",
    "vanilla extract",
    "foil",
    "spoon",
    "wire rack"
  ],
  "tyn_section":[

  ]
}