{
  "title":"How to Clean Oval Makeup Brushes",
  "url":"https://www.wikihow.com/Clean-Oval-Makeup-Brushes",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Doing a Basic Cleaning with Soap",
      "steps":[
        {
          "headline":"Wet your brush with warm water.",
          "description":"Only wet the bristles of the brush. Avoid getting water into the area where the brush handle meets the head. This can loosen the glue that holds the bristles to the brush. Try dipping the bristles in a bowl of warm water to make sure that you don’t soak the handle. Fill your sink with warm water to dip the brush in if you don’t want to use a bowl."
        },
        {
          "headline":"Wash your brush with bar soap.",
          "description":"Very gently swirl the wet surface of your brush against the soap. Use a very mild soap. After washing it, rinse the brush well with clean warm water. Clean the brush a second time if the water doesn’t run clean when you rinse it."
        },
        {
          "headline":"Clean your brush with liquid soap or baby shampoo.",
          "description":"This is best for brushes with synthetic bristles. Put a dab of liquid soap or baby shampoo in the palm of your hand. Swirl the wet brush against your palm. Add a little water if needed to create a good lather. Rinse the bristles of the brush in warm water. Repeat if the water doesn’t run clean when you rinse the brush. Try this with dish soap or Woolite if your brushes are clogged with oil-based makeup. For a deeper clean, put the liquid soap or baby shampoo on a microfiber cloth instead of in your palm and gently swirl the bristles against the cloth."
        }
      ]
    },
    {
      "name":"Cleaning with Household Items",
      "steps":[
        {
          "headline":"Make your own cleanser.",
          "description":"Combine ½ cup (120 mL) of witch hazel with two teaspoons (9.857 mL) of mild castile soap and one cup (240 mL) of distilled water. Shake well. Swirl the brush in this solution, then rinse it completely in warm water."
        },
        {
          "headline":"Clean your brush in vinegar and water.",
          "description":"Combine ¼ cup (60 mL) of white vinegar and ½ cup (120 mL) of water and store it in a clean jar. Pour some of this solution in a shallow bowl and gently swirl the bristles of your brush in the solution. Change the water if it gets very dirty as you’re cleaning. Rinse the clean brush in warm water."
        },
        {
          "headline":"Disinfect them with alcohol.",
          "description":"If your brushes seem especially dirty or stiff, rinse them with 70% isopropyl alcohol. You can wash them with some soap beforehand and use the alcohol instead of water when rinsing them. Allow them to dry completely before using them. Spritz them with antibacterial spray and blot them dry for a very quick approach to cleaning and sanitizing."
        }
      ]
    },
    {
      "name":"Drying Your Brushes",
      "steps":[
        {
          "headline":"Squeeze out extra water.",
          "description":"After rinsing your brushes, take a clean towel or paper towel and gently squeeze the extra water out of your brushes. Don’t wipe your brushes against the towel because this can cause the bristles to loosen and fall out. And never shake out the extra water, which can also loosen the bristles."
        },
        {
          "headline":"Lay it flat.",
          "description":"After squeezing out the extra water, lay your brush over the edge of the table with the bristles facing downward. This will maintain the shape of the brush and prevent extra water from seeping into the head of the brush. Put a towel under the wet brushes. Allow your brushes to dry completely overnight before you use them again. Never let your brushes dry while standing upright -- this can rust any metal parts of the handle and also loosen the glue in the head where the bristles meet the handle."
        },
        {
          "headline":"Reshape your brushes.",
          "description":"Once your brushes are dry, gently fluff them out. Use your fingers to reshape your brushes if needed. You can also get the bristles slightly damp to reshape them."
        },
        {
          "headline":"Steam them into shape.",
          "description":"Hold your brushes in the steam from a garment steamer for a few seconds, then reshape the surface gently with your fingers. Try holding them in the steam from a tea kettle spout if you don’t have a garment steamer. Let the brush cool before you use it."
        }
      ]
    }
  ],
  "text":" Doing a Basic Cleaning with Soap Wet your brush with warm water. Only wet the bristles of the brush. Avoid getting water into the area where the brush handle meets the head. This can loosen the glue that holds the bristles to the brush. Try dipping the bristles in a bowl of warm water to make sure that you don’t soak the handle. Fill your sink with warm water to dip the brush in if you don’t want to use a bowl. Wash your brush with bar soap. Very gently swirl the wet surface of your brush against the soap. Use a very mild soap. After washing it, rinse the brush well with clean warm water. Clean the brush a second time if the water doesn’t run clean when you rinse it. Clean your brush with liquid soap or baby shampoo. This is best for brushes with synthetic bristles. Put a dab of liquid soap or baby shampoo in the palm of your hand. Swirl the wet brush against your palm. Add a little water if needed to create a good lather. Rinse the bristles of the brush in warm water. Repeat if the water doesn’t run clean when you rinse the brush. Try this with dish soap or Woolite if your brushes are clogged with oil-based makeup. For a deeper clean, put the liquid soap or baby shampoo on a microfiber cloth instead of in your palm and gently swirl the bristles against the cloth. Cleaning with Household Items Make your own cleanser. Combine ½ cup (120 mL) of witch hazel with two teaspoons (9.857 mL) of mild castile soap and one cup (240 mL) of distilled water. Shake well. Swirl the brush in this solution, then rinse it completely in warm water. Clean your brush in vinegar and water. Combine ¼ cup (60 mL) of white vinegar and ½ cup (120 mL) of water and store it in a clean jar. Pour some of this solution in a shallow bowl and gently swirl the bristles of your brush in the solution. Change the water if it gets very dirty as you’re cleaning. Rinse the clean brush in warm water. Disinfect them with alcohol. If your brushes seem especially dirty or stiff, rinse them with 70% isopropyl alcohol. You can wash them with some soap beforehand and use the alcohol instead of water when rinsing them. Allow them to dry completely before using them. Spritz them with antibacterial spray and blot them dry for a very quick approach to cleaning and sanitizing. Drying Your Brushes Squeeze out extra water. After rinsing your brushes, take a clean towel or paper towel and gently squeeze the extra water out of your brushes. Don’t wipe your brushes against the towel because this can cause the bristles to loosen and fall out. And never shake out the extra water, which can also loosen the bristles. Lay it flat. After squeezing out the extra water, lay your brush over the edge of the table with the bristles facing downward. This will maintain the shape of the brush and prevent extra water from seeping into the head of the brush. Put a towel under the wet brushes. Allow your brushes to dry completely overnight before you use them again. Never let your brushes dry while standing upright -- this can rust any metal parts of the handle and also loosen the glue in the head where the bristles meet the handle. Reshape your brushes. Once your brushes are dry, gently fluff them out. Use your fingers to reshape your brushes if needed. You can also get the bristles slightly damp to reshape them. Steam them into shape. Hold your brushes in the steam from a garment steamer for a few seconds, then reshape the surface gently with your fingers. Try holding them in the steam from a tea kettle spout if you don’t have a garment steamer. Let the brush cool before you use it.",
  "tyn_model":[
    "water",
    "soap",
    "liquid soap",
    "baby shampoo",
    "alcohol",
    "towel",
    "garment steamer",
    "bowl",
    "bar soap",
    "dish soap",
    "microfiber cloth",
    "witch hazel",
    "mild castile soap",
    "distilled water",
    "vinegar",
    "white vinegar",
    "isopropyl alcohol",
    "antibacterial spray",
    "tea kettle spout",
    "brush"
  ],
  "tyn_section":[

  ]
}