{
  "title":"How to Can Tomato Soup",
  "url":"https://www.wikihow.com/Can-Tomato-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Sauces",
    "Tomato Sauces"
  ],
  "methods":[
    {
      "name":"Making Your Soup",
      "steps":[
        {
          "headline":"Simmer the onions and celery.",
          "description":"Place your onions and celery in a pot. Add just enough water so they will not burn. Bring the onions and celery to a simmer over your stove."
        },
        {
          "headline":"Cook the tomatoes.",
          "description":"Once the onions and celery are simmering, add your tomatoes to the mixture. Let everything simmer until the vegetables are tender to the touch."
        },
        {
          "headline":"Strain the mixture.",
          "description":"Use a strainer or a similar device to remove the water. Strain out the now tender celery, tomatoes, and onions. Then, discard the water."
        },
        {
          "headline":"Add the salt and sugar.",
          "description":"Place your strained mixture back in the pot. Add your salt and sugar. Stir the ingredients together until they're just combined."
        },
        {
          "headline":"Cream the flour and butter.",
          "description":"In a separate bowl, use a spoon to mash the butter and flower together. Keep mashing until all the ingredients are completely mixed together. You should be left with a smooth, even texture."
        },
        {
          "headline":"Add the butter and flour mixture to your soup.",
          "description":"Pour the creamed butter and flour into your soup. Stir everything together using a large mixing spoon. Keep stirring until you have a completely even mixture."
        },
        {
          "headline":"Cook the mixture.",
          "description":"Keep the mixture over the stove. Heat everything together until it's just hot and giving off a small amount of steam. Do not let the mixture come to a boil, as this can make the flour lumpy. Remove the mixture from the stove just before it begins to boil."
        }
      ]
    },
    {
      "name":"Using a Canner",
      "steps":[
        {
          "headline":"Sanitize the jars and lids.",
          "description":"It's important to sanitize the jars and lids before using them to can tomatoes. If have a dishwasher, wash the jars and lids using the sanitize cycle. If you don't have a dishwasher, or if your dishwasher doesn't have a sanitize cycle, wash the jars and lids in hot, soapy water. Then, submerge them in boiling water for five minutes to kill any lingering germs."
        },
        {
          "headline":"Fill your jars with the soup.",
          "description":"Do not fill your jars all the way up with soup. It's important to leave a little headspace. Leave about half an inch (about 1.3 centimeters) of headspace on top of the jar. Then, slide a spatula between the side of jar and the soup. This should remove any air bubbles."
        },
        {
          "headline":"Seal your lids.",
          "description":"Seal each lid completely. Place the lids on and screw them until you you cannot turn the lids. Then, add the rings that go over the lids. Screw them on until you cannot make any more turns."
        },
        {
          "headline":"Place the jars in the canner.",
          "description":"Add enough water to the canner that there is three inches (about 7.5 centimeters) of water on the bottom. Place your jars in the individual compartments of your canner found in the center. Then, screw the canner's lid in place. It is not necessary to weigh down the canner's lid with anything. Simply screw it into place. If your pressure canner has a valve, leave that opened."
        },
        {
          "headline":"Steam the jars.",
          "description":"Turn the canner to the highest heat setting. For 10 minutes, let heat escape from the valve or sides of the canner. Set a timer to make sure the jars do not steam for too long."
        },
        {
          "headline":"Process the jars.",
          "description":"When the water in the canner comes to a boil, set a timer. Let the jars process for 20 to 30 minutes. If your canner comes with a weight to weigh down the lid, put it on during processing and close any valves on your canner."
        },
        {
          "headline":"Remove the jars.",
          "description":"After the jars are done processing, open the canner and use tongs to remove the jars from the canner. Let them cool on a wooden drying rack or towel. Once the jars are cool to the touch, loosen the rings slightly to prevent rust."
        }
      ]
    },
    {
      "name":"Canning Your Soup Without a Canner",
      "steps":[
        {
          "headline":"Boil the lids and cans.",
          "description":"Before you begin canning, sterilize your lids and cans by boiling them. Submerge your cans and lids in a pot of water. Bring the water to a boil. Then, let them sit in the water for three to five minutes. Turn the water off and let the cans sit until you're ready to use them."
        },
        {
          "headline":"Fill your jars with the soup.",
          "description":"Leave about half an inch (about 1.2 centimeters) of headspace on top of the can. Take a small spatula and run it between the soup and the side of each can to remove air bubbles."
        },
        {
          "headline":"Top your cans.",
          "description":"Place your lids on the cans and screw them on tightly. Then, screw on any lid rings. Make sure to keep screwing the lid and rings on until you can no longer move them. It's important to make sure the cans do not break open during the canning process."
        },
        {
          "headline":"Place a cloth towel in a pot of water.",
          "description":"Fill a pot big enough to contain your jars with water. Then, place a cloth towel on the bottom of the pot. The cloth towel will keep your cans from moving around during the canning process."
        },
        {
          "headline":"Submerge your jars in the water.",
          "description":"Place each jar into the pot. Submerge them completely in the water. If necessary, add more water to cover the cans. If your jars are still hot from being submerged in the boiling water earlier, use tongs to move them."
        },
        {
          "headline":"Boil your jars for 85 minutes.",
          "description":"Let the water come to a boil. Once the water comes to a boil, set a timer for 85 minutes. Keep an eye on the pot for the entire boiling process. Leaving the pot alone over the stove is a fire hazard. Check the water level periodically while the jars boil. If the jars are no longer submerged in the water, add more water to the pot."
        },
        {
          "headline":"Cool your jars overnight.",
          "description":"After 85 minutes have passed, turn off the burner and remove your jars from the stove. Use tongs to avoid burning your hands. Place them in a safe area where they will not get bumped or otherwise disrupted. Let them cool overnight. Once the jars are cool, loosen the rings slightly. This prevents rust."
        }
      ]
    }
  ],
  "text":" Making Your Soup Simmer the onions and celery. Place your onions and celery in a pot. Add just enough water so they will not burn. Bring the onions and celery to a simmer over your stove. Cook the tomatoes. Once the onions and celery are simmering, add your tomatoes to the mixture. Let everything simmer until the vegetables are tender to the touch. Strain the mixture. Use a strainer or a similar device to remove the water. Strain out the now tender celery, tomatoes, and onions. Then, discard the water. Add the salt and sugar. Place your strained mixture back in the pot. Add your salt and sugar. Stir the ingredients together until they're just combined. Cream the flour and butter. In a separate bowl, use a spoon to mash the butter and flower together. Keep mashing until all the ingredients are completely mixed together. You should be left with a smooth, even texture. Add the butter and flour mixture to your soup. Pour the creamed butter and flour into your soup. Stir everything together using a large mixing spoon. Keep stirring until you have a completely even mixture. Cook the mixture. Keep the mixture over the stove. Heat everything together until it's just hot and giving off a small amount of steam. Do not let the mixture come to a boil, as this can make the flour lumpy. Remove the mixture from the stove just before it begins to boil. Using a Canner Sanitize the jars and lids. It's important to sanitize the jars and lids before using them to can tomatoes. If have a dishwasher, wash the jars and lids using the sanitize cycle. If you don't have a dishwasher, or if your dishwasher doesn't have a sanitize cycle, wash the jars and lids in hot, soapy water. Then, submerge them in boiling water for five minutes to kill any lingering germs. Fill your jars with the soup. Do not fill your jars all the way up with soup. It's important to leave a little headspace. Leave about half an inch (about 1.3 centimeters) of headspace on top of the jar. Then, slide a spatula between the side of jar and the soup. This should remove any air bubbles. Seal your lids. Seal each lid completely. Place the lids on and screw them until you you cannot turn the lids. Then, add the rings that go over the lids. Screw them on until you cannot make any more turns. Place the jars in the canner. Add enough water to the canner that there is three inches (about 7.5 centimeters) of water on the bottom. Place your jars in the individual compartments of your canner found in the center. Then, screw the canner's lid in place. It is not necessary to weigh down the canner's lid with anything. Simply screw it into place. If your pressure canner has a valve, leave that opened. Steam the jars. Turn the canner to the highest heat setting. For 10 minutes, let heat escape from the valve or sides of the canner. Set a timer to make sure the jars do not steam for too long. Process the jars. When the water in the canner comes to a boil, set a timer. Let the jars process for 20 to 30 minutes. If your canner comes with a weight to weigh down the lid, put it on during processing and close any valves on your canner. Remove the jars. After the jars are done processing, open the canner and use tongs to remove the jars from the canner. Let them cool on a wooden drying rack or towel. Once the jars are cool to the touch, loosen the rings slightly to prevent rust. Canning Your Soup Without a Canner Boil the lids and cans. Before you begin canning, sterilize your lids and cans by boiling them. Submerge your cans and lids in a pot of water. Bring the water to a boil. Then, let them sit in the water for three to five minutes. Turn the water off and let the cans sit until you're ready to use them. Fill your jars with the soup. Leave about half an inch (about 1.2 centimeters) of headspace on top of the can. Take a small spatula and run it between the soup and the side of each can to remove air bubbles. Top your cans. Place your lids on the cans and screw them on tightly. Then, screw on any lid rings. Make sure to keep screwing the lid and rings on until you can no longer move them. It's important to make sure the cans do not break open during the canning process. Place a cloth towel in a pot of water. Fill a pot big enough to contain your jars with water. Then, place a cloth towel on the bottom of the pot. The cloth towel will keep your cans from moving around during the canning process. Submerge your jars in the water. Place each jar into the pot. Submerge them completely in the water. If necessary, add more water to cover the cans. If your jars are still hot from being submerged in the boiling water earlier, use tongs to move them. Boil your jars for 85 minutes. Let the water come to a boil. Once the water comes to a boil, set a timer for 85 minutes. Keep an eye on the pot for the entire boiling process. Leaving the pot alone over the stove is a fire hazard. Check the water level periodically while the jars boil. If the jars are no longer submerged in the water, add more water to the pot. Cool your jars overnight. After 85 minutes have passed, turn off the burner and remove your jars from the stove. Use tongs to avoid burning your hands. Place them in a safe area where they will not get bumped or otherwise disrupted. Let them cool overnight. Once the jars are cool, loosen the rings slightly. This prevents rust.",
  "tyn_model":[
    "water",
    "canner",
    "pot",
    "stove",
    "jars",
    "soup",
    "tomatoes",
    "flour",
    "butter",
    "onions",
    "celery",
    "salt",
    "sugar",
    "spatula",
    "cloth towel",
    "vegetables",
    "strainer",
    "bowl",
    "spoon",
    "flower",
    "mixing spoon",
    "tongs"
  ],
  "tyn_section":[

  ]
}