{
  "title":"How to Pick Garden Pots",
  "url":"https://www.wikihow.com/Pick-Garden-Pots",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "methods":[
    {
      "name":"Comparing Different Pots",
      "steps":[
        {
          "headline":"Decide how much money you want to spend.",
          "description":"Various types of pots will cost different amounts of money. Terracotta pots and plastic pots are typically the most affordable types of pots that you can get. Cast iron, concrete, and glazed ceramic pots are often the most expensive. Determine how much money you have in your budget, and look for pots that you can afford."
        },
        {
          "headline":"Consider purchasing terracotta pots.",
          "description":"Many terracotta pots are ornate and can add to your interior decor. The subtle colors of the material match well with many different plant types. On the downside, the material is also somewhat more fragile than other pots and has to be brought indoors during the winter."
        },
        {
          "headline":"Get glazed ceramic pots to add a splash of color.",
          "description":"If your primary goal is to add to your decor, you should choose a ceramic pot that matches with the scenery. Glazed ceramic pots come in a wide variety of colors and shapes. Select a container that matches the aesthetic of your apartment, garden, or house."
        },
        {
          "headline":"Purchase concrete or cast iron pots for durability.",
          "description":"If you are housing plants that are meant to be permanent outdoor fixtures in your landscaping, concrete and cast iron pots are the best options. These pots will be able to withstand harsh weather and won't degrade or break down quickly."
        },
        {
          "headline":"Get a pot with proper drainage.",
          "description":"Regardless of the type of plant, improper drainage or overwatering can cause water to build on the bottom of the pot which can lead to rot or mold. To avoid this, look for pots that have drainage holes and remember to buy a saucer with the pot at the time of purchase. This will ensure that your plant receives the right amount of drainage."
        },
        {
          "headline":"Check for imperfections when you purchase the pot.",
          "description":"If you are looking for pots in person, make sure that you take a look at the pot to make sure there are no chips, cracks, or imperfections. This will help narrow down your decision when deciding which one to purchase."
        }
      ]
    },
    {
      "name":"Picking the Pot Based on the Plant Type",
      "steps":[
        {
          "headline":"Get a larger pot for bigger plants.",
          "description":"The larger your plant, the bigger the pot that you'll need. Getting a pot that's too big for the plant you are growing is a waste of money while getting a pot that's too small could result in an unhealthy plant.If you are growing eggplant, broccoli, or peppers, you should get 18-inch (45.7 cm) 14 or 15-gallon (53-56.8 L) pots. Some fruits and vegetables, including raspberries, cucumbers, and summer squash, require larger 24-inch (61 cm) 24 or 25-gallon (90.8-94.6 L) pots. Get a very large pot for trees and big shrubs."
        },
        {
          "headline":"Get a smaller pot for smaller fruits and herbs.",
          "description":"Smaller fruits and herbs, including strawberries, chives, and parsley, only need 10-inch (25.4 cm) 2.5 or 3-gallon (9.5-11.4 L) pots in order to thrive. Other vegetables like collards, spinach, and arugula require slightly bigger 14-inch (35.6 cm) 6 or 7-gallon (22.7-26.5 L) pots."
        },
        {
          "headline":"Use a pot that matches the needs of the plant.",
          "description":"Some plants, like succulents or some vegetables and fruits, require better drainage than other plants in order to thrive. Other, larger shrubs and trees require larger pots because their root systems are bigger. Think of what your plant needs in order to survive and choose a pot that will encourage growth. Herbs like rosemary, sage, and thyme thrive in terracotta pots because they do well in dry environment."
        },
        {
          "headline":"Imagine how the plant will look in the pot.",
          "description":"Large shrubs look bad in narrow pots while low-growing plants often look bad in larger or wider pots. Think about how your plant will grow out, and get a pot that matches the size and shape of the plant."
        }
      ]
    },
    {
      "name":"Choosing Pots that Fit Your Garden's Aesthetic",
      "steps":[
        {
          "headline":"Pick a pot that matches the garden's style.",
          "description":"Determine what kind of look you are going for in your garden. If you are going for a more traditional look, you should select a pot with earth tones or natural colors. If you are going for a sleek look, a black glazed ceramic pot might work best. Think of your garden and pick a pot that suits the design there."
        },
        {
          "headline":"Choose a subtle color.",
          "description":"Bright colors can be jarring and bring attention off your plant and onto the pot. Avoid brightly colored pots or neon color pots, unless you want your garden to be eccentric. If you want to add contrast in your garden, go with more muted colors like buttermilk, dark chocolate, or white."
        },
        {
          "headline":"Measure your backyard.",
          "description":"Some larger pots may not even fit in the space that you intend them to, so make sure you measure the area with a yardstick or measuring tape before purchasing your pot. A lot of small pots may make your garden look cluttered if you have a smaller garden. If you are working with a larger sized garden, choose a larger centerpiece to bring attention to it."
        },
        {
          "headline":"Select a textured pot to fill in a small space.",
          "description":"A textured pot can give the illusion of space in a smaller, flatter area. You can also get a pot that has interesting textures to add a splash of personality to your garden. There are cement, ceramic pots, and terracotta pots that are created with different textures. Look for pots that have ornate designs for a more refined or chic garden. Pots with simple textures, like stippling, are also an option."
        }
      ]
    }
  ],
  "text":" Comparing Different Pots Decide how much money you want to spend. Various types of pots will cost different amounts of money. Terracotta pots and plastic pots are typically the most affordable types of pots that you can get. Cast iron, concrete, and glazed ceramic pots are often the most expensive. Determine how much money you have in your budget, and look for pots that you can afford. Consider purchasing terracotta pots. Many terracotta pots are ornate and can add to your interior decor. The subtle colors of the material match well with many different plant types. On the downside, the material is also somewhat more fragile than other pots and has to be brought indoors during the winter. Get glazed ceramic pots to add a splash of color. If your primary goal is to add to your decor, you should choose a ceramic pot that matches with the scenery. Glazed ceramic pots come in a wide variety of colors and shapes. Select a container that matches the aesthetic of your apartment, garden, or house. Purchase concrete or cast iron pots for durability. If you are housing plants that are meant to be permanent outdoor fixtures in your landscaping, concrete and cast iron pots are the best options. These pots will be able to withstand harsh weather and won't degrade or break down quickly. Get a pot with proper drainage. Regardless of the type of plant, improper drainage or overwatering can cause water to build on the bottom of the pot which can lead to rot or mold. To avoid this, look for pots that have drainage holes and remember to buy a saucer with the pot at the time of purchase. This will ensure that your plant receives the right amount of drainage. Check for imperfections when you purchase the pot. If you are looking for pots in person, make sure that you take a look at the pot to make sure there are no chips, cracks, or imperfections. This will help narrow down your decision when deciding which one to purchase. Picking the Pot Based on the Plant Type Get a larger pot for bigger plants. The larger your plant, the bigger the pot that you'll need. Getting a pot that's too big for the plant you are growing is a waste of money while getting a pot that's too small could result in an unhealthy plant.If you are growing eggplant, broccoli, or peppers, you should get 18-inch (45.7 cm) 14 or 15-gallon (53-56.8 L) pots. Some fruits and vegetables, including raspberries, cucumbers, and summer squash, require larger 24-inch (61 cm) 24 or 25-gallon (90.8-94.6 L) pots. Get a very large pot for trees and big shrubs. Get a smaller pot for smaller fruits and herbs. Smaller fruits and herbs, including strawberries, chives, and parsley, only need 10-inch (25.4 cm) 2.5 or 3-gallon (9.5-11.4 L) pots in order to thrive. Other vegetables like collards, spinach, and arugula require slightly bigger 14-inch (35.6 cm) 6 or 7-gallon (22.7-26.5 L) pots. Use a pot that matches the needs of the plant. Some plants, like succulents or some vegetables and fruits, require better drainage than other plants in order to thrive. Other, larger shrubs and trees require larger pots because their root systems are bigger. Think of what your plant needs in order to survive and choose a pot that will encourage growth. Herbs like rosemary, sage, and thyme thrive in terracotta pots because they do well in dry environment. Imagine how the plant will look in the pot. Large shrubs look bad in narrow pots while low-growing plants often look bad in larger or wider pots. Think about how your plant will grow out, and get a pot that matches the size and shape of the plant. Choosing Pots that Fit Your Garden's Aesthetic Pick a pot that matches the garden's style. Determine what kind of look you are going for in your garden. If you are going for a more traditional look, you should select a pot with earth tones or natural colors. If you are going for a sleek look, a black glazed ceramic pot might work best. Think of your garden and pick a pot that suits the design there. Choose a subtle color. Bright colors can be jarring and bring attention off your plant and onto the pot. Avoid brightly colored pots or neon color pots, unless you want your garden to be eccentric. If you want to add contrast in your garden, go with more muted colors like buttermilk, dark chocolate, or white. Measure your backyard. Some larger pots may not even fit in the space that you intend them to, so make sure you measure the area with a yardstick or measuring tape before purchasing your pot. A lot of small pots may make your garden look cluttered if you have a smaller garden. If you are working with a larger sized garden, choose a larger centerpiece to bring attention to it. Select a textured pot to fill in a small space. A textured pot can give the illusion of space in a smaller, flatter area. You can also get a pot that has interesting textures to add a splash of personality to your garden. There are cement, ceramic pots, and terracotta pots that are created with different textures. Look for pots that have ornate designs for a more refined or chic garden. Pots with simple textures, like stippling, are also an option.",
  "tyn_model":[
    "pot",
    "pots",
    "terracotta pots",
    "cast iron, concrete, and glazed ceramic pots",
    "ceramic pot",
    "container",
    "concrete or",
    "cast iron",
    "concrete",
    "water",
    "saucer",
    "broccoli",
    "peppers",
    "cucumbers",
    "summer squash",
    "herbs",
    "strawberries",
    "chives",
    "parsley",
    "vegetables",
    "spinach",
    "arugula",
    "rosemary",
    "sage",
    "thyme",
    "buttermilk",
    "yardstick or",
    "measuring tape",
    "cement"
  ],
  "tyn_section":[

  ]
}