{
  "title":"How to Clean Burners on a Stove",
  "url":"https://www.wikihow.com/Clean-Burners-on-a-Stove",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Doing a Basic Cleaning",
      "steps":[
        {
          "headline":"Remove the burners.",
          "description":"Before cleaning, remove the burners from your gas or electric stove top. Be sure that the stove is off and that the elements are completely cooled down before taking off the burner grates or coils. Place them aside on a counter top to be cleaned. Most burners come off easily, but others may require a gentle twist or squeeze to be removed. If you encounter difficulty, refer to your appliance manual for detailed instructions."
        },
        {
          "headline":"Wipe down the burner coils or grates.",
          "description":"Add a few drops of dish washing liquid to a small bowl of warm water and agitate the mixture to produce soap suds. Dip a clean cloth or rag into the liquid, wring it out, and wipe down each coil to remove stains or debris. Re-wet and wring out the cloth for each burner. With electric burner coils, avoid getting the electrical connection wet and do not submerge them in water. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tSoak the burners in soapy water if they're really dirty. Chris Willatt of Alpine Maids says: \"To clean tough stains off the burners on a stove, take them off and soak them in the sink in soapy water for about 30 minutes. After that, just scrub them off. If you're in a hurry or you're dealing with a lot of grease, you can use a cleaner like Easy-Off, but it's a caustic cleaning product so we avoid using it whenever possible.\""
        },
        {
          "headline":"Rinse and dry the burners.",
          "description":"Wet a clean cloth with plain water and wipe down the burner coils or grates once again. Be sure to remove any soapy residue that may be left behind. Lay the burners on a clean dish towel to dry. For best results, let the burners dry for several hours before putting them back on the stove."
        }
      ]
    },
    {
      "name":"Using Baking Soda on Tough Stains",
      "steps":[
        {
          "headline":"Make a baking soda paste.",
          "description":"If any stubborn stains remain after wiping down the burner coils or grates, use a baking soda scrub to gently remove them. In a small bowl, add 1-2 tablespoons of baking soda. Slowly add drops of water and stir until the mixture reaches a thick paste consistency."
        },
        {
          "headline":"Apply the paste.",
          "description":"Using a soft cloth, sponge, or old, soft-bristled toothbrush, gently apply the baking soda paste to the stains on your burners. For best results, only apply the baking soda paste to burner coils or grates when they are removed from the stove top. Let them sit for 15-20 minutes."
        },
        {
          "headline":"Wipe off and dry the burners.",
          "description":"Using a clean, wet cloth, wipe the baking soda paste off of the burners. Wipe as thoroughly as possible to make sure that none of the mixture is left behind on the burners. Let the coils or grates dry completely before reattaching them to the stove."
        }
      ]
    },
    {
      "name":"Using Ammonia",
      "steps":[
        {
          "headline":"Bag the burners and add ammonia.",
          "description":"Remove the burner coils or grates from your stove top and place them in separate, gallon-size Ziploc bags. Add ¼ cup (2 oz.) of plain ammonia to each Ziploc bag. Be sure to keep the ammonia away from anything containing bleach, as the combination of the two chemicals can cause toxic fumes. The ammonia does not have to cover or coat the burners. The fumes from the ammonia within the bags will slowly dissolve build up and grime on your burners."
        },
        {
          "headline":"Seal and store the bags.",
          "description":"Seal each Ziploc bag tightly. Move the bags outdoors, or to a room where the ammonia smell will not affect you, and place them on a surface that will not be damaged if the ammonia leaks (e.g. a concrete floor). Let the bags sit overnight, or for approximately 12 hours."
        },
        {
          "headline":"Wipe the burners clean.",
          "description":"Put on protective rubber gloves before touching the ammonia-soaked burners. Remove the coils or grates from the Ziploc bags. Wipe down thoroughly with a clean, wet cloth or sponge and allow them to air dry."
        }
      ]
    },
    {
      "name":"Cleaning Glass Stove Top Burners",
      "steps":[
        {
          "headline":"Sprinkle baking soda over the surface.",
          "description":"Wait until the surface of your glass stove top is entirely cool before cleaning. Sprinkle baking soda over each burner circle (or the entire surface of the stove top, if desired). Be sure to add a thick layer of baking soda to cover all of the area you wish to clean."
        },
        {
          "headline":"Spray the surface with vinegar.",
          "description":"Fill a spray bottle with white vinegar. Spray the surface of the stove with the vinegar. Make sure that all of the baking soda is covered with vinegar and let the ingredients sit for 15 minutes."
        },
        {
          "headline":"Wipe down the surface.",
          "description":"Using a clean, wet cloth, wipe down the entire surface of the stove. Re-wet and wring out the cloth as needed to fully remove the baking soda and vinegar. Let the surface air dry before using the stove."
        },
        {
          "headline":"Remove stubborn stains.",
          "description":"For stubborn food stains or scorch marks, use a magic eraser pad for cleaning. Wet the pad and gently wipe stains. To make cleaning easy, remove stains as soon as they occur to prevent them from caking onto the surface of the stove."
        }
      ]
    }
  ],
  "text":" Doing a Basic Cleaning Remove the burners. Before cleaning, remove the burners from your gas or electric stove top. Be sure that the stove is off and that the elements are completely cooled down before taking off the burner grates or coils. Place them aside on a counter top to be cleaned. Most burners come off easily, but others may require a gentle twist or squeeze to be removed. If you encounter difficulty, refer to your appliance manual for detailed instructions. Wipe down the burner coils or grates. Add a few drops of dish washing liquid to a small bowl of warm water and agitate the mixture to produce soap suds. Dip a clean cloth or rag into the liquid, wring it out, and wipe down each coil to remove stains or debris. Re-wet and wring out the cloth for each burner. With electric burner coils, avoid getting the electrical connection wet and do not submerge them in water. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tSoak the burners in soapy water if they're really dirty. Chris Willatt of Alpine Maids says: \"To clean tough stains off the burners on a stove, take them off and soak them in the sink in soapy water for about 30 minutes. After that, just scrub them off. If you're in a hurry or you're dealing with a lot of grease, you can use a cleaner like Easy-Off, but it's a caustic cleaning product so we avoid using it whenever possible.\" Rinse and dry the burners. Wet a clean cloth with plain water and wipe down the burner coils or grates once again. Be sure to remove any soapy residue that may be left behind. Lay the burners on a clean dish towel to dry. For best results, let the burners dry for several hours before putting them back on the stove. Using Baking Soda on Tough Stains Make a baking soda paste. If any stubborn stains remain after wiping down the burner coils or grates, use a baking soda scrub to gently remove them. In a small bowl, add 1-2 tablespoons of baking soda. Slowly add drops of water and stir until the mixture reaches a thick paste consistency. Apply the paste. Using a soft cloth, sponge, or old, soft-bristled toothbrush, gently apply the baking soda paste to the stains on your burners. For best results, only apply the baking soda paste to burner coils or grates when they are removed from the stove top. Let them sit for 15-20 minutes. Wipe off and dry the burners. Using a clean, wet cloth, wipe the baking soda paste off of the burners. Wipe as thoroughly as possible to make sure that none of the mixture is left behind on the burners. Let the coils or grates dry completely before reattaching them to the stove. Using Ammonia Bag the burners and add ammonia. Remove the burner coils or grates from your stove top and place them in separate, gallon-size Ziploc bags. Add ¼ cup (2 oz.) of plain ammonia to each Ziploc bag. Be sure to keep the ammonia away from anything containing bleach, as the combination of the two chemicals can cause toxic fumes. The ammonia does not have to cover or coat the burners. The fumes from the ammonia within the bags will slowly dissolve build up and grime on your burners. Seal and store the bags. Seal each Ziploc bag tightly. Move the bags outdoors, or to a room where the ammonia smell will not affect you, and place them on a surface that will not be damaged if the ammonia leaks (e.g. a concrete floor). Let the bags sit overnight, or for approximately 12 hours. Wipe the burners clean. Put on protective rubber gloves before touching the ammonia-soaked burners. Remove the coils or grates from the Ziploc bags. Wipe down thoroughly with a clean, wet cloth or sponge and allow them to air dry. Cleaning Glass Stove Top Burners Sprinkle baking soda over the surface. Wait until the surface of your glass stove top is entirely cool before cleaning. Sprinkle baking soda over each burner circle (or the entire surface of the stove top, if desired). Be sure to add a thick layer of baking soda to cover all of the area you wish to clean. Spray the surface with vinegar. Fill a spray bottle with white vinegar. Spray the surface of the stove with the vinegar. Make sure that all of the baking soda is covered with vinegar and let the ingredients sit for 15 minutes. Wipe down the surface. Using a clean, wet cloth, wipe down the entire surface of the stove. Re-wet and wring out the cloth as needed to fully remove the baking soda and vinegar. Let the surface air dry before using the stove. Remove stubborn stains. For stubborn food stains or scorch marks, use a magic eraser pad for cleaning. Wet the pad and gently wipe stains. To make cleaning easy, remove stains as soon as they occur to prevent them from caking onto the surface of the stove.",
  "tyn_model":[
    "baking soda",
    "stove",
    "ammonia",
    "water",
    "vinegar",
    "alpine maids",
    "burner",
    "soapy water",
    "sponge",
    "ziploc bags",
    "ziploc bag",
    "gas or electric stove",
    "appliance manual",
    "dish washing",
    "electric burner",
    "easy-off",
    "dish towel",
    "rubber gloves",
    "stove top",
    "spray bottle",
    "white vinegar",
    "magic eraser pad"
  ],
  "tyn_section":[

  ]
}