{
  "title":"How to Give Your Kids a Healthy Bedtime Snack",
  "url":"https://www.wikihow.com/Give-Your-Kids-a-Healthy-Bedtime-Snack",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children",
    "Snacks for Kids"
  ],
  "methods":[
    {
      "name":"Choosing the Healthiest Snacks",
      "steps":[
        {
          "headline":"Try peanut butter and crackers for a protein-carb combo.",
          "description":"A combination of protein and complex carbs at bedtime, like whole grain crackers with nut butter, will help prevent blood sugar spikes. Sweet snacks cause blood sugar levels to rise and fall, which could cause your child to wake up hungry a couple hours after bedtime. Other protein-carb combo snacks include hummus and crackers, peanut butter toast, and cheese and fruit slices."
        },
        {
          "headline":"Serve Greek yogurt for a healthy sweet snack.",
          "description":"Greek yogurt could be a great option if your child has a sweet tooth. Instead of serving a sweet snack like ice cream or cookies, you can satisfy their craving with Greek yogurt. Greek yogurt with fruit or veggie slices also fits into the protein-carb category."
        },
        {
          "headline":"Give your child unsalted nuts before bed.",
          "description":"Peanuts, cashews, pistachios, and other nuts contain protein and fiber, which both help promote a full night's sleep. Go for unsalted nuts to avoid adding too much sodium to your child's diet. Cashews contain lots of magnesium, which makes them an even more appealing bedtime snack. Magnesium deficiency is linked to sleep disorders like restless leg syndrome and muscle cramps."
        },
        {
          "headline":"Try offering a glass of warm milk.",
          "description":"Warm milk before bed isn’t just an old fashioned myth. Cow’s milk contains melatonin, which is a neurochemical that helps regulate the sleep cycle. Heat milk in the microwave or in a double broiler until it begins to steam but not scald or boil. Your child might also find warm milk soothing, so it could help them relax before at bedtime. Make sure they brush their teeth before going to sleep, even if they’ve just had a glass of milk. Going to sleep after drinking anything except water can result in tooth decay."
        },
        {
          "headline":"Try to fill gaps in what your child ate that day.",
          "description":"Think about what your child ate or didn’t eat that day. Use the bedtime snack to fill any nutritional gaps. For example, if they skipped their serving of fruit at lunch, offer them a banana or apple slices at bedtime."
        },
        {
          "headline":"Offer snacks that your child can learn to prepare.",
          "description":"Teaching your child early how to snack in a healthy way can set the foundation for lifelong eating habits. As they enter into their school-age and preteen years, they’ll learn how to make quick and easy healthy snacks for themselves. Greek yogurt with sliced cucumber, cheese with crackers, sliced fruit or veggies, and toast with fruit and peanut butter are all great snacks to teach your growing child how to make."
        }
      ]
    },
    {
      "name":"Keeping a Bedtime Routine",
      "steps":[
        {
          "headline":"Give your child a bedtime snack to promote a full night’s sleep.",
          "description":"Toddlers and young children have high nutritional needs, but their stomachs are still growing. Along with three meals, two to three snacks during the day will make sure they get the nutrients they need. Going to bed hungry can make it more difficult for anyone to fall asleep, especially a growing child. An overnight dip in blood sugar can interfere with a full night’s sleep, causing your young one to wake up in the middle of the night."
        },
        {
          "headline":"Offer a snack an hour before bedtime.",
          "description":"Offering a snack an hour before bedtime will allow for quiet time before bed. During that time, you can make sure your child completes their hygiene and bath routines. When you offer a snack, ask your child if they’re they’re hungry first, so they don’t just eat for the sake of it."
        },
        {
          "headline":"Have your child eat the snack at the table.",
          "description":"Childhood is a time to develop good, healthy eating habits, and that means eating at the table. Don’t allow your child to eat in their bed or bedroom, on the couch, or while watching television.After snacking, make sure your child brushes their teeth and goes to the bathroom. Then, they can do relaxing activities until it’s time to go to sleep, like listening to soothing music and reading a book (or you can read them a story)."
        },
        {
          "headline":"Try to keep a consistent bedtime routine.",
          "description":"Do your best to put your child to bed and complete their bedtime routine at the same time every day. A consistent sleep schedule, even on the weekends, is best for both children and adults. Making sure your child snacks at scheduled times, including before bed, will help prevent overgrazing in the future."
        }
      ]
    },
    {
      "name":"Avoiding Pitfalls",
      "steps":[
        {
          "headline":"Keep the snack size small.",
          "description":"Remember that the bedtime snack is not a full meal. Limit portion size to a small piece of fruit, a few crackers with peanut butter or cheese, or a small bowl of low-sugar, whole grain cereal with milk. Avoid feeding your child a full meal within two hours of bedtime."
        },
        {
          "headline":"Keep the sugar content low.",
          "description":"Sugar can cause spikes in blood sugar that interfere with sleep. Further, a sugary snack before bed can encourage your child to eat less at dinner. If they’re expecting a sweet snack in a couple hours, they might turn down their portion of steamed veggies at dinner."
        },
        {
          "headline":"Don’t let caffeine sneak up on you.",
          "description":"Avoid giving your child obvious sources of caffeine, such as coffee and colas. You should also steer clear of less obvious sources, such as hot or iced tea and chocolate. Caffeine has a long half-life, so if your child does consume any tea or chocolate, make sure it’s at least six hours before bedtime."
        },
        {
          "headline":"Be aware of the feigning hunger phase.",
          "description":"Some kids go through a feigning hunger phase, which is when they say they’re hungry as a way to stay up later. If they constantly ask for one thing after another or seem to be stalling, they probably just want to stay up as late as possible. Plan on offering a snack an hour before bedtime to help make sure they stick to their bedtime routine."
        }
      ]
    }
  ],
  "text":" Choosing the Healthiest Snacks Try peanut butter and crackers for a protein-carb combo. A combination of protein and complex carbs at bedtime, like whole grain crackers with nut butter, will help prevent blood sugar spikes. Sweet snacks cause blood sugar levels to rise and fall, which could cause your child to wake up hungry a couple hours after bedtime. Other protein-carb combo snacks include hummus and crackers, peanut butter toast, and cheese and fruit slices. Serve Greek yogurt for a healthy sweet snack. Greek yogurt could be a great option if your child has a sweet tooth. Instead of serving a sweet snack like ice cream or cookies, you can satisfy their craving with Greek yogurt. Greek yogurt with fruit or veggie slices also fits into the protein-carb category. Give your child unsalted nuts before bed. Peanuts, cashews, pistachios, and other nuts contain protein and fiber, which both help promote a full night's sleep. Go for unsalted nuts to avoid adding too much sodium to your child's diet. Cashews contain lots of magnesium, which makes them an even more appealing bedtime snack. Magnesium deficiency is linked to sleep disorders like restless leg syndrome and muscle cramps. Try offering a glass of warm milk. Warm milk before bed isn’t just an old fashioned myth. Cow’s milk contains melatonin, which is a neurochemical that helps regulate the sleep cycle. Heat milk in the microwave or in a double broiler until it begins to steam but not scald or boil. Your child might also find warm milk soothing, so it could help them relax before at bedtime. Make sure they brush their teeth before going to sleep, even if they’ve just had a glass of milk. Going to sleep after drinking anything except water can result in tooth decay. Try to fill gaps in what your child ate that day. Think about what your child ate or didn’t eat that day. Use the bedtime snack to fill any nutritional gaps. For example, if they skipped their serving of fruit at lunch, offer them a banana or apple slices at bedtime. Offer snacks that your child can learn to prepare. Teaching your child early how to snack in a healthy way can set the foundation for lifelong eating habits. As they enter into their school-age and preteen years, they’ll learn how to make quick and easy healthy snacks for themselves. Greek yogurt with sliced cucumber, cheese with crackers, sliced fruit or veggies, and toast with fruit and peanut butter are all great snacks to teach your growing child how to make. Keeping a Bedtime Routine Give your child a bedtime snack to promote a full night’s sleep. Toddlers and young children have high nutritional needs, but their stomachs are still growing. Along with three meals, two to three snacks during the day will make sure they get the nutrients they need. Going to bed hungry can make it more difficult for anyone to fall asleep, especially a growing child. An overnight dip in blood sugar can interfere with a full night’s sleep, causing your young one to wake up in the middle of the night. Offer a snack an hour before bedtime. Offering a snack an hour before bedtime will allow for quiet time before bed. During that time, you can make sure your child completes their hygiene and bath routines. When you offer a snack, ask your child if they’re they’re hungry first, so they don’t just eat for the sake of it. Have your child eat the snack at the table. Childhood is a time to develop good, healthy eating habits, and that means eating at the table. Don’t allow your child to eat in their bed or bedroom, on the couch, or while watching television.After snacking, make sure your child brushes their teeth and goes to the bathroom. Then, they can do relaxing activities until it’s time to go to sleep, like listening to soothing music and reading a book (or you can read them a story). Try to keep a consistent bedtime routine. Do your best to put your child to bed and complete their bedtime routine at the same time every day. A consistent sleep schedule, even on the weekends, is best for both children and adults. Making sure your child snacks at scheduled times, including before bed, will help prevent overgrazing in the future. Avoiding Pitfalls Keep the snack size small. Remember that the bedtime snack is not a full meal. Limit portion size to a small piece of fruit, a few crackers with peanut butter or cheese, or a small bowl of low-sugar, whole grain cereal with milk. Avoid feeding your child a full meal within two hours of bedtime. Keep the sugar content low. Sugar can cause spikes in blood sugar that interfere with sleep. Further, a sugary snack before bed can encourage your child to eat less at dinner. If they’re expecting a sweet snack in a couple hours, they might turn down their portion of steamed veggies at dinner. Don’t let caffeine sneak up on you. Avoid giving your child obvious sources of caffeine, such as coffee and colas. You should also steer clear of less obvious sources, such as hot or iced tea and chocolate. Caffeine has a long half-life, so if your child does consume any tea or chocolate, make sure it’s at least six hours before bedtime. Be aware of the feigning hunger phase. Some kids go through a feigning hunger phase, which is when they say they’re hungry as a way to stay up later. If they constantly ask for one thing after another or seem to be stalling, they probably just want to stay up as late as possible. Plan on offering a snack an hour before bedtime to help make sure they stick to their bedtime routine.",
  "tyn_model":[
    "milk",
    "greek yogurt",
    "peanut butter",
    "crackers",
    "nuts",
    "cashews",
    "snack",
    "chocolate",
    "whole grain crackers",
    "nut butter",
    "hummus",
    "peanut butter toast",
    "ice cream",
    "peanuts",
    "pistachios",
    "magnesium",
    "cow’s milk",
    "microwave",
    "water",
    "banana",
    "cucumber",
    "cheese",
    "toast",
    "sugar",
    "coffee",
    "caffeine",
    "tea"
  ],
  "tyn_section":[

  ]
}