{
  "title":"How to Crystallize Honey",
  "url":"https://www.wikihow.com/Crystallize-Honey",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Honey"
  ],
  "parts":[
    {
      "name":"Creating the Right Conditions",
      "steps":[
        {
          "headline":"Purchase unfiltered honey.",
          "description":"Regardless of how much time passes and the temperature it's stored at, honey that's been processed or tampered with will not crystalize. Only raw, unfiltered honey will crystalize. Make sure you purchase unfiltered, pure honey. Unfiltered honey may have an added cost, but it's the only way to get crystalized honey. It may be easier to find unfiltered honey in an organic grocery store or the organic section of your store."
        },
        {
          "headline":"Store your honey in a plastic jar.",
          "description":"Exposure to air may make honey crystalize faster. Plastic jars are generally more porous than other storage options. If your honey did not already come in a plastic jar, transfer it to one to speed up the crystallization process."
        },
        {
          "headline":"Ask at a store which honey crystalizes fastest.",
          "description":"If you're buying your honey from a local business, like a farmer's market, ask the provider which honeys crystalize fastest. Honeys infused with things like rose petals may crystalize faster than other types of honey."
        }
      ]
    },
    {
      "name":"Crystalizing the Honey",
      "steps":[
        {
          "headline":"Add water.",
          "description":"A low glucose-to-water ratio speeds up the process of crystallization. Try adding a tablespoon or two of water to your honey and mixing it in. This may result in faster crystallization."
        },
        {
          "headline":"Store your honey in the refrigerator.",
          "description":"Honey stored in temperatures around 50 degrees Fahrenheit (10 degrees Celsius) will crystalize much faster. Store your honey somewhere like the fridge. Use a thermometer to determine your fridge's heat to make sure it hovers around the 50s. Do not freeze your honey. This will prevent it from crystalizing."
        },
        {
          "headline":"Wait for your honey to crystalize.",
          "description":"Unfortunately, there is no exact formula to know how long honey crystalizes. When kept at the right temperature, most honey will crystalize but this can take anywhere from weeks to years. When your honey crystalizes, you will realize the honey is formed into large crystals with white air bubbles in between."
        },
        {
          "headline":"Transfer small amounts of crystalized honey to runny honey.",
          "description":"If you already have some crystalized honey, transfer this to a container of runny honey. The presence of honey crystals may speed up the crystallization process."
        }
      ]
    },
    {
      "name":"Using Crystalized Honey",
      "steps":[
        {
          "headline":"Use it as a spread.",
          "description":"Crystalized honey is thicker than regular honey. You can use it as a spread on things like bread, bagels, toast, and English muffins."
        },
        {
          "headline":"Glaze meat with crystalized honey.",
          "description":"Meats like pork and chicken can taste great with a honey glaze. You can just as easily use crystalized honey as regular honey to glaze your meats prior to cooking them."
        },
        {
          "headline":"Sweeten drinks with crystalized honey.",
          "description":"Honey crystals can be dropped in hot drinks like coffee and tea. They dissolve just like sugar cubes and will sweeten up your drink."
        }
      ]
    }
  ],
  "text":" Creating the Right Conditions Purchase unfiltered honey. Regardless of how much time passes and the temperature it's stored at, honey that's been processed or tampered with will not crystalize. Only raw, unfiltered honey will crystalize. Make sure you purchase unfiltered, pure honey. Unfiltered honey may have an added cost, but it's the only way to get crystalized honey. It may be easier to find unfiltered honey in an organic grocery store or the organic section of your store. Store your honey in a plastic jar. Exposure to air may make honey crystalize faster. Plastic jars are generally more porous than other storage options. If your honey did not already come in a plastic jar, transfer it to one to speed up the crystallization process. Ask at a store which honey crystalizes fastest. If you're buying your honey from a local business, like a farmer's market, ask the provider which honeys crystalize fastest. Honeys infused with things like rose petals may crystalize faster than other types of honey. Crystalizing the Honey Add water. A low glucose-to-water ratio speeds up the process of crystallization. Try adding a tablespoon or two of water to your honey and mixing it in. This may result in faster crystallization. Store your honey in the refrigerator. Honey stored in temperatures around 50 degrees Fahrenheit (10 degrees Celsius) will crystalize much faster. Store your honey somewhere like the fridge. Use a thermometer to determine your fridge's heat to make sure it hovers around the 50s. Do not freeze your honey. This will prevent it from crystalizing. Wait for your honey to crystalize. Unfortunately, there is no exact formula to know how long honey crystalizes. When kept at the right temperature, most honey will crystalize but this can take anywhere from weeks to years. When your honey crystalizes, you will realize the honey is formed into large crystals with white air bubbles in between. Transfer small amounts of crystalized honey to runny honey. If you already have some crystalized honey, transfer this to a container of runny honey. The presence of honey crystals may speed up the crystallization process. Using Crystalized Honey Use it as a spread. Crystalized honey is thicker than regular honey. You can use it as a spread on things like bread, bagels, toast, and English muffins. Glaze meat with crystalized honey. Meats like pork and chicken can taste great with a honey glaze. You can just as easily use crystalized honey as regular honey to glaze your meats prior to cooking them. Sweeten drinks with crystalized honey. Honey crystals can be dropped in hot drinks like coffee and tea. They dissolve just like sugar cubes and will sweeten up your drink.",
  "tyn_model":[
    "honey",
    "water",
    "refrigerator",
    "english muffins"
  ],
  "tyn_section":[

  ]
}