{
  "title":"How to Plant Moso Bamboo Seeds",
  "url":"https://www.wikihow.com/Plant-Moso-Bamboo-Seeds",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "parts":[
    {
      "name":"Selecting the Environment for Your Seeds",
      "steps":[
        {
          "headline":"Choose a location that gets ample sunlight.",
          "description":"Larger species of bamboo, such as moso, grow especially fast and become healthiest when they’re exposed to full sunlight after the germination process. Try to avoid planting your moso bamboo in an area where there are surrounding trees or buildings that will minimize sunlight. While other types of bamboo and plants in general can thrive while being exposed to three or so hours of sunlight a day, moso bamboo needs six or more."
        },
        {
          "headline":"Make sure the area has a water source.",
          "description":"While moso bamboo may not necessarily need an excessive amount of water, it grows best in a location where it has constant access to water. Opt for an area that’s relatively easy to make and keep moist."
        },
        {
          "headline":"Plant your seeds when and where the temperature is mild.",
          "description":"Choose a cooler environment that doesn’t freeze for long periods. For the best possible end result, plant your seeds in the springtime. Once your moso bamboo is more established, it will be able to handle temperatures as low as 5 degrees Fahrenheit (-15 degrees Celsius), but it will have a hard time coming back from damage caused by colder, longer periods of time."
        }
      ]
    },
    {
      "name":"Preparing the Seeds",
      "steps":[
        {
          "headline":"Chill your seeds in the refrigerator.",
          "description":"Break seed dormancy by keeping them in the refrigerator for two or three weeks before you sow them. You can put them in the ground outside during winter months instead and hope for springtime germination, but the chances of success when using this method are lower, because you won’t be able to regulate moisture and temperature."
        },
        {
          "headline":"Get a pot and create a growing medium by mixing sand and compost.",
          "description":"Either a peat-based or peat-free compost mixed with sand in equal parts will create a strong foundation that will allow your seeds to get a good start. Make enough of your mixture to fill your pot about three fourths of the way."
        },
        {
          "headline":"Soak your seeds.",
          "description":"Soften up your seeds by soaking them for 24 hours in a bowl of water. In addition to softening, this step allows you to assess which of your seeds are viable and which aren’t. Any seeds that float and do not sink to the bottom most likely won’t sprout, so don’t bother planting those."
        },
        {
          "headline":"Warm the growing medium.",
          "description":"While the seeds are soaking, fill your pot a little over halfway with your sand and compost mixture, cover it with plastic wrap, and let it sit in a temperature somewhere between 68 and 78 degrees Fahrenheit (20-26 degrees Celsius)."
        }
      ]
    },
    {
      "name":"Planting and Growing the Seeds",
      "steps":[
        {
          "headline":"Plant the seeds in a shady spot.",
          "description":"Place the seeds in the pot several inches apart and cover the seeds with about a quarter inch of your medium. At this point in the process, the seeds will be very sensitive to environmental influences, and require consistently warm temperatures, light shade, and moisture. Bamboo typically takes around a month or so to germinate, however, sometimes it can take up to six months. Be patient and consider this before assuming that your seeds aren’t viable."
        },
        {
          "headline":"Transport the plant.",
          "description":"Dig a hole the size of your pot somewhere in the sunny area you’ve selected. Once your moso bamboo plant is several inches tall and appears to be somewhat strong and stable, gently remove it from the pot in the shady, warm area while keeping the roots and compost mixture as intact as possible."
        },
        {
          "headline":"Support the plant with stakes.",
          "description":"As your moso bamboo tries to weather its new environment, place three or four stakes around the base of the plant and tie a rope around its culms. This will stabilize the plant and keep it from uprooting or getting damaged while it gets stronger."
        },
        {
          "headline":"Maintain a moist environment.",
          "description":"When you initially transport the plant, make sure to soak the ground with water so that your moso bamboo starts off with a healthy amount of moisture. Put a three or four inch layer of mulch around your plant to help it retain moisture."
        }
      ]
    }
  ],
  "text":" Selecting the Environment for Your Seeds Choose a location that gets ample sunlight. Larger species of bamboo, such as moso, grow especially fast and become healthiest when they’re exposed to full sunlight after the germination process. Try to avoid planting your moso bamboo in an area where there are surrounding trees or buildings that will minimize sunlight. While other types of bamboo and plants in general can thrive while being exposed to three or so hours of sunlight a day, moso bamboo needs six or more. Make sure the area has a water source. While moso bamboo may not necessarily need an excessive amount of water, it grows best in a location where it has constant access to water. Opt for an area that’s relatively easy to make and keep moist. Plant your seeds when and where the temperature is mild. Choose a cooler environment that doesn’t freeze for long periods. For the best possible end result, plant your seeds in the springtime. Once your moso bamboo is more established, it will be able to handle temperatures as low as 5 degrees Fahrenheit (-15 degrees Celsius), but it will have a hard time coming back from damage caused by colder, longer periods of time. Preparing the Seeds Chill your seeds in the refrigerator. Break seed dormancy by keeping them in the refrigerator for two or three weeks before you sow them. You can put them in the ground outside during winter months instead and hope for springtime germination, but the chances of success when using this method are lower, because you won’t be able to regulate moisture and temperature. Get a pot and create a growing medium by mixing sand and compost. Either a peat-based or peat-free compost mixed with sand in equal parts will create a strong foundation that will allow your seeds to get a good start. Make enough of your mixture to fill your pot about three fourths of the way. Soak your seeds. Soften up your seeds by soaking them for 24 hours in a bowl of water. In addition to softening, this step allows you to assess which of your seeds are viable and which aren’t. Any seeds that float and do not sink to the bottom most likely won’t sprout, so don’t bother planting those. Warm the growing medium. While the seeds are soaking, fill your pot a little over halfway with your sand and compost mixture, cover it with plastic wrap, and let it sit in a temperature somewhere between 68 and 78 degrees Fahrenheit (20-26 degrees Celsius). Planting and Growing the Seeds Plant the seeds in a shady spot. Place the seeds in the pot several inches apart and cover the seeds with about a quarter inch of your medium. At this point in the process, the seeds will be very sensitive to environmental influences, and require consistently warm temperatures, light shade, and moisture. Bamboo typically takes around a month or so to germinate, however, sometimes it can take up to six months. Be patient and consider this before assuming that your seeds aren’t viable. Transport the plant. Dig a hole the size of your pot somewhere in the sunny area you’ve selected. Once your moso bamboo plant is several inches tall and appears to be somewhat strong and stable, gently remove it from the pot in the shady, warm area while keeping the roots and compost mixture as intact as possible. Support the plant with stakes. As your moso bamboo tries to weather its new environment, place three or four stakes around the base of the plant and tie a rope around its culms. This will stabilize the plant and keep it from uprooting or getting damaged while it gets stronger. Maintain a moist environment. When you initially transport the plant, make sure to soak the ground with water so that your moso bamboo starts off with a healthy amount of moisture. Put a three or four inch layer of mulch around your plant to help it retain moisture.",
  "tyn_model":[
    "bamboo",
    "pot",
    "water",
    "compost",
    "sand",
    "stakes",
    "plants",
    "refrigerator",
    "peat-based or",
    "peat-free compost",
    "bowl",
    "growing medium",
    "plastic wrap",
    "medium",
    "rope",
    "moso bamboo",
    "mulch"
  ],
  "tyn_section":[

  ]
}