{
  "title":"How to Make Chocolate Avocado Truffles",
  "url":"https://www.wikihow.com/Make-Chocolate-Avocado-Truffles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Chocolate Truffles"
  ],
  "parts":[
    {
      "name":"Melting Your Chocolate",
      "steps":[
        {
          "headline":"Cut the chocolate into chunks.",
          "description":"Before melting your chocolate, use a sharp knife to cut it into small chunks so it mixes quicker. Some baking chocolate comes in pre-cut segments so you can easily break the chocolate apart with your hands."
        },
        {
          "headline":"Combine the chocolate with the vanilla and salt.",
          "description":"Get a small glass bowl big enough to contain the chocolate. Put the chocolate and vanilla in the bowl. Then, add a small pinch of salt for added taste."
        },
        {
          "headline":"Heat a few inches of water in a sauce pan.",
          "description":"Pick a sauce pan that you can place your bowl over. Your bowl should be able to sit on top of the sauce pan, covering it. Place a few inches of water on the bottom of the bowl and heat it over the stove until it produces steam."
        },
        {
          "headline":"Place the your bowl above the water.",
          "description":"Take your bowl and place it over the sauce pan. Make sure cover the sauce pan completely to trap the steam."
        },
        {
          "headline":"Stir the chocolate until it melts.",
          "description":"Allow the chocolate to slowly melt over the heat. Stir the chocolate on occasion with a mixing spoon. Make sure the chocolate all melts completely through and the vanilla and salt mix into the chocolate."
        }
      ]
    },
    {
      "name":"Mixing in the Other Ingredients",
      "steps":[
        {
          "headline":"Blend the avocado in a food processor.",
          "description":"Cut your avocado into small chunks. Place the small chunks in a food processor and blend your avocado until it forms smooth, pudding-like texture. If you don't have a food processor, mash the avocado with a knife instead."
        },
        {
          "headline":"Stir the avocado into the melted chocolate.",
          "description":"Pour your avocado into your melted chocolate mixture. The mixture should be removed from the heat by now. Use a mixing spoon to stir the mixture together until all the ingredients are evenly mixed."
        },
        {
          "headline":"Set the mixture in the fridge.",
          "description":"When you're done stirring, place the mixture in your refrigerator. Refrigerate the mixture for about 20 minutes. When it's done cooling, the mixture should be slightly firm to the touch. As your mixture will only be in the fridge a short time, it's not necessary to cover the bowl."
        }
      ]
    },
    {
      "name":"Forming Your Truffles",
      "steps":[
        {
          "headline":"Line a cookie sheet with waxed paper.",
          "description":"Take some wax paper and lay it over a cookie sheet. Use tape to secure the paper to prevent it from moving."
        },
        {
          "headline":"Roll the mixture into balls.",
          "description":"Use a tablespoon. Scoop the chocolate avocado mixture out of the bowl. You should get about 12 chunks of the avocado mixture. Place the mixture on the parchment paper and use your hands to roll the chunks into uniform balls."
        },
        {
          "headline":"Roll the balls in the cocoa powder.",
          "description":"Sprinkle your cocoa powder into a bowl or onto a plate. Roll the avocado balls in the cocoa powder until they're evenly coated."
        },
        {
          "headline":"Serve your truffles.",
          "description":"As soon as you're done rolling the avocado mixture into balls, you can serve your truffles. They taste best when served at room temperature. The truffles should last three to four days when stored in a cabinet or cupboard. When stored in the fridge, they should last seven to ten days."
        }
      ]
    }
  ],
  "text":" Melting Your Chocolate Cut the chocolate into chunks. Before melting your chocolate, use a sharp knife to cut it into small chunks so it mixes quicker. Some baking chocolate comes in pre-cut segments so you can easily break the chocolate apart with your hands. Combine the chocolate with the vanilla and salt. Get a small glass bowl big enough to contain the chocolate. Put the chocolate and vanilla in the bowl. Then, add a small pinch of salt for added taste. Heat a few inches of water in a sauce pan. Pick a sauce pan that you can place your bowl over. Your bowl should be able to sit on top of the sauce pan, covering it. Place a few inches of water on the bottom of the bowl and heat it over the stove until it produces steam. Place the your bowl above the water. Take your bowl and place it over the sauce pan. Make sure cover the sauce pan completely to trap the steam. Stir the chocolate until it melts. Allow the chocolate to slowly melt over the heat. Stir the chocolate on occasion with a mixing spoon. Make sure the chocolate all melts completely through and the vanilla and salt mix into the chocolate. Mixing in the Other Ingredients Blend the avocado in a food processor. Cut your avocado into small chunks. Place the small chunks in a food processor and blend your avocado until it forms smooth, pudding-like texture. If you don't have a food processor, mash the avocado with a knife instead. Stir the avocado into the melted chocolate. Pour your avocado into your melted chocolate mixture. The mixture should be removed from the heat by now. Use a mixing spoon to stir the mixture together until all the ingredients are evenly mixed. Set the mixture in the fridge. When you're done stirring, place the mixture in your refrigerator. Refrigerate the mixture for about 20 minutes. When it's done cooling, the mixture should be slightly firm to the touch. As your mixture will only be in the fridge a short time, it's not necessary to cover the bowl. Forming Your Truffles Line a cookie sheet with waxed paper. Take some wax paper and lay it over a cookie sheet. Use tape to secure the paper to prevent it from moving. Roll the mixture into balls. Use a tablespoon. Scoop the chocolate avocado mixture out of the bowl. You should get about 12 chunks of the avocado mixture. Place the mixture on the parchment paper and use your hands to roll the chunks into uniform balls. Roll the balls in the cocoa powder. Sprinkle your cocoa powder into a bowl or onto a plate. Roll the avocado balls in the cocoa powder until they're evenly coated. Serve your truffles. As soon as you're done rolling the avocado mixture into balls, you can serve your truffles. They taste best when served at room temperature. The truffles should last three to four days when stored in a cabinet or cupboard. When stored in the fridge, they should last seven to ten days.",
  "tyn_model":[
    "chocolate",
    "bowl",
    "sauce pan",
    "avocado",
    "vanilla",
    "salt",
    "water",
    "food processor",
    "cocoa powder",
    "mixing spoon",
    "baking chocolate",
    "stove",
    "knife",
    "refrigerator",
    "cookie sheet",
    "waxed paper",
    "wax paper",
    "chocolate avocado",
    "parchment paper",
    "plate"
  ],
  "tyn_section":[

  ]
}