{
  "title":"How to Dull Leather",
  "url":"https://www.wikihow.com/Dull-Leather",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Leatherworking"
  ],
  "methods":[
    {
      "name":"Washing and Wearing Leather Items",
      "steps":[
        {
          "headline":"Clean your leather item with soapy water.",
          "description":"Cleaning your leather may be enough to remove oils or waxes that are making it look shiny. You can make your own leather cleaning solution by combining 16  fl oz (470 mL) of water with a few drops of dish soap. Dip a soft towel or cloth into the solution and then wipe down the leather. Then, dip a new cloth in distilled water and wipe the item again. Dry the leather with a soft, dry towel or chamois. You can also purchase a leather cleaning product if you prefer. Look for a leather cleaning product that will leave a matte finish to get a dull look on your leather item. Wetting the leather with plain water may also be enough to dull it. Moisten a washcloth with water and wipe it over the surface of your leather item for an instant dulling effect."
        },
        {
          "headline":"Pull the shine off of a leather jacket by washing and drying it.",
          "description":"Put your leather jacket in the washer by itself and add 1 US tbsp (15 mL) of laundry detergent. Run the washer on the gentle cycle using cold water. Wring the jacket out when it’s finished washing, as the washing machine won’t be able to get out all the excess water. Then, transfer it to the dryer and run it on medium heat until it is dry. This should get rid of any wrinkles in the leather. You might need to repeat the process to get the desired look, especially if your leather item is brand new. Your leather jacket may shrink in the dryer. For items that you don’t want to get any smaller, use the no-heat tumble dry cycle."
        },
        {
          "headline":"Wear and use your leather often to break it in over time.",
          "description":"Another easy, slow way to dull leather is to wear and use it often. Leather will continue to look duller and more beat up over the years. Speed up this slow aging process by using your leather items as often as you can. You can also try wearing your leather item outside on a rainy or snowy day to get it wet.Tip: If you have a leather jacket or leather shoes that you want to make look duller, try lending the item out to friends to speed up the process."
        }
      ]
    },
    {
      "name":"Using a Chemical Solution to Dull Leather",
      "steps":[
        {
          "headline":"Use a wax stripping product to remove a mirror shine.",
          "description":"A mirror shine is an ultra-glossy finish on leather. It is a common finish on dress shoes. If you have a pair of shoes or other leather item that has a wax mirror shine on it, then you might need to purchase a special product to get the wax off. Purchase a bottle of leather wax remover in the shoe department of a store or online. Apply the product to a rag or soft cloth and wipe it over the surface of the leather. Continue to apply and wipe the surface until the mirror glaze is completely gone. Mirror glaze can be difficult to remove. Press hard as you wipe down the surface of the leather item."
        },
        {
          "headline":"Spray the item with rubbing alcohol to create a dull, weathered look.",
          "description":"Fill an empty spray bottle about 1/4 to 1/2 full with rubbing alcohol. Then, spray a light layer of alcohol all over your leather item. Apply enough alcohol so that the item is damp but not drenched. Allow the alcohol to dry completely to give your leather a dull, weathered look. You can also use a toothbrush dipped in rubbing alcohol to apply it to hard-to-reach spots. Alcohol dries quickly, so you should notice the effect within 5 minutes of applying the product."
        },
        {
          "headline":"Apply acetone nail polish remover to remove color and shine.",
          "description":"Acetone nail polish remover can lighten or even remove the dyes used to color your leather. Pour a small amount of acetone nail polish remover onto a cotton ball or soft cloth, and rub the cotton ball or cloth over any spots you want to lighten. Focus on areas that might naturally fade first, such as the bottom corners of bags or the elbow creases of jackets. This technique will work differently depending on the quality and color of the dye. You may not be able to completely remove the color on a dark leather item.Warning: Chemical methods of dulling your leather may damage and discolor it, so test it first. Apply the solution to an inconspicuous area of the leather before you treat the whole item."
        }
      ]
    },
    {
      "name":"Trying Abrasive Techniques",
      "steps":[
        {
          "headline":"Wipe leather with a textured cleaning cloth to dull the shine.",
          "description":"Purchase a container of scrubbing surface wipes that are meant for cleaning counters and other hard surfaces. Then, wipe the leather to dull the shine. Dry off the leather with a soft towel or chamois after you finish wiping it. You may need to repeat this 1 to 2 more times to get the desired effect. You can find texture cleaning cloths in the cleaning supplies section of a grocery store. Look for one that is labeled as “textured,” “abrasive,” or “scrubbing.”"
        },
        {
          "headline":"Rub leather with steel wool or 220-grit sandpaper for a distressed look.",
          "description":"The longer you have your leather, the more scratched up it gets. To give new leather a distressed appearance, rub it gently with steel wool or 220-grit sandpaper. Use back-and-forth motions to rub the leather instead of going in circles, as this will create more natural-looking scratches. Sandpaper may be too coarse for some leather. Try starting with steel wool and moving up to sandpaper if you need it. You can move up to even coarser sandpaper if you want to create deeper scratches."
        },
        {
          "headline":"Use a wire brush if you want to create naturally worn spots.",
          "description":"Rub a wire brush in back-and-forth and use circular motions in the spot on your leather item that you’d like to age. Go slowly and monitor the amount of distress you’re creating in the leather. Don't rub an area too much or you may puncture the leather. For shoes and boots, focus on the top part of the toe. For bags, scuff up the bottom corners. For jackets, spend some time on the elbow creases. You could also try scuffing up a leather item with another rough item, such as a pumice stone or rough rock. Warning: Be aware that using abrasive methods to dull leather may damage it. Test the technique on an inconspicuous area of the item before you treat it all over."
        }
      ]
    }
  ],
  "text":" Washing and Wearing Leather Items Clean your leather item with soapy water. Cleaning your leather may be enough to remove oils or waxes that are making it look shiny. You can make your own leather cleaning solution by combining 16  fl oz (470 mL) of water with a few drops of dish soap. Dip a soft towel or cloth into the solution and then wipe down the leather. Then, dip a new cloth in distilled water and wipe the item again. Dry the leather with a soft, dry towel or chamois. You can also purchase a leather cleaning product if you prefer. Look for a leather cleaning product that will leave a matte finish to get a dull look on your leather item. Wetting the leather with plain water may also be enough to dull it. Moisten a washcloth with water and wipe it over the surface of your leather item for an instant dulling effect. Pull the shine off of a leather jacket by washing and drying it. Put your leather jacket in the washer by itself and add 1 US tbsp (15 mL) of laundry detergent. Run the washer on the gentle cycle using cold water. Wring the jacket out when it’s finished washing, as the washing machine won’t be able to get out all the excess water. Then, transfer it to the dryer and run it on medium heat until it is dry. This should get rid of any wrinkles in the leather. You might need to repeat the process to get the desired look, especially if your leather item is brand new. Your leather jacket may shrink in the dryer. For items that you don’t want to get any smaller, use the no-heat tumble dry cycle. Wear and use your leather often to break it in over time. Another easy, slow way to dull leather is to wear and use it often. Leather will continue to look duller and more beat up over the years. Speed up this slow aging process by using your leather items as often as you can. You can also try wearing your leather item outside on a rainy or snowy day to get it wet.Tip: If you have a leather jacket or leather shoes that you want to make look duller, try lending the item out to friends to speed up the process. Using a Chemical Solution to Dull Leather Use a wax stripping product to remove a mirror shine. A mirror shine is an ultra-glossy finish on leather. It is a common finish on dress shoes. If you have a pair of shoes or other leather item that has a wax mirror shine on it, then you might need to purchase a special product to get the wax off. Purchase a bottle of leather wax remover in the shoe department of a store or online. Apply the product to a rag or soft cloth and wipe it over the surface of the leather. Continue to apply and wipe the surface until the mirror glaze is completely gone. Mirror glaze can be difficult to remove. Press hard as you wipe down the surface of the leather item. Spray the item with rubbing alcohol to create a dull, weathered look. Fill an empty spray bottle about 1/4 to 1/2 full with rubbing alcohol. Then, spray a light layer of alcohol all over your leather item. Apply enough alcohol so that the item is damp but not drenched. Allow the alcohol to dry completely to give your leather a dull, weathered look. You can also use a toothbrush dipped in rubbing alcohol to apply it to hard-to-reach spots. Alcohol dries quickly, so you should notice the effect within 5 minutes of applying the product. Apply acetone nail polish remover to remove color and shine. Acetone nail polish remover can lighten or even remove the dyes used to color your leather. Pour a small amount of acetone nail polish remover onto a cotton ball or soft cloth, and rub the cotton ball or cloth over any spots you want to lighten. Focus on areas that might naturally fade first, such as the bottom corners of bags or the elbow creases of jackets. This technique will work differently depending on the quality and color of the dye. You may not be able to completely remove the color on a dark leather item.Warning: Chemical methods of dulling your leather may damage and discolor it, so test it first. Apply the solution to an inconspicuous area of the leather before you treat the whole item. Trying Abrasive Techniques Wipe leather with a textured cleaning cloth to dull the shine. Purchase a container of scrubbing surface wipes that are meant for cleaning counters and other hard surfaces. Then, wipe the leather to dull the shine. Dry off the leather with a soft towel or chamois after you finish wiping it. You may need to repeat this 1 to 2 more times to get the desired effect. You can find texture cleaning cloths in the cleaning supplies section of a grocery store. Look for one that is labeled as “textured,” “abrasive,” or “scrubbing.” Rub leather with steel wool or 220-grit sandpaper for a distressed look. The longer you have your leather, the more scratched up it gets. To give new leather a distressed appearance, rub it gently with steel wool or 220-grit sandpaper. Use back-and-forth motions to rub the leather instead of going in circles, as this will create more natural-looking scratches. Sandpaper may be too coarse for some leather. Try starting with steel wool and moving up to sandpaper if you need it. You can move up to even coarser sandpaper if you want to create deeper scratches. Use a wire brush if you want to create naturally worn spots. Rub a wire brush in back-and-forth and use circular motions in the spot on your leather item that you’d like to age. Go slowly and monitor the amount of distress you’re creating in the leather. Don't rub an area too much or you may puncture the leather. For shoes and boots, focus on the top part of the toe. For bags, scuff up the bottom corners. For jackets, spend some time on the elbow creases. You could also try scuffing up a leather item with another rough item, such as a pumice stone or rough rock. Warning: Be aware that using abrasive methods to dull leather may damage it. Test the technique on an inconspicuous area of the item before you treat it all over.",
  "tyn_model":[
    "water",
    "rubbing alcohol",
    "alcohol",
    "sandpaper",
    "dryer",
    "leather",
    "acetone nail polish remover",
    "220-grit sandpaper",
    "steel wool",
    "wire brush",
    "soapy water",
    "dish soap",
    "distilled water",
    "leather cleaning product",
    "washcloth",
    "laundry detergent",
    "washer",
    "washing machine",
    "tumble dry cycle",
    "wax stripping product",
    "leather wax remover",
    "spray bottle",
    "acetone nail polish",
    "cotton ball",
    "cleaning cloth",
    "scrubbing surface wipes",
    "chamois",
    "texture cleaning cloths",
    "cleaning supplies section",
    "“textured",
    "” “",
    "” or",
    "“scrubbing",
    "” rub",
    "steel wool or",
    "pumice stone"
  ],
  "tyn_section":[

  ]
}