{
  "title":"How to Conserve Energy",
  "url":"https://www.wikihow.com/Conserve-Energy",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling"
  ],
  "methods":[
    {
      "name":"Rethinking Lighting",
      "steps":[
        {
          "headline":"Create a \"bright room\" in your household.",
          "description":"When the sun goes down, turn on the lights in just one central room in your house, and encourage your family to spend the evening hours there instead of scattering around the house and lighting up every room. Lighting just one room will save a lot of energy and money over time."
        },
        {
          "headline":"Replace electric lights with candles.",
          "description":"Conserving energy means taking a new approach to everyday conveniences we take for granted, like the ability to flip on all the lights and keep them burning all night long. You don't have to completely stop using electric lights, but using candles instead a few nights per week is a great way to save energy and provide inspiration for reevaluating your approach to energy. In addition to these practical reasons for turning out the lights, breaking out the candles provides an instant atmosphere of either romance or spooky fun, depending upon who else is around to enjoy it. Start by choosing just one night a week to use candles instead of electric lights. Stock up on sturdy, slow-burning candles that will cast a fair amount of light for several hours. On \"candle night,\" try to do activities that don't require electricity, such as telling stories or reading by candlelight. Be sure to store your candles and matches in a safe place when they are not in use."
        },
        {
          "headline":"Embrace natural light.",
          "description":"During the day, think of the sun as your primary light source, and rearrange your home or workplace to take advantage of its rays. Open the shades or blinds and let the light pour in instead of automatically flipping on the overhead switch. If you work in an office, try to arrange your desk so that it's lit by natural light, so you won't have to use a desk lamp or  overhead lighting. In your home, set up your family's main daytime activity area in the brightest room that gets the best sunlight. Drawing, reading, using the computer, and other activities that require good lighting can take place in this room without the need for electric lights."
        },
        {
          "headline":"Replace your incandescent light bulbs.",
          "description":"These old-fashioned light bulbs burn off most of their energy as heat instead of producing light. Replace them with compact fluorescent bulbs or LED bulbs, both of which are much more energy efficient. Compact fluorescent bulbs use about 1/4 the energy of incandescent bulbs. They're made with a small amount of mercury, though, so be sure you dispose of them properly when they burn out. LED bulbs are more expensive than the other types, but they last longer and they don't contain mercury."
        },
        {
          "headline":"Minimize your use of outside lights.",
          "description":"A lot of people don't think about how much energy is being used by porch lights or path lights that stay on all night long. Decide whether it's really necessary to leave the lights on past your bedtime. If you want outside lights for security purposes, consider buying an automatic light that operates using a motion detector, rather than one that burns constantly. Turn off decorative holiday lights before you go to bed, rather than waiting until morning. Replace path and garden lights  that charge during the day and glow warmly at night."
        }
      ]
    },
    {
      "name":"Reducing Use of Appliances",
      "steps":[
        {
          "headline":"Decide which appliances you really need to use.",
          "description":"Your first impulse might be to say, \"I need them all.\" However, you'd be surprised how much energy you can save by reducing your use of appliances, and how much satisfaction comes from being self-reliant. Consider changing your habits regarding the following energy-sapping appliances:\nThe dryer. If you have access to outside space, hang a clothesline and start drying your clothes outside. You can also get a drying rack to use indoors - just place it in your bedroom or bathroom near a window. If you must continue using the dryer, reduce your usage to once a week or so, rather than throwing in small loads every other day. The dishwasher. Make sure each load you do is completely full. If you have time to wash dishes by hand using the  water conservation method, that's even better. The oven. Heating an electric oven requires a lot of energy. Plan to do all of your baking on one day of the week, while the oven is hot, instead of heating it every few days for various purposes. The vacuum. Sweep whenever you can instead of using a vacuum. Even a carpet can be swept between vacuuming sessions to remove larger pieces of debris."
        },
        {
          "headline":"Unplug everything.",
          "description":"Electronics and appliances continue sapping energy while they're plugged in, even when they're switched to \"off.\" Make a habit of unplugging everything that's not in use, especially computers, TVs and sound systems, which use up the most energy. Don't forget small appliances like coffee makers, hair dryers and phone chargers. Determine whether it's really necessary to keep plug-in air fresheners and night lights."
        },
        {
          "headline":"Replace old appliances with newer models.",
          "description":"Older appliances weren't always designed with energy conservation in mind. If you have an older refrigerator, dishwasher, oven, or dryer, you may be using more energy (and paying more money) than strictly necessary for the chores you need to do. Conduct research to find newer models that are more energy efficient."
        }
      ]
    },
    {
      "name":"Handling Heating and Cooling Efficiently",
      "steps":[
        {
          "headline":"Turn off the air conditioner.",
          "description":"Conserving energy sometimes requires making small sacrifices, and getting more familiar with the heat of summer is one of them. Leaving the air conditioner on all the time is a great way to use loads of energy and keep your electricity bills high. Turn off the air conditioner when you aren't home. There's no reason for your house to stay cool while you're at work. Use the air conditioner in just one or two rooms where you spend the most time. Close the doors in the air conditioned rooms to keep the cool air inside. Cool off in other ways. Take a cool shower in the heat of the day, go to the pool, or spend time under a shade tree. Try to limit your use of the air conditioner to just a few hours a day."
        },
        {
          "headline":"Keep your house a few degrees cooler in the winter.",
          "description":"Heating a home is another big energy drain. It's possible to reduce the amount of energy you use by simply lowering the thermostat by a few degrees in the winter. Keep warm by wearing multiple layers of clothing and  throw blankets over you."
        },
        {
          "headline":"Insulate your house.",
          "description":"Keeping the cool or warm air in, depending on the season, is an important way to save energy. If a window gets left open, your air conditioner or furnace has to go into overdrive to keep things at a steady temperature. Hire a contractor to take a look at your home and determine whether better insulation is required around the basement, foundation, attic, and other areas. Use caulk and seals to seal the cracks around your doors and windows. Use plastic sheeting over your windows during the winter to keep drafty air out of the house."
        },
        {
          "headline":"Use less hot water.",
          "description":"Taking shorter, cooler showers reduces the amount of water your water heater needs to heat on a daily basis. Washing your clothes on the cold setting is another way to avoid using too much hot water."
        }
      ]
    }
  ],
  "text":" Rethinking Lighting Create a \"bright room\" in your household. When the sun goes down, turn on the lights in just one central room in your house, and encourage your family to spend the evening hours there instead of scattering around the house and lighting up every room. Lighting just one room will save a lot of energy and money over time. Replace electric lights with candles. Conserving energy means taking a new approach to everyday conveniences we take for granted, like the ability to flip on all the lights and keep them burning all night long. You don't have to completely stop using electric lights, but using candles instead a few nights per week is a great way to save energy and provide inspiration for reevaluating your approach to energy. In addition to these practical reasons for turning out the lights, breaking out the candles provides an instant atmosphere of either romance or spooky fun, depending upon who else is around to enjoy it. Start by choosing just one night a week to use candles instead of electric lights. Stock up on sturdy, slow-burning candles that will cast a fair amount of light for several hours. On \"candle night,\" try to do activities that don't require electricity, such as telling stories or reading by candlelight. Be sure to store your candles and matches in a safe place when they are not in use. Embrace natural light. During the day, think of the sun as your primary light source, and rearrange your home or workplace to take advantage of its rays. Open the shades or blinds and let the light pour in instead of automatically flipping on the overhead switch. If you work in an office, try to arrange your desk so that it's lit by natural light, so you won't have to use a desk lamp or  overhead lighting. In your home, set up your family's main daytime activity area in the brightest room that gets the best sunlight. Drawing, reading, using the computer, and other activities that require good lighting can take place in this room without the need for electric lights. Replace your incandescent light bulbs. These old-fashioned light bulbs burn off most of their energy as heat instead of producing light. Replace them with compact fluorescent bulbs or LED bulbs, both of which are much more energy efficient. Compact fluorescent bulbs use about 1/4 the energy of incandescent bulbs. They're made with a small amount of mercury, though, so be sure you dispose of them properly when they burn out. LED bulbs are more expensive than the other types, but they last longer and they don't contain mercury. Minimize your use of outside lights. A lot of people don't think about how much energy is being used by porch lights or path lights that stay on all night long. Decide whether it's really necessary to leave the lights on past your bedtime. If you want outside lights for security purposes, consider buying an automatic light that operates using a motion detector, rather than one that burns constantly. Turn off decorative holiday lights before you go to bed, rather than waiting until morning. Replace path and garden lights  that charge during the day and glow warmly at night. Reducing Use of Appliances Decide which appliances you really need to use. Your first impulse might be to say, \"I need them all.\" However, you'd be surprised how much energy you can save by reducing your use of appliances, and how much satisfaction comes from being self-reliant. Consider changing your habits regarding the following energy-sapping appliances:\nThe dryer. If you have access to outside space, hang a clothesline and start drying your clothes outside. You can also get a drying rack to use indoors - just place it in your bedroom or bathroom near a window. If you must continue using the dryer, reduce your usage to once a week or so, rather than throwing in small loads every other day. The dishwasher. Make sure each load you do is completely full. If you have time to wash dishes by hand using the  water conservation method, that's even better. The oven. Heating an electric oven requires a lot of energy. Plan to do all of your baking on one day of the week, while the oven is hot, instead of heating it every few days for various purposes. The vacuum. Sweep whenever you can instead of using a vacuum. Even a carpet can be swept between vacuuming sessions to remove larger pieces of debris. Unplug everything. Electronics and appliances continue sapping energy while they're plugged in, even when they're switched to \"off.\" Make a habit of unplugging everything that's not in use, especially computers, TVs and sound systems, which use up the most energy. Don't forget small appliances like coffee makers, hair dryers and phone chargers. Determine whether it's really necessary to keep plug-in air fresheners and night lights. Replace old appliances with newer models. Older appliances weren't always designed with energy conservation in mind. If you have an older refrigerator, dishwasher, oven, or dryer, you may be using more energy (and paying more money) than strictly necessary for the chores you need to do. Conduct research to find newer models that are more energy efficient. Handling Heating and Cooling Efficiently Turn off the air conditioner. Conserving energy sometimes requires making small sacrifices, and getting more familiar with the heat of summer is one of them. Leaving the air conditioner on all the time is a great way to use loads of energy and keep your electricity bills high. Turn off the air conditioner when you aren't home. There's no reason for your house to stay cool while you're at work. Use the air conditioner in just one or two rooms where you spend the most time. Close the doors in the air conditioned rooms to keep the cool air inside. Cool off in other ways. Take a cool shower in the heat of the day, go to the pool, or spend time under a shade tree. Try to limit your use of the air conditioner to just a few hours a day. Keep your house a few degrees cooler in the winter. Heating a home is another big energy drain. It's possible to reduce the amount of energy you use by simply lowering the thermostat by a few degrees in the winter. Keep warm by wearing multiple layers of clothing and  throw blankets over you. Insulate your house. Keeping the cool or warm air in, depending on the season, is an important way to save energy. If a window gets left open, your air conditioner or furnace has to go into overdrive to keep things at a steady temperature. Hire a contractor to take a look at your home and determine whether better insulation is required around the basement, foundation, attic, and other areas. Use caulk and seals to seal the cracks around your doors and windows. Use plastic sheeting over your windows during the winter to keep drafty air out of the house. Use less hot water. Taking shorter, cooler showers reduces the amount of water your water heater needs to heat on a daily basis. Washing your clothes on the cold setting is another way to avoid using too much hot water.",
  "tyn_model":[
    "candles",
    "air conditioner",
    "appliances",
    "oven",
    "compact fluorescent bulbs",
    "dryer",
    "vacuum",
    "water",
    "matches",
    "incandescent light bulbs",
    "incandescent bulbs",
    "drying rack",
    "dishwasher",
    "air fresheners",
    "refrigerator",
    "blankets",
    "furnace",
    "contractor",
    "insulation",
    "caulk",
    "water heater"
  ],
  "tyn_section":[

  ]
}