{
  "title":"How to Make Fruity Pebble Ice Cream Sandwiches",
  "url":"https://www.wikihow.com/Make-Fruity-Pebble-Ice-Cream-Sandwiches",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts"
  ],
  "parts":[
    {
      "name":"Making the Vanilla Ice Cream",
      "steps":[
        {
          "headline":"Beat together the half and half with the heavy cream.",
          "description":"In a large bowl, beat the two ingredients together with a whisk until well combined."
        },
        {
          "headline":"Pour in the sugar and vanilla extract.",
          "description":"Mix once more with the whisk."
        },
        {
          "headline":"Cover the bowl with plastic wrap and chill.",
          "description":"Let the mixture chill for about 3 hours until cold. The mixture can also stay longer if you wish to make the ice cream later. It can last up to 3 days covered in the fridge."
        },
        {
          "headline":"Pour the ice cream mixture into an ice cream machine.",
          "description":"Make the ice cream according to the manufacturer's directions. Place the finished ice cream into a large, freezer-proof bowl."
        },
        {
          "headline":"Freeze the ice cream for about 2-3 hours.",
          "description":"Depending on your freezer's temperature, the ice cream may need to freeze longer, or it may freeze quicker on a shorter time limit. To keep the ice cream smooth and creamy, stir the mixture every 30 minutes with a spoon."
        }
      ]
    },
    {
      "name":"Making the Fruity Pebble Patties",
      "steps":[
        {
          "headline":"Spray non-stick cooking spray or coat a small amount of melted butter over a baking sheet using a pastry brush..",
          "description":""
        },
        {
          "headline":"Place a large saucepan on a stovetop preheated to low heat.",
          "description":""
        },
        {
          "headline":"Add the butter to the pan and mix slowly for 3-4 minutes.",
          "description":"Continue mixing until the butter fully melts."
        },
        {
          "headline":"Pour in the marshmallows and stir once more.",
          "description":"Mix for about 2-3 minutes, until the mixture is completely smooth and creamy. Remove from heat once the marshmallows have fully melted."
        },
        {
          "headline":"Fold in the Fruity Pebbles and stir once more.",
          "description":"The mixture should be incorporated properly and well-coated."
        },
        {
          "headline":"Spread the Fruity Pebble mixture onto the baking sheet.",
          "description":"Pat it down firmly with a spatula or another similar utensil, making it ½-inch thick. Leave it cool for about 20 minutes."
        },
        {
          "headline":"Cut out circles from the layer.",
          "description":"Using a cookie cutter, punch out 8 medium-sized circles from the Fruit Pebble layer. Set them aside. Depending on your cookie cutter size, you may get less or more Fruity Pebble patties."
        },
        {
          "headline":"Make the ice cream sandwiches.",
          "description":"Scoop and place vanilla ice cream onto a Fruity Pebble pattie. Close with another to create an ice cream sandwich. Repeat until there are no more patties."
        },
        {
          "headline":"Serve.",
          "description":"Place the ice cream sandwiches on a serving plate and eat right away. Enjoy!"
        }
      ]
    }
  ],
  "text":" Making the Vanilla Ice Cream Beat together the half and half with the heavy cream. In a large bowl, beat the two ingredients together with a whisk until well combined. Pour in the sugar and vanilla extract. Mix once more with the whisk. Cover the bowl with plastic wrap and chill. Let the mixture chill for about 3 hours until cold. The mixture can also stay longer if you wish to make the ice cream later. It can last up to 3 days covered in the fridge. Pour the ice cream mixture into an ice cream machine. Make the ice cream according to the manufacturer's directions. Place the finished ice cream into a large, freezer-proof bowl. Freeze the ice cream for about 2-3 hours. Depending on your freezer's temperature, the ice cream may need to freeze longer, or it may freeze quicker on a shorter time limit. To keep the ice cream smooth and creamy, stir the mixture every 30 minutes with a spoon. Making the Fruity Pebble Patties Spray non-stick cooking spray or coat a small amount of melted butter over a baking sheet using a pastry brush..  Place a large saucepan on a stovetop preheated to low heat.  Add the butter to the pan and mix slowly for 3-4 minutes. Continue mixing until the butter fully melts. Pour in the marshmallows and stir once more. Mix for about 2-3 minutes, until the mixture is completely smooth and creamy. Remove from heat once the marshmallows have fully melted. Fold in the Fruity Pebbles and stir once more. The mixture should be incorporated properly and well-coated. Spread the Fruity Pebble mixture onto the baking sheet. Pat it down firmly with a spatula or another similar utensil, making it ½-inch thick. Leave it cool for about 20 minutes. Cut out circles from the layer. Using a cookie cutter, punch out 8 medium-sized circles from the Fruit Pebble layer. Set them aside. Depending on your cookie cutter size, you may get less or more Fruity Pebble patties. Make the ice cream sandwiches. Scoop and place vanilla ice cream onto a Fruity Pebble pattie. Close with another to create an ice cream sandwich. Repeat until there are no more patties. Serve. Place the ice cream sandwiches on a serving plate and eat right away. Enjoy!",
  "tyn_model":[
    "ice cream",
    "butter",
    "vanilla ice cream",
    "whisk",
    "baking sheet",
    "cookie cutter",
    "heavy cream",
    "large bowl",
    "sugar",
    "vanilla extract",
    "plastic wrap",
    "ice cream machine",
    "spoon",
    "non-stick cooking spray",
    "pastry brush",
    "large saucepan",
    "stovetop preheated",
    "marshmallows",
    "fruity pebbles",
    "fruity pebble",
    "spatula",
    "serving plate"
  ],
  "tyn_section":[

  ]
}