{
  "title":"How to Draw Accurate Human Body Proportions",
  "url":"https://www.wikihow.com/Draw-Accurate-Human-Body-Proportions",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing People",
    "Drawing the Body"
  ],
  "steps":[
    {
      "headline":"Draw 7 circles of about the same size.",
      "description":"These will be your guidelines."
    },
    {
      "headline":"Draw an oval parallel to the topmost circle.",
      "description":"This will be the head."
    },
    {
      "headline":"Halfway down the second circle from the top, add a horizontal line.",
      "description":"This is where the shoulder stops."
    },
    {
      "headline":"Halfway down the third circle, draw another horizontal line.",
      "description":"This is where the waist will be, and also where the elbows end."
    },
    {
      "headline":"Halfway down the fourth circle, end the torso.",
      "description":""
    },
    {
      "headline":"Halfway down the fifth circle, end the fingertips.",
      "description":"Draw the beginning of the wrists about where the torso ends."
    },
    {
      "headline":"Just past the top of the sixth circle, end the knees.",
      "description":""
    },
    {
      "headline":"Finish the bottom of the feet where the last circle ends.",
      "description":"That's it!"
    }
  ],
  "text":" Draw 7 circles of about the same size. These will be your guidelines. Draw an oval parallel to the topmost circle. This will be the head. Halfway down the second circle from the top, add a horizontal line. This is where the shoulder stops. Halfway down the third circle, draw another horizontal line. This is where the waist will be, and also where the elbows end. Halfway down the fourth circle, end the torso.  Halfway down the fifth circle, end the fingertips. Draw the beginning of the wrists about where the torso ends. Just past the top of the sixth circle, end the knees.  Finish the bottom of the feet where the last circle ends. That's it!",
  "tyn_model":[
    "fingertips"
  ],
  "tyn_section":[

  ]
}