{
  "title":"How to Make Omelet without Egg",
  "url":"https://www.wikihow.com/Make-Omelet-without-Egg",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Omelets"
  ],
  "methods":[
    {
      "name":"Basic Egg-Free Omelet",
      "steps":[
        {
          "headline":"Remove the firm silken tofu from the package.",
          "description":"Drain the tofu and pat dry carefully."
        },
        {
          "headline":"Preheat the oven to 190ºC/375ºF.",
          "description":""
        },
        {
          "headline":"Cut the vegetables into small sizes in readiness for use in the omelet.",
          "description":""
        },
        {
          "headline":"Place the pan on the stove-top.",
          "description":"Warm over a medium heat. Add the olive oil and garlic to the warmed pan. Cook for 1 to 2 minutes."
        },
        {
          "headline":"Place the cooked garlic into the food processor.",
          "description":"Add the tofu, hummus, nutritional yeast and cornstarch or arrowroot powder to the processor. Add the paprika and salt and pepper. Blend everything to combine. If water is needed, add no more than 1 to 2 tablespoons. Set to one side."
        },
        {
          "headline":"Add olive oil to the pan.",
          "description":"Add the chopped vegetables and season with salt and pepper. Gently cook to soften. Remove from the heat and tip the vegetables into a bowl."
        },
        {
          "headline":"Add more olive oil to the pan.",
          "description":"Add the batter to the pan. Tip in 1/4 of the cooked vegetables. Spread the batter across the pan using a wooden spoon or spatula. Aim to spread it thinly without breaking it."
        },
        {
          "headline":"Cook for 5 minutes on the stove-top.",
          "description":"Then transfer to the preheated oven and bake for 10 to 15 minutes. The omelet should change to a golden brown color. The omelet will be moister at 10 minutes and drier at 15 minutes, adjust cooking time to suit your preference."
        },
        {
          "headline":"Drop the remaining vegetables onto the omelet toward the end.",
          "description":"Cook for another 1 to 2 minutes. Wear an oven mitt before adding the vegetables."
        },
        {
          "headline":"Remove from the oven.",
          "description":"Use a spatula to flip the omelet over into a half moon shape. It can be served as one omelet, or cut into slices or cut in half to share."
        },
        {
          "headline":"Serve.",
          "description":"Add fresh herbs and sauce, as desired."
        }
      ]
    },
    {
      "name":"Potato Egg-Free Omelet",
      "steps":[
        {
          "headline":"Peel and grate the potatoes.",
          "description":"Mix the grated potato with the flour."
        },
        {
          "headline":"Add soy milk and stir through to form the omelet batter.",
          "description":""
        },
        {
          "headline":"Chop the chives and garlic.",
          "description":"Add to the omelet batter."
        },
        {
          "headline":"Add salt and pepper to taste.",
          "description":"Mix through. The batter is now ready for cooking."
        },
        {
          "headline":"Add the margarine or oil to the frying pan.",
          "description":"Heat it up gently, the add the omelet batter."
        },
        {
          "headline":"Spread across the pan using the back of a wooden spoon or spatula.",
          "description":"Be careful not to let it stick as it cooks."
        },
        {
          "headline":"Flip the omelet over when the first side cooked begins to turn golden.",
          "description":"Cook the other side until it too turns golden."
        },
        {
          "headline":"Remove from the heat.",
          "description":"Flip or slide the vegan omelet out and onto a serving plate."
        },
        {
          "headline":"Cut the omelet into two for two servings.",
          "description":"Or, keep as one omelet and have as a single meal."
        }
      ]
    }
  ],
  "text":" Basic Egg-Free Omelet Remove the firm silken tofu from the package. Drain the tofu and pat dry carefully. Preheat the oven to 190ºC/375ºF.  Cut the vegetables into small sizes in readiness for use in the omelet.  Place the pan on the stove-top. Warm over a medium heat. Add the olive oil and garlic to the warmed pan. Cook for 1 to 2 minutes. Place the cooked garlic into the food processor. Add the tofu, hummus, nutritional yeast and cornstarch or arrowroot powder to the processor. Add the paprika and salt and pepper. Blend everything to combine. If water is needed, add no more than 1 to 2 tablespoons. Set to one side. Add olive oil to the pan. Add the chopped vegetables and season with salt and pepper. Gently cook to soften. Remove from the heat and tip the vegetables into a bowl. Add more olive oil to the pan. Add the batter to the pan. Tip in 1/4 of the cooked vegetables. Spread the batter across the pan using a wooden spoon or spatula. Aim to spread it thinly without breaking it. Cook for 5 minutes on the stove-top. Then transfer to the preheated oven and bake for 10 to 15 minutes. The omelet should change to a golden brown color. The omelet will be moister at 10 minutes and drier at 15 minutes, adjust cooking time to suit your preference. Drop the remaining vegetables onto the omelet toward the end. Cook for another 1 to 2 minutes. Wear an oven mitt before adding the vegetables. Remove from the oven. Use a spatula to flip the omelet over into a half moon shape. It can be served as one omelet, or cut into slices or cut in half to share. Serve. Add fresh herbs and sauce, as desired. Potato Egg-Free Omelet Peel and grate the potatoes. Mix the grated potato with the flour. Add soy milk and stir through to form the omelet batter.  Chop the chives and garlic. Add to the omelet batter. Add salt and pepper to taste. Mix through. The batter is now ready for cooking. Add the margarine or oil to the frying pan. Heat it up gently, the add the omelet batter. Spread across the pan using the back of a wooden spoon or spatula. Be careful not to let it stick as it cooks. Flip the omelet over when the first side cooked begins to turn golden. Cook the other side until it too turns golden. Remove from the heat. Flip or slide the vegan omelet out and onto a serving plate. Cut the omelet into two for two servings. Or, keep as one omelet and have as a single meal.",
  "tyn_model":[
    "vegetables",
    "tofu",
    "oven",
    "olive oil",
    "garlic",
    "spatula",
    "stove-",
    "salt and pepper",
    "wooden spoon",
    "food processor",
    "nutritional yeast",
    "cornstarch or",
    "arrowroot powder",
    "processor",
    "paprika",
    "bowl",
    "oven mitt",
    "fresh herbs",
    "potato egg-free omelet",
    "potatoes",
    "potato",
    "flour",
    "soy milk",
    "chives",
    "salt",
    "pepper",
    "margarine",
    "oil",
    "frying pan",
    "serving plate"
  ],
  "tyn_section":[

  ]
}