{
  "title":"How to Make Mint Chip Ice Cream",
  "url":"https://www.wikihow.com/Make-Mint-Chip-Ice-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts"
  ],
  "steps":[
    {
      "headline":"Heat the sugar, heavy cream, mint leaves or extract and salt in a medium saucepan on low.",
      "description":""
    },
    {
      "headline":"Wait until the mixture is steaming hot, then allow to cool for one hour.",
      "description":""
    },
    {
      "headline":"Use a strainer to take out the mint, and press down using a spatula for the best mint flavor and color.",
      "description":"Then throw the mint away."
    },
    {
      "headline":"Take the heavy cream and pour it into a big bowl.",
      "description":"Put the strainer above the top."
    },
    {
      "headline":"Heat the milk again, beat the egg yolks with a whisk, and pour in the mint mix.",
      "description":"Continue beating with a whisk and scrape yolks in the saucepan again."
    },
    {
      "headline":"Cook the entire mixture.",
      "description":"Use a heat-resistant spatula to stir it, and wait for the mixture to be thick and for the spatula to coat it. A thermometer should read a temperature of 170 degrees Fahrenheit, or 77 degrees Celsius."
    },
    {
      "headline":"Instantly use a strainer to place the mixture into the cream (meaning strain it).",
      "description":"Take an ice bath and stir the mixture there to cool it down."
    },
    {
      "headline":"Refrigerate overnight, and then place the mixture into the ice cream maker for freezing.",
      "description":"While the mixture is freezing, make the chocolate chips! Take a little bowl and simmer water in a pot, or put the chocolate bowl in the microwave, and stir until it smoothens."
    },
    {
      "headline":"Wait for the ice cream to be ready, then get some of the chocolate in the container.",
      "description":"Get a layer of the ice cream that was churned, and drizzle the melted chocolate over it, and stir it in. Break the chocolate into pieces known as chocolate chips, and keep layering. \"Scribble\" more of the chocolate and stir."
    },
    {
      "headline":"Serve and enjoy!",
      "description":""
    }
  ],
  "text":" Heat the sugar, heavy cream, mint leaves or extract and salt in a medium saucepan on low.  Wait until the mixture is steaming hot, then allow to cool for one hour.  Use a strainer to take out the mint, and press down using a spatula for the best mint flavor and color. Then throw the mint away. Take the heavy cream and pour it into a big bowl. Put the strainer above the top. Heat the milk again, beat the egg yolks with a whisk, and pour in the mint mix. Continue beating with a whisk and scrape yolks in the saucepan again. Cook the entire mixture. Use a heat-resistant spatula to stir it, and wait for the mixture to be thick and for the spatula to coat it. A thermometer should read a temperature of 170 degrees Fahrenheit, or 77 degrees Celsius. Instantly use a strainer to place the mixture into the cream (meaning strain it). Take an ice bath and stir the mixture there to cool it down. Refrigerate overnight, and then place the mixture into the ice cream maker for freezing. While the mixture is freezing, make the chocolate chips! Take a little bowl and simmer water in a pot, or put the chocolate bowl in the microwave, and stir until it smoothens. Wait for the ice cream to be ready, then get some of the chocolate in the container. Get a layer of the ice cream that was churned, and drizzle the melted chocolate over it, and stir it in. Break the chocolate into pieces known as chocolate chips, and keep layering. \"Scribble\" more of the chocolate and stir. Serve and enjoy! ",
  "tyn_model":[
    "chocolate",
    "strainer",
    "spatula",
    "heavy cream",
    "whisk",
    "chocolate chips",
    "ice cream",
    "sugar",
    "mint leaves or extract",
    "salt",
    "medium saucepan",
    "bowl",
    "milk",
    "saucepan",
    "cream",
    "ice bath",
    "ice cream maker",
    "water",
    "chocolate bowl",
    "microwave"
  ],
  "tyn_section":[

  ]
}