{
  "title":"How to Make \"Macarrones Con Salsa Roja y Champiñones\" (Macaroons with Red Sauce and Mushrooms)",
  "url":"https://www.wikihow.com/Make-%22Macarrones-Con-Salsa-Roja-y-Champi%C3%B1ones%22-(Macaroons-with-Red-Sauce-and-Mushrooms)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "steps":[
    {
      "headline":"Cook the macaroons, with a lot of water boiled with salt and a little oil, for approximately 12 minutes.",
      "description":"Cook until the pasta remains al dente."
    },
    {
      "headline":"Remove the pot from the fire and drain the pasta.",
      "description":""
    },
    {
      "headline":"Place the butter in the olive oil in another skillet.",
      "description":""
    },
    {
      "headline":"Add the onion and let the mixture cook until it browns.",
      "description":""
    },
    {
      "headline":"Add the tomatoes, the red wine and the oregano.",
      "description":"Later, add spices like salt and paper. Let cook at medium heat for 10 minutes."
    },
    {
      "headline":"Add the mushrooms and let cook for at least four minutes.",
      "description":""
    },
    {
      "headline":"After finishing the process, return the salsa to the fire and add the crema de leche.",
      "description":""
    },
    {
      "headline":"Add the macaroons and mix them for a minute, or until the salsa is covered.",
      "description":""
    },
    {
      "headline":"Serve and sprinkle with parmesan cheese.",
      "description":""
    }
  ],
  "text":" Cook the macaroons, with a lot of water boiled with salt and a little oil, for approximately 12 minutes. Cook until the pasta remains al dente. Remove the pot from the fire and drain the pasta.  Place the butter in the olive oil in another skillet.  Add the onion and let the mixture cook until it browns.  Add the tomatoes, the red wine and the oregano. Later, add spices like salt and paper. Let cook at medium heat for 10 minutes. Add the mushrooms and let cook for at least four minutes.  After finishing the process, return the salsa to the fire and add the crema de leche.  Add the macaroons and mix them for a minute, or until the salsa is covered.  Serve and sprinkle with parmesan cheese. ",
  "tyn_model":[
    "salt",
    "oil",
    "pot",
    "butter",
    "olive oil",
    "skillet",
    "onion",
    "tomatoes",
    "red wine",
    "oregano",
    "mushrooms",
    "salsa",
    "macaroons",
    "parmesan cheese"
  ],
  "tyn_section":[

  ]
}