{
  "title":"How to Make a Flax Egg",
  "url":"https://www.wikihow.com/Make-a-Flax-Egg",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan",
    "Vegan Baking"
  ],
  "methods":[
    {
      "name":"Making a Basic Flax Egg",
      "steps":[
        {
          "headline":"Grind the flax seeds.",
          "description":"You can do this in a blender, coffee grinder, or a spice grinder. It is best if you grind the seeds yourself rather than buying pre-ground seeds from the store. This is because flax seeds release oils as soon as you grind them; these oils are perishable and go rancid over time."
        },
        {
          "headline":"Measure out 1 tablespoon (10 grams) of ground flax seed.",
          "description":"Place the flax seeds into a small bowl or cup. If you have any ground flax seeds left over, place them into an airtight container, then store them in the freezer to preserve them."
        },
        {
          "headline":"Add 3 tablespoons (45 milliliters) of warm water.",
          "description":"Give the mixture a quick stir with a fork or mini whisk. Don't worry if it looks watery or soupy at this point. The mixture will thicken up. Warm water will speed up the gelling process. If you don't have warm water, you can use cool water, but it will take longer."
        },
        {
          "headline":"Allow the mixture to sit until it thickens.",
          "description":"This will take 10 to 15 minutes—if you are using warm water. The ground flax seeds will become gloopy, sort of like a real egg."
        },
        {
          "headline":"Use the flax egg.",
          "description":"This recipe makes one flax egg, which is equal to one chicken egg. They aren't good for frying, but you can use them in other recipes, such as pancakes or muffins."
        }
      ]
    },
    {
      "name":"Making Simmered Flax Eggs",
      "steps":[
        {
          "headline":"Grind the flax seeds in a blender, coffee grinder, or spice grinder.",
          "description":"Don't use pre-ground flax seeds from the store. When ground, flax seeds release oils, which start to perish immediately."
        },
        {
          "headline":"Measure the flax seeds into a small saucepan.",
          "description":"You will need 1 tablespoon (10 grams) of ground flax seeds for every egg you plan on making. Because you will be cooking this recipe, it would be more convenient to make larger amounts. If you have any ground flax seeds left over, place them into an airtight container, then store it in the freezer. This will preserve the oils and keep them from going rancid."
        },
        {
          "headline":"Stir in some water.",
          "description":"You will need 2 to 3 tablespoons (30 to 45 milliliters) of water for each egg you are making. If you are making more flax eggs, you will need to use more water."
        },
        {
          "headline":"Simmer the mixture until the ground flax seeds thicken.",
          "description":"This will take about 5 minutes. It may take less time if you are making just one egg, and it may take more if you are making several eggs."
        },
        {
          "headline":"Allow the flax egg(s) to cool before using it in your recipe.",
          "description":"If you made several flax eggs, use 4 tablespoons (40 grams) of the mixture for each egg you plan on using. Store the rest of the eggs in the fridge for up to 2 weeks. If you have a large ice cube tray or mini containers, you can divide the mixture up into individual portions."
        }
      ]
    },
    {
      "name":"Making Flax Gel Eggs",
      "steps":[
        {
          "headline":"Measure the flax seeds and water into a small saucepan.",
          "description":"You will need 5 tablespoons (50 grams) of whole flax seeds (not ground) and 3 cups (700 milliliters) of water. Stir the two together using a whisk."
        },
        {
          "headline":"Bring the mixture to a boil, then cook it for 20 to 25 minutes.",
          "description":"Bring the mixture to a boil over medium-high heat first. Once it starts to boil, reduce the heat to a low boil, then allow it to cook for 20 to 25 minutes. You are ready for the next step when the flax seeds turn gelatinous and stringy. Do not cover the saucepan at any point during this step."
        },
        {
          "headline":"Strain the mixture into a bowl.",
          "description":"Place a fine, mesh strainer into a bowl. Pour the hot mixture through the strainer and into the bowl. Scrape the strainer with a rubber spatula to help the mixture drain faster. The mesh needs to be woven tight enough so that the seeds don't fall through."
        },
        {
          "headline":"Discard the seeds and allow the gel to cool.",
          "description":"If you need to, you can pour the gel into a smaller container first. It will take about 1 hour for it to cool at room temperature, but you can speed up the process by placing it into the refrigerator."
        },
        {
          "headline":"Use the flax gel egg.",
          "description":"You will need 3 tablespoons (45 milliliters) of flax gel for every egg you will be replacing in your recipe. You can mix the flax gel egg into the liquid ingredients of you recipe. Do not mix it into oil ingredients, however. Store left over flax gel eggs in an airtight container in the fridge for up to 1 week. Measure out 3-tablespoon (45-milliliter) portions into a large ice cube tray, and freeze the gel for up to 3 months."
        }
      ]
    }
  ],
  "text":" Making a Basic Flax Egg Grind the flax seeds. You can do this in a blender, coffee grinder, or a spice grinder. It is best if you grind the seeds yourself rather than buying pre-ground seeds from the store. This is because flax seeds release oils as soon as you grind them; these oils are perishable and go rancid over time. Measure out 1 tablespoon (10 grams) of ground flax seed. Place the flax seeds into a small bowl or cup. If you have any ground flax seeds left over, place them into an airtight container, then store them in the freezer to preserve them. Add 3 tablespoons (45 milliliters) of warm water. Give the mixture a quick stir with a fork or mini whisk. Don't worry if it looks watery or soupy at this point. The mixture will thicken up. Warm water will speed up the gelling process. If you don't have warm water, you can use cool water, but it will take longer. Allow the mixture to sit until it thickens. This will take 10 to 15 minutes—if you are using warm water. The ground flax seeds will become gloopy, sort of like a real egg. Use the flax egg. This recipe makes one flax egg, which is equal to one chicken egg. They aren't good for frying, but you can use them in other recipes, such as pancakes or muffins. Making Simmered Flax Eggs Grind the flax seeds in a blender, coffee grinder, or spice grinder. Don't use pre-ground flax seeds from the store. When ground, flax seeds release oils, which start to perish immediately. Measure the flax seeds into a small saucepan. You will need 1 tablespoon (10 grams) of ground flax seeds for every egg you plan on making. Because you will be cooking this recipe, it would be more convenient to make larger amounts. If you have any ground flax seeds left over, place them into an airtight container, then store it in the freezer. This will preserve the oils and keep them from going rancid. Stir in some water. You will need 2 to 3 tablespoons (30 to 45 milliliters) of water for each egg you are making. If you are making more flax eggs, you will need to use more water. Simmer the mixture until the ground flax seeds thicken. This will take about 5 minutes. It may take less time if you are making just one egg, and it may take more if you are making several eggs. Allow the flax egg(s) to cool before using it in your recipe. If you made several flax eggs, use 4 tablespoons (40 grams) of the mixture for each egg you plan on using. Store the rest of the eggs in the fridge for up to 2 weeks. If you have a large ice cube tray or mini containers, you can divide the mixture up into individual portions. Making Flax Gel Eggs Measure the flax seeds and water into a small saucepan. You will need 5 tablespoons (50 grams) of whole flax seeds (not ground) and 3 cups (700 milliliters) of water. Stir the two together using a whisk. Bring the mixture to a boil, then cook it for 20 to 25 minutes. Bring the mixture to a boil over medium-high heat first. Once it starts to boil, reduce the heat to a low boil, then allow it to cook for 20 to 25 minutes. You are ready for the next step when the flax seeds turn gelatinous and stringy. Do not cover the saucepan at any point during this step. Strain the mixture into a bowl. Place a fine, mesh strainer into a bowl. Pour the hot mixture through the strainer and into the bowl. Scrape the strainer with a rubber spatula to help the mixture drain faster. The mesh needs to be woven tight enough so that the seeds don't fall through. Discard the seeds and allow the gel to cool. If you need to, you can pour the gel into a smaller container first. It will take about 1 hour for it to cool at room temperature, but you can speed up the process by placing it into the refrigerator. Use the flax gel egg. You will need 3 tablespoons (45 milliliters) of flax gel for every egg you will be replacing in your recipe. You can mix the flax gel egg into the liquid ingredients of you recipe. Do not mix it into oil ingredients, however. Store left over flax gel eggs in an airtight container in the fridge for up to 1 week. Measure out 3-tablespoon (45-milliliter) portions into a large ice cube tray, and freeze the gel for up to 3 months.",
  "tyn_model":[
    "water",
    "airtight container",
    "bowl",
    "strainer",
    "blender",
    "coffee grinder",
    "spice grinder",
    "flax egg",
    "small saucepan",
    "flax gel eggs",
    "flax gel egg",
    "flax seeds",
    "ground flax seed",
    "flax",
    "fork",
    "mini whisk",
    "—if",
    "ground flax seeds",
    "freezer",
    "eggs",
    "ice cube tray",
    "whisk",
    "saucepan",
    "rubber spatula",
    "refrigerator",
    "flax gel",
    "large ice cube tray"
  ],
  "tyn_section":[

  ]
}