{
  "title":"How to Substitute Spelt Flour for All‐Purpose Flour",
  "url":"https://www.wikihow.com/Substitute-Spelt-Flour-for-All%E2%80%90Purpose-Flour",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Making the Basic Substitution",
      "steps":[
        {
          "headline":"Use white spelt flour instead of all-purpose flour.",
          "description":"Spelt flour is available in two varieties: white and whole. White spelt flour has the bran and germ removed so it will provide a lighter texture in baked goods. As a result, it’s the best substitute for all-purpose flour in your favorite recipes. You can usually find white spelt flour at natural food stores and the organic section of traditional grocery stores."
        },
        {
          "headline":"Reduce liquids by ¼. Spelt flour is more water soluble than all-purpose flour.",
          "description":"That means you don’t need to mix as much liquid into your recipes if you’re substituting spelt. Reducing the amount of liquid ingredients in the recipe by ¼ usually provides the best results. If you’re making a recipe with a liquid that’s hard to reduce, you can increase the amount of flour than you use instead. For example, if you need to add whole eggs, increase the spelt flour by 10 to 15% instead of reducing the amount of the eggs."
        },
        {
          "headline":"Mix the dough or batter lightly.",
          "description":"The gluten in spelt flour is different than the gluten in all-purpose flour, so it’s important to handle the dough or batter you make with it accordingly. All-purpose flour can be kneaded or mixed for a long time, but if you overmix spelt batters or doughs, you can wind up with crumbly baked goods. Knead or mix until the dough or batter is just combined."
        }
      ]
    },
    {
      "name":"Adjusting the Amounts",
      "steps":[
        {
          "headline":"Start with just ¼ spelt flour to test.",
          "description":"When you’re beginning to experiment with spelt flour substitution, it’s best to ease your way into it. Replace just ¼ of the all-purpose flour in your recipe with spelt and use all-purpose flour for the remaining ¾ to see how the finished product turns out. You can gradually begin to increase the amount of spelt when you know how it will affect the recipe. If you’re only using ¼ spelt flour for a recipe, you don’t necessarily have to reduce the amount of liquid. See how the final product turns out before deciding if you have to adjust the liquids."
        },
        {
          "headline":"Use 100% spelt flour for pancakes.",
          "description":"For pancakes, you can make a 1 for 1 substitution with spelt and all-purpose flour. The spelt will give the pancakes a rich, sweet whole wheat flavor, while still creating a moist, fluffy texture. If you’re doing a 1 for 1 substitution with spelt in your pancakes, be sure to reduce the liquids by ¼."
        },
        {
          "headline":"Use half spelt and half all-purpose for cookies, muffins, and breads.",
          "description":"With baked goods like cookies, muffins, or sweetbreads, having a moist, soft texture is important. Instead of using a 1 for 1 substitution with spelt and all-purpose flour, you’re better off using half spelt and half all-purpose. That will keep them from being too crumbly. It usually isn't necessary to reduce the liquid in a recipe if you're using half spelt and half all-purpose flour."
        },
        {
          "headline":"Opt for 50% spelt flour with yeast breads.",
          "description":"If you’re making a delicious yeast bread, using all spelt flour in place of all-purpose can lead to dry bread that has a pronounced whole wheat flavor. Using half spelt flour instead keeps the bread moist and provides a sweet, mild flavor. You don't have to reduce the liquid if you're only using 50% spelt flour in your yeast bread recipe."
        }
      ]
    },
    {
      "name":"Getting the Best Results",
      "steps":[
        {
          "headline":"Sift spelt flour.",
          "description":"White spelt flour is less refined than whole spelt. As a result, it’s a good idea to sift it before mixing it into your recipes as a substitution for all-purpose flour. That will help break up any lumps and remove any chunks of bran."
        },
        {
          "headline":"Weigh spelt flour for accurate measurements.",
          "description":"Spelt flour often weighs differently than all-purpose flour, so using a cup of spelt may not necessarily weigh the same as all-purpose. To be sure that you get the proper amounts, weigh the spelt flour on a food scale before adding it to a recipe. 1 cup of white spelt flour contains 102 grams, while 1 cup of all-purpose flour contains 125 grams."
        },
        {
          "headline":"Add baking powder for self raising flour.",
          "description":"Spelt flour doesn’t allow baked goods to rise all that much. If you are replacing self-rising all purpose flour in recipe, mix in ¾ teaspoon (3 g) of baking powder for every cup (102 g) of spelt flour that you’re using to get a good rise."
        }
      ]
    }
  ],
  "text":" Making the Basic Substitution Use white spelt flour instead of all-purpose flour. Spelt flour is available in two varieties: white and whole. White spelt flour has the bran and germ removed so it will provide a lighter texture in baked goods. As a result, it’s the best substitute for all-purpose flour in your favorite recipes. You can usually find white spelt flour at natural food stores and the organic section of traditional grocery stores. Reduce liquids by ¼. Spelt flour is more water soluble than all-purpose flour. That means you don’t need to mix as much liquid into your recipes if you’re substituting spelt. Reducing the amount of liquid ingredients in the recipe by ¼ usually provides the best results. If you’re making a recipe with a liquid that’s hard to reduce, you can increase the amount of flour than you use instead. For example, if you need to add whole eggs, increase the spelt flour by 10 to 15% instead of reducing the amount of the eggs. Mix the dough or batter lightly. The gluten in spelt flour is different than the gluten in all-purpose flour, so it’s important to handle the dough or batter you make with it accordingly. All-purpose flour can be kneaded or mixed for a long time, but if you overmix spelt batters or doughs, you can wind up with crumbly baked goods. Knead or mix until the dough or batter is just combined. Adjusting the Amounts Start with just ¼ spelt flour to test. When you’re beginning to experiment with spelt flour substitution, it’s best to ease your way into it. Replace just ¼ of the all-purpose flour in your recipe with spelt and use all-purpose flour for the remaining ¾ to see how the finished product turns out. You can gradually begin to increase the amount of spelt when you know how it will affect the recipe. If you’re only using ¼ spelt flour for a recipe, you don’t necessarily have to reduce the amount of liquid. See how the final product turns out before deciding if you have to adjust the liquids. Use 100% spelt flour for pancakes. For pancakes, you can make a 1 for 1 substitution with spelt and all-purpose flour. The spelt will give the pancakes a rich, sweet whole wheat flavor, while still creating a moist, fluffy texture. If you’re doing a 1 for 1 substitution with spelt in your pancakes, be sure to reduce the liquids by ¼. Use half spelt and half all-purpose for cookies, muffins, and breads. With baked goods like cookies, muffins, or sweetbreads, having a moist, soft texture is important. Instead of using a 1 for 1 substitution with spelt and all-purpose flour, you’re better off using half spelt and half all-purpose. That will keep them from being too crumbly. It usually isn't necessary to reduce the liquid in a recipe if you're using half spelt and half all-purpose flour. Opt for 50% spelt flour with yeast breads. If you’re making a delicious yeast bread, using all spelt flour in place of all-purpose can lead to dry bread that has a pronounced whole wheat flavor. Using half spelt flour instead keeps the bread moist and provides a sweet, mild flavor. You don't have to reduce the liquid if you're only using 50% spelt flour in your yeast bread recipe. Getting the Best Results Sift spelt flour. White spelt flour is less refined than whole spelt. As a result, it’s a good idea to sift it before mixing it into your recipes as a substitution for all-purpose flour. That will help break up any lumps and remove any chunks of bran. Weigh spelt flour for accurate measurements. Spelt flour often weighs differently than all-purpose flour, so using a cup of spelt may not necessarily weigh the same as all-purpose. To be sure that you get the proper amounts, weigh the spelt flour on a food scale before adding it to a recipe. 1 cup of white spelt flour contains 102 grams, while 1 cup of all-purpose flour contains 125 grams. Add baking powder for self raising flour. Spelt flour doesn’t allow baked goods to rise all that much. If you are replacing self-rising all purpose flour in recipe, mix in ¾ teaspoon (3 g) of baking powder for every cup (102 g) of spelt flour that you’re using to get a good rise.",
  "tyn_model":[
    "spelt flour",
    "all-purpose flour",
    "spelt",
    "white spelt flour",
    "eggs",
    "all-purpose",
    "yeast bread",
    "baking powder",
    "natural food stores",
    "flour",
    "whole wheat",
    "baked goods",
    "spelt and all-purpose flour",
    "yeast breads",
    "food scale",
    "all purpose flour"
  ],
  "tyn_section":[

  ]
}