{
  "title":"How to Buy on eBay Without PayPal",
  "url":"https://www.wikihow.com/Buy-on-eBay-Without-PayPal",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "methods":[
    {
      "name":"Paying with a Credit or Debit Card",
      "steps":[
        {
          "headline":"Click \"Buy it now.\"",
          "description":"Select your product as you normally would. Then, click the icon that says \"Buy It Now.\" This will redirect you to a screen that will let you enter payment information."
        },
        {
          "headline":"Register for an account (if necessary).",
          "description":"If you're not registered for eBay, you can quickly create an account by clicking \"register now.\" You enter basic information, such as your name, address, and telephone number. If you'd rather not register, you can also click \"continue as guest.\""
        },
        {
          "headline":"Select the debit/credit card payment option.",
          "description":"After you select your item, you should be presented with different payment options. Instead of clicking the PayPal option, click the option to pay with a debit or credit card."
        },
        {
          "headline":"Enter your information.",
          "description":"You will then be redirected to a screen where you can enter your credit or debit card number. You will also have to enter the billing address, your name, the expiration date, and the card's security code. If your billing and shipping address are different, make sure to specify this so your item is not shipped to the wrong place."
        },
        {
          "headline":"Complete the purchase.",
          "description":"After entering your information, you will be asked to review your order. Make sure all the information you entered is correct and then verify you want to go through with the purchase. Your order should be billed to your credit/debit card."
        }
      ]
    },
    {
      "name":"Paying with a Gift Card or Coupon",
      "steps":[
        {
          "headline":"Click \"Pay Now.\"",
          "description":"Select the item you want as you normally would. Then, click the \"Pay Now\" or \"Buy Now\" icon. If you've won an item in an auction, you would also press \"Pay Now\" or \"Buy Now\" after securing the item."
        },
        {
          "headline":"Click the \"Redeem a Gift Card, certificate, or coupon\" button.",
          "description":"Instead of selecting the button that lets you choose between a debit/credit card and PayPal, click the button that allows you to redeem a gift card, certificate, or coupon. You should be momentarily redirected to a page where you can enter your code."
        },
        {
          "headline":"Enter the code.",
          "description":"Gift cards, certificates, and coupons all come with codes you must enter on the eBay site. Codes will either be emailed to you or printed physically on the back of your card. Enter your code carefully in the box provided and then hit \"redeem.\""
        },
        {
          "headline":"Continue and log into your account.",
          "description":"Click the \"apply\" button followed by the \"continue\" button. If you have not already done so, you will be asked to log into your account. You can also opt to order as a guest if you don't have an account. You can enter your shipping address when ordering as a guest."
        },
        {
          "headline":"Complete your purchase.",
          "description":"Review your information to make sure your shipping address, name, phone number, and other information is correct. Then, click the \"Confirm payment\" button to complete the order."
        }
      ]
    },
    {
      "name":"Troubleshooting Common Problems",
      "steps":[
        {
          "headline":"Pay as a guest if you've used PayPal before.",
          "description":"eBay sometimes defaults to PayPal as your payment if you've used it before on eBay. It's sometimes easier to simply pay as a guest and then enter your card information."
        },
        {
          "headline":"Try clearing your browser's history.",
          "description":"Sometimes, the eBay site will keep redirecting you to the screen where you pay via PayPal even if you request otherwise. If you're having this issue, try clearing your browser history as well as your cookies. This may clear up the issue."
        },
        {
          "headline":"Do not link a PayPal and eBay account.",
          "description":"If you prefer not to use your PayPal account for eBay, do not link your eBay and PayPal account to begin with. If your PayPal is linked to your eBay account, this can sometimes result in PayPal being your default payment option. If you've already linked your PayPal and eBay account, try creating a different eBay account with a new email."
        }
      ]
    }
  ],
  "text":" Paying with a Credit or Debit Card Click \"Buy it now.\" Select your product as you normally would. Then, click the icon that says \"Buy It Now.\" This will redirect you to a screen that will let you enter payment information. Register for an account (if necessary). If you're not registered for eBay, you can quickly create an account by clicking \"register now.\" You enter basic information, such as your name, address, and telephone number. If you'd rather not register, you can also click \"continue as guest.\" Select the debit/credit card payment option. After you select your item, you should be presented with different payment options. Instead of clicking the PayPal option, click the option to pay with a debit or credit card. Enter your information. You will then be redirected to a screen where you can enter your credit or debit card number. You will also have to enter the billing address, your name, the expiration date, and the card's security code. If your billing and shipping address are different, make sure to specify this so your item is not shipped to the wrong place. Complete the purchase. After entering your information, you will be asked to review your order. Make sure all the information you entered is correct and then verify you want to go through with the purchase. Your order should be billed to your credit/debit card. Paying with a Gift Card or Coupon Click \"Pay Now.\" Select the item you want as you normally would. Then, click the \"Pay Now\" or \"Buy Now\" icon. If you've won an item in an auction, you would also press \"Pay Now\" or \"Buy Now\" after securing the item. Click the \"Redeem a Gift Card, certificate, or coupon\" button. Instead of selecting the button that lets you choose between a debit/credit card and PayPal, click the button that allows you to redeem a gift card, certificate, or coupon. You should be momentarily redirected to a page where you can enter your code. Enter the code. Gift cards, certificates, and coupons all come with codes you must enter on the eBay site. Codes will either be emailed to you or printed physically on the back of your card. Enter your code carefully in the box provided and then hit \"redeem.\" Continue and log into your account. Click the \"apply\" button followed by the \"continue\" button. If you have not already done so, you will be asked to log into your account. You can also opt to order as a guest if you don't have an account. You can enter your shipping address when ordering as a guest. Complete your purchase. Review your information to make sure your shipping address, name, phone number, and other information is correct. Then, click the \"Confirm payment\" button to complete the order. Troubleshooting Common Problems Pay as a guest if you've used PayPal before. eBay sometimes defaults to PayPal as your payment if you've used it before on eBay. It's sometimes easier to simply pay as a guest and then enter your card information. Try clearing your browser's history. Sometimes, the eBay site will keep redirecting you to the screen where you pay via PayPal even if you request otherwise. If you're having this issue, try clearing your browser history as well as your cookies. This may clear up the issue. Do not link a PayPal and eBay account. If you prefer not to use your PayPal account for eBay, do not link your eBay and PayPal account to begin with. If your PayPal is linked to your eBay account, this can sometimes result in PayPal being your default payment option. If you've already linked your PayPal and eBay account, try creating a different eBay account with a new email.",
  "tyn_model":[
    "paypal",
    "credit/debit card",
    "gift card"
  ],
  "tyn_section":[

  ]
}