{
  "title":"How to Make a Gluten Free Chiffon Cake",
  "url":"https://www.wikihow.com/Make-a-Gluten-Free-Chiffon-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Sponge Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 325ºF/160ºC.",
      "description":""
    },
    {
      "headline":"Whisk together the flour mix, sugar, baking powder, and salt in a mixing bowl.",
      "description":"Whisking is a very important part of the process, so be sure to do it well."
    },
    {
      "headline":"Make a well in the center and add the oil, unbeaten egg yolks, orange juice, and rind.",
      "description":""
    },
    {
      "headline":"Beat on low speed until blended.",
      "description":""
    },
    {
      "headline":"Turn the mixer to high and beat 5 minutes.",
      "description":""
    },
    {
      "headline":"Beat the egg whites and the cream of tartar in a large bowl with an electric mixer until they form very stiff peaks.",
      "description":""
    },
    {
      "headline":"Pour the batter mixture gradually over the whipped whites, gently folding with a rubber spatula until just blended.",
      "description":""
    },
    {
      "headline":"Pour the batter into a large tube pan or a 9″ x 13″ oblong cake pan.",
      "description":""
    },
    {
      "headline":"Bake the tube pan for 65 minutes or the oblong pan for 45-50 minutes.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 325ºF/160ºC.  Whisk together the flour mix, sugar, baking powder, and salt in a mixing bowl. Whisking is a very important part of the process, so be sure to do it well. Make a well in the center and add the oil, unbeaten egg yolks, orange juice, and rind.  Beat on low speed until blended.  Turn the mixer to high and beat 5 minutes.  Beat the egg whites and the cream of tartar in a large bowl with an electric mixer until they form very stiff peaks.  Pour the batter mixture gradually over the whipped whites, gently folding with a rubber spatula until just blended.  Pour the batter into a large tube pan or a 9″ x 13″ oblong cake pan.  Bake the tube pan for 65 minutes or the oblong pan for 45-50 minutes.  Finished. ",
  "tyn_model":[
    "oven",
    "flour",
    "sugar",
    "baking powder",
    "salt",
    "mixing bowl",
    "oil",
    "orange juice",
    "mixer",
    "cream",
    "large bowl",
    "electric mixer",
    "whipped whites",
    "rubber spatula",
    "large tube pan",
    "cake pan",
    "tube pan"
  ],
  "tyn_section":[

  ]
}