{
  "title":"How to Play a Video Game in Real Life",
  "url":"https://www.wikihow.com/Play-a-Video-Game-in-Real-Life",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Gather some friends and siblings.",
      "description":"If you have friends that don't want to do it or siblings that don't care, get a pencil and paper."
    },
    {
      "headline":"Dress up in a costume.",
      "description":"Ask your friends to do the same, or you can just use the clothes you're wearing. If you're using paper, draw figures."
    },
    {
      "headline":"Try to use some paper.",
      "description":"Make an energy bar and stick it on your costume. Use energy bars with your friends or the creatures on the paper. If your game involves food or hunger, you can have little paper cut outs of food or something of your liking"
    },
    {
      "headline":"Create your \"enemies\".",
      "description":"The friends can be enemies, or you can have imaginary enemies. You might have some friends heroes and some friends enemies, too. It can also be helpful to have puppets or cardboard cutouts for enemies as well."
    },
    {
      "headline":"Provide the players with special powers or gear.",
      "description":"Give you and the enemies and heroes attacks, abilities, and/or fighting gear. Try to make a vehicle if your game has one."
    },
    {
      "headline":"Draw a scene on a large piece of paper.",
      "description":"Color it in with bright colors. If you want, you can just use the scenery around you for time sake, and to make it easier."
    },
    {
      "headline":"Engage in combat.",
      "description":"Use your weapons, attacks, and abilities to fight the enemies. Have them erase some of their energy bar when they get attacked."
    },
    {
      "headline":"Have levels, boss fights, and points.",
      "description":"If you run out of people, make another costume and have a previous enemy be another enemy."
    },
    {
      "headline":"Construct a point shop.",
      "description":"If you have a certain amount of points, Make a point shop, where players can use points they accumulate. Stock the ship with weapons, abilities, and attacks that the players can purchase. You can also have a person whose job is a healer for injuries and such."
    },
    {
      "headline":"Continue the play if you deplete your energy.",
      "description":"If all your energy is gone and you have other heroes, let them take over and then become an enemy. You could also have a healer, or maybe you have to eat to re-heal, but some games don't have that kind of option."
    },
    {
      "headline":"Have fun and play fair.",
      "description":""
    }
  ],
  "text":" Gather some friends and siblings. If you have friends that don't want to do it or siblings that don't care, get a pencil and paper. Dress up in a costume. Ask your friends to do the same, or you can just use the clothes you're wearing. If you're using paper, draw figures. Try to use some paper. Make an energy bar and stick it on your costume. Use energy bars with your friends or the creatures on the paper. If your game involves food or hunger, you can have little paper cut outs of food or something of your liking Create your \"enemies\". The friends can be enemies, or you can have imaginary enemies. You might have some friends heroes and some friends enemies, too. It can also be helpful to have puppets or cardboard cutouts for enemies as well. Provide the players with special powers or gear. Give you and the enemies and heroes attacks, abilities, and/or fighting gear. Try to make a vehicle if your game has one. Draw a scene on a large piece of paper. Color it in with bright colors. If you want, you can just use the scenery around you for time sake, and to make it easier. Engage in combat. Use your weapons, attacks, and abilities to fight the enemies. Have them erase some of their energy bar when they get attacked. Have levels, boss fights, and points. If you run out of people, make another costume and have a previous enemy be another enemy. Construct a point shop. If you have a certain amount of points, Make a point shop, where players can use points they accumulate. Stock the ship with weapons, abilities, and attacks that the players can purchase. You can also have a person whose job is a healer for injuries and such. Continue the play if you deplete your energy. If all your energy is gone and you have other heroes, let them take over and then become an enemy. You could also have a healer, or maybe you have to eat to re-heal, but some games don't have that kind of option. Have fun and play fair. ",
  "tyn_model":[
    "paper",
    "pencil",
    "cardboard",
    "healer"
  ],
  "tyn_section":[

  ]
}