{
  "title":"How to Make a Yellow Bird Drink",
  "url":"https://www.wikihow.com/Make-a-Yellow-Bird-Drink",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails"
  ],
  "methods":[
    {
      "name":"Yellow Bird",
      "steps":[
        {
          "headline":"Fill a cocktail shaker with ice.",
          "description":""
        },
        {
          "headline":"Juice half a lime.",
          "description":"Dump the lime juice into the cocktail shaker."
        },
        {
          "headline":"Dump the orange juice into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Dump the light rum into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Dump the dark rum into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Dump the Galliano liquor into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Shake well.",
          "description":""
        },
        {
          "headline":"Fill a collins glass with crushed ice.",
          "description":""
        },
        {
          "headline":"Strain the drink into the collins glass.",
          "description":""
        },
        {
          "headline":"Garnish with the cherry.",
          "description":""
        }
      ]
    },
    {
      "name":"Blended Yellow Bird",
      "steps":[
        {
          "headline":"Pour the light rum into a blender.",
          "description":""
        },
        {
          "headline":"Pour the Galliano into the blender.",
          "description":""
        },
        {
          "headline":"Pour the creme de banana into the blender.",
          "description":""
        },
        {
          "headline":"Pour the orange juice into the blender.",
          "description":""
        },
        {
          "headline":"Pour the pineapple juice into the blender.",
          "description":""
        },
        {
          "headline":"Blend the drink well.",
          "description":""
        },
        {
          "headline":"Fill a hurricane glass with ice.",
          "description":""
        },
        {
          "headline":"Pour the drink into the hurricane glass.",
          "description":""
        }
      ]
    },
    {
      "name":"Coffee Yellow Bird",
      "steps":[
        {
          "headline":"Pour the light rum into a cocktail shaker.",
          "description":""
        },
        {
          "headline":"Pour the banana liquor into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Pour the coffee liquor into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Pour the orange juice into the cocktail shaker",
          "description":""
        },
        {
          "headline":"Pour the pineapple juice into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Shake well.",
          "description":""
        },
        {
          "headline":"Fill a glass with ice.",
          "description":""
        },
        {
          "headline":"Strain drink into glass.",
          "description":""
        }
      ]
    }
  ],
  "text":" Yellow Bird Fill a cocktail shaker with ice.  Juice half a lime. Dump the lime juice into the cocktail shaker. Dump the orange juice into the cocktail shaker.  Dump the light rum into the cocktail shaker.  Dump the dark rum into the cocktail shaker.  Dump the Galliano liquor into the cocktail shaker.  Shake well.  Fill a collins glass with crushed ice.  Strain the drink into the collins glass.  Garnish with the cherry.  Blended Yellow Bird Pour the light rum into a blender.  Pour the Galliano into the blender.  Pour the creme de banana into the blender.  Pour the orange juice into the blender.  Pour the pineapple juice into the blender.  Blend the drink well.  Fill a hurricane glass with ice.  Pour the drink into the hurricane glass.  Coffee Yellow Bird Pour the light rum into a cocktail shaker.  Pour the banana liquor into the cocktail shaker.  Pour the coffee liquor into the cocktail shaker.  Pour the orange juice into the cocktail shaker  Pour the pineapple juice into the cocktail shaker.  Shake well.  Fill a glass with ice.  Strain drink into glass. ",
  "tyn_model":[
    "cocktail shaker",
    "blender",
    "ice",
    "orange juice",
    "light rum",
    "collins glass",
    "pineapple juice",
    "hurricane glass",
    "lime",
    "lime juice",
    "dark rum",
    "galliano liquor",
    "crushed ice",
    "cherry",
    "banana",
    "banana liquor",
    "coffee liquor",
    "glass"
  ],
  "tyn_section":[

  ]
}