{
  "title":"How to Paint an Outdoor Garden Scene in Watercolor",
  "url":"https://www.wikihow.com/Paint-an-Outdoor-Garden-Scene-in-Watercolor",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Paths and Paving"
  ],
  "parts":[
    {
      "name":"Planning Your Painting",
      "steps":[
        {
          "headline":"Imagine yourself a landscape designer.",
          "description":"Try doodling flowers in a garden. Nothing fancy, just put some ideas on paper. Try grouping different flower varieties. Play up the flower types, sizes, shapes, heights and colors for maximum effect. Remember the importance of greenery and non blossoming plants to accent the colors of the flowers."
        },
        {
          "headline":"Once at your painting destination, survey your surroundings.",
          "description":"At first, walk around to get a feel for what the scene has to offer. Ask yourself what this garden conveys to you. What catches your attention? What feeling does the garden give you? {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/02\\/Patsmixed.jpg\\/460px-Patsmixed.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/02\\/Patsmixed.jpg\\/760px-Patsmixed.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Plan to use your imagination and employ artistic license.",
          "description":"This means shifting and changing things to suit your needs. Most often, as pretty as it is, for the sake of a good painting, you will be required to shuffle things around on your paper."
        },
        {
          "headline":"Decide on a center of interest for your art piece.",
          "description":"Is there something in the garden that might become your focal point? What shapes, heights, and colors are the flowers? Most gardeners plant similar flowers in groups for drama and impact rather than scattering them randomly."
        },
        {
          "headline":"Spread out your supplies in the shade, but within view of what most inspires you.",
          "description":"Remember, you might have to move your chair more than once during your painting session. The sun moves across the sky and light and shadows change, so take snapshots for reference later."
        },
        {
          "headline":"Never underestimate the power of animals and pets.",
          "description":"Putting a cat or dog in the scene can bring it alive. This could be a completely fictional happenstance, but the addition of animals  is indescribable."
        }
      ]
    },
    {
      "name":"Sketching the Design",
      "steps":[
        {
          "headline":"Make a sketch on your good paper.",
          "description":"A pad of #140 cold press watercolor paper is good to use in that it has a cardboard backing to function as your support as you paint. Start with the focal point figure, be it a tree or whatever. Establish it right off the bat."
        },
        {
          "headline":"Wet your pads of color in your paint set.",
          "description":"Lay out your favorite brushes for easy grabbing as you work. A medium round, a half in flat, a wash brush and a tiny detailer brush are typically used. Of course, additional brushes are fun to add varied textures. Have a pencil, eraser, and a torn piece of natural sponge for doing foliage. Put your water vessel close at hand. Have all supplies on a small table or the seat of a chair within easy reach of your dominant hand."
        },
        {
          "headline":"Paint the main element right away.",
          "description":"Let it dry. Outdoors you might find the paint drying fast, depending of the humidity in the air."
        }
      ]
    },
    {
      "name":"Adding Details",
      "steps":[
        {
          "headline":"Sketch in pencil the shapes for the flowers, flagstones, grassy areas, etc.",
          "description":"Actually break the areas into jig-saw like shapes. Here is where you might take off from reality and add flowers of your choosing."
        },
        {
          "headline":"Paint each section of flowers, one at a time.",
          "description":"Watch your painting grow and extend out as you paint each section. Remember to contrast heights and shapes of plants from one area to the next."
        },
        {
          "headline":"Clarify each section of flowers by doing a small, quick sketch.",
          "description":""
        },
        {
          "headline":"Return to the main element and flesh it out.",
          "description":"Add shadows along each branch, textures, more branches and twigs."
        },
        {
          "headline":"Do the foliage by sponging on the color for the leaf clusters.",
          "description":"Use a dampened, squeezed out natural sponge dipped in undiluted paint. Twist and turn your wrist as you dab on the foliage for variety. Immediately go back in with a water filled brush and spread and break up the strong texture made by the sponge. (A small spray bottle filled with clean water would do a similar job.) Allow this to dry. Then return with the sponge and accent areas that need it. Try to make it look like it is not a sponge job."
        },
        {
          "headline":"Fill in areas behind the main figure.",
          "description":"Pale blue is always good and looks like sky. Think about adding a large, green pine tree to fill some of the space and add another interesting, triangular shape."
        }
      ]
    },
    {
      "name":"Finishing Up",
      "steps":[
        {
          "headline":"When complete, set it away from yourself.",
          "description":"As it dries, look at it. If it needs pulling together, do that, carefully, but avoid completely outlining shapes."
        },
        {
          "headline":"With your pencil, redraw the shapes of the sections of flowers.",
          "description":"Lines get blurred and lost and by redrawing them, it will bring them back into focus."
        },
        {
          "headline":"Let it dry overnight.",
          "description":"If you want to add things, refer to your photographs from the scene. If you want to alter something, use a magic eraser or a white household sponge/eraser to swipe it away. Let the area dry and repaint."
        },
        {
          "headline":"Congratulate yourself for seeing through the confusing array of greens in an actual scene.",
          "description":"By using the method of breaking areas into workable sections, and by relying on your own sensibilities to add what isn’t there, you  are getting closer to seeing and painting like an artist. Sign and hang your work. By keeping it you will have a record of your growth as you paint outdoors as often as the day allows."
        }
      ]
    }
  ],
  "text":" Planning Your Painting Imagine yourself a landscape designer. Try doodling flowers in a garden. Nothing fancy, just put some ideas on paper. Try grouping different flower varieties. Play up the flower types, sizes, shapes, heights and colors for maximum effect. Remember the importance of greenery and non blossoming plants to accent the colors of the flowers. Once at your painting destination, survey your surroundings. At first, walk around to get a feel for what the scene has to offer. Ask yourself what this garden conveys to you. What catches your attention? What feeling does the garden give you? {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/02\\/Patsmixed.jpg\\/460px-Patsmixed.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/02\\/Patsmixed.jpg\\/760px-Patsmixed.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"} Plan to use your imagination and employ artistic license. This means shifting and changing things to suit your needs. Most often, as pretty as it is, for the sake of a good painting, you will be required to shuffle things around on your paper. Decide on a center of interest for your art piece. Is there something in the garden that might become your focal point? What shapes, heights, and colors are the flowers? Most gardeners plant similar flowers in groups for drama and impact rather than scattering them randomly. Spread out your supplies in the shade, but within view of what most inspires you. Remember, you might have to move your chair more than once during your painting session. The sun moves across the sky and light and shadows change, so take snapshots for reference later. Never underestimate the power of animals and pets. Putting a cat or dog in the scene can bring it alive. This could be a completely fictional happenstance, but the addition of animals  is indescribable. Sketching the Design Make a sketch on your good paper. A pad of #140 cold press watercolor paper is good to use in that it has a cardboard backing to function as your support as you paint. Start with the focal point figure, be it a tree or whatever. Establish it right off the bat. Wet your pads of color in your paint set. Lay out your favorite brushes for easy grabbing as you work. A medium round, a half in flat, a wash brush and a tiny detailer brush are typically used. Of course, additional brushes are fun to add varied textures. Have a pencil, eraser, and a torn piece of natural sponge for doing foliage. Put your water vessel close at hand. Have all supplies on a small table or the seat of a chair within easy reach of your dominant hand. Paint the main element right away. Let it dry. Outdoors you might find the paint drying fast, depending of the humidity in the air. Adding Details Sketch in pencil the shapes for the flowers, flagstones, grassy areas, etc. Actually break the areas into jig-saw like shapes. Here is where you might take off from reality and add flowers of your choosing. Paint each section of flowers, one at a time. Watch your painting grow and extend out as you paint each section. Remember to contrast heights and shapes of plants from one area to the next. Clarify each section of flowers by doing a small, quick sketch.  Return to the main element and flesh it out. Add shadows along each branch, textures, more branches and twigs. Do the foliage by sponging on the color for the leaf clusters. Use a dampened, squeezed out natural sponge dipped in undiluted paint. Twist and turn your wrist as you dab on the foliage for variety. Immediately go back in with a water filled brush and spread and break up the strong texture made by the sponge. (A small spray bottle filled with clean water would do a similar job.) Allow this to dry. Then return with the sponge and accent areas that need it. Try to make it look like it is not a sponge job. Fill in areas behind the main figure. Pale blue is always good and looks like sky. Think about adding a large, green pine tree to fill some of the space and add another interesting, triangular shape. Finishing Up When complete, set it away from yourself. As it dries, look at it. If it needs pulling together, do that, carefully, but avoid completely outlining shapes. With your pencil, redraw the shapes of the sections of flowers. Lines get blurred and lost and by redrawing them, it will bring them back into focus. Let it dry overnight. If you want to add things, refer to your photographs from the scene. If you want to alter something, use a magic eraser or a white household sponge/eraser to swipe it away. Let the area dry and repaint. Congratulate yourself for seeing through the confusing array of greens in an actual scene. By using the method of breaking areas into workable sections, and by relying on your own sensibilities to add what isn’t there, you  are getting closer to seeing and painting like an artist. Sign and hang your work. By keeping it you will have a record of your growth as you paint outdoors as often as the day allows.",
  "tyn_model":[
    "flowers",
    "paint",
    "sponge",
    "paper",
    "pencil",
    "eraser",
    "natural sponge",
    "landscape designer",
    "plants",
    "artistic license",
    "cold press watercolor paper",
    "water vessel",
    "twigs",
    "water filled brush",
    "spray bottle",
    "magic eraser",
    "white household sponge"
  ],
  "tyn_section":[

  ]
}