{
  "title":"How to Make Popcorn Balls",
  "url":"https://www.wikihow.com/Make-Popcorn-Balls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Popcorn"
  ],
  "methods":[
    {
      "name":"Making Marshmallow Popcorn Balls",
      "steps":[
        {
          "headline":"Bring the light corn syrup, butter, water, confectioners' sugar, and marshmallows to a boil over medium heat.",
          "description":"Pour the light corn syrup into a saucepan, then stir in the butter, water, confectioners' sugar, and marshmallows. Heat the mixture over medium heat until it starts to boil., stirring often to prevent scorching or burning."
        },
        {
          "headline":"Put the popcorn into a large bowl, then stir the mixture into it with a rubber spatula.",
          "description":"Be sure to scrape the bottom of the bowl often to ensure that you get the popcorn at the bottom. You can buy plain, pre-popped popcorn from the store, or you can make your own using the microwave or stove."
        },
        {
          "headline":"Grease your hands with vegetable shortening or butter, then shape the popcorn mixture into balls using your hands.",
          "description":"Try to make each ball about 3½ inches (8.89-centimeters) wide. Place the popcorn balls onto a baking sheet covered with wax paper as you finish them; you can also use greased cupcake or muffin pans instead. Keep some extra butter or shortening on hand. If the popcorn starts to stick to your hands, simply coat your hands with more butter or shortening."
        },
        {
          "headline":"Wait for the popcorn balls to set before serving them.",
          "description":"This will take about 30 minutes. After this, you can serve the popcorn balls."
        }
      ]
    },
    {
      "name":"Making Caramel Popcorn Balls",
      "steps":[
        {
          "headline":"Bring the butter, sugar, and corn syrup to a boil over medium heat.",
          "description":"Place a medium-sized saucepan on the stove, then add the butter, sugar, and corn syrup. Turn the heat to medium, and wait for the mixture to come to a boil, stirring it occasionally . Clip a cooking thermometer to the side of the saucepan. Don't let the bottom of the thermometer touch the bottom of the saucepan."
        },
        {
          "headline":"Stir in the condensed milk, and let the mixture simmer until it reaches 238°F (114°C).",
          "description":"Add the condensed milked, then reduce the heat to low. Let the mixture simmer until it reaches 238°F (114°C). Stir the mixture often to prevent scorching."
        },
        {
          "headline":"Remove the saucepan from heat, then stir in the vanilla extract.",
          "description":"This will help sweeten the caramel as well as give it a more complex flavor."
        },
        {
          "headline":"Put the popcorn into a large bowl, then carefully stir the mixture into it with a rubber spatula.",
          "description":"Be sure to scrape the bottom of the bowl often so that all of the popcorn gets evenly coated with caramel. You can use pre-popped popcorn from the store, or you can make your own using a stove or microwave."
        },
        {
          "headline":"Coat your hands with butter, then sculpt the popcorn into 3½-inch (8.89-centimeter) balls.",
          "description":"Place the popcorn balls onto a baking sheet covered with wax paper as you finish each one. You can also use a greased cupcake or muffin pan instead."
        },
        {
          "headline":"Wait for the popcorn to set.",
          "description":"This will take about 30 minutes. After this, you can serve the popcorn balls however you please."
        }
      ]
    },
    {
      "name":"Making Peanut Butter Popcorn Balls",
      "steps":[
        {
          "headline":"Bring the brown sugar, corn syrup, and butter to a boil over medium heat.",
          "description":"Put the brown sugar into a large saucepan, then stir in the corn syrup and butter. Put the saucepan on the stove, then turn the heat up to medium. Wait for the mixture to come to a boil, stirring occasionally to prevent scorching."
        },
        {
          "headline":"Take the saucepan off the stove, then stir in the peanut butter.",
          "description":"As soon as the mixture comes to a boil, take the saucepan off the burner and add the peanut butter. Stir well with a rubber spatula until everything is evenly combined. Make sure that you use the plain kind of peanut butter."
        },
        {
          "headline":"Place the popcorn into a large bowl, then pour the mixture over it.",
          "description":"Stir the two together with a rubber spatula until everything is evenly coated. Be sure to scrape the bottom of the bowl often! You can use pre-popped popcorn from the store, or make your own ahead of time using a microwave or stove."
        },
        {
          "headline":"Coat your hands with butter or vegetable shortening, then form the popcorn into balls.",
          "description":"Try to get the balls about 3½ inches (8.89 centimeters) wide. As you finish the balls, place them onto a baking sheet lined with wax paper. You can also use a greased cupcake or muffin pan instead."
        },
        {
          "headline":"Wait for the popcorn to set.",
          "description":"This will take about 30 minutes. After that, you can serve the popcorn balls."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Marshmallow Popcorn Balls Bring the light corn syrup, butter, water, confectioners' sugar, and marshmallows to a boil over medium heat. Pour the light corn syrup into a saucepan, then stir in the butter, water, confectioners' sugar, and marshmallows. Heat the mixture over medium heat until it starts to boil., stirring often to prevent scorching or burning. Put the popcorn into a large bowl, then stir the mixture into it with a rubber spatula. Be sure to scrape the bottom of the bowl often to ensure that you get the popcorn at the bottom. You can buy plain, pre-popped popcorn from the store, or you can make your own using the microwave or stove. Grease your hands with vegetable shortening or butter, then shape the popcorn mixture into balls using your hands. Try to make each ball about 3½ inches (8.89-centimeters) wide. Place the popcorn balls onto a baking sheet covered with wax paper as you finish them; you can also use greased cupcake or muffin pans instead. Keep some extra butter or shortening on hand. If the popcorn starts to stick to your hands, simply coat your hands with more butter or shortening. Wait for the popcorn balls to set before serving them. This will take about 30 minutes. After this, you can serve the popcorn balls. Making Caramel Popcorn Balls Bring the butter, sugar, and corn syrup to a boil over medium heat. Place a medium-sized saucepan on the stove, then add the butter, sugar, and corn syrup. Turn the heat to medium, and wait for the mixture to come to a boil, stirring it occasionally . Clip a cooking thermometer to the side of the saucepan. Don't let the bottom of the thermometer touch the bottom of the saucepan. Stir in the condensed milk, and let the mixture simmer until it reaches 238°F (114°C). Add the condensed milked, then reduce the heat to low. Let the mixture simmer until it reaches 238°F (114°C). Stir the mixture often to prevent scorching. Remove the saucepan from heat, then stir in the vanilla extract. This will help sweeten the caramel as well as give it a more complex flavor. Put the popcorn into a large bowl, then carefully stir the mixture into it with a rubber spatula. Be sure to scrape the bottom of the bowl often so that all of the popcorn gets evenly coated with caramel. You can use pre-popped popcorn from the store, or you can make your own using a stove or microwave. Coat your hands with butter, then sculpt the popcorn into 3½-inch (8.89-centimeter) balls. Place the popcorn balls onto a baking sheet covered with wax paper as you finish each one. You can also use a greased cupcake or muffin pan instead. Wait for the popcorn to set. This will take about 30 minutes. After this, you can serve the popcorn balls however you please. Making Peanut Butter Popcorn Balls Bring the brown sugar, corn syrup, and butter to a boil over medium heat. Put the brown sugar into a large saucepan, then stir in the corn syrup and butter. Put the saucepan on the stove, then turn the heat up to medium. Wait for the mixture to come to a boil, stirring occasionally to prevent scorching. Take the saucepan off the stove, then stir in the peanut butter. As soon as the mixture comes to a boil, take the saucepan off the burner and add the peanut butter. Stir well with a rubber spatula until everything is evenly combined. Make sure that you use the plain kind of peanut butter. Place the popcorn into a large bowl, then pour the mixture over it. Stir the two together with a rubber spatula until everything is evenly coated. Be sure to scrape the bottom of the bowl often! You can use pre-popped popcorn from the store, or make your own ahead of time using a microwave or stove. Coat your hands with butter or vegetable shortening, then form the popcorn into balls. Try to get the balls about 3½ inches (8.89 centimeters) wide. As you finish the balls, place them onto a baking sheet lined with wax paper. You can also use a greased cupcake or muffin pan instead. Wait for the popcorn to set. This will take about 30 minutes. After that, you can serve the popcorn balls. Finished. ",
  "tyn_model":[
    "popcorn",
    "butter",
    "saucepan",
    "rubber spatula",
    "corn syrup",
    "bowl",
    "microwave",
    "baking sheet",
    "wax paper",
    "light corn syrup",
    "water",
    "confectioners' sugar",
    "marshmallows",
    "large bowl",
    "vegetable shortening",
    "sugar",
    "stove",
    "cupcake or muffin pan",
    "brown sugar",
    "peanut butter",
    "cupcake or muffin pans",
    "butter or shortening",
    "cooking thermometer",
    "condensed milk",
    "condensed milked",
    "vanilla",
    "caramel",
    "peanut butter popcorn balls",
    "large saucepan",
    "butter or"
  ],
  "tyn_section":[

  ]
}