{
  "title":"How to Prepare to Build a Shed",
  "url":"https://www.wikihow.com/Prepare-to-Build-a-Shed",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Outdoor Buildings",
    "Sheds"
  ],
  "steps":[
    {
      "headline":"Check the rules of the neighborhood.",
      "description":"Check into any neighborhood restrictions or requirements. Simple things such as roof choice, color or visibility from the road can be addressed much easier in your planning phase."
    },
    {
      "headline":"Check the local laws.",
      "description":"Before you begin construction check your local laws … contact your town’s local building department, see if a building permit is required. Or, check to see if there are specific zoning restrictions or requirements."
    },
    {
      "headline":"Verify what the exact required setback are from your property’s boundaries.",
      "description":"Know the official boundary and get the set back requirements in writing from the official source."
    },
    {
      "headline":"Identify underground sprinkler heads and connecting pipes, be aware you may need to move piping or sprinklers.",
      "description":"Do not build your shed on top of an underground sprinkler systems."
    },
    {
      "headline":"Consider what you want to store now and in the future, build accordingly.",
      "description":"Draw a schematic of how things will fit. Make a list and view the actual items. Nothing is worse than outgrowing your well-built shed after a single season. Or, building a shed for specific items that comfortably fit."
    },
    {
      "headline":"Use supplies that will protect against your region’s weather.",
      "description":"Snow? Plan for a sturdy roof. Heavy Rains? High Humidity? Use the best materials for regional conditions and you won't be rebuilding prematurely."
    },
    {
      "headline":"Assess your surrounding landscape, thinking 3-4-5 years out … are there trees or other foliage whose growth may crowd easy access to and from your shed.",
      "description":"The last thing you’ll want is to cut down your wife’s favorite dogwood tree in 4 years… you know, the little one she just planted?"
    },
    {
      "headline":"Consider the position of the shed as you measure space – if swinging doors are part of your shed plans, can the doors open and shut fully, unhindered within the shed zone?",
      "description":"It’s surprising the number of projects that don’t account for the full distance of a wide-open door."
    },
    {
      "headline":"Decide on windows.",
      "description":"Will your shed offer windows? Consider the position of the sun and if you want the benefit of natural light inside your shed, a great benefit even if your shed will boast electric lights."
    },
    {
      "headline":"Be sure the ground is level.",
      "description":"Level ground sounds like an obvious requirement that shouldn’t need mentioning. That being said, not all obviously looking flat ground is level. Be sure to actually measure for levelness and address any minor issues needed. Overtime, un-level ground will be a regretted nuisance."
    }
  ],
  "text":" Check the rules of the neighborhood. Check into any neighborhood restrictions or requirements. Simple things such as roof choice, color or visibility from the road can be addressed much easier in your planning phase. Check the local laws. Before you begin construction check your local laws … contact your town’s local building department, see if a building permit is required. Or, check to see if there are specific zoning restrictions or requirements. Verify what the exact required setback are from your property’s boundaries. Know the official boundary and get the set back requirements in writing from the official source. Identify underground sprinkler heads and connecting pipes, be aware you may need to move piping or sprinklers. Do not build your shed on top of an underground sprinkler systems. Consider what you want to store now and in the future, build accordingly. Draw a schematic of how things will fit. Make a list and view the actual items. Nothing is worse than outgrowing your well-built shed after a single season. Or, building a shed for specific items that comfortably fit. Use supplies that will protect against your region’s weather. Snow? Plan for a sturdy roof. Heavy Rains? High Humidity? Use the best materials for regional conditions and you won't be rebuilding prematurely. Assess your surrounding landscape, thinking 3-4-5 years out … are there trees or other foliage whose growth may crowd easy access to and from your shed. The last thing you’ll want is to cut down your wife’s favorite dogwood tree in 4 years… you know, the little one she just planted? Consider the position of the shed as you measure space – if swinging doors are part of your shed plans, can the doors open and shut fully, unhindered within the shed zone? It’s surprising the number of projects that don’t account for the full distance of a wide-open door. Decide on windows. Will your shed offer windows? Consider the position of the sun and if you want the benefit of natural light inside your shed, a great benefit even if your shed will boast electric lights. Be sure the ground is level. Level ground sounds like an obvious requirement that shouldn’t need mentioning. That being said, not all obviously looking flat ground is level. Be sure to actually measure for levelness and address any minor issues needed. Overtime, un-level ground will be a regretted nuisance.",
  "tyn_model":[
    "… contact",
    "shed",
    "… are",
    "dogwood tree",
    "… you",
    "– if",
    "windows"
  ],
  "tyn_section":[

  ]
}