{
  "title":"How to Count Electrical Plans",
  "url":"https://www.wikihow.com/Count-Electrical-Plans",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Electrical Maintenance"
  ],
  "steps":[
    {
      "headline":"Gather your counting equipment.",
      "description":"If you set up the plans on a thin tabletop, you can use binder clips to keep the binded edge of the plans from falling."
    },
    {
      "headline":"Write the job name in the header of the notepad page.",
      "description":""
    },
    {
      "headline":"Determine which items you need to keep track of, and read the electrical legend to familiarize yourself with the symbols.",
      "description":"On a residential job, you may only need to count the \"additional\" electrical features (dimmer switches, recessed can lights, hot tub outlets). On large commercial projects, you'll be wise to do a count of everything."
    },
    {
      "headline":"Begin the counts.",
      "description":"Some common items you may want to count are below:\nReceptacles: Duplex, simplex, quadruplex, floor, weather proof, GFI, convenience/USB\nSwitches: Standard, dimmer, occupancy\nLights: Recessed cans, track lights, UC (undercabinet) lights, weather proof/damp lights, pendant lights\nFans: Exhaust fans, exhaust fan/light combos, pendant/paddle fans\nTV/data drops\nFireplace stub-ins\nSpecial outlets: Hot tub, 220A for welder, etc. Fire alarms\nExit/emergency signage"
    },
    {
      "headline":"Choose a color for the item you're about to start counting.",
      "description":"Use that color to highlight each item on the plan sheet as you count it. It's usually easiest to start from one corner of the plan, or do it room by room. Color code that item in the electrical legend."
    },
    {
      "headline":"Write the item's name, and number, on the notepad.",
      "description":"Example: Floor receptacles -- 4. Take the highlighter you used for that item and make a slight slash next to the item's name or number. This'll help you keep organized and find an item you're looking for."
    },
    {
      "headline":"Count the rest of the switchgear and lights.",
      "description":"Keep each count of items two lines apart on the notepad. Leave plenty of space to allow for adding numbers to your count."
    },
    {
      "headline":"Staple multiple count pages together.",
      "description":"Make sure they're neatly titled, and store them in the appropriate folder for future usage."
    }
  ],
  "text":" Gather your counting equipment. If you set up the plans on a thin tabletop, you can use binder clips to keep the binded edge of the plans from falling. Write the job name in the header of the notepad page.  Determine which items you need to keep track of, and read the electrical legend to familiarize yourself with the symbols. On a residential job, you may only need to count the \"additional\" electrical features (dimmer switches, recessed can lights, hot tub outlets). On large commercial projects, you'll be wise to do a count of everything. Begin the counts. Some common items you may want to count are below:\nReceptacles: Duplex, simplex, quadruplex, floor, weather proof, GFI, convenience/USB\nSwitches: Standard, dimmer, occupancy\nLights: Recessed cans, track lights, UC (undercabinet) lights, weather proof/damp lights, pendant lights\nFans: Exhaust fans, exhaust fan/light combos, pendant/paddle fans\nTV/data drops\nFireplace stub-ins\nSpecial outlets: Hot tub, 220A for welder, etc. Fire alarms\nExit/emergency signage Choose a color for the item you're about to start counting. Use that color to highlight each item on the plan sheet as you count it. It's usually easiest to start from one corner of the plan, or do it room by room. Color code that item in the electrical legend. Write the item's name, and number, on the notepad. Example: Floor receptacles -- 4. Take the highlighter you used for that item and make a slight slash next to the item's name or number. This'll help you keep organized and find an item you're looking for. Count the rest of the switchgear and lights. Keep each count of items two lines apart on the notepad. Leave plenty of space to allow for adding numbers to your count. Staple multiple count pages together. Make sure they're neatly titled, and store them in the appropriate folder for future usage.",
  "tyn_model":[
    "notepad",
    "binder clips",
    "usb",
    "fans",
    "highlighter"
  ],
  "tyn_section":[

  ]
}