{
  "title":"How to Stage a Bathroom",
  "url":"https://www.wikihow.com/Stage-a-Bathroom",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "parts":[
    {
      "name":"Cleaning and Making Repairs",
      "steps":[
        {
          "headline":"Clear off all visible surfaces.",
          "description":"Empty your countertops, sink area, toilet tank and shower shelves completely. Not only will this make cleaning a breeze, it also helps to declutter the bathroom, giving it more of a “showroom” feel. You can return a select few items when it comes time to put the finishing touches on the room. Sort the items you remove into two separate piles: things you can get rid of and things you can hide until later."
        },
        {
          "headline":"Deep-clean the major surfaces.",
          "description":"Give the toilet, sink and shower or bathtub area a good scrubbing with a strong disinfecting solution. Pay particular attention to areas with soap scum or hard water buildup. Since the buyer will be performing all of their hygiene in these places, it’s critical that they don’t find anything that might gross them out. Mix up your own all-purpose cleaner using a combination of liquid castile soap, baking soda, and your choice of fragrant essential oils. Be sure to get into the tiniest cracks and crevices and use a little elbow grease. Even the most inconspicuous spots are likely to be given a once-over at some point. Don’t forget to clean the floor vents, light fixtures, and other areas where dust and cobwebs can build up."
        },
        {
          "headline":"Polish your fixtures.",
          "description":"Use a specialty steel, silver, or brass cleaner to get your knobs, handles, faucets, shower head and other accents shining again. Interested viewers will be inspecting the condition of the bathroom’s metal pieces, and a little rust or tarnish may leave a bad taste in their mouths. Don’t forget to touch up less obvious hardware like drawer pulls, as well."
        },
        {
          "headline":"Detail the floor.",
          "description":"Start by sweeping or vacuuming to remove loose dust and debris, then wipe it down with a damp cloth soaked in a mild soap solution to cut through stuck-on messes. Finish by towel-drying the entire floor by hand—standing water can eventually lead to damage and discoloration. For bathrooms with tile floors, you can treat light discoloration and renew grout by scrubbing it with a paste made from baking soda and water. Use a wax or floor polish to increase the luster of smooth surfaces. Use a wood stain pen to repair scratches in the floor, then apply a coat of wax for a nice finish."
        },
        {
          "headline":"Fix broken plumbing and appliances.",
          "description":"Check for common issues like leaky faucets, clogged drains, and running toilets. Should repairs be needed, be sure to schedule them well in advance of any open houses or walkthrough dates. Everything in your bathrooms should be in good working order before you admit your first visitor. Don’t ignore drafts, temperamental wiring and other red flags that could potentially become an issue (or a safety hazard) in the future. Save money by tackling minor projects yourself, assuming you have the know-how."
        }
      ]
    },
    {
      "name":"Organizing the Bathroom",
      "steps":[
        {
          "headline":"Put away your unmentionables.",
          "description":"Stash embarrassing or personal personal items in a lower drawer where they won’t be immediately visible, or better yet, in a box with a lid underneath the sink. This applies to things like deodorant, razors, and feminine hygiene products, but it might also include prescription medications or that half-empty bottle of dandruff shampoo. Consider moving anything valuable or off-limits to another room in the house. The less the buyer sees of your belongings, the easier they’ll be able to envision themselves inhabiting the space."
        },
        {
          "headline":"Tidy up your storage spaces.",
          "description":"If there’s a closet in your bathroom, make sure everything in it is folded and tucked away neatly. The same goes for drawers within arm’s reach. Assume that your buyer will want to look at these places and plan accordingly, just to be on the safe side. Consider purchasing a couple smaller storage solutions, such as a wicker basket for bath towels or a small decorative cart to display your soaps, lotions, and oils. That way, everything won’t all be crammed into one place. If you really want to go the extra mile, group your stored items together by function and color. Avoid displaying all of your items so that you can showcase the functionality of each space. For instance, remove all but your best 6 towels from the linen closet, then roll or fold the 6 towels and arrange them nicely."
        },
        {
          "headline":"Straighten up for better presentation.",
          "description":"Once you've decided what can go and what can stay, make sure it's all nicely configured and that no two items are clustered too closely together. Everything that's out should look like it has a purpose. The idea is to use your available space strategically to let the room breathe a little. Keep breakable objects away from ledges where they might be knocked over accidentally. Any products that are left out the countertops or in the shower area should have the labels turned outward so that they can be plainly seen. Consider transferring commonplace products like soaps, shaving supplies, and cotton swabs to more attractive containers, like nice jars or dishes."
        }
      ]
    },
    {
      "name":"Accessorizing for Better Effect",
      "steps":[
        {
          "headline":"Lay out a few eye-catching items.",
          "description":"Move throughout the bathroom and arrange a handful of elegant decorations in each area. Pieces like these essentially function as props—they’ll keep the room from looking so empty and tantalize prospective buyers with ideas for how they could take advantage of the space themselves. For example, you might place a small stack of folded towels on the edge of the tub, or set an ornate soap dish (complete with a new bar of soap) next to the sink. A scented candle in a pretty jar looks great on the counter. Even if it’s not lit, it adds a nice fragrance and appeal to the space. Be careful not to over-decorate. It’s better to keep it sparse and simple and let onlookers use their imagination."
        },
        {
          "headline":"Put down a cozy rug.",
          "description":"Having a comfortable, private place to escape is high on any buyer’s list, and a plush rug will go a long way toward completing the luxurious “spa” atmosphere you’re trying to achieve. The right floor covering will also help break up empty space that puts your bathroom in danger of feeling sterile. Finding a rug that matches your towels or shower curtain is a plus. Otherwise, go with a neutral shade like white, beige, black, gray, or navy so it doesn’t clash with the rest of the room’s decor. Look for rugs made of absorbent materials that won’t get soggy if you’re coming straight from the shower."
        },
        {
          "headline":"Replace your shower curtain.",
          "description":"Throw out your old shower curtain and upgrade to a more contemporary style. Sleek patterns and materials will capture the most attention. Avoid anything that looks cheap or gimmicky, like loud floral prints or flamingos, in favor of solid colors or minimalist designs. Go ahead and toss your old curtain liner. These show stains easily after enough use and they’re inexpensive, so there’s no sense in trying to save the one you’ve got. At the very least, run your current shower curtain through the washing machine to restore it to its original hue."
        },
        {
          "headline":"Hang some tasteful artwork.",
          "description":"Cover barren walls with framed paintings to give wandering eyes a place to settle. If classical art isn’t your style, experiment with something more abstract like a hanging metal work or shadowbox. Choose art that’s on the small side and keep it confined to intuitive spaces so it doesn’t look out of place. Rather than buying prefab art from your local home goods store, scavenge for more original productions at antique stores, flea markets, and yard sales. One or two pieces should be more than enough. Remember, it’s a bathroom, not a museum."
        },
        {
          "headline":"Add a vase of fresh flowers.",
          "description":"Most bathrooms are finished in neutral tones, which can look a little drab even with accessories. A spray of daylilies or orchids will help brighten up the room and inject a splash of eye-catching color. For washrooms with more open layouts, you can create an air of lushness using larger plants like ferns. You can opt for fake flowers or greenery if desired. For example, place a fake succulent on the countertop or a jar of fake pussy willows on the edge of the tub. Position flowers and other plants in an out of the way section of the room so touring visitors don’t feel swamped when they walk in."
        }
      ]
    }
  ],
  "text":" Cleaning and Making Repairs Clear off all visible surfaces. Empty your countertops, sink area, toilet tank and shower shelves completely. Not only will this make cleaning a breeze, it also helps to declutter the bathroom, giving it more of a “showroom” feel. You can return a select few items when it comes time to put the finishing touches on the room. Sort the items you remove into two separate piles: things you can get rid of and things you can hide until later. Deep-clean the major surfaces. Give the toilet, sink and shower or bathtub area a good scrubbing with a strong disinfecting solution. Pay particular attention to areas with soap scum or hard water buildup. Since the buyer will be performing all of their hygiene in these places, it’s critical that they don’t find anything that might gross them out. Mix up your own all-purpose cleaner using a combination of liquid castile soap, baking soda, and your choice of fragrant essential oils. Be sure to get into the tiniest cracks and crevices and use a little elbow grease. Even the most inconspicuous spots are likely to be given a once-over at some point. Don’t forget to clean the floor vents, light fixtures, and other areas where dust and cobwebs can build up. Polish your fixtures. Use a specialty steel, silver, or brass cleaner to get your knobs, handles, faucets, shower head and other accents shining again. Interested viewers will be inspecting the condition of the bathroom’s metal pieces, and a little rust or tarnish may leave a bad taste in their mouths. Don’t forget to touch up less obvious hardware like drawer pulls, as well. Detail the floor. Start by sweeping or vacuuming to remove loose dust and debris, then wipe it down with a damp cloth soaked in a mild soap solution to cut through stuck-on messes. Finish by towel-drying the entire floor by hand—standing water can eventually lead to damage and discoloration. For bathrooms with tile floors, you can treat light discoloration and renew grout by scrubbing it with a paste made from baking soda and water. Use a wax or floor polish to increase the luster of smooth surfaces. Use a wood stain pen to repair scratches in the floor, then apply a coat of wax for a nice finish. Fix broken plumbing and appliances. Check for common issues like leaky faucets, clogged drains, and running toilets. Should repairs be needed, be sure to schedule them well in advance of any open houses or walkthrough dates. Everything in your bathrooms should be in good working order before you admit your first visitor. Don’t ignore drafts, temperamental wiring and other red flags that could potentially become an issue (or a safety hazard) in the future. Save money by tackling minor projects yourself, assuming you have the know-how. Organizing the Bathroom Put away your unmentionables. Stash embarrassing or personal personal items in a lower drawer where they won’t be immediately visible, or better yet, in a box with a lid underneath the sink. This applies to things like deodorant, razors, and feminine hygiene products, but it might also include prescription medications or that half-empty bottle of dandruff shampoo. Consider moving anything valuable or off-limits to another room in the house. The less the buyer sees of your belongings, the easier they’ll be able to envision themselves inhabiting the space. Tidy up your storage spaces. If there’s a closet in your bathroom, make sure everything in it is folded and tucked away neatly. The same goes for drawers within arm’s reach. Assume that your buyer will want to look at these places and plan accordingly, just to be on the safe side. Consider purchasing a couple smaller storage solutions, such as a wicker basket for bath towels or a small decorative cart to display your soaps, lotions, and oils. That way, everything won’t all be crammed into one place. If you really want to go the extra mile, group your stored items together by function and color. Avoid displaying all of your items so that you can showcase the functionality of each space. For instance, remove all but your best 6 towels from the linen closet, then roll or fold the 6 towels and arrange them nicely. Straighten up for better presentation. Once you've decided what can go and what can stay, make sure it's all nicely configured and that no two items are clustered too closely together. Everything that's out should look like it has a purpose. The idea is to use your available space strategically to let the room breathe a little. Keep breakable objects away from ledges where they might be knocked over accidentally. Any products that are left out the countertops or in the shower area should have the labels turned outward so that they can be plainly seen. Consider transferring commonplace products like soaps, shaving supplies, and cotton swabs to more attractive containers, like nice jars or dishes. Accessorizing for Better Effect Lay out a few eye-catching items. Move throughout the bathroom and arrange a handful of elegant decorations in each area. Pieces like these essentially function as props—they’ll keep the room from looking so empty and tantalize prospective buyers with ideas for how they could take advantage of the space themselves. For example, you might place a small stack of folded towels on the edge of the tub, or set an ornate soap dish (complete with a new bar of soap) next to the sink. A scented candle in a pretty jar looks great on the counter. Even if it’s not lit, it adds a nice fragrance and appeal to the space. Be careful not to over-decorate. It’s better to keep it sparse and simple and let onlookers use their imagination. Put down a cozy rug. Having a comfortable, private place to escape is high on any buyer’s list, and a plush rug will go a long way toward completing the luxurious “spa” atmosphere you’re trying to achieve. The right floor covering will also help break up empty space that puts your bathroom in danger of feeling sterile. Finding a rug that matches your towels or shower curtain is a plus. Otherwise, go with a neutral shade like white, beige, black, gray, or navy so it doesn’t clash with the rest of the room’s decor. Look for rugs made of absorbent materials that won’t get soggy if you’re coming straight from the shower. Replace your shower curtain. Throw out your old shower curtain and upgrade to a more contemporary style. Sleek patterns and materials will capture the most attention. Avoid anything that looks cheap or gimmicky, like loud floral prints or flamingos, in favor of solid colors or minimalist designs. Go ahead and toss your old curtain liner. These show stains easily after enough use and they’re inexpensive, so there’s no sense in trying to save the one you’ve got. At the very least, run your current shower curtain through the washing machine to restore it to its original hue. Hang some tasteful artwork. Cover barren walls with framed paintings to give wandering eyes a place to settle. If classical art isn’t your style, experiment with something more abstract like a hanging metal work or shadowbox. Choose art that’s on the small side and keep it confined to intuitive spaces so it doesn’t look out of place. Rather than buying prefab art from your local home goods store, scavenge for more original productions at antique stores, flea markets, and yard sales. One or two pieces should be more than enough. Remember, it’s a bathroom, not a museum. Add a vase of fresh flowers. Most bathrooms are finished in neutral tones, which can look a little drab even with accessories. A spray of daylilies or orchids will help brighten up the room and inject a splash of eye-catching color. For washrooms with more open layouts, you can create an air of lushness using larger plants like ferns. You can opt for fake flowers or greenery if desired. For example, place a fake succulent on the countertop or a jar of fake pussy willows on the edge of the tub. Position flowers and other plants in an out of the way section of the room so touring visitors don’t feel swamped when they walk in.",
  "tyn_model":[
    "towels",
    "shower curtain",
    "flowers",
    "baking soda",
    "water",
    "soaps",
    "rug",
    "plants",
    "“showroom",
    "” feel",
    "all-purpose cleaner",
    "castile soap",
    "essential oils",
    "cleaner",
    "mild soap",
    "towel",
    "—standing",
    "grout",
    "wood stain pen",
    "wax",
    "toilets",
    "razors",
    "dandruff shampoo",
    "wicker basket",
    "decorative cart",
    "lotions",
    "oils",
    "linen closet",
    "dishes",
    "decorations",
    "—they’ll",
    "soap dish",
    "soap",
    "scented candle",
    "“spa",
    "” atmosphere",
    "rugs",
    "curtain liner",
    "art",
    "vase",
    "daylilies",
    "orchids"
  ],
  "tyn_section":[

  ]
}