{
  "title":"How to Make Strawberry Balsamic Truffles",
  "url":"https://www.wikihow.com/Make-Strawberry-Balsamic-Truffles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Chocolate Truffles"
  ],
  "methods":[
    {
      "name":"Making the Truffles",
      "steps":[
        {
          "headline":"Break up the chocolate into smaller pieces.",
          "description":"Place the pieces into a food processor and whirl into fine bits."
        },
        {
          "headline":"Bring the cream to a simmer.",
          "description":""
        },
        {
          "headline":"Remove cream from heat before adding the balsamic vinegar to the hot cream.",
          "description":"Don't be alarmed, as the vinegar will immediately cause the cream to curdle. This is a natural reaction."
        },
        {
          "headline":"Pour the hot cream into the food processor already filled with chocolate bits and pulse for 15 seconds.",
          "description":"You have just created what is known as \"ganache\"."
        },
        {
          "headline":"Pour the ganache into a glass loaf pan.",
          "description":"Cover with plastic wrap and allow to cool at room temperature. The truffle ganache will set to a firm consistency. Refrigerate for several hours, well covered."
        },
        {
          "headline":"Prepare the truffles after allowing the ganache to set for several hours.",
          "description":"Scoop out portions with a small ice cream scooper; create thumb tip sized truffle pieces."
        },
        {
          "headline":"Round down the edges of your truffle pieces, using your fingertips.",
          "description":"You should aim to make the little truffle balls as smooth as possible. Think of truffle chocolates you have eaten before to get the proportions in your mind."
        }
      ]
    },
    {
      "name":"Coating the Truffles in a Layer of Fine Chocolate",
      "steps":[
        {
          "headline":"Prepare a double boiler.",
          "description":"Heat finely chopped quality dark chocolate until just barely melted. Remove from the heat and stir. Add a couple tablespoons more of finely chopped chocolate and continue stirring until this second addition of chocolate is melted in. The melted chocolate mixture should be just smooth and barely warm, not hot."
        },
        {
          "headline":"Place a spoonful of melted chocolate in the palm of your hand.",
          "description":"Place one of your truffle pieces in the puddle of chocolate. Swirl the truffle piece around to coat it entirely. The resulting shell of chocolate can be quite thin; in fact, it is preferable to make it as thin as possible."
        },
        {
          "headline":"Prepare the dehydrated strawberries.",
          "description":"If your dehydrated strawberries are not already in powdered form, you will need to either blend them or crush them in a mortar and pestle to create a powder. To keep the fruit powder nice and loose, add 1 tsp of corn starch and stir. If they are already in powdered form, proceed to the next step."
        },
        {
          "headline":"Drop the chocolate-coated truffle into the bowl of strawberry powder.",
          "description":"Shake gently to coat. If preferred, use the tines of a fork to gently push the truffle around in the powder."
        },
        {
          "headline":"Allow the outer shell to set before gently spooning the powdered truffle out of the powdered strawberry mixture.",
          "description":"Place the finished truffle onto a non-stick surface to finish firming up."
        },
        {
          "headline":"Serve or deliver as gift complete with box, cellophane wrap and a beautiful big bow.",
          "description":"Don't forget to include a card telling the recipient that you made them."
        }
      ]
    }
  ],
  "text":" Making the Truffles Break up the chocolate into smaller pieces. Place the pieces into a food processor and whirl into fine bits. Bring the cream to a simmer.  Remove cream from heat before adding the balsamic vinegar to the hot cream. Don't be alarmed, as the vinegar will immediately cause the cream to curdle. This is a natural reaction. Pour the hot cream into the food processor already filled with chocolate bits and pulse for 15 seconds. You have just created what is known as \"ganache\". Pour the ganache into a glass loaf pan. Cover with plastic wrap and allow to cool at room temperature. The truffle ganache will set to a firm consistency. Refrigerate for several hours, well covered. Prepare the truffles after allowing the ganache to set for several hours. Scoop out portions with a small ice cream scooper; create thumb tip sized truffle pieces. Round down the edges of your truffle pieces, using your fingertips. You should aim to make the little truffle balls as smooth as possible. Think of truffle chocolates you have eaten before to get the proportions in your mind. Coating the Truffles in a Layer of Fine Chocolate Prepare a double boiler. Heat finely chopped quality dark chocolate until just barely melted. Remove from the heat and stir. Add a couple tablespoons more of finely chopped chocolate and continue stirring until this second addition of chocolate is melted in. The melted chocolate mixture should be just smooth and barely warm, not hot. Place a spoonful of melted chocolate in the palm of your hand. Place one of your truffle pieces in the puddle of chocolate. Swirl the truffle piece around to coat it entirely. The resulting shell of chocolate can be quite thin; in fact, it is preferable to make it as thin as possible. Prepare the dehydrated strawberries. If your dehydrated strawberries are not already in powdered form, you will need to either blend them or crush them in a mortar and pestle to create a powder. To keep the fruit powder nice and loose, add 1 tsp of corn starch and stir. If they are already in powdered form, proceed to the next step. Drop the chocolate-coated truffle into the bowl of strawberry powder. Shake gently to coat. If preferred, use the tines of a fork to gently push the truffle around in the powder. Allow the outer shell to set before gently spooning the powdered truffle out of the powdered strawberry mixture. Place the finished truffle onto a non-stick surface to finish firming up. Serve or deliver as gift complete with box, cellophane wrap and a beautiful big bow. Don't forget to include a card telling the recipient that you made them.",
  "tyn_model":[
    "chocolate",
    "cream",
    "food processor",
    "strawberries",
    "balsamic vinegar",
    "vinegar",
    "glass loaf pan",
    "plastic wrap",
    "ice cream",
    "fine chocolate",
    "boiler",
    "dark chocolate",
    "mortar and pestle",
    "corn starch",
    "chocolate-",
    "bowl",
    "strawberry powder",
    "fork",
    "cellophane wrap"
  ],
  "tyn_section":[

  ]
}