{
  "title":"How to Make Iskender Kebab",
  "url":"https://www.wikihow.com/Make-Iskender-Kebab",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Middle Eastern Cuisine"
  ],
  "parts":[
    {
      "name":"Marinating the Meat",
      "steps":[
        {
          "headline":"Puree the onion, oregano, red pepper flakes, olive oil, salt, and pepper.",
          "description":"Add 2 large, grated onions, 3 tablespoons (45 ml) of olive oil, 2 teaspoons (2 g) of dried oregano, 2 teaspoons (3 g) of red pepper flakes, and salt and freshly ground black pepper to taste to the bowl of a food processor. Process the mixture until it is pureed smooth. If you don’t have a food processor, you can puree the mixture in a blender."
        },
        {
          "headline":"Transfer the mixture to a bowl and add the meat.",
          "description":"When the onion mixture is pureed, dump it into a large bowl. Add 2 pounds (907 g) of lamb tenderloin that’s been cut into 2-inch (5-cm) pieces to the bowl and toss well to coat the meat. For the best results, pound the pieces of lamb with a meat tenderizer or wooden spoon before adding them to the onion mixture. Aim to get the pieces about 1 ½-inches (4-cm) thick. If you prefer, you can your butcher to cut the lamb tenderloin for you. You can substitute beef tenderloin for the lamb if you prefer."
        },
        {
          "headline":"Cover the bowl and marinate the meat overnight.",
          "description":"Once the lamb pieces are well coated with the onion mixture, place a piece of plastic wrap over the bowl. Chill the meat overnight in the refrigerator so it has a time to marinate. If you’re in a hurry, you can marinate the meat in the refrigerator for as few as two hours. However, you’ll get the best flavor if you leave it in the fridge overnight."
        }
      ]
    },
    {
      "name":"Making the Tomato Sauce",
      "steps":[
        {
          "headline":"Heat the olive oil in pan.",
          "description":"Add 2 tablespoons (30 ml) of olive oil to a medium sauce pan. Allow the oil to heat on medium for 3 to 5 minutes, or until it begins to shimmer."
        },
        {
          "headline":"Mix in the tomato paste, red pepper paste, salt, and pepper.",
          "description":"Once the oil is heated, add 2 tablespoons (33 g) of concentrated tomato paste and 1 tablespoon (16 g) of red pepper paste to the pan. Next, season the mixture with salt and freshly ground black pepper to taste, and mix well to blend all of the ingredients. If you can’t find red pepper paste, you can substitute another tablespoon (16 g) of tomato paste and a pinch or two of red pepper flakes instead."
        },
        {
          "headline":"Add the water and bring the mixture to a boil.",
          "description":"When the tomato paste and red pepper paste are properly seasoned, mix in 2 cups (474 ml) of water. Raise the heat to medium-high, and allow the mixture to come to a boil, which should take 5 to 7 minutes."
        },
        {
          "headline":"Simmer the sauce for about 10 minutes.",
          "description":"When the sauce mixture reaches a boil, lower the heat to medium. Let the sauce simmer for 10 to 20 minutes, or until it thickens up. Stir the sauce occasionally as it simmers so it doesn’t stick to the bottom of the pan."
        }
      ]
    },
    {
      "name":"Finishing the Kebabs",
      "steps":[
        {
          "headline":"Preheat the oven.",
          "description":"To ensure that your oven is warm enough to heat the pita, it’s important to preheat it. Set the temperature to 350°F (180°C), and allow it to heat fully."
        },
        {
          "headline":"Drizzle some olive oil to a skillet and cook the meat for several minutes.",
          "description":"Add a few drops of olive oil to a skillet, and heat it on high for a minute. Next, add the marinated lamb to the skillet and cook it for 2 minutes. Flip the meat over and cook it for another 2 minutes. Be careful not to overcook the lamb or it may become tough. If you prefer, you can thread the lamb pieces onto skewers and cook them on a grill."
        },
        {
          "headline":"Add the tomatoes and peppers and cook them until they’re charred.",
          "description":"When the lamb has cooked for several minutes, place 3 medium tomatoes that have been cut into wedges and 2 green bell peppers that have been deseeded and sliced on the other side of the skillet. Cook them on high until they begin to char at the edges, which should take about 5 minutes."
        },
        {
          "headline":"Place the pita bread on a baking sheet and warm in the oven for several minutes.",
          "description":"Set 6 thin slices of plain pita bread onto a cookie sheet and add it to the preheated oven. Allow the pita slices to warm for 5 minutes."
        },
        {
          "headline":"Set a piece of pita bread on each plate and top with the meat.",
          "description":"When the pita slices are warm, remove the tray from the oven. Place one pita slice on each plate. Add some of the lamb pieces to the top of each bread slice."
        },
        {
          "headline":"Pour the tomato sauce over the meat and add the tomatoes and peppers.",
          "description":"Once the meat is on the pita, spoon some of the tomato sauce over the meat. Add some of the charred tomatoes and peppers to the side of the plate as well."
        },
        {
          "headline":"Serve the meal with a spoonful of yogurt on the side.",
          "description":"When you’re ready to serve, add a dollop of yogurt to the side of each plate. Be sure to serve the dish while it’s still warm."
        }
      ]
    }
  ],
  "text":" Marinating the Meat Puree the onion, oregano, red pepper flakes, olive oil, salt, and pepper. Add 2 large, grated onions, 3 tablespoons (45 ml) of olive oil, 2 teaspoons (2 g) of dried oregano, 2 teaspoons (3 g) of red pepper flakes, and salt and freshly ground black pepper to taste to the bowl of a food processor. Process the mixture until it is pureed smooth. If you don’t have a food processor, you can puree the mixture in a blender. Transfer the mixture to a bowl and add the meat. When the onion mixture is pureed, dump it into a large bowl. Add 2 pounds (907 g) of lamb tenderloin that’s been cut into 2-inch (5-cm) pieces to the bowl and toss well to coat the meat. For the best results, pound the pieces of lamb with a meat tenderizer or wooden spoon before adding them to the onion mixture. Aim to get the pieces about 1 ½-inches (4-cm) thick. If you prefer, you can your butcher to cut the lamb tenderloin for you. You can substitute beef tenderloin for the lamb if you prefer. Cover the bowl and marinate the meat overnight. Once the lamb pieces are well coated with the onion mixture, place a piece of plastic wrap over the bowl. Chill the meat overnight in the refrigerator so it has a time to marinate. If you’re in a hurry, you can marinate the meat in the refrigerator for as few as two hours. However, you’ll get the best flavor if you leave it in the fridge overnight. Making the Tomato Sauce Heat the olive oil in pan. Add 2 tablespoons (30 ml) of olive oil to a medium sauce pan. Allow the oil to heat on medium for 3 to 5 minutes, or until it begins to shimmer. Mix in the tomato paste, red pepper paste, salt, and pepper. Once the oil is heated, add 2 tablespoons (33 g) of concentrated tomato paste and 1 tablespoon (16 g) of red pepper paste to the pan. Next, season the mixture with salt and freshly ground black pepper to taste, and mix well to blend all of the ingredients. If you can’t find red pepper paste, you can substitute another tablespoon (16 g) of tomato paste and a pinch or two of red pepper flakes instead. Add the water and bring the mixture to a boil. When the tomato paste and red pepper paste are properly seasoned, mix in 2 cups (474 ml) of water. Raise the heat to medium-high, and allow the mixture to come to a boil, which should take 5 to 7 minutes. Simmer the sauce for about 10 minutes. When the sauce mixture reaches a boil, lower the heat to medium. Let the sauce simmer for 10 to 20 minutes, or until it thickens up. Stir the sauce occasionally as it simmers so it doesn’t stick to the bottom of the pan. Finishing the Kebabs Preheat the oven. To ensure that your oven is warm enough to heat the pita, it’s important to preheat it. Set the temperature to 350°F (180°C), and allow it to heat fully. Drizzle some olive oil to a skillet and cook the meat for several minutes. Add a few drops of olive oil to a skillet, and heat it on high for a minute. Next, add the marinated lamb to the skillet and cook it for 2 minutes. Flip the meat over and cook it for another 2 minutes. Be careful not to overcook the lamb or it may become tough. If you prefer, you can thread the lamb pieces onto skewers and cook them on a grill. Add the tomatoes and peppers and cook them until they’re charred. When the lamb has cooked for several minutes, place 3 medium tomatoes that have been cut into wedges and 2 green bell peppers that have been deseeded and sliced on the other side of the skillet. Cook them on high until they begin to char at the edges, which should take about 5 minutes. Place the pita bread on a baking sheet and warm in the oven for several minutes. Set 6 thin slices of plain pita bread onto a cookie sheet and add it to the preheated oven. Allow the pita slices to warm for 5 minutes. Set a piece of pita bread on each plate and top with the meat. When the pita slices are warm, remove the tray from the oven. Place one pita slice on each plate. Add some of the lamb pieces to the top of each bread slice. Pour the tomato sauce over the meat and add the tomatoes and peppers. Once the meat is on the pita, spoon some of the tomato sauce over the meat. Add some of the charred tomatoes and peppers to the side of the plate as well. Serve the meal with a spoonful of yogurt on the side. When you’re ready to serve, add a dollop of yogurt to the side of each plate. Be sure to serve the dish while it’s still warm.",
  "tyn_model":[
    "red pepper",
    "olive oil",
    "lamb",
    "oven",
    "onion",
    "salt",
    "bowl",
    "tomato paste",
    "skillet",
    "tomatoes",
    "pita bread",
    "pepper",
    "freshly ground black pepper",
    "food processor",
    "lamb tenderloin",
    "refrigerator",
    "oil",
    "water",
    "peppers",
    "tomato sauce",
    "yogurt",
    "oregano",
    "onions",
    "dried oregano",
    "blender",
    "large bowl",
    "meat tenderizer or wooden spoon",
    "plastic wrap",
    "medium sauce pan",
    "grill",
    "green bell peppers",
    "baking sheet",
    "cookie sheet",
    "tray",
    "plate"
  ],
  "tyn_section":[

  ]
}