{
  "title":"How to Kill Grass Invading a Flower Bed",
  "url":"https://www.wikihow.com/Kill-Grass-Invading-a-Flower-Bed",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "methods":[
    {
      "name":"Smothering the Grass with Newspaper",
      "steps":[
        {
          "headline":"Lay down sheets of newspaper over the invasive grass.",
          "description":"Make the newspaper barrier around four sheets thick for the best results. Leave room around the bases of the flowers in the flower bed. If you don’t have a lot of newspaper lying around, try getting some at your local recycling plant."
        },
        {
          "headline":"Wet the sheets of newspaper with a hose.",
          "description":"Get them wet enough that they won’t blow away in the wind. Getting the newspapers wet will also help them decompose faster, which will be good for your flower bed."
        },
        {
          "headline":"Add a three-inch (7.6 cm) layer of mulch over the newspaper.",
          "description":"You can use any type of mulch, like shredded wood chips, leaves, or compost."
        },
        {
          "headline":"Pull out any grass that manages to grow through the newspaper.",
          "description":"If you don’t want to pull out the grass by hand, try using an herbicide to kill the grass and stop it from spreading."
        },
        {
          "headline":"Repeat the process every year to prevent new grass from growing.",
          "description":"Lay down more newspaper, smothering any existing grass in the flower bed, and add a fresh layer of mulch."
        }
      ]
    },
    {
      "name":"Applying a Pre-Emergent Herbicide",
      "steps":[
        {
          "headline":"Use a granular pre-emergent herbicide that’s compatible.",
          "description":"Some herbicides are toxic to use on certain flowers. Read the label on the herbicide to see if it’s safe to use on the flowers in your flower bed. You can find a pre-emergent herbicide at your local gardening center."
        },
        {
          "headline":"Pull up any existing grass in the flower bed.",
          "description":"Pre-emergent herbicide won’t kill grass that’s already there; its main purpose is to prevent new grass from growing."
        },
        {
          "headline":"Read the instructions that came with the pre-emergent herbicide carefully.",
          "description":"Check the label to see exactly how much you should be applying to the flower bed."
        },
        {
          "headline":"Apply an even coat of the pre-emergent herbicide to the flower bed.",
          "description":"Make sure you cover the entire surface of the flower bed so there are no gaps for grass to come through. Don’t spread pre-emergent herbicide over the flower bed when it’s wet or the granules may cling to the flowers and cause them to die."
        },
        {
          "headline":"Water the flower bed with a ½ inch (1.3 cm) of water.",
          "description":"Do this immediately after applying the pre-emergent herbicide to help the granules work their way into the soil. Not watering the flower bed will prevent the herbicide from fully working."
        },
        {
          "headline":"Re-apply pre-emergent herbicide to the flower bed every 2-3 months.",
          "description":"After 2-3 months the effectiveness of the herbicide will wear, and you’ll want to put down more to prevent new grass from growing."
        }
      ]
    },
    {
      "name":"Using a Post-Emergent Herbicide",
      "steps":[
        {
          "headline":"Find a selective post-emergent herbicide that won’t kill the flowers.",
          "description":"Selective herbicides are designed to kill a specific kind of weed, so they won’t kill the other plants in your flower bed. Look at your local gardening center for a post-emergent herbicide that mentions the type of grass invading your flower bed on the label."
        },
        {
          "headline":"Apply an even coat of the post-emergent herbicide to the flower bed.",
          "description":"If you’re using an herbicide with a spray applicator, spray all of the unwanted grass in the flower bed. If you’re using a granular herbicide, sprinkle an even layer of the granules over the flower bed. Read the instructions that come with the post-emergent herbicide to know exactly how much to apply to the flower bed."
        },
        {
          "headline":"Water the flower bed with a ½ inch (1.3 cm) of water if applying granular herbicide.",
          "description":"Water the flower bed immediately after laying down the granules. If you’re using a spray-on post-emergent herbicide, don’t water the flower bed or you’ll wash the herbicide off the grass."
        },
        {
          "headline":"Re-apply the herbicide the next growing season if the grass returns.",
          "description":"Because post-emergent herbicide only kills grass that’s already grown, wait until the growing season is underway and you see some grass in your flower bed before you apply more."
        }
      ]
    },
    {
      "name":"Using Natural Alternatives",
      "steps":[
        {
          "headline":"Pour boiling water onto the grass.",
          "description":"One natural way to kill your grass only requires water. Fill a pot with water and bring it to  a boil on the stove. Then, carefully carry the pot to the flower bed and pour the water directly onto the grass. Be extremely cautious when handling the water, as it can burn you if you spill it on yourself. Do not pour any hot water onto your flowers, or you may accidentally kill them as well. Refill the pot with water and boil it if you don’t cover all of the grass with the first pot of water."
        },
        {
          "headline":"Spray a vinegar mixture onto the grass.",
          "description":"To create a natural vinegar mixture that should be able to kill your grass, mix together 1 gallon (3.8 l) of white vinegar and 1 cup (240 ml) of table or rock salt. Stir in 1 tablespoon (15 ml) of dish soap, and pour the mixture into the body of a garden sprayer. Spray your unwanted grass directly with the sprayer."
        },
        {
          "headline":"Cover the grass in lemon juice.",
          "description":"Lemon juice is another chemical-free option that may be able to kill your grass. Douse the grass in lemon juice and then check on the grass after 1-2 days. By this time, the grass should be mostly dead. If not, repeat the process until you’ve achieved your desired results."
        }
      ]
    }
  ],
  "text":" Smothering the Grass with Newspaper Lay down sheets of newspaper over the invasive grass. Make the newspaper barrier around four sheets thick for the best results. Leave room around the bases of the flowers in the flower bed. If you don’t have a lot of newspaper lying around, try getting some at your local recycling plant. Wet the sheets of newspaper with a hose. Get them wet enough that they won’t blow away in the wind. Getting the newspapers wet will also help them decompose faster, which will be good for your flower bed. Add a three-inch (7.6 cm) layer of mulch over the newspaper. You can use any type of mulch, like shredded wood chips, leaves, or compost. Pull out any grass that manages to grow through the newspaper. If you don’t want to pull out the grass by hand, try using an herbicide to kill the grass and stop it from spreading. Repeat the process every year to prevent new grass from growing. Lay down more newspaper, smothering any existing grass in the flower bed, and add a fresh layer of mulch. Applying a Pre-Emergent Herbicide Use a granular pre-emergent herbicide that’s compatible. Some herbicides are toxic to use on certain flowers. Read the label on the herbicide to see if it’s safe to use on the flowers in your flower bed. You can find a pre-emergent herbicide at your local gardening center. Pull up any existing grass in the flower bed. Pre-emergent herbicide won’t kill grass that’s already there; its main purpose is to prevent new grass from growing. Read the instructions that came with the pre-emergent herbicide carefully. Check the label to see exactly how much you should be applying to the flower bed. Apply an even coat of the pre-emergent herbicide to the flower bed. Make sure you cover the entire surface of the flower bed so there are no gaps for grass to come through. Don’t spread pre-emergent herbicide over the flower bed when it’s wet or the granules may cling to the flowers and cause them to die. Water the flower bed with a ½ inch (1.3 cm) of water. Do this immediately after applying the pre-emergent herbicide to help the granules work their way into the soil. Not watering the flower bed will prevent the herbicide from fully working. Re-apply pre-emergent herbicide to the flower bed every 2-3 months. After 2-3 months the effectiveness of the herbicide will wear, and you’ll want to put down more to prevent new grass from growing. Using a Post-Emergent Herbicide Find a selective post-emergent herbicide that won’t kill the flowers. Selective herbicides are designed to kill a specific kind of weed, so they won’t kill the other plants in your flower bed. Look at your local gardening center for a post-emergent herbicide that mentions the type of grass invading your flower bed on the label. Apply an even coat of the post-emergent herbicide to the flower bed. If you’re using an herbicide with a spray applicator, spray all of the unwanted grass in the flower bed. If you’re using a granular herbicide, sprinkle an even layer of the granules over the flower bed. Read the instructions that come with the post-emergent herbicide to know exactly how much to apply to the flower bed. Water the flower bed with a ½ inch (1.3 cm) of water if applying granular herbicide. Water the flower bed immediately after laying down the granules. If you’re using a spray-on post-emergent herbicide, don’t water the flower bed or you’ll wash the herbicide off the grass. Re-apply the herbicide the next growing season if the grass returns. Because post-emergent herbicide only kills grass that’s already grown, wait until the growing season is underway and you see some grass in your flower bed before you apply more. Using Natural Alternatives Pour boiling water onto the grass. One natural way to kill your grass only requires water. Fill a pot with water and bring it to  a boil on the stove. Then, carefully carry the pot to the flower bed and pour the water directly onto the grass. Be extremely cautious when handling the water, as it can burn you if you spill it on yourself. Do not pour any hot water onto your flowers, or you may accidentally kill them as well. Refill the pot with water and boil it if you don’t cover all of the grass with the first pot of water. Spray a vinegar mixture onto the grass. To create a natural vinegar mixture that should be able to kill your grass, mix together 1 gallon (3.8 l) of white vinegar and 1 cup (240 ml) of table or rock salt. Stir in 1 tablespoon (15 ml) of dish soap, and pour the mixture into the body of a garden sprayer. Spray your unwanted grass directly with the sprayer. Cover the grass in lemon juice. Lemon juice is another chemical-free option that may be able to kill your grass. Douse the grass in lemon juice and then check on the grass after 1-2 days. By this time, the grass should be mostly dead. If not, repeat the process until you’ve achieved your desired results.",
  "tyn_model":[
    "herbicide",
    "water",
    "newspaper",
    "mulch",
    "pot",
    "lemon juice",
    "herbicides",
    "vinegar",
    "hose",
    "newspapers",
    "white vinegar",
    "table or rock salt",
    "dish soap",
    "garden sprayer"
  ],
  "tyn_section":[

  ]
}