{
  "title":"How to Use Leftover Hot Dogs",
  "url":"https://www.wikihow.com/Use-Leftover-Hot-Dogs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Fast Food",
    "Hot Dogs"
  ],
  "methods":[
    {
      "name":"Baking with Hot Dogs",
      "steps":[
        {
          "headline":"Make corn dog muffins.",
          "description":"Mix up your favorite cornbread from a recipe or a boxed cornbread mix. Fill each cup in a muffin tin about half full. Slice the hot dogs into thirds. Press one third of a hot dog into each muffin. Bake the corn dog muffins based on the cornbread’s instructions. If you want to distribute the hot dogs through the muffins more evenly, cut them into small slices and put a handful into each muffin."
        },
        {
          "headline":"Wrap the hot dogs with bacon and cheese in crescent rolls.",
          "description":"Fry up some bacon. Cut the hot dogs in half. Open a can of crescent rolls and spread them out individually on a baking sheet. Lay a piece of hot dog, a half piece of bacon, and some cheese on each roll. Bake based on the crescent roll instructions. Put sliced onions and jalapenos in the rolls for a spicier version. Experiment with different cheeses. Add some chili to the roll for chili cheese dogs."
        },
        {
          "headline":"Toss hot dog pieces into a pan of mac and cheese.",
          "description":"Layer cooked pasta in a dish with your favorite cheese. Pour beaten eggs, milk, or melted butter over the top, if you want. Then slice up the hot dogs and place them evenly throughout the whole pan before you bake it. This is a great way to add a bit of protein to a carb-heavy meal."
        }
      ]
    },
    {
      "name":"Cooking Dishes on the Stove",
      "steps":[
        {
          "headline":"Make hot dog fried rice in a skillet over medium heat.",
          "description":"Dice carrots and hot dogs and fry them in an oiled skillet. Scoop one or two cups of cooked and cooled white rice into the skillet. Flip it over for a few minutes to heat the rice. Pour two beaten eggs over the rice and fry it until the eggs are cooked. Add diced onions, some peas, or other small bits of vegetables if you want."
        },
        {
          "headline":"Use hot dog bits to make hash and eggs.",
          "description":"Chop up potatoes, onions, and hot dogs into tiny pieces. Heat butter in a skillet and add the potatoes, then onions, then hot dogs. Be sure to flip the hash so it cooks on all sides. Fry up a couple of eggs in a separate skillet and serve them on top of the hash. For a variation, beat the eggs and pour them over the hash. Then form them up into patties. Cook them for a minute or two on both sides of the patty."
        },
        {
          "headline":"Use hot dogs instead of beef in your favorite sloppy joe recipe.",
          "description":"Use a can of sloppy joe sauce or your own secret recipe. Slice leftover hot dogs into small chunks. Throw the hot dog pieces into a heated skillet and pour the sloppy joe mix over the top. Heat to boiling. Serve on hamburger buns or bread for a traditional sloppy joe sandwich. Serve the sloppy joes on hot dog buns if you have lots of those leftover, too. Otherwise, serve it without the buns with cheese, onions, and jalapeños to toss on top."
        }
      ]
    },
    {
      "name":"Making Other Dishes",
      "steps":[
        {
          "headline":"Mix up a Chicago-style hot dog salad.",
          "description":"If you love Chicago-style hot dogs, make a tasty hot dog salad without the bun. Throw some sliced hot dogs, onions, pickles, peppers, cabbage and mixed greens into a bowl. Mix together mustard, oil, and honey. Drizzle the liquid over the salad. Slice the ingredients for a salad into large chunks, or dice everything except the hot dogs so the salad mixes together more completely."
        },
        {
          "headline":"Put together hot dog tacos for a non-traditional meal.",
          "description":"Grab your favorite type of tortilla and any taco fixings you want. Pile the tortilla with a whole hot dog or slices, and diced onions, jalapenos, cheese, relish, or avocado. This is an especially good option if you like eating gluten free. Use spinach or corn tortillas to avoid the flour in hot dog buns."
        },
        {
          "headline":"Cook up a variation of cocktail weenies in your slow cooker.",
          "description":"Cut the hot dogs into one to two inch (2.5-5 cm) long pieces and place them in your slow cooker. Add barbecue or chili sauce and grape jelly on top of the hot dogs. Cook for six to ten hours on the slow cooker’s low setting. The choice between barbecue and chili sauce is mainly one of personal taste. Each one gives the weenies a slightly different taste."
        }
      ]
    }
  ],
  "text":" Baking with Hot Dogs Make corn dog muffins. Mix up your favorite cornbread from a recipe or a boxed cornbread mix. Fill each cup in a muffin tin about half full. Slice the hot dogs into thirds. Press one third of a hot dog into each muffin. Bake the corn dog muffins based on the cornbread’s instructions. If you want to distribute the hot dogs through the muffins more evenly, cut them into small slices and put a handful into each muffin. Wrap the hot dogs with bacon and cheese in crescent rolls. Fry up some bacon. Cut the hot dogs in half. Open a can of crescent rolls and spread them out individually on a baking sheet. Lay a piece of hot dog, a half piece of bacon, and some cheese on each roll. Bake based on the crescent roll instructions. Put sliced onions and jalapenos in the rolls for a spicier version. Experiment with different cheeses. Add some chili to the roll for chili cheese dogs. Toss hot dog pieces into a pan of mac and cheese. Layer cooked pasta in a dish with your favorite cheese. Pour beaten eggs, milk, or melted butter over the top, if you want. Then slice up the hot dogs and place them evenly throughout the whole pan before you bake it. This is a great way to add a bit of protein to a carb-heavy meal. Cooking Dishes on the Stove Make hot dog fried rice in a skillet over medium heat. Dice carrots and hot dogs and fry them in an oiled skillet. Scoop one or two cups of cooked and cooled white rice into the skillet. Flip it over for a few minutes to heat the rice. Pour two beaten eggs over the rice and fry it until the eggs are cooked. Add diced onions, some peas, or other small bits of vegetables if you want. Use hot dog bits to make hash and eggs. Chop up potatoes, onions, and hot dogs into tiny pieces. Heat butter in a skillet and add the potatoes, then onions, then hot dogs. Be sure to flip the hash so it cooks on all sides. Fry up a couple of eggs in a separate skillet and serve them on top of the hash. For a variation, beat the eggs and pour them over the hash. Then form them up into patties. Cook them for a minute or two on both sides of the patty. Use hot dogs instead of beef in your favorite sloppy joe recipe. Use a can of sloppy joe sauce or your own secret recipe. Slice leftover hot dogs into small chunks. Throw the hot dog pieces into a heated skillet and pour the sloppy joe mix over the top. Heat to boiling. Serve on hamburger buns or bread for a traditional sloppy joe sandwich. Serve the sloppy joes on hot dog buns if you have lots of those leftover, too. Otherwise, serve it without the buns with cheese, onions, and jalapeños to toss on top. Making Other Dishes Mix up a Chicago-style hot dog salad. If you love Chicago-style hot dogs, make a tasty hot dog salad without the bun. Throw some sliced hot dogs, onions, pickles, peppers, cabbage and mixed greens into a bowl. Mix together mustard, oil, and honey. Drizzle the liquid over the salad. Slice the ingredients for a salad into large chunks, or dice everything except the hot dogs so the salad mixes together more completely. Put together hot dog tacos for a non-traditional meal. Grab your favorite type of tortilla and any taco fixings you want. Pile the tortilla with a whole hot dog or slices, and diced onions, jalapenos, cheese, relish, or avocado. This is an especially good option if you like eating gluten free. Use spinach or corn tortillas to avoid the flour in hot dog buns. Cook up a variation of cocktail weenies in your slow cooker. Cut the hot dogs into one to two inch (2.5-5 cm) long pieces and place them in your slow cooker. Add barbecue or chili sauce and grape jelly on top of the hot dogs. Cook for six to ten hours on the slow cooker’s low setting. The choice between barbecue and chili sauce is mainly one of personal taste. Each one gives the weenies a slightly different taste.",
  "tyn_model":[
    "hot dogs",
    "hot dog",
    "eggs",
    "skillet",
    "bacon",
    "onions",
    "slow cooker",
    "jalapenos",
    "butter",
    "potatoes",
    "corn dog muffins",
    "cornbread mix",
    "muffin tin",
    "corn dog",
    "crescent rolls",
    "baking sheet",
    "crescent roll",
    "chili",
    "chili cheese dogs",
    "mac and cheese",
    "milk",
    "hot dog fried rice",
    "carrots",
    "oiled skillet",
    "white rice",
    "rice",
    "peas",
    "hash",
    "sloppy joe recipe",
    "sloppy joe sauce",
    "sloppy joe mix",
    "hamburger buns",
    "sloppy joe sandwich",
    "jalapeños",
    "hot dog salad",
    "pickles",
    "peppers",
    "cabbage",
    "bowl",
    "mustard",
    "oil",
    "honey",
    "hot dog tacos",
    "tortilla",
    "avocado",
    "corn tortillas",
    "hot dog buns",
    "barbecue or chili sauce",
    "grape jelly",
    "barbecue and",
    "chili sauce"
  ],
  "tyn_section":[

  ]
}