{
  "title":"How to Play Voez",
  "url":"https://www.wikihow.com/Play-Voez",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Electronic Game Strategies"
  ],
  "parts":[
    {
      "name":"Understanding Gameplay",
      "steps":[
        {
          "headline":"Know the moves.",
          "description":"This game has 4 different techniques that can be used in every song. These are:\nSwiping motions (left and right)\nSliding motions (slide the white diamonds that appear)\nLong black bars (press down on them until it ends)\nRegular notes (the beats, tap on them and try not to miss any!)"
        },
        {
          "headline":"Pick a mode.",
          "description":"Modes range from and are available in all songs. You can pick which mode you want at the beginning of whatever song you are playing. The beat and melody will get more difficult to keep up with as you are in special or hard mode. There are all three modes available at the beginning of any song you play:\nEasy (easiest mode there is, perfect for beginners)\nHard mode (if you want to take things up a notch)\nSpecial (difficult and very tough depending on the mode!) In the image shown is the Easy, Medium and Special Modes. Every song as each mode."
        },
        {
          "headline":"Work your way through the levels.",
          "description":"The levels range from 1-17. Do keep in mind at there can be songs with different modes and higher/lower levels for them. That depends on how tough the song is to play! 1 is the easiest level of a song there is. 17 is the toughest level, there is only one song with a 17 level! In the image shown is an example of the Levels. We can see that this song is Level 3 easy, Level 8 hard and Level 13 special. This song is quite good for a beginner as it isn't hard to do. The name of the song is Lv.0."
        }
      ]
    },
    {
      "name":"Mastering the Game",
      "steps":[
        {
          "headline":"Play on an iPad or big tablet if possible.",
          "description":"You'll be able to see the notes a lot better."
        },
        {
          "headline":"Use your fingers, not your thumbs.",
          "description":"This will help you make sure you are hitting the notes accurately."
        },
        {
          "headline":"Try not to rush.",
          "description":"Play in time as best as you can. This ensures that your overall score is higher and you get a better grade (an A, B, C grade). Don't worry if you have lost your combo! Keep focusing and you can do it!"
        },
        {
          "headline":"Play the beats of the notes as best as you can without missing them.",
          "description":"Try the modes and levels that you are comfortable with. Don't purchase level 16 songs unless you are confident you can do well in them!"
        },
        {
          "headline":"Tackle combinations when needed.",
          "description":"It can get a bit complicated, you might get the bar and the slide motion at the same time, or the notes and the bar/swiping motion all going on at the same time."
        }
      ]
    },
    {
      "name":"Getting Keys",
      "steps":[
        {
          "headline":"Earn keys.",
          "description":"Completing tasks in the diary (on the starting page) can get you some keys. All songs cost 1 key. Songs such as 'Noel' or 'Run Lads Run' can only be purchased through a pack, which costs 5 keys; you cannot buy some songs separately!"
        },
        {
          "headline":"Consider purchasing keys (using real money).",
          "description":"You can purchase 10 keys for £5.00 too. This means that you can unlock 10 songs of your choice, or two 5 key packs. Either way, if you want more songs, purchasing keys can allow you to do that quickly!"
        }
      ]
    }
  ],
  "text":" Understanding Gameplay Know the moves. This game has 4 different techniques that can be used in every song. These are:\nSwiping motions (left and right)\nSliding motions (slide the white diamonds that appear)\nLong black bars (press down on them until it ends)\nRegular notes (the beats, tap on them and try not to miss any!) Pick a mode. Modes range from and are available in all songs. You can pick which mode you want at the beginning of whatever song you are playing. The beat and melody will get more difficult to keep up with as you are in special or hard mode. There are all three modes available at the beginning of any song you play:\nEasy (easiest mode there is, perfect for beginners)\nHard mode (if you want to take things up a notch)\nSpecial (difficult and very tough depending on the mode!) In the image shown is the Easy, Medium and Special Modes. Every song as each mode. Work your way through the levels. The levels range from 1-17. Do keep in mind at there can be songs with different modes and higher/lower levels for them. That depends on how tough the song is to play! 1 is the easiest level of a song there is. 17 is the toughest level, there is only one song with a 17 level! In the image shown is an example of the Levels. We can see that this song is Level 3 easy, Level 8 hard and Level 13 special. This song is quite good for a beginner as it isn't hard to do. The name of the song is Lv.0. Mastering the Game Play on an iPad or big tablet if possible. You'll be able to see the notes a lot better. Use your fingers, not your thumbs. This will help you make sure you are hitting the notes accurately. Try not to rush. Play in time as best as you can. This ensures that your overall score is higher and you get a better grade (an A, B, C grade). Don't worry if you have lost your combo! Keep focusing and you can do it! Play the beats of the notes as best as you can without missing them. Try the modes and levels that you are comfortable with. Don't purchase level 16 songs unless you are confident you can do well in them! Tackle combinations when needed. It can get a bit complicated, you might get the bar and the slide motion at the same time, or the notes and the bar/swiping motion all going on at the same time. Getting Keys Earn keys. Completing tasks in the diary (on the starting page) can get you some keys. All songs cost 1 key. Songs such as 'Noel' or 'Run Lads Run' can only be purchased through a pack, which costs 5 keys; you cannot buy some songs separately! Consider purchasing keys (using real money). You can purchase 10 keys for £5.00 too. This means that you can unlock 10 songs of your choice, or two 5 key packs. Either way, if you want more songs, purchasing keys can allow you to do that quickly!",
  "tyn_model":[
    "keys",
    "game"
  ],
  "tyn_section":[

  ]
}