{
  "title":"How to Serve Plum Wine",
  "url":"https://www.wikihow.com/Serve-Plum-Wine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "methods":[
    {
      "name":"Serving Plum Wine on the Rocks",
      "steps":[
        {
          "headline":"Place a glass in the freezer for about an hour.",
          "description":"After an hour, the glass should have a slight frost on it. The frost and the coldness of the glass will help keep your plum wine cold as you drink it. If you don’t want to chill your glass, you don’t have to. However, without chilling your glass, your plum wine will warm more quickly."
        },
        {
          "headline":"Fill a glass halfway with ice cubes.",
          "description":"Gently drop some cubes into your glass. Depending on the size of the glass (and cubes), you’ll use anywhere between 4 and 8 cubes. Ultimately, the cubes should rise to at least halfway or slightly above the halfway mark of the glass. Instead of ice, consider freezing and using grapes or cherries."
        },
        {
          "headline":"Pour the plum wine until it reaches the top of the ice cubes.",
          "description":"After you’ve placed ice cubes in your glass, slowly pour plum wine onto the cubes. Stop when you see the level of the wine approaching the top of the ice cubes. Parts of the cubes should stick out above the plum wine."
        },
        {
          "headline":"Add water if you want your wine to be less sweet.",
          "description":"While some people like to drink plum wine on the rocks without diluting it, others prefer to add water. Adding water will dilute the very sweet taste of the wine. Ultimately, the amount of water you add depends on you. However, when adding water:\nStart with as little as possible like a tablespoon or two (15 to 30 ml). Mix thoroughly before adding more water. Add more water until you’re satisfied with the sweetness."
        }
      ]
    },
    {
      "name":"Creating Mixed Drinks with Plum Wine",
      "steps":[
        {
          "headline":"Make a plum wine sour.",
          "description":"Pour 3 ounces (80 ml) of plum wine into a cocktail shaker. Add 1 ounce (35 ml) of fresh lemon juice, and half an ounce (15 ml) of simple syrup. If you want, you can add half an ounce (15 ml) of egg white. Shake the mixture vigorously. Then, pour it into a cocktail glass and garnish with a lemon wedge and a cherry. Serve chilled. Consider substituting fresh lemon juice with lemon concentrate or a lemon cocktail mix. The egg white will thicken the drink and make it foamy."
        },
        {
          "headline":"Serve a plum wine tonic.",
          "description":"Pour one part plum wine into a wine or cocktail glass. Then, add 3 parts tonic water. Gently stir the wine and water together with a spoon. If you want, you can use flavored tonic water (like orange, lemon, or lime) to add extra character to your tonic. Chill the tonic water and plum wine before mixing it. You can also substitute carbonated/soda water for tonic water to make a plum wine soda."
        },
        {
          "headline":"Create a plum wine tea.",
          "description":"Brew a cup of green tea. Pour it in a mug or a tea cup. Then, add an equal amount of plum wine. Mix the combination together with a spoon. Your plum wine should be at room temperature to prevent it from cooling the tea too much. Serve hot."
        },
        {
          "headline":"Serve a plum martini.",
          "description":"Fill a martini shaker up to the halfway mark with ice. Pour 4 ounces (120 ml) of plum wine into the shaker. Add 2 ounces (60 ml) of vodka. Place your lid on the shaker and shake it. Strain the mixture into a martini or similar serving glass. Chill your martini or serving glass before using. Garnish the martini with mint, a tea leaf, or a cherry. Also, consider garnishing your plum wine with a shiso leaf for an authentic flare."
        }
      ]
    },
    {
      "name":"Pairing Plum Wine with Food",
      "steps":[
        {
          "headline":"Serve sushi with plum wine.",
          "description":"As a Japanese traditional drink, plum wine is often eaten with sushi. Most sushi rolls are compatible with plum wine, so you can pick your favorite sushi roll. However, when purchasing or preparing your sushi, focus on spicy rolls and rolls that have shrimp and crab in them. The flavors of these rolls will complement the plum wine. Consider serving your plum wine warm (by heating it in a small saucepan on your stovetop for a couple of minutes) or mixed with hot tea when eating sushi."
        },
        {
          "headline":"Eat spicy Chinese food with plum wine.",
          "description":"Consider serving traditional Szechuan dishes (like Szechuan chicken or pork) with your plum wine. The seasonings used in Szechuan style cooking and the spiciness of it will complement your plum wine. The seasonings and spiciness will help you to experience flavors in your plum wine that you never noticed before."
        },
        {
          "headline":"Prepare a savory chicken or fish meal.",
          "description":"East Asian food isn’t the only food you can pair with plum wine. Instead, prepare a light-flavored chicken or fish meal. Bake or sauté the chicken or fish. In addition, rely on spices like rosemary, thyme, and sage. Some meals to consider preparing include:\nMushroom chicken\nChicken piccata\nShrimp scampi\nGrilled tuna"
        }
      ]
    }
  ],
  "text":" Serving Plum Wine on the Rocks Place a glass in the freezer for about an hour. After an hour, the glass should have a slight frost on it. The frost and the coldness of the glass will help keep your plum wine cold as you drink it. If you don’t want to chill your glass, you don’t have to. However, without chilling your glass, your plum wine will warm more quickly. Fill a glass halfway with ice cubes. Gently drop some cubes into your glass. Depending on the size of the glass (and cubes), you’ll use anywhere between 4 and 8 cubes. Ultimately, the cubes should rise to at least halfway or slightly above the halfway mark of the glass. Instead of ice, consider freezing and using grapes or cherries. Pour the plum wine until it reaches the top of the ice cubes. After you’ve placed ice cubes in your glass, slowly pour plum wine onto the cubes. Stop when you see the level of the wine approaching the top of the ice cubes. Parts of the cubes should stick out above the plum wine. Add water if you want your wine to be less sweet. While some people like to drink plum wine on the rocks without diluting it, others prefer to add water. Adding water will dilute the very sweet taste of the wine. Ultimately, the amount of water you add depends on you. However, when adding water:\nStart with as little as possible like a tablespoon or two (15 to 30 ml). Mix thoroughly before adding more water. Add more water until you’re satisfied with the sweetness. Creating Mixed Drinks with Plum Wine Make a plum wine sour. Pour 3 ounces (80 ml) of plum wine into a cocktail shaker. Add 1 ounce (35 ml) of fresh lemon juice, and half an ounce (15 ml) of simple syrup. If you want, you can add half an ounce (15 ml) of egg white. Shake the mixture vigorously. Then, pour it into a cocktail glass and garnish with a lemon wedge and a cherry. Serve chilled. Consider substituting fresh lemon juice with lemon concentrate or a lemon cocktail mix. The egg white will thicken the drink and make it foamy. Serve a plum wine tonic. Pour one part plum wine into a wine or cocktail glass. Then, add 3 parts tonic water. Gently stir the wine and water together with a spoon. If you want, you can use flavored tonic water (like orange, lemon, or lime) to add extra character to your tonic. Chill the tonic water and plum wine before mixing it. You can also substitute carbonated/soda water for tonic water to make a plum wine soda. Create a plum wine tea. Brew a cup of green tea. Pour it in a mug or a tea cup. Then, add an equal amount of plum wine. Mix the combination together with a spoon. Your plum wine should be at room temperature to prevent it from cooling the tea too much. Serve hot. Serve a plum martini. Fill a martini shaker up to the halfway mark with ice. Pour 4 ounces (120 ml) of plum wine into the shaker. Add 2 ounces (60 ml) of vodka. Place your lid on the shaker and shake it. Strain the mixture into a martini or similar serving glass. Chill your martini or serving glass before using. Garnish the martini with mint, a tea leaf, or a cherry. Also, consider garnishing your plum wine with a shiso leaf for an authentic flare. Pairing Plum Wine with Food Serve sushi with plum wine. As a Japanese traditional drink, plum wine is often eaten with sushi. Most sushi rolls are compatible with plum wine, so you can pick your favorite sushi roll. However, when purchasing or preparing your sushi, focus on spicy rolls and rolls that have shrimp and crab in them. The flavors of these rolls will complement the plum wine. Consider serving your plum wine warm (by heating it in a small saucepan on your stovetop for a couple of minutes) or mixed with hot tea when eating sushi. Eat spicy Chinese food with plum wine. Consider serving traditional Szechuan dishes (like Szechuan chicken or pork) with your plum wine. The seasonings used in Szechuan style cooking and the spiciness of it will complement your plum wine. The seasonings and spiciness will help you to experience flavors in your plum wine that you never noticed before. Prepare a savory chicken or fish meal. East Asian food isn’t the only food you can pair with plum wine. Instead, prepare a light-flavored chicken or fish meal. Bake or sauté the chicken or fish. In addition, rely on spices like rosemary, thyme, and sage. Some meals to consider preparing include:\nMushroom chicken\nChicken piccata\nShrimp scampi\nGrilled tuna",
  "tyn_model":[
    "plum wine",
    "glass",
    "water",
    "ice cubes",
    "tonic water",
    "ice",
    "spoon",
    "seasonings",
    "freezer",
    "cocktail shaker",
    "fresh lemon",
    "simple syrup",
    "cocktail glass",
    "lemon",
    "cherry",
    "lemon concentrate",
    "lemon cocktail mix",
    "plum wine tonic",
    "wine or cocktail glass",
    "carbonated/soda water",
    "plum wine soda",
    "plum wine tea",
    "green tea",
    "mug",
    "tea cup",
    "martini shaker",
    "vodka",
    "martini or similar serving glass",
    "mint",
    "tea leaf",
    "sushi",
    "shrimp",
    "crab",
    "rosemary",
    "thyme",
    "sage",
    "mushroom chicken",
    "chicken piccata",
    "grilled tuna"
  ],
  "tyn_section":[

  ]
}