{
  "title":"How to Make a Fudge Style Milk Jelly",
  "url":"https://www.wikihow.com/Make-a-Fudge-Style-Milk-Jelly",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Jams and Jellies"
  ],
  "steps":[
    {
      "headline":"Boil the milk and agar-agar powder together.",
      "description":"Allow the mixture to simmer until the milk slightly evaporates."
    },
    {
      "headline":"Remove from the stove.",
      "description":""
    },
    {
      "headline":"Add the cardamom powder, sugar and condensed milk to the milk mixture.",
      "description":"Mix well and allow the milk to cool slightly."
    },
    {
      "headline":"Add the vanilla essence (extract) and mix well.",
      "description":"Add the cream and mix well."
    },
    {
      "headline":"Pour the mixture into a glass casserole dish.",
      "description":"Leave to allow it to set."
    },
    {
      "headline":"Decorate with almonds, desiccated coconut, or silver cake beads.",
      "description":"While these are an optional extra, they improve the appearance."
    },
    {
      "headline":"Place the casserole dish into the fridge.",
      "description":"When the jelly is cold enough, it is ready for serving."
    },
    {
      "headline":"Slice and serve.",
      "description":"This can be served as a dessert or on its own as a sweet serving."
    },
    {
      "headline":"This dessert is similar to panna cotta.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Boil the milk and agar-agar powder together. Allow the mixture to simmer until the milk slightly evaporates. Remove from the stove.  Add the cardamom powder, sugar and condensed milk to the milk mixture. Mix well and allow the milk to cool slightly. Add the vanilla essence (extract) and mix well. Add the cream and mix well. Pour the mixture into a glass casserole dish. Leave to allow it to set. Decorate with almonds, desiccated coconut, or silver cake beads. While these are an optional extra, they improve the appearance. Place the casserole dish into the fridge. When the jelly is cold enough, it is ready for serving. Slice and serve. This can be served as a dessert or on its own as a sweet serving. This dessert is similar to panna cotta.  Finished. ",
  "tyn_model":[
    "milk",
    "agar-agar",
    "stove",
    "cardamom powder",
    "sugar",
    "condensed milk",
    "vanilla essence",
    "cream",
    "glass casserole dish",
    "almonds",
    "coconut",
    "silver cake beads",
    "casserole dish",
    "jelly"
  ],
  "tyn_section":[

  ]
}