{
  "title":"How to Make a Cleansing Soup",
  "url":"https://www.wikihow.com/Make-a-Cleansing-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Soups"
  ],
  "methods":[
    {
      "name":"Beetroot and garlic cleansing soup",
      "steps":[
        {
          "headline":"Gather the ingredients listed above.",
          "description":""
        },
        {
          "headline":"Pour the water into a soup pot.",
          "description":"Add all the ingredients to the water."
        },
        {
          "headline":"Bring the mixture to a boil.",
          "description":""
        },
        {
          "headline":"Once the mixture is boiling, reduce the heat and simmer on low heat for one hour.",
          "description":""
        },
        {
          "headline":"Enjoy your cleansing soup!",
          "description":""
        }
      ]
    },
    {
      "name":"Green pea and mint cleansing soup",
      "steps":[
        {
          "headline":"Add the coconut oil to the saucepan.",
          "description":"Melt over medium heat."
        },
        {
          "headline":"Add the scallions and a pinch of salt.",
          "description":"Cook for about 5 minutes, or until the scallions have softened."
        },
        {
          "headline":"Add the garlic.",
          "description":"Cook for 1 minute."
        },
        {
          "headline":"Pour in 3 cups of boiling water.",
          "description":"Add the peas."
        },
        {
          "headline":"Bring to a simmer.",
          "description":"Cook until the peas turn bright green. If using frozen peas, they should be unfrozen now. This will take about 1 to 2 minutes."
        },
        {
          "headline":"Remove from the heat.",
          "description":"Ladle the soup into a blender. Add mint leaves, lemon zest and olive oil."
        },
        {
          "headline":"Blend to form a puree.",
          "description":"Hold down the lid to prevent it from blowing off. Season to taste."
        },
        {
          "headline":"Ladle the soup into bowls.",
          "description":"If you like, drizzle some olive oil and add a mint leaf on top of the soup."
        },
        {
          "headline":"Serve immediately.",
          "description":""
        }
      ]
    },
    {
      "name":"Chicken broth cleansing soup",
      "steps":[
        {
          "headline":"Pour the chicken broth into the pot or saucepan.",
          "description":"Add the onion and ginger slices."
        },
        {
          "headline":"Bring to the boil.",
          "description":""
        },
        {
          "headline":"Add the chicken breast.",
          "description":"Reduce the heat to medium. Simmer for 15 minutes or until the chicken breast is soft and well cooked."
        },
        {
          "headline":"Remove the chicken breast.",
          "description":"Slice it into small pieces. Add the pieces back to the broth."
        },
        {
          "headline":"Add the bok choy and fish sauce.",
          "description":"Cook for 5 minutes, then remove from the stove."
        },
        {
          "headline":"Pour into the serving bowls.",
          "description":"Add a pinch of cayenne pepper as garnish. Fresh herb leaves could also be added."
        }
      ]
    }
  ],
  "text":" Beetroot and garlic cleansing soup Gather the ingredients listed above.  Pour the water into a soup pot. Add all the ingredients to the water. Bring the mixture to a boil.  Once the mixture is boiling, reduce the heat and simmer on low heat for one hour.  Enjoy your cleansing soup!  Green pea and mint cleansing soup Add the coconut oil to the saucepan. Melt over medium heat. Add the scallions and a pinch of salt. Cook for about 5 minutes, or until the scallions have softened. Add the garlic. Cook for 1 minute. Pour in 3 cups of boiling water. Add the peas. Bring to a simmer. Cook until the peas turn bright green. If using frozen peas, they should be unfrozen now. This will take about 1 to 2 minutes. Remove from the heat. Ladle the soup into a blender. Add mint leaves, lemon zest and olive oil. Blend to form a puree. Hold down the lid to prevent it from blowing off. Season to taste. Ladle the soup into bowls. If you like, drizzle some olive oil and add a mint leaf on top of the soup. Serve immediately.  Chicken broth cleansing soup Pour the chicken broth into the pot or saucepan. Add the onion and ginger slices. Bring to the boil.  Add the chicken breast. Reduce the heat to medium. Simmer for 15 minutes or until the chicken breast is soft and well cooked. Remove the chicken breast. Slice it into small pieces. Add the pieces back to the broth. Add the bok choy and fish sauce. Cook for 5 minutes, then remove from the stove. Pour into the serving bowls. Add a pinch of cayenne pepper as garnish. Fresh herb leaves could also be added.",
  "tyn_model":[
    "water",
    "garlic",
    "peas",
    "olive oil",
    "chicken broth",
    "beetroot",
    "soup pot",
    "mint",
    "coconut oil",
    "saucepan",
    "scallions",
    "salt",
    "blender",
    "lemon",
    "pot or saucepan",
    "onion",
    "ginger",
    "chicken breast",
    "broth",
    "bok choy",
    "fish sauce",
    "stove",
    "cayenne pepper"
  ],
  "tyn_section":[

  ]
}