{
  "title":"How to Prevent Mold from Growing in Your Home",
  "url":"https://www.wikihow.com/Prevent-Mold-from-Growing-in-Your-Home",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Mold and Mildew Treatment"
  ],
  "parts":[
    {
      "name":"Controlling Moisture",
      "steps":[
        {
          "headline":"Keep an eye on the humidity levels.",
          "description":"Mold grows where there's moisture, so keeping your house dry is one of the most important ways to prevent mold. Install a hygrometer in your home, as this will measure the moisture levels inside. Ideally, you want to keep the humidity level in your house below 60 percent to prevent mold growth."
        },
        {
          "headline":"Open windows when bathing.",
          "description":"To prevent too much moisture from building up in the bathroom when you shower or bathe, open a window in the bathroom to vent out moisture. If you don’t have a window in the bathroom, leave the door open and open the closest window you can."
        },
        {
          "headline":"Wipe down the walls after bathing.",
          "description":"Moisture from a shower or bath that sits on the walls of the shower or tub can lead to mold growth. The best way to stop this from happening is to wipe down the walls with a sponge, towel, or squeegee after every time you bathe. It’s important to get your whole family on board with wiping down the walls after every shower. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley Matuska\t\t\tCleaning Guru\t\t\t\tIf you're having trouble with mold in your shower even though you're cleaning regularly, it may need to be re-caulked."
        },
        {
          "headline":"Don’t ignore damp clothes.",
          "description":"When you're doing laundry, don’t leave wet clothes to sit in the washing machine, as mold will start to grow on the clothes. As soon as the washing cycle is complete, remove the clothes from the machine and transfer them to the drier or the line. If you need help remembering to transfer clothes, set a timer when you do laundry. Similarly, never leave damp clothes or towels lying around on the floor or bunched up in a laundry basket. Always hang wet things to dry."
        },
        {
          "headline":"Don’t hang clothes to dry inside.",
          "description":"If you don’t have a drier or prefer to line dry clothes to save energy, always hang the clothes outside. Any water that evaporates from the clothes will otherwise hang in the air in your home, and this can lead to mold growth on walls, floors, and other surfaces. In winter, if you have to hang clothes to dry inside, make sure the room is well-ventilated, that air is circulating, and that air and moisture from inside are pushed outside with fans."
        },
        {
          "headline":"Clean spills and floods immediately.",
          "description":"It only takes between 24 and 48 hours for mold to begin growing on wet surfaces. To prevent this, address standing water as soon as the spill, leak, or flood occurs. This includes water on:\nCarpets and floors\nFurniture\nClothing\nBedding\nFoundation walls and basement floors"
        },
        {
          "headline":"Use exhaust fans and vents.",
          "description":"Exhaust vents are important in many rooms in your house, including the kitchen, bathroom, and laundry room. In the kitchen and bathroom, turn on exhaust fans anytime you cook or bathe. In the laundry room, make sure the drier is being vented to the outside. You should also make sure that your crawl space and basement are properly ventilated. If the air isn't circulating enough, install vents or fans."
        },
        {
          "headline":"Empty drip trays regularly.",
          "description":"Some appliances are equipped with drip trays that catch water and moisture. This includes refrigerators, air conditioners, and dehumidifiers. Make sure you drain and clean these regularly to prevent mold from growing in them. Emptying drip trays will also prevent spills, leaks, and overflows, which can lead to moisture problems under the fridge, near window sills, and on basement floors."
        },
        {
          "headline":"Increase ventilation and air circulation.",
          "description":"Keeping the air moving in your house and providing a source of fresh air will really help to control the humidity in your home. When the weather allows, open the windows to vent out stale air, and use ceiling fans year-round to circulate the air inside. If you don’t have ceiling fans, you can also use standing or oscillating fans to circulate air."
        },
        {
          "headline":"Run a dehumidifier.",
          "description":"A dehumidifier will remove any moisture from the air that you aren't able to prevent, and will help you control the humidity in the house. It’s particularly important to have dehumidifiers in damp areas, such as basements and crawl spaces. If you have a large home, consider setting up at least two dehumidifiers in different areas of the house."
        },
        {
          "headline":"Replace basement and bathroom carpets with area rugs.",
          "description":"Areas that are prone to being wet shouldn’t be fully carpeted. This includes basements that are damp or prone to flooding, and bathrooms. Instead, remove the carpet and install area rugs if necessary. Area rugs are better than carpet because they can be removed, cleaned, and dried if they get wet."
        },
        {
          "headline":"Improve insulation.",
          "description":"Cold surfaces such as walls, pipes, and tanks are susceptible to having condensation form on them. You can prevent this with extra insulation. Outfit metal pipes with insulating sleeves, wrap toilet and water tanks with insulating blankets, and add more insulation to basement, exterior wall, and attic floors, ceilings, and windows. If condensation has formed on any of these surfaces, dry it immediately and inspect it regularly to keep it dry."
        },
        {
          "headline":"Fix leaks.",
          "description":"Leaks are a main cause of moisture problems in a house, which can come from pipes, appliances, the roof, and faucets and taps. Inspect your home regularly for leaks and signs of water damage, and repair issues immediately. Don’t forget to check for leaks:\nUnder sinks\nAround fridges, water coolers, and ice makers\nUnder floors, especially in the basement\nAround air conditioners\nNear toilets, tubs, and showers"
        }
      ]
    },
    {
      "name":"Keeping Moisture Out of the House",
      "steps":[
        {
          "headline":"Drain water away from your house.",
          "description":"Water can also get into your house from outside, and preventing this will protect your house from excess moisture inside. Along with fixing leaks in the roof and elsewhere in the house, you can also get rid of water by making sure that water is drawn away from your house. One way to do this is by installing extra gutters if necessary to direct rainwater away from your home. If you have trouble with groundwater coming in, consider installing vapor barriers in the basement and a sump pump system that will collect water."
        },
        {
          "headline":"Clean and fix gutters.",
          "description":"Gutters are an integral part of the system that keeps water away from your house, so it’s important to keep them clean and well maintained. Clean the gutters every fall and spring to remove dirt, debris, leaves, and other matter. Address leaks in your gutters as soon as you notice them. If you can't repair the leak, replace the section of damaged gutter."
        },
        {
          "headline":"Install plastic sheets in crawl spaces.",
          "description":"A crawl space that has a dirt floor is susceptible to mold, because moisture coming up from the ground can make the area wet all the time. To prevent this, dry out the area with fans, and then cover the dirt with a sheet of plastic. Covering the dirt won’t necessarily prevent moisture from coming up, but it will stop mold from growing in the crawl space itself."
        }
      ]
    },
    {
      "name":"Keeping the House Clean and Cool",
      "steps":[
        {
          "headline":"Vacuum and dust regularly.",
          "description":"Keeping your house vacuumed and dusted will remove mold spores that enter your home, and this will prevent the mold from taking root and growing. For the best results, vacuum and dust your entire home weekly. Ideally, you should use a vacuum that has a HEPA filter, but this isn't strictly necessary."
        },
        {
          "headline":"Run filters.",
          "description":"Along with vacuuming, running filters or air purifiers in your house will also help to eliminate mold spores in the air. Filters can be particularly useful in damp areas like bathrooms, basements, and attics, as well as near entryways like doors and windows. HEPA filters are among the most effective filters, and are able to remove over 99 percent of pollutants from the air."
        },
        {
          "headline":"Let the sun in.",
          "description":"Mold grows best in dark areas, so allowing natural light into your house can prevent it from growing. During the day, open all your curtains to allow natural light in. The heat from the sun will also help to dry up any moisture in the house. In summer, outfit your windows with lighter drapes and curtains that allow light to pass through. This isn't always practical in winter, because lightweight drapes allow too much cold air in."
        },
        {
          "headline":"Maintain the temperature.",
          "description":"Just as mold prefers dark spaces, so too does it grow better in warm areas. In the summer, use your air conditioner to keep your house cool, dry, and comfortable. Most molds cannot grow if the temperature is below 70 F (21 C). Keeping your house at this temperature would be very expensive and inefficient, but you can still use the air conditioner to keep the air dry and relatively cool. In winter, keep the heat as low as possible while still being comfortable."
        }
      ]
    }
  ],
  "text":" Controlling Moisture Keep an eye on the humidity levels. Mold grows where there's moisture, so keeping your house dry is one of the most important ways to prevent mold. Install a hygrometer in your home, as this will measure the moisture levels inside. Ideally, you want to keep the humidity level in your house below 60 percent to prevent mold growth. Open windows when bathing. To prevent too much moisture from building up in the bathroom when you shower or bathe, open a window in the bathroom to vent out moisture. If you don’t have a window in the bathroom, leave the door open and open the closest window you can. Wipe down the walls after bathing. Moisture from a shower or bath that sits on the walls of the shower or tub can lead to mold growth. The best way to stop this from happening is to wipe down the walls with a sponge, towel, or squeegee after every time you bathe. It’s important to get your whole family on board with wiping down the walls after every shower. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley Matuska\t\t\tCleaning Guru\t\t\t\tIf you're having trouble with mold in your shower even though you're cleaning regularly, it may need to be re-caulked. Don’t ignore damp clothes. When you're doing laundry, don’t leave wet clothes to sit in the washing machine, as mold will start to grow on the clothes. As soon as the washing cycle is complete, remove the clothes from the machine and transfer them to the drier or the line. If you need help remembering to transfer clothes, set a timer when you do laundry. Similarly, never leave damp clothes or towels lying around on the floor or bunched up in a laundry basket. Always hang wet things to dry. Don’t hang clothes to dry inside. If you don’t have a drier or prefer to line dry clothes to save energy, always hang the clothes outside. Any water that evaporates from the clothes will otherwise hang in the air in your home, and this can lead to mold growth on walls, floors, and other surfaces. In winter, if you have to hang clothes to dry inside, make sure the room is well-ventilated, that air is circulating, and that air and moisture from inside are pushed outside with fans. Clean spills and floods immediately. It only takes between 24 and 48 hours for mold to begin growing on wet surfaces. To prevent this, address standing water as soon as the spill, leak, or flood occurs. This includes water on:\nCarpets and floors\nFurniture\nClothing\nBedding\nFoundation walls and basement floors Use exhaust fans and vents. Exhaust vents are important in many rooms in your house, including the kitchen, bathroom, and laundry room. In the kitchen and bathroom, turn on exhaust fans anytime you cook or bathe. In the laundry room, make sure the drier is being vented to the outside. You should also make sure that your crawl space and basement are properly ventilated. If the air isn't circulating enough, install vents or fans. Empty drip trays regularly. Some appliances are equipped with drip trays that catch water and moisture. This includes refrigerators, air conditioners, and dehumidifiers. Make sure you drain and clean these regularly to prevent mold from growing in them. Emptying drip trays will also prevent spills, leaks, and overflows, which can lead to moisture problems under the fridge, near window sills, and on basement floors. Increase ventilation and air circulation. Keeping the air moving in your house and providing a source of fresh air will really help to control the humidity in your home. When the weather allows, open the windows to vent out stale air, and use ceiling fans year-round to circulate the air inside. If you don’t have ceiling fans, you can also use standing or oscillating fans to circulate air. Run a dehumidifier. A dehumidifier will remove any moisture from the air that you aren't able to prevent, and will help you control the humidity in the house. It’s particularly important to have dehumidifiers in damp areas, such as basements and crawl spaces. If you have a large home, consider setting up at least two dehumidifiers in different areas of the house. Replace basement and bathroom carpets with area rugs. Areas that are prone to being wet shouldn’t be fully carpeted. This includes basements that are damp or prone to flooding, and bathrooms. Instead, remove the carpet and install area rugs if necessary. Area rugs are better than carpet because they can be removed, cleaned, and dried if they get wet. Improve insulation. Cold surfaces such as walls, pipes, and tanks are susceptible to having condensation form on them. You can prevent this with extra insulation. Outfit metal pipes with insulating sleeves, wrap toilet and water tanks with insulating blankets, and add more insulation to basement, exterior wall, and attic floors, ceilings, and windows. If condensation has formed on any of these surfaces, dry it immediately and inspect it regularly to keep it dry. Fix leaks. Leaks are a main cause of moisture problems in a house, which can come from pipes, appliances, the roof, and faucets and taps. Inspect your home regularly for leaks and signs of water damage, and repair issues immediately. Don’t forget to check for leaks:\nUnder sinks\nAround fridges, water coolers, and ice makers\nUnder floors, especially in the basement\nAround air conditioners\nNear toilets, tubs, and showers Keeping Moisture Out of the House Drain water away from your house. Water can also get into your house from outside, and preventing this will protect your house from excess moisture inside. Along with fixing leaks in the roof and elsewhere in the house, you can also get rid of water by making sure that water is drawn away from your house. One way to do this is by installing extra gutters if necessary to direct rainwater away from your home. If you have trouble with groundwater coming in, consider installing vapor barriers in the basement and a sump pump system that will collect water. Clean and fix gutters. Gutters are an integral part of the system that keeps water away from your house, so it’s important to keep them clean and well maintained. Clean the gutters every fall and spring to remove dirt, debris, leaves, and other matter. Address leaks in your gutters as soon as you notice them. If you can't repair the leak, replace the section of damaged gutter. Install plastic sheets in crawl spaces. A crawl space that has a dirt floor is susceptible to mold, because moisture coming up from the ground can make the area wet all the time. To prevent this, dry out the area with fans, and then cover the dirt with a sheet of plastic. Covering the dirt won’t necessarily prevent moisture from coming up, but it will stop mold from growing in the crawl space itself. Keeping the House Clean and Cool Vacuum and dust regularly. Keeping your house vacuumed and dusted will remove mold spores that enter your home, and this will prevent the mold from taking root and growing. For the best results, vacuum and dust your entire home weekly. Ideally, you should use a vacuum that has a HEPA filter, but this isn't strictly necessary. Run filters. Along with vacuuming, running filters or air purifiers in your house will also help to eliminate mold spores in the air. Filters can be particularly useful in damp areas like bathrooms, basements, and attics, as well as near entryways like doors and windows. HEPA filters are among the most effective filters, and are able to remove over 99 percent of pollutants from the air. Let the sun in. Mold grows best in dark areas, so allowing natural light into your house can prevent it from growing. During the day, open all your curtains to allow natural light in. The heat from the sun will also help to dry up any moisture in the house. In summer, outfit your windows with lighter drapes and curtains that allow light to pass through. This isn't always practical in winter, because lightweight drapes allow too much cold air in. Maintain the temperature. Just as mold prefers dark spaces, so too does it grow better in warm areas. In the summer, use your air conditioner to keep your house cool, dry, and comfortable. Most molds cannot grow if the temperature is below 70 F (21 C). Keeping your house at this temperature would be very expensive and inefficient, but you can still use the air conditioner to keep the air dry and relatively cool. In winter, keep the heat as low as possible while still being comfortable.",
  "tyn_model":[
    "water",
    "filters",
    "fans",
    "dehumidifiers",
    "area rugs",
    "insulation",
    "exhaust fans",
    "air conditioners",
    "dehumidifier",
    "gutters",
    "vacuum",
    "air conditioner",
    "bath",
    "sponge",
    "towel",
    "squeegee",
    "dashing maids",
    "washing machine",
    "drier",
    "towels",
    "exhaust vents",
    "refrigerators",
    "ceiling fans",
    "carpet",
    "insulating blankets",
    "pipes",
    "sinks",
    "water coolers",
    "ice makers",
    "toilets",
    "showers",
    "sump pump",
    "plastic",
    "dust",
    "hepa filter",
    "vacuuming",
    "air purifiers",
    "hepa filters",
    "curtains"
  ],
  "tyn_section":[

  ]
}