{
  "title":"How to Pose for a Selfie",
  "url":"https://www.wikihow.com/Pose-for-a-Selfie",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Genres",
    "People and Portrait Photography",
    "Self Portrait Photographs"
  ],
  "methods":[
    {
      "name":"Angling Your Face",
      "steps":[
        {
          "headline":"Figure out your best side.",
          "description":"Straight on photos are generally not as flattering as a photo where your face is angled. Look into your camera, or use a mirror, and examine your face from various angles. Most people prefer one side of their face to the other, so tilt that side toward your camera to take a good selfie. Swivel each of your shoulders away from the camera one at a time to help figure out your best angle."
        },
        {
          "headline":"Take the photo from slightly above.",
          "description":"Pictures shot from above are more flattering than those shot from below. Raise your arms slightly to take the photo from an elevated position. Hold the camera just slightly above face level. Don't hold the camera so high that you look shrunken."
        },
        {
          "headline":"Tilt your chin down.",
          "description":"Gently angle your chin downwards, towards the floor. Holding your chin slightly down and the camera slightly up shows the harmonious flow of the cheekbones toward the lips. This angle may work best if your forehead is on the shorter side."
        },
        {
          "headline":"Extend your neck slightly forward.",
          "description":"Holding your head the right way can help you avoid any double chin or awkward faces. When posing, extend your neck so that your face is closer to the camera. It may feel weird, but it will help you look better in a selfie. This angle helps define your jawline."
        }
      ]
    },
    {
      "name":"Wearing an Attractive Facial Expression",
      "steps":[
        {
          "headline":"Smile sincerely.",
          "description":"To get a smile that looks real, don't force a grin. If you're feeling happy, just think of how happy you are and smile. If you aren't really there but you want a smiley selfie, relax and let a good feeling come to you. Take a deep breath and let it out. Think of someone who makes you happy, and imagine smiling at them. Let your eyes crinkle up slightly when you smile, but don't force it by squinting."
        },
        {
          "headline":"Pose your eyes.",
          "description":"The eyes are the star of the selfie. Look directly at the camera lens when you pose so that it looks like you're looking at the viewer. Smiling and making eye contact will help you look friendly and inviting. For a coy look, try casting your eyes downward and to the side. Widen your eyes and raise your eyebrows slightly to look alert, innocent, or surprised."
        },
        {
          "headline":"Pout a little.",
          "description":"Pouting deepens the lines of your cheekbones and makes your lips look fuller. Try whispering the word \"prune\" for a perfect pout. If you exaggerate your pout, you may get a \"duck face\" expression, which many consider silly."
        },
        {
          "headline":"Try different dynamic facial expressions.",
          "description":"Smiling is only one way to interest people in your selfie. Try frowning, winking, sticking out your tongue, opening your mouth as if surprised, or biting your lip. For a cute puppy look, try sticking out your lower lip while tilting your chin down and looking right into the camera. Relaxing your face so that your expression is blank can be flattering, but your photo won't be as interesting."
        }
      ]
    },
    {
      "name":"Posing Your Body",
      "steps":[
        {
          "headline":"Swivel a bit to the side.",
          "description":"To slim your waist and show off your shoulders and hips, turn your body slightly when you take your photo. If you're standing, shift your weight onto one foot to give your torso a more angular posture."
        },
        {
          "headline":"Bend your arms and legs.",
          "description":"Use the arm that isn't taking the shot to frame your figure. Try putting a hand high on your waist to frame your torso, or crook your elbow and put a hand behind your head to show off your upper arm. Bend your knee or cross your legs for a more dynamic position."
        },
        {
          "headline":"Prop your head up if you're lying down.",
          "description":"When taking a lying-down selfie, don't let your face get swallowed up by gravity. Use a pillow, or put a hand behind your head. Take the photo from slightly above your eye level, just as if you were standing."
        },
        {
          "headline":"Pose in the mirror.",
          "description":"It can be tricky to fit a lot of your body into the frame without distorting your proportions. A mirror lets you take a picture without worrying about that. If you have two mirrors facing one another, you can even take a picture of your back and front at once. Mirror shots look best if the light is next to the mirror, rather than behind you. Try putting a lamp next to your mirror, or keep a mirror by your window. Try shooting from right next to your face or closer to your chest. If you don't want the camera to show, hold it just past the mirror frame."
        }
      ]
    },
    {
      "name":"Taking a Good Photo",
      "steps":[
        {
          "headline":"Place your face in the corner of the shot.",
          "description":"Good selfies set up the photo in an aesthetically pleasing way. Framing your face in the middle isn’t usually the best composition. Instead, consider placing yourself in the top right or top left corner. Try to position your eyes about one-third of the way down from the top of the photo. They should also be to the side, not in the middle."
        },
        {
          "headline":"Find the best light.",
          "description":"When taking a good picture of yourself, lighting plays a crucial role. Fluorescent lights are generally not the most flattering, while soft and golden light gives you a much better selfie. Posing outside, or near a window, can provide great lighting for selfies. When taking a photo in direct sunlight, try blocking the sun with your head. That way, you won't squint, and the sun will light your hair up like a halo. Photographers call the time around sunrise and sunset the \"golden hour,\" when the light is warm and soft. Strong candle-light can also be attractive, but be careful when lighting your face from below. Tilt your chin down so the light can catch your cheekbones. Nice restaurants, cafés, galleries, and changing rooms in high-end stores often have flattering lighting."
        },
        {
          "headline":"Hold something white in the frame.",
          "description":"To get the color balance right, hold a white object within your selfie frame. This will help your camera find the right balance of cool and warm tones. Hold a napkin, a piece of paper, or some other white object just within the frame of your selfie. Crop it out when you've taken the shot. If you're wearing a white shirt, hat, or sunglasses, you don't need to worry about this."
        },
        {
          "headline":"Use a selfie stick.",
          "description":"A selfie stick will let you get more of your figure and the background into a shot. They tend to take slimming photos since they can be held very high. Hold the selfie stick up and tilt your face towards the camera."
        }
      ]
    },
    {
      "name":"Taking Creative Selfies",
      "steps":[
        {
          "headline":"Use your arms as a frame.",
          "description":"When you take a two-handed selfie, you can hold the phone with more stability and click the picture button without dropping the phone. The two-handed selfie lets your arms frame the picture, almost as if you were hugging the viewer. Hold the camera away from your body with both hands. Use one hand to keep the phone or camera secure while the other hand hits the button. Just be careful not to cover up the lens."
        },
        {
          "headline":"Use a filter or a frame.",
          "description":"If you're taking a selfie on Snapchat, WeChat, or a similar app, you can embellish your pictures with filters and frames. Take a selfie wearing a virtual flower crown, draw a funny mustache on yourself, or write a message across your face."
        },
        {
          "headline":"Do something in the selfie.",
          "description":"Selfies are a great opportunity to show everyone what you are doing. Take your selfie while doing something interesting. This may be posing in front of a tourist attraction or monument, sitting on a horse, or eating something colorful and delicious."
        }
      ]
    }
  ],
  "text":" Angling Your Face Figure out your best side. Straight on photos are generally not as flattering as a photo where your face is angled. Look into your camera, or use a mirror, and examine your face from various angles. Most people prefer one side of their face to the other, so tilt that side toward your camera to take a good selfie. Swivel each of your shoulders away from the camera one at a time to help figure out your best angle. Take the photo from slightly above. Pictures shot from above are more flattering than those shot from below. Raise your arms slightly to take the photo from an elevated position. Hold the camera just slightly above face level. Don't hold the camera so high that you look shrunken. Tilt your chin down. Gently angle your chin downwards, towards the floor. Holding your chin slightly down and the camera slightly up shows the harmonious flow of the cheekbones toward the lips. This angle may work best if your forehead is on the shorter side. Extend your neck slightly forward. Holding your head the right way can help you avoid any double chin or awkward faces. When posing, extend your neck so that your face is closer to the camera. It may feel weird, but it will help you look better in a selfie. This angle helps define your jawline. Wearing an Attractive Facial Expression Smile sincerely. To get a smile that looks real, don't force a grin. If you're feeling happy, just think of how happy you are and smile. If you aren't really there but you want a smiley selfie, relax and let a good feeling come to you. Take a deep breath and let it out. Think of someone who makes you happy, and imagine smiling at them. Let your eyes crinkle up slightly when you smile, but don't force it by squinting. Pose your eyes. The eyes are the star of the selfie. Look directly at the camera lens when you pose so that it looks like you're looking at the viewer. Smiling and making eye contact will help you look friendly and inviting. For a coy look, try casting your eyes downward and to the side. Widen your eyes and raise your eyebrows slightly to look alert, innocent, or surprised. Pout a little. Pouting deepens the lines of your cheekbones and makes your lips look fuller. Try whispering the word \"prune\" for a perfect pout. If you exaggerate your pout, you may get a \"duck face\" expression, which many consider silly. Try different dynamic facial expressions. Smiling is only one way to interest people in your selfie. Try frowning, winking, sticking out your tongue, opening your mouth as if surprised, or biting your lip. For a cute puppy look, try sticking out your lower lip while tilting your chin down and looking right into the camera. Relaxing your face so that your expression is blank can be flattering, but your photo won't be as interesting. Posing Your Body Swivel a bit to the side. To slim your waist and show off your shoulders and hips, turn your body slightly when you take your photo. If you're standing, shift your weight onto one foot to give your torso a more angular posture. Bend your arms and legs. Use the arm that isn't taking the shot to frame your figure. Try putting a hand high on your waist to frame your torso, or crook your elbow and put a hand behind your head to show off your upper arm. Bend your knee or cross your legs for a more dynamic position. Prop your head up if you're lying down. When taking a lying-down selfie, don't let your face get swallowed up by gravity. Use a pillow, or put a hand behind your head. Take the photo from slightly above your eye level, just as if you were standing. Pose in the mirror. It can be tricky to fit a lot of your body into the frame without distorting your proportions. A mirror lets you take a picture without worrying about that. If you have two mirrors facing one another, you can even take a picture of your back and front at once. Mirror shots look best if the light is next to the mirror, rather than behind you. Try putting a lamp next to your mirror, or keep a mirror by your window. Try shooting from right next to your face or closer to your chest. If you don't want the camera to show, hold it just past the mirror frame. Taking a Good Photo Place your face in the corner of the shot. Good selfies set up the photo in an aesthetically pleasing way. Framing your face in the middle isn’t usually the best composition. Instead, consider placing yourself in the top right or top left corner. Try to position your eyes about one-third of the way down from the top of the photo. They should also be to the side, not in the middle. Find the best light. When taking a good picture of yourself, lighting plays a crucial role. Fluorescent lights are generally not the most flattering, while soft and golden light gives you a much better selfie. Posing outside, or near a window, can provide great lighting for selfies. When taking a photo in direct sunlight, try blocking the sun with your head. That way, you won't squint, and the sun will light your hair up like a halo. Photographers call the time around sunrise and sunset the \"golden hour,\" when the light is warm and soft. Strong candle-light can also be attractive, but be careful when lighting your face from below. Tilt your chin down so the light can catch your cheekbones. Nice restaurants, cafés, galleries, and changing rooms in high-end stores often have flattering lighting. Hold something white in the frame. To get the color balance right, hold a white object within your selfie frame. This will help your camera find the right balance of cool and warm tones. Hold a napkin, a piece of paper, or some other white object just within the frame of your selfie. Crop it out when you've taken the shot. If you're wearing a white shirt, hat, or sunglasses, you don't need to worry about this. Use a selfie stick. A selfie stick will let you get more of your figure and the background into a shot. They tend to take slimming photos since they can be held very high. Hold the selfie stick up and tilt your face towards the camera. Taking Creative Selfies Use your arms as a frame. When you take a two-handed selfie, you can hold the phone with more stability and click the picture button without dropping the phone. The two-handed selfie lets your arms frame the picture, almost as if you were hugging the viewer. Hold the camera away from your body with both hands. Use one hand to keep the phone or camera secure while the other hand hits the button. Just be careful not to cover up the lens. Use a filter or a frame. If you're taking a selfie on Snapchat, WeChat, or a similar app, you can embellish your pictures with filters and frames. Take a selfie wearing a virtual flower crown, draw a funny mustache on yourself, or write a message across your face. Do something in the selfie. Selfies are a great opportunity to show everyone what you are doing. Take your selfie while doing something interesting. This may be posing in front of a tourist attraction or monument, sitting on a horse, or eating something colorful and delicious.",
  "tyn_model":[
    "mirror",
    "camera",
    "selfie stick",
    "phone",
    "sun",
    "prune",
    "pillow",
    "mirrors",
    "lamp",
    "napkin",
    "snapchat",
    "filters",
    "frames"
  ],
  "tyn_section":[

  ]
}