{
  "title":"How to Reface Cabinet Doors",
  "url":"https://www.wikihow.com/Reface-Cabinet-Doors",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Cabinets and Cupboards"
  ],
  "parts":[
    {
      "name":"Removing and Sanding the Doors",
      "steps":[
        {
          "headline":"Unscrew the doors from the hinges of the cabinets.",
          "description":"Move from the top screws down to the bottom screws. Place the screws in a plastic bag and label which door they belong to. Place a small piece of painter’s tape on the back of the door and number it. You’ll have to move this tape later as you paint or stain the door."
        },
        {
          "headline":"Remove all hardware from the doors.",
          "description":"Unscrew door knobs, handles, and other hardware. Place the hardware into a plastic bag and label them just like you did with the screws from the hinges. This way, you’ll know exactly where to put them when you go to reattach your doors after you’re done with your refacing project. If you’re planning on purchasing new hardware, you can throw the old hardware away."
        },
        {
          "headline":"Lay the doors on a flat and sturdy surface.",
          "description":"Before you begin the job of painting your doors, find a flat surface to lay them on. When doing this, consider an old table, saw horses, or even a flat piece of ground. This way, you'll be able to paint your doors without them falling down and with minimal dripping or running. If you choose to lay your doors on the ground, place plastic or a cloth sheet down first."
        },
        {
          "headline":"Apply a deglosser with a scrubber.",
          "description":"Dip an abrasive pad or scrubber in a deglosser product. Then scrub the entire surface of the cabinet door with the deglossing product. Next, slightly dampen a clean rag in deglosser and wipe the door down again. This will ensure you’ve deglossed the entire surface of the door. Place a rag, towel, or plastic underneath the area you’re deglosser to catch any dripping. Depending on the size of the cabinet door, you may want to do one side at a time."
        },
        {
          "headline":"Sand the doors until the stain or paint is removed.",
          "description":"For best results, use sandpaper or a sanding block and hand sand your doors back and forth in the direction of the wood grain. Start with 100-grit sandpaper. Then, move on to 180-grit sandpaper. Finally, finish up with 220-grit sandpaper. Sand until the entire surface is smooth and all paint or stain has been removed. Use as much pressure as you need to remove varnish or paint."
        },
        {
          "headline":"Vacuum the doors to remove dust and other debris.",
          "description":"Use a shop vacuum and a floor cleaning attachment that has soft bristles. This is important, as you want to avoid scratching your cabinet doors. When vacuuming your doors, go back and forth and vacuum the entire surface of the door. When you’re finished, wipe the surface with a tack cloth."
        },
        {
          "headline":"Fill screw and hardware holes with wood filler if you need.",
          "description":"If you’re using different sized hardware or moving the position of old hardware, you should fill in hardware and screw holes. Do this with a wood filling product. Overfill the holes just slightly, as the filler may shrink. When the filler dries, sand it with 100-grit sandpaper. Fill your holes with a piece of sponge or rubber if you plan to reuse them and don't want to avoid accidentally covering them with paint."
        },
        {
          "headline":"Fill dents with wood filler.",
          "description":"After filling screw and hardware holes, use wood filler to fill any dents, chips, or other imperfections in the door. Use a ruler or another flat piece of wood to shape the wood filler. Once the wood filler dries, hand sand it with 100-grit sandpaper until it is smooth and even with the rest of the surface of the door."
        }
      ]
    },
    {
      "name":"Painting Your Cabinet Doors",
      "steps":[
        {
          "headline":"Prime the doors with a nylon paint brush.",
          "description":"Use a nylon brush to prime one side of each door. Paint in the same direction as the wood grain to hide your brush strokes. Go slowly and get complete coverage. Give the doors one day to dry. After a day, prime the other side of each door. Wait one more day and apply a second coat of primer to each side. If the primed surface is rough, sand it with a 220-grit piece of sandpaper and then apply primer to the surface. Use oil-based primer on maple, cherry, or engineered wood products. Use latex primer on pine, oak, ash, mahogany, or hickory."
        },
        {
          "headline":"Remove dust with a vacuum and a tack cloth.",
          "description":"Vacuum your doors on the front and back. Then, wipe them down with a tack cloth. By doing this, you’ll remove dust and other debris and ensure a smooth surface when you paint your doors."
        },
        {
          "headline":"Paint the doors with a nylon brush.",
          "description":"Move from the bottom to the top of the door. Paint in one direction against the grain of the wood in long smooth strokes. Go slowly so you can get complete coverage. Try to go from the top to the bottom of the cabinet with a single brush stroke. After you’re finished with one side, allow it a day to dry. Use oil-based paint on maple, cherry, or engineered wood products. Use latex paint on pine, oak, ash, mahogany, or hickory. If the first coat seems streaky, wait 24 hours and apply a second coat. Since you're painting on a flat surface, watch to see if excess paint pools in recessed parts of the door. To avoid pooling, use only as much paint on your brush as you need."
        },
        {
          "headline":"Paint one side at a time.",
          "description":"If you want to paint both sides of your doors, do so one side at a time. When you're done with one side, allow it to dry for 24 hours. Then, paint the other side and allow it to dry for 24 hours before moving it."
        }
      ]
    },
    {
      "name":"Staining Your Cabinet Doors",
      "steps":[
        {
          "headline":"Place the door on a flat and sturdy surface.",
          "description":"Before applying your stain, find a flat surface to lay your doors. This way, you'll have a sturdy surface to work on when you stain your doors. In addition, a flat surface will help make sure your stain or sealant dries without running. Clean the cabinet with rubbing alcohol before staining."
        },
        {
          "headline":"Apply your stain with a brush.",
          "description":"Use a 1.5 to 2 in (3.8 to 5.1 cm) white china bristle brush. Pick a stain that matches the color of the wood or the overall look you are going for. When applying stain, brush with the grain of the wood. Use a single stroke approach (brush in one direction). Only use as much stain as you need to get complete coverage. Your goal is to apply 1 thin coat at a time. However, you can always go back later and apply another coat if needed. Do not brush back and forth. Use a clean white rag to remove excess stain from the brush. Allow the stain to dry for 24 hours before touching it."
        },
        {
          "headline":"Do a light sand of the door in between coats of finish.",
          "description":"In some cases, dust can settle between different coats of wood finish. In addition, polyurethane and other finishes can sometimes draw out wood fragments and create a rougher feel. To eliminate this, do a very light sanding of the wood finishing, using 120-grit sandpaper or higher. Vacuum after each sanding."
        },
        {
          "headline":"Put on a second or third coat of stain if you want it darker.",
          "description":"If the first coat isn’t dark enough or is streaky, apply a second coat. Again, paint with the grain of the wood. Don’t use too much. If you need to apply more stain later, you can. Allow every coat you apply 24 hours to dry."
        },
        {
          "headline":"Use a tack rag to apply a sealant or wood finish.",
          "description":"Choose the type of finish you want to use. This may include urethane, polyurethane, or varnish. To apply the finish, first vacuum the door to remove dust or other debris. Then, dampen a tack rag with the finish and lightly wipe down the entire surface of the door. Wipe in the direction of the wood grain. Carefully review the door to make sure you’ve gotten complete coverage. If you want a your doors to be more durable and have a higher gloss, you can apply a second or third coat. Your choice of sealant depends on your taste and the project. You may want to consider varnish if you're going for a more rustic look. Polyurethane is usually more durable than varnish. Urethane is a lot like polyurethane, but dries quicker and is inexpensive."
        },
        {
          "headline":"Complete one side of the door at a time.",
          "description":"After you've stained or sealed one side of your door, allow it 24 hours to dry. Then, stain or seal the other side of the door. This way, your stain or seal job will be completely dry and won't be ruined when you flip the door over to finish the other side. Stain both sides of your doors and allow them each 24 hours to dry before applying a sealant. Then, seal one side of the door, allow it to dry for 24 hours, and seal the other side of the door."
        }
      ]
    },
    {
      "name":"Reattaching Your Doors",
      "steps":[
        {
          "headline":"Give your doors 24 hours to dry.",
          "description":"Set your doors aside for at least 24 hours after you finish working on them. Keep them in an area free of any dust or pet dander. If you don’t, you could wind up messing up your paint or staining job."
        },
        {
          "headline":"Put the hardware back on.",
          "description":"Take the plastic bags with your old hardware (or new hardware you’ve purchased) and match them up with the doors. Refer to the marked piece of painters tape you put on the doors when you took them off. While you have probably moved the tape during the refacing process, it should still be somewhere on the door. Then, reattach the hardware to the doors."
        },
        {
          "headline":"Reattach the doors.",
          "description":"Hold the door up to the cabinet and position the free side of the hinge on the side of the door. Depending on your painting and sanding job, you may still see a slight indentation where the hinge was originally located. If not, you may need to measure to make sure the door is placed evenly. If you filled in the holes because you’re using new hardware, you’ll need to use an electric drill to drill new holes into the door."
        }
      ]
    }
  ],
  "text":" Removing and Sanding the Doors Unscrew the doors from the hinges of the cabinets. Move from the top screws down to the bottom screws. Place the screws in a plastic bag and label which door they belong to. Place a small piece of painter’s tape on the back of the door and number it. You’ll have to move this tape later as you paint or stain the door. Remove all hardware from the doors. Unscrew door knobs, handles, and other hardware. Place the hardware into a plastic bag and label them just like you did with the screws from the hinges. This way, you’ll know exactly where to put them when you go to reattach your doors after you’re done with your refacing project. If you’re planning on purchasing new hardware, you can throw the old hardware away. Lay the doors on a flat and sturdy surface. Before you begin the job of painting your doors, find a flat surface to lay them on. When doing this, consider an old table, saw horses, or even a flat piece of ground. This way, you'll be able to paint your doors without them falling down and with minimal dripping or running. If you choose to lay your doors on the ground, place plastic or a cloth sheet down first. Apply a deglosser with a scrubber. Dip an abrasive pad or scrubber in a deglosser product. Then scrub the entire surface of the cabinet door with the deglossing product. Next, slightly dampen a clean rag in deglosser and wipe the door down again. This will ensure you’ve deglossed the entire surface of the door. Place a rag, towel, or plastic underneath the area you’re deglosser to catch any dripping. Depending on the size of the cabinet door, you may want to do one side at a time. Sand the doors until the stain or paint is removed. For best results, use sandpaper or a sanding block and hand sand your doors back and forth in the direction of the wood grain. Start with 100-grit sandpaper. Then, move on to 180-grit sandpaper. Finally, finish up with 220-grit sandpaper. Sand until the entire surface is smooth and all paint or stain has been removed. Use as much pressure as you need to remove varnish or paint. Vacuum the doors to remove dust and other debris. Use a shop vacuum and a floor cleaning attachment that has soft bristles. This is important, as you want to avoid scratching your cabinet doors. When vacuuming your doors, go back and forth and vacuum the entire surface of the door. When you’re finished, wipe the surface with a tack cloth. Fill screw and hardware holes with wood filler if you need. If you’re using different sized hardware or moving the position of old hardware, you should fill in hardware and screw holes. Do this with a wood filling product. Overfill the holes just slightly, as the filler may shrink. When the filler dries, sand it with 100-grit sandpaper. Fill your holes with a piece of sponge or rubber if you plan to reuse them and don't want to avoid accidentally covering them with paint. Fill dents with wood filler. After filling screw and hardware holes, use wood filler to fill any dents, chips, or other imperfections in the door. Use a ruler or another flat piece of wood to shape the wood filler. Once the wood filler dries, hand sand it with 100-grit sandpaper until it is smooth and even with the rest of the surface of the door. Painting Your Cabinet Doors Prime the doors with a nylon paint brush. Use a nylon brush to prime one side of each door. Paint in the same direction as the wood grain to hide your brush strokes. Go slowly and get complete coverage. Give the doors one day to dry. After a day, prime the other side of each door. Wait one more day and apply a second coat of primer to each side. If the primed surface is rough, sand it with a 220-grit piece of sandpaper and then apply primer to the surface. Use oil-based primer on maple, cherry, or engineered wood products. Use latex primer on pine, oak, ash, mahogany, or hickory. Remove dust with a vacuum and a tack cloth. Vacuum your doors on the front and back. Then, wipe them down with a tack cloth. By doing this, you’ll remove dust and other debris and ensure a smooth surface when you paint your doors. Paint the doors with a nylon brush. Move from the bottom to the top of the door. Paint in one direction against the grain of the wood in long smooth strokes. Go slowly so you can get complete coverage. Try to go from the top to the bottom of the cabinet with a single brush stroke. After you’re finished with one side, allow it a day to dry. Use oil-based paint on maple, cherry, or engineered wood products. Use latex paint on pine, oak, ash, mahogany, or hickory. If the first coat seems streaky, wait 24 hours and apply a second coat. Since you're painting on a flat surface, watch to see if excess paint pools in recessed parts of the door. To avoid pooling, use only as much paint on your brush as you need. Paint one side at a time. If you want to paint both sides of your doors, do so one side at a time. When you're done with one side, allow it to dry for 24 hours. Then, paint the other side and allow it to dry for 24 hours before moving it. Staining Your Cabinet Doors Place the door on a flat and sturdy surface. Before applying your stain, find a flat surface to lay your doors. This way, you'll have a sturdy surface to work on when you stain your doors. In addition, a flat surface will help make sure your stain or sealant dries without running. Clean the cabinet with rubbing alcohol before staining. Apply your stain with a brush. Use a 1.5 to 2 in (3.8 to 5.1 cm) white china bristle brush. Pick a stain that matches the color of the wood or the overall look you are going for. When applying stain, brush with the grain of the wood. Use a single stroke approach (brush in one direction). Only use as much stain as you need to get complete coverage. Your goal is to apply 1 thin coat at a time. However, you can always go back later and apply another coat if needed. Do not brush back and forth. Use a clean white rag to remove excess stain from the brush. Allow the stain to dry for 24 hours before touching it. Do a light sand of the door in between coats of finish. In some cases, dust can settle between different coats of wood finish. In addition, polyurethane and other finishes can sometimes draw out wood fragments and create a rougher feel. To eliminate this, do a very light sanding of the wood finishing, using 120-grit sandpaper or higher. Vacuum after each sanding. Put on a second or third coat of stain if you want it darker. If the first coat isn’t dark enough or is streaky, apply a second coat. Again, paint with the grain of the wood. Don’t use too much. If you need to apply more stain later, you can. Allow every coat you apply 24 hours to dry. Use a tack rag to apply a sealant or wood finish. Choose the type of finish you want to use. This may include urethane, polyurethane, or varnish. To apply the finish, first vacuum the door to remove dust or other debris. Then, dampen a tack rag with the finish and lightly wipe down the entire surface of the door. Wipe in the direction of the wood grain. Carefully review the door to make sure you’ve gotten complete coverage. If you want a your doors to be more durable and have a higher gloss, you can apply a second or third coat. Your choice of sealant depends on your taste and the project. You may want to consider varnish if you're going for a more rustic look. Polyurethane is usually more durable than varnish. Urethane is a lot like polyurethane, but dries quicker and is inexpensive. Complete one side of the door at a time. After you've stained or sealed one side of your door, allow it 24 hours to dry. Then, stain or seal the other side of the door. This way, your stain or seal job will be completely dry and won't be ruined when you flip the door over to finish the other side. Stain both sides of your doors and allow them each 24 hours to dry before applying a sealant. Then, seal one side of the door, allow it to dry for 24 hours, and seal the other side of the door. Reattaching Your Doors Give your doors 24 hours to dry. Set your doors aside for at least 24 hours after you finish working on them. Keep them in an area free of any dust or pet dander. If you don’t, you could wind up messing up your paint or staining job. Put the hardware back on. Take the plastic bags with your old hardware (or new hardware you’ve purchased) and match them up with the doors. Refer to the marked piece of painters tape you put on the doors when you took them off. While you have probably moved the tape during the refacing process, it should still be somewhere on the door. Then, reattach the hardware to the doors. Reattach the doors. Hold the door up to the cabinet and position the free side of the hinge on the side of the door. Depending on your painting and sanding job, you may still see a slight indentation where the hinge was originally located. If not, you may need to measure to make sure the door is placed evenly. If you filled in the holes because you’re using new hardware, you’ll need to use an electric drill to drill new holes into the door.",
  "tyn_model":[
    "paint",
    "sandpaper",
    "wood filler",
    "polyurethane",
    "sealant",
    "varnish",
    "plastic bag",
    "scrubber",
    "rag",
    "vacuum",
    "filler",
    "100-grit sandpaper",
    "nylon brush",
    "primer",
    "tack cloth",
    "stain",
    "tack rag",
    "painter’s tape",
    "deglosser",
    "abrasive pad",
    "deglosser product",
    "deglossing product",
    "towel",
    "plastic",
    "sanding block",
    "shop vacuum",
    "floor cleaning attachment",
    "wood filling product",
    "sponge",
    "ruler",
    "nylon paint brush",
    "220-grit piece",
    "oil-based primer",
    "latex primer",
    "oil-based paint",
    "latex paint",
    "rubbing alcohol",
    "china bristle brush",
    "white rag",
    "120-grit sandpaper",
    "urethane",
    "plastic bags",
    "painters tape",
    "tape",
    "hardware",
    "cabinet",
    "electric drill"
  ],
  "tyn_section":[

  ]
}