{
  "title":"How to Rivet Leather",
  "url":"https://www.wikihow.com/Rivet-Leather",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Leatherworking"
  ],
  "methods":[
    {
      "name":"Selecting Your Materials",
      "steps":[
        {
          "headline":"Match the length of your rivet to the thickness of your materials.",
          "description":"The rivet should be long enough to get through the material you’re using with about 1/8 inch (0.3 cm) to spare. Stack your materials together and measure their height, then add the additional 1/8 inch to find out how long your rivet should be."
        },
        {
          "headline":"Choose single cap rivets for one-sided projects.",
          "description":"If your rivets will only be visible from one side – like if you’re decorating on a leather bag no one will see the inside of – you can use a single cap rivet. This will give your project a finished look."
        },
        {
          "headline":"Use a double cap rivets for two-sided projects.",
          "description":"If you’re making something that you can see the front and back of – like the strap of a purse, for example – use double-sided rivets. You install these the same way as single cap rivets – they just give your project a more finished look."
        },
        {
          "headline":"Select copper rivets for a sturdier finish.",
          "description":"Copper rivets are stronger than regular, silver, “quick” rivets. They’re great for using on any leather work that needs some extra strength."
        }
      ]
    },
    {
      "name":"Setting Rivets by Hand",
      "steps":[
        {
          "headline":"Mark where you want your hole.",
          "description":"This is especially important if you’re creating a design that you want to look professional. Make sure you measure out where your holes should be in the leather, and then mark the spot with a marker or pen. Don’t make the mark too big – you want it small enough to disappear when you punch a hole through the leather at that spot."
        },
        {
          "headline":"Punch a hole in your leather.",
          "description":"You can do this by hand with an awl or with a leather punch. The hole just needs to be big enough for you to get the post of the rivet through."
        },
        {
          "headline":"Push the rivet post up through the underside of the leather.",
          "description":"The underside of the leather is usually less finished and will often be a lighter color. Make sure you push your rivet up through the leather from this side, or it will end up upside down. Your rivet post should only extend about 1/8 inch (0.3 cm) above the surface of the leather."
        },
        {
          "headline":"Place your leather piece on an anvil.",
          "description":"You can buy pretty small anvils from most leather working supply stores. You only need an anvil big enough to accommodate the size of the leather you’re working on. Place it on the anvil with the bottom of the leather facing down and the post sticking up."
        },
        {
          "headline":"Put the rivet cap on top of the post.",
          "description":"Some rivet caps will make a clicking or snapping noise when you place it over the top of the post. The rivet cap is the part that looks “finished” – it’s usually brass or copper and has a convex top."
        },
        {
          "headline":"Place your rivet setter over the cap.",
          "description":"The rivet setter looks like a small metal cylinder, and it has a concave end that allows that cap to fit snugly against it. Place the setter over the cap so that the cap is flush against the setter."
        },
        {
          "headline":"Tap the setter with a soft mallet or small hammer.",
          "description":"You don’t want to hit the setter too hard, because that can dent the rivet. Instead, give the setter a few short taps with a soft mallet or hammer."
        },
        {
          "headline":"Check that the rivet is set.",
          "description":"If the rivet has been set, you should be able to pick up the piece of leather without the rivet post or cap falling off. If they do, reset them and give the setter a little bit of a harder bang."
        }
      ]
    },
    {
      "name":"Setting Copper Rivets with Washers",
      "steps":[
        {
          "headline":"Punch a hole in the leather.",
          "description":"Copper rivets with washers tend to be larger than your everyday rivets. Make sure when you punch the hole that it’s big enough for a wider rivet post to get through. It should be big enough that you can push the rivet post through the leather but not so big that it slips right through."
        },
        {
          "headline":"Push your rivet through the leather.",
          "description":"You should have at least 1/8 inch (0.3 cm) of rivet post above the surface of your leather. Push the rivet up from the bottom of the leather."
        },
        {
          "headline":"Set the washer.",
          "description":"Flip your leather over so you can see where the post sticks up through the leather. Set the washer over the post so that it’s flat against the leather."
        },
        {
          "headline":"Set the leather and rivet on an anvil.",
          "description":"The anvil should be big enough to accommodate the piece of leather you’re working on. You should be able to work on the rivet on a flat surface."
        },
        {
          "headline":"Set up a copper rivet setter.",
          "description":"A copper rivet setter is silver, and is almost shaped like a lighter. On one end, you’ll see a concave circle, with a smaller, hollow circle next to it. Place the setter over the rivet post and on top of the washer, making sure the post goes into the hollow circle on the setter."
        },
        {
          "headline":"Tap on the setter with a mallet or hammer.",
          "description":"You might need two or three taps to make sure everything is set. Don’t pound too hard, as this can ruin the rivet. When you’re done, the washer should be completely flat against the leather. If you notice that the washer seems to be higher on one side of the post than the other, give it another bang to make sure it’s set all the way around."
        },
        {
          "headline":"Set the concave section of the setter over the post.",
          "description":"With the same mallet or hammer, pound down on the post a few times. You should hit the setter fairly hard for this step, because what you’re doing is getting the post to expand and flatten out. This will keep the washer in place and your rivet secure."
        }
      ]
    }
  ],
  "text":" Selecting Your Materials Match the length of your rivet to the thickness of your materials. The rivet should be long enough to get through the material you’re using with about 1/8 inch (0.3 cm) to spare. Stack your materials together and measure their height, then add the additional 1/8 inch to find out how long your rivet should be. Choose single cap rivets for one-sided projects. If your rivets will only be visible from one side – like if you’re decorating on a leather bag no one will see the inside of – you can use a single cap rivet. This will give your project a finished look. Use a double cap rivets for two-sided projects. If you’re making something that you can see the front and back of – like the strap of a purse, for example – use double-sided rivets. You install these the same way as single cap rivets – they just give your project a more finished look. Select copper rivets for a sturdier finish. Copper rivets are stronger than regular, silver, “quick” rivets. They’re great for using on any leather work that needs some extra strength. Setting Rivets by Hand Mark where you want your hole. This is especially important if you’re creating a design that you want to look professional. Make sure you measure out where your holes should be in the leather, and then mark the spot with a marker or pen. Don’t make the mark too big – you want it small enough to disappear when you punch a hole through the leather at that spot. Punch a hole in your leather. You can do this by hand with an awl or with a leather punch. The hole just needs to be big enough for you to get the post of the rivet through. Push the rivet post up through the underside of the leather. The underside of the leather is usually less finished and will often be a lighter color. Make sure you push your rivet up through the leather from this side, or it will end up upside down. Your rivet post should only extend about 1/8 inch (0.3 cm) above the surface of the leather. Place your leather piece on an anvil. You can buy pretty small anvils from most leather working supply stores. You only need an anvil big enough to accommodate the size of the leather you’re working on. Place it on the anvil with the bottom of the leather facing down and the post sticking up. Put the rivet cap on top of the post. Some rivet caps will make a clicking or snapping noise when you place it over the top of the post. The rivet cap is the part that looks “finished” – it’s usually brass or copper and has a convex top. Place your rivet setter over the cap. The rivet setter looks like a small metal cylinder, and it has a concave end that allows that cap to fit snugly against it. Place the setter over the cap so that the cap is flush against the setter. Tap the setter with a soft mallet or small hammer. You don’t want to hit the setter too hard, because that can dent the rivet. Instead, give the setter a few short taps with a soft mallet or hammer. Check that the rivet is set. If the rivet has been set, you should be able to pick up the piece of leather without the rivet post or cap falling off. If they do, reset them and give the setter a little bit of a harder bang. Setting Copper Rivets with Washers Punch a hole in the leather. Copper rivets with washers tend to be larger than your everyday rivets. Make sure when you punch the hole that it’s big enough for a wider rivet post to get through. It should be big enough that you can push the rivet post through the leather but not so big that it slips right through. Push your rivet through the leather. You should have at least 1/8 inch (0.3 cm) of rivet post above the surface of your leather. Push the rivet up from the bottom of the leather. Set the washer. Flip your leather over so you can see where the post sticks up through the leather. Set the washer over the post so that it’s flat against the leather. Set the leather and rivet on an anvil. The anvil should be big enough to accommodate the piece of leather you’re working on. You should be able to work on the rivet on a flat surface. Set up a copper rivet setter. A copper rivet setter is silver, and is almost shaped like a lighter. On one end, you’ll see a concave circle, with a smaller, hollow circle next to it. Place the setter over the rivet post and on top of the washer, making sure the post goes into the hollow circle on the setter. Tap on the setter with a mallet or hammer. You might need two or three taps to make sure everything is set. Don’t pound too hard, as this can ruin the rivet. When you’re done, the washer should be completely flat against the leather. If you notice that the washer seems to be higher on one side of the post than the other, give it another bang to make sure it’s set all the way around. Set the concave section of the setter over the post. With the same mallet or hammer, pound down on the post a few times. You should hit the setter fairly hard for this step, because what you’re doing is getting the post to expand and flatten out. This will keep the washer in place and your rivet secure.",
  "tyn_model":[
    "setter",
    "washer",
    "rivets",
    "anvil",
    "hammer",
    "– like",
    "– you",
    "rivet post",
    "rivet setter",
    "soft mallet",
    "copper rivet setter",
    "mallet",
    "rivet",
    "– use",
    "single cap rivets",
    "– they",
    "“quick",
    "” rivets",
    "marker",
    "pen",
    "awl",
    "leather punch",
    "anvils",
    "leather working supply stores",
    "rivet cap",
    "“finished",
    "” –",
    "small hammer",
    "washers"
  ],
  "tyn_section":[

  ]
}