{
  "title":"How to Measure Coffee Beans",
  "url":"https://www.wikihow.com/Measure-Coffee-Beans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Coffee Beans"
  ],
  "methods":[
    {
      "name":"Measuring the Ingredients",
      "steps":[
        {
          "headline":"Buy a small kitchen scale.",
          "description":"Look for a scale that goes out at least two decimal places and measures in both ounces and grams. You can purchase a scale from your local kitchen supply store or your favorite online retailer. A digital scale gives you the most precision and control when measuring your coffee. Analog scales may be more difficult to read if you’re measuring small quantities."
        },
        {
          "headline":"Measure the beans.",
          "description":"Place a cup on the scale and rezero the scale so you will be measuring only the weight of the beans. Add a few coffee beans at a time until your scale reads 30 grams (1.1 oz). 30 grams (1.1 oz) will yield about 3 cups of coffee and will make for a universally accepted strength. Every 10 grams (0.35 oz) of coffee beans will yield roughly one cup of coffee, so this measurement will yield about 3 cups. Use whole beans when measuring coffee."
        },
        {
          "headline":"Measure the water.",
          "description":"Place a kitchen glass on the scale and rezero the scale so you’re measuring only the amount of water. From another glass, slowly pour filtered drinking water into the glass on the scale until it reads 500 millilitres (18 imp fl oz; 17  fl oz)."
        },
        {
          "headline":"Grind your coffee beans.",
          "description":"Pour your coffee beans into a coffee grinder and blend to your desired consistency. A finer grind will result in a slightly stronger cup of coffee with more intense flavor. A coarser grind will yield a more mild cup of coffee. A finer grind makes more intense coffee because there is more bean surface area in contact with the hot water during brewing."
        },
        {
          "headline":"Brew your coffee as usual.",
          "description":"Pour your water and beans into the coffee maker or French press, and brew as normal. Wait until the coffee is done percolating to pour yourself a cup. Fix up with cream or sugar as you wish."
        },
        {
          "headline":"Scale up your measurements to make more coffee.",
          "description":"If measuring your coffee beans in ounces, multiply your measurement by 16 to get the rough amount of water needed in fluid ounces. If you’re measuring your coffee in grams, multiply by 16.6945 to get the rough amount of water needed in milliliters. Calculate how many cups of coffee you’d like to make, depending on how many guests you’re having or how much coffee you like to drink. Since every 10 grams (0.35 oz) of beans will make about a cup of coffee, figure 20 grams (0.71 oz) per person if you’re unsure how much people will drink."
        },
        {
          "headline":"Avoid using spoons to measure beans.",
          "description":"For the most consistent cup, always use your scale. Measuring your coffee using everyday utensils will lead to inconsistent results. Coffee beans vary in density and size from variety to variety."
        }
      ]
    },
    {
      "name":"Adjusting the Strength of Your Coffee",
      "steps":[
        {
          "headline":"Add more beans if you like stronger coffee.",
          "description":"If the first cup of coffee tastes weak to you, measure a few more beans on the scale when brewing your coffee the next time. Use the same amount of water, so the coffee is more concentrated. Coffee to water ratio of 1:14 (71 grams of coffee per 1000 ml of water) would produce a cup of medium strength. Always record the ratio of beans to water each time you brew, so you can recreate the experience when you make your perfect cup."
        },
        {
          "headline":"Add more water if you like weaker coffee.",
          "description":"If the first cup of coffee was too strong for you, add a little more water to the scale when you make your coffee next time. Keep the amount of beans consistent so you know your brew will be weaker this time in accordance with your taste. How much water you add will depend upon if you felt the cup was way too strong or just a little too strong. Be sure to write down the amount of water you prefer with your beans so you can make your perfect ratio again in the future."
        },
        {
          "headline":"Experiment with different beans.",
          "description":"Find the roast you like best to make coffee that suits your taste. Some beans are intensely flavored and bitter while others are sweet and mild. Ask your local barista about the different kinds of beans available, so you can select a roast that suits your preferences."
        }
      ]
    }
  ],
  "text":" Measuring the Ingredients Buy a small kitchen scale. Look for a scale that goes out at least two decimal places and measures in both ounces and grams. You can purchase a scale from your local kitchen supply store or your favorite online retailer. A digital scale gives you the most precision and control when measuring your coffee. Analog scales may be more difficult to read if you’re measuring small quantities. Measure the beans. Place a cup on the scale and rezero the scale so you will be measuring only the weight of the beans. Add a few coffee beans at a time until your scale reads 30 grams (1.1 oz). 30 grams (1.1 oz) will yield about 3 cups of coffee and will make for a universally accepted strength. Every 10 grams (0.35 oz) of coffee beans will yield roughly one cup of coffee, so this measurement will yield about 3 cups. Use whole beans when measuring coffee. Measure the water. Place a kitchen glass on the scale and rezero the scale so you’re measuring only the amount of water. From another glass, slowly pour filtered drinking water into the glass on the scale until it reads 500 millilitres (18 imp fl oz; 17  fl oz). Grind your coffee beans. Pour your coffee beans into a coffee grinder and blend to your desired consistency. A finer grind will result in a slightly stronger cup of coffee with more intense flavor. A coarser grind will yield a more mild cup of coffee. A finer grind makes more intense coffee because there is more bean surface area in contact with the hot water during brewing. Brew your coffee as usual. Pour your water and beans into the coffee maker or French press, and brew as normal. Wait until the coffee is done percolating to pour yourself a cup. Fix up with cream or sugar as you wish. Scale up your measurements to make more coffee. If measuring your coffee beans in ounces, multiply your measurement by 16 to get the rough amount of water needed in fluid ounces. If you’re measuring your coffee in grams, multiply by 16.6945 to get the rough amount of water needed in milliliters. Calculate how many cups of coffee you’d like to make, depending on how many guests you’re having or how much coffee you like to drink. Since every 10 grams (0.35 oz) of beans will make about a cup of coffee, figure 20 grams (0.71 oz) per person if you’re unsure how much people will drink. Avoid using spoons to measure beans. For the most consistent cup, always use your scale. Measuring your coffee using everyday utensils will lead to inconsistent results. Coffee beans vary in density and size from variety to variety. Adjusting the Strength of Your Coffee Add more beans if you like stronger coffee. If the first cup of coffee tastes weak to you, measure a few more beans on the scale when brewing your coffee the next time. Use the same amount of water, so the coffee is more concentrated. Coffee to water ratio of 1:14 (71 grams of coffee per 1000 ml of water) would produce a cup of medium strength. Always record the ratio of beans to water each time you brew, so you can recreate the experience when you make your perfect cup. Add more water if you like weaker coffee. If the first cup of coffee was too strong for you, add a little more water to the scale when you make your coffee next time. Keep the amount of beans consistent so you know your brew will be weaker this time in accordance with your taste. How much water you add will depend upon if you felt the cup was way too strong or just a little too strong. Be sure to write down the amount of water you prefer with your beans so you can make your perfect ratio again in the future. Experiment with different beans. Find the roast you like best to make coffee that suits your taste. Some beans are intensely flavored and bitter while others are sweet and mild. Ask your local barista about the different kinds of beans available, so you can select a roast that suits your preferences.",
  "tyn_model":[
    "water",
    "scale",
    "coffee",
    "coffee beans",
    "small kitchen scale",
    "scales",
    "kitchen glass",
    "glass",
    "filtered drinking water",
    "coffee grinder",
    "coffee maker",
    "french press",
    "sugar",
    "spoons"
  ],
  "tyn_section":[

  ]
}