{
  "title":"How to Know when Sesame Oil Is Rancid",
  "url":"https://www.wikihow.com/Know-when-Sesame-Oil-Is-Rancid",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "parts":[
    {
      "name":"Examining the Oil",
      "steps":[
        {
          "headline":"Check your oil for a dark, amber color.",
          "description":"Sesame oils that appear darker in color than usual - a deep amber hue as opposed to a light golden color - are often rancid. Compare the color of your oil to images of sesame oil online to determine whether or not your oil is rancid."
        },
        {
          "headline":"Feel the bottle to see if it's sticky.",
          "description":"A sticky residue will develop on the outside of a rancid oil container. If your bottle of sesame oil is uncharacteristically sticky, this is likely a symptom of rancidity."
        },
        {
          "headline":"Note a harsh, acrid smell.",
          "description":"Fresh sesame oil has a fragrant, nutty odor. In comparison, rancid oil smells acrid, bitter, and soapy. Give your oil a whiff, and if the smell is harsh on your nose, it’s probably best to throw it out."
        },
        {
          "headline":"Taste the oil for signs of bitterness.",
          "description":"If the sight and smell of your oil are not telling enough, try tasting a tiny amount of your sesame oil to determine once and for all if the oil is rancid. If the oil tastes acrid or bitter, it is rancid and unsafe to cook with. If you decide to taste-test your sesame oil, consume no more than a drop in case the oil is rancid."
        }
      ]
    },
    {
      "name":"Determining the Shelf Life",
      "steps":[
        {
          "headline":"Check the “Use By” date on the bottle.",
          "description":"If your sesame oil displays any physical signs of rancidity, and if the oil’s “use by” date is long past, it’s safe to say your oil is probably rancid. If the \"use by\" date has passed but your oil looks, smells, and tastes fresh, it's probably fine to use the oil."
        },
        {
          "headline":"Throw away any sesame oil that's over 2 years old.",
          "description":"Most sesame oil will stay fresh for no longer than 2 years, regardless of its storage conditions. Keep these guidelines in mind when you inspect your sesame oil for signs of rancidity to determine the likelihood of its freshness. Unopened sesame oil will stay fresh for up to 1 year when stored at room temperature, and up to 2 years when refrigerated. An opened container of sesame oil will stay fresh for 6-8 months when left at room temperature, and up to 2 years when refrigerated."
        },
        {
          "headline":"Inspect the storage environment of your sesame oil.",
          "description":"If your bottle of sesame oil has been left open and/or in direct sunlight for longer than 1-2 months, and you notice a change in its color or odor, it's best to throw it away. These storage conditions often cause sesame oils to go rancid. Practice safe storage techniques to prevent rancid oil in the future. Sesame oil stays fresh for longest when it is sealed tightly and stored in a cool, dry location, away from direct sunlight or other sources of heat."
        }
      ]
    }
  ],
  "text":" Examining the Oil Check your oil for a dark, amber color. Sesame oils that appear darker in color than usual - a deep amber hue as opposed to a light golden color - are often rancid. Compare the color of your oil to images of sesame oil online to determine whether or not your oil is rancid. Feel the bottle to see if it's sticky. A sticky residue will develop on the outside of a rancid oil container. If your bottle of sesame oil is uncharacteristically sticky, this is likely a symptom of rancidity. Note a harsh, acrid smell. Fresh sesame oil has a fragrant, nutty odor. In comparison, rancid oil smells acrid, bitter, and soapy. Give your oil a whiff, and if the smell is harsh on your nose, it’s probably best to throw it out. Taste the oil for signs of bitterness. If the sight and smell of your oil are not telling enough, try tasting a tiny amount of your sesame oil to determine once and for all if the oil is rancid. If the oil tastes acrid or bitter, it is rancid and unsafe to cook with. If you decide to taste-test your sesame oil, consume no more than a drop in case the oil is rancid. Determining the Shelf Life Check the “Use By” date on the bottle. If your sesame oil displays any physical signs of rancidity, and if the oil’s “use by” date is long past, it’s safe to say your oil is probably rancid. If the \"use by\" date has passed but your oil looks, smells, and tastes fresh, it's probably fine to use the oil. Throw away any sesame oil that's over 2 years old. Most sesame oil will stay fresh for no longer than 2 years, regardless of its storage conditions. Keep these guidelines in mind when you inspect your sesame oil for signs of rancidity to determine the likelihood of its freshness. Unopened sesame oil will stay fresh for up to 1 year when stored at room temperature, and up to 2 years when refrigerated. An opened container of sesame oil will stay fresh for 6-8 months when left at room temperature, and up to 2 years when refrigerated. Inspect the storage environment of your sesame oil. If your bottle of sesame oil has been left open and/or in direct sunlight for longer than 1-2 months, and you notice a change in its color or odor, it's best to throw it away. These storage conditions often cause sesame oils to go rancid. Practice safe storage techniques to prevent rancid oil in the future. Sesame oil stays fresh for longest when it is sealed tightly and stored in a cool, dry location, away from direct sunlight or other sources of heat.",
  "tyn_model":[
    "sesame oil",
    "oil",
    "“use",
    "” date",
    "sesame oils"
  ],
  "tyn_section":[

  ]
}