{
  "title":"How to Maintain Your Swimming Pool",
  "url":"https://www.wikihow.com/Maintain-Your-Swimming-Pool",
  "category_hierarchy":[
    "Home and Garden",
    "Swimming Pools",
    "Swimming Pool Maintenance"
  ],
  "parts":[
    {
      "name":"Understanding Your Pool's Water Needs",
      "steps":[
        {
          "headline":"Become familiar with your pool's total alkalinity and pH levels.",
          "description":"Total alkalinity is a way of measuring the water's ability to neutralize acidity. Your water's alkalinity levels are directly related to your water's pH; the higher the total alkalinity, the higher the pH levels of your pool's water will be. pH levels measure how acidic or basic substances are. The pH scale has a range between 0 and 14, with a neutral pH at 7."
        },
        {
          "headline":"Know your pool's chlorine, calcium hardness, cyanuric acid, and total dissolved solids levels.",
          "description":"Besides the pH and alkaline levels, these are also important considerations. Make sure you understand what they are and how they benefit your water. Chlorine is used to disinfect and sanitize the water. Calcium hardness refers to the amount of calcium present in the water. If the calcium levels are too low your water will become corrosive, potentially ruining the body of your pool. Cyanuric acid protects the chlorine in the water from the sun's ultraviolet rays. Total dissolved solids are mainly composed of inorganic salts (calcium, magnesium, potassium, sodium, bicarbonates, chlorides and sulfates) and small amounts of other organic materials dissolved in the water."
        },
        {
          "headline":"Identify your pool water's pH, total alkalinity, chlorine, cyanuric acid, calcium hardness, and total dissolved solids levels.",
          "description":"Keep these recommended level ranges in mind. pH: 7.2 - 7.8\nTotal alkalinity: 80 - 120 ppm\nChlorine: 1.0 - 2.0 ppm\nCyanuric Acid: 40 - 80 ppm\nCalcium hardness: 180 - 220 ppm, though some say 200 - 400\nTotal Dissolved Solids: below 5000 ppm"
        },
        {
          "headline":"Know your testing timelines for each water component.",
          "description":"When you test your pool's water, you should observe certain timelines in order for your pool to function well, and for the water to stay clean and healthy. Each element, like the pH for example, has to be tested at a specific point. Some professionals advise daily testing, which can be difficult for many people. Keep the following timeframes in mind to ensure proper pool functions:\npH should be tested twice a week. Total alkalinity should be tested once a week, and at least once a month. Chlorine should be tested twice a week. Cyanuric acid should be tested twice a season. Calcium hardness should be tested twice a season. Total dissolved solids should be tested once a week, and at least once a month."
        }
      ]
    },
    {
      "name":"Testing Your Pool's Water",
      "steps":[
        {
          "headline":"Purchase testing strips from your local pool store.",
          "description":"Buy the strips that identify chlorine, alkaline, pH, and cyanuric acid. Nowadays, you don't have to bother with different tests for different chemicals."
        },
        {
          "headline":"Dip the test strip into the pool.",
          "description":"Move to an area that's separated from the pool's skimmer, and dip the test strip about 18 inches (46 cm) into the water for about ten seconds."
        },
        {
          "headline":"Wait until the different colors fill in.",
          "description":"Match the color readings to the color description on the product box or bottle. Make sure to read the product's instructions carefully, as different manufacturers might have different procedures."
        },
        {
          "headline":"Make sure that your readings fall in the appropriate range.",
          "description":"It's very important to adjust your water in case your readings do not match the recommended ranges. Using the right chemicals will easily adjust the ranges should they not meet suggested standards."
        }
      ]
    },
    {
      "name":"Applying Chemicals To Your Pool",
      "steps":[
        {
          "headline":"Have the right chemicals readily available.",
          "description":"From time to time, you'll be faced with water problems that require aggressive chemical solutions. But generally, these chemicals should become part of your pool maintenance routine as you might need to adjust certain levels sporadically. You product's instructions will provide appropriate dosage, should adjusting be necessary. Here are the most common chemicals you'll need:\nChlorine\nShocking products\nAlgaecide"
        },
        {
          "headline":"Apply chlorine to your pool.",
          "description":"You and your guests won't be too happy with algae and bacteria swimming alongside with you. Chlorine keeps these unwanted guests away. There are a few options out there when it comes to choosing the right chlorine products. Basic Chlorinating Tabs. These tabs dissolve slowly, and can be found in 1-inch and 3-inch sizes. They do a great job at keeping your pool clean. Plus, most chlorinating tablets contain a built-in stabilizer to shield your water's chlorine from the sun's rays. You can use the tablets in your floating dispenser, skimmer or automatic chlorinator. Liquid Chlorine. In liquid form, chlorine is quite similar to household bleach. But beware: it is also much stronger when it is designed for pools. Applying liquid chlorine is relatively easy, but it has a rather short shelf life. It won't last for more than a few weeks. Chlorinating Tabs. Some non-basic chlorinating tabs provide a multifunctional approach to pool maintenance; they sanitize the water while also shocking your pool. Shocking your pool gets rid of all sorts of contaminants. Chlorinating Granules. These granules come in multifunctional varieties that can help you resolve several issues at once; chlorinating, shocking and killing algae with a single, daily application."
        },
        {
          "headline":"Shock your pool.",
          "description":"Performing this task is crucial, as shocking keeps the water clear, and reduces eye irritation and odors coming from the chlorine. As mentioned, certain chlorine products already have built-in shockers, but if you choose to go with ones that do not, here are some shocking products that get the job done:\nBasic Shock Products. Basic products take care of killing bacteria, from breaking down cosmetic residue, suntan lotions, and any kind of swimmer waste. Using basic products to shock the water tone down chlorine. Multifunctional Shock Products. These products work fast and restore the water's clarity by eliminating all kinds of bacteria. Multifunctional products also balance the pool water's pH, boost filtration, and provide increased algae protection. The main pro is that these shocking products allow you to get back into the water within 15 minutes of use."
        },
        {
          "headline":"Add algaecide to the water.",
          "description":"Just imagine, there are millions microscopic plants that can easily make your pool their home. Rain, wind, and fill water can allow these tiny forms of algae to settle into your pool, making the water quickly unusable and diminishing the efficiency of the pool chemicals. Your filters will become quickly clogged, and the water's circulation will become sluggish. Algaecides effectively inhibit these small plants from invading the pool algae. Read the manufacturer's instructions carefully, and then pour the suggested amount of algaecides directly into the pool."
        },
        {
          "headline":"Handle necessary chemicals properly and carefully.",
          "description":"There are many available, but they can be highly dangerous to humans and animals. Use caution when utilizing any chemical solution. Always wear rubber gloves. Wash hands immediately after being exposed to chemicals. Follow the dosage instructions carefully and store chemicals according to the manufacturer's directions. Never pour or return unused or wasted material to the original package, and do not throw it away in regular garbage. Do not light fires when using chemicals. Always add the chemical to the water, and not the other way around."
        }
      ]
    },
    {
      "name":"Maintaining Your Pool's Filters",
      "steps":[
        {
          "headline":"Manually clean your pool daily, if possible.",
          "description":"Use brushes, cleaners, and debris catching devices to remove surface dirt and excessive amounts of leaves or branches."
        },
        {
          "headline":"Keep your pool's water between 1/3 and 1/2 way up the opening of the pool skimmer.",
          "description":"This is the level at which your pool operates best. A pool skimmer is a device that attracts the surface water of the pool. It pulls in small debris, like leaves and other things that might have fallen into the pool. A few inconvenient, and potentially damaging, things can happen if the water level is too high or too low for the skimmer. If the water level is too high, the water moves too slowly into the skimmer. This can result in debris bypassing the skimmer and accumulating in the pool. If the water level is too low, the skimmer is left with little to suck in and it can bottom out. It will suck in air instead, potentially burning your pool's motor pump."
        },
        {
          "headline":"Pour in water before backwashing and vacuuming.",
          "description":"The action of vacuuming causes the water level to decrease, which is why you need to add water beforehand."
        },
        {
          "headline":"Be aware of different filtration systems.",
          "description":"There are three basic filtration types:\nSand filters: these filters are made of metal, fiberglass, or concrete and they contain a solid bed of specific sand. The sand does the job of trapping debris. Change the sand in the filter every five years. Cartridge filters: these filters allow water to seep through a fine filtrating surface. This filter keeps the impurities it catches until you clean it. An advantage of cartridge filters over sand ones, is that they have a greater surface area, which results in fewer clogs and easy maintenance. Replace them every 3-5 years. Diatomaceous earth filters: these filters contain porous bone material, which easily filters debris. Installing a DE filter is quite simple, as you place it directly into the skimmer. Backwashing and replacement/addition of a new DE has to be done once or twice a year."
        },
        {
          "headline":"Remember to maintain your filters.",
          "description":"Your pool filters are some of the most important tools for your pool, and need to stay very clean. So make sure to remember them in your pool care routine."
        }
      ]
    }
  ],
  "text":" Understanding Your Pool's Water Needs Become familiar with your pool's total alkalinity and pH levels. Total alkalinity is a way of measuring the water's ability to neutralize acidity. Your water's alkalinity levels are directly related to your water's pH; the higher the total alkalinity, the higher the pH levels of your pool's water will be. pH levels measure how acidic or basic substances are. The pH scale has a range between 0 and 14, with a neutral pH at 7. Know your pool's chlorine, calcium hardness, cyanuric acid, and total dissolved solids levels. Besides the pH and alkaline levels, these are also important considerations. Make sure you understand what they are and how they benefit your water. Chlorine is used to disinfect and sanitize the water. Calcium hardness refers to the amount of calcium present in the water. If the calcium levels are too low your water will become corrosive, potentially ruining the body of your pool. Cyanuric acid protects the chlorine in the water from the sun's ultraviolet rays. Total dissolved solids are mainly composed of inorganic salts (calcium, magnesium, potassium, sodium, bicarbonates, chlorides and sulfates) and small amounts of other organic materials dissolved in the water. Identify your pool water's pH, total alkalinity, chlorine, cyanuric acid, calcium hardness, and total dissolved solids levels. Keep these recommended level ranges in mind. pH: 7.2 - 7.8\nTotal alkalinity: 80 - 120 ppm\nChlorine: 1.0 - 2.0 ppm\nCyanuric Acid: 40 - 80 ppm\nCalcium hardness: 180 - 220 ppm, though some say 200 - 400\nTotal Dissolved Solids: below 5000 ppm Know your testing timelines for each water component. When you test your pool's water, you should observe certain timelines in order for your pool to function well, and for the water to stay clean and healthy. Each element, like the pH for example, has to be tested at a specific point. Some professionals advise daily testing, which can be difficult for many people. Keep the following timeframes in mind to ensure proper pool functions:\npH should be tested twice a week. Total alkalinity should be tested once a week, and at least once a month. Chlorine should be tested twice a week. Cyanuric acid should be tested twice a season. Calcium hardness should be tested twice a season. Total dissolved solids should be tested once a week, and at least once a month. Testing Your Pool's Water Purchase testing strips from your local pool store. Buy the strips that identify chlorine, alkaline, pH, and cyanuric acid. Nowadays, you don't have to bother with different tests for different chemicals. Dip the test strip into the pool. Move to an area that's separated from the pool's skimmer, and dip the test strip about 18 inches (46 cm) into the water for about ten seconds. Wait until the different colors fill in. Match the color readings to the color description on the product box or bottle. Make sure to read the product's instructions carefully, as different manufacturers might have different procedures. Make sure that your readings fall in the appropriate range. It's very important to adjust your water in case your readings do not match the recommended ranges. Using the right chemicals will easily adjust the ranges should they not meet suggested standards. Applying Chemicals To Your Pool Have the right chemicals readily available. From time to time, you'll be faced with water problems that require aggressive chemical solutions. But generally, these chemicals should become part of your pool maintenance routine as you might need to adjust certain levels sporadically. You product's instructions will provide appropriate dosage, should adjusting be necessary. Here are the most common chemicals you'll need:\nChlorine\nShocking products\nAlgaecide Apply chlorine to your pool. You and your guests won't be too happy with algae and bacteria swimming alongside with you. Chlorine keeps these unwanted guests away. There are a few options out there when it comes to choosing the right chlorine products. Basic Chlorinating Tabs. These tabs dissolve slowly, and can be found in 1-inch and 3-inch sizes. They do a great job at keeping your pool clean. Plus, most chlorinating tablets contain a built-in stabilizer to shield your water's chlorine from the sun's rays. You can use the tablets in your floating dispenser, skimmer or automatic chlorinator. Liquid Chlorine. In liquid form, chlorine is quite similar to household bleach. But beware: it is also much stronger when it is designed for pools. Applying liquid chlorine is relatively easy, but it has a rather short shelf life. It won't last for more than a few weeks. Chlorinating Tabs. Some non-basic chlorinating tabs provide a multifunctional approach to pool maintenance; they sanitize the water while also shocking your pool. Shocking your pool gets rid of all sorts of contaminants. Chlorinating Granules. These granules come in multifunctional varieties that can help you resolve several issues at once; chlorinating, shocking and killing algae with a single, daily application. Shock your pool. Performing this task is crucial, as shocking keeps the water clear, and reduces eye irritation and odors coming from the chlorine. As mentioned, certain chlorine products already have built-in shockers, but if you choose to go with ones that do not, here are some shocking products that get the job done:\nBasic Shock Products. Basic products take care of killing bacteria, from breaking down cosmetic residue, suntan lotions, and any kind of swimmer waste. Using basic products to shock the water tone down chlorine. Multifunctional Shock Products. These products work fast and restore the water's clarity by eliminating all kinds of bacteria. Multifunctional products also balance the pool water's pH, boost filtration, and provide increased algae protection. The main pro is that these shocking products allow you to get back into the water within 15 minutes of use. Add algaecide to the water. Just imagine, there are millions microscopic plants that can easily make your pool their home. Rain, wind, and fill water can allow these tiny forms of algae to settle into your pool, making the water quickly unusable and diminishing the efficiency of the pool chemicals. Your filters will become quickly clogged, and the water's circulation will become sluggish. Algaecides effectively inhibit these small plants from invading the pool algae. Read the manufacturer's instructions carefully, and then pour the suggested amount of algaecides directly into the pool. Handle necessary chemicals properly and carefully. There are many available, but they can be highly dangerous to humans and animals. Use caution when utilizing any chemical solution. Always wear rubber gloves. Wash hands immediately after being exposed to chemicals. Follow the dosage instructions carefully and store chemicals according to the manufacturer's directions. Never pour or return unused or wasted material to the original package, and do not throw it away in regular garbage. Do not light fires when using chemicals. Always add the chemical to the water, and not the other way around. Maintaining Your Pool's Filters Manually clean your pool daily, if possible. Use brushes, cleaners, and debris catching devices to remove surface dirt and excessive amounts of leaves or branches. Keep your pool's water between 1/3 and 1/2 way up the opening of the pool skimmer. This is the level at which your pool operates best. A pool skimmer is a device that attracts the surface water of the pool. It pulls in small debris, like leaves and other things that might have fallen into the pool. A few inconvenient, and potentially damaging, things can happen if the water level is too high or too low for the skimmer. If the water level is too high, the water moves too slowly into the skimmer. This can result in debris bypassing the skimmer and accumulating in the pool. If the water level is too low, the skimmer is left with little to suck in and it can bottom out. It will suck in air instead, potentially burning your pool's motor pump. Pour in water before backwashing and vacuuming. The action of vacuuming causes the water level to decrease, which is why you need to add water beforehand. Be aware of different filtration systems. There are three basic filtration types:\nSand filters: these filters are made of metal, fiberglass, or concrete and they contain a solid bed of specific sand. The sand does the job of trapping debris. Change the sand in the filter every five years. Cartridge filters: these filters allow water to seep through a fine filtrating surface. This filter keeps the impurities it catches until you clean it. An advantage of cartridge filters over sand ones, is that they have a greater surface area, which results in fewer clogs and easy maintenance. Replace them every 3-5 years. Diatomaceous earth filters: these filters contain porous bone material, which easily filters debris. Installing a DE filter is quite simple, as you place it directly into the skimmer. Backwashing and replacement/addition of a new DE has to be done once or twice a year. Remember to maintain your filters. Your pool filters are some of the most important tools for your pool, and need to stay very clean. So make sure to remember them in your pool care routine.",
  "tyn_model":[
    "water",
    "chlorine",
    "chemicals",
    "cyanuric acid",
    "skimmer",
    "pool",
    "calcium",
    "cyanuric",
    "algae",
    "chlorine products",
    "chlorinating tabs",
    "filters",
    "algaecides",
    "pool skimmer",
    "sand",
    "magnesium",
    "ph",
    "chlorinating tablets",
    "bleach",
    "suntan lotions",
    "brushes",
    "cleaners",
    "sand filters",
    "diatomaceous earth filters",
    "de filter",
    "de",
    "pool filters",
    "pool care routine"
  ],
  "tyn_section":[

  ]
}