{
  "title":"How to Make a Ginger Sticky Date Pudding",
  "url":"https://www.wikihow.com/Make-a-Ginger-Sticky-Date-Pudding",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Puddings"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180-200 C.",
      "description":""
    },
    {
      "headline":"Grease a deep 20 centimeter (7.9 in) round cake pan.",
      "description":""
    },
    {
      "headline":"Combine the dates, glazed ginger, soda and water in a food processor.",
      "description":""
    },
    {
      "headline":"Let stand 5 minutes.",
      "description":""
    },
    {
      "headline":"Add the butter and sugar to the food processor.",
      "description":""
    },
    {
      "headline":"Process until the mixture is almost smooth.",
      "description":""
    },
    {
      "headline":"Add the eggs, flour and ground ginger and process until combined.",
      "description":""
    },
    {
      "headline":"Pour the mixture into the pan and bake for 45 minutes.",
      "description":""
    },
    {
      "headline":"Let stand for 10 minutes.",
      "description":""
    },
    {
      "headline":"Make the butterscotch sauce while the cake is standing.",
      "description":"Combine the ingredients in a medium saucepan. Stir over low heat until the sauce is smooth."
    },
    {
      "headline":"Serve while still warm.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 180-200 C.  Grease a deep 20 centimeter (7.9 in) round cake pan.  Combine the dates, glazed ginger, soda and water in a food processor.  Let stand 5 minutes.  Add the butter and sugar to the food processor.  Process until the mixture is almost smooth.  Add the eggs, flour and ground ginger and process until combined.  Pour the mixture into the pan and bake for 45 minutes.  Let stand for 10 minutes.  Make the butterscotch sauce while the cake is standing. Combine the ingredients in a medium saucepan. Stir over low heat until the sauce is smooth. Serve while still warm. ",
  "tyn_model":[
    "ginger",
    "food processor",
    "oven",
    "cake pan",
    "dates",
    "soda",
    "water",
    "butter",
    "sugar",
    "eggs",
    "flour",
    "butterscotch sauce",
    "medium saucepan"
  ],
  "tyn_section":[

  ]
}