{
  "title":"How to Substitute for Mustard Seed",
  "url":"https://www.wikihow.com/Substitute-for-Mustard-Seed",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes"
  ],
  "methods":[
    {
      "name":"Substituting with Other Ingredients",
      "steps":[
        {
          "headline":"Use prepared horseradish to add spice.",
          "description":"Prepared horseradish is made by combining ground horseradish with vinegar, and sometimes other spices, to form a sauce. You can get it from your local supermarket. In place of mustard seed, use the same amount of prepared horseradish to add spice and complexity to your recipe."
        },
        {
          "headline":"Add mayonnaise to achieve the same consistency.",
          "description":"Mustard seeds are often used to thicken soups or other dishes. If you need mustard seeds to change the consistency of a dish, substitute the seeds for the same amount of mayonnaise."
        },
        {
          "headline":"Substitute wasabi to increase the heat.",
          "description":"Wasabi is a spicy green paste used in many Asian dishes. If you don’t have mustard seed, substitute it with a smaller amount of wasabi to add heat to your dish."
        },
        {
          "headline":"Use caraway seeds for a similar flavor.",
          "description":"Substitute the same quantity of caraway seeds for mustard seeds in your recipe. The flavors are similar and using one kind of seed in place of another ensures you don’t have to alter your recipe any further."
        },
        {
          "headline":"Add turmeric to increase the nutritional value.",
          "description":"Turmeric reduces inflammation, relieves pain, and boosts immunity. Substitute ground turmeric for mustard seed using a 1 to 1 ratio for added health benefits."
        }
      ]
    },
    {
      "name":"Using Different Kinds of Mustard",
      "steps":[
        {
          "headline":"Substitute the same amount of dry mustard for mustard seeds.",
          "description":"If your recipe calls for 1 Tbsp (14.3 g) of mustard seeds, simply substitute it for 1 Tbsp (14.3 g) of dry mustard."
        },
        {
          "headline":"Use 1 tsp of prepared mustard instead of 1 Tbsp of mustard seeds.",
          "description":"If possible, decrease the amount of liquid in the recipe by 1 tsp (5 mL) to compensate for this substitution. For other quantities, use one-third of the amount of prepared mustard in place of mustard seed."
        },
        {
          "headline":"Replace white mustard seeds with fewer brown or black mustard seeds.",
          "description":"Brown and black mustard seeds are more potent than white (also called yellow) mustard seeds. If your recipe calls for white mustard seeds, try using half the amount of brown or a quarter of the amount of black mustard seeds."
        },
        {
          "headline":"Use more yellow mustard seeds, or fewer black, in place of brown.",
          "description":"Brown mustard seeds are more flavorful than yellow but less intense than black mustard seeds. Use twice as many yellow mustard seeds or half as many black mustard seeds."
        },
        {
          "headline":"Add more yellow or brown mustard seeds instead of using black.",
          "description":"Black mustard seeds are the most flavorful and spicy. If you can’t find them, use four times as many white mustard seeds or twice as many brown mustard seeds in their place."
        }
      ]
    }
  ],
  "text":" Substituting with Other Ingredients Use prepared horseradish to add spice. Prepared horseradish is made by combining ground horseradish with vinegar, and sometimes other spices, to form a sauce. You can get it from your local supermarket. In place of mustard seed, use the same amount of prepared horseradish to add spice and complexity to your recipe. Add mayonnaise to achieve the same consistency. Mustard seeds are often used to thicken soups or other dishes. If you need mustard seeds to change the consistency of a dish, substitute the seeds for the same amount of mayonnaise. Substitute wasabi to increase the heat. Wasabi is a spicy green paste used in many Asian dishes. If you don’t have mustard seed, substitute it with a smaller amount of wasabi to add heat to your dish. Use caraway seeds for a similar flavor. Substitute the same quantity of caraway seeds for mustard seeds in your recipe. The flavors are similar and using one kind of seed in place of another ensures you don’t have to alter your recipe any further. Add turmeric to increase the nutritional value. Turmeric reduces inflammation, relieves pain, and boosts immunity. Substitute ground turmeric for mustard seed using a 1 to 1 ratio for added health benefits. Using Different Kinds of Mustard Substitute the same amount of dry mustard for mustard seeds. If your recipe calls for 1 Tbsp (14.3 g) of mustard seeds, simply substitute it for 1 Tbsp (14.3 g) of dry mustard. Use 1 tsp of prepared mustard instead of 1 Tbsp of mustard seeds. If possible, decrease the amount of liquid in the recipe by 1 tsp (5 mL) to compensate for this substitution. For other quantities, use one-third of the amount of prepared mustard in place of mustard seed. Replace white mustard seeds with fewer brown or black mustard seeds. Brown and black mustard seeds are more potent than white (also called yellow) mustard seeds. If your recipe calls for white mustard seeds, try using half the amount of brown or a quarter of the amount of black mustard seeds. Use more yellow mustard seeds, or fewer black, in place of brown. Brown mustard seeds are more flavorful than yellow but less intense than black mustard seeds. Use twice as many yellow mustard seeds or half as many black mustard seeds. Add more yellow or brown mustard seeds instead of using black. Black mustard seeds are the most flavorful and spicy. If you can’t find them, use four times as many white mustard seeds or twice as many brown mustard seeds in their place.",
  "tyn_model":[
    "mustard",
    "mustard seeds",
    "horseradish",
    "mustard seed",
    "wasabi",
    "turmeric",
    "mayonnaise",
    "caraway seeds",
    "dry mustard",
    "vinegar",
    "yellow mustard seeds"
  ],
  "tyn_section":[

  ]
}