{
  "title":"How to Decide What to Eat",
  "url":"https://www.wikihow.com/Decide-What-to-Eat",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Trying New Foods at Home",
      "steps":[
        {
          "headline":"Find a recipe that you’ve never cooked before.",
          "description":"If you’re unsure of what to cook for a meal, try finding a new dish or recipe that you can prepare. It’s easy to get stuck in a rut of only eating a handful of meals over and over. Deliberately looking for a dish you’ve never had before can help bring some variety into your home-cooked meals. Sites like All Recipes or Food.com offer a huge variety of recipes. Input different ingredients, and browse until you find a good-looking recipe that you’ve never tried before. If you often cook pasta and other Italian dishes, try searching for a recipe that includes no pasta and no meat. You could discover, for example, a vegetarian tofu salad that you enjoy."
        },
        {
          "headline":"Prepare a dish from a new type of cuisine.",
          "description":"If you’re bored with the types of meals that you usually prepare at home, try something new from a different type of regional or world cuisine. If you’re having trouble coming up with suitable recipes, check out websites like the BBC’s \"goodfood.\" You can choose among many recipes from international cuisines including Indian, Chinese, Moroccan, and French. Alternately, if you’re in the mood to eat out at a restaurant, choose an eatery that serves a type of cuisine you haven’t tried before."
        },
        {
          "headline":"Balance out other meals you’ve had recently.",
          "description":"Think back on what you’ve eaten throughout the day—or even the week. If you notice any food groups that you’ve neglected, plan a homemade meal which incorporates that food group. For example, if it’s time for dinner and you’ve had protein-heavy meals so far (e.g. bacon for breakfast and a burger for lunch), plan to incorporate more carbs or fruits and vegetables in your dinner. In addition to helping with indecisiveness, balancing your daily diet will also help you to eat a healthier blend of foods."
        }
      ]
    },
    {
      "name":"Using the Process of Elimination",
      "steps":[
        {
          "headline":"Decide where or what you don’t want to eat.",
          "description":"Whether you’re just deciding on a meal for yourself, or if you’re with another person or group of people, start by removing restaurants or recipes that don’t sound good. Removing unwanted options will leave you with a small number of better food options, and make your decision that much easier. For example, maybe your friend ate pizza last night and doesn’t want to repeat, or else you just aren’t in the mood for homemade Italian food."
        },
        {
          "headline":"Consider the time and location.",
          "description":"If you’re hoping to eat relatively soon, avoid any restaurants that will take more than 15 or 20 minutes to travel to. Unless you’re prepared to travel for a delicious meal, you and your group can decide together to stick to a nearby eatery. If any restaurants are simply too much of a hassle, cross them off your list. For example, if your first dining choice is located across a city and you’re in peak dining hour or the middle of rush hour, settle for something closer to home."
        },
        {
          "headline":"Consider food restrictions, allergies, or diets.",
          "description":"If you’re planning to go out to eat with a group, be sure to choose a location that will cater to everyone’s needs. For example, if a friend has a seafood allergy, you can rule out the local oyster bar. If you’re dining with a vegetarian, avoid a steakhouse or restaurant specializing in hamburgers. Be considerate of your dining partners: the restaurant or dining option your group chooses should offer something for every person you’ll be eating with."
        },
        {
          "headline":"Make your choice.",
          "description":"Ultimately, it comes down to simply making a choice. If you’re with a group that can’t make up its mind, appoint one person to make an executive decision. If you’re on your own, pick a location or decide on a meal to cook for yourself at home. If you end up regretting your choice, at least you’ll know not to return to the restaurant or re-make the same recipe. If you’re stuck deciding between two different food options—restaurants, food trucks, etc.—a simple coin toss could decide for you."
        }
      ]
    },
    {
      "name":"Overcoming a Group Deadlock",
      "steps":[
        {
          "headline":"Use the 5:3:1 rule.",
          "description":"If you’re eating out (or cooking at home) with one or two other people and you cannot reach a consensus, use the 5:3:1: rule. The first person suggests five meal options (whether restaurants to dine out at, or meals to prepare at home). The second person cuts two options, leaving three. The third person makes the final decision and chooses the meal option. If you’re using the 5:3:1 rule with only two people, it can be up to the first person to make the final choice. This method won’t work with groups larger than three, as not every person will have input."
        },
        {
          "headline":"Choose an alternating leader.",
          "description":"Part of the difficulty with choosing a meal or restaurant option with a group is that everyone has their own preferences, which can prove challenging to accommodate. One way around this is to opt for a rotation “leader” position: allow one person to choose which restaurant or eatery to go to. Their decision should be final. Then, each subsequent time the group is planning to eat out, the leader position can rotate, and the new leader will get to choose their preference for eatery\nThis can also work with a dining-in option: allow a rotating leader or family member to choose a dish or recipe you can cook at home."
        },
        {
          "headline":"Pair your meal choice with an activity.",
          "description":"You’ll have an easier time deciding what restaurant or eatery to dine at if you plan to accompany your meal with an activity on the town. For example, if you’ve wanted to try a new restaurant that’s near a movie theater, plan to see a movie right after you finish your meal. Or, you could plan in reverse: if you know you want to attend an art gallery opening, look around online for restaurants near the gallery, and make your lunch or dinner plans there."
        },
        {
          "headline":"Draw a name out of a hat to choose a decision-maker.",
          "description":"While making plans with a group, put all group member names on separate sheets of paper, fold the papers up, and put them in a hat or bowl. Draw a name out and let that person know that they’re in charge of deciding where to eat this time."
        },
        {
          "headline":"Try planning group meals based on food themes.",
          "description":"Have someone choose the theme for the gathering, then have a potluck with this theme. For example, Under the Sea (fried shrimp, crab legs, lobster rolls, grits, fish and chips, etc.) or Mexican Fiesta (refried beans, enchiladas, burritos, spicy rice, etc. )."
        }
      ]
    },
    {
      "name":"Using Websites and Apps to Find a Restaurant",
      "steps":[
        {
          "headline":"Browse restaurants on Zomato.",
          "description":"Zomato lists and ranks restaurants in your local area by food type: breakfast, lunch, dinner, delivery, etc. If you are feeling indecisive about where to eat, scroll through a listing of local restaurants. You can also filter your restaurant search by type of food/cuisine or location."
        },
        {
          "headline":"Take a look through Yelp.",
          "description":"Yelp is a terrific resource for anyone looking for a variety of restaurants in their local area. The site or corresponding app will provide starred ratings of many restaurants, and will also list the eateries’ menus and pricing. If you’re looking to try a new restaurant or a new type of food altogether (e.g. Indian, Peruvian, raw, etc.) check Yelp. Keep in mind that Yelp’s user reviews are obviously subjective. An unhappy eater may give an otherwise excellent restaurant two stars for a superficial reason. So, don’t dismiss a restaurant, food truck, or café simply because of one or two bad reviews. Yelp is accessible throughout the United States and Europe. However, many European countries favor Foursquare over Yelp for restaurant reviews."
        },
        {
          "headline":"Order in with GrubHub or EatStreet.",
          "description":"Both of the smartphone apps work similarly: they let you order from any number of local restaurants that deliver food. These apps are a good option if you want to eat in, but are interested in having food from a local restaurant: either an old favorite or a new place you’ve wanted to dine at for months. Either app will give a full menu and pricing, and will let you know delivery costs and minimum-order amounts at each restaurant. GrubHub and EatStreet are both designed for users in the United States. The UberEats app is basically the same as GrubHub. UberEats works in major international cities like Amsterdam, Tokyo, Singapore, and Toronto."
        }
      ]
    }
  ],
  "text":" Trying New Foods at Home Find a recipe that you’ve never cooked before. If you’re unsure of what to cook for a meal, try finding a new dish or recipe that you can prepare. It’s easy to get stuck in a rut of only eating a handful of meals over and over. Deliberately looking for a dish you’ve never had before can help bring some variety into your home-cooked meals. Sites like All Recipes or Food.com offer a huge variety of recipes. Input different ingredients, and browse until you find a good-looking recipe that you’ve never tried before. If you often cook pasta and other Italian dishes, try searching for a recipe that includes no pasta and no meat. You could discover, for example, a vegetarian tofu salad that you enjoy. Prepare a dish from a new type of cuisine. If you’re bored with the types of meals that you usually prepare at home, try something new from a different type of regional or world cuisine. If you’re having trouble coming up with suitable recipes, check out websites like the BBC’s \"goodfood.\" You can choose among many recipes from international cuisines including Indian, Chinese, Moroccan, and French. Alternately, if you’re in the mood to eat out at a restaurant, choose an eatery that serves a type of cuisine you haven’t tried before. Balance out other meals you’ve had recently. Think back on what you’ve eaten throughout the day—or even the week. If you notice any food groups that you’ve neglected, plan a homemade meal which incorporates that food group. For example, if it’s time for dinner and you’ve had protein-heavy meals so far (e.g. bacon for breakfast and a burger for lunch), plan to incorporate more carbs or fruits and vegetables in your dinner. In addition to helping with indecisiveness, balancing your daily diet will also help you to eat a healthier blend of foods. Using the Process of Elimination Decide where or what you don’t want to eat. Whether you’re just deciding on a meal for yourself, or if you’re with another person or group of people, start by removing restaurants or recipes that don’t sound good. Removing unwanted options will leave you with a small number of better food options, and make your decision that much easier. For example, maybe your friend ate pizza last night and doesn’t want to repeat, or else you just aren’t in the mood for homemade Italian food. Consider the time and location. If you’re hoping to eat relatively soon, avoid any restaurants that will take more than 15 or 20 minutes to travel to. Unless you’re prepared to travel for a delicious meal, you and your group can decide together to stick to a nearby eatery. If any restaurants are simply too much of a hassle, cross them off your list. For example, if your first dining choice is located across a city and you’re in peak dining hour or the middle of rush hour, settle for something closer to home. Consider food restrictions, allergies, or diets. If you’re planning to go out to eat with a group, be sure to choose a location that will cater to everyone’s needs. For example, if a friend has a seafood allergy, you can rule out the local oyster bar. If you’re dining with a vegetarian, avoid a steakhouse or restaurant specializing in hamburgers. Be considerate of your dining partners: the restaurant or dining option your group chooses should offer something for every person you’ll be eating with. Make your choice. Ultimately, it comes down to simply making a choice. If you’re with a group that can’t make up its mind, appoint one person to make an executive decision. If you’re on your own, pick a location or decide on a meal to cook for yourself at home. If you end up regretting your choice, at least you’ll know not to return to the restaurant or re-make the same recipe. If you’re stuck deciding between two different food options—restaurants, food trucks, etc.—a simple coin toss could decide for you. Overcoming a Group Deadlock Use the 5:3:1 rule. If you’re eating out (or cooking at home) with one or two other people and you cannot reach a consensus, use the 5:3:1: rule. The first person suggests five meal options (whether restaurants to dine out at, or meals to prepare at home). The second person cuts two options, leaving three. The third person makes the final decision and chooses the meal option. If you’re using the 5:3:1 rule with only two people, it can be up to the first person to make the final choice. This method won’t work with groups larger than three, as not every person will have input. Choose an alternating leader. Part of the difficulty with choosing a meal or restaurant option with a group is that everyone has their own preferences, which can prove challenging to accommodate. One way around this is to opt for a rotation “leader” position: allow one person to choose which restaurant or eatery to go to. Their decision should be final. Then, each subsequent time the group is planning to eat out, the leader position can rotate, and the new leader will get to choose their preference for eatery\nThis can also work with a dining-in option: allow a rotating leader or family member to choose a dish or recipe you can cook at home. Pair your meal choice with an activity. You’ll have an easier time deciding what restaurant or eatery to dine at if you plan to accompany your meal with an activity on the town. For example, if you’ve wanted to try a new restaurant that’s near a movie theater, plan to see a movie right after you finish your meal. Or, you could plan in reverse: if you know you want to attend an art gallery opening, look around online for restaurants near the gallery, and make your lunch or dinner plans there. Draw a name out of a hat to choose a decision-maker. While making plans with a group, put all group member names on separate sheets of paper, fold the papers up, and put them in a hat or bowl. Draw a name out and let that person know that they’re in charge of deciding where to eat this time. Try planning group meals based on food themes. Have someone choose the theme for the gathering, then have a potluck with this theme. For example, Under the Sea (fried shrimp, crab legs, lobster rolls, grits, fish and chips, etc.) or Mexican Fiesta (refried beans, enchiladas, burritos, spicy rice, etc. ). Using Websites and Apps to Find a Restaurant Browse restaurants on Zomato. Zomato lists and ranks restaurants in your local area by food type: breakfast, lunch, dinner, delivery, etc. If you are feeling indecisive about where to eat, scroll through a listing of local restaurants. You can also filter your restaurant search by type of food/cuisine or location. Take a look through Yelp. Yelp is a terrific resource for anyone looking for a variety of restaurants in their local area. The site or corresponding app will provide starred ratings of many restaurants, and will also list the eateries’ menus and pricing. If you’re looking to try a new restaurant or a new type of food altogether (e.g. Indian, Peruvian, raw, etc.) check Yelp. Keep in mind that Yelp’s user reviews are obviously subjective. An unhappy eater may give an otherwise excellent restaurant two stars for a superficial reason. So, don’t dismiss a restaurant, food truck, or café simply because of one or two bad reviews. Yelp is accessible throughout the United States and Europe. However, many European countries favor Foursquare over Yelp for restaurant reviews. Order in with GrubHub or EatStreet. Both of the smartphone apps work similarly: they let you order from any number of local restaurants that deliver food. These apps are a good option if you want to eat in, but are interested in having food from a local restaurant: either an old favorite or a new place you’ve wanted to dine at for months. Either app will give a full menu and pricing, and will let you know delivery costs and minimum-order amounts at each restaurant. GrubHub and EatStreet are both designed for users in the United States. The UberEats app is basically the same as GrubHub. UberEats works in major international cities like Amsterdam, Tokyo, Singapore, and Toronto.",
  "tyn_model":[
    "yelp",
    "—or",
    "pizza",
    "seafood",
    "restaurant",
    "—restaurants",
    "“leader",
    "” position",
    "bowl",
    "shrimp",
    "crab legs",
    "lobster rolls",
    "fish",
    "refried beans",
    "spicy rice",
    "’ menus",
    "ubereats"
  ],
  "tyn_section":[

  ]
}