{
  "title":"How to Do Batch Cooking",
  "url":"https://www.wikihow.com/Do-Batch-Cooking",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "parts":[
    {
      "name":"Planning Your Meals",
      "steps":[
        {
          "headline":"Figure out what kind of batch cooking you want to do.",
          "description":"In essence, batch cooking means preparing food ahead of time in large batches. Decide whether or not you want to freeze any of the food you cook, and whether you’d like to create finished meals or simply prep ingredients. Decide how many meals you’d like to make overall, and set aside some time for shopping and cooking. Often batch cooking refers to dinners, but you can use this method to prep breakfasts, lunches, or snacks. If this is your first time doing any kind of batch cooking, you may want to start with just a week’s worth of meals, or less. If you are preparing meals for one week, you can probably knock it out in 1-3 hours, plus shopping time. If you are preparing meals for an entire month, it can take anywhere from 3-6 hours. You may want to split your work up over the course of two days."
        },
        {
          "headline":"Choose foods that freeze well.",
          "description":"Many food freeze well. Some great examples are cooked grains (rice, oatmeal, quinoa), meatballs, sauces, soups, breads, fruit, cooked beans, casseroles, lasagna, chili, and many desserts (like muffins and pies). There are only a handful of foods that should be avoided.These include:\nCream cheese, sour cream, or any kind of milk-based sauce\nMayonnaise, egg whites, or meringue\nPotatoes (raw or baked; in recipes they are OK)\nLettuce, endive, parsley, or celery (spinach is OK)"
        },
        {
          "headline":"Select some soups and stews.",
          "description":"Stews, soups, curries, and chili dishes are great choices for batch cooking. These foods are easy to make in large amounts, and they freeze great. Select some soup and stew recipes that your family would enjoy. Here are some ideas: \nChicken curry with sweet potatoes\nTurkey chili with garbanzo beans\nCorn and potato chowder\nTomato soup"
        },
        {
          "headline":"Choose one-dish recipes.",
          "description":"Recipes that combine several ingredients in one dish tend to freeze better that foods that are frozen individually. Plus, one-dish meals make reheating more practical. Select some one-dish recipes to batch cook. Some ideas include: \nLasagna\nChicken pot pie\nRice pilaf with chicken and veggies\nFried rice"
        },
        {
          "headline":"Make a list of meals.",
          "description":"Come up with the ultimate list of what you’ll batch cook this round. Come up with dishes that use repeat ingredients, and remember that you can always repeat meals. Double or triple recipe sizes for recipes you know you like. It is best to batch good meals that you already know that you (and your family) enjoy. Before you make a huge batch of something, it is a good idea to try out a recipe and make sure you like it."
        },
        {
          "headline":"Create a shopping list.",
          "description":"Look over all the recipes you plan to use and create a detailed shopping list. Separate your list into three categories: produce (fruits and veggies), cold items (meat, dairy, frozen items), and dry goods (everything else). Next to each item, include the amount you will need. If you are going to more than one store, you might create a separate list for each store. You might want to create/edit this list on a computer and then print it out. Don’t forget about oils and spices."
        }
      ]
    },
    {
      "name":"Making Your Food",
      "steps":[
        {
          "headline":"Go shopping.",
          "description":"Place your shopping list on a clipboard, grab a pen, and head to the store. Choose produce items that are ripe and ready to cook with. Cross items off your list as you shop, then double-check your list before you check out. If can help to bring your dinner list with you as well. This helps prevent forgetting ingredients. Bring reusable shopping bags with you to reduce waste."
        },
        {
          "headline":"Make a cooking plan.",
          "description":"In order to cook a lot of items at once, it’s best to make a plan before you start. There are two main factors to keep in mind when making a cooking plan: cooking time and kitchen appliances. Place the items you need to prepare in order from longest cooking time to shortest cooking time. Use this cooking order as a guideline, so that most items finish cooking at roughly the same time. Think about which cooking appliances are required for which recipe. If one item is roasting in the oven, you can make something else in the slow-cooker. Try to get one item started in each major appliance you have (oven, range, slow-cooker, etc. )."
        },
        {
          "headline":"Wash, chop, and measure your ingredients.",
          "description":"Once you’ve got a plan in place it is time to prep your ingredients. Carefully wash all of your vegetables, and chop them. If any of your meat needs to be chopped, do so now. Measure out the ingredients you will need for each recipe and set them aside."
        },
        {
          "headline":"Follow your cooking plan.",
          "description":"With everything prepped and measured, it is time to start cooking. With so many pots on the stove (literally) it is important not to rush or try to do more than you can handle at one time. Follow your cooking list and prepare your batch meals. It is a good idea to clean and wash some dishes as you go. This way the cleaning is not too overwhelming at the end."
        }
      ]
    },
    {
      "name":"Packaging and Labeling Your Food",
      "steps":[
        {
          "headline":"Decide how you’ll package your food.",
          "description":"After your ingredients have been prepared, figure out how you’ll package and store what you made. If you will be keeping items in your fridge, airtight glass containers are ideal, but any air-tight container will work. If you will be storing items in your freezer, freezer bags are the most efficient. Make sure you have the containers you’ll need."
        },
        {
          "headline":"Create complete meals.",
          "description":"If you will be putting together complete meals to store in your freezer, now is the time to package them up. Follow each recipe, using the ingredients you have already prepared. Store the amount your family would normally consume in one sitting in one freezer bag. Be sure to squeeze all the air out of each bag, and make sure it is completely sealed."
        },
        {
          "headline":"Package individual servings of foods or ingredients.",
          "description":"If you are doing a weekly ingredient meal prep, you can store individual servings of your items in airtight containers in your fridge. You might make yourself a series of lunches for the week, or prepare what you’ll need for dinners. When you’re ready for dinner, pull out the ingredients and use them to make a complete meal."
        },
        {
          "headline":"Label your food items.",
          "description":"Before you place anything in your fridge or freezer, it is very important to add a label! Use a permanent marker to write directly on a freezer bag, or place masking tape on glass containers. Write down what the contents are, as well as the date."
        },
        {
          "headline":"Freeze or refrigerate your food.",
          "description":"Place your food in the fridge or freezer. Most meat dishes will last 4-5 days in the fridge, while plant-based items (like beans or grains) can last 5-7. Most meals can last up to 4 months in the freezer."
        },
        {
          "headline":"Reheat as needed.",
          "description":"If your food is frozen, transfer it to the fridge up to a day before you plan to eat it. Then move the contents to a pot, pan, or baking dish, and heat it up on the stove or in the oven. Many recipes will include reheat instructions, so reference these."
        }
      ]
    }
  ],
  "text":" Planning Your Meals Figure out what kind of batch cooking you want to do. In essence, batch cooking means preparing food ahead of time in large batches. Decide whether or not you want to freeze any of the food you cook, and whether you’d like to create finished meals or simply prep ingredients. Decide how many meals you’d like to make overall, and set aside some time for shopping and cooking. Often batch cooking refers to dinners, but you can use this method to prep breakfasts, lunches, or snacks. If this is your first time doing any kind of batch cooking, you may want to start with just a week’s worth of meals, or less. If you are preparing meals for one week, you can probably knock it out in 1-3 hours, plus shopping time. If you are preparing meals for an entire month, it can take anywhere from 3-6 hours. You may want to split your work up over the course of two days. Choose foods that freeze well. Many food freeze well. Some great examples are cooked grains (rice, oatmeal, quinoa), meatballs, sauces, soups, breads, fruit, cooked beans, casseroles, lasagna, chili, and many desserts (like muffins and pies). There are only a handful of foods that should be avoided.These include:\nCream cheese, sour cream, or any kind of milk-based sauce\nMayonnaise, egg whites, or meringue\nPotatoes (raw or baked; in recipes they are OK)\nLettuce, endive, parsley, or celery (spinach is OK) Select some soups and stews. Stews, soups, curries, and chili dishes are great choices for batch cooking. These foods are easy to make in large amounts, and they freeze great. Select some soup and stew recipes that your family would enjoy. Here are some ideas: \nChicken curry with sweet potatoes\nTurkey chili with garbanzo beans\nCorn and potato chowder\nTomato soup Choose one-dish recipes. Recipes that combine several ingredients in one dish tend to freeze better that foods that are frozen individually. Plus, one-dish meals make reheating more practical. Select some one-dish recipes to batch cook. Some ideas include: \nLasagna\nChicken pot pie\nRice pilaf with chicken and veggies\nFried rice Make a list of meals. Come up with the ultimate list of what you’ll batch cook this round. Come up with dishes that use repeat ingredients, and remember that you can always repeat meals. Double or triple recipe sizes for recipes you know you like. It is best to batch good meals that you already know that you (and your family) enjoy. Before you make a huge batch of something, it is a good idea to try out a recipe and make sure you like it. Create a shopping list. Look over all the recipes you plan to use and create a detailed shopping list. Separate your list into three categories: produce (fruits and veggies), cold items (meat, dairy, frozen items), and dry goods (everything else). Next to each item, include the amount you will need. If you are going to more than one store, you might create a separate list for each store. You might want to create/edit this list on a computer and then print it out. Don’t forget about oils and spices. Making Your Food Go shopping. Place your shopping list on a clipboard, grab a pen, and head to the store. Choose produce items that are ripe and ready to cook with. Cross items off your list as you shop, then double-check your list before you check out. If can help to bring your dinner list with you as well. This helps prevent forgetting ingredients. Bring reusable shopping bags with you to reduce waste. Make a cooking plan. In order to cook a lot of items at once, it’s best to make a plan before you start. There are two main factors to keep in mind when making a cooking plan: cooking time and kitchen appliances. Place the items you need to prepare in order from longest cooking time to shortest cooking time. Use this cooking order as a guideline, so that most items finish cooking at roughly the same time. Think about which cooking appliances are required for which recipe. If one item is roasting in the oven, you can make something else in the slow-cooker. Try to get one item started in each major appliance you have (oven, range, slow-cooker, etc. ). Wash, chop, and measure your ingredients. Once you’ve got a plan in place it is time to prep your ingredients. Carefully wash all of your vegetables, and chop them. If any of your meat needs to be chopped, do so now. Measure out the ingredients you will need for each recipe and set them aside. Follow your cooking plan. With everything prepped and measured, it is time to start cooking. With so many pots on the stove (literally) it is important not to rush or try to do more than you can handle at one time. Follow your cooking list and prepare your batch meals. It is a good idea to clean and wash some dishes as you go. This way the cleaning is not too overwhelming at the end. Packaging and Labeling Your Food Decide how you’ll package your food. After your ingredients have been prepared, figure out how you’ll package and store what you made. If you will be keeping items in your fridge, airtight glass containers are ideal, but any air-tight container will work. If you will be storing items in your freezer, freezer bags are the most efficient. Make sure you have the containers you’ll need. Create complete meals. If you will be putting together complete meals to store in your freezer, now is the time to package them up. Follow each recipe, using the ingredients you have already prepared. Store the amount your family would normally consume in one sitting in one freezer bag. Be sure to squeeze all the air out of each bag, and make sure it is completely sealed. Package individual servings of foods or ingredients. If you are doing a weekly ingredient meal prep, you can store individual servings of your items in airtight containers in your fridge. You might make yourself a series of lunches for the week, or prepare what you’ll need for dinners. When you’re ready for dinner, pull out the ingredients and use them to make a complete meal. Label your food items. Before you place anything in your fridge or freezer, it is very important to add a label! Use a permanent marker to write directly on a freezer bag, or place masking tape on glass containers. Write down what the contents are, as well as the date. Freeze or refrigerate your food. Place your food in the fridge or freezer. Most meat dishes will last 4-5 days in the fridge, while plant-based items (like beans or grains) can last 5-7. Most meals can last up to 4 months in the freezer. Reheat as needed. If your food is frozen, transfer it to the fridge up to a day before you plan to eat it. Then move the contents to a pot, pan, or baking dish, and heat it up on the stove or in the oven. Many recipes will include reheat instructions, so reference these.",
  "tyn_model":[
    "freezer",
    "oven",
    "slow-cooker",
    "freezer bag",
    "sauces",
    "chili",
    "cheese",
    "sour cream",
    "mayonnaise",
    "egg whites",
    "meringue",
    "potatoes",
    "lettuce",
    "endive",
    "parsley",
    "celery",
    "spinach",
    "chili dishes",
    "soup",
    "sweet potatoes",
    "lasagna",
    "pot pie",
    "rice pilaf",
    "chicken",
    "fried rice",
    "produce",
    "oils",
    "spices",
    "clipboard",
    "pen",
    "kitchen appliances",
    "cooking appliances",
    "vegetables",
    "stove",
    "dishes",
    "freezer bags",
    "containers",
    "airtight containers",
    "fridge",
    "permanent marker",
    "masking tape",
    "pot",
    "baking dish"
  ],
  "tyn_section":[

  ]
}