{
  "title":"How to Make Cheesecake Bites",
  "url":"https://www.wikihow.com/Make-Cheesecake-Bites",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "methods":[
    {
      "name":"Making No-Bake Cheesecake Bites",
      "steps":[
        {
          "headline":"Beat the cream cheese with the butter.",
          "description":"Open one 8-ounce (225 g) package of cream cheese and put it in a medium-sized mixing bowl. Add 4 tablespoons (56 g) of softened butter. Use an electric mixer or a spoon to beat the butter and cream cheese until they're completely combined. It's important that both the butter and cream cheese are softened or you'll end up with lumpy cheesecake batter."
        },
        {
          "headline":"Stir in the graham cracker crumbs.",
          "description":"Measure 1/2 cup (40 g) of crushed graham cracker crumbs and stir them into the cheesecake batter until they're incorporated."
        },
        {
          "headline":"Stir in one cup (125 g) of powdered sugar at a time.",
          "description":"Get out 4 cups (500 g) of powdered sugar. Beat in one cup (125 g) of the powdered sugar on low speed until it's combined. Continue to stir in the rest of the powdered sugar, one cup at a time. If you add all of the powdered sugar at once, it will fly out of the bowl when you turn the mixer on."
        },
        {
          "headline":"Chill the cheesecake batter for at least one hour.",
          "description":"Cover the mixing bowl with plastic wrap and put it in the refrigerator. Chill the batter for at least one hour or up to overnight. Chilling the batter will make it easier to roll into bites."
        },
        {
          "headline":"Remove the batter from the fridge and set up a rolling station.",
          "description":"Take out a baking sheet and set it next to your work surface. Lay a sheet of waxed paper on it and take the bowl of cheesecake batter out of the refrigerator."
        },
        {
          "headline":"Scoop the batter into balls.",
          "description":"Take a cookie scoop and scoop the firm batter into rough balls. For completely smooth cheesecake bites, roll each ball between the palms of your hands to smooth out any edges. Set each bite on the waxed paper. You can use any size cookie scoop to get whatever size cheesecake bite you want."
        },
        {
          "headline":"Chill the cheesecake bites for 10 to 20 minutes.",
          "description":"Put the sheet of cheesecake bites in the refrigerator to firm up for 10 to 20 minutes. Chilling them will prevent them from melting as you dip them in chocolate."
        },
        {
          "headline":"Melt the chocolate chips in the microwave.",
          "description":"Measure 10 ounces (283 g) of chocolate chips into a microwave-safe bowl. Put it in the microwave and heat the chocolate chips for 15 seconds. Stir the chocolate chips and microwave them for another 15 seconds. Continue to stir and microwave the chocolate chips until they're melted."
        },
        {
          "headline":"Dip each cheesecake bite in melted chocolate.",
          "description":"Set the bowl of melted chocolate on your work surface and take the chilled cheesecake bites out of the refrigerator. Place a cheesecake bite into the chocolate and use a fork to cover the bite with the chocolate. Lift the bite out of the bowl of chocolate and set it back onto the waxed paper. Cover each cheesecake bite in chocolate."
        },
        {
          "headline":"Chill the chocolate covered cheesecake bites for one hour.",
          "description":"Put the tray with the dipped cheesecake bites into the refrigerator so the chocolate can harden. You'll need to chill them for at least one hour before you serve them. Store any leftovers in an airtight container in the refrigerator for up to one week."
        }
      ]
    },
    {
      "name":"Making Chocolate-Covered Cheesecake Bites",
      "steps":[
        {
          "headline":"Preheat the oven and prepare a baking dish.",
          "description":"Turn the oven on to 350 °F (177 °C). Get out an 8 x 8-inch (20 x 20-cm) baking dish and lay a sheet of foil in the bottom of it. Spray the foil with cooking spray to prevent the crust from sticking."
        },
        {
          "headline":"Crush the graham cracker crumbs and mix them with the butter.",
          "description":"Put 9 whole graham cracker sheets into a food processor. Pulse the crackers until they're crumbs. Put the crumbs into a bowl along with 8 tablespoons (113 g) of melted butter. Stir the crumbs with the butter until the mixture is a sandy texture."
        },
        {
          "headline":"Press the crust into the pan and bake it for 10 minutes.",
          "description":"Scoop the graham cracker mixture into the prepared baking dish and press it evenly across the bottom of the pan. Put the pan in the preheated oven to bake for 10 minutes. Take the pan out of the oven. The graham cracker crust should become pale golden."
        },
        {
          "headline":"Beat the cream cheese with the sugar for three minutes.",
          "description":"Open two 8-ounce (225 g) packages of softened cream cheese. Put the cream cheese in a mixing bowl along with 1/2 cup (100 g) of granulated sugar. Use an electric mixer to beat the mixture for three minutes. The cream cheese should become light and fluffy. You may need to scrape down the sides of the bowl once or twice."
        },
        {
          "headline":"Beat in the rest of the filling ingredients on low speed.",
          "description":"Turn the electric mixer to low speed and beat in the remaining cheesecake filling ingredients. Beat the creamy mixture just until it's combined. You'll need to beat in:\n1/4 cup (57 g) sour cream\n2 large eggs\n1 teaspoon (5 ml) vanilla extract\n1 tablespoon (8 g) all-purpose flour\n1/2 teaspoon (2 g) fine sea salt"
        },
        {
          "headline":"Reduce the oven temperature and bake the cream cheese mixture.",
          "description":"Turn the oven down to 325 °F (163 °C). Transfer the cheesecake filling to the pan with the graham cracker crust. Spread the filling evenly and bake it for 35 to 40 minutes. The cheesecake should puff up and the center should jiggle only slightly. It will firm up a little as it cools."
        },
        {
          "headline":"Cool the cheesecake and freeze it for three hours.",
          "description":"Set the baked cheesecake on a wire rack to cool completely. Once it's cool, place it in the freezer to harden. This should take at least three hours or up to overnight."
        },
        {
          "headline":"Cut the cheesecake into 36 bites.",
          "description":"Remove the pan of cheesecake from the freezer. Lift the cheesecake out of the pan using the foil. Set it on a cutting board and use a sharp knife to cut the cheesecake into 36 evenly sized squares. If the cheesecake begins to soften, put it back in the freezer until it's hard enough to finish cutting."
        },
        {
          "headline":"Melt the chocolate with the coconut oil in the microwave.",
          "description":"Chop 16 ounces (460 g) of semisweet chocolate into small pieces and put it into a microwave-safe bowl. Stir in 4 tablespoons (60 ml) of coconut oil and place the bowl in the microwave. Microwave the mixture for 30 seconds. Stir the chocolate and continue microwaving it in 30 second increments until it's melted. It should take you a total of one to two minutes to melt the chocolate."
        },
        {
          "headline":"Dip the cheesecake bites in the melted chocolate.",
          "description":"Get out a baking sheet and lay a sheet of parchment paper or a silicone mat on it. Take a cheesecake bite and lower it into the bowl of melted chocolate. Use a fork to coat the entire bite with the chocolate and then lift it out of the chocolate. Set the bite on the prepared baking sheet and continue to dip the rest of the cheesecake bites."
        },
        {
          "headline":"Chill the chocolate covered cheesecake bites for at least one hour.",
          "description":"Place the sheet of cheesecake bites in the refrigerator so the chocolate can harden. This should take about one hour. You can serve the bites or keep them stored in an airtight container in the refrigerator for up to one week."
        }
      ]
    },
    {
      "name":"Making Frozen Cheesecake Bites",
      "steps":[
        {
          "headline":"Beat the low-fat cream cheese.",
          "description":"Place 8 ounces (225 g) of softened, low-fat cream cheese into a mixing bowl. Use an electric mixer to beat the cream cheese for about one minute. It should be smooth and a little fluffy."
        },
        {
          "headline":"Beat in the yogurt, vanilla, lemon juice, and honey.",
          "description":"Measure 1/2 cup (142 g) of plain Greek yogurt, 1 teaspoon (5 ml) of vanilla extract, 1 teaspoon (5 ml) of lemon juice, and 2 tablespoons (42 g) of honey. Add these to the mixing bowl and beat them on medium speed until they're combined. Set this cheesecake batter aside."
        },
        {
          "headline":"Crush the graham crackers and mix them with melted butter.",
          "description":"Place 5 whole graham cracker squares (2.5-inches or 6.3-cm) into a food processor. Pulse the crackers until they're crumbs. Put the crumbs into a small bowl along with 2 tablespoons (28 g) of melted butter. Stir the crumbs with the butter until the mixture is a sandy texture."
        },
        {
          "headline":"Divide the graham cracker mixture among a few ice cube trays.",
          "description":"Get out two ice cube trays and sprinkle a few spoonfuls of graham cracker crust mixture into each cavity. Once you've evenly divided the mixture, push down on the crumbs in each cavity to make a crust."
        },
        {
          "headline":"Divide the cheesecake batter among the ice cube trays.",
          "description":"Place a few spoonfuls of batter on top of the graham cracker crust in each ice cube cavity. Try to fill the cavity to the top and smooth out the surface with the back of a spoon."
        },
        {
          "headline":"Top each cheesecake bite with blueberries.",
          "description":"Wash 1/2 cup (75 g) of fresh blueberries and scatter a few berries over each cheesecake bite in the ice cube trays. If you'd like, you can stick a popsicle stick three-quarters of the way into each of the cheesecake bites to make mini-cheesecake popsicles."
        },
        {
          "headline":"Freeze the cheesecake bites for at least two hours.",
          "description":"Place the ice cube trays into the freezer and let them set up for at least two hours or until they're frozen solid. Pop each of the bites out and serve them immediately. You can store the leftover frozen cheesecake bites in an airtight container in the freezer for a few months."
        }
      ]
    }
  ],
  "text":" Making No-Bake Cheesecake Bites Beat the cream cheese with the butter. Open one 8-ounce (225 g) package of cream cheese and put it in a medium-sized mixing bowl. Add 4 tablespoons (56 g) of softened butter. Use an electric mixer or a spoon to beat the butter and cream cheese until they're completely combined. It's important that both the butter and cream cheese are softened or you'll end up with lumpy cheesecake batter. Stir in the graham cracker crumbs. Measure 1/2 cup (40 g) of crushed graham cracker crumbs and stir them into the cheesecake batter until they're incorporated. Stir in one cup (125 g) of powdered sugar at a time. Get out 4 cups (500 g) of powdered sugar. Beat in one cup (125 g) of the powdered sugar on low speed until it's combined. Continue to stir in the rest of the powdered sugar, one cup at a time. If you add all of the powdered sugar at once, it will fly out of the bowl when you turn the mixer on. Chill the cheesecake batter for at least one hour. Cover the mixing bowl with plastic wrap and put it in the refrigerator. Chill the batter for at least one hour or up to overnight. Chilling the batter will make it easier to roll into bites. Remove the batter from the fridge and set up a rolling station. Take out a baking sheet and set it next to your work surface. Lay a sheet of waxed paper on it and take the bowl of cheesecake batter out of the refrigerator. Scoop the batter into balls. Take a cookie scoop and scoop the firm batter into rough balls. For completely smooth cheesecake bites, roll each ball between the palms of your hands to smooth out any edges. Set each bite on the waxed paper. You can use any size cookie scoop to get whatever size cheesecake bite you want. Chill the cheesecake bites for 10 to 20 minutes. Put the sheet of cheesecake bites in the refrigerator to firm up for 10 to 20 minutes. Chilling them will prevent them from melting as you dip them in chocolate. Melt the chocolate chips in the microwave. Measure 10 ounces (283 g) of chocolate chips into a microwave-safe bowl. Put it in the microwave and heat the chocolate chips for 15 seconds. Stir the chocolate chips and microwave them for another 15 seconds. Continue to stir and microwave the chocolate chips until they're melted. Dip each cheesecake bite in melted chocolate. Set the bowl of melted chocolate on your work surface and take the chilled cheesecake bites out of the refrigerator. Place a cheesecake bite into the chocolate and use a fork to cover the bite with the chocolate. Lift the bite out of the bowl of chocolate and set it back onto the waxed paper. Cover each cheesecake bite in chocolate. Chill the chocolate covered cheesecake bites for one hour. Put the tray with the dipped cheesecake bites into the refrigerator so the chocolate can harden. You'll need to chill them for at least one hour before you serve them. Store any leftovers in an airtight container in the refrigerator for up to one week. Making Chocolate-Covered Cheesecake Bites Preheat the oven and prepare a baking dish. Turn the oven on to 350 °F (177 °C). Get out an 8 x 8-inch (20 x 20-cm) baking dish and lay a sheet of foil in the bottom of it. Spray the foil with cooking spray to prevent the crust from sticking. Crush the graham cracker crumbs and mix them with the butter. Put 9 whole graham cracker sheets into a food processor. Pulse the crackers until they're crumbs. Put the crumbs into a bowl along with 8 tablespoons (113 g) of melted butter. Stir the crumbs with the butter until the mixture is a sandy texture. Press the crust into the pan and bake it for 10 minutes. Scoop the graham cracker mixture into the prepared baking dish and press it evenly across the bottom of the pan. Put the pan in the preheated oven to bake for 10 minutes. Take the pan out of the oven. The graham cracker crust should become pale golden. Beat the cream cheese with the sugar for three minutes. Open two 8-ounce (225 g) packages of softened cream cheese. Put the cream cheese in a mixing bowl along with 1/2 cup (100 g) of granulated sugar. Use an electric mixer to beat the mixture for three minutes. The cream cheese should become light and fluffy. You may need to scrape down the sides of the bowl once or twice. Beat in the rest of the filling ingredients on low speed. Turn the electric mixer to low speed and beat in the remaining cheesecake filling ingredients. Beat the creamy mixture just until it's combined. You'll need to beat in:\n1/4 cup (57 g) sour cream\n2 large eggs\n1 teaspoon (5 ml) vanilla extract\n1 tablespoon (8 g) all-purpose flour\n1/2 teaspoon (2 g) fine sea salt Reduce the oven temperature and bake the cream cheese mixture. Turn the oven down to 325 °F (163 °C). Transfer the cheesecake filling to the pan with the graham cracker crust. Spread the filling evenly and bake it for 35 to 40 minutes. The cheesecake should puff up and the center should jiggle only slightly. It will firm up a little as it cools. Cool the cheesecake and freeze it for three hours. Set the baked cheesecake on a wire rack to cool completely. Once it's cool, place it in the freezer to harden. This should take at least three hours or up to overnight. Cut the cheesecake into 36 bites. Remove the pan of cheesecake from the freezer. Lift the cheesecake out of the pan using the foil. Set it on a cutting board and use a sharp knife to cut the cheesecake into 36 evenly sized squares. If the cheesecake begins to soften, put it back in the freezer until it's hard enough to finish cutting. Melt the chocolate with the coconut oil in the microwave. Chop 16 ounces (460 g) of semisweet chocolate into small pieces and put it into a microwave-safe bowl. Stir in 4 tablespoons (60 ml) of coconut oil and place the bowl in the microwave. Microwave the mixture for 30 seconds. Stir the chocolate and continue microwaving it in 30 second increments until it's melted. It should take you a total of one to two minutes to melt the chocolate. Dip the cheesecake bites in the melted chocolate. Get out a baking sheet and lay a sheet of parchment paper or a silicone mat on it. Take a cheesecake bite and lower it into the bowl of melted chocolate. Use a fork to coat the entire bite with the chocolate and then lift it out of the chocolate. Set the bite on the prepared baking sheet and continue to dip the rest of the cheesecake bites. Chill the chocolate covered cheesecake bites for at least one hour. Place the sheet of cheesecake bites in the refrigerator so the chocolate can harden. This should take about one hour. You can serve the bites or keep them stored in an airtight container in the refrigerator for up to one week. Making Frozen Cheesecake Bites Beat the low-fat cream cheese. Place 8 ounces (225 g) of softened, low-fat cream cheese into a mixing bowl. Use an electric mixer to beat the cream cheese for about one minute. It should be smooth and a little fluffy. Beat in the yogurt, vanilla, lemon juice, and honey. Measure 1/2 cup (142 g) of plain Greek yogurt, 1 teaspoon (5 ml) of vanilla extract, 1 teaspoon (5 ml) of lemon juice, and 2 tablespoons (42 g) of honey. Add these to the mixing bowl and beat them on medium speed until they're combined. Set this cheesecake batter aside. Crush the graham crackers and mix them with melted butter. Place 5 whole graham cracker squares (2.5-inches or 6.3-cm) into a food processor. Pulse the crackers until they're crumbs. Put the crumbs into a small bowl along with 2 tablespoons (28 g) of melted butter. Stir the crumbs with the butter until the mixture is a sandy texture. Divide the graham cracker mixture among a few ice cube trays. Get out two ice cube trays and sprinkle a few spoonfuls of graham cracker crust mixture into each cavity. Once you've evenly divided the mixture, push down on the crumbs in each cavity to make a crust. Divide the cheesecake batter among the ice cube trays. Place a few spoonfuls of batter on top of the graham cracker crust in each ice cube cavity. Try to fill the cavity to the top and smooth out the surface with the back of a spoon. Top each cheesecake bite with blueberries. Wash 1/2 cup (75 g) of fresh blueberries and scatter a few berries over each cheesecake bite in the ice cube trays. If you'd like, you can stick a popsicle stick three-quarters of the way into each of the cheesecake bites to make mini-cheesecake popsicles. Freeze the cheesecake bites for at least two hours. Place the ice cube trays into the freezer and let them set up for at least two hours or until they're frozen solid. Pop each of the bites out and serve them immediately. You can store the leftover frozen cheesecake bites in an airtight container in the freezer for a few months.",
  "tyn_model":[
    "chocolate",
    "cream cheese",
    "graham cracker",
    "butter",
    "bowl",
    "refrigerator",
    "microwave",
    "oven",
    "ice cube",
    "powdered sugar",
    "chocolate chips",
    "freezer",
    "electric mixer",
    "mixing bowl",
    "baking sheet",
    "waxed paper",
    "airtight container",
    "baking dish",
    "foil",
    "spoon",
    "cookie scoop",
    "microwave-safe bowl",
    "fork",
    "food processor",
    "vanilla extract",
    "coconut oil",
    "low-fat cream cheese",
    "lemon juice",
    "honey",
    "blueberries",
    "medium-sized mixing bowl",
    "mixer",
    "plastic wrap",
    "fridge",
    "tray",
    "cooking spray",
    "sugar",
    "granulated sugar",
    "cheesecake filling",
    "sour cream",
    "eggs",
    "all-purpose flour",
    "fine sea salt",
    "graham cracker crust",
    "wire rack",
    "cutting board",
    "sharp knife",
    "semisweet chocolate",
    "parchment paper",
    "silicone mat",
    "yogurt",
    "vanilla",
    "plain greek yogurt",
    "graham crackers",
    "small bowl",
    "melted butter",
    "berries",
    "popsicle stick"
  ],
  "tyn_section":[

  ]
}