{
  "title":"How to Snake a Shower Drain",
  "url":"https://www.wikihow.com/Snake-a-Shower-Drain",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms",
    "Showers"
  ],
  "parts":[
    {
      "name":"Preparing the Snake and Drain",
      "steps":[
        {
          "headline":"Purchase a plumber’s snake.",
          "description":"A drain or plumber’s snake, also known as an auger or a drain claw, is a long, coiled metal spiral that has a graspable handle on one end. Drain snakes can either be manual (in which case you’ll crank the handle yourself) or electric (which you can attach to a power drill). Both manual and electric plumber’s snakes should be readily available at your local hardware store or home-supply store. A snake will probably cost around $25 USD."
        },
        {
          "headline":"Put on rubber gloves and goggles.",
          "description":"Before you start snaking your shower drain, put on a pair of gloves (the kind you’d use when washing dishes or cleaning your bathroom). Pulling out months-old mats of soggy hair can be a gross task, and you also don’t want to risk cutting your fingers on the shower drain or snake. Wearing safety goggles isn’t mandatory when snaking a shower drain. However, it’s a smart idea, especially if you’ve recently tried to un-clog the drain with a chemical drain cleaner."
        },
        {
          "headline":"Take the cover off of your shower drain.",
          "description":"Most shower drain openings are protected by a round, metal grate-like cover which prevents you from accidentally stepping into the drain. Your drain cover may simply fit by friction into its housing, in which case you can pry it out. Otherwise, if it’s screwed into place, use a screwdriver to remove the cover. If your shower doesn’t have a drain cover, you can skip this step."
        }
      ]
    },
    {
      "name":"Rotating the Drain Snake",
      "steps":[
        {
          "headline":"Feed the end of the snake into the drain.",
          "description":"Depending on the amount of built-up hair and congealed shampoo and soap clogging your drain, it may take a couple of tries to press the business end of the snake down into your drain. Keep feeding the snake down into the drain pipe until you begin to feel some resistance."
        },
        {
          "headline":"Slowly crank the snake handle clockwise.",
          "description":"Once the snake is at least a few inches down your drain and you can feel resistance, gently crank the snake handle. This will turn the tip of the snake and cause it to snare whatever hair is clogging your drain. Cranking the snake handle clockwise will also press the drain snake further into the shower pipe."
        },
        {
          "headline":"Continue to turn the snake handle.",
          "description":"As the end of the snake moves deeper into the shower drain and collects more and more built-up hair, you’ll notice that the handle becomes more difficult to turn. This is a good sign, as it means that the snake is cleaning out the drain. The snake may also become more difficult to turn as it rounds any corners or bends in your shower drainpipe. If you experience resistance, pull the snake back 2 inches (5.1 cm) and then gently press it back down into the drain while turning it."
        }
      ]
    },
    {
      "name":"Pulling Out the Clog",
      "steps":[
        {
          "headline":"Snake the drain until you feel resistance lessen.",
          "description":"If you feel the snake become easier to rotate, this means that you’ve hooked and loosened whatever large mat was clogging your drain. Give the handle one more full turn to make sure that the obstacle is fully hooked, and then stop rotating the snake. If you keep spinning the snake and forcing it deeper into your drain, you’ll risk losing part or all of the mat further down the drain pipe. Be gentle with the snake so you don't accidentally damage the pipe."
        },
        {
          "headline":"Turn the handle counter-clockwise and withdraw the snake.",
          "description":"Spinning the snake in the opposite direction will make it easier for you to draw the snake out of the shower drain. Pull slowly and avoid yanking on the snake, in order to avoid leaving any clumped hair behind in the drain pipe."
        },
        {
          "headline":"Dispose of the gunk the snake draws from your drain.",
          "description":"Once you’ve fully withdrawn the shower snake from your drain pipe, use your gloved hands to pull the bits of hair and other debris from the snake. Throw this material in a trash can. At this point, you can also re-attach the shower drain cover, if you removed this part before beginning to snake the drain."
        },
        {
          "headline":"Call a plumber if the shower still doesn’t drain.",
          "description":"If you’re still having trouble getting your shower or tub to drain, call a local plumber. An experienced plumber will effectively diagnose your draining problem and should be able to fix it within a day or two. A plumber will also be better equipped to handle serious drain clogs."
        }
      ]
    }
  ],
  "text":" Preparing the Snake and Drain Purchase a plumber’s snake. A drain or plumber’s snake, also known as an auger or a drain claw, is a long, coiled metal spiral that has a graspable handle on one end. Drain snakes can either be manual (in which case you’ll crank the handle yourself) or electric (which you can attach to a power drill). Both manual and electric plumber’s snakes should be readily available at your local hardware store or home-supply store. A snake will probably cost around $25 USD. Put on rubber gloves and goggles. Before you start snaking your shower drain, put on a pair of gloves (the kind you’d use when washing dishes or cleaning your bathroom). Pulling out months-old mats of soggy hair can be a gross task, and you also don’t want to risk cutting your fingers on the shower drain or snake. Wearing safety goggles isn’t mandatory when snaking a shower drain. However, it’s a smart idea, especially if you’ve recently tried to un-clog the drain with a chemical drain cleaner. Take the cover off of your shower drain. Most shower drain openings are protected by a round, metal grate-like cover which prevents you from accidentally stepping into the drain. Your drain cover may simply fit by friction into its housing, in which case you can pry it out. Otherwise, if it’s screwed into place, use a screwdriver to remove the cover. If your shower doesn’t have a drain cover, you can skip this step. Rotating the Drain Snake Feed the end of the snake into the drain. Depending on the amount of built-up hair and congealed shampoo and soap clogging your drain, it may take a couple of tries to press the business end of the snake down into your drain. Keep feeding the snake down into the drain pipe until you begin to feel some resistance. Slowly crank the snake handle clockwise. Once the snake is at least a few inches down your drain and you can feel resistance, gently crank the snake handle. This will turn the tip of the snake and cause it to snare whatever hair is clogging your drain. Cranking the snake handle clockwise will also press the drain snake further into the shower pipe. Continue to turn the snake handle. As the end of the snake moves deeper into the shower drain and collects more and more built-up hair, you’ll notice that the handle becomes more difficult to turn. This is a good sign, as it means that the snake is cleaning out the drain. The snake may also become more difficult to turn as it rounds any corners or bends in your shower drainpipe. If you experience resistance, pull the snake back 2 inches (5.1 cm) and then gently press it back down into the drain while turning it. Pulling Out the Clog Snake the drain until you feel resistance lessen. If you feel the snake become easier to rotate, this means that you’ve hooked and loosened whatever large mat was clogging your drain. Give the handle one more full turn to make sure that the obstacle is fully hooked, and then stop rotating the snake. If you keep spinning the snake and forcing it deeper into your drain, you’ll risk losing part or all of the mat further down the drain pipe. Be gentle with the snake so you don't accidentally damage the pipe. Turn the handle counter-clockwise and withdraw the snake. Spinning the snake in the opposite direction will make it easier for you to draw the snake out of the shower drain. Pull slowly and avoid yanking on the snake, in order to avoid leaving any clumped hair behind in the drain pipe. Dispose of the gunk the snake draws from your drain. Once you’ve fully withdrawn the shower snake from your drain pipe, use your gloved hands to pull the bits of hair and other debris from the snake. Throw this material in a trash can. At this point, you can also re-attach the shower drain cover, if you removed this part before beginning to snake the drain. Call a plumber if the shower still doesn’t drain. If you’re still having trouble getting your shower or tub to drain, call a local plumber. An experienced plumber will effectively diagnose your draining problem and should be able to fix it within a day or two. A plumber will also be better equipped to handle serious drain clogs.",
  "tyn_model":[
    "snake",
    "plumber",
    "snake handle",
    "mat",
    "plumber’s snake",
    "drain or plumber’s snake",
    "auger",
    "plumber’s snakes",
    "rubber gloves",
    "goggles",
    "gloves",
    "safety goggles",
    "drain cleaner",
    "drain cover",
    "screwdriver",
    "shampoo",
    "soap",
    "shower snake"
  ],
  "tyn_section":[

  ]
}