{
  "title":"How to Tell if Fish Has Gone Bad",
  "url":"https://www.wikihow.com/Tell-if-Fish-Has-Gone-Bad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Reading the Sell-By Date",
      "steps":[
        {
          "headline":"Toss refrigerated raw fish 2 days after the sell-by date.",
          "description":"Raw fish doesn’t last very long in a refrigerator, and it begins to go bad soon after the sell-by date. Look for the sell-by date on the packaging. If more than 1 or 2 days have passed since that date, throw the fish out. If you’d like to delay the expiration of refrigerated fish, put it in the freezer. If the fish has a use-by date rather than a sell-by date, avoid keeping the fish past that date. “Use-by” indicates that fish will begin to spoil if it’s not eaten by the printed date."
        },
        {
          "headline":"Keep cooked fish in your fridge for 5 or 6 days past the sell-by date.",
          "description":"If you’ve bought cooked fish—or cooked your own fish—and then stored it in the refrigerator in an airtight container, it will keep longer than raw fish. If you haven’t eaten the fish after 5 or 6 days past the sell-by date, though, it will need to be discarded. If you know in advance that you’re not going to use the cooked fish before it expires, put it in the freezer to delay the expiration. If you’re planning to discard the fish’s original packaging once it’s cooked, and then refrigerate the fish, write down the sell-by date so you don’t forget it after you’ve thrown the packaging away. You can write the sell-by date on a sticky note that you then attach to the \tTupperware the fish is stored in. Alternately, write the date on a notepad that you keep on the door of your fridge."
        },
        {
          "headline":"Keep frozen fish for 6 to 9 months past the sell-by date.",
          "description":"Whether it’s raw or cooked, frozen fish will keep for much longer than refrigerated fish. The only exception to this rule is smoked salmon. Even in a freezer, smoked salmon will only last between 3 and 6 months. You can always freeze your salmon yourself, even if you bought it raw or have already cooked it. To freeze salmon, wrap the pieces of fish in a layer of plastic-wrap, or place them in an air-tight plastic bag."
        }
      ]
    },
    {
      "name":"Inspecting the Fish",
      "steps":[
        {
          "headline":"Feel for a slimy coating on the raw fish.",
          "description":"As fish ages and begins to go bad, its outer surface will become wetter and eventually develop a thin layer of slime. This is a good sign that your fish has begun to spoil. Once fish has fully spoiled, the slimy moisture on the meat will feel thick and slippery to the touch. Discard fresh fish as soon as you notice the beginning of this slimy texture. Cooked fish will not develop a slimy coating, even after it’s started to go bad."
        },
        {
          "headline":"Smell for a pungent fishy aroma.",
          "description":"All fish—raw or cooked—smells like fish. However, refrigerated fish that has started to go bad will have an increasingly fishy smell. If given enough time, this potent fish smell will develop into the putrid smell of rotting meat. As fish continues to spoil, its pungent fish smell will grow stronger and stronger. It’s best to discard fish as soon as it starts to smell “off.”"
        },
        {
          "headline":"Inspect the raw fish for a milky color.",
          "description":"Fish meat is typically light pink or white in color, with a thin, clear film of liquid. As fresh or refrigerated fish ages and begins to go bad, the meat will take on a glossy, milky color. The milky parts of the fish may also take on a blue- or gray-ish tint. If you’ve already cooked your fish, it will not develop a milky color. This sign of expiration applies only to raw fish."
        },
        {
          "headline":"Check for signs of freezer burn.",
          "description":"If you’ve kept fish in the freezer for over 9 months, it may begin showing signs of freezer burn. Look for crystallized peaks of ice that have formed on the surface of the fish, and note any discolored patches as well. Discard freezer-burned food. Freezer-burned food is still technically edible, and it will not make you sick. However, fish will lose most of its flavor and take on a grainy texture as freezer burn sets in."
        }
      ]
    },
    {
      "name":"Identifying Expired Salmon",
      "steps":[
        {
          "headline":"Note if the white lines in the meat disappear.",
          "description":"Salmon, unlike most other kinds of fish, is well known for the thin white lines which separate the layers or flakes of its meat. These lines indicate that the fish is still fresh and edible. If you notice that these white lines have disappeared—or if they’ve turned to a more gray color—the salmon has likely gone bad."
        },
        {
          "headline":"Press the salmon to see if it’s still firm.",
          "description":"Edible, fresh salmon should be firm to the touch. If salmon in your refrigerator has become squishy, mushy, or unexpectedly soft in texture, it’s likely expired. The white lines between flakes of salmon can indicate its firmness in addition to its freshness. Once the lines have faded, the meat is all but guaranteed to be mushy."
        },
        {
          "headline":"Inspect the salmon for discolored spots on the meat.",
          "description":"Unlike other types of fish, as salmon ages and begins to go bad, it will develop discolorations. Look over the surface of the meat. If you see any spots that are not the healthy pink color of most salmon, your fish has likely expired. Most of the discolorations you’ll find on salmon will be dark. However, spoiled salmon can also have small white-ish patches."
        }
      ]
    }
  ],
  "text":" Reading the Sell-By Date Toss refrigerated raw fish 2 days after the sell-by date. Raw fish doesn’t last very long in a refrigerator, and it begins to go bad soon after the sell-by date. Look for the sell-by date on the packaging. If more than 1 or 2 days have passed since that date, throw the fish out. If you’d like to delay the expiration of refrigerated fish, put it in the freezer. If the fish has a use-by date rather than a sell-by date, avoid keeping the fish past that date. “Use-by” indicates that fish will begin to spoil if it’s not eaten by the printed date. Keep cooked fish in your fridge for 5 or 6 days past the sell-by date. If you’ve bought cooked fish—or cooked your own fish—and then stored it in the refrigerator in an airtight container, it will keep longer than raw fish. If you haven’t eaten the fish after 5 or 6 days past the sell-by date, though, it will need to be discarded. If you know in advance that you’re not going to use the cooked fish before it expires, put it in the freezer to delay the expiration. If you’re planning to discard the fish’s original packaging once it’s cooked, and then refrigerate the fish, write down the sell-by date so you don’t forget it after you’ve thrown the packaging away. You can write the sell-by date on a sticky note that you then attach to the \tTupperware the fish is stored in. Alternately, write the date on a notepad that you keep on the door of your fridge. Keep frozen fish for 6 to 9 months past the sell-by date. Whether it’s raw or cooked, frozen fish will keep for much longer than refrigerated fish. The only exception to this rule is smoked salmon. Even in a freezer, smoked salmon will only last between 3 and 6 months. You can always freeze your salmon yourself, even if you bought it raw or have already cooked it. To freeze salmon, wrap the pieces of fish in a layer of plastic-wrap, or place them in an air-tight plastic bag. Inspecting the Fish Feel for a slimy coating on the raw fish. As fish ages and begins to go bad, its outer surface will become wetter and eventually develop a thin layer of slime. This is a good sign that your fish has begun to spoil. Once fish has fully spoiled, the slimy moisture on the meat will feel thick and slippery to the touch. Discard fresh fish as soon as you notice the beginning of this slimy texture. Cooked fish will not develop a slimy coating, even after it’s started to go bad. Smell for a pungent fishy aroma. All fish—raw or cooked—smells like fish. However, refrigerated fish that has started to go bad will have an increasingly fishy smell. If given enough time, this potent fish smell will develop into the putrid smell of rotting meat. As fish continues to spoil, its pungent fish smell will grow stronger and stronger. It’s best to discard fish as soon as it starts to smell “off.” Inspect the raw fish for a milky color. Fish meat is typically light pink or white in color, with a thin, clear film of liquid. As fresh or refrigerated fish ages and begins to go bad, the meat will take on a glossy, milky color. The milky parts of the fish may also take on a blue- or gray-ish tint. If you’ve already cooked your fish, it will not develop a milky color. This sign of expiration applies only to raw fish. Check for signs of freezer burn. If you’ve kept fish in the freezer for over 9 months, it may begin showing signs of freezer burn. Look for crystallized peaks of ice that have formed on the surface of the fish, and note any discolored patches as well. Discard freezer-burned food. Freezer-burned food is still technically edible, and it will not make you sick. However, fish will lose most of its flavor and take on a grainy texture as freezer burn sets in. Identifying Expired Salmon Note if the white lines in the meat disappear. Salmon, unlike most other kinds of fish, is well known for the thin white lines which separate the layers or flakes of its meat. These lines indicate that the fish is still fresh and edible. If you notice that these white lines have disappeared—or if they’ve turned to a more gray color—the salmon has likely gone bad. Press the salmon to see if it’s still firm. Edible, fresh salmon should be firm to the touch. If salmon in your refrigerator has become squishy, mushy, or unexpectedly soft in texture, it’s likely expired. The white lines between flakes of salmon can indicate its firmness in addition to its freshness. Once the lines have faded, the meat is all but guaranteed to be mushy. Inspect the salmon for discolored spots on the meat. Unlike other types of fish, as salmon ages and begins to go bad, it will develop discolorations. Look over the surface of the meat. If you see any spots that are not the healthy pink color of most salmon, your fish has likely expired. Most of the discolorations you’ll find on salmon will be dark. However, spoiled salmon can also have small white-ish patches.",
  "tyn_model":[
    "fish",
    "salmon",
    "freezer",
    "freezer burn",
    "refrigerator",
    "—or",
    "smoked salmon",
    "freezer-",
    "refrigerated fish",
    "“use",
    "” indicates",
    "—and",
    "airtight container",
    "tupperware",
    "notepad",
    "plastic-wrap",
    "air-tight plastic bag",
    "—raw",
    "—smells",
    "“off",
    "” inspect",
    "fish meat",
    "ice",
    "—the",
    "meat"
  ],
  "tyn_section":[

  ]
}