{
  "title":"How to Make Dhal Puri",
  "url":"https://www.wikihow.com/Make-Dhal-Puri",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Breads"
  ],
  "parts":[
    {
      "name":"Making the Filling",
      "steps":[
        {
          "headline":"Soak the cup of peas in water overnight.",
          "description":""
        },
        {
          "headline":"Drain the water from peas after.",
          "description":"Rinse the peas until the water inside runs clear."
        },
        {
          "headline":"Move the peas to a pot.",
          "description":"Cover with water and boil on high heat."
        },
        {
          "headline":"Add salt.",
          "description":"Cook until the peas have a bite to them."
        },
        {
          "headline":"Drain.",
          "description":"Spread the peas out to allow them to air dry."
        },
        {
          "headline":"Add the 4 cloves of garlic and pepper to a bowl of a food processor.",
          "description":"Pulse."
        },
        {
          "headline":"Add the peas to the mix.",
          "description":"Pulse again, until the result is very fine."
        },
        {
          "headline":"Move to a bowl and fluff the mixture with a fork.",
          "description":""
        },
        {
          "headline":"Add the 2 teaspoons of cumin.",
          "description":"Mix."
        }
      ]
    },
    {
      "name":"Making the Dough",
      "steps":[
        {
          "headline":"Add the 4 cups of flour to a large bowl.",
          "description":""
        },
        {
          "headline":"Add the 4 teaspoons baking powder, 1 teaspoon sugar, and 1/2 teaspoon salt to the bowl.",
          "description":""
        },
        {
          "headline":"Mix thoroughly.",
          "description":"Drizzle in the 1 tablespoon oil."
        },
        {
          "headline":"Add 1 1/4 cups lukewarm water.",
          "description":"Mix until the dough forms."
        },
        {
          "headline":"Knead the dough for 3 minutes.",
          "description":"Massage oil over the dough."
        },
        {
          "headline":"Place this in a bowl.",
          "description":"Let rest for 30 minutes."
        }
      ]
    },
    {
      "name":"Assembling the Dough",
      "steps":[
        {
          "headline":"Knead the dough for 2 minutes.",
          "description":""
        },
        {
          "headline":"Cut into 10-12 pieces.",
          "description":"Pat each individual piece into a disk."
        },
        {
          "headline":"Put the dough in one hand and form a cup.",
          "description":""
        },
        {
          "headline":"Add the filling into the dough cup.",
          "description":"Pinch the ends of the dough together to seal."
        },
        {
          "headline":"Place seam side down onto an oiled baking sheet.",
          "description":""
        },
        {
          "headline":"Pat each ball with a little oil.",
          "description":""
        },
        {
          "headline":"Repeat until all dough is stuffed.",
          "description":""
        },
        {
          "headline":"Cover the dough with plastic wrap.",
          "description":"Let rest for 30 minutes."
        }
      ]
    },
    {
      "name":"Cooking the Dough",
      "steps":[
        {
          "headline":"Heat a 12 inch cast iron skillet over medium heat.",
          "description":""
        },
        {
          "headline":"Flour a surface and a rolling pin.",
          "description":""
        },
        {
          "headline":"Flatten one of the balls with your hand.",
          "description":"Roll the dough back and forth starting from the center. Turn into a 90-degree angle and keep until there's a round flat dough."
        },
        {
          "headline":"Move the dough to the skillet.",
          "description":"Allow it to cook until it begins to puff up with bubbles."
        },
        {
          "headline":"Flip the dough.",
          "description":""
        },
        {
          "headline":"Brush on a little oil.",
          "description":"Allow to cook for 30 seconds."
        },
        {
          "headline":"Flip and oil the other side.",
          "description":""
        },
        {
          "headline":"Cook for another 45 seconds.",
          "description":""
        },
        {
          "headline":"Remove from heat.",
          "description":"Put the dough into a basket lined with a tea towel."
        },
        {
          "headline":"Repeat until all the dough is cooked.",
          "description":"Separate each one with a slice of wax paper to prevent sticking."
        }
      ]
    }
  ],
  "text":" Making the Filling Soak the cup of peas in water overnight.  Drain the water from peas after. Rinse the peas until the water inside runs clear. Move the peas to a pot. Cover with water and boil on high heat. Add salt. Cook until the peas have a bite to them. Drain. Spread the peas out to allow them to air dry. Add the 4 cloves of garlic and pepper to a bowl of a food processor. Pulse. Add the peas to the mix. Pulse again, until the result is very fine. Move to a bowl and fluff the mixture with a fork.  Add the 2 teaspoons of cumin. Mix. Making the Dough Add the 4 cups of flour to a large bowl.  Add the 4 teaspoons baking powder, 1 teaspoon sugar, and 1/2 teaspoon salt to the bowl.  Mix thoroughly. Drizzle in the 1 tablespoon oil. Add 1 1/4 cups lukewarm water. Mix until the dough forms. Knead the dough for 3 minutes. Massage oil over the dough. Place this in a bowl. Let rest for 30 minutes. Assembling the Dough Knead the dough for 2 minutes.  Cut into 10-12 pieces. Pat each individual piece into a disk. Put the dough in one hand and form a cup.  Add the filling into the dough cup. Pinch the ends of the dough together to seal. Place seam side down onto an oiled baking sheet.  Pat each ball with a little oil.  Repeat until all dough is stuffed.  Cover the dough with plastic wrap. Let rest for 30 minutes. Cooking the Dough Heat a 12 inch cast iron skillet over medium heat.  Flour a surface and a rolling pin.  Flatten one of the balls with your hand. Roll the dough back and forth starting from the center. Turn into a 90-degree angle and keep until there's a round flat dough. Move the dough to the skillet. Allow it to cook until it begins to puff up with bubbles. Flip the dough.  Brush on a little oil. Allow to cook for 30 seconds. Flip and oil the other side.  Cook for another 45 seconds.  Remove from heat. Put the dough into a basket lined with a tea towel. Repeat until all the dough is cooked. Separate each one with a slice of wax paper to prevent sticking.",
  "tyn_model":[
    "peas",
    "water",
    "oil",
    "bowl",
    "salt",
    "pot",
    "garlic",
    "pepper",
    "food processor",
    "fork",
    "cumin",
    "flour",
    "large bowl",
    "baking powder",
    "sugar",
    "oiled baking sheet",
    "plastic wrap",
    "12 inch cast iron skillet",
    "rolling pin",
    "skillet",
    "basket",
    "tea towel",
    "wax paper"
  ],
  "tyn_section":[

  ]
}