{
  "title":"How to Mix Green Paint",
  "url":"https://www.wikihow.com/Mix-Green-Paint",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Coloring and Shading"
  ],
  "methods":[
    {
      "name":"Mixing Basic Green Paint",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"Many people will reach directly for a paintbrush when mixing paint, but this actually isn't the best option. Not only will you risk ruining your paintbrush, but you also won't get a very smooth color. Opt for a palette knife or popsicle stick instead. Here is a complete list of what you will need:\n • Blue paint\n • Yellow paint\n • Paint palette, paper plate, or cup\n • Something to mix with (palette knife, spoon, popsicle stick, etc)"
        },
        {
          "headline":"Put a coin-sized drop of yellow paint onto a palette.",
          "description":"This will count as \"one part yellow.\" When mixing paints, you will be working with \"parts\" as a form of measurement."
        },
        {
          "headline":"Add a drop of blue paint.",
          "description":"To begin with, make the blue drop the same size as the yellow drop. This will give you a basic shade of green. If you want to make a different shade, click here."
        },
        {
          "headline":"Mix the two colors together.",
          "description":"Keep mixing the paint until the color is uniform and you don't see any streaks. If you are using a thin paint, like tempra, poster, or craft-grade acrylic paint, try using a spoon or popsicle stick. If you are using a thicker, paste-like paint, such as oil or acrylic, use a palette knife to smoosh and move the paint around until it you get an even color."
        },
        {
          "headline":"Use the paint.",
          "description":"You could create a green landscape or use green to mix realistic skin tones. The possibilities are endless!"
        }
      ]
    },
    {
      "name":"Mixing Different Shades of Green",
      "steps":[
        {
          "headline":"Add more yellow if you want a lighter, brighter green.",
          "description":"Start with one part yellow and one part blue and mix the two colors together with a pallet knife. Once you have your green, add one extra part yellow and mix again. Keep adding yellow until you get the shade you want. Two to three parts yellow and one part blue will give you a bright, lime green."
        },
        {
          "headline":"Add some white if you want a lighter, pastel green.",
          "description":"Adding white will also give you more of a minty green. Keep in mind that some whites can be very vibrant. Start with less white than you think you might need."
        },
        {
          "headline":"Darken your paint with some more blue.",
          "description":"Start with a basic green color, then mix in one extra part blue. Keep adding blue paint until you get the color you want. Two parts blue and one part yellow will give you turquoise."
        },
        {
          "headline":"Add black if you want a darker, duller shade of green.",
          "description":"Keep adding the black paint, drop by drop, and mixing, until you get the color you want."
        },
        {
          "headline":"Add red to dull the green down.",
          "description":"If you want more of an olive green or an army green, add a drop of red. The more red you add, the more earthy your shade of green."
        }
      ]
    },
    {
      "name":"Mixing Green Using Artist Paint",
      "steps":[
        {
          "headline":"Know that artist-grade blue and yellow paint come in different shades.",
          "description":"When buying artist-grade acrylic, oil, or watercolor paint, look at the colors carefully. You may notice that some of the blues have more of a greenish tint, while others have more of a purple tint. You may also notice that some of the yellows have more of a green tint, while others have more of an orange tint. Choosing the wrong shade of blue or yellow will result in a murky, muddy yellow."
        },
        {
          "headline":"Purchase the right shade of blue and yellow.",
          "description":"To get a bright, vibrant green, you will need to buy blue and yellow paint that both have a greenish tint to them. Here are some combinations to get you started:\nPhthalo blue (Green Shade) and Cadmium yellow light\nPhthalo blue (Green) & Hansa yellow (also called Lemon yellow)"
        },
        {
          "headline":"Know what shades to use when mixing a muted green.",
          "description":"If you don't want a bright green, then you can use other shades of blue and yellow. You can also use some other colors as well. Here are some combinations to get you started:\nUltramarine blue & Cadmium yellow light\nUltramarine blue & Yellow ochre\nIvory black & Cadmium yellow light\nPrussian blue & Yellow ochre\nBurnt umber & Cadmium yellow light"
        },
        {
          "headline":"Use red to tone down green.",
          "description":"If your green turned out too bright, don't add black or grey to make it duller. Add a little bit of red paint instead. Red is opposite of green on the color wheel, so it will help tone down the green. The more red you add, the more brown/grey your green will be."
        },
        {
          "headline":"Lighten or darken your green with some yellow or blue paint.",
          "description":"Do not use white or black paint; these colors will dull your green. Instead, use a little bit of the yellow that you were using the lighten the green. To darken the green, use a little bit of the blue that you were using. Using yellow and blue will help keep the green bright and vibrant without dulling it down. Blue can be a very intense color. Start with a pinhead-sized drop first."
        },
        {
          "headline":"Know when to add black or white paint to your green.",
          "description":"If you want to lighten your green into a pastel shade, add some white. If you want to darken your green into a more dull shade, add a little bit of black. Start with a pinhead-sized drop."
        }
      ]
    }
  ],
  "text":" Mixing Basic Green Paint Gather your supplies. Many people will reach directly for a paintbrush when mixing paint, but this actually isn't the best option. Not only will you risk ruining your paintbrush, but you also won't get a very smooth color. Opt for a palette knife or popsicle stick instead. Here is a complete list of what you will need:\n • Blue paint\n • Yellow paint\n • Paint palette, paper plate, or cup\n • Something to mix with (palette knife, spoon, popsicle stick, etc) Put a coin-sized drop of yellow paint onto a palette. This will count as \"one part yellow.\" When mixing paints, you will be working with \"parts\" as a form of measurement. Add a drop of blue paint. To begin with, make the blue drop the same size as the yellow drop. This will give you a basic shade of green. If you want to make a different shade, click here. Mix the two colors together. Keep mixing the paint until the color is uniform and you don't see any streaks. If you are using a thin paint, like tempra, poster, or craft-grade acrylic paint, try using a spoon or popsicle stick. If you are using a thicker, paste-like paint, such as oil or acrylic, use a palette knife to smoosh and move the paint around until it you get an even color. Use the paint. You could create a green landscape or use green to mix realistic skin tones. The possibilities are endless! Mixing Different Shades of Green Add more yellow if you want a lighter, brighter green. Start with one part yellow and one part blue and mix the two colors together with a pallet knife. Once you have your green, add one extra part yellow and mix again. Keep adding yellow until you get the shade you want. Two to three parts yellow and one part blue will give you a bright, lime green. Add some white if you want a lighter, pastel green. Adding white will also give you more of a minty green. Keep in mind that some whites can be very vibrant. Start with less white than you think you might need. Darken your paint with some more blue. Start with a basic green color, then mix in one extra part blue. Keep adding blue paint until you get the color you want. Two parts blue and one part yellow will give you turquoise. Add black if you want a darker, duller shade of green. Keep adding the black paint, drop by drop, and mixing, until you get the color you want. Add red to dull the green down. If you want more of an olive green or an army green, add a drop of red. The more red you add, the more earthy your shade of green. Mixing Green Using Artist Paint Know that artist-grade blue and yellow paint come in different shades. When buying artist-grade acrylic, oil, or watercolor paint, look at the colors carefully. You may notice that some of the blues have more of a greenish tint, while others have more of a purple tint. You may also notice that some of the yellows have more of a green tint, while others have more of an orange tint. Choosing the wrong shade of blue or yellow will result in a murky, muddy yellow. Purchase the right shade of blue and yellow. To get a bright, vibrant green, you will need to buy blue and yellow paint that both have a greenish tint to them. Here are some combinations to get you started:\nPhthalo blue (Green Shade) and Cadmium yellow light\nPhthalo blue (Green) & Hansa yellow (also called Lemon yellow) Know what shades to use when mixing a muted green. If you don't want a bright green, then you can use other shades of blue and yellow. You can also use some other colors as well. Here are some combinations to get you started:\nUltramarine blue & Cadmium yellow light\nUltramarine blue & Yellow ochre\nIvory black & Cadmium yellow light\nPrussian blue & Yellow ochre\nBurnt umber & Cadmium yellow light Use red to tone down green. If your green turned out too bright, don't add black or grey to make it duller. Add a little bit of red paint instead. Red is opposite of green on the color wheel, so it will help tone down the green. The more red you add, the more brown/grey your green will be. Lighten or darken your green with some yellow or blue paint. Do not use white or black paint; these colors will dull your green. Instead, use a little bit of the yellow that you were using the lighten the green. To darken the green, use a little bit of the blue that you were using. Using yellow and blue will help keep the green bright and vibrant without dulling it down. Blue can be a very intense color. Start with a pinhead-sized drop first. Know when to add black or white paint to your green. If you want to lighten your green into a pastel shade, add some white. If you want to darken your green into a more dull shade, add a little bit of black. Start with a pinhead-sized drop.",
  "tyn_model":[
    "paint",
    "palette knife",
    "popsicle stick",
    "spoon",
    "blue paint",
    "blue",
    "• blue",
    "• yellow",
    "• paint",
    "paper plate",
    "• something",
    "yellow paint",
    "palette",
    "paints",
    "tempra, poster,",
    "acrylic paint",
    "pallet knife",
    "artist paint",
    "artist-grade acrylic, oil, or watercolor paint",
    "hansa yellow",
    "ivory",
    "red paint"
  ],
  "tyn_section":[

  ]
}