{
  "title":"How to Play Total Conquest",
  "url":"https://www.wikihow.com/Play-Total-Conquest",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "steps":[
    {
      "headline":"Start a kingdom.",
      "description":"You are given a city hall; this is your central structure; it is a building which you would want to protect, so best is to have it in the center of your base. Along with the city hall you also startup with a gold storage and a gold storage. Soldier’s costs 10 gold. Unless you have the hero Illidan the marshal as your selected hero. Ships costs 500 gold, they can carry up to 300 soldiers and can travel any amount of distance over water, for a ship to stay on land a port must be built. Land ships cost 1000 gold and can travel any distance over water and can travel\nOver land these ships can carry 500 people. Battle zeppelins are armored blimps that sore over mountains and oceans. They are the most expensive costing 2000 gold .they can overpass mountains and can fly : per turn. They can carry up to 700 soldiers. Steam engines. These machines can break through the walls of the city allowing other vehicles and soldiers to get through. Even the mighty zeppelin cannot pass over a wall without the fear of getting shot down. 1 steam engine costs 1500 gold coins."
    },
    {
      "headline":"Build walls.",
      "description":"Walls are the main protection of your city they come in varying strengths and costs. Building a wall takes 2 turns and upgrading it takes 1 turn. Here is a list of the first 10 walls, more may be added later. Wooden wall, takes 2 steam engines to destroy costs 1000 gold to build\nHeavy oak wall takes 4 steam engines to destroy costs 2000 gold to build\nBronze wall takes 6 steam engines to destroy costs 3000 to build\nIron wall takes 8 steam engines to destroy costs 4000 gold to build\nSteel wall takes 10 steam engine to destroy costs 5000 gold to build\nBright steel wall takes 12 steam engines to destroy costs 6000 gold to build\nTitan steel wall , takes 14 steam engines to destroy costs 8000 gold to build\nObsidian wall takes 16 steam engines to destroy costs 10000 gold to build\nPlatinum wall takes 18 steam engines to destroy costs 12000 to build\nGod steel wall takes 25 steam engines to destroy made by the very gods themselves this wall costs 15000 to build, very powerful defense indeed\nWell that’s enough for the walls a lot of them were made up on the spot."
    },
    {
      "headline":"Provide heroes.",
      "description":"you can have 1 hero per game\nHeroes are the most powerful units in the game; they provide incredible bonuses that could mean the difference between victory and defeat. Here is a list of the games heroes, more may be added later\nIlidan the marshal cuts the costs of soldiers in half. Gilzard the engineer cuts the cost of vehicles as following:\nShip- 250 gold\nLand ship-500 gold\nBattle zeppelin – 1200\nSteam engines – 900 gold"
    },
    {
      "headline":"Get the architect.",
      "description":"Arthas the architect reduces the cost of all walls by 2000 gold (level 1 and 2 walls are free of charge)Arthas is one of the heroes available."
    },
    {
      "headline":"Build ports.",
      "description":"Ports can house zeppelins soldiers ships and land ships also steam engines they always belong to the person who created them, it costs 3000 gold to build and can house 1 zeppelin 3 ships and 6 land ships and 4 steam engines and 800 soldiers per upgrade an upgrade costs 1000 more gold each time, ports must always be by the sea"
    },
    {
      "headline":"Build forts.",
      "description":"Forts same rules apply as with ports except they can be anywhere except on water and no ships may be stored there"
    },
    {
      "headline":"Get gold.",
      "description":"Gold is earned through your territories. You get 200 gold for each regular country and 300 for your capital"
    },
    {
      "headline":"Draw a map.",
      "description":"When drawing the map you may divide the territories however you want, every time you move or add soldiers to a territory you have to change the number or if it is unclaimed add the number a territory may hold any amount of soldiers ships land ship and every other vehicle. You will be drawing a map on paper so adjust numbers accordingly to paper size."
    },
    {
      "headline":"Possess mountains.",
      "description":"Mountain is difficult terrain that takes two turns to pass zeppelins may pass over mountains with no trouble. Everything else will have to pass through or around it"
    },
    {
      "headline":"Know the strength of your vehicles.",
      "description":"Soldiers 2-3 in. on map\nShips any amount on water\nLand ships 5-6in. on map\nZeppelins 8-9 in. on map"
    }
  ],
  "text":" Start a kingdom. You are given a city hall; this is your central structure; it is a building which you would want to protect, so best is to have it in the center of your base. Along with the city hall you also startup with a gold storage and a gold storage. Soldier’s costs 10 gold. Unless you have the hero Illidan the marshal as your selected hero. Ships costs 500 gold, they can carry up to 300 soldiers and can travel any amount of distance over water, for a ship to stay on land a port must be built. Land ships cost 1000 gold and can travel any distance over water and can travel\nOver land these ships can carry 500 people. Battle zeppelins are armored blimps that sore over mountains and oceans. They are the most expensive costing 2000 gold .they can overpass mountains and can fly : per turn. They can carry up to 700 soldiers. Steam engines. These machines can break through the walls of the city allowing other vehicles and soldiers to get through. Even the mighty zeppelin cannot pass over a wall without the fear of getting shot down. 1 steam engine costs 1500 gold coins. Build walls. Walls are the main protection of your city they come in varying strengths and costs. Building a wall takes 2 turns and upgrading it takes 1 turn. Here is a list of the first 10 walls, more may be added later. Wooden wall, takes 2 steam engines to destroy costs 1000 gold to build\nHeavy oak wall takes 4 steam engines to destroy costs 2000 gold to build\nBronze wall takes 6 steam engines to destroy costs 3000 to build\nIron wall takes 8 steam engines to destroy costs 4000 gold to build\nSteel wall takes 10 steam engine to destroy costs 5000 gold to build\nBright steel wall takes 12 steam engines to destroy costs 6000 gold to build\nTitan steel wall , takes 14 steam engines to destroy costs 8000 gold to build\nObsidian wall takes 16 steam engines to destroy costs 10000 gold to build\nPlatinum wall takes 18 steam engines to destroy costs 12000 to build\nGod steel wall takes 25 steam engines to destroy made by the very gods themselves this wall costs 15000 to build, very powerful defense indeed\nWell that’s enough for the walls a lot of them were made up on the spot. Provide heroes. you can have 1 hero per game\nHeroes are the most powerful units in the game; they provide incredible bonuses that could mean the difference between victory and defeat. Here is a list of the games heroes, more may be added later\nIlidan the marshal cuts the costs of soldiers in half. Gilzard the engineer cuts the cost of vehicles as following:\nShip- 250 gold\nLand ship-500 gold\nBattle zeppelin – 1200\nSteam engines – 900 gold Get the architect. Arthas the architect reduces the cost of all walls by 2000 gold (level 1 and 2 walls are free of charge)Arthas is one of the heroes available. Build ports. Ports can house zeppelins soldiers ships and land ships also steam engines they always belong to the person who created them, it costs 3000 gold to build and can house 1 zeppelin 3 ships and 6 land ships and 4 steam engines and 800 soldiers per upgrade an upgrade costs 1000 more gold each time, ports must always be by the sea Build forts. Forts same rules apply as with ports except they can be anywhere except on water and no ships may be stored there Get gold. Gold is earned through your territories. You get 200 gold for each regular country and 300 for your capital Draw a map. When drawing the map you may divide the territories however you want, every time you move or add soldiers to a territory you have to change the number or if it is unclaimed add the number a territory may hold any amount of soldiers ships land ship and every other vehicle. You will be drawing a map on paper so adjust numbers accordingly to paper size. Possess mountains. Mountain is difficult terrain that takes two turns to pass zeppelins may pass over mountains with no trouble. Everything else will have to pass through or around it Know the strength of your vehicles. Soldiers 2-3 in. on map\nShips any amount on water\nLand ships 5-6in. on map\nZeppelins 8-9 in. on map",
  "tyn_model":[
    "ships",
    "steam engines",
    "heroes",
    "ports",
    "water",
    "gold",
    "battle zeppelins",
    "steam engine",
    "walls",
    "wooden",
    "iron",
    "engineer",
    "battle zeppelin",
    "– 1200",
    "– 900",
    "map",
    "mountains"
  ],
  "tyn_section":[

  ]
}