{
  "title":"How to Grill Octopus",
  "url":"https://www.wikihow.com/Grill-Octopus",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Cleaning the Octopus",
      "steps":[
        {
          "headline":"Look for a cleaned octopus or ask your fishmonger to clean it.",
          "description":"Preparing an octopus for cooking is a bit icky, so get one that's already cleaned if you're squeamish. Frozen octopus is almost always cleaned in advance. If you're purchasing fresh octopus, ask your fishmonger to do the dirty work for you. Freezing doesn't reduce octopus quality. In fact, it helps tenderize the meat. If you're using a frozen octopus, thaw it in the refrigerator for 24 hours before cooking it."
        },
        {
          "headline":"Remove the tentacles if you're cleaning a fresh octopus yourself.",
          "description":"If you have to clean the octopus yourself, start by removing the tentacles. Lay out the octopus, and use a sharp chef's knife to slice the octopus in half. Make your slice just under the eyes, so the tentacles are still connected to each other."
        },
        {
          "headline":"Slice just above the eyes to remove them from the head.",
          "description":"The eyes are edible, but most people like to remove them for a more attractive presentation. Use your chef's knife to make a cut just above the eyes. Slice off the entire end of the head that contains the eyes, then discard it. You'll then be left with just the round head of the octopus. Before you throw it away, check the middle section with the eyes to see if you took the beak with it. If not, you'll have to remove it from the tentacles. The beak is the mouth, and is the only hard part of an octopus. It's located in the middle of the tentacles."
        },
        {
          "headline":"Turn the head inside out to remove the innards.",
          "description":"Make a 1 to 2 inch (2.5 to 5 cm) slice into the head so it's easier get inside of it. Then, pull out the ink sac and innards by detaching the 3 or 4 fleshy strands that connect them to the inside of the head. Rinse away ink under running water if you have trouble seeing what you're doing. While not necessary, you can also peel off the skin from the head with your fingers. It's edible, but can be a bit rubbery. Some chefs argue the skin lends flavor and texture and should be left on, while others prefer to peel it. Since you'll be simmering and grilling it, you can just leave it if you want. It shouldn't be too rubbery after being grilled."
        },
        {
          "headline":"Remove the beak from the tentacles.",
          "description":"Grab the tentacles and gently push out the center to expose the hard beak. Grasp the beak firmly once you've found it, then pluck it out and discard it. Keep in mind you might have already removed the beak when you cut off the middle section with the eyes. Be careful and wear gloves if needed. The beak is surprisingly sharp."
        },
        {
          "headline":"Rinse the head and tentacles thoroughly.",
          "description":"You're just about done cleaning the octopus! After removing all the guts, hold the head under cold running water. Thoroughly wash it inside and out to rinse away ink and other residue, then wash the tentacles."
        }
      ]
    },
    {
      "name":"Simmering Your Octopus",
      "steps":[
        {
          "headline":"Use a large mallet to tenderize the octopus.",
          "description":"Hammer the octopus for a minute or two with a large meat mallet. If you don't have a mallet, you could also use a heavy rolling pin. Some people even swear by placing the octopus in three zip-sealed bags (to remove any risk of leakage), then throwing it in the washing machine for a 5 minute spin cycle!"
        },
        {
          "headline":"Add the octopus, wine, peppercorns, lemon, and garlic to a large pot.",
          "description":"Cut the lemon in half before adding it to the pot, and smash your garlic cloves to help release their flavor. Once you've placed your ingredients in the pot, add enough water to cover them about 1 inch (2.5 cm). If you want, you can also throw a wine cork into the mix. Some chefs claim that it helps tenderize octopus meat."
        },
        {
          "headline":"Bring the mix to a boil, then it simmer for 45 to 90 minutes.",
          "description":"Set your stove burner to medium high. Once the liquid begins to boil, reduce heat to low and simmer the octopus until it's tender. You'll easily be able to pierce it with a knife when it's tender. Depending on the size of your octopus, it could take anywhere between 45 and 90 minutes to cook."
        },
        {
          "headline":"Cool the octopus to room temperature.",
          "description":"Once the octopus is tender, remove the pot from the burner and turn off the stove. Keep the octopus in the liquid as you let it cool to room temperature. When it's cool, remove the octopus from the pot and discard the liquid."
        }
      ]
    },
    {
      "name":"Grilling It to Perfection",
      "steps":[
        {
          "headline":"Cut a whole octopus in half if it won't fit on your grill.",
          "description":"If you bought a frozen octopus or had the fishmonger clean it, it might still be whole, or with the tentacles still attached to the head. If you have a whole cleaned octopus, you could cut it in half if you don't think it will fit across your grill grate. The easiest way to clean an octopus yourself is to cut it in half. If you cleaned your octopus at home, you probably already cut it in half."
        },
        {
          "headline":"Light your grill and heat it for 5 minutes.",
          "description":"Set your gas grill to high heat or light your charcoals. Close the lid and give the grill 5 minutes to get hot. If you have a charcoal grill, it's better to use a chimney starter than lighter fluid, which can leave behind a chemical taste."
        },
        {
          "headline":"Clean the grill grate.",
          "description":"As the grill heats, it'll burn off residue on the cooking grate and make it easier to clean. You'll still want to give it a once over with a wire grill brush to prevent sticking and flare-ups."
        },
        {
          "headline":"Oil the grate lightly.",
          "description":"Dab a wadded paper towel or clean cloth with a tablespoon or less of olive oil. Hold it with long grilling tongs and lightly coat the grate. Try not to use too much oil, or you might start a flare-up."
        },
        {
          "headline":"Toss the octopus with olive oil, salt, and pepper.",
          "description":"Toss the octopus in a large mixing bowl with 1/4 cup (60 mL) of olive oil until it's evenly coated. Season it lightly by rubbing it down with salt and pepper."
        },
        {
          "headline":"Grill the octopus 3 to 4 minutes per side, or until it's well browned.",
          "description":"Use your tongs to place the octopus on the cooking grate, then close the lid. After 3 to 4 minutes, flip the octopus and grill the other side for another 3 to 4 minutes. You want to see good browning and some char, but it should still look moist."
        },
        {
          "headline":"Serve it on its own or toss it into a salad or pasta.",
          "description":"Remove the octopus from the grill, give it a rough chop, and place it on a serving platter. Drizzle it with the remaining 1/4 cup (60 mL) of olive oil and juice of 1 lemon, and season it with salt and pepper to taste. Showcase it as a starter, and serve it to your guests with lemon wedges. You could also toss it with fresh greens and balsamic vinaigrette or serve it over pasta with a spicy tomato sauce."
        }
      ]
    }
  ],
  "text":" Cleaning the Octopus Look for a cleaned octopus or ask your fishmonger to clean it. Preparing an octopus for cooking is a bit icky, so get one that's already cleaned if you're squeamish. Frozen octopus is almost always cleaned in advance. If you're purchasing fresh octopus, ask your fishmonger to do the dirty work for you. Freezing doesn't reduce octopus quality. In fact, it helps tenderize the meat. If you're using a frozen octopus, thaw it in the refrigerator for 24 hours before cooking it. Remove the tentacles if you're cleaning a fresh octopus yourself. If you have to clean the octopus yourself, start by removing the tentacles. Lay out the octopus, and use a sharp chef's knife to slice the octopus in half. Make your slice just under the eyes, so the tentacles are still connected to each other. Slice just above the eyes to remove them from the head. The eyes are edible, but most people like to remove them for a more attractive presentation. Use your chef's knife to make a cut just above the eyes. Slice off the entire end of the head that contains the eyes, then discard it. You'll then be left with just the round head of the octopus. Before you throw it away, check the middle section with the eyes to see if you took the beak with it. If not, you'll have to remove it from the tentacles. The beak is the mouth, and is the only hard part of an octopus. It's located in the middle of the tentacles. Turn the head inside out to remove the innards. Make a 1 to 2 inch (2.5 to 5 cm) slice into the head so it's easier get inside of it. Then, pull out the ink sac and innards by detaching the 3 or 4 fleshy strands that connect them to the inside of the head. Rinse away ink under running water if you have trouble seeing what you're doing. While not necessary, you can also peel off the skin from the head with your fingers. It's edible, but can be a bit rubbery. Some chefs argue the skin lends flavor and texture and should be left on, while others prefer to peel it. Since you'll be simmering and grilling it, you can just leave it if you want. It shouldn't be too rubbery after being grilled. Remove the beak from the tentacles. Grab the tentacles and gently push out the center to expose the hard beak. Grasp the beak firmly once you've found it, then pluck it out and discard it. Keep in mind you might have already removed the beak when you cut off the middle section with the eyes. Be careful and wear gloves if needed. The beak is surprisingly sharp. Rinse the head and tentacles thoroughly. You're just about done cleaning the octopus! After removing all the guts, hold the head under cold running water. Thoroughly wash it inside and out to rinse away ink and other residue, then wash the tentacles. Simmering Your Octopus Use a large mallet to tenderize the octopus. Hammer the octopus for a minute or two with a large meat mallet. If you don't have a mallet, you could also use a heavy rolling pin. Some people even swear by placing the octopus in three zip-sealed bags (to remove any risk of leakage), then throwing it in the washing machine for a 5 minute spin cycle! Add the octopus, wine, peppercorns, lemon, and garlic to a large pot. Cut the lemon in half before adding it to the pot, and smash your garlic cloves to help release their flavor. Once you've placed your ingredients in the pot, add enough water to cover them about 1 inch (2.5 cm). If you want, you can also throw a wine cork into the mix. Some chefs claim that it helps tenderize octopus meat. Bring the mix to a boil, then it simmer for 45 to 90 minutes. Set your stove burner to medium high. Once the liquid begins to boil, reduce heat to low and simmer the octopus until it's tender. You'll easily be able to pierce it with a knife when it's tender. Depending on the size of your octopus, it could take anywhere between 45 and 90 minutes to cook. Cool the octopus to room temperature. Once the octopus is tender, remove the pot from the burner and turn off the stove. Keep the octopus in the liquid as you let it cool to room temperature. When it's cool, remove the octopus from the pot and discard the liquid. Grilling It to Perfection Cut a whole octopus in half if it won't fit on your grill. If you bought a frozen octopus or had the fishmonger clean it, it might still be whole, or with the tentacles still attached to the head. If you have a whole cleaned octopus, you could cut it in half if you don't think it will fit across your grill grate. The easiest way to clean an octopus yourself is to cut it in half. If you cleaned your octopus at home, you probably already cut it in half. Light your grill and heat it for 5 minutes. Set your gas grill to high heat or light your charcoals. Close the lid and give the grill 5 minutes to get hot. If you have a charcoal grill, it's better to use a chimney starter than lighter fluid, which can leave behind a chemical taste. Clean the grill grate. As the grill heats, it'll burn off residue on the cooking grate and make it easier to clean. You'll still want to give it a once over with a wire grill brush to prevent sticking and flare-ups. Oil the grate lightly. Dab a wadded paper towel or clean cloth with a tablespoon or less of olive oil. Hold it with long grilling tongs and lightly coat the grate. Try not to use too much oil, or you might start a flare-up. Toss the octopus with olive oil, salt, and pepper. Toss the octopus in a large mixing bowl with 1/4 cup (60 mL) of olive oil until it's evenly coated. Season it lightly by rubbing it down with salt and pepper. Grill the octopus 3 to 4 minutes per side, or until it's well browned. Use your tongs to place the octopus on the cooking grate, then close the lid. After 3 to 4 minutes, flip the octopus and grill the other side for another 3 to 4 minutes. You want to see good browning and some char, but it should still look moist. Serve it on its own or toss it into a salad or pasta. Remove the octopus from the grill, give it a rough chop, and place it on a serving platter. Drizzle it with the remaining 1/4 cup (60 mL) of olive oil and juice of 1 lemon, and season it with salt and pepper to taste. Showcase it as a starter, and serve it to your guests with lemon wedges. You could also toss it with fresh greens and balsamic vinaigrette or serve it over pasta with a spicy tomato sauce.",
  "tyn_model":[
    "octopus",
    "grill",
    "olive oil",
    "water",
    "lemon",
    "chef's knife",
    "tentacles",
    "mallet",
    "garlic",
    "pot",
    "grill grate",
    "salt and pepper",
    "refrigerator",
    "ink",
    "large mallet",
    "large meat",
    "heavy rolling pin",
    "washing machine",
    "wine",
    "peppercorns",
    "large pot",
    "wine cork",
    "stove burner",
    "knife",
    "burner",
    "stove",
    "gas grill",
    "charcoal grill",
    "chimney starter",
    "lighter fluid",
    "grill brush",
    "long grilling tongs",
    "oil",
    "salt",
    "pepper",
    "large mixing bowl",
    "cooking grate",
    "lemon wedges",
    "balsamic vinaigrette",
    "tomato sauce"
  ],
  "tyn_section":[

  ]
}