{
  "title":"How to Remodel a Kitchen",
  "url":"https://www.wikihow.com/Remodel-a-Kitchen",
  "category_hierarchy":[
    "Home and Garden",
    "Home Improvements"
  ],
  "parts":[
    {
      "name":"Planning the Remodel",
      "steps":[
        {
          "headline":"Pick the features you want in your kitchen.",
          "description":"Take some time to come up with the ways you want to improve your current kitchen. One of the most important questions is if you have enough space. You may need to add onto your kitchen. After settling on space, pick out the kitchen features you absolutely have to have. For example, your dream kitchen may feature an island cooktop instead of a traditional stove. Save pictures of kitchens you like. Use them to identify features you want in your ideal kitchen."
        },
        {
          "headline":"Come up with a preliminary budget.",
          "description":"Decide upon a maximum amount of money you’re willing to invest in the remodel. As you plan your kitchen, do some research to find out how your plans fit your budget. You can do this by searching for furniture estimates online, visiting furniture showrooms, and talking to designers and contractors. Most of the time, remodeling costs more than you’d expect, so you’ll need to alter your plans or budget. The biggest priority is getting the layout and utilities right. Cabinets and countertops are the next part. These will comprise most of your biggest expenses. Don’t forget to add in designer and contractor costs."
        },
        {
          "headline":"Plan out the kitchen’s floor space.",
          "description":"Take the time to draw out your kitchen. Figure out where you’ll put your refrigerator and other appliances. Add in the counters and cabinets. A complete sketch shows you how much space you have to work with. You may need to opt for smaller appliances, counters, and cabinets in order to maintain enough free space in the kitchen. Keep in mind where your utility lines are going to be. Electrical outlets, plumbing, and gas lines all affect the arrangement. To save money, have the contractor keep them where they are now."
        },
        {
          "headline":"Determine the kitchen’s style.",
          "description":"Most likely you have an idea of how you want the kitchen to look. Perhaps you want your kitchen to look modern instead of traditional. It could be all wood, or it could incorporate a color theme. Picking a style means focusing on the overall look of the kitchen rather than its parts. For example, a kitchen with a modern style might have a black, gray, or white color scheme with a lot of reflective surfaces and marble walls. The appliances can be metallic and the furniture can look very sleek and minimal. A cottage kitchen could have checkered light blue or yellow patterns, vintage or white appliances, wood floors, and colorful decorations. For a farmhouse kitchen, wood flooring and furniture works well. The color scheme can include red, yellow, blue or white. Stone and brick appliances can also give a rustic look. A French or Mediterranean kitchen looks very ornate. It can feature warm colors with white or yellow walls and wood cabinets. It might have hand-painted wall tiles, a chandelier, copper pots, or ceramic crafts on display."
        },
        {
          "headline":"Get construction plans from a contractor.",
          "description":"Even if you plan on building the kitchen yourself, speaking to a designer is a good idea. Kitchen designers and architects can help you finalize your remodeling plans while staying within your budget. Construction contractors provide outlines for structural and utility work. You’ll need these plans to apply for building permits."
        },
        {
          "headline":"Get contractor estimates.",
          "description":"Significant remodels involve a lot of different parts, from electrical wiring to furniture installation. Usually you can get one contractor to do everything you need. Get estimates from at least three companies. Each contractor should talk to you about your design plans and give you an estimate. Use the estimate to figure out if you need to change your plans to stay under budget. Search the contractor’s name online to find reviews from other customers."
        },
        {
          "headline":"Apply for construction permits.",
          "description":"Consult your local government to figure out what permits you need. For most work, you won’t need a permit. If your remodeling plan includes building or demolishing walls, window openings, or utility lines, you’ll most likely need a permit. Designers, architects, and contractors can take care of this."
        }
      ]
    },
    {
      "name":"Starting the Remodel",
      "steps":[
        {
          "headline":"Arrange living plans during the remodeling.",
          "description":"Remodeling takes weeks and can be stressful. You’ll have to decide where you’re going to live and eat while the construction happens. Move your stove and refrigerator to another room. During the noisiest and dusty days, such as when walls and flooring are demolished, spend the day away from home. The best time for construction is in the summer. During warm weather, you can spend time outside and make food on a grill."
        },
        {
          "headline":"Get rid of everything you don’t want to keep.",
          "description":"Most of the things in your kitchen can be removed without a contractor’s help. If you’re handy around the house, pull up the flooring and cabinets. Remove light fixtures and other furniture you don’t plan on including in your new kitchen. If you haven’t hired a contractor yet, doing this on your own saves you some money. You might want to keep some of the appliances until the new ones come in, or else you could be stuck without a refrigerator or stove for weeks."
        },
        {
          "headline":"Order new cabinets, appliances, and light fixtures.",
          "description":"These features of your kitchen may take weeks to arrive. Getting stuck in the middle of a remodel is frustrating, so order what you need in advance. You’ll need storage space in your garage or house if they arrive before wall and flooring work is complete. Investing in these features can be expensive. Remember that they don’t all have to be replaced at the same time."
        },
        {
          "headline":"Get the framing, plumbing, and electrical work inspected.",
          "description":"Rough-in work is when your utilities are installed but not connected. Before the drywall is installed, hire a building inspector. They’ll make sure your home doesn’t violate any codes. You or your contractor can fix the violations before they become bigger issues."
        }
      ]
    },
    {
      "name":"Completing the Kitchen",
      "steps":[
        {
          "headline":"Finish decorating the walls.",
          "description":"After your home passes inspection, the walls need to be finished. You or your contractor will put up new drywall. Later on, when the rest of the construction work is finished, you can prime the walls and paint or put on wood paneling."
        },
        {
          "headline":"Install doors and windows.",
          "description":"New spaces for windows and doors may need to be cut into the wall. Once the space is finalized, install them along with any trim. It’s important to do this now so the cabinets are placed accurately."
        },
        {
          "headline":"Place the cabinets on the walls.",
          "description":"Hang the wall cabinets first so you have plenty of room to work. Place ground cabinets afterwards according to your floor plan. Cabinets tend to be the most expensive part of a remodel, so avoid brand names or repurpose old ones to save money. Renovating a cabinet can include painting, changing the knobs, or removing the doors."
        },
        {
          "headline":"Set up the countertops and sinks.",
          "description":"Countertops can also be a significant expense. Granite countertops are beautiful, but laminate countertops are the cheapest option. Once your countertop is set, you or your contractor can install the sink. Stainless steel sinks are the least expensive option, followed by copper, stone, and other options. This part is difficult to do yourself. Countertop slabs are heavy and require specific tools for shaping."
        },
        {
          "headline":"Install the flooring.",
          "description":"Flooring should only be done after the cabinets and countertops are in place. You’ll need to work around them when laying the flooring. Hardwood and linoleum flooring are two of the cheapest options. Other options, such as porcelain tiles and cork, can give your kitchen a unique look. You may install wall-to-wall flooring in the kitchen, but there’s not much reason to put it under the cabinets and countertops. It’ll impact your budget, yet you’ll never see that flooring."
        },
        {
          "headline":"Move your appliances into position.",
          "description":"Refrigerators, stoves, dishwashers, and other appliances come in a variety of shapes and sizes. Pick the ones that are best for your space and budget. Hook them up to the utility lines and celebrate being able to make dinner in your kitchen again. If you want to replace all of your appliances, consider doing it in stages. For instance, start with a new stove, then replace the other appliances as your budget allows it."
        },
        {
          "headline":"Install the light fixtures.",
          "description":"If new lights are part of the plan, set them up last. Shop around for stylish light fixtures that fit both within your kitchen and your budget. Attach them to the walls and ceiling as needed, then relax and enjoy your beautiful kitchen! Keeping your old light fixtures to save money is okay. Even if you can’t afford to install a new light fixture, have the contractors put in the electrical wires during the remodel."
        }
      ]
    }
  ],
  "text":" Planning the Remodel Pick the features you want in your kitchen. Take some time to come up with the ways you want to improve your current kitchen. One of the most important questions is if you have enough space. You may need to add onto your kitchen. After settling on space, pick out the kitchen features you absolutely have to have. For example, your dream kitchen may feature an island cooktop instead of a traditional stove. Save pictures of kitchens you like. Use them to identify features you want in your ideal kitchen. Come up with a preliminary budget. Decide upon a maximum amount of money you’re willing to invest in the remodel. As you plan your kitchen, do some research to find out how your plans fit your budget. You can do this by searching for furniture estimates online, visiting furniture showrooms, and talking to designers and contractors. Most of the time, remodeling costs more than you’d expect, so you’ll need to alter your plans or budget. The biggest priority is getting the layout and utilities right. Cabinets and countertops are the next part. These will comprise most of your biggest expenses. Don’t forget to add in designer and contractor costs. Plan out the kitchen’s floor space. Take the time to draw out your kitchen. Figure out where you’ll put your refrigerator and other appliances. Add in the counters and cabinets. A complete sketch shows you how much space you have to work with. You may need to opt for smaller appliances, counters, and cabinets in order to maintain enough free space in the kitchen. Keep in mind where your utility lines are going to be. Electrical outlets, plumbing, and gas lines all affect the arrangement. To save money, have the contractor keep them where they are now. Determine the kitchen’s style. Most likely you have an idea of how you want the kitchen to look. Perhaps you want your kitchen to look modern instead of traditional. It could be all wood, or it could incorporate a color theme. Picking a style means focusing on the overall look of the kitchen rather than its parts. For example, a kitchen with a modern style might have a black, gray, or white color scheme with a lot of reflective surfaces and marble walls. The appliances can be metallic and the furniture can look very sleek and minimal. A cottage kitchen could have checkered light blue or yellow patterns, vintage or white appliances, wood floors, and colorful decorations. For a farmhouse kitchen, wood flooring and furniture works well. The color scheme can include red, yellow, blue or white. Stone and brick appliances can also give a rustic look. A French or Mediterranean kitchen looks very ornate. It can feature warm colors with white or yellow walls and wood cabinets. It might have hand-painted wall tiles, a chandelier, copper pots, or ceramic crafts on display. Get construction plans from a contractor. Even if you plan on building the kitchen yourself, speaking to a designer is a good idea. Kitchen designers and architects can help you finalize your remodeling plans while staying within your budget. Construction contractors provide outlines for structural and utility work. You’ll need these plans to apply for building permits. Get contractor estimates. Significant remodels involve a lot of different parts, from electrical wiring to furniture installation. Usually you can get one contractor to do everything you need. Get estimates from at least three companies. Each contractor should talk to you about your design plans and give you an estimate. Use the estimate to figure out if you need to change your plans to stay under budget. Search the contractor’s name online to find reviews from other customers. Apply for construction permits. Consult your local government to figure out what permits you need. For most work, you won’t need a permit. If your remodeling plan includes building or demolishing walls, window openings, or utility lines, you’ll most likely need a permit. Designers, architects, and contractors can take care of this. Starting the Remodel Arrange living plans during the remodeling. Remodeling takes weeks and can be stressful. You’ll have to decide where you’re going to live and eat while the construction happens. Move your stove and refrigerator to another room. During the noisiest and dusty days, such as when walls and flooring are demolished, spend the day away from home. The best time for construction is in the summer. During warm weather, you can spend time outside and make food on a grill. Get rid of everything you don’t want to keep. Most of the things in your kitchen can be removed without a contractor’s help. If you’re handy around the house, pull up the flooring and cabinets. Remove light fixtures and other furniture you don’t plan on including in your new kitchen. If you haven’t hired a contractor yet, doing this on your own saves you some money. You might want to keep some of the appliances until the new ones come in, or else you could be stuck without a refrigerator or stove for weeks. Order new cabinets, appliances, and light fixtures. These features of your kitchen may take weeks to arrive. Getting stuck in the middle of a remodel is frustrating, so order what you need in advance. You’ll need storage space in your garage or house if they arrive before wall and flooring work is complete. Investing in these features can be expensive. Remember that they don’t all have to be replaced at the same time. Get the framing, plumbing, and electrical work inspected. Rough-in work is when your utilities are installed but not connected. Before the drywall is installed, hire a building inspector. They’ll make sure your home doesn’t violate any codes. You or your contractor can fix the violations before they become bigger issues. Completing the Kitchen Finish decorating the walls. After your home passes inspection, the walls need to be finished. You or your contractor will put up new drywall. Later on, when the rest of the construction work is finished, you can prime the walls and paint or put on wood paneling. Install doors and windows. New spaces for windows and doors may need to be cut into the wall. Once the space is finalized, install them along with any trim. It’s important to do this now so the cabinets are placed accurately. Place the cabinets on the walls. Hang the wall cabinets first so you have plenty of room to work. Place ground cabinets afterwards according to your floor plan. Cabinets tend to be the most expensive part of a remodel, so avoid brand names or repurpose old ones to save money. Renovating a cabinet can include painting, changing the knobs, or removing the doors. Set up the countertops and sinks. Countertops can also be a significant expense. Granite countertops are beautiful, but laminate countertops are the cheapest option. Once your countertop is set, you or your contractor can install the sink. Stainless steel sinks are the least expensive option, followed by copper, stone, and other options. This part is difficult to do yourself. Countertop slabs are heavy and require specific tools for shaping. Install the flooring. Flooring should only be done after the cabinets and countertops are in place. You’ll need to work around them when laying the flooring. Hardwood and linoleum flooring are two of the cheapest options. Other options, such as porcelain tiles and cork, can give your kitchen a unique look. You may install wall-to-wall flooring in the kitchen, but there’s not much reason to put it under the cabinets and countertops. It’ll impact your budget, yet you’ll never see that flooring. Move your appliances into position. Refrigerators, stoves, dishwashers, and other appliances come in a variety of shapes and sizes. Pick the ones that are best for your space and budget. Hook them up to the utility lines and celebrate being able to make dinner in your kitchen again. If you want to replace all of your appliances, consider doing it in stages. For instance, start with a new stove, then replace the other appliances as your budget allows it. Install the light fixtures. If new lights are part of the plan, set them up last. Shop around for stylish light fixtures that fit both within your kitchen and your budget. Attach them to the walls and ceiling as needed, then relax and enjoy your beautiful kitchen! Keeping your old light fixtures to save money is okay. Even if you can’t afford to install a new light fixture, have the contractors put in the electrical wires during the remodel.",
  "tyn_model":[
    "cabinets",
    "stove",
    "appliances",
    "refrigerator",
    "light fixtures",
    "drywall",
    "sinks",
    "counters",
    "pots",
    "kitchen designers",
    "construction contractors",
    "construction permits",
    "grill",
    "cabinet",
    "countertops",
    "sink",
    "flooring",
    "refrigerators",
    "stoves"
  ],
  "tyn_section":[

  ]
}