{
  "title":"How to Make Kalacs (Hungarian Sweet Bread)",
  "url":"https://www.wikihow.com/Make-Kalacs-(Hungarian-Sweet-Bread)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine"
  ],
  "steps":[
    {
      "headline":"Combine 2 cups flour and the yeast in a large mixing bowl.",
      "description":""
    },
    {
      "headline":"Heat milk, butter, sugar, salt in a pan until the butter is melted (about 115°F).",
      "description":""
    },
    {
      "headline":"Add the milk mixture to the flour and yeast.",
      "description":"Mix well, add the egg and beat well."
    },
    {
      "headline":"Add remainder of flour.",
      "description":"Knead, if you wish, or don't knead, just make sure that everything is well mixed."
    },
    {
      "headline":"Transfer to a greased bowl.",
      "description":"Cover and put in warm place to rise for 1 hour to 1-1/2 hrs. The size of the dough should about double."
    },
    {
      "headline":"While the dough is rising, prepare filling (if you make it from scratch, see recipe below, but if you have the sweetened chestnut puree already, then it's easy)",
      "description":""
    },
    {
      "headline":"After dough has risen, put it out onto a floured bread board and allow it to rest for 5-10 minutes.",
      "description":""
    },
    {
      "headline":"Divide the dough into two halves.",
      "description":""
    },
    {
      "headline":"Pat out or roll out each half with a rolling pin to about ⁄4 inch (0.6 cm) thickness.",
      "description":""
    },
    {
      "headline":"Spread half the filling on the dough and roll the dough up like a jelly roll.",
      "description":"Tuck the ends over to close the loaf. Repeat with the second half of the dough and the rest of the filling."
    },
    {
      "headline":"Place each loaf in a greased loaf pan and let rise about 30 minutes.",
      "description":"Bake at 350 °F (177 °C) for about 30 minutes until lightly browned."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Combine 2 cups flour and the yeast in a large mixing bowl.  Heat milk, butter, sugar, salt in a pan until the butter is melted (about 115°F).  Add the milk mixture to the flour and yeast. Mix well, add the egg and beat well. Add remainder of flour. Knead, if you wish, or don't knead, just make sure that everything is well mixed. Transfer to a greased bowl. Cover and put in warm place to rise for 1 hour to 1-1/2 hrs. The size of the dough should about double. While the dough is rising, prepare filling (if you make it from scratch, see recipe below, but if you have the sweetened chestnut puree already, then it's easy)  After dough has risen, put it out onto a floured bread board and allow it to rest for 5-10 minutes.  Divide the dough into two halves.  Pat out or roll out each half with a rolling pin to about ⁄4 inch (0.6 cm) thickness.  Spread half the filling on the dough and roll the dough up like a jelly roll. Tuck the ends over to close the loaf. Repeat with the second half of the dough and the rest of the filling. Place each loaf in a greased loaf pan and let rise about 30 minutes. Bake at 350 °F (177 °C) for about 30 minutes until lightly browned. Finished. ",
  "tyn_model":[
    "flour",
    "yeast",
    "milk",
    "butter",
    "large mixing bowl",
    "sugar",
    "salt",
    "pan",
    "bowl",
    "sweetened chestnut puree",
    "bread board",
    "rolling pin",
    "loaf pan"
  ],
  "tyn_section":[

  ]
}