{
  "title":"How to Reheat Pancakes",
  "url":"https://www.wikihow.com/Reheat-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "methods":[
    {
      "name":"Reheating in the Microwave, Oven, or Toaster",
      "steps":[
        {
          "headline":"Microwave your pancakes for 20 seconds each.",
          "description":"Heat up 1-5 uncovered pancakes at a time on a microwave-safe plate. Experiment with timing to see what works best with your microwave’s wattage; you may find that 5 pancakes will be ready to go after just about a minute, or that they’ll need a bit more time. If you froze your pancake, let it defrost in the refrigerator overnight before microwaving in the morning. This is the fastest method, and great for a busy weekday morning. Your pancakes should be soft, fluffy, warm, and ready to eat! If you find your pancakes getting a bit mushy in the microwave, try microwaving them for a shorter time. Mix it up to see what length of time works best for your pancakes and your microwave."
        },
        {
          "headline":"Toast small batches for pancakes with the perfect crunch.",
          "description":"Set the toaster to a medium setting and check it when it pops out. Cut into your pancake a bit to see if it’s heated all the way through. If it’s just slightly crispy and warm or hot, serve it up and enjoy! If it’s still lukewarm or cold, let it toast for a few minutes more. Toast pancakes that use a non-white flour, like whole wheat flour. They’ll get just slightly crunchy on the outside without becoming doughy underneath. You can use a toaster oven or a regular toaster. This method is typically limited to smaller batches because of the small size of toasters and toaster ovens."
        },
        {
          "headline":"Reheat larger batches in the oven for 10 minutes at 350 °F (177 °C).",
          "description":"Wrap your pancakes in foil before putting them in, which will help them retain their fluffiness and not get too dry. You can either wrap up a stack in foil, or lay them flat on a baking sheet and cover it tightly with foil. Check the pancakes after 10 minutes to see if they’re ready - they’ll be warm and soft, but not too hot or crunchy. Put them back in for a few minutes if they’re still a little cold. This is a great option if you’re reheating a large number of pancakes. Simply wrap up as many as you need and pop them in the oven!"
        }
      ]
    },
    {
      "name":"Freezing Pancakes Properly",
      "steps":[
        {
          "headline":"Let the pancakes cool to room temperature.",
          "description":"After you’ve finished cooking your pancakes, set them out on a cooling rack or cutting board to cool. Flip them over after about 10 minutes so each side gets a chance to cool down. Pancakes that are still warm will create condensation in your resealable bag and cause your pancakes to freeze together."
        },
        {
          "headline":"Date and label a resealable plastic bag.",
          "description":"This is where you’ll be storing your pancakes. Make sure to put the current date and the type of pancake (such as buttermilk)."
        },
        {
          "headline":"Stack your pancakes with a piece of parchment between each.",
          "description":"Make sure none of the pancakes are touching each other, which will prevent them from sticking together. Place them in the labeled plastic bag. You can also use wax paper as a separator."
        },
        {
          "headline":"Freeze the pancakes on a baking sheet if you don’t have parchment.",
          "description":"Lay them flat on the sheet, making sure they’re not touching. Set them in the freezer until totally frozen, about 30 minutes. Then, remove them from the freezer, place them in the plastic bag, and put them back in the freezer until you’re ready to eat."
        },
        {
          "headline":"Plan to eat the pancakes within a week or two.",
          "description":"The pancakes should keep for a few weeks, although you should eat them within one week if possible. This is when they’ll be the most fresh--and taste the best!"
        },
        {
          "headline":"Let your pancakes thaw before you reheat them.",
          "description":"Set them in the refrigerator overnight, then pop them in the microwave, toaster, or oven when you’re ready to reheat."
        }
      ]
    }
  ],
  "text":" Reheating in the Microwave, Oven, or Toaster Microwave your pancakes for 20 seconds each. Heat up 1-5 uncovered pancakes at a time on a microwave-safe plate. Experiment with timing to see what works best with your microwave’s wattage; you may find that 5 pancakes will be ready to go after just about a minute, or that they’ll need a bit more time. If you froze your pancake, let it defrost in the refrigerator overnight before microwaving in the morning. This is the fastest method, and great for a busy weekday morning. Your pancakes should be soft, fluffy, warm, and ready to eat! If you find your pancakes getting a bit mushy in the microwave, try microwaving them for a shorter time. Mix it up to see what length of time works best for your pancakes and your microwave. Toast small batches for pancakes with the perfect crunch. Set the toaster to a medium setting and check it when it pops out. Cut into your pancake a bit to see if it’s heated all the way through. If it’s just slightly crispy and warm or hot, serve it up and enjoy! If it’s still lukewarm or cold, let it toast for a few minutes more. Toast pancakes that use a non-white flour, like whole wheat flour. They’ll get just slightly crunchy on the outside without becoming doughy underneath. You can use a toaster oven or a regular toaster. This method is typically limited to smaller batches because of the small size of toasters and toaster ovens. Reheat larger batches in the oven for 10 minutes at 350 °F (177 °C). Wrap your pancakes in foil before putting them in, which will help them retain their fluffiness and not get too dry. You can either wrap up a stack in foil, or lay them flat on a baking sheet and cover it tightly with foil. Check the pancakes after 10 minutes to see if they’re ready - they’ll be warm and soft, but not too hot or crunchy. Put them back in for a few minutes if they’re still a little cold. This is a great option if you’re reheating a large number of pancakes. Simply wrap up as many as you need and pop them in the oven! Freezing Pancakes Properly Let the pancakes cool to room temperature. After you’ve finished cooking your pancakes, set them out on a cooling rack or cutting board to cool. Flip them over after about 10 minutes so each side gets a chance to cool down. Pancakes that are still warm will create condensation in your resealable bag and cause your pancakes to freeze together. Date and label a resealable plastic bag. This is where you’ll be storing your pancakes. Make sure to put the current date and the type of pancake (such as buttermilk). Stack your pancakes with a piece of parchment between each. Make sure none of the pancakes are touching each other, which will prevent them from sticking together. Place them in the labeled plastic bag. You can also use wax paper as a separator. Freeze the pancakes on a baking sheet if you don’t have parchment. Lay them flat on the sheet, making sure they’re not touching. Set them in the freezer until totally frozen, about 30 minutes. Then, remove them from the freezer, place them in the plastic bag, and put them back in the freezer until you’re ready to eat. Plan to eat the pancakes within a week or two. The pancakes should keep for a few weeks, although you should eat them within one week if possible. This is when they’ll be the most fresh--and taste the best! Let your pancakes thaw before you reheat them. Set them in the refrigerator overnight, then pop them in the microwave, toaster, or oven when you’re ready to reheat.",
  "tyn_model":[
    "pancakes",
    "toaster",
    "microwave",
    "foil",
    "freezer",
    "refrigerator",
    "oven",
    "baking sheet",
    "parchment",
    "plastic bag",
    "microwave, oven",
    "microwave-safe plate",
    "whole wheat flour",
    "toaster oven",
    "toasters",
    "toaster ovens",
    "resealable bag",
    "resealable plastic bag",
    "buttermilk",
    "wax paper"
  ],
  "tyn_section":[

  ]
}