{
  "title":"How to Draw a Cartoon Moose",
  "url":"https://www.wikihow.com/Draw-a-Cartoon-Moose",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "parts":[
    {
      "name":"Drawing the Head",
      "steps":[
        {
          "headline":"Start by lightly sketching an oval.",
          "description":"This will help shape the moose's head. Make sure to sketch it lightly as you will erase this later."
        },
        {
          "headline":"Draw a small circle on the oval.",
          "description":"The circle should overlap the bottom of the oval, slightly extending outwards.This should also be sketched lightly; you will erase it later."
        },
        {
          "headline":"Trace around the full shape.",
          "description":"Follow the shape that's already been formed. This will later define the shape of the nose and the overall face."
        },
        {
          "headline":"Erase the original shape.",
          "description":"Erase the inside parts of the tracing (the oval that was drawn in step 1 and the circle that was drawn in step 2). Your head shape should be clear and defined."
        },
        {
          "headline":"Split the face in half.",
          "description":"Do this by sketching a vertical line across the middle of the face and then a horizontal line towards the top of the face. This will help align the eyes accurately in the next part."
        }
      ]
    },
    {
      "name":"Drawing the Eyes",
      "steps":[
        {
          "headline":"Draw the eye shapes.",
          "description":"Do this by sketching two smaller ovals using the lines sketched in the previous step to help you align them. The eyes should go right on top of the horizontal line you sketched but they should not touch the vertical line."
        },
        {
          "headline":"Draw the eyeballs.",
          "description":"Sketch a curved line in each of the eye shapes, towards the top, connecting it to the ends. Then, draw three smaller circles inside each eye shape."
        },
        {
          "headline":"Shade them in.",
          "description":"Make sure to leave the smaller circles unshaded."
        },
        {
          "headline":"Draw the eyebrows.",
          "description":"Do this by sketching two small, curved lines aligning the tops of the eyes. The eyebrows should not extend farther than the eyes."
        }
      ]
    },
    {
      "name":"Drawing the Nose",
      "steps":[
        {
          "headline":"Draw the nostrils.",
          "description":"You can simply do this by drawing two small oval shapes with pointed tips at the bottom, almost like upside down raindrops. They should be at the center of the bottom of the nose, one on each side of the vertical line."
        },
        {
          "headline":"Shade the nostrils in completely.",
          "description":"Make them as dark as possible, still using pencil."
        },
        {
          "headline":"Erase the horizontal and vertical lines.",
          "description":"You should be able to see the face more clear now."
        }
      ]
    },
    {
      "name":"Drawing the Mouth",
      "steps":[
        {
          "headline":"Draw the mouth.",
          "description":"Do this by drawing a small upside down half circle, connecting it to right under the nose, starting from the first nostril and ending at the second nostril."
        },
        {
          "headline":"Repeat previous step.",
          "description":"This line should be under the first. Make sure to leave a little bit of space between them."
        }
      ]
    },
    {
      "name":"Drawing the Ears",
      "steps":[
        {
          "headline":"Sketch two triangular shapes.",
          "description":"They should have a smooth tip and be at the top of the head. Make sure to align each ear above each eye."
        },
        {
          "headline":"Sketch a line in the middle of each ear.",
          "description":"Follow the shape of the ear when you do this. Instead of drawing two straight lines, make them more curved. This will shape the inner ears."
        }
      ]
    },
    {
      "name":"Drawing the Antlers",
      "steps":[
        {
          "headline":"Sketch upward slanted lines on both sides of the face.",
          "description":"The first line should be right under each ear; make sure it slightly extends past each ear. Then leaving some space in between, draw another line under each of the first lines, making it slightly longer."
        },
        {
          "headline":"Sketch wide half circles.",
          "description":"These should be upside down wide half circles, connected to the bottom lines (from previous step)."
        },
        {
          "headline":"Create irregular shapes.",
          "description":"Sketch small triangular and circular shapes along the top of the antlers. This can vary, but you can start with a triangular shape, then two circular, and finish off with a triangular."
        },
        {
          "headline":"Connect the antlers.",
          "description":"Finish off by drawing lines to connect both antlers to the head. The lines do not have to be perfectly straight. You are done!"
        }
      ]
    }
  ],
  "text":" Drawing the Head Start by lightly sketching an oval. This will help shape the moose's head. Make sure to sketch it lightly as you will erase this later. Draw a small circle on the oval. The circle should overlap the bottom of the oval, slightly extending outwards.This should also be sketched lightly; you will erase it later. Trace around the full shape. Follow the shape that's already been formed. This will later define the shape of the nose and the overall face. Erase the original shape. Erase the inside parts of the tracing (the oval that was drawn in step 1 and the circle that was drawn in step 2). Your head shape should be clear and defined. Split the face in half. Do this by sketching a vertical line across the middle of the face and then a horizontal line towards the top of the face. This will help align the eyes accurately in the next part. Drawing the Eyes Draw the eye shapes. Do this by sketching two smaller ovals using the lines sketched in the previous step to help you align them. The eyes should go right on top of the horizontal line you sketched but they should not touch the vertical line. Draw the eyeballs. Sketch a curved line in each of the eye shapes, towards the top, connecting it to the ends. Then, draw three smaller circles inside each eye shape. Shade them in. Make sure to leave the smaller circles unshaded. Draw the eyebrows. Do this by sketching two small, curved lines aligning the tops of the eyes. The eyebrows should not extend farther than the eyes. Drawing the Nose Draw the nostrils. You can simply do this by drawing two small oval shapes with pointed tips at the bottom, almost like upside down raindrops. They should be at the center of the bottom of the nose, one on each side of the vertical line. Shade the nostrils in completely. Make them as dark as possible, still using pencil. Erase the horizontal and vertical lines. You should be able to see the face more clear now. Drawing the Mouth Draw the mouth. Do this by drawing a small upside down half circle, connecting it to right under the nose, starting from the first nostril and ending at the second nostril. Repeat previous step. This line should be under the first. Make sure to leave a little bit of space between them. Drawing the Ears Sketch two triangular shapes. They should have a smooth tip and be at the top of the head. Make sure to align each ear above each eye. Sketch a line in the middle of each ear. Follow the shape of the ear when you do this. Instead of drawing two straight lines, make them more curved. This will shape the inner ears. Drawing the Antlers Sketch upward slanted lines on both sides of the face. The first line should be right under each ear; make sure it slightly extends past each ear. Then leaving some space in between, draw another line under each of the first lines, making it slightly longer. Sketch wide half circles. These should be upside down wide half circles, connected to the bottom lines (from previous step). Create irregular shapes. Sketch small triangular and circular shapes along the top of the antlers. This can vary, but you can start with a triangular shape, then two circular, and finish off with a triangular. Connect the antlers. Finish off by drawing lines to connect both antlers to the head. The lines do not have to be perfectly straight. You are done!",
  "tyn_model":[
    "nostrils",
    "moose",
    "eyebrows",
    "pencil",
    "triangular"
  ],
  "tyn_section":[

  ]
}