{
  "title":"How to Make Chicken Paprikash",
  "url":"https://www.wikihow.com/Make-Chicken-Paprikash",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine"
  ],
  "parts":[
    {
      "name":"Cooking the Chicken",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C).",
          "description":""
        },
        {
          "headline":"Mix the seasonings in bowl.",
          "description":"Mix together 2 teaspoons garlic powder, 1 tablespoon black pepper, 1 tablespoon Vegeta, and 1 teaspoon sea salt in a small bowl."
        },
        {
          "headline":"Rub the seasonings onto the chicken.",
          "description":"Let stand 1 minute. Spread the corn starch evenly onto chicken."
        },
        {
          "headline":"Pour oil into a 12-inch skillet pan.",
          "description":"Oil should be ⁄4 inch (0.6 cm) deep in pain. Turn the heat to medium."
        },
        {
          "headline":"Place the chicken into the pan.",
          "description":"When oil is hot, place chicken skin-side-down and reduce heat to medium-low after 30 seconds. While the chicken is being cooked, start preparing the sauce. The sauce will be completed at the same time as frying the chicken if working concurrently."
        },
        {
          "headline":"Cook the chicken for about 15 minutes or until light brown.",
          "description":"Rotate chicken 90 degrees every 2 minutes while cooking. The internal chicken temperature should be about 130 °F (54 °C) at this point. Shake the excess oil off chicken and place into covered baking dish. Corningware or Granite ware is best to use as baking dishes."
        }
      ]
    },
    {
      "name":"Making the Sauce",
      "steps":[
        {
          "headline":"Saute the onions.",
          "description":"In a large pot, heat 1 tablespoon of oil and add the onions. Add 2 tablespoons of Vegeta and saute onions until translucent on medium-high heat. Stir the mixture continually."
        },
        {
          "headline":"Add flour to sauteed onion mixture.",
          "description":"Whisk together on low heat until flour is absorbed."
        },
        {
          "headline":"Add the paprika slowly while whisking mixture.",
          "description":"Remove pan off burner to avoid burning."
        },
        {
          "headline":"Pour 24 ounces of water slowly while whisking the sauce.",
          "description":"Bring sauce to boil."
        },
        {
          "headline":"Add mushrooms and parsley.",
          "description":"Whisk well to dissolve any clumps."
        },
        {
          "headline":"Season to taste.",
          "description":"Add 2 teaspoons garlic powder, 1 tablespoon of black pepper, and the chicken bouillon to mixture. Add additional salt to taste."
        },
        {
          "headline":"Reduce sauce.",
          "description":"Reduce heat to a simmer until mixture becomes a gravy consistency. Whisk occasionally. If sauce becomes too thick, add a small amount of water until desired consistency is reached."
        }
      ]
    },
    {
      "name":"Finishing the Dish",
      "steps":[
        {
          "headline":"Pour the mixture over the chicken within the baking container.",
          "description":""
        },
        {
          "headline":"Cover the chicken and place in oven.",
          "description":"Place baking pan in convectional oven for 20-25 minutes. If using conventional oven, bake for 25-30 minutes. Use a thermometer to verify chicken is above 165 degrees Fahrenheit."
        },
        {
          "headline":"Serve and eat.",
          "description":"Use a ladle to serve over mashed potatoes or rice."
        }
      ]
    }
  ],
  "text":" Cooking the Chicken Preheat the oven to 350 °F (177 °C).  Mix the seasonings in bowl. Mix together 2 teaspoons garlic powder, 1 tablespoon black pepper, 1 tablespoon Vegeta, and 1 teaspoon sea salt in a small bowl. Rub the seasonings onto the chicken. Let stand 1 minute. Spread the corn starch evenly onto chicken. Pour oil into a 12-inch skillet pan. Oil should be ⁄4 inch (0.6 cm) deep in pain. Turn the heat to medium. Place the chicken into the pan. When oil is hot, place chicken skin-side-down and reduce heat to medium-low after 30 seconds. While the chicken is being cooked, start preparing the sauce. The sauce will be completed at the same time as frying the chicken if working concurrently. Cook the chicken for about 15 minutes or until light brown. Rotate chicken 90 degrees every 2 minutes while cooking. The internal chicken temperature should be about 130 °F (54 °C) at this point. Shake the excess oil off chicken and place into covered baking dish. Corningware or Granite ware is best to use as baking dishes. Making the Sauce Saute the onions. In a large pot, heat 1 tablespoon of oil and add the onions. Add 2 tablespoons of Vegeta and saute onions until translucent on medium-high heat. Stir the mixture continually. Add flour to sauteed onion mixture. Whisk together on low heat until flour is absorbed. Add the paprika slowly while whisking mixture. Remove pan off burner to avoid burning. Pour 24 ounces of water slowly while whisking the sauce. Bring sauce to boil. Add mushrooms and parsley. Whisk well to dissolve any clumps. Season to taste. Add 2 teaspoons garlic powder, 1 tablespoon of black pepper, and the chicken bouillon to mixture. Add additional salt to taste. Reduce sauce. Reduce heat to a simmer until mixture becomes a gravy consistency. Whisk occasionally. If sauce becomes too thick, add a small amount of water until desired consistency is reached. Finishing the Dish Pour the mixture over the chicken within the baking container.  Cover the chicken and place in oven. Place baking pan in convectional oven for 20-25 minutes. If using conventional oven, bake for 25-30 minutes. Use a thermometer to verify chicken is above 165 degrees Fahrenheit. Serve and eat. Use a ladle to serve over mashed potatoes or rice.",
  "tyn_model":[
    "chicken",
    "oil",
    "oven",
    "onions",
    "seasonings",
    "garlic powder",
    "black pepper",
    "flour",
    "water",
    "sea salt",
    "small bowl",
    "corn starch",
    "12-inch skillet",
    "baking dish",
    "corningware or",
    "granite ware",
    "baking dishes",
    "large pot",
    "paprika",
    "mushrooms",
    "parsley",
    "whisk",
    "salt",
    "baking container",
    "baking pan",
    "convectional oven",
    "ladle",
    "potatoes",
    "rice"
  ],
  "tyn_section":[

  ]
}