{
  "title":"How to Make Pumpkin Alfredo",
  "url":"https://www.wikihow.com/Make-Pumpkin-Alfredo",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "methods":[
    {
      "name":"Basic Pumpkin Alfredo",
      "steps":[
        {
          "headline":"Boil the fettuccine pasta in a pot of salted boiling water.",
          "description":"Following the instructions directed on the package, cook the pasta until it is al dente, usually taking about 7-8 minutes. Drain in a colander once cooked."
        },
        {
          "headline":"Melt the butter in a large skillet pan over medium-high heat.",
          "description":"Stir with a wooden spoon until fully melted."
        },
        {
          "headline":"Stir in the garlic and sauté together for about a minute.",
          "description":"Sauté well until the garlic gives out a fragrant."
        },
        {
          "headline":"Mix in the pumpkin puree milk, and rosemary.",
          "description":"Incorporate the ingredients properly with a wooden spoon."
        },
        {
          "headline":"Sprinkle the Parmesan cheese and nutmeg over the sauce.",
          "description":"If desired for more flavor, you can also season the sauce with sea salt and black pepper. Mix well until fully combined."
        },
        {
          "headline":"Simmer the pumpkin sauce for about five minutes until thick and creamy.",
          "description":""
        },
        {
          "headline":"Combine the fettuccine pasta with the pumpkin sauce.",
          "description":"Mix well until the sauce is properly incorporated with the pasta."
        },
        {
          "headline":"Serve.",
          "description":"Scoop a serving of pumpkin alfredo onto a serving plate. Garnish with extra Parmesan cheese and parsley. Enjoy!"
        }
      ]
    },
    {
      "name":"5 Ingredient Pumpkin Alfredo",
      "steps":[
        {
          "headline":"Boil the fettuccine pasta in a pot of salted boiling water.",
          "description":"Following the instructions directed on the package, cook the pasta until it is al dente, usually taking about 7-8 minutes. Drain in a colander once cooked."
        },
        {
          "headline":"Melt the butter in a large skillet pan over medium-high heat.",
          "description":"Stir with a wooden spoon until fully melted."
        },
        {
          "headline":"Stir in the garlic and sauté together for about a minute.",
          "description":"Sauté well until the garlic gives out a fragrant."
        },
        {
          "headline":"Pour the heavy whipping cream and pumpkin puree into the mixture.",
          "description":"Stir with a wooden spoon until fully incorporated. Add the Parmesan cheese, if desired."
        },
        {
          "headline":"Simmer the pumpkin sauce for about five minutes until thick and creamy.",
          "description":""
        },
        {
          "headline":"Combine the fettuccine pasta with the pumpkin sauce.",
          "description":"Mix well until the sauce is properly incorporated with the pasta."
        },
        {
          "headline":"Serve.",
          "description":"Scoop a serving of pumpkin alfredo onto a serving plate. Garnish with extra Parmesan cheese and/or parsley, if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Vegan Pumpkin Alfredo",
      "steps":[
        {
          "headline":"Boil the fettuccine pasta in a pot of salted boiling water.",
          "description":"Following the instructions directed on the package, cook the pasta until it is al dente, usually taking about 7-8 minutes. Drain in a colander once cooked."
        },
        {
          "headline":"Combine the oil and garlic together and sauté for about a minute over medium heat.",
          "description":"Sauté well until the garlic gives out a fragrant and is golden brown."
        },
        {
          "headline":"Pour in the pumpkin puree, one cup of milk, salt, and pepper.",
          "description":"Allow the mixture to cook over medium-high heat for about five minutes to simmer."
        },
        {
          "headline":"Add in the rest of milk, lemon juice, yeast, and cornstarch.",
          "description":"Stir once more until fully combined."
        },
        {
          "headline":"Allow the sauce to simmer for an additional few minutes to thicken.",
          "description":""
        },
        {
          "headline":"Combine the fettuccine pasta with the pumpkin sauce.",
          "description":"Mix well until the sauce is properly incorporated with the pasta."
        },
        {
          "headline":"Serve.",
          "description":"Scoop a serving of pumpkin alfredo onto a serving plate. Garnish with extra Parmesan cheese and/or parsley, if desired. Enjoy!"
        }
      ]
    }
  ],
  "text":" Basic Pumpkin Alfredo Boil the fettuccine pasta in a pot of salted boiling water. Following the instructions directed on the package, cook the pasta until it is al dente, usually taking about 7-8 minutes. Drain in a colander once cooked. Melt the butter in a large skillet pan over medium-high heat. Stir with a wooden spoon until fully melted. Stir in the garlic and sauté together for about a minute. Sauté well until the garlic gives out a fragrant. Mix in the pumpkin puree milk, and rosemary. Incorporate the ingredients properly with a wooden spoon. Sprinkle the Parmesan cheese and nutmeg over the sauce. If desired for more flavor, you can also season the sauce with sea salt and black pepper. Mix well until fully combined. Simmer the pumpkin sauce for about five minutes until thick and creamy.  Combine the fettuccine pasta with the pumpkin sauce. Mix well until the sauce is properly incorporated with the pasta. Serve. Scoop a serving of pumpkin alfredo onto a serving plate. Garnish with extra Parmesan cheese and parsley. Enjoy! 5 Ingredient Pumpkin Alfredo Boil the fettuccine pasta in a pot of salted boiling water. Following the instructions directed on the package, cook the pasta until it is al dente, usually taking about 7-8 minutes. Drain in a colander once cooked. Melt the butter in a large skillet pan over medium-high heat. Stir with a wooden spoon until fully melted. Stir in the garlic and sauté together for about a minute. Sauté well until the garlic gives out a fragrant. Pour the heavy whipping cream and pumpkin puree into the mixture. Stir with a wooden spoon until fully incorporated. Add the Parmesan cheese, if desired. Simmer the pumpkin sauce for about five minutes until thick and creamy.  Combine the fettuccine pasta with the pumpkin sauce. Mix well until the sauce is properly incorporated with the pasta. Serve. Scoop a serving of pumpkin alfredo onto a serving plate. Garnish with extra Parmesan cheese and/or parsley, if desired. Enjoy! Vegan Pumpkin Alfredo Boil the fettuccine pasta in a pot of salted boiling water. Following the instructions directed on the package, cook the pasta until it is al dente, usually taking about 7-8 minutes. Drain in a colander once cooked. Combine the oil and garlic together and sauté for about a minute over medium heat. Sauté well until the garlic gives out a fragrant and is golden brown. Pour in the pumpkin puree, one cup of milk, salt, and pepper. Allow the mixture to cook over medium-high heat for about five minutes to simmer. Add in the rest of milk, lemon juice, yeast, and cornstarch. Stir once more until fully combined. Allow the sauce to simmer for an additional few minutes to thicken.  Combine the fettuccine pasta with the pumpkin sauce. Mix well until the sauce is properly incorporated with the pasta. Serve. Scoop a serving of pumpkin alfredo onto a serving plate. Garnish with extra Parmesan cheese and/or parsley, if desired. Enjoy!",
  "tyn_model":[
    "garlic",
    "fettuccine pasta",
    "parmesan cheese",
    "pumpkin sauce",
    "wooden spoon",
    "colander",
    "pumpkin alfredo",
    "parsley",
    "salted boiling",
    "butter",
    "large skillet",
    "pumpkin puree",
    "milk",
    "pumpkin puree milk",
    "rosemary",
    "nutmeg",
    "sea salt",
    "black pepper",
    "water",
    "heavy whipping cream",
    "serving plate",
    "pot",
    "salted boiling water",
    "oil",
    "salt",
    "pepper",
    "lemon juice",
    "yeast",
    "cornstarch"
  ],
  "tyn_section":[

  ]
}