{
  "title":"How to Make Beigli (Hungarian Poppy Seed &amp; Walnut Rolls)",
  "url":"https://www.wikihow.com/Make-Beigli-(Hungarian-Poppy-Seed-%26-Walnut-Rolls)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Bread Rolls"
  ],
  "steps":[
    {
      "headline":"Dissolve the yeast and granulated sugar in 1/4 cup of  lukewarm milk.",
      "description":"Set aside for 10 minutes until the liquid forms a foamy mixture."
    },
    {
      "headline":"Combine the flour, icing sugar, and salt in a large bowl.",
      "description":"Cut in the butter. Mix well."
    },
    {
      "headline":"Make a well in the center and add the yeast mixture and egg yolks.",
      "description":"Mix gently, gradually adding 1/4 to 1/2 cup milk until the dough can be formed into a ball. Cover with a cloth and let rise until doubled in size (2 hours)."
    },
    {
      "headline":"Grind the walnuts and poppy seeds separately.",
      "description":""
    },
    {
      "headline":"Mix the ingredients for the two fillings separately in a medium saucepan and simmer over a low heat for 15 minutes, stirring frequently.",
      "description":"Remove from the stove and allow to cool."
    },
    {
      "headline":"Divide the dough into two halves and roll each half on a floured surface into 12x18 inch rectangles.",
      "description":"Spread the nut filling on one rectangle and the poppy seed filling on the other, leaving a margin of at least an inch on all edges."
    },
    {
      "headline":"Turn up the sides to prevent leaking and roll the beigli lengthwise to form two 12-inch rolls.",
      "description":"Brush the tops of the rolls with egg whites, poke a few holes in them with a fork."
    },
    {
      "headline":"Bake at 350 °F (177 °C) for 40-45 minutes or until golden brown.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Dissolve the yeast and granulated sugar in 1/4 cup of  lukewarm milk. Set aside for 10 minutes until the liquid forms a foamy mixture. Combine the flour, icing sugar, and salt in a large bowl. Cut in the butter. Mix well. Make a well in the center and add the yeast mixture and egg yolks. Mix gently, gradually adding 1/4 to 1/2 cup milk until the dough can be formed into a ball. Cover with a cloth and let rise until doubled in size (2 hours). Grind the walnuts and poppy seeds separately.  Mix the ingredients for the two fillings separately in a medium saucepan and simmer over a low heat for 15 minutes, stirring frequently. Remove from the stove and allow to cool. Divide the dough into two halves and roll each half on a floured surface into 12x18 inch rectangles. Spread the nut filling on one rectangle and the poppy seed filling on the other, leaving a margin of at least an inch on all edges. Turn up the sides to prevent leaking and roll the beigli lengthwise to form two 12-inch rolls. Brush the tops of the rolls with egg whites, poke a few holes in them with a fork. Bake at 350 °F (177 °C) for 40-45 minutes or until golden brown.  Finished. ",
  "tyn_model":[
    "yeast",
    "granulated sugar",
    "lukewarm milk",
    "flour",
    "icing sugar",
    "salt",
    "large bowl",
    "butter",
    "egg yolks",
    "milk",
    "walnuts",
    "poppy seeds",
    "medium saucepan",
    "stove",
    "nut",
    "poppy seed",
    "beigli",
    "fork"
  ],
  "tyn_section":[

  ]
}