{
  "title":"How to Cook Taro Root",
  "url":"https://www.wikihow.com/Cook-Taro-Root",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian"
  ],
  "methods":[
    {
      "name":"Taking the Proper Precautions",
      "steps":[
        {
          "headline":"Avoid eating taro root raw.",
          "description":"Taro root can actually be toxic to humans if it is ingested raw. You should always cook taro root completely to avoid any possible side effects from eating the raw root. Always err on the side of caution and overcook the taro root instead of undercooking it."
        },
        {
          "headline":"Wear gloves while handling the taro root.",
          "description":"Since taro root is toxic in its raw form, it’s important to wear gloves while you are touching the root. This will help prevent any possible reactions to the toxicity of the root. The hairy external skin is also quite irritating to human skin, so the gloves help protect your skin in this respect as well."
        },
        {
          "headline":"Clean the taro root well before cooking.",
          "description":"Washing food before consumption is always important, but it’s especially important with the taro root because of the toxicity factor. Cleaning the taro root can help remove additional toxins before cooking the root makes the rest fully edible. Peel the taro root with a knife or peeling utensil. Run the peeled taro root under cold water in the sink and use your fingers to wipe away any excess dirt or debris."
        }
      ]
    },
    {
      "name":"Cooking Taro Root in the Oven",
      "steps":[
        {
          "headline":"Make taro root fries.",
          "description":"Cut off the hairy exterior of the root and slice 1 full taro root into thin pieces – just as you would if you were making regular potato fries. Pour 2 tablespoons (29.6 ml) of canola oil into a frying pan and let it simmer on medium-high heat until it is hot and sizzling. Add your taro slices to the pan and let them cook until the edges become golden brown. Then flip the taro slices and let the other side cook. When they are done, you can drain any excess oil by placing the taro slices on a paper towel. Then season with salt and they are ready to serve!"
        },
        {
          "headline":"Roast the taro root.",
          "description":"Wash 12 small taro roots thoroughly. Place the roots in a steamer for about 10 minutes, or until the flesh is tender. After steaming, let the roots cool before peeling off the hairy outer skin. Place all of the peeled taro roots inside a large Zip-lock bag and add 2 teaspoons of oil, 1 teaspoon of chili powder, and ¼ teaspoon of turmeric powder. Toss the roots inside the Zip-lock bag until all of the roots are coated in the mixture. Scatter roots on a baking sheet with a piece of aluminum foil on top. Broil them for 25 minutes. Remove them when the root surfaces are charred and golden brown. Remember to turn the roots several times while they are in the oven."
        },
        {
          "headline":"Make taro root chips.",
          "description":"Take 1 lb (0.45 kg) of fresh taro roots and peel them. Carefully slice the taro roots into thin slices lengthwise. Place the slices on a baking sheet lined with parchment paper and lightly coat each slice with olive oil. Put the baking sheet in the oven on 400 °F (204 °C) for 20 minutes, or until the edges are a crispy golden brown. You can sprinkle some additional salt on top of the chips if you want. Be extra careful not to cut your fingers while you are slicing the roots."
        }
      ]
    },
    {
      "name":"Cooking Taro Root on the Stove Top",
      "steps":[
        {
          "headline":"Make taro root mash.",
          "description":"Cut 2 lb (0.91 kg) of taro root into 2 in (5.1 cm) pieces. In a mixing bowl, combine the taro root pieces, 2  c (470 mL) of oil, 2 tablespoons (29.6 ml) of minced garlic, and salt or pepper to taste. Mix the ingredients together thoroughly. Spread the root mixture on a lightly-oiled baking sheet. Put it in the oven to roast for 45 minutes, or until golden brown. In a sauce pot, add 1 US-quart (950 ml) heavy cream and ⁄2 lb (0.23 kg) unsalted butter. Heat the sauce pot until the butter has completely melted, stirring it continuously. Remove the sauce pot and pour it into the root mixing bowl. Add the golden brown taro root pieces and mash the two mixtures together until you get the desired consistency."
        },
        {
          "headline":"Boil the taro root for an hour.",
          "description":"Peel the hairy exterior of the root and cut it into smaller pieces with a knife. Put the taro pieces in a pot filled with hot water and put it on the stove on high heat. When the water begins to boil, you can reduce the heat and cover the pot with a lid. Let the taro simmer for about an hour. When it is ready, the boiled flesh of the taro root will be soft to the touch."
        },
        {
          "headline":"Simmer the taro root with sake.",
          "description":"Take 7 medium-sized taro roots and peel them with a knife. Cut off the inedible tips and discard them. Add 1 tablespoon (14.8 ml) of vegetable oil to a pot, then add the whole taro roots and roll them around until they are fully coated with the oil. Stir in 400 mL (1.7  c) of water and 100 mL (0.42  c) of regular sake and increase the heat. When the liquid starts to boil, add 2 tablespoons (29.6 ml) of sugar. Cover the pot with a lid and let it simmer on medium heat for 10 minutes. Then add 2 tablespoons (29.6 ml) of soy sauce and continue simmering for approximately 8 more minutes, or until the sauce has thickened."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Taking the Proper Precautions Avoid eating taro root raw. Taro root can actually be toxic to humans if it is ingested raw. You should always cook taro root completely to avoid any possible side effects from eating the raw root. Always err on the side of caution and overcook the taro root instead of undercooking it. Wear gloves while handling the taro root. Since taro root is toxic in its raw form, it’s important to wear gloves while you are touching the root. This will help prevent any possible reactions to the toxicity of the root. The hairy external skin is also quite irritating to human skin, so the gloves help protect your skin in this respect as well. Clean the taro root well before cooking. Washing food before consumption is always important, but it’s especially important with the taro root because of the toxicity factor. Cleaning the taro root can help remove additional toxins before cooking the root makes the rest fully edible. Peel the taro root with a knife or peeling utensil. Run the peeled taro root under cold water in the sink and use your fingers to wipe away any excess dirt or debris. Cooking Taro Root in the Oven Make taro root fries. Cut off the hairy exterior of the root and slice 1 full taro root into thin pieces – just as you would if you were making regular potato fries. Pour 2 tablespoons (29.6 ml) of canola oil into a frying pan and let it simmer on medium-high heat until it is hot and sizzling. Add your taro slices to the pan and let them cook until the edges become golden brown. Then flip the taro slices and let the other side cook. When they are done, you can drain any excess oil by placing the taro slices on a paper towel. Then season with salt and they are ready to serve! Roast the taro root. Wash 12 small taro roots thoroughly. Place the roots in a steamer for about 10 minutes, or until the flesh is tender. After steaming, let the roots cool before peeling off the hairy outer skin. Place all of the peeled taro roots inside a large Zip-lock bag and add 2 teaspoons of oil, 1 teaspoon of chili powder, and ¼ teaspoon of turmeric powder. Toss the roots inside the Zip-lock bag until all of the roots are coated in the mixture. Scatter roots on a baking sheet with a piece of aluminum foil on top. Broil them for 25 minutes. Remove them when the root surfaces are charred and golden brown. Remember to turn the roots several times while they are in the oven. Make taro root chips. Take 1 lb (0.45 kg) of fresh taro roots and peel them. Carefully slice the taro roots into thin slices lengthwise. Place the slices on a baking sheet lined with parchment paper and lightly coat each slice with olive oil. Put the baking sheet in the oven on 400 °F (204 °C) for 20 minutes, or until the edges are a crispy golden brown. You can sprinkle some additional salt on top of the chips if you want. Be extra careful not to cut your fingers while you are slicing the roots. Cooking Taro Root on the Stove Top Make taro root mash. Cut 2 lb (0.91 kg) of taro root into 2 in (5.1 cm) pieces. In a mixing bowl, combine the taro root pieces, 2  c (470 mL) of oil, 2 tablespoons (29.6 ml) of minced garlic, and salt or pepper to taste. Mix the ingredients together thoroughly. Spread the root mixture on a lightly-oiled baking sheet. Put it in the oven to roast for 45 minutes, or until golden brown. In a sauce pot, add 1 US-quart (950 ml) heavy cream and ⁄2 lb (0.23 kg) unsalted butter. Heat the sauce pot until the butter has completely melted, stirring it continuously. Remove the sauce pot and pour it into the root mixing bowl. Add the golden brown taro root pieces and mash the two mixtures together until you get the desired consistency. Boil the taro root for an hour. Peel the hairy exterior of the root and cut it into smaller pieces with a knife. Put the taro pieces in a pot filled with hot water and put it on the stove on high heat. When the water begins to boil, you can reduce the heat and cover the pot with a lid. Let the taro simmer for about an hour. When it is ready, the boiled flesh of the taro root will be soft to the touch. Simmer the taro root with sake. Take 7 medium-sized taro roots and peel them with a knife. Cut off the inedible tips and discard them. Add 1 tablespoon (14.8 ml) of vegetable oil to a pot, then add the whole taro roots and roll them around until they are fully coated with the oil. Stir in 400 mL (1.7  c) of water and 100 mL (0.42  c) of regular sake and increase the heat. When the liquid starts to boil, add 2 tablespoons (29.6 ml) of sugar. Cover the pot with a lid and let it simmer on medium heat for 10 minutes. Then add 2 tablespoons (29.6 ml) of soy sauce and continue simmering for approximately 8 more minutes, or until the sauce has thickened. Finished. ",
  "tyn_model":[
    "taro root",
    "water",
    "oven",
    "baking sheet",
    "pot",
    "gloves",
    "knife",
    "oil",
    "salt",
    "sauce pot",
    "taro",
    "zip-lock bag",
    "– just",
    "canola oil",
    "frying pan",
    "steamer",
    "chili powder",
    "turmeric powder",
    "aluminum foil",
    "taro root chips",
    "parchment paper",
    "olive oil",
    "mixing bowl",
    "garlic",
    "pepper",
    "heavy cream",
    "unsalted butter",
    "butter",
    "root mixing bowl",
    "stove",
    "sake",
    "vegetable oil",
    "regular sake",
    "sugar",
    "soy sauce"
  ],
  "tyn_section":[

  ]
}