{
  "title":"How to Go Camping with a Plushie",
  "url":"https://www.wikihow.com/Go-Camping-with-a-Plushie",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Traditional Toys",
    "Stuffed Animals"
  ],
  "parts":[
    {
      "name":"Getting Ready",
      "steps":[
        {
          "headline":"Wake up your stuffed animal.",
          "description":"Simply whisper into their ear, \"It's time to wake up! We're going on a trip!\" Say it gently and happily so that your plush pal wakes up feeling happy and refreshed. Maybe shake it very gently if he or she doesn't wake up, but please don't shake your pal too hard! It can scare them and make them not want to come with you."
        },
        {
          "headline":"Eat a hearty and nutritious breakfast together.",
          "description":"Stuffed animals do not like human food! Do not feed them real food or drinks. Give them plastic, clay or rubber food. They love the taste of those materials. Make sure you both eat healthy food, because you will need energy and strength for the big journey ahead."
        },
        {
          "headline":"Get dressed together.",
          "description":"If your stuffed animal doesn't wear clothes, skip this step. Help your stuffed animal get out of their old clothes and into their new ones. Make sure that both of your clothes are suitable for the weather! You do not want to wear shorts and a tank top in the snowy mountains, or a heavy winter coat to the beach."
        },
        {
          "headline":"Pack both of your bags.",
          "description":"Go through your checklist together. You can pack a seperate bag for your stuffed animal, or let your pal use yours. You should pack:\nExtra outfits\nFood\nWater\nMatches (Be extremely cautious with these.) Hats (In case it gets cold)\nSunglasses (In case it gets sunny)\nTent\nSleeping bags\nYour cellphone\nFavorite book or toy\nCoat or jacket\nSunscreen (If where you are going is hot)\nAnything else you feel you need"
        },
        {
          "headline":"Check your bags.",
          "description":"Did you pack everything? Did you pack a little too much? You want to make sure that your bags are perfect."
        }
      ]
    },
    {
      "name":"Going On The Trip",
      "steps":[
        {
          "headline":"Tell your plushie how you will get there.",
          "description":"Train? Bus? Car? Airplane? Maybe you're going on foot! This way, they know and they don't get surprised."
        },
        {
          "headline":"Get seated onto your vehicle if you're using one.",
          "description":"Pick your seat wisely, and always keep your stuffed pal on your lap or in your bag. Keep them in a bag with lots of space to breathe. Think about how you would feel if you were stuck in cramped a bag or box with barely any air!"
        },
        {
          "headline":"If you're walking, put your stuffed animal into your bag with entertainment, bedding and food.",
          "description":"Bedding means anything soft and comfy, so that your stuffed animal does not get hurt."
        },
        {
          "headline":"If you're on a plane, comfort your pal through takeoff.",
          "description":"If your stuffed animal has been on a plane before, this should be much easier."
        },
        {
          "headline":"Always know what your stuffed animal is doing and where they are.",
          "description":"You don't want your best buddy to get into danger or get lost, do you? Absolutely not!"
        },
        {
          "headline":"Comfort them when it gets dark, if they're scared.",
          "description":"If they're not, you can skip this step."
        },
        {
          "headline":"If you're on a vehicle, sleep safely together.",
          "description":"Don't sleep in a way where either of you are in danger of falling down or getting hurt."
        }
      ]
    },
    {
      "name":"Arrival",
      "steps":[
        {
          "headline":"Tell your plushie that you have arrived.",
          "description":"Something like \"We're here!\" or \"Look, we're here! Let's go!\" is great!"
        },
        {
          "headline":"Find where you are going to have your tent.",
          "description":"It's not camping without a tent."
        },
        {
          "headline":"Set up your tent.",
          "description":"Put it up and set your sleeping bags inside."
        },
        {
          "headline":"Go on adventures together.",
          "description":"Take a walk, go bird watching, climb up a mountain. (Please be very careful when climbing up a mountain. You don't want you or anyone else to get hurt.) the possibilities are endless!"
        },
        {
          "headline":"Enjoy your time with the plushie.",
          "description":"Don't forget to take pictures!"
        }
      ]
    }
  ],
  "text":" Getting Ready Wake up your stuffed animal. Simply whisper into their ear, \"It's time to wake up! We're going on a trip!\" Say it gently and happily so that your plush pal wakes up feeling happy and refreshed. Maybe shake it very gently if he or she doesn't wake up, but please don't shake your pal too hard! It can scare them and make them not want to come with you. Eat a hearty and nutritious breakfast together. Stuffed animals do not like human food! Do not feed them real food or drinks. Give them plastic, clay or rubber food. They love the taste of those materials. Make sure you both eat healthy food, because you will need energy and strength for the big journey ahead. Get dressed together. If your stuffed animal doesn't wear clothes, skip this step. Help your stuffed animal get out of their old clothes and into their new ones. Make sure that both of your clothes are suitable for the weather! You do not want to wear shorts and a tank top in the snowy mountains, or a heavy winter coat to the beach. Pack both of your bags. Go through your checklist together. You can pack a seperate bag for your stuffed animal, or let your pal use yours. You should pack:\nExtra outfits\nFood\nWater\nMatches (Be extremely cautious with these.) Hats (In case it gets cold)\nSunglasses (In case it gets sunny)\nTent\nSleeping bags\nYour cellphone\nFavorite book or toy\nCoat or jacket\nSunscreen (If where you are going is hot)\nAnything else you feel you need Check your bags. Did you pack everything? Did you pack a little too much? You want to make sure that your bags are perfect. Going On The Trip Tell your plushie how you will get there. Train? Bus? Car? Airplane? Maybe you're going on foot! This way, they know and they don't get surprised. Get seated onto your vehicle if you're using one. Pick your seat wisely, and always keep your stuffed pal on your lap or in your bag. Keep them in a bag with lots of space to breathe. Think about how you would feel if you were stuck in cramped a bag or box with barely any air! If you're walking, put your stuffed animal into your bag with entertainment, bedding and food. Bedding means anything soft and comfy, so that your stuffed animal does not get hurt. If you're on a plane, comfort your pal through takeoff. If your stuffed animal has been on a plane before, this should be much easier. Always know what your stuffed animal is doing and where they are. You don't want your best buddy to get into danger or get lost, do you? Absolutely not! Comfort them when it gets dark, if they're scared. If they're not, you can skip this step. If you're on a vehicle, sleep safely together. Don't sleep in a way where either of you are in danger of falling down or getting hurt. Arrival Tell your plushie that you have arrived. Something like \"We're here!\" or \"Look, we're here! Let's go!\" is great! Find where you are going to have your tent. It's not camping without a tent. Set up your tent. Put it up and set your sleeping bags inside. Go on adventures together. Take a walk, go bird watching, climb up a mountain. (Please be very careful when climbing up a mountain. You don't want you or anyone else to get hurt.) the possibilities are endless! Enjoy your time with the plushie. Don't forget to take pictures!",
  "tyn_model":[
    "tent",
    "food",
    "water",
    "matches",
    "hats",
    "sunglasses",
    "coat",
    "sunscreen",
    "sleeping bags"
  ],
  "tyn_section":[

  ]
}