{
  "title":"How to Replace a Keurig Water Filter",
  "url":"https://www.wikihow.com/Replace-a-Keurig-Water-Filter",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Removing the Old Filter",
      "steps":[
        {
          "headline":"Remove the top of the Keurig water reservoir.",
          "description":"In most Keurig models, the water reservoir is located on the left-hand side of the machine. Fully removing the reservoir's top will give you access to the water filter. You can change the filter if there is water in the reservoir, or if the reservoir is empty."
        },
        {
          "headline":"Pull out the filter unit.",
          "description":"The handle portion of the upper filter holder will be sticking up in the water reservoir. Grasp the handle firmly, and pull it out of the reservoir. The bottom of the filter-holder unit will be locked into plastic grooves on the bottom of the water reservoir. You may need to rock the filter-holder unit back in place or give it a sharp tug to remove it. If you have a Classic series Keurig, your filter will be black with a circular timer on the end. If you have a K200 Plus, the filter will be clear and shorter, while the K300 and higher models have filters that are tall, thin, and clear."
        },
        {
          "headline":"Open the filter holder and discard the used filter.",
          "description":"Use your thumb and index finger to pinch in the tabs at the bottom of the filter unit. Pull down to release the lower filter holder, then pull out the old filter. The old filter can be thrown away in your kitchen trash can."
        }
      ]
    },
    {
      "name":"Installing the New Filter",
      "steps":[
        {
          "headline":"Purchase a new Keurig filter package.",
          "description":"Keurig water filters are not sold individually, so you'll need to buy a set. They're commonly sold in groups of 6 or 12. You can find Keurig filters sold in the same stores that sell Keurig machines. Check any business or department stores that sell housewares, including Bed Bath and Beyond, Sears, Target, and larger grocery stores. If you'd rather shop online, Keurig filters are sold through major retailers like Amazon and Walmart. Also check the websites of business that stock housewares. Filter sets are relatively inexpensive. Depending on the number of individual filters in a package, the cost can range between $5 and $10."
        },
        {
          "headline":"Soak the filter in water for 5 to 10 minutes.",
          "description":"Before you install the new filter in your Keurig and make the first cup of coffee, the filter needs to soak and absorb water. Fill a cup or bowl partway with water, and drop the filter in. Make sure that the filter is completely submerged while it's soaking. The filter will float initially, but will have absorbed water and sunk to the bottom of the cup or bowl after 10 minutes."
        },
        {
          "headline":"Rinse the filter.",
          "description":"For best results, rinse the filter off with tap water after it has finished soaking. Keep the tap water on a medium flow, and rinse the filter for a full 60 seconds."
        },
        {
          "headline":"Rinse the lower filter holder.",
          "description":"The lower filter holder will have a thin mesh layer on its bottom side. Rinse this off with tap water to remove any dirt or impurities that may have built up during normal use. Give the sides of the lower filter holder a quick rinse too."
        },
        {
          "headline":"Replace the filter in the filter-housing unit.",
          "description":"Slide the new filter into the filter holder, with its rounded top-side facing up. Set the lower filter holder in place below it. The mesh bottom of the lower filter holder should cover up the flat bottom of the fabric filter. Snap the 2 sides of the filter holder in place around the filter."
        },
        {
          "headline":"Turn the replacement dial ahead 2 months.",
          "description":"The replacement dial is located on top of the handle of the filter replacement unit. It's about the size of your thumb, and will list numbers 1–12 (each of which stands for the corresponding month). Twist the dial clockwise until the indicator points to the month 2 ahead of the current month. So, if it's currently October (month 10), set the replacement dial to 12 (December). The Keurig will use this setting to trigger its electronic reminder in 2 months. However, you need to set the reminder manually."
        },
        {
          "headline":"Set the Keurig to remind you about the next filter change.",
          "description":"Your Keurig has a setting which enables it to alert you to change the water filter every 2 months. If you've correctly turned the replacement dial 2 months ahead, you can turn on the reminder through the electronic menu. Navigate to “Settings,” and select “Water Filter Reminder.” Select “Enable.”\nBased on the specific model and generation of your Keurig machine, its menu may slightly differ. Older models (prior to Keurig 2.0) may not have the electronic reminder function."
        },
        {
          "headline":"Insert the water filter unit into the Keurig reservoir.",
          "description":"Once you've reassembled the filter unit, put the unit back into the Keurig's water filter. The external side of the lower filter holder will snap into place when pressed down firmly into the bottom of the reservoir. If the filter doesn't click into place, check to see that you've properly aligned the grooves on the bottom of the lower filter holder with the raised plastic on the floor of the Keurig's water reservoir."
        }
      ]
    }
  ],
  "text":" Removing the Old Filter Remove the top of the Keurig water reservoir. In most Keurig models, the water reservoir is located on the left-hand side of the machine. Fully removing the reservoir's top will give you access to the water filter. You can change the filter if there is water in the reservoir, or if the reservoir is empty. Pull out the filter unit. The handle portion of the upper filter holder will be sticking up in the water reservoir. Grasp the handle firmly, and pull it out of the reservoir. The bottom of the filter-holder unit will be locked into plastic grooves on the bottom of the water reservoir. You may need to rock the filter-holder unit back in place or give it a sharp tug to remove it. If you have a Classic series Keurig, your filter will be black with a circular timer on the end. If you have a K200 Plus, the filter will be clear and shorter, while the K300 and higher models have filters that are tall, thin, and clear. Open the filter holder and discard the used filter. Use your thumb and index finger to pinch in the tabs at the bottom of the filter unit. Pull down to release the lower filter holder, then pull out the old filter. The old filter can be thrown away in your kitchen trash can. Installing the New Filter Purchase a new Keurig filter package. Keurig water filters are not sold individually, so you'll need to buy a set. They're commonly sold in groups of 6 or 12. You can find Keurig filters sold in the same stores that sell Keurig machines. Check any business or department stores that sell housewares, including Bed Bath and Beyond, Sears, Target, and larger grocery stores. If you'd rather shop online, Keurig filters are sold through major retailers like Amazon and Walmart. Also check the websites of business that stock housewares. Filter sets are relatively inexpensive. Depending on the number of individual filters in a package, the cost can range between $5 and $10. Soak the filter in water for 5 to 10 minutes. Before you install the new filter in your Keurig and make the first cup of coffee, the filter needs to soak and absorb water. Fill a cup or bowl partway with water, and drop the filter in. Make sure that the filter is completely submerged while it's soaking. The filter will float initially, but will have absorbed water and sunk to the bottom of the cup or bowl after 10 minutes. Rinse the filter. For best results, rinse the filter off with tap water after it has finished soaking. Keep the tap water on a medium flow, and rinse the filter for a full 60 seconds. Rinse the lower filter holder. The lower filter holder will have a thin mesh layer on its bottom side. Rinse this off with tap water to remove any dirt or impurities that may have built up during normal use. Give the sides of the lower filter holder a quick rinse too. Replace the filter in the filter-housing unit. Slide the new filter into the filter holder, with its rounded top-side facing up. Set the lower filter holder in place below it. The mesh bottom of the lower filter holder should cover up the flat bottom of the fabric filter. Snap the 2 sides of the filter holder in place around the filter. Turn the replacement dial ahead 2 months. The replacement dial is located on top of the handle of the filter replacement unit. It's about the size of your thumb, and will list numbers 1–12 (each of which stands for the corresponding month). Twist the dial clockwise until the indicator points to the month 2 ahead of the current month. So, if it's currently October (month 10), set the replacement dial to 12 (December). The Keurig will use this setting to trigger its electronic reminder in 2 months. However, you need to set the reminder manually. Set the Keurig to remind you about the next filter change. Your Keurig has a setting which enables it to alert you to change the water filter every 2 months. If you've correctly turned the replacement dial 2 months ahead, you can turn on the reminder through the electronic menu. Navigate to “Settings,” and select “Water Filter Reminder.” Select “Enable.”\nBased on the specific model and generation of your Keurig machine, its menu may slightly differ. Older models (prior to Keurig 2.0) may not have the electronic reminder function. Insert the water filter unit into the Keurig reservoir. Once you've reassembled the filter unit, put the unit back into the Keurig's water filter. The external side of the lower filter holder will snap into place when pressed down firmly into the bottom of the reservoir. If the filter doesn't click into place, check to see that you've properly aligned the grooves on the bottom of the lower filter holder with the raised plastic on the floor of the Keurig's water reservoir.",
  "tyn_model":[
    "water",
    "keurig",
    "water filter",
    "tap water",
    "keurig water",
    "filter",
    "filters",
    "filter holder",
    "filter-holder",
    "keurig filter",
    "keurig machines",
    "keurig filters",
    "bowl",
    "filter-housing",
    "fabric filter",
    "“settings",
    "” and",
    "“water",
    "” select",
    "“enable",
    "”\n"
  ],
  "tyn_section":[

  ]
}