{
  "title":"How to Make Sapin Sapin",
  "url":"https://www.wikihow.com/Make-Sapin-Sapin",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Philippine Dishes"
  ],
  "steps":[
    {
      "headline":"Prepare your ingredients.",
      "description":"Gather all your ingredients. Due to the nature of the dessert, the ingredients are likely going to be troublesome to find, however, the glutinous rice flour, coconut milk, jackfruit, and ube can all be found in an Asian market. The last three aforementioned ingredients can usually be found canned, or in a jar."
    },
    {
      "headline":"Mix your glutinous rice flour and sugar.",
      "description":"Using a whisk, combine the glutinous rice flour and sugar in a mixing bowl."
    },
    {
      "headline":"Add the milk products and vanilla extract.",
      "description":"Add the 7 oz of condensed milk, 4 cups of coconut milk, and vanilla extract to the mixing bowl. Continue to mix both wet and dry ingredients till the mixture is smooth and there are no clumps."
    },
    {
      "headline":"Split the mix into thirds.",
      "description":"Pour the mix into three equal portions in different mixing bowls. These three different portions will eventually become the three layers of our Filipino dessert."
    },
    {
      "headline":"Add your pureed ube to the first mixing bowl.",
      "description":"This mix will be our top layer. The ube is what gives the top layer the purple color. The syrup in the can also help give the mixture its purple color."
    },
    {
      "headline":"Add the jackfruit to the second mixing bowl.",
      "description":"Using a blender, puree the jackfruit until smooth. This second bowl will be the bottom layer of the Sapin Sapin. The jackfruit and its syrup will give the third layer its yellow color."
    },
    {
      "headline":"Prepare your steamer.",
      "description":"Fill the base of the steamer with water and cover with a mesh or perforated lid. Apply high heat to boil."
    },
    {
      "headline":"Grease your pan.",
      "description":"Using a brush, lightly cover the bottom of the baking pan with the cooking oil."
    },
    {
      "headline":"Begin steaming the first layer.",
      "description":"Take the violet mixture and pour it into the baking pan. Pick up the baking pan and drop it a minimum of three times. This is done to ensure there are no pockets of air within the mixture, and that it properly settles. Wrap the steamer's lid with a cloth to prevent water from collecting on top of the mixture. Steam the first layer for approximately 15 minutes."
    },
    {
      "headline":"Begin steaming the second layer.",
      "description":"Take the pan out of the steamer. Slowly pour the white layer, evenly covering the purple layer of the Sapin Sapin. Use a rubber spatula to ensure the layer is smooth and evenly distributed. Replace the cloth covered lid above the second layer. Place pan back into steamer and steam for another 15 minutes."
    },
    {
      "headline":"Steam the third layer.",
      "description":"Remove the pan from the steamer. Add a sufficient amount of water to the steamer to replace the amount lost. Pour in the final layer atop the white layer, ensuring you evenly distribute the mixture. Pick up the pan and drop, repeat 3 times to ensure no air bubbles are in the mix. Finish the layer by smoothing the top with a rubber spatula. Replace the cloth covered lid above the top layer. Place pan back into steamer and steam for 20 minutes."
    },
    {
      "headline":"Final Prep.",
      "description":"Cover the top of a cake stand with a sufficient amount of wax paper. Remove the pan from the steamer and place upside down onto the covered cake stand. Allow the Sapin Sapin to fall on the stand and remove the pan."
    },
    {
      "headline":"Reduce the coconut cream to make Latik.",
      "description":"Pour the remaining ½ cup of coconut cream into a saucepan and reduce the milk. Reduce till the color becomes golden brown and you are left with flakes and oil."
    },
    {
      "headline":"Garnish with Latik.",
      "description":"Garnish the top of the Sapin Sapin with the golden brown flakes, which is called Latik."
    },
    {
      "headline":"Serve.",
      "description":"Cut your dessert, and serve!"
    }
  ],
  "text":" Prepare your ingredients. Gather all your ingredients. Due to the nature of the dessert, the ingredients are likely going to be troublesome to find, however, the glutinous rice flour, coconut milk, jackfruit, and ube can all be found in an Asian market. The last three aforementioned ingredients can usually be found canned, or in a jar. Mix your glutinous rice flour and sugar. Using a whisk, combine the glutinous rice flour and sugar in a mixing bowl. Add the milk products and vanilla extract. Add the 7 oz of condensed milk, 4 cups of coconut milk, and vanilla extract to the mixing bowl. Continue to mix both wet and dry ingredients till the mixture is smooth and there are no clumps. Split the mix into thirds. Pour the mix into three equal portions in different mixing bowls. These three different portions will eventually become the three layers of our Filipino dessert. Add your pureed ube to the first mixing bowl. This mix will be our top layer. The ube is what gives the top layer the purple color. The syrup in the can also help give the mixture its purple color. Add the jackfruit to the second mixing bowl. Using a blender, puree the jackfruit until smooth. This second bowl will be the bottom layer of the Sapin Sapin. The jackfruit and its syrup will give the third layer its yellow color. Prepare your steamer. Fill the base of the steamer with water and cover with a mesh or perforated lid. Apply high heat to boil. Grease your pan. Using a brush, lightly cover the bottom of the baking pan with the cooking oil. Begin steaming the first layer. Take the violet mixture and pour it into the baking pan. Pick up the baking pan and drop it a minimum of three times. This is done to ensure there are no pockets of air within the mixture, and that it properly settles. Wrap the steamer's lid with a cloth to prevent water from collecting on top of the mixture. Steam the first layer for approximately 15 minutes. Begin steaming the second layer. Take the pan out of the steamer. Slowly pour the white layer, evenly covering the purple layer of the Sapin Sapin. Use a rubber spatula to ensure the layer is smooth and evenly distributed. Replace the cloth covered lid above the second layer. Place pan back into steamer and steam for another 15 minutes. Steam the third layer. Remove the pan from the steamer. Add a sufficient amount of water to the steamer to replace the amount lost. Pour in the final layer atop the white layer, ensuring you evenly distribute the mixture. Pick up the pan and drop, repeat 3 times to ensure no air bubbles are in the mix. Finish the layer by smoothing the top with a rubber spatula. Replace the cloth covered lid above the top layer. Place pan back into steamer and steam for 20 minutes. Final Prep. Cover the top of a cake stand with a sufficient amount of wax paper. Remove the pan from the steamer and place upside down onto the covered cake stand. Allow the Sapin Sapin to fall on the stand and remove the pan. Reduce the coconut cream to make Latik. Pour the remaining ½ cup of coconut cream into a saucepan and reduce the milk. Reduce till the color becomes golden brown and you are left with flakes and oil. Garnish with Latik. Garnish the top of the Sapin Sapin with the golden brown flakes, which is called Latik. Serve. Cut your dessert, and serve!",
  "tyn_model":[
    "steamer",
    "pan",
    "mixing bowl",
    "glutinous rice flour",
    "water",
    "baking pan",
    "coconut milk",
    "sugar",
    "vanilla extract",
    "sapin sapin",
    "rubber spatula",
    "cake stand",
    "coconut cream",
    "whisk",
    "milk products",
    "condensed milk",
    "mixing bowls",
    "ube",
    "syrup",
    "jackfruit",
    "blender",
    "cooking oil",
    "cloth",
    "wax paper",
    "saucepan",
    "milk",
    "oil"
  ],
  "tyn_section":[

  ]
}