{
  "title":"How to Make a Fruit Smoothie for Breakfast",
  "url":"https://www.wikihow.com/Make-a-Fruit-Smoothie-for-Breakfast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Smoothies"
  ],
  "steps":[
    {
      "headline":"Start with a clean, variable powered blender.",
      "description":""
    },
    {
      "headline":"Start with your liquids.",
      "description":"Pour 4 ounces each of either purple grape juice or Acai juice into the blender. Add the ice with the fruit if your fruit is room temperature. If the fruit is chilled, you may not need the ice. If you do, add half. If the fruit is from the freezer, you don't need ice."
    },
    {
      "headline":"Add one quartered banana.",
      "description":"This should be about 4 ounces."
    },
    {
      "headline":"Put in 4 ounces each of the other 3 fruits of your choice.",
      "description":""
    },
    {
      "headline":"Start the blender on the slowest speed and let it run for about 30 seconds.",
      "description":""
    },
    {
      "headline":"Increase the speed, gradually, until you can see a good vortex forming on the top of the mix.",
      "description":"Don't go too much. The mix will inhale a gulp of air and stall the blades. If it does, stop, let it \"burp\", and start again."
    },
    {
      "headline":"Let it run for one minute once it gets smooth enough to hold the vortex.",
      "description":""
    },
    {
      "headline":"Increase the speed just until the vortex creates a small hole in the center without closing.",
      "description":"This is when you stop and add the yogurt, if you want to use it. Add the yogurt, and mix it in with a spoon or stiffer. Slowly start the blender on slow and let the yogurt incorporate, then increase it to the point where the small hole appears in the vortex. Hold it here for another 30 seconds to homogenize into a smooth, creamy smoothie."
    },
    {
      "headline":"Pour into your glasses and garnish as desired.",
      "description":"Makes 2 12oz. smoothies."
    }
  ],
  "text":" Start with a clean, variable powered blender.  Start with your liquids. Pour 4 ounces each of either purple grape juice or Acai juice into the blender. Add the ice with the fruit if your fruit is room temperature. If the fruit is chilled, you may not need the ice. If you do, add half. If the fruit is from the freezer, you don't need ice. Add one quartered banana. This should be about 4 ounces. Put in 4 ounces each of the other 3 fruits of your choice.  Start the blender on the slowest speed and let it run for about 30 seconds.  Increase the speed, gradually, until you can see a good vortex forming on the top of the mix. Don't go too much. The mix will inhale a gulp of air and stall the blades. If it does, stop, let it \"burp\", and start again. Let it run for one minute once it gets smooth enough to hold the vortex.  Increase the speed just until the vortex creates a small hole in the center without closing. This is when you stop and add the yogurt, if you want to use it. Add the yogurt, and mix it in with a spoon or stiffer. Slowly start the blender on slow and let the yogurt incorporate, then increase it to the point where the small hole appears in the vortex. Hold it here for another 30 seconds to homogenize into a smooth, creamy smoothie. Pour into your glasses and garnish as desired. Makes 2 12oz. smoothies.",
  "tyn_model":[
    "blender",
    "ice",
    "yogurt",
    "grape juice",
    "acai juice",
    "banana",
    "spoon"
  ],
  "tyn_section":[

  ]
}