{
  "title":"How to Order Italian Food",
  "url":"https://www.wikihow.com/Order-Italian-Food",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine",
    "Italian Cuisine"
  ],
  "methods":[
    {
      "name":"Ordering Your Courses",
      "steps":[
        {
          "headline":"Ask for bottled water and/or wine by the glass or bottle to drink.",
          "description":"At meals, it’s most common to order water and/or wine to drink. Most Italian restaurants have both flat and sparkling bottled water, but not tap water. They’ll probably have red, white, and sparkling wines available for you to choose from. When eating at a restaurant in Italy, the server will likely ask you, “Da bere?” which means “To drink?” Answer with something like, “un litro di aqua naturale,” which means “a liter of flat water."
        },
        {
          "headline":"Start with “antipasti.” In Italian, “antipasta” means “before the meal.” This is similar to an appetizer and often includes cured meats, cured cheeses, fried vegetables, olives, or toasted bread with tomatoes (“bruschetta”).",
          "description":"Order antipasti before any other courses. Once you’ve decided on an appetizer at a restaurant in Italy, the server may ask, “Che facciamo?” meaning, “What are we making?” Respond with something like, “Per antipasto facciamo un carpaccio.” This means, “For an appetizer, let’s make a carpaccio.”"
        },
        {
          "headline":"Order your first course, or “primo,” of pasta.",
          "description":"Next, choose a pasta, risotto, or soup from the “Primo” section of the menu. There will likely be many different pasta dishes to choose from that come in a variety of shapes and are served with a variety of sauces. In Italy, the server may say, “Per primo?” meaning “For your first course?” to which you can reply something like, “Per primo facciamo spaghetti alla carbonara.”"
        },
        {
          "headline":"Order your second course, or “secondo” of meat.",
          "description":"After pasta, you’ll most likely order red meat, poultry, or fish as the second course. The second course typically doesn’t come with any sides. Choose a meat from the “Secondo” section of the menu. If eating in Italy, your server may ask, “Per secondo?” which means “For the second course?” You may say something like, “Per secondo facciamo, una bistecca alla fiorentina.”"
        },
        {
          "headline":"Ask for a side dish, or “contorni.” Following the second course, you’ll be served a side dish of your choice, often served with a salad.",
          "description":"At this point, order vegetables, potatoes, or any other side listed on the menu. A server in a restaurant in Italy may get your side dish course by asking, “Salata, contorno?” which means, “Salad, side dish?” In response, say “Si grazie, un insalata e patatine fritte.” This means, “Yes please, a salad and french fries.”"
        },
        {
          "headline":"Ask for a dessert, or “dolchi.” You’ll probably be offered dessert at this point in your meal.",
          "description":"This is often a fruit selection, but tiramisu and/or other sweet treats may also be on the menu. Make your selection and tell the server what you want. If you’re in Italy, the server will likely say, “Poi un dolche?” to which you can reply, “Si, un tiramisù.”"
        },
        {
          "headline":"Drink your “caffè” last.",
          "description":"If you want coffee after your meal, there are a few different ways you can have it prepared for you. Either order a “normale,” which is an espresso shot, or a “macchiato,” which means coffee with a drop of milk. You can also order a “lungo,” meaning “long” coffee, which is similar to a normale but is brewed with twice as much water, making it bigger and more diluted than an espresso shot."
        },
        {
          "headline":"Order “digestivi” to help you digest your meal.",
          "description":"“Digestivi” is a beverage that typically contains liquor and fruit juice. Order and drink it after your last course if you want to do like the Italians do and settle your stomach."
        }
      ]
    },
    {
      "name":"Pronouncing Words Correctly",
      "steps":[
        {
          "headline":"Say “brews-keh-tah” when you want Bruschetta.",
          "description":"Many make the mistake of pronouncing bruschetta like “brewshhetta.” However, “ch” in Italian sounds like a hard “k.” If you’re ordering bruschetta as your antipasto, remember to enunciate that hard “k.”"
        },
        {
          "headline":"Pronounce gnocchi like “nyoh-kee.” Sometimes people think that gnocchi is pronounced like “nookie.” While it’s true that the “g” is silent, this isn’t quite right.",
          "description":"Say “nyoh-kee” if you decide to order these potato dumplings as your primo."
        },
        {
          "headline":"Say “mean-ehs-tron-ih” when ordering minestrone.",
          "description":"Instead of saying “minestron-ee,” pronounce this word with a softer emphasis on the last “e.” There are no silent vowels on the end of Italian words, but this doesn’t mean that they’re harsh-sounding."
        },
        {
          "headline":"Order a “marg-eh-rita” pizza, not a margarita pizza.",
          "description":"While the spelling of this Italian pizza is the same as an alcoholic beverage you may be familiar with, their pronunciations are a little different. Don’t include the “r” in the second syllable if you choose to order a margarita pizza."
        },
        {
          "headline":"Pronounce every syllable when you aren’t sure.",
          "description":"As a good rule of thumb, it’s best to pronounce every syllable of each Italian word if you have no idea how to say it. This will increase your chances of saying it correctly and/or being understood."
        }
      ]
    },
    {
      "name":"Blending in with Italian Culture",
      "steps":[
        {
          "headline":"Head to meals later in the day if you’re in Italy.",
          "description":"In Italy, it’s normal to go to lunch around 1:00 in the afternoon and dinner around 8:00 in the evening. If you’re wanting to truly blend into the culture, don’t arrive at the restaurant any earlier than these times. Keep in mind that most Italian restaurants close between lunch and dinner."
        },
        {
          "headline":"Order 2 courses in Italy.",
          "description":"If you order every single course option, you’ll likely have way too much food to eat. It is completely normal in Italy to choose 2 or so different courses to order and to pass on the rest. Keep in mind that the portions for each course are smaller than in the United States."
        },
        {
          "headline":"Ask for “il conto” when you’re ready to pay at a restaurant in Italy.",
          "description":"In Italian culture, it’s seen as rude to drop off the check when it isn’t asked for. Make sure to ask for the check when you want it. In Italy, it’s appropriate to subtly raise a hand, make eye contact with your server, and say, “Il conte per favore.” This means, “The check, please.”"
        },
        {
          "headline":"Don’t tip your server if you’re dining in Italy.",
          "description":"In Italy, tipping the server is unnecessary and gratuity will never be added to your bill. In most instances, you’ll stand out as a foreigner If you tip the server. However, if you’re at a nice restaurant and you feel like you’ve been treated extremely well, consider tipping 10%. It’s socially acceptable and recommended that you tip 18-20% at restaurants in the United States, whether or not they’re Italian."
        }
      ]
    }
  ],
  "text":" Ordering Your Courses Ask for bottled water and/or wine by the glass or bottle to drink. At meals, it’s most common to order water and/or wine to drink. Most Italian restaurants have both flat and sparkling bottled water, but not tap water. They’ll probably have red, white, and sparkling wines available for you to choose from. When eating at a restaurant in Italy, the server will likely ask you, “Da bere?” which means “To drink?” Answer with something like, “un litro di aqua naturale,” which means “a liter of flat water. Start with “antipasti.” In Italian, “antipasta” means “before the meal.” This is similar to an appetizer and often includes cured meats, cured cheeses, fried vegetables, olives, or toasted bread with tomatoes (“bruschetta”). Order antipasti before any other courses. Once you’ve decided on an appetizer at a restaurant in Italy, the server may ask, “Che facciamo?” meaning, “What are we making?” Respond with something like, “Per antipasto facciamo un carpaccio.” This means, “For an appetizer, let’s make a carpaccio.” Order your first course, or “primo,” of pasta. Next, choose a pasta, risotto, or soup from the “Primo” section of the menu. There will likely be many different pasta dishes to choose from that come in a variety of shapes and are served with a variety of sauces. In Italy, the server may say, “Per primo?” meaning “For your first course?” to which you can reply something like, “Per primo facciamo spaghetti alla carbonara.” Order your second course, or “secondo” of meat. After pasta, you’ll most likely order red meat, poultry, or fish as the second course. The second course typically doesn’t come with any sides. Choose a meat from the “Secondo” section of the menu. If eating in Italy, your server may ask, “Per secondo?” which means “For the second course?” You may say something like, “Per secondo facciamo, una bistecca alla fiorentina.” Ask for a side dish, or “contorni.” Following the second course, you’ll be served a side dish of your choice, often served with a salad. At this point, order vegetables, potatoes, or any other side listed on the menu. A server in a restaurant in Italy may get your side dish course by asking, “Salata, contorno?” which means, “Salad, side dish?” In response, say “Si grazie, un insalata e patatine fritte.” This means, “Yes please, a salad and french fries.” Ask for a dessert, or “dolchi.” You’ll probably be offered dessert at this point in your meal. This is often a fruit selection, but tiramisu and/or other sweet treats may also be on the menu. Make your selection and tell the server what you want. If you’re in Italy, the server will likely say, “Poi un dolche?” to which you can reply, “Si, un tiramisù.” Drink your “caffè” last. If you want coffee after your meal, there are a few different ways you can have it prepared for you. Either order a “normale,” which is an espresso shot, or a “macchiato,” which means coffee with a drop of milk. You can also order a “lungo,” meaning “long” coffee, which is similar to a normale but is brewed with twice as much water, making it bigger and more diluted than an espresso shot. Order “digestivi” to help you digest your meal. “Digestivi” is a beverage that typically contains liquor and fruit juice. Order and drink it after your last course if you want to do like the Italians do and settle your stomach. Pronouncing Words Correctly Say “brews-keh-tah” when you want Bruschetta. Many make the mistake of pronouncing bruschetta like “brewshhetta.” However, “ch” in Italian sounds like a hard “k.” If you’re ordering bruschetta as your antipasto, remember to enunciate that hard “k.” Pronounce gnocchi like “nyoh-kee.” Sometimes people think that gnocchi is pronounced like “nookie.” While it’s true that the “g” is silent, this isn’t quite right. Say “nyoh-kee” if you decide to order these potato dumplings as your primo. Say “mean-ehs-tron-ih” when ordering minestrone. Instead of saying “minestron-ee,” pronounce this word with a softer emphasis on the last “e.” There are no silent vowels on the end of Italian words, but this doesn’t mean that they’re harsh-sounding. Order a “marg-eh-rita” pizza, not a margarita pizza. While the spelling of this Italian pizza is the same as an alcoholic beverage you may be familiar with, their pronunciations are a little different. Don’t include the “r” in the second syllable if you choose to order a margarita pizza. Pronounce every syllable when you aren’t sure. As a good rule of thumb, it’s best to pronounce every syllable of each Italian word if you have no idea how to say it. This will increase your chances of saying it correctly and/or being understood. Blending in with Italian Culture Head to meals later in the day if you’re in Italy. In Italy, it’s normal to go to lunch around 1:00 in the afternoon and dinner around 8:00 in the evening. If you’re wanting to truly blend into the culture, don’t arrive at the restaurant any earlier than these times. Keep in mind that most Italian restaurants close between lunch and dinner. Order 2 courses in Italy. If you order every single course option, you’ll likely have way too much food to eat. It is completely normal in Italy to choose 2 or so different courses to order and to pass on the rest. Keep in mind that the portions for each course are smaller than in the United States. Ask for “il conto” when you’re ready to pay at a restaurant in Italy. In Italian culture, it’s seen as rude to drop off the check when it isn’t asked for. Make sure to ask for the check when you want it. In Italy, it’s appropriate to subtly raise a hand, make eye contact with your server, and say, “Il conte per favore.” This means, “The check, please.” Don’t tip your server if you’re dining in Italy. In Italy, tipping the server is unnecessary and gratuity will never be added to your bill. In most instances, you’ll stand out as a foreigner If you tip the server. However, if you’re at a nice restaurant and you feel like you’ve been treated extremely well, consider tipping 10%. It’s socially acceptable and recommended that you tip 18-20% at restaurants in the United States, whether or not they’re Italian.",
  "tyn_model":[
    "” which",
    "“per",
    "” in",
    "” this",
    "” meaning",
    "“for",
    "pasta",
    "” to",
    "” when",
    "bruschetta",
    "bottled water",
    "wine",
    "water",
    "vegetables",
    "” order",
    "“primo",
    "” of",
    "” section",
    "“secondo",
    "meat",
    "” you",
    "” ask",
    "salad",
    "“si",
    "dessert",
    "“digestivi",
    "” is",
    "“k.",
    "” if",
    "” pronounce",
    "gnocchi",
    "“nyoh",
    "“il",
    "tap water",
    "sparkling wines",
    "“da",
    "“to",
    "” answer",
    "“un",
    "“a",
    "flat water",
    "“antipasti",
    "“antipasta",
    "” means",
    "“before",
    "olives",
    "“bruschetta",
    "”)",
    "antipasti",
    "“che",
    "“what",
    "” respond",
    "risotto",
    "soup",
    "sauces",
    "spaghetti",
    "poultry",
    "fish",
    "“contorni",
    "” following",
    "potatoes",
    "“salata",
    "“salad",
    "“yes",
    "french fries",
    "“dolchi",
    "“poi",
    "” drink",
    "“caffè",
    "” last",
    "coffee",
    "“normale",
    "“macchiato",
    "milk",
    "“lungo",
    "“long",
    "” coffee",
    "liquor",
    "“brews",
    "“brewshhetta",
    "” however",
    "“ch",
    "” sometimes",
    "“nookie",
    "” while",
    "“g",
    "“mean",
    "minestrone",
    "“minestron",
    "“e.",
    "” there",
    "“marg",
    "” pizza",
    "“r",
    "margarita pizza",
    "restaurant",
    "“the",
    "” do",
    "restaurants"
  ],
  "tyn_section":[

  ]
}