{
  "title":"How to Reduce Plastic Use",
  "url":"https://www.wikihow.com/Reduce-Plastic-Use",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Waste Reduction"
  ],
  "methods":[
    {
      "name":"Cutting Down Daily Plastic Use",
      "steps":[
        {
          "headline":"Skip the plastic straws.",
          "description":"Straws have become a huge problem in ocean contamination--in fact, they’re one of the most common pieces of trash picked up on beaches. Eliminating straw use is easy and straightforward--if you order a drink that comes with a straw, just tell the waiter, barista, or worker that you don’t need one. You can also invest in reusable straws made of glass or stainless steel. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCarmela Resuma, MPP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorld Traveler & Executive Director, FLYTE\t\t\t\t\t\t\t\tCarmela is the Executive Director of FLYTE, a non-profit organization headquartered in Georgetown, Texas that empowers students living in underserved communities through transformative travel experiences. Carmela has a Masters in Public Policy Analysis from New York University and is passionate about youth empowerment, social impact, and traveling. Carmela Resuma, MPP\t\t\tWorld Traveler & Executive Director, FLYTE\t\t\t\tWhere does that plastic end up? Often, the ocean. Carmela Resuma, Executive Director of FLYTE, tells us: \"I think about every single-use plastic that I purchase now. When you see a polluted beach in a formerly beautiful place, you realize that those straws and those plastic bags are all going to end up somewhere. You gain perspective — there are other people in the world affected by this pollution.\""
        },
        {
          "headline":"Bring a reusable tumbler or to-go mug when you order coffee.",
          "description":"Instead of ordering coffee in the usual plastic cups and tops, bring your own to-go mug or thermos and ask the cashier to fill it. Insulated tumblers can also keep your beverage hot or cold much longer. Even paper coffee cups are often coated with a plastic resin, so skip these as well in favor of a reusable vessel."
        },
        {
          "headline":"Carry your dry-cleaning in a reusable bag.",
          "description":"Rather than use the dry-cleaner’s single-use plastic bags, bring your own fabric garment bag to hold your clothing. You can purchase recycled dry-cleaner bags made of a more durable, longer-lasting plastic online. Bring fewer clothes to the dry-cleaner’s to reduce your bag use as well."
        },
        {
          "headline":"Stop chewing gum.",
          "description":"Although gum was originally made from natural materials such as sap and rubber, manufacturers now use a type of plastic instead. So instead of chewing and throwing away plastic, find a natural brand of gum or just use mints instead."
        }
      ]
    },
    {
      "name":"Using Eco-Friendly Shopping Tips",
      "steps":[
        {
          "headline":"Bring reusable bags to carry your groceries.",
          "description":"Every year, billions of plastic bags fill up landfills. To help reduce this number, bring your own tote bags when you grocery shopping. Reusable bags made of canvas, jute, or recycled plastic are sturdier for carrying groceries and can make a huge impact on the amount of plastic bags you use. You can find reusable tote bags at most grocery stores or online. If you forget to bring your own bag, many stores offer inexpensive reusable bag options near the checkout area. In some states, such as California, stores even charge around 5 cents USD per plastic bag if you don’t bring your own reusable bags."
        },
        {
          "headline":"Purchase food from bulk bins and store in reusable containers.",
          "description":"Buying foods like cereal, flour, pasta, dried fruit, and rice from the bulk section can save you money as well as lots of plastic packaging. Instead of bagging bulk foods up in plastic bags, bring your own reusable bags or containers to store them in. Cotton bags, glass jars, and stainless steel containers are several waste-free storage options. If you’re worried about how your containers will affect the weighing and paying, go to the customer service desk. Most stores have weighing options for personal containers, and cotton bags usually have their weight printed on the bottom to make the process easier."
        },
        {
          "headline":"Don’t buy bottled beverages.",
          "description":"Bottled water, soda, and juice generate tons of plastic waste. Eliminate your use of plastic bottles by finding alternatives--bring a reusable bottle to fill up with water, make your own soda or seltzer water with a machine like a SodaStream, or buy fresh fruit to make your own juice."
        },
        {
          "headline":"Avoid buying frozen foods.",
          "description":"With frozen food products--particularly frozen meals--plastic packaging is practically impossible to avoid. Even the cardboard, “eco-friendly” packaging is usually coated with plastic. Avoiding these highly processed and packaged products will make you and the environment healthier."
        },
        {
          "headline":"Buy toys and electronics secondhand.",
          "description":"When you buy toys or electronics new, they often come in lots of excess plastic packaging. By shopping secondhand, you can eliminate that waste and find a good-as-new product for a fraction of the price. Browse thrift stores, online postings, and garage sales to find some good, eco-friendly deals. Look at local Goodwills, Salvation Army stores, and Craigslist.com postings for a bargain."
        }
      ]
    },
    {
      "name":"Reducing Plastic In the Home",
      "steps":[
        {
          "headline":"Store food in glass containers or jars.",
          "description":"Instead of wrapping food up in plastic wrap or using a plastic Ziploc bag, store food in reusable glass containers or jars. You can either purchase some glass containers new, or clean and reuse glass jars from other products, such as pasta sauce or jam. For example, instead of packing a sandwich in a Ziploc bag, put it in a reusable container and take it with you to work."
        },
        {
          "headline":"Cook more often.",
          "description":"Eating out often involves plastic-coated takeout containers and doggy bags. Plus, making your own food is healthier for you and for the environment. If you do go out to eat, bring your own food storage containers and use those."
        },
        {
          "headline":"Make your own all-purpose cleaner.",
          "description":"Since cleaner usually comes in plastic bottles, making your own and reusing old bottles will help reduce waste. Make your own simple, affordable solution with 1 part vinegar and 3 parts water. Combine the two liquids in a glass or upcycled plastic spray bottle and use it as a disinfectant spray. Add essential oils such as peppermint or lemon to make the scent fresher and more pleasant. You can also use baking soda for scouring and scrubbing."
        },
        {
          "headline":"Avoid buying products with microbeads.",
          "description":"Many products such as toothpaste, face wash, and body wash may contain small plastic beads for exfoliation. However, because most water treatment plants cannot clean these microbeads out of the water, the plastic collects and causes damage to marine life. Make your own hygiene products or purchase consciously, making sure to only buy microbead-free products. Use products with natural exfoliants instead, such as oatmeal, salt, or sugar. Try making your own face wash with oats, almond meal, and water. You can also make your own eco-friendly toothpaste with baking soda, sea salt, and peppermint extract. Making your own hygiene products like toothpaste and face wash also eliminates any plastic packaging."
        },
        {
          "headline":"Recycle your plastic products.",
          "description":"If you need to use plastic products, such as plastic cutlery, plates, or packaging, make sure to recycle instead of throwing them away. You can either sign up for a recycling service and have them picked up at your home or you can take your recyclables to a facility."
        }
      ]
    }
  ],
  "text":" Cutting Down Daily Plastic Use Skip the plastic straws. Straws have become a huge problem in ocean contamination--in fact, they’re one of the most common pieces of trash picked up on beaches. Eliminating straw use is easy and straightforward--if you order a drink that comes with a straw, just tell the waiter, barista, or worker that you don’t need one. You can also invest in reusable straws made of glass or stainless steel. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCarmela Resuma, MPP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorld Traveler & Executive Director, FLYTE\t\t\t\t\t\t\t\tCarmela is the Executive Director of FLYTE, a non-profit organization headquartered in Georgetown, Texas that empowers students living in underserved communities through transformative travel experiences. Carmela has a Masters in Public Policy Analysis from New York University and is passionate about youth empowerment, social impact, and traveling. Carmela Resuma, MPP\t\t\tWorld Traveler & Executive Director, FLYTE\t\t\t\tWhere does that plastic end up? Often, the ocean. Carmela Resuma, Executive Director of FLYTE, tells us: \"I think about every single-use plastic that I purchase now. When you see a polluted beach in a formerly beautiful place, you realize that those straws and those plastic bags are all going to end up somewhere. You gain perspective — there are other people in the world affected by this pollution.\" Bring a reusable tumbler or to-go mug when you order coffee. Instead of ordering coffee in the usual plastic cups and tops, bring your own to-go mug or thermos and ask the cashier to fill it. Insulated tumblers can also keep your beverage hot or cold much longer. Even paper coffee cups are often coated with a plastic resin, so skip these as well in favor of a reusable vessel. Carry your dry-cleaning in a reusable bag. Rather than use the dry-cleaner’s single-use plastic bags, bring your own fabric garment bag to hold your clothing. You can purchase recycled dry-cleaner bags made of a more durable, longer-lasting plastic online. Bring fewer clothes to the dry-cleaner’s to reduce your bag use as well. Stop chewing gum. Although gum was originally made from natural materials such as sap and rubber, manufacturers now use a type of plastic instead. So instead of chewing and throwing away plastic, find a natural brand of gum or just use mints instead. Using Eco-Friendly Shopping Tips Bring reusable bags to carry your groceries. Every year, billions of plastic bags fill up landfills. To help reduce this number, bring your own tote bags when you grocery shopping. Reusable bags made of canvas, jute, or recycled plastic are sturdier for carrying groceries and can make a huge impact on the amount of plastic bags you use. You can find reusable tote bags at most grocery stores or online. If you forget to bring your own bag, many stores offer inexpensive reusable bag options near the checkout area. In some states, such as California, stores even charge around 5 cents USD per plastic bag if you don’t bring your own reusable bags. Purchase food from bulk bins and store in reusable containers. Buying foods like cereal, flour, pasta, dried fruit, and rice from the bulk section can save you money as well as lots of plastic packaging. Instead of bagging bulk foods up in plastic bags, bring your own reusable bags or containers to store them in. Cotton bags, glass jars, and stainless steel containers are several waste-free storage options. If you’re worried about how your containers will affect the weighing and paying, go to the customer service desk. Most stores have weighing options for personal containers, and cotton bags usually have their weight printed on the bottom to make the process easier. Don’t buy bottled beverages. Bottled water, soda, and juice generate tons of plastic waste. Eliminate your use of plastic bottles by finding alternatives--bring a reusable bottle to fill up with water, make your own soda or seltzer water with a machine like a SodaStream, or buy fresh fruit to make your own juice. Avoid buying frozen foods. With frozen food products--particularly frozen meals--plastic packaging is practically impossible to avoid. Even the cardboard, “eco-friendly” packaging is usually coated with plastic. Avoiding these highly processed and packaged products will make you and the environment healthier. Buy toys and electronics secondhand. When you buy toys or electronics new, they often come in lots of excess plastic packaging. By shopping secondhand, you can eliminate that waste and find a good-as-new product for a fraction of the price. Browse thrift stores, online postings, and garage sales to find some good, eco-friendly deals. Look at local Goodwills, Salvation Army stores, and Craigslist.com postings for a bargain. Reducing Plastic In the Home Store food in glass containers or jars. Instead of wrapping food up in plastic wrap or using a plastic Ziploc bag, store food in reusable glass containers or jars. You can either purchase some glass containers new, or clean and reuse glass jars from other products, such as pasta sauce or jam. For example, instead of packing a sandwich in a Ziploc bag, put it in a reusable container and take it with you to work. Cook more often. Eating out often involves plastic-coated takeout containers and doggy bags. Plus, making your own food is healthier for you and for the environment. If you do go out to eat, bring your own food storage containers and use those. Make your own all-purpose cleaner. Since cleaner usually comes in plastic bottles, making your own and reusing old bottles will help reduce waste. Make your own simple, affordable solution with 1 part vinegar and 3 parts water. Combine the two liquids in a glass or upcycled plastic spray bottle and use it as a disinfectant spray. Add essential oils such as peppermint or lemon to make the scent fresher and more pleasant. You can also use baking soda for scouring and scrubbing. Avoid buying products with microbeads. Many products such as toothpaste, face wash, and body wash may contain small plastic beads for exfoliation. However, because most water treatment plants cannot clean these microbeads out of the water, the plastic collects and causes damage to marine life. Make your own hygiene products or purchase consciously, making sure to only buy microbead-free products. Use products with natural exfoliants instead, such as oatmeal, salt, or sugar. Try making your own face wash with oats, almond meal, and water. You can also make your own eco-friendly toothpaste with baking soda, sea salt, and peppermint extract. Making your own hygiene products like toothpaste and face wash also eliminates any plastic packaging. Recycle your plastic products. If you need to use plastic products, such as plastic cutlery, plates, or packaging, make sure to recycle instead of throwing them away. You can either sign up for a recycling service and have them picked up at your home or you can take your recyclables to a facility.",
  "tyn_model":[
    "water",
    "plastic",
    "gum",
    "reusable bags",
    "straws",
    "straw",
    "reusable bag",
    "dry-cleaner",
    "containers",
    "glass jars",
    "toys",
    "ziploc bag",
    "baking soda",
    "plastic straws",
    "— there",
    "reusable tumbler",
    "to-go mug",
    "thermos",
    "tumblers",
    "dry-cleaner bags",
    "rubber",
    "reusable tote bags",
    "reusable containers",
    "rice",
    "plastic bags",
    "stainless steel containers",
    "bottled beverages",
    "soda",
    "seltzer water",
    "“eco",
    "” packaging",
    "jars",
    "reusable container",
    "plastic-coated takeout containers",
    "food storage containers",
    "all-purpose cleaner",
    "vinegar",
    "water treatment plants",
    "salt",
    "sugar",
    "oats",
    "sea salt",
    "plates"
  ],
  "tyn_section":[

  ]
}