{
  "title":"How to Prune Cilantro",
  "url":"https://www.wikihow.com/Prune-Cilantro",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "methods":[
    {
      "name":"Trimming Small Cilantro Plants",
      "steps":[
        {
          "headline":"Start trimming your cilantro plant once it is 6 inches (15 cm) tall.",
          "description":"Cilantro should be pruned often to encourage new growth. Older, larger cilantro leaves also tend to be more bitter in flavor, making the herb less desirable if it is left to grow out. When your cilantro plant reaches 6 inches (15 cm), start trimming away stems to use as needed. Add fresh cilantro to salads, soups, salsa, guacamole, and other dishes. It will usually take 60-75 days after planting for your cilantro to be this height."
        },
        {
          "headline":"Pinch or cut cilantro stems off of your plant.",
          "description":"Use your thumb and forefinger to grasp a stem at its outermost leaves. Trace downwards until your reach a new growth coming in underneath it. Pinch about 0.4 inches (1.0 cm) above the new growth to remove the stem and leaves above it. If you prefer, use scissors to cut the piece instead of pinching it. Avoid pulling off stems, which could damage the remaining plant."
        },
        {
          "headline":"Keep fresh cilantro in the fridge for a week.",
          "description":"Wrap newly picked cilantro stems or leaves in a clean plastic bag. Store the bag in the vegetable bin of your refrigerator. Cilantro will stay fresh and flavorful for up to a week."
        }
      ]
    },
    {
      "name":"Harvesting Large Amounts of Cilantro",
      "steps":[
        {
          "headline":"Harvest cilantro often throughout the spring and fall.",
          "description":"Cooler months during the springtime and fall are the best to time to pick cilantro from your garden. Cilantro plants will not grow properly in warmer weather as the heat causes them to seed. Harvest cilantro early and often to encourage it to keep growing. Once cilantro plants start to flower and produce coriander seeds, they can no longer be harvested. These seeds can be dried and used as coriander in recipes, though. Generally only the outer leaves of the plant should be removed, leaving the inner leaves to continue to grow\nA cilantro plant should produce new foliage appropriate for harvesting approximately every week for the duration of its blooming. EXPERT TIP\t“After cilantro flowers, the leaves lose their flavor. However, you can use the seeds as spices for Asian, Indian, and Mexican recipes.”\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaggie Moran\t\t\t\t\tHorticulturist\t\t\t\t\t\t\t\tMaggie Moran is a Professional Gardener in Pennsylvania. Maggie MoranHorticulturist"
        },
        {
          "headline":"Cut stems near the ground level.",
          "description":"Using sharp scissors or garden shears, cut the largest leafy stems of your cilantro plants just above the ground. Stems of fully grown cilantro plants are generally between 6 inches (15 cm) and 12 inches (30 cm) tall. Do not cut any stems that are smaller than 6 inches (15 cm)."
        },
        {
          "headline":"Harvest no more than 1/3 of each plant.",
          "description":"To make sure that cilantro plants retain their strength, trim no more than 1/3 of their mass when you harvest the herb. Losing any more of their structure would weaken the plants and possibly stunt their growth. Assess each plant visually and count the number of large stems growing from them before deciding how many to remove."
        },
        {
          "headline":"Freeze cilantro leaves and stems.",
          "description":"To store large amount of cilantro leaves and stems, wash them and dry them thoroughly. Lay them flat and place them in a thin layer in a resealable freezer bag or airtight freezer safe container. Freeze cilantro and keep it for up to a year. To use frozen cilantro, simply break off as much as you need and put the rest back in the freezer. If you are cooking with cilantro, use it straight from frozen in your recipe. To use the cilantro as a garnish, let it thaw in the fridge for 2-3 hours."
        },
        {
          "headline":"Dry cilantro.",
          "description":"Another way of preserving cilantro is to dry it out. Tie clusters of full cilantro stems together with twist-ties and hang them in a warm, dry room. Leave them there for several days until they are completely dried out. Once the stems are dry, you can remove the leaves and crumble them into a small spice jar. You can also dry out cilantro leaves by placing them on a baking tray and heating them in the oven at the lowest possible temperature for 30 minutes."
        }
      ]
    },
    {
      "name":"Growing Cilantro",
      "steps":[
        {
          "headline":"Plant cilantro in the spring or early autumn.",
          "description":"Cilantro thrives in spring and fall weather, so these two seasons are the best for planting it. Avoid planting cilantro in the summer, as the heat will cause your plants to flower prematurely. This will end your harvesting cycle of cilantro and leave you with bitter-tasting leaves."
        },
        {
          "headline":"Place cilantro in a sunny location with partial shade.",
          "description":"Whether you grow cilantro indoors or outdoors, plants will need at least some direct sunlight to grow. They also need some shade, however, to keep from overheating. Too much sun and warmth will cause the plants to go to seed, ending their harvest."
        },
        {
          "headline":"Use soil with a pH level between 6.0 and 8.0.",
          "description":"If you are planting cilantro in small quantities, purchase a potting soil with a neutral pH falling between 6.0 and 8.0. If you are planting cilantro in your garden, test the soil first with a soil pH test kit. If you need to neutralize your soil, rake compost into it before planting cilantro."
        },
        {
          "headline":"Plant seeds instead of seedlings.",
          "description":"It is best to plant cilantro straight from seed, as seedlings are delicate and don’t fare well when they are transplanted. Sow the seeds approximately 0.4 inches (1.0 cm) into good quality soil. Seeds can be planted outdoors in rows or indoors in a medium-sized container. Plants will take approximately 2-3 weeks to germinate."
        },
        {
          "headline":"Keep the soil moist.",
          "description":"Avoid overwatering cilantro plants, which can overwhelm them. Give plants about 1 inch (2.5 cm) of water per week, or just enough to keep the soil moist at all times. Watch the soil and give the plants more water if it looks dry."
        }
      ]
    }
  ],
  "text":" Trimming Small Cilantro Plants Start trimming your cilantro plant once it is 6 inches (15 cm) tall. Cilantro should be pruned often to encourage new growth. Older, larger cilantro leaves also tend to be more bitter in flavor, making the herb less desirable if it is left to grow out. When your cilantro plant reaches 6 inches (15 cm), start trimming away stems to use as needed. Add fresh cilantro to salads, soups, salsa, guacamole, and other dishes. It will usually take 60-75 days after planting for your cilantro to be this height. Pinch or cut cilantro stems off of your plant. Use your thumb and forefinger to grasp a stem at its outermost leaves. Trace downwards until your reach a new growth coming in underneath it. Pinch about 0.4 inches (1.0 cm) above the new growth to remove the stem and leaves above it. If you prefer, use scissors to cut the piece instead of pinching it. Avoid pulling off stems, which could damage the remaining plant. Keep fresh cilantro in the fridge for a week. Wrap newly picked cilantro stems or leaves in a clean plastic bag. Store the bag in the vegetable bin of your refrigerator. Cilantro will stay fresh and flavorful for up to a week. Harvesting Large Amounts of Cilantro Harvest cilantro often throughout the spring and fall. Cooler months during the springtime and fall are the best to time to pick cilantro from your garden. Cilantro plants will not grow properly in warmer weather as the heat causes them to seed. Harvest cilantro early and often to encourage it to keep growing. Once cilantro plants start to flower and produce coriander seeds, they can no longer be harvested. These seeds can be dried and used as coriander in recipes, though. Generally only the outer leaves of the plant should be removed, leaving the inner leaves to continue to grow\nA cilantro plant should produce new foliage appropriate for harvesting approximately every week for the duration of its blooming. EXPERT TIP\t“After cilantro flowers, the leaves lose their flavor. However, you can use the seeds as spices for Asian, Indian, and Mexican recipes.”\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaggie Moran\t\t\t\t\tHorticulturist\t\t\t\t\t\t\t\tMaggie Moran is a Professional Gardener in Pennsylvania. Maggie MoranHorticulturist Cut stems near the ground level. Using sharp scissors or garden shears, cut the largest leafy stems of your cilantro plants just above the ground. Stems of fully grown cilantro plants are generally between 6 inches (15 cm) and 12 inches (30 cm) tall. Do not cut any stems that are smaller than 6 inches (15 cm). Harvest no more than 1/3 of each plant. To make sure that cilantro plants retain their strength, trim no more than 1/3 of their mass when you harvest the herb. Losing any more of their structure would weaken the plants and possibly stunt their growth. Assess each plant visually and count the number of large stems growing from them before deciding how many to remove. Freeze cilantro leaves and stems. To store large amount of cilantro leaves and stems, wash them and dry them thoroughly. Lay them flat and place them in a thin layer in a resealable freezer bag or airtight freezer safe container. Freeze cilantro and keep it for up to a year. To use frozen cilantro, simply break off as much as you need and put the rest back in the freezer. If you are cooking with cilantro, use it straight from frozen in your recipe. To use the cilantro as a garnish, let it thaw in the fridge for 2-3 hours. Dry cilantro. Another way of preserving cilantro is to dry it out. Tie clusters of full cilantro stems together with twist-ties and hang them in a warm, dry room. Leave them there for several days until they are completely dried out. Once the stems are dry, you can remove the leaves and crumble them into a small spice jar. You can also dry out cilantro leaves by placing them on a baking tray and heating them in the oven at the lowest possible temperature for 30 minutes. Growing Cilantro Plant cilantro in the spring or early autumn. Cilantro thrives in spring and fall weather, so these two seasons are the best for planting it. Avoid planting cilantro in the summer, as the heat will cause your plants to flower prematurely. This will end your harvesting cycle of cilantro and leave you with bitter-tasting leaves. Place cilantro in a sunny location with partial shade. Whether you grow cilantro indoors or outdoors, plants will need at least some direct sunlight to grow. They also need some shade, however, to keep from overheating. Too much sun and warmth will cause the plants to go to seed, ending their harvest. Use soil with a pH level between 6.0 and 8.0. If you are planting cilantro in small quantities, purchase a potting soil with a neutral pH falling between 6.0 and 8.0. If you are planting cilantro in your garden, test the soil first with a soil pH test kit. If you need to neutralize your soil, rake compost into it before planting cilantro. Plant seeds instead of seedlings. It is best to plant cilantro straight from seed, as seedlings are delicate and don’t fare well when they are transplanted. Sow the seeds approximately 0.4 inches (1.0 cm) into good quality soil. Seeds can be planted outdoors in rows or indoors in a medium-sized container. Plants will take approximately 2-3 weeks to germinate. Keep the soil moist. Avoid overwatering cilantro plants, which can overwhelm them. Give plants about 1 inch (2.5 cm) of water per week, or just enough to keep the soil moist at all times. Watch the soil and give the plants more water if it looks dry.",
  "tyn_model":[
    "cilantro",
    "scissors",
    "coriander",
    "water",
    "vegetable bin",
    "“after",
    "spices",
    "”\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t",
    "gardener",
    "garden shears",
    "resealable freezer bag",
    "airtight freezer safe container",
    "small spice jar",
    "oven",
    "soil",
    "potting soil",
    "compost"
  ],
  "tyn_section":[

  ]
}