{
  "title":"How to Take a Passport Photo",
  "url":"https://www.wikihow.com/Take-a-Passport-Photo",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Genres",
    "People and Portrait Photography"
  ],
  "methods":[
    {
      "name":"Getting a Professional Photo",
      "steps":[
        {
          "headline":"Find a place that offers passport photos.",
          "description":"Many businesses offer to take passport photos for a small fee, including drugstores, big box stores, and other photo-processing stores. Find a business in your area that offers this service. For instance, you can get photos taken at places like Walgreens, CVS, Walmart, Target, and Costco."
        },
        {
          "headline":"Ask a store clerk to help you.",
          "description":"Generally, anyone in the store can help you, though usually a person who works at the photo counter is best. Ask if they will take the photo for you. They have to use their camera to take your photo, which is connected to the store's software."
        },
        {
          "headline":"Pose appropriately.",
          "description":"The U.S. Department of State recommends that you have a neutral expression or a regular smile. Also, you should look directly at the camera and keep your eyes open when taking the photo. Check with your country's laws to see what they require for the photo. For instance, both the U.K. and Canada require that you not smile at all."
        },
        {
          "headline":"Take off your hat and glasses.",
          "description":"You can't wear a hat, head covering, or glasses while taking a passport photo. There are two exceptions to this rule. You can wear glasses if you can't take them off for medical reasons, and you can wear a head covering if it's required by your religion. You must have a signed doctor's note with your application if you keep your glasses on. If a head covering is required for your religion, you may submit a statement with your photo stating that it's required by a recognized religion. The covering cannot obscure your face or hairline."
        },
        {
          "headline":"Pay the fee for the photo to be printed.",
          "description":"Drugstores charge for the service of taking your photo and printing it off. Usually it costs somewhere between $5 USD and $15 USD depending on where you are, so be ready to pay that fee."
        }
      ]
    },
    {
      "name":"Taking Your Own Photo",
      "steps":[
        {
          "headline":"Find a white or off-white background.",
          "description":"The State Department requires that your photo have a white background. When you're taking your own photo, find a white wall or other backdrop to take your photo in front of."
        },
        {
          "headline":"Pay attention to the lighting.",
          "description":"The picture needs to be clear without glare or shadows. It should also be in good lighting. You may need to move around to find the perfect balance of good lighting and no shadows."
        },
        {
          "headline":"Remove glasses and hats.",
          "description":"Unless you have a medical reason to keep them on, take your glasses off. Also, hats and head coverings need to come off unless it's a part of your religious beliefs. With the glasses, you'll need a doctor's note if you keep them on. With the head coverings, you'll submit a letter stating that your head covering is required by a recognized religion. Also, take your headphones out. You can't be wearing electronic devices in the photo, specifically headphones or bluetooth ear pieces. Take them out before you snap the photo."
        },
        {
          "headline":"Face the camera with a natural expression.",
          "description":"You can make a natural smile in the United States, but don't do anything too crazy. You want to keep it pretty normal."
        },
        {
          "headline":"Take the photo.",
          "description":"You can take the photo with a digital camera, film camera, or a smartphone. If you're using a smartphone, trying using a passport photo app, which will help you line up your photo appropriately. To make it easier, have a friend take the photo for you if you're the one who needs the passport photo. If you take it yourself, you should use a timer and a tripod instead of taking a traditional selfie. Take multiple shots to make sure you get a good one."
        }
      ]
    },
    {
      "name":"Editing the Photo as Needed",
      "steps":[
        {
          "headline":"Take out red eye.",
          "description":"If you ended up with red eyes in your photo, you can remove them digitally with a photo editing tool. However, that is the only digital alteration you are allowed to make. Generally, all you need to do to take out red eye is to select the red eye removal tool in the photo editor of your choice and then click on each eye. Some editors even remove it automatically."
        },
        {
          "headline":"Size the photo appropriately.",
          "description":"Your passport photo needs to be sized according to your country's regulations. Google \"[Your Country Name] passport photo size\" to learn more. For instance, for the US, the photo needs to be 2 by 2 inches (5.1 by 5.1 cm), and your face needs to be 1 by 1.375 inches (2.54 by 3.49 cm) in length from top to bottom. You can use the State Department's tool to adjust your photo at https://travel.state.gov/content/dam/passports/content-page-resources/FIG_cropper.swf. You upload a photo and then adjust your photo to fit in the given outline."
        },
        {
          "headline":"Print the photo.",
          "description":"You can print the photo at home, as long as you have photo paper and your printer prints cleanly. Make sure the photo is clear and not pixelated. You can also print it off at a drugstore for less than $1 USD. Some apps, such as the Passport Photo Booth, will help you take the photo, and then they will send you a printed photo by mail for about $6 USD."
        },
        {
          "headline":"Submit it before 6 months is up.",
          "description":"The photo for your passport photo needs to be recent, specifically taken with the last 6 months. Therefore, make sure you get your application submitted before that time is up. Make sure you submit the appropriate number of photos -- you'll often need to submit more than 1 copy!"
        }
      ]
    }
  ],
  "text":" Getting a Professional Photo Find a place that offers passport photos. Many businesses offer to take passport photos for a small fee, including drugstores, big box stores, and other photo-processing stores. Find a business in your area that offers this service. For instance, you can get photos taken at places like Walgreens, CVS, Walmart, Target, and Costco. Ask a store clerk to help you. Generally, anyone in the store can help you, though usually a person who works at the photo counter is best. Ask if they will take the photo for you. They have to use their camera to take your photo, which is connected to the store's software. Pose appropriately. The U.S. Department of State recommends that you have a neutral expression or a regular smile. Also, you should look directly at the camera and keep your eyes open when taking the photo. Check with your country's laws to see what they require for the photo. For instance, both the U.K. and Canada require that you not smile at all. Take off your hat and glasses. You can't wear a hat, head covering, or glasses while taking a passport photo. There are two exceptions to this rule. You can wear glasses if you can't take them off for medical reasons, and you can wear a head covering if it's required by your religion. You must have a signed doctor's note with your application if you keep your glasses on. If a head covering is required for your religion, you may submit a statement with your photo stating that it's required by a recognized religion. The covering cannot obscure your face or hairline. Pay the fee for the photo to be printed. Drugstores charge for the service of taking your photo and printing it off. Usually it costs somewhere between $5 USD and $15 USD depending on where you are, so be ready to pay that fee. Taking Your Own Photo Find a white or off-white background. The State Department requires that your photo have a white background. When you're taking your own photo, find a white wall or other backdrop to take your photo in front of. Pay attention to the lighting. The picture needs to be clear without glare or shadows. It should also be in good lighting. You may need to move around to find the perfect balance of good lighting and no shadows. Remove glasses and hats. Unless you have a medical reason to keep them on, take your glasses off. Also, hats and head coverings need to come off unless it's a part of your religious beliefs. With the glasses, you'll need a doctor's note if you keep them on. With the head coverings, you'll submit a letter stating that your head covering is required by a recognized religion. Also, take your headphones out. You can't be wearing electronic devices in the photo, specifically headphones or bluetooth ear pieces. Take them out before you snap the photo. Face the camera with a natural expression. You can make a natural smile in the United States, but don't do anything too crazy. You want to keep it pretty normal. Take the photo. You can take the photo with a digital camera, film camera, or a smartphone. If you're using a smartphone, trying using a passport photo app, which will help you line up your photo appropriately. To make it easier, have a friend take the photo for you if you're the one who needs the passport photo. If you take it yourself, you should use a timer and a tripod instead of taking a traditional selfie. Take multiple shots to make sure you get a good one. Editing the Photo as Needed Take out red eye. If you ended up with red eyes in your photo, you can remove them digitally with a photo editing tool. However, that is the only digital alteration you are allowed to make. Generally, all you need to do to take out red eye is to select the red eye removal tool in the photo editor of your choice and then click on each eye. Some editors even remove it automatically. Size the photo appropriately. Your passport photo needs to be sized according to your country's regulations. Google \"[Your Country Name] passport photo size\" to learn more. For instance, for the US, the photo needs to be 2 by 2 inches (5.1 by 5.1 cm), and your face needs to be 1 by 1.375 inches (2.54 by 3.49 cm) in length from top to bottom. You can use the State Department's tool to adjust your photo at https://travel.state.gov/content/dam/passports/content-page-resources/FIG_cropper.swf. You upload a photo and then adjust your photo to fit in the given outline. Print the photo. You can print the photo at home, as long as you have photo paper and your printer prints cleanly. Make sure the photo is clear and not pixelated. You can also print it off at a drugstore for less than $1 USD. Some apps, such as the Passport Photo Booth, will help you take the photo, and then they will send you a printed photo by mail for about $6 USD. Submit it before 6 months is up. The photo for your passport photo needs to be recent, specifically taken with the last 6 months. Therefore, make sure you get your application submitted before that time is up. Make sure you submit the appropriate number of photos -- you'll often need to submit more than 1 copy!",
  "tyn_model":[
    "glasses",
    "hat",
    "hats",
    "headphones",
    "photo-processing stores",
    "timer",
    "photo editing",
    "red eye removal tool",
    "photo editor",
    "photo paper",
    "printer"
  ],
  "tyn_section":[

  ]
}