{
  "title":"How to Eat Soursop",
  "url":"https://www.wikihow.com/Eat-Soursop",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Getting to the Pulp",
      "steps":[
        {
          "headline":"Choose a soursop with yellow-green skin.",
          "description":"An unripe soursop has a dark green tinted skin. It can take a week or more to ripen. When it does ripen the skin color will change to more of a yellowish tone. A soursop fruit should also feel soft and slightly mushy to the touch when it is ready to eat. A soursop fruit will also ripen in the fridge, although it may take a bit longer. If you eat an unripe soursop it will taste tart and the pulp will be very tough and grainy."
        },
        {
          "headline":"Wash it with warm water.",
          "description":"Before you get ready to eat your soursop, hold the fruit under warm tap water for 2-3 minutes. Rub your hands along the surface of the fruit to remove any dirt or other debris. For an even higher level of cleanliness, you can rinse off the fruit with a produce cleaning solution, which you can buy at the grocery store."
        },
        {
          "headline":"Remove the skin.",
          "description":"The outer skin of the soursop is not edible, so you’ll need to remove it. Score the end of the fruit with your knife, so that your cuts form an “X.” Make it just deep enough to reach past the skin and into the pulp. Then, use your fingers to separate the skin sections. Grab a single section of skin at a time and pull it downward and away from the pulp, effectively peeling the fruit. Peel it like you would a banana. Use your knife to clean up any areas where the pulp isn’t exposed. The soursop has tiny thorns spread over its skin. However, these are usually not firm enough to irritate your skin when handling the fruit."
        },
        {
          "headline":"Cut it longways.",
          "description":"Get a sharp paring knife. Lay the fruit down on a cutting board. Holding it firmly, cut it in half down the middle. With a ripe soursop you should be able to make one clean cut. If you would like more access to the seeds, then you can cut it once more into fourths."
        },
        {
          "headline":"Remove the seeds.",
          "description":"When you cut open the soursop you will see custard-colored flesh with a handful of long, smooth black seeds. You can dig into the flesh with a grapefruit spoon and lift out each seed. Some people prefer to use their fingers to feel out each seed. Try to get out all of the seeds, as they contain neurotoxins. Within each of the long seed pods that you see are dozens of smaller seeds. Make sure to carefully dispose of the seeds after removing them, so that no animals or people will have access to them."
        },
        {
          "headline":"Store leftover pieces in an airtight container.",
          "description":"Get a plastic or glass bowl container with a tight-fitting lid. Place the sections of soursop into the container and seat it tightly. The fruit will last in the refrigerator for about a week."
        }
      ]
    },
    {
      "name":"Making Soursop Foods",
      "steps":[
        {
          "headline":"Eat it raw.",
          "description":"Get a spoon and push it right into the soft interior pulp. Or, you can dice the soursop up with a sharp knife and eat it in bite-sized pieces. Another option is to blend the pulp into a paste and then eat the paste with a spoon. A soursop fruit has a flavor similar to a pineapple. Like many tropical fruits, it contains both sweet and sour flavors mixed together."
        },
        {
          "headline":"Refrigerate the pulp to increase its sweetness.",
          "description":"If you try to eat your soursop fruit raw and it irritates or tingles your mouth, wait a few days and then try it again. In the meantime, store the pulp in the refrigerator in an airtight container. If you wait, you’ll also notice that the fruit gets progressively sweeter."
        },
        {
          "headline":"Roast it.",
          "description":"A ripe soursop can be prepared just like a vegetable for consumption. You can place soursop chunks or halves into an oven on 350 degrees Fahrenheit (176 degrees Celsius) and cook for 20-30 minutes or until extra soft. To add even more flavor, sprinkle the soursop with cinnamon or nutmeg prior to roasting. Just like pineapple, you can also place slices of soursop onto a hot grill. Drizzle these pieces with honey to make an extra special treat."
        },
        {
          "headline":"Use it for homemade ice cream.",
          "description":"Get out your manual or electric ice cream maker. In the mixing compartment, add together ¾ cup (180 mL) pureed soursop pulp, 1 cup (240 mL) milk, ¾ cup (150 g) granulated sugar, and 2 cups (475 mL) heavy whipping cream. Follow the directions on your ice maker for processing and scoop out the final product when finished. If you don’t have an ice cream maker, you can also freeze this mixture into ice cubes."
        },
        {
          "headline":"Make a soursop cream pie.",
          "description":"In a large bowl, whisk together ½ cup (120 mL) of egg yolk with ¾ cup (75 g) of powdered sugar. Add in 1 cup (240 mL) heavy cream. In a small pan, heat up 1 cup (240 mL) soursop puree along with 1 ounce (28 g) powdered gelatin. Stir 12 ounces (350 mL) white chocolate couverture and 1 cup (240 mL) fresh black sapote into the pan. Pour the cream mixture into the pan as well. Stir well and then pour it from the pan into a pie dish. Chill for 2 hours or until firm."
        },
        {
          "headline":"Be cautious when eating it for medicinal purposes.",
          "description":"Although there are some claims that soursop can help with cancer therapies, this information has yet to be tested by medical authorities. There are also some concerns regarding eating large quantities of soursop, due to the presence of traces of neurotoxins."
        }
      ]
    },
    {
      "name":"Making Soursop Drinks",
      "steps":[
        {
          "headline":"Make a fruit smoothie.",
          "description":"You can get a bit creative when working with soursop and other fruits. Place soursop chunks in your blender alongside bananas, kiwis, strawberries, or blueberries. Fill the rest of the blender up with ice. Blend until the mixture is smooth and drinkable. Pour some into a glass and refrigerate the rest for later."
        },
        {
          "headline":"Make a milkshake.",
          "description":"Place the pulp from 1 ripe soursop fruit, 1 frozen banana, ½ cup (120 mL) coconut water, and ½ cup (120 mL) almond milk into a blender. Add a dash of cinnamon and vanilla flavoring for extra taste. Blend until the mixture is smooth and creamy. Pour your shake into a glass. Garnish with a bit of ground cinnamon on top."
        },
        {
          "headline":"Make a chilled drink.",
          "description":"Add the pulp from 1 ripe soursop fruit and 2 cups (475 mL) water into a blender. Puree until smooth. Then, add 1 additional cup (240 mL) of water, 1 can sweetened condensed milk, 2 tablespoons (30 mL) fresh lime juice, 1 tablespoon (15 mL) vanilla extract, and 1 teaspoon (5 mL) grated nutmeg into the blender. Blend until the mixture is smooth. Pour into a glass and enjoy! This drink can be served chilled or even over ice. If you don’t like the taste of condensed milk, you can sweeten up your drink by adding honey instead."
        },
        {
          "headline":"Brew soursop tea.",
          "description":"Place 2 or 3 soursop leaves into a tea cup. Pour boiling water on top of the leaves and let the cup sit for 5-10 minutes. Remove the leaves with a spoon. Add sugar or honey for extra sweetness. Soursop tea is good both hot and cold, so there’s no need to wait to enjoy it. Attached to the stem of each piece of soursop fruit are 4 to 6 leaves. The leaves are bright green in color and oval in shape. You can buy a piece of fruit with the leaves still attached or you can purchase dried leaves from your local specialty grocery store."
        },
        {
          "headline":"Put it in a juicer.",
          "description":"Get a hand crank or electric juicer. After you’ve peeled and de-seeded your soursop, cut it into small chunks. Feed these chunks into your juicer. Make sure that you’ve placed a glass at the spout to collect the juice. Throw the remaining pulp way. You can drink soursop juice straight or add it to ice cream or yogurt."
        }
      ]
    }
  ],
  "text":" Getting to the Pulp Choose a soursop with yellow-green skin. An unripe soursop has a dark green tinted skin. It can take a week or more to ripen. When it does ripen the skin color will change to more of a yellowish tone. A soursop fruit should also feel soft and slightly mushy to the touch when it is ready to eat. A soursop fruit will also ripen in the fridge, although it may take a bit longer. If you eat an unripe soursop it will taste tart and the pulp will be very tough and grainy. Wash it with warm water. Before you get ready to eat your soursop, hold the fruit under warm tap water for 2-3 minutes. Rub your hands along the surface of the fruit to remove any dirt or other debris. For an even higher level of cleanliness, you can rinse off the fruit with a produce cleaning solution, which you can buy at the grocery store. Remove the skin. The outer skin of the soursop is not edible, so you’ll need to remove it. Score the end of the fruit with your knife, so that your cuts form an “X.” Make it just deep enough to reach past the skin and into the pulp. Then, use your fingers to separate the skin sections. Grab a single section of skin at a time and pull it downward and away from the pulp, effectively peeling the fruit. Peel it like you would a banana. Use your knife to clean up any areas where the pulp isn’t exposed. The soursop has tiny thorns spread over its skin. However, these are usually not firm enough to irritate your skin when handling the fruit. Cut it longways. Get a sharp paring knife. Lay the fruit down on a cutting board. Holding it firmly, cut it in half down the middle. With a ripe soursop you should be able to make one clean cut. If you would like more access to the seeds, then you can cut it once more into fourths. Remove the seeds. When you cut open the soursop you will see custard-colored flesh with a handful of long, smooth black seeds. You can dig into the flesh with a grapefruit spoon and lift out each seed. Some people prefer to use their fingers to feel out each seed. Try to get out all of the seeds, as they contain neurotoxins. Within each of the long seed pods that you see are dozens of smaller seeds. Make sure to carefully dispose of the seeds after removing them, so that no animals or people will have access to them. Store leftover pieces in an airtight container. Get a plastic or glass bowl container with a tight-fitting lid. Place the sections of soursop into the container and seat it tightly. The fruit will last in the refrigerator for about a week. Making Soursop Foods Eat it raw. Get a spoon and push it right into the soft interior pulp. Or, you can dice the soursop up with a sharp knife and eat it in bite-sized pieces. Another option is to blend the pulp into a paste and then eat the paste with a spoon. A soursop fruit has a flavor similar to a pineapple. Like many tropical fruits, it contains both sweet and sour flavors mixed together. Refrigerate the pulp to increase its sweetness. If you try to eat your soursop fruit raw and it irritates or tingles your mouth, wait a few days and then try it again. In the meantime, store the pulp in the refrigerator in an airtight container. If you wait, you’ll also notice that the fruit gets progressively sweeter. Roast it. A ripe soursop can be prepared just like a vegetable for consumption. You can place soursop chunks or halves into an oven on 350 degrees Fahrenheit (176 degrees Celsius) and cook for 20-30 minutes or until extra soft. To add even more flavor, sprinkle the soursop with cinnamon or nutmeg prior to roasting. Just like pineapple, you can also place slices of soursop onto a hot grill. Drizzle these pieces with honey to make an extra special treat. Use it for homemade ice cream. Get out your manual or electric ice cream maker. In the mixing compartment, add together ¾ cup (180 mL) pureed soursop pulp, 1 cup (240 mL) milk, ¾ cup (150 g) granulated sugar, and 2 cups (475 mL) heavy whipping cream. Follow the directions on your ice maker for processing and scoop out the final product when finished. If you don’t have an ice cream maker, you can also freeze this mixture into ice cubes. Make a soursop cream pie. In a large bowl, whisk together ½ cup (120 mL) of egg yolk with ¾ cup (75 g) of powdered sugar. Add in 1 cup (240 mL) heavy cream. In a small pan, heat up 1 cup (240 mL) soursop puree along with 1 ounce (28 g) powdered gelatin. Stir 12 ounces (350 mL) white chocolate couverture and 1 cup (240 mL) fresh black sapote into the pan. Pour the cream mixture into the pan as well. Stir well and then pour it from the pan into a pie dish. Chill for 2 hours or until firm. Be cautious when eating it for medicinal purposes. Although there are some claims that soursop can help with cancer therapies, this information has yet to be tested by medical authorities. There are also some concerns regarding eating large quantities of soursop, due to the presence of traces of neurotoxins. Making Soursop Drinks Make a fruit smoothie. You can get a bit creative when working with soursop and other fruits. Place soursop chunks in your blender alongside bananas, kiwis, strawberries, or blueberries. Fill the rest of the blender up with ice. Blend until the mixture is smooth and drinkable. Pour some into a glass and refrigerate the rest for later. Make a milkshake. Place the pulp from 1 ripe soursop fruit, 1 frozen banana, ½ cup (120 mL) coconut water, and ½ cup (120 mL) almond milk into a blender. Add a dash of cinnamon and vanilla flavoring for extra taste. Blend until the mixture is smooth and creamy. Pour your shake into a glass. Garnish with a bit of ground cinnamon on top. Make a chilled drink. Add the pulp from 1 ripe soursop fruit and 2 cups (475 mL) water into a blender. Puree until smooth. Then, add 1 additional cup (240 mL) of water, 1 can sweetened condensed milk, 2 tablespoons (30 mL) fresh lime juice, 1 tablespoon (15 mL) vanilla extract, and 1 teaspoon (5 mL) grated nutmeg into the blender. Blend until the mixture is smooth. Pour into a glass and enjoy! This drink can be served chilled or even over ice. If you don’t like the taste of condensed milk, you can sweeten up your drink by adding honey instead. Brew soursop tea. Place 2 or 3 soursop leaves into a tea cup. Pour boiling water on top of the leaves and let the cup sit for 5-10 minutes. Remove the leaves with a spoon. Add sugar or honey for extra sweetness. Soursop tea is good both hot and cold, so there’s no need to wait to enjoy it. Attached to the stem of each piece of soursop fruit are 4 to 6 leaves. The leaves are bright green in color and oval in shape. You can buy a piece of fruit with the leaves still attached or you can purchase dried leaves from your local specialty grocery store. Put it in a juicer. Get a hand crank or electric juicer. After you’ve peeled and de-seeded your soursop, cut it into small chunks. Feed these chunks into your juicer. Make sure that you’ve placed a glass at the spout to collect the juice. Throw the remaining pulp way. You can drink soursop juice straight or add it to ice cream or yogurt.",
  "tyn_model":[
    "soursop fruit",
    "blender",
    "water",
    "glass",
    "spoon",
    "honey",
    "knife",
    "banana",
    "airtight container",
    "refrigerator",
    "pineapple",
    "cinnamon",
    "ice cream",
    "ice cream maker",
    "soursop tea",
    "juicer",
    "tap water",
    "produce cleaning solution",
    "“x.",
    "” make",
    "paring knife",
    "cutting board",
    "grapefruit spoon",
    "oven",
    "grill",
    "soursop pulp",
    "milk",
    "granulated sugar",
    "heavy whipping cream",
    "ice maker",
    "ice cubes",
    "soursop cream pie",
    "large bowl",
    "egg yolk",
    "powdered sugar",
    "heavy cream",
    "small pan",
    "soursop puree",
    "powdered gelatin",
    "white chocolate",
    "black sapote",
    "cream",
    "pie dish",
    "soursop",
    "fruit smoothie",
    "bananas",
    "strawberries",
    "blueberries",
    "ice",
    "coconut water",
    "almond milk",
    "vanilla",
    "ground cinnamon",
    "sweetened condensed milk",
    "fresh lime juice",
    "vanilla extract",
    "nutmeg",
    "condensed milk",
    "tea cup",
    "sugar",
    "electric juicer",
    "yogurt"
  ],
  "tyn_section":[

  ]
}