{
  "title":"How to Turn Water Back on",
  "url":"https://www.wikihow.com/Turn-Water-Back-on",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Notifying the Water Company",
      "steps":[
        {
          "headline":"Contact the water company.",
          "description":"In most cases, you should let public works or the municipal water company turn your water on for you. You can contact your local water company by calling them or using their online assistance portal. If your water is drawn from a well, you do not need to contact the water company."
        },
        {
          "headline":"Ask the water company to start service if you just moved.",
          "description":"Contact the company 2 weeks in advance. If possible, ask them to turn the water on the day before you move in. You may need to provide basic identification and a form of payment. Many water companies allow you to turn the water on using an online form."
        },
        {
          "headline":"Explain what the problem is if your water stopped unexpectedly.",
          "description":"If your water stopped unexpectedly, the water company may be able to tell you why. Some common problems include:\nUnpaid bills. You may be asked to pay your water bill and extra late fees. Neighborhood or city leak. You will have to wait until the leak is fixed. A broken valve. They may send someone to inspect your valve or suggest that you hire a plumber. If the valve is broken, the city must fix it."
        },
        {
          "headline":"Request permission to turn the main valve on yourself.",
          "description":"The main valve and water meter are the property of your city. Call the water company to get permission to touch or handle the main valve. If you are not allowed to touch the main valve, they will do it for you. You only need permission if you are turning on water for the entire house or property. Appliance supply valves can be turned on or off at your leisure."
        }
      ]
    },
    {
      "name":"Turning Supply Valves On",
      "steps":[
        {
          "headline":"Locate the supply shut-off valve near the appliance or fixture.",
          "description":"This valve will look like a wheel or a lever. It should be attached to the pipe running out of the device. The wheels are called gate valves while the levers are called ball valves. Some older houses may not have supply shut-off valves for appliances and sinks. In this case, you will need to turn on the water at the main valve."
        },
        {
          "headline":"Turn the valve counterclockwise.",
          "description":"If it is a gate valve, you may need to do 2 to 4 full turns before it turns on. If it is a ball valve, turn it so that it is parallel with the pipe. You should be able to turn the valve with your hands, but if that is difficult, you can use a wrench to help you."
        },
        {
          "headline":"Avoid forcing the valve.",
          "description":"If the valve won’t turn, call a plumber. Forcing the valve can cause the pipe to crack, burst, or leak. A plumber will be able to fix or replace the valve for you."
        }
      ]
    },
    {
      "name":"Switching on the Main Valve",
      "steps":[
        {
          "headline":"Close all sinks and faucets.",
          "description":"You can leave 1 sink on to help equalize the pressure; any sink will work. Turn it on all the way. Otherwise, every other faucet must be turned off all the way in your home."
        },
        {
          "headline":"Locate your shut-off valve.",
          "description":"In most areas, the valve is located outside. Check outside near the street. You may notice a grate in the ground. If you lift up this grate, you should see a hole with a pipe running through it. If you live in a colder climate, the meter may be inside, either in a basement, utility closet, or near the water heater. To open the grate, you can simply reach down and pick it up. If this is hard to do, insert a wrench in the key hole. Turn it and lift up to remove the grate."
        },
        {
          "headline":"Identify the water valve.",
          "description":"You may notice a water meter or gauge with 1 or more turn-handles on either side. These handles are the shut-off valves. In newer homes, there may be 2 valves, 1 on either side of the water meter. In this case, use the valve closest to your house, which will be a gate (or wheel-shaped) valve. You can turn this by hand. In older homes, there will be just 1 valve. It will have a notched top that is perpendicular to the pipe. You will need a water key to turn this valve. You can get one at a hardware store."
        },
        {
          "headline":"Turn the valve counterclockwise.",
          "description":"Start by turning it ¼ of a rotation. Pause for 20 seconds before turning it another ¼. This will allow the water to start running without bursting your pipes. Your water should now work. If the valve is wheel-shaped, you can turn it with your hands or with a wrench. If it has a notched top, use a water key by holding the T-shaped side. Place the other side on top of the notch and turn. If the valve won’t turn, don’t force it. Instead, call a plumber to help. Forcing the valve can cause a leak."
        }
      ]
    },
    {
      "name":"Turning Well Water Back On",
      "steps":[
        {
          "headline":"Turn the upper valve at the water pump.",
          "description":"You may notice a pipe coming up and over the water pump. It may have a ball valve (which will look like a lever). Turn this so that it is parallel with the pipe. If you have a wheel-shaped gate valve at the bottom of your water pump, do not turn this to the on position. Leave it closed."
        },
        {
          "headline":"Locate the electrical switches.",
          "description":"In most cases, the electrical power for the well pump will be shut off at the same time as the water itself. You may have 2 switches: one near the pump and one at the main electrical breaker. Check both to see if they have been switched off."
        },
        {
          "headline":"Flip the switch on.",
          "description":"If you have 2 switches that are turned off, turn on the main electrical switch on first and then turn on the switch next to the pump. Make sure that there is no standing water under or around you. If there is, do not touch the switch. Dry or mop up the water. Your hands must be dry before touching the switch. Otherwise, you may be at risk of electrical shock."
        },
        {
          "headline":"Wait for the pump to fill.",
          "description":"It will take a few minutes before you can use water. You may hear water in the pipes. As it fills, you can turn on a sink to see if it is working. The sink should sputter and spit for several minutes. If the water doesn't start running, call a plumber."
        }
      ]
    },
    {
      "name":"Dewinterizing a House",
      "steps":[
        {
          "headline":"Turn off all faucets.",
          "description":"If you winterized the house, you may have left all of the faucets open. Go through the building and turn all of these faucets off for any showers, sinks, or baths you have. If you would like, you can remove the aerators from your sinks to prevent mineral build-up when the water starts."
        },
        {
          "headline":"Turn on supply valves.",
          "description":"These are the valves underneath your fixtures and water devices, including your sinks, toilets, and water heater. Turn them counterclockwise until they stop."
        },
        {
          "headline":"Check the pipes for visible damage.",
          "description":"Check every pipe in the building to make sure that no breaks or cracks developed. If you notice any damage, call a plumber to have them repaired. Don’t forget to check your:\nWater heater\nSinks\nToilets\nShowers and baths\nRefrigerator\nWashing machine\nHoses"
        },
        {
          "headline":"Turn on the water at the main shut-off valve.",
          "description":"Once you have checked everywhere for leaks, locate the shut-off valve, either outside or in your home. Turn it a quarter of the way and wait 20 seconds. Then turn it another quarter. Water valves are usually located near the street beneath a grate. If there are 2 valves, use the one closest to your house. If you can't turn the valve by hand, you may need a wrench or a water key. Do not turn the valve on all at once. This could flood your pipes and cause a leak."
        },
        {
          "headline":"Check for leaks again.",
          "description":"Quickly go back to check all of your fixtures. Look for any water leaking from the pipes from small cracks that you may not have noticed before. If there are any leaks, call a plumber."
        },
        {
          "headline":"Turn on faucets one by one.",
          "description":"Let the faucet run for about 20 seconds before turning it off. Check for leaks around the pipes again. If there are no leaks, move on to the next faucet. If you notice a leak, call a plumber for repairs."
        }
      ]
    }
  ],
  "text":" Notifying the Water Company Contact the water company. In most cases, you should let public works or the municipal water company turn your water on for you. You can contact your local water company by calling them or using their online assistance portal. If your water is drawn from a well, you do not need to contact the water company. Ask the water company to start service if you just moved. Contact the company 2 weeks in advance. If possible, ask them to turn the water on the day before you move in. You may need to provide basic identification and a form of payment. Many water companies allow you to turn the water on using an online form. Explain what the problem is if your water stopped unexpectedly. If your water stopped unexpectedly, the water company may be able to tell you why. Some common problems include:\nUnpaid bills. You may be asked to pay your water bill and extra late fees. Neighborhood or city leak. You will have to wait until the leak is fixed. A broken valve. They may send someone to inspect your valve or suggest that you hire a plumber. If the valve is broken, the city must fix it. Request permission to turn the main valve on yourself. The main valve and water meter are the property of your city. Call the water company to get permission to touch or handle the main valve. If you are not allowed to touch the main valve, they will do it for you. You only need permission if you are turning on water for the entire house or property. Appliance supply valves can be turned on or off at your leisure. Turning Supply Valves On Locate the supply shut-off valve near the appliance or fixture. This valve will look like a wheel or a lever. It should be attached to the pipe running out of the device. The wheels are called gate valves while the levers are called ball valves. Some older houses may not have supply shut-off valves for appliances and sinks. In this case, you will need to turn on the water at the main valve. Turn the valve counterclockwise. If it is a gate valve, you may need to do 2 to 4 full turns before it turns on. If it is a ball valve, turn it so that it is parallel with the pipe. You should be able to turn the valve with your hands, but if that is difficult, you can use a wrench to help you. Avoid forcing the valve. If the valve won’t turn, call a plumber. Forcing the valve can cause the pipe to crack, burst, or leak. A plumber will be able to fix or replace the valve for you. Switching on the Main Valve Close all sinks and faucets. You can leave 1 sink on to help equalize the pressure; any sink will work. Turn it on all the way. Otherwise, every other faucet must be turned off all the way in your home. Locate your shut-off valve. In most areas, the valve is located outside. Check outside near the street. You may notice a grate in the ground. If you lift up this grate, you should see a hole with a pipe running through it. If you live in a colder climate, the meter may be inside, either in a basement, utility closet, or near the water heater. To open the grate, you can simply reach down and pick it up. If this is hard to do, insert a wrench in the key hole. Turn it and lift up to remove the grate. Identify the water valve. You may notice a water meter or gauge with 1 or more turn-handles on either side. These handles are the shut-off valves. In newer homes, there may be 2 valves, 1 on either side of the water meter. In this case, use the valve closest to your house, which will be a gate (or wheel-shaped) valve. You can turn this by hand. In older homes, there will be just 1 valve. It will have a notched top that is perpendicular to the pipe. You will need a water key to turn this valve. You can get one at a hardware store. Turn the valve counterclockwise. Start by turning it ¼ of a rotation. Pause for 20 seconds before turning it another ¼. This will allow the water to start running without bursting your pipes. Your water should now work. If the valve is wheel-shaped, you can turn it with your hands or with a wrench. If it has a notched top, use a water key by holding the T-shaped side. Place the other side on top of the notch and turn. If the valve won’t turn, don’t force it. Instead, call a plumber to help. Forcing the valve can cause a leak. Turning Well Water Back On Turn the upper valve at the water pump. You may notice a pipe coming up and over the water pump. It may have a ball valve (which will look like a lever). Turn this so that it is parallel with the pipe. If you have a wheel-shaped gate valve at the bottom of your water pump, do not turn this to the on position. Leave it closed. Locate the electrical switches. In most cases, the electrical power for the well pump will be shut off at the same time as the water itself. You may have 2 switches: one near the pump and one at the main electrical breaker. Check both to see if they have been switched off. Flip the switch on. If you have 2 switches that are turned off, turn on the main electrical switch on first and then turn on the switch next to the pump. Make sure that there is no standing water under or around you. If there is, do not touch the switch. Dry or mop up the water. Your hands must be dry before touching the switch. Otherwise, you may be at risk of electrical shock. Wait for the pump to fill. It will take a few minutes before you can use water. You may hear water in the pipes. As it fills, you can turn on a sink to see if it is working. The sink should sputter and spit for several minutes. If the water doesn't start running, call a plumber. Dewinterizing a House Turn off all faucets. If you winterized the house, you may have left all of the faucets open. Go through the building and turn all of these faucets off for any showers, sinks, or baths you have. If you would like, you can remove the aerators from your sinks to prevent mineral build-up when the water starts. Turn on supply valves. These are the valves underneath your fixtures and water devices, including your sinks, toilets, and water heater. Turn them counterclockwise until they stop. Check the pipes for visible damage. Check every pipe in the building to make sure that no breaks or cracks developed. If you notice any damage, call a plumber to have them repaired. Don’t forget to check your:\nWater heater\nSinks\nToilets\nShowers and baths\nRefrigerator\nWashing machine\nHoses Turn on the water at the main shut-off valve. Once you have checked everywhere for leaks, locate the shut-off valve, either outside or in your home. Turn it a quarter of the way and wait 20 seconds. Then turn it another quarter. Water valves are usually located near the street beneath a grate. If there are 2 valves, use the one closest to your house. If you can't turn the valve by hand, you may need a wrench or a water key. Do not turn the valve on all at once. This could flood your pipes and cause a leak. Check for leaks again. Quickly go back to check all of your fixtures. Look for any water leaking from the pipes from small cracks that you may not have noticed before. If there are any leaks, call a plumber. Turn on faucets one by one. Let the faucet run for about 20 seconds before turning it off. Check for leaks around the pipes again. If there are no leaks, move on to the next faucet. If you notice a leak, call a plumber for repairs.",
  "tyn_model":[
    "water",
    "plumber",
    "water meter",
    "wrench",
    "water heater",
    "water key",
    "water pump",
    "sink",
    "water company",
    "faucets",
    "faucet",
    "meter",
    "toilets",
    "refrigerator",
    "hoses"
  ],
  "tyn_section":[

  ]
}