{
  "title":"How to Lower Swimming Pool pH",
  "url":"https://www.wikihow.com/Lower-Swimming-Pool-pH",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Testing Your Pool’s pH",
      "steps":[
        {
          "headline":"Get a DPD test kit.",
          "description":"While there are many types of kits on the market for testing pool pH (including digital testers and litmus test strips), DPD test kits are among the most accurate. They are also very affordable compared to digital test kits. DPD test kits are available at most department and home supply stores. DPD kits contain a variety of chemicals that change color when mixed with pool water. These chemicals test different pool water qualities, such as pH, total alkalinity, chlorine and bromine levels, and water hardness. Different DPD kits come in different forms. For example, some use liquid reagents, while others use solid tablets. Liquid and tablet test kits are similar in their level of accuracy, but tablets may be easier to use because they do not require precise measurements of liquid reagents. While litmus strip kits are easier to use than DPD kits, DPD kits are more accurate when used correctly. Digital test kits have no obvious mechanism for indicating when test results are inaccurate (e.g., colors that do not match the test chart), so their results can be misleading. Many Digital pH testers do however allow them to be calibrated. If you do use a digital tester, get into the habit of double checking results from time to time with drop based reagents."
        },
        {
          "headline":"Follow the directions on your test kit.",
          "description":"To use a DPD test kit, you will be mixing different chemical reagents with samples of pool water. These chemicals change color when added to pool water, and you must consult the color chart to interpret the results. Read the directions closely to make sure you are using the test kit correctly and that you know how to interpret the results. Make sure you are using the correct reagent to test pH levels. Most kits use Phenol Red for this purpose."
        },
        {
          "headline":"Watch out for false or problematic results.",
          "description":"Most pool pH testers appear more yellow at low pH levels(Below 6.8), and redder at high pH (Above 8.2) levels. However, if your pool water contains very high levels of chlorine(Above 10ppm Chlorine) or bromine, this may interfere with the test and cause it to give unusual results, e.g., turning purple. Very low alkalinity in your pool may also cause the test to give incorrect results. To minimize these problems, test your pool’s chlorine, bromine, and total alkalinity levels before testing pH. Test kits can also give incorrect results if the reagents are stored improperly (e.g., in humid areas or extreme temperatures), or become cross-contaminated due to careless handling."
        },
        {
          "headline":"Test your pool water at least twice a week.",
          "description":"Most pool experts recommend testing your pool 2-3 times a week, particularly during the summer, when the pool is used more frequently. The CDC recommends testing twice a day or even more often at times when your pool is being used every day or by many people throughout the day. Pool pH needs to be checked more frequently when the pool is getting a lot of use, because anything that gets into the pool water (including natural oils from swimmers’ hair and bodies, traces of sunscreen and other body care products, or dirt that gets tracked into the pool) will affect the water’s chemical makeup."
        }
      ]
    },
    {
      "name":"Using Muriatic Acid to Lower pH",
      "steps":[
        {
          "headline":"Purchase muriatic acid formulated for pool use.",
          "description":"Muriatic acid, also known as hydrochloric acid, is a corrosive chemical with a variety of household uses. To ensure that you are getting the right concentration of muriatic acid for use in a pool, purchase a product that is marketed as a pool chemical. Most home and pool supply stores carry muriatic acid for swimming pools."
        },
        {
          "headline":"Read the label instructions carefully.",
          "description":"Different products are sold in varying concentrations and forms. Some muriatic acid pH reducers are sold as pre-mixed liquid solutions, while others come in granular form. Read all safety precautions and make sure you understand exactly how to use your specific product before you add it to the pool. Some forms of muriatic acid can be added directly to the pool, while others may need to be diluted in a bucket of water before use."
        },
        {
          "headline":"Take proper safety precautions.",
          "description":"Even diluted muriatic acid can burn your skin and eyes. It can also irritate your nose, throat and lungs if you inhale the fumes. Before you work with muriatic acid, put on rubber gloves, and wear clothes that cover your arms, legs, and feet. Wear a respirator mask and safety goggles. Always work with the acid in a well-ventilated area. If you get muriatic acid in your eyes, immediately flush them with fresh, cold water for at least 15 minutes, then seek medical attention. If you get the acid on your skin, rinse your skin with fresh, cold water for at least 15 minutes, and remove any clothing that might have gotten acid on it. When you are done, seek medical attention. Get medical attention immediately if you swallow any of the acid or inhale the fumes."
        },
        {
          "headline":"Determine how much acid to add.",
          "description":"Check the instructions on the muriatic acid product label to find out how much acid to add based on the size of your pool and the current pH of your pool water. Try adding about ¾ of the recommended amount to prevent lowering the pH of your pool too much. You can also estimate how much acid to add by using an online pool calculator like this one: http://poolcalculator.com/."
        },
        {
          "headline":"Pour the acid into your pool over a return jet.",
          "description":"With the return jet running and the vent facing down, slowly and carefully pour the required amount of acid into the water directly over the jet. The return flow will distribute the acid evenly throughout the pool. Hold your container close to the water as you pour in order to minimize splashing. Be careful not to let the acid run over any pool fixtures or directly contact the wall of the pool."
        },
        {
          "headline":"Test the pool’s pH again after 4 hours.",
          "description":"Once the muriatic acid has had time to circulate, test the pH level again. If it’s still too high, repeat the procedure, using the recommended amount of acid for the new current pH level."
        },
        {
          "headline":"Wait at least 4 hours since the last application of acid before swimming.",
          "description":"The acid should have plenty of time to become evenly distributed in the water before anyone gets into the pool. Otherwise, you run the risk of encountering “pockets” of concentrated acid in the water. Keep the pump on and the jets running while you are waiting for the acid to work its way through the water."
        }
      ]
    },
    {
      "name":"Lowering pH with Sodium Bisulfate",
      "steps":[
        {
          "headline":"Buy sodium bisulfate or “dry acid” for the pool.",
          "description":"Sodium bisulfate is an acid that is sold in granular or powdered form. It has the advantage of being a bit safer and gentler than muriatic acid. Sodium bisulfate for pools is available at most home and pool supply stores."
        },
        {
          "headline":"Follow the instructions on the package.",
          "description":"Different manufacturers may provide different instructions for use. In some cases, it may be necessary to dissolve the sodium bisulfate in water before adding it to the pool, while other products may be added directly to the pool water in powdered form."
        },
        {
          "headline":"Determine how much sodium bisulfate to add.",
          "description":"Follow the manufacturer’s instructions to figure out the correct amount of sodium bisulfate based on your pool’s size and the current pH of your water. You may wish to use ¾ of the recommended amount in order to avoid lowering the pH of your pool too much. You can also use a pool calculator, such as this one: http://poolcalculator.com/."
        },
        {
          "headline":"Use safety precautions.",
          "description":"Sodium bisulfate is relatively gentle, but it can still cause serious burns and irritation. Wear gloves and clothing that covers your skin, such as a long-sleeved shirt and long pants. Always work in a well-ventilated area. If you are concerned about the wind blowing acid granules into your face, wear protective goggles or a face shield. If you get sodium bisulfate on your skin, wash thoroughly with soap and water. Go to the doctor if you experience skin irritation that doesn’t go away after washing. If you get any sodium bisulfate in your eyes, rinse with cold water for at least 15 minutes and then get medical attention. If you swallow any of the powder, rinse your mouth out with water and drink at least one tall glass of water. Seek medical attention immediately."
        },
        {
          "headline":"Pour the dry acid into the pool over the return jets.",
          "description":"With the pump running and the jets on, slowly add the acid to the pool water directly over the return jets. Take care to keep the powder away from the skimmer. Get close to the water when you pour, and take care not to let the wind blow any of the powder back onto you."
        },
        {
          "headline":"Wait a few hours and re-test your pool’s pH.",
          "description":"Give the acid at least 4 hours to circulate, then test again. Since sodium bisulfate can also decrease your pool’s total alkalinity, it is important to test that as well and make sure it is still within an acceptable range. Make any necessary adjustments based on the results of the test. Don’t wait longer than 24 hours after adding the dry acid before re-testing your pool’s pH levels."
        },
        {
          "headline":"Add an alkalinity booster, if necessary.",
          "description":"If your pool’s total alkalinity level is too low after adding sodium bisulfate, raise it by adding an alkalinity increaser, such as baking soda or sodium sesquicarbonate, to the water. Alkalinity boosters for pool use are available in most pool and home supply stores. Soda ash can also raise your pool’s alkalinity, but may cause the water’s pH to become too high again. Follow the manufacturer’s instructions to determine how much of any alkalinity booster to add to your pool based on the size of the pool and the current alkalinity level. If you are using plain baking soda, you can use a pool calculator, like this one: http://poolcalculator.com/."
        },
        {
          "headline":"Wait at least 4 hours before swimming.",
          "description":"Although sodium bisulfate is relatively gentle, it can still irritate your skin and eyes. Give the acid plenty of time to dissolve and circulate throughout the pool before you jump in."
        }
      ]
    },
    {
      "name":"Installing a CO2 System in Your Pool",
      "steps":[
        {
          "headline":"Purchase a CO2 system for safer pH control.",
          "description":"Carbon dioxide, or CO2, can safely and effectively lower and stabilize your pool’s pH. A variety of CO2 systems for pools are available, some of which can automatically analyze your pool’s pH and adjust their output accordingly. These devices are available through specialty pool and spa supply stores. Some CO2 systems are fully automated, while others have to be controlled manually. Consult a specialist at a pool supply store to determine what type of CO2 system is best for your pool. These systems can be expensive, ranging in price from $300-$10,000 USD. However, a CO2 system may ultimately save you money, since it minimizes the need for frequent pH and chlorine adjustments."
        },
        {
          "headline":"Have a professional install your system.",
          "description":"Unless you have a lot of experience installing pool equipment, it is probably best to have a pool technician install the CO2 system for you. Consider consulting a professional before you purchase a CO2 system, so that they can help you determine whether the system is a good fit for your pool."
        },
        {
          "headline":"Avoid using a CO2 system if your water is hard or high in total alkalinity.",
          "description":"Since CO2 can raise your pool’s total alkalinity, it is best not to use a CO2 system if your water already has a high total alkalinity (i.e., if water tests reveal it is over 125 ppm). CO2 is also less effective at lowering pH if your water is hard. Consult a pool technician to determine if your water conditions are right for a CO2 system."
        }
      ]
    }
  ],
  "text":" Testing Your Pool’s pH Get a DPD test kit. While there are many types of kits on the market for testing pool pH (including digital testers and litmus test strips), DPD test kits are among the most accurate. They are also very affordable compared to digital test kits. DPD test kits are available at most department and home supply stores. DPD kits contain a variety of chemicals that change color when mixed with pool water. These chemicals test different pool water qualities, such as pH, total alkalinity, chlorine and bromine levels, and water hardness. Different DPD kits come in different forms. For example, some use liquid reagents, while others use solid tablets. Liquid and tablet test kits are similar in their level of accuracy, but tablets may be easier to use because they do not require precise measurements of liquid reagents. While litmus strip kits are easier to use than DPD kits, DPD kits are more accurate when used correctly. Digital test kits have no obvious mechanism for indicating when test results are inaccurate (e.g., colors that do not match the test chart), so their results can be misleading. Many Digital pH testers do however allow them to be calibrated. If you do use a digital tester, get into the habit of double checking results from time to time with drop based reagents. Follow the directions on your test kit. To use a DPD test kit, you will be mixing different chemical reagents with samples of pool water. These chemicals change color when added to pool water, and you must consult the color chart to interpret the results. Read the directions closely to make sure you are using the test kit correctly and that you know how to interpret the results. Make sure you are using the correct reagent to test pH levels. Most kits use Phenol Red for this purpose. Watch out for false or problematic results. Most pool pH testers appear more yellow at low pH levels(Below 6.8), and redder at high pH (Above 8.2) levels. However, if your pool water contains very high levels of chlorine(Above 10ppm Chlorine) or bromine, this may interfere with the test and cause it to give unusual results, e.g., turning purple. Very low alkalinity in your pool may also cause the test to give incorrect results. To minimize these problems, test your pool’s chlorine, bromine, and total alkalinity levels before testing pH. Test kits can also give incorrect results if the reagents are stored improperly (e.g., in humid areas or extreme temperatures), or become cross-contaminated due to careless handling. Test your pool water at least twice a week. Most pool experts recommend testing your pool 2-3 times a week, particularly during the summer, when the pool is used more frequently. The CDC recommends testing twice a day or even more often at times when your pool is being used every day or by many people throughout the day. Pool pH needs to be checked more frequently when the pool is getting a lot of use, because anything that gets into the pool water (including natural oils from swimmers’ hair and bodies, traces of sunscreen and other body care products, or dirt that gets tracked into the pool) will affect the water’s chemical makeup. Using Muriatic Acid to Lower pH Purchase muriatic acid formulated for pool use. Muriatic acid, also known as hydrochloric acid, is a corrosive chemical with a variety of household uses. To ensure that you are getting the right concentration of muriatic acid for use in a pool, purchase a product that is marketed as a pool chemical. Most home and pool supply stores carry muriatic acid for swimming pools. Read the label instructions carefully. Different products are sold in varying concentrations and forms. Some muriatic acid pH reducers are sold as pre-mixed liquid solutions, while others come in granular form. Read all safety precautions and make sure you understand exactly how to use your specific product before you add it to the pool. Some forms of muriatic acid can be added directly to the pool, while others may need to be diluted in a bucket of water before use. Take proper safety precautions. Even diluted muriatic acid can burn your skin and eyes. It can also irritate your nose, throat and lungs if you inhale the fumes. Before you work with muriatic acid, put on rubber gloves, and wear clothes that cover your arms, legs, and feet. Wear a respirator mask and safety goggles. Always work with the acid in a well-ventilated area. If you get muriatic acid in your eyes, immediately flush them with fresh, cold water for at least 15 minutes, then seek medical attention. If you get the acid on your skin, rinse your skin with fresh, cold water for at least 15 minutes, and remove any clothing that might have gotten acid on it. When you are done, seek medical attention. Get medical attention immediately if you swallow any of the acid or inhale the fumes. Determine how much acid to add. Check the instructions on the muriatic acid product label to find out how much acid to add based on the size of your pool and the current pH of your pool water. Try adding about ¾ of the recommended amount to prevent lowering the pH of your pool too much. You can also estimate how much acid to add by using an online pool calculator like this one: http://poolcalculator.com/. Pour the acid into your pool over a return jet. With the return jet running and the vent facing down, slowly and carefully pour the required amount of acid into the water directly over the jet. The return flow will distribute the acid evenly throughout the pool. Hold your container close to the water as you pour in order to minimize splashing. Be careful not to let the acid run over any pool fixtures or directly contact the wall of the pool. Test the pool’s pH again after 4 hours. Once the muriatic acid has had time to circulate, test the pH level again. If it’s still too high, repeat the procedure, using the recommended amount of acid for the new current pH level. Wait at least 4 hours since the last application of acid before swimming. The acid should have plenty of time to become evenly distributed in the water before anyone gets into the pool. Otherwise, you run the risk of encountering “pockets” of concentrated acid in the water. Keep the pump on and the jets running while you are waiting for the acid to work its way through the water. Lowering pH with Sodium Bisulfate Buy sodium bisulfate or “dry acid” for the pool. Sodium bisulfate is an acid that is sold in granular or powdered form. It has the advantage of being a bit safer and gentler than muriatic acid. Sodium bisulfate for pools is available at most home and pool supply stores. Follow the instructions on the package. Different manufacturers may provide different instructions for use. In some cases, it may be necessary to dissolve the sodium bisulfate in water before adding it to the pool, while other products may be added directly to the pool water in powdered form. Determine how much sodium bisulfate to add. Follow the manufacturer’s instructions to figure out the correct amount of sodium bisulfate based on your pool’s size and the current pH of your water. You may wish to use ¾ of the recommended amount in order to avoid lowering the pH of your pool too much. You can also use a pool calculator, such as this one: http://poolcalculator.com/. Use safety precautions. Sodium bisulfate is relatively gentle, but it can still cause serious burns and irritation. Wear gloves and clothing that covers your skin, such as a long-sleeved shirt and long pants. Always work in a well-ventilated area. If you are concerned about the wind blowing acid granules into your face, wear protective goggles or a face shield. If you get sodium bisulfate on your skin, wash thoroughly with soap and water. Go to the doctor if you experience skin irritation that doesn’t go away after washing. If you get any sodium bisulfate in your eyes, rinse with cold water for at least 15 minutes and then get medical attention. If you swallow any of the powder, rinse your mouth out with water and drink at least one tall glass of water. Seek medical attention immediately. Pour the dry acid into the pool over the return jets. With the pump running and the jets on, slowly add the acid to the pool water directly over the return jets. Take care to keep the powder away from the skimmer. Get close to the water when you pour, and take care not to let the wind blow any of the powder back onto you. Wait a few hours and re-test your pool’s pH. Give the acid at least 4 hours to circulate, then test again. Since sodium bisulfate can also decrease your pool’s total alkalinity, it is important to test that as well and make sure it is still within an acceptable range. Make any necessary adjustments based on the results of the test. Don’t wait longer than 24 hours after adding the dry acid before re-testing your pool’s pH levels. Add an alkalinity booster, if necessary. If your pool’s total alkalinity level is too low after adding sodium bisulfate, raise it by adding an alkalinity increaser, such as baking soda or sodium sesquicarbonate, to the water. Alkalinity boosters for pool use are available in most pool and home supply stores. Soda ash can also raise your pool’s alkalinity, but may cause the water’s pH to become too high again. Follow the manufacturer’s instructions to determine how much of any alkalinity booster to add to your pool based on the size of the pool and the current alkalinity level. If you are using plain baking soda, you can use a pool calculator, like this one: http://poolcalculator.com/. Wait at least 4 hours before swimming. Although sodium bisulfate is relatively gentle, it can still irritate your skin and eyes. Give the acid plenty of time to dissolve and circulate throughout the pool before you jump in. Installing a CO2 System in Your Pool Purchase a CO2 system for safer pH control. Carbon dioxide, or CO2, can safely and effectively lower and stabilize your pool’s pH. A variety of CO2 systems for pools are available, some of which can automatically analyze your pool’s pH and adjust their output accordingly. These devices are available through specialty pool and spa supply stores. Some CO2 systems are fully automated, while others have to be controlled manually. Consult a specialist at a pool supply store to determine what type of CO2 system is best for your pool. These systems can be expensive, ranging in price from $300-$10,000 USD. However, a CO2 system may ultimately save you money, since it minimizes the need for frequent pH and chlorine adjustments. Have a professional install your system. Unless you have a lot of experience installing pool equipment, it is probably best to have a pool technician install the CO2 system for you. Consider consulting a professional before you purchase a CO2 system, so that they can help you determine whether the system is a good fit for your pool. Avoid using a CO2 system if your water is hard or high in total alkalinity. Since CO2 can raise your pool’s total alkalinity, it is best not to use a CO2 system if your water already has a high total alkalinity (i.e., if water tests reveal it is over 125 ppm). CO2 is also less effective at lowering pH if your water is hard. Consult a pool technician to determine if your water conditions are right for a CO2 system.",
  "tyn_model":[
    "water",
    "muriatic acid",
    "sodium bisulfate",
    "co2 system",
    "acid",
    "pool water",
    "pool",
    "chlorine",
    "co2",
    "dpd kits",
    "baking soda",
    "co2 systems",
    "pool technician",
    "dpd test kit",
    "litmus test strips",
    "dpd test kits",
    "litmus strip kits",
    "digital ph testers",
    "phenol red",
    "pool ph testers",
    "bromine",
    "’ hair",
    "hydrochloric acid",
    "ph reducers",
    "rubber gloves",
    "respirator mask",
    "container",
    "“pockets",
    "” of",
    "“dry",
    "” for",
    "pool calculator",
    "gloves",
    "protective goggles",
    "face shield",
    "soap",
    "sodium sesquicarbonate,",
    "soda ash",
    "carbon dioxide",
    "pool supply store",
    "pool equipment"
  ],
  "tyn_section":[

  ]
}