{
  "title":"How to Find a Yellow Jacket Nest",
  "url":"https://www.wikihow.com/Find-a-Yellow-Jacket-Nest",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Bee and Wasp Control"
  ],
  "methods":[
    {
      "name":"Tracking a Yellow Jacket Nest",
      "steps":[
        {
          "headline":"Start your search after 10 am.",
          "description":"Yellow jackets are most active between 10 am and 4 pm. It’s therefore easiest to find them flying the paths between their food sources and nests at this time. If it’s very hot or very cold, keep in mind that this timeframe might be shortened, as yellow jackets tend to be less active during extreme temperatures."
        },
        {
          "headline":"Search for holes in the ground of your property.",
          "description":"Yellow jackets tend to build nests partially underground, usually in old gopher holes. They can also build nests in wood piles and dense vegetation. Walk your property, looking for holes, as well as other ground areas where nests might exist. If you see yellow jackets flying near such areas, or a large number of yellow jackets crawling around protecting a certain area, you’ve probably found a nest."
        },
        {
          "headline":"Look for yellow jackets flying in a straight path.",
          "description":"Regardless of where their nests are located, wasps will fly in a straight line from their nest to their food sources. Stand still near where you’ve seen the yellow jackets, and look across the part of that area that’s in full sun. Look for any insects flying quickly by in a straight line – they should stand out in the direct sun. Keep looking if you see one – if you see more, you’re probably seeing them emerge from or going back to their nest and you can track the nest that way."
        },
        {
          "headline":"Lure the yellow jackets with food.",
          "description":"If you can’t spot any yellow jackets flying, you can try luring them with food and then following them back to their nests. Place the food in a shallow dish near where you think nests might be, and then watch the food trap. Yellow jackets should eventually show up near the food. Once they do, follow their path back to their nests. You can use protein-based baits, including tuna-flavored canned cat food, chicken skin, cold cuts, and ground meat. In the summer, sugar baits might work better. Try fruit juice, grenadine, ice cream, or a bit of fruit jelly."
        },
        {
          "headline":"Mark nests as you find them.",
          "description":"As you find the nests, mark them. Spray painting an “x” near the location is best, since you can do it from a distance away and the paint will eventually wash off of your yard or any buildings. Don’t try to mark the nest directly – spraying it or poking a marker flag into it can upset the colony and cause the yellow jackets to swarm and attack you."
        }
      ]
    },
    {
      "name":"Treating a Yellow Jacket Nest",
      "steps":[
        {
          "headline":"Treat the nests at night.",
          "description":"Most worker yellow jackets return to the nest at sunset, so treating the nest after that should kill the most yellow jackets possible. Plan to treat the nest about 45 minutes after sunset. If you have to treat during the day, remember that you may have to treat the nest multiple times. After you’ve treated the nest, you can leave insecticide dust at the entrance of the nest. That should kill any returning yellow jackets that weren’t already in the nest."
        },
        {
          "headline":"Use a quick freeze wasp spray on aerial nests.",
          "description":"Aerial yellow jacket nests are the easiest to spot – they’re usually hanging from the eaves of houses or garages, trees, or electric or light poles. Standing as far away as possible, point the spray at the nest and saturate the nest with spray. Make sure to get the nest opening as well. The nest should be completely coated. You can find these quick freeze sprays in most home improvement stores, or in the \"home\" section of your grocery store. Most quick freeze sprays work 10 to 15 feet (3 to 5 m) away, so you shouldn’t need a ladder unless you’ve found a nest that’s very, very high up."
        },
        {
          "headline":"Use quick freeze spray and insecticide dust on ground nests.",
          "description":"A spray won’t completely saturate a nest that’s partially underground, so you’ll need to use a 2-part system. First, spray the nest entrance and as much of the nest as you can see. Then sprinkle an insecticide dust labeled for use on wasps at the entrance. That should kill any yellow jackets that try to leave or return to the nest. You may need to wait a few minutes after spraying the nest to use the dust. Once you spray the nest, a few yellow jackets may fly out of the nest, so you don’t want your hands anywhere near there!"
        },
        {
          "headline":"Hire a professional pest company for difficult nests.",
          "description":"If you find a nest in a place that’s difficult to reach, or you suspect that a yellow jacket nest has been built in a void in your walls, call a professional pest removal company. They’ll know how to find the nest and exactly how to treat it to keep you and your home safe."
        },
        {
          "headline":"Remain calm if you're swarmed.",
          "description":"If you disturb a yellow jacket nest, they may swarm you. If that happens, try to remain as calm as possible - if you run or flail, it can increase the yellow jackets' aggressiveness. As calmly as possible, walk away from the place were you were swarmed, and get inside somewhere if you can."
        },
        {
          "headline":"Apply meat tenderizer to a sting.",
          "description":"If you're stung by a yellow jacket, make a paste with meat tenderizer and a few drops of water. Use a cotton ball to apply the paste to the sting. You can leave the paste on for up to 20 minutes. Don't use this paste near your eyes. If you don't have meat tenderizer, you can make a paste with baking soda to apply to the sting. If the meat tenderizer or baking soda doesn't work, hold an ice cube to the sting for 20 minutes."
        }
      ]
    }
  ],
  "text":" Tracking a Yellow Jacket Nest Start your search after 10 am. Yellow jackets are most active between 10 am and 4 pm. It’s therefore easiest to find them flying the paths between their food sources and nests at this time. If it’s very hot or very cold, keep in mind that this timeframe might be shortened, as yellow jackets tend to be less active during extreme temperatures. Search for holes in the ground of your property. Yellow jackets tend to build nests partially underground, usually in old gopher holes. They can also build nests in wood piles and dense vegetation. Walk your property, looking for holes, as well as other ground areas where nests might exist. If you see yellow jackets flying near such areas, or a large number of yellow jackets crawling around protecting a certain area, you’ve probably found a nest. Look for yellow jackets flying in a straight path. Regardless of where their nests are located, wasps will fly in a straight line from their nest to their food sources. Stand still near where you’ve seen the yellow jackets, and look across the part of that area that’s in full sun. Look for any insects flying quickly by in a straight line – they should stand out in the direct sun. Keep looking if you see one – if you see more, you’re probably seeing them emerge from or going back to their nest and you can track the nest that way. Lure the yellow jackets with food. If you can’t spot any yellow jackets flying, you can try luring them with food and then following them back to their nests. Place the food in a shallow dish near where you think nests might be, and then watch the food trap. Yellow jackets should eventually show up near the food. Once they do, follow their path back to their nests. You can use protein-based baits, including tuna-flavored canned cat food, chicken skin, cold cuts, and ground meat. In the summer, sugar baits might work better. Try fruit juice, grenadine, ice cream, or a bit of fruit jelly. Mark nests as you find them. As you find the nests, mark them. Spray painting an “x” near the location is best, since you can do it from a distance away and the paint will eventually wash off of your yard or any buildings. Don’t try to mark the nest directly – spraying it or poking a marker flag into it can upset the colony and cause the yellow jackets to swarm and attack you. Treating a Yellow Jacket Nest Treat the nests at night. Most worker yellow jackets return to the nest at sunset, so treating the nest after that should kill the most yellow jackets possible. Plan to treat the nest about 45 minutes after sunset. If you have to treat during the day, remember that you may have to treat the nest multiple times. After you’ve treated the nest, you can leave insecticide dust at the entrance of the nest. That should kill any returning yellow jackets that weren’t already in the nest. Use a quick freeze wasp spray on aerial nests. Aerial yellow jacket nests are the easiest to spot – they’re usually hanging from the eaves of houses or garages, trees, or electric or light poles. Standing as far away as possible, point the spray at the nest and saturate the nest with spray. Make sure to get the nest opening as well. The nest should be completely coated. You can find these quick freeze sprays in most home improvement stores, or in the \"home\" section of your grocery store. Most quick freeze sprays work 10 to 15 feet (3 to 5 m) away, so you shouldn’t need a ladder unless you’ve found a nest that’s very, very high up. Use quick freeze spray and insecticide dust on ground nests. A spray won’t completely saturate a nest that’s partially underground, so you’ll need to use a 2-part system. First, spray the nest entrance and as much of the nest as you can see. Then sprinkle an insecticide dust labeled for use on wasps at the entrance. That should kill any yellow jackets that try to leave or return to the nest. You may need to wait a few minutes after spraying the nest to use the dust. Once you spray the nest, a few yellow jackets may fly out of the nest, so you don’t want your hands anywhere near there! Hire a professional pest company for difficult nests. If you find a nest in a place that’s difficult to reach, or you suspect that a yellow jacket nest has been built in a void in your walls, call a professional pest removal company. They’ll know how to find the nest and exactly how to treat it to keep you and your home safe. Remain calm if you're swarmed. If you disturb a yellow jacket nest, they may swarm you. If that happens, try to remain as calm as possible - if you run or flail, it can increase the yellow jackets' aggressiveness. As calmly as possible, walk away from the place were you were swarmed, and get inside somewhere if you can. Apply meat tenderizer to a sting. If you're stung by a yellow jacket, make a paste with meat tenderizer and a few drops of water. Use a cotton ball to apply the paste to the sting. You can leave the paste on for up to 20 minutes. Don't use this paste near your eyes. If you don't have meat tenderizer, you can make a paste with baking soda to apply to the sting. If the meat tenderizer or baking soda doesn't work, hold an ice cube to the sting for 20 minutes.",
  "tyn_model":[
    "yellow jackets",
    "yellow jacket",
    "food",
    "insecticide dust",
    "meat tenderizer",
    "wasps",
    "– they",
    "quick freeze sprays",
    "baking soda",
    "insects",
    "– if",
    "chicken skin",
    "cold cuts",
    "ground meat",
    "fruit juice",
    "grenadine",
    "ice cream",
    "fruit jelly",
    "“x",
    "” near",
    "paint",
    "– spraying",
    "marker flag",
    "freeze wasp",
    "ladder",
    "quick freeze spray",
    "pest removal company",
    "water",
    "cotton ball",
    "ice cube"
  ],
  "tyn_section":[

  ]
}