{
  "title":"How to Ship Beer",
  "url":"https://www.wikihow.com/Ship-Beer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Beer and Cider"
  ],
  "parts":[
    {
      "name":"Wrapping the Beer",
      "steps":[
        {
          "headline":"Put each bottle or can in its own gallon-size sealable plastic bag.",
          "description":"That way, if one of them breaks open during shipment, the beer will stay in the plastic bag instead of soaking through the box. Before you seal the bags shut, press out the excess air using your hands. If you're shipping a pack of beer, like a 6-pack, remove all the beers from the pack and bag them individually."
        },
        {
          "headline":"Cut a 2 foot (61 cm) strip of bubble wrap for each beer.",
          "description":"The bubble wrap strips should be about 1 foot (30 cm) wide. You can find a roll of bubble wrap at your local packaging store."
        },
        {
          "headline":"Roll each beer up in a bubble wrap strip.",
          "description":"To roll up the beers, grab one of the plastic bags with a beer in it and lay it on top of a bubble wrap strip. The long side of the beer should be lined up with one of the ends of the strip. Then, grab the edge of the bubble wrap that the beer is next to and roll the beer and bubble wrap down the length of the strip. When you reach the end, wrap 2-3 rubber bands around the bubble wrap and beer to hold the bubble wrap in place. Repeat with all of the beers."
        }
      ]
    },
    {
      "name":"Packing the Beer",
      "steps":[
        {
          "headline":"Use a thick, sturdy box to package the beer in.",
          "description":"Avoid thin, flimsy boxes that won't do a good job of protecting your beers. Look for heavy duty shipping boxes online or at your local packaging store. If you don’t have a sturdy box to use, put one box inside of a slightly larger box so there are 2 layers of protection."
        },
        {
          "headline":"Line the box with bubble wrap.",
          "description":"Cut out a strip of bubble wrap that’s large enough to cover the bottom of the box. Then, cut out 4 more strips you can use to line the sides. Place the bottom strip of bubble wrap in the box first, followed by the strips that go on the sides. For extra padding, cut out twice as many strips of bubble wrap and double layer them in the box. If you don’t have any more bubble wrap to use, you can line the box with styrofoam instead."
        },
        {
          "headline":"Pack the beers tightly in the box.",
          "description":"If you’re shipping both bottles and cans, pack the bottles on the bottom and the cans on top. Pack the beers so there’s no room between them. Otherwise, they may shift around in the box and break. If there’s space between the beers, fill it with bubble wrap."
        },
        {
          "headline":"Fill in the top of the box with bubble wrap or packing peanuts.",
          "description":"That way the beers won’t shift when the box gets turned upside down during shipping. If you’re using bubble wrap, keep layering strips over the top of the packed beer until the bubble wrap reaches the top edge of the box. If you’re using packing peanuts, continue pouring the peanuts over the packed beer until they come up to the top of the box."
        },
        {
          "headline":"Seal the box closed with shipping tape.",
          "description":"Close the flaps at the top of the box and run a strip of tape along the seam. Run 2 or 3 more strips of tape around the whole box so it doesn’t open while it’s being shipped."
        }
      ]
    },
    {
      "name":"Shipping the Package",
      "steps":[
        {
          "headline":"Choose a service to deliver your package.",
          "description":"Some postal services and shipping companies prohibit the shipment of alcohol. Call or visit their website beforehand to find out their policy. You can also inquire about shipping costs to see which service is the most affordable. Look for couriers that offer tracking so you’re able to keep track of your package as it’s being shipped."
        },
        {
          "headline":"Attach a shipping label to the outside of the box.",
          "description":"Some postal services and shipping companies let you print your shipping labels at home after you pay the cost of shipping online. If not, you’ll need to go into the post office or shipping location to get your shipping label. Your shipping label should include your name and address, as well as the name and address of the person you’re sending the beer to."
        },
        {
          "headline":"Drop off your package to be delivered.",
          "description":"With most postal services and shipping companies, you’ll need to bring your package into one of their locations to be shipped. When you arrive, be prepared to pay for the cost of shipping and to attach your shipping label if you haven’t already. Then, just leave your package with the courier and you’re finished! If you received a tracking number, visit the courier’s website and enter it to see how far your package has gotten and when it’s going to be delivered."
        }
      ]
    }
  ],
  "text":" Wrapping the Beer Put each bottle or can in its own gallon-size sealable plastic bag. That way, if one of them breaks open during shipment, the beer will stay in the plastic bag instead of soaking through the box. Before you seal the bags shut, press out the excess air using your hands. If you're shipping a pack of beer, like a 6-pack, remove all the beers from the pack and bag them individually. Cut a 2 foot (61 cm) strip of bubble wrap for each beer. The bubble wrap strips should be about 1 foot (30 cm) wide. You can find a roll of bubble wrap at your local packaging store. Roll each beer up in a bubble wrap strip. To roll up the beers, grab one of the plastic bags with a beer in it and lay it on top of a bubble wrap strip. The long side of the beer should be lined up with one of the ends of the strip. Then, grab the edge of the bubble wrap that the beer is next to and roll the beer and bubble wrap down the length of the strip. When you reach the end, wrap 2-3 rubber bands around the bubble wrap and beer to hold the bubble wrap in place. Repeat with all of the beers. Packing the Beer Use a thick, sturdy box to package the beer in. Avoid thin, flimsy boxes that won't do a good job of protecting your beers. Look for heavy duty shipping boxes online or at your local packaging store. If you don’t have a sturdy box to use, put one box inside of a slightly larger box so there are 2 layers of protection. Line the box with bubble wrap. Cut out a strip of bubble wrap that’s large enough to cover the bottom of the box. Then, cut out 4 more strips you can use to line the sides. Place the bottom strip of bubble wrap in the box first, followed by the strips that go on the sides. For extra padding, cut out twice as many strips of bubble wrap and double layer them in the box. If you don’t have any more bubble wrap to use, you can line the box with styrofoam instead. Pack the beers tightly in the box. If you’re shipping both bottles and cans, pack the bottles on the bottom and the cans on top. Pack the beers so there’s no room between them. Otherwise, they may shift around in the box and break. If there’s space between the beers, fill it with bubble wrap. Fill in the top of the box with bubble wrap or packing peanuts. That way the beers won’t shift when the box gets turned upside down during shipping. If you’re using bubble wrap, keep layering strips over the top of the packed beer until the bubble wrap reaches the top edge of the box. If you’re using packing peanuts, continue pouring the peanuts over the packed beer until they come up to the top of the box. Seal the box closed with shipping tape. Close the flaps at the top of the box and run a strip of tape along the seam. Run 2 or 3 more strips of tape around the whole box so it doesn’t open while it’s being shipped. Shipping the Package Choose a service to deliver your package. Some postal services and shipping companies prohibit the shipment of alcohol. Call or visit their website beforehand to find out their policy. You can also inquire about shipping costs to see which service is the most affordable. Look for couriers that offer tracking so you’re able to keep track of your package as it’s being shipped. Attach a shipping label to the outside of the box. Some postal services and shipping companies let you print your shipping labels at home after you pay the cost of shipping online. If not, you’ll need to go into the post office or shipping location to get your shipping label. Your shipping label should include your name and address, as well as the name and address of the person you’re sending the beer to. Drop off your package to be delivered. With most postal services and shipping companies, you’ll need to bring your package into one of their locations to be shipped. When you arrive, be prepared to pay for the cost of shipping and to attach your shipping label if you haven’t already. Then, just leave your package with the courier and you’re finished! If you received a tracking number, visit the courier’s website and enter it to see how far your package has gotten and when it’s going to be delivered.",
  "tyn_model":[
    "bubble wrap",
    "beer",
    "packing peanuts",
    "tape",
    "courier",
    "sealable plastic bag",
    "plastic bag",
    "plastic bags",
    "rubber bands",
    "styrofoam",
    "peanuts",
    "shipping tape",
    "alcohol"
  ],
  "tyn_section":[

  ]
}