{
  "title":"How to Make Chocolate Mint Brownies",
  "url":"https://www.wikihow.com/Make-Chocolate-Mint-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "parts":[
    {
      "name":"Making the Base",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F.",
          "description":"If you're using a non-stick or dark pan, you'll only need to preheat it to 325°F."
        },
        {
          "headline":"Use cooking spray or shortening to grease a 13-by−9 inch (−23 cm) pan.",
          "description":"Make sure you're greasing only the bottom, not the top. If you add foil to the pan and grease the foil, you won't have such a hard time with the greasing."
        },
        {
          "headline":"Follow the instructions for the brownie mix.",
          "description":"Refer to the box for the proper instructions."
        }
      ]
    },
    {
      "name":"Making the Filling",
      "steps":[
        {
          "headline":"Take out a large bowl.",
          "description":"Gather the cream cheese and softened butter (for the filling), then place them into the bowl."
        },
        {
          "headline":"Use an electric mixer to beat the above ingredients.",
          "description":"The electric mixer should smoothen them."
        },
        {
          "headline":"Incorporate whipped cream into the mixture.",
          "description":"Continue beating until the mixture comes together, smoothened and blended."
        },
        {
          "headline":"Incorporate powdered sugar and continue blending.",
          "description":""
        },
        {
          "headline":"Insert food coloring and mint extract (unless you are using mint leaves).",
          "description":"Mix together until blended."
        },
        {
          "headline":"Disperse the filling onto the brownies (once the brownies are cool enough).",
          "description":"Chill in the refrigerator for about one hour at least."
        }
      ]
    },
    {
      "name":"Preparing the Topping",
      "steps":[
        {
          "headline":"Take out a non-stick saucepan of two quarts.",
          "description":""
        },
        {
          "headline":"Gather the whipping cream, semisweet chocolate chips and butter.",
          "description":"Place them on medium-low heat. Stir consistently until completely melted."
        },
        {
          "headline":"Allow the mixture to cool.",
          "description":"Let it sit for at least 10 minutes."
        },
        {
          "headline":"Disperse the topping over the filling.",
          "description":"Then, chill in the fridge for at least two hours."
        },
        {
          "headline":"Remove the brownie mixture from the refrigerator.",
          "description":"Let it sit for a bit before cutting."
        },
        {
          "headline":"Refrigerate the brownies one last time, and then serve.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Base Preheat your oven to 350°F. If you're using a non-stick or dark pan, you'll only need to preheat it to 325°F. Use cooking spray or shortening to grease a 13-by−9 inch (−23 cm) pan. Make sure you're greasing only the bottom, not the top. If you add foil to the pan and grease the foil, you won't have such a hard time with the greasing. Follow the instructions for the brownie mix. Refer to the box for the proper instructions. Making the Filling Take out a large bowl. Gather the cream cheese and softened butter (for the filling), then place them into the bowl. Use an electric mixer to beat the above ingredients. The electric mixer should smoothen them. Incorporate whipped cream into the mixture. Continue beating until the mixture comes together, smoothened and blended. Incorporate powdered sugar and continue blending.  Insert food coloring and mint extract (unless you are using mint leaves). Mix together until blended. Disperse the filling onto the brownies (once the brownies are cool enough). Chill in the refrigerator for about one hour at least. Preparing the Topping Take out a non-stick saucepan of two quarts.  Gather the whipping cream, semisweet chocolate chips and butter. Place them on medium-low heat. Stir consistently until completely melted. Allow the mixture to cool. Let it sit for at least 10 minutes. Disperse the topping over the filling. Then, chill in the fridge for at least two hours. Remove the brownie mixture from the refrigerator. Let it sit for a bit before cutting. Refrigerate the brownies one last time, and then serve. ",
  "tyn_model":[
    "foil",
    "butter",
    "electric mixer",
    "refrigerator",
    "oven",
    "cooking spray",
    "shortening",
    "large bowl",
    "cream cheese",
    "bowl",
    "whipped cream",
    "powdered sugar",
    "food coloring",
    "mint extract",
    "non-stick saucepan",
    "whipping cream",
    "semisweet chocolate chips",
    "fridge"
  ],
  "tyn_section":[

  ]
}