{
  "title":"How to Store an Open Bottle of Red Wine",
  "url":"https://www.wikihow.com/Store-an-Open-Bottle-of-Red-Wine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "methods":[
    {
      "name":"Storing Red Wine in the Fridge",
      "steps":[
        {
          "headline":"Place your bottle in the fridge promptly.",
          "description":"When it comes to storing wine, heat and oxygen are your enemies. Sealing your bottle and placing it in the fridge as soon as you’re done drinking is the simplest way to slow down the oxidation process that turns wine into vinegar. While it’s common knowledge that red wine should be enjoyed at room temperature, red wine should still be refrigerated after it’s been opened. A wine fridge is a great option, too. It'll keep your wine cool enough to slow oxidation, but not as cold as a standard refrigerator. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamuel Bogue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWine Director & Consultant\t\t\t\t\t\t\t\tSamuel Bogue is the Wine Director of the Ne Timeas Restaurant Group in San Francisco, California. He gained his Sommelier certification in 2013, is a Zagat \"30 Under 30\" award winner, and is a wine consultant for the San Francisco Bay Area's top restaurants. Samuel Bogue\t\t\tWine Director & Consultant\t\t\t\tCool air will keep your wine fresh longer. Sam Bogue, a sommelier, says: \"In a cooler environment, you're going to see less of a reaction between the chemicals in the wine and the oxygen in the air. If you keep the wine at a higher temperature, you're going to accelerate that aging process. To keep it as fresh as possible, keep the wine as cool as you can without freezing it.\""
        },
        {
          "headline":"Seal the bottle with plastic wrap and a rubber band if you lost the cork.",
          "description":"If you accidentally threw away the cork or screw cap, wrap the top of the bottle with plastic and secure it with a rubber band. You can also invest in inexpensive wine stoppers, which are made of plastic or metal and create an air-tight seal. You can find them online or at wine, liquor, and home goods stores."
        },
        {
          "headline":"Store wine in the fridge for 3 to 5 days.",
          "description":"The exact storage time depends on the type of wine, but 3 to 5 days is a good general guideline. Even after 5 days, it’s worth doing a taste test. While the flavor might be a bit off, many wines are drinkable for at least a week after being opened. Wines with higher tannin levels and acidity will keep longer. A full-bodied, tannic cabernet could last a week without major flavor changes, while a delicate pinot noir could last 1 to 2 days. Organic and older wines can spoil within a day."
        },
        {
          "headline":"Place the bottle in lukewarm water to slowly raise its temperature.",
          "description":"Most red wines are best enjoyed at temperatures just cooler than room temperature, or around 62 to 66 °F (17 to 19 °C). Rapid temperature changes negatively affect wine, so warm a refrigerated red slowly by submerging the bottom of the bottle in a bowl of lukewarm water. Make sure the water is lukewarm and not hot. Start raising its temperature about 30 minutes before serving it. When you serve it, pour smaller amounts so the wine will warm in the glass faster."
        }
      ]
    },
    {
      "name":"Reducing Exposure to Oxygen",
      "steps":[
        {
          "headline":"Keep the bottle upright to reduce the wine’s surface area.",
          "description":"Never keep a bottle of wine on its side after opening. Oxygen spoils wine, so you want to reduce the amount of wine that’s exposed to air. Storing a bottle on its side creates a larger surface area, which exposes more wine to oxygen."
        },
        {
          "headline":"Pour the wine into a smaller bottle.",
          "description":"If you have one handy, pour leftover wine into a small, sealable glass bottle or jar. When a standard bottle of wine is half full, half of its volume contains air. If you store wine in a container half the size of a standard 750 milliliters (25.4  fl oz) bottle, there will be less space for air, which means less oxidation."
        },
        {
          "headline":"Use a pump to remove oxygen from bottles of non-sparkling wine.",
          "description":"A vacuum pump removes air from a bottle of wine, and is among the most affordable wine preservation tools. Pump systems often include stoppers. Insert the stopper into the bottle, then attach the pump to the stopper to remove oxygen from the bottle. Some wine connoisseurs suggest that vacuum pumps negatively affect aroma and taste. While you might want to finish an aged, expensive wine instead of pumping and storing it, pumping an average bottle of wine probably won’t hurt its flavor."
        },
        {
          "headline":"Don’t use a pump on sparkling wines.",
          "description":"Pumping sparkling reds, such as Lambrusco, or those with slight effervescence, such as vinho verde tinto, can leave you with a flat, disappointing wine. Store any carbonated wines in the fridge, and try to enjoy them within 1 to 3 days. Sparkling reds are best enjoyed chilled, so there’s no need for a lukewarm bath. Just remove the bottle from the fridge 20 minutes before serving."
        },
        {
          "headline":"Replace the oxygen with an inert gas aerosol.",
          "description":"To use an aerosol product, insert the extension tube into the bottle, spray the gas, then quickly replace the cork. Aerosol preservation products replace the oxygen in a bottle with an inert gas, such as argon."
        },
        {
          "headline":"Extract wine with a Coravin instead of opening the cork.",
          "description":"A Coravin wine extraction system pierces the cork (without actually removing it) so you can pour a small amount of wine, then reseals the cork. It’s expensive, so might not be worth the price unless you routinely taste high quality bottles of wine. A Coravin is ideal if you like to regularly taste good wines but don't want to have more than a sip or a glass. The bottle is good as new after the Coravin reseals it, so your expensive aged wine, which spoils quickly, won't go to waste."
        }
      ]
    },
    {
      "name":"Keeping Wine from Spoiling",
      "steps":[
        {
          "headline":"Insert the stained side into the bottle when you re-cork.",
          "description":"Make sure the stained side of the cork faces down like it did when the bottle was unopened. Inserting the cork with the stained side down might take more effort, as the clean side, which faced up when the bottle was sealed, is usually easier to fit into the bottle. However, inserting that end could introduce bacteria and cause your wine to spoil faster. The clean side was exposed during shipping, on the shelf at the store, and in your wine rack or countertop. It’s likely to have a higher bacteria count than the stained side, which was sealed within the bottle."
        },
        {
          "headline":"Avoid temperatures above 70 °F (21 °C).",
          "description":"If you’re keeping wine on the countertop or bar during a party, try to keep the ambient temperature below 70 °F (21 °C). Whether they’re opened or sealed, avoid storing your bottles by the oven, next to the fridge, or near any appliance that produces heat. You wouldn’t want to keep a bottle of red in cold water or ice during a party, so just try to control the ambient temperature."
        },
        {
          "headline":"Avoid exposing the bottle to sunlight.",
          "description":"Keep opened and sealed bottles of wine away from windows and other sources of sunlight. Sun exposure can hasten oxidation and cause discoloration."
        },
        {
          "headline":"Finish a bottle of wine that’s several years old.",
          "description":"If you’ve opened up an 8 year old bottle of wine, you’re better off just finishing it. Even when stored in the fridge, a bottle of good, aged wine can spoil in a matter of hours. Organic wines can also turn within a day, so avoid trying to store them for longer periods of time."
        },
        {
          "headline":"Find another use for wine that’s turned.",
          "description":"Just because a wine doesn’t taste good enough to drink doesn’t mean you have to toss it, especially if it’s been less than a week since you opened the bottle. If a red has only started to lose its vibrant color and doesn’t smell moldy or rancid, give it a taste test. If it’s just slightly off, find another use for it. You could use it to deglaze a pan of sauteed onions or garlic for a sauce, use it in a stew, or add it to a meat marinade. For best results, your recipe should have lots of flavor. The wine will add an extra note, but the stronger flavors will tone down any sourness. If you don’t have an immediate need to cook with borderline wine, pour it into an ice cube try and freeze it. (Don’t freeze wine you plan on drinking.) Just toss it if it tastes like vinegar, smells moldy, or looks cloudy."
        }
      ]
    }
  ],
  "text":" Storing Red Wine in the Fridge Place your bottle in the fridge promptly. When it comes to storing wine, heat and oxygen are your enemies. Sealing your bottle and placing it in the fridge as soon as you’re done drinking is the simplest way to slow down the oxidation process that turns wine into vinegar. While it’s common knowledge that red wine should be enjoyed at room temperature, red wine should still be refrigerated after it’s been opened. A wine fridge is a great option, too. It'll keep your wine cool enough to slow oxidation, but not as cold as a standard refrigerator. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamuel Bogue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWine Director & Consultant\t\t\t\t\t\t\t\tSamuel Bogue is the Wine Director of the Ne Timeas Restaurant Group in San Francisco, California. He gained his Sommelier certification in 2013, is a Zagat \"30 Under 30\" award winner, and is a wine consultant for the San Francisco Bay Area's top restaurants. Samuel Bogue\t\t\tWine Director & Consultant\t\t\t\tCool air will keep your wine fresh longer. Sam Bogue, a sommelier, says: \"In a cooler environment, you're going to see less of a reaction between the chemicals in the wine and the oxygen in the air. If you keep the wine at a higher temperature, you're going to accelerate that aging process. To keep it as fresh as possible, keep the wine as cool as you can without freezing it.\" Seal the bottle with plastic wrap and a rubber band if you lost the cork. If you accidentally threw away the cork or screw cap, wrap the top of the bottle with plastic and secure it with a rubber band. You can also invest in inexpensive wine stoppers, which are made of plastic or metal and create an air-tight seal. You can find them online or at wine, liquor, and home goods stores. Store wine in the fridge for 3 to 5 days. The exact storage time depends on the type of wine, but 3 to 5 days is a good general guideline. Even after 5 days, it’s worth doing a taste test. While the flavor might be a bit off, many wines are drinkable for at least a week after being opened. Wines with higher tannin levels and acidity will keep longer. A full-bodied, tannic cabernet could last a week without major flavor changes, while a delicate pinot noir could last 1 to 2 days. Organic and older wines can spoil within a day. Place the bottle in lukewarm water to slowly raise its temperature. Most red wines are best enjoyed at temperatures just cooler than room temperature, or around 62 to 66 °F (17 to 19 °C). Rapid temperature changes negatively affect wine, so warm a refrigerated red slowly by submerging the bottom of the bottle in a bowl of lukewarm water. Make sure the water is lukewarm and not hot. Start raising its temperature about 30 minutes before serving it. When you serve it, pour smaller amounts so the wine will warm in the glass faster. Reducing Exposure to Oxygen Keep the bottle upright to reduce the wine’s surface area. Never keep a bottle of wine on its side after opening. Oxygen spoils wine, so you want to reduce the amount of wine that’s exposed to air. Storing a bottle on its side creates a larger surface area, which exposes more wine to oxygen. Pour the wine into a smaller bottle. If you have one handy, pour leftover wine into a small, sealable glass bottle or jar. When a standard bottle of wine is half full, half of its volume contains air. If you store wine in a container half the size of a standard 750 milliliters (25.4  fl oz) bottle, there will be less space for air, which means less oxidation. Use a pump to remove oxygen from bottles of non-sparkling wine. A vacuum pump removes air from a bottle of wine, and is among the most affordable wine preservation tools. Pump systems often include stoppers. Insert the stopper into the bottle, then attach the pump to the stopper to remove oxygen from the bottle. Some wine connoisseurs suggest that vacuum pumps negatively affect aroma and taste. While you might want to finish an aged, expensive wine instead of pumping and storing it, pumping an average bottle of wine probably won’t hurt its flavor. Don’t use a pump on sparkling wines. Pumping sparkling reds, such as Lambrusco, or those with slight effervescence, such as vinho verde tinto, can leave you with a flat, disappointing wine. Store any carbonated wines in the fridge, and try to enjoy them within 1 to 3 days. Sparkling reds are best enjoyed chilled, so there’s no need for a lukewarm bath. Just remove the bottle from the fridge 20 minutes before serving. Replace the oxygen with an inert gas aerosol. To use an aerosol product, insert the extension tube into the bottle, spray the gas, then quickly replace the cork. Aerosol preservation products replace the oxygen in a bottle with an inert gas, such as argon. Extract wine with a Coravin instead of opening the cork. A Coravin wine extraction system pierces the cork (without actually removing it) so you can pour a small amount of wine, then reseals the cork. It’s expensive, so might not be worth the price unless you routinely taste high quality bottles of wine. A Coravin is ideal if you like to regularly taste good wines but don't want to have more than a sip or a glass. The bottle is good as new after the Coravin reseals it, so your expensive aged wine, which spoils quickly, won't go to waste. Keeping Wine from Spoiling Insert the stained side into the bottle when you re-cork. Make sure the stained side of the cork faces down like it did when the bottle was unopened. Inserting the cork with the stained side down might take more effort, as the clean side, which faced up when the bottle was sealed, is usually easier to fit into the bottle. However, inserting that end could introduce bacteria and cause your wine to spoil faster. The clean side was exposed during shipping, on the shelf at the store, and in your wine rack or countertop. It’s likely to have a higher bacteria count than the stained side, which was sealed within the bottle. Avoid temperatures above 70 °F (21 °C). If you’re keeping wine on the countertop or bar during a party, try to keep the ambient temperature below 70 °F (21 °C). Whether they’re opened or sealed, avoid storing your bottles by the oven, next to the fridge, or near any appliance that produces heat. You wouldn’t want to keep a bottle of red in cold water or ice during a party, so just try to control the ambient temperature. Avoid exposing the bottle to sunlight. Keep opened and sealed bottles of wine away from windows and other sources of sunlight. Sun exposure can hasten oxidation and cause discoloration. Finish a bottle of wine that’s several years old. If you’ve opened up an 8 year old bottle of wine, you’re better off just finishing it. Even when stored in the fridge, a bottle of good, aged wine can spoil in a matter of hours. Organic wines can also turn within a day, so avoid trying to store them for longer periods of time. Find another use for wine that’s turned. Just because a wine doesn’t taste good enough to drink doesn’t mean you have to toss it, especially if it’s been less than a week since you opened the bottle. If a red has only started to lose its vibrant color and doesn’t smell moldy or rancid, give it a taste test. If it’s just slightly off, find another use for it. You could use it to deglaze a pan of sauteed onions or garlic for a sauce, use it in a stew, or add it to a meat marinade. For best results, your recipe should have lots of flavor. The wine will add an extra note, but the stronger flavors will tone down any sourness. If you don’t have an immediate need to cook with borderline wine, pour it into an ice cube try and freeze it. (Don’t freeze wine you plan on drinking.) Just toss it if it tastes like vinegar, smells moldy, or looks cloudy.",
  "tyn_model":[
    "wine",
    "pump",
    "water",
    "coravin",
    "fridge",
    "vinegar",
    "red wine",
    "bottle",
    "oxygen",
    "stopper",
    "wines",
    "wine fridge",
    "refrigerator",
    "sommelier certification",
    "wine director",
    "sommelier",
    "plastic wrap",
    "rubber band",
    "plastic",
    "wine stoppers",
    "cabernet",
    "pinot",
    "bowl",
    "vacuum pump",
    "vacuum pumps",
    "sparkling wines",
    "inert gas",
    "aerosol product",
    "aerosol preservation products",
    "argon",
    "cork",
    "wine rack",
    "oven",
    "onions",
    "garlic",
    "ice cube"
  ],
  "tyn_section":[

  ]
}