{
  "title":"How to Make Chocolate Coconut Cake",
  "url":"https://www.wikihow.com/Make-Chocolate-Coconut-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "methods":[
    {
      "name":"Package chocolate coconut cake",
      "steps":[
        {
          "headline":"Mix the cake batter according to package instructions.",
          "description":"Add in 1 1/2- 2 cups of desiccated coconut and mix well."
        },
        {
          "headline":"Transfer to a prepared cake pan.",
          "description":"Either grease or line with parchment paper."
        },
        {
          "headline":"Bake in the oven according to instructions.",
          "description":"Then let it cool."
        },
        {
          "headline":"Sprinkle with leftover coconut.",
          "description":"Serve."
        }
      ]
    },
    {
      "name":"Coconut cake from scratch",
      "steps":[
        {
          "headline":"Preheat the oven to 160ºC/325ºF.",
          "description":"Prepare the cake pan; either grease it or line it with parchment paper."
        },
        {
          "headline":"Place the caster/superfine sugar, syrup, butter and desiccated coconut in the saucepan.",
          "description":"Heat over low to medium heat, stirring constantly to help dissolve the the sugar in the liquid. When it has completely melted, remove from the heat."
        },
        {
          "headline":"Sift the flour and baking soda together.",
          "description":"Add the to liquid mixture. Add the eggs and 3 tablespoons of milk. Stir to combine."
        },
        {
          "headline":"Transfer the batter to the cake pan.",
          "description":"Ensure that the top of the batter is even."
        },
        {
          "headline":"Place in the preheated oven.",
          "description":"Bake for 40to 50 minutes. It is ready when it has risen well and is firm."
        },
        {
          "headline":"Remove from the oven.",
          "description":"Allow to cool in the oven for 10 minutes. To loosen, take a knife around the edges of the cake to pry it away. Place on a wire cooling rack to finish the cooling."
        },
        {
          "headline":"Ice or frost, if wished.",
          "description":"Wait until the cake has cooled before doing so. Toasted coconut makes for a nice finish over the top of the cake."
        }
      ]
    },
    {
      "name":"Rich chocolate coconut cake from scratch",
      "steps":[
        {
          "headline":"Place the chocolate into a saucepan.",
          "description":"Add the butter and cream as well. Heat over low heat, mixing frequently to combine the ingredients completely. Remove from the heat."
        },
        {
          "headline":"Separate the eggs into whites and yolks.",
          "description":"Place the yolks into a mixing bowl. Add 75g of the brown sugar and whisk together until the mixture turns light."
        },
        {
          "headline":"Fold the egg mixture into the melted mixture.",
          "description":""
        },
        {
          "headline":"Whisk the egg whites.",
          "description":"When they form soft white peaks, add the remaining 25g of sugar and continue to beat in. Set aside."
        },
        {
          "headline":"Mix in the baking soda with the flour.",
          "description":"Pour the egg yolk mixture into a mixing bowl, then add the flour mixture and the desiccated coconut; mix all together. Then quickly and lightly fold in the egg whites mixture using a hand whisk."
        },
        {
          "headline":"Place into an oven set to 190ºC.",
          "description":"Bake for 30 minutes."
        },
        {
          "headline":"Test that the cake is done by pricking with a toothpick or skewer.",
          "description":"It's done if the item comes out free of crumbs."
        },
        {
          "headline":"Remove from the oven when baked.",
          "description":"Allow to cool for a few minutes in the pan, then unmold and allow to cool on a wire cooling rack."
        },
        {
          "headline":"Frost or ice, if desired.",
          "description":"Finish with toasted coconut as a topping."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Package chocolate coconut cake Mix the cake batter according to package instructions. Add in 1 1/2- 2 cups of desiccated coconut and mix well. Transfer to a prepared cake pan. Either grease or line with parchment paper. Bake in the oven according to instructions. Then let it cool. Sprinkle with leftover coconut. Serve. Coconut cake from scratch Preheat the oven to 160ºC/325ºF. Prepare the cake pan; either grease it or line it with parchment paper. Place the caster/superfine sugar, syrup, butter and desiccated coconut in the saucepan. Heat over low to medium heat, stirring constantly to help dissolve the the sugar in the liquid. When it has completely melted, remove from the heat. Sift the flour and baking soda together. Add the to liquid mixture. Add the eggs and 3 tablespoons of milk. Stir to combine. Transfer the batter to the cake pan. Ensure that the top of the batter is even. Place in the preheated oven. Bake for 40to 50 minutes. It is ready when it has risen well and is firm. Remove from the oven. Allow to cool in the oven for 10 minutes. To loosen, take a knife around the edges of the cake to pry it away. Place on a wire cooling rack to finish the cooling. Ice or frost, if wished. Wait until the cake has cooled before doing so. Toasted coconut makes for a nice finish over the top of the cake. Rich chocolate coconut cake from scratch Place the chocolate into a saucepan. Add the butter and cream as well. Heat over low heat, mixing frequently to combine the ingredients completely. Remove from the heat. Separate the eggs into whites and yolks. Place the yolks into a mixing bowl. Add 75g of the brown sugar and whisk together until the mixture turns light. Fold the egg mixture into the melted mixture.  Whisk the egg whites. When they form soft white peaks, add the remaining 25g of sugar and continue to beat in. Set aside. Mix in the baking soda with the flour. Pour the egg yolk mixture into a mixing bowl, then add the flour mixture and the desiccated coconut; mix all together. Then quickly and lightly fold in the egg whites mixture using a hand whisk. Place into an oven set to 190ºC. Bake for 30 minutes. Test that the cake is done by pricking with a toothpick or skewer. It's done if the item comes out free of crumbs. Remove from the oven when baked. Allow to cool for a few minutes in the pan, then unmold and allow to cool on a wire cooling rack. Frost or ice, if desired. Finish with toasted coconut as a topping. Finished. ",
  "tyn_model":[
    "oven",
    "coconut",
    "cake pan",
    "flour",
    "chocolate coconut cake",
    "parchment paper",
    "butter",
    "saucepan",
    "sugar",
    "baking soda",
    "eggs",
    "mixing bowl",
    "cake batter",
    "coconut cake",
    "syrup",
    "milk",
    "knife",
    "chocolate",
    "cream",
    "brown sugar",
    "egg yolk",
    "egg whites",
    "ice",
    "toasted coconut"
  ],
  "tyn_section":[

  ]
}