{
  "title":"How to Reset a Luggage Lock",
  "url":"https://www.wikihow.com/Reset-a-Luggage-Lock",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Changing a Lock with a Button Reset",
      "steps":[
        {
          "headline":"Unlock the lock first.",
          "description":"Most of the time, your lock has to be on the correct combination before you can change the combination to something else. Put in the right combination and make sure it unlocks. If the luggage is new, the combination probably came with the materials. It's likely just \"000.\""
        },
        {
          "headline":"Find the reset button.",
          "description":"Often, the lock will have a little reset button on the bottom or side of the lock. You may need a paperclip, pen, or pencil to push the button in and begin the resetting process."
        },
        {
          "headline":"Put in your new combination.",
          "description":"While pressing the reset button, enter your new combination in the lock. Set it to whatever you'd like. Make sure it's a combination you can remember."
        },
        {
          "headline":"Release the button.",
          "description":"When you're done, release the button, and you've reset the lock. Remember to move the numbers around to another combination to lock it in place once you're ready to go."
        }
      ]
    },
    {
      "name":"Putting a New Code in a Lock with a Lever",
      "steps":[
        {
          "headline":"Find the lever.",
          "description":"The lever may be on the inside of the suitcase. It's also possible it could be on the outside near the combination wheels. Either way, you'll need to know the combination for the lock to open it and release the zippers."
        },
        {
          "headline":"Slide the lever over to the resetting position.",
          "description":"To change the combination, the lever needs to be in the position for setting the lock. Usually, you just slide the lever into the second position."
        },
        {
          "headline":"Change the combination.",
          "description":"Put your new combination into the lock. Make sure it's something you'll remember, and set the wheels with the proper combination. Turn each wheel to the number you want."
        },
        {
          "headline":"Secure the lock by randomizing the numbers.",
          "description":"Push the lever back into the first position. Check that you have properly set the lock by randomizing the numbers and then putting in the combination you just set to see if it opens. Once you've established the lock will open again, randomize the numbers again to finish locking the suitcase."
        }
      ]
    },
    {
      "name":"Altering the Code on a Shackle Lock",
      "steps":[
        {
          "headline":"Release the shackle.",
          "description":"The lock must be unlocked first. Set the lock to the proper code, likely \"000\" if it's new, and pull up on the shackle to release it."
        },
        {
          "headline":"Turn the shackle 90 degrees and press the shackle down.",
          "description":"How you turn and press the shackle depends on your lock. Start by moving it 90 degrees from the locked position. Press down on the shackle and move it to 180 degrees from the locked position. If this movement doesn't reset it, try moving to 180 degrees first, pressing down, and moving back to 90 degrees. You won't know if it reset until you put in a new combination and then try opening it with that combination."
        },
        {
          "headline":"Reset the combination number.",
          "description":"If the lock has wheels, turn them to the new combination while still holding the shackle down. If it has a large dial, put in your new combination."
        },
        {
          "headline":"Turn the shackle back to the original position.",
          "description":"Once you've put in a new combination, move the shackle back to the locked position. Check to make sure the new combination works on your lock."
        }
      ]
    }
  ],
  "text":" Changing a Lock with a Button Reset Unlock the lock first. Most of the time, your lock has to be on the correct combination before you can change the combination to something else. Put in the right combination and make sure it unlocks. If the luggage is new, the combination probably came with the materials. It's likely just \"000.\" Find the reset button. Often, the lock will have a little reset button on the bottom or side of the lock. You may need a paperclip, pen, or pencil to push the button in and begin the resetting process. Put in your new combination. While pressing the reset button, enter your new combination in the lock. Set it to whatever you'd like. Make sure it's a combination you can remember. Release the button. When you're done, release the button, and you've reset the lock. Remember to move the numbers around to another combination to lock it in place once you're ready to go. Putting a New Code in a Lock with a Lever Find the lever. The lever may be on the inside of the suitcase. It's also possible it could be on the outside near the combination wheels. Either way, you'll need to know the combination for the lock to open it and release the zippers. Slide the lever over to the resetting position. To change the combination, the lever needs to be in the position for setting the lock. Usually, you just slide the lever into the second position. Change the combination. Put your new combination into the lock. Make sure it's something you'll remember, and set the wheels with the proper combination. Turn each wheel to the number you want. Secure the lock by randomizing the numbers. Push the lever back into the first position. Check that you have properly set the lock by randomizing the numbers and then putting in the combination you just set to see if it opens. Once you've established the lock will open again, randomize the numbers again to finish locking the suitcase. Altering the Code on a Shackle Lock Release the shackle. The lock must be unlocked first. Set the lock to the proper code, likely \"000\" if it's new, and pull up on the shackle to release it. Turn the shackle 90 degrees and press the shackle down. How you turn and press the shackle depends on your lock. Start by moving it 90 degrees from the locked position. Press down on the shackle and move it to 180 degrees from the locked position. If this movement doesn't reset it, try moving to 180 degrees first, pressing down, and moving back to 90 degrees. You won't know if it reset until you put in a new combination and then try opening it with that combination. Reset the combination number. If the lock has wheels, turn them to the new combination while still holding the shackle down. If it has a large dial, put in your new combination. Turn the shackle back to the original position. Once you've put in a new combination, move the shackle back to the locked position. Check to make sure the new combination works on your lock.",
  "tyn_model":[
    "shackle",
    "lever",
    "suitcase",
    "pencil"
  ],
  "tyn_section":[

  ]
}