{
  "title":"How to Prepare Sugar Snap Peas",
  "url":"https://www.wikihow.com/Prepare-Sugar-Snap-Peas",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Preparing the Peas to Be Eaten",
      "steps":[
        {
          "headline":"Wash the sugar snap peas before beginning to prepare them.",
          "description":"Whether you're preparing the peas to be eaten raw or will be cooking them first, rinse them with clean water thoroughly beforehand. You want to make sure you're working with fresh, clean pods. Make sure to dry them entirely after being washed."
        },
        {
          "headline":"Trim the ends of the sugar snap peas.",
          "description":"If you believe your peas contain a string, you’ll need to cut into the ends to remove it. Either use a knife to make a small slice into the end, or use your fingers to snap the end partially off instead. Don’t cut or snap the end off entirely — you’ll need it connected to the rest of the pod to remove the string. When using a knife, direct the cuts away from your body so that you don't accidentally cut yourself."
        },
        {
          "headline":"Remove the tough string that runs along the side of the peas.",
          "description":"Once you’ve snapped off the end of the pod, pull the end along the entire length of the pod to peel off the string. The string should essentially “unzip” from the pod in one easy pull. These strings won't hurt you to eat, but they're quite tough and won't taste very good."
        },
        {
          "headline":"Check to make sure your peas don’t have strings on both sides.",
          "description":"Unless the peas you purchased or grew were labeled as stringless sugar snap peas, it’s best to go ahead and check that there aren’t strings on both sides of the pod. Simply snap or cut off the other end of the pods and pull down to remove any other strings."
        },
        {
          "headline":"Store the peas in the refrigerator if you won't be using them right away.",
          "description":"If you're saving the peas for dinner later or just want to store them for a different day, place the peas in the refrigerator. Make sure they're sealed in a container or bag with as little air as possible in it. The peas should last 4-5 days in the fridge. It's best not to wash the pods if you intend on leaving them in the refrigerator. This will make them last longer and stay fresh."
        }
      ]
    },
    {
      "name":"Sautéing Peas",
      "steps":[
        {
          "headline":"Put oil and water in a pan and place it over medium heat.",
          "description":"Add 2 teaspoons (9.9 ml) of oil and 2 teaspoons (9.9 ml) of water to a pan large enough to cook your peas. Set the heat to medium and wait for the pan to warm up."
        },
        {
          "headline":"Add the peas to the pan to sauté them.",
          "description":"After the pan heats up, add the peas to the pan and cover it with a top for less than 1 minute to trap steam. Remove the top and let the water evaporate from the pan as your peas cook for another minute or w.\nThis whole process should only take a couple of minutes — you don't want to overcook the peas. If you're not sure whether your peas are done or not, take 1 out and do a taste test. If it tastes cooked while still having a crunch, they're done."
        },
        {
          "headline":"Remove the peas from the pan and season them.",
          "description":"Once your peas are a nice mix of tender and crisp, remove them from the pan. Transfer them to a serving dish and season them with your preferred seasonings. Season your sautéed peas with salt and black pepper. Sautéing the peas with butter or garlic is also a popular choice."
        }
      ]
    },
    {
      "name":"Steaming Peas",
      "steps":[
        {
          "headline":"Place the peas on a steamer rack above boiling water.",
          "description":"Bring a pot of water to a boil, and then arrange your peas on a steamer rack. Place the rack on top of the pot of boiling water to start the steaming process."
        },
        {
          "headline":"Steam the peas for 3-5 minutes.",
          "description":"Cover the steamer rack to create a better steaming environment for the peas. Let the peas steam for about 3 minutes. Once steamed, the peas should be slightly tender yet crisp. You want to preserve their crunch and flavor, so don't steam them for too long."
        },
        {
          "headline":"Transfer the peas to a bowl and season them.",
          "description":"Once the peas are done steaming, transfer them to a serving bowl. Season them with your choice of herbs and seasoning, or simply sprinkle them with salt. Season your peas with mint, butter, salt, and pepper after steaming. You can also just add lemon juice to the peas for a bit of flavor. Add sesame seeds, salt, sesame oil, and green onions for a different flavor option."
        }
      ]
    },
    {
      "name":"Storing the Peas in the Freezer",
      "steps":[
        {
          "headline":"Blanch the sugar snap peas to reduce spoilage.",
          "description":"One way to prepare peas for the freezer is to blanch them first. Boil the pods in a pot of water for 2 minutes or less. After the 2 minutes, drain the water from the pot and place the pods in a bowl of ice water to cool them down for a few minutes. Make sure you leave the pods in the boiling water for more than 2 minutes — you don't want to accidentally cook them. Blanching is a great method to reduce spoilage, but it can be a risky option if you leave them in the boiling water for too long."
        },
        {
          "headline":"Cut the peas into sections if you don't want to boil them.",
          "description":"If you don’t want to blanch your pods, you can cut them up and put them in the freezer. Take the strings out first, and then slice each pod into pieces that are 1 inch (2.5 cm) or 2 inches (5.1 cm). If you don’t want to cut them up, you can leave the pods whole. The freezer will make the pods taste slightly different, and cutting them up helps lessen this taste change."
        },
        {
          "headline":"Dry the pods entirely before freezing them.",
          "description":"If your sugar snap peas are wet when you place them in the freezer, ice will affect them much faster. If you’ve washed the pods, make sure to dry them thoroughly before freezing them."
        },
        {
          "headline":"Store the pods in a sealed container or plastic bag.",
          "description":"As with most other food you place in the freezer, you want your peas to be protected from ice, air, and other variables that will affect how long they last. Put your peas in a sealed container or plastic bag to store them. Make sure that you remove as much air as possible from the container or bag before putting it into the freezer. Frozen peas should last for roughly 8 months."
        }
      ]
    }
  ],
  "text":" Preparing the Peas to Be Eaten Wash the sugar snap peas before beginning to prepare them. Whether you're preparing the peas to be eaten raw or will be cooking them first, rinse them with clean water thoroughly beforehand. You want to make sure you're working with fresh, clean pods. Make sure to dry them entirely after being washed. Trim the ends of the sugar snap peas. If you believe your peas contain a string, you’ll need to cut into the ends to remove it. Either use a knife to make a small slice into the end, or use your fingers to snap the end partially off instead. Don’t cut or snap the end off entirely — you’ll need it connected to the rest of the pod to remove the string. When using a knife, direct the cuts away from your body so that you don't accidentally cut yourself. Remove the tough string that runs along the side of the peas. Once you’ve snapped off the end of the pod, pull the end along the entire length of the pod to peel off the string. The string should essentially “unzip” from the pod in one easy pull. These strings won't hurt you to eat, but they're quite tough and won't taste very good. Check to make sure your peas don’t have strings on both sides. Unless the peas you purchased or grew were labeled as stringless sugar snap peas, it’s best to go ahead and check that there aren’t strings on both sides of the pod. Simply snap or cut off the other end of the pods and pull down to remove any other strings. Store the peas in the refrigerator if you won't be using them right away. If you're saving the peas for dinner later or just want to store them for a different day, place the peas in the refrigerator. Make sure they're sealed in a container or bag with as little air as possible in it. The peas should last 4-5 days in the fridge. It's best not to wash the pods if you intend on leaving them in the refrigerator. This will make them last longer and stay fresh. Sautéing Peas Put oil and water in a pan and place it over medium heat. Add 2 teaspoons (9.9 ml) of oil and 2 teaspoons (9.9 ml) of water to a pan large enough to cook your peas. Set the heat to medium and wait for the pan to warm up. Add the peas to the pan to sauté them. After the pan heats up, add the peas to the pan and cover it with a top for less than 1 minute to trap steam. Remove the top and let the water evaporate from the pan as your peas cook for another minute or w.\nThis whole process should only take a couple of minutes — you don't want to overcook the peas. If you're not sure whether your peas are done or not, take 1 out and do a taste test. If it tastes cooked while still having a crunch, they're done. Remove the peas from the pan and season them. Once your peas are a nice mix of tender and crisp, remove them from the pan. Transfer them to a serving dish and season them with your preferred seasonings. Season your sautéed peas with salt and black pepper. Sautéing the peas with butter or garlic is also a popular choice. Steaming Peas Place the peas on a steamer rack above boiling water. Bring a pot of water to a boil, and then arrange your peas on a steamer rack. Place the rack on top of the pot of boiling water to start the steaming process. Steam the peas for 3-5 minutes. Cover the steamer rack to create a better steaming environment for the peas. Let the peas steam for about 3 minutes. Once steamed, the peas should be slightly tender yet crisp. You want to preserve their crunch and flavor, so don't steam them for too long. Transfer the peas to a bowl and season them. Once the peas are done steaming, transfer them to a serving bowl. Season them with your choice of herbs and seasoning, or simply sprinkle them with salt. Season your peas with mint, butter, salt, and pepper after steaming. You can also just add lemon juice to the peas for a bit of flavor. Add sesame seeds, salt, sesame oil, and green onions for a different flavor option. Storing the Peas in the Freezer Blanch the sugar snap peas to reduce spoilage. One way to prepare peas for the freezer is to blanch them first. Boil the pods in a pot of water for 2 minutes or less. After the 2 minutes, drain the water from the pot and place the pods in a bowl of ice water to cool them down for a few minutes. Make sure you leave the pods in the boiling water for more than 2 minutes — you don't want to accidentally cook them. Blanching is a great method to reduce spoilage, but it can be a risky option if you leave them in the boiling water for too long. Cut the peas into sections if you don't want to boil them. If you don’t want to blanch your pods, you can cut them up and put them in the freezer. Take the strings out first, and then slice each pod into pieces that are 1 inch (2.5 cm) or 2 inches (5.1 cm). If you don’t want to cut them up, you can leave the pods whole. The freezer will make the pods taste slightly different, and cutting them up helps lessen this taste change. Dry the pods entirely before freezing them. If your sugar snap peas are wet when you place them in the freezer, ice will affect them much faster. If you’ve washed the pods, make sure to dry them thoroughly before freezing them. Store the pods in a sealed container or plastic bag. As with most other food you place in the freezer, you want your peas to be protected from ice, air, and other variables that will affect how long they last. Put your peas in a sealed container or plastic bag to store them. Make sure that you remove as much air as possible from the container or bag before putting it into the freezer. Frozen peas should last for roughly 8 months.",
  "tyn_model":[
    "peas",
    "water",
    "pan",
    "freezer",
    "sugar snap peas",
    "— you",
    "refrigerator",
    "steamer rack",
    "salt",
    "knife",
    "oil",
    "butter",
    "bowl",
    "ice",
    "“unzip",
    "” from",
    "container",
    "seasonings",
    "salt and black pepper",
    "garlic",
    "pot",
    "serving bowl",
    "herbs",
    "pepper",
    "lemon juice",
    "sesame seeds",
    "sesame oil",
    "green onions",
    "ice water"
  ],
  "tyn_section":[

  ]
}