{
  "title":"How to Grill Bone‐in Chicken Breast",
  "url":"https://www.wikihow.com/Grill-Bone%E2%80%90in-Chicken-Breast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "parts":[
    {
      "name":"Flavoring the Chicken",
      "steps":[
        {
          "headline":"Decide between a marinade and a dry rub to add flavor.",
          "description":"You can grill chicken without preparation, but marinades and dry rubs can help keep chicken moist and give it extra flavor. Marinades are especially effective in preserving moisture, but the chicken needs to sit in it for longer before cooking. Dry rubs, though, can be applied to chicken right before grilling."
        },
        {
          "headline":"Prepare the marinade and let the chicken sit in it for at least 1 hour.",
          "description":"Find a marinade that sounds good to you in a cookbook or on a recipe website. BBQ style marinades are especially popular  for bone-in chicken, but marinades can use a variety of ingredients, including citrus, oil, vinegar, and yogurt. Once you’ve sat the chicken in the marinade, cover it and put it in the refrigerator. How long you will want your chicken to marinate will depend on the kind of marinade you’re using. In general, you will want to marinate your chicken between 2 and 10 hours."
        },
        {
          "headline":"Apply a dry rub to the chicken just before grilling.",
          "description":"Mix the spices, herbs, and any other ingredients in your dry tub together in a bowl. Rub both sides of each chicken breast into the mixture to give it an even coating. Dry rubs add flavor instantly, so you can move your chicken to the grill right after coating them."
        }
      ]
    },
    {
      "name":"Grilling the Chicken",
      "steps":[
        {
          "headline":"Heat up your grill so there’s a hot side and a cooler side.",
          "description":"If you’re using a charcoal grill, pile the charcoal mainly to one side. If you’re using a gas grill, heat one side with a high flame and the other with a low flame. For a charcoal grill, allow it to preheat for around 30 minutes before adding the meat. For a gas grill, preheat for about 10 minutes before starting your chicken."
        },
        {
          "headline":"Oil the grates of your grill.",
          "description":"If your grates are too dry, the chicken might stick to them. Place some oil on a paper towel. Then pick that towel up with tongs and rub it along the heated grates of your grill. Wear oven mitts for protection and watch out for the flame."
        },
        {
          "headline":"Sear each side of the chicken for 3-5 minutes.",
          "description":"Place your chicken breasts on the hotter side of your grill. Let each side cook until it has visible char or grill marks. Searing your chicken this way helps seal in its flavor and moisture."
        },
        {
          "headline":"Move the chicken to the cooler side of the grill and close the lid.",
          "description":"Now that the outside of the breasts are seared, you will want to cook the inside more slowly. With the lid closed and the heat on low, the inside of your chicken will cook without drying out or burning the exterior. Cooking it slowly like this takes extra time but makes for a juicier piece of meat."
        },
        {
          "headline":"Check the chicken every 5 minutes.",
          "description":"At first, you will mainly want to check to make sure it isn’t burning. If it is burning, flip it over and consider reducing the heat even further. After about fifteen minutes, check the breasts with a meat thermometer to see how close it is to being done. It will be finished when its temperature at the center is 165 °F (74 °C). Flip the chicken to cook it evenly. Your meat thermometer will tell you how hot the different parts of the chicken are. If one side is significantly  hotter than the other, flip it over to allow the alternate side to cook closer to the heat source."
        },
        {
          "headline":"Remove the chicken when it reaches 165 °F (74 °C) near the bone.",
          "description":"The meat that touches the bone cooks slowest, so make sure your thermometer checks that part of the breast. Using tongs, take the chicken off of the grill and place it on a plate. Turn off your grill or add more chicken to it if you want to cook more. The chicken will usually be done grilling after 20-25 minutes. But cooking times can vary based on how thick the breasts are."
        },
        {
          "headline":"Allow the chicken to rest for 5-8 minutes before serving.",
          "description":"Resting your meat before serving it helps it to retain its juice when you cut into it. This makes the chicken more moist, more flavorful, and generally more delicious! Pair your chicken with a side like corn on the cob or salad. Or simply enjoy it on its own!"
        }
      ]
    }
  ],
  "text":" Flavoring the Chicken Decide between a marinade and a dry rub to add flavor. You can grill chicken without preparation, but marinades and dry rubs can help keep chicken moist and give it extra flavor. Marinades are especially effective in preserving moisture, but the chicken needs to sit in it for longer before cooking. Dry rubs, though, can be applied to chicken right before grilling. Prepare the marinade and let the chicken sit in it for at least 1 hour. Find a marinade that sounds good to you in a cookbook or on a recipe website. BBQ style marinades are especially popular  for bone-in chicken, but marinades can use a variety of ingredients, including citrus, oil, vinegar, and yogurt. Once you’ve sat the chicken in the marinade, cover it and put it in the refrigerator. How long you will want your chicken to marinate will depend on the kind of marinade you’re using. In general, you will want to marinate your chicken between 2 and 10 hours. Apply a dry rub to the chicken just before grilling. Mix the spices, herbs, and any other ingredients in your dry tub together in a bowl. Rub both sides of each chicken breast into the mixture to give it an even coating. Dry rubs add flavor instantly, so you can move your chicken to the grill right after coating them. Grilling the Chicken Heat up your grill so there’s a hot side and a cooler side. If you’re using a charcoal grill, pile the charcoal mainly to one side. If you’re using a gas grill, heat one side with a high flame and the other with a low flame. For a charcoal grill, allow it to preheat for around 30 minutes before adding the meat. For a gas grill, preheat for about 10 minutes before starting your chicken. Oil the grates of your grill. If your grates are too dry, the chicken might stick to them. Place some oil on a paper towel. Then pick that towel up with tongs and rub it along the heated grates of your grill. Wear oven mitts for protection and watch out for the flame. Sear each side of the chicken for 3-5 minutes. Place your chicken breasts on the hotter side of your grill. Let each side cook until it has visible char or grill marks. Searing your chicken this way helps seal in its flavor and moisture. Move the chicken to the cooler side of the grill and close the lid. Now that the outside of the breasts are seared, you will want to cook the inside more slowly. With the lid closed and the heat on low, the inside of your chicken will cook without drying out or burning the exterior. Cooking it slowly like this takes extra time but makes for a juicier piece of meat. Check the chicken every 5 minutes. At first, you will mainly want to check to make sure it isn’t burning. If it is burning, flip it over and consider reducing the heat even further. After about fifteen minutes, check the breasts with a meat thermometer to see how close it is to being done. It will be finished when its temperature at the center is 165 °F (74 °C). Flip the chicken to cook it evenly. Your meat thermometer will tell you how hot the different parts of the chicken are. If one side is significantly  hotter than the other, flip it over to allow the alternate side to cook closer to the heat source. Remove the chicken when it reaches 165 °F (74 °C) near the bone. The meat that touches the bone cooks slowest, so make sure your thermometer checks that part of the breast. Using tongs, take the chicken off of the grill and place it on a plate. Turn off your grill or add more chicken to it if you want to cook more. The chicken will usually be done grilling after 20-25 minutes. But cooking times can vary based on how thick the breasts are. Allow the chicken to rest for 5-8 minutes before serving. Resting your meat before serving it helps it to retain its juice when you cut into it. This makes the chicken more moist, more flavorful, and generally more delicious! Pair your chicken with a side like corn on the cob or salad. Or simply enjoy it on its own!",
  "tyn_model":[
    "chicken",
    "grill",
    "marinade",
    "oil",
    "marinades",
    "charcoal grill",
    "gas grill",
    "meat thermometer",
    "citrus",
    "vinegar",
    "yogurt",
    "refrigerator",
    "spices",
    "herbs",
    "bowl",
    "charcoal",
    "oven mitts",
    "plate",
    "salad"
  ],
  "tyn_section":[

  ]
}