{
  "title":"How to Do Easy Origami",
  "url":"https://www.wikihow.com/Do-Easy-Origami",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Origami",
    "Origami Basics"
  ],
  "methods":[
    {
      "name":"Creating an Origami Crown",
      "steps":[
        {
          "headline":"Gather 6-7 pieces of paper.",
          "description":"In order to make this crown, you will need several pieces of square paper, 6 by 6 inches (15 by 15 cm) in size. For a child-sized crown, you will need 4-5 pieces. For an adult crown, you will need 6-7 pieces. Sturdy paper (like construction paper or craft paper) will work best."
        },
        {
          "headline":"Create a cross crease.",
          "description":"Fold the paper in half horizontally. Use your finger to make a sharp crease and unfold the paper. Then fold the paper in half vertically. Make a sharp crease using your finger, and unfold your paper again."
        },
        {
          "headline":"Create a point on top.",
          "description":"Fold the top left corner in to meet the center crease, followed by the right. Use your finger to tighten each crease. At this stage, your paper will look like a little house."
        },
        {
          "headline":"Bend the bottom edge up to meet the center.",
          "description":"Make a good crease with your finger. At this stage, your paper will look like a sailboat."
        },
        {
          "headline":"Fold the bottom edge upward again.",
          "description":"Fold the rectangle you made upward, so that it overlaps 1 more time. You have now completed your first modular crown section."
        },
        {
          "headline":"Create 3-6 more crown pieces and fit them together.",
          "description":"Repeat this method to create more modular crown pieces. Slide the bottom rectangular part of 1 piece inside the rectangular fold of another. Wiggle the pieces together as far as they will go, until the bottoms of the triangles overlap. Finally, connect the first and last pieces together to form a ring. Adjust your crown to be the proper size by adding or removing crown pieces."
        }
      ]
    },
    {
      "name":"Folding an Origami Fortune Teller",
      "steps":[
        {
          "headline":"Start with square white paper.",
          "description":"For this project, you need a single sheet of square white paper, about 6 by 6 inches (15 by 15 cm) in size. You will also need some crayons and markers."
        },
        {
          "headline":"Create an “X” crease.",
          "description":"Fold the paper in half so that the top right corner meets the bottom left corner. Use your finger to make a good crease and unfold the paper. Then fold the paper the opposite way, joining the top left corner with the bottom right. Make a good crease and unfold."
        },
        {
          "headline":"Make a cross crease.",
          "description":"Fold the paper in half again, meeting the bottom edge up with the top edge. Make a crease, then unfold. Repeat this along the vertical axis, make a crease, and unfold the paper."
        },
        {
          "headline":"Fold all 4 corners to meet the center.",
          "description":"Fold each point so that it touches the center crease point. You should end up with a smaller square than you had before."
        },
        {
          "headline":"Turn your paper over and fold all 4 corners to the center again.",
          "description":"Once again, fold each corner so that it touches the center crease point. You will now have an even smaller square."
        },
        {
          "headline":"Decorate your fortune teller.",
          "description":"You now have 8 triangles (4 triangular flaps that are divided in half by folds). Color each of the 8 triangles with different colors. Write a fortune on the underside of each triangle. Fortune ideas include:\nYou will have a wonderful day today. A friend will call you tomorrow. You will get an A on your next test. Be careful on Wednesday."
        },
        {
          "headline":"Place your hands inside the fortune teller.",
          "description":"Fold the bottom half of the fortune teller up to the top. Tuck the forefingers and thumbs of both of your hands into the openings below. When you look down at your fortune teller, it should resemble a flower."
        },
        {
          "headline":"Play with your fortune teller.",
          "description":"Tell a friend to choose a number from 1-8. Open and close the fortune teller that number of times. Next, tell the friend to choose 1 of the four colors they see. Lift up that color flap, and read your friend their fortune."
        }
      ]
    },
    {
      "name":"Making an Origami Heart",
      "steps":[
        {
          "headline":"Fold the paper in half from corner to corner.",
          "description":"Set a square piece of paper on a flat surface so that it is shaped like a diamond (with a point at the top). Fold the paper so that the top right corner meets the bottom left corner. Crease this line and unfold the paper. Fold the top left corner to meet the bottom right, crease, and unfold."
        },
        {
          "headline":"Bend the top corner to meet the center.",
          "description":"Carefully bend the top point so that it reaches the center crease. Use your finger to tighten the fold. You will now have a flat line on top."
        },
        {
          "headline":"Fold the bottom point to meet the top.",
          "description":"Bend the bottom corner so that the point reaches the flat line at the top. Don’t make the mistake of measuring the bottom point to the center crease; make sure it goes the top of your paper."
        },
        {
          "headline":"Pleat both sides in toward the center.",
          "description":"Bend the right side of your paper so that it overlaps inward. The bottom right side of your paper should match up with your center crease. Repeat this on the left side."
        },
        {
          "headline":"Flip the paper over and fold in the points.",
          "description":"Turn your paper so that it is face down. You will see 2 points on the top, and 1 point on each side. Fold each of the points over to create flat lines. This will make your creation into a heart. Flip the paper back over to reveal your origami heart."
        }
      ]
    }
  ],
  "text":" Creating an Origami Crown Gather 6-7 pieces of paper. In order to make this crown, you will need several pieces of square paper, 6 by 6 inches (15 by 15 cm) in size. For a child-sized crown, you will need 4-5 pieces. For an adult crown, you will need 6-7 pieces. Sturdy paper (like construction paper or craft paper) will work best. Create a cross crease. Fold the paper in half horizontally. Use your finger to make a sharp crease and unfold the paper. Then fold the paper in half vertically. Make a sharp crease using your finger, and unfold your paper again. Create a point on top. Fold the top left corner in to meet the center crease, followed by the right. Use your finger to tighten each crease. At this stage, your paper will look like a little house. Bend the bottom edge up to meet the center. Make a good crease with your finger. At this stage, your paper will look like a sailboat. Fold the bottom edge upward again. Fold the rectangle you made upward, so that it overlaps 1 more time. You have now completed your first modular crown section. Create 3-6 more crown pieces and fit them together. Repeat this method to create more modular crown pieces. Slide the bottom rectangular part of 1 piece inside the rectangular fold of another. Wiggle the pieces together as far as they will go, until the bottoms of the triangles overlap. Finally, connect the first and last pieces together to form a ring. Adjust your crown to be the proper size by adding or removing crown pieces. Folding an Origami Fortune Teller Start with square white paper. For this project, you need a single sheet of square white paper, about 6 by 6 inches (15 by 15 cm) in size. You will also need some crayons and markers. Create an “X” crease. Fold the paper in half so that the top right corner meets the bottom left corner. Use your finger to make a good crease and unfold the paper. Then fold the paper the opposite way, joining the top left corner with the bottom right. Make a good crease and unfold. Make a cross crease. Fold the paper in half again, meeting the bottom edge up with the top edge. Make a crease, then unfold. Repeat this along the vertical axis, make a crease, and unfold the paper. Fold all 4 corners to meet the center. Fold each point so that it touches the center crease point. You should end up with a smaller square than you had before. Turn your paper over and fold all 4 corners to the center again. Once again, fold each corner so that it touches the center crease point. You will now have an even smaller square. Decorate your fortune teller. You now have 8 triangles (4 triangular flaps that are divided in half by folds). Color each of the 8 triangles with different colors. Write a fortune on the underside of each triangle. Fortune ideas include:\nYou will have a wonderful day today. A friend will call you tomorrow. You will get an A on your next test. Be careful on Wednesday. Place your hands inside the fortune teller. Fold the bottom half of the fortune teller up to the top. Tuck the forefingers and thumbs of both of your hands into the openings below. When you look down at your fortune teller, it should resemble a flower. Play with your fortune teller. Tell a friend to choose a number from 1-8. Open and close the fortune teller that number of times. Next, tell the friend to choose 1 of the four colors they see. Lift up that color flap, and read your friend their fortune. Making an Origami Heart Fold the paper in half from corner to corner. Set a square piece of paper on a flat surface so that it is shaped like a diamond (with a point at the top). Fold the paper so that the top right corner meets the bottom left corner. Crease this line and unfold the paper. Fold the top left corner to meet the bottom right, crease, and unfold. Bend the top corner to meet the center. Carefully bend the top point so that it reaches the center crease. Use your finger to tighten the fold. You will now have a flat line on top. Fold the bottom point to meet the top. Bend the bottom corner so that the point reaches the flat line at the top. Don’t make the mistake of measuring the bottom point to the center crease; make sure it goes the top of your paper. Pleat both sides in toward the center. Bend the right side of your paper so that it overlaps inward. The bottom right side of your paper should match up with your center crease. Repeat this on the left side. Flip the paper over and fold in the points. Turn your paper so that it is face down. You will see 2 points on the top, and 1 point on each side. Fold each of the points over to create flat lines. This will make your creation into a heart. Flip the paper back over to reveal your origami heart.",
  "tyn_model":[
    "paper",
    "fortune teller",
    "construction paper",
    "white paper",
    "crayons",
    "markers",
    "“x",
    "” crease",
    "origami heart"
  ],
  "tyn_section":[

  ]
}