{
  "title":"How to Design and Build Your Own House",
  "url":"https://www.wikihow.com/Design-and-Build-Your-Own-House",
  "category_hierarchy":[
    "Home and Garden",
    "Home Improvements",
    "House Building",
    "House Designs and Plans"
  ],
  "parts":[
    {
      "name":"Finding an Architect and Builder",
      "steps":[
        {
          "headline":"Design your own floor plans.",
          "description":"If you’d like to have creative control over every part of your house’s design, it’s possible to design a floor plan with little or no experience. There are various online resources you can use to compose your own blueprints and floor plans. You’ll also need to independently research many aspect of home building that your architect or builder would normally take care of, including:\nAnalyzing the shape and slope of the land plot to determine a specific build location. Determining zoning regulations for your build site."
        },
        {
          "headline":"Contact a reputable architect.",
          "description":"If you choose not to design your own floor plans, you’ll need to find someone to design your house. An architect will incorporate your own vision or the house and your own design preferences into their final design. Working with an architect should be more like collaboration than like handing over control of your pet project. Architect fees for drawing up floor plans usually reach around $5,000 or $6,000 USD. Use The American Institute of Architects online database to search for architects in your city or zip code: https://architectfinder.aia.org."
        },
        {
          "headline":"Obtain bids from builders once the blueprints are complete.",
          "description":"The architect will make the blueprints and floor plans, but you need to find someone to actually build the house. Collect bids from at least 3 builders. In many scenarios, architects work closely with builders. Your architect may already have one (or more) builders that they can recommend with you. Ask your architect for a builder recommendation. This will save you the trouble of having to find a builder on your own."
        }
      ]
    },
    {
      "name":"Designing Your House",
      "steps":[
        {
          "headline":"Determine the location for your house.",
          "description":"It may be that you already own a housing lot, or a chunk of land in a rural area, on which you’re planning to build your house. The location of your house will, in fact, have a significant effect on the design. Work with an architect—or accommodate your own floor plan—to take into account:\nHow to situate the house for the best views from your bedroom, living room, and porch. Where to place the house so it won’t be in shadows from nearby mountains or trees. How to maximize sunlight entering your home."
        },
        {
          "headline":"Formulate a budget with your architect.",
          "description":"Communicate your financial goals to your architect, and ask for their help in establishing a budget for each phase of designing and building the house. The architect can advise you on which building materials and house styles will best suit your architectural and financial goals. For example, stone houses are visually impressive, but can cost 50% more than wood-framed houses. Also consider that multi-story houses typically cost less to build than single-story homes. However, if you’re planning on living in this house in your old age, single-story will be preferable."
        },
        {
          "headline":"Accommodate the needs of all family members.",
          "description":"Think about how many people will be using your house, and how many room you’ll need to designate as bedrooms, hobby rooms, and workshop areas. This will directly effect the size of your house, the size of your living spaces, and the number of bedrooms and bathrooms you build. Relay all of this information to your architect. If you’re planning to expand your family by asking a partner to move in, getting married, or having 1 or more children, you’ll need to anticipate those future needs."
        },
        {
          "headline":"Assist the architect in the design process.",
          "description":"When helping design your own home, take a hands-on approach and communicate to the architect what you want regarding the shape and size of your home. If you have a specific architectural style in mind, or want an overall aesthetic for certain rooms, communicate this as well. A great way to help out the architect is by collecting photographs of rooms that you like or dislike. These can be found in magazines or online. You may not know the specific vocabulary of architecture, but by providing both positive and negative examples, you’ll help the architect design your house the way you want it."
        }
      ]
    },
    {
      "name":"Building Your House",
      "steps":[
        {
          "headline":"Research local city and county building codes.",
          "description":"These sets of rules will govern where you can and cannot build a house. They’ll also restrict architectural aspects of the house like its structural support, the slope of the roof, and the electrical setup. At some point, you’ll need to have a county inspector visit the build site. You should be able to find these rules online without too much trouble. Use a web browser to search for your county followed by the words “building codes.”"
        },
        {
          "headline":"Contact your county government and obtain the necessary building permits.",
          "description":"Once you’re familiar with the building codes, you’ll need to work with the county to obtain actual building permits. You’ll need permits in order to build any structure with plumbing, electrical connectivity, and heating and air conditioning. A county or city inspector will review your building plan and issue permits once the building plan is approved. If the county inspector does not approve of the building plan, you’ll need to revise the building plan as the inspector directs."
        },
        {
          "headline":"Determine how the property will be reached by roads.",
          "description":"All houses—unless you’re building illicitly in an extremely rural area—must be able to be accessed by known roads. If you’re following county codes and building on a relatively remote lot, you’ll need to work with the county building inspector to make sure that your house can be reached by emergency and mail delivery vehicles. Road access shouldn’t be a problem if you’re building in a suburban or urban lot."
        },
        {
          "headline":"Plan how you’ll get water to the house.",
          "description":"If you’re planning to build in an undeveloped, rural area, connecting your house’s plumbing with a water supply network can be an unexpected challenge. Work with your builder to find an efficient way to connect your house to a water supply. This may involve modifying your building location. If you’re building on a vacant lot in a suburban area or small city, this won’t be a problem since a water system will already be in place (although you’ll need to dig a few trenches for water pipes)."
        },
        {
          "headline":"Work with the builder while construction is underway.",
          "description":"On average, it can take from 4 to 6 months to build a new home, from when the foundation is poured to when you move in. During that time, the builder may encounter unforeseen problems, or you may decide to make cosmetic changes to the house layout. Keep in contact with the builder and visit the site frequently to make sure all goes according to plan. Keep in mind that any changes you make to the house plans—or problems encountered by the builder—may increase the amount you’ve budgeted to spend."
        }
      ]
    }
  ],
  "text":" Finding an Architect and Builder Design your own floor plans. If you’d like to have creative control over every part of your house’s design, it’s possible to design a floor plan with little or no experience. There are various online resources you can use to compose your own blueprints and floor plans. You’ll also need to independently research many aspect of home building that your architect or builder would normally take care of, including:\nAnalyzing the shape and slope of the land plot to determine a specific build location. Determining zoning regulations for your build site. Contact a reputable architect. If you choose not to design your own floor plans, you’ll need to find someone to design your house. An architect will incorporate your own vision or the house and your own design preferences into their final design. Working with an architect should be more like collaboration than like handing over control of your pet project. Architect fees for drawing up floor plans usually reach around $5,000 or $6,000 USD. Use The American Institute of Architects online database to search for architects in your city or zip code: https://architectfinder.aia.org. Obtain bids from builders once the blueprints are complete. The architect will make the blueprints and floor plans, but you need to find someone to actually build the house. Collect bids from at least 3 builders. In many scenarios, architects work closely with builders. Your architect may already have one (or more) builders that they can recommend with you. Ask your architect for a builder recommendation. This will save you the trouble of having to find a builder on your own. Designing Your House Determine the location for your house. It may be that you already own a housing lot, or a chunk of land in a rural area, on which you’re planning to build your house. The location of your house will, in fact, have a significant effect on the design. Work with an architect—or accommodate your own floor plan—to take into account:\nHow to situate the house for the best views from your bedroom, living room, and porch. Where to place the house so it won’t be in shadows from nearby mountains or trees. How to maximize sunlight entering your home. Formulate a budget with your architect. Communicate your financial goals to your architect, and ask for their help in establishing a budget for each phase of designing and building the house. The architect can advise you on which building materials and house styles will best suit your architectural and financial goals. For example, stone houses are visually impressive, but can cost 50% more than wood-framed houses. Also consider that multi-story houses typically cost less to build than single-story homes. However, if you’re planning on living in this house in your old age, single-story will be preferable. Accommodate the needs of all family members. Think about how many people will be using your house, and how many room you’ll need to designate as bedrooms, hobby rooms, and workshop areas. This will directly effect the size of your house, the size of your living spaces, and the number of bedrooms and bathrooms you build. Relay all of this information to your architect. If you’re planning to expand your family by asking a partner to move in, getting married, or having 1 or more children, you’ll need to anticipate those future needs. Assist the architect in the design process. When helping design your own home, take a hands-on approach and communicate to the architect what you want regarding the shape and size of your home. If you have a specific architectural style in mind, or want an overall aesthetic for certain rooms, communicate this as well. A great way to help out the architect is by collecting photographs of rooms that you like or dislike. These can be found in magazines or online. You may not know the specific vocabulary of architecture, but by providing both positive and negative examples, you’ll help the architect design your house the way you want it. Building Your House Research local city and county building codes. These sets of rules will govern where you can and cannot build a house. They’ll also restrict architectural aspects of the house like its structural support, the slope of the roof, and the electrical setup. At some point, you’ll need to have a county inspector visit the build site. You should be able to find these rules online without too much trouble. Use a web browser to search for your county followed by the words “building codes.” Contact your county government and obtain the necessary building permits. Once you’re familiar with the building codes, you’ll need to work with the county to obtain actual building permits. You’ll need permits in order to build any structure with plumbing, electrical connectivity, and heating and air conditioning. A county or city inspector will review your building plan and issue permits once the building plan is approved. If the county inspector does not approve of the building plan, you’ll need to revise the building plan as the inspector directs. Determine how the property will be reached by roads. All houses—unless you’re building illicitly in an extremely rural area—must be able to be accessed by known roads. If you’re following county codes and building on a relatively remote lot, you’ll need to work with the county building inspector to make sure that your house can be reached by emergency and mail delivery vehicles. Road access shouldn’t be a problem if you’re building in a suburban or urban lot. Plan how you’ll get water to the house. If you’re planning to build in an undeveloped, rural area, connecting your house’s plumbing with a water supply network can be an unexpected challenge. Work with your builder to find an efficient way to connect your house to a water supply. This may involve modifying your building location. If you’re building on a vacant lot in a suburban area or small city, this won’t be a problem since a water system will already be in place (although you’ll need to dig a few trenches for water pipes). Work with the builder while construction is underway. On average, it can take from 4 to 6 months to build a new home, from when the foundation is poured to when you move in. During that time, the builder may encounter unforeseen problems, or you may decide to make cosmetic changes to the house layout. Keep in contact with the builder and visit the site frequently to make sure all goes according to plan. Keep in mind that any changes you make to the house plans—or problems encountered by the builder—may increase the amount you’ve budgeted to spend.",
  "tyn_model":[
    "architect",
    "builders",
    "water",
    "architects",
    "builder",
    "—or",
    "—to",
    "building materials",
    "photographs",
    "“building",
    "” contact",
    "building permits",
    "building codes",
    "plumbing",
    "—unless",
    "—must",
    "—may"
  ],
  "tyn_section":[

  ]
}