{
  "title":"How to Measure Flooring",
  "url":"https://www.wikihow.com/Measure-Flooring",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs"
  ],
  "parts":[
    {
      "name":"Dividing the Room into Rectangles",
      "steps":[
        {
          "headline":"Map out the entire floorspace.",
          "description":"Look around at all the floor that will need to be covered. This includes everything bordered by walls, but also less obvious places like the floor inside of closets. Sketch the floorspace out on a sheet of paper for reference."
        },
        {
          "headline":"Measure the length and width of the room.",
          "description":"Run a tape measure down one side of the room to get its length. Move the tape measure and record the other wall in the same way. Write these measurements down on the sketch you made for reference. If there aren’t any obstructions or unusual aspects to the room, the length and width will be enough to calculate the area."
        },
        {
          "headline":"Multiply to get the area.",
          "description":"Take the length and multiply it by the width to get the area of floor space in square units. For instance, if one wall is 10 feet (3.0 m) and the other is 8 feet (2.4 m), multiply these to get a total floor space area of 80 feet (24 m) square. If there are any closets, obstructions, or angled areas in the room, you’ll start with this basic area and adjust it with a few more calculations to get the actual total amount of floor space."
        },
        {
          "headline":"Use an online calculator for a quick solution.",
          "description":"If you have a simple room with no obstructions or unusual shapes, look up an online floor space calculator. Enter the length and width measurements, and the calculator will compute the area."
        }
      ]
    },
    {
      "name":"Adjusting for Angles, Additions, and Obstructions",
      "steps":[
        {
          "headline":"Divide non-rectangular rooms into smaller segments.",
          "description":"It the room is not simply a rectangle or square, you can cut it into a series of smaller, imaginary portions. Take the length and width of these, calculate the area of each segment, then add everything together to get the total floorspace area. For instance, imagine you have an “L” shaped room:\nThe long part of the “L” is 14 feet (4.3 m) long and 8 feet (2.4 m) on one end and 12 feet (3.7 m) on the other. The other walls on the part of the “L” that sticks out are 6 feet (1.8 m) and 4 feet (1.2 m) long. This means you can divide the room into two rectangles. One will be 14 feet (4.3 m) by 8 feet (2.4 m). The other will be 6 feet (1.8 m) by 4 feet (1.2 m). Calculating the area of each rectangle, then adding the sums together gives you a total floorspace of 136 feet (41 m) square."
        },
        {
          "headline":"Add any extra floorspace area.",
          "description":"If you have something like floor space on the interior of a closet, calculate this separately, then add it to your total. If there is a 2 feet (0.61 m) by 3 feet (0.91 m) closet off of your “L” shaped room for instance, add its area of 6 feet (1.8 m) square to the main floor area to get a total of 142 feet (43 m) square."
        },
        {
          "headline":"Account for any angular areas.",
          "description":"Plan on buying extra flooring to account for these. That way you’ll have enough material. For instance:\nImagine you have a bay window that juts out in a trapezoidal shape. The base of this trapezoid (an imaginary line going from one end of its widest point to the other) is 4 feet (1.2 m). The height of the trapezoid (the distance from the imaginary line of the base to the point where the wall starts under the window) is 0.5 feet (0.15 m). Multiply these measurements to get a hypothetical rectangle with an area of 2 feet (0.61 m) square. The sides of the trapezoid will angle inwards, making the actual area less than 2 feet (0.61 m) square. You’ll cut the flooring material to fit the trapezoid later, and discard the excess."
        },
        {
          "headline":"Subtract the area of any obstructions on the floor.",
          "description":"Check your floorspace and see there are things like a kitchen island, support beam, or floor vents that will not need to be covered by flooring. Subtract the area of these obstructions from the total area of floorspace to get the actual amount you need covered."
        }
      ]
    },
    {
      "name":"Purchasing Enough Flooring",
      "steps":[
        {
          "headline":"Account for extra material.",
          "description":"Take  your total floor space area and multiply it by 1.05 for a 5 percent increase or 1.1 for a 10 percent increase. This ensures you buy enough material, whatever kind you're using, to have extra in case you need it. For instance, if the total floor space is 142 feet (43 m) square, a 5 percent increase would give you 149.1 feet (45.4 m) square. A 10 percent increase would give you 156.2 feet (47.6 m) square. Having extra material is a safeguard against mistakes or damages that occur either during installation or later. You can always replace the ruined piece with new material if you have extra on hand."
        },
        {
          "headline":"Purchase your boxes of flooring.",
          "description":"Check boxes of flooring to see how much area they cover. Buy enough to meet or exceed the amount of floor space (plus extra) you need covered. Divide the total area you want covered by the amount each box of flooring covers to find the number of boxes you need. Add a box if there is any remainder. For instance, if each box of flooring covers 10 feet (3.0 m) square, and you have 149.1 feet (45.4 m) square to cover, you’ll need 15 boxes (149.1 divided by 10 is 14.91)."
        },
        {
          "headline":"Buy enough rolls of carpeting, alternatively.",
          "description":"Carpeting is sold by the roll, but you can easily calculate the amount you'll need. For instance, if you are covering the area in carpeting that is sold in rolls 10 feet (3.0 m) wide, for example, you’ll need a roll that’s at least 14.91 feet (4.54 m) long, which would equal the total floor area you’re covering."
        },
        {
          "headline":"Calculate the number of tiles you’ll need, if applicable.",
          "description":"If you are covering your floor in tile (or some other material sold in pieces), divide the area of flooring by the area of an individual tile to determine how many you’ll need. For example:\nIf you are using tiles that are 0.5 feet (0.15 m) square, and you want to cover a room that is 80 feet (24 m) square, you’ll need 160 tiles (80 divided by 0.5 equals 160. Add 10 percent extra as a precaution, to equal a total of 176 tiles."
        }
      ]
    }
  ],
  "text":" Dividing the Room into Rectangles Map out the entire floorspace. Look around at all the floor that will need to be covered. This includes everything bordered by walls, but also less obvious places like the floor inside of closets. Sketch the floorspace out on a sheet of paper for reference. Measure the length and width of the room. Run a tape measure down one side of the room to get its length. Move the tape measure and record the other wall in the same way. Write these measurements down on the sketch you made for reference. If there aren’t any obstructions or unusual aspects to the room, the length and width will be enough to calculate the area. Multiply to get the area. Take the length and multiply it by the width to get the area of floor space in square units. For instance, if one wall is 10 feet (3.0 m) and the other is 8 feet (2.4 m), multiply these to get a total floor space area of 80 feet (24 m) square. If there are any closets, obstructions, or angled areas in the room, you’ll start with this basic area and adjust it with a few more calculations to get the actual total amount of floor space. Use an online calculator for a quick solution. If you have a simple room with no obstructions or unusual shapes, look up an online floor space calculator. Enter the length and width measurements, and the calculator will compute the area. Adjusting for Angles, Additions, and Obstructions Divide non-rectangular rooms into smaller segments. It the room is not simply a rectangle or square, you can cut it into a series of smaller, imaginary portions. Take the length and width of these, calculate the area of each segment, then add everything together to get the total floorspace area. For instance, imagine you have an “L” shaped room:\nThe long part of the “L” is 14 feet (4.3 m) long and 8 feet (2.4 m) on one end and 12 feet (3.7 m) on the other. The other walls on the part of the “L” that sticks out are 6 feet (1.8 m) and 4 feet (1.2 m) long. This means you can divide the room into two rectangles. One will be 14 feet (4.3 m) by 8 feet (2.4 m). The other will be 6 feet (1.8 m) by 4 feet (1.2 m). Calculating the area of each rectangle, then adding the sums together gives you a total floorspace of 136 feet (41 m) square. Add any extra floorspace area. If you have something like floor space on the interior of a closet, calculate this separately, then add it to your total. If there is a 2 feet (0.61 m) by 3 feet (0.91 m) closet off of your “L” shaped room for instance, add its area of 6 feet (1.8 m) square to the main floor area to get a total of 142 feet (43 m) square. Account for any angular areas. Plan on buying extra flooring to account for these. That way you’ll have enough material. For instance:\nImagine you have a bay window that juts out in a trapezoidal shape. The base of this trapezoid (an imaginary line going from one end of its widest point to the other) is 4 feet (1.2 m). The height of the trapezoid (the distance from the imaginary line of the base to the point where the wall starts under the window) is 0.5 feet (0.15 m). Multiply these measurements to get a hypothetical rectangle with an area of 2 feet (0.61 m) square. The sides of the trapezoid will angle inwards, making the actual area less than 2 feet (0.61 m) square. You’ll cut the flooring material to fit the trapezoid later, and discard the excess. Subtract the area of any obstructions on the floor. Check your floorspace and see there are things like a kitchen island, support beam, or floor vents that will not need to be covered by flooring. Subtract the area of these obstructions from the total area of floorspace to get the actual amount you need covered. Purchasing Enough Flooring Account for extra material. Take  your total floor space area and multiply it by 1.05 for a 5 percent increase or 1.1 for a 10 percent increase. This ensures you buy enough material, whatever kind you're using, to have extra in case you need it. For instance, if the total floor space is 142 feet (43 m) square, a 5 percent increase would give you 149.1 feet (45.4 m) square. A 10 percent increase would give you 156.2 feet (47.6 m) square. Having extra material is a safeguard against mistakes or damages that occur either during installation or later. You can always replace the ruined piece with new material if you have extra on hand. Purchase your boxes of flooring. Check boxes of flooring to see how much area they cover. Buy enough to meet or exceed the amount of floor space (plus extra) you need covered. Divide the total area you want covered by the amount each box of flooring covers to find the number of boxes you need. Add a box if there is any remainder. For instance, if each box of flooring covers 10 feet (3.0 m) square, and you have 149.1 feet (45.4 m) square to cover, you’ll need 15 boxes (149.1 divided by 10 is 14.91). Buy enough rolls of carpeting, alternatively. Carpeting is sold by the roll, but you can easily calculate the amount you'll need. For instance, if you are covering the area in carpeting that is sold in rolls 10 feet (3.0 m) wide, for example, you’ll need a roll that’s at least 14.91 feet (4.54 m) long, which would equal the total floor area you’re covering. Calculate the number of tiles you’ll need, if applicable. If you are covering your floor in tile (or some other material sold in pieces), divide the area of flooring by the area of an individual tile to determine how many you’ll need. For example:\nIf you are using tiles that are 0.5 feet (0.15 m) square, and you want to cover a room that is 80 feet (24 m) square, you’ll need 160 tiles (80 divided by 0.5 equals 160. Add 10 percent extra as a precaution, to equal a total of 176 tiles.",
  "tyn_model":[
    "“l",
    "material",
    "carpeting",
    "tape measure",
    "calculator",
    "” shaped",
    "flooring",
    "tiles",
    "paper",
    "floor space calculator",
    "” is",
    "” that",
    "flooring material",
    "tile"
  ],
  "tyn_section":[

  ]
}