{
  "title":"How to Get Odor Out of Clothes",
  "url":"https://www.wikihow.com/Get-Odor-Out-of-Clothes",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Treating Laundry Odors"
  ],
  "methods":[
    {
      "name":"Removing Smells in the Wash",
      "steps":[
        {
          "headline":"Read the care label on your garments.",
          "description":"Each item of clothing should have a label or tag on the inside that will specify how it should be washed and dried. Read each label carefully to ensure that you prolong the life of your clothes and don’t damage them with improper care. If your garment does not have a care label, wash it in cold water only to avoid accidentally shrinking or damaging the fabric. If it is very old or expensive, it may be safer to assume that it is dry clean only."
        },
        {
          "headline":"Pre-soak your clothes.",
          "description":"Fill a clean bucket or tub with warm water and 1 ounce (28 g) of detergent, and add any clothes you want to remove odors from. Let them sit for about 30 minutes. You can also add the juice of half a lemon to your pre-soak solution to help break up any body oils soaked into the fabric. Use cold water if your garment’s care label indicates that it is cold-wash only."
        },
        {
          "headline":"Scrub any particularly smelly areas.",
          "description":"Take a soft-bristled cleaning brush and gently scrub any especially smelly sections of your garments. On gym clothes, this might be the armpits or the collar. This method works better when the garment has been pre-soaked, but it can still be effective without soaking. If you choose to skip the pre-soak, get the garment wet before scrubbing."
        },
        {
          "headline":"Add 8 ounces (230 g) of baking soda with your detergent.",
          "description":"Baking soda is frequently used as a deodorizer, and can help to draw the smells out of clothes. If you are using powdered detergent, add the baking soda along with it in the detergent tray. If you are using liquid detergent, add the baking soda to the wash basin after it’s filled with water."
        },
        {
          "headline":"Use oxygenated bleach.",
          "description":"Unlike chlorine bleach, it will be less likely to cause your clothes to fade, and can be very effective in removing odors. It is also more environmentally friendly than chlorine bleach and less corrosive to fabrics. Use it along with your normal detergent. While oxygenated bleach is generally considered color-safe, you shouldn’t use it if your garment’s care label says “No Bleach.”"
        },
        {
          "headline":"Try Borax laundry detergent.",
          "description":"Borax can be useful in eliminating odors, removing stains, and even softening water. Many household brands offer laundry detergents that contain Borax, which saves you the trouble of measuring and adding the Borax separately. Use it instead of your regular detergent, and combine it with an additive like oxygenated bleach or baking soda for especially smelly garments. If you can’t find any Borax detergents, simply dissolve 4 ounces (110 g) of powdered Borax in hot water and add to a load along with your normal detergent. Wait until the wash basin has filled with water before adding the Borax solution."
        },
        {
          "headline":"Add 1 cup (240 ml) of white vinegar during the rinse cycle.",
          "description":"Vinegar is an affordable, natural option for eliminating embedded odors. Adding it during the rinse cycle will allow it to neutralize odors without lessening the effect of your laundry detergent. If you are dealing with particularly strong smells, add 1 cup (240 ml) of vinegar. For especially tenacious smells, try using this additive along with baking soda. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle. She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices. Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tAdd a pleasant scent with tea tree oil. Try adding several drops of tea tree essential oil to your detergent. It removes smells by killing whatever is causing them. It's amazing at killing bacteria and germs, and it's also a natural anti-fungal."
        }
      ]
    },
    {
      "name":"Deodorizing Garments Without Washing",
      "steps":[
        {
          "headline":"Air out old clothes.",
          "description":"If you recently bought your garments from a thrift shop or secondhand store, or if they have been sitting your closet for quite a while, hang them up somewhere with good ventilation. Allow them to air out for at least a day, longer if possible. Hanging clothes outside will air them out faster. Just be sure to watch the weather -- and don’t leave them out overnight, or they may become dewy and moist, which can worsen their condition."
        },
        {
          "headline":"Spritz musty clothes with vodka.",
          "description":"Fill a small spray bottle with undiluted vodka and thoroughly spritz any musty or old-smelling clothes to neutralize odors, then leave them where they can air out for a few hours. This is a particularly useful trick for extremely old or ornate clothing that is difficult to wash."
        },
        {
          "headline":"Use cat litter to absorb smells.",
          "description":"As strange as it sounds, cat litter contains activated charcoal and is designed to absorb unwanted odors. Put your garment in a bag or tub and fill it about halfway with cat litter. Leave it for at least 24 hours and up to a week. The cat litter should be easy to shake or dust off after removal."
        },
        {
          "headline":"Use a vinegar spray.",
          "description":"Hang your clothes up and spritz them with undiluted white vinegar. The acidity will cut through odors without leaving a lingering vinegar smell. Let the garment dry out completely before wearing it. This can also work well as a quick fix to freshen up clothes between washes."
        },
        {
          "headline":"Freeze your clothes to kill odor-causing bacteria.",
          "description":"Put the offending garment in a sealable plastic bag and leave it in the freezer for at least 2-3 hours. This will kill some of the living organisms that produce unpleasant smells. Once the item has thawed, it should smell and feel cleaner."
        },
        {
          "headline":"Take your clothes to a professional dry cleaner.",
          "description":"Although this often costs more than cleaning your clothes at home, it may be worth the money when dealing with garments that are expensive or extremely delicate, as it will give you the best guarantee that your clothes will end up odor-free."
        },
        {
          "headline":"Buy a home dry cleaning kit.",
          "description":"If you own several clothes that can’t be put in the washing machine, it may be worthwhile to purchase your own dry cleaning kit. Search online retailers or department stores for a kit. Whirlpool also sells a free-standing dry-cleaning appliance that can be used in your home."
        }
      ]
    },
    {
      "name":"Preventing Odor Buildup",
      "steps":[
        {
          "headline":"Store dirty laundry in a breathable bag or hamper.",
          "description":"If your dirty clothes are left in a gym bag or a bin with no air-flow, bacteria will grow faster and cause smells that will be difficult to remove. Put dirty laundry in a breathable container such as a mesh hamper as soon as possible."
        },
        {
          "headline":"Turn clothes inside out before washing.",
          "description":"Body oils and sweat build up on the inside of clothes, not the outside, so it can be helpful to turn clothes inside out before putting them in the washer. This is especially true of workout clothes or anything you sweat heavily in."
        },
        {
          "headline":"Check your washer for detergent buildup.",
          "description":"Washers can become smelly themselves when too much detergent builds up, and may leave sour or mildew smells in your laundry. Test for this either by simply smelling the empty washer or by running a cycle with no detergent and watching for any suds that result from built-up detergent. Detergent buildup can be decreased by running an empty hot cycle with 16 ounces (450 g) of bleach. Leave your washer’s door or lid open when not in use to air out the inside."
        },
        {
          "headline":"Don’t overfill the machine.",
          "description":"You should fill the washer to no more than ¾ of its capacity. Otherwise, the oils, bacteria and other substances that cause unwanted smells will not be thoroughly washed from your clothes and may build up over time."
        },
        {
          "headline":"Use the recommended amount of detergent.",
          "description":"Follows the instructions on your detergent’s label and don’t add more than specified. Detergent increases the water’s viscosity, which can make it more difficult for the water to penetrate the fabric and remove dirt and odors."
        },
        {
          "headline":"Skip liquid fabric softener.",
          "description":"It can actually act to seal in odors and body oils. If you choose to use fabric softener, avoid using it on clothes that accumulate more odors, such as gym clothes. Dryer sheets can also be used in place of liquid softener, and won’t be as likely to make your clothes retain their smells."
        },
        {
          "headline":"Smell clothes before drying them.",
          "description":"Putting smelly clothes in the dryer can “bake” odors into them. If you are dealing with clothes that contain unwanted smells, give them a sniff before throwing them in the dryer, and wash them again if you detect any remaining odors. If your clothes still seem to retain some odors after a second wash, try air-drying them. This can be particularly effective if you are able to hang them outside or somewhere with plenty of airflow."
        }
      ]
    }
  ],
  "text":" Removing Smells in the Wash Read the care label on your garments. Each item of clothing should have a label or tag on the inside that will specify how it should be washed and dried. Read each label carefully to ensure that you prolong the life of your clothes and don’t damage them with improper care. If your garment does not have a care label, wash it in cold water only to avoid accidentally shrinking or damaging the fabric. If it is very old or expensive, it may be safer to assume that it is dry clean only. Pre-soak your clothes. Fill a clean bucket or tub with warm water and 1 ounce (28 g) of detergent, and add any clothes you want to remove odors from. Let them sit for about 30 minutes. You can also add the juice of half a lemon to your pre-soak solution to help break up any body oils soaked into the fabric. Use cold water if your garment’s care label indicates that it is cold-wash only. Scrub any particularly smelly areas. Take a soft-bristled cleaning brush and gently scrub any especially smelly sections of your garments. On gym clothes, this might be the armpits or the collar. This method works better when the garment has been pre-soaked, but it can still be effective without soaking. If you choose to skip the pre-soak, get the garment wet before scrubbing. Add 8 ounces (230 g) of baking soda with your detergent. Baking soda is frequently used as a deodorizer, and can help to draw the smells out of clothes. If you are using powdered detergent, add the baking soda along with it in the detergent tray. If you are using liquid detergent, add the baking soda to the wash basin after it’s filled with water. Use oxygenated bleach. Unlike chlorine bleach, it will be less likely to cause your clothes to fade, and can be very effective in removing odors. It is also more environmentally friendly than chlorine bleach and less corrosive to fabrics. Use it along with your normal detergent. While oxygenated bleach is generally considered color-safe, you shouldn’t use it if your garment’s care label says “No Bleach.” Try Borax laundry detergent. Borax can be useful in eliminating odors, removing stains, and even softening water. Many household brands offer laundry detergents that contain Borax, which saves you the trouble of measuring and adding the Borax separately. Use it instead of your regular detergent, and combine it with an additive like oxygenated bleach or baking soda for especially smelly garments. If you can’t find any Borax detergents, simply dissolve 4 ounces (110 g) of powdered Borax in hot water and add to a load along with your normal detergent. Wait until the wash basin has filled with water before adding the Borax solution. Add 1 cup (240 ml) of white vinegar during the rinse cycle. Vinegar is an affordable, natural option for eliminating embedded odors. Adding it during the rinse cycle will allow it to neutralize odors without lessening the effect of your laundry detergent. If you are dealing with particularly strong smells, add 1 cup (240 ml) of vinegar. For especially tenacious smells, try using this additive along with baking soda. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle. She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices. Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tAdd a pleasant scent with tea tree oil. Try adding several drops of tea tree essential oil to your detergent. It removes smells by killing whatever is causing them. It's amazing at killing bacteria and germs, and it's also a natural anti-fungal. Deodorizing Garments Without Washing Air out old clothes. If you recently bought your garments from a thrift shop or secondhand store, or if they have been sitting your closet for quite a while, hang them up somewhere with good ventilation. Allow them to air out for at least a day, longer if possible. Hanging clothes outside will air them out faster. Just be sure to watch the weather -- and don’t leave them out overnight, or they may become dewy and moist, which can worsen their condition. Spritz musty clothes with vodka. Fill a small spray bottle with undiluted vodka and thoroughly spritz any musty or old-smelling clothes to neutralize odors, then leave them where they can air out for a few hours. This is a particularly useful trick for extremely old or ornate clothing that is difficult to wash. Use cat litter to absorb smells. As strange as it sounds, cat litter contains activated charcoal and is designed to absorb unwanted odors. Put your garment in a bag or tub and fill it about halfway with cat litter. Leave it for at least 24 hours and up to a week. The cat litter should be easy to shake or dust off after removal. Use a vinegar spray. Hang your clothes up and spritz them with undiluted white vinegar. The acidity will cut through odors without leaving a lingering vinegar smell. Let the garment dry out completely before wearing it. This can also work well as a quick fix to freshen up clothes between washes. Freeze your clothes to kill odor-causing bacteria. Put the offending garment in a sealable plastic bag and leave it in the freezer for at least 2-3 hours. This will kill some of the living organisms that produce unpleasant smells. Once the item has thawed, it should smell and feel cleaner. Take your clothes to a professional dry cleaner. Although this often costs more than cleaning your clothes at home, it may be worth the money when dealing with garments that are expensive or extremely delicate, as it will give you the best guarantee that your clothes will end up odor-free. Buy a home dry cleaning kit. If you own several clothes that can’t be put in the washing machine, it may be worthwhile to purchase your own dry cleaning kit. Search online retailers or department stores for a kit. Whirlpool also sells a free-standing dry-cleaning appliance that can be used in your home. Preventing Odor Buildup Store dirty laundry in a breathable bag or hamper. If your dirty clothes are left in a gym bag or a bin with no air-flow, bacteria will grow faster and cause smells that will be difficult to remove. Put dirty laundry in a breathable container such as a mesh hamper as soon as possible. Turn clothes inside out before washing. Body oils and sweat build up on the inside of clothes, not the outside, so it can be helpful to turn clothes inside out before putting them in the washer. This is especially true of workout clothes or anything you sweat heavily in. Check your washer for detergent buildup. Washers can become smelly themselves when too much detergent builds up, and may leave sour or mildew smells in your laundry. Test for this either by simply smelling the empty washer or by running a cycle with no detergent and watching for any suds that result from built-up detergent. Detergent buildup can be decreased by running an empty hot cycle with 16 ounces (450 g) of bleach. Leave your washer’s door or lid open when not in use to air out the inside. Don’t overfill the machine. You should fill the washer to no more than ¾ of its capacity. Otherwise, the oils, bacteria and other substances that cause unwanted smells will not be thoroughly washed from your clothes and may build up over time. Use the recommended amount of detergent. Follows the instructions on your detergent’s label and don’t add more than specified. Detergent increases the water’s viscosity, which can make it more difficult for the water to penetrate the fabric and remove dirt and odors. Skip liquid fabric softener. It can actually act to seal in odors and body oils. If you choose to use fabric softener, avoid using it on clothes that accumulate more odors, such as gym clothes. Dryer sheets can also be used in place of liquid softener, and won’t be as likely to make your clothes retain their smells. Smell clothes before drying them. Putting smelly clothes in the dryer can “bake” odors into them. If you are dealing with clothes that contain unwanted smells, give them a sniff before throwing them in the dryer, and wash them again if you detect any remaining odors. If your clothes still seem to retain some odors after a second wash, try air-drying them. This can be particularly effective if you are able to hang them outside or somewhere with plenty of airflow.",
  "tyn_model":[
    "water",
    "detergent",
    "baking soda",
    "washer",
    "vinegar",
    "cat litter",
    "borax",
    "green cleaning",
    "oxygenated bleach",
    "chlorine bleach",
    "bleach",
    "white vinegar",
    "green cleaning expert",
    "vodka",
    "fabric softener",
    "dryer",
    "lemon",
    "cold water",
    "detergent tray",
    "“no",
    "” try",
    "borax laundry detergent",
    "laundry detergents",
    "borax solution",
    "laundry detergent",
    "— winning",
    "—and",
    "tea tree oil",
    "tea tree essential oil",
    "garments",
    "spray bottle",
    "activated charcoal",
    "freezer",
    "dry cleaner",
    "dry cleaning kit",
    "dry cleaning",
    "free-standing dry-cleaning appliance",
    "breathable bag or hamper",
    "mesh hamper",
    "washers",
    "dryer sheets",
    "liquid softener",
    "“bake",
    "” odors"
  ],
  "tyn_section":[

  ]
}