{
  "title":"How to Cook Skinless Salmon",
  "url":"https://www.wikihow.com/Cook-Skinless-Salmon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Salmon"
  ],
  "methods":[
    {
      "name":"Baking Skinless Salmon",
      "steps":[
        {
          "headline":"Preheat your oven to 450° F (232° C).",
          "description":"To help your salmon bake evenly, arrange your racks so you can place a baking dish in the very center, equally distant from the top and bottom."
        },
        {
          "headline":"Brush your salmon with olive oil.",
          "description":"Use a brush to spread a light amount of olive oil over your filet. This will help your salmon retain moisture while stuck in the oven. If your salmon is large, cut it into smaller filets before spreading any oil."
        },
        {
          "headline":"Season your salmon with herbs, spices, and citrus.",
          "description":"To season your salmon thoroughly, sprinkle pinches of salt, pepper, dill, garlic, parsley, and tarragon over the filet. After, squeeze half of your citrus fruit over the salmon for extra flavor and juiciness. Make sure to season both sides before baking."
        },
        {
          "headline":"Place your salmon in a baking dish coated with nonstick cooking spray.",
          "description":"You can also use aluminum foil or non-stick baking sheets as an alternative to cooking spray."
        },
        {
          "headline":"Bake your salmon for about 5 minutes per every ⁄2 inch (1.3 cm) of thickness.",
          "description":"For most salmon, this leads to baking times of around 15 minutes. Salmon can dry out quickly, so make sure you keep an eye on it while cooking."
        },
        {
          "headline":"Serve your salmon when it flakes easily.",
          "description":"To check if your salmon is ready, scrape the center of the fish with a fork to see if it's done. If it doesn't slake, leave it in for a few more minutes."
        }
      ]
    },
    {
      "name":"Grilling Skinless Salmon",
      "steps":[
        {
          "headline":"Preheat your grill to a medium high setting.",
          "description":"This will cook your salmon thoroughly and evenly. If you’re using a charcoal grill, spread the coals out, light the fire, and wait about 5 minutes before you start cooking."
        },
        {
          "headline":"Oil your grill to prevent sticking.",
          "description":"While your grill is heating up, run a cloth dipped in olive oil over your grates. This will help prevent your salmon from sticking to the surface. Keep the cloth between your hand and the grates to avoid burning yourself."
        },
        {
          "headline":"Spread a light amount of olive oil over your filet.",
          "description":"Use a brush to coat your fish with a thin layer of olive oil. This will pack in moisture while your salmon is grilling. If your filet is large, cut it into smaller pieces before using any olive oil."
        },
        {
          "headline":"Sprinkle herbs, spices, and citrus over your salmon.",
          "description":"To add additional flavor, sprinkle your fish with a small amount of salt, pepper, dill, garlic, parsley, and tarragon. For additional zest, squeeze half of your lemon or lime over the filet. Before grilling, make sure you cover both sides. To give your salmon more flavor, place it in a wet marinade an hour before cooking. Popular ingredients include lemon juice, sesame oil, honey, and hot sauce."
        },
        {
          "headline":"Grill your salmon until one side is golden brown.",
          "description":"Place the filet on a part of the grill where heat is evenly distributed, avoiding spots directly above large flames or burners. Depending on the size of your filet and the heat of the grill, each side could take between 4 and 8 minutes to cook. To give your salmon grill-marks, place it at a 45° angle to the grate."
        },
        {
          "headline":"Use a wide spatula to flip the salmon over and cook the other side.",
          "description":"Avoid tongs, which can force moisture out of the fish, and skewers, which can cause the fish to break apart."
        },
        {
          "headline":"Move your salmon off the heat to finish cooking.",
          "description":"To see if your salmon is close to done, press your spatula into the center of the fish. If it flakes and causes clear juice to run out, it is ready to be moved. Fish can dry out quickly, so taking your salmon off the grill will ensure that residual heat does not overcook or burn it."
        }
      ]
    },
    {
      "name":"Poaching Skinless Salmon",
      "steps":[
        {
          "headline":"Fill a pot with cold water, lemon, onion, celery, salt, and herbs.",
          "description":"Fill a pot with 1 US-quart (950 ml) (1 L) of cold water. Either squeeze your lemon into the water or cut it into thin slices to insert. Place your onions, celery, and bay leaf into the pot. Sprinkle thyme, dill, and salt on top to taste. For more flavor, try adding peppercorns, other vegetables like carrots, or cooking liquids like chicken stock and white wine."
        },
        {
          "headline":"Add your salmon filet and heat to a medium temperature.",
          "description":"To avoid overcooking your fish, keep your pot well below boiling, aiming for a temperature around 170° F (76° C). If your water does not fully cover the salmon, add just enough to do so. Do not preheat your pot. Starting cold will help your salmon retain moisture and avoid overheating."
        },
        {
          "headline":"Cook your salmon until it is opaque and flakes easily.",
          "description":"Let your salmon simmer until it can be easily pulled apart by a fork and is no longer transparent on the inside. Depending on the exact heat, this could take between 20 and 30 minutes. Poached salmon will not change colors as drastically as grilled or baked salmon, so pay extra attention to the opacity and toughness."
        },
        {
          "headline":"Season with salt, pepper, and herbs.",
          "description":"Sprinkle your salmon with a small amount of salt, pepper, thyme, and dill. Poached salmon has a naturally clean, light flavor, so avoid excessive seasoning. Squeeze lemon over the top to add a zesty kick."
        }
      ]
    }
  ],
  "text":" Baking Skinless Salmon Preheat your oven to 450° F (232° C). To help your salmon bake evenly, arrange your racks so you can place a baking dish in the very center, equally distant from the top and bottom. Brush your salmon with olive oil. Use a brush to spread a light amount of olive oil over your filet. This will help your salmon retain moisture while stuck in the oven. If your salmon is large, cut it into smaller filets before spreading any oil. Season your salmon with herbs, spices, and citrus. To season your salmon thoroughly, sprinkle pinches of salt, pepper, dill, garlic, parsley, and tarragon over the filet. After, squeeze half of your citrus fruit over the salmon for extra flavor and juiciness. Make sure to season both sides before baking. Place your salmon in a baking dish coated with nonstick cooking spray. You can also use aluminum foil or non-stick baking sheets as an alternative to cooking spray. Bake your salmon for about 5 minutes per every ⁄2 inch (1.3 cm) of thickness. For most salmon, this leads to baking times of around 15 minutes. Salmon can dry out quickly, so make sure you keep an eye on it while cooking. Serve your salmon when it flakes easily. To check if your salmon is ready, scrape the center of the fish with a fork to see if it's done. If it doesn't slake, leave it in for a few more minutes. Grilling Skinless Salmon Preheat your grill to a medium high setting. This will cook your salmon thoroughly and evenly. If you’re using a charcoal grill, spread the coals out, light the fire, and wait about 5 minutes before you start cooking. Oil your grill to prevent sticking. While your grill is heating up, run a cloth dipped in olive oil over your grates. This will help prevent your salmon from sticking to the surface. Keep the cloth between your hand and the grates to avoid burning yourself. Spread a light amount of olive oil over your filet. Use a brush to coat your fish with a thin layer of olive oil. This will pack in moisture while your salmon is grilling. If your filet is large, cut it into smaller pieces before using any olive oil. Sprinkle herbs, spices, and citrus over your salmon. To add additional flavor, sprinkle your fish with a small amount of salt, pepper, dill, garlic, parsley, and tarragon. For additional zest, squeeze half of your lemon or lime over the filet. Before grilling, make sure you cover both sides. To give your salmon more flavor, place it in a wet marinade an hour before cooking. Popular ingredients include lemon juice, sesame oil, honey, and hot sauce. Grill your salmon until one side is golden brown. Place the filet on a part of the grill where heat is evenly distributed, avoiding spots directly above large flames or burners. Depending on the size of your filet and the heat of the grill, each side could take between 4 and 8 minutes to cook. To give your salmon grill-marks, place it at a 45° angle to the grate. Use a wide spatula to flip the salmon over and cook the other side. Avoid tongs, which can force moisture out of the fish, and skewers, which can cause the fish to break apart. Move your salmon off the heat to finish cooking. To see if your salmon is close to done, press your spatula into the center of the fish. If it flakes and causes clear juice to run out, it is ready to be moved. Fish can dry out quickly, so taking your salmon off the grill will ensure that residual heat does not overcook or burn it. Poaching Skinless Salmon Fill a pot with cold water, lemon, onion, celery, salt, and herbs. Fill a pot with 1 US-quart (950 ml) (1 L) of cold water. Either squeeze your lemon into the water or cut it into thin slices to insert. Place your onions, celery, and bay leaf into the pot. Sprinkle thyme, dill, and salt on top to taste. For more flavor, try adding peppercorns, other vegetables like carrots, or cooking liquids like chicken stock and white wine. Add your salmon filet and heat to a medium temperature. To avoid overcooking your fish, keep your pot well below boiling, aiming for a temperature around 170° F (76° C). If your water does not fully cover the salmon, add just enough to do so. Do not preheat your pot. Starting cold will help your salmon retain moisture and avoid overheating. Cook your salmon until it is opaque and flakes easily. Let your salmon simmer until it can be easily pulled apart by a fork and is no longer transparent on the inside. Depending on the exact heat, this could take between 20 and 30 minutes. Poached salmon will not change colors as drastically as grilled or baked salmon, so pay extra attention to the opacity and toughness. Season with salt, pepper, and herbs. Sprinkle your salmon with a small amount of salt, pepper, thyme, and dill. Poached salmon has a naturally clean, light flavor, so avoid excessive seasoning. Squeeze lemon over the top to add a zesty kick.",
  "tyn_model":[
    "salmon",
    "olive oil",
    "grill",
    "pot",
    "herbs",
    "dill",
    "lemon",
    "salt",
    "salt, pepper",
    "oven",
    "baking dish",
    "spices",
    "citrus",
    "garlic",
    "parsley",
    "tarragon",
    "fork",
    "cloth",
    "spatula",
    "cold water",
    "celery",
    "water",
    "thyme",
    "pepper",
    "citrus fruit",
    "nonstick cooking spray",
    "aluminum foil",
    "non-stick baking sheets",
    "cooking spray",
    "charcoal grill",
    "lemon juice",
    "sesame oil",
    "honey",
    "hot sauce",
    "tongs",
    "skewers",
    "onion",
    "onions",
    "bay leaf",
    "carrots",
    "chicken stock",
    "white wine"
  ],
  "tyn_section":[

  ]
}