{
  "title":"How to Decorate Cards",
  "url":"https://www.wikihow.com/Decorate-Cards",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Homemade Cards"
  ],
  "methods":[
    {
      "name":"Using Pens, Pencils and Crayons",
      "steps":[
        {
          "headline":"Write the text yourself.",
          "description":"The easiest way to spruce up a card is by writing your own words. Whether it's an addition to a printed message or not, a nice, personal note will take a card from kind to touching. Some ways to make the text more visual include:\nWriting in large, fancy handwriting or a distinct, fun style. Writing in a specific shape or pattern, such as a heart or tree. Using small drawings to represent simple ideas, such as a laughing face instead of the word “laugh.”"
        },
        {
          "headline":"Draw a picture on the card.",
          "description":"Pictures are a sweet, creative way to bring life to otherwise simple cards. Use pens, colored pencils, or crayons to draw something that has meaning to you and the person receiving the card. Make sure to leave a little space between the picture and the original card text, that way it can still be read. Some simple drawings include things from nature, like trees, flowers, or the sun, and animals, like dogs, cats, or fish. If you don't want to draw a full picture, try simply shading the card to add extra color."
        },
        {
          "headline":"Draw borders around the card.",
          "description":"To make a drab card more exciting, draw a border around it. These can be simple, single-line borders or complex, museum-quality masterpieces. Try using a color or design that compliments the rest of the card, like using red and green for a Christmas card or drawing paw prints around a card about animals. For a simple border, try writing a message around the edge of the card."
        },
        {
          "headline":"Add to the current design.",
          "description":"For cards that are already illustrated, try adding your own simple touches to make it more personal. For elegant designs, add extra flourishes or references to the card recipient's favorite things. For sillier designs, draw mustaches on top of the images or add inside jokes that have meaning to you and the person you're sending the card to."
        }
      ]
    },
    {
      "name":"Adhering Items to the Card",
      "steps":[
        {
          "headline":"Add stickers to the card.",
          "description":"An easy way to add flair is through stickers. You can find simple stickers, including ones based on popular movies and TV shows, in dollar stores, general markets, and craft books. To greet someone during religious festivals like Diwali, Christmas, or Hanukkah, you can add holiday-specific stickers. For more unique stickers, including bubble and object stickers, try specialty craft stores like Hobby Lobby. In addition to the card itself, stickers are an easy way to decorate envelopes without causing any shipping issues."
        },
        {
          "headline":"Add glitter, jewels, and other fun objects to the card.",
          "description":"Bedazzling isn't just for clothing, it can make cards shine too! Use small dabs of glue to add fake jewels, beads, and other craft supplies to the page. For extra creativity, try adding unexpected items like board game pieces. After, use glitter glue to add even more color and sparkle to the card."
        },
        {
          "headline":"Add items with personal meaning.",
          "description":"For very special occasions, add items to the card that have deep, personal significance. For a spouse or significant other, use items that have special romantic meaning, like a type of flower that was given on your first date. For friends, use items that tie to a specific memory or shared activity, like a guitar pick if you're in a band together."
        },
        {
          "headline":"Add photos to the card.",
          "description":"Photographs can give your card a more personal flare, especially those taken during special occasions. To add one, grab photos developed at a store or print some out from your computer. Cut them to fit your card's size and design, then paste them using a small amount of glue around the edges and center. For cards to your significant other, try a romantic photo cut into a heart shape. For cards to your best friend, try a series of small, square photos arranged like a photo-booth strip. For cards to your parents, try photos comparing them as a baby to you as a baby."
        },
        {
          "headline":"Add cutouts from magazines.",
          "description":"Magazine and newspaper collages are a staple of the art world, and they can be just as fun and creative in card form. Grab a magazine or newspaper that has meaning to the person receiving the card. Cut out interesting words and images, then use a small amount of glue to stick them to the card. Instead of writing on the card, try making a word collage using cool and creative fonts from the magazine. Try making a collage of the person's favorite things, whether that be high fashion from Vogue, new technology from Popular Mechanics, or movie stars from Entertainment Weekly."
        }
      ]
    },
    {
      "name":"Getting Creative",
      "steps":[
        {
          "headline":"Add ribbon or thread to the card.",
          "description":"To make your card a bit more festive, add string or ribbon. You can do this by taping or gluing the ends down, tying the ribbon or thread around the card, or by punching a small hole in the card to run the string or ribbon through. String will make a card feel more whimsical and handmade while ribbon will make it feel classy and elegant."
        },
        {
          "headline":"Add flowers to the card.",
          "description":"Flowers or flower petals can take your card to the next level. To make something happy or festive, glue a flat sunflower onto one of the pages. To make something romantic, put scented rose petals into the card so that, when opened, they will fall out and leave a nice scent. Use fake flowers instead of real ones, that way they will preserve over time."
        },
        {
          "headline":"Add a game to the card.",
          "description":"For puzzle-minded people, try adding a small game to the card. A puzzle or word game will give the card a unique flair and, if the recipient is inspired to complete it, will help your message stick out among others. Just make sure the game is fair before putting it in the card! For word games, try adding a riddle or simple crossword puzzle. If you're going to give the card in person, try adding a game you can finish together like tic-tac-toe or hangman."
        },
        {
          "headline":"Make a pop-up card.",
          "description":"Cut out a small strip of paper made from similar material to your card. Glue the ends to the inside of the card, one on each page, and fold the card multiple times to make sure it creases properly and pops up. Then, glue a small photo or drawing to the area where the paper creases. A handmade pop-up graphic can add a nice surprise to a card."
        },
        {
          "headline":"Use computer programs to make a card insert.",
          "description":"If you're more digitally minded, try using computer software to make an insert for your card. General programs like Word can make simple handouts, while specialty programs like Photoshop can make more advanced images. For something simple, try adding a digital border to a photo you want to use. For something complex, try putting the card recipient's face on an image of their favorite celebrity or character."
        }
      ]
    }
  ],
  "text":" Using Pens, Pencils and Crayons Write the text yourself. The easiest way to spruce up a card is by writing your own words. Whether it's an addition to a printed message or not, a nice, personal note will take a card from kind to touching. Some ways to make the text more visual include:\nWriting in large, fancy handwriting or a distinct, fun style. Writing in a specific shape or pattern, such as a heart or tree. Using small drawings to represent simple ideas, such as a laughing face instead of the word “laugh.” Draw a picture on the card. Pictures are a sweet, creative way to bring life to otherwise simple cards. Use pens, colored pencils, or crayons to draw something that has meaning to you and the person receiving the card. Make sure to leave a little space between the picture and the original card text, that way it can still be read. Some simple drawings include things from nature, like trees, flowers, or the sun, and animals, like dogs, cats, or fish. If you don't want to draw a full picture, try simply shading the card to add extra color. Draw borders around the card. To make a drab card more exciting, draw a border around it. These can be simple, single-line borders or complex, museum-quality masterpieces. Try using a color or design that compliments the rest of the card, like using red and green for a Christmas card or drawing paw prints around a card about animals. For a simple border, try writing a message around the edge of the card. Add to the current design. For cards that are already illustrated, try adding your own simple touches to make it more personal. For elegant designs, add extra flourishes or references to the card recipient's favorite things. For sillier designs, draw mustaches on top of the images or add inside jokes that have meaning to you and the person you're sending the card to. Adhering Items to the Card Add stickers to the card. An easy way to add flair is through stickers. You can find simple stickers, including ones based on popular movies and TV shows, in dollar stores, general markets, and craft books. To greet someone during religious festivals like Diwali, Christmas, or Hanukkah, you can add holiday-specific stickers. For more unique stickers, including bubble and object stickers, try specialty craft stores like Hobby Lobby. In addition to the card itself, stickers are an easy way to decorate envelopes without causing any shipping issues. Add glitter, jewels, and other fun objects to the card. Bedazzling isn't just for clothing, it can make cards shine too! Use small dabs of glue to add fake jewels, beads, and other craft supplies to the page. For extra creativity, try adding unexpected items like board game pieces. After, use glitter glue to add even more color and sparkle to the card. Add items with personal meaning. For very special occasions, add items to the card that have deep, personal significance. For a spouse or significant other, use items that have special romantic meaning, like a type of flower that was given on your first date. For friends, use items that tie to a specific memory or shared activity, like a guitar pick if you're in a band together. Add photos to the card. Photographs can give your card a more personal flare, especially those taken during special occasions. To add one, grab photos developed at a store or print some out from your computer. Cut them to fit your card's size and design, then paste them using a small amount of glue around the edges and center. For cards to your significant other, try a romantic photo cut into a heart shape. For cards to your best friend, try a series of small, square photos arranged like a photo-booth strip. For cards to your parents, try photos comparing them as a baby to you as a baby. Add cutouts from magazines. Magazine and newspaper collages are a staple of the art world, and they can be just as fun and creative in card form. Grab a magazine or newspaper that has meaning to the person receiving the card. Cut out interesting words and images, then use a small amount of glue to stick them to the card. Instead of writing on the card, try making a word collage using cool and creative fonts from the magazine. Try making a collage of the person's favorite things, whether that be high fashion from Vogue, new technology from Popular Mechanics, or movie stars from Entertainment Weekly. Getting Creative Add ribbon or thread to the card. To make your card a bit more festive, add string or ribbon. You can do this by taping or gluing the ends down, tying the ribbon or thread around the card, or by punching a small hole in the card to run the string or ribbon through. String will make a card feel more whimsical and handmade while ribbon will make it feel classy and elegant. Add flowers to the card. Flowers or flower petals can take your card to the next level. To make something happy or festive, glue a flat sunflower onto one of the pages. To make something romantic, put scented rose petals into the card so that, when opened, they will fall out and leave a nice scent. Use fake flowers instead of real ones, that way they will preserve over time. Add a game to the card. For puzzle-minded people, try adding a small game to the card. A puzzle or word game will give the card a unique flair and, if the recipient is inspired to complete it, will help your message stick out among others. Just make sure the game is fair before putting it in the card! For word games, try adding a riddle or simple crossword puzzle. If you're going to give the card in person, try adding a game you can finish together like tic-tac-toe or hangman. Make a pop-up card. Cut out a small strip of paper made from similar material to your card. Glue the ends to the inside of the card, one on each page, and fold the card multiple times to make sure it creases properly and pops up. Then, glue a small photo or drawing to the area where the paper creases. A handmade pop-up graphic can add a nice surprise to a card. Use computer programs to make a card insert. If you're more digitally minded, try using computer software to make an insert for your card. General programs like Word can make simple handouts, while specialty programs like Photoshop can make more advanced images. For something simple, try adding a digital border to a photo you want to use. For something complex, try putting the card recipient's face on an image of their favorite celebrity or character.",
  "tyn_model":[
    "stickers",
    "ribbon",
    "glue",
    "cards",
    "flowers",
    "pens",
    "crayons",
    "card",
    "thread",
    "string",
    "paper",
    "using",
    "pencils",
    "“laugh",
    "” draw",
    "pictures",
    "colored pencils",
    "glitter",
    "jewels",
    "beads",
    "glitter glue",
    "photos",
    "photo-booth strip",
    "magazine",
    "newspaper",
    "sunflower",
    "computer software",
    "photoshop"
  ],
  "tyn_section":[

  ]
}