{
  "title":"How to Dry Sage",
  "url":"https://www.wikihow.com/Dry-Sage",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices",
    "Preserving Herbs"
  ],
  "methods":[
    {
      "name":"Preparing Your Leaves for Drying",
      "steps":[
        {
          "headline":"Pull the leaves from the stalk.",
          "description":"Since sage has a thick leaf, it dries well off of the stalk. Gently pull off each leaf and place it on a clean towel. You could also use sharp scissors to cut the leaves from the stalk, but this is more time consuming."
        },
        {
          "headline":"Discard any damaged, soiled, or imperfect leaves.",
          "description":"Check each leaf to make sure it's healthy. Otherwise, your sage may not taste right, spoiling any dish you season with it."
        },
        {
          "headline":"Inspect the leaves for insects.",
          "description":"Insects are common on herbs, including sage. Look over each leaf to make sure there are no obvious signs of insects, such as bugs crawling, webbing, or little white specs that could be eggs. You can remove insects, but it's best to discard any leaves that have webbing or possible eggs."
        },
        {
          "headline":"Rinse the leaves in cool water, shaking off any excess.",
          "description":"Hold the sage under running water for a few seconds either in your hand or in a colander. Since sage leaves are larger, using a colander is an easy way to rinse the herbs. After the rinse, gently shake the sage and then place them on a clean, dry towel."
        },
        {
          "headline":"Dry the sage with a clean towel.",
          "description":"Gently blot away the remaining dampness by pressing a 2nd clean towel over the herbs. Place the prepared herbs on a dry towel."
        }
      ]
    },
    {
      "name":"Hanging Your Sage",
      "steps":[
        {
          "headline":"Gather the leaves into a small bundle.",
          "description":"Pick up the leaves individually, holding them by their ends. Add no more than 8 leaves to a bundle to ensure that they are able to get adequate air circulation for drying."
        },
        {
          "headline":"Tie the bundles with string, twine, or a rubber band.",
          "description":"Wrap the tie around the base of the stems to secure the bundle. Leave extra string for hanging or tie a new piece of string around the end of the bundle so that you can hang the sage. If you use a rubber band, it will tighten as the sage dries. This will prevent you from losing leaves."
        },
        {
          "headline":"Cover your sage bundles with a paper bag with holes punched into it.",
          "description":"The bag will protect your herbs from dust, while the holes still allow for airflow around the leaves. Place the bag over the bundles, with the bottom open. You can wrap them in muslin instead of a paper bag. However, do not use plastic, as it will cause mold. Some people choose not to cover the herbs because they like the look of drying herbs, but you will need to watch for dust."
        },
        {
          "headline":"Hang the sage in a well-ventilated area away from direct sunlight.",
          "description":"The bundles should hang upside down from a string. Make sure that the place you choose gets good air circulation, such as an area near a fireplace or in a dry area of the kitchen. It's best to dry the sage indoors for better flavor and color. You can also air dry the sage on a paper towel. Lay out each leaf individually and change the paper towels daily. Avoid moist areas of your home like the sink, stove, or dishwasher."
        },
        {
          "headline":"Turn the sprigs every day or 2 for even drying.",
          "description":"Unhook the string holding the bundles and turn the sage around. Even if you think the sage is getting the same air circulation around the bundle, the sides of the sage bundles could dry at different rates. It's possible that one side will get better air or more light, causing it to dry faster."
        },
        {
          "headline":"Watch for mold if you live in a humid area.",
          "description":"Herbs can quickly mold if left to dry in a moist area. You can still air dry herbs in humid areas, but carefully monitor the sage for mold. If you see any black spots or white patches, take the bundles down immediately. If you live in a very humid area, it may be better to choose a different drying method, such as a food dehydrator."
        },
        {
          "headline":"Let them dry for 7 to 10 days.",
          "description":"Check your sage daily to evaluate the progress. Give your leaves the time they need to dry, as taking them down early could ruin them."
        },
        {
          "headline":"Test the leaves to see if they're dry.",
          "description":"Check the leaves to see if they are dry and crispy. Pick up a leaf and see if it easily crumbles between your fingers. If it does, then the sage is dry."
        },
        {
          "headline":"Treat air-dried sage for insects and insect eggs.",
          "description":"It's possible to miss insects or their eggs during inspection, so you should always treat sage after air drying it. You can treat it in either the oven or the freezer. If you use the oven, heat it at 160 degrees Fahrenheit (71 degrees Celsius) for 30 minutes. Make sure that you do not go over this time because you may damage the herbs. If you use the freezer, freeze it for 48 hours. You do not need to treat the sage if you use a heat method to dry it."
        }
      ]
    },
    {
      "name":"Drying Sage in a Food Dehydrator",
      "steps":[
        {
          "headline":"Set your dehydrator on a low temperature.",
          "description":"The ideal temperature for drying sage is between 95 and 110 degrees Fahrenheit (35 and 46 degrees Celsius). Lower temperatures take longer to dry the sage, but they limit the risk that you will accidentally cook the sage, which will ruin them. If you live in an area with high humidity, you may need to set the temperature at 125 degrees Fahrenheit (52 degrees Celsius)."
        },
        {
          "headline":"Spread out the leaves on a tray in a single layer.",
          "description":"Make sure that the leaves do not touch each other or overlap, as this could prevent them from drying properly. You may have to dry the sage in batches if you have a lot."
        },
        {
          "headline":"Dry the sage alone so that the flavors will not get mixed.",
          "description":"It's tempting to dry several herbs together or to dry the herbs with fruit, but this could cause the flavors to mix. Stick to one item at a time in the dehydrator."
        },
        {
          "headline":"Check the leaves every 30 minutes to see if they're dry.",
          "description":"Depending on your dehydrator, your sage may take 1 to 4 hours to dry. Read the instructions that came with your dehydrator to see if it recommends a time."
        },
        {
          "headline":"Determine if the sage is dry.",
          "description":"Look for crispy, dry edges on the leaves. If they look dry, pick up a leaf and see if it easily crumbles between your fingers. When it does, then the sage is dry."
        }
      ]
    },
    {
      "name":"Drying the Sage Leaves in an Oven",
      "steps":[
        {
          "headline":"Lay the sage in a single layer on a cookie sheet.",
          "description":"It's best to wrap the cookie sheet in muslin or parchment paper before you put the sage on it. Make sure that the leaves do not touch each other or overlap, as this can make them dry unevenly. If only part of the leaf dries, then the sage could be ruined."
        },
        {
          "headline":"Set your oven on the lowest temperature.",
          "description":"Choose the lowest temperature on your oven because oven drying can quickly destroy the flavor, color, and oils in the sage. You should dry the leaves as slowly as possible to prevent damage. The highest temperature you should use is 180 degrees Fahrenheit (82 degrees Celsius)."
        },
        {
          "headline":"Prop open the oven door if you have an electric oven.",
          "description":"This allows the air to circulate, which the herbs need to dry. It also keeps the temperature from rising too high inside the oven. If you have a gas oven, don't prop open the oven because it's dangerous to let the gas fill the kitchen. Instead, open the oven every 5 minutes to allow the air to circulate."
        },
        {
          "headline":"Turn the sage leaves after 30 minutes.",
          "description":"Pull the cookie sheet from the oven and set it on a heatproof surface. Wear oven mitts and use tongs or a fork to flip the sage. Then return the tray to the oven."
        },
        {
          "headline":"Allow the sage to dry for 1 hour.",
          "description":"Set a timer and check the sage every 15 minutes to make sure that it is not drying too quickly. If you suspect that the sage is dry before you reach the 1 hour mark, pull it early. It's easy to over-dry the herb."
        },
        {
          "headline":"Test the sage for dryness.",
          "description":"The leaves should be dry and crispy. Rub a leaf between your fingers to see if it crumbles easily."
        }
      ]
    },
    {
      "name":"Storing Your Sage",
      "steps":[
        {
          "headline":"Crumble the sage by rolling it between your fingers.",
          "description":"If you're using sage for seasoning, it's best to crumble it. Rub each leaf separately, continuing until all of the sage is ready for storage. If you are using the sage to form a sage bundle, keep the leaves whole."
        },
        {
          "headline":"Transfer the dried sage to an airtight container.",
          "description":"You could use a jar, tupperware container, or ziplock bag. Make sure that the seal doesn't have any leaks, as moisture from the air could ruin the batch."
        },
        {
          "headline":"Place the container in a cool, dry area.",
          "description":"You can store the sage in a pantry, cabinet, or in the refrigerator. If you use a clear jar, place it in the dark to preserve the color of your sage."
        }
      ]
    }
  ],
  "text":" Preparing Your Leaves for Drying Pull the leaves from the stalk. Since sage has a thick leaf, it dries well off of the stalk. Gently pull off each leaf and place it on a clean towel. You could also use sharp scissors to cut the leaves from the stalk, but this is more time consuming. Discard any damaged, soiled, or imperfect leaves. Check each leaf to make sure it's healthy. Otherwise, your sage may not taste right, spoiling any dish you season with it. Inspect the leaves for insects. Insects are common on herbs, including sage. Look over each leaf to make sure there are no obvious signs of insects, such as bugs crawling, webbing, or little white specs that could be eggs. You can remove insects, but it's best to discard any leaves that have webbing or possible eggs. Rinse the leaves in cool water, shaking off any excess. Hold the sage under running water for a few seconds either in your hand or in a colander. Since sage leaves are larger, using a colander is an easy way to rinse the herbs. After the rinse, gently shake the sage and then place them on a clean, dry towel. Dry the sage with a clean towel. Gently blot away the remaining dampness by pressing a 2nd clean towel over the herbs. Place the prepared herbs on a dry towel. Hanging Your Sage Gather the leaves into a small bundle. Pick up the leaves individually, holding them by their ends. Add no more than 8 leaves to a bundle to ensure that they are able to get adequate air circulation for drying. Tie the bundles with string, twine, or a rubber band. Wrap the tie around the base of the stems to secure the bundle. Leave extra string for hanging or tie a new piece of string around the end of the bundle so that you can hang the sage. If you use a rubber band, it will tighten as the sage dries. This will prevent you from losing leaves. Cover your sage bundles with a paper bag with holes punched into it. The bag will protect your herbs from dust, while the holes still allow for airflow around the leaves. Place the bag over the bundles, with the bottom open. You can wrap them in muslin instead of a paper bag. However, do not use plastic, as it will cause mold. Some people choose not to cover the herbs because they like the look of drying herbs, but you will need to watch for dust. Hang the sage in a well-ventilated area away from direct sunlight. The bundles should hang upside down from a string. Make sure that the place you choose gets good air circulation, such as an area near a fireplace or in a dry area of the kitchen. It's best to dry the sage indoors for better flavor and color. You can also air dry the sage on a paper towel. Lay out each leaf individually and change the paper towels daily. Avoid moist areas of your home like the sink, stove, or dishwasher. Turn the sprigs every day or 2 for even drying. Unhook the string holding the bundles and turn the sage around. Even if you think the sage is getting the same air circulation around the bundle, the sides of the sage bundles could dry at different rates. It's possible that one side will get better air or more light, causing it to dry faster. Watch for mold if you live in a humid area. Herbs can quickly mold if left to dry in a moist area. You can still air dry herbs in humid areas, but carefully monitor the sage for mold. If you see any black spots or white patches, take the bundles down immediately. If you live in a very humid area, it may be better to choose a different drying method, such as a food dehydrator. Let them dry for 7 to 10 days. Check your sage daily to evaluate the progress. Give your leaves the time they need to dry, as taking them down early could ruin them. Test the leaves to see if they're dry. Check the leaves to see if they are dry and crispy. Pick up a leaf and see if it easily crumbles between your fingers. If it does, then the sage is dry. Treat air-dried sage for insects and insect eggs. It's possible to miss insects or their eggs during inspection, so you should always treat sage after air drying it. You can treat it in either the oven or the freezer. If you use the oven, heat it at 160 degrees Fahrenheit (71 degrees Celsius) for 30 minutes. Make sure that you do not go over this time because you may damage the herbs. If you use the freezer, freeze it for 48 hours. You do not need to treat the sage if you use a heat method to dry it. Drying Sage in a Food Dehydrator Set your dehydrator on a low temperature. The ideal temperature for drying sage is between 95 and 110 degrees Fahrenheit (35 and 46 degrees Celsius). Lower temperatures take longer to dry the sage, but they limit the risk that you will accidentally cook the sage, which will ruin them. If you live in an area with high humidity, you may need to set the temperature at 125 degrees Fahrenheit (52 degrees Celsius). Spread out the leaves on a tray in a single layer. Make sure that the leaves do not touch each other or overlap, as this could prevent them from drying properly. You may have to dry the sage in batches if you have a lot. Dry the sage alone so that the flavors will not get mixed. It's tempting to dry several herbs together or to dry the herbs with fruit, but this could cause the flavors to mix. Stick to one item at a time in the dehydrator. Check the leaves every 30 minutes to see if they're dry. Depending on your dehydrator, your sage may take 1 to 4 hours to dry. Read the instructions that came with your dehydrator to see if it recommends a time. Determine if the sage is dry. Look for crispy, dry edges on the leaves. If they look dry, pick up a leaf and see if it easily crumbles between your fingers. When it does, then the sage is dry. Drying the Sage Leaves in an Oven Lay the sage in a single layer on a cookie sheet. It's best to wrap the cookie sheet in muslin or parchment paper before you put the sage on it. Make sure that the leaves do not touch each other or overlap, as this can make them dry unevenly. If only part of the leaf dries, then the sage could be ruined. Set your oven on the lowest temperature. Choose the lowest temperature on your oven because oven drying can quickly destroy the flavor, color, and oils in the sage. You should dry the leaves as slowly as possible to prevent damage. The highest temperature you should use is 180 degrees Fahrenheit (82 degrees Celsius). Prop open the oven door if you have an electric oven. This allows the air to circulate, which the herbs need to dry. It also keeps the temperature from rising too high inside the oven. If you have a gas oven, don't prop open the oven because it's dangerous to let the gas fill the kitchen. Instead, open the oven every 5 minutes to allow the air to circulate. Turn the sage leaves after 30 minutes. Pull the cookie sheet from the oven and set it on a heatproof surface. Wear oven mitts and use tongs or a fork to flip the sage. Then return the tray to the oven. Allow the sage to dry for 1 hour. Set a timer and check the sage every 15 minutes to make sure that it is not drying too quickly. If you suspect that the sage is dry before you reach the 1 hour mark, pull it early. It's easy to over-dry the herb. Test the sage for dryness. The leaves should be dry and crispy. Rub a leaf between your fingers to see if it crumbles easily. Storing Your Sage Crumble the sage by rolling it between your fingers. If you're using sage for seasoning, it's best to crumble it. Rub each leaf separately, continuing until all of the sage is ready for storage. If you are using the sage to form a sage bundle, keep the leaves whole. Transfer the dried sage to an airtight container. You could use a jar, tupperware container, or ziplock bag. Make sure that the seal doesn't have any leaks, as moisture from the air could ruin the batch. Place the container in a cool, dry area. You can store the sage in a pantry, cabinet, or in the refrigerator. If you use a clear jar, place it in the dark to preserve the color of your sage.",
  "tyn_model":[
    "sage",
    "oven",
    "herbs",
    "dehydrator",
    "water",
    "colander",
    "rubber band",
    "muslin",
    "food dehydrator",
    "freezer",
    "tray",
    "cookie sheet",
    "jar",
    "towel",
    "scissors",
    "string",
    "twine",
    "paper towel",
    "paper towels",
    "air-dried sage",
    "fruit",
    "parchment paper",
    "oven mitts",
    "fork",
    "airtight container",
    "tupperware container",
    "ziplock bag",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}