{
  "title":"How to Make Gluten Free Orange and Almond Cake",
  "url":"https://www.wikihow.com/Make-Gluten-Free-Orange-and-Almond-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes",
    "Gluten Free Dishes"
  ],
  "parts":[
    {
      "name":"Making the Cake",
      "steps":[
        {
          "headline":"Boil the oranges whole for at least two hours in a pan of water to cover the fruit, changing the water at least once.",
          "description":"This is best done the night before during cooking dinner, then letting them drain and chill in the refrigerator overnight."
        },
        {
          "headline":"Quarter the cold oranges and remove the seeds and the core pith.",
          "description":"Leave the skin and zest of the orange intact."
        },
        {
          "headline":"Puree the oranges - skin and all - in a food processor until smooth, or push them through a sieve.",
          "description":""
        },
        {
          "headline":"Gather the rest of your ingredients.",
          "description":"Preheat the oven to 180°C / 356°F and line your cake pan or fluted muffin pans."
        },
        {
          "headline":"Using a beater, whip the eggs and sugar until thick and pale in color and the sugar dissolves.",
          "description":"This takes about four minutes."
        },
        {
          "headline":"Add the almond meal, baking powder and orange.",
          "description":"Fold through until combined using a large spoon."
        },
        {
          "headline":"Transfer to your pan and bake for an hour.",
          "description":"Use a skewer test to ensure it is cooked (the skewer when inserted should come out clean). The muffin pans may need 20-25 minutes."
        },
        {
          "headline":"Allow to cool and then serve.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Syrup",
      "steps":[
        {
          "headline":"Heat the lemon juice, water, sugar, cinnamon, spice cloves, vanilla in a small pan.",
          "description":""
        },
        {
          "headline":"Simmer for five minutes.",
          "description":"Serve a small amount per muffin or slice and garnish with pistachios."
        }
      ]
    }
  ],
  "text":" Making the Cake Boil the oranges whole for at least two hours in a pan of water to cover the fruit, changing the water at least once. This is best done the night before during cooking dinner, then letting them drain and chill in the refrigerator overnight. Quarter the cold oranges and remove the seeds and the core pith. Leave the skin and zest of the orange intact. Puree the oranges - skin and all - in a food processor until smooth, or push them through a sieve.  Gather the rest of your ingredients. Preheat the oven to 180°C / 356°F and line your cake pan or fluted muffin pans. Using a beater, whip the eggs and sugar until thick and pale in color and the sugar dissolves. This takes about four minutes. Add the almond meal, baking powder and orange. Fold through until combined using a large spoon. Transfer to your pan and bake for an hour. Use a skewer test to ensure it is cooked (the skewer when inserted should come out clean). The muffin pans may need 20-25 minutes. Allow to cool and then serve.  Finished.  Making the Syrup Heat the lemon juice, water, sugar, cinnamon, spice cloves, vanilla in a small pan.  Simmer for five minutes. Serve a small amount per muffin or slice and garnish with pistachios.",
  "tyn_model":[
    "oranges",
    "water",
    "sugar",
    "orange",
    "food processor",
    "sieve",
    "oven",
    "cake pan",
    "fluted muffin pans",
    "eggs",
    "almond meal",
    "baking powder",
    "large spoon",
    "muffin pans",
    "lemon",
    "cinnamon",
    "spice cloves",
    "vanilla",
    "small pan",
    "pistachios"
  ],
  "tyn_section":[

  ]
}