{
  "title":"How to Pick Dragon Fruit",
  "url":"https://www.wikihow.com/Pick-Dragon-Fruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "parts":[
    {
      "name":"Checking for Ripeness",
      "steps":[
        {
          "headline":"Expect the fruit to ripen about a month after it flowers.",
          "description":"Generally, dragon fruit will ripen about a month after it flowers. Check the dragon fruit daily for any flowers and use the flowers as a gauge for ripeness."
        },
        {
          "headline":"Check for a saturated fuchsia color to determine ripeness.",
          "description":"Watch for the color of the fruit to change from green to fuchsia or yellow, depending on the variety. The color will slowly change and deepen as the fruit ripens. However, the leaves, or “wings,” on the sides of the fruit will remain green on the tips even when the fruit is ripe."
        },
        {
          "headline":"Watch for the “wings” to wither.",
          "description":"Once the leaves on the sides of the fruit, or the “wings,” droop and wither, the fruit is likely ripe. Check the wings regularly to see if they’ve begun to brown or dry out. If they’re still healthy and colorful, then the fruit is not ripe yet."
        },
        {
          "headline":"Press lightly on the skin of the fruit.",
          "description":"Ripe dragon fruit should feel soft and have a bit of give, like a ripe mango or avocado. If the skin still feels firm and doesn’t yield to light pressure, then the fruit isn’t ripe yet. On the other hand, if the fruit feels mushy when you squeeze it, it is likely overripe."
        },
        {
          "headline":"Don’t wait for the fruit to fall off the plant.",
          "description":"Because dragon fruit does not automatically fall off the plant when it’s ripe, you’ll need to check it periodically to make sure it hasn’t over-ripened."
        }
      ]
    },
    {
      "name":"Picking the Fruit",
      "steps":[
        {
          "headline":"Use a brush to remove any thorns from yellow dragon fruit varieties.",
          "description":"The thorns grow in small clusters on the tip of each segment of the yellow dragon fruit. While the fruit is still connected to the stalk, use a thick-bristled brush to gently brush away the thorns. Use shears to clip away any thorns that you can’t reach with the brush. Thorns only grow on the more rare yellow dragon fruit, so you don’t have to worry about thorns when picking the more popular red or purple varieties."
        },
        {
          "headline":"Twist the fruit off of the stalk with your hands.",
          "description":"Grasp one dragon fruit and use your hand to twist it around 1 or 2 times. Then, pull at the fruit until it fully detaches from the plant’s stalk. If the fruit doesn’t come off the stalk easily, it hasn’t ripened enough yet. Leave the fruit attached to the stalk and let it ripen for a little longer. To speed up the picking process, you can also use a knife or a pair of garden shears to cut through the stalk at the top of the fruit. If you use a knife, cut as close to the fruit as possible so you don’t leave an extra stump of cactus stalk at the top. If the fruit doesn’t come away easily, it likely isn’t ripe enough yet. Leave the fruit attached to the stalk and let it ripen for a little longer."
        },
        {
          "headline":"Break off the dried flowers at the bottom.",
          "description":"Dragon fruit will often have long flowers extending from the bottom of the fruit that dry and wither before the fruit ripens. You can simply tear the flowers off by hand or cut them away at the base. Since they should be brittle and dried out at this point, the flowers should come off easily."
        },
        {
          "headline":"Rinse and cut it into quarters when you’re ready to eat it.",
          "description":"Rinse the dragon fruit in clean water to get rid of any dirt or debris. Use a non-serrated knife to cut the fruit in half, then into quarters. From there, you can eat it or cube it into smaller pieces. The inside of a fresh dragon fruit should be an opaque white with black seeds. If the fruit looks translucent or brown, it’s gone bad. After cutting the dragon fruit open, you can store it in a plastic ziploc bag for up to 3-4 days."
        },
        {
          "headline":"Store uncut dragon fruit in the refrigerator for up to 3 days.",
          "description":"It’s best to eat the fruit as soon as possible, but the fruit will stay fresh for a few days if you keep it in the refrigerator. Store the fruit in a crisper drawer for best results."
        }
      ]
    }
  ],
  "text":" Checking for Ripeness Expect the fruit to ripen about a month after it flowers. Generally, dragon fruit will ripen about a month after it flowers. Check the dragon fruit daily for any flowers and use the flowers as a gauge for ripeness. Check for a saturated fuchsia color to determine ripeness. Watch for the color of the fruit to change from green to fuchsia or yellow, depending on the variety. The color will slowly change and deepen as the fruit ripens. However, the leaves, or “wings,” on the sides of the fruit will remain green on the tips even when the fruit is ripe. Watch for the “wings” to wither. Once the leaves on the sides of the fruit, or the “wings,” droop and wither, the fruit is likely ripe. Check the wings regularly to see if they’ve begun to brown or dry out. If they’re still healthy and colorful, then the fruit is not ripe yet. Press lightly on the skin of the fruit. Ripe dragon fruit should feel soft and have a bit of give, like a ripe mango or avocado. If the skin still feels firm and doesn’t yield to light pressure, then the fruit isn’t ripe yet. On the other hand, if the fruit feels mushy when you squeeze it, it is likely overripe. Don’t wait for the fruit to fall off the plant. Because dragon fruit does not automatically fall off the plant when it’s ripe, you’ll need to check it periodically to make sure it hasn’t over-ripened. Picking the Fruit Use a brush to remove any thorns from yellow dragon fruit varieties. The thorns grow in small clusters on the tip of each segment of the yellow dragon fruit. While the fruit is still connected to the stalk, use a thick-bristled brush to gently brush away the thorns. Use shears to clip away any thorns that you can’t reach with the brush. Thorns only grow on the more rare yellow dragon fruit, so you don’t have to worry about thorns when picking the more popular red or purple varieties. Twist the fruit off of the stalk with your hands. Grasp one dragon fruit and use your hand to twist it around 1 or 2 times. Then, pull at the fruit until it fully detaches from the plant’s stalk. If the fruit doesn’t come off the stalk easily, it hasn’t ripened enough yet. Leave the fruit attached to the stalk and let it ripen for a little longer. To speed up the picking process, you can also use a knife or a pair of garden shears to cut through the stalk at the top of the fruit. If you use a knife, cut as close to the fruit as possible so you don’t leave an extra stump of cactus stalk at the top. If the fruit doesn’t come away easily, it likely isn’t ripe enough yet. Leave the fruit attached to the stalk and let it ripen for a little longer. Break off the dried flowers at the bottom. Dragon fruit will often have long flowers extending from the bottom of the fruit that dry and wither before the fruit ripens. You can simply tear the flowers off by hand or cut them away at the base. Since they should be brittle and dried out at this point, the flowers should come off easily. Rinse and cut it into quarters when you’re ready to eat it. Rinse the dragon fruit in clean water to get rid of any dirt or debris. Use a non-serrated knife to cut the fruit in half, then into quarters. From there, you can eat it or cube it into smaller pieces. The inside of a fresh dragon fruit should be an opaque white with black seeds. If the fruit looks translucent or brown, it’s gone bad. After cutting the dragon fruit open, you can store it in a plastic ziploc bag for up to 3-4 days. Store uncut dragon fruit in the refrigerator for up to 3 days. It’s best to eat the fruit as soon as possible, but the fruit will stay fresh for a few days if you keep it in the refrigerator. Store the fruit in a crisper drawer for best results.",
  "tyn_model":[
    "dragon fruit",
    "“wings",
    "brush",
    "knife",
    "flowers",
    "” on",
    "” to",
    "” droop",
    "avocado",
    "shears",
    "garden shears",
    "cactus stalk",
    "water",
    "ziploc bag",
    "crisper drawer"
  ],
  "tyn_section":[

  ]
}