{
  "title":"How to Hire an Independent Contractor",
  "url":"https://www.wikihow.com/Hire-an-Independent-Contractor",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance"
  ],
  "methods":[
    {
      "name":"Entering into a Legal Contract",
      "steps":[
        {
          "headline":"Search online for forms or templates.",
          "description":"When you draft a contract to hire an independent contractor, you don't have to start from scratch. Government agencies, law firms, and other legal services have free forms available that you can copy and adapt to your needs. A template designed for independent contractors in the same industry will be easier for you to adapt. For example, if you're hiring a freelance writer to produce content for your website, you don't necessarily want to use an agreement template designed for construction contractors. Ideally, you should find an agreement that is designed to be used in the state where you live (or where the work will be performed) and drafted or reviewed by an attorney."
        },
        {
          "headline":"Identify the parties to the agreement.",
          "description":"Your agreement should include the legal names of both yourself and your independent contractor. If the independent contractor has an LLC or corporation, use the legal name of the business rather than the contractor's individual name. In contracts, it's common to spell the legal names out once initially and refer to the parties by generic titles throughout the rest of the contract. For example, you might refer to yourself as \"client\" and the independent contractor as \"contractor.\""
        },
        {
          "headline":"Include a specific period of time.",
          "description":"Generally, when you hire an independent contractor you only need their services for a short period of time. The contract should state specifically when the contractual relationship begins and when it will end. Even if you intend the contract to end when the work is completed, you still want a contractual deadline by which the work must be completed. If you intend the relationship to be longer term, check your state's law or consult an employment attorney to find out if there are any limitations in your state regarding the length of contracts."
        },
        {
          "headline":"Describe the work to be performed.",
          "description":"Your contract should include a section that sets out specifically what the contractor will be doing for you, including what they will be responsible for and how their performance will be evaluated. If the contractor is required to use any of their own tools or resources, include this information in your description of the job. Include any information about how the completed work will be submitted or delivered to you, if necessary."
        },
        {
          "headline":"Provide payment terms.",
          "description":"One section of your agreement should state specifically how much the contractor is being paid for their services, as well as when and how you're making payment. Include any conditions you want to place on final payment. For example, if you're hiring a contractor to remodel your kitchen, you may make your final payment to the contractor contingent on the work passing inspection. Include the method of payment. If you're paying through a third-party service that charges fees, your contract should state whether you or the contractor is responsible for paying those fees."
        },
        {
          "headline":"Define the person as an independent contractor.",
          "description":"All independent contractor agreements include legal language stating that the person is an independent contractor and not your employee. It may include a brief description of the responsibilities the contractor has as a result of this relationship. In some cases, it may be enough simply to include a statement that says \"In providing services under this agreement, the parties agree that Contractor is an independent contractor and not an employee of Client.\" Some states may require specific language to create an independent contractor relationship. Make sure any form or template you use is designed to be legally valid in your state."
        },
        {
          "headline":"Get the contract signed before work starts.",
          "description":"Signing the contract before the independent contractor starts work for you ensures that the contract will legally govern the work performed. If the contractor starts work before signing the contract, they could later argue that they agreed to something different. Both you and the contractor should sign the contract. After all signatures are in place, make copies of the signed contract for the contractor and your own records."
        }
      ]
    },
    {
      "name":"Taking Care of Tax Matters",
      "steps":[
        {
          "headline":"Use Form SS-8 to get a formal determination from the IRS.",
          "description":"If you have any questions regarding whether the person you've hired will be classified as an independent contractor or an employee, the IRS will make a determination for you. Simply calling the person an independent contractor may not be enough. The IRS evaluates facts in 3 general categories – behavioral control, financial control, and type of relationship – to determine whether someone is an independent contractor. Either you or the contractor can file Form SS-8 at any time. You set out facts about the relationship on the form, then the IRS evaluates those facts and decides whether the person is an independent contractor or employee. If you intend to file Form SS-8, do so as soon as possible. It can take as long as 6 months for the IRS to evaluate the form and make a determination."
        },
        {
          "headline":"Have the contractor fill out Form W-9.",
          "description":"Form W-9 is used to get the independent contractor's full legal name and tax identification number. The contractor's tax identification number may be their Social Security number or an employer identification number (EIN). When the contractor gives their W-9 back to you, keep it in your files for at least 4 years. You may need to show it to the IRS if any questions arise with your taxes."
        },
        {
          "headline":"File Form 1099-MISC if you pay the contractor more than $600.",
          "description":"When you pay an independent contractor, you must submit an informational return to the IRS stating how much you paid them. Actually paying taxes on that income is the contractor's responsibility. You may also complete a Form 1099 and send it to the employee, although you aren't required to do so."
        },
        {
          "headline":"File any required reports with your state.",
          "description":"Particularly if you are a small business, you may be required to file informational reports with your state's labor and tax departments if you hire independent contractors. To find out what reports are required, check with your state's tax office or your state's employment agency. States may have different rules than the IRS regarding whether a worker is classified as an independent contractor or an employee for tax or other purposes. Find out at your state's labor department, or talk to a local employment attorney."
        },
        {
          "headline":"Check your state's law regarding workers' compensation coverage.",
          "description":"In some states, you must pay for workers' compensation coverage for independent contractors. To find out for sure, contact your state's department of labor. You typically can use the department's website to find out if you're required to pay workers' compensation. There may be a list of factors to consider, or a tool you can use to quickly assess whether you need to pay for workers' compensation coverage."
        }
      ]
    },
    {
      "name":"Choosing an Independent Contractor to Hire",
      "steps":[
        {
          "headline":"Identify what you need from your independent contractor.",
          "description":"Before you start looking for an independent contractor, take some time to figure out exactly what skills they'll need to complete the work you have for them. Hiring an independent contractor can be different from hiring a contractor for a construction job or other labor position. Your methods for evaluating their skills and experience will be different as well. For example, if you want someone to write content for your business's website, you could ask for a writing sample to evaluate. If you also want them to design your content pages, on the other hand, you might look for web design education or certifications."
        },
        {
          "headline":"Ask friends or colleagues for referrals.",
          "description":"If someone you know and trust has recently hired an independent contractor for similar reasons, ask who they used. A referral can save you a lot of time and money checking someone's background. Find out what kind of work the independent contractor generally does, and how much your friend or colleague paid them. Ask specifically if your friend or colleague has any reservations in recommending the independent contractor, or if they had any issues. An issue that wasn't a problem for them may be a deal-breaker for you."
        },
        {
          "headline":"Do a thorough background check.",
          "description":"Even if an independent contractor has been recommended to you, check reviews of the contractor and find out all you can about their reputation in the industry. Search online to find their website. If they have a portfolio of recent projects, it can give you an idea whether they would work well for you. If they have any licenses or certifications, check with the agency that issued the license or certification and make sure it's valid and in good standing. There are a number of websites, such as Upwork and Guru, where you can advertise work for independent contractors and freelancers. Typically independent contractors then bid on your project and you can select the one you want to use."
        },
        {
          "headline":"Interview at least 3 independent contractors.",
          "description":"Talking to several people not only helps you find the best qualified independent contractor to handle your project, it also allows you to get the work done at the right price. Have an amount in mind that you are willing to pay for the work, and allow contractors to submit bids on the project. Ask questions about their past experience and subject matter expertise. Find out whether they've completed projects similar to yours. Get the names of previous clients with projects similar to yours who you can contact about the contractor."
        },
        {
          "headline":"Discuss the project in detail.",
          "description":"Your independent contractor should have a good idea up front of exactly what work you want them to complete, what aspects of the work they'll be responsible for, and how long the job is expected to last. Particularly if they are working for other clients, get a good idea of how many hours a day (or week) they can devote to your project. If you need them to be available during specific hours, let them know. Be clear about your expectations for the project and your goals for completion. If they will be required to bring their own tools or resources to complete the project, let them know this up front."
        }
      ]
    }
  ],
  "text":" Entering into a Legal Contract Search online for forms or templates. When you draft a contract to hire an independent contractor, you don't have to start from scratch. Government agencies, law firms, and other legal services have free forms available that you can copy and adapt to your needs. A template designed for independent contractors in the same industry will be easier for you to adapt. For example, if you're hiring a freelance writer to produce content for your website, you don't necessarily want to use an agreement template designed for construction contractors. Ideally, you should find an agreement that is designed to be used in the state where you live (or where the work will be performed) and drafted or reviewed by an attorney. Identify the parties to the agreement. Your agreement should include the legal names of both yourself and your independent contractor. If the independent contractor has an LLC or corporation, use the legal name of the business rather than the contractor's individual name. In contracts, it's common to spell the legal names out once initially and refer to the parties by generic titles throughout the rest of the contract. For example, you might refer to yourself as \"client\" and the independent contractor as \"contractor.\" Include a specific period of time. Generally, when you hire an independent contractor you only need their services for a short period of time. The contract should state specifically when the contractual relationship begins and when it will end. Even if you intend the contract to end when the work is completed, you still want a contractual deadline by which the work must be completed. If you intend the relationship to be longer term, check your state's law or consult an employment attorney to find out if there are any limitations in your state regarding the length of contracts. Describe the work to be performed. Your contract should include a section that sets out specifically what the contractor will be doing for you, including what they will be responsible for and how their performance will be evaluated. If the contractor is required to use any of their own tools or resources, include this information in your description of the job. Include any information about how the completed work will be submitted or delivered to you, if necessary. Provide payment terms. One section of your agreement should state specifically how much the contractor is being paid for their services, as well as when and how you're making payment. Include any conditions you want to place on final payment. For example, if you're hiring a contractor to remodel your kitchen, you may make your final payment to the contractor contingent on the work passing inspection. Include the method of payment. If you're paying through a third-party service that charges fees, your contract should state whether you or the contractor is responsible for paying those fees. Define the person as an independent contractor. All independent contractor agreements include legal language stating that the person is an independent contractor and not your employee. It may include a brief description of the responsibilities the contractor has as a result of this relationship. In some cases, it may be enough simply to include a statement that says \"In providing services under this agreement, the parties agree that Contractor is an independent contractor and not an employee of Client.\" Some states may require specific language to create an independent contractor relationship. Make sure any form or template you use is designed to be legally valid in your state. Get the contract signed before work starts. Signing the contract before the independent contractor starts work for you ensures that the contract will legally govern the work performed. If the contractor starts work before signing the contract, they could later argue that they agreed to something different. Both you and the contractor should sign the contract. After all signatures are in place, make copies of the signed contract for the contractor and your own records. Taking Care of Tax Matters Use Form SS-8 to get a formal determination from the IRS. If you have any questions regarding whether the person you've hired will be classified as an independent contractor or an employee, the IRS will make a determination for you. Simply calling the person an independent contractor may not be enough. The IRS evaluates facts in 3 general categories – behavioral control, financial control, and type of relationship – to determine whether someone is an independent contractor. Either you or the contractor can file Form SS-8 at any time. You set out facts about the relationship on the form, then the IRS evaluates those facts and decides whether the person is an independent contractor or employee. If you intend to file Form SS-8, do so as soon as possible. It can take as long as 6 months for the IRS to evaluate the form and make a determination. Have the contractor fill out Form W-9. Form W-9 is used to get the independent contractor's full legal name and tax identification number. The contractor's tax identification number may be their Social Security number or an employer identification number (EIN). When the contractor gives their W-9 back to you, keep it in your files for at least 4 years. You may need to show it to the IRS if any questions arise with your taxes. File Form 1099-MISC if you pay the contractor more than $600. When you pay an independent contractor, you must submit an informational return to the IRS stating how much you paid them. Actually paying taxes on that income is the contractor's responsibility. You may also complete a Form 1099 and send it to the employee, although you aren't required to do so. File any required reports with your state. Particularly if you are a small business, you may be required to file informational reports with your state's labor and tax departments if you hire independent contractors. To find out what reports are required, check with your state's tax office or your state's employment agency. States may have different rules than the IRS regarding whether a worker is classified as an independent contractor or an employee for tax or other purposes. Find out at your state's labor department, or talk to a local employment attorney. Check your state's law regarding workers' compensation coverage. In some states, you must pay for workers' compensation coverage for independent contractors. To find out for sure, contact your state's department of labor. You typically can use the department's website to find out if you're required to pay workers' compensation. There may be a list of factors to consider, or a tool you can use to quickly assess whether you need to pay for workers' compensation coverage. Choosing an Independent Contractor to Hire Identify what you need from your independent contractor. Before you start looking for an independent contractor, take some time to figure out exactly what skills they'll need to complete the work you have for them. Hiring an independent contractor can be different from hiring a contractor for a construction job or other labor position. Your methods for evaluating their skills and experience will be different as well. For example, if you want someone to write content for your business's website, you could ask for a writing sample to evaluate. If you also want them to design your content pages, on the other hand, you might look for web design education or certifications. Ask friends or colleagues for referrals. If someone you know and trust has recently hired an independent contractor for similar reasons, ask who they used. A referral can save you a lot of time and money checking someone's background. Find out what kind of work the independent contractor generally does, and how much your friend or colleague paid them. Ask specifically if your friend or colleague has any reservations in recommending the independent contractor, or if they had any issues. An issue that wasn't a problem for them may be a deal-breaker for you. Do a thorough background check. Even if an independent contractor has been recommended to you, check reviews of the contractor and find out all you can about their reputation in the industry. Search online to find their website. If they have a portfolio of recent projects, it can give you an idea whether they would work well for you. If they have any licenses or certifications, check with the agency that issued the license or certification and make sure it's valid and in good standing. There are a number of websites, such as Upwork and Guru, where you can advertise work for independent contractors and freelancers. Typically independent contractors then bid on your project and you can select the one you want to use. Interview at least 3 independent contractors. Talking to several people not only helps you find the best qualified independent contractor to handle your project, it also allows you to get the work done at the right price. Have an amount in mind that you are willing to pay for the work, and allow contractors to submit bids on the project. Ask questions about their past experience and subject matter expertise. Find out whether they've completed projects similar to yours. Get the names of previous clients with projects similar to yours who you can contact about the contractor. Discuss the project in detail. Your independent contractor should have a good idea up front of exactly what work you want them to complete, what aspects of the work they'll be responsible for, and how long the job is expected to last. Particularly if they are working for other clients, get a good idea of how many hours a day (or week) they can devote to your project. If you need them to be available during specific hours, let them know. Be clear about your expectations for the project and your goals for completion. If they will be required to bring their own tools or resources to complete the project, let them know this up front.",
  "tyn_model":[
    "independent contractor",
    "contractor",
    "workers' compensation coverage",
    "irs",
    "employment attorney",
    "– behavioral",
    "– to",
    "social security number",
    "workers' compensation",
    "web design education",
    "guru",
    "independent contractors",
    "contractors"
  ],
  "tyn_section":[

  ]
}