{
  "title":"How to Make Almond Butter",
  "url":"https://www.wikihow.com/Make-Almond-Butter",
  "category_hierarchy":[
    "Food and Entertaining",
    "Nuts and Seeds"
  ],
  "methods":[
    {
      "name":"Making Your Butter",
      "steps":[
        {
          "headline":"Roast the almonds.",
          "description":"Preheat your oven to 250 degrees Fahrenheit (121 degrees Celsius). Arrange your nuts on a baking sheet. Cook them for 10 to 15 minutes. Roasting temperature and time may vary by oven. For your first time, start with the lower temperature of 250 degrees F (121 degrees C) to avoid burning the nuts. Once you have  a better sense of cooking time, use a higher temperature (350 degrees F or 177 degrees C) for a quicker roasting time (about 8 to 10 minutes. Pay attention to their coloring as they cook. Remove when they have toasted to a slight brown, before they can burn. This step is not strictly necessary, but heating the nuts’ natural oils will make blending them easier."
        },
        {
          "headline":"Transfer them to a food processor.",
          "description":"Alternately, use a food blender if that is all you have, but a food processor will blend the nuts more thoroughly without needing as much added oil. Slowly pour the almonds in while running the processor on pulse. Allow the processor to start chopping the nuts a little at a time rather than dumping the whole load in at once. Set aside some nuts to add later if you prefer a chunky butter."
        },
        {
          "headline":"Continue processing.",
          "description":"Run the processor for approximately 10 minutes, at which point the nuts’ released oils should begin to smooth the mixture. Turn the machine off as the blended nuts start to build up along the container’s sides. Remove the lid and use a spatula to push the mixture back down toward the blades. Replace the lid and resume blending until you need to push the mixture back down again. Repeat as needed. The amount of time may vary according to the strength of your food processor and the amount of nuts."
        },
        {
          "headline":"Blend until the butter is smooth.",
          "description":"After approximately 20 minutes of constant blending, expect the mixture to attain a creamier consistency. If clumpiness persists, add a teaspoon of olive oil to soften the mixture. Continue blending and adding oil until it reaches your desired consistency. Add salt as desired and continue blending to mix it in. Add extra roasted almonds and process briefly for chunky butter."
        },
        {
          "headline":"Store your butter.",
          "description":"Unplug the machine and detach the canister from the base. Use a serving spoon to transfer the bulk of the butter from the processor to an airtight container. Remove the S-blade and use your spoon or spatula to push any clinging butter into the container. Then rake up any butter clinging to the processor’s sides. Seal your container when finished and store it in the refrigerator. Refrigerated almond butter should last up to 3 weeks."
        }
      ]
    },
    {
      "name":"Using Alternative Ingredients",
      "steps":[
        {
          "headline":"Add honey-roasted peanuts.",
          "description":"Give your almond butter some extra flavor. Purchase some pre-roasted peanuts. Add ⅓ cup of these to every 2 cups of almonds during the blending process."
        },
        {
          "headline":"Substitute cashews for almonds.",
          "description":"For quicker roasting and blending, use this softer nut instead. Save money by purchasing them in raw chunks from the bulk section, since whole pieces may be more expensive than almonds. They also tend to be drier, so be sure to have oil on hand to blend them to your desired consistency. When roasting, start checking their coloring no later than 7 minutes into cooking. Cashews will begin to burn sooner than almonds would."
        },
        {
          "headline":"Use pecans for minimal effort.",
          "description":"Replace almonds with pecans for to create a butter in less time with less fuss. Skip the roasting process altogether, even with raw pecans. Simply blend until the mixture is even."
        }
      ]
    },
    {
      "name":"Serving and Baking",
      "steps":[
        {
          "headline":"Enjoy almond butter straight from the fridge.",
          "description":"Make a plain almond butter sandwich, or add jam like a traditional PB-&-J. Scoop almond butter up with apple slices. Smear it over crackers, biscuits, toast, or pancakes."
        },
        {
          "headline":"Add almond butter to smoothies.",
          "description":"Give your smoothie extra protein and a nutty taste. Experiment by adding some to your favorite recipe. Or, try blending 1 tablespoon with the following ingredients:\n2 cups fresh spinach\n1 cup almond milk (vanilla, original, or unsweetened, according to your taste)\nHalf of a ripe banana\n¼ cup pineapple chunks"
        },
        {
          "headline":"Bake cookies with almond butter.",
          "description":"First, preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius). While the oven heats, create your cookie dough:\nCombine the following in a mixing bowl: ½ cup dairy butter, ½ cup shortening, 6 ounces almond butter, and 1 ⅓ cup sugar. Break one egg and beat the contents into the mixture. In a separate bowl, mix 2 cups of all-purpose flour with 1 teaspoon of baking soda. Slowly pour the flour/soda mixture into the first bowl, stirring as you go. Roll the dough into balls roughly a quarter of an inch in size and then arrange these on an ungreased baking sheet, with at least two inches between each ball. Bake for 8 to 10 minutes and then transfer them to a cooling rack."
        },
        {
          "headline":"Make an almond butter cake.",
          "description":"Preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius). Then use greased parchment paper to line an 8” x 8” baking pan. Then create your batter:\nFirst, mix the following in a bowl: 5 tablespoons almond flour, 5 tablespoons buckwheat flour, 2 tablespoons arrowroot flour, ½ teaspoon baking soda, ½ teaspoon baking powder, ½ teaspoon kosher salt, and ¼ teaspoon ground nutmeg. In another, larger bowl, combine these ingredients: ½ cup melted coconut oil, ¾ cup almond butter, ¾ honey, and 1 teaspoon vanilla extract. Next, beat one egg into the wet ingredients. Slowly pour the dry ingredients into the wet batter, stirring as you go. Pour the finished batter into the pan and bake for 30 to 40 minutes."
        }
      ]
    }
  ],
  "text":" Making Your Butter Roast the almonds. Preheat your oven to 250 degrees Fahrenheit (121 degrees Celsius). Arrange your nuts on a baking sheet. Cook them for 10 to 15 minutes. Roasting temperature and time may vary by oven. For your first time, start with the lower temperature of 250 degrees F (121 degrees C) to avoid burning the nuts. Once you have  a better sense of cooking time, use a higher temperature (350 degrees F or 177 degrees C) for a quicker roasting time (about 8 to 10 minutes. Pay attention to their coloring as they cook. Remove when they have toasted to a slight brown, before they can burn. This step is not strictly necessary, but heating the nuts’ natural oils will make blending them easier. Transfer them to a food processor. Alternately, use a food blender if that is all you have, but a food processor will blend the nuts more thoroughly without needing as much added oil. Slowly pour the almonds in while running the processor on pulse. Allow the processor to start chopping the nuts a little at a time rather than dumping the whole load in at once. Set aside some nuts to add later if you prefer a chunky butter. Continue processing. Run the processor for approximately 10 minutes, at which point the nuts’ released oils should begin to smooth the mixture. Turn the machine off as the blended nuts start to build up along the container’s sides. Remove the lid and use a spatula to push the mixture back down toward the blades. Replace the lid and resume blending until you need to push the mixture back down again. Repeat as needed. The amount of time may vary according to the strength of your food processor and the amount of nuts. Blend until the butter is smooth. After approximately 20 minutes of constant blending, expect the mixture to attain a creamier consistency. If clumpiness persists, add a teaspoon of olive oil to soften the mixture. Continue blending and adding oil until it reaches your desired consistency. Add salt as desired and continue blending to mix it in. Add extra roasted almonds and process briefly for chunky butter. Store your butter. Unplug the machine and detach the canister from the base. Use a serving spoon to transfer the bulk of the butter from the processor to an airtight container. Remove the S-blade and use your spoon or spatula to push any clinging butter into the container. Then rake up any butter clinging to the processor’s sides. Seal your container when finished and store it in the refrigerator. Refrigerated almond butter should last up to 3 weeks. Using Alternative Ingredients Add honey-roasted peanuts. Give your almond butter some extra flavor. Purchase some pre-roasted peanuts. Add ⅓ cup of these to every 2 cups of almonds during the blending process. Substitute cashews for almonds. For quicker roasting and blending, use this softer nut instead. Save money by purchasing them in raw chunks from the bulk section, since whole pieces may be more expensive than almonds. They also tend to be drier, so be sure to have oil on hand to blend them to your desired consistency. When roasting, start checking their coloring no later than 7 minutes into cooking. Cashews will begin to burn sooner than almonds would. Use pecans for minimal effort. Replace almonds with pecans for to create a butter in less time with less fuss. Skip the roasting process altogether, even with raw pecans. Simply blend until the mixture is even. Serving and Baking Enjoy almond butter straight from the fridge. Make a plain almond butter sandwich, or add jam like a traditional PB-&-J. Scoop almond butter up with apple slices. Smear it over crackers, biscuits, toast, or pancakes. Add almond butter to smoothies. Give your smoothie extra protein and a nutty taste. Experiment by adding some to your favorite recipe. Or, try blending 1 tablespoon with the following ingredients:\n2 cups fresh spinach\n1 cup almond milk (vanilla, original, or unsweetened, according to your taste)\nHalf of a ripe banana\n¼ cup pineapple chunks Bake cookies with almond butter. First, preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius). While the oven heats, create your cookie dough:\nCombine the following in a mixing bowl: ½ cup dairy butter, ½ cup shortening, 6 ounces almond butter, and 1 ⅓ cup sugar. Break one egg and beat the contents into the mixture. In a separate bowl, mix 2 cups of all-purpose flour with 1 teaspoon of baking soda. Slowly pour the flour/soda mixture into the first bowl, stirring as you go. Roll the dough into balls roughly a quarter of an inch in size and then arrange these on an ungreased baking sheet, with at least two inches between each ball. Bake for 8 to 10 minutes and then transfer them to a cooling rack. Make an almond butter cake. Preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius). Then use greased parchment paper to line an 8” x 8” baking pan. Then create your batter:\nFirst, mix the following in a bowl: 5 tablespoons almond flour, 5 tablespoons buckwheat flour, 2 tablespoons arrowroot flour, ½ teaspoon baking soda, ½ teaspoon baking powder, ½ teaspoon kosher salt, and ¼ teaspoon ground nutmeg. In another, larger bowl, combine these ingredients: ½ cup melted coconut oil, ¾ cup almond butter, ¾ honey, and 1 teaspoon vanilla extract. Next, beat one egg into the wet ingredients. Slowly pour the dry ingredients into the wet batter, stirring as you go. Pour the finished batter into the pan and bake for 30 to 40 minutes.",
  "tyn_model":[
    "butter",
    "almond butter",
    "almonds",
    "processor",
    "oven",
    "nuts",
    "food processor",
    "pecans",
    "baking sheet",
    "spatula",
    "oil",
    "peanuts",
    "cashews",
    "baking soda",
    "bowl",
    "’ natural",
    "food blender",
    "’ released",
    "machine",
    "olive oil",
    "salt",
    "serving spoon",
    "airtight container",
    "spoon",
    "refrigerator",
    "⅓ cup",
    "apple slices",
    "spinach",
    "almond milk",
    "banana",
    "pineapple",
    "cookie dough",
    "mixing bowl",
    "dairy butter",
    "shortening",
    "1 ⅓",
    "sugar",
    "all-purpose flour",
    "flour",
    "almond butter cake",
    "parchment paper",
    "” x",
    "” baking",
    "almond flour",
    "buckwheat flour",
    "arrowroot flour",
    "baking powder",
    "kosher salt",
    "nutmeg",
    "coconut oil",
    "honey",
    "vanilla extract"
  ],
  "tyn_section":[

  ]
}