{
  "title":"How to Lock a Discord Channel on a PC or Mac",
  "url":"https://www.wikihow.com/Lock-a-Discord-Channel-on-a-PC-or-Mac",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Open Discord on your PC or Mac.",
      "description":"You can do this in a web browser by signing in to https://discordapp.com. If you have the desktop app installed, you'll find it under All Apps in the Windows menu (Windows) or in the Applications folder (macOS). You must be a server administrator or have the proper permissions to lock a channel."
    },
    {
      "headline":"Click the server that hosts the channel.",
      "description":"Servers are listed along the left side of Discord."
    },
    {
      "headline":"Click the gear next to the channel you want to lock.",
      "description":"The gear will only appear when you hover the mouse over the channel's name in the list. A menu will appear."
    },
    {
      "headline":"Click Permissions.",
      "description":"It's the second option in the menu."
    },
    {
      "headline":"Click @everyone.",
      "description":"It's under the “Roles/Members” header at the top-center part of the screen. This displays the channel's permissions for everyone on the server."
    },
    {
      "headline":"Click the X next to every permission.",
      "description":"Each X will turn red, indicating that server members will not have permission to use the channel in that way."
    },
    {
      "headline":"Click Save Changes.",
      "description":"It's the green button at the bottom of the screen. The channel is now locked, meaning that nobody on the server can access it."
    }
  ],
  "text":" Open Discord on your PC or Mac. You can do this in a web browser by signing in to https://discordapp.com. If you have the desktop app installed, you'll find it under All Apps in the Windows menu (Windows) or in the Applications folder (macOS). You must be a server administrator or have the proper permissions to lock a channel. Click the server that hosts the channel. Servers are listed along the left side of Discord. Click the gear next to the channel you want to lock. The gear will only appear when you hover the mouse over the channel's name in the list. A menu will appear. Click Permissions. It's the second option in the menu. Click @everyone. It's under the “Roles/Members” header at the top-center part of the screen. This displays the channel's permissions for everyone on the server. Click the X next to every permission. Each X will turn red, indicating that server members will not have permission to use the channel in that way. Click Save Changes. It's the green button at the bottom of the screen. The channel is now locked, meaning that nobody on the server can access it.",
  "tyn_model":[
    "discord",
    "“roles",
    "” header"
  ],
  "tyn_section":[

  ]
}