{
  "title":"How to Wash Gore‐Tex",
  "url":"https://www.wikihow.com/Wash-Gore%E2%80%90Tex",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Fabric",
    "Cleaning Synthetic Fabric"
  ],
  "methods":[
    {
      "name":"Washing Gore Tex Outerwear",
      "steps":[
        {
          "headline":"Zip all zippers completely closed.",
          "description":"Gore Tex jackets and pants will have a variety of zippers on them. Make sure these are all zipped closed. You should also close any snaps and release any tension cords."
        },
        {
          "headline":"Set the water temperature to \"warm\" on your washing machine.",
          "description":"The water temperature should be around 105 °F (41 °C). Then set your washer’s cycle to permanent press – this is usually the standard setting on a washing machine."
        },
        {
          "headline":"Add a dime-sized amount of liquid detergent to the washing machine.",
          "description":"You won’t need to use as much detergent as you use for a regular load of laundry. Instead, measure out about a dime-sized amount of liquid detergent. Pour it into the washing machine."
        },
        {
          "headline":"Don’t use powder detergents when washing Gore Tex.",
          "description":"You also shouldn’t use bleach or detergent with fabric softeners. All of these things can ruin the water repellant on your Gore Tex."
        },
        {
          "headline":"Wash on a permanent press cycle.",
          "description":"Once you have the water and detergent in the washing machine, add your Gore Tex outerwear. Set your washer to a permanent press cycle - usually the standard setting on a washing machine. Then turn your washer on."
        },
        {
          "headline":"Dry your outerwear.",
          "description":"You can line dry your Gore Tex if you have a couple of hours. Or you can tumble dry your outerwear on a warm, gentle cycle. Don’t dry clean your outerwear, as this can ruin the water repellent."
        }
      ]
    },
    {
      "name":"Washing Gore Tex Footwear",
      "steps":[
        {
          "headline":"Remove the foot bed, if possible.",
          "description":"If you have sole inserts in your boots, remove them. Then brush them gently with a soft-bristled brush to remove any loose dirt. Set them aside until you’re finished cleaning your boots."
        },
        {
          "headline":"Shake out any gravel or dirt out of your shoes.",
          "description":"Once you have the foot bed out of your shoes, tip them upside down and shake them. Any dirt, gravel, or dust in your shoes should come out. You can also tap on the sole of your shoes to remove any stubborn dirt stuck inside."
        },
        {
          "headline":"Use a cloth dipped in lukewarm water to clean fabric.",
          "description":"For any fabric on your Gore Tex boots, you’ll want to use a soft cloth. Dip the cloth into lukewarm water and gently scrub the fabric of your boots."
        },
        {
          "headline":"Use a soft-bristled brush to clean leather.",
          "description":"If your Gore Tex shoes have leather toes or heels, you should use a soft-bristled brush to clean them. Dip the brush in lukewarm water and gently scrub the leather to remove any dirt."
        },
        {
          "headline":"Let your shoes air dry.",
          "description":"Leave your boots out and let them air dry overnight. You can also use a convection-style boot dryer. Follow the directions for the boot dryer if that’s what you decide to use."
        }
      ]
    },
    {
      "name":"Washing Gore Tex Gloves",
      "steps":[
        {
          "headline":"Fill a bowl with lukewarm water.",
          "description":"Don’t overfill the bowl, since you could spill water while washing the gloves. Use just enough water so the gloves are covered."
        },
        {
          "headline":"Add a mild detergent to the bowl.",
          "description":"Don’t use a detergent with bleach or fabric softener in it. A mild, clear detergent is best to protect the water repellency of your gloves. Squeeze a dime-sized amount of detergent into the bowl of water. Then mix the water and soap until small bubbles form."
        },
        {
          "headline":"Hand wash your gloves.",
          "description":"Put your gloves in the soapy water. Then, using your hands, gently rub the gloves until the dirt comes out of your gloves. Once they're washed, rinse the gloves under clear running water."
        },
        {
          "headline":"Squeeze the gloves to remove excess water.",
          "description":"Starting at the wrist of the gloves, squeeze the gloves, moving up to the fingers."
        },
        {
          "headline":"Air dry leather gloves.",
          "description":"Once you squeeze out the excess water, lay the gloves out so that wrist opening faces downward. Let the gloves air dry until they are completely dry, about 3 hours."
        },
        {
          "headline":"Tumble dry fabric gloves.",
          "description":"You can place fabric Gore Tex gloves in the dryer. Set the dryer to the lowest heat setting it has and set it for a 30-minute cycle."
        }
      ]
    },
    {
      "name":"Restoring Water Repellency",
      "steps":[
        {
          "headline":"Wash and dry your Gore Tex.",
          "description":"Wash your items according to the directions for the type of Gore Tex you have. Then make sure it’s fully dry, either by line drying it or using a dryer."
        },
        {
          "headline":"Dry your garment for another 20 minutes.",
          "description":"If you have a dryer available, put your garment back in the dryer for 20 minutes. This should reactivate the water repellency."
        },
        {
          "headline":"Iron your garment if you don’t have a dryer.",
          "description":"Set your iron to a warm – not hot – setting, without steam. Place a towel on top of the garment before you iron it. Run the iron over the towel. This will apply enough heat to reactive the water repellency, but the towel will protect your garment from damage."
        },
        {
          "headline":"Apply a new water-repellent treatment if necessary.",
          "description":"If the water repellency won’t reactivate, you might need to apply a new water-repellent treatment. Use any fabric water repellent that comes in a spray bottle. Spray your garments. Then put them back in the dryer for another 20 minutes."
        }
      ]
    }
  ],
  "text":" Washing Gore Tex Outerwear Zip all zippers completely closed. Gore Tex jackets and pants will have a variety of zippers on them. Make sure these are all zipped closed. You should also close any snaps and release any tension cords. Set the water temperature to \"warm\" on your washing machine. The water temperature should be around 105 °F (41 °C). Then set your washer’s cycle to permanent press – this is usually the standard setting on a washing machine. Add a dime-sized amount of liquid detergent to the washing machine. You won’t need to use as much detergent as you use for a regular load of laundry. Instead, measure out about a dime-sized amount of liquid detergent. Pour it into the washing machine. Don’t use powder detergents when washing Gore Tex. You also shouldn’t use bleach or detergent with fabric softeners. All of these things can ruin the water repellant on your Gore Tex. Wash on a permanent press cycle. Once you have the water and detergent in the washing machine, add your Gore Tex outerwear. Set your washer to a permanent press cycle - usually the standard setting on a washing machine. Then turn your washer on. Dry your outerwear. You can line dry your Gore Tex if you have a couple of hours. Or you can tumble dry your outerwear on a warm, gentle cycle. Don’t dry clean your outerwear, as this can ruin the water repellent. Washing Gore Tex Footwear Remove the foot bed, if possible. If you have sole inserts in your boots, remove them. Then brush them gently with a soft-bristled brush to remove any loose dirt. Set them aside until you’re finished cleaning your boots. Shake out any gravel or dirt out of your shoes. Once you have the foot bed out of your shoes, tip them upside down and shake them. Any dirt, gravel, or dust in your shoes should come out. You can also tap on the sole of your shoes to remove any stubborn dirt stuck inside. Use a cloth dipped in lukewarm water to clean fabric. For any fabric on your Gore Tex boots, you’ll want to use a soft cloth. Dip the cloth into lukewarm water and gently scrub the fabric of your boots. Use a soft-bristled brush to clean leather. If your Gore Tex shoes have leather toes or heels, you should use a soft-bristled brush to clean them. Dip the brush in lukewarm water and gently scrub the leather to remove any dirt. Let your shoes air dry. Leave your boots out and let them air dry overnight. You can also use a convection-style boot dryer. Follow the directions for the boot dryer if that’s what you decide to use. Washing Gore Tex Gloves Fill a bowl with lukewarm water. Don’t overfill the bowl, since you could spill water while washing the gloves. Use just enough water so the gloves are covered. Add a mild detergent to the bowl. Don’t use a detergent with bleach or fabric softener in it. A mild, clear detergent is best to protect the water repellency of your gloves. Squeeze a dime-sized amount of detergent into the bowl of water. Then mix the water and soap until small bubbles form. Hand wash your gloves. Put your gloves in the soapy water. Then, using your hands, gently rub the gloves until the dirt comes out of your gloves. Once they're washed, rinse the gloves under clear running water. Squeeze the gloves to remove excess water. Starting at the wrist of the gloves, squeeze the gloves, moving up to the fingers. Air dry leather gloves. Once you squeeze out the excess water, lay the gloves out so that wrist opening faces downward. Let the gloves air dry until they are completely dry, about 3 hours. Tumble dry fabric gloves. You can place fabric Gore Tex gloves in the dryer. Set the dryer to the lowest heat setting it has and set it for a 30-minute cycle. Restoring Water Repellency Wash and dry your Gore Tex. Wash your items according to the directions for the type of Gore Tex you have. Then make sure it’s fully dry, either by line drying it or using a dryer. Dry your garment for another 20 minutes. If you have a dryer available, put your garment back in the dryer for 20 minutes. This should reactivate the water repellency. Iron your garment if you don’t have a dryer. Set your iron to a warm – not hot – setting, without steam. Place a towel on top of the garment before you iron it. Run the iron over the towel. This will apply enough heat to reactive the water repellency, but the towel will protect your garment from damage. Apply a new water-repellent treatment if necessary. If the water repellency won’t reactivate, you might need to apply a new water-repellent treatment. Use any fabric water repellent that comes in a spray bottle. Spray your garments. Then put them back in the dryer for another 20 minutes.",
  "tyn_model":[
    "water",
    "gore tex",
    "dryer",
    "iron",
    "washing machine",
    "washer",
    "bowl",
    "liquid detergent",
    "detergent",
    "water repellent",
    "soft-bristled brush",
    "boot dryer",
    "gore tex gloves",
    "water repellency",
    "water-repellent treatment",
    "gore tex outerwear",
    "gore tex jackets",
    "– this",
    "fabric softeners.",
    "cloth",
    "gore tex boots",
    "gore tex shoes",
    "fabric softener",
    "soap",
    "– not",
    "– setting",
    "towel"
  ],
  "tyn_section":[

  ]
}