{
  "title":"How to Solve a Metal Puzzle",
  "url":"https://www.wikihow.com/Solve-a-Metal-Puzzle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Puzzles and Memory Games"
  ],
  "parts":[
    {
      "name":"Working Through a P-Shaped Puzzle",
      "steps":[
        {
          "headline":"Grab one end of each P-shaped ring with both of your hands.",
          "description":"Hold the puzzle as evenly as possible to prevent twisting the puzzle the wrong way while you work. Align the puzzle horizontally before you begin twisting it, with both ends of the P-shaped rings facing outwards. The two Ps should make something resembling a \"W\" shape before you begin twisting them."
        },
        {
          "headline":"Turn your left P-shaped ring down.",
          "description":"Then, loop the right ring around the upper \"P\" loop of the left ring. Your two P-shaped rings should look stacked on top of each other and mirroring each other at the loops. The rings should resemble a heart shape at this stage."
        },
        {
          "headline":"Pull the right ring from the top and through the left loop.",
          "description":"As you string the right ring through the left loop, it should slide off once you reach the bottom end. Once the two rings are separated, you have completed the puzzle. Set them down somewhere you won't forget to prevent losing them."
        },
        {
          "headline":"Slide one ring through the \"P\" loop of the other ring to reset the puzzle.",
          "description":"To prevent losing either ring and to put the puzzle together again, insert one ring through the top loop of the other ring. Pull the first ring all the way through the second ring, then turn the second ring up to secure both in place."
        }
      ]
    },
    {
      "name":"Beating a Horseshoe Ring Puzzle",
      "steps":[
        {
          "headline":"Hold the ring up evenly in front of you.",
          "description":"Align the ring as evenly and as tightly as you can. Avoid holding one end of the right higher or lower than the other to prevent the ring from twisting or tangling as you work on it."
        },
        {
          "headline":"Twist one horseshoe in a counterclockwise direction.",
          "description":"Keep the metal ring in-between the two rings. Continue twisting it until the ring is tight between the two rings and you cannot twist the horseshoe any further."
        },
        {
          "headline":"Bend and align the two horseshoes.",
          "description":"Push the two horseshoes together into the middle of the chain until it bends in half. Line up the horseshoes as evenly as possible, allowing the ring to fall to the bottom of the horseshoes."
        },
        {
          "headline":"Slide the ring up and off of the horseshoe.",
          "description":"Grab hold of the metal ring and lift it up through 1 side of the horseshoes. If the horseshoes are aligned, the ring should come off without forcing it. Check the horseshoe alignment if your ring appears stuck or you cannot locate an opening at the top of the horseshoes."
        },
        {
          "headline":"Re-align the horseshoes to put the puzzle back together.",
          "description":"When you're ready to put the puzzle together again, twist and bend the chain in half to align the horseshoes back together. Drop the ring through one end of the horseshoes, then fold the horseshoes back up and twist 1 horseshoe in the opposite direction to secure the ring."
        }
      ]
    },
    {
      "name":"Solving a Double M Puzzle",
      "steps":[
        {
          "headline":"Lift one double M ring above the other ring.",
          "description":"Both double M rings have a large curve around the top of the ring. Position your rings so that 1 ring is facing with their curve up and the other is facing downward in the opposite direction. Because the pieces are identical, they should look like a reflection of each other."
        },
        {
          "headline":"Turn the rings at a 90-degree angle.",
          "description":"Lift the bottom ring up through the top ring's side, then tilt them sideways at a 90-degree angle. The two ring curves should still be facing in opposite directions."
        },
        {
          "headline":"Slide the bottom piece up through the top piece's curve.",
          "description":"Keep the rings even and at the 90-degree angle to prevent twisting or complicating your puzzle. When you have reached the top, make the bottom ring aligned with the middle of the top ring's curve."
        },
        {
          "headline":"Lower the bottom ring through the middle of the top ring's \"M.\" Turn both rings upright again and slide the bottom ring down through the top ring's \"M.\" If you have aligned the rings correctly, it should go through the middle without twisting or catching.",
          "description":""
        },
        {
          "headline":"Insert one ring through the other ring's \"M\" to put the puzzle together again.",
          "description":"To attach the two rings together again, raise one ring through the middle of the other ring's \"M.\" Then, twist the rings at a 90-degree angle and slide it over the top curve and to the bottom of the ring. This will secure the rings together for storage."
        }
      ]
    }
  ],
  "text":" Working Through a P-Shaped Puzzle Grab one end of each P-shaped ring with both of your hands. Hold the puzzle as evenly as possible to prevent twisting the puzzle the wrong way while you work. Align the puzzle horizontally before you begin twisting it, with both ends of the P-shaped rings facing outwards. The two Ps should make something resembling a \"W\" shape before you begin twisting them. Turn your left P-shaped ring down. Then, loop the right ring around the upper \"P\" loop of the left ring. Your two P-shaped rings should look stacked on top of each other and mirroring each other at the loops. The rings should resemble a heart shape at this stage. Pull the right ring from the top and through the left loop. As you string the right ring through the left loop, it should slide off once you reach the bottom end. Once the two rings are separated, you have completed the puzzle. Set them down somewhere you won't forget to prevent losing them. Slide one ring through the \"P\" loop of the other ring to reset the puzzle. To prevent losing either ring and to put the puzzle together again, insert one ring through the top loop of the other ring. Pull the first ring all the way through the second ring, then turn the second ring up to secure both in place. Beating a Horseshoe Ring Puzzle Hold the ring up evenly in front of you. Align the ring as evenly and as tightly as you can. Avoid holding one end of the right higher or lower than the other to prevent the ring from twisting or tangling as you work on it. Twist one horseshoe in a counterclockwise direction. Keep the metal ring in-between the two rings. Continue twisting it until the ring is tight between the two rings and you cannot twist the horseshoe any further. Bend and align the two horseshoes. Push the two horseshoes together into the middle of the chain until it bends in half. Line up the horseshoes as evenly as possible, allowing the ring to fall to the bottom of the horseshoes. Slide the ring up and off of the horseshoe. Grab hold of the metal ring and lift it up through 1 side of the horseshoes. If the horseshoes are aligned, the ring should come off without forcing it. Check the horseshoe alignment if your ring appears stuck or you cannot locate an opening at the top of the horseshoes. Re-align the horseshoes to put the puzzle back together. When you're ready to put the puzzle together again, twist and bend the chain in half to align the horseshoes back together. Drop the ring through one end of the horseshoes, then fold the horseshoes back up and twist 1 horseshoe in the opposite direction to secure the ring. Solving a Double M Puzzle Lift one double M ring above the other ring. Both double M rings have a large curve around the top of the ring. Position your rings so that 1 ring is facing with their curve up and the other is facing downward in the opposite direction. Because the pieces are identical, they should look like a reflection of each other. Turn the rings at a 90-degree angle. Lift the bottom ring up through the top ring's side, then tilt them sideways at a 90-degree angle. The two ring curves should still be facing in opposite directions. Slide the bottom piece up through the top piece's curve. Keep the rings even and at the 90-degree angle to prevent twisting or complicating your puzzle. When you have reached the top, make the bottom ring aligned with the middle of the top ring's curve. Lower the bottom ring through the middle of the top ring's \"M.\" Turn both rings upright again and slide the bottom ring down through the top ring's \"M.\" If you have aligned the rings correctly, it should go through the middle without twisting or catching.  Insert one ring through the other ring's \"M\" to put the puzzle together again. To attach the two rings together again, raise one ring through the middle of the other ring's \"M.\" Then, twist the rings at a 90-degree angle and slide it over the top curve and to the bottom of the ring. This will secure the rings together for storage.",
  "tyn_model":[
    "rings",
    "puzzle",
    "metal ring",
    "horseshoe ring",
    "chain",
    "double m ring"
  ],
  "tyn_section":[

  ]
}