{
  "title":"How to Evolve a Quackberry into a Juicygoose in Viva Piñata",
  "url":"https://www.wikihow.com/Evolve-a-Quackberry-into-a-Juicygoose-in-Viva-Pi%C3%B1ata",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Viva Pinata"
  ],
  "steps":[
    {
      "headline":"Get a resident Quackberry in your garden.",
      "description":"You must be able to dig ponds with your shovel before you can get one. To make it appear you must dig up 3 pinometers of ground. To make it visit, have 4 pinometers of water and a corn plant in your garden. It should cross the boundary after you get rid of any predators that eat it, like the Pretztail, for example. Its residential requirements are that you have 4 pinometers of water in your garden and eats a piece of bread."
    },
    {
      "headline":"Get the gooseberry.",
      "description":"One can be bought at Costalot's store or grown from a bush."
    },
    {
      "headline":"Direct the Quackberry to the gooseberry.",
      "description":"It will eat the gooseberry."
    },
    {
      "headline":"Your Quackberry will be engulfed in a white light and suddenly transform into a Juicygoose piñata!",
      "description":""
    }
  ],
  "text":" Get a resident Quackberry in your garden. You must be able to dig ponds with your shovel before you can get one. To make it appear you must dig up 3 pinometers of ground. To make it visit, have 4 pinometers of water and a corn plant in your garden. It should cross the boundary after you get rid of any predators that eat it, like the Pretztail, for example. Its residential requirements are that you have 4 pinometers of water in your garden and eats a piece of bread. Get the gooseberry. One can be bought at Costalot's store or grown from a bush. Direct the Quackberry to the gooseberry. It will eat the gooseberry. Your Quackberry will be engulfed in a white light and suddenly transform into a Juicygoose piñata! ",
  "tyn_model":[
    "water",
    "gooseberry",
    "shovel",
    "bread",
    "quackberry",
    "juicygoose piñata"
  ],
  "tyn_section":[

  ]
}