{
  "title":"How to Fill Raised Garden Beds",
  "url":"https://www.wikihow.com/Fill-Raised-Garden-Beds",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Projects"
  ],
  "methods":[
    {
      "name":"Mixing Soil and Compost",
      "steps":[
        {
          "headline":"Calculate how much soil you will need.",
          "description":"Measure the dimensions of your garden bed using a tape measure. You will need the length, width, and depth of the bed. Place those measurements into an online soil volume calculator. Find one of these by searching on the Internet. You can try this one: https://www.gardeners.com/how-to/soil-calculator/7558.html\nKeep in mind that you’ll be mixing the soil with compost. So the number you get from the calculator will be the volume you should have after you’ve combined compost with your soil."
        },
        {
          "headline":"Gather native soil from your yard if possible.",
          "description":"The best soil to use is the soil that is native to your area. If you have soil to spare in your yard, simply gather the amount that you need in a bucket or wheelbarrow and move it over to your raised garden bed."
        },
        {
          "headline":"Purchase nutrient-rich mixtures if you can’t use native soil.",
          "description":"If you don’t have easy access to soil, you can purchase some topsoil or a faux soil mixture from a gardening supply store. If you’re mixing purchased soil with soil from your yard, make sure they both have a similar consistency. Inconsistent soil can cause problems for water drainage."
        },
        {
          "headline":"Make your own compost or purchase some.",
          "description":"You can make your own compost by decomposing organic material in a compost bin. If you have enough from your personal compost pile, simply use what you have. If you don’t compost or need to supplement your supply, purchase compost from a gardening supply store. Read the bag or ask the store assistant to find out what materials went into the compost. The best compost will be made primarily from plant matter, food scraps, and manure."
        },
        {
          "headline":"Mix soil and compost using at a 1:1 ratio.",
          "description":"Your goal should be have to an even mixture of compost and soil. Measure the soil and compost before pouring them into the bed to be precise, or simply gauge the amounts by eye. Don’t worry about being completely exact. Once you’ve poured both soil and compost into the bed, mix them thoroughly using either your hands or a gardening tool, like a till. Wear gloves if you’re mixing with your hands."
        },
        {
          "headline":"Remove any rocks from the mixture.",
          "description":"Simply pull out rocks whenever you see them and place them somewhere else in your yard. Too many large rocks can make it difficult for plants to grow."
        },
        {
          "headline":"Fill your garden bed to the top or nearly the top.",
          "description":"How high you fill the bed depends on personal preference and the plants you’ll be growing. If your plants will grow straight up, like tomatoes, keep the soil mixture flush with the top of the bed. If you’re mainly growing flowers, leave some space between the top of the soil and the top of the bed. This way the bloom of the flower will be more prominently displayed."
        }
      ]
    },
    {
      "name":"Trying Lasagna Gardening",
      "steps":[
        {
          "headline":"Gather organic compostable materials like grass clippings and leaves.",
          "description":"Lasagna gardening uses a bottom layer of compost and a top layer of soil. When making their layer of compost, many gardeners aim to have a mixture that is 2 parts shredded leaves and 1 part grass clippings. If you have a yard, use the leaves from your trees and the grass clippings that you gather from mowing your lawn. If you don’t have grass clippings and leaves on hand, ask someone at a local gardening store for alternatives."
        },
        {
          "headline":"Place a layer of cardboard or newspaper down.",
          "description":"This will break down slowly, gathering moisture and smothering weeds in the process. You'll need about 4 to 6 overlapping layers regardless of which choice you use. Make sure the layer of cardboard or newspaper spreads all the way to the edges of your raised bed plot."
        },
        {
          "headline":"Lay your compost on top of the newspaper or cardboard.",
          "description":"Spread your compostable materials evenly across the cardboard or newspaper layer. Fill the bed up halfway with this material. If you’re using a few different compostable materials, mix them together with your hands."
        },
        {
          "headline":"Find soil to layer on top of your compost.",
          "description":"Ideally, use native soil that’s in your yard. If you need an alternative, go to a local gardening store and purchase topsoil or a soil substitute."
        },
        {
          "headline":"Remove any rocks from the soil.",
          "description":"Work your hand through the soil and make sure there’s nothing in there that could obstruct the growth of your plants. If you find any rocks, simply move them somewhere else in your yard, or perhaps place them in a park or a beach later."
        },
        {
          "headline":"Fill the raised bed to the top or near the top.",
          "description":"Place the soil directly on top of the layer of cardboard or newspaper. If you’re planting something that grows straight, like tomatoes, feel free to make the soil flush with the top of the bed. If you’re planting flowers, leave some space between the top of the soil and the top of the bed. This ensures that the bloom of the flower appears more prominent than the stem."
        }
      ]
    }
  ],
  "text":" Mixing Soil and Compost Calculate how much soil you will need. Measure the dimensions of your garden bed using a tape measure. You will need the length, width, and depth of the bed. Place those measurements into an online soil volume calculator. Find one of these by searching on the Internet. You can try this one: https://www.gardeners.com/how-to/soil-calculator/7558.html\nKeep in mind that you’ll be mixing the soil with compost. So the number you get from the calculator will be the volume you should have after you’ve combined compost with your soil. Gather native soil from your yard if possible. The best soil to use is the soil that is native to your area. If you have soil to spare in your yard, simply gather the amount that you need in a bucket or wheelbarrow and move it over to your raised garden bed. Purchase nutrient-rich mixtures if you can’t use native soil. If you don’t have easy access to soil, you can purchase some topsoil or a faux soil mixture from a gardening supply store. If you’re mixing purchased soil with soil from your yard, make sure they both have a similar consistency. Inconsistent soil can cause problems for water drainage. Make your own compost or purchase some. You can make your own compost by decomposing organic material in a compost bin. If you have enough from your personal compost pile, simply use what you have. If you don’t compost or need to supplement your supply, purchase compost from a gardening supply store. Read the bag or ask the store assistant to find out what materials went into the compost. The best compost will be made primarily from plant matter, food scraps, and manure. Mix soil and compost using at a 1:1 ratio. Your goal should be have to an even mixture of compost and soil. Measure the soil and compost before pouring them into the bed to be precise, or simply gauge the amounts by eye. Don’t worry about being completely exact. Once you’ve poured both soil and compost into the bed, mix them thoroughly using either your hands or a gardening tool, like a till. Wear gloves if you’re mixing with your hands. Remove any rocks from the mixture. Simply pull out rocks whenever you see them and place them somewhere else in your yard. Too many large rocks can make it difficult for plants to grow. Fill your garden bed to the top or nearly the top. How high you fill the bed depends on personal preference and the plants you’ll be growing. If your plants will grow straight up, like tomatoes, keep the soil mixture flush with the top of the bed. If you’re mainly growing flowers, leave some space between the top of the soil and the top of the bed. This way the bloom of the flower will be more prominently displayed. Trying Lasagna Gardening Gather organic compostable materials like grass clippings and leaves. Lasagna gardening uses a bottom layer of compost and a top layer of soil. When making their layer of compost, many gardeners aim to have a mixture that is 2 parts shredded leaves and 1 part grass clippings. If you have a yard, use the leaves from your trees and the grass clippings that you gather from mowing your lawn. If you don’t have grass clippings and leaves on hand, ask someone at a local gardening store for alternatives. Place a layer of cardboard or newspaper down. This will break down slowly, gathering moisture and smothering weeds in the process. You'll need about 4 to 6 overlapping layers regardless of which choice you use. Make sure the layer of cardboard or newspaper spreads all the way to the edges of your raised bed plot. Lay your compost on top of the newspaper or cardboard. Spread your compostable materials evenly across the cardboard or newspaper layer. Fill the bed up halfway with this material. If you’re using a few different compostable materials, mix them together with your hands. Find soil to layer on top of your compost. Ideally, use native soil that’s in your yard. If you need an alternative, go to a local gardening store and purchase topsoil or a soil substitute. Remove any rocks from the soil. Work your hand through the soil and make sure there’s nothing in there that could obstruct the growth of your plants. If you find any rocks, simply move them somewhere else in your yard, or perhaps place them in a park or a beach later. Fill the raised bed to the top or near the top. Place the soil directly on top of the layer of cardboard or newspaper. If you’re planting something that grows straight, like tomatoes, feel free to make the soil flush with the top of the bed. If you’re planting flowers, leave some space between the top of the soil and the top of the bed. This ensures that the bloom of the flower appears more prominent than the stem.",
  "tyn_model":[
    "soil",
    "compost",
    "rocks",
    "cardboard",
    "newspaper",
    "garden bed",
    "topsoil",
    "tape measure",
    "soil volume calculator",
    "bucket",
    "native soil",
    "compost bin",
    "gardening supply store",
    "gardening tool",
    "till",
    "organic compostable materials",
    "soil substitute"
  ],
  "tyn_section":[

  ]
}