{
  "title":"How to Bake Red Velvet Whoopie Pies",
  "url":"https://www.wikihow.com/Bake-Red-Velvet-Whoopie-Pies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits"
  ],
  "parts":[
    {
      "name":"Making the Cookies",
      "steps":[
        {
          "headline":"Preheat the oven to 350°F (177°C) (Gas Mark 4).",
          "description":"Line two large baking sheets with parchment paper. You can also line the baking sheets with aluminum foil and spray the baking sheets with nonstick cooking spray. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/7e\\/Bake-Red-Velvet-Whoopie-Pies-Step-1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/7e\\/Bake-Red-Velvet-Whoopie-Pies-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":760,\"bigHeight\":508,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Whisk the flour, cocoa powder, baking soda, and salt together in a mixing bowl.",
          "description":""
        },
        {
          "headline":"Add butter to another mixing bowl  and beat for 1 minute on medium-high speed using an electric mixer.",
          "description":"The butter will look creamy."
        },
        {
          "headline":"Add the brown sugar to the butter and beat at high speed until fluffy.",
          "description":""
        },
        {
          "headline":"Add the egg to the butter mixture and beat in on high scraping the bowl as needed.",
          "description":""
        },
        {
          "headline":"Add the vanilla and buttermilk to the butter mixture.",
          "description":"Beat in the vanilla and buttermilk."
        },
        {
          "headline":"Add the dry ingredients to the butter mixture.",
          "description":"Beat mixture on low speed of the mixer. Mix cookie dough until just combined."
        },
        {
          "headline":"Add the gel food coloring to the cookie batter.",
          "description":"Add enough food coloring to make a nice, deep red hue. This should be about 1 teaspoon (5 grams) of red gel food coloring."
        },
        {
          "headline":"Spray a tablespoon with nonstick cooking spray.",
          "description":"Use a sturdy measuring spoon to measure out (228 to 314 grams) the batter or use a cookie scoop that measures out 1 to 1 1/2 tablespoons (228 to 314 grams). Drop cookie batter onto prepared the baking sheets."
        },
        {
          "headline":"Bake cookies for about 10 to 12 minutes or until centers are set.",
          "description":"Lightly press a cookie with your finger and if no indentation remains the cookie is set."
        },
        {
          "headline":"Allow cookies to cool about 5 minutes before removing to wire baking racks to cool.",
          "description":"Cool cookies completely before filling with cream cheese filling."
        }
      ]
    },
    {
      "name":"Making the Cream Cheese Filling",
      "steps":[
        {
          "headline":"Beat cream cheese for 1 minute at high speed or until creamy",
          "description":""
        },
        {
          "headline":"Turn down mixer speed to medium-high.",
          "description":"Slowly add powdered sugar and vanilla. Cream mixture at medium-high speed until fluffy and creamy."
        }
      ]
    },
    {
      "name":"Sandwiching the Cookies Together",
      "steps":[
        {
          "headline":"Select cookie pairs based on the size of the cookies.",
          "description":"Try to match equally sized cookies to make the cookie sandwiches."
        },
        {
          "headline":"Use a table knife or off-set spatula to spread filling on the flat side of one cookie half.",
          "description":"Top with the matching cookie half. Repeat until all the cookies are matched up."
        },
        {
          "headline":"Store the cookie sandwiches in the refrigerator for up to 1 week.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Cookies Preheat the oven to 350°F (177°C) (Gas Mark 4). Line two large baking sheets with parchment paper. You can also line the baking sheets with aluminum foil and spray the baking sheets with nonstick cooking spray. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/7e\\/Bake-Red-Velvet-Whoopie-Pies-Step-1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/7e\\/Bake-Red-Velvet-Whoopie-Pies-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":760,\"bigHeight\":508,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Whisk the flour, cocoa powder, baking soda, and salt together in a mixing bowl.  Add butter to another mixing bowl  and beat for 1 minute on medium-high speed using an electric mixer. The butter will look creamy. Add the brown sugar to the butter and beat at high speed until fluffy.  Add the egg to the butter mixture and beat in on high scraping the bowl as needed.  Add the vanilla and buttermilk to the butter mixture. Beat in the vanilla and buttermilk. Add the dry ingredients to the butter mixture. Beat mixture on low speed of the mixer. Mix cookie dough until just combined. Add the gel food coloring to the cookie batter. Add enough food coloring to make a nice, deep red hue. This should be about 1 teaspoon (5 grams) of red gel food coloring. Spray a tablespoon with nonstick cooking spray. Use a sturdy measuring spoon to measure out (228 to 314 grams) the batter or use a cookie scoop that measures out 1 to 1 1/2 tablespoons (228 to 314 grams). Drop cookie batter onto prepared the baking sheets. Bake cookies for about 10 to 12 minutes or until centers are set. Lightly press a cookie with your finger and if no indentation remains the cookie is set. Allow cookies to cool about 5 minutes before removing to wire baking racks to cool. Cool cookies completely before filling with cream cheese filling. Making the Cream Cheese Filling Beat cream cheese for 1 minute at high speed or until creamy  Turn down mixer speed to medium-high. Slowly add powdered sugar and vanilla. Cream mixture at medium-high speed until fluffy and creamy. Sandwiching the Cookies Together Select cookie pairs based on the size of the cookies. Try to match equally sized cookies to make the cookie sandwiches. Use a table knife or off-set spatula to spread filling on the flat side of one cookie half. Top with the matching cookie half. Repeat until all the cookies are matched up. Store the cookie sandwiches in the refrigerator for up to 1 week. ",
  "tyn_model":[
    "butter",
    "baking sheets",
    "vanilla",
    "cream cheese",
    "nonstick cooking spray",
    "mixing bowl",
    "buttermilk",
    "mixer",
    "cookie batter",
    "oven",
    "parchment paper",
    "aluminum foil",
    "flour",
    "cocoa powder",
    "baking soda",
    "salt",
    "electric mixer",
    "brown sugar",
    "bowl",
    "cookie dough",
    "gel food coloring",
    "food coloring",
    "red gel food coloring",
    "measuring spoon",
    "cookie scoop",
    "baking racks",
    "powdered sugar",
    "table knife",
    "spatula",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}