{
  "title":"How to Move Across the Country for Cheap",
  "url":"https://www.wikihow.com/Move-Across-the-Country-for-Cheap",
  "category_hierarchy":[
    "Home and Garden",
    "Moving and Removals",
    "Moving Cross Country"
  ],
  "parts":[
    {
      "name":"Organizing Your Possessions",
      "steps":[
        {
          "headline":"Clean your home to sort your possessions.",
          "description":"Do a little spring cleaning. This gives you an opportunity to sort through all the things you own. It will be more than you expect, so take an inventory. Try to sort your possessions into groups of necessities, things you would like to save, and things you’re willing to discard. Also sort similar items into groups to be packed together. For instance, pack pots and pans together."
        },
        {
          "headline":"Get rid of items that aren’t important to you.",
          "description":"The big expense is in the amount of stuff you need to transport, but this is something you can control. Throw away anything you can live without. Large items in particular are difficult to move, so leave furniture and bulky electronics if you can. For example, food, books, toys, and clothing may be easier and cheaper to replace instead of move. Leave behind items that are well worn. Your old TV, for instance, might cost more to ship than it is worth."
        },
        {
          "headline":"Leave behind heavy items like furniture.",
          "description":"Large, heavy objects are the costliest to move. Items like couches, chairs, and bookcases can often be left behind and replaced for less once you move. Carefully calculate these into your moving expenses later and decide if they’re worth the trouble. For example, you could get rid of your couch and pick up a used one from Craigslist or a secondhand shop after you have moved into your new residence."
        },
        {
          "headline":"Sell anything you don’t want to keep.",
          "description":"Visit sites like Craigslist to post listings for your items or have a yard sale. You get to reduce your moving burden while making some extra cash. It’s a great way to offset some of the cost of moving."
        },
        {
          "headline":"Donate usable items you can’t sell.",
          "description":"If you have something that can help someone, bring it to a thrift shop. Clothes and furniture are a few things that may be needed by other people in your community. Also think of friends and family who may have a use for what you own."
        },
        {
          "headline":"Contact stores in your area to find free cardboard boxes.",
          "description":"Visit stores and ask them nicely for spare cardboard boxes. Many shops throw away the boxes so they’ll give them away for free. Fast food restaurants, bookstores, and liquor stores are some places that tend to have plenty of strong cardboard boxes to give away. Also look online at sites like Craigslist, Freecycle, or the U-Haul message boards. Someone nearby may have boxes for you."
        }
      ]
    },
    {
      "name":"Arranging Your Trip",
      "steps":[
        {
          "headline":"Create a budget for your move.",
          "description":"On a piece of paper, list all your transport options and the expenses. Set a maximum amount you’re willing to pay. Moving is typically more expensive than you expect, so continue to adjust your plans and reduce your possessions in order to save money."
        },
        {
          "headline":"Avoid peak moving season to get cheaper costs.",
          "description":"Peak moving season is when schools are out, including the summer, holidays, and weekends. Lots of people travel during these times, so moving and transportation companies increase their rates. Save money by moving in colder months and during the middle of the week."
        },
        {
          "headline":"Find a place to move to before you leave.",
          "description":"An unexpected expense happens if you end up living in a hotel or moving somewhere you don’t like. Save money by arranging to stay with friends or family in the area. Cheap rooms through Airbnb and similar services are also good options until you find a permanent home. You can do research at home to find a permanent residence, but it’s never as good as visiting in person."
        },
        {
          "headline":"Decide on how you will get yourself across the country.",
          "description":"Plan your own trip, keeping in mind that your choice is heavily related to how you want to move your possessions. Flying is the quickest and least stressful option, but it means packing light. Driving is arduous and means extra costs and planning, so consider what option best fits your situation. With flying, you won’t need to plan as much for fuel, food, or places to sleep. With driving, you can bring your own vehicle or drive a moving truck with your possessions. Another option is taking a bus or train. This is also a cheap way to travel lightly."
        },
        {
          "headline":"Factor in moving costs for any pets you bring.",
          "description":"Bringing along a pet is another significant cost to research. Count on having a carrier cage, a supply of food, and visiting places that are pet-friendly. If you’re flying, research how much airlines charge for pets, what health documentation you need,  and where they put them on the plane. Moving is stressful for pets, so take precautions to make the trip as safe and speedy for them as possible."
        }
      ]
    },
    {
      "name":"Choosing a Shipping Method",
      "steps":[
        {
          "headline":"Compare the costs of different shipping methods.",
          "description":"Visit the websites of companies offering shipping services to find contact information. They will give you estimates on how much moving costs. Read about and consider the benefits and drawbacks of the service to figure out which one works best for your situation. The cheapest way to move is to pack lightly and fly, drive, or ride a train across the country. However, you may have to sacrifice more of what you own. Hiring a moving service is costly, but you don’t have to worry about moving your possessions. You can then save money by flying to your destination."
        },
        {
          "headline":"Ship essentials through the mail to save money.",
          "description":"Pack some clothing into a box and ship it to your new location through UPS, the post office, or another service. You can also affordably send heavier possessions, like books, through ground shipping. This is a great way to save money if you plan on traveling light or can’t fit everything into another transportation option. You will need somewhere to send these items. Arrange for a place to stay in advance or ship them to someone you know who can get them to you when you arrive."
        },
        {
          "headline":"Bring a few suitcases on a commercial airline at a low cost.",
          "description":"If you have no furniture, hop on a plane to travel cheaply. Seek out a budget airline for extra savings. You can usually pack a suitcase or 2 for free. If needed, pack extra suitcases for a small charge. Even with the fees, this can be a surprisingly cheap option. This kind of moving involves checking the bags in on a flight you will be taking. Bring the bags up to the check-in counter when you arrive at the airport. Pack lightly, since each extra checked bag comes at a price. Remember that you will need to transport each bag to and from the airport yourself."
        },
        {
          "headline":"Use a bus or train service to move a few heavy items.",
          "description":"Use Amtrak or Greyhound’s Bus Freighter service. You will have to pack your items and bring them to the bus or train. It’s not as fast as using a plane, but it is cheaper than using a moving truck. These services usually accept heavier boxes and furniture. First, contact these services to find out if they have a line from your old destination to your new one. Sometimes this isn’t possible. These services may also deliver to your door, although it costs extra."
        },
        {
          "headline":"Pack anything you can fit into your car to avoid extra expenses.",
          "description":"This is the most obvious solution, since it gets both you and your necessities to your destination. You won’t have a lot of space for supplies, so limit yourself to important items like food, clothing, and valuables. Driving includes planning out your route and budget for gas and other supplies. Also consider the wear and tear on your vehicle."
        },
        {
          "headline":"Rent a trailer to transport more possessions.",
          "description":"The hauling method is trustworthy and the cheapest way to move everything you own. Make sure you call U-Haul and competing companies for estimates. You will need to pay for gas and unload all of your gear yourself, but you get to bring your vehicle with you if you have one. Check that you are able to drop off the trailer in your new destination. Not all companies allow this, and it would be unpleasant to have to drive all the way back to return the trailer. You can also rent larger trucks from these companies. They’re a little more expensive than trailers and you would need someone else to drive your vehicle if you have one to bring along."
        },
        {
          "headline":"Create a uShip listing to move a few heavy possessions.",
          "description":"On uShip, you list what you need to move and private contractors bid on it. You don’t have to do any of the work, so it’s a great way to move difficult items like TVs, motorcycles, and even pets for a lower cost. The contractor will deliver it to your new home, so you can take the cheapest transportation method available. Receiving good bids isn’t guaranteed and takes time, so put up the listing weeks in advance of your move. Using this service involves trusting the contractor. Even someone who is highly rated can end up ruining your items."
        },
        {
          "headline":"Hire cross country movers to avoid packing and planning.",
          "description":"Moving companies take out some of the hassle of moving. Pack what you want to bring, then have the movers load it into the truck. They will also unload it when you arrive, so this is an efficient way of moving a lot of stuff. Expect it to be the most expensive option. Call these companies to get estimates, then schedule pick up and drop off times for your items. Make sure you accurately estimate the weight of your boxes. Heavier boxes cost more. Also be aware of the fees."
        }
      ]
    },
    {
      "name":"Driving Across the Country",
      "steps":[
        {
          "headline":"Plan out your route before leaving.",
          "description":"Once you’re settled on transportation, get a map and research your route. Copy any directions you need in order to stay on track. Locate possible places to stop along the way, avoiding tourist traps that burn through your funds."
        },
        {
          "headline":"Find the cheapest gas stations on the way.",
          "description":"The cheapest gas stations tend to be right outside major cities and suburbs. Isolated gas stations out in the country charge much more, so avoid taking detours and fuel up when the time is right. Download a gas price phone app to help locate the cheapest gas while you travel."
        },
        {
          "headline":"Arrange stays at hotels along your route.",
          "description":"Search online for pricing estimates and addresses for hotels on your route. Motels and hostels tend to offer the best rates. Be careful of high prices in large cities, travel hubs, and isolated areas. To save more money, try arranging stays through Airbnb or a couchsurfing website. Read and research these offers carefully to ensure they are legitimate and safe. You may also be able to find camping spots along your route. If you have a tent, this can be a great way to stretch your legs and save money."
        },
        {
          "headline":"Pack your own food to save money.",
          "description":"Unfortunately, you can’t bring your refrigerator, but you can bring snacks. Non-perishables such as peanut butter, chips, beef jerky, and bottled drinks mean less stopping on the road and spending money. You can also bring a cooler with ice to fill with supplies, if you have the space. If you do need to stop for food, stay away from pricey food at gas stations and restaurants. The cost adds up quickly."
        }
      ]
    }
  ],
  "text":" Organizing Your Possessions Clean your home to sort your possessions. Do a little spring cleaning. This gives you an opportunity to sort through all the things you own. It will be more than you expect, so take an inventory. Try to sort your possessions into groups of necessities, things you would like to save, and things you’re willing to discard. Also sort similar items into groups to be packed together. For instance, pack pots and pans together. Get rid of items that aren’t important to you. The big expense is in the amount of stuff you need to transport, but this is something you can control. Throw away anything you can live without. Large items in particular are difficult to move, so leave furniture and bulky electronics if you can. For example, food, books, toys, and clothing may be easier and cheaper to replace instead of move. Leave behind items that are well worn. Your old TV, for instance, might cost more to ship than it is worth. Leave behind heavy items like furniture. Large, heavy objects are the costliest to move. Items like couches, chairs, and bookcases can often be left behind and replaced for less once you move. Carefully calculate these into your moving expenses later and decide if they’re worth the trouble. For example, you could get rid of your couch and pick up a used one from Craigslist or a secondhand shop after you have moved into your new residence. Sell anything you don’t want to keep. Visit sites like Craigslist to post listings for your items or have a yard sale. You get to reduce your moving burden while making some extra cash. It’s a great way to offset some of the cost of moving. Donate usable items you can’t sell. If you have something that can help someone, bring it to a thrift shop. Clothes and furniture are a few things that may be needed by other people in your community. Also think of friends and family who may have a use for what you own. Contact stores in your area to find free cardboard boxes. Visit stores and ask them nicely for spare cardboard boxes. Many shops throw away the boxes so they’ll give them away for free. Fast food restaurants, bookstores, and liquor stores are some places that tend to have plenty of strong cardboard boxes to give away. Also look online at sites like Craigslist, Freecycle, or the U-Haul message boards. Someone nearby may have boxes for you. Arranging Your Trip Create a budget for your move. On a piece of paper, list all your transport options and the expenses. Set a maximum amount you’re willing to pay. Moving is typically more expensive than you expect, so continue to adjust your plans and reduce your possessions in order to save money. Avoid peak moving season to get cheaper costs. Peak moving season is when schools are out, including the summer, holidays, and weekends. Lots of people travel during these times, so moving and transportation companies increase their rates. Save money by moving in colder months and during the middle of the week. Find a place to move to before you leave. An unexpected expense happens if you end up living in a hotel or moving somewhere you don’t like. Save money by arranging to stay with friends or family in the area. Cheap rooms through Airbnb and similar services are also good options until you find a permanent home. You can do research at home to find a permanent residence, but it’s never as good as visiting in person. Decide on how you will get yourself across the country. Plan your own trip, keeping in mind that your choice is heavily related to how you want to move your possessions. Flying is the quickest and least stressful option, but it means packing light. Driving is arduous and means extra costs and planning, so consider what option best fits your situation. With flying, you won’t need to plan as much for fuel, food, or places to sleep. With driving, you can bring your own vehicle or drive a moving truck with your possessions. Another option is taking a bus or train. This is also a cheap way to travel lightly. Factor in moving costs for any pets you bring. Bringing along a pet is another significant cost to research. Count on having a carrier cage, a supply of food, and visiting places that are pet-friendly. If you’re flying, research how much airlines charge for pets, what health documentation you need,  and where they put them on the plane. Moving is stressful for pets, so take precautions to make the trip as safe and speedy for them as possible. Choosing a Shipping Method Compare the costs of different shipping methods. Visit the websites of companies offering shipping services to find contact information. They will give you estimates on how much moving costs. Read about and consider the benefits and drawbacks of the service to figure out which one works best for your situation. The cheapest way to move is to pack lightly and fly, drive, or ride a train across the country. However, you may have to sacrifice more of what you own. Hiring a moving service is costly, but you don’t have to worry about moving your possessions. You can then save money by flying to your destination. Ship essentials through the mail to save money. Pack some clothing into a box and ship it to your new location through UPS, the post office, or another service. You can also affordably send heavier possessions, like books, through ground shipping. This is a great way to save money if you plan on traveling light or can’t fit everything into another transportation option. You will need somewhere to send these items. Arrange for a place to stay in advance or ship them to someone you know who can get them to you when you arrive. Bring a few suitcases on a commercial airline at a low cost. If you have no furniture, hop on a plane to travel cheaply. Seek out a budget airline for extra savings. You can usually pack a suitcase or 2 for free. If needed, pack extra suitcases for a small charge. Even with the fees, this can be a surprisingly cheap option. This kind of moving involves checking the bags in on a flight you will be taking. Bring the bags up to the check-in counter when you arrive at the airport. Pack lightly, since each extra checked bag comes at a price. Remember that you will need to transport each bag to and from the airport yourself. Use a bus or train service to move a few heavy items. Use Amtrak or Greyhound’s Bus Freighter service. You will have to pack your items and bring them to the bus or train. It’s not as fast as using a plane, but it is cheaper than using a moving truck. These services usually accept heavier boxes and furniture. First, contact these services to find out if they have a line from your old destination to your new one. Sometimes this isn’t possible. These services may also deliver to your door, although it costs extra. Pack anything you can fit into your car to avoid extra expenses. This is the most obvious solution, since it gets both you and your necessities to your destination. You won’t have a lot of space for supplies, so limit yourself to important items like food, clothing, and valuables. Driving includes planning out your route and budget for gas and other supplies. Also consider the wear and tear on your vehicle. Rent a trailer to transport more possessions. The hauling method is trustworthy and the cheapest way to move everything you own. Make sure you call U-Haul and competing companies for estimates. You will need to pay for gas and unload all of your gear yourself, but you get to bring your vehicle with you if you have one. Check that you are able to drop off the trailer in your new destination. Not all companies allow this, and it would be unpleasant to have to drive all the way back to return the trailer. You can also rent larger trucks from these companies. They’re a little more expensive than trailers and you would need someone else to drive your vehicle if you have one to bring along. Create a uShip listing to move a few heavy possessions. On uShip, you list what you need to move and private contractors bid on it. You don’t have to do any of the work, so it’s a great way to move difficult items like TVs, motorcycles, and even pets for a lower cost. The contractor will deliver it to your new home, so you can take the cheapest transportation method available. Receiving good bids isn’t guaranteed and takes time, so put up the listing weeks in advance of your move. Using this service involves trusting the contractor. Even someone who is highly rated can end up ruining your items. Hire cross country movers to avoid packing and planning. Moving companies take out some of the hassle of moving. Pack what you want to bring, then have the movers load it into the truck. They will also unload it when you arrive, so this is an efficient way of moving a lot of stuff. Expect it to be the most expensive option. Call these companies to get estimates, then schedule pick up and drop off times for your items. Make sure you accurately estimate the weight of your boxes. Heavier boxes cost more. Also be aware of the fees. Driving Across the Country Plan out your route before leaving. Once you’re settled on transportation, get a map and research your route. Copy any directions you need in order to stay on track. Locate possible places to stop along the way, avoiding tourist traps that burn through your funds. Find the cheapest gas stations on the way. The cheapest gas stations tend to be right outside major cities and suburbs. Isolated gas stations out in the country charge much more, so avoid taking detours and fuel up when the time is right. Download a gas price phone app to help locate the cheapest gas while you travel. Arrange stays at hotels along your route. Search online for pricing estimates and addresses for hotels on your route. Motels and hostels tend to offer the best rates. Be careful of high prices in large cities, travel hubs, and isolated areas. To save more money, try arranging stays through Airbnb or a couchsurfing website. Read and research these offers carefully to ensure they are legitimate and safe. You may also be able to find camping spots along your route. If you have a tent, this can be a great way to stretch your legs and save money. Pack your own food to save money. Unfortunately, you can’t bring your refrigerator, but you can bring snacks. Non-perishables such as peanut butter, chips, beef jerky, and bottled drinks mean less stopping on the road and spending money. You can also bring a cooler with ice to fill with supplies, if you have the space. If you do need to stop for food, stay away from pricey food at gas stations and restaurants. The cost adds up quickly.",
  "tyn_model":[
    "trailer",
    "cardboard",
    "airbnb",
    "suitcases",
    "movers",
    "pots",
    "pans",
    "tv",
    "couch",
    "furniture",
    "u-haul message",
    "flying",
    "food",
    "ups",
    "suitcase",
    "plane",
    "moving truck",
    "u-haul and competing companies",
    "trucks",
    "trailers",
    "gas",
    "tent",
    "refrigerator",
    "beef jerky",
    "cooler",
    "ice"
  ],
  "tyn_section":[

  ]
}