{
  "title":"How to Preserve Eggs",
  "url":"https://www.wikihow.com/Preserve-Eggs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy"
  ],
  "methods":[
    {
      "name":"Freezing Whole Eggs, Yolks, and Whites",
      "steps":[
        {
          "headline":"Separate the egg whites from the yolks to freeze them separately.",
          "description":"Crack your egg onto a slotted spoon and shift it gently from side to side over a bowl. The egg white should slip through the holes in the spoon. Repeat for as many eggs as you plan to freeze. Set the yolk aside in a different bowl if you plan to use it later, or simply throw it away."
        },
        {
          "headline":"Beat the yolks and add salt or sugar to prevent gelation.",
          "description":"When frozen by themselves, egg yolks can thicken and become gel-like, making them difficult to cook with. To prevent this, stir in ⁄8 teaspoon (0.62 mL) salt or 1 ⁄2 teaspoons (7.4 mL) sugar per 4 yolks. If you know you’ll be using the yolks for savory dishes, use salt. For baking or desserts, mix in sugar."
        },
        {
          "headline":"Crack and beat whole eggs to freeze a full mixture.",
          "description":"If you’re planning on freezing whole eggs--the whites and the yolks together--simply crack them open into a bowl. Use a whisk or a fork to beat them until they’re just blended."
        },
        {
          "headline":"Pour the eggs into a freezer container and label it.",
          "description":"Label a sealable plastic container with the amount of eggs, the date, and any additives you’ve stirred in, like salt or sugar. Then pour the egg whites or mixture and seal it tightly. If you want to avoid writing directly on the container, write on a piece of tape and stick it to the surface. You can also use a plastic egg crate, muffin tin, or ice cube tray to freeze the eggs."
        },
        {
          "headline":"Place the eggs in the freezer for up to a year and thaw before use.",
          "description":"Your frozen eggs or egg whites will last for up to a year in a freezer set to 0 °F (−18 °C) or colder. To defrost them, set them in the refrigerator overnight or run them under cold running water until thawed. Use them right away once they’re defrosted, and only in dishes that cook the egg. 3 tablespoons (44 mL) of whole egg mixture is equal to about 1 fresh egg. 2 tablespoons (30 mL) of defrosted egg white is equal to 1 fresh egg white. 1 tablespoon (15 mL) of thawed egg yolk is equivalent to 1 fresh egg yolk."
        }
      ]
    },
    {
      "name":"Making Frozen Hard-Boiled Egg Yolks",
      "steps":[
        {
          "headline":"Remove the yolks from the eggs and put them in a saucepan.",
          "description":"Crack  as many eggs as desired one by one over a slotted spoon. Gently shake the spoon over a bowl to separate the egg whites, then place the yolks in a saucepan on the stove."
        },
        {
          "headline":"Boil the yolks in a small amount of water and let stand for 12 minutes.",
          "description":"Pour water over the yolks so that there’s at least a 1 inch (2.5 cm) layer on top of them. Cover the pan and bring it to a boil, then take the pan off the heat. Keep it covered and let the yolks stand for about 12 minutes."
        },
        {
          "headline":"Drain the eggs and place them in a freezer container.",
          "description":"Use the slotted spoon to lift the eggs from the pan, draining them well over the sink. Place them in a labeled, sealable freezer container to store."
        },
        {
          "headline":"Freeze the hard-boiled yolks for up to a year and thaw before use.",
          "description":"Store your egg yolks in a freezer set to 0 °F (−18 °C) or colder. Thaw the yolks by leaving them overnight in the refrigerator or running them under cold water. Use your frozen, hard-boiled egg yolks as garnishes on a salad or toppings for a sandwich."
        }
      ]
    },
    {
      "name":"Making Eggs Last Safely",
      "steps":[
        {
          "headline":"Buy eggs that haven’t passed their expiration or sell-by dates.",
          "description":"Egg cartons bought in a grocery store typically have a pack date, a sell-by date, and an expiration date. For the freshest, longest-lasting eggs, make sure to buy a carton that hasn’t passed its sell-by or expiration date. Peek inside the carton and examine the eggs as well to ensure that none are cracked."
        },
        {
          "headline":"Refrigerate whole eggs for up to 3 weeks after purchase.",
          "description":"Regardless of the sell-by date, your eggs should be good to use until about 4 weeks after the pack date. This will typically be about 3 weeks after the the day you purchased the carton. The pack date will be a 3-digit code that represents the day of the year that the eggs were washed, graded, and placed into the carton. If your carton was packed on December 31, for example, the pack date would be 365, because it was the 365th day of the year."
        },
        {
          "headline":"Store eggs in the coldest part of the refrigerator.",
          "description":"To keep your eggs fresher for longer, store them in their original carton in the back of the refrigerator, where the air stays coldest. Avoid storing them in the door or near the front of the shelves. Make sure your refrigerator is set to 40 °F (4 °C) or lower to ensure that your eggs remain fresh."
        },
        {
          "headline":"Test eggs for freshness before you use them.",
          "description":"If you’re not sure whether an egg is still good or not, fill a bowl with water and place the egg inside. Eggshells are porous, allowing air in and out, and the more air that permeates the shell over time, the more spoiled the egg becomes. You can test this porousness, and the egg’s quality, based on whether it floats in water or not. Also check for bad smells or unusual colors to see if your egg is bad. If the egg lays at the bottom of the bowl on its side, it’s still fine to eat. If the egg is at the bottom of the bowl but remains upright, you should eat it that day, as it will go bad very soon. If the egg floats up to the top of the bowl, it’s spoiled and should be thrown out."
        },
        {
          "headline":"Avoid food poisoning by never eating raw or undercooked eggs.",
          "description":"Eggs can contain a germ called Salmonella which can give you food poisoning, especially if you eat eggs that are raw or undercooked. Avoid eating eggs that are dirty or cracked and cook eggs fully to an internal temperature of 160 °F (71 °C). Go to a doctor immediately if you see signs of food poisoning, which can include:\nAbdominal cramps\nDiarrhea\nFever\nBloody stools\nSymptoms of dehydration, including a dry mouth and throat, dizziness when you stand, and producing very little urine"
        }
      ]
    }
  ],
  "text":" Freezing Whole Eggs, Yolks, and Whites Separate the egg whites from the yolks to freeze them separately. Crack your egg onto a slotted spoon and shift it gently from side to side over a bowl. The egg white should slip through the holes in the spoon. Repeat for as many eggs as you plan to freeze. Set the yolk aside in a different bowl if you plan to use it later, or simply throw it away. Beat the yolks and add salt or sugar to prevent gelation. When frozen by themselves, egg yolks can thicken and become gel-like, making them difficult to cook with. To prevent this, stir in ⁄8 teaspoon (0.62 mL) salt or 1 ⁄2 teaspoons (7.4 mL) sugar per 4 yolks. If you know you’ll be using the yolks for savory dishes, use salt. For baking or desserts, mix in sugar. Crack and beat whole eggs to freeze a full mixture. If you’re planning on freezing whole eggs--the whites and the yolks together--simply crack them open into a bowl. Use a whisk or a fork to beat them until they’re just blended. Pour the eggs into a freezer container and label it. Label a sealable plastic container with the amount of eggs, the date, and any additives you’ve stirred in, like salt or sugar. Then pour the egg whites or mixture and seal it tightly. If you want to avoid writing directly on the container, write on a piece of tape and stick it to the surface. You can also use a plastic egg crate, muffin tin, or ice cube tray to freeze the eggs. Place the eggs in the freezer for up to a year and thaw before use. Your frozen eggs or egg whites will last for up to a year in a freezer set to 0 °F (−18 °C) or colder. To defrost them, set them in the refrigerator overnight or run them under cold running water until thawed. Use them right away once they’re defrosted, and only in dishes that cook the egg. 3 tablespoons (44 mL) of whole egg mixture is equal to about 1 fresh egg. 2 tablespoons (30 mL) of defrosted egg white is equal to 1 fresh egg white. 1 tablespoon (15 mL) of thawed egg yolk is equivalent to 1 fresh egg yolk. Making Frozen Hard-Boiled Egg Yolks Remove the yolks from the eggs and put them in a saucepan. Crack  as many eggs as desired one by one over a slotted spoon. Gently shake the spoon over a bowl to separate the egg whites, then place the yolks in a saucepan on the stove. Boil the yolks in a small amount of water and let stand for 12 minutes. Pour water over the yolks so that there’s at least a 1 inch (2.5 cm) layer on top of them. Cover the pan and bring it to a boil, then take the pan off the heat. Keep it covered and let the yolks stand for about 12 minutes. Drain the eggs and place them in a freezer container. Use the slotted spoon to lift the eggs from the pan, draining them well over the sink. Place them in a labeled, sealable freezer container to store. Freeze the hard-boiled yolks for up to a year and thaw before use. Store your egg yolks in a freezer set to 0 °F (−18 °C) or colder. Thaw the yolks by leaving them overnight in the refrigerator or running them under cold water. Use your frozen, hard-boiled egg yolks as garnishes on a salad or toppings for a sandwich. Making Eggs Last Safely Buy eggs that haven’t passed their expiration or sell-by dates. Egg cartons bought in a grocery store typically have a pack date, a sell-by date, and an expiration date. For the freshest, longest-lasting eggs, make sure to buy a carton that hasn’t passed its sell-by or expiration date. Peek inside the carton and examine the eggs as well to ensure that none are cracked. Refrigerate whole eggs for up to 3 weeks after purchase. Regardless of the sell-by date, your eggs should be good to use until about 4 weeks after the pack date. This will typically be about 3 weeks after the the day you purchased the carton. The pack date will be a 3-digit code that represents the day of the year that the eggs were washed, graded, and placed into the carton. If your carton was packed on December 31, for example, the pack date would be 365, because it was the 365th day of the year. Store eggs in the coldest part of the refrigerator. To keep your eggs fresher for longer, store them in their original carton in the back of the refrigerator, where the air stays coldest. Avoid storing them in the door or near the front of the shelves. Make sure your refrigerator is set to 40 °F (4 °C) or lower to ensure that your eggs remain fresh. Test eggs for freshness before you use them. If you’re not sure whether an egg is still good or not, fill a bowl with water and place the egg inside. Eggshells are porous, allowing air in and out, and the more air that permeates the shell over time, the more spoiled the egg becomes. You can test this porousness, and the egg’s quality, based on whether it floats in water or not. Also check for bad smells or unusual colors to see if your egg is bad. If the egg lays at the bottom of the bowl on its side, it’s still fine to eat. If the egg is at the bottom of the bowl but remains upright, you should eat it that day, as it will go bad very soon. If the egg floats up to the top of the bowl, it’s spoiled and should be thrown out. Avoid food poisoning by never eating raw or undercooked eggs. Eggs can contain a germ called Salmonella which can give you food poisoning, especially if you eat eggs that are raw or undercooked. Avoid eating eggs that are dirty or cracked and cook eggs fully to an internal temperature of 160 °F (71 °C). Go to a doctor immediately if you see signs of food poisoning, which can include:\nAbdominal cramps\nDiarrhea\nFever\nBloody stools\nSymptoms of dehydration, including a dry mouth and throat, dizziness when you stand, and producing very little urine",
  "tyn_model":[
    "eggs",
    "bowl",
    "refrigerator",
    "water",
    "salt",
    "sugar",
    "slotted spoon",
    "freezer container",
    "freezer",
    "egg white",
    "spoon",
    "saucepan",
    "whisk",
    "fork",
    "sealable plastic container",
    "muffin tin",
    "ice cube tray",
    "egg whites",
    "stove",
    "egg yolks",
    "egg cartons"
  ],
  "tyn_section":[

  ]
}