{
  "title":"How to Wash Nylons",
  "url":"https://www.wikihow.com/Wash-Nylons",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Washing Delicates"
  ],
  "methods":[
    {
      "name":"Hand Washing Your Nylons",
      "steps":[
        {
          "headline":"Fill a sink with cold water.",
          "description":"To best care for your nylons, you should wash them by hand. Fill your sink with cold water. Make sure the drain plug and chain are free of sharp edges which could snag your tights."
        },
        {
          "headline":"Add 1 tablespoon (15 ml) of mild detergent to your water.",
          "description":"Nylons are extremely delicate, so you should always wash them with a mild detergent. This will help preserve the fibers in the long run so your nylons last longer."
        },
        {
          "headline":"Soak inside-out tights in the soapy water for 10 minutes.",
          "description":"When you soak your tights, the detergent will be able to penetrate the fabric without much agitation. By turning your tights inside out, you will be able to wash out any oils or sweat from your skin that have built up."
        },
        {
          "headline":"Scrunch your nylons together to wash them.",
          "description":"You don’t want to stretch, pull, or wring your nylons, since this will cause them to lose their shape. Instead, gently scrunch the fabric together and swirl the nylons around in the water to dislodge any dirt."
        },
        {
          "headline":"Rinse your nylons under cold running water.",
          "description":"Hot water will cause the fibers of your nylon stockings to stretch out, while cold water will help them stay tightly knitted. Empty the soapy water from the sink, then carefully rinse all of the detergent out of your nylons using cold water from the tap. Do not squeeze or twist your nylons as you rinse them."
        }
      ]
    },
    {
      "name":"Cleaning Your Nylons in the Washing Machine",
      "steps":[
        {
          "headline":"Place your nylons in a very fine mesh bag.",
          "description":"Don’t put your nylons straight into the washing machine, as they can get hung up on the agitator. Instead, protect your stockings by placing them in a mesh bag with a fine weave. If you don’t have one, try using a pillowcase."
        },
        {
          "headline":"Use a mild detergent and skip the fabric softener.",
          "description":"Mild detergent will help preserve the life of your tights by protecting and conditioning the fibers. However, fabric softener will weaken the fibers, so leave that out of the wash."
        },
        {
          "headline":"Wash tights on the cold, gentle cycle.",
          "description":"Always use cold water to wash your tights, as this will help the delicate fabric to last longer. Check your washing machine dials or user’s manual and place it on the gentlest setting available when you wash your nylons."
        },
        {
          "headline":"Leave out anything that can snag your tights.",
          "description":"Don’t wash anything with clasps, zippers, metal buttons, or hooks in the same wash as your nylons. These can snag your nylons in the wash, causing them to rip or snag."
        }
      ]
    },
    {
      "name":"Drying Your Nylons",
      "steps":[
        {
          "headline":"Squeeze your tights gently to remove any excess water.",
          "description":"Twisting or pulling your tights will stretch them and cause them to lose their shape. You can gently squeeze them to remove excess water but do not wring them."
        },
        {
          "headline":"Roll your tights up in a towel to blot them until they are damp.",
          "description":"A soft towel will gently absorb the excess water from your tights after you take them out of the sink or washing machine. Since the nylons are made up of thin, delicate fabric, they should dry quickly."
        },
        {
          "headline":"Hang your tights or lay them flat to air dry.",
          "description":"You should never put your tights into the dryer, as the heat will damage the fibers. You also run the risk of the nylons snagging in the door or on another piece of clothing. Instead, lay your tights flat or hang them on a clothes horse until they dry."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Hand Washing Your Nylons Fill a sink with cold water. To best care for your nylons, you should wash them by hand. Fill your sink with cold water. Make sure the drain plug and chain are free of sharp edges which could snag your tights. Add 1 tablespoon (15 ml) of mild detergent to your water. Nylons are extremely delicate, so you should always wash them with a mild detergent. This will help preserve the fibers in the long run so your nylons last longer. Soak inside-out tights in the soapy water for 10 minutes. When you soak your tights, the detergent will be able to penetrate the fabric without much agitation. By turning your tights inside out, you will be able to wash out any oils or sweat from your skin that have built up. Scrunch your nylons together to wash them. You don’t want to stretch, pull, or wring your nylons, since this will cause them to lose their shape. Instead, gently scrunch the fabric together and swirl the nylons around in the water to dislodge any dirt. Rinse your nylons under cold running water. Hot water will cause the fibers of your nylon stockings to stretch out, while cold water will help them stay tightly knitted. Empty the soapy water from the sink, then carefully rinse all of the detergent out of your nylons using cold water from the tap. Do not squeeze or twist your nylons as you rinse them. Cleaning Your Nylons in the Washing Machine Place your nylons in a very fine mesh bag. Don’t put your nylons straight into the washing machine, as they can get hung up on the agitator. Instead, protect your stockings by placing them in a mesh bag with a fine weave. If you don’t have one, try using a pillowcase. Use a mild detergent and skip the fabric softener. Mild detergent will help preserve the life of your tights by protecting and conditioning the fibers. However, fabric softener will weaken the fibers, so leave that out of the wash. Wash tights on the cold, gentle cycle. Always use cold water to wash your tights, as this will help the delicate fabric to last longer. Check your washing machine dials or user’s manual and place it on the gentlest setting available when you wash your nylons. Leave out anything that can snag your tights. Don’t wash anything with clasps, zippers, metal buttons, or hooks in the same wash as your nylons. These can snag your nylons in the wash, causing them to rip or snag. Drying Your Nylons Squeeze your tights gently to remove any excess water. Twisting or pulling your tights will stretch them and cause them to lose their shape. You can gently squeeze them to remove excess water but do not wring them. Roll your tights up in a towel to blot them until they are damp. A soft towel will gently absorb the excess water from your tights after you take them out of the sink or washing machine. Since the nylons are made up of thin, delicate fabric, they should dry quickly. Hang your tights or lay them flat to air dry. You should never put your tights into the dryer, as the heat will damage the fibers. You also run the risk of the nylons snagging in the door or on another piece of clothing. Instead, lay your tights flat or hang them on a clothes horse until they dry. Finished. ",
  "tyn_model":[
    "water",
    "nylons",
    "mild detergent",
    "fabric softener",
    "towel",
    "soapy water",
    "mesh bag",
    "detergent",
    "washing machine",
    "tights",
    "clothes horse"
  ],
  "tyn_section":[

  ]
}