{
  "title":"How to Make Duck Sauce",
  "url":"https://www.wikihow.com/Make-Duck-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Sauces"
  ],
  "methods":[
    {
      "name":"Making Duck Sauce with Fresh Fruit",
      "steps":[
        {
          "headline":"Remove any pits or hard peels from the fruits.",
          "description":"If you’re using plums, peaches, apricots, or any other fruit that contains a pit, cut it in half and use a knife or spoon to remove the pit. If you’re using pineapple or any other fruit with a hard, inedible peel, use a knife to carefully  remove the peel."
        },
        {
          "headline":"Cut all the fruit into chunks 1 inch (2.5 cm) square.",
          "description":"Use a large, sharp knife to carefully chop your fruit into pieces that are roughly 1 inch (2.5 cm) square. Softer fruits like plums may get a little mushy and juicy when cut, which is fine."
        },
        {
          "headline":"Peel and grate the fresh ginger if you’re using it.",
          "description":"Fresh ginger will give you the best flavor, but there’s nothing wrong with using dried ginger to save time. Remove the outer peel from the ginger with a small knife or vegetable peeler, and use a fine grater or zester to grate it."
        },
        {
          "headline":"Peel and mince the fresh garlic if you’re using it.",
          "description":"Place your knife flat on top of the garlic and press down on it with your hand to crush the clove. This will make it easier to remove the peel. After you’ve peeled the garlic, cut it into very fine pieces with a knife or use a garlic press to mince it."
        },
        {
          "headline":"Add all the ingredients to a medium-sized saucepan.",
          "description":"Use a large knife to slide your chopped fruit off the cutting board into the saucepan, along with any juice that may have gathered on the cutting board. Add the rest of the ingredients and stir them a few times."
        },
        {
          "headline":"Bring the mixture to a boil while stirring occasionally.",
          "description":"Set the heat to medium and let the mixture come to a boil. Stir it every 1 minute or so to make sure the mixture isn’t sticking to the bottom of the pan. Make sure you are using your stirring spoon to reach the corners of the pan and remove any sauce that might stick there."
        },
        {
          "headline":"Turn the heat to low and let the sauce simmer for 30 minutes.",
          "description":"Once the mixture has come to a full boil and you see large, rapid bubbles in the liquid, set the heat to low. Set the timer for 30 minutes, and stir the sauce every 5 minutes or so."
        },
        {
          "headline":"Check the sauce to see if it has thickened.",
          "description":"If it has, turn the heat off. If not, cook it for another 5 minutes and check it again, repeating this process until the sauce has become thick. Stir it every time you check it."
        },
        {
          "headline":"Puree the sauce with a food processor or immersion blender.",
          "description":"A food processor on a low setting should blend your sauce until it’s smooth. If you use an immersion blender, make sure your saucepan is deep enough that the blender’s blades can be fully submerged when you use it. Blend it until it appears smooth and you don’t see any chunks. If some chunks remain after blending the sauce several times, you can also strain the mixture through a sieve."
        },
        {
          "headline":"Store any unused sauce in the fridge for up to 3 weeks.",
          "description":"Put whatever’s left of your sauce in an airtight container, preferably glass, and put it your fridge. It should stay fresh for up to 3 weeks."
        }
      ]
    },
    {
      "name":"Making Duck Sauce with Fruit Jam",
      "steps":[
        {
          "headline":"Put all the ingredients in a large mixing bowl and stir them with a whisk.",
          "description":"Add the ingredients and stir them thoroughly until the mixture appears to be all one color."
        },
        {
          "headline":"Strain the mixture through a sieve.",
          "description":"Pour the sauce into another bowl through a fine sieve to strain out any large chunks. Use a wooden spoon to gently force the liquid through. If any chunks remain in the sieve, throw them out."
        },
        {
          "headline":"Refrigerate the sauce for at least 2 hours to let the flavors combine.",
          "description":"This will give the ingredients a chance to meld and create a single flavor. Pour the sauce into an airtight container and leave it in the fridge for at least 2 hours before serving."
        },
        {
          "headline":"Bring the sauce to room temperature 30 minutes before serving it.",
          "description":"If you are using the sauce for a glaze or marinade, there’s no need to bring it to room temperature, since it will be heated in the process of cooking or grilling. However, if you’re using it for a dipping sauce, take it out of the fridge at least 30 minutes before serving to bring it to room temperature."
        },
        {
          "headline":"Store any unused sauce in the fridge for up to 1 month.",
          "description":"Since this sauce is made with preserved fruit instead of fresh, it will last at least 1 month if refrigerated. Store it in an airtight container in your fridge."
        }
      ]
    },
    {
      "name":"Finding Uses for Duck Sauce",
      "steps":[
        {
          "headline":"Use duck sauce as a dip for egg rolls, wonton, dumplings and rangoons.",
          "description":"The sweet, tangy flavor of duck sauce makes it a great addition to any savory snack meant for dipping. Although it’s traditionally used with Chinese cuisine, you can also try it with French fries, roasted vegetables, and chicken wings."
        },
        {
          "headline":"Glaze meats with duck sauce.",
          "description":"With its sweet flavor and thick consistency, duck sauce can make an ideal glaze for meats. Brush it onto chicken drumsticks, pork tenderloin, or ribs before roasting or grilling."
        },
        {
          "headline":"Marinate meats in duck sauce before grilling.",
          "description":"Duck sauce can add a tangy, delicious flavor to grilled meat, and makes for an interesting alternative to traditional barbecue sauce. Pour duck sauce into a pan or dish and let the meat sit in it for at least 30 minutes, turning it once so both sides are marinated. If you are grilling something large like a thick steak, marinate at least 1 hour. For a whole chicken, marinate it at least 4 hours."
        }
      ]
    }
  ],
  "text":" Making Duck Sauce with Fresh Fruit Remove any pits or hard peels from the fruits. If you’re using plums, peaches, apricots, or any other fruit that contains a pit, cut it in half and use a knife or spoon to remove the pit. If you’re using pineapple or any other fruit with a hard, inedible peel, use a knife to carefully  remove the peel. Cut all the fruit into chunks 1 inch (2.5 cm) square. Use a large, sharp knife to carefully chop your fruit into pieces that are roughly 1 inch (2.5 cm) square. Softer fruits like plums may get a little mushy and juicy when cut, which is fine. Peel and grate the fresh ginger if you’re using it. Fresh ginger will give you the best flavor, but there’s nothing wrong with using dried ginger to save time. Remove the outer peel from the ginger with a small knife or vegetable peeler, and use a fine grater or zester to grate it. Peel and mince the fresh garlic if you’re using it. Place your knife flat on top of the garlic and press down on it with your hand to crush the clove. This will make it easier to remove the peel. After you’ve peeled the garlic, cut it into very fine pieces with a knife or use a garlic press to mince it. Add all the ingredients to a medium-sized saucepan. Use a large knife to slide your chopped fruit off the cutting board into the saucepan, along with any juice that may have gathered on the cutting board. Add the rest of the ingredients and stir them a few times. Bring the mixture to a boil while stirring occasionally. Set the heat to medium and let the mixture come to a boil. Stir it every 1 minute or so to make sure the mixture isn’t sticking to the bottom of the pan. Make sure you are using your stirring spoon to reach the corners of the pan and remove any sauce that might stick there. Turn the heat to low and let the sauce simmer for 30 minutes. Once the mixture has come to a full boil and you see large, rapid bubbles in the liquid, set the heat to low. Set the timer for 30 minutes, and stir the sauce every 5 minutes or so. Check the sauce to see if it has thickened. If it has, turn the heat off. If not, cook it for another 5 minutes and check it again, repeating this process until the sauce has become thick. Stir it every time you check it. Puree the sauce with a food processor or immersion blender. A food processor on a low setting should blend your sauce until it’s smooth. If you use an immersion blender, make sure your saucepan is deep enough that the blender’s blades can be fully submerged when you use it. Blend it until it appears smooth and you don’t see any chunks. If some chunks remain after blending the sauce several times, you can also strain the mixture through a sieve. Store any unused sauce in the fridge for up to 3 weeks. Put whatever’s left of your sauce in an airtight container, preferably glass, and put it your fridge. It should stay fresh for up to 3 weeks. Making Duck Sauce with Fruit Jam Put all the ingredients in a large mixing bowl and stir them with a whisk. Add the ingredients and stir them thoroughly until the mixture appears to be all one color. Strain the mixture through a sieve. Pour the sauce into another bowl through a fine sieve to strain out any large chunks. Use a wooden spoon to gently force the liquid through. If any chunks remain in the sieve, throw them out. Refrigerate the sauce for at least 2 hours to let the flavors combine. This will give the ingredients a chance to meld and create a single flavor. Pour the sauce into an airtight container and leave it in the fridge for at least 2 hours before serving. Bring the sauce to room temperature 30 minutes before serving it. If you are using the sauce for a glaze or marinade, there’s no need to bring it to room temperature, since it will be heated in the process of cooking or grilling. However, if you’re using it for a dipping sauce, take it out of the fridge at least 30 minutes before serving to bring it to room temperature. Store any unused sauce in the fridge for up to 1 month. Since this sauce is made with preserved fruit instead of fresh, it will last at least 1 month if refrigerated. Store it in an airtight container in your fridge. Finding Uses for Duck Sauce Use duck sauce as a dip for egg rolls, wonton, dumplings and rangoons. The sweet, tangy flavor of duck sauce makes it a great addition to any savory snack meant for dipping. Although it’s traditionally used with Chinese cuisine, you can also try it with French fries, roasted vegetables, and chicken wings. Glaze meats with duck sauce. With its sweet flavor and thick consistency, duck sauce can make an ideal glaze for meats. Brush it onto chicken drumsticks, pork tenderloin, or ribs before roasting or grilling. Marinate meats in duck sauce before grilling. Duck sauce can add a tangy, delicious flavor to grilled meat, and makes for an interesting alternative to traditional barbecue sauce. Pour duck sauce into a pan or dish and let the meat sit in it for at least 30 minutes, turning it once so both sides are marinated. If you are grilling something large like a thick steak, marinate at least 1 hour. For a whole chicken, marinate it at least 4 hours.",
  "tyn_model":[
    "duck sauce",
    "knife",
    "ginger",
    "garlic",
    "sieve",
    "airtight container",
    "saucepan",
    "food processor",
    "immersion blender",
    "plums",
    "peaches",
    "apricots",
    "spoon",
    "pineapple",
    "fresh ginger",
    "small knife",
    "vegetable peeler",
    "fine grater",
    "zester",
    "garlic press",
    "medium-sized saucepan",
    "stirring spoon",
    "blender",
    "fruit jam",
    "large mixing bowl",
    "whisk",
    "bowl",
    "fine sieve",
    "wooden spoon",
    "fridge",
    "dipping sauce",
    "egg rolls",
    "french fries",
    "chicken wings",
    "chicken drumsticks",
    "barbecue sauce",
    "pan",
    "chicken"
  ],
  "tyn_section":[

  ]
}