{
  "title":"How to Change a Home Air Filter",
  "url":"https://www.wikihow.com/Change-a-Home-Air-Filter",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Monitoring Your Air Filter",
      "steps":[
        {
          "headline":"Check your unit’s filter every month when it’s in frequent use.",
          "description":"If you’re using your air unit on a daily basis -- running your air conditioner in the summer, for instance -- you should check the unit’s filter once a month. This way you will be able to see if the filter is dirty and needs changing. If you don’t use your air unit frequently, you may still want to check your filter once a month if your household includes pets, smokers, or a large amount of people."
        },
        {
          "headline":"Change your filter once a month if it is not pleated.",
          "description":"If your unit’s filter is non-pleated (has a smooth surface instead of a ridged one), it has less surface area to filter out particles and will become dirty and ineffective sooner. You may prefer non-pleated filters as they often have lower energy costs, but be prepared to change them more often."
        },
        {
          "headline":"Install a new filter at least every 3 months when it’s in frequent use.",
          "description":"Even if your filter doesn’t look particularly dirty, it should be changed at least every 3 months when it’s being used regularly. Air conditioners should have new filters every 3 months in the summer, and the same goes for furnace filters in the winter."
        },
        {
          "headline":"Change your filter anytime it looks dirty, damp or moldy.",
          "description":"No matter when you changed it last, you should always get a new filter if your current one appears dirty or damp, or if it seems to be growing mold. If you hold your air filter up to a light, you should be able to see through it easily. If not, it should be changed immediately."
        }
      ]
    },
    {
      "name":"Choosing the Right Air Filter",
      "steps":[
        {
          "headline":"Ask your HVAC installer what filter to use.",
          "description":"If you are around when your HVAC unit is installed, ask the technician what kind of filter it takes and how to install it. If you have a window unit, you may be able to talk to a representative from the store or company that supplied it and find out which filter to buy."
        },
        {
          "headline":"Look for a label on your unit that says which filter will fit.",
          "description":"Many air units have labels somewhere on the exterior that will say which kind of filter to buy. Check any visible parts of your unit for a label. Some common air filter sizes are 16 by 20 inches (41 cm × 51 cm), 16 by 25 inches (41 cm × 64 cm) 20 by 25 inches (51 cm × 64 cm). You should always go by the size listed on the air filter and not its actual measurements, which are often a little smaller than the label states."
        },
        {
          "headline":"Take a picture of your current filter to the store.",
          "description":"The best way to ensure that you get the right filter is to match it with the one already in use. Take out the current filter and see if it has a label or number. Take a picture of any information written on the filter and of the filter itself to help you match it in the store. You can also take the old filter itself to the store, but make sure you leave your unit turned off while the filter is removed. You should also look for the arrow marking on the outside of the filter and make a note of which way it’s pointing so you will know which way to install the new one."
        },
        {
          "headline":"Choose a filter with a MERV rating of at least 6.",
          "description":"MERV stands for Minimum Efficiency Reporting Value, which essentially means how well it’s able to filter out small particles. However, filtering more effectively also means using more energy, so a higher rating will raise your energy bill. 6 is an average rating for filters, and a good compromise between effective filtering and affordability."
        },
        {
          "headline":"Buy a filter with a higher MERV rating if you are concerned about air quality.",
          "description":"If someone in your household is allergies or asthma, or if you believe there is an unusual amount of dust or other particles in your air, you may want to opt for a filter with a MERV rating between 7 and 12. This will cost you more in energy use, but will filter more effectively. This can be a good choice for someone with a large family or several pets."
        }
      ]
    },
    {
      "name":"Installing a New Air Filter",
      "steps":[
        {
          "headline":"Locate your HVAC unit if you have central air.",
          "description":"If you have central air and heat, you’ll need to find the main unit that conditions and circulates the air. This is usually in a basement, closet, or other out-of-the-way space. Try following any visible pipes or ducts through your house until it leads you to the HVAC unit, which will be a large metal contraption."
        },
        {
          "headline":"Look for an air filter slot in your unit.",
          "description":"On a HVAC unit, this will probably be somewhere between the air handler, a large box where the air is conditioned, and the plenum, another metal box located next to the unit itself. On a window air conditioner, the filter slot should be behind the grill that faces into your house. The location of the filter slot can vary from one unit to the next, but it should look like a long, thin opening with a removable cover. If you can’t find a filter slot on your HVAC unit, try looking in the vents that blow air into your rooms. Some systems have filters in the return air vents themselves, although this is usually only true of systems with 2 or fewer vents."
        },
        {
          "headline":"Turn your unit off.",
          "description":"To avoid hurting the machinery or yourself, you’ll want the unit to be off when you change the air filter. This will also keep any dust or particles from getting into the machinery while the filter is removed."
        },
        {
          "headline":"Remove the old filter.",
          "description":"The filter should slide out easily. Be careful when removing it, as it may be covered in dirt and dust that could come loose and make a mess if handled too roughly. If the filter doesn’t come out easily, you can attach a folded tab of duct tape to the side of the new air filter to make an easy-pull handle for next time. The old filter can be thrown in the trash. You may want to carry it to the trash in a garbage bag to keep it from shedding dust and dirt on the way."
        },
        {
          "headline":"Insert the new air filter.",
          "description":"It should slide in the empty slot with little to no resistance. The filter should have an arrow on the side that indicates the direction of the airflow. Make sure this arrow points in the same direction the old filter did, which will be towards the ductwork and the unit’s blower."
        },
        {
          "headline":"Check for any gaps around the filter once it’s in.",
          "description":"If you notice any gaps or other signs that the filter does not fit correctly, remove it and put the old filter back in temporarily. You may have the wrong size of filter, in which case you should double check which kind you should have and buy a new one. It’s also possible that your new filter was somehow damaged and misshapen. Look at it closely to see if you can detect any damage, and if so, return it to the store and buy another."
        },
        {
          "headline":"Clean off any residual dust with a rag or vacuum.",
          "description":"If any dust or dirt was shaken off the old filter when it was removed, be sure to clean it up. Use a rag or vacuum to remove as much of the dust as possible."
        },
        {
          "headline":"Turn the unit on to make sure it’s still running well.",
          "description":"It should run the same as it did before, or else have slightly better air pressure. If anything sounds or smells strange, or if the system isn’t running at all, call a HVAC technician."
        },
        {
          "headline":"Make a note of when you replaced the filter.",
          "description":"This will help you keep track of how often you’re changing the filter, and ensure that you remember when it’s due for a check. Make a note with your phone or computer, or write it down somewhere that will be easy to keep track of."
        }
      ]
    }
  ],
  "text":" Monitoring Your Air Filter Check your unit’s filter every month when it’s in frequent use. If you’re using your air unit on a daily basis -- running your air conditioner in the summer, for instance -- you should check the unit’s filter once a month. This way you will be able to see if the filter is dirty and needs changing. If you don’t use your air unit frequently, you may still want to check your filter once a month if your household includes pets, smokers, or a large amount of people. Change your filter once a month if it is not pleated. If your unit’s filter is non-pleated (has a smooth surface instead of a ridged one), it has less surface area to filter out particles and will become dirty and ineffective sooner. You may prefer non-pleated filters as they often have lower energy costs, but be prepared to change them more often. Install a new filter at least every 3 months when it’s in frequent use. Even if your filter doesn’t look particularly dirty, it should be changed at least every 3 months when it’s being used regularly. Air conditioners should have new filters every 3 months in the summer, and the same goes for furnace filters in the winter. Change your filter anytime it looks dirty, damp or moldy. No matter when you changed it last, you should always get a new filter if your current one appears dirty or damp, or if it seems to be growing mold. If you hold your air filter up to a light, you should be able to see through it easily. If not, it should be changed immediately. Choosing the Right Air Filter Ask your HVAC installer what filter to use. If you are around when your HVAC unit is installed, ask the technician what kind of filter it takes and how to install it. If you have a window unit, you may be able to talk to a representative from the store or company that supplied it and find out which filter to buy. Look for a label on your unit that says which filter will fit. Many air units have labels somewhere on the exterior that will say which kind of filter to buy. Check any visible parts of your unit for a label. Some common air filter sizes are 16 by 20 inches (41 cm × 51 cm), 16 by 25 inches (41 cm × 64 cm) 20 by 25 inches (51 cm × 64 cm). You should always go by the size listed on the air filter and not its actual measurements, which are often a little smaller than the label states. Take a picture of your current filter to the store. The best way to ensure that you get the right filter is to match it with the one already in use. Take out the current filter and see if it has a label or number. Take a picture of any information written on the filter and of the filter itself to help you match it in the store. You can also take the old filter itself to the store, but make sure you leave your unit turned off while the filter is removed. You should also look for the arrow marking on the outside of the filter and make a note of which way it’s pointing so you will know which way to install the new one. Choose a filter with a MERV rating of at least 6. MERV stands for Minimum Efficiency Reporting Value, which essentially means how well it’s able to filter out small particles. However, filtering more effectively also means using more energy, so a higher rating will raise your energy bill. 6 is an average rating for filters, and a good compromise between effective filtering and affordability. Buy a filter with a higher MERV rating if you are concerned about air quality. If someone in your household is allergies or asthma, or if you believe there is an unusual amount of dust or other particles in your air, you may want to opt for a filter with a MERV rating between 7 and 12. This will cost you more in energy use, but will filter more effectively. This can be a good choice for someone with a large family or several pets. Installing a New Air Filter Locate your HVAC unit if you have central air. If you have central air and heat, you’ll need to find the main unit that conditions and circulates the air. This is usually in a basement, closet, or other out-of-the-way space. Try following any visible pipes or ducts through your house until it leads you to the HVAC unit, which will be a large metal contraption. Look for an air filter slot in your unit. On a HVAC unit, this will probably be somewhere between the air handler, a large box where the air is conditioned, and the plenum, another metal box located next to the unit itself. On a window air conditioner, the filter slot should be behind the grill that faces into your house. The location of the filter slot can vary from one unit to the next, but it should look like a long, thin opening with a removable cover. If you can’t find a filter slot on your HVAC unit, try looking in the vents that blow air into your rooms. Some systems have filters in the return air vents themselves, although this is usually only true of systems with 2 or fewer vents. Turn your unit off. To avoid hurting the machinery or yourself, you’ll want the unit to be off when you change the air filter. This will also keep any dust or particles from getting into the machinery while the filter is removed. Remove the old filter. The filter should slide out easily. Be careful when removing it, as it may be covered in dirt and dust that could come loose and make a mess if handled too roughly. If the filter doesn’t come out easily, you can attach a folded tab of duct tape to the side of the new air filter to make an easy-pull handle for next time. The old filter can be thrown in the trash. You may want to carry it to the trash in a garbage bag to keep it from shedding dust and dirt on the way. Insert the new air filter. It should slide in the empty slot with little to no resistance. The filter should have an arrow on the side that indicates the direction of the airflow. Make sure this arrow points in the same direction the old filter did, which will be towards the ductwork and the unit’s blower. Check for any gaps around the filter once it’s in. If you notice any gaps or other signs that the filter does not fit correctly, remove it and put the old filter back in temporarily. You may have the wrong size of filter, in which case you should double check which kind you should have and buy a new one. It’s also possible that your new filter was somehow damaged and misshapen. Look at it closely to see if you can detect any damage, and if so, return it to the store and buy another. Clean off any residual dust with a rag or vacuum. If any dust or dirt was shaken off the old filter when it was removed, be sure to clean it up. Use a rag or vacuum to remove as much of the dust as possible. Turn the unit on to make sure it’s still running well. It should run the same as it did before, or else have slightly better air pressure. If anything sounds or smells strange, or if the system isn’t running at all, call a HVAC technician. Make a note of when you replaced the filter. This will help you keep track of how often you’re changing the filter, and ensure that you remember when it’s due for a check. Make a note with your phone or computer, or write it down somewhere that will be easy to keep track of.",
  "tyn_model":[
    "filter",
    "air filter",
    "hvac unit",
    "filters",
    "air unit",
    "air conditioner",
    "× 64",
    "vacuum",
    "air conditioners",
    "furnace",
    "air units",
    "× 51",
    "air",
    "air handler",
    "duct tape",
    "blower",
    "hvac technician"
  ],
  "tyn_section":[

  ]
}