{
  "title":"How to Prune a Dappled Willow",
  "url":"https://www.wikihow.com/Prune-a-Dappled-Willow",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "parts":[
    {
      "name":"Timing Pruning Correctly",
      "steps":[
        {
          "headline":"Prune for rejuvenation in early winter.",
          "description":"You can prune a dappled willow as early as the beginning of winter, when the plant has gone dormant. You can prune it once the weather has turned cold for good in your area. You may be able to prune it as early as late November."
        },
        {
          "headline":"Prune before mid- to late spring.",
          "description":"You can wait to thin or cut back branches to the end of winter, but don't go past early spring. You want to do this type of pruning before new growth begins."
        },
        {
          "headline":"Trim the shape in late summer.",
          "description":"If you are just trimming the top of the plant and not removing more than 10 percent of the tree, you can trim in late summer. It's a good time because new growth is over and you can get a good idea of how much growth the plant has had when the leaves are still on it."
        }
      ]
    },
    {
      "name":"Using Pruning to Rejuvenate or Maintain Growth",
      "steps":[
        {
          "headline":"Thin the dappled willow for a natural form.",
          "description":"You can simply thin out branches if you want to keep the willow in a natural form. Cut select branches down to the ground every 1-2 years, and you will have a tall tree that produces an array of blooms. Use pruning shears or loppers for this purpose. Pick the tallest and oldest branches first. The oldest growth will be the widest, heaviest branches. Cut those off near the ground. Try not to even leave a stub above the ground. You can take 1 to 5 branches or about a third of the branches."
        },
        {
          "headline":"Cut off weak or diseased branches.",
          "description":"Cut back any branches that are dead, diseased, or weak-looking with bypass shears. You should also cut split or crossed branches off. Work from the top to the bottom. If the branches are larger than 0.5 inches (1.3 cm), use lopping shears."
        },
        {
          "headline":"Trim offshoots.",
          "description":"This plant tends to sucker more than most, meaning it produces offshoots near the base of the plant. Trim these offshoots at the ground 1 to 2 times a year as they appear."
        },
        {
          "headline":"Chop the plant to the ground if it has become unruly or unhealthy.",
          "description":"Sometimes, your plant has been neglected for too long or its branches have been weakened in some way, such as by a storm. In that case, it may be better to cut it back completely. Trim all branches back until they're a couple of inches off the ground, and let it grow back. After you use this technique, make sure you pay special attention to watering and fertilizing the plant."
        }
      ]
    },
    {
      "name":"Creating a Shape",
      "steps":[
        {
          "headline":"Shear off the tops of branches to reduce the height.",
          "description":"If you want to form a shape, you can cut off the tops of branches to make a shape. Cut at lateral buds and side branches. You can trim every 4 to 6 weeks if you prefer. Lateral buds are ones that grow to the side instead of up. Cut just above a healthy bud, leaving about 0.25 inches (0.64 cm) of branch above it. It's important to cut some side branches off, as after thinning the bush, some branches may become leggy. Simply pick branches that are at a 45-degree angle to main trunks and are about half the size. Trim them back close to the trunk."
        },
        {
          "headline":"Trim off branches near the bottom if you want bare trunks.",
          "description":"The trunks will branch out all the way to the ground. If you prefer a bare look near the bottom, you can trim the branches off up to your chosen height to create the look you want. Cut the branches off near the trunk with hand shears."
        },
        {
          "headline":"Use pick pruning if you have a dense hedge.",
          "description":"You can form a dense hedge with this plant, but you do need to let light into the bottom of the hedge. With this method, you cut a few little inconspicuous holes in the top of the plant to let light through to the bottom. As you're trimming for height, cut some branches down into the plant rather than right at the height you want. That way, you're creating space in the top."
        },
        {
          "headline":"Keep hedges wider at the bottom.",
          "description":"If you are creating a hedge shape, shape it so it's a bit wider at the bottom. That way, light will be able to reach the whole plant more effectively. As you prune the plant for shaping or pick pruning, curve the plant back in towards the top, creating an \"A\" shape. That creates space at the bottom for the plant to get more light."
        }
      ]
    }
  ],
  "text":" Timing Pruning Correctly Prune for rejuvenation in early winter. You can prune a dappled willow as early as the beginning of winter, when the plant has gone dormant. You can prune it once the weather has turned cold for good in your area. You may be able to prune it as early as late November. Prune before mid- to late spring. You can wait to thin or cut back branches to the end of winter, but don't go past early spring. You want to do this type of pruning before new growth begins. Trim the shape in late summer. If you are just trimming the top of the plant and not removing more than 10 percent of the tree, you can trim in late summer. It's a good time because new growth is over and you can get a good idea of how much growth the plant has had when the leaves are still on it. Using Pruning to Rejuvenate or Maintain Growth Thin the dappled willow for a natural form. You can simply thin out branches if you want to keep the willow in a natural form. Cut select branches down to the ground every 1-2 years, and you will have a tall tree that produces an array of blooms. Use pruning shears or loppers for this purpose. Pick the tallest and oldest branches first. The oldest growth will be the widest, heaviest branches. Cut those off near the ground. Try not to even leave a stub above the ground. You can take 1 to 5 branches or about a third of the branches. Cut off weak or diseased branches. Cut back any branches that are dead, diseased, or weak-looking with bypass shears. You should also cut split or crossed branches off. Work from the top to the bottom. If the branches are larger than 0.5 inches (1.3 cm), use lopping shears. Trim offshoots. This plant tends to sucker more than most, meaning it produces offshoots near the base of the plant. Trim these offshoots at the ground 1 to 2 times a year as they appear. Chop the plant to the ground if it has become unruly or unhealthy. Sometimes, your plant has been neglected for too long or its branches have been weakened in some way, such as by a storm. In that case, it may be better to cut it back completely. Trim all branches back until they're a couple of inches off the ground, and let it grow back. After you use this technique, make sure you pay special attention to watering and fertilizing the plant. Creating a Shape Shear off the tops of branches to reduce the height. If you want to form a shape, you can cut off the tops of branches to make a shape. Cut at lateral buds and side branches. You can trim every 4 to 6 weeks if you prefer. Lateral buds are ones that grow to the side instead of up. Cut just above a healthy bud, leaving about 0.25 inches (0.64 cm) of branch above it. It's important to cut some side branches off, as after thinning the bush, some branches may become leggy. Simply pick branches that are at a 45-degree angle to main trunks and are about half the size. Trim them back close to the trunk. Trim off branches near the bottom if you want bare trunks. The trunks will branch out all the way to the ground. If you prefer a bare look near the bottom, you can trim the branches off up to your chosen height to create the look you want. Cut the branches off near the trunk with hand shears. Use pick pruning if you have a dense hedge. You can form a dense hedge with this plant, but you do need to let light into the bottom of the hedge. With this method, you cut a few little inconspicuous holes in the top of the plant to let light through to the bottom. As you're trimming for height, cut some branches down into the plant rather than right at the height you want. That way, you're creating space in the top. Keep hedges wider at the bottom. If you are creating a hedge shape, shape it so it's a bit wider at the bottom. That way, light will be able to reach the whole plant more effectively. As you prune the plant for shaping or pick pruning, curve the plant back in towards the top, creating an \"A\" shape. That creates space at the bottom for the plant to get more light.",
  "tyn_model":[
    "branches",
    "prune",
    "willow",
    "pruning",
    "pruning shears",
    "loppers",
    "shears",
    "lopping shears",
    "pick pruning"
  ],
  "tyn_section":[

  ]
}