{
  "title":"How to Compare Gas and Electricity Prices",
  "url":"https://www.wikihow.com/Compare-Gas-and-Electricity-Prices",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Selecting the Rate Type",
      "steps":[
        {
          "headline":"Get a dual rate if you want to deal with only one provider.",
          "description":"Some providers will offer a dual rate, where the rate for gas and electricity are bundled together. The dual rate can then be fixed or variable, depending on the provider. This is a good option if you do not want to have to pay two different providers for each service. Most major energy companies will offer a dual rate to make paying for energy more convenient for customers."
        },
        {
          "headline":"Opt for a fixed rate if you prefer a stable, affordable price.",
          "description":"A fixed rate means the price for gas and electricity will stay the same for the duration of your contract with the energy company. If you use more energy, your cost of energy will go up. The rate per kilowatt, however, will stay the same. You will need to sign a contract with the energy company to get a fixed rate, but this may be a good option if you do not want to have to worry about the price of gas and electricity going up."
        },
        {
          "headline":"Go for a variable rate if you do not want to sign a contract.",
          "description":"Variable or standard rates will fluctuate based on the cost of energy in the marketplace. This means you may pay less for energy one month and more another month. Variable rates allow you to switch from provider to provider as you are not tied to a contract. However, you may end up paying high amounts for your energy, depending on the market price. Variable rates are a good idea if you plan to move in the near future and do not want to be tied to a contract."
        },
        {
          "headline":"Get an eco-friendly rate if you want to be environmentally conscious.",
          "description":"Some energy providers will offer energy from green sources like wind or solar power. However, green energy will cost more than energy from non-environmentally friendly sources. As part of your agreement with the provider, they must outline how they are accessing green energy sources as well as which types. They should also disclose how much money they are donating to green energy programs on your behalf."
        },
        {
          "headline":"Opt for an economy rate if you tend to use electricity and gas during the day.",
          "description":"If you are home during the day and find you use more of your energy in the daytime hours, an economy rate may be the best option. This is good for people who work away from home at night or have appliances that use a lot of energy during the day."
        }
      ]
    },
    {
      "name":"Using an Online Comparison Tool",
      "steps":[
        {
          "headline":"Search online for a comparison tool for utilities.",
          "description":"There are many different comparison tools for utilities online, such as GoCompare.com, EnergyCompare.com, and ComparetheMarket.com. Most of these tools are free to use. Some may require you to sign up for an account by providing your email address before you can use them. Many comparison tools will be country specific, providing gas and electricity providers based on the country where you are searching from on your computer. Try using 2-3 different comparison tools at a time so you get a good sense of the different rates available."
        },
        {
          "headline":"Enter in your postal code and the type of space you are looking for.",
          "description":"There should be a screen on the comparison tool asking you to put in the postal code of the space. You will also need to specify if you are looking for a residential, commercial, or industrial space, as the rates will change based on the space type. Some comparison tools may ask you for a complete address, but in most cases, a postal code is enough for the tool to do a search."
        },
        {
          "headline":"Specify you are looking for gas and electricity services.",
          "description":"The online tool will ask you to note if you are looking for gas or electricity prices so it can search for these for you. You may have to do two separate searches, one for gas and one for electricity. Some tools will allow you to search for gas and electricity rates bundled together. If you are short on time, and want to pay for both services together, you can opt for a bundled search."
        },
        {
          "headline":"Compare prices through the tool.",
          "description":"The comparison tool will then present 5-10 different providers in your area as well as their rates. The prices will be broken down by dollars per kilowatt. They will also specify the cost for a fixed or variable rate. The tool should also show how long the contract would be with the provider if you went with a fixed rate, usually 1-2 years. Notice if the provider charges a cancellation fee, as you may avoid these options if you want the freedom to cancel your contract in the future without a penalty."
        },
        {
          "headline":"Select prices based on your budget and needs.",
          "description":"Review each provider’s rate to find one you can afford and that suits your gas and electricity needs. Keep in mind different comparison tools may show different rates from the same provider, as they may not be updated. Be sure to compare prices on several different search tools to get accurate rates. The online comparison tools may not provide a breakdown of any terms and conditions or additional fees associated with the rate. You may need to contact the provider directly to learn more about these details."
        }
      ]
    },
    {
      "name":"Contacting Providers by Phone or Email",
      "steps":[
        {
          "headline":"Get contact information for top 5 energy providers in your area.",
          "description":"In most areas, there are usually 4-5 providers that are the most commonly used and the biggest in terms of coverage. Do an online search for the provider’s website and look for their contact numbers or email on their “Contact” or “About” page. Most energy providers will have a customer service line you can call or email for a prompt response, free of charge."
        },
        {
          "headline":"Contact the providers directly and ask them about their prices.",
          "description":"Call or email the energy providers to find out their rates. Discuss whether you are looking for dual rates and if you want them to be fixed or variable. Find out the details of the contracts they offer so you are aware of all the terms and conditions. You may ask questions like, “Do you offer dual rates?\" \"How much is a fixed rate for gas and electricity?\" \"How long is the contract for a fixed rate?\" \"What are the average variable rates for energy?\" \"Are there any fees associated with the fixed or variable rates?”"
        },
        {
          "headline":"Try negotiating with providers for a competitive rate.",
          "description":"Once you have reviewed the rates of several energy providers, try to ask for a comparable deal from each provider. Mention the rates of other providers and see if they would be willing to provide a competitive rate or a discounted rate. If they say “no,” go for a rate that fits your budget and needs. Only sign a contract with an energy provider if you can afford the rate offered and are not planning to move in the near future."
        }
      ]
    }
  ],
  "text":" Selecting the Rate Type Get a dual rate if you want to deal with only one provider. Some providers will offer a dual rate, where the rate for gas and electricity are bundled together. The dual rate can then be fixed or variable, depending on the provider. This is a good option if you do not want to have to pay two different providers for each service. Most major energy companies will offer a dual rate to make paying for energy more convenient for customers. Opt for a fixed rate if you prefer a stable, affordable price. A fixed rate means the price for gas and electricity will stay the same for the duration of your contract with the energy company. If you use more energy, your cost of energy will go up. The rate per kilowatt, however, will stay the same. You will need to sign a contract with the energy company to get a fixed rate, but this may be a good option if you do not want to have to worry about the price of gas and electricity going up. Go for a variable rate if you do not want to sign a contract. Variable or standard rates will fluctuate based on the cost of energy in the marketplace. This means you may pay less for energy one month and more another month. Variable rates allow you to switch from provider to provider as you are not tied to a contract. However, you may end up paying high amounts for your energy, depending on the market price. Variable rates are a good idea if you plan to move in the near future and do not want to be tied to a contract. Get an eco-friendly rate if you want to be environmentally conscious. Some energy providers will offer energy from green sources like wind or solar power. However, green energy will cost more than energy from non-environmentally friendly sources. As part of your agreement with the provider, they must outline how they are accessing green energy sources as well as which types. They should also disclose how much money they are donating to green energy programs on your behalf. Opt for an economy rate if you tend to use electricity and gas during the day. If you are home during the day and find you use more of your energy in the daytime hours, an economy rate may be the best option. This is good for people who work away from home at night or have appliances that use a lot of energy during the day. Using an Online Comparison Tool Search online for a comparison tool for utilities. There are many different comparison tools for utilities online, such as GoCompare.com, EnergyCompare.com, and ComparetheMarket.com. Most of these tools are free to use. Some may require you to sign up for an account by providing your email address before you can use them. Many comparison tools will be country specific, providing gas and electricity providers based on the country where you are searching from on your computer. Try using 2-3 different comparison tools at a time so you get a good sense of the different rates available. Enter in your postal code and the type of space you are looking for. There should be a screen on the comparison tool asking you to put in the postal code of the space. You will also need to specify if you are looking for a residential, commercial, or industrial space, as the rates will change based on the space type. Some comparison tools may ask you for a complete address, but in most cases, a postal code is enough for the tool to do a search. Specify you are looking for gas and electricity services. The online tool will ask you to note if you are looking for gas or electricity prices so it can search for these for you. You may have to do two separate searches, one for gas and one for electricity. Some tools will allow you to search for gas and electricity rates bundled together. If you are short on time, and want to pay for both services together, you can opt for a bundled search. Compare prices through the tool. The comparison tool will then present 5-10 different providers in your area as well as their rates. The prices will be broken down by dollars per kilowatt. They will also specify the cost for a fixed or variable rate. The tool should also show how long the contract would be with the provider if you went with a fixed rate, usually 1-2 years. Notice if the provider charges a cancellation fee, as you may avoid these options if you want the freedom to cancel your contract in the future without a penalty. Select prices based on your budget and needs. Review each provider’s rate to find one you can afford and that suits your gas and electricity needs. Keep in mind different comparison tools may show different rates from the same provider, as they may not be updated. Be sure to compare prices on several different search tools to get accurate rates. The online comparison tools may not provide a breakdown of any terms and conditions or additional fees associated with the rate. You may need to contact the provider directly to learn more about these details. Contacting Providers by Phone or Email Get contact information for top 5 energy providers in your area. In most areas, there are usually 4-5 providers that are the most commonly used and the biggest in terms of coverage. Do an online search for the provider’s website and look for their contact numbers or email on their “Contact” or “About” page. Most energy providers will have a customer service line you can call or email for a prompt response, free of charge. Contact the providers directly and ask them about their prices. Call or email the energy providers to find out their rates. Discuss whether you are looking for dual rates and if you want them to be fixed or variable. Find out the details of the contracts they offer so you are aware of all the terms and conditions. You may ask questions like, “Do you offer dual rates?\" \"How much is a fixed rate for gas and electricity?\" \"How long is the contract for a fixed rate?\" \"What are the average variable rates for energy?\" \"Are there any fees associated with the fixed or variable rates?” Try negotiating with providers for a competitive rate. Once you have reviewed the rates of several energy providers, try to ask for a comparable deal from each provider. Mention the rates of other providers and see if they would be willing to provide a competitive rate or a discounted rate. If they say “no,” go for a rate that fits your budget and needs. Only sign a contract with an energy provider if you can afford the rate offered and are not planning to move in the near future.",
  "tyn_model":[
    "gas",
    "electricity",
    "energy",
    "energy providers",
    "energy company",
    "utilities",
    "energy companies",
    "green energy",
    "“contact",
    "” or",
    "“about",
    "” page",
    "“do",
    "” try",
    "“no",
    "” go"
  ],
  "tyn_section":[

  ]
}