{
  "title":"How to Become a Brewmaster",
  "url":"https://www.wikihow.com/Become-a-Brewmaster",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Beer and Cider"
  ],
  "parts":[
    {
      "name":"Gaining Experience",
      "steps":[
        {
          "headline":"Find educational resources.",
          "description":"One great way to get started on the way to becoming a brewmaster is to start the learning process in you kitchen or backyard. You can find guides online for the process or get a book. Your local library probably even has a book you can use to get started. You can also visit a home brew shop in your area to learn more about the process."
        },
        {
          "headline":"Learn to brew at home.",
          "description":"Once you've researched the process, you can try your hand at brewing at home. Keep in mind, the process will include malting, milling, mashing, boiling, fermenting, conditioning, and filtering, so it's not for the faint of heart. Brewing at home also helps you learn if you like the different parts of the process. Some parts of the process smell strongly, for instance, and you may find you don't like the smell."
        },
        {
          "headline":"Gain knowledge in chemistry and biology.",
          "description":"Brewing beer relies heavily on both of these sciences, so it can help to take a few classes in these areas. You'll use microorganisms to brew your beer (yeast), which is where biology comes into play. Chemistry will help you understand the brewing process better, as well as assist you in balancing the overall flavor. You can take classes in high school or college, or you can sign up for some at your local community college. You can also look into free online courses like those from Coursera, Khan Academy, or Princeton. You'll also need at least some college mathematics to get you through a brewing course."
        },
        {
          "headline":"Network with other brewers in your area.",
          "description":"As you start to brew, it will help to meet other like-minded folks. Try attending conferences on brewing or joining local brew clubs. You can pick up tips, share ideas, and meet other people in the field."
        },
        {
          "headline":"Enter local brewing contests.",
          "description":"Once you've started developing your own brews, enter them in local contests. You'll get valuable feedback and meet other people interested in brewing who live in your area. Plus, you'll get your name out there and get an idea of how your brews measure up to other beers."
        },
        {
          "headline":"Apply for a job in a brewing pub.",
          "description":"One way to learn about brewing is to simply get a job in a brewery. Apply for an entry-level position, such as the assistant to the brew master. That way, you can learn about brewing on the job. You may need a certificate from a brewing school or a degree to get an entry-level position. It depends on the company. If you can't land a gig in a brewing pub, try a related field. You could become a bartender, review beers for a blog or the local paper, or become a beer sales representative."
        }
      ]
    },
    {
      "name":"Attending Brewing School",
      "steps":[
        {
          "headline":"Find a brewing program.",
          "description":"You can attend either a standalone program or one associated with a university. See if there's a program nearby that you can attend by checking the list at https://www.brewersassociation.org/resources/schools-organizations/. This list has most of the schools in the U.S. and a few international schools, as well."
        },
        {
          "headline":"Apply for the brewing program of your choice.",
          "description":"How you apply depends on the school or university. For instance, at a university, you'll likely need to apply through the school's admission office. In that case, you'll need things like your transcripts from high school or other colleges, references, and a personal statement, as well as a completed application form. Non-university programs will have a similar application process. You may be required to prove you've taken certain prerequisites, as well as describe the brewing experience you've had. You'll be required to fill out an application form, and you'll likely need to pay a fee. Some programs have scholarships you can apply for."
        },
        {
          "headline":"Complete your required coursework.",
          "description":"The amount of coursework you'll need to complete varies widely by program. You might do a certificate program in a couple of semesters. Other programs might be as long as 4 years, or possibly longer if you continue on to graduate work. In some cases, you may need to pass an exam at the end, though it depends on the program. In most programs, you'll be doing hands-on brewing in conjunction with what you're learning in the classroom."
        }
      ]
    },
    {
      "name":"Working up to Brewmaster",
      "steps":[
        {
          "headline":"Prepare for the demands of the job.",
          "description":"Brewing beer is not the easiest task. It's physically demanding and requires a lot of cleaning. Also, you will often be working in warm to hot conditions when brewing, due to the process of heating and brewing the beer. Make sure you are in good physical health and able to withstand periods of heat. Exercise regularly, at least 30 minutes a day most days of the week."
        },
        {
          "headline":"Get hired at a brewery.",
          "description":"If you haven't already been hired as a brewer's assistant, it's time to get that experience now. Look for positions in your area. When applying, use creative tactics to get your foot in the door. For instance, you could bring a bottle of your homebrew to the interview. You could also bring a formula for 1 of your favorite beers or format your resume like it's a beer bottle label."
        },
        {
          "headline":"Learn as much as you can about brewing on the job.",
          "description":"Once you get hired, use your time wisely. Be ready and willing to learn all about the brewing process. Ask questions, and take notes if you have trouble remembering. You want to gain as much from the brewmaster's experience as you can."
        },
        {
          "headline":"Say yes to job offers that progress your career.",
          "description":"The more experience you gain, the more likely you'll be offered jobs with more responsibility. In fact, other breweries may try to steal you away for a better position. Keep your eyes and ears open, and try to move up as you can."
        },
        {
          "headline":"Consider beginning your own brewery.",
          "description":"If you can get financial backing and a good location, beginning your own brewery is a viable option. Of course, you'll want to have the knowledge and experience you need to run your own brewery. Don't jump in before you know that you're ready to take that responsibility on."
        }
      ]
    }
  ],
  "text":" Gaining Experience Find educational resources. One great way to get started on the way to becoming a brewmaster is to start the learning process in you kitchen or backyard. You can find guides online for the process or get a book. Your local library probably even has a book you can use to get started. You can also visit a home brew shop in your area to learn more about the process. Learn to brew at home. Once you've researched the process, you can try your hand at brewing at home. Keep in mind, the process will include malting, milling, mashing, boiling, fermenting, conditioning, and filtering, so it's not for the faint of heart. Brewing at home also helps you learn if you like the different parts of the process. Some parts of the process smell strongly, for instance, and you may find you don't like the smell. Gain knowledge in chemistry and biology. Brewing beer relies heavily on both of these sciences, so it can help to take a few classes in these areas. You'll use microorganisms to brew your beer (yeast), which is where biology comes into play. Chemistry will help you understand the brewing process better, as well as assist you in balancing the overall flavor. You can take classes in high school or college, or you can sign up for some at your local community college. You can also look into free online courses like those from Coursera, Khan Academy, or Princeton. You'll also need at least some college mathematics to get you through a brewing course. Network with other brewers in your area. As you start to brew, it will help to meet other like-minded folks. Try attending conferences on brewing or joining local brew clubs. You can pick up tips, share ideas, and meet other people in the field. Enter local brewing contests. Once you've started developing your own brews, enter them in local contests. You'll get valuable feedback and meet other people interested in brewing who live in your area. Plus, you'll get your name out there and get an idea of how your brews measure up to other beers. Apply for a job in a brewing pub. One way to learn about brewing is to simply get a job in a brewery. Apply for an entry-level position, such as the assistant to the brew master. That way, you can learn about brewing on the job. You may need a certificate from a brewing school or a degree to get an entry-level position. It depends on the company. If you can't land a gig in a brewing pub, try a related field. You could become a bartender, review beers for a blog or the local paper, or become a beer sales representative. Attending Brewing School Find a brewing program. You can attend either a standalone program or one associated with a university. See if there's a program nearby that you can attend by checking the list at https://www.brewersassociation.org/resources/schools-organizations/. This list has most of the schools in the U.S. and a few international schools, as well. Apply for the brewing program of your choice. How you apply depends on the school or university. For instance, at a university, you'll likely need to apply through the school's admission office. In that case, you'll need things like your transcripts from high school or other colleges, references, and a personal statement, as well as a completed application form. Non-university programs will have a similar application process. You may be required to prove you've taken certain prerequisites, as well as describe the brewing experience you've had. You'll be required to fill out an application form, and you'll likely need to pay a fee. Some programs have scholarships you can apply for. Complete your required coursework. The amount of coursework you'll need to complete varies widely by program. You might do a certificate program in a couple of semesters. Other programs might be as long as 4 years, or possibly longer if you continue on to graduate work. In some cases, you may need to pass an exam at the end, though it depends on the program. In most programs, you'll be doing hands-on brewing in conjunction with what you're learning in the classroom. Working up to Brewmaster Prepare for the demands of the job. Brewing beer is not the easiest task. It's physically demanding and requires a lot of cleaning. Also, you will often be working in warm to hot conditions when brewing, due to the process of heating and brewing the beer. Make sure you are in good physical health and able to withstand periods of heat. Exercise regularly, at least 30 minutes a day most days of the week. Get hired at a brewery. If you haven't already been hired as a brewer's assistant, it's time to get that experience now. Look for positions in your area. When applying, use creative tactics to get your foot in the door. For instance, you could bring a bottle of your homebrew to the interview. You could also bring a formula for 1 of your favorite beers or format your resume like it's a beer bottle label. Learn as much as you can about brewing on the job. Once you get hired, use your time wisely. Be ready and willing to learn all about the brewing process. Ask questions, and take notes if you have trouble remembering. You want to gain as much from the brewmaster's experience as you can. Say yes to job offers that progress your career. The more experience you gain, the more likely you'll be offered jobs with more responsibility. In fact, other breweries may try to steal you away for a better position. Keep your eyes and ears open, and try to move up as you can. Consider beginning your own brewery. If you can get financial backing and a good location, beginning your own brewery is a viable option. Of course, you'll want to have the knowledge and experience you need to run your own brewery. Don't jump in before you know that you're ready to take that responsibility on.",
  "tyn_model":[
    "chemistry",
    "brew",
    "biology",
    "beer",
    "brewer's assistant",
    "beer bottle"
  ],
  "tyn_section":[

  ]
}