{
  "title":"How to Sell a Mattress",
  "url":"https://www.wikihow.com/Sell-a-Mattress",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "parts":[
    {
      "name":"Finding a Sale Venue",
      "steps":[
        {
          "headline":"Look up local laws regarding the sale of used mattresses.",
          "description":"Laws regarding the sale of used mattresses and bedding vary by state or municipality. In many areas, used mattresses must be sterilized using approved methods and appropriately labeled before they can be resold. While these laws mostly apply to third-party sellers, such as furniture stores and consignment shops, it is important to familiarize yourself with the law in your area before you attempt to sell a mattress. Do an online search, using terms like “legal to sell used mattress in [my state].”"
        },
        {
          "headline":"Sell your mattress to a used furniture store.",
          "description":"Do an online search for used furniture stores in your area. Call around and find out if any of the stores in your area will buy used mattresses. You may need to provide proof of the age and brand of the mattress. Most resale stores will not purchase a mattress that is too old, in poor condition, or not considered a high-quality brand. While selling your mattress to a used furniture store is a convenient option, you will probably not get the best price for your mattress this way. Resale stores buy items at a low price and sell them at a markup in order to make a profit."
        },
        {
          "headline":"Go through a consignment shop to get a better price for your mattress.",
          "description":"Some furniture stores will sell items on consignment, meaning that they will sell your item for you and take a percentage of the profit. It is in the consignment shop’s best interest to get you the best possible price for your item, so you are likely to get a much better deal this way than you would selling your mattress to a resale shop outright. Consignment is probably only an option if your mattress is of very high quality and in extremely good or “like new” condition. Call ahead to find out if the store you are interested in will take mattresses, and ask what their requirements are for age and condition."
        },
        {
          "headline":"Get the best price by selling your mattress directly.",
          "description":"Selling your mattress directly will likely net you the biggest profit, but may require a little more work on your part than other options. Use a website that specializes in selling used items, such as OfferUp, Craigslist, eBay, or the Facebook Marketplace. If you use one of these options, you will need to write a strong description of your mattress and provide good photographs. Some online sale venues may charge a listing fee or take a small percentage of the profit from your sale. Check the terms of use for each site and decide which option works best for you."
        }
      ]
    },
    {
      "name":"Setting a Good Price for Your Mattress",
      "steps":[
        {
          "headline":"Look at the original retail value of your mattress.",
          "description":"When selling a used mattress, you are likely to net a much lower price than the original retail value—even if the mattress is in new or like-new condition. People looking to buy a used mattress are hoping to get a good deal, so they will not be willing to shell out retail prices. However, determining the original retail value can provide a good starting point for figuring out the market value of your mattress. If your mattress is in new or nearly new condition, try selling it for roughly 70-80% of the original retail price. If you are unable to sell it for that much, you may need to reduce the price even further."
        },
        {
          "headline":"Compare your mattress to similar used mattresses for sale online.",
          "description":"Do some research on websites like Craigslist and eBay to get an idea of the typical price range for used mattresses like yours. Look at mattresses of roughly the same size, age, brand, and condition. This will give you a realistic idea of what you can expect to get for your mattress."
        },
        {
          "headline":"Take your mattress’s age and condition into account.",
          "description":"Age and wear will have a significant impact on the value of your mattress. If your mattress is more than a couple years old or has any obvious stains or damage, you will likely not be able to get very much for it. A mattress that has been slept on every night may also sell for less than a barely-used mattress from a guest bedroom."
        },
        {
          "headline":"Use an online furniture value calculator to get a ballpark figure.",
          "description":"Used furniture calculators can help you get a ballpark idea of how much your mattress may be worth on the resale market. These calculators take into account factors such as the condition, brand, age, and original price of your item. While you ultimately may not be able to sell your mattress for the price suggested by the calculator, these calculations can provide a helpful starting point for setting a reasonable price. Try a calculator like Bluebookfurniture.com or the Aptdeco.com furniture calculator."
        },
        {
          "headline":"Decide on a minimum price.",
          "description":"Once you have an idea of the average resale price range for mattresses like yours, decide on the minimum you are willing to accept. For example, if mattresses similar to yours sell for between $250 and $400 on eBay, set your minimum price at $250. If you are unable to sell your mattress for the price range you settled on, you may need to reassess your minimum and go lower."
        }
      ]
    },
    {
      "name":"Advertising Your Mattress",
      "steps":[
        {
          "headline":"Get some good photographs.",
          "description":"Before listing your mattress for sale online or trying to sell it to a resale shop, get some photos that clearly show its condition. Get pictures from several angles and in good lighting. Take close-up shots of any important details you wish to highlight, such as original tags or labels. Your photos should also support any claims you make about the condition of your mattress."
        },
        {
          "headline":"Be honest about the condition of your mattress.",
          "description":"While you want to present your mattress in the most favorable light, transparency is also important. Tell potential buyers about any damage to the mattress so that they will not be surprised when they inspect the item or bring it home. Give an honest description of the mattress’s age and history."
        },
        {
          "headline":"Provide as many details as you can.",
          "description":"Potential buyers will be more interested in your mattress if they know exactly what they are getting. Write up a description with plenty of details about the mattress, including:\nSize (e.g., queen or twin). Type (e.g., memory foam, pillow-top). Brand. Original sale price. Current condition. Details about how the mattress has been cleaned and maintained."
        },
        {
          "headline":"Tell potential buyers about conditions the mattress has been exposed to.",
          "description":"Buyers will want to know whether or not your mattress has been in contact with potential allergens, such as pets or cigarette smoke. If you have pets or smoke in your home, address any steps you have taken to clean and deodorize the mattress."
        }
      ]
    },
    {
      "name":"Making Sure Your Mattress is in Good Condition",
      "steps":[
        {
          "headline":"Hold on to receipts and labels.",
          "description":"To get the most value for your mattress, hang on to important information so that you can show it to potential buyers. Keep your original receipts, care instructions, and any warranty information. Receipts and warranties are useful for proving the age and original retail value of the mattress. If you no longer have your receipts or care instructions, you may be able to find pricing and care information for your type of mattress online. Check the manufacturer’s website, or the website of a retailer that sells your mattress."
        },
        {
          "headline":"Keep your mattress in good condition.",
          "description":"If you want to be able to sell a mattress you are currently using, you will need to care for it well. Use a mattress protector to seal out dirt, dust, stains, and odors. Prevent sagging by keeping your mattress properly supported on a frame or boxspring base. Carefully follow any care instructions that came with your mattress."
        },
        {
          "headline":"Clean and deodorize your mattress.",
          "description":"Before trying to sell a mattress, get it as clean as possible. Vacuum the mattress to remove dust and dirt particles, and spot-clean stains with a gentle cleanser, such as an enzyme-based cleaner. Sprinkle some baking soda on the surface of the mattress and let it sit for a few hours to absorb any lingering odors, then vacuum the mattress again. Follow the manufacturer’s cleaning instructions carefully to avoid damaging your mattress. If you can, put your mattress outside for a day or 2 and let it air out after you clean it. Fresh air and sunlight can help eliminate lingering odors. For the best results, consider having your mattress cleaned professionally. Do an online search for mattress cleaning services in your area."
        }
      ]
    }
  ],
  "text":" Finding a Sale Venue Look up local laws regarding the sale of used mattresses. Laws regarding the sale of used mattresses and bedding vary by state or municipality. In many areas, used mattresses must be sterilized using approved methods and appropriately labeled before they can be resold. While these laws mostly apply to third-party sellers, such as furniture stores and consignment shops, it is important to familiarize yourself with the law in your area before you attempt to sell a mattress. Do an online search, using terms like “legal to sell used mattress in [my state].” Sell your mattress to a used furniture store. Do an online search for used furniture stores in your area. Call around and find out if any of the stores in your area will buy used mattresses. You may need to provide proof of the age and brand of the mattress. Most resale stores will not purchase a mattress that is too old, in poor condition, or not considered a high-quality brand. While selling your mattress to a used furniture store is a convenient option, you will probably not get the best price for your mattress this way. Resale stores buy items at a low price and sell them at a markup in order to make a profit. Go through a consignment shop to get a better price for your mattress. Some furniture stores will sell items on consignment, meaning that they will sell your item for you and take a percentage of the profit. It is in the consignment shop’s best interest to get you the best possible price for your item, so you are likely to get a much better deal this way than you would selling your mattress to a resale shop outright. Consignment is probably only an option if your mattress is of very high quality and in extremely good or “like new” condition. Call ahead to find out if the store you are interested in will take mattresses, and ask what their requirements are for age and condition. Get the best price by selling your mattress directly. Selling your mattress directly will likely net you the biggest profit, but may require a little more work on your part than other options. Use a website that specializes in selling used items, such as OfferUp, Craigslist, eBay, or the Facebook Marketplace. If you use one of these options, you will need to write a strong description of your mattress and provide good photographs. Some online sale venues may charge a listing fee or take a small percentage of the profit from your sale. Check the terms of use for each site and decide which option works best for you. Setting a Good Price for Your Mattress Look at the original retail value of your mattress. When selling a used mattress, you are likely to net a much lower price than the original retail value—even if the mattress is in new or like-new condition. People looking to buy a used mattress are hoping to get a good deal, so they will not be willing to shell out retail prices. However, determining the original retail value can provide a good starting point for figuring out the market value of your mattress. If your mattress is in new or nearly new condition, try selling it for roughly 70-80% of the original retail price. If you are unable to sell it for that much, you may need to reduce the price even further. Compare your mattress to similar used mattresses for sale online. Do some research on websites like Craigslist and eBay to get an idea of the typical price range for used mattresses like yours. Look at mattresses of roughly the same size, age, brand, and condition. This will give you a realistic idea of what you can expect to get for your mattress. Take your mattress’s age and condition into account. Age and wear will have a significant impact on the value of your mattress. If your mattress is more than a couple years old or has any obvious stains or damage, you will likely not be able to get very much for it. A mattress that has been slept on every night may also sell for less than a barely-used mattress from a guest bedroom. Use an online furniture value calculator to get a ballpark figure. Used furniture calculators can help you get a ballpark idea of how much your mattress may be worth on the resale market. These calculators take into account factors such as the condition, brand, age, and original price of your item. While you ultimately may not be able to sell your mattress for the price suggested by the calculator, these calculations can provide a helpful starting point for setting a reasonable price. Try a calculator like Bluebookfurniture.com or the Aptdeco.com furniture calculator. Decide on a minimum price. Once you have an idea of the average resale price range for mattresses like yours, decide on the minimum you are willing to accept. For example, if mattresses similar to yours sell for between $250 and $400 on eBay, set your minimum price at $250. If you are unable to sell your mattress for the price range you settled on, you may need to reassess your minimum and go lower. Advertising Your Mattress Get some good photographs. Before listing your mattress for sale online or trying to sell it to a resale shop, get some photos that clearly show its condition. Get pictures from several angles and in good lighting. Take close-up shots of any important details you wish to highlight, such as original tags or labels. Your photos should also support any claims you make about the condition of your mattress. Be honest about the condition of your mattress. While you want to present your mattress in the most favorable light, transparency is also important. Tell potential buyers about any damage to the mattress so that they will not be surprised when they inspect the item or bring it home. Give an honest description of the mattress’s age and history. Provide as many details as you can. Potential buyers will be more interested in your mattress if they know exactly what they are getting. Write up a description with plenty of details about the mattress, including:\nSize (e.g., queen or twin). Type (e.g., memory foam, pillow-top). Brand. Original sale price. Current condition. Details about how the mattress has been cleaned and maintained. Tell potential buyers about conditions the mattress has been exposed to. Buyers will want to know whether or not your mattress has been in contact with potential allergens, such as pets or cigarette smoke. If you have pets or smoke in your home, address any steps you have taken to clean and deodorize the mattress. Making Sure Your Mattress is in Good Condition Hold on to receipts and labels. To get the most value for your mattress, hang on to important information so that you can show it to potential buyers. Keep your original receipts, care instructions, and any warranty information. Receipts and warranties are useful for proving the age and original retail value of the mattress. If you no longer have your receipts or care instructions, you may be able to find pricing and care information for your type of mattress online. Check the manufacturer’s website, or the website of a retailer that sells your mattress. Keep your mattress in good condition. If you want to be able to sell a mattress you are currently using, you will need to care for it well. Use a mattress protector to seal out dirt, dust, stains, and odors. Prevent sagging by keeping your mattress properly supported on a frame or boxspring base. Carefully follow any care instructions that came with your mattress. Clean and deodorize your mattress. Before trying to sell a mattress, get it as clean as possible. Vacuum the mattress to remove dust and dirt particles, and spot-clean stains with a gentle cleanser, such as an enzyme-based cleaner. Sprinkle some baking soda on the surface of the mattress and let it sit for a few hours to absorb any lingering odors, then vacuum the mattress again. Follow the manufacturer’s cleaning instructions carefully to avoid damaging your mattress. If you can, put your mattress outside for a day or 2 and let it air out after you clean it. Fresh air and sunlight can help eliminate lingering odors. For the best results, consider having your mattress cleaned professionally. Do an online search for mattress cleaning services in your area.",
  "tyn_model":[
    "mattress",
    "mattresses",
    "bedding",
    "“legal",
    "” sell",
    "used furniture",
    "used furniture store",
    "“like",
    "” condition",
    "—even",
    "calculator",
    "mattress protector",
    "enzyme-based cleaner",
    "baking soda",
    "vacuum",
    "mattress cleaning services"
  ],
  "tyn_section":[

  ]
}