{
  "title":"How to Create a Feminine Bathroom",
  "url":"https://www.wikihow.com/Create-a-Feminine-Bathroom",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "steps":[
    {
      "headline":"Get some pink, light blue or cream silky curtains to hang up at the window.",
      "description":""
    },
    {
      "headline":"Get a toilet seat in pink or cream.",
      "description":"Maybe with a sophisticated pattern."
    },
    {
      "headline":"Get an elegant bathroom mat.",
      "description":""
    },
    {
      "headline":"Get pink, light blue or cream shower curtains in the same colour as the regular curtains.",
      "description":""
    },
    {
      "headline":"Paint the walls in a rose pink colour, or use a colour that's deep but not too dark.",
      "description":""
    },
    {
      "headline":"Hang up soft, fluffy robes and put some slippers in the room.",
      "description":""
    },
    {
      "headline":"Get some white, cream or pink towels.",
      "description":"Put them on a heated rail."
    },
    {
      "headline":"Get a mirror above the sink.",
      "description":"Choose one with a white frame or in a shape like a heart. You could hang a feather boa around it."
    },
    {
      "headline":"Have a box or draw for your beauty products.",
      "description":"Fill it with scented shower gels, shampoos and conditioners."
    },
    {
      "headline":"Hang up some fairy lights round the ceiling: very relaxing if your having a bath.",
      "description":""
    },
    {
      "headline":"Finish up.",
      "description":"Add a picture to a bare looking wall and if there is spare space on shelves or dressers add decorations like scented candles, vases of fake flowers, beautiful shells or ornate perfume bottles."
    }
  ],
  "text":" Get some pink, light blue or cream silky curtains to hang up at the window.  Get a toilet seat in pink or cream. Maybe with a sophisticated pattern. Get an elegant bathroom mat.  Get pink, light blue or cream shower curtains in the same colour as the regular curtains.  Paint the walls in a rose pink colour, or use a colour that's deep but not too dark.  Hang up soft, fluffy robes and put some slippers in the room.  Get some white, cream or pink towels. Put them on a heated rail. Get a mirror above the sink. Choose one with a white frame or in a shape like a heart. You could hang a feather boa around it. Have a box or draw for your beauty products. Fill it with scented shower gels, shampoos and conditioners. Hang up some fairy lights round the ceiling: very relaxing if your having a bath.  Finish up. Add a picture to a bare looking wall and if there is spare space on shelves or dressers add decorations like scented candles, vases of fake flowers, beautiful shells or ornate perfume bottles.",
  "tyn_model":[
    "toilet seat",
    "bathroom mat",
    "shower curtains",
    "slippers",
    "towels",
    "mirror",
    "beauty products",
    "shower gels",
    "fairy lights"
  ],
  "tyn_section":[

  ]
}