{
  "title":"How to Find a Cheap Apartment",
  "url":"https://www.wikihow.com/Find-a-Cheap-Apartment",
  "category_hierarchy":[
    "Home and Garden",
    "Apartment Living"
  ],
  "methods":[
    {
      "name":"Searching for an Apartment Online",
      "steps":[
        {
          "headline":"Look for affordable apartment and roommate ads on Craigslist.",
          "description":"Check the local listings and use Craigslist’s filtering options to narrow down your search results based on distance and rent price. Craigslist is often full of affordable options and deals. To avoid getting scammed, make sure to verify the owner, never give personal information away upfront, and never wire money."
        },
        {
          "headline":"Find a cheaper option by directly comparing prices online.",
          "description":"If Craigslist isn’t your jam, don’t worry! There are countless apartment-browsing websites that make it easy to search and compare options with just a click. Compare offers from different buildings to find exactly what you're looking for at the cheapest price. These sites can offer advanced searches by square footage and pricing as well as extras like video tours, relocation service tools, and information about local price trends. For example, check out https://www.apartment.com, https://www.zillow.com, https://www.forrent.com, https://www.apartments.com, or https://www.apartmentsearch.com."
        },
        {
          "headline":"Join a low-cost housing Facebook group to find local options.",
          "description":"Many cities have dozens of local groups with affordable apartment postings going up regularly. To find a group, search your city’s name along keywords like “cheap,” “affordable,” “apartment,” “listings,” and “housing.” Request to the join the groups, and once you’re accepted, you can start putting faces to listings."
        }
      ]
    },
    {
      "name":"Looking in Lower-Cost Areas",
      "steps":[
        {
          "headline":"Look in the suburbs right outside of urban areas.",
          "description":"Living just outside a city can cut your rent down by hundreds of dollars. Check out the surrounding suburban areas and focus your search on apartments in these cheaper areas. If you work in the city, this is a great option for saving some money and keeping your commute time reasonable."
        },
        {
          "headline":"Consider moving to a city with cheaper apartment options.",
          "description":"If your living situation is flexible and you’re really looking to get the best deal, think about changing your living situation. Highly populated cities like New York City and San Francisco generally have much higher rent because of the high demand. Instead, look for cities like Memphis, Tulsa, Indianapolis, and Louisville, which have record-low apartment rent."
        },
        {
          "headline":"Look for an apartment with a smaller square footage.",
          "description":"Even if it’s not your dream home, a lower square footage will mean a lower monthly rate. During your search, check out apartment buildings with smaller rental options, such as 400-600 square feet."
        },
        {
          "headline":"Choose an apartment that’s further away from public transportation.",
          "description":"Apartments that are positioned conveniently near public transportation often cost more, so if you don’t need the extra convenience, go for an apartment that’s further away. This option can really help cut down on your rent price if you work from home, have a car, or don’t mind a longer commute."
        }
      ]
    },
    {
      "name":"Reducing Rent",
      "steps":[
        {
          "headline":"Find a roommate to split the rent with.",
          "description":"Post that you’re looking for a roommate on your social media as well as popular websites like Craigslist or Spare Room. In addition, ask family and friends if they know anyone who needs a roommate. Having a personal connection can help you verify the potential roommate and also acts as a character reference. In your post or ad, include some basic information about what kind of roommate you’re looking for and invite people to contact you for more information. You can also mention that you’re “on a budget” if you don’t want to say your exact price point."
        },
        {
          "headline":"Negotiate the rent down if possible.",
          "description":"If you’re not in a highly populated area with little renter turnaround, most landlords are open to negotiation. Set up a meeting with the landlord and be polite, respectful, and professional. Show them that you are an ideal tenant and make an offer for rent. If they accept your offer, that’s great! Make sure to get everything in writing and you’re good to go. If they turn you down, it’s okay to walk away. Keep looking for a great bargain!"
        },
        {
          "headline":"Look at older buildings to find a rent-controlled apartment.",
          "description":"Rent-controlled units protects tenants from unexpected rent increases or landlord retaliation in disputes. Search online specifically for apartment buildings built between 1947 and 1974, then call to make sure they’re rent-controlled. You can also enter an advanced search for rent-controlled or rent-stabilized apartments on the website https://streeteasy.com. In cities with an abundance of old buildings, such as San Francisco or New York, you have a great chance of finding a rent-controlled unit."
        },
        {
          "headline":"Stay flexible when searching and keep your standards at a minimum.",
          "description":"It’s exciting to dream about your ideal apartment, complete with shiny appliances and amenities, but in order to find a bargain, you may have to settle a little. Keep your standards simple and look for a place that may be less exciting but will give you a great deal. When searching, start with basic criteria like no maintenance problems, insect infestations, or safety problems."
        }
      ]
    }
  ],
  "text":" Searching for an Apartment Online Look for affordable apartment and roommate ads on Craigslist. Check the local listings and use Craigslist’s filtering options to narrow down your search results based on distance and rent price. Craigslist is often full of affordable options and deals. To avoid getting scammed, make sure to verify the owner, never give personal information away upfront, and never wire money. Find a cheaper option by directly comparing prices online. If Craigslist isn’t your jam, don’t worry! There are countless apartment-browsing websites that make it easy to search and compare options with just a click. Compare offers from different buildings to find exactly what you're looking for at the cheapest price. These sites can offer advanced searches by square footage and pricing as well as extras like video tours, relocation service tools, and information about local price trends. For example, check out https://www.apartment.com, https://www.zillow.com, https://www.forrent.com, https://www.apartments.com, or https://www.apartmentsearch.com. Join a low-cost housing Facebook group to find local options. Many cities have dozens of local groups with affordable apartment postings going up regularly. To find a group, search your city’s name along keywords like “cheap,” “affordable,” “apartment,” “listings,” and “housing.” Request to the join the groups, and once you’re accepted, you can start putting faces to listings. Looking in Lower-Cost Areas Look in the suburbs right outside of urban areas. Living just outside a city can cut your rent down by hundreds of dollars. Check out the surrounding suburban areas and focus your search on apartments in these cheaper areas. If you work in the city, this is a great option for saving some money and keeping your commute time reasonable. Consider moving to a city with cheaper apartment options. If your living situation is flexible and you’re really looking to get the best deal, think about changing your living situation. Highly populated cities like New York City and San Francisco generally have much higher rent because of the high demand. Instead, look for cities like Memphis, Tulsa, Indianapolis, and Louisville, which have record-low apartment rent. Look for an apartment with a smaller square footage. Even if it’s not your dream home, a lower square footage will mean a lower monthly rate. During your search, check out apartment buildings with smaller rental options, such as 400-600 square feet. Choose an apartment that’s further away from public transportation. Apartments that are positioned conveniently near public transportation often cost more, so if you don’t need the extra convenience, go for an apartment that’s further away. This option can really help cut down on your rent price if you work from home, have a car, or don’t mind a longer commute. Reducing Rent Find a roommate to split the rent with. Post that you’re looking for a roommate on your social media as well as popular websites like Craigslist or Spare Room. In addition, ask family and friends if they know anyone who needs a roommate. Having a personal connection can help you verify the potential roommate and also acts as a character reference. In your post or ad, include some basic information about what kind of roommate you’re looking for and invite people to contact you for more information. You can also mention that you’re “on a budget” if you don’t want to say your exact price point. Negotiate the rent down if possible. If you’re not in a highly populated area with little renter turnaround, most landlords are open to negotiation. Set up a meeting with the landlord and be polite, respectful, and professional. Show them that you are an ideal tenant and make an offer for rent. If they accept your offer, that’s great! Make sure to get everything in writing and you’re good to go. If they turn you down, it’s okay to walk away. Keep looking for a great bargain! Look at older buildings to find a rent-controlled apartment. Rent-controlled units protects tenants from unexpected rent increases or landlord retaliation in disputes. Search online specifically for apartment buildings built between 1947 and 1974, then call to make sure they’re rent-controlled. You can also enter an advanced search for rent-controlled or rent-stabilized apartments on the website https://streeteasy.com. In cities with an abundance of old buildings, such as San Francisco or New York, you have a great chance of finding a rent-controlled unit. Stay flexible when searching and keep your standards at a minimum. It’s exciting to dream about your ideal apartment, complete with shiny appliances and amenities, but in order to find a bargain, you may have to settle a little. Keep your standards simple and look for a place that may be less exciting but will give you a great deal. When searching, start with basic criteria like no maintenance problems, insect infestations, or safety problems.",
  "tyn_model":[
    "craigslist",
    "” “",
    "“cheap",
    "” and",
    "“housing",
    "” request",
    "apartment buildings",
    "“on",
    "” if",
    "rent-controlled apartment"
  ],
  "tyn_section":[

  ]
}