{
  "title":"How to Make Pierogies",
  "url":"https://www.wikihow.com/Make-Pierogies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks"
  ],
  "parts":[
    {
      "name":"Making the Dough",
      "steps":[
        {
          "headline":"Sift together the flour and salt.",
          "description":"Position a fine-mesh strainer over a large mixing bowl. Pour the flour and salt into the strainer, and tap the strainer against the side of your hand to sift the dry ingredients into the bowl below. Sifting the dry ingredients will remove lumps and work air into the flour, making for a softer dough."
        },
        {
          "headline":"Whisk in the boiling water.",
          "description":"Boil the water in a kettle or in a saucepan on the stove. When the water is boiling, pour it into the flour mixture. Vigorously whisk or stir the mixture with a wooden spoon. Keep stirring to bring the mixture together as a crumbly dough, and use a fork to break down any lumps that form."
        },
        {
          "headline":"Rest the dough before adding the cold water.",
          "description":"Cover the bowl with a clean tea towel. Set the dough aside for five minutes to give it time to rest. Then, remove the towel and add the cold water. Stir the dough with a wooden spoon to fully incorporate the water. When you're making pierogi dough, you can replace up to 75 percent of the water with milk. This is common when making sweet pierogi, because the milk makes the dough slightly sweeter and more delicate."
        },
        {
          "headline":"Rest the dough again.",
          "description":"Once all the water has been incorporated into the dough, cover the bowl with the clean tea towel again. Set the dough aside and let it rest for about 15 minutes. This will give the gluten time to relax, and ensure the dough isn't rubbery or tough."
        },
        {
          "headline":"Knead in the oil.",
          "description":"Turn the dough out onto a clean, flat surface. Drizzle the oil over the dough and knead the oil into the dough with your hands. Continue kneading for five to 10 minutes, until the oil is fully incorporated and the dough is a smooth, uniform ball. You can use softened butter in place of the oil."
        },
        {
          "headline":"Rest the dough for another 10 minutes.",
          "description":"Cover the dough one last time with the tea towel. Set it aside to rest for at least 10 minutes, but you can leave the dough for longer as you prepare the filling."
        }
      ]
    },
    {
      "name":"Making Savory Filling",
      "steps":[
        {
          "headline":"Wash and peel the potatoes.",
          "description":"Wash the potatoes under running water, and scrub the skin with a vegetable brush. Transfer the washed potatoes to a clean tea towel and pat them dry. Use a knife or vegetable peeler to remove the skins."
        },
        {
          "headline":"Chop the potatoes into bite-sized pieces.",
          "description":"Place the potatoes onto a cutting board. Use a sharp knife to carefully cut each potato into 1-inch (2.5-cm) cubes. This will ensure uniform cooking, and cut down on the time they need to boil."
        },
        {
          "headline":"Boil the potatoes until tender.",
          "description":"Fill a medium saucepan with water. Put on the lid and bring the water to a boil over medium-high heat. When the water is boiling, add the potato chunks. Return the water to a boil and reduce the heat to medium. Cover the pan and cook the potatoes until tender, about 10 minutes."
        },
        {
          "headline":"Dry the potatoes.",
          "description":"When the potatoes are cooked through and tender, remove them from the heat. Drain the potatoes in a colander, and then return them to the hot saucepan. Heat the potatoes over low heat for about two minutes, stirring constantly, to dry out the potatoes and release the steam. Drying the potatoes in this way will ensure the filling isn't soggy or overly wet."
        },
        {
          "headline":"Mash the potatoes with the remaining ingredients.",
          "description":"Add the cheese, salt, pepper, and nutmeg to the saucepan with the potatoes. Use a fork, potato masher, or hand mixer to mash the potatoes and combine all the ingredients. You can use any cheese you like in this recipe, including white cheddar, yellow cheddar, cottage cheese, or even cream cheese. Sharp cheeses like cheddar will give the pierogi a tangy and cheesy flavor."
        }
      ]
    },
    {
      "name":"Making Sweet Strawberry Filling",
      "steps":[
        {
          "headline":"Wash the berries.",
          "description":"Transfer the strawberries to a strainer. Rinse them under running water, and use your fingers to gently scrub the berries to remove any dirt or residue that's on the berries. You can substitute blueberries or bilberries for some or all of the strawberries in this recipe."
        },
        {
          "headline":"Remove the stems and chop the berries.",
          "description":"Transfer the strawberries to a clean towel. Use a small knife to carefully cut the stem from each berry. Cut the berries into lengthwise quarters, and then dice each quarter into quarter-inch (6-mm) chunks. If you're using blueberries or bilberries, cut them into halves or quarters."
        },
        {
          "headline":"Toss the berries with the sugar.",
          "description":"Transfer the diced strawberries to a medium mixing bowl. Sprinkle the sugar over the berries and stir the mixture with a spoon to completely coat the berries with the sugar. Taste the berries, and add another tablespoon (14 g) of sugar, to taste, if desired."
        },
        {
          "headline":"Let the berries soak in the sugar.",
          "description":"Set the berries aside and let the juices dissolve the sugar for 30 minutes. As the berries sit in the sugar, they will release their juices and become soft and delicious."
        }
      ]
    },
    {
      "name":"Stuffing the Pierogi",
      "steps":[
        {
          "headline":"Roll out the dough.",
          "description":"When the dough has had time to relax and the filling is ready, turn the dough out onto a lightly floured surface. Cut the dough in half. Use a heavy rolling pin to roll each dough ball into a circle that's one-eight-inch (3-mm) thick. You need the dough to be thin enough that you can work with it easily, but not so thin that it will tear. You can also use a pasta maker to roll out the dough."
        },
        {
          "headline":"Cut the dough into circles.",
          "description":"Use the rim of a drinking glass, a round cookie cutter, or a pierogi cutter to cut out as many circles from the dough as you can. Collect the circles of dough and set them aside on a plate. Then, collect the dough scraps and form them into a single ball. Roll out the extra dough into a round sheet again and cut out more pierogi."
        },
        {
          "headline":"Add filling to each circle of dough.",
          "description":"Take a teaspoon of your sweet or savory filling and place it directly in the center of the dough circle. Do not add too much filling, or the pierogi will burst when it cooks. Repeat with all of your pierogi until all the dough has been stuffed or all the filling is gone. Leftover filling can be stored in an airtight container in the refrigerator or freezer."
        },
        {
          "headline":"Fold the pierogi in half and seal them shut.",
          "description":"Use a pastry brush or your finger to brush a drop of water around the edge of the dough circle. Fold the pierogi in half around the filling to form semicircles. Use your fingers to delicately press out all the air from the middle of the pierogi, and then press the edges together to seal the pierogi. Repeat until all the pierogi have been sealed. To ensure the pierogi are properly sealed, press the edges with a fork. You can also make these with a special pierogi maker that will cut the dough and fold and seal the pierogi."
        }
      ]
    },
    {
      "name":"Cooking the Pierogi",
      "steps":[
        {
          "headline":"Boil the water.",
          "description":"Fill a large saucepan with water. Add a pinch of salt for flavor and a teaspoon of oil to prevent the pierogi from sticking together. Cover the pan and bring the water to a boil over medium-high heat."
        },
        {
          "headline":"Boil the pierogi for a few minutes.",
          "description":"When the water is boiling, carefully drop about 15 pierogi into the water. Watch carefully, as the pierogi will start to float. Once they start to float, cook the pierogi for an additional three minutes. The pierogi are ready when the dough becomes soft. You can cook the pierogi in batches if they don't all fit in the saucepan at once."
        },
        {
          "headline":"Remove the pierogi from the water with a slotted spoon.",
          "description":"When the dough is soft and the pierogi are cooked, remove them from the water in batches using a slotted spoon. Transfer the pierogi to a large plate to dry off. Bring the water back to a boil and cook any remaining pierogi if necessary."
        },
        {
          "headline":"Fry savory pierogi in butter.",
          "description":"You can fry savory pierogi in a frying pan with some butter or oil if you want them to have an added crunch. Drop a tablespoon (14 g) of butter into a frying pan and heat it over medium heat. When the butter has melted, add the pierogi and cook them for three to four minutes on each side, until crispy and slightly browned. Don't fry sweet pierogi, as they will likely burst. Savory pierogi are ready to eat as soon as they're boiled, so the frying is an optional step."
        },
        {
          "headline":"Garnish the pierogi before serving.",
          "description":"Boiled sweet pierogi and boiled or fried savory pierogi are ready to eat and taste best when they're still hot. You can eat the pierogi plain, or you can garnish them with your favorite toppings, such as:\nIce cream, yogurt, brown sugar, or fruit for sweet pierogi\nSour cream, fried onions, and cooked bacon for savory pierogi\nButter for sweet or savory pierogi"
        }
      ]
    }
  ],
  "text":" Making the Dough Sift together the flour and salt. Position a fine-mesh strainer over a large mixing bowl. Pour the flour and salt into the strainer, and tap the strainer against the side of your hand to sift the dry ingredients into the bowl below. Sifting the dry ingredients will remove lumps and work air into the flour, making for a softer dough. Whisk in the boiling water. Boil the water in a kettle or in a saucepan on the stove. When the water is boiling, pour it into the flour mixture. Vigorously whisk or stir the mixture with a wooden spoon. Keep stirring to bring the mixture together as a crumbly dough, and use a fork to break down any lumps that form. Rest the dough before adding the cold water. Cover the bowl with a clean tea towel. Set the dough aside for five minutes to give it time to rest. Then, remove the towel and add the cold water. Stir the dough with a wooden spoon to fully incorporate the water. When you're making pierogi dough, you can replace up to 75 percent of the water with milk. This is common when making sweet pierogi, because the milk makes the dough slightly sweeter and more delicate. Rest the dough again. Once all the water has been incorporated into the dough, cover the bowl with the clean tea towel again. Set the dough aside and let it rest for about 15 minutes. This will give the gluten time to relax, and ensure the dough isn't rubbery or tough. Knead in the oil. Turn the dough out onto a clean, flat surface. Drizzle the oil over the dough and knead the oil into the dough with your hands. Continue kneading for five to 10 minutes, until the oil is fully incorporated and the dough is a smooth, uniform ball. You can use softened butter in place of the oil. Rest the dough for another 10 minutes. Cover the dough one last time with the tea towel. Set it aside to rest for at least 10 minutes, but you can leave the dough for longer as you prepare the filling. Making Savory Filling Wash and peel the potatoes. Wash the potatoes under running water, and scrub the skin with a vegetable brush. Transfer the washed potatoes to a clean tea towel and pat them dry. Use a knife or vegetable peeler to remove the skins. Chop the potatoes into bite-sized pieces. Place the potatoes onto a cutting board. Use a sharp knife to carefully cut each potato into 1-inch (2.5-cm) cubes. This will ensure uniform cooking, and cut down on the time they need to boil. Boil the potatoes until tender. Fill a medium saucepan with water. Put on the lid and bring the water to a boil over medium-high heat. When the water is boiling, add the potato chunks. Return the water to a boil and reduce the heat to medium. Cover the pan and cook the potatoes until tender, about 10 minutes. Dry the potatoes. When the potatoes are cooked through and tender, remove them from the heat. Drain the potatoes in a colander, and then return them to the hot saucepan. Heat the potatoes over low heat for about two minutes, stirring constantly, to dry out the potatoes and release the steam. Drying the potatoes in this way will ensure the filling isn't soggy or overly wet. Mash the potatoes with the remaining ingredients. Add the cheese, salt, pepper, and nutmeg to the saucepan with the potatoes. Use a fork, potato masher, or hand mixer to mash the potatoes and combine all the ingredients. You can use any cheese you like in this recipe, including white cheddar, yellow cheddar, cottage cheese, or even cream cheese. Sharp cheeses like cheddar will give the pierogi a tangy and cheesy flavor. Making Sweet Strawberry Filling Wash the berries. Transfer the strawberries to a strainer. Rinse them under running water, and use your fingers to gently scrub the berries to remove any dirt or residue that's on the berries. You can substitute blueberries or bilberries for some or all of the strawberries in this recipe. Remove the stems and chop the berries. Transfer the strawberries to a clean towel. Use a small knife to carefully cut the stem from each berry. Cut the berries into lengthwise quarters, and then dice each quarter into quarter-inch (6-mm) chunks. If you're using blueberries or bilberries, cut them into halves or quarters. Toss the berries with the sugar. Transfer the diced strawberries to a medium mixing bowl. Sprinkle the sugar over the berries and stir the mixture with a spoon to completely coat the berries with the sugar. Taste the berries, and add another tablespoon (14 g) of sugar, to taste, if desired. Let the berries soak in the sugar. Set the berries aside and let the juices dissolve the sugar for 30 minutes. As the berries sit in the sugar, they will release their juices and become soft and delicious. Stuffing the Pierogi Roll out the dough. When the dough has had time to relax and the filling is ready, turn the dough out onto a lightly floured surface. Cut the dough in half. Use a heavy rolling pin to roll each dough ball into a circle that's one-eight-inch (3-mm) thick. You need the dough to be thin enough that you can work with it easily, but not so thin that it will tear. You can also use a pasta maker to roll out the dough. Cut the dough into circles. Use the rim of a drinking glass, a round cookie cutter, or a pierogi cutter to cut out as many circles from the dough as you can. Collect the circles of dough and set them aside on a plate. Then, collect the dough scraps and form them into a single ball. Roll out the extra dough into a round sheet again and cut out more pierogi. Add filling to each circle of dough. Take a teaspoon of your sweet or savory filling and place it directly in the center of the dough circle. Do not add too much filling, or the pierogi will burst when it cooks. Repeat with all of your pierogi until all the dough has been stuffed or all the filling is gone. Leftover filling can be stored in an airtight container in the refrigerator or freezer. Fold the pierogi in half and seal them shut. Use a pastry brush or your finger to brush a drop of water around the edge of the dough circle. Fold the pierogi in half around the filling to form semicircles. Use your fingers to delicately press out all the air from the middle of the pierogi, and then press the edges together to seal the pierogi. Repeat until all the pierogi have been sealed. To ensure the pierogi are properly sealed, press the edges with a fork. You can also make these with a special pierogi maker that will cut the dough and fold and seal the pierogi. Cooking the Pierogi Boil the water. Fill a large saucepan with water. Add a pinch of salt for flavor and a teaspoon of oil to prevent the pierogi from sticking together. Cover the pan and bring the water to a boil over medium-high heat. Boil the pierogi for a few minutes. When the water is boiling, carefully drop about 15 pierogi into the water. Watch carefully, as the pierogi will start to float. Once they start to float, cook the pierogi for an additional three minutes. The pierogi are ready when the dough becomes soft. You can cook the pierogi in batches if they don't all fit in the saucepan at once. Remove the pierogi from the water with a slotted spoon. When the dough is soft and the pierogi are cooked, remove them from the water in batches using a slotted spoon. Transfer the pierogi to a large plate to dry off. Bring the water back to a boil and cook any remaining pierogi if necessary. Fry savory pierogi in butter. You can fry savory pierogi in a frying pan with some butter or oil if you want them to have an added crunch. Drop a tablespoon (14 g) of butter into a frying pan and heat it over medium heat. When the butter has melted, add the pierogi and cook them for three to four minutes on each side, until crispy and slightly browned. Don't fry sweet pierogi, as they will likely burst. Savory pierogi are ready to eat as soon as they're boiled, so the frying is an optional step. Garnish the pierogi before serving. Boiled sweet pierogi and boiled or fried savory pierogi are ready to eat and taste best when they're still hot. You can eat the pierogi plain, or you can garnish them with your favorite toppings, such as:\nIce cream, yogurt, brown sugar, or fruit for sweet pierogi\nSour cream, fried onions, and cooked bacon for savory pierogi\nButter for sweet or savory pierogi",
  "tyn_model":[
    "water",
    "potatoes",
    "sugar",
    "pierogi",
    "oil",
    "butter",
    "berries",
    "flour",
    "salt",
    "tea towel",
    "strawberries",
    "strainer",
    "bowl",
    "saucepan",
    "fork",
    "wooden spoon",
    "milk",
    "blueberries",
    "slotted spoon",
    "frying pan",
    "fine-mesh strainer",
    "large mixing bowl",
    "kettle",
    "cold water",
    "vegetable brush",
    "knife",
    "vegetable peeler",
    "cutting board",
    "medium saucepan",
    "potato",
    "pan",
    "colander",
    "hot saucepan",
    "cheese",
    "pepper",
    "potato masher",
    "hand mixer",
    "white cheddar",
    "yellow cheddar,",
    "cottage cheese",
    "cream cheese",
    "bilberries",
    "small knife",
    "medium mixing bowl",
    "spoon",
    "pasta maker",
    "drinking glass",
    "cookie cutter",
    "pierogi cutter",
    "plate",
    "airtight container",
    "pastry brush",
    "pierogi maker",
    "large saucepan",
    "large plate",
    "ice cream",
    "yogurt",
    "brown sugar",
    "fruit",
    "sour cream",
    "fried onions",
    "cooked bacon"
  ],
  "tyn_section":[

  ]
}