{
  "title":"How to Clean a Black Stove Top",
  "url":"https://www.wikihow.com/Clean-a-Black-Stove-Top",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning"
  ],
  "methods":[
    {
      "name":"Using a Vinegar Solution",
      "steps":[
        {
          "headline":"Take off any removable burner elements and soak them in hot water.",
          "description":"Fill up your sink with hot, soapy water and put any removable burner caps or grates in it to soak while you work on the stove top. This will help remove any crusted food or grease from the burner elements, and also make it easier to clean the stove around your burners. When you’re done cleaning your stove, scrub the burner elements with a scouring pad and rinse them off before putting them back on the stove. If your burners aren’t removable or have electric components, don’t soak them. Instead, lay a warm, wet cloth over the coils, being careful not to get the electric parts wet, and wipe them down with a paper towel instead of rinsing them."
        },
        {
          "headline":"Clear off any loose debris with a paper towel.",
          "description":"Wipe off anything that isn’t stuck to the surface of your stove and throw it away. You can also use a sponge for this, but a paper towel is often more effective since you can pick loose pieces up with it."
        },
        {
          "headline":"Spray the stove top with a 1:1 solution of vinegar and water.",
          "description":"Fill a household spray bottle with 1 part water and 1 part distilled white vinegar. Spray the entire surface of the stove, adding a couple of extra sprays over any particularly tough stains. If you do not like the scent of vinegar, replace it with an equal amount of lemon juice, or add a few drops of an essential oil to your vinegar and water mixture."
        },
        {
          "headline":"Let the solution soak in for 1-3 minutes.",
          "description":"The vinegar should cut through the grease and loosen any crusted-on food. Let it sit for at least 1 minute, or more if your stove top is very greasy or dirty."
        },
        {
          "headline":"Wipe the stove surface with a wet, soapy sponge.",
          "description":"Run a dish sponge under warm water and add a few drops of dish soap. Run the wet sponge over the surface of the stove and wipe up any grease or debris. You can also use the rough side of the sponge on stains, but be careful to scrub gently. Never use steel wool when scrubbing your black stove top, as it may scratch the surface."
        },
        {
          "headline":"Clean up the soapy water with another wet sponge.",
          "description":"Take a separate sponge and run it under warm water with no soap. Use this sponge to mop up the soapy water and any remaining grease or crumbs. You may need to squeeze the sponge out and rinse it a few times during the process to get the surface totally clean."
        },
        {
          "headline":"Dry the stove top with a microfiber cloth.",
          "description":"To avoid creating streaks on your black stove top, use a microfiber cloth to dry and buff the surface of your stove once it’s clean. This will keep water or soap residue from drying in visible patterns."
        }
      ]
    },
    {
      "name":"Cleaning with Baking Soda",
      "steps":[
        {
          "headline":"Put your burner caps and grates in hot water to soak.",
          "description":"If your burner elements soak while you work on the stove top, they will be easier to clean. Scrub the burner caps and grates with a scouring pad and rinse them off before putting them back on your clean stove. Some burners are not removable, or may have electrical components in them that shouldn’t get wet. If this is the case, lay a warm, wet cloth over the burners instead of soaking them, and wipe them down with a paper towel after scrubbing."
        },
        {
          "headline":"Wipe the stove off with a dry paper towel.",
          "description":"This will remove any loose grease or debris that is not attached to the stove top. Gather up any crumbs with the paper towel and throw them away."
        },
        {
          "headline":"Sprinkle baking soda over the entire stove top.",
          "description":"Use your hands or simply shake the box over the stove until the entire surface is covered in at least a light layer of baking soda. You can sprinkle a little extra on any particularly greasy or crusty areas."
        },
        {
          "headline":"Cover the stove with warm soapy towels for 15 minutes.",
          "description":"The steam will help loosen up any crusted-on food and help the baking soda cut through the grease. Take a couple of kitchen towels and run them under warm water with a little bit of dish soap. Squeeze them until they are not dripping heavily, and lay them over the entire surface of the stove."
        },
        {
          "headline":"Use the soapy towels to wipe up the baking soda.",
          "description":"After 15 minutes, begin to sweep the towels around the surface of the stove in an S pattern. This should gather up the baking soda as well as any loosened crust or crumbs. Use the towels to pick up the debris and throw it in the trash."
        },
        {
          "headline":"Wipe the stove down with a wet rag or sponge.",
          "description":"Clean off any remaining baking soda or mess with a wet, non-soapy rag or sponge. If the rag becomes too dirty, rinse it off and squeeze it out before wiping again."
        },
        {
          "headline":"Buff the surface of the stove with a microfiber cloth.",
          "description":"Black stove tops tend to show streaks after cleaning, so it’s important to dry the surface as soon as possible. Microfiber cloths are ideal for creating a smooth finish without visible streaks."
        }
      ]
    },
    {
      "name":"Getting Rid of Tough Stains",
      "steps":[
        {
          "headline":"Remove crusted food with a wooden or plastic scraper.",
          "description":"Using steel wool or a metal scraper can scratch and dent stove tops, which is particularly obvious on black surfaces. Use a wooden or plastic scraper or spatula to remove crusted-on stains without damaging the stove. Hold the scraper at about a 45° angle, with the bottom of the scraper angled in the direction you are scraping."
        },
        {
          "headline":"Apply a baking soda and vinegar solution.",
          "description":"Make a paste of baking soda and distilled white vinegar and apply this to any problem areas. The paste should be roughly 4 parts baking soda to 1 part vinegar, but add more vinegar if necessary to make it wet enough to stick together. Let it sit for 1-2 minutes, then gently scrub the stain with a scouring pad. It should be loosened and come off easily. If you don’t have any vinegar on hand, you can substitute the same amount of hydrogen peroxide."
        },
        {
          "headline":"Scrub stains with a stove top scouring pad.",
          "description":"It’s best to avoid generic scouring pads, as they can be overly abrasive and make visible scratches in black stove tops. Instead, look for scouring pads designed specifically for stove tops, which will typically say “stove top” or “stove cleaner” in the label."
        },
        {
          "headline":"Use a stove top cleaning fluid.",
          "description":"Several home product brands carry cleaning fluids formulated especially for cleaning stove tops. If you have particularly tough stains on your stove, avoid harsh chemical cleaners and look for a product that is designed for stove tops."
        }
      ]
    }
  ],
  "text":" Using a Vinegar Solution Take off any removable burner elements and soak them in hot water. Fill up your sink with hot, soapy water and put any removable burner caps or grates in it to soak while you work on the stove top. This will help remove any crusted food or grease from the burner elements, and also make it easier to clean the stove around your burners. When you’re done cleaning your stove, scrub the burner elements with a scouring pad and rinse them off before putting them back on the stove. If your burners aren’t removable or have electric components, don’t soak them. Instead, lay a warm, wet cloth over the coils, being careful not to get the electric parts wet, and wipe them down with a paper towel instead of rinsing them. Clear off any loose debris with a paper towel. Wipe off anything that isn’t stuck to the surface of your stove and throw it away. You can also use a sponge for this, but a paper towel is often more effective since you can pick loose pieces up with it. Spray the stove top with a 1:1 solution of vinegar and water. Fill a household spray bottle with 1 part water and 1 part distilled white vinegar. Spray the entire surface of the stove, adding a couple of extra sprays over any particularly tough stains. If you do not like the scent of vinegar, replace it with an equal amount of lemon juice, or add a few drops of an essential oil to your vinegar and water mixture. Let the solution soak in for 1-3 minutes. The vinegar should cut through the grease and loosen any crusted-on food. Let it sit for at least 1 minute, or more if your stove top is very greasy or dirty. Wipe the stove surface with a wet, soapy sponge. Run a dish sponge under warm water and add a few drops of dish soap. Run the wet sponge over the surface of the stove and wipe up any grease or debris. You can also use the rough side of the sponge on stains, but be careful to scrub gently. Never use steel wool when scrubbing your black stove top, as it may scratch the surface. Clean up the soapy water with another wet sponge. Take a separate sponge and run it under warm water with no soap. Use this sponge to mop up the soapy water and any remaining grease or crumbs. You may need to squeeze the sponge out and rinse it a few times during the process to get the surface totally clean. Dry the stove top with a microfiber cloth. To avoid creating streaks on your black stove top, use a microfiber cloth to dry and buff the surface of your stove once it’s clean. This will keep water or soap residue from drying in visible patterns. Cleaning with Baking Soda Put your burner caps and grates in hot water to soak. If your burner elements soak while you work on the stove top, they will be easier to clean. Scrub the burner caps and grates with a scouring pad and rinse them off before putting them back on your clean stove. Some burners are not removable, or may have electrical components in them that shouldn’t get wet. If this is the case, lay a warm, wet cloth over the burners instead of soaking them, and wipe them down with a paper towel after scrubbing. Wipe the stove off with a dry paper towel. This will remove any loose grease or debris that is not attached to the stove top. Gather up any crumbs with the paper towel and throw them away. Sprinkle baking soda over the entire stove top. Use your hands or simply shake the box over the stove until the entire surface is covered in at least a light layer of baking soda. You can sprinkle a little extra on any particularly greasy or crusty areas. Cover the stove with warm soapy towels for 15 minutes. The steam will help loosen up any crusted-on food and help the baking soda cut through the grease. Take a couple of kitchen towels and run them under warm water with a little bit of dish soap. Squeeze them until they are not dripping heavily, and lay them over the entire surface of the stove. Use the soapy towels to wipe up the baking soda. After 15 minutes, begin to sweep the towels around the surface of the stove in an S pattern. This should gather up the baking soda as well as any loosened crust or crumbs. Use the towels to pick up the debris and throw it in the trash. Wipe the stove down with a wet rag or sponge. Clean off any remaining baking soda or mess with a wet, non-soapy rag or sponge. If the rag becomes too dirty, rinse it off and squeeze it out before wiping again. Buff the surface of the stove with a microfiber cloth. Black stove tops tend to show streaks after cleaning, so it’s important to dry the surface as soon as possible. Microfiber cloths are ideal for creating a smooth finish without visible streaks. Getting Rid of Tough Stains Remove crusted food with a wooden or plastic scraper. Using steel wool or a metal scraper can scratch and dent stove tops, which is particularly obvious on black surfaces. Use a wooden or plastic scraper or spatula to remove crusted-on stains without damaging the stove. Hold the scraper at about a 45° angle, with the bottom of the scraper angled in the direction you are scraping. Apply a baking soda and vinegar solution. Make a paste of baking soda and distilled white vinegar and apply this to any problem areas. The paste should be roughly 4 parts baking soda to 1 part vinegar, but add more vinegar if necessary to make it wet enough to stick together. Let it sit for 1-2 minutes, then gently scrub the stain with a scouring pad. It should be loosened and come off easily. If you don’t have any vinegar on hand, you can substitute the same amount of hydrogen peroxide. Scrub stains with a stove top scouring pad. It’s best to avoid generic scouring pads, as they can be overly abrasive and make visible scratches in black stove tops. Instead, look for scouring pads designed specifically for stove tops, which will typically say “stove top” or “stove cleaner” in the label. Use a stove top cleaning fluid. Several home product brands carry cleaning fluids formulated especially for cleaning stove tops. If you have particularly tough stains on your stove, avoid harsh chemical cleaners and look for a product that is designed for stove tops.",
  "tyn_model":[
    "water",
    "baking soda",
    "sponge",
    "vinegar",
    "stove",
    "paper towel",
    "scouring pad",
    "microfiber cloth",
    "distilled white vinegar",
    "dish soap",
    "burner",
    "towels",
    "wooden or plastic scraper",
    "scraper",
    "scouring pads",
    "“stove",
    "spray bottle",
    "lemon juice",
    "essential oil",
    "wet, soapy sponge",
    "dish sponge",
    "soapy towels",
    "kitchen towels",
    "microfiber cloths",
    "metal scraper",
    "spatula",
    "hydrogen peroxide",
    "stove top scouring pad",
    "” or",
    "” in",
    "stove top cleaning fluid",
    "home product brands",
    "cleaning fluids"
  ],
  "tyn_section":[

  ]
}