{
  "title":"How to Compare Handwriting Samples",
  "url":"https://www.wikihow.com/Compare-Handwriting-Samples",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Text and Lettering"
  ],
  "parts":[
    {
      "name":"Obtaining Suitable Samples",
      "steps":[
        {
          "headline":"Ask for samples if you're comparing handwriting for fun.",
          "description":"If you just want to practice comparing handwriting, ask friends or family members to write samples. Have a few people write 2 or 3 notes each, and ask them to mix the notes up before giving them to you. Then see if you can tell which notes were written by the same person. You could also ask each person for a sample that you know they wrote and try to match the notes to the right person."
        },
        {
          "headline":"Consult an attorney if you need to compare samples for a legal matter.",
          "description":"If your issue is much more serious, a judge can order someone to provide handwriting samples for comparison. An attorney can help you figure out your options and recommend a professional forensic analyst."
        },
        {
          "headline":"Compare original documents instead of photocopies.",
          "description":"The devil is in the details! Whenever possible, examine original documents, which reveal more detail than photocopies. Line weight, subtle retouches, and other tiny details might not be visible in copied samples. Typically, you’ll compare a known sample with a questioned sample. A known sample is a document that you’re reasonably sure a writer composed. A questioned sample may or may not have been composed by that writer. If original samples aren’t available, you can still form conclusions based on letter shape, stylistic idiosyncrasies, arrangement, and other qualities visible in copied documents."
        },
        {
          "headline":"Obtain both requested and collected known samples, if possible.",
          "description":"Requested documents are samples someone prepares and submits for comparison. Collected samples, such as letters and signed forms, are documents that someone created without knowing they’d be used in a handwriting comparison. Both have advantages and disadvantages, so use both whenever possible. You’ll know beyond doubt that someone composed a requested document if you watch them write it. However, since they know it’ll be used for comparison, they might try to disguise their handwriting. A collected document is less likely to be disguised, but you can’t be absolutely certain that the writer actually composed it."
        },
        {
          "headline":"Compare questioned samples with similar examples.",
          "description":"Choose known documents that fit the same category as your questioned sample. For example, if you're trying to find out if someone wrote a full letter written with cursive, compare it with a letter you know that person wrote. You'll have an easier time comparing 2 similar documents, and your results will be more reliable."
        },
        {
          "headline":"Use known samples prepared around the same time as questioned samples.",
          "description":"Handwriting changes over time due to a variety of factors. If your questioned sample is dated, try to compare it with collected samples written around that date. Requested documents are best if the unknown sample was composed recently. Obtaining similarly dated samples is especially important when comparing samples written by children and the elderly. Handwriting changes as children mature and can deteriorate with advanced age or illness."
        },
        {
          "headline":"Obtain 20 to 30 repetitions if you’re comparing signature samples.",
          "description":"People don't sign their signature the same exact way every time. If you have enough samples, you can get a feel for someone's natural variations and spot characteristics consistent throughout their signatures. A precisely reproduced signature is a red flag for forgery."
        }
      ]
    },
    {
      "name":"Examining the Samples",
      "steps":[
        {
          "headline":"Evaluate formal qualities, such as letters’ shape, curves, and angles.",
          "description":"Begin by looking closely at each document, and note the particular ways each sample’s writer forms letters. Examine stroke direction and legibility, letter size, and whether loops are rounded or angled. For example, check to see if the writer makes an “M” with 2 upward arches or with a pointed squiggle. See if they make an “8” with 2 individual circles or with 1 continuous stroke."
        },
        {
          "headline":"Examine each sample’s line weight and quality.",
          "description":"See if lettering is heavy, as if the writer placed more pressure on the pen or pencil as they wrote. Is line weight consistent throughout a document, or are there places where lines are bold and others where lines are thin? Additionally, figure out if line weights fade due to the pen running out of ink. Look for spots where ink might have thinned that the author traced over to form clear lettering."
        },
        {
          "headline":"Inspect letters’ arrangement, height, and relation to the baseline.",
          "description":"Look for quirks such as capital letters that sit below their baseline or veer into the above baseline. Check for forward or backward slants, bunched or loose groupings, and other formatting quirks. The baseline is the lower ruled or imaginary line on which all of the letters sit."
        },
        {
          "headline":"Notice stylistic traits, such as capitalization and embellishment.",
          "description":"For example, a writer might always use a capital “N,” but otherwise uses capital lowercase letters appropriately. In a journal entry written in cursive, you might find exaggerated strokes at the end of each word, or dramatic loops throughout the sample. Alternatively, perhaps a cursive writer uses closed, angled marks for letters like “b,” “f,” and “p” instead of rounded, open loops."
        },
        {
          "headline":"Look for retouching, hesitations, and other signs of unnatural writing.",
          "description":"Quivering lines, touch-ups, and other strange marks could indicate the writer was trying to disguise their handwriting or mimic someone else’s style. Keep in mind unsure marks are a red flag, but aren’t absolute proof of forgery. Wavering lines, for instance, could be due to the writer being cold or anxious."
        },
        {
          "headline":"Check for repeated spelling and grammar mistakes.",
          "description":"While formal and stylistic characteristics are the most concrete forms of evidence, you can also glean information from a sample’s content. Shared turns of phrase and repeated spelling and grammatical errors can indicate that 2 documents share an author. However, the marks themselves are more important than content. Plenty of people spell the same words wrong or use the same slang. However, all handwriting is unique, so the marks themselves provide stronger evidence of a sample’s authorship."
        }
      ]
    },
    {
      "name":"Forming a Conclusion",
      "steps":[
        {
          "headline":"Spot forged, precisely identical signatures.",
          "description":"If you’re comparing signatures, the easiest way to spot a forgery is to check for tracing or simulation. If 2 signatures are exactly the same, and you know 1 is authentic, it’s almost certain that the other is a forgery. Identical signatures are the most obvious example of forgery. Natural signatures always have slight variation."
        },
        {
          "headline":"Find characteristics that prove the samples share a writer.",
          "description":"After examining your samples, you should have a list of individual characteristics for each document or signature. Compare your notes and look for subtle consistencies that prove 2 documents share an author. For example, you might find that there are inconsistencies in slant, letter size, and spacing between letters in 2 samples. However, despite these differences, “m” is always written as 2 upward arches, “I” always sits below its baseline, capital “R” is always used instead of lowercase “r,” and cursive “s” always has a rounded top. If you don’t see signs of tracing or mimicry, these characteristics are good evidence that the documents share an author."
        },
        {
          "headline":"Decide if the samples do not share individual characteristics.",
          "description":"Keep in mind there are always variations between handwriting samples written by the same person. However, if you find 1 document or signature includes at least 1 repeated trait not present in the other sample, you can reasonably conclude the documents do not share an author. For instance, suppose the writer of 1 document always represents an “m” with a quick, natural squiggle stroke with 2 points, but the other document features only rounded arches. This would outweigh any similarities between the 2 samples."
        }
      ]
    }
  ],
  "text":" Obtaining Suitable Samples Ask for samples if you're comparing handwriting for fun. If you just want to practice comparing handwriting, ask friends or family members to write samples. Have a few people write 2 or 3 notes each, and ask them to mix the notes up before giving them to you. Then see if you can tell which notes were written by the same person. You could also ask each person for a sample that you know they wrote and try to match the notes to the right person. Consult an attorney if you need to compare samples for a legal matter. If your issue is much more serious, a judge can order someone to provide handwriting samples for comparison. An attorney can help you figure out your options and recommend a professional forensic analyst. Compare original documents instead of photocopies. The devil is in the details! Whenever possible, examine original documents, which reveal more detail than photocopies. Line weight, subtle retouches, and other tiny details might not be visible in copied samples. Typically, you’ll compare a known sample with a questioned sample. A known sample is a document that you’re reasonably sure a writer composed. A questioned sample may or may not have been composed by that writer. If original samples aren’t available, you can still form conclusions based on letter shape, stylistic idiosyncrasies, arrangement, and other qualities visible in copied documents. Obtain both requested and collected known samples, if possible. Requested documents are samples someone prepares and submits for comparison. Collected samples, such as letters and signed forms, are documents that someone created without knowing they’d be used in a handwriting comparison. Both have advantages and disadvantages, so use both whenever possible. You’ll know beyond doubt that someone composed a requested document if you watch them write it. However, since they know it’ll be used for comparison, they might try to disguise their handwriting. A collected document is less likely to be disguised, but you can’t be absolutely certain that the writer actually composed it. Compare questioned samples with similar examples. Choose known documents that fit the same category as your questioned sample. For example, if you're trying to find out if someone wrote a full letter written with cursive, compare it with a letter you know that person wrote. You'll have an easier time comparing 2 similar documents, and your results will be more reliable. Use known samples prepared around the same time as questioned samples. Handwriting changes over time due to a variety of factors. If your questioned sample is dated, try to compare it with collected samples written around that date. Requested documents are best if the unknown sample was composed recently. Obtaining similarly dated samples is especially important when comparing samples written by children and the elderly. Handwriting changes as children mature and can deteriorate with advanced age or illness. Obtain 20 to 30 repetitions if you’re comparing signature samples. People don't sign their signature the same exact way every time. If you have enough samples, you can get a feel for someone's natural variations and spot characteristics consistent throughout their signatures. A precisely reproduced signature is a red flag for forgery. Examining the Samples Evaluate formal qualities, such as letters’ shape, curves, and angles. Begin by looking closely at each document, and note the particular ways each sample’s writer forms letters. Examine stroke direction and legibility, letter size, and whether loops are rounded or angled. For example, check to see if the writer makes an “M” with 2 upward arches or with a pointed squiggle. See if they make an “8” with 2 individual circles or with 1 continuous stroke. Examine each sample’s line weight and quality. See if lettering is heavy, as if the writer placed more pressure on the pen or pencil as they wrote. Is line weight consistent throughout a document, or are there places where lines are bold and others where lines are thin? Additionally, figure out if line weights fade due to the pen running out of ink. Look for spots where ink might have thinned that the author traced over to form clear lettering. Inspect letters’ arrangement, height, and relation to the baseline. Look for quirks such as capital letters that sit below their baseline or veer into the above baseline. Check for forward or backward slants, bunched or loose groupings, and other formatting quirks. The baseline is the lower ruled or imaginary line on which all of the letters sit. Notice stylistic traits, such as capitalization and embellishment. For example, a writer might always use a capital “N,” but otherwise uses capital lowercase letters appropriately. In a journal entry written in cursive, you might find exaggerated strokes at the end of each word, or dramatic loops throughout the sample. Alternatively, perhaps a cursive writer uses closed, angled marks for letters like “b,” “f,” and “p” instead of rounded, open loops. Look for retouching, hesitations, and other signs of unnatural writing. Quivering lines, touch-ups, and other strange marks could indicate the writer was trying to disguise their handwriting or mimic someone else’s style. Keep in mind unsure marks are a red flag, but aren’t absolute proof of forgery. Wavering lines, for instance, could be due to the writer being cold or anxious. Check for repeated spelling and grammar mistakes. While formal and stylistic characteristics are the most concrete forms of evidence, you can also glean information from a sample’s content. Shared turns of phrase and repeated spelling and grammatical errors can indicate that 2 documents share an author. However, the marks themselves are more important than content. Plenty of people spell the same words wrong or use the same slang. However, all handwriting is unique, so the marks themselves provide stronger evidence of a sample’s authorship. Forming a Conclusion Spot forged, precisely identical signatures. If you’re comparing signatures, the easiest way to spot a forgery is to check for tracing or simulation. If 2 signatures are exactly the same, and you know 1 is authentic, it’s almost certain that the other is a forgery. Identical signatures are the most obvious example of forgery. Natural signatures always have slight variation. Find characteristics that prove the samples share a writer. After examining your samples, you should have a list of individual characteristics for each document or signature. Compare your notes and look for subtle consistencies that prove 2 documents share an author. For example, you might find that there are inconsistencies in slant, letter size, and spacing between letters in 2 samples. However, despite these differences, “m” is always written as 2 upward arches, “I” always sits below its baseline, capital “R” is always used instead of lowercase “r,” and cursive “s” always has a rounded top. If you don’t see signs of tracing or mimicry, these characteristics are good evidence that the documents share an author. Decide if the samples do not share individual characteristics. Keep in mind there are always variations between handwriting samples written by the same person. However, if you find 1 document or signature includes at least 1 repeated trait not present in the other sample, you can reasonably conclude the documents do not share an author. For instance, suppose the writer of 1 document always represents an “m” with a quick, natural squiggle stroke with 2 points, but the other document features only rounded arches. This would outweigh any similarities between the 2 samples.",
  "tyn_model":[
    "documents",
    "“m",
    "” with",
    "pen",
    "ink",
    "” and",
    "” is",
    "” always",
    "“r",
    "’ shape",
    "“8",
    "pencil",
    "’ arrangement",
    "“n",
    "” but",
    "“b",
    "” “",
    "“p",
    "” instead",
    "“i",
    "“s"
  ],
  "tyn_section":[

  ]
}