{
  "title":"How to Adjust Settings in set.a.light 3D Studio",
  "url":"https://www.wikihow.com/Adjust-Settings-in-set.a.light-3D-Studio",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "steps":[
    {
      "headline":"Download and install set.a.light.",
      "description":"You can do this, whatever the version."
    },
    {
      "headline":"Once you have started the program, go to the Settings option in the bar at the top of the screen.",
      "description":""
    },
    {
      "headline":"Change the language.",
      "description":"At this time, there are only 4 languages to choose from."
    },
    {
      "headline":"Change the standard of measurement.",
      "description":"Your options are Metric and Imperial. Be aware that whatever you have, you might need to switch, so it's a good idea to become familiar with the process. Imperial will have the option of having the grid by yards."
    },
    {
      "headline":"Decide whether you want the laser pointer on.",
      "description":"That can be very helpful, for knowing exactly where your light is aimed. It's a good idea to leave it on."
    },
    {
      "headline":"Go into your Quality Settings.",
      "description":"Your options here will be largely determined by your computer's processing power."
    }
  ],
  "text":" Download and install set.a.light. You can do this, whatever the version. Once you have started the program, go to the Settings option in the bar at the top of the screen.  Change the language. At this time, there are only 4 languages to choose from. Change the standard of measurement. Your options are Metric and Imperial. Be aware that whatever you have, you might need to switch, so it's a good idea to become familiar with the process. Imperial will have the option of having the grid by yards. Decide whether you want the laser pointer on. That can be very helpful, for knowing exactly where your light is aimed. It's a good idea to leave it on. Go into your Quality Settings. Your options here will be largely determined by your computer's processing power.",
  "tyn_model":[
    "laser"
  ],
  "tyn_section":[

  ]
}