{
  "title":"How to Replace a Fence Post in Concrete",
  "url":"https://www.wikihow.com/Replace-a-Fence-Post-in-Concrete",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Fences and Gates"
  ],
  "parts":[
    {
      "name":"Removing the Original Post",
      "steps":[
        {
          "headline":"Disconnect the post from any fence panels or wires.",
          "description":"To gain access to the specific post you want to remove, you’ll first need to detach any fasteners securing the post to a wood fence panel or wire mesh. These fasteners may include:\nNails placed through a wood post into a wood panel. Screws connecting the post to the fence via a detachable panel. Tension bands holding wire mesh to the post."
        },
        {
          "headline":"Dig a hole around 1 side of the fence post.",
          "description":"With a shovel, break into the ground surrounding the fence post’s concrete base. Keep digging until you create a half-circle gap between the ground and concrete. If possible, dig a hole that is as deep as the concrete itself, giving the post as much wiggle room as possible. Creating a semi-circular hole will be more than enough for most posts. However, if your pole refuses to budge, try digging out the rest."
        },
        {
          "headline":"Rock the post back and forth to break up the surrounding ground.",
          "description":"Your pole will resist at first, but should eventually start to move. Keep wiggling the post until you can move it back and forth with ease, indicating that the ground has lost its hold on the concrete base."
        },
        {
          "headline":"Lift loose posts up by hand.",
          "description":"Some posts, especially those that were not installed particularly well, can be easily removed by hand. Simply grip the base of the pole and lift up with your legs, pulling it out of the ground. Concrete is incredibly heavy, so make sure to grab a friend or 2 for help."
        },
        {
          "headline":"Use a jack to remove your post if it’s stuck.",
          "description":"Place a thick block or brick next to your post and set a high lift jack on top of it. Then, wrap 1 end of a thick chain around the base of your post and connect the other end of the chain to the jack. When you’re ready, pump the jack slowly. The additional force will help pull the post out of the ground. If the jack doesn’t provide enough support, try connecting the chain to something even larger like a power lift."
        },
        {
          "headline":"Clear the hole of any post and concrete remains.",
          "description":"To prepare the hole for your replacement post, pull out any remaining wood splinters, concrete slivers, and other unwanted items. If necessary, run the head of a shovel along the inside edge of the hole, pulling out any excess debris and smoothing everything over."
        }
      ]
    },
    {
      "name":"Placing a New Post",
      "steps":[
        {
          "headline":"Coat the bottom of wood posts with copper naphthenate.",
          "description":"Due to their potential for rot, wood posts need a bit more care before placing them in the ground. Specifically, you’ll need to cover the bottom of your post in a copper naphthenate solution like Cuprinol. Copper naphthenate mixtures act as in-ground preservatives, protecting the wood from decay and damage. Look for copper naphthenate solutions at home improvement and paint stores. You can apply the solution by brushing it onto the post or dipping the post into a tub filled with the liquid."
        },
        {
          "headline":"Fill the bottom of the hole with aggregate.",
          "description":"Construction aggregate is a coarse material made from sand, crushed stone, rock, and similar items. To hold your post steady, you’ll need to pour in enough of this material so that, when the post is fully inserted, the very bottom is covered by 2 in (5.1 cm) of aggregate or more. Your aggregate should provide a sizeable cushion between the bottom of the hole and the base of your pole, so pour in a liberal amount. Aggregate helps water drain more quickly, preventing mildew and rot."
        },
        {
          "headline":"Place your post inside the hole.",
          "description":"Set 1 end of your pole inside the hole, pushing down until it enters the aggregate mix. Then, if you’re lining the post up with a pre-existing fence, check to make sure that your pole sits at the same height as the other posts. If possible, pull your fence panels up to the post to make sure they fit together nicely. If the pole won’t stand up on its own, ask a friend to hold it or place small stakes around the base."
        },
        {
          "headline":"Check the post’s vertical orientation with a bubble level.",
          "description":"To avoid any issues with alignment, check to make sure that your post is perfectly straight. You can do this by placing a vertical bubble level flush against the side of the pole. If the bubble does not sit inside the device’s level markers, adjust the pole until it does."
        },
        {
          "headline":"Fill the hole with concrete.",
          "description":"Purchase a ready-to-use personal concrete mix from a hardware store, then prepare it according to the manufacturer’s instructions. Once it’s ready, pour the concrete solution into the hole, making sure to fill it up evenly. Keep pouring until the concrete reaches just above the top of the hole. Wear protective eyewear, working gloves, and long-sleeved clothes to keep your eyes and skin safe from the concrete. If you get concrete on your skin, scrub it off and run the area under clean water for a minimum of 20 minutes. If necessary, prevent burning by adding vinegar or citrus to the water. If you get concrete on your clothes, remove them immediately and rinse them in clean water."
        },
        {
          "headline":"Slope the concrete away from the post using a trowel.",
          "description":"Before the concrete dries, scrape the top of the mixture with a trowel to make it smooth. Then, continue scraping the mixture until it slopes away from the post, ensuring the area drains properly."
        },
        {
          "headline":"Let the concrete dry for at least 4 hours.",
          "description":"Most ready-to-use concrete mixtures will need at least 4 hours to set, though this time can vary based on the specific brand. To see if your concrete is dry, poke it with a small wooden rod."
        },
        {
          "headline":"Seal the base of the post with caulk.",
          "description":"Once the concrete is completely dry, place a line of silicone or acrylic latex caulk around the area where the base of the post meets the concrete. During colder periods of the year, this caulk will prevent the concrete from opening up and creating a gap."
        },
        {
          "headline":"Connect the post to any fence panels or wires.",
          "description":"Check that the post is set and stable, then attach it to any pre-existing fence panels or wires using the same types of fasteners you removed earlier."
        }
      ]
    }
  ],
  "text":" Removing the Original Post Disconnect the post from any fence panels or wires. To gain access to the specific post you want to remove, you’ll first need to detach any fasteners securing the post to a wood fence panel or wire mesh. These fasteners may include:\nNails placed through a wood post into a wood panel. Screws connecting the post to the fence via a detachable panel. Tension bands holding wire mesh to the post. Dig a hole around 1 side of the fence post. With a shovel, break into the ground surrounding the fence post’s concrete base. Keep digging until you create a half-circle gap between the ground and concrete. If possible, dig a hole that is as deep as the concrete itself, giving the post as much wiggle room as possible. Creating a semi-circular hole will be more than enough for most posts. However, if your pole refuses to budge, try digging out the rest. Rock the post back and forth to break up the surrounding ground. Your pole will resist at first, but should eventually start to move. Keep wiggling the post until you can move it back and forth with ease, indicating that the ground has lost its hold on the concrete base. Lift loose posts up by hand. Some posts, especially those that were not installed particularly well, can be easily removed by hand. Simply grip the base of the pole and lift up with your legs, pulling it out of the ground. Concrete is incredibly heavy, so make sure to grab a friend or 2 for help. Use a jack to remove your post if it’s stuck. Place a thick block or brick next to your post and set a high lift jack on top of it. Then, wrap 1 end of a thick chain around the base of your post and connect the other end of the chain to the jack. When you’re ready, pump the jack slowly. The additional force will help pull the post out of the ground. If the jack doesn’t provide enough support, try connecting the chain to something even larger like a power lift. Clear the hole of any post and concrete remains. To prepare the hole for your replacement post, pull out any remaining wood splinters, concrete slivers, and other unwanted items. If necessary, run the head of a shovel along the inside edge of the hole, pulling out any excess debris and smoothing everything over. Placing a New Post Coat the bottom of wood posts with copper naphthenate. Due to their potential for rot, wood posts need a bit more care before placing them in the ground. Specifically, you’ll need to cover the bottom of your post in a copper naphthenate solution like Cuprinol. Copper naphthenate mixtures act as in-ground preservatives, protecting the wood from decay and damage. Look for copper naphthenate solutions at home improvement and paint stores. You can apply the solution by brushing it onto the post or dipping the post into a tub filled with the liquid. Fill the bottom of the hole with aggregate. Construction aggregate is a coarse material made from sand, crushed stone, rock, and similar items. To hold your post steady, you’ll need to pour in enough of this material so that, when the post is fully inserted, the very bottom is covered by 2 in (5.1 cm) of aggregate or more. Your aggregate should provide a sizeable cushion between the bottom of the hole and the base of your pole, so pour in a liberal amount. Aggregate helps water drain more quickly, preventing mildew and rot. Place your post inside the hole. Set 1 end of your pole inside the hole, pushing down until it enters the aggregate mix. Then, if you’re lining the post up with a pre-existing fence, check to make sure that your pole sits at the same height as the other posts. If possible, pull your fence panels up to the post to make sure they fit together nicely. If the pole won’t stand up on its own, ask a friend to hold it or place small stakes around the base. Check the post’s vertical orientation with a bubble level. To avoid any issues with alignment, check to make sure that your post is perfectly straight. You can do this by placing a vertical bubble level flush against the side of the pole. If the bubble does not sit inside the device’s level markers, adjust the pole until it does. Fill the hole with concrete. Purchase a ready-to-use personal concrete mix from a hardware store, then prepare it according to the manufacturer’s instructions. Once it’s ready, pour the concrete solution into the hole, making sure to fill it up evenly. Keep pouring until the concrete reaches just above the top of the hole. Wear protective eyewear, working gloves, and long-sleeved clothes to keep your eyes and skin safe from the concrete. If you get concrete on your skin, scrub it off and run the area under clean water for a minimum of 20 minutes. If necessary, prevent burning by adding vinegar or citrus to the water. If you get concrete on your clothes, remove them immediately and rinse them in clean water. Slope the concrete away from the post using a trowel. Before the concrete dries, scrape the top of the mixture with a trowel to make it smooth. Then, continue scraping the mixture until it slopes away from the post, ensuring the area drains properly. Let the concrete dry for at least 4 hours. Most ready-to-use concrete mixtures will need at least 4 hours to set, though this time can vary based on the specific brand. To see if your concrete is dry, poke it with a small wooden rod. Seal the base of the post with caulk. Once the concrete is completely dry, place a line of silicone or acrylic latex caulk around the area where the base of the post meets the concrete. During colder periods of the year, this caulk will prevent the concrete from opening up and creating a gap. Connect the post to any fence panels or wires. Check that the post is set and stable, then attach it to any pre-existing fence panels or wires using the same types of fasteners you removed earlier.",
  "tyn_model":[
    "concrete",
    "aggregate",
    "water",
    "pole",
    "jack",
    "wire mesh",
    "shovel",
    "bubble level",
    "trowel",
    "caulk",
    "brick",
    "high lift jack",
    "copper naphthenate",
    "copper naphthenate solution",
    "cuprinol",
    "copper naphthenate mixtures",
    "copper naphthenate solutions",
    "home improvement and paint",
    "construction aggregate",
    "fence panels",
    "stakes",
    "level markers",
    "personal concrete",
    "working gloves",
    "vinegar",
    "citrus",
    "wooden rod",
    "acrylic latex caulk"
  ],
  "tyn_section":[

  ]
}