{
  "title":"How to Photograph Nails",
  "url":"https://www.wikihow.com/Photograph-Nails",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Genres",
    "People and Portrait Photography"
  ],
  "parts":[
    {
      "name":"Setting Up the Space",
      "steps":[
        {
          "headline":"Clean the hands and nails before taking the picture.",
          "description":"If dirty hands are in the picture, the dirt is going to be the main focus instead of the nails. Use a clean cloth to clear away any dust or dirt on the nails. If you have dirt on your hands, rinse them with soap and water before drying them."
        },
        {
          "headline":"Apply lotion to hands that look dry.",
          "description":"To avoid taking pictures of dry hands that will take away from the focus of the nails, use a soothing lotion to moisturize the hands. Apply the lotion a few minutes before taking the photograph so that the lotion has some time to soak into the hands."
        },
        {
          "headline":"Aim for even, natural lighting in your photos.",
          "description":"It’s best to photograph nails during the day when there’s lots of natural sunlight. If possible, photograph nails next to a window where you can play around with the best lighting by positioning the hands to catch different angles of light. A workspace lamp works too, just make sure the light doesn’t alter the appearance of the nail color. If you’re using a lamp, try to get the light as close to the nails as possible for the best shine."
        },
        {
          "headline":"Avoid shadows from your camera or cell phone.",
          "description":"Since your camera or phone will be positioned above the nails, it's going to cast a shadow depending on where your light source is coming from. Make sure you don't get the shadow in your photo. If necessary, try out different angles so that your camera is able to capture a shadow-free picture."
        },
        {
          "headline":"Choose a simple background for the nails.",
          "description":"You want to photograph nails on a very simple background that won’t be distracting to the viewer. Choose a clean, white background, or you could opt for a colored background that highlights the nail color. Just make sure that the background isn’t taking away from the main focus of the picture — the nails!"
        }
      ]
    },
    {
      "name":"Choosing a Pose",
      "steps":[
        {
          "headline":"Try different hand poses to show off the nails.",
          "description":"Choosing the best hand pose ultimately comes down to personal preference, but there are a few tips to keep in mind. When posing the hands, bend the fingers slightly so that the light reflects off of the nails, and keep the fingers close together to include more detail in the camera frame. For pose inspiration, check Instagram to find nail pictures you like, and then try to copy the hand poses."
        },
        {
          "headline":"Curl your fingers inwards slightly to show off 1 hand.",
          "description":"Curl your fingers inwards like you would to blow air onto your nails to dry them. Make sure your fingers aren't clenched into a claw — they should be a bit loose, giving your hand a more natural look."
        },
        {
          "headline":"Place 1 hand on top of the other to show off both hands.",
          "description":"If you’d like to show both hands at once, place 1 hand on top of the other and play around with interlacing the fingers. You can also place the hands on top of one another while keeping each hand's fingers pressed together. This way, your nails will be facing different directions, allowing the light to reflect off of them differently as well."
        },
        {
          "headline":"Play around with props to create more focal points, if desired.",
          "description":"While it’s best to keep your foreground simple to keep the focus on the nails, props can be a fun way of making your photos more interesting. Test out using different objects in your photos, either by having the hands hold the object or using the object as a background."
        },
        {
          "headline":"Show off the nails by clutching an item.",
          "description":"A popular option for showing off nails is to clutch an item that complements them. This gives the hand a purpose in the picture, and it makes the photograph more interesting. Try clutching a solid-colored purse or clutch to show off the nails, or hold a nail polish bottle without the words showing."
        },
        {
          "headline":"Accessorize the hands for a put-together photo.",
          "description":"To make your photos look even classier, you can add accessories. Try putting rings on a finger that either match the color of the nails or are sparkly. A classic diamond or gold ring can take your photo to a whole new level. You can also put unique rings on the hands, including 2-finger rings, rings resembling a flower or animal, or put different rings on multiple fingers."
        },
        {
          "headline":"Use a complementary item to show off a creative design.",
          "description":"If the nails are designed after a specific pattern or object, use this object in the picture. This will give your photo more meaning and add a new level of creativity. For example, to show off a creative design such as a flower pattern, you can have the fingers holding a flower that resembles the design on the nails. If the nails are painted to resemble piano keys, position the hand on a piano keyboard to take the picture."
        }
      ]
    },
    {
      "name":"Taking the Picture",
      "steps":[
        {
          "headline":"Find a camera that takes quality close-up pictures.",
          "description":"If you have a cell phone that takes great pictures, then it’s totally fine to use this to take pictures of nails. However, there are also many high-quality cameras that won’t break the bank and will give you gorgeous, close-up pictures. Make sure the lens of the camera is clean, whether you’re using a professional camera or your phone."
        },
        {
          "headline":"Use the macro setting to help your camera focus.",
          "description":"Since your camera will need to get close to the nails to take a picture, you want to make sure it’s able to focus. If you’re using a regular camera and not a cell phone, change the setting to macro. This setting will help the camera focus on things that are very close to the lens, making sure your photos don’t come out blurry. The macro setting is often portrayed as a flower symbol on your camera."
        },
        {
          "headline":"Avoid using your camera’s flash.",
          "description":"Using a camera flash to photograph nails will take away from the natural polish shine that you’re trying to capture in the photo, and it will also distort the polish color. Try to stick to using natural lighting, and avoid taking pictures of nails using a flash."
        },
        {
          "headline":"Take at least 10 pictures to ensure you have a great one.",
          "description":"Instead of just taking 1 or 2 pictures of the nails, take at least 10 to give yourself options. Take pictures of multiple hand positions, playing with how the nails are displayed as well as the lighting. This way, you’ll have lots of pictures to sort through and choose from, ensuring that you’ve taken a great one."
        },
        {
          "headline":"Edit the photos, if desired.",
          "description":"If you think your photos need a little extra brightness or color adjustments, you can always edit them. Use Photoshop or a similar photo editing program to make your pictures look how you want them too. You can experiment with filters and crop your photos, too."
        }
      ]
    }
  ],
  "text":" Setting Up the Space Clean the hands and nails before taking the picture. If dirty hands are in the picture, the dirt is going to be the main focus instead of the nails. Use a clean cloth to clear away any dust or dirt on the nails. If you have dirt on your hands, rinse them with soap and water before drying them. Apply lotion to hands that look dry. To avoid taking pictures of dry hands that will take away from the focus of the nails, use a soothing lotion to moisturize the hands. Apply the lotion a few minutes before taking the photograph so that the lotion has some time to soak into the hands. Aim for even, natural lighting in your photos. It’s best to photograph nails during the day when there’s lots of natural sunlight. If possible, photograph nails next to a window where you can play around with the best lighting by positioning the hands to catch different angles of light. A workspace lamp works too, just make sure the light doesn’t alter the appearance of the nail color. If you’re using a lamp, try to get the light as close to the nails as possible for the best shine. Avoid shadows from your camera or cell phone. Since your camera or phone will be positioned above the nails, it's going to cast a shadow depending on where your light source is coming from. Make sure you don't get the shadow in your photo. If necessary, try out different angles so that your camera is able to capture a shadow-free picture. Choose a simple background for the nails. You want to photograph nails on a very simple background that won’t be distracting to the viewer. Choose a clean, white background, or you could opt for a colored background that highlights the nail color. Just make sure that the background isn’t taking away from the main focus of the picture — the nails! Choosing a Pose Try different hand poses to show off the nails. Choosing the best hand pose ultimately comes down to personal preference, but there are a few tips to keep in mind. When posing the hands, bend the fingers slightly so that the light reflects off of the nails, and keep the fingers close together to include more detail in the camera frame. For pose inspiration, check Instagram to find nail pictures you like, and then try to copy the hand poses. Curl your fingers inwards slightly to show off 1 hand. Curl your fingers inwards like you would to blow air onto your nails to dry them. Make sure your fingers aren't clenched into a claw — they should be a bit loose, giving your hand a more natural look. Place 1 hand on top of the other to show off both hands. If you’d like to show both hands at once, place 1 hand on top of the other and play around with interlacing the fingers. You can also place the hands on top of one another while keeping each hand's fingers pressed together. This way, your nails will be facing different directions, allowing the light to reflect off of them differently as well. Play around with props to create more focal points, if desired. While it’s best to keep your foreground simple to keep the focus on the nails, props can be a fun way of making your photos more interesting. Test out using different objects in your photos, either by having the hands hold the object or using the object as a background. Show off the nails by clutching an item. A popular option for showing off nails is to clutch an item that complements them. This gives the hand a purpose in the picture, and it makes the photograph more interesting. Try clutching a solid-colored purse or clutch to show off the nails, or hold a nail polish bottle without the words showing. Accessorize the hands for a put-together photo. To make your photos look even classier, you can add accessories. Try putting rings on a finger that either match the color of the nails or are sparkly. A classic diamond or gold ring can take your photo to a whole new level. You can also put unique rings on the hands, including 2-finger rings, rings resembling a flower or animal, or put different rings on multiple fingers. Use a complementary item to show off a creative design. If the nails are designed after a specific pattern or object, use this object in the picture. This will give your photo more meaning and add a new level of creativity. For example, to show off a creative design such as a flower pattern, you can have the fingers holding a flower that resembles the design on the nails. If the nails are painted to resemble piano keys, position the hand on a piano keyboard to take the picture. Taking the Picture Find a camera that takes quality close-up pictures. If you have a cell phone that takes great pictures, then it’s totally fine to use this to take pictures of nails. However, there are also many high-quality cameras that won’t break the bank and will give you gorgeous, close-up pictures. Make sure the lens of the camera is clean, whether you’re using a professional camera or your phone. Use the macro setting to help your camera focus. Since your camera will need to get close to the nails to take a picture, you want to make sure it’s able to focus. If you’re using a regular camera and not a cell phone, change the setting to macro. This setting will help the camera focus on things that are very close to the lens, making sure your photos don’t come out blurry. The macro setting is often portrayed as a flower symbol on your camera. Avoid using your camera’s flash. Using a camera flash to photograph nails will take away from the natural polish shine that you’re trying to capture in the photo, and it will also distort the polish color. Try to stick to using natural lighting, and avoid taking pictures of nails using a flash. Take at least 10 pictures to ensure you have a great one. Instead of just taking 1 or 2 pictures of the nails, take at least 10 to give yourself options. Take pictures of multiple hand positions, playing with how the nails are displayed as well as the lighting. This way, you’ll have lots of pictures to sort through and choose from, ensuring that you’ve taken a great one. Edit the photos, if desired. If you think your photos need a little extra brightness or color adjustments, you can always edit them. Use Photoshop or a similar photo editing program to make your pictures look how you want them too. You can experiment with filters and crop your photos, too.",
  "tyn_model":[
    "lotion",
    "camera",
    "nails",
    "props",
    "soap",
    "water",
    "soothing lotion",
    "lamp",
    "— the",
    "— they",
    "nail polish",
    "cell phone",
    "cameras",
    "camera flash",
    "photoshop",
    "photo editing program",
    "filters"
  ],
  "tyn_section":[

  ]
}