{
  "title":"How to Make Icing",
  "url":"https://www.wikihow.com/Make-Icing",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Cooked Vanilla Icing",
      "steps":[
        {
          "headline":"Set a mixing bowl in a saucepan of simmering water.",
          "description":"Choose a saucepan large enough to fit a mixing bowl inside, fill it with a few inches of water, and set it on the stove over medium heat. When the water is simmering, place the mixing bowl inside. Make sure that the water level isn't so high that you risk getting water in the mixing bowl. The water should not be boiling; if it begins to get too hot, reduce the heat."
        },
        {
          "headline":"Cook the icing.",
          "description":"Put the egg whites, sugar, and corn syrup in the bowl. Stir them until they're completely combined, and continue stirring as the sugar dissolves and the mixture heats up. Use a candy thermometer to check the temperature of the icing; when it reaches 160 degrees, it's ready to be beaten. Keep a close watch on the temperature of the icing, as it could easily overcook. If the icing seems quite slow to warm, increase the burner temperature. It should reach 160 degrees within 2 or so minutes."
        },
        {
          "headline":"Beat the icing.",
          "description":"Use a whisk or an electric mixer to beat the icing until it turns fluffy and glossy. Add the vanilla and continue beating for a total of five minutes. Remove the icing from heat and use it to frost your cake."
        }
      ]
    },
    {
      "name":"Fudge Icing",
      "steps":[
        {
          "headline":"Boil the sugar, cocoa powder and milk.",
          "description":"Place the ingredients in a saucepan and bring them to a boil over medium high heat, stirring constantly. When they come to a boil, remove them from heat."
        },
        {
          "headline":"Add the butter, vanilla and salt.",
          "description":"Stir them in with the boiled chocolate mixture, then place the saucepan back on the burner over medium heat. Stir the icing and cook until the butter is melted and the ingredients are completely combined. Remove the icing from heat."
        },
        {
          "headline":"Beat the icing with a spoon.",
          "description":"As the icing cools, beat it with a spoon until it becomes thick and glossy. When it becomes difficult to move the spoon through the fudge icing, it's ready to use. This icing has a loose consistency, so pour it over your cake or cupcakes rather than using a knife to frost them. If the mixture seems too loose, return it to heat for a few minutes to allow it to thicken."
        }
      ]
    },
    {
      "name":"Buttercream Icing",
      "steps":[
        {
          "headline":"Whip the butter.",
          "description":"The first step is to change the consistency of the butter so that it becomes light, fluffy, and easy to mix with the other ingredients. Place it in a mixing bowl and beat the butter with a hand mixer or using a stand mixer for several minutes."
        },
        {
          "headline":"Add the sugar.",
          "description":"Continue beating the butter as you add the sugar. Mix until the sugar is fully incorporated into the butter."
        },
        {
          "headline":"Mix in the cream and salt.",
          "description":"Finish the icing by beating in the cream and salt until the icing is light, fluffy and fully mixed. Use it to ice your cake or cupcakes immediately, or refrigerate for later use. This icing can be easily altered to make a chocolate buttercream by adding a few tablespoons of cocoa. Add a few drops of lemon juice, almond extract, or another flavoring to match the cake flavor you made. Create a colorful buttercream icing by mixing in a few drops of food coloring."
        }
      ]
    },
    {
      "name":"Cream Cheese Icing",
      "steps":[
        {
          "headline":"Beat the cream cheese and butter.",
          "description":"Place the cream cheese and butter in a mixing bowl. Use an electric mixer or work by hand to beat the two ingredients together until you have a light, fluffy mixture."
        },
        {
          "headline":"Add the powdered sugar and milk.",
          "description":"Continue beating the mixture as you add the powdered sugar and milk. Beat for several minutes, until the ingredients are well combined and the icing has the right consistency. If you need to thicken the icing, add more powdered sugar. To thin out the icing, add a spoonful of milk."
        }
      ]
    },
    {
      "name":"Powdered Sugar Icing",
      "steps":[
        {
          "headline":"Stir the ingredients together.",
          "description":"Place the powdered sugar, vanilla, and milk in a bowl. Use a spoon or a whisk to stir the ingredients until they are completely combined. Pour the icing over the cake, cupcakes or cookies you baked."
        },
        {
          "headline":"Customize the icing.",
          "description":"This simple icing can be customized to create a lot of different flavors. Substitute the milk with the following ingredients if you want to try different flavors:\nLemon juice\nOrange juice\nMaple syrup\nBourbon\nRaspberry jam\nChocolate syrup"
        }
      ]
    }
  ],
  "text":" Cooked Vanilla Icing Set a mixing bowl in a saucepan of simmering water. Choose a saucepan large enough to fit a mixing bowl inside, fill it with a few inches of water, and set it on the stove over medium heat. When the water is simmering, place the mixing bowl inside. Make sure that the water level isn't so high that you risk getting water in the mixing bowl. The water should not be boiling; if it begins to get too hot, reduce the heat. Cook the icing. Put the egg whites, sugar, and corn syrup in the bowl. Stir them until they're completely combined, and continue stirring as the sugar dissolves and the mixture heats up. Use a candy thermometer to check the temperature of the icing; when it reaches 160 degrees, it's ready to be beaten. Keep a close watch on the temperature of the icing, as it could easily overcook. If the icing seems quite slow to warm, increase the burner temperature. It should reach 160 degrees within 2 or so minutes. Beat the icing. Use a whisk or an electric mixer to beat the icing until it turns fluffy and glossy. Add the vanilla and continue beating for a total of five minutes. Remove the icing from heat and use it to frost your cake. Fudge Icing Boil the sugar, cocoa powder and milk. Place the ingredients in a saucepan and bring them to a boil over medium high heat, stirring constantly. When they come to a boil, remove them from heat. Add the butter, vanilla and salt. Stir them in with the boiled chocolate mixture, then place the saucepan back on the burner over medium heat. Stir the icing and cook until the butter is melted and the ingredients are completely combined. Remove the icing from heat. Beat the icing with a spoon. As the icing cools, beat it with a spoon until it becomes thick and glossy. When it becomes difficult to move the spoon through the fudge icing, it's ready to use. This icing has a loose consistency, so pour it over your cake or cupcakes rather than using a knife to frost them. If the mixture seems too loose, return it to heat for a few minutes to allow it to thicken. Buttercream Icing Whip the butter. The first step is to change the consistency of the butter so that it becomes light, fluffy, and easy to mix with the other ingredients. Place it in a mixing bowl and beat the butter with a hand mixer or using a stand mixer for several minutes. Add the sugar. Continue beating the butter as you add the sugar. Mix until the sugar is fully incorporated into the butter. Mix in the cream and salt. Finish the icing by beating in the cream and salt until the icing is light, fluffy and fully mixed. Use it to ice your cake or cupcakes immediately, or refrigerate for later use. This icing can be easily altered to make a chocolate buttercream by adding a few tablespoons of cocoa. Add a few drops of lemon juice, almond extract, or another flavoring to match the cake flavor you made. Create a colorful buttercream icing by mixing in a few drops of food coloring. Cream Cheese Icing Beat the cream cheese and butter. Place the cream cheese and butter in a mixing bowl. Use an electric mixer or work by hand to beat the two ingredients together until you have a light, fluffy mixture. Add the powdered sugar and milk. Continue beating the mixture as you add the powdered sugar and milk. Beat for several minutes, until the ingredients are well combined and the icing has the right consistency. If you need to thicken the icing, add more powdered sugar. To thin out the icing, add a spoonful of milk. Powdered Sugar Icing Stir the ingredients together. Place the powdered sugar, vanilla, and milk in a bowl. Use a spoon or a whisk to stir the ingredients until they are completely combined. Pour the icing over the cake, cupcakes or cookies you baked. Customize the icing. This simple icing can be customized to create a lot of different flavors. Substitute the milk with the following ingredients if you want to try different flavors:\nLemon juice\nOrange juice\nMaple syrup\nBourbon\nRaspberry jam\nChocolate syrup",
  "tyn_model":[
    "butter",
    "mixing bowl",
    "icing",
    "sugar",
    "milk",
    "powdered sugar",
    "saucepan",
    "water",
    "spoon",
    "vanilla",
    "salt",
    "cream cheese",
    "bowl",
    "whisk",
    "electric mixer",
    "fudge icing",
    "buttercream icing",
    "cream",
    "lemon juice",
    "stove",
    "corn syrup",
    "candy thermometer",
    "cocoa powder",
    "boiled chocolate",
    "knife",
    "hand mixer",
    "stand mixer",
    "chocolate buttercream",
    "cocoa",
    "almond extract",
    "food coloring",
    "orange juice",
    "maple syrup",
    "bourbon",
    "raspberry jam",
    "chocolate syrup"
  ],
  "tyn_section":[

  ]
}