{
  "title":"How to Bake Cakes and Pastries",
  "url":"https://www.wikihow.com/Bake-Cakes-and-Pastries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Decide what you would like to bake.",
      "description":"You won't have enough time in the day to bake a lot of items, so be selective. Pastries tend to be more effort and take more skills than making cakes, so if you're a novice, start with cakes and work your way towards making pastries."
    },
    {
      "headline":"Read up on making cakes and pastries.",
      "description":"To begin with, it's a really good idea to become knowledgeable about the techniques, as well as the things that can go wrong with them. For example, temperature is very important when baking a cake, so that opening the oven mid-cooking can cause it to deflate. And pastries often require cold handling (adding cold fat, keeping your fingers cool by only using the fingertips and only rubbing for a short time, and having a cool room to work in). While these \"fiddly\" things may seem overwhelming at first, once you have grasped the finer techniques of baking, they make the experience both much more enjoyable and a lot more successful."
    },
    {
      "headline":"Try easy baking recipes to begin with.",
      "description":"Start with plain cakes and pastries before graduating to fancier, more complicated versions. Some good ones to start with would be:\nCupcakes\nChocolate cake\nBanana cake\nPies\nIce cream cake"
    },
    {
      "headline":"Once you feel confident making basic cakes, you can proceed to more complex cakes, such as wedding cakes, fruit cakes, layered cakes, birthday cakes with designs etc.",
      "description":"Here are some ideas to try:\nA cupcake wedding cake\nFruit cake\nA chocolate chip birthday cake\nRed velvet cake"
    },
    {
      "headline":"Avoid making French pastries until you have a good grasp of working with pastry and a fair understanding of its properties.",
      "description":"French pastries become easier with practice but they are not a good beginner's pastry because you will be easily deterred by the amount of effort required. Once you do feel more certain, you might like to try:\nCroissants\nEclairs\nChoux pastry for a croquembouche"
    },
    {
      "headline":"Consider attending classes to learn the techniques used in baking.",
      "description":"It can be a lot easier learning from a pastry chef who already knows all the tricks and trickiness and you will benefit from both the visual demonstrations and the practice with help."
    },
    {
      "headline":"Learn about baking from other places and for special occasions:",
      "description":"Try to experiment with baking from different cultures, from Japan to New Zealand, from the USA to Romania, you will find wide variations on commonly baked goods. It could take a lifetime to discover them all! Learn about baked food that signify different seasons or celebrations. There are many different baked items associated with harvests, Christmas, Easter, Day of the Dead, and other celebrations around the world. These tend to be more complicated, on the whole, so you might need to be an intermediate to advanced baker to feel comfortable with them. See wikiHow's Holiday Cooking section for some ideas."
    }
  ],
  "text":" Decide what you would like to bake. You won't have enough time in the day to bake a lot of items, so be selective. Pastries tend to be more effort and take more skills than making cakes, so if you're a novice, start with cakes and work your way towards making pastries. Read up on making cakes and pastries. To begin with, it's a really good idea to become knowledgeable about the techniques, as well as the things that can go wrong with them. For example, temperature is very important when baking a cake, so that opening the oven mid-cooking can cause it to deflate. And pastries often require cold handling (adding cold fat, keeping your fingers cool by only using the fingertips and only rubbing for a short time, and having a cool room to work in). While these \"fiddly\" things may seem overwhelming at first, once you have grasped the finer techniques of baking, they make the experience both much more enjoyable and a lot more successful. Try easy baking recipes to begin with. Start with plain cakes and pastries before graduating to fancier, more complicated versions. Some good ones to start with would be:\nCupcakes\nChocolate cake\nBanana cake\nPies\nIce cream cake Once you feel confident making basic cakes, you can proceed to more complex cakes, such as wedding cakes, fruit cakes, layered cakes, birthday cakes with designs etc. Here are some ideas to try:\nA cupcake wedding cake\nFruit cake\nA chocolate chip birthday cake\nRed velvet cake Avoid making French pastries until you have a good grasp of working with pastry and a fair understanding of its properties. French pastries become easier with practice but they are not a good beginner's pastry because you will be easily deterred by the amount of effort required. Once you do feel more certain, you might like to try:\nCroissants\nEclairs\nChoux pastry for a croquembouche Consider attending classes to learn the techniques used in baking. It can be a lot easier learning from a pastry chef who already knows all the tricks and trickiness and you will benefit from both the visual demonstrations and the practice with help. Learn about baking from other places and for special occasions: Try to experiment with baking from different cultures, from Japan to New Zealand, from the USA to Romania, you will find wide variations on commonly baked goods. It could take a lifetime to discover them all! Learn about baked food that signify different seasons or celebrations. There are many different baked items associated with harvests, Christmas, Easter, Day of the Dead, and other celebrations around the world. These tend to be more complicated, on the whole, so you might need to be an intermediate to advanced baker to feel comfortable with them. See wikiHow's Holiday Cooking section for some ideas.",
  "tyn_model":[
    "pastries",
    "cakes",
    "pastry",
    "baking",
    "cake",
    "oven",
    "easy baking recipes",
    "chocolate cake",
    "banana cake",
    "pies",
    "ice cream cake",
    "fruit cakes",
    "chocolate chip birthday cake",
    "red velvet cake",
    "french pastries",
    "eclairs",
    "pastry chef",
    "baker"
  ],
  "tyn_section":[

  ]
}