{
  "title":"How to Get Ready for Your Next Big Move",
  "url":"https://www.wikihow.com/Get-Ready-for-Your-Next-Big-Move",
  "category_hierarchy":[
    "Home and Garden",
    "Moving and Removals"
  ],
  "steps":[
    {
      "headline":"Clean house.",
      "description":"The first rule of moving is to get rid of unnecessary clutter before you go. That way, you won't have to find a place for those rarely-used items when you get to your new home. Host a garage sale or donate goods to a local charity."
    },
    {
      "headline":"Get organized.",
      "description":"Two months before your move, keep track of all your mail and make a list of people, subscriptions, and organizations that should be notified of your changing address. Don't forget about your bank, your broker or investment companies, your insurance agent, your doctor, and your vet. Just before your move, contact the postal service for a change of address form."
    },
    {
      "headline":"Cancel and re-order.",
      "description":"Make another list that includes all the contact information for your utility service providers (telephone, gas, electric, water, cable, and Internet access). To save even more time, you can transfer your utilities online. Remember to contact your pest control, lawn care, window cleaning and other services to let them know about your move. Proper planning insures that you won't be paying for services you're not using!"
    },
    {
      "headline":"Be \"Mover Friendly\".",
      "description":"If you're using a professional moving company, make yourself available to answer questions on both ends of the move - loading and unloading. Review the home inventory paperwork and make sure the driver has your contact information and details of your delivery."
    },
    {
      "headline":"Be safe.",
      "description":"Whether you're hiring professionals or moving yourself, remove all rugs, low hanging items, and tripping hazards. Keep walkways clear at all times. Arrange for someone to take care of your children and pets while everything is being packed and loaded onto the moving truck."
    },
    {
      "headline":"Know what you're packing.",
      "description":"Label boxes in detail, including contents and the room in which they belong. This will save time and questions for you and your movers."
    },
    {
      "headline":"Pack an \"essentials box\".",
      "description":"When you arrive at your new residence, your essentials box will be first thing you unpack. In it, you'll want to include items like:\nAlarm clock\nAspirin or pain reliever\nBasic cleaning supplies and paper towels\nBedding and linens\nBox cutter or knife\nChange of clothes\nCoffee maker or instant coffee and tea\nDisposable plates, cups, and eating utensils\nExtension cords and batteries\nFirst-aid kit\nFlashlights\nGarbage bags\nLight bulbs\nMap of new area\nMedications and eyeglasses\nPet supplies\nPhone book for new area\nPlastic trash bags\nScissors\nScrewdriver and hammer\nShower curtain and towels\nSnacks\nTape and dispenser\nToilet paper\nToiletries (soap, shampoo, razors, etc.) Toys and games for the kids\nWork gloves"
    },
    {
      "headline":"Know what not to pack.",
      "description":"Charcoal lighter fluid, pesticides and paint thinner are a few of the items that professional moving companies won't touch. Make arrangements to transport these items or leave them with a neighbor. Valuables such as cash, jewelry and important documents should stay with you or be shipped via trackable shipping service."
    },
    {
      "headline":"Check and double check.",
      "description":"Before the moving van leaves, make sure everything is loaded or unloaded - on both ends of your move. Check the attic, basement, closets, and garage for things you may have forgotten. If something is damaged during the move, notify your moving company immediately and take photographs of the damaged item. Review your home inventory before the moving company leaves.."
    },
    {
      "headline":"Keep smiling!",
      "description":"Moving can be manageable, with the right attitude and thoughtful preparation. It will all be over soon - and you'll have days, weeks or even months to unpack at your leisure. Throw yourself a housewarming party and meet your new neighbors."
    }
  ],
  "text":" Clean house. The first rule of moving is to get rid of unnecessary clutter before you go. That way, you won't have to find a place for those rarely-used items when you get to your new home. Host a garage sale or donate goods to a local charity. Get organized. Two months before your move, keep track of all your mail and make a list of people, subscriptions, and organizations that should be notified of your changing address. Don't forget about your bank, your broker or investment companies, your insurance agent, your doctor, and your vet. Just before your move, contact the postal service for a change of address form. Cancel and re-order. Make another list that includes all the contact information for your utility service providers (telephone, gas, electric, water, cable, and Internet access). To save even more time, you can transfer your utilities online. Remember to contact your pest control, lawn care, window cleaning and other services to let them know about your move. Proper planning insures that you won't be paying for services you're not using! Be \"Mover Friendly\". If you're using a professional moving company, make yourself available to answer questions on both ends of the move - loading and unloading. Review the home inventory paperwork and make sure the driver has your contact information and details of your delivery. Be safe. Whether you're hiring professionals or moving yourself, remove all rugs, low hanging items, and tripping hazards. Keep walkways clear at all times. Arrange for someone to take care of your children and pets while everything is being packed and loaded onto the moving truck. Know what you're packing. Label boxes in detail, including contents and the room in which they belong. This will save time and questions for you and your movers. Pack an \"essentials box\". When you arrive at your new residence, your essentials box will be first thing you unpack. In it, you'll want to include items like:\nAlarm clock\nAspirin or pain reliever\nBasic cleaning supplies and paper towels\nBedding and linens\nBox cutter or knife\nChange of clothes\nCoffee maker or instant coffee and tea\nDisposable plates, cups, and eating utensils\nExtension cords and batteries\nFirst-aid kit\nFlashlights\nGarbage bags\nLight bulbs\nMap of new area\nMedications and eyeglasses\nPet supplies\nPhone book for new area\nPlastic trash bags\nScissors\nScrewdriver and hammer\nShower curtain and towels\nSnacks\nTape and dispenser\nToilet paper\nToiletries (soap, shampoo, razors, etc.) Toys and games for the kids\nWork gloves Know what not to pack. Charcoal lighter fluid, pesticides and paint thinner are a few of the items that professional moving companies won't touch. Make arrangements to transport these items or leave them with a neighbor. Valuables such as cash, jewelry and important documents should stay with you or be shipped via trackable shipping service. Check and double check. Before the moving van leaves, make sure everything is loaded or unloaded - on both ends of your move. Check the attic, basement, closets, and garage for things you may have forgotten. If something is damaged during the move, notify your moving company immediately and take photographs of the damaged item. Review your home inventory before the moving company leaves.. Keep smiling! Moving can be manageable, with the right attitude and thoughtful preparation. It will all be over soon - and you'll have days, weeks or even months to unpack at your leisure. Throw yourself a housewarming party and meet your new neighbors.",
  "tyn_model":[
    "mail",
    "moving company",
    "rugs",
    "aspirin",
    "pain reliever",
    "coffee maker",
    "instant coffee and tea\ndisposable",
    "first-aid kit",
    "flashlights",
    "scissors",
    "screwdriver",
    "hammer",
    "work gloves",
    "charcoal lighter fluid",
    "pesticides",
    "paint thinner"
  ],
  "tyn_section":[

  ]
}