{
  "title":"How to Report a Stolen EBT Card",
  "url":"https://www.wikihow.com/Report-a-Stolen-EBT-Card",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Reporting and Cancelling a Stolen Card",
      "steps":[
        {
          "headline":"Call your state’s customer service line right away.",
          "description":"As soon as you notice that your card is missing, you should call to cancel it. EBT cards are not protected by federal laws against theft, so it’s important to protect the funds on your card as quickly as possible. For a list of customer service numbers by state, visit https://fns-prod.azureedge.net/sites/default/files/snap/state-lines.pdf."
        },
        {
          "headline":"Follow the prompts on the phone to disable your card.",
          "description":"There should be an option to report your card lost or stolen right from the menu. This will disable your card immediately, meaning no one will be able to use it."
        },
        {
          "headline":"Stay on the line to hear how to order a new card.",
          "description":"The process for ordering a new card varies from state to state and may require you to visit your local office."
        }
      ]
    },
    {
      "name":"Reporting Missing Funds",
      "steps":[
        {
          "headline":"Determine whether your funds are due to electronic theft.",
          "description":"If your card was stolen and the person uses your PIN, your funds will not be replaced. However, if you can obtain proof that the theft occurred without the use of your physical card or your PIN, you may be able to recover your funds, depending on the laws in the state where you live. If funds are missing from your account but you have had possession of your card and/or you did not give your PIN to anyone, you may be a victim of electronic theft. If you are able to access a list of your transactions online, examine them to see if there are any PIN-less purchases. If you are unable to see your transactions online, ask your case worker for a statement listing the transactions on your EBT account."
        },
        {
          "headline":"Follow the steps for reporting a stolen card.",
          "description":"Call your state’s customer service line, report your card stolen, and order a new card. This will stop any further funds from being taken out of your account."
        },
        {
          "headline":"File a police report.",
          "description":"As with any theft, it’s important to file a police report to have a legal record of the incident. This may help you as you attempt to recover your lost funds. When you file your police report, make sure you obtain your file number. This will need to be included in your claim."
        },
        {
          "headline":"Bring any documentation to your county EBT office to file a theft report.",
          "description":"This should be the same place you originally went to apply for your EBT card. Bring your file number from the police station and any other documentation about the theft, including an account summary if you have one. Your case worker will decide whether or not your funds can be replaced depending on the facts of the case and the regulations in your state."
        }
      ]
    }
  ],
  "text":" Reporting and Cancelling a Stolen Card Call your state’s customer service line right away. As soon as you notice that your card is missing, you should call to cancel it. EBT cards are not protected by federal laws against theft, so it’s important to protect the funds on your card as quickly as possible. For a list of customer service numbers by state, visit https://fns-prod.azureedge.net/sites/default/files/snap/state-lines.pdf. Follow the prompts on the phone to disable your card. There should be an option to report your card lost or stolen right from the menu. This will disable your card immediately, meaning no one will be able to use it. Stay on the line to hear how to order a new card. The process for ordering a new card varies from state to state and may require you to visit your local office. Reporting Missing Funds Determine whether your funds are due to electronic theft. If your card was stolen and the person uses your PIN, your funds will not be replaced. However, if you can obtain proof that the theft occurred without the use of your physical card or your PIN, you may be able to recover your funds, depending on the laws in the state where you live. If funds are missing from your account but you have had possession of your card and/or you did not give your PIN to anyone, you may be a victim of electronic theft. If you are able to access a list of your transactions online, examine them to see if there are any PIN-less purchases. If you are unable to see your transactions online, ask your case worker for a statement listing the transactions on your EBT account. Follow the steps for reporting a stolen card. Call your state’s customer service line, report your card stolen, and order a new card. This will stop any further funds from being taken out of your account. File a police report. As with any theft, it’s important to file a police report to have a legal record of the incident. This may help you as you attempt to recover your lost funds. When you file your police report, make sure you obtain your file number. This will need to be included in your claim. Bring any documentation to your county EBT office to file a theft report. This should be the same place you originally went to apply for your EBT card. Bring your file number from the police station and any other documentation about the theft, including an account summary if you have one. Your case worker will decide whether or not your funds can be replaced depending on the facts of the case and the regulations in your state.",
  "tyn_model":[
    "customer service line",
    "ebt cards",
    "customer service numbers",
    "ebt account",
    "ebt office",
    "ebt card"
  ],
  "tyn_section":[

  ]
}