{
  "title":"How to Clean a Plastic Bottle",
  "url":"https://www.wikihow.com/Clean-a-Plastic-Bottle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Using Dish Soap and Water",
      "steps":[
        {
          "headline":"Add a few drops of dish soap and water to your bottle then put the cap back on.",
          "description":"Any hand dish liquid is fine to use for washing a plastic bottle. After you add some dish soap, fill your bottle halfway with warm water. Put the cap back on."
        },
        {
          "headline":"Shake the dish soap and water around in your bottle then dump.",
          "description":"For the fastest clean, you can just shake the soapy water around in your bottle with the cap on for one minute. Then dump the soapy water out and rinse your bottle. If you use the bottle for any drinks other than water, you should scrub the top and inside with a soapy sponge or bottle brush."
        },
        {
          "headline":"Scrub the top by hand with a soapy sponge or brush.",
          "description":"To get the top part where you drink out of clean, use a soapy dish sponge to scrub it. For bottles with pull-up tops or flip-straw tops, use a small bottle brush to get into the little crevices of the opening."
        },
        {
          "headline":"Use a bottle brush to reach deep inside the bottle.",
          "description":"Use a soapy bottle brush to scrub the inside of the bottle and remove germs from within. Do this every day if you use your bottle for drinks other than water."
        },
        {
          "headline":"Leave your bottle open to air dry.",
          "description":"It is recommended to wash your bottle in the evening so you can leave it out overnight to air dry. If you can’t do this, dry your bottle completely with a clean towel before using."
        }
      ]
    },
    {
      "name":"Cleaning in the Dishwasher",
      "steps":[
        {
          "headline":"Check your bottle for a dishwasher-safe symbol.",
          "description":"Most products today are safe in the dishwasher but check your bottle just to be sure. Take the top parts off of the bottle and be sure those go into the dishwasher too."
        },
        {
          "headline":"Load your bottle into the top rack of your dishwasher.",
          "description":"Plastic items should go into the top rack of a dishwasher. Many dishwashers have a heating element in the bottom for the dryer setting that can warp or melt plastic if it is put in the bottom rack."
        },
        {
          "headline":"Add detergent and run your dishwasher on a regular setting.",
          "description":"Run your dishwasher with the plastic bottle inside (in the top rack) just like you would regularly run a load of dishes. Leave the dryer setting on so that the bottle gets dry, or take the bottle out right after the load is done and allow it to air dry."
        }
      ]
    },
    {
      "name":"Sanitizing with Vinegar",
      "steps":[
        {
          "headline":"Fill your bottle 1/5 of the way with white vinegar.",
          "description":"To get your bottle extra clean, sanitize it with vinegar. White vinegar is a great cleaning product and can be easily found at any grocery store. After filling your bottle 1/5 of the way with vinegar, fill it the rest of the way with warm water."
        },
        {
          "headline":"Allow the vinegar and water mixture to sit overnight in your bottle.",
          "description":"In the morning, rinse your bottle thoroughly with hot water and wipe it dry with a clean towel. Your bottle is sanitized and ready to use!"
        },
        {
          "headline":"Add baking soda or bleach for extra precaution.",
          "description":"If your bottle has been in an extra dirty environment, or it has been shared by many people (like kids in a daycare), you may want to also clean it with baking soda. Mix one teaspoon of baking soda to water and proceed just like with the vinegar and water mixture. Do not mix baking soda into your vinegar and water mixture. Baking soda is basic, while vinegar is acid, so the two of them would just each other cancel out. Alternatively, you can use one teaspoon of bleach, instead of using vinegar, in the water mixture. Rinse your bottle extra well before using it if you use any bleach to sanitize it."
        }
      ]
    }
  ],
  "text":" Using Dish Soap and Water Add a few drops of dish soap and water to your bottle then put the cap back on. Any hand dish liquid is fine to use for washing a plastic bottle. After you add some dish soap, fill your bottle halfway with warm water. Put the cap back on. Shake the dish soap and water around in your bottle then dump. For the fastest clean, you can just shake the soapy water around in your bottle with the cap on for one minute. Then dump the soapy water out and rinse your bottle. If you use the bottle for any drinks other than water, you should scrub the top and inside with a soapy sponge or bottle brush. Scrub the top by hand with a soapy sponge or brush. To get the top part where you drink out of clean, use a soapy dish sponge to scrub it. For bottles with pull-up tops or flip-straw tops, use a small bottle brush to get into the little crevices of the opening. Use a bottle brush to reach deep inside the bottle. Use a soapy bottle brush to scrub the inside of the bottle and remove germs from within. Do this every day if you use your bottle for drinks other than water. Leave your bottle open to air dry. It is recommended to wash your bottle in the evening so you can leave it out overnight to air dry. If you can’t do this, dry your bottle completely with a clean towel before using. Cleaning in the Dishwasher Check your bottle for a dishwasher-safe symbol. Most products today are safe in the dishwasher but check your bottle just to be sure. Take the top parts off of the bottle and be sure those go into the dishwasher too. Load your bottle into the top rack of your dishwasher. Plastic items should go into the top rack of a dishwasher. Many dishwashers have a heating element in the bottom for the dryer setting that can warp or melt plastic if it is put in the bottom rack. Add detergent and run your dishwasher on a regular setting. Run your dishwasher with the plastic bottle inside (in the top rack) just like you would regularly run a load of dishes. Leave the dryer setting on so that the bottle gets dry, or take the bottle out right after the load is done and allow it to air dry. Sanitizing with Vinegar Fill your bottle 1/5 of the way with white vinegar. To get your bottle extra clean, sanitize it with vinegar. White vinegar is a great cleaning product and can be easily found at any grocery store. After filling your bottle 1/5 of the way with vinegar, fill it the rest of the way with warm water. Allow the vinegar and water mixture to sit overnight in your bottle. In the morning, rinse your bottle thoroughly with hot water and wipe it dry with a clean towel. Your bottle is sanitized and ready to use! Add baking soda or bleach for extra precaution. If your bottle has been in an extra dirty environment, or it has been shared by many people (like kids in a daycare), you may want to also clean it with baking soda. Mix one teaspoon of baking soda to water and proceed just like with the vinegar and water mixture. Do not mix baking soda into your vinegar and water mixture. Baking soda is basic, while vinegar is acid, so the two of them would just each other cancel out. Alternatively, you can use one teaspoon of bleach, instead of using vinegar, in the water mixture. Rinse your bottle extra well before using it if you use any bleach to sanitize it.",
  "tyn_model":[
    "water",
    "vinegar",
    "baking soda",
    "dish soap",
    "bottle",
    "dishwasher",
    "bottle brush",
    "bleach",
    "soapy sponge",
    "white vinegar",
    "soapy dish sponge",
    "soapy bottle brush",
    "dishwashers",
    "detergent",
    "dryer"
  ],
  "tyn_section":[

  ]
}