{
  "title":"How to Play Super Mario Odyssey",
  "url":"https://www.wikihow.com/Play-Super-Mario-Odyssey",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "parts":[
    {
      "name":"Learning the Basics",
      "steps":[
        {
          "headline":"Understand how Super Mario Odyssey differs from classic Mario games.",
          "description":"While classic Mario games are side-scrollers, Super Mario Odyssey allows you to move in a full 3D world. This means that it controls much more like a traditionally third-person game (such as The Division or Crash Bandicoot) than a third-person side-scroller."
        },
        {
          "headline":"Know the controls.",
          "description":"The basic controls used to control Mario are as follows:\n\nLeft Stick — Move Mario, or rotate in circles to prompt Mario's \"Spin\" move. Right Stick — Move the camera independently of Mario's movement. You can also press this stick to activate first-person mode, though you can't move while in first-person. A or B — Press once to jump, or press and hold to jump higher. If you're crouched, this button will cause you to backflip. X or Y — Press once to throw Cappy, or hold to make Cappy stay after being thrown. Hold down to sprint when possible. Hold down near an object to hold the object, then release it to throw the object. Press once while crouched to roll. L or R — Re-center the camera behind Mario. ZL or ZR — Hold to crouch, or press once while on top of a pipe to drop into the pipe. Plus — Pause the game and open the menu. Minus — Open the map, or close the map if it's already open. D-Pad Down — Open the screenshot interface. D-Pad Right — Scan amiibo if available."
        },
        {
          "headline":"Understand Mario's move-set.",
          "description":"Mario has several navigational and combative moves that will allow you to traverse the environment and defeat enemies in the game. The moves are as follows, though keep in mind that the A/B, X/Y, and ZL/ZR buttons are interchangeable:\n\nLong Jump — Press ZL + B. Causes Mario to jump farther than usual. Triple Jump — Press A or B three times at the height of each jump. Allows Mario to jump up to three times in succession. Roll — Hold ZL to crouch, then press Y. Hold down Y to keep rolling. Useful for things like avoiding some traps. Ground Pound — Press B, then press ZL. Causes Mario to slam into the ground. Ground Pound Jump — Press B immediately after executing a Ground Pound. Causes Mario to jump higher than usual. Dive — Press ZL + Y while in the middle of a fall. Causes Mario to dive rather than just landing. Backflip — Hold ZL while pressing B. Mario will flip backward. Swim — When in water, press ZL, then press Y. This causes Mario to move forward. Wall Jump — Press B while on a wall. Causes Mario to jump up and away from the wall at an angle."
        },
        {
          "headline":"Use Cappy's move-set.",
          "description":"One of Super Mario Odyssey's additions is the ability to throw your hat—named \"Cappy\"—to access hard-to-reach areas and attack certain enemies:\n\nCapture — Pressing Y to throw Cappy will result in him bringing back to you any capturable animal or opponent. Throw Up — Flick the Switch upward. Throw Down — Flick the Switch downward. Cap Jump — Throw and hold Cappy by holding down Y, then walk forward and press B to jump onto (and off of) Cappy. Homing Throw — Throw Cappy by pressing Y, then shake the Switch. Cappy will automatically lock onto the closest item."
        },
        {
          "headline":"Insert the Super Mario Odyssey cartridge into your Switch.",
          "description":"Once you're ready to begin playing Super Mario Odyssey, begin by placing the game's cartridge in the slot on the top of the Switch."
        },
        {
          "headline":"Start a new game.",
          "description":"Once the game loads, select New Game on the main menu. This will start the introduction cutscene. You can also select Resume to pick up where you left off if you have a saved game in progress."
        },
        {
          "headline":"Refrain from skipping cutscenes.",
          "description":"The intro cutscenes are important to understanding the story and the gameplay mechanics, so make sure you watch them all the way through."
        },
        {
          "headline":"Follow the initial tutorials.",
          "description":"As with most games, Super Mario Odyssey has an introduction sequence that is meant to familiarize you with the controls and their basic applications. Once you've navigated through this section, you are free to begin playing Super Mario Odyssey in full."
        }
      ]
    },
    {
      "name":"Having a Successful Game",
      "steps":[
        {
          "headline":"Practice Mario's move-set before launching into the game.",
          "description":"There are quite a few new moves to master if you're new to Super Mario Odyssey, so you might want to take some time to practice each of Mario's (and Cappy's) moves before you launch into the main game. Super Mario Odyssey does a good job of easing you into combat and navigation, so you can proceed if you don't mind learning as you go."
        },
        {
          "headline":"Use verticality.",
          "description":"You'll find the bulk of the game's secrets on platforms and behind walls that are, at first glance, inaccessible. You can usually get to these places by navigating to a higher point. Using Cappy to extend your jumps (throw and hold Cappy, then press B) will allow you to reach previously inaccessible platforms."
        },
        {
          "headline":"Observe your environment before making a move.",
          "description":"While there's usually a straightforward way to approach a goal or an enemy, you may find elements of the environment that make the conflict or the path easier."
        },
        {
          "headline":"Avoid using Cappy on hat-wearing opponents.",
          "description":"Cappy cannot possess hat-wearing enemies, so keep an eye out for such enemies before throwing Cappy. Some opponents can have their hats knocked off by attacking them. Once an opponent's hat is gone, you can use Cappy to possess them."
        },
        {
          "headline":"Keep an eye out for secrets.",
          "description":"You can find coins in boxes, false walls, bushes, and other unassuming places, so Ground Pound any suspicious item. You'll also find challenge sections and hidden Moons if you explore areas outside of the linear game."
        },
        {
          "headline":"Pay the Hint Toad for Moon locations.",
          "description":"Once you complete a level, the Hint Toad will approach you and offer to mark the level's Moon locations on your map for 50 gold. This is optional, and doing so will detract from your ability to buy outfits; however, if you're having trouble finding the last few Moons in a level, this feature can help. Moons will make a twinkling sound when nearby, even if they're hidden behind a wall or below your current platform."
        },
        {
          "headline":"Know that Challenge Worlds hold two Moons.",
          "description":"Challenge Worlds (the sections you can access through pipes) contain two Moons: one at the end of the challenge run, and one hidden somewhere in the run. While it isn't mandatory that you access both Moons to continue, finding the second Moon in each Challenge World will make the game easier in the long run."
        },
        {
          "headline":"Buy costumes that help unlock Moons.",
          "description":"Since there are exactly enough coins in Super Mario Odyssey to buy every outfit (no more, no fewer), spend your initial coins on outfits that will unlock Moons. The exact number of coins in the game means that missing just one will prevent you from unlocking the last item in the shop."
        },
        {
          "headline":"Try playing in Assist Mode if you can't get the hang of the game.",
          "description":"You can access Assist Mode by opening the Pause menu (press +), selecting Options, and selecting the Assist Mode option in the menu. Assist Mode will add health points and objective markers, and the death mechanic and coin loss that accompanies it will be replaced by losing only one health point when falling off a platform."
        }
      ]
    }
  ],
  "text":" Learning the Basics Understand how Super Mario Odyssey differs from classic Mario games. While classic Mario games are side-scrollers, Super Mario Odyssey allows you to move in a full 3D world. This means that it controls much more like a traditionally third-person game (such as The Division or Crash Bandicoot) than a third-person side-scroller. Know the controls. The basic controls used to control Mario are as follows:\n\nLeft Stick — Move Mario, or rotate in circles to prompt Mario's \"Spin\" move. Right Stick — Move the camera independently of Mario's movement. You can also press this stick to activate first-person mode, though you can't move while in first-person. A or B — Press once to jump, or press and hold to jump higher. If you're crouched, this button will cause you to backflip. X or Y — Press once to throw Cappy, or hold to make Cappy stay after being thrown. Hold down to sprint when possible. Hold down near an object to hold the object, then release it to throw the object. Press once while crouched to roll. L or R — Re-center the camera behind Mario. ZL or ZR — Hold to crouch, or press once while on top of a pipe to drop into the pipe. Plus — Pause the game and open the menu. Minus — Open the map, or close the map if it's already open. D-Pad Down — Open the screenshot interface. D-Pad Right — Scan amiibo if available. Understand Mario's move-set. Mario has several navigational and combative moves that will allow you to traverse the environment and defeat enemies in the game. The moves are as follows, though keep in mind that the A/B, X/Y, and ZL/ZR buttons are interchangeable:\n\nLong Jump — Press ZL + B. Causes Mario to jump farther than usual. Triple Jump — Press A or B three times at the height of each jump. Allows Mario to jump up to three times in succession. Roll — Hold ZL to crouch, then press Y. Hold down Y to keep rolling. Useful for things like avoiding some traps. Ground Pound — Press B, then press ZL. Causes Mario to slam into the ground. Ground Pound Jump — Press B immediately after executing a Ground Pound. Causes Mario to jump higher than usual. Dive — Press ZL + Y while in the middle of a fall. Causes Mario to dive rather than just landing. Backflip — Hold ZL while pressing B. Mario will flip backward. Swim — When in water, press ZL, then press Y. This causes Mario to move forward. Wall Jump — Press B while on a wall. Causes Mario to jump up and away from the wall at an angle. Use Cappy's move-set. One of Super Mario Odyssey's additions is the ability to throw your hat—named \"Cappy\"—to access hard-to-reach areas and attack certain enemies:\n\nCapture — Pressing Y to throw Cappy will result in him bringing back to you any capturable animal or opponent. Throw Up — Flick the Switch upward. Throw Down — Flick the Switch downward. Cap Jump — Throw and hold Cappy by holding down Y, then walk forward and press B to jump onto (and off of) Cappy. Homing Throw — Throw Cappy by pressing Y, then shake the Switch. Cappy will automatically lock onto the closest item. Insert the Super Mario Odyssey cartridge into your Switch. Once you're ready to begin playing Super Mario Odyssey, begin by placing the game's cartridge in the slot on the top of the Switch. Start a new game. Once the game loads, select New Game on the main menu. This will start the introduction cutscene. You can also select Resume to pick up where you left off if you have a saved game in progress. Refrain from skipping cutscenes. The intro cutscenes are important to understanding the story and the gameplay mechanics, so make sure you watch them all the way through. Follow the initial tutorials. As with most games, Super Mario Odyssey has an introduction sequence that is meant to familiarize you with the controls and their basic applications. Once you've navigated through this section, you are free to begin playing Super Mario Odyssey in full. Having a Successful Game Practice Mario's move-set before launching into the game. There are quite a few new moves to master if you're new to Super Mario Odyssey, so you might want to take some time to practice each of Mario's (and Cappy's) moves before you launch into the main game. Super Mario Odyssey does a good job of easing you into combat and navigation, so you can proceed if you don't mind learning as you go. Use verticality. You'll find the bulk of the game's secrets on platforms and behind walls that are, at first glance, inaccessible. You can usually get to these places by navigating to a higher point. Using Cappy to extend your jumps (throw and hold Cappy, then press B) will allow you to reach previously inaccessible platforms. Observe your environment before making a move. While there's usually a straightforward way to approach a goal or an enemy, you may find elements of the environment that make the conflict or the path easier. Avoid using Cappy on hat-wearing opponents. Cappy cannot possess hat-wearing enemies, so keep an eye out for such enemies before throwing Cappy. Some opponents can have their hats knocked off by attacking them. Once an opponent's hat is gone, you can use Cappy to possess them. Keep an eye out for secrets. You can find coins in boxes, false walls, bushes, and other unassuming places, so Ground Pound any suspicious item. You'll also find challenge sections and hidden Moons if you explore areas outside of the linear game. Pay the Hint Toad for Moon locations. Once you complete a level, the Hint Toad will approach you and offer to mark the level's Moon locations on your map for 50 gold. This is optional, and doing so will detract from your ability to buy outfits; however, if you're having trouble finding the last few Moons in a level, this feature can help. Moons will make a twinkling sound when nearby, even if they're hidden behind a wall or below your current platform. Know that Challenge Worlds hold two Moons. Challenge Worlds (the sections you can access through pipes) contain two Moons: one at the end of the challenge run, and one hidden somewhere in the run. While it isn't mandatory that you access both Moons to continue, finding the second Moon in each Challenge World will make the game easier in the long run. Buy costumes that help unlock Moons. Since there are exactly enough coins in Super Mario Odyssey to buy every outfit (no more, no fewer), spend your initial coins on outfits that will unlock Moons. The exact number of coins in the game means that missing just one will prevent you from unlocking the last item in the shop. Try playing in Assist Mode if you can't get the hang of the game. You can access Assist Mode by opening the Pause menu (press +), selecting Options, and selecting the Assist Mode option in the menu. Assist Mode will add health points and objective markers, and the death mechanic and coin loss that accompanies it will be replaced by losing only one health point when falling off a platform.",
  "tyn_model":[
    "— press",
    "cappy",
    "switch",
    "super mario odyssey",
    "— hold",
    "— move",
    "camera",
    "— open",
    "— flick",
    "— throw",
    "— re",
    "mario",
    "pipe",
    "— pause",
    "— scan",
    "dive",
    "swim",
    "— when",
    "water",
    "super mario",
    "hat",
    "—named",
    "— pressing",
    "moons",
    "costumes"
  ],
  "tyn_section":[

  ]
}