{
  "title":"How to Remove Super Glue from Laminate Flooring",
  "url":"https://www.wikihow.com/Remove-Super-Glue-from-Laminate-Flooring",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Adhesive Stains",
    "Removing Glue"
  ],
  "parts":[
    {
      "name":"Getting Supplies",
      "steps":[
        {
          "headline":"Get acetone.",
          "description":"You can buy concentrated acetone from your local hardware store. It usually comes in a 1 US gal (3.8 L) can. You can also find acetone in your beauty cabinet. Acetone is the main ingredient in most nail polish removers. Never keep your acetone in a styrofoam or plastic cup. It will dissolve the cup. If you use nail polish remover, make sure it does indeed have acetone. Some companies are trying to use other substances as acetone weakens the bonds for acrylic nails."
        },
        {
          "headline":"Get a knife.",
          "description":"The softer the knife the better. You want a knife that will not leave marks on your flooring. A soft, plastic putty knife will work best. Laminate flooring can be easily scratched by metallic knives. If you can’t find a plastic putty knife, you can use a butter knife but you will have to wrap it with a soft rag before using it on your laminate flooring."
        },
        {
          "headline":"Get paper towels or cleaning cloths.",
          "description":"Laminate flooring is very sensitive to liquid. You’ll want plenty of dry paper towels or cloths on hand to wipe up any moisture off your floor before it causes any discoloration. Darker color laminate is more prone to discoloration."
        },
        {
          "headline":"Get a thick, clean rag.",
          "description":"You never want to use a scouring pad on your laminate flooring or anything else that can leave scratches. You can use your soft rag to clean your floor without damaging it. You may also need another rag to wrap around your butter knife if you choose to use one."
        }
      ]
    },
    {
      "name":"Removing the Glue",
      "steps":[
        {
          "headline":"Crack a window.",
          "description":"While acetone is safe to use, overexposure to it can be bad for you. Too much inhalation of acetone can irritate your respiratory tract, cause headaches and in serious cases even make you go unconscious. Overexposure of concentrated acetone to the skin can even cause dermatitis, so be careful. Acetone can also stain fabrics in your clothes, so roll up your sleeves."
        },
        {
          "headline":"Spot-test the acetone.",
          "description":"Find a small hidden area on your laminate flooring where guests will not normally see. Place a small dot of acetone on the spot. Wait for it to dry, then check the spot to make sure there is no discoloration. You want to make sure the acetone will not damage your flooring. Choose a spot somewhere that is not likely to be exposed when you inevitably move your furniture around. A corner of the room may be best."
        },
        {
          "headline":"Put some acetone on the superglue.",
          "description":"When you’re sure the acetone is safe to use on your flooring, apply the acetone to your cleaning rag and work the rag into the stain. Give the acetone some time to soften the glue. If you have a small stain, apply acetone to a cotton swab and rub it over the stain until the glue is softened."
        },
        {
          "headline":"Scrape away the glue.",
          "description":"Use your putty knife to gently scrape away the glue stain. If you’re using a steel butter knife, remember to wrap it in your clean thick rag before you use it on your floor. Be gentle and take your time. Keep the edge of your scraper even with the floor to prevent scratches. With enough force, even a soft knife can cause damage to your flooring."
        },
        {
          "headline":"Repeat the process.",
          "description":"It may take a few tries to get all the glue off. Keep pouring drops of acetone on the stain, letting it sit and then scraping away with your knife until your flooring is free of superglue."
        }
      ]
    },
    {
      "name":"Finishing the Job",
      "steps":[
        {
          "headline":"Test the area.",
          "description":"Drag a paper towel across the area where the stain was to see if you can feel any hard places where there might still be glue. Check the area around the initial stain as well. Your knife could have smeared the glue into a larger area."
        },
        {
          "headline":"Remove any remaining particles.",
          "description":"If you do find tiny remnants of superglue on your floor, rub more acetone over the spot with your rag. Once again, use only a few drops of acetone and be sure to be gentle. Never apply any liquid directly to your laminate flooring. It could discolor it. Instead, put a few drops of acetone on your rag, then apply your rag to the floor. Make sure to apply the rag to your floor in a soft, circular motion."
        },
        {
          "headline":"Dry the area.",
          "description":"When you are confident all the superglue has been removed, use a paper towel or dry rag to wipe away all the residue. Make sure that all moisture is removed from your flooring. Dry the area carefully so that you do not scratch your floor."
        },
        {
          "headline":"Put your acetone away properly.",
          "description":"Acetone is extremely flammable and can ignite from a distance. Keep it in an area far away from any electrical outlets or anything else that could cause it to catch fire. Make sure to have a tight fitting lid on your acetone so that it is not exposed to anything that could cause it to catch fire."
        },
        {
          "headline":"Wash your hands.",
          "description":"Acetone can irritate your skin, causing it to become red and dried out. Be sure to scrub it all off with soap and water after you’re done working with it. Use plenty of lotion to combat the dryness it can cause as well."
        }
      ]
    }
  ],
  "text":" Getting Supplies Get acetone. You can buy concentrated acetone from your local hardware store. It usually comes in a 1 US gal (3.8 L) can. You can also find acetone in your beauty cabinet. Acetone is the main ingredient in most nail polish removers. Never keep your acetone in a styrofoam or plastic cup. It will dissolve the cup. If you use nail polish remover, make sure it does indeed have acetone. Some companies are trying to use other substances as acetone weakens the bonds for acrylic nails. Get a knife. The softer the knife the better. You want a knife that will not leave marks on your flooring. A soft, plastic putty knife will work best. Laminate flooring can be easily scratched by metallic knives. If you can’t find a plastic putty knife, you can use a butter knife but you will have to wrap it with a soft rag before using it on your laminate flooring. Get paper towels or cleaning cloths. Laminate flooring is very sensitive to liquid. You’ll want plenty of dry paper towels or cloths on hand to wipe up any moisture off your floor before it causes any discoloration. Darker color laminate is more prone to discoloration. Get a thick, clean rag. You never want to use a scouring pad on your laminate flooring or anything else that can leave scratches. You can use your soft rag to clean your floor without damaging it. You may also need another rag to wrap around your butter knife if you choose to use one. Removing the Glue Crack a window. While acetone is safe to use, overexposure to it can be bad for you. Too much inhalation of acetone can irritate your respiratory tract, cause headaches and in serious cases even make you go unconscious. Overexposure of concentrated acetone to the skin can even cause dermatitis, so be careful. Acetone can also stain fabrics in your clothes, so roll up your sleeves. Spot-test the acetone. Find a small hidden area on your laminate flooring where guests will not normally see. Place a small dot of acetone on the spot. Wait for it to dry, then check the spot to make sure there is no discoloration. You want to make sure the acetone will not damage your flooring. Choose a spot somewhere that is not likely to be exposed when you inevitably move your furniture around. A corner of the room may be best. Put some acetone on the superglue. When you’re sure the acetone is safe to use on your flooring, apply the acetone to your cleaning rag and work the rag into the stain. Give the acetone some time to soften the glue. If you have a small stain, apply acetone to a cotton swab and rub it over the stain until the glue is softened. Scrape away the glue. Use your putty knife to gently scrape away the glue stain. If you’re using a steel butter knife, remember to wrap it in your clean thick rag before you use it on your floor. Be gentle and take your time. Keep the edge of your scraper even with the floor to prevent scratches. With enough force, even a soft knife can cause damage to your flooring. Repeat the process. It may take a few tries to get all the glue off. Keep pouring drops of acetone on the stain, letting it sit and then scraping away with your knife until your flooring is free of superglue. Finishing the Job Test the area. Drag a paper towel across the area where the stain was to see if you can feel any hard places where there might still be glue. Check the area around the initial stain as well. Your knife could have smeared the glue into a larger area. Remove any remaining particles. If you do find tiny remnants of superglue on your floor, rub more acetone over the spot with your rag. Once again, use only a few drops of acetone and be sure to be gentle. Never apply any liquid directly to your laminate flooring. It could discolor it. Instead, put a few drops of acetone on your rag, then apply your rag to the floor. Make sure to apply the rag to your floor in a soft, circular motion. Dry the area. When you are confident all the superglue has been removed, use a paper towel or dry rag to wipe away all the residue. Make sure that all moisture is removed from your flooring. Dry the area carefully so that you do not scratch your floor. Put your acetone away properly. Acetone is extremely flammable and can ignite from a distance. Keep it in an area far away from any electrical outlets or anything else that could cause it to catch fire. Make sure to have a tight fitting lid on your acetone so that it is not exposed to anything that could cause it to catch fire. Wash your hands. Acetone can irritate your skin, causing it to become red and dried out. Be sure to scrub it all off with soap and water after you’re done working with it. Use plenty of lotion to combat the dryness it can cause as well.",
  "tyn_model":[
    "acetone",
    "knife",
    "glue",
    "butter knife",
    "putty knife",
    "rag",
    "superglue",
    "paper towel",
    "nail polish removers",
    "nail polish remover",
    "plastic putty knife",
    "paper towels",
    "cleaning rag",
    "scraper",
    "dry rag",
    "soap",
    "water",
    "lotion"
  ],
  "tyn_section":[

  ]
}