{
  "title":"How to Eat When Recovering From Addiction",
  "url":"https://www.wikihow.com/Eat-When-Recovering-From-Addiction",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Following a Recovery-Specific Meal Plan",
      "steps":[
        {
          "headline":"Keep a food journal.",
          "description":"Write down exactly what you eat and when you eat it. Make a brief note as to portion sizes as well. Don’t forget to write down what you drink. Keep journaling your food choices until you feel as if you are aware of your dietary patterns and what needs to be adjusted. Writing down everything will help you to differentiate between hunger pangs and a craving for addictive substances. As your body begins to recover, you will see that many of your body’s cues are actually requests for additional nutrients via food. You can also download  smartphone apps that will allow you to track your diet. This may be a more convenient way to store the information, just make sure to keep the entries accurate and up-to-date."
        },
        {
          "headline":"Eat small meals throughout the day.",
          "description":"Start your day by eating breakfast about 30 minutes after getting out of bed. From that point onward, eat a small meal every two to four hours until your final evening snack. Staying full with a regular snacks and meals will keep your blood sugar consistent and help you resist giving in to other problematic cravings. Carry healthy snack foods with you, such as almonds, so that you nibble on something healthy if you feel hunger pangs. If you need to keep your hands busy, you can choose a more interactive snack such as string cheese, which you can shred and eat piece-by-piece. If you simply don’t feel hungry (lack of appetite is common when in recovery), carry some saltine crackers with you and munch on them whenever you can. This will help to stimulate your appetite, keep your hands busy, and soothe your stomach. All of your meals and snacks throughout the day should total to around 2,000 calories. Try to maintain a balance of 30% calories from fat, 45% calories from carbohydrates, and 25% calories from protein."
        },
        {
          "headline":"Watch your portion sizes.",
          "description":"Your addiction may have inhibited your ability to sense when you are no longer hungry and full. Monitor your portion sizes by paying attention to product packaging and general nutritional guidelines. Go online and print out a small portion calculator or download an app on your phone to provide portion references for you. One easy method to measuring out portions is comparing the food to parts of your hand. For example, a portion of cheese is the same size as your pointer finger. A portion of chicken should fit on the flat surface of your palm, making it around 3 ounces."
        },
        {
          "headline":"Eat at least five servings of fruits and vegetables.",
          "description":"Nutrient-dense foods are a critical component of an effective recovery diet. Consuming fresh or raw fruits and vegetables will increase your antioxidant levels, boost your immune system, and help to reverse some of the damage done to your body. Certain fruits and vegetables can target particular elements of your body’s recuperation process. For example, green leafy vegetables, such as spinach, can fight off nausea and intestinal issues. Acidic fruits, such as limes, can improve the functioning of your liver. Experiment with fruits and vegetables by trying out new ones each week. For example, if you’ve never had eggplant before, try making eggplant pasta one night for dinner. This will also prevent you from becoming overly focused on only one type of fruit or vegetable, meaning you will be getting a variety of nutrients. Always thoroughly clean fresh produce prior to consuming, to clean off any potential pesticide residue or harmful bacteria."
        },
        {
          "headline":"Make changes gradually.",
          "description":"Being in recovery requires a number of major lifestyle changes, so don’t overwhelm yourself by expecting diet perfection overnight. Instead, pick a few areas to work on based on what your food journal shows and what your body tells you. For example, if you eat way too much candy, try to replace some of it with fruit in your diet."
        }
      ]
    },
    {
      "name":"Eating Foods that Will Assist in Recovery",
      "steps":[
        {
          "headline":"Consume protein-rich foods.",
          "description":"Protein is one of the most important dietary elements for a recovering addict. The amino acids found in proteins can assist in healing your body’s tissues and organs. Protein may also boost positive chemicals in the brain, such as dopamine, providing a barrier against depression. Aim to eat around 10 – 15 grams of protein during each meal or snack session. This will keep you from feeling hungry and will also be easier on your digestive system. Nuts, lean red meats, turkey, and eggs are all good sources of protein."
        },
        {
          "headline":"Incorporate fiber-rich foods into your diet.",
          "description":"If your addiction led to problems with your digestive system, fiber just might be the answer for you. It will soothe your intestines and get them back on a ‘regular’ schedule. Remove all white flour from your diet and replace it with unrefined and unprocessed whole grains. Whole grain pasta and brown rice are quick and easy fiber options. You can also get fiber from vegetables, such as beans, artichokes, and lentils. If you need an extra fiber boost consider taking a fiber supplement. These come in both caplet and stir-in forms."
        },
        {
          "headline":"Add healthy fats to your diet.",
          "description":"Not all fats are bad for you. Eating certain fats can actually assist in addiction recovery by boosting fatty acids. This, in turn, helps elevate your mood, turning it away from depression. Healthy fats can also assist in the absorption of vital nutrients from other foods. Olive, coconut, and flaxseed oils all contain healthy fats. Whole foods such as avocado and fish are also good sources."
        },
        {
          "headline":"Take a good quality vitamin/mineral supplement.",
          "description":"It is likely that your addiction period left you with a serious nutritional deficiency — malnourishment is a common problem among recovering addicts. Eating a balanced diet can counter some of this, but adding a multivitamin will fill in any gaps. You can also take supplements in order to get those good fatty acids in your diet as well. It is important to make your healthcare provider aware of any supplements you are taking, as they can interact with some medications. B vitamins are particularly helpful when recovering from addiction. They elevate brain function and fight against signs of mental fatigue. Vitamin B5, for example, has been shown to help detox the body of harmful chemicals and is often used by recovering alcoholics. Most adults need about 2.4 micrograms of vitamin B daily. Remember that multivitamins are not a “cure all.” You still need to follow a careful diet as part of your recovery process."
        },
        {
          "headline":"Drink plenty of water.",
          "description":"Try to drink at least eight 8-oz glasses (1.9 liters) of water each day; even more is better. Water will help flush your body of toxins and will hydrate your intestinal tract, which often suffers damage from addiction. Drinking a full glass of water before most meals is one way to reach your goal. If you are struggling with nausea, pour yourself a glass of ice cold water. Take your time drinking it and that alone will help to calm your system. If unflavored water is too bland for you, try adding a lemon slice (or a slice of any other fruit) to each glass. You can also freeze fruit into ice cubes and add them in. Stomach upset can sometimes be a problem during recovery and coconut water has been shown to calm your digestive system. It also contains natural sugar for an energy boost and electrolytes to increase overall hydration."
        }
      ]
    },
    {
      "name":"Avoiding Foods that Can Sabotage Recovery",
      "steps":[
        {
          "headline":"Limit saturated fats.",
          "description":"These “bad” fats are often found in fast foods and processed foods. They burden your digestive system as they take more effort to process. This can lead to constipation and other intestinal issues especially if your system is already weakened. In the long-term, they can lead to heart problems as well."
        },
        {
          "headline":"Limit processed and packaged foods.",
          "description":"These items often contain high levels of sodium, which can dehydrate you and contribute to depression. This can then damage the recovery process. Processed foods are also tough on the liver, which has to process all of the artificial preservatives. Go with natural or raw food whenever possible. For example, instead of the prepackaged frozen fish sticks, grill a piece of fresh salmon instead."
        },
        {
          "headline":"Keep a close eye on your sugar intake.",
          "description":"Many addicts fall prey to sugar addiction during recovery. Sugar provides a similar high to alcohol and can cause intense cravings as well. These cravings can lead to your reaching for sugar or the prior substance of addiction. It is best to eliminate all, or close to all, sugar from your diet. Part of following a healthy diet is also watching your caloric intake. Sugars provide very few nutrients at a high cost in calories. Sugar tricks your body into thinking it is satisfied."
        },
        {
          "headline":"Avoid caffeinated beverages and foods.",
          "description":"Caffeine is a stimulant and may contribute to mood swings. It can also make it harder for you to resist the temptation of other addictive substances. As a substitute for caffeinated beverages you could try herbal coffee or teas. The taste is similar without the potential negative effects. If you simply cannot live without your coffee, try to limit it to no more than two cups a day. If you choose an herbal tea, chamomile is a good option. It will calm your stomach down by reducing inflammation. Peppermint tea, in contrast, can irritate your digestive system."
        }
      ]
    },
    {
      "name":"Staying Motivated Via Social Interaction",
      "steps":[
        {
          "headline":"Share meals with your friends and family.",
          "description":"Eating does not need to be, and often should not be, a solitary venture. Cook for your friends at home or meet them at a restaurant. Start to view food as both fuel and a means for fun interaction. Tell your friends about your nutritional goals and ask for their cooperation in monitoring your progress."
        },
        {
          "headline":"Shop for groceries with a team.",
          "description":"The \"buddy system\" is often used as a model of accountability in recovery situations. Take this model and adapt it to your new diet. Invite family members or friends that you trust to go shopping with you for groceries. Make this a weekly or bi-weekly plan and, to keep it lively, switch out stores every so often. Add challenges into your grocery shopping excursions. For example, spend time reading the food labels and avoid buying any food item that includes any form of sugar in the first three ingredients."
        },
        {
          "headline":"Take a cooking class.",
          "description":"The more pride you take in your food, the better your diet will be. Enroll in a cooking class for amateurs at your local recreation center or through a cooking school. Most classes meet once a week and focus on a single dish or type of preparation. This will allow you to experience new foods and meet new people, thus moving further into the recovery process."
        },
        {
          "headline":"Work with a nutritionist.",
          "description":"Many recovery programs now include nutritional counseling. If you do not have a nutritionist, look for one online that works in your area. Many of them are affiliated with local hospitals and healthcare centers. You can even go to one that specializes in addiction recovery."
        }
      ]
    }
  ],
  "text":" Following a Recovery-Specific Meal Plan Keep a food journal. Write down exactly what you eat and when you eat it. Make a brief note as to portion sizes as well. Don’t forget to write down what you drink. Keep journaling your food choices until you feel as if you are aware of your dietary patterns and what needs to be adjusted. Writing down everything will help you to differentiate between hunger pangs and a craving for addictive substances. As your body begins to recover, you will see that many of your body’s cues are actually requests for additional nutrients via food. You can also download  smartphone apps that will allow you to track your diet. This may be a more convenient way to store the information, just make sure to keep the entries accurate and up-to-date. Eat small meals throughout the day. Start your day by eating breakfast about 30 minutes after getting out of bed. From that point onward, eat a small meal every two to four hours until your final evening snack. Staying full with a regular snacks and meals will keep your blood sugar consistent and help you resist giving in to other problematic cravings. Carry healthy snack foods with you, such as almonds, so that you nibble on something healthy if you feel hunger pangs. If you need to keep your hands busy, you can choose a more interactive snack such as string cheese, which you can shred and eat piece-by-piece. If you simply don’t feel hungry (lack of appetite is common when in recovery), carry some saltine crackers with you and munch on them whenever you can. This will help to stimulate your appetite, keep your hands busy, and soothe your stomach. All of your meals and snacks throughout the day should total to around 2,000 calories. Try to maintain a balance of 30% calories from fat, 45% calories from carbohydrates, and 25% calories from protein. Watch your portion sizes. Your addiction may have inhibited your ability to sense when you are no longer hungry and full. Monitor your portion sizes by paying attention to product packaging and general nutritional guidelines. Go online and print out a small portion calculator or download an app on your phone to provide portion references for you. One easy method to measuring out portions is comparing the food to parts of your hand. For example, a portion of cheese is the same size as your pointer finger. A portion of chicken should fit on the flat surface of your palm, making it around 3 ounces. Eat at least five servings of fruits and vegetables. Nutrient-dense foods are a critical component of an effective recovery diet. Consuming fresh or raw fruits and vegetables will increase your antioxidant levels, boost your immune system, and help to reverse some of the damage done to your body. Certain fruits and vegetables can target particular elements of your body’s recuperation process. For example, green leafy vegetables, such as spinach, can fight off nausea and intestinal issues. Acidic fruits, such as limes, can improve the functioning of your liver. Experiment with fruits and vegetables by trying out new ones each week. For example, if you’ve never had eggplant before, try making eggplant pasta one night for dinner. This will also prevent you from becoming overly focused on only one type of fruit or vegetable, meaning you will be getting a variety of nutrients. Always thoroughly clean fresh produce prior to consuming, to clean off any potential pesticide residue or harmful bacteria. Make changes gradually. Being in recovery requires a number of major lifestyle changes, so don’t overwhelm yourself by expecting diet perfection overnight. Instead, pick a few areas to work on based on what your food journal shows and what your body tells you. For example, if you eat way too much candy, try to replace some of it with fruit in your diet. Eating Foods that Will Assist in Recovery Consume protein-rich foods. Protein is one of the most important dietary elements for a recovering addict. The amino acids found in proteins can assist in healing your body’s tissues and organs. Protein may also boost positive chemicals in the brain, such as dopamine, providing a barrier against depression. Aim to eat around 10 – 15 grams of protein during each meal or snack session. This will keep you from feeling hungry and will also be easier on your digestive system. Nuts, lean red meats, turkey, and eggs are all good sources of protein. Incorporate fiber-rich foods into your diet. If your addiction led to problems with your digestive system, fiber just might be the answer for you. It will soothe your intestines and get them back on a ‘regular’ schedule. Remove all white flour from your diet and replace it with unrefined and unprocessed whole grains. Whole grain pasta and brown rice are quick and easy fiber options. You can also get fiber from vegetables, such as beans, artichokes, and lentils. If you need an extra fiber boost consider taking a fiber supplement. These come in both caplet and stir-in forms. Add healthy fats to your diet. Not all fats are bad for you. Eating certain fats can actually assist in addiction recovery by boosting fatty acids. This, in turn, helps elevate your mood, turning it away from depression. Healthy fats can also assist in the absorption of vital nutrients from other foods. Olive, coconut, and flaxseed oils all contain healthy fats. Whole foods such as avocado and fish are also good sources. Take a good quality vitamin/mineral supplement. It is likely that your addiction period left you with a serious nutritional deficiency — malnourishment is a common problem among recovering addicts. Eating a balanced diet can counter some of this, but adding a multivitamin will fill in any gaps. You can also take supplements in order to get those good fatty acids in your diet as well. It is important to make your healthcare provider aware of any supplements you are taking, as they can interact with some medications. B vitamins are particularly helpful when recovering from addiction. They elevate brain function and fight against signs of mental fatigue. Vitamin B5, for example, has been shown to help detox the body of harmful chemicals and is often used by recovering alcoholics. Most adults need about 2.4 micrograms of vitamin B daily. Remember that multivitamins are not a “cure all.” You still need to follow a careful diet as part of your recovery process. Drink plenty of water. Try to drink at least eight 8-oz glasses (1.9 liters) of water each day; even more is better. Water will help flush your body of toxins and will hydrate your intestinal tract, which often suffers damage from addiction. Drinking a full glass of water before most meals is one way to reach your goal. If you are struggling with nausea, pour yourself a glass of ice cold water. Take your time drinking it and that alone will help to calm your system. If unflavored water is too bland for you, try adding a lemon slice (or a slice of any other fruit) to each glass. You can also freeze fruit into ice cubes and add them in. Stomach upset can sometimes be a problem during recovery and coconut water has been shown to calm your digestive system. It also contains natural sugar for an energy boost and electrolytes to increase overall hydration. Avoiding Foods that Can Sabotage Recovery Limit saturated fats. These “bad” fats are often found in fast foods and processed foods. They burden your digestive system as they take more effort to process. This can lead to constipation and other intestinal issues especially if your system is already weakened. In the long-term, they can lead to heart problems as well. Limit processed and packaged foods. These items often contain high levels of sodium, which can dehydrate you and contribute to depression. This can then damage the recovery process. Processed foods are also tough on the liver, which has to process all of the artificial preservatives. Go with natural or raw food whenever possible. For example, instead of the prepackaged frozen fish sticks, grill a piece of fresh salmon instead. Keep a close eye on your sugar intake. Many addicts fall prey to sugar addiction during recovery. Sugar provides a similar high to alcohol and can cause intense cravings as well. These cravings can lead to your reaching for sugar or the prior substance of addiction. It is best to eliminate all, or close to all, sugar from your diet. Part of following a healthy diet is also watching your caloric intake. Sugars provide very few nutrients at a high cost in calories. Sugar tricks your body into thinking it is satisfied. Avoid caffeinated beverages and foods. Caffeine is a stimulant and may contribute to mood swings. It can also make it harder for you to resist the temptation of other addictive substances. As a substitute for caffeinated beverages you could try herbal coffee or teas. The taste is similar without the potential negative effects. If you simply cannot live without your coffee, try to limit it to no more than two cups a day. If you choose an herbal tea, chamomile is a good option. It will calm your stomach down by reducing inflammation. Peppermint tea, in contrast, can irritate your digestive system. Staying Motivated Via Social Interaction Share meals with your friends and family. Eating does not need to be, and often should not be, a solitary venture. Cook for your friends at home or meet them at a restaurant. Start to view food as both fuel and a means for fun interaction. Tell your friends about your nutritional goals and ask for their cooperation in monitoring your progress. Shop for groceries with a team. The \"buddy system\" is often used as a model of accountability in recovery situations. Take this model and adapt it to your new diet. Invite family members or friends that you trust to go shopping with you for groceries. Make this a weekly or bi-weekly plan and, to keep it lively, switch out stores every so often. Add challenges into your grocery shopping excursions. For example, spend time reading the food labels and avoid buying any food item that includes any form of sugar in the first three ingredients. Take a cooking class. The more pride you take in your food, the better your diet will be. Enroll in a cooking class for amateurs at your local recreation center or through a cooking school. Most classes meet once a week and focus on a single dish or type of preparation. This will allow you to experience new foods and meet new people, thus moving further into the recovery process. Work with a nutritionist. Many recovery programs now include nutritional counseling. If you do not have a nutritionist, look for one online that works in your area. Many of them are affiliated with local hospitals and healthcare centers. You can even go to one that specializes in addiction recovery.",
  "tyn_model":[
    "vegetables",
    "fruits",
    "water",
    "sugar",
    "protein",
    "fiber",
    "supplements",
    "almonds",
    "string cheese",
    "saltine crackers",
    "small portion calculator",
    "cheese",
    "chicken",
    "spinach",
    "limes",
    "eggplant",
    "eggplant pasta",
    "produce",
    "candy",
    "fruit",
    "proteins",
    "– 15",
    "nuts",
    "turkey",
    "eggs",
    "‘regular",
    "’ schedule",
    "white flour",
    "brown rice",
    "fats",
    "coconut",
    "avocado",
    "fish",
    "vitamin",
    "— malnourishment",
    "multivitamin",
    "b vitamins",
    "vitamin b5",
    "vitamin b",
    "“cure",
    "” you",
    "ice cold water",
    "lemon",
    "ice cubes",
    "coconut water",
    "saturated fats",
    "“bad",
    "” fats",
    "salmon",
    "sugars",
    "caffeine",
    "teas",
    "coffee",
    "chamomile",
    "meals",
    "food",
    "cooking class",
    "nutritional counseling"
  ],
  "tyn_section":[

  ]
}