{
  "title":"How to Pick a Lock in Fallout 3",
  "url":"https://www.wikihow.com/Pick-a-Lock-in-Fallout-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Fallout"
  ],
  "steps":[
    {
      "headline":"Find a lock that you can pick.",
      "description":"To start out, you probably want to find a very easy lock, as this will make it easy to learn how to lockpick."
    },
    {
      "headline":"Next, you need approach the lock and press the correct button (square on Playstation or \"x\" on Xbox) to attempt to pick the lock.",
      "description":""
    },
    {
      "headline":"Pick the lock.",
      "description":"You only have bobby pins and a screwdriver to pick the lock with. You need to move the bobby pin around (by using the left analog stick). Once you have found a spot that you think will unlock the door, use the right analog stick to attempt picking the lock. The screwdriver will turn the lock until it either opens or doesn't move any more. If it stops moving, you need to move around the bobby pin until the lock keeps moving. Once the lock has turned 90 degrees, it will open."
    },
    {
      "headline":"Be careful.",
      "description":"If you hold it too long without the lock moving, the bobby pin will break and you will have to use another. Eventually, you will run out of bobby pins, so you will need to search the Wasteland and find some more."
    }
  ],
  "text":" Find a lock that you can pick. To start out, you probably want to find a very easy lock, as this will make it easy to learn how to lockpick. Next, you need approach the lock and press the correct button (square on Playstation or \"x\" on Xbox) to attempt to pick the lock.  Pick the lock. You only have bobby pins and a screwdriver to pick the lock with. You need to move the bobby pin around (by using the left analog stick). Once you have found a spot that you think will unlock the door, use the right analog stick to attempt picking the lock. The screwdriver will turn the lock until it either opens or doesn't move any more. If it stops moving, you need to move around the bobby pin until the lock keeps moving. Once the lock has turned 90 degrees, it will open. Be careful. If you hold it too long without the lock moving, the bobby pin will break and you will have to use another. Eventually, you will run out of bobby pins, so you will need to search the Wasteland and find some more.",
  "tyn_model":[
    "bobby pins",
    "screwdriver"
  ],
  "tyn_section":[

  ]
}