{
  "title":"How to Choose an Air Compressor",
  "url":"https://www.wikihow.com/Choose-an-Air-Compressor",
  "category_hierarchy":[
    "Home and Garden",
    "Tools"
  ],
  "parts":[
    {
      "name":"Knowing the Basics",
      "steps":[
        {
          "headline":"Analyze the requirements of the equipment that you will be powering.",
          "description":"Are you going to be using the compressor to power machinery or to power pneumatic tools or to simply inflate a tire? You'll probably want a compressor with a tank if you plan on using tools that require high flow. You may want a portable compressor without a tank if you plan on merely using it for air brushing or filling a tire. Since there is no tank to store the compressed air the tankless type will run continuously, which usually isn't an issue since they are usually quite small and therefore make minimal noise. In particular, consider pressure and volume requirements of any tools you may be using. Obviously, heavy-duty tools require much more pressure and, in turn, more volume. If you fail to choose a compressor that's large enough for your intended use, you will find yourself periodically waiting for the tank to fill up, thereby decreasing your work efficiency. If the portable air compressor is for airbrushing, for example, 5 liter (1.3 US gal) a small tank capacity and around 30 psi of sustained air pressure would be adequate."
        },
        {
          "headline":"Understand the types of compressor available.",
          "description":"Essentially, there are two different kinds of air compressors: reciprocating and rotary screw. The most common type you'll likely see for sale somewhere is the reciprocating piston type. It has a cylinder with a piston that moves up and down and a one-way valve on top of the moving piston. Some air compressors utilize a dual piston setup for higher flow and/or pressure. The other type of air compressor is the rotary screw. These are designed for continuous use and are often used with tools that run for several seconds (or minutes) at a time, such as impact wrenches and jackhammers, and in industrial applications. Piston compressors come in single-stage and two stage. Single-stage tops out at about 150 psi. Two-stage compressors use two pistons usually of different size to deliver around 200 psi. The larger piston compresses air to about 100 psi and the second piston compresses that air to near 200 psi. Be aware that a single stage compressor may have two pistons but it is still considered a single-stage, because the second piston will be the same size and only maxes out around 150 psi. The benefit of this design is that it compresses air quicker than a single piston compressor. Just because an air compressor has dual pistons doesn't mean it's a two-stage compressor. Single-stage compressors are adequate for powering most pneumatic tools, caulk guns, spray guns, glue guns, and of course as well as for inflating tires and rafts. Dual piston, whether single or two-stage, compressors are more often used when owners expect higher usage."
        }
      ]
    },
    {
      "name":"Making Specific Determinations",
      "steps":[
        {
          "headline":"Look at the horsepower (HP) of the air compressor.",
          "description":"A common range for horsepower on an air compressor is between 1.5 and 6.5 HP. Air compressors with larger HP capacity exist, but are usually reserved for industrial uses and offer far greater psi. There are many blogs and articles online indicating horsepower ratings have changed in recent years. It is probably best to look at the flow rates instead of HP ratings if you are comparing today's models to much older ones. Small-scale uses won't require as much horsepower as industrial uses. While horsepower is a valuable marker in determining your air compressor, it shouldn't be the only one. More valuable will be a CFM rating, or Cubic Feet per Minute, if you can find one. Read more below for a detailed discussion of CFM."
        },
        {
          "headline":"Try to look at Cubic Feet per Minute (CFM.)",
          "description":"CFM is a measure of volumetric flow. Easy enough, right? The difficult part is that CFM changes depending on the psi of the compressor, meaning that two tools with different psi won't necessarily have CFMs that you can simply add together, which is what you want to be able to do. This is where things get tricky. Let's try to keep it simple:\nLook for or ask about Standard CFM (SCFM) when evaluating compressors. Standard CFM is measured as 14.5 PSIA, at 68 °F (20 °C), with 0% relative humidity. (If you choose not to use SCFM, be sure to use CFM numbers that are all pegged at the same psi.) When you've got the SCFM of all your air tools that you'll be using simultaneously, add up their SCFMs, then add 30% to that as a safety buffer. This should give you the maximum required CFM usage you'll need to complete the job. When choosing an air compressor, you want to get close to this number so that you don't waste time with a too-small unit or waste money on a too-large one. Say, for example, that you're using a grease gun (~4 CFM @ 90 psi), framing nailer (~2 CFM @ 90 psi), and dual sander (~11 CFM @ 90 psi) at approximately the same time. Add all the CFMs to get 17 CFM @ 90 psi as your max required CFM."
        },
        {
          "headline":"Consider space and portability.",
          "description":"For example, will you be able to roll the compressor or lift it off the ground if you need to? Air compressors can be small, portable items or larger, more powerful fixtures. Portability is convenient, but if it will stay in one corner of the garage, you may be able to use a longer hose, instead, and have a higher capacity compressor. Essentially, does this compressor need to supply a nail gun on the roof, or just fill tires in the garage?"
        },
        {
          "headline":"Consider your power source.",
          "description":"Will you have the luxury of electricity at all times, or will you be in environments without electricity? If you'll be next to an outlet at all times, you can choose a drive system with an electric motor. Most electric air compressors will run on 110V (US), but some larger ones run on 240V. Find out before you make the purchase. Alternatively, you'll need to consider mobile air compressor options. Mobile air compressors can run off gasoline or diesel engines, be integrated into a vehicle's existing engine, or use a hydraulic port or other PTO. Fortunately, there are many modern ways to power an air compressor."
        },
        {
          "headline":"If using a tank mounted compressor, determine how large your tank should be.",
          "description":"If you'll only need your air compressor for short bursts of time — such as when using a nail gun — you can get away with having a small tank. If you'll be working for extended periods of time with your compressor, you'll want the tank to be bigger. Tank sizes are usually measured in gallons."
        }
      ]
    }
  ],
  "text":" Knowing the Basics Analyze the requirements of the equipment that you will be powering. Are you going to be using the compressor to power machinery or to power pneumatic tools or to simply inflate a tire? You'll probably want a compressor with a tank if you plan on using tools that require high flow. You may want a portable compressor without a tank if you plan on merely using it for air brushing or filling a tire. Since there is no tank to store the compressed air the tankless type will run continuously, which usually isn't an issue since they are usually quite small and therefore make minimal noise. In particular, consider pressure and volume requirements of any tools you may be using. Obviously, heavy-duty tools require much more pressure and, in turn, more volume. If you fail to choose a compressor that's large enough for your intended use, you will find yourself periodically waiting for the tank to fill up, thereby decreasing your work efficiency. If the portable air compressor is for airbrushing, for example, 5 liter (1.3 US gal) a small tank capacity and around 30 psi of sustained air pressure would be adequate. Understand the types of compressor available. Essentially, there are two different kinds of air compressors: reciprocating and rotary screw. The most common type you'll likely see for sale somewhere is the reciprocating piston type. It has a cylinder with a piston that moves up and down and a one-way valve on top of the moving piston. Some air compressors utilize a dual piston setup for higher flow and/or pressure. The other type of air compressor is the rotary screw. These are designed for continuous use and are often used with tools that run for several seconds (or minutes) at a time, such as impact wrenches and jackhammers, and in industrial applications. Piston compressors come in single-stage and two stage. Single-stage tops out at about 150 psi. Two-stage compressors use two pistons usually of different size to deliver around 200 psi. The larger piston compresses air to about 100 psi and the second piston compresses that air to near 200 psi. Be aware that a single stage compressor may have two pistons but it is still considered a single-stage, because the second piston will be the same size and only maxes out around 150 psi. The benefit of this design is that it compresses air quicker than a single piston compressor. Just because an air compressor has dual pistons doesn't mean it's a two-stage compressor. Single-stage compressors are adequate for powering most pneumatic tools, caulk guns, spray guns, glue guns, and of course as well as for inflating tires and rafts. Dual piston, whether single or two-stage, compressors are more often used when owners expect higher usage. Making Specific Determinations Look at the horsepower (HP) of the air compressor. A common range for horsepower on an air compressor is between 1.5 and 6.5 HP. Air compressors with larger HP capacity exist, but are usually reserved for industrial uses and offer far greater psi. There are many blogs and articles online indicating horsepower ratings have changed in recent years. It is probably best to look at the flow rates instead of HP ratings if you are comparing today's models to much older ones. Small-scale uses won't require as much horsepower as industrial uses. While horsepower is a valuable marker in determining your air compressor, it shouldn't be the only one. More valuable will be a CFM rating, or Cubic Feet per Minute, if you can find one. Read more below for a detailed discussion of CFM. Try to look at Cubic Feet per Minute (CFM.) CFM is a measure of volumetric flow. Easy enough, right? The difficult part is that CFM changes depending on the psi of the compressor, meaning that two tools with different psi won't necessarily have CFMs that you can simply add together, which is what you want to be able to do. This is where things get tricky. Let's try to keep it simple:\nLook for or ask about Standard CFM (SCFM) when evaluating compressors. Standard CFM is measured as 14.5 PSIA, at 68 °F (20 °C), with 0% relative humidity. (If you choose not to use SCFM, be sure to use CFM numbers that are all pegged at the same psi.) When you've got the SCFM of all your air tools that you'll be using simultaneously, add up their SCFMs, then add 30% to that as a safety buffer. This should give you the maximum required CFM usage you'll need to complete the job. When choosing an air compressor, you want to get close to this number so that you don't waste time with a too-small unit or waste money on a too-large one. Say, for example, that you're using a grease gun (~4 CFM @ 90 psi), framing nailer (~2 CFM @ 90 psi), and dual sander (~11 CFM @ 90 psi) at approximately the same time. Add all the CFMs to get 17 CFM @ 90 psi as your max required CFM. Consider space and portability. For example, will you be able to roll the compressor or lift it off the ground if you need to? Air compressors can be small, portable items or larger, more powerful fixtures. Portability is convenient, but if it will stay in one corner of the garage, you may be able to use a longer hose, instead, and have a higher capacity compressor. Essentially, does this compressor need to supply a nail gun on the roof, or just fill tires in the garage? Consider your power source. Will you have the luxury of electricity at all times, or will you be in environments without electricity? If you'll be next to an outlet at all times, you can choose a drive system with an electric motor. Most electric air compressors will run on 110V (US), but some larger ones run on 240V. Find out before you make the purchase. Alternatively, you'll need to consider mobile air compressor options. Mobile air compressors can run off gasoline or diesel engines, be integrated into a vehicle's existing engine, or use a hydraulic port or other PTO. Fortunately, there are many modern ways to power an air compressor. If using a tank mounted compressor, determine how large your tank should be. If you'll only need your air compressor for short bursts of time — such as when using a nail gun — you can get away with having a small tank. If you'll be working for extended periods of time with your compressor, you'll want the tank to be bigger. Tank sizes are usually measured in gallons.",
  "tyn_model":[
    "compressor",
    "air compressor",
    "air compressors",
    "compressors",
    "air",
    "rotary screw",
    "compressed air",
    "impact wrenches",
    "pneumatic tools",
    "caulk guns",
    "spray guns",
    "glue guns",
    "air tools",
    "grease gun",
    "framing nailer",
    "sander",
    "hose",
    "electric air compressors",
    "— such",
    "— you"
  ],
  "tyn_section":[

  ]
}