{
  "title":"How to Play With Bitty Twin American Girl Dolls",
  "url":"https://www.wikihow.com/Play-With-Bitty-Twin-American-Girl-Dolls",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Dolls and Doll Houses",
    "Fashion Dolls",
    "American Girl Dolls"
  ],
  "steps":[
    {
      "headline":"Give them cute names.",
      "description":"For the girls, some names are Hannah, Lilly, or Anna. For boys, some names are Timmy, Toby, Devin, Jack."
    },
    {
      "headline":"Give them personalities.",
      "description":"Since they are twins, you can give them both similar personalities or totally opposite ones."
    },
    {
      "headline":"Buy or make them clothes.",
      "description":"Make sure to make two of the same, so that they can look alike. You could make dresses, shirts, pants, PJ's, and diapers! You could also have them wear clothes that look the same in design, but are in alternate colors."
    },
    {
      "headline":"Give them both beds!",
      "description":"You could make bunks for them by getting two large boxes and four sticks. Tape the sticks to the corners of the boxes and put blankets or towels in for mattresses, pillows, or blankets."
    },
    {
      "headline":"Take them on a stroll together.",
      "description":"Take them in a stroller or hold them, and take a walk through the park. Your bitty twins will love it."
    },
    {
      "headline":"Take them everywhere you go.",
      "description":"Your bitty twins will love it when they get to travel. When you are going on an airplane or even the store, you will have with them wherever you go"
    },
    {
      "headline":"Play with them.",
      "description":"Have tea parties, play \"mommy\", pretend to go fishing, take them to the park and put them in the baby swings, make \"food\" out of Play-Doh and \"feed\" it to them, have a movie night, have a picnic, and/or play with your friends and their dolls!"
    },
    {
      "headline":"Take them on vacation!",
      "description":"Pack their suitcases. Remember to pack medicine, \"food\", toys, diapers, and their clothes."
    },
    {
      "headline":"Take them to the doctors for shots or just a check-up.",
      "description":"Pretend that they are sick and take them to the hospital!"
    },
    {
      "headline":"Keep consistent!",
      "description":"Don't just do this for one day and give up! Remember to change their clothes, put them to sleep, and feed them."
    }
  ],
  "text":" Give them cute names. For the girls, some names are Hannah, Lilly, or Anna. For boys, some names are Timmy, Toby, Devin, Jack. Give them personalities. Since they are twins, you can give them both similar personalities or totally opposite ones. Buy or make them clothes. Make sure to make two of the same, so that they can look alike. You could make dresses, shirts, pants, PJ's, and diapers! You could also have them wear clothes that look the same in design, but are in alternate colors. Give them both beds! You could make bunks for them by getting two large boxes and four sticks. Tape the sticks to the corners of the boxes and put blankets or towels in for mattresses, pillows, or blankets. Take them on a stroll together. Take them in a stroller or hold them, and take a walk through the park. Your bitty twins will love it. Take them everywhere you go. Your bitty twins will love it when they get to travel. When you are going on an airplane or even the store, you will have with them wherever you go Play with them. Have tea parties, play \"mommy\", pretend to go fishing, take them to the park and put them in the baby swings, make \"food\" out of Play-Doh and \"feed\" it to them, have a movie night, have a picnic, and/or play with your friends and their dolls! Take them on vacation! Pack their suitcases. Remember to pack medicine, \"food\", toys, diapers, and their clothes. Take them to the doctors for shots or just a check-up. Pretend that they are sick and take them to the hospital! Keep consistent! Don't just do this for one day and give up! Remember to change their clothes, put them to sleep, and feed them.",
  "tyn_model":[
    "blankets",
    "diapers",
    "towels",
    "play-doh"
  ],
  "tyn_section":[

  ]
}