{
  "title":"How to Embroider the Crinoline Lady Motif",
  "url":"https://www.wikihow.com/Embroider-the-Crinoline-Lady-Motif",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Embroidery"
  ],
  "steps":[
    {
      "headline":"Decide on the appropriate design.",
      "description":"The following designs each represent a different style of the Crinoline lady. Select the one you prefer for stitching. In each case, you can click on them to enlarge. Print off the design for use. ."
    },
    {
      "headline":"Prepare the fabric.",
      "description":"Choose your preferred fabric - linen, cotton, Aida cloth, etc. If the fabric needs ironing or any other preparation beforehand, do so."
    },
    {
      "headline":"Trace the chosen design onto the fabric.",
      "description":"You can use carbon based tracing paper for patterns, free draw from the design, or trace using a window light source if the fabric is transparent enough."
    },
    {
      "headline":"Embroider the design onto the fabric.",
      "description":"Plan in advance:\nStyle of the stitches you will use. It is recommended that you use fancier stitches for creating the flowers and embellished parts of the design. Consider using ribbon embroidery to make the bows and dress ornamentation. Colors. Embellishments (such as sequins, ribbon bows, lace, etc. )."
    },
    {
      "headline":"Stitch the design.",
      "description":"Finish off as desired. Some ways to use your embroidered crinoline lady design include:\nFrame it for a picture\nSew onto a quilt, tea cosy, tablecloth, doll's bedding set, etc."
    }
  ],
  "text":" Decide on the appropriate design. The following designs each represent a different style of the Crinoline lady. Select the one you prefer for stitching. In each case, you can click on them to enlarge. Print off the design for use. . Prepare the fabric. Choose your preferred fabric - linen, cotton, Aida cloth, etc. If the fabric needs ironing or any other preparation beforehand, do so. Trace the chosen design onto the fabric. You can use carbon based tracing paper for patterns, free draw from the design, or trace using a window light source if the fabric is transparent enough. Embroider the design onto the fabric. Plan in advance:\nStyle of the stitches you will use. It is recommended that you use fancier stitches for creating the flowers and embellished parts of the design. Consider using ribbon embroidery to make the bows and dress ornamentation. Colors. Embellishments (such as sequins, ribbon bows, lace, etc. ). Stitch the design. Finish off as desired. Some ways to use your embroidered crinoline lady design include:\nFrame it for a picture\nSew onto a quilt, tea cosy, tablecloth, doll's bedding set, etc.",
  "tyn_model":[
    "fabric",
    "crinoline lady",
    "carbon based tracing paper",
    "ribbon embroidery",
    "quilt",
    "tea cosy,"
  ],
  "tyn_section":[

  ]
}