{
  "title":"How to Make Smoothie Popsicles",
  "url":"https://www.wikihow.com/Make-Smoothie-Popsicles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Ice Pops"
  ],
  "methods":[
    {
      "name":"Making Berry and Soya Popsicles",
      "steps":[
        {
          "headline":"Add three to six tablespoons of vanilla soya yogurt.",
          "description":"You can vary the amount of yogurt added in to fit your liking."
        },
        {
          "headline":"Put in two cups of berries.",
          "description":"It doesn't matter what berries you use strawberries, raspberries, blueberries or blackberries. Frozen fruit works well but seeing as it is going to be frozen anyway it doesn't matter so much."
        },
        {
          "headline":"Squeeze the juice of a whole orange in if you want.",
          "description":"You don't need to add an orange but it can give it a nice flavour if you do."
        },
        {
          "headline":"Sprinkle in a little pinch of sugar.",
          "description":"The sugar makes the popsicle sweet. If your yogurt already has sugar in it you might want to miss out this step."
        },
        {
          "headline":"Blend it until smooth.",
          "description":"If you don't have a blender an alternative is to use a masher, it won't work as well but it will break the berries down smaller."
        },
        {
          "headline":"Pour the smoothie mixture into popsicle molds or small plastic cups when it is properly blended and add a popsicle stick in.",
          "description":"Don't fill them to the very top or of will most likely overflow."
        },
        {
          "headline":"Leave them in the freezer for a day or so until they are frozen.",
          "description":""
        },
        {
          "headline":"Enjoy!",
          "description":""
        }
      ]
    },
    {
      "name":"Making Tropical Popsicles",
      "steps":[
        {
          "headline":"Pour in ½ a cup of coconut milk into the measuring jug.",
          "description":"Regular milk works too but it doesn't have the same effect as coconut milk has."
        },
        {
          "headline":"Peel and cut two ripe kiwis.",
          "description":"Add them to the jug."
        },
        {
          "headline":"Cut up a whole or half mango into small pieces.",
          "description":"Put it in the jug."
        },
        {
          "headline":"Core, peel, and cut a pear for the smoothie.",
          "description":"Make sure that the pear is ripe and soft as hard pears don't taste as nice and are hard to blend."
        },
        {
          "headline":"Blend or mash the mixture until it is fine.",
          "description":"If it is too hard to blend add in a bit more coconut milk to make it more liquid."
        },
        {
          "headline":"Break or cut two pineapple rings into small chunks.",
          "description":"Place them in the smoothie. If you don't want pineapple chunks in there, you can leave them out."
        },
        {
          "headline":"Pour it into popsicle molds taking care not to spill or overfill.",
          "description":""
        },
        {
          "headline":"Freeze in the freezer until they are solid.",
          "description":""
        },
        {
          "headline":"Enjoy!",
          "description":""
        }
      ]
    },
    {
      "name":"Making Banana Popsicles",
      "steps":[
        {
          "headline":"Remove the skin of two or three bananas.",
          "description":"Chop them up into small slices and place them in a jug."
        },
        {
          "headline":"Measure out one and a half cups of almond milk and add it to the bananas.",
          "description":""
        },
        {
          "headline":"Add a teaspoon of peanut butter.",
          "description":"If you are allergic to peanuts, leave it out."
        },
        {
          "headline":"Put half a teaspoon of cinnamon in the jug to add spice.",
          "description":""
        },
        {
          "headline":"Blend it well.",
          "description":"Make sure all the ingredients are well mixed."
        },
        {
          "headline":"Fill the popsicle molds almost to the top.",
          "description":""
        },
        {
          "headline":"Freeze them for a day until they are properly frozen solid.",
          "description":""
        },
        {
          "headline":"Enjoy!",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Berry and Soya Popsicles Add three to six tablespoons of vanilla soya yogurt. You can vary the amount of yogurt added in to fit your liking. Put in two cups of berries. It doesn't matter what berries you use strawberries, raspberries, blueberries or blackberries. Frozen fruit works well but seeing as it is going to be frozen anyway it doesn't matter so much. Squeeze the juice of a whole orange in if you want. You don't need to add an orange but it can give it a nice flavour if you do. Sprinkle in a little pinch of sugar. The sugar makes the popsicle sweet. If your yogurt already has sugar in it you might want to miss out this step. Blend it until smooth. If you don't have a blender an alternative is to use a masher, it won't work as well but it will break the berries down smaller. Pour the smoothie mixture into popsicle molds or small plastic cups when it is properly blended and add a popsicle stick in. Don't fill them to the very top or of will most likely overflow. Leave them in the freezer for a day or so until they are frozen.  Enjoy!  Making Tropical Popsicles Pour in ½ a cup of coconut milk into the measuring jug. Regular milk works too but it doesn't have the same effect as coconut milk has. Peel and cut two ripe kiwis. Add them to the jug. Cut up a whole or half mango into small pieces. Put it in the jug. Core, peel, and cut a pear for the smoothie. Make sure that the pear is ripe and soft as hard pears don't taste as nice and are hard to blend. Blend or mash the mixture until it is fine. If it is too hard to blend add in a bit more coconut milk to make it more liquid. Break or cut two pineapple rings into small chunks. Place them in the smoothie. If you don't want pineapple chunks in there, you can leave them out. Pour it into popsicle molds taking care not to spill or overfill.  Freeze in the freezer until they are solid.  Enjoy!  Making Banana Popsicles Remove the skin of two or three bananas. Chop them up into small slices and place them in a jug. Measure out one and a half cups of almond milk and add it to the bananas.  Add a teaspoon of peanut butter. If you are allergic to peanuts, leave it out. Put half a teaspoon of cinnamon in the jug to add spice.  Blend it well. Make sure all the ingredients are well mixed. Fill the popsicle molds almost to the top.  Freeze them for a day until they are properly frozen solid.  Enjoy! ",
  "tyn_model":[
    "popsicle molds",
    "coconut milk",
    "jug",
    "yogurt",
    "sugar",
    "pear",
    "bananas",
    "vanilla soya yogurt",
    "berries",
    "strawberries",
    "blueberries",
    "fruit",
    "orange",
    "blender",
    "masher",
    "popsicle stick",
    "measuring jug",
    "milk",
    "mango",
    "pineapple rings",
    "pineapple",
    "freezer",
    "almond milk",
    "peanut butter",
    "cinnamon"
  ],
  "tyn_section":[

  ]
}