{
  "title":"How to Learn Drawing Online",
  "url":"https://www.wikihow.com/Learn-Drawing-Online",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Learning to Draw"
  ],
  "methods":[
    {
      "name":"Finding Free Resources",
      "steps":[
        {
          "headline":"Purchase your sketchbook and drawing materials from an art store.",
          "description":"Choose between drawing or sketch paper, and buy at least four to seven different pencils in a varying hardness levels. At a minimum, you should get a rubber eraser and a kneaded eraser. You can also purchase colored pencils and charcoal for other drawing projects. Don’t forget the pencil sharpener! Sketchbooks and drawing pads come in a variety of sizes, and any size will work just fine. Choose a book that works for you. You can get one with an attractive cover or decorate your own! A #2 pencil is an “HB” drawing pencil. For softer, darker marks, use pencils B-9B. For harder, lighter marks, use pencils H-9H. A standard set usually comes with pencils 8B, 7B, 6B, 5B, 4B, 3B, 2B, B, HB, F, H, 2H."
        },
        {
          "headline":"Assess your skill level, to search for lessons based on your experience.",
          "description":"Online lessons usually break down into either beginner, intermediate, or advanced drawing. Decide on your experience level to help specify what kind of drawing lessons you should look for. Are you just picking up a pencil for the first time? Did you take 1 or 2 classes in school? Or are you an avid artist looking for new skills?"
        },
        {
          "headline":"Search online for specific kinds of drawing instruction.",
          "description":"Base your search query on your skill level and drawing interests, and browse your results. You can be specific or general with your searches. For beginners, search for something like \"Drawing lessons for beginners,\" \"Free basic illustration tutorials,\" and \"Beginner drawing tutorials. For intermediate artists, you can search for something like, \"How to draw perspective,\" \"Intermediate drawing lessons,\" and \"Drawing landscapes.\" For advanced drawers, search for \"Drawing mastery course,\" \"Advanced drawing techniques,\" and \"Drawing anatomy.\""
        },
        {
          "headline":"Select a website with lessons that meet your learning style.",
          "description":"There are countless websites that can get you started. You will get the best instruction if you select websites that seem easy-to-follow and fun. You can follow along with step-by-step instructions with visual aids, watch a video tutorial, download printable PDF instructions, or use a combination approach. Use websites like DeviantArt, Drawspace, Drawing Coach, Academy of Art University, Daily Sketch Challenge, and Pinterest."
        },
        {
          "headline":"Experiment with different drawing lesson formats.",
          "description":"After you've tried one method, give another approach a shot! You may find you prefer another method after you experiment with a few options. Try a variety of instructions to improve your skills. Maybe at first you followed a step-by-step guide off the internet, but perhaps printing out the instructions and looking at a physical copy will also be helpful."
        },
        {
          "headline":"Search YouTube for free video instructions.",
          "description":"Use search queries on your drawing interests and skill level, and look up tutorials on YouTube. Video instruction can be helpful because you get to watch and see how someone else completes the drawing. You can learn how to draw things like animals, people, flowers, landscapes, and manga. Drawing techniques you can study include highlighting, shading, cross hatching, still life, perspective drawing, and textures. Search for things like “Drawing for beginners,” “Drawing faces,” “Figure drawing lessons,” or “How to draw a rose.”"
        },
        {
          "headline":"Complete drawing lessons from quality resources.",
          "description":"There are so many different resources online to learn to draw, though you want to be sure you are following the most reliable, helpful lessons. Review the website before you start. Look for things like the author of the site (accredited website or personal blog), variety of lessons available, experience of the person providing the lesson, the ratings, and number of views."
        }
      ]
    },
    {
      "name":"Taking Drawing Courses Online",
      "steps":[
        {
          "headline":"Search for paid drawing courses based on your skill level and interests.",
          "description":"Type “Drawing courses” into Google, and look for an interesting course. Search for things like, \"drawing course for beginner\" and \"advanced online drawing course.\""
        },
        {
          "headline":"Review the different kinds of online drawing courses.",
          "description":"You will find some drawing courses by accredited programs, online college courses, and stand-alone courses taught by professionals. Courses can cost anywhere from a few dollars to a few hundred dollars, so be mindful of your budget as you select a course. Look for courses in your budget that seem helpful and informative. Watch a course preview if available. This will give you an overview of what the source has to offer."
        },
        {
          "headline":"Choose quality courses by reviewing the course and reading reviews.",
          "description":"When you find a course that interests you, check to see if there are any ratings and reviews written from previous students. Look for when the course was last updated and how many students have enrolled in total. Read the instructor biography if available. You can also scroll through the course to get an idea of what it will cover. Some websites will have a Frequently Asked Questions section which can be helpful when deciding what course to take. Keep an eye out for scammers! While there are a ton of great online sources, sometimes you will find sites trying to trick you. Do a search on the particular course you've found to make sure it is legitimate."
        },
        {
          "headline":"Select your course format to get started.",
          "description":"Some courses will offer videos, downloadable PDFs, and step-by-step options. Other courses will offer live video classes in real time. Choose a method that works for you, and get drawing! If you prefer going at your own pace, try the step-by-step option. If you like to see how something is done before you try it yourself, video tutorials will work well for you. If you need a bit more assistance, try taking a course with live instruction to get more personal lessons."
        },
        {
          "headline":"Gather the materials outlined by the course.",
          "description":"After you've selected your course, review the required materials detailed on the course information page. The instructions will let you know if you need any particular pencils or erasers, or additional supplies like a ruler or compass. Beginner courses likely will have you use pencils, paper, and erasers. More advanced courses will list other materials like charcoal or pen and ink."
        }
      ]
    },
    {
      "name":"Practicing Your Skills",
      "steps":[
        {
          "headline":"Get into a drawing routine to practice your skills.",
          "description":"Set aside time in your day to draw, whether it be 30 minutes or 3 hours. Pick the same time every day, and stick with it. Working on a routine will subconsciously make drawing a habit, and your art will look better the more you practice. Sketch every day if you can. If not, try to sketch at least 3 times a week. At first, try to draw about one to two hours a day. If you want to see major improvements, up your time to about four to six hours a day or more!"
        },
        {
          "headline":"Carry your sketchbook with you and draw in your free time.",
          "description":"In addition to establishing a drawing routine, have your sketchbook on you at all times and take advantage of any down time. Sketch what you see around you or what pops into your imagination. Draw in between classes, on the bus, or as you eat lunch."
        },
        {
          "headline":"Build upon each lesson to expand your skills.",
          "description":"After you’ve finished a lesson or mastered a technique, search for the next one. Many sites offer lessons in sequence, like a 30-day sketching challenge or an 8-part workshop. You can follow your lessons in order if you’d like, or search for something else. For example, maybe you finished a lesson on how to shade a sphere. You can learn how to shade cubes, or maybe search for a drawing lesson on perspective drawing instead."
        },
        {
          "headline":"Make your drawing your own with extra detail or color.",
          "description":"Remember art is all about self-expression. The lessons are there to teach you the skill, and you can always build off of your piece. Your finished product doesn’t have to look exactly like the original. Use your creativity, and make your piece your own! For example, if you complete a tutorial on how to draw a basic landscape, add detail with some colored pencils."
        },
        {
          "headline":"Keep track of your progress by cataloging and saving your work.",
          "description":"Flip through your sketchbook pages and see what you’ve drawn. You can also save your work, either to your YouTube account, your bookmarks bar, or to a document. This way you can see how far you’ve come and prioritize what else you want to learn."
        }
      ]
    }
  ],
  "text":" Finding Free Resources Purchase your sketchbook and drawing materials from an art store. Choose between drawing or sketch paper, and buy at least four to seven different pencils in a varying hardness levels. At a minimum, you should get a rubber eraser and a kneaded eraser. You can also purchase colored pencils and charcoal for other drawing projects. Don’t forget the pencil sharpener! Sketchbooks and drawing pads come in a variety of sizes, and any size will work just fine. Choose a book that works for you. You can get one with an attractive cover or decorate your own! A #2 pencil is an “HB” drawing pencil. For softer, darker marks, use pencils B-9B. For harder, lighter marks, use pencils H-9H. A standard set usually comes with pencils 8B, 7B, 6B, 5B, 4B, 3B, 2B, B, HB, F, H, 2H. Assess your skill level, to search for lessons based on your experience. Online lessons usually break down into either beginner, intermediate, or advanced drawing. Decide on your experience level to help specify what kind of drawing lessons you should look for. Are you just picking up a pencil for the first time? Did you take 1 or 2 classes in school? Or are you an avid artist looking for new skills? Search online for specific kinds of drawing instruction. Base your search query on your skill level and drawing interests, and browse your results. You can be specific or general with your searches. For beginners, search for something like \"Drawing lessons for beginners,\" \"Free basic illustration tutorials,\" and \"Beginner drawing tutorials. For intermediate artists, you can search for something like, \"How to draw perspective,\" \"Intermediate drawing lessons,\" and \"Drawing landscapes.\" For advanced drawers, search for \"Drawing mastery course,\" \"Advanced drawing techniques,\" and \"Drawing anatomy.\" Select a website with lessons that meet your learning style. There are countless websites that can get you started. You will get the best instruction if you select websites that seem easy-to-follow and fun. You can follow along with step-by-step instructions with visual aids, watch a video tutorial, download printable PDF instructions, or use a combination approach. Use websites like DeviantArt, Drawspace, Drawing Coach, Academy of Art University, Daily Sketch Challenge, and Pinterest. Experiment with different drawing lesson formats. After you've tried one method, give another approach a shot! You may find you prefer another method after you experiment with a few options. Try a variety of instructions to improve your skills. Maybe at first you followed a step-by-step guide off the internet, but perhaps printing out the instructions and looking at a physical copy will also be helpful. Search YouTube for free video instructions. Use search queries on your drawing interests and skill level, and look up tutorials on YouTube. Video instruction can be helpful because you get to watch and see how someone else completes the drawing. You can learn how to draw things like animals, people, flowers, landscapes, and manga. Drawing techniques you can study include highlighting, shading, cross hatching, still life, perspective drawing, and textures. Search for things like “Drawing for beginners,” “Drawing faces,” “Figure drawing lessons,” or “How to draw a rose.” Complete drawing lessons from quality resources. There are so many different resources online to learn to draw, though you want to be sure you are following the most reliable, helpful lessons. Review the website before you start. Look for things like the author of the site (accredited website or personal blog), variety of lessons available, experience of the person providing the lesson, the ratings, and number of views. Taking Drawing Courses Online Search for paid drawing courses based on your skill level and interests. Type “Drawing courses” into Google, and look for an interesting course. Search for things like, \"drawing course for beginner\" and \"advanced online drawing course.\" Review the different kinds of online drawing courses. You will find some drawing courses by accredited programs, online college courses, and stand-alone courses taught by professionals. Courses can cost anywhere from a few dollars to a few hundred dollars, so be mindful of your budget as you select a course. Look for courses in your budget that seem helpful and informative. Watch a course preview if available. This will give you an overview of what the source has to offer. Choose quality courses by reviewing the course and reading reviews. When you find a course that interests you, check to see if there are any ratings and reviews written from previous students. Look for when the course was last updated and how many students have enrolled in total. Read the instructor biography if available. You can also scroll through the course to get an idea of what it will cover. Some websites will have a Frequently Asked Questions section which can be helpful when deciding what course to take. Keep an eye out for scammers! While there are a ton of great online sources, sometimes you will find sites trying to trick you. Do a search on the particular course you've found to make sure it is legitimate. Select your course format to get started. Some courses will offer videos, downloadable PDFs, and step-by-step options. Other courses will offer live video classes in real time. Choose a method that works for you, and get drawing! If you prefer going at your own pace, try the step-by-step option. If you like to see how something is done before you try it yourself, video tutorials will work well for you. If you need a bit more assistance, try taking a course with live instruction to get more personal lessons. Gather the materials outlined by the course. After you've selected your course, review the required materials detailed on the course information page. The instructions will let you know if you need any particular pencils or erasers, or additional supplies like a ruler or compass. Beginner courses likely will have you use pencils, paper, and erasers. More advanced courses will list other materials like charcoal or pen and ink. Practicing Your Skills Get into a drawing routine to practice your skills. Set aside time in your day to draw, whether it be 30 minutes or 3 hours. Pick the same time every day, and stick with it. Working on a routine will subconsciously make drawing a habit, and your art will look better the more you practice. Sketch every day if you can. If not, try to sketch at least 3 times a week. At first, try to draw about one to two hours a day. If you want to see major improvements, up your time to about four to six hours a day or more! Carry your sketchbook with you and draw in your free time. In addition to establishing a drawing routine, have your sketchbook on you at all times and take advantage of any down time. Sketch what you see around you or what pops into your imagination. Draw in between classes, on the bus, or as you eat lunch. Build upon each lesson to expand your skills. After you’ve finished a lesson or mastered a technique, search for the next one. Many sites offer lessons in sequence, like a 30-day sketching challenge or an 8-part workshop. You can follow your lessons in order if you’d like, or search for something else. For example, maybe you finished a lesson on how to shade a sphere. You can learn how to shade cubes, or maybe search for a drawing lesson on perspective drawing instead. Make your drawing your own with extra detail or color. Remember art is all about self-expression. The lessons are there to teach you the skill, and you can always build off of your piece. Your finished product doesn’t have to look exactly like the original. Use your creativity, and make your piece your own! For example, if you complete a tutorial on how to draw a basic landscape, add detail with some colored pencils. Keep track of your progress by cataloging and saving your work. Flip through your sketchbook pages and see what you’ve drawn. You can also save your work, either to your YouTube account, your bookmarks bar, or to a document. This way you can see how far you’ve come and prioritize what else you want to learn.",
  "tyn_model":[
    "pencil",
    "colored pencils",
    "charcoal",
    "“drawing",
    "” “",
    "drawing courses",
    "erasers",
    "sketch",
    "sketchbook",
    "sketchbook and",
    "art store",
    "sketch paper",
    "rubber eraser",
    "pencil sharpener",
    "sketchbooks",
    "“hb",
    "” drawing",
    "daily sketch challenge",
    "drawing lesson",
    "drawing",
    "” or",
    "“how",
    "” complete",
    "drawing lessons",
    "” into",
    "ruler",
    "compass",
    "pencils",
    "paper",
    "pen and ink",
    "sketchbook pages"
  ],
  "tyn_section":[

  ]
}