{
  "title":"How to Make a Quick Dish of Spaghetti and Tomato Sauce",
  "url":"https://www.wikihow.com/Make-a-Quick-Dish-of-Spaghetti-and-Tomato-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Spaghetti"
  ],
  "steps":[
    {
      "headline":"Fill a medium sized pot about 3/4 of the way full with warm water.",
      "description":""
    },
    {
      "headline":"Add a teaspoon of salt to help the spaghetti soak up the water faster and a 1/4 of olive oil to keep the pasta from sticking together.",
      "description":""
    },
    {
      "headline":"Turn stove on high and carefully place the pot onto the burner.",
      "description":""
    },
    {
      "headline":"Allow the water to come to a boil.",
      "description":"Set a timer for 10 minutes."
    },
    {
      "headline":"Open the container of tomato pasta sauce and empty it into a smaller pot.",
      "description":"Whilst no guarantee of quality, a more expensive sauce may be nicer than a budget sauce."
    },
    {
      "headline":"Cover the sauce pan of sauce with a lid.",
      "description":"Leave it to simmer on medium heat. Be sure to stir the sauce periodically to heat it evenly. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/89\\/Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\\/v4-459px-Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/89\\/Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\\/v4-759px-Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Empty the entire package of pasta into the water.",
      "description":""
    },
    {
      "headline":"Use spoon to stir the pasta into the water.",
      "description":"Set the timer for another 10 minutes. 10 minutes is the average to achieve an \"al dente\" (cooked, but not hard) texture. Consider double checking the pasta packaging for the suggested times, as different kinds of spaghetti requires different times."
    },
    {
      "headline":"Place a strainer in the sink.",
      "description":""
    },
    {
      "headline":"Drain the spaghetti into the strainer.",
      "description":"Have caution concerning the boiling water; it's advisable to pour away from you to avoid potential splashing."
    },
    {
      "headline":"Run cool water over the pasta for 15 seconds in order to stop it from cooking.",
      "description":""
    },
    {
      "headline":"Shake the pasta in the strainer.",
      "description":"Make sure all the excess water is out."
    },
    {
      "headline":"Take your sauce which should be hot and ready off the burner.",
      "description":""
    },
    {
      "headline":"Pour the pasta in a larger bowl and serve the sauce over top.",
      "description":""
    },
    {
      "headline":"Serve with garlic bread and Parmesan cheese or just eat the spaghetti.",
      "description":""
    }
  ],
  "text":" Fill a medium sized pot about 3/4 of the way full with warm water.  Add a teaspoon of salt to help the spaghetti soak up the water faster and a 1/4 of olive oil to keep the pasta from sticking together.  Turn stove on high and carefully place the pot onto the burner.  Allow the water to come to a boil. Set a timer for 10 minutes. Open the container of tomato pasta sauce and empty it into a smaller pot. Whilst no guarantee of quality, a more expensive sauce may be nicer than a budget sauce. Cover the sauce pan of sauce with a lid. Leave it to simmer on medium heat. Be sure to stir the sauce periodically to heat it evenly. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/89\\/Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\\/v4-459px-Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/89\\/Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\\/v4-759px-Make-a-Delicious-Dish-of-Spaghetti-and-Tomato-Sauce-Step-7.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Empty the entire package of pasta into the water.  Use spoon to stir the pasta into the water. Set the timer for another 10 minutes. 10 minutes is the average to achieve an \"al dente\" (cooked, but not hard) texture. Consider double checking the pasta packaging for the suggested times, as different kinds of spaghetti requires different times. Place a strainer in the sink.  Drain the spaghetti into the strainer. Have caution concerning the boiling water; it's advisable to pour away from you to avoid potential splashing. Run cool water over the pasta for 15 seconds in order to stop it from cooking.  Shake the pasta in the strainer. Make sure all the excess water is out. Take your sauce which should be hot and ready off the burner.  Pour the pasta in a larger bowl and serve the sauce over top.  Serve with garlic bread and Parmesan cheese or just eat the spaghetti. ",
  "tyn_model":[
    "water",
    "sauce",
    "strainer",
    "pot",
    "medium sized pot",
    "salt",
    "olive oil",
    "stove",
    "tomato pasta sauce",
    "sauce pan",
    "pasta",
    "spoon",
    "bowl",
    "garlic bread",
    "parmesan cheese",
    "spaghetti"
  ],
  "tyn_section":[

  ]
}