{
  "title":"How to Replace Colors on MediBang Paint Pro",
  "url":"https://www.wikihow.com/Replace-Colors-on-MediBang-Paint-Pro",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Digital Technology Art and Craft Projects"
  ],
  "steps":[
    {
      "headline":"Decide which area you want to change.",
      "description":"Should this section be a little bluer? Maybe having these lines pink would complement the vase better."
    },
    {
      "headline":"Choose the layer that has the element you want to change.",
      "description":""
    },
    {
      "headline":"Click \"Protect Alpha\".",
      "description":"It is the first of three checkboxes above the layers. If you've activated it, you should see a little x in the square. Protect Alpha will make it so that you can only draw on areas that you have already drawn on in that layer, and so you can't draw on any other layer."
    },
    {
      "headline":"Adjust your brush size.",
      "description":"Make it bigger or smaller depending on what you want to achieve. If you're trying to change a larger area or trace over all of the lines in one drawing, make your brush size bigger. The biggest it can be is 1000. If you're trying to make more precise details, or there is a lot of clutter in a specific part you want to focus on, make the brush smaller. The smallest it can be is 1."
    },
    {
      "headline":"Change the brush color.",
      "description":"Make it the color that you want your lines to be. Try experimenting with different levels of saturation. The brush preview window will not show you the color of your brush. It will show you the size, transparency, and type, but not color. You could try experimenting with a new layer to see how your new color will look before you actually apply it. Once you've found the right one, simply delete this layer."
    },
    {
      "headline":"Click and drag using your brush over the whole canvas.",
      "description":"Only the elements in the selected layer will change color, leaving you with transformed (yet clean) lines."
    }
  ],
  "text":" Decide which area you want to change. Should this section be a little bluer? Maybe having these lines pink would complement the vase better. Choose the layer that has the element you want to change.  Click \"Protect Alpha\". It is the first of three checkboxes above the layers. If you've activated it, you should see a little x in the square. Protect Alpha will make it so that you can only draw on areas that you have already drawn on in that layer, and so you can't draw on any other layer. Adjust your brush size. Make it bigger or smaller depending on what you want to achieve. If you're trying to change a larger area or trace over all of the lines in one drawing, make your brush size bigger. The biggest it can be is 1000. If you're trying to make more precise details, or there is a lot of clutter in a specific part you want to focus on, make the brush smaller. The smallest it can be is 1. Change the brush color. Make it the color that you want your lines to be. Try experimenting with different levels of saturation. The brush preview window will not show you the color of your brush. It will show you the size, transparency, and type, but not color. You could try experimenting with a new layer to see how your new color will look before you actually apply it. Once you've found the right one, simply delete this layer. Click and drag using your brush over the whole canvas. Only the elements in the selected layer will change color, leaving you with transformed (yet clean) lines.",
  "tyn_model":[
    "brush",
    "vase"
  ],
  "tyn_section":[

  ]
}