{
  "title":"How to Recycle Cables",
  "url":"https://www.wikihow.com/Recycle-Cables",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Disposing of Old and Unused Cables",
      "steps":[
        {
          "headline":"Drop off a collection of cables at an electronics recycling center.",
          "description":"These places often have collection boxes on-site where you can go to deposit unwanted electronic components. Your junk hookups will be recycled right there at the facility, and you can rest easy knowing that you’ve done your part to clean up the planet. For information on recycling centers in your area, run a search for \"electronics recycling\" and the name of your city. If you live in the U.S., you can also visit Earth911.com or contact the National Center for Electronics Recycling using the form provided on their website."
        },
        {
          "headline":"Take your accessories to a tech store for recycling.",
          "description":"Big-name chain retailers like Best Buy and Staples provide free recycling services for customers looking to get rid of unused electronics. Look for a bin or kiosk marked “Recycling” upon entering the store and simply dump your accessories there. They’ll typically see to the disposal of cords, cables, wires, and even rechargeable batteries. Not all stores offer recycling. You may have to call a few different locations to find one that will take your materials."
        },
        {
          "headline":"Take advantage of Apple’s Renew program.",
          "description":"Return proprietary parts from Apple devices like iPhones and MacBooks to any Apple Store and let them take care of the rest. You can even apply for a free shipping label online to send in your devices without ever having to set foot in a store. For every device you turn in, you’ll be rewarded with an online gift card or credit for in-store purchases. Apple accepts trade-ins on a wide range of devices from any generation, including iPhones, iPads, iPods, Apple Watches, Apple TVS, desktop and notebook computers, and all of their accompanying cables. Any devices that aren’t refurbished will be recycled and used to make new products."
        },
        {
          "headline":"Attend an e-waste collection event.",
          "description":"In many places, particularly big cities, nonprofit businesses and special interest groups have been known to host collection events in an effort to reduce the amount of electronic waste (or “e-waste”) floating around. All you have to do is box up whatever cords and cables you no longer have a use for. The attendants will sort, inventory, and prepare them for processing. Check the community events section of your local newspaper to learn when and where e-waste collection events are happening near you. Generally, any device or accessory containing materials like lead, cadmium, beryllium, or brominated cyclic hydrocarbons that may be harmful to the environment falls into the category of e-waste."
        }
      ]
    },
    {
      "name":"Finding Other Uses for Cables",
      "steps":[
        {
          "headline":"Give your unused accessories to a friend or family member.",
          "description":"Before you start looking for a place to offload newer accessories, see if someone you know might be able to use them. You could end up saving them the trouble and expense of shopping for a replacement. They’ll get the piece they need and you won’t have to worry about it cluttering up your nightstand anymore. Components like charging cords and adaptor cables don’t tend to change much through subsequent generations, which means they’re more likely to be compatible with newer devices. Post about the items you’re parting with on social media to reach more eyes. Be sure to include a few photos so interested acquaintances know they’re getting the right part."
        },
        {
          "headline":"Reuse cables for other devices.",
          "description":"Some types of accessories are less device-specific than others. A USB cord is a USB cord, for instance, and can be used on any device with a USB port. Familiarizing yourself with the connectors of your various devices can be a good way to get more use out of a cable if you have one that’s missing its mate. HDMI, A/V, and coaxial cables are feature a universal construction that makes them interchangeable between many different types of electronics, from computers to video recording equipment. Even a specially-designed component like Apple’s lightning charger cord can be plugged into any iPhone, iPad, or iPod manufactured after 2012."
        },
        {
          "headline":"Donate your cords and cables to a local STEM program.",
          "description":"Schools and hobby groups, such as the Boy Scouts and audio/video clubs, sometimes use electronic accessories like power cords as part of their technology education curriculum. Run a search for STEM programs being advertised in your town and see what sorts of items they’re asking for. Chances are, they’ll be pleased with whatever you contribute. Since these programs are mostly concerned with studying technology, they may be willing to accept parts that are considered outdated or obsolete."
        },
        {
          "headline":"Sell raw materials for salvage.",
          "description":"If you’re looking for a way to turn a tangle of cables into quick cash, consider mining them for the materials inside. Conductive metals like pure copper and nickel are highly sought after by scrap metal dealers, who melt them down and sell them to vendors. Copper, in particular, is very valuable—in many markets, it can go for as much as $3 per pound. Contact your local scrapyard or metal recycling center and ask about their criteria for accepting salvage metals. Some dealers are happy to handle the extraction process themselves, while others may expect you to have the raw materials ready before you bring them in. Be aware that copper theft is a felony offense. The only time you should attempt to mine raw copper for sale is when it comes from an electronic component that you purchased legally."
        }
      ]
    }
  ],
  "text":" Disposing of Old and Unused Cables Drop off a collection of cables at an electronics recycling center. These places often have collection boxes on-site where you can go to deposit unwanted electronic components. Your junk hookups will be recycled right there at the facility, and you can rest easy knowing that you’ve done your part to clean up the planet. For information on recycling centers in your area, run a search for \"electronics recycling\" and the name of your city. If you live in the U.S., you can also visit Earth911.com or contact the National Center for Electronics Recycling using the form provided on their website. Take your accessories to a tech store for recycling. Big-name chain retailers like Best Buy and Staples provide free recycling services for customers looking to get rid of unused electronics. Look for a bin or kiosk marked “Recycling” upon entering the store and simply dump your accessories there. They’ll typically see to the disposal of cords, cables, wires, and even rechargeable batteries. Not all stores offer recycling. You may have to call a few different locations to find one that will take your materials. Take advantage of Apple’s Renew program. Return proprietary parts from Apple devices like iPhones and MacBooks to any Apple Store and let them take care of the rest. You can even apply for a free shipping label online to send in your devices without ever having to set foot in a store. For every device you turn in, you’ll be rewarded with an online gift card or credit for in-store purchases. Apple accepts trade-ins on a wide range of devices from any generation, including iPhones, iPads, iPods, Apple Watches, Apple TVS, desktop and notebook computers, and all of their accompanying cables. Any devices that aren’t refurbished will be recycled and used to make new products. Attend an e-waste collection event. In many places, particularly big cities, nonprofit businesses and special interest groups have been known to host collection events in an effort to reduce the amount of electronic waste (or “e-waste”) floating around. All you have to do is box up whatever cords and cables you no longer have a use for. The attendants will sort, inventory, and prepare them for processing. Check the community events section of your local newspaper to learn when and where e-waste collection events are happening near you. Generally, any device or accessory containing materials like lead, cadmium, beryllium, or brominated cyclic hydrocarbons that may be harmful to the environment falls into the category of e-waste. Finding Other Uses for Cables Give your unused accessories to a friend or family member. Before you start looking for a place to offload newer accessories, see if someone you know might be able to use them. You could end up saving them the trouble and expense of shopping for a replacement. They’ll get the piece they need and you won’t have to worry about it cluttering up your nightstand anymore. Components like charging cords and adaptor cables don’t tend to change much through subsequent generations, which means they’re more likely to be compatible with newer devices. Post about the items you’re parting with on social media to reach more eyes. Be sure to include a few photos so interested acquaintances know they’re getting the right part. Reuse cables for other devices. Some types of accessories are less device-specific than others. A USB cord is a USB cord, for instance, and can be used on any device with a USB port. Familiarizing yourself with the connectors of your various devices can be a good way to get more use out of a cable if you have one that’s missing its mate. HDMI, A/V, and coaxial cables are feature a universal construction that makes them interchangeable between many different types of electronics, from computers to video recording equipment. Even a specially-designed component like Apple’s lightning charger cord can be plugged into any iPhone, iPad, or iPod manufactured after 2012. Donate your cords and cables to a local STEM program. Schools and hobby groups, such as the Boy Scouts and audio/video clubs, sometimes use electronic accessories like power cords as part of their technology education curriculum. Run a search for STEM programs being advertised in your town and see what sorts of items they’re asking for. Chances are, they’ll be pleased with whatever you contribute. Since these programs are mostly concerned with studying technology, they may be willing to accept parts that are considered outdated or obsolete. Sell raw materials for salvage. If you’re looking for a way to turn a tangle of cables into quick cash, consider mining them for the materials inside. Conductive metals like pure copper and nickel are highly sought after by scrap metal dealers, who melt them down and sell them to vendors. Copper, in particular, is very valuable—in many markets, it can go for as much as $3 per pound. Contact your local scrapyard or metal recycling center and ask about their criteria for accepting salvage metals. Some dealers are happy to handle the extraction process themselves, while others may expect you to have the raw materials ready before you bring them in. Be aware that copper theft is a felony offense. The only time you should attempt to mine raw copper for sale is when it comes from an electronic component that you purchased legally.",
  "tyn_model":[
    "cables",
    "copper",
    "usb cord",
    "electronics recycling center",
    "electronics recycling",
    "“recycling",
    "” upon",
    "recycling",
    "apple store",
    "apple watches",
    "apple tvs",
    "e-waste collection event",
    "electronic waste",
    "“e-waste",
    "”)",
    "e-waste collection",
    "charging cords",
    "adaptor cables",
    "cable",
    "hdmi",
    "/v, and coaxial cables",
    "audio/video clubs",
    "power cords",
    "nickel",
    "scrap metal",
    "—in",
    "metals"
  ],
  "tyn_section":[

  ]
}