{
  "title":"How to Use Skype for Video Games on Android",
  "url":"https://www.wikihow.com/Use-Skype-for-Video-Games-on-Android",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Open Skype on your Android.",
      "description":"The Skype app looks like a white \"S\" in a blue circle icon on your Apps menu."
    },
    {
      "headline":"Tap the Chats tab.",
      "description":"This button is located below your profile picture at the top of your screen. It will open a list of all your recent personal and group chats. If you want to create a new group chat, tap the \"+\" icon on the top-left, and select New Group on the menu."
    },
    {
      "headline":"Tap the Contacts button.",
      "description":"This button looks like a book icon in the upper-right corner of your Chats list. It will open a list of all your phone contacts. If you see your friend on the Chats list, you can just tap their name and open your conversation here."
    },
    {
      "headline":"Tap the Skype tab.",
      "description":"This button is at the top of your Contacts page. It will open a list of your Skype contacts. On some versions of Skype, you can switch between People and Groups on a tabs bar at the top of your Contacts."
    },
    {
      "headline":"Find and tap the friend you want to voice chat.",
      "description":"Scroll down the Contacts list to find your friend's name, and tap it. This will open a  conversation between you and the selected contact."
    },
    {
      "headline":"Tap the phone icon.",
      "description":"This button is in the upper-right corner of your chat conversation. It will start a voice call between you and your contact. If you're prompted to allow Skype access to your microphone, tap ALLOW or OK."
    },
    {
      "headline":"Press your Android's home button.",
      "description":"Once your contact answers your call, you can minimize the Skype app by pressing your phone or tablet's home button. Minimizing Skype won't end your call. You can still voice chat with your contact while the app is minimized."
    },
    {
      "headline":"Open the game you want to play.",
      "description":"Find your game on your home screen or on the Apps menu, and tap its icon to open the game."
    },
    {
      "headline":"Play your game while voice chatting.",
      "description":"Skype will stay minimized when you open the game. This way, you can keep playing and voice chatting at the same time."
    }
  ],
  "text":" Open Skype on your Android. The Skype app looks like a white \"S\" in a blue circle icon on your Apps menu. Tap the Chats tab. This button is located below your profile picture at the top of your screen. It will open a list of all your recent personal and group chats. If you want to create a new group chat, tap the \"+\" icon on the top-left, and select New Group on the menu. Tap the Contacts button. This button looks like a book icon in the upper-right corner of your Chats list. It will open a list of all your phone contacts. If you see your friend on the Chats list, you can just tap their name and open your conversation here. Tap the Skype tab. This button is at the top of your Contacts page. It will open a list of your Skype contacts. On some versions of Skype, you can switch between People and Groups on a tabs bar at the top of your Contacts. Find and tap the friend you want to voice chat. Scroll down the Contacts list to find your friend's name, and tap it. This will open a  conversation between you and the selected contact. Tap the phone icon. This button is in the upper-right corner of your chat conversation. It will start a voice call between you and your contact. If you're prompted to allow Skype access to your microphone, tap ALLOW or OK. Press your Android's home button. Once your contact answers your call, you can minimize the Skype app by pressing your phone or tablet's home button. Minimizing Skype won't end your call. You can still voice chat with your contact while the app is minimized. Open the game you want to play. Find your game on your home screen or on the Apps menu, and tap its icon to open the game. Play your game while voice chatting. Skype will stay minimized when you open the game. This way, you can keep playing and voice chatting at the same time.",
  "tyn_model":[
    "skype",
    "skype contacts"
  ],
  "tyn_section":[

  ]
}