{
  "title":"How to Determine the Right Size Ceiling Fan for a Room",
  "url":"https://www.wikihow.com/Determine-the-Right-Size-Ceiling-Fan-for-a-Room",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Ceilings"
  ],
  "parts":[
    {
      "name":"Taking Measurements",
      "steps":[
        {
          "headline":"Calculate the full blade span.",
          "description":"Count the number of blades – some fans have three, and some have four blades. If it has an even number of blades, measure your fan from the tip of one blade to the tip of the blade directly opposite it. If it has an odd number of blades, measure from the center of the fan to the tip of one blade, and multiply by 2. Now you have the full blade span. Obviously, you will need fans with larger spans in bigger rooms like the living room and bedrooms, and smaller spans in the kitchen, corridors or nooks."
        },
        {
          "headline":"Use a standard measuring tape and measure the square footage of your room.",
          "description":"For this you first measure the length, and then the width. Then you multiply the two measurements. For example, if the length of the room is 9 feet, and the width is 8 feet, it means that the room is 72 square feet in size."
        },
        {
          "headline":"Measure the ceiling height.",
          "description":"The correct size of the fan also depends on the distance between your floor and ceiling. If you have a high ceiling, you may require a fan with larger blade span, or you will most probably need a down rod that helps to suspend it a little lower from the ceiling. If the ceiling is on the lower side, you could opt for a flush mount or low profile ceiling fan – they don’t hang low, and appear to be almost on the ceiling. The ideal minimum distance from the floor to the ceiling fan is 7 feet. Keep this in mind when you decide about the length of the rod."
        }
      ]
    },
    {
      "name":"Determining the Right Size",
      "steps":[
        {
          "headline":"Check how much air the ceiling fan can move in a minute.",
          "description":"This is measured in CFM – which stands for cubic feet per minute. It is a pretty accurate description of the amount of space that the fan can cover when it turns. You should be able to get this information from the store you’re purchasing the fan from."
        },
        {
          "headline":"Check this table to determine the ideal fan size for each room.",
          "description":"You now have all the necessary measurements with you. This is not an exhaustive table but it will serve to give you a good idea on the size of the fan you need to choose for each room. Size of Room (in Sq. Ft)\nSize of Fan (in inches)\nRoom Type\nCFM Rating\n\nBelow 75\n\n\n 29 - 36  \n\n\n\n Bathrooms, utility spaces, nooks  \n\n\n\n Below 1000\n\n\n75 - 144\n\n\n 36 - 42  \n\n\n\n Small bedrooms, nooks, porch, work areas  \n\n\n\n 1000 - 3000\n\n\n144 - 225\n\n\n 44 - 50  \n\n\n\n Medium bedrooms, dining areas, patio, kitchen  \n\n\n\n 1600 - 4500\n\n\n225 - 400\n\n\n 50 - 62  \n\n\n\n Large bedrooms, living rooms, family rooms  \n\n\n\n 2300 - 6500\n\n\n400+\n\n\n 62+  \n\n\n\n Large garages, basements, halls   \n\n\n\n 5500 - 13,500"
        },
        {
          "headline":"Determine at what height your fan needs to be suspended, based on the height of your ceiling and whether the ceiling has a slope.",
          "description":"Ceiling heights are more or less standard now, and most modern constructions, especially for individual homes are likely to feature ceilings at 10 feet distance from the floor. If you have a low ceiling of less than 8 feet, you need to choose a low profile ceiling fan, and maintain a distance of 7 feet from the floor to the ceiling. However if you have a high ceiling, say 9 feet and over, you may well require a down rod to ensure that the fan is not too high up to provide comfort. Determine the size of the rod based on the exact height of your ceiling. For a 9 ft ceiling, you may need a rod of 3 to 6 inches, for 10 ft ceiling, around 6 to 8 inches, and for 11 ft ceiling height, a rod of around 12 to 16 inches may be needed, depending on whether you also use an air conditioner, how many people are likely to be in the room at a given time, and so on. In both cases, you need to ensure a minimum distance of 18 inches from blade to wall."
        }
      ]
    }
  ],
  "text":" Taking Measurements Calculate the full blade span. Count the number of blades – some fans have three, and some have four blades. If it has an even number of blades, measure your fan from the tip of one blade to the tip of the blade directly opposite it. If it has an odd number of blades, measure from the center of the fan to the tip of one blade, and multiply by 2. Now you have the full blade span. Obviously, you will need fans with larger spans in bigger rooms like the living room and bedrooms, and smaller spans in the kitchen, corridors or nooks. Use a standard measuring tape and measure the square footage of your room. For this you first measure the length, and then the width. Then you multiply the two measurements. For example, if the length of the room is 9 feet, and the width is 8 feet, it means that the room is 72 square feet in size. Measure the ceiling height. The correct size of the fan also depends on the distance between your floor and ceiling. If you have a high ceiling, you may require a fan with larger blade span, or you will most probably need a down rod that helps to suspend it a little lower from the ceiling. If the ceiling is on the lower side, you could opt for a flush mount or low profile ceiling fan – they don’t hang low, and appear to be almost on the ceiling. The ideal minimum distance from the floor to the ceiling fan is 7 feet. Keep this in mind when you decide about the length of the rod. Determining the Right Size Check how much air the ceiling fan can move in a minute. This is measured in CFM – which stands for cubic feet per minute. It is a pretty accurate description of the amount of space that the fan can cover when it turns. You should be able to get this information from the store you’re purchasing the fan from. Check this table to determine the ideal fan size for each room. You now have all the necessary measurements with you. This is not an exhaustive table but it will serve to give you a good idea on the size of the fan you need to choose for each room. Size of Room (in Sq. Ft)\nSize of Fan (in inches)\nRoom Type\nCFM Rating\n\nBelow 75\n\n\n 29 - 36  \n\n\n\n Bathrooms, utility spaces, nooks  \n\n\n\n Below 1000\n\n\n75 - 144\n\n\n 36 - 42  \n\n\n\n Small bedrooms, nooks, porch, work areas  \n\n\n\n 1000 - 3000\n\n\n144 - 225\n\n\n 44 - 50  \n\n\n\n Medium bedrooms, dining areas, patio, kitchen  \n\n\n\n 1600 - 4500\n\n\n225 - 400\n\n\n 50 - 62  \n\n\n\n Large bedrooms, living rooms, family rooms  \n\n\n\n 2300 - 6500\n\n\n400+\n\n\n 62+  \n\n\n\n Large garages, basements, halls   \n\n\n\n 5500 - 13,500 Determine at what height your fan needs to be suspended, based on the height of your ceiling and whether the ceiling has a slope. Ceiling heights are more or less standard now, and most modern constructions, especially for individual homes are likely to feature ceilings at 10 feet distance from the floor. If you have a low ceiling of less than 8 feet, you need to choose a low profile ceiling fan, and maintain a distance of 7 feet from the floor to the ceiling. However if you have a high ceiling, say 9 feet and over, you may well require a down rod to ensure that the fan is not too high up to provide comfort. Determine the size of the rod based on the exact height of your ceiling. For a 9 ft ceiling, you may need a rod of 3 to 6 inches, for 10 ft ceiling, around 6 to 8 inches, and for 11 ft ceiling height, a rod of around 12 to 16 inches may be needed, depending on whether you also use an air conditioner, how many people are likely to be in the room at a given time, and so on. In both cases, you need to ensure a minimum distance of 18 inches from blade to wall.",
  "tyn_model":[
    "fan",
    "fans",
    "ceiling fan",
    "rod",
    "– some",
    "– they",
    "– which",
    "air conditioner"
  ],
  "tyn_section":[

  ]
}