{
  "title":"How to Clean Eyeglasses Using Soap Bubbles",
  "url":"https://www.wikihow.com/Clean-Eyeglasses-Using-Soap-Bubbles",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "Cleaning Glass"
  ],
  "steps":[
    {
      "headline":"Take out your glasses from the glasses case.",
      "description":""
    },
    {
      "headline":"Put the glasses under the light to see if the lenses are clean.",
      "description":""
    },
    {
      "headline":"If the glasses are not clean use a wet cotton towel to tidy them.",
      "description":"Never use a dry cloth to clean your glasses because the particles can scratch the lenses."
    },
    {
      "headline":"If doing this does not make your glasses clean, try washing the lenses under water.",
      "description":""
    },
    {
      "headline":"Make some soap bubbles and put these bubbles on lenses.",
      "description":""
    },
    {
      "headline":"Wipe off dirt, grease, and fingerprints on the lenses using a wet cloth.",
      "description":"Using your fingers is a bad idea because your fingers are very oily and dirty."
    },
    {
      "headline":"After this, use water to rinse these bubbles out.",
      "description":""
    },
    {
      "headline":"Dry the glasses with a cotton cloth or lens tissue.",
      "description":"Or you can dry the glasses by using a hair dryer. Do NOT use facial tissue. It is a wood product and the large wood fibers can do serious damage."
    },
    {
      "headline":"Put your glasses back into your case.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Take out your glasses from the glasses case.  Put the glasses under the light to see if the lenses are clean.  If the glasses are not clean use a wet cotton towel to tidy them. Never use a dry cloth to clean your glasses because the particles can scratch the lenses. If doing this does not make your glasses clean, try washing the lenses under water.  Make some soap bubbles and put these bubbles on lenses.  Wipe off dirt, grease, and fingerprints on the lenses using a wet cloth. Using your fingers is a bad idea because your fingers are very oily and dirty. After this, use water to rinse these bubbles out.  Dry the glasses with a cotton cloth or lens tissue. Or you can dry the glasses by using a hair dryer. Do NOT use facial tissue. It is a wood product and the large wood fibers can do serious damage. Put your glasses back into your case.  Finished. ",
  "tyn_model":[
    "glasses",
    "water",
    "glasses case",
    "wet cotton towel",
    "soap",
    "lens tissue",
    "hair dryer",
    "facial tissue"
  ],
  "tyn_section":[

  ]
}