{
  "title":"How to Take Action to Solve the Water Crisis",
  "url":"https://www.wikihow.com/Take-Action-to-Solve-the-Water-Crisis",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Reducing Personal Water Consumption",
      "steps":[
        {
          "headline":"Turn off the tap while brushing your teeth.",
          "description":"If you wet your toothbrush when applying toothpaste to it, turn the water back off while you’re scrubbing your teeth. Turn it back on when you’re ready to rinse your mouth and toothbrush. Similarly, when you wash your hands or face at the sink, wet your hands and face, then turn the water off. Apply your soap and scrub for the recommended time then turn the water back on to rinse."
        },
        {
          "headline":"Take 5-minute showers.",
          "description":"Standard shower heads use 2.5 gallons (9.5 L) of water per minute. That means an 8-minute shower uses 20 gallons (76 L) of water! If you cut back just 3 minutes of your shower time and aim to take 5-minute showers instead, the amount of water you’ll save will really add up. To take 5-minute showers, try one of the following: use a shower timer or set 5 minutes on your phone alarm, listen to a 5-minute song, sing the ABC’s 10 times then stop on M on the 11th time, or count backwards from 300 during your shower."
        },
        {
          "headline":"Collect cold shower water or install a water-saving showerhead.",
          "description":"Many people wait for hot water before even getting into the shower. If you do this, collect the clean cold water with a bucket and use it for watering plants or rinsing dishes. To adjust the speed at which water comes out of your showerhead, invest in a water-saving showerhead. Look up the EPA’s WaterSense program at https://www.epa.gov/watersense to find out more about water-saving products and utilities for your home."
        },
        {
          "headline":"Use biodegradable cleaners.",
          "description":"Some household cleaning products require a lot of water because of their foaming agents and harmful chemicals. The amount of water needed to rinse them is higher than those of organic or natural cleaners. Look for natural commercial “green” cleaners helps to decrease the amount of water you’ll need to use while cleaning. To save money on buying commercial green cleaners, make your own cleaning products with vinegar and baking soda."
        },
        {
          "headline":"Fix your leaky pipes and faucets.",
          "description":"Household leaks account for nearly 1 trillion gallons of wasted water per year. Check your faucets for drips; even if they are slow, you should repair that faucet. Fixing other leaky pipes promptly will not only save water but will also save you money on water damage in the long run. Listen for drips in the walls or floor after you use the sink, tub, or toilet. If you hear anything that sounds like dripping, consult a plumber. To test your toilet tank for leaks, put a few drops of food coloring in your tank. If the color shows up in the bowl without you flushing, you probably need to replace the flapper in your tank."
        },
        {
          "headline":"Replace your toilet with a water-saving toilet.",
          "description":"Regular toilets flush enormous amounts of otherwise clean water per day. “Water-saving,” or “dual-flush” toilets are available at many hardware and home-improvement stores. Once you have your new toilet, consult a plumber if you need help on how to install it. Some home improvement stores will install new appliances you buy from them for an extra fee. If possible, install more dual-flush toilets in public restrooms. Provide urinals with dividers between them in restrooms for men and boys. In rural areas, males should not be discouraged from peeing outside as long as common sense is used in the process."
        },
        {
          "headline":"Harvest rainwater for your garden.",
          "description":"If you water your garden plants or grass, place a rain barrel beneath your gutters on the side of your home. Fill your watering canisters with this water by dipping them in the barrel and using the water on your garden. Or connect a manual pump hose to spray the water from the barrel onto your yard. Do not drink rainwater that is untreated, as it is considered unsafe to drink."
        },
        {
          "headline":"Take advantage of water-saving yard incentives.",
          "description":"If you live in a drought-prone area, there may be cash incentives available for replacing the grass on your property with more sustainable, native plants. One example of this is the California “Cash for Grass” program, which provides homeowners with money to replace their grass with native plants that require less water to maintain. Contact your local urban development agencies to see if a water-saving program like this exists in your area."
        }
      ]
    },
    {
      "name":"Protecting Drinking Water Sources",
      "steps":[
        {
          "headline":"Use and dispose of harmful materials properly.",
          "description":"Hazardous waste that gets dumped on the ground contaminates the soil, which in turn can contaminate groundwater or nearby surface water. Don’t ever dump hazardous wastes like motor oil, leftover paint or paint cans, household cleaners, or medicines onto the ground. Check with your local sanitation or trash removal agency about guidelines before putting hazardous wastes into the trash."
        },
        {
          "headline":"Use pesticides and fertilizers only when necessary.",
          "description":"Many pesticides and fertilizers contain harmful chemicals that contaminate ground water. If you must use pesticides or fertilizers, use them sparingly or check the ingredients to use ones that are made from all-natural ingredients. Or try making your own pesticides out of organic ingredients like neem oil, Epsom salts, or citrus. Make your own neem oil pesticide by mixing 1 teaspoon (4.9 mL) of neem oil with ⁄2 teaspoon (2.5 mL) soap and 32 fluid ounces (0.95 L) of warm water. To make an Epsom salt spray, dissolve 8 fluid ounces (0.24 L) into 5 gallons (19 L) of water. Or simply sprinkle Epsom salts around the bases of your plants instead of making a spray. Citrus is especially effective against aphids. To make a citrus spray, grate the rind from 1 lemon and add it to 16 fluid ounces (0.47 L) boiling water. Allow this to steep overnight then strain the liquid from the lemon rinds. Check to see if the plants you grow need a fertilizer to thrive in your garden before automatically using them."
        },
        {
          "headline":"Organize a storm drain stenciling project.",
          "description":"Stencil a message next to a storm drain, reminding people not to dump waste into a street drain because that water drains to a river. Use simple images like fish, a faucet with water drops, or a person throwing away trash, and include a simple message like “Protect Your Water” or “Drains Directly To Rivers.”\nGet permission to stencil storm drains in your area by contacting your local Department of Public Works. Search your closest city or town along with “Department of Public Works” online to find their phone number and tell them you’re interested in doing a storm drain stenciling project. To create the stencils, draw and cut out your design on a piece of paper, then spray paint the design on or near a storm drain."
        },
        {
          "headline":"Call your local elected officials with concerns within your area.",
          "description":"If you are concerned about clean water shortages in your area, contact your elected officials to voice your water concerns and ask that action is taken. The website at https://www.usa.gov/elected-officials directs you to your state and local elected officials like governors, mayors, and county executives within the U.S.\nTo contact officials outside of where you live, search the name of the town, for instance “Flint, MI,” along with “ways to help.”\nFor contacting elected officials outside the U.S., conduct a google search on “contacting my elected officials” or “who are my government representatives.”"
        },
        {
          "headline":"Contact the EPA to take action in a specific U.S. region.",
          "description":"The Environmental Protection Agency oversees environmental issues like clean water protection and accessibility within the U.S. Their website has many resources about clean water issues and allows you to ask them questions. You can also find source water protection coordinators in your area and report environmental law violations that may contribute to decreased clean water through their website. Visit https://www.epa.gov/sourcewaterprotection/forms/contact-us-about-source-water-protection for more information on contacting the EPA about clean water protection."
        }
      ]
    },
    {
      "name":"Spreading the Word",
      "steps":[
        {
          "headline":"Start a social media campaign to help communities in need.",
          "description":"People often don’t know about a problem unless it’s directly affecting them. If you know of a water crisis happening in a nearby community, get on social media to see how you can help. Look for ways to join people who are already taking action, or start your own group. Ask for volunteers on your social media page to help you start a group dedicated to helping a particular affected region. Ask people  in surrounding areas to donate water in jugs to designated drop-off centers within the affected area. Contact companies and businesses on social media and ask them to donate or help transport water to areas that are running low."
        },
        {
          "headline":"Raise money at school or work to donate to communities without water.",
          "description":"Start a fundraiser to benefit a specific non-profit that’s working to alleviate a clean water crisis in a specific area. Organize a small concert, open-mic, or talent show where people have to pay for admission and you donate the door money to a specific group. The groups Blood:Water, Lifewater International, and Water for Good are groups that partner with underserved communities facing water crisis in Africa. Generosity.org brings safe water to areas in Haiti, Ghana, Uganda, and India. Convoy of Hope and the Flint Water Fund are organizations helping with the crisis in Flint, Michigan."
        },
        {
          "headline":"Host a workshop to educate people about the water crisis.",
          "description":"Bring your knowledge about the global water crisis to people who want more information. Choose a place to host your event. Plan out the information you want to share and invite guest speakers who are knowledgeable about the subject to speak at your workshop. Once you have some guest speakers interested, get them to commit to a date for your event. Create flyers to advertise your event and hang them up nearby the event’s location. Create an event page on social media and invite people to come. Consider providing some refreshments during the event by making them yourself or asking for donations from a local restaurant or café. Be sure to provide resources like pamphlets, phone numbers, and websites for various ways people can help after they leave your event."
        }
      ]
    }
  ],
  "text":" Reducing Personal Water Consumption Turn off the tap while brushing your teeth. If you wet your toothbrush when applying toothpaste to it, turn the water back off while you’re scrubbing your teeth. Turn it back on when you’re ready to rinse your mouth and toothbrush. Similarly, when you wash your hands or face at the sink, wet your hands and face, then turn the water off. Apply your soap and scrub for the recommended time then turn the water back on to rinse. Take 5-minute showers. Standard shower heads use 2.5 gallons (9.5 L) of water per minute. That means an 8-minute shower uses 20 gallons (76 L) of water! If you cut back just 3 minutes of your shower time and aim to take 5-minute showers instead, the amount of water you’ll save will really add up. To take 5-minute showers, try one of the following: use a shower timer or set 5 minutes on your phone alarm, listen to a 5-minute song, sing the ABC’s 10 times then stop on M on the 11th time, or count backwards from 300 during your shower. Collect cold shower water or install a water-saving showerhead. Many people wait for hot water before even getting into the shower. If you do this, collect the clean cold water with a bucket and use it for watering plants or rinsing dishes. To adjust the speed at which water comes out of your showerhead, invest in a water-saving showerhead. Look up the EPA’s WaterSense program at https://www.epa.gov/watersense to find out more about water-saving products and utilities for your home. Use biodegradable cleaners. Some household cleaning products require a lot of water because of their foaming agents and harmful chemicals. The amount of water needed to rinse them is higher than those of organic or natural cleaners. Look for natural commercial “green” cleaners helps to decrease the amount of water you’ll need to use while cleaning. To save money on buying commercial green cleaners, make your own cleaning products with vinegar and baking soda. Fix your leaky pipes and faucets. Household leaks account for nearly 1 trillion gallons of wasted water per year. Check your faucets for drips; even if they are slow, you should repair that faucet. Fixing other leaky pipes promptly will not only save water but will also save you money on water damage in the long run. Listen for drips in the walls or floor after you use the sink, tub, or toilet. If you hear anything that sounds like dripping, consult a plumber. To test your toilet tank for leaks, put a few drops of food coloring in your tank. If the color shows up in the bowl without you flushing, you probably need to replace the flapper in your tank. Replace your toilet with a water-saving toilet. Regular toilets flush enormous amounts of otherwise clean water per day. “Water-saving,” or “dual-flush” toilets are available at many hardware and home-improvement stores. Once you have your new toilet, consult a plumber if you need help on how to install it. Some home improvement stores will install new appliances you buy from them for an extra fee. If possible, install more dual-flush toilets in public restrooms. Provide urinals with dividers between them in restrooms for men and boys. In rural areas, males should not be discouraged from peeing outside as long as common sense is used in the process. Harvest rainwater for your garden. If you water your garden plants or grass, place a rain barrel beneath your gutters on the side of your home. Fill your watering canisters with this water by dipping them in the barrel and using the water on your garden. Or connect a manual pump hose to spray the water from the barrel onto your yard. Do not drink rainwater that is untreated, as it is considered unsafe to drink. Take advantage of water-saving yard incentives. If you live in a drought-prone area, there may be cash incentives available for replacing the grass on your property with more sustainable, native plants. One example of this is the California “Cash for Grass” program, which provides homeowners with money to replace their grass with native plants that require less water to maintain. Contact your local urban development agencies to see if a water-saving program like this exists in your area. Protecting Drinking Water Sources Use and dispose of harmful materials properly. Hazardous waste that gets dumped on the ground contaminates the soil, which in turn can contaminate groundwater or nearby surface water. Don’t ever dump hazardous wastes like motor oil, leftover paint or paint cans, household cleaners, or medicines onto the ground. Check with your local sanitation or trash removal agency about guidelines before putting hazardous wastes into the trash. Use pesticides and fertilizers only when necessary. Many pesticides and fertilizers contain harmful chemicals that contaminate ground water. If you must use pesticides or fertilizers, use them sparingly or check the ingredients to use ones that are made from all-natural ingredients. Or try making your own pesticides out of organic ingredients like neem oil, Epsom salts, or citrus. Make your own neem oil pesticide by mixing 1 teaspoon (4.9 mL) of neem oil with ⁄2 teaspoon (2.5 mL) soap and 32 fluid ounces (0.95 L) of warm water. To make an Epsom salt spray, dissolve 8 fluid ounces (0.24 L) into 5 gallons (19 L) of water. Or simply sprinkle Epsom salts around the bases of your plants instead of making a spray. Citrus is especially effective against aphids. To make a citrus spray, grate the rind from 1 lemon and add it to 16 fluid ounces (0.47 L) boiling water. Allow this to steep overnight then strain the liquid from the lemon rinds. Check to see if the plants you grow need a fertilizer to thrive in your garden before automatically using them. Organize a storm drain stenciling project. Stencil a message next to a storm drain, reminding people not to dump waste into a street drain because that water drains to a river. Use simple images like fish, a faucet with water drops, or a person throwing away trash, and include a simple message like “Protect Your Water” or “Drains Directly To Rivers.”\nGet permission to stencil storm drains in your area by contacting your local Department of Public Works. Search your closest city or town along with “Department of Public Works” online to find their phone number and tell them you’re interested in doing a storm drain stenciling project. To create the stencils, draw and cut out your design on a piece of paper, then spray paint the design on or near a storm drain. Call your local elected officials with concerns within your area. If you are concerned about clean water shortages in your area, contact your elected officials to voice your water concerns and ask that action is taken. The website at https://www.usa.gov/elected-officials directs you to your state and local elected officials like governors, mayors, and county executives within the U.S.\nTo contact officials outside of where you live, search the name of the town, for instance “Flint, MI,” along with “ways to help.”\nFor contacting elected officials outside the U.S., conduct a google search on “contacting my elected officials” or “who are my government representatives.” Contact the EPA to take action in a specific U.S. region. The Environmental Protection Agency oversees environmental issues like clean water protection and accessibility within the U.S. Their website has many resources about clean water issues and allows you to ask them questions. You can also find source water protection coordinators in your area and report environmental law violations that may contribute to decreased clean water through their website. Visit https://www.epa.gov/sourcewaterprotection/forms/contact-us-about-source-water-protection for more information on contacting the EPA about clean water protection. Spreading the Word Start a social media campaign to help communities in need. People often don’t know about a problem unless it’s directly affecting them. If you know of a water crisis happening in a nearby community, get on social media to see how you can help. Look for ways to join people who are already taking action, or start your own group. Ask for volunteers on your social media page to help you start a group dedicated to helping a particular affected region. Ask people  in surrounding areas to donate water in jugs to designated drop-off centers within the affected area. Contact companies and businesses on social media and ask them to donate or help transport water to areas that are running low. Raise money at school or work to donate to communities without water. Start a fundraiser to benefit a specific non-profit that’s working to alleviate a clean water crisis in a specific area. Organize a small concert, open-mic, or talent show where people have to pay for admission and you donate the door money to a specific group. The groups Blood:Water, Lifewater International, and Water for Good are groups that partner with underserved communities facing water crisis in Africa. Generosity.org brings safe water to areas in Haiti, Ghana, Uganda, and India. Convoy of Hope and the Flint Water Fund are organizations helping with the crisis in Flint, Michigan. Host a workshop to educate people about the water crisis. Bring your knowledge about the global water crisis to people who want more information. Choose a place to host your event. Plan out the information you want to share and invite guest speakers who are knowledgeable about the subject to speak at your workshop. Once you have some guest speakers interested, get them to commit to a date for your event. Create flyers to advertise your event and hang them up nearby the event’s location. Create an event page on social media and invite people to come. Consider providing some refreshments during the event by making them yourself or asking for donations from a local restaurant or café. Be sure to provide resources like pamphlets, phone numbers, and websites for various ways people can help after they leave your event.",
  "tyn_model":[
    "water",
    "pesticides",
    "toilet",
    "” or",
    "fertilizers",
    "neem oil",
    "soap",
    "toilets",
    "epsom salts",
    "citrus",
    "”\n",
    "tap",
    "bucket",
    "“green” cleaners",
    "vinegar",
    "baking soda",
    "food coloring",
    "“water",
    "“dual",
    "” toilets",
    "plumber",
    "home improvement stores",
    "urinals",
    "rain barrel",
    "pump hose",
    "“cash",
    "” program",
    "warm water",
    "epsom salt",
    "citrus spray",
    "fertilizer",
    "“protect",
    "“drains",
    "“department",
    "” online",
    "paper",
    "“flint",
    "” along",
    "“ways",
    "“contacting",
    "“who",
    "” contact",
    "epa",
    "environmental protection agency",
    "flyers"
  ],
  "tyn_section":[

  ]
}