{
  "title":"How to Retreat in the Pokémon Card Game",
  "url":"https://www.wikihow.com/Retreat-in-the-Pok%C3%A9mon-Card-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Look at the retreat cost of the of your Active Pokémon.",
      "description":"This can be found at the bottom of the card, where it says “retreat”."
    },
    {
      "headline":"Attach energy cards to the Pokémon you’re retreating.",
      "description":"In the retreat cost, you should see * symbols. Those represent how much energy is needed to be attached to that Pokémon in order to retreat. For example: if there is one * symbol, you only need one energy card attached to that Pokémon in order to retreat. You can attach any type of energy you want to the retreating Pokémon. If there are no * symbols, then that Pokémon doesn’t need any energy in order to retreat; it can retreat anytime for free! Great examples are Electrode and Gengar, and Crobat, which all have the retreat of zero. Be aware, though, that you can only attach one energy card to a Pokémon per turn."
    },
    {
      "headline":"Find a Pokémon in your bench that you want to retreat with.",
      "description":"When you retreat, you must choose a Pokémon from your bench to be your new Active Pokémon. Choose a Pokémon from your bench to switch with."
    },
    {
      "headline":"Retreat and switch.",
      "description":"Once you have the energy cost required to retreat, and you have one of your Benched Pokémon ready, retreat your Active Pokémon into your bench and put the Pokémon from your bench as your new Active Pokémon. When you retreat, you must put all the energy you used to retreat into the discard pile, which is right under your deck. Retreating a Pokémon removes all Special Conditions."
    }
  ],
  "text":" Look at the retreat cost of the of your Active Pokémon. This can be found at the bottom of the card, where it says “retreat”. Attach energy cards to the Pokémon you’re retreating. In the retreat cost, you should see * symbols. Those represent how much energy is needed to be attached to that Pokémon in order to retreat. For example: if there is one * symbol, you only need one energy card attached to that Pokémon in order to retreat. You can attach any type of energy you want to the retreating Pokémon. If there are no * symbols, then that Pokémon doesn’t need any energy in order to retreat; it can retreat anytime for free! Great examples are Electrode and Gengar, and Crobat, which all have the retreat of zero. Be aware, though, that you can only attach one energy card to a Pokémon per turn. Find a Pokémon in your bench that you want to retreat with. When you retreat, you must choose a Pokémon from your bench to be your new Active Pokémon. Choose a Pokémon from your bench to switch with. Retreat and switch. Once you have the energy cost required to retreat, and you have one of your Benched Pokémon ready, retreat your Active Pokémon into your bench and put the Pokémon from your bench as your new Active Pokémon. When you retreat, you must put all the energy you used to retreat into the discard pile, which is right under your deck. Retreating a Pokémon removes all Special Conditions.",
  "tyn_model":[
    "pokémon",
    "energy card",
    "“retreat",
    "”.",
    "energy cards",
    "energy",
    "gengar",
    "crobat"
  ],
  "tyn_section":[

  ]
}