{
  "title":"How to Order Dirt",
  "url":"https://www.wikihow.com/Order-Dirt",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Compost Mulch and Soil Preparation"
  ],
  "parts":[
    {
      "name":"Choosing a Dirt Supplier",
      "steps":[
        {
          "headline":"Ask your friends and family for company recommendations.",
          "description":"If anyone who you know has recently ordered dirt, ask them about their experiences. There are likely many companies competing for your business, and this is one way to narrow them down. You can also question workers at your local garden center about who they’d suggest and why. For example, you might ask, “How was the delivery process?” You could also say, “Was the dirt the same quality as promised originally?”"
        },
        {
          "headline":"Talk about the source of the dirt.",
          "description":"Does the company mix its own dirt? Do they buy from the local community or outside suppliers? What are their standards for dirt purchases that they plan to sell to consumers? This is also a good time to ask about how and when they’ve stopped using a particular supplier. For example, some companies create their own unique dirt blends using compost, worm castings, and other materials. This is usually a sign of high-quality dirt. If a company gets their dirt from local, known providers that’s another good sign."
        },
        {
          "headline":"Request an ingredients list.",
          "description":"The company that supplies your dirt should be able to supply a fairly exact listing of what materials are present in the soil. Some companies specialize in providing dirt that only contains organic components. Other suppliers might load their dirt up with heavy, and potentially toxic, chemicals. For example, dirt sourced from a home construction site might contain harmful materials, such as asbestos. In contrast, quality dirt might contain worm castings or other natural materials."
        },
        {
          "headline":"Discuss their screening process.",
          "description":"This is a particularly important step if you are intending to use the dirt at your home or for gardening. Does the company guarantee that the dirt will be largely free of weeds? How do they remove rocks or pieces of litter, such as glass? It’s important that the dirt is screened in its entirety; otherwise, heavy pieces of litter could fall to the bottom of the load."
        },
        {
          "headline":"Request a pH test.",
          "description":"This is a fairly simple test that a company can perform by taking a small sample of the soil and mixing it with testing liquid. Then, they’ll be able to give you an approximate pH value, which you can test on your own upon delivery. Certain plants, for example, require particular levels of acidity or alkalinity in order to thrive."
        }
      ]
    },
    {
      "name":"Selecting a Type of Dirt",
      "steps":[
        {
          "headline":"Get basic fill dirt to fill holes.",
          "description":"This dirt is usually not suitable for growing, but can be easily used to fill in pools, ditches, or other areas. It may contain a variety of ingredients, including sands, pebbles, or clay. You can also request that the dirt have a higher concentration of any of these materials. For example, if you are planning to use the dirt mixture for drainage, ask that it contain more pebbles or small stones. If you are going to build a structure on top of the soil, a mixture with a higher clay content could provide additional stability."
        },
        {
          "headline":"Choose organic topsoil if you need it for plants.",
          "description":"This is dirt that comes from the first few inches of the ground. It is usually higher quality and can be immediately used for planting. Another benefit of topsoil is that it should contain a variety of beneficial bacteria and microbes. It’s a myth that all high-quality topsoil should be dark black. In fact, this type of soil can range widely in color."
        },
        {
          "headline":"Consider purchasing bulk manure for an agricultural project.",
          "description":"In some areas, this can be a cheaper option than buying standard fill dirt. Instead, you can get straight manure or a fill dirt/manure mix. Most manure comes from sheep, horses, or cows and is digested material. Check that the manure is at least 1 year old or older if you are concerned about weeds. This is usually enough time for any dormant weed seeds in the manure to die off."
        },
        {
          "headline":"Buy year-old or older mulch as a dirt alternative .",
          "description":"Bulk mulch is essentially shredded wood and bark. You want your mulch to have aged a bit before you buy it, because aging will make it richer in microbes. Make sure to ask about the source when buying mulch, because it can sometimes contain harmful insects, like termites. Mulch should not come from scrap wood or you could risk an insect infestation or exposure to harmful chemicals. Freshly shredded pine or hardwood is a better, safer option."
        }
      ]
    },
    {
      "name":"Making Your Purchase",
      "steps":[
        {
          "headline":"Calculate how much dirt you need.",
          "description":"For roughly rectangular spaces, measure the average depth, width, and length of the space that you wish to fill with dirt. Multiply these 3 numbers and you will know the required dirt volume. Then, simply order enough dirt to meet that cubic volume, with a little bit extra (perhaps 10%) to spare. For example, if your space is 3 feet (0.91 m) deep, 3 feet (0.91 m) wide, and 3 feet (0.91 m) long, then you’ll need 27 cubic feet (0.76 m) of dirt. For a roughly circular space, determine the average depth and radius (distance from the center to the edge). Then use the formula V=πr²h (in which h = the depth) to get the volume of dirt that you’ll need."
        },
        {
          "headline":"Examine the pricing and delivery rates.",
          "description":"Most companies will offer both bulk and by-the-bag options. They should be able to provide a clear listing of how much you’ll pay for a particular weight of any type of dirt. If you’ll need to have the dirt delivered, give them your address and request a delivery estimate in advance. For example, you might ask, “What are some of the unexpected expenses that might occur with this type of dirt delivery?”"
        },
        {
          "headline":"Purchase dirt according to your budget.",
          "description":"If you only a few cubic feet or meters to fill, then going with bags from your local garden store might be the best option. However, if you need delivery for a larger space, then consider buying in bulk from dirt suppliers. You can also consider completing half of your project and leaving the rest for later. Quality soil mix can cost upwards of $5-$8 per bag at your local gardening store."
        },
        {
          "headline":"Set up a delivery or pick-up window.",
          "description":"Arrange to get your dirt yourself or to have it delivered at a particular time and date. Make sure that you’ll have enough people to help you unload the dirt and move it to where you need it. It’s also important to consider the weather when making these arrangements. If it’s raining, will you delay pick-up or delivery or continue as planned? If you delay, you might face additional fees."
        },
        {
          "headline":"Arrange for dirt from a free or exchange website.",
          "description":"There are a number of marketplaces online, including FreeDirt.com, that allow people to advertise and sell or give away excess dirt. This can be a great resource if you find a local match and have the manpower to go get the dirt yourself. As always, be careful when dealing or trading with other people online. For example, only meet at a person’s home if you feel completely safe."
        }
      ]
    }
  ],
  "text":" Choosing a Dirt Supplier Ask your friends and family for company recommendations. If anyone who you know has recently ordered dirt, ask them about their experiences. There are likely many companies competing for your business, and this is one way to narrow them down. You can also question workers at your local garden center about who they’d suggest and why. For example, you might ask, “How was the delivery process?” You could also say, “Was the dirt the same quality as promised originally?” Talk about the source of the dirt. Does the company mix its own dirt? Do they buy from the local community or outside suppliers? What are their standards for dirt purchases that they plan to sell to consumers? This is also a good time to ask about how and when they’ve stopped using a particular supplier. For example, some companies create their own unique dirt blends using compost, worm castings, and other materials. This is usually a sign of high-quality dirt. If a company gets their dirt from local, known providers that’s another good sign. Request an ingredients list. The company that supplies your dirt should be able to supply a fairly exact listing of what materials are present in the soil. Some companies specialize in providing dirt that only contains organic components. Other suppliers might load their dirt up with heavy, and potentially toxic, chemicals. For example, dirt sourced from a home construction site might contain harmful materials, such as asbestos. In contrast, quality dirt might contain worm castings or other natural materials. Discuss their screening process. This is a particularly important step if you are intending to use the dirt at your home or for gardening. Does the company guarantee that the dirt will be largely free of weeds? How do they remove rocks or pieces of litter, such as glass? It’s important that the dirt is screened in its entirety; otherwise, heavy pieces of litter could fall to the bottom of the load. Request a pH test. This is a fairly simple test that a company can perform by taking a small sample of the soil and mixing it with testing liquid. Then, they’ll be able to give you an approximate pH value, which you can test on your own upon delivery. Certain plants, for example, require particular levels of acidity or alkalinity in order to thrive. Selecting a Type of Dirt Get basic fill dirt to fill holes. This dirt is usually not suitable for growing, but can be easily used to fill in pools, ditches, or other areas. It may contain a variety of ingredients, including sands, pebbles, or clay. You can also request that the dirt have a higher concentration of any of these materials. For example, if you are planning to use the dirt mixture for drainage, ask that it contain more pebbles or small stones. If you are going to build a structure on top of the soil, a mixture with a higher clay content could provide additional stability. Choose organic topsoil if you need it for plants. This is dirt that comes from the first few inches of the ground. It is usually higher quality and can be immediately used for planting. Another benefit of topsoil is that it should contain a variety of beneficial bacteria and microbes. It’s a myth that all high-quality topsoil should be dark black. In fact, this type of soil can range widely in color. Consider purchasing bulk manure for an agricultural project. In some areas, this can be a cheaper option than buying standard fill dirt. Instead, you can get straight manure or a fill dirt/manure mix. Most manure comes from sheep, horses, or cows and is digested material. Check that the manure is at least 1 year old or older if you are concerned about weeds. This is usually enough time for any dormant weed seeds in the manure to die off. Buy year-old or older mulch as a dirt alternative . Bulk mulch is essentially shredded wood and bark. You want your mulch to have aged a bit before you buy it, because aging will make it richer in microbes. Make sure to ask about the source when buying mulch, because it can sometimes contain harmful insects, like termites. Mulch should not come from scrap wood or you could risk an insect infestation or exposure to harmful chemicals. Freshly shredded pine or hardwood is a better, safer option. Making Your Purchase Calculate how much dirt you need. For roughly rectangular spaces, measure the average depth, width, and length of the space that you wish to fill with dirt. Multiply these 3 numbers and you will know the required dirt volume. Then, simply order enough dirt to meet that cubic volume, with a little bit extra (perhaps 10%) to spare. For example, if your space is 3 feet (0.91 m) deep, 3 feet (0.91 m) wide, and 3 feet (0.91 m) long, then you’ll need 27 cubic feet (0.76 m) of dirt. For a roughly circular space, determine the average depth and radius (distance from the center to the edge). Then use the formula V=πr²h (in which h = the depth) to get the volume of dirt that you’ll need. Examine the pricing and delivery rates. Most companies will offer both bulk and by-the-bag options. They should be able to provide a clear listing of how much you’ll pay for a particular weight of any type of dirt. If you’ll need to have the dirt delivered, give them your address and request a delivery estimate in advance. For example, you might ask, “What are some of the unexpected expenses that might occur with this type of dirt delivery?” Purchase dirt according to your budget. If you only a few cubic feet or meters to fill, then going with bags from your local garden store might be the best option. However, if you need delivery for a larger space, then consider buying in bulk from dirt suppliers. You can also consider completing half of your project and leaving the rest for later. Quality soil mix can cost upwards of $5-$8 per bag at your local gardening store. Set up a delivery or pick-up window. Arrange to get your dirt yourself or to have it delivered at a particular time and date. Make sure that you’ll have enough people to help you unload the dirt and move it to where you need it. It’s also important to consider the weather when making these arrangements. If it’s raining, will you delay pick-up or delivery or continue as planned? If you delay, you might face additional fees. Arrange for dirt from a free or exchange website. There are a number of marketplaces online, including FreeDirt.com, that allow people to advertise and sell or give away excess dirt. This can be a great resource if you find a local match and have the manpower to go get the dirt yourself. As always, be careful when dealing or trading with other people online. For example, only meet at a person’s home if you feel completely safe.",
  "tyn_model":[
    "dirt",
    "manure",
    "mulch",
    "soil",
    "topsoil",
    "fill dirt",
    "pebbles",
    "clay",
    "garden center",
    "“how",
    "” you",
    "“was",
    "” talk",
    "compost",
    "stones",
    "bark",
    "“what",
    "” purchase",
    "bags"
  ],
  "tyn_section":[

  ]
}