{
  "title":"How to Choose Vinyl Plank Flooring",
  "url":"https://www.wikihow.com/Choose-Vinyl-Plank-Flooring",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Floor Types"
  ],
  "methods":[
    {
      "name":"Choosing the Thickness of the Vinyl",
      "steps":[
        {
          "headline":"Opt for a thickness of 2–3 mm (0.079–0.118 in) for low-traffic areas.",
          "description":"If you’re covering a small area with low traffic, you can choose planks in a thickness of 2 mm (0.079 in), 2.5 mm (0.098 in), or 3 mm (0.12 in). Thinner vinyl planks are usually more budget-friendly, making this an inexpensive way to freshen up the look of a smaller room! Thin vinyl can’t hide imperfections in your subfloor, so you’ll need to have an even concrete subfloor."
        },
        {
          "headline":"Select planks between 3.2–4.0 mm (0.13–0.16 in) for high-traffic areas.",
          "description":"Most of the common areas in your home, including the living room and the kitchen, will be best suited by a high-quality plank that is either 3.2 mm (0.13 in) or 4 mm (0.16 in) thick. This thickness is a good balance of durability and affordability. In addition, it will have a somewhat soft feel beneath your feet, providing additional comfort in living areas."
        },
        {
          "headline":"Choose a thickness of 5 mm (0.20 in) or more for the highest quality.",
          "description":"The thickest vinyl planks can be anywhere from 5 mm (0.20 in) to over 8 mm (0.31 in) thick. These planks cost the most, but they are also the most durable and usually look the most like real wood. Thicker vinyl is a good option if you have a thin or uneven hardwood subfloor, since it will smooth out imperfections. EXPERT TIP\t\"Vinyl plank flooring is a great choice if you want an economical, durable floor covering, and it can be used in almost any room.\" Mitchell Newman\t\t\t\t\tHabitar Design and Stratagem Construction\t\t\t\t\t\t\t\tMitchell Newman is the Principal at Habitar Design and its sister company Stratagem Construction in Chicago, Illinois. He has 20 years of experience in construction, interior design and real estate development. Mitchell NewmanHabitar Design and Stratagem Construction"
        }
      ]
    },
    {
      "name":"Comparing Wear Layers",
      "steps":[
        {
          "headline":"Select a vinyl no-wax top coat for the most affordable wear layer.",
          "description":"The top layer of your vinyl flooring, or the wear layer, is what determines how durable the flooring is. A no-wax coating is made from urethane or vinyl. It’s the most affordable option, but it is the least durable. You will need to apply a new protective coating every 2-3 years as it wears off over time. These coatings come in a variety of thicknesses and budget options."
        },
        {
          "headline":"Pick an enhanced urethane coating for the most durability.",
          "description":"These coatings are made from advanced materials such as aluminum oxide, and they will provide the greatest protection against everyday wear. Enhanced urethane coatings will cost more, but they will prolong the life of your flooring."
        },
        {
          "headline":"Choose a wear layer of 10 mil (0.01 in) or more for most family areas.",
          "description":"You can find vinyl planks with wear layers starting at as little as 2 mil (0.002 in), but these will wear out quickly. Planks with a wear layer of 10 mil (0.01 in) are considered to be appropriately durable for use in moderate-to-high traffic areas of your home."
        },
        {
          "headline":"Opt for a 20 mil wear layer for commercial spaces.",
          "description":"If you are going to be installing your vinyl plank flooring in an area with high foot traffic, such as a restaurant or retail space, choose flooring with a wear layer of at least 20 mil (0.02 in). This will ensure that your flooring is sufficiently durable to last for several years."
        }
      ]
    },
    {
      "name":"Selecting the Color and Width",
      "steps":[
        {
          "headline":"Choose printed vinyl for the most affordable color patterns.",
          "description":"Printed vinyl is more affordable because the color or pattern is printed directly onto the vinyl, then covered with a clear coat. This type of flooring shows scratches more easily, and it looks the least like real wood, but since it’s economical, it’s a good choice if you’re covering large areas."
        },
        {
          "headline":"Select inlaid vinyl to get the look of real wood.",
          "description":"Inlaid vinyl is made so that the color penetrates the entire floor, which means it won’t dull or scratch as easily as printed vinyl. Inlaid vinyl costs slightly more, but it will retain its new look longer than printed vinyl."
        },
        {
          "headline":"Pick glued planks if you want a permanent installation option.",
          "description":"Glued vinyl planks are adhered directly to the subfloor. This is the best option for high traffic areas, as it will be resistant to peeling or slipping. Because it’s difficult to remove glued flooring once it’s installed, you may want to have a professional install these floors."
        },
        {
          "headline":"Opt for floating planks for an easy DIY installation.",
          "description":"Floating planks snap together similar to tongue-and-groove wood planks. These are a popular option for people who want to install their new flooring themselves. Floating planks are not adhered to the floor, so they can be easily removed with a crowbar if you decide you want to change things up in a few years."
        },
        {
          "headline":"Avoid wide planks unless your subfloor is perfectly even.",
          "description":"Most vinyl planks are about 4–6 inches (10–15 cm) wide, but you can find options up to 11 inches (28 cm) wide. However, wide planks will not sit correctly unless your subfloor is completely level. If you have a hardwood subfloor, you should opt for standard-width planks."
        }
      ]
    }
  ],
  "text":" Choosing the Thickness of the Vinyl Opt for a thickness of 2–3 mm (0.079–0.118 in) for low-traffic areas. If you’re covering a small area with low traffic, you can choose planks in a thickness of 2 mm (0.079 in), 2.5 mm (0.098 in), or 3 mm (0.12 in). Thinner vinyl planks are usually more budget-friendly, making this an inexpensive way to freshen up the look of a smaller room! Thin vinyl can’t hide imperfections in your subfloor, so you’ll need to have an even concrete subfloor. Select planks between 3.2–4.0 mm (0.13–0.16 in) for high-traffic areas. Most of the common areas in your home, including the living room and the kitchen, will be best suited by a high-quality plank that is either 3.2 mm (0.13 in) or 4 mm (0.16 in) thick. This thickness is a good balance of durability and affordability. In addition, it will have a somewhat soft feel beneath your feet, providing additional comfort in living areas. Choose a thickness of 5 mm (0.20 in) or more for the highest quality. The thickest vinyl planks can be anywhere from 5 mm (0.20 in) to over 8 mm (0.31 in) thick. These planks cost the most, but they are also the most durable and usually look the most like real wood. Thicker vinyl is a good option if you have a thin or uneven hardwood subfloor, since it will smooth out imperfections. EXPERT TIP\t\"Vinyl plank flooring is a great choice if you want an economical, durable floor covering, and it can be used in almost any room.\" Mitchell Newman\t\t\t\t\tHabitar Design and Stratagem Construction\t\t\t\t\t\t\t\tMitchell Newman is the Principal at Habitar Design and its sister company Stratagem Construction in Chicago, Illinois. He has 20 years of experience in construction, interior design and real estate development. Mitchell NewmanHabitar Design and Stratagem Construction Comparing Wear Layers Select a vinyl no-wax top coat for the most affordable wear layer. The top layer of your vinyl flooring, or the wear layer, is what determines how durable the flooring is. A no-wax coating is made from urethane or vinyl. It’s the most affordable option, but it is the least durable. You will need to apply a new protective coating every 2-3 years as it wears off over time. These coatings come in a variety of thicknesses and budget options. Pick an enhanced urethane coating for the most durability. These coatings are made from advanced materials such as aluminum oxide, and they will provide the greatest protection against everyday wear. Enhanced urethane coatings will cost more, but they will prolong the life of your flooring. Choose a wear layer of 10 mil (0.01 in) or more for most family areas. You can find vinyl planks with wear layers starting at as little as 2 mil (0.002 in), but these will wear out quickly. Planks with a wear layer of 10 mil (0.01 in) are considered to be appropriately durable for use in moderate-to-high traffic areas of your home. Opt for a 20 mil wear layer for commercial spaces. If you are going to be installing your vinyl plank flooring in an area with high foot traffic, such as a restaurant or retail space, choose flooring with a wear layer of at least 20 mil (0.02 in). This will ensure that your flooring is sufficiently durable to last for several years. Selecting the Color and Width Choose printed vinyl for the most affordable color patterns. Printed vinyl is more affordable because the color or pattern is printed directly onto the vinyl, then covered with a clear coat. This type of flooring shows scratches more easily, and it looks the least like real wood, but since it’s economical, it’s a good choice if you’re covering large areas. Select inlaid vinyl to get the look of real wood. Inlaid vinyl is made so that the color penetrates the entire floor, which means it won’t dull or scratch as easily as printed vinyl. Inlaid vinyl costs slightly more, but it will retain its new look longer than printed vinyl. Pick glued planks if you want a permanent installation option. Glued vinyl planks are adhered directly to the subfloor. This is the best option for high traffic areas, as it will be resistant to peeling or slipping. Because it’s difficult to remove glued flooring once it’s installed, you may want to have a professional install these floors. Opt for floating planks for an easy DIY installation. Floating planks snap together similar to tongue-and-groove wood planks. These are a popular option for people who want to install their new flooring themselves. Floating planks are not adhered to the floor, so they can be easily removed with a crowbar if you decide you want to change things up in a few years. Avoid wide planks unless your subfloor is perfectly even. Most vinyl planks are about 4–6 inches (10–15 cm) wide, but you can find options up to 11 inches (28 cm) wide. However, wide planks will not sit correctly unless your subfloor is completely level. If you have a hardwood subfloor, you should opt for standard-width planks.",
  "tyn_model":[
    "vinyl",
    "planks",
    "stratagem construction",
    "plank",
    "vinyl plank flooring",
    "habitar design",
    "real estate development.",
    "no-wax top coat",
    "no-wax coating",
    "protective coating",
    "urethane coating",
    "urethane coatings",
    "vinyl plank",
    "inlaid vinyl",
    "glued vinyl planks",
    "floating planks"
  ],
  "tyn_section":[

  ]
}