{
  "title":"How to Choose a Slow Cooker",
  "url":"https://www.wikihow.com/Choose-a-Slow-Cooker",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "parts":[
    {
      "name":"Deciding on a Size and Shape",
      "steps":[
        {
          "headline":"Choose a 2–3 US quarts (1.9–2.8 L) cooker for a 1 or 2-person family.",
          "description":"The smallest size of slow cooker is a 2–3 US quarts (1.9–2.8 L) cooker. This size is perfect if you live on your own or with 1 other person. For the best results, the crock of the cooker should be at least half full, but no more than ¾ full, when cooking. These small cookers also work well for making appetizers, serving hot drinks, and even baking cakes."
        },
        {
          "headline":"Pick a 4 US quarts (3.8 L) cooker for a family of 3-4.",
          "description":"A medium sized slow cooker is usually the best size for a medium sized family. Again, be sure your recipes fill half the crock but don’t go over ¾ full. Choose a larger sized cooker if you’ll be cooking larger items for your family like a whole chicken or turkey breasts in your slow cooker."
        },
        {
          "headline":"Choose a 6–8 US quarts (5.7–7.6 L) cooker for large families of 4-6.",
          "description":"For a large family, or if you intend to use your slow cooker for dishes you’ll be serving at parties, choose the largest size slow cooker. If you’re ever cooking smaller recipes or for a smaller number of people, you can place the recipe in a smaller oven-safe dish and put it inside your slow cooker. This size slow cooker is often considered the most versatile\nTry baking bread in this size cooker; it’s the perfect size for a loaf pan."
        },
        {
          "headline":"Go with a round cooker for soups, stews, and chilis.",
          "description":"Slow cookers generally come in either round or oval shapes. If you’ll mainly be using your cooker for liquids like soups and stews, a round cooker can be nice because it’s slightly smaller and fits easily into cabinets or on your counter."
        },
        {
          "headline":"Choose an oval cooker for meats or stuffed peppers.",
          "description":"For more surface area when cooking irregular-shaped foods, go with an oval cooker. This shape is better for cooking whole chickens, brisket, ribs, or stuffed peppers. You can also make soups and stews in these cookers, making oval the more versatile shape. Choose this slow cooker especially if you have plenty of storage space in which to keep it."
        }
      ]
    },
    {
      "name":"Choosing Features",
      "steps":[
        {
          "headline":"Go with a programmable cooker for schedule flexibility.",
          "description":"If you’d like the ease of setting a digital timer in the morning before you leave for the day, or even the night before, and having your dinner ready when you get home, a programmable cooker is the best option for you. This type of cooker often allows you to program up to 24 hours in 30-minute increments. Most programmable cookers have a keep-warm setting that they switch to automatically when the cook time is up. Some also have a manual mode in case you don’t want to use the programming feature. These cookers can be a bit higher in price than their manual counterparts."
        },
        {
          "headline":"Choose a manual cooker for more direct control and simplicity.",
          "description":"A manual slow cooker has a knob with low, medium, or high settings that you choose from, or a series of numbers from 1-5 or 1-10. These cookers also usually have a keep-warm setting, though you will have to set it to that manually when the cooker is finished cooking. This type of cooker is a good choice for you if you are home more often and can occasionally supervise the cooking in your slow cooker."
        },
        {
          "headline":"Look for a clear lid to check on your cooking without releasing heat.",
          "description":"A glass or clear plastic lid allows you to see the progress of your cooking without lifting the lid. Many people prefer these to the opaque plastic type of lid. You can also find cookers with split hinge lids, that allow you to lift 1 side to check on your food while retaining more heat than lifting the whole lid."
        },
        {
          "headline":"Choose a cooker with a locking lid for easy transport.",
          "description":"Some cookers come with locking lid which come in handy for transporting your food. Choose this type of cooker if you attend lots of potlucks, parties, or if you bring hot food with you to holiday functions."
        },
        {
          "headline":"Consider a sear function if you do lots of browning or sautéing.",
          "description":"Some cookers come with a sear function that allow you to brown meat or sauté vegetables before switching to a slow cook setting. Cookers with this function have stove-safe inserts, allowing you to do the browning or sautéing on the stove if you’d prefer. This function saves you from having to wash an extra pan later, since you can do your browning/sautéing directly in the crock."
        },
        {
          "headline":"Choose a casserole cooker to cut down on casserole cooking time.",
          "description":"Casserole cookers are fairly new, and are great for making anything from casseroles to lasagna, enchiladas, or dips. Their short, flat shape allows you to cook these types of dishes that were not often cooked in a slow cooker in the past. These cookers also come in a variety of sizes and can work well for traveling to potlucks or parties."
        },
        {
          "headline":"Get a warming function if you’ll be home after the cooking is done.",
          "description":"Slow cookers all come with high temperature and low temperature settings, but some also have a warming function which keeps food warm when it’s done cooking. Look for a cooker with a warming function that’s tied to a built-in timer that it switches to automatically when the cooking is done."
        },
        {
          "headline":"Choose a cooker with an insert to get more even heating.",
          "description":"Some slow cookers have a crock that sits on top of, instead of inside, the warming unit. It’s best to avoid these types of cookers because the heating is more uneven, and the food will need to be stirred more often to avoid scorching. Look for a crock that sits inside the warming unit, so you don’t have to continuously stir the food."
        },
        {
          "headline":"Choose a ceramic, porcelain, or metal insert based on your preferences.",
          "description":"All the materials of inserts are good at conducting heat, so the type of material you get is really up to your preference. Just be sure that the crock is easily removable for cleaning, so that you don’t get stuck having to clean the inside while it’s still attached to the heating unit."
        }
      ]
    }
  ],
  "text":" Deciding on a Size and Shape Choose a 2–3 US quarts (1.9–2.8 L) cooker for a 1 or 2-person family. The smallest size of slow cooker is a 2–3 US quarts (1.9–2.8 L) cooker. This size is perfect if you live on your own or with 1 other person. For the best results, the crock of the cooker should be at least half full, but no more than ¾ full, when cooking. These small cookers also work well for making appetizers, serving hot drinks, and even baking cakes. Pick a 4 US quarts (3.8 L) cooker for a family of 3-4. A medium sized slow cooker is usually the best size for a medium sized family. Again, be sure your recipes fill half the crock but don’t go over ¾ full. Choose a larger sized cooker if you’ll be cooking larger items for your family like a whole chicken or turkey breasts in your slow cooker. Choose a 6–8 US quarts (5.7–7.6 L) cooker for large families of 4-6. For a large family, or if you intend to use your slow cooker for dishes you’ll be serving at parties, choose the largest size slow cooker. If you’re ever cooking smaller recipes or for a smaller number of people, you can place the recipe in a smaller oven-safe dish and put it inside your slow cooker. This size slow cooker is often considered the most versatile\nTry baking bread in this size cooker; it’s the perfect size for a loaf pan. Go with a round cooker for soups, stews, and chilis. Slow cookers generally come in either round or oval shapes. If you’ll mainly be using your cooker for liquids like soups and stews, a round cooker can be nice because it’s slightly smaller and fits easily into cabinets or on your counter. Choose an oval cooker for meats or stuffed peppers. For more surface area when cooking irregular-shaped foods, go with an oval cooker. This shape is better for cooking whole chickens, brisket, ribs, or stuffed peppers. You can also make soups and stews in these cookers, making oval the more versatile shape. Choose this slow cooker especially if you have plenty of storage space in which to keep it. Choosing Features Go with a programmable cooker for schedule flexibility. If you’d like the ease of setting a digital timer in the morning before you leave for the day, or even the night before, and having your dinner ready when you get home, a programmable cooker is the best option for you. This type of cooker often allows you to program up to 24 hours in 30-minute increments. Most programmable cookers have a keep-warm setting that they switch to automatically when the cook time is up. Some also have a manual mode in case you don’t want to use the programming feature. These cookers can be a bit higher in price than their manual counterparts. Choose a manual cooker for more direct control and simplicity. A manual slow cooker has a knob with low, medium, or high settings that you choose from, or a series of numbers from 1-5 or 1-10. These cookers also usually have a keep-warm setting, though you will have to set it to that manually when the cooker is finished cooking. This type of cooker is a good choice for you if you are home more often and can occasionally supervise the cooking in your slow cooker. Look for a clear lid to check on your cooking without releasing heat. A glass or clear plastic lid allows you to see the progress of your cooking without lifting the lid. Many people prefer these to the opaque plastic type of lid. You can also find cookers with split hinge lids, that allow you to lift 1 side to check on your food while retaining more heat than lifting the whole lid. Choose a cooker with a locking lid for easy transport. Some cookers come with locking lid which come in handy for transporting your food. Choose this type of cooker if you attend lots of potlucks, parties, or if you bring hot food with you to holiday functions. Consider a sear function if you do lots of browning or sautéing. Some cookers come with a sear function that allow you to brown meat or sauté vegetables before switching to a slow cook setting. Cookers with this function have stove-safe inserts, allowing you to do the browning or sautéing on the stove if you’d prefer. This function saves you from having to wash an extra pan later, since you can do your browning/sautéing directly in the crock. Choose a casserole cooker to cut down on casserole cooking time. Casserole cookers are fairly new, and are great for making anything from casseroles to lasagna, enchiladas, or dips. Their short, flat shape allows you to cook these types of dishes that were not often cooked in a slow cooker in the past. These cookers also come in a variety of sizes and can work well for traveling to potlucks or parties. Get a warming function if you’ll be home after the cooking is done. Slow cookers all come with high temperature and low temperature settings, but some also have a warming function which keeps food warm when it’s done cooking. Look for a cooker with a warming function that’s tied to a built-in timer that it switches to automatically when the cooking is done. Choose a cooker with an insert to get more even heating. Some slow cookers have a crock that sits on top of, instead of inside, the warming unit. It’s best to avoid these types of cookers because the heating is more uneven, and the food will need to be stirred more often to avoid scorching. Look for a crock that sits inside the warming unit, so you don’t have to continuously stir the food. Choose a ceramic, porcelain, or metal insert based on your preferences. All the materials of inserts are good at conducting heat, so the type of material you get is really up to your preference. Just be sure that the crock is easily removable for cleaning, so that you don’t get stuck having to clean the inside while it’s still attached to the heating unit.",
  "tyn_model":[
    "cooker",
    "slow cooker",
    "cookers",
    "slow cookers",
    "programmable cooker",
    "chickens",
    "brisket",
    "programmable cookers",
    "food",
    "vegetables",
    "stove",
    "casserole cooker",
    "casserole cookers",
    "timer",
    "heating unit"
  ],
  "tyn_section":[

  ]
}