{
  "title":"How to Choose a Cabin Building Method",
  "url":"https://www.wikihow.com/Choose-a-Cabin-Building-Method",
  "category_hierarchy":[
    "Home and Garden",
    "Home Improvements",
    "House Building"
  ],
  "methods":[
    {
      "name":"Kits",
      "steps":[
        {
          "headline":"Beware of the Log Home Kit.",
          "description":"Do you have the time to take a couple of weeks to assemble a cabin kit? When fully assembled log cabins are very competitively priced with the kit packages you can purchase, and often times priced even better. Did you know the average cost in America to build a Log cabin ranges from a conservative estimate of $100 per square foot to an unbelievable $240 per square foot. The cost per square foot for a fully assembled unit averages out at about $65 per square foot. Take a minute and do a “Google” search for “cost of a log home”, and see for yourself the cost to build a log home. Many times you don't have the necessary extra set 3-4 sets of hands necessary to assemble portions of the kit. If your building site isn't precisely level, the precut lumber doesn't fit, or if you place one piece wrong you fight everything the rest of the way, and sometimes a piece will be cut wrong at the factory, a mistake that wasn't even yours. Couple that with the fact that very few people have ever assembled a kit, and have yet to face the frustrations of doing it themselves or finding someone to do it for them. You've probably assembled things with missing pieces, and had things that just would not go together, and the box always reads easy assembly, but really, is there anything more frustrating?"
        },
        {
          "headline":"Keep in mind that a cabin kit itself makes up only a fraction of the total cost of your building.",
          "description":"Most kits are only exterior walls, do not include a foundation, floor system, electric, insulation, plumbing, or any finish on the interior. Those supplies will cost you significantly and also add to the overall length of your project. Make sure you know exactly what is coming with your kit, and calculate additional costs you will have in assembling the structure."
        },
        {
          "headline":"Make sure your site is accessible by tractor trailer, if it is not you can unload at the nearest point accessible by the truck.",
          "description":"Keep in mind that a driver will not risk running his truck and trailer into a job site that could damage his equipment, or get him stuck."
        },
        {
          "headline":"Don't assume that every kit that leaves the factory is done correctly.",
          "description":"Many people think that because the kit was sent from a factory that the kit is correct, and they are doing something wrong, but kit builders make mistakes, only they are not there to help fix them. If you set one piece wrong, or something doesn't go together quite right, you can fight everything the rest of the building and nothing will be smooth, or correct."
        },
        {
          "headline":"Have the right equipment in place.",
          "description":"You need to have a forklift onsite to unload the kit from the truck. Many kits require a crane to set pieces of the roof in place. Make sure you get a list of all the tools that you need in order to put you kit together, and find out where you can buy, borrow, or rent them. Kits do not come stained, and that is something you will need to do, or pay to have done. Some kit suppliers will offer you their services in this area, but you will pay dearly for it. Many stains also have toxic fumes which you need to be careful around. You are limited in the custom design. They take a long time to assemble."
        },
        {
          "headline":"If you are putting a kit together by yourself you really need to have at least some carpentry experience, and it would help if you had some log building experience.",
          "description":"A very small 12X24 kit may take you approx. 6-7 weekends, or 12-14 days, and is a lot of work. If you plan to run electric, you will need to drill through the center of each log the whole way up your wall. These things can take a great deal of time, slow the overall process down. The only time a kit would recommend is if you are looking to put a building in a very remote location that is inaccessible. Keep in mind though that you still need to find a way to get all your pieces back to the site."
        }
      ]
    },
    {
      "name":"Building from Scratch",
      "steps":[
        {
          "headline":"Weigh the benefits and costs.",
          "description":"This option is very expensive, but does allow for the most customization of your cabin. You have the freedom to design the cabin exactly how you want, both on the interior and exterior."
        },
        {
          "headline":"It can take up to 6 months and sometimes even longer to build your cabin.",
          "description":"You can often expect delays that will push back your timeline, and cause your budget to run over. Delays can occur due to weather, waiting for materials, or even simple complications in the building process."
        },
        {
          "headline":"You need to have a road in that grants access for all of your supplies, and crews.",
          "description":""
        },
        {
          "headline":"You will need to find a way to remove of all of your scrap and trash from your site.",
          "description":"Any time you have large work crews coming to a site the property gets torn up, and left a mess. The larger the project the larger the mess left behind. Also note that contractors are often permitted to bury a certain amount of the scrap from a work-site on your property, ask about that up front so you know what you can expect. The more remote your site the more difficult the trash removal is."
        },
        {
          "headline":"You can save yourself some money by operating as your own general contractor, but there is a lot of work and headaches in that.",
          "description":"Make sure that you know what you are getting into before taking on that responsibility."
        }
      ]
    },
    {
      "name":"Pre Assembled Cabins",
      "steps":[
        {
          "headline":".",
          "description":"Reconsider the stereotype of modular homes. In recent year modular homes have become more and more popular among home builders. When many people think of modular homes they think of trailer units that are towed to a site and then connected together. However, the modern modular home is something entirely different. The major advantage of modular homes is they can be assembled in the controlled environment of a factory and then delivered in pieces to the site. This saves on building time, overall cost, and the mess left by a traditional stick built home. Modular homes are also said to be built sturdier than traditional homes because they have to withstand the delivery process. This means that you can get a less expensive, sturdier home in less time than a traditional building."
        },
        {
          "headline":"Consider the limitations to this type of building.",
          "description":"You need to make sure that you have clearance for the building to be delivered. You will need to arrange for your water, electric, and sewer to be run to your building and you will also need to hook it up when building is in place. For larger double wide buildings, or a building set up off the ground on a foundation a crane rental is necessary. Buildings are customizable, and it is possible to accommodate any ideas or options that you would like to incorporate. You are limited in the size buildings that can be made because everything is hauled down the road fully assembled, and needs to be careful of height and width restrictions."
        }
      ]
    }
  ],
  "text":" Kits Beware of the Log Home Kit. Do you have the time to take a couple of weeks to assemble a cabin kit? When fully assembled log cabins are very competitively priced with the kit packages you can purchase, and often times priced even better. Did you know the average cost in America to build a Log cabin ranges from a conservative estimate of $100 per square foot to an unbelievable $240 per square foot. The cost per square foot for a fully assembled unit averages out at about $65 per square foot. Take a minute and do a “Google” search for “cost of a log home”, and see for yourself the cost to build a log home. Many times you don't have the necessary extra set 3-4 sets of hands necessary to assemble portions of the kit. If your building site isn't precisely level, the precut lumber doesn't fit, or if you place one piece wrong you fight everything the rest of the way, and sometimes a piece will be cut wrong at the factory, a mistake that wasn't even yours. Couple that with the fact that very few people have ever assembled a kit, and have yet to face the frustrations of doing it themselves or finding someone to do it for them. You've probably assembled things with missing pieces, and had things that just would not go together, and the box always reads easy assembly, but really, is there anything more frustrating? Keep in mind that a cabin kit itself makes up only a fraction of the total cost of your building. Most kits are only exterior walls, do not include a foundation, floor system, electric, insulation, plumbing, or any finish on the interior. Those supplies will cost you significantly and also add to the overall length of your project. Make sure you know exactly what is coming with your kit, and calculate additional costs you will have in assembling the structure. Make sure your site is accessible by tractor trailer, if it is not you can unload at the nearest point accessible by the truck. Keep in mind that a driver will not risk running his truck and trailer into a job site that could damage his equipment, or get him stuck. Don't assume that every kit that leaves the factory is done correctly. Many people think that because the kit was sent from a factory that the kit is correct, and they are doing something wrong, but kit builders make mistakes, only they are not there to help fix them. If you set one piece wrong, or something doesn't go together quite right, you can fight everything the rest of the building and nothing will be smooth, or correct. Have the right equipment in place. You need to have a forklift onsite to unload the kit from the truck. Many kits require a crane to set pieces of the roof in place. Make sure you get a list of all the tools that you need in order to put you kit together, and find out where you can buy, borrow, or rent them. Kits do not come stained, and that is something you will need to do, or pay to have done. Some kit suppliers will offer you their services in this area, but you will pay dearly for it. Many stains also have toxic fumes which you need to be careful around. You are limited in the custom design. They take a long time to assemble. If you are putting a kit together by yourself you really need to have at least some carpentry experience, and it would help if you had some log building experience. A very small 12X24 kit may take you approx. 6-7 weekends, or 12-14 days, and is a lot of work. If you plan to run electric, you will need to drill through the center of each log the whole way up your wall. These things can take a great deal of time, slow the overall process down. The only time a kit would recommend is if you are looking to put a building in a very remote location that is inaccessible. Keep in mind though that you still need to find a way to get all your pieces back to the site. Building from Scratch Weigh the benefits and costs. This option is very expensive, but does allow for the most customization of your cabin. You have the freedom to design the cabin exactly how you want, both on the interior and exterior. It can take up to 6 months and sometimes even longer to build your cabin. You can often expect delays that will push back your timeline, and cause your budget to run over. Delays can occur due to weather, waiting for materials, or even simple complications in the building process. You need to have a road in that grants access for all of your supplies, and crews.  You will need to find a way to remove of all of your scrap and trash from your site. Any time you have large work crews coming to a site the property gets torn up, and left a mess. The larger the project the larger the mess left behind. Also note that contractors are often permitted to bury a certain amount of the scrap from a work-site on your property, ask about that up front so you know what you can expect. The more remote your site the more difficult the trash removal is. You can save yourself some money by operating as your own general contractor, but there is a lot of work and headaches in that. Make sure that you know what you are getting into before taking on that responsibility. Pre Assembled Cabins . Reconsider the stereotype of modular homes. In recent year modular homes have become more and more popular among home builders. When many people think of modular homes they think of trailer units that are towed to a site and then connected together. However, the modern modular home is something entirely different. The major advantage of modular homes is they can be assembled in the controlled environment of a factory and then delivered in pieces to the site. This saves on building time, overall cost, and the mess left by a traditional stick built home. Modular homes are also said to be built sturdier than traditional homes because they have to withstand the delivery process. This means that you can get a less expensive, sturdier home in less time than a traditional building. Consider the limitations to this type of building. You need to make sure that you have clearance for the building to be delivered. You will need to arrange for your water, electric, and sewer to be run to your building and you will also need to hook it up when building is in place. For larger double wide buildings, or a building set up off the ground on a foundation a crane rental is necessary. Buildings are customizable, and it is possible to accommodate any ideas or options that you would like to incorporate. You are limited in the size buildings that can be made because everything is hauled down the road fully assembled, and needs to be careful of height and width restrictions.",
  "tyn_model":[
    "modular homes",
    "crane",
    "“google",
    "” search",
    "“cost",
    "”,",
    "log home",
    "lumber",
    "tractor trailer",
    "kit builders",
    "forklift onsite",
    "kit",
    "electric",
    "drill",
    "trash",
    "general contractor",
    "home builders",
    "modular home",
    "water",
    "sewer"
  ],
  "tyn_section":[

  ]
}