{
  "title":"How to Build a Slither in Slither.io",
  "url":"https://www.wikihow.com/Build-a-Slither-in-Slither.io",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "steps":[
    {
      "headline":"Go to Slither.io.",
      "description":"You can do this by typing \"slither.io\" into your search bar or URL bar. You can also download the game from the Google Play Store or the App Store."
    },
    {
      "headline":"Click \"Change Skin\".",
      "description":"It is at the bottom left-hand corner."
    },
    {
      "headline":"Click \"Build a Slither\".",
      "description":"You'll find it at the bottom right-hand corner."
    },
    {
      "headline":"Look at the colors and patterns.",
      "description":"Click on the one you'd like to include in your slither the most. Whichever one you click first will be that of your snake's head. Furthermore, the next color/pattern you click will be that of the next bit of your snake. If your sequence is repeated, you don't need to continue clicking on it in order for it to appear on your snake. Simply enter it once and it will be repeated on the rest of your snake."
    },
    {
      "headline":"Click \"Save\" once you are happy with it.",
      "description":"If you still think you need to make changes, press the \"Reset\" button and start over."
    },
    {
      "headline":"Click \"Save\" again.",
      "description":""
    },
    {
      "headline":"Click \"Play\" to see your unique snake in action.",
      "description":"You can go back and change your slither any time."
    }
  ],
  "text":" Go to Slither.io. You can do this by typing \"slither.io\" into your search bar or URL bar. You can also download the game from the Google Play Store or the App Store. Click \"Change Skin\". It is at the bottom left-hand corner. Click \"Build a Slither\". You'll find it at the bottom right-hand corner. Look at the colors and patterns. Click on the one you'd like to include in your slither the most. Whichever one you click first will be that of your snake's head. Furthermore, the next color/pattern you click will be that of the next bit of your snake. If your sequence is repeated, you don't need to continue clicking on it in order for it to appear on your snake. Simply enter it once and it will be repeated on the rest of your snake. Click \"Save\" once you are happy with it. If you still think you need to make changes, press the \"Reset\" button and start over. Click \"Save\" again.  Click \"Play\" to see your unique snake in action. You can go back and change your slither any time.",
  "tyn_model":[
    "slither"
  ],
  "tyn_section":[

  ]
}