{
  "title":"How to Use Easy Duplicate Finder to Clean Out Your Digital Images",
  "url":"https://www.wikihow.com/Use-Easy-Duplicate-Finder-to-Clean-Out-Your-Digital-Images",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographs",
    "Care of Photographs",
    "Storing Photos"
  ],
  "steps":[
    {
      "headline":"Download the software.",
      "description":"There is a free version. It can be found at EasyDuplicateFinder.com."
    },
    {
      "headline":"Run the program.",
      "description":"This is your first screen. You will be selecting the source folder for the search, which file types, and the size limits, if any."
    },
    {
      "headline":"Select the folder(s) that you want to scan and that you don't want to scan (if applicable).",
      "description":"If you select a folder, the software will look in all of the subfolders. If you don't want a folder to be searched, then you will have to inform the software."
    },
    {
      "headline":"Choose the image type.",
      "description":"If you want all images to be processed, don't use this option. It is recommended that you choose image files, like NEF, JPG, PNG, DNG, CRW, etc."
    },
    {
      "headline":"Choose the file size.",
      "description":"If you have any particularly large files, you might want to use this option."
    },
    {
      "headline":"Start the scan.",
      "description":"This may take a while."
    },
    {
      "headline":"Wait for your results.",
      "description":"Once your scan is complete, select 'Go Fix Them! '."
    },
    {
      "headline":"Look at the images.",
      "description":"If you are unsure about any of the files listed, then you might want to select the"
    },
    {
      "headline":"Press the Trash can icon.",
      "description":"That will delete the preselected duplicates."
    }
  ],
  "text":" Download the software. There is a free version. It can be found at EasyDuplicateFinder.com. Run the program. This is your first screen. You will be selecting the source folder for the search, which file types, and the size limits, if any. Select the folder(s) that you want to scan and that you don't want to scan (if applicable). If you select a folder, the software will look in all of the subfolders. If you don't want a folder to be searched, then you will have to inform the software. Choose the image type. If you want all images to be processed, don't use this option. It is recommended that you choose image files, like NEF, JPG, PNG, DNG, CRW, etc. Choose the file size. If you have any particularly large files, you might want to use this option. Start the scan. This may take a while. Wait for your results. Once your scan is complete, select 'Go Fix Them! '. Look at the images. If you are unsure about any of the files listed, then you might want to select the Press the Trash can icon. That will delete the preselected duplicates.",
  "tyn_model":[
    "software",
    "image files"
  ],
  "tyn_section":[

  ]
}