{
  "title":"How to Get Rares from Art on Animal Jam",
  "url":"https://www.wikihow.com/Get-Rares-from-Art-on-Animal-Jam",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Animal Jam",
    "Animal Jam Trading"
  ],
  "steps":[
    {
      "headline":"Decide what your style of drawing is.",
      "description":"The Animal Jam art system is borrowed from the Microsoft Art app, so many of the tools are similar, however it is extremely limited. This means it can be difficult to make very good art. That doesn't mean it's impossible though. Decide what art style you want to be your main type. You can have multiple if you'd like. Practice each style and see which one you like best and which one you're most good at. Some examples are below:\nLine art - the easiest tool to use with the painting program on Animal Jam, you can just use the pen tool to create simple line art and color it in with the paint bucket tool and add basic shading. This art is simple and more cartoon-looking, but with enough details, you can get rares off of simple and easy to make art like this. Spray art - combined with the outline of the figure you're drawing with the pen tool, spray art can make your piece look extremely realistic. Masterpieces like this do take a very long time, and they need to be quite elaborate to be able to get you rares. Blending art - blending is one of the hardest tools to use in the Animal Jam art studio unfortunately, but if you manage to master it, you can combine it with other tools to create elaborate designs which can be made quite easily. You can then trade these for rares."
    },
    {
      "headline":"Decide what you will draw.",
      "description":"There are a number of things - animals, humans, anime, or even just designs. All of these can be made in any style you'd like. The more elaborate the style, and the more detailed and realistic, usually the more rare the art piece you make will be. You can make designs such as multicolored spirals, swirls, etc. using the blending tool, realistic animals with spray paint and pen, etc."
    },
    {
      "headline":"Understand how to do each type of art.",
      "description":"Line art, spray art, and art with blending all have specific methods that must be used to master each type. Line art is the simplest, while spray and blending are more difficult. With line art, use the pen tool, represented by the paint brush box when you're inside the art studio. Try outlining the thing you are drawing with the color of the object, animal, person, etc. itself. This improves the look of the art instead of outlining the whole thing in just solid black. Once you color in the art, you can add basic shading. For example, if you draw a wolf and it is facing the moon, color the wolf gray, brown, etc. Then pick a lighter tint of the color of the wolf, use the pen tool to draw the line where the lighter shade will stop, and then fill the area within that line with the same lighter tint you chose. This is simple and easy, but it can still appear detailed and can get you rares. With spray art, outline the thing you are drawing in its color. Switch to the spray tool, represented by the spray painter box icon, and use, preferably the the first, second, or third options for how thick you want your dots to be. Larger dots will not allow you to shade with the tool as easily and it will look solid, which is not what you want. The spray tool is unique because you can control how dark or how light you want a certain area to be with just a number of clicks, without having to change from dark colors to light colors all the time. Say you're drawing a dog in daylight and the sun is behind it. You'd color the front of the dog darkly, clicking multiple times with the spray tool to get the darkest color you can possibly get with it. As you color the parts of the dog closer to the sun, you can control how the dark color blends to the lightest possible color you can get with the spray tool just by changing the number of clicks you use, or how often you go over a space over and over again. You don't need to continuously click with this tool as this will get exhausting - just click and hold and swipe your mouse over the areas you want to color till an area is covered with dots. Go over an area slower for darker color, and go over an area fast for lighter color. You can control how dark an area gets through your speed as well. Remember, spray art takes more devotion and time. Blending is an extremely difficult tool to use and it's best to create simple design masterpieces such as spirals, patterns, illusions, etc. Contrary to its name, it isn't the best tool for shading or blending together colors. If you just want to make simple design masterpieces which can still get you small rares, create colorful or interesting multicolored designs or illusions. Then streak the blending tool, represented by the paw box icon, in the direction you want to create your design. Say you have black and white checkers on your canvas. Streak the blending tool along each row of black and white checkers to get interesting streaks through this checkered picture. You can be more elaborate if you want. Design art like this, such as illusions, can also be done with simple line art."
    },
    {
      "headline":"Practice and take your time.",
      "description":"Try out each of the different coloring styles or combine them if you'd like. See which one you're best at or which one you enjoy most and stick with it. Make masterpieces in this style, or multiple styles if you'd like. Decide which style would get you rare faster. If you're really good at spray painting art or you can put the blending tool to good use in elaborate, realistic masterpieces, you can take more time on your art and possibly get small spikes. If you're good at simple line art or designs, you can make many masterpieces in a short amount of time and get many small good items faster, such as clothing betas or den betas."
    },
    {
      "headline":"Save up a large amount of diamonds.",
      "description":"Creating art requires diamonds or masterpiece coins. If you're non member, you'll need masterpiece coins. Members can use coins or diamonds. Masterpiece coins are worth 1 to 2 clothing betas, and you can get those easily from adventures such as Return of the Phantoms and the Phantom Portal hard mode. If you have any extra spikes or good rares like black worn blankets, you can trade those for many masterpiece coins at once. If you're member, you can easily get at least 3 to 6 diamonds a day assuming you've logged in 3 days in a row, so getting diamonds shouldn't be a problem."
    },
    {
      "headline":"Begin creating masterpieces.",
      "description":"When you've practiced and gotten better, create your art! Keep it appropriate and neat and try not to make it cliche. There are a huge amount of masterpieces of Animal Jam items, like spikes, headdresses, etc. Make more unique art. You can make art of characters from TV shows, movies, books, or comics. As you create masterpieces, think of what you enjoy drawing most and what you are best at drawing. You might realize you don't have to even create actual drawings to get rares out of them - you could make comic strips through multiple masterpieces (line art). Or you can just write out and customize quotes and words (all art styles). You can write inspirational quotes, color the words in or detail them any way you want, and customize those masterpieces with designs around the words, spray painted backgrounds, etc. Be creative."
    },
    {
      "headline":"Add details.",
      "description":"A wolf in the forest is nice, but there are a lot of wolf masterpieces. Make it unique. Add dripping fur or detailed eyes. A lot of masterpieces are cliche in the game, such as wolves in the forest, masterpieces of people's main animals, art of Animal Jam items like spikes, etc. Unique art is more likely to be worth more in other people's eyes and your own."
    },
    {
      "headline":"Create a decent amount of masterpieces.",
      "description":"If you're looking to trade multiple for an item, create a lot. If not, you can just place your masterpieces on trade and trade them each for items like clothing betas or den betas. Once you've created enough masterpieces to show others your style of art and allow them to decide whether they like it or not, you can begin trading your art for rares. Try making many different masterpieces rather than several of the same kind. This will help you later on decide which of your masterpieces are viewed as the rarest so you can trade those ones for better rares. However, keep and make a variety of masterpieces as well. Over time, when many of the same masterpiece is created and passed around, like most famous Animal Jam artists' pieces, they lose value."
    },
    {
      "headline":"Assess how rare your masterpiece may be.",
      "description":"Get a good and general idea of what your masterpiece is worth. Blended and detailed art, like spray paint art, is usually considered to be more valuable than line art. Keep in mind that just because a masterpiece is very important to you doesn't mean it's the same for others. A masterpiece given to you by a friend wishing you good luck will mean more to you than it will to a stranger, so don't make it worth a blue long because you really like it. Avoid placing prices on your masterpieces immediately. First, place them on trade and go to a server such as Aldan. Say, \"Offer for my art or jag me offers for multiple pieces.\" Depending on what people offer you, you'll have a good chance at getting those items. Just because you get offered den betas or clothing betas doesn't mean your art is bad. Some people don't view art to be valuable in general. Some people think art shouldn't be worth anything no matter what in this game. Look for the offers of people who enjoy art. If you'd like, ask obvious unbiased (preferably no famous Animal Jam artists, as they can be biased) collectors and traders or buddies who like art to offer for your masterpieces. Or you can ask them what they think the worth would be. Currently, art blended using the spray paint tool can get extremely valuable. Hyenine1 is an example of a popular artist in Animal Jam. He uses the spray paint method combined with other details to make his realistic masterpieces, and they are viewed as decently valued. However, value also depends on the Jammer. Some Jammers may prefer simple characters drawn and shaded with pen, and may offer you more. It also depends on what's in your masterpiece. Anime is popular - someone might prefer a simple line drawn anime masterpiece to an extremely realistic dog. There isn't really a set value on art - it depends on a number of factors which are all different for each person, which is why the value of art is always ambiguous."
    },
    {
      "headline":"Place your masterpieces on trade.",
      "description":"As explained above, art value is very ambiguous. The majority of people view spray paint art as more valuable because it's more realistic, but then again not everyone loves realistic art and might prefer something more simple and less messy, like line art. This is why it's best to avoid placing a set price on your masterpieces, unless it's small. Place many different art pieces on trade - not just the same one. This will allow you to see what type of art you've created people mostly want so that you can keep creating it. Create other masterpieces too of course - many of the same masterpiece can get boring, even on your trade list."
    },
    {
      "headline":"Open your jam a grams and receive offers.",
      "description":"If you're looking for small rares, say, \"Trade me 1 clothing beta/1 den beta per masterpiece!' If you want larger rares, like long collars, this may prove to be difficult unless you can create extremely well-drawn and realistic art. Unfortunately, most famous artists in the game have 'reserved' this opportunity for themselves. Unless you can become a famous well-known artist within the game (which may be difficult considering there are very good artists who aren't famous), it will prove to be hard to get large rares for your art. However, it's not impossible, so if you want to give it a shot, feel free to. If you're looking for larger rares, you can attempt to get items such as short collars for your masterpieces. Or you can trade multiple masterpieces for items like this. If you'd like your art to be more noticed and increase in value, improve your art skills. View famous artists' art and examine it. Most famous artists do spray paint art, which can prove to be realistic and valuable. If you want to be more noticed, perform more art trades often in Aldan or host frequent free art giveaways if you want your art to be noticed more. When your art is shared around more, more people might recognize you and your masterpieces can go up in value."
    },
    {
      "headline":"Do commissions.",
      "description":"Doing commissions is a great way to get rares off your art. Place good examples of your art on trade and go to Aldan. Announce yourself by saying, \"Doing commissions for your [animal/pet/item/favorite character, etc]. Prince is a short collar!\" or \"Doing commissions for your main look, price ranges from short to a bad long collar.\" Keep in mind this is a little more advanced, so your art may need to stretch past just line art. Again, realistic spray paint art is very popular. Put examples on trade so people know what your art is like. This way, when people tell you they'll give you your price for an art piece you make for them, you know you'll get the item for sure because that person wants an art piece for you, even if you just make line art. When doing this, do not make your art ridiculously expensive. Animal Jam isn't centered around art, but a whole trading system of a variety of rares. People are looking to trade up in rarity, not trade a black long for an art piece they'll get bored of eventually. You can still do commissions with line art or designs, but you may want to make your prices lower, such as from a few den betas to a bad short collar. Or if you can make line art with shading and other details, you can raise your prices slightly. Raise your prices as you improve your art."
    },
    {
      "headline":"Improve your art.",
      "description":"Think positive about your art! If you want, ask for help or ask for criticism from an artist or friend. Don't always expect nice criticism from everyone. Take it as help and use it. Ask some good friends, multiple artists not just one. Improve your skills and you can get even rarer off your art as you continue to improve."
    }
  ],
  "text":" Decide what your style of drawing is. The Animal Jam art system is borrowed from the Microsoft Art app, so many of the tools are similar, however it is extremely limited. This means it can be difficult to make very good art. That doesn't mean it's impossible though. Decide what art style you want to be your main type. You can have multiple if you'd like. Practice each style and see which one you like best and which one you're most good at. Some examples are below:\nLine art - the easiest tool to use with the painting program on Animal Jam, you can just use the pen tool to create simple line art and color it in with the paint bucket tool and add basic shading. This art is simple and more cartoon-looking, but with enough details, you can get rares off of simple and easy to make art like this. Spray art - combined with the outline of the figure you're drawing with the pen tool, spray art can make your piece look extremely realistic. Masterpieces like this do take a very long time, and they need to be quite elaborate to be able to get you rares. Blending art - blending is one of the hardest tools to use in the Animal Jam art studio unfortunately, but if you manage to master it, you can combine it with other tools to create elaborate designs which can be made quite easily. You can then trade these for rares. Decide what you will draw. There are a number of things - animals, humans, anime, or even just designs. All of these can be made in any style you'd like. The more elaborate the style, and the more detailed and realistic, usually the more rare the art piece you make will be. You can make designs such as multicolored spirals, swirls, etc. using the blending tool, realistic animals with spray paint and pen, etc. Understand how to do each type of art. Line art, spray art, and art with blending all have specific methods that must be used to master each type. Line art is the simplest, while spray and blending are more difficult. With line art, use the pen tool, represented by the paint brush box when you're inside the art studio. Try outlining the thing you are drawing with the color of the object, animal, person, etc. itself. This improves the look of the art instead of outlining the whole thing in just solid black. Once you color in the art, you can add basic shading. For example, if you draw a wolf and it is facing the moon, color the wolf gray, brown, etc. Then pick a lighter tint of the color of the wolf, use the pen tool to draw the line where the lighter shade will stop, and then fill the area within that line with the same lighter tint you chose. This is simple and easy, but it can still appear detailed and can get you rares. With spray art, outline the thing you are drawing in its color. Switch to the spray tool, represented by the spray painter box icon, and use, preferably the the first, second, or third options for how thick you want your dots to be. Larger dots will not allow you to shade with the tool as easily and it will look solid, which is not what you want. The spray tool is unique because you can control how dark or how light you want a certain area to be with just a number of clicks, without having to change from dark colors to light colors all the time. Say you're drawing a dog in daylight and the sun is behind it. You'd color the front of the dog darkly, clicking multiple times with the spray tool to get the darkest color you can possibly get with it. As you color the parts of the dog closer to the sun, you can control how the dark color blends to the lightest possible color you can get with the spray tool just by changing the number of clicks you use, or how often you go over a space over and over again. You don't need to continuously click with this tool as this will get exhausting - just click and hold and swipe your mouse over the areas you want to color till an area is covered with dots. Go over an area slower for darker color, and go over an area fast for lighter color. You can control how dark an area gets through your speed as well. Remember, spray art takes more devotion and time. Blending is an extremely difficult tool to use and it's best to create simple design masterpieces such as spirals, patterns, illusions, etc. Contrary to its name, it isn't the best tool for shading or blending together colors. If you just want to make simple design masterpieces which can still get you small rares, create colorful or interesting multicolored designs or illusions. Then streak the blending tool, represented by the paw box icon, in the direction you want to create your design. Say you have black and white checkers on your canvas. Streak the blending tool along each row of black and white checkers to get interesting streaks through this checkered picture. You can be more elaborate if you want. Design art like this, such as illusions, can also be done with simple line art. Practice and take your time. Try out each of the different coloring styles or combine them if you'd like. See which one you're best at or which one you enjoy most and stick with it. Make masterpieces in this style, or multiple styles if you'd like. Decide which style would get you rare faster. If you're really good at spray painting art or you can put the blending tool to good use in elaborate, realistic masterpieces, you can take more time on your art and possibly get small spikes. If you're good at simple line art or designs, you can make many masterpieces in a short amount of time and get many small good items faster, such as clothing betas or den betas. Save up a large amount of diamonds. Creating art requires diamonds or masterpiece coins. If you're non member, you'll need masterpiece coins. Members can use coins or diamonds. Masterpiece coins are worth 1 to 2 clothing betas, and you can get those easily from adventures such as Return of the Phantoms and the Phantom Portal hard mode. If you have any extra spikes or good rares like black worn blankets, you can trade those for many masterpiece coins at once. If you're member, you can easily get at least 3 to 6 diamonds a day assuming you've logged in 3 days in a row, so getting diamonds shouldn't be a problem. Begin creating masterpieces. When you've practiced and gotten better, create your art! Keep it appropriate and neat and try not to make it cliche. There are a huge amount of masterpieces of Animal Jam items, like spikes, headdresses, etc. Make more unique art. You can make art of characters from TV shows, movies, books, or comics. As you create masterpieces, think of what you enjoy drawing most and what you are best at drawing. You might realize you don't have to even create actual drawings to get rares out of them - you could make comic strips through multiple masterpieces (line art). Or you can just write out and customize quotes and words (all art styles). You can write inspirational quotes, color the words in or detail them any way you want, and customize those masterpieces with designs around the words, spray painted backgrounds, etc. Be creative. Add details. A wolf in the forest is nice, but there are a lot of wolf masterpieces. Make it unique. Add dripping fur or detailed eyes. A lot of masterpieces are cliche in the game, such as wolves in the forest, masterpieces of people's main animals, art of Animal Jam items like spikes, etc. Unique art is more likely to be worth more in other people's eyes and your own. Create a decent amount of masterpieces. If you're looking to trade multiple for an item, create a lot. If not, you can just place your masterpieces on trade and trade them each for items like clothing betas or den betas. Once you've created enough masterpieces to show others your style of art and allow them to decide whether they like it or not, you can begin trading your art for rares. Try making many different masterpieces rather than several of the same kind. This will help you later on decide which of your masterpieces are viewed as the rarest so you can trade those ones for better rares. However, keep and make a variety of masterpieces as well. Over time, when many of the same masterpiece is created and passed around, like most famous Animal Jam artists' pieces, they lose value. Assess how rare your masterpiece may be. Get a good and general idea of what your masterpiece is worth. Blended and detailed art, like spray paint art, is usually considered to be more valuable than line art. Keep in mind that just because a masterpiece is very important to you doesn't mean it's the same for others. A masterpiece given to you by a friend wishing you good luck will mean more to you than it will to a stranger, so don't make it worth a blue long because you really like it. Avoid placing prices on your masterpieces immediately. First, place them on trade and go to a server such as Aldan. Say, \"Offer for my art or jag me offers for multiple pieces.\" Depending on what people offer you, you'll have a good chance at getting those items. Just because you get offered den betas or clothing betas doesn't mean your art is bad. Some people don't view art to be valuable in general. Some people think art shouldn't be worth anything no matter what in this game. Look for the offers of people who enjoy art. If you'd like, ask obvious unbiased (preferably no famous Animal Jam artists, as they can be biased) collectors and traders or buddies who like art to offer for your masterpieces. Or you can ask them what they think the worth would be. Currently, art blended using the spray paint tool can get extremely valuable. Hyenine1 is an example of a popular artist in Animal Jam. He uses the spray paint method combined with other details to make his realistic masterpieces, and they are viewed as decently valued. However, value also depends on the Jammer. Some Jammers may prefer simple characters drawn and shaded with pen, and may offer you more. It also depends on what's in your masterpiece. Anime is popular - someone might prefer a simple line drawn anime masterpiece to an extremely realistic dog. There isn't really a set value on art - it depends on a number of factors which are all different for each person, which is why the value of art is always ambiguous. Place your masterpieces on trade. As explained above, art value is very ambiguous. The majority of people view spray paint art as more valuable because it's more realistic, but then again not everyone loves realistic art and might prefer something more simple and less messy, like line art. This is why it's best to avoid placing a set price on your masterpieces, unless it's small. Place many different art pieces on trade - not just the same one. This will allow you to see what type of art you've created people mostly want so that you can keep creating it. Create other masterpieces too of course - many of the same masterpiece can get boring, even on your trade list. Open your jam a grams and receive offers. If you're looking for small rares, say, \"Trade me 1 clothing beta/1 den beta per masterpiece!' If you want larger rares, like long collars, this may prove to be difficult unless you can create extremely well-drawn and realistic art. Unfortunately, most famous artists in the game have 'reserved' this opportunity for themselves. Unless you can become a famous well-known artist within the game (which may be difficult considering there are very good artists who aren't famous), it will prove to be hard to get large rares for your art. However, it's not impossible, so if you want to give it a shot, feel free to. If you're looking for larger rares, you can attempt to get items such as short collars for your masterpieces. Or you can trade multiple masterpieces for items like this. If you'd like your art to be more noticed and increase in value, improve your art skills. View famous artists' art and examine it. Most famous artists do spray paint art, which can prove to be realistic and valuable. If you want to be more noticed, perform more art trades often in Aldan or host frequent free art giveaways if you want your art to be noticed more. When your art is shared around more, more people might recognize you and your masterpieces can go up in value. Do commissions. Doing commissions is a great way to get rares off your art. Place good examples of your art on trade and go to Aldan. Announce yourself by saying, \"Doing commissions for your [animal/pet/item/favorite character, etc]. Prince is a short collar!\" or \"Doing commissions for your main look, price ranges from short to a bad long collar.\" Keep in mind this is a little more advanced, so your art may need to stretch past just line art. Again, realistic spray paint art is very popular. Put examples on trade so people know what your art is like. This way, when people tell you they'll give you your price for an art piece you make for them, you know you'll get the item for sure because that person wants an art piece for you, even if you just make line art. When doing this, do not make your art ridiculously expensive. Animal Jam isn't centered around art, but a whole trading system of a variety of rares. People are looking to trade up in rarity, not trade a black long for an art piece they'll get bored of eventually. You can still do commissions with line art or designs, but you may want to make your prices lower, such as from a few den betas to a bad short collar. Or if you can make line art with shading and other details, you can raise your prices slightly. Raise your prices as you improve your art. Improve your art. Think positive about your art! If you want, ask for help or ask for criticism from an artist or friend. Don't always expect nice criticism from everyone. Take it as help and use it. Ask some good friends, multiple artists not just one. Improve your skills and you can get even rarer off your art as you continue to improve.",
  "tyn_model":[
    "animal jam",
    "spray paint",
    "spray tool",
    "diamonds",
    "pen",
    "spray art",
    "pen tool",
    "spray",
    "paint bucket",
    "animal jam art studio",
    "line art",
    "paint brush",
    "spray painter",
    "dog",
    "mouse",
    "blending tool",
    "checkers",
    "spray painting",
    "coins",
    "fur",
    "spikes",
    "animal jam artists",
    "jammer",
    "jammers",
    "anime",
    "aldan"
  ],
  "tyn_section":[

  ]
}