{
  "title":"How to Kill Prostrate Spurge",
  "url":"https://www.wikihow.com/Kill-Prostrate-Spurge",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Lawn Care",
    "Lawn Problems",
    "Lawn Weeds"
  ],
  "methods":[
    {
      "name":"Solarizing the Soil",
      "steps":[
        {
          "headline":"Solarize the soil during the summer months.",
          "description":"Solarization is most effective when the sun is at its brightest and the sky is cloudless. Spring is often rainy and the other months are too cool for solarization. Spurge will usually take root and set seed after 5 weeks of warm weather. If you live somewhere cool and foggy, like some coastal regions, solarization may not work for you."
        },
        {
          "headline":"Remove any plants and rocks using a garden hoe or spade.",
          "description":"Loosen up the dirt by pushing a shovel into the soil and spreading the loose dirt around the area. Make sure the dirt is level by smoothing the dirt with a shovel. A good rake can also be useful for leveling."
        },
        {
          "headline":"Water the soil to a depth of 12 in (30 cm).",
          "description":"Test the water depth by pushing a long screwdriver or spade into the dirt. If it does not sink easily down to 12 in (30 cm), keep watering and test again. The water allows the sun's rays to go deeper into the soil in order to kill and prevent the spurge seeds from growing."
        },
        {
          "headline":"Lay a clear tarp over the area before the grass starts to grow.",
          "description":"Lay the tarp as close to the soil as possible to get the most out of the sun’s heat. Anchor the corners with rocks or soil so the tarp does not come loose during wind or storms. Be sure you get a clear tarp so the sunlight can get through it. You can buy clear tarps at most home improvement stores and online. A black tarp will also work, since it will soak up the sun’s heat and warm the ground underneath it."
        },
        {
          "headline":"Leave the tarp on the ground for 4 to 6 weeks.",
          "description":"Avoid leaving it any longer than that, since the plastic will start to break into pieces and become ineffective. Once you remove the tarp, you can resume gardening as you usually would in that area. Use caution when using this method, since any other plants that are already growing in the covered area will die."
        }
      ]
    },
    {
      "name":"Applying Herbicides",
      "steps":[
        {
          "headline":"Use pre-emergent herbicides in late winter before weed growth.",
          "description":"Choose an herbicide with oryzalin, dithiopyr, pendimethalin, prodiamine, benfluralin, isoxaben or trifluralin. Apply the herbicide following the manufacturer’s instructions before the outdoor temperature reaches 60 °F (16 °C). Make sure to wear gloves and eye protection. If you're a home gardener, you will be able to buy pendimethalin, trifluralin, dithiopyr, and oryzalin. The other types are only available to landscape professionals. Do not use pre-emergent herbicides on a home vegetable garden, since the chemical residue lasts for months after application."
        },
        {
          "headline":"Use corn gluten as a non-toxic alternative.",
          "description":"Corn gluten also works as a pre-emergent herbicide, with the advantage of being safer for you and the environment than harsh chemical herbicides. Sprinkle the granules on any weed-infested areas before the weeds have a chance to sprout. Apply according to the directions on the package."
        },
        {
          "headline":"Use a post-emergent herbicide if the weeds are already growing.",
          "description":"Choose an herbicide with Glyphosate 2,4-D. Wear eye protection and gloves and follow the manufacturer’s instructions closely. Once the spurge dies, remove it from the area. Pick a non-selective herbicide with glyphosate to kill all the plants in the area where it is applied. Use a selective 2,4-D broadleaf herbicide if you want to protect grass and plants that may be underneath the spurge."
        },
        {
          "headline":"Spray vinegar-based or citric acid herbicides for a natural option.",
          "description":"Choose 20% acetic acid options, which you can buy at home improvement stores. Put the herbicide in a spray bottle or other applicator and spray the spurge thoroughly. Use these herbicides when the plants are young for best results. These herbicides are not selective and will kill or damage any plant they come into contact with, including grass. These herbicides are non-toxic when used appropriately."
        }
      ]
    },
    {
      "name":"Removing Small Patches",
      "steps":[
        {
          "headline":"Weed the spurge by hand when the soil is moist.",
          "description":"Grip the weed in the middle between the top and the ground and pull upward. This helps remove the taproot, which will prevent the same plant from regrowing. If the soil is not moist, water the area you want to weed for several minutes before starting to hand weed."
        },
        {
          "headline":"Weed spurge when the plants are beginning to grow.",
          "description":"It's best to pull weeds out when the plants are young. This usually occurs during spring months (April-May), depending on your region. Make sure to bag up and dispose of the weeds after you pull them out. Leaving them behind can allow their seeds to spread and grow."
        },
        {
          "headline":"Cover the weeds in mulch for a quick solution.",
          "description":"Put 3 in (7.6 cm) to 6 in (15 cm) of coarse mulch on top of the weeds you want to kill. The mulch will starve the plants of oxygen and sunlight. Keep in mind that mulch breaks down over time. Check it occasionally and replace it when it starts looking thin. Maintaining a thick and even layer of mulch on bare ground will also prevent weed seeds from growing."
        },
        {
          "headline":"Use newspaper to smother the weeds.",
          "description":"Cover the spurge with several layers of newspaper and stamp down on top of the newspaper to flatten it on top of the weeds. Dampen the newspapers with water and cover them with a thick layer of mulch."
        }
      ]
    },
    {
      "name":"Preventing Prostrate Spurge",
      "steps":[
        {
          "headline":"Mow the grass so it stays below 2 in (5.1 cm).",
          "description":"Use a reel mower to keep the grass short where the weeds tend to grow. The spurge will not be able to move in as easily if you keep your lawn dense, short, and healthy."
        },
        {
          "headline":"Fertilize your lawn during spring months (April-May).",
          "description":"Before the grass and weeds start to grow, fertilize your lawn and water for 30 minutes afterward. Fertilizing the lawn will help produce healthier grass, which is a way to prevent weeds from spreading. If you are trying to control spurge in an area outside of a lawn or turf area, do not fertilize. The grass will probably not be maintained and fertilizing the area will only help the weed grow faster."
        },
        {
          "headline":"Water your lawn to maintain healthy grass.",
          "description":"Maintaining a healthy lawn or mulched area is the first defense against controlling spurge. Water the lawn for 30 minutes. Test to make sure the grass has enough water by trying to push a screwdriver into the dirt. If it sinks easily to 6 in (15 cm), do not continue to water it. If not, water for another 10 minutes and retest. Depending on the type of grass you have, it may be more heat and drought-resistant than others. Also, if you live a dry climate, you will need to water your grass more often."
        }
      ]
    }
  ],
  "text":" Solarizing the Soil Solarize the soil during the summer months. Solarization is most effective when the sun is at its brightest and the sky is cloudless. Spring is often rainy and the other months are too cool for solarization. Spurge will usually take root and set seed after 5 weeks of warm weather. If you live somewhere cool and foggy, like some coastal regions, solarization may not work for you. Remove any plants and rocks using a garden hoe or spade. Loosen up the dirt by pushing a shovel into the soil and spreading the loose dirt around the area. Make sure the dirt is level by smoothing the dirt with a shovel. A good rake can also be useful for leveling. Water the soil to a depth of 12 in (30 cm). Test the water depth by pushing a long screwdriver or spade into the dirt. If it does not sink easily down to 12 in (30 cm), keep watering and test again. The water allows the sun's rays to go deeper into the soil in order to kill and prevent the spurge seeds from growing. Lay a clear tarp over the area before the grass starts to grow. Lay the tarp as close to the soil as possible to get the most out of the sun’s heat. Anchor the corners with rocks or soil so the tarp does not come loose during wind or storms. Be sure you get a clear tarp so the sunlight can get through it. You can buy clear tarps at most home improvement stores and online. A black tarp will also work, since it will soak up the sun’s heat and warm the ground underneath it. Leave the tarp on the ground for 4 to 6 weeks. Avoid leaving it any longer than that, since the plastic will start to break into pieces and become ineffective. Once you remove the tarp, you can resume gardening as you usually would in that area. Use caution when using this method, since any other plants that are already growing in the covered area will die. Applying Herbicides Use pre-emergent herbicides in late winter before weed growth. Choose an herbicide with oryzalin, dithiopyr, pendimethalin, prodiamine, benfluralin, isoxaben or trifluralin. Apply the herbicide following the manufacturer’s instructions before the outdoor temperature reaches 60 °F (16 °C). Make sure to wear gloves and eye protection. If you're a home gardener, you will be able to buy pendimethalin, trifluralin, dithiopyr, and oryzalin. The other types are only available to landscape professionals. Do not use pre-emergent herbicides on a home vegetable garden, since the chemical residue lasts for months after application. Use corn gluten as a non-toxic alternative. Corn gluten also works as a pre-emergent herbicide, with the advantage of being safer for you and the environment than harsh chemical herbicides. Sprinkle the granules on any weed-infested areas before the weeds have a chance to sprout. Apply according to the directions on the package. Use a post-emergent herbicide if the weeds are already growing. Choose an herbicide with Glyphosate 2,4-D. Wear eye protection and gloves and follow the manufacturer’s instructions closely. Once the spurge dies, remove it from the area. Pick a non-selective herbicide with glyphosate to kill all the plants in the area where it is applied. Use a selective 2,4-D broadleaf herbicide if you want to protect grass and plants that may be underneath the spurge. Spray vinegar-based or citric acid herbicides for a natural option. Choose 20% acetic acid options, which you can buy at home improvement stores. Put the herbicide in a spray bottle or other applicator and spray the spurge thoroughly. Use these herbicides when the plants are young for best results. These herbicides are not selective and will kill or damage any plant they come into contact with, including grass. These herbicides are non-toxic when used appropriately. Removing Small Patches Weed the spurge by hand when the soil is moist. Grip the weed in the middle between the top and the ground and pull upward. This helps remove the taproot, which will prevent the same plant from regrowing. If the soil is not moist, water the area you want to weed for several minutes before starting to hand weed. Weed spurge when the plants are beginning to grow. It's best to pull weeds out when the plants are young. This usually occurs during spring months (April-May), depending on your region. Make sure to bag up and dispose of the weeds after you pull them out. Leaving them behind can allow their seeds to spread and grow. Cover the weeds in mulch for a quick solution. Put 3 in (7.6 cm) to 6 in (15 cm) of coarse mulch on top of the weeds you want to kill. The mulch will starve the plants of oxygen and sunlight. Keep in mind that mulch breaks down over time. Check it occasionally and replace it when it starts looking thin. Maintaining a thick and even layer of mulch on bare ground will also prevent weed seeds from growing. Use newspaper to smother the weeds. Cover the spurge with several layers of newspaper and stamp down on top of the newspaper to flatten it on top of the weeds. Dampen the newspapers with water and cover them with a thick layer of mulch. Preventing Prostrate Spurge Mow the grass so it stays below 2 in (5.1 cm). Use a reel mower to keep the grass short where the weeds tend to grow. The spurge will not be able to move in as easily if you keep your lawn dense, short, and healthy. Fertilize your lawn during spring months (April-May). Before the grass and weeds start to grow, fertilize your lawn and water for 30 minutes afterward. Fertilizing the lawn will help produce healthier grass, which is a way to prevent weeds from spreading. If you are trying to control spurge in an area outside of a lawn or turf area, do not fertilize. The grass will probably not be maintained and fertilizing the area will only help the weed grow faster. Water your lawn to maintain healthy grass. Maintaining a healthy lawn or mulched area is the first defense against controlling spurge. Water the lawn for 30 minutes. Test to make sure the grass has enough water by trying to push a screwdriver into the dirt. If it sinks easily to 6 in (15 cm), do not continue to water it. If not, water for another 10 minutes and retest. Depending on the type of grass you have, it may be more heat and drought-resistant than others. Also, if you live a dry climate, you will need to water your grass more often.",
  "tyn_model":[
    "water",
    "herbicides",
    "tarp",
    "herbicide",
    "mulch",
    "newspaper",
    "shovel",
    "oryzalin",
    "corn gluten",
    "weeds",
    "garden hoe",
    "spade",
    "watering",
    "rocks",
    "tarps",
    "plastic",
    "glyphosate 2,4",
    "glyphosate",
    "vinegar",
    "citric acid",
    "acetic acid",
    "spray bottle",
    "newspapers",
    "fertilize",
    "screwdriver",
    "grass"
  ],
  "tyn_section":[

  ]
}