{
  "title":"How to Recycle Rubber",
  "url":"https://www.wikihow.com/Recycle-Rubber",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Connecting with Rubber Recyclers",
      "steps":[
        {
          "headline":"Research information regarding your local recycling facility.",
          "description":"Sometimes recycling facilities won’t take tires or other forms of rubber because the process to recycle them is so different from other materials. Call or visit your local recycling facility’s website to see if they address whether or not rubber can be recycled. If they do accept it, drop it off at the recycling facility during regular drop off hours, which can be found on the website as well. EXPERT TIP\t\"Research facilities near you that accept tires for recycling. They'll typically shred them for use in playgrounds and landscapes.\" Kathryn Kellogg\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn KelloggAuthor, 101 Ways to Go Zero Waste"
        },
        {
          "headline":"Locate a rubber recycling option near you.",
          "description":"Visit websites that direct you to a rubber recycling solution in your location, such as https://search.earth911.com/. Type in “rubber” as well as your zip code to find out the name and address of places that will accept the rubber. Earth911 tells you the specific type of rubbers that they allow, such as tires, carpet padding, inner tubes, etc. If this site isn’t providing any answers for you, do a general search online to look for rubber recycling options near you."
        },
        {
          "headline":"Contact a business that produces rubber mulch.",
          "description":"One of the main uses for recycled rubber is in the creation of rubber mulch, such as the kind used on children’s playgrounds. If there’s a business that produces rubber mulch near you, call or look on their website to find out how you can donate your old tires. To find businesses like this, go online and type in “rubber mulch company near me.”"
        },
        {
          "headline":"Take your tires to a local tire retailer.",
          "description":"Visit or call your local tire retailer to see if they take old tires. If they do, drop your old tires off with them during their open hours, or simply drop them off the next time you go in to have your car fixed. You may have to pay a small fee to have your tires taken at a tire retailer. Check with several other tire retailers if the first one you ask doesn’t take recycled tires. When your tire retailer does a routine tire switch on your car, ask them what they do with the old tires to see if they recycle them."
        },
        {
          "headline":"Donate rubber bands to local schools or mail services.",
          "description":"Schools are always in need of school supplies, and rubber bands are very useful. Post offices also often need rubber bands to hold mail or newspapers together. Reach out to local schools or post offices to ask if they’d like your extra rubber bands."
        }
      ]
    },
    {
      "name":"Reusing the Rubber",
      "steps":[
        {
          "headline":"Build pieces of furniture using old tires.",
          "description":"By painting an old tire with a colorful paint that’s suitable for rubber, you can create endless furniture possibilities. Put a piece of glass over the tire and you’ve got a coffee table, or fill the tire with soft bedding or pillows and you’ve created a dog bed. Priming the tire before painting will help the paint stick and stay on the surface. You can also create a stool or an ottoman with an old tire by covering them in twine or strong fabrics."
        },
        {
          "headline":"Make planters out of tires if you need a spot for your plants.",
          "description":"Set a tire out in the yard and fill it with soil. You can place your plants in the soil and the tire will contain everything while also providing a cool aesthetic. Paint the tire before turning it into a planter, if desired. You can also create hanging planters by securing a bottom to the tire and attaching hooks and wire or string to the sides."
        },
        {
          "headline":"Turn your old tire into a tire swing for a fun solution.",
          "description":"This is a fun outdoor fix and will entertain kids. Tie a strong rope to the tire securely and attach the other end of the rope to a strong tree limb. Make sure you position the tire swing high enough that legs won’t be jammed into the ground, but low enough for kids to easily reach. It's best to supervise young children if they're playing on the tire swing to make sure no one gets injured. Drill small holes in the tire to allow water to drain out if it rains."
        },
        {
          "headline":"Fill an old tire with sand to create an outdoor sandbox.",
          "description":"Lay a tarp or a piece of wood on the ground as a base for the sandbox. Once you’ve placed the tire on the ground, fill it with sand. You can cut out a top to cover the sandbox using wood or plastic. Wash the tire with clean water (and a little soap, if necessary) to get all of the dirt off, and paint it if desired. Stick a small outdoor umbrella into the sand to provide a bit of shade. Drill small holes in the tire to let water pass through instead of collecting in the tire."
        },
        {
          "headline":"Use rubber bands to re-seal open bags of food.",
          "description":"This is a good way to keep foods fresh while also taking advantage of all those rubber bands you have. Scrunch together the top of the opened bag and wrap the rubber band around it tightly. This works great on bags of chips, pretzels, or other snack foods."
        },
        {
          "headline":"Slide rubber bands onto hangers to keep clothing in place.",
          "description":"This is an easy fix for keeping your shirts, dresses, and other clothing items from ending up on the floor of your closet. Simply slide the rubber bands onto the hangers vertically, or tie them around the rod of the hanger to create a thicker rubber band layer."
        },
        {
          "headline":"Place silicone wristbands on the lids of jars to make opening them easier.",
          "description":"If you have a collection of silicone wristbands, or the type of wristbands that are often given for concerts or to raise money for charity, place these around jar lids. When you go to open the jar, the rubber will provide a non-slip surface for you to grip easily. You can also use a regular rubber glove as a jar opener."
        },
        {
          "headline":"Create puppets out of old rubber gloves.",
          "description":"This is a great activity to do with kids—all you need are 1 or 2 rubber gloves and some craft supplies. Glue eyes or hair onto the puppet, or use markers to design a face. Make sure you clean the gloves thoroughly before turning them into a craft project. You can also make individual finger puppets by cutting off each of the fingers of the glove."
        }
      ]
    }
  ],
  "text":" Connecting with Rubber Recyclers Research information regarding your local recycling facility. Sometimes recycling facilities won’t take tires or other forms of rubber because the process to recycle them is so different from other materials. Call or visit your local recycling facility’s website to see if they address whether or not rubber can be recycled. If they do accept it, drop it off at the recycling facility during regular drop off hours, which can be found on the website as well. EXPERT TIP\t\"Research facilities near you that accept tires for recycling. They'll typically shred them for use in playgrounds and landscapes.\" Kathryn Kellogg\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn KelloggAuthor, 101 Ways to Go Zero Waste Locate a rubber recycling option near you. Visit websites that direct you to a rubber recycling solution in your location, such as https://search.earth911.com/. Type in “rubber” as well as your zip code to find out the name and address of places that will accept the rubber. Earth911 tells you the specific type of rubbers that they allow, such as tires, carpet padding, inner tubes, etc. If this site isn’t providing any answers for you, do a general search online to look for rubber recycling options near you. Contact a business that produces rubber mulch. One of the main uses for recycled rubber is in the creation of rubber mulch, such as the kind used on children’s playgrounds. If there’s a business that produces rubber mulch near you, call or look on their website to find out how you can donate your old tires. To find businesses like this, go online and type in “rubber mulch company near me.” Take your tires to a local tire retailer. Visit or call your local tire retailer to see if they take old tires. If they do, drop your old tires off with them during their open hours, or simply drop them off the next time you go in to have your car fixed. You may have to pay a small fee to have your tires taken at a tire retailer. Check with several other tire retailers if the first one you ask doesn’t take recycled tires. When your tire retailer does a routine tire switch on your car, ask them what they do with the old tires to see if they recycle them. Donate rubber bands to local schools or mail services. Schools are always in need of school supplies, and rubber bands are very useful. Post offices also often need rubber bands to hold mail or newspapers together. Reach out to local schools or post offices to ask if they’d like your extra rubber bands. Reusing the Rubber Build pieces of furniture using old tires. By painting an old tire with a colorful paint that’s suitable for rubber, you can create endless furniture possibilities. Put a piece of glass over the tire and you’ve got a coffee table, or fill the tire with soft bedding or pillows and you’ve created a dog bed. Priming the tire before painting will help the paint stick and stay on the surface. You can also create a stool or an ottoman with an old tire by covering them in twine or strong fabrics. Make planters out of tires if you need a spot for your plants. Set a tire out in the yard and fill it with soil. You can place your plants in the soil and the tire will contain everything while also providing a cool aesthetic. Paint the tire before turning it into a planter, if desired. You can also create hanging planters by securing a bottom to the tire and attaching hooks and wire or string to the sides. Turn your old tire into a tire swing for a fun solution. This is a fun outdoor fix and will entertain kids. Tie a strong rope to the tire securely and attach the other end of the rope to a strong tree limb. Make sure you position the tire swing high enough that legs won’t be jammed into the ground, but low enough for kids to easily reach. It's best to supervise young children if they're playing on the tire swing to make sure no one gets injured. Drill small holes in the tire to allow water to drain out if it rains. Fill an old tire with sand to create an outdoor sandbox. Lay a tarp or a piece of wood on the ground as a base for the sandbox. Once you’ve placed the tire on the ground, fill it with sand. You can cut out a top to cover the sandbox using wood or plastic. Wash the tire with clean water (and a little soap, if necessary) to get all of the dirt off, and paint it if desired. Stick a small outdoor umbrella into the sand to provide a bit of shade. Drill small holes in the tire to let water pass through instead of collecting in the tire. Use rubber bands to re-seal open bags of food. This is a good way to keep foods fresh while also taking advantage of all those rubber bands you have. Scrunch together the top of the opened bag and wrap the rubber band around it tightly. This works great on bags of chips, pretzels, or other snack foods. Slide rubber bands onto hangers to keep clothing in place. This is an easy fix for keeping your shirts, dresses, and other clothing items from ending up on the floor of your closet. Simply slide the rubber bands onto the hangers vertically, or tie them around the rod of the hanger to create a thicker rubber band layer. Place silicone wristbands on the lids of jars to make opening them easier. If you have a collection of silicone wristbands, or the type of wristbands that are often given for concerts or to raise money for charity, place these around jar lids. When you go to open the jar, the rubber will provide a non-slip surface for you to grip easily. You can also use a regular rubber glove as a jar opener. Create puppets out of old rubber gloves. This is a great activity to do with kids—all you need are 1 or 2 rubber gloves and some craft supplies. Glue eyes or hair onto the puppet, or use markers to design a face. Make sure you clean the gloves thoroughly before turning them into a craft project. You can also make individual finger puppets by cutting off each of the fingers of the glove.",
  "tyn_model":[
    "rubber bands",
    "rubber recycling",
    "rubber mulch",
    "water",
    "sand",
    "rubber",
    "“rubber",
    "tire retailer",
    "paint",
    "rope",
    "rubber band",
    "rubber gloves",
    "tires",
    "eco-friendly living down into a simple step-by-step process",
    "” as",
    "” take",
    "tire retailers",
    "glass",
    "twine",
    "soil",
    "planter",
    "hooks",
    "tire swing",
    "tarp",
    "outdoor umbrella",
    "jars",
    "jar",
    "jar opener",
    "—all",
    "markers"
  ],
  "tyn_section":[

  ]
}