{
  "title":"How to Grow Oca",
  "url":"https://www.wikihow.com/Grow-Oca",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables"
  ],
  "parts":[
    {
      "name":"Starting Oca Indoors",
      "steps":[
        {
          "headline":"Sprout your oca tubers before planting them.",
          "description":"Like potatoes, oca is most often grown from last season’s tubers. These seed tubers can be held back from your own crop or purchased at a garden store. Place the tubers on a tray where they will receive direct sunlight and the temperature is somewhere between 60 and 70 °F (16 and 21 °C). Leave tubers on the sprouting tray 1 to 2 weeks. Sprouts should be 1 inch (2.5 cm) or longer after 2 weeks on the tray. Choose tubers that have at least 2 eyes and are no larger than a chicken egg."
        },
        {
          "headline":"Plant the sprouted seed tubers in a potting soil made for vegetables.",
          "description":"Put them just under the surface of the soil in 3.5 in (8.9 cm) pots. Place the starts in a sunny windowsill or greenhouse.Keep them inside until after the last frost of the season. Oca is a frost sensitive plant. If you live in a temperate climate, starting oca inside will give them a head start and will increase the chances of large, healthy tubers. You will want to start oca at least 10 weeks before the last frost of the season. Oca can also be started from seed but the germination rate is lower. The seeds can also result in less uniform growth and can be hard to find."
        },
        {
          "headline":"Plant oca directly into the ground if you live in a damp, cool climate.",
          "description":"You can skip starting oca inside if you live in the Pacific Northwest, coastal California, upland Hawaii, or lowland Appalachia. After your tubers have sprouted in the sun, follow the instructions for transferring oca to the ground. Make sure to wait until after the last frost of the season to plant your oca outside."
        }
      ]
    },
    {
      "name":"Transferring Oca to the Ground",
      "steps":[
        {
          "headline":"Plant oca in full sun if you are in a cool, damp climate.",
          "description":"If you are somewhere that does not often experience temperatures over 85 °F (29 °C) during the daytime, your oca crop will thrive in the sun. Examples of this climate in the United States include coastal California, the Pacific Northwest, and upland Hawaii."
        },
        {
          "headline":"Choose a location with partial shade in warmer climates.",
          "description":"If you regularly experience daytime temperatures over 85 °F (29 °C) during the growing season, your oca crop will do better with partial sun. Texas, Florida, and the Great Lakes areas are examples of this type of climate."
        },
        {
          "headline":"Make sure the area drains well.",
          "description":"To find out if the area drains well, observe the ground after it rains. If you see pooling water, then the area likely doesn't have good drainage. If there are no puddles, then the area probably has good drainage and will make a good oca plot. If you're planting oca in a pot or container, choose a well-draining, sandy soil."
        },
        {
          "headline":"Amend the soil with compost or a complete organic fertilizer.",
          "description":"Avoid high-nitrogen fertilizers. Soil condition is less important when growing oca than sun exposure and average daytime temperatures. Oca tolerates poor soil condition well. It prefers moderately acidic soil, and will do well in soils as acidic as pH 7.5."
        },
        {
          "headline":"Plant oca outside once the danger of frost has passed.",
          "description":"Dig holes or trenches 2 to 3 inches (5.1 to 7.6 cm) deep, just large enough for the tuber seeds. Place the tuber in the hole with the sprout facing up. Pat the soil around the base of the sprout. Space plants 18 inches (46 cm) apart to accommodate for the foliage canopy. To maximize your garden space, consider companion planting. Since oca grows very slowly during the spring and summer months, there is room for a faster growing plant to occupy the space between the oca plants. Choose a crop that will be harvested before the oca begins its fall growth spurt. Onions are an excellent choice for a companion to oca."
        },
        {
          "headline":"Water oca in times of high heat or drought.",
          "description":"If you are in a humid climate that experiences regular rain, your oca crop will not need much additional watering. In warmer, more arid climates watering is necessary. Water often with less as oca does not tolerate standing water well. It becomes more important to water in September because this is the most active time of oca development and when the tubers begin to sprout underground. If you live in a warmer climate, consider mulching around your oca to keep it cool and help it retain moisture. This will cut down on how much you will have to water."
        },
        {
          "headline":"Cover the plants with garden fleece as the temperatures drop.",
          "description":"Oca tubers start growing sometime in September as the days shorten and the temperature drops. It is a crucial time to protect the plants if you want a healthy yield. If you live in a temperate climate that experiences early autumn frosts, place garden fleece over the rows to protect the plants as the tubers grow. Garden fleece is lightweight and needs to be anchored. You can use rocks or stakes to hold it down."
        }
      ]
    },
    {
      "name":"Harvesting Oca",
      "steps":[
        {
          "headline":"Harvest your tubers 1 to 2 weeks after the first hard frost.",
          "description":"The longer you can wait to harvest, the higher your yield will be. In North America, the end of November is ideal. If there has been no hard frost by the beginning of December, go ahead with your harvest. Use a table fork or small spade to gently lift the foliage from underneath. Oca tubers grow close to the surface so you will not need to dig. Wait until the foliage has died down after the first hard frost, then harvest your oca. However, if you wait too long, slugs and rodents may eat your buried tubers. Expect to harvest 30 to 50 tubers per plant if you are harvesting in late November. The size of the tubers range from 2 to 5 inches (5.1 to 12.7 cm) long. After harvesting, consider composting the foliage."
        },
        {
          "headline":"Wash the tubers and put them in the sun to dry.",
          "description":"Do not scrub your oca tubers with a brush. Run them under cool water, removing dirt by gently rubbing with your fingers. Place them on a tray in the sun for 1 week. Like spinach and rhubarb, oca tubers are high in oxalic acid, which can make them bitter. Sunning them before storage helps to sweeten the oca. Keep your sunning tubers inside, where the temperature does not fall below 50 °F (10 °C)."
        },
        {
          "headline":"Store your oca tubers in a cool, dark place.",
          "description":"The ideal temperature for storage is 40 °F (4 °C) with high humidity. They will tolerate storage temperatures up to 70 °F (21 °C). Place tubers in a burlap or brown paper bag to protect them from light exposure. Avoid any direct sunlight, even if they are in a bag. Select some of your crop to set aside for next year’s seed tubers. Store these tubers separately in a bag that is labeled “seed.”  Next year, start over and pull these tubers out to sprout 2 weeks before planting! Save the smallest oca from your harvest to serve as the \"seed\" for your next year's crop. Be sure to store it in a cool, dark place."
        }
      ]
    }
  ],
  "text":" Starting Oca Indoors Sprout your oca tubers before planting them. Like potatoes, oca is most often grown from last season’s tubers. These seed tubers can be held back from your own crop or purchased at a garden store. Place the tubers on a tray where they will receive direct sunlight and the temperature is somewhere between 60 and 70 °F (16 and 21 °C). Leave tubers on the sprouting tray 1 to 2 weeks. Sprouts should be 1 inch (2.5 cm) or longer after 2 weeks on the tray. Choose tubers that have at least 2 eyes and are no larger than a chicken egg. Plant the sprouted seed tubers in a potting soil made for vegetables. Put them just under the surface of the soil in 3.5 in (8.9 cm) pots. Place the starts in a sunny windowsill or greenhouse.Keep them inside until after the last frost of the season. Oca is a frost sensitive plant. If you live in a temperate climate, starting oca inside will give them a head start and will increase the chances of large, healthy tubers. You will want to start oca at least 10 weeks before the last frost of the season. Oca can also be started from seed but the germination rate is lower. The seeds can also result in less uniform growth and can be hard to find. Plant oca directly into the ground if you live in a damp, cool climate. You can skip starting oca inside if you live in the Pacific Northwest, coastal California, upland Hawaii, or lowland Appalachia. After your tubers have sprouted in the sun, follow the instructions for transferring oca to the ground. Make sure to wait until after the last frost of the season to plant your oca outside. Transferring Oca to the Ground Plant oca in full sun if you are in a cool, damp climate. If you are somewhere that does not often experience temperatures over 85 °F (29 °C) during the daytime, your oca crop will thrive in the sun. Examples of this climate in the United States include coastal California, the Pacific Northwest, and upland Hawaii. Choose a location with partial shade in warmer climates. If you regularly experience daytime temperatures over 85 °F (29 °C) during the growing season, your oca crop will do better with partial sun. Texas, Florida, and the Great Lakes areas are examples of this type of climate. Make sure the area drains well. To find out if the area drains well, observe the ground after it rains. If you see pooling water, then the area likely doesn't have good drainage. If there are no puddles, then the area probably has good drainage and will make a good oca plot. If you're planting oca in a pot or container, choose a well-draining, sandy soil. Amend the soil with compost or a complete organic fertilizer. Avoid high-nitrogen fertilizers. Soil condition is less important when growing oca than sun exposure and average daytime temperatures. Oca tolerates poor soil condition well. It prefers moderately acidic soil, and will do well in soils as acidic as pH 7.5. Plant oca outside once the danger of frost has passed. Dig holes or trenches 2 to 3 inches (5.1 to 7.6 cm) deep, just large enough for the tuber seeds. Place the tuber in the hole with the sprout facing up. Pat the soil around the base of the sprout. Space plants 18 inches (46 cm) apart to accommodate for the foliage canopy. To maximize your garden space, consider companion planting. Since oca grows very slowly during the spring and summer months, there is room for a faster growing plant to occupy the space between the oca plants. Choose a crop that will be harvested before the oca begins its fall growth spurt. Onions are an excellent choice for a companion to oca. Water oca in times of high heat or drought. If you are in a humid climate that experiences regular rain, your oca crop will not need much additional watering. In warmer, more arid climates watering is necessary. Water often with less as oca does not tolerate standing water well. It becomes more important to water in September because this is the most active time of oca development and when the tubers begin to sprout underground. If you live in a warmer climate, consider mulching around your oca to keep it cool and help it retain moisture. This will cut down on how much you will have to water. Cover the plants with garden fleece as the temperatures drop. Oca tubers start growing sometime in September as the days shorten and the temperature drops. It is a crucial time to protect the plants if you want a healthy yield. If you live in a temperate climate that experiences early autumn frosts, place garden fleece over the rows to protect the plants as the tubers grow. Garden fleece is lightweight and needs to be anchored. You can use rocks or stakes to hold it down. Harvesting Oca Harvest your tubers 1 to 2 weeks after the first hard frost. The longer you can wait to harvest, the higher your yield will be. In North America, the end of November is ideal. If there has been no hard frost by the beginning of December, go ahead with your harvest. Use a table fork or small spade to gently lift the foliage from underneath. Oca tubers grow close to the surface so you will not need to dig. Wait until the foliage has died down after the first hard frost, then harvest your oca. However, if you wait too long, slugs and rodents may eat your buried tubers. Expect to harvest 30 to 50 tubers per plant if you are harvesting in late November. The size of the tubers range from 2 to 5 inches (5.1 to 12.7 cm) long. After harvesting, consider composting the foliage. Wash the tubers and put them in the sun to dry. Do not scrub your oca tubers with a brush. Run them under cool water, removing dirt by gently rubbing with your fingers. Place them on a tray in the sun for 1 week. Like spinach and rhubarb, oca tubers are high in oxalic acid, which can make them bitter. Sunning them before storage helps to sweeten the oca. Keep your sunning tubers inside, where the temperature does not fall below 50 °F (10 °C). Store your oca tubers in a cool, dark place. The ideal temperature for storage is 40 °F (4 °C) with high humidity. They will tolerate storage temperatures up to 70 °F (21 °C). Place tubers in a burlap or brown paper bag to protect them from light exposure. Avoid any direct sunlight, even if they are in a bag. Select some of your crop to set aside for next year’s seed tubers. Store these tubers separately in a bag that is labeled “seed.”  Next year, start over and pull these tubers out to sprout 2 weeks before planting! Save the smallest oca from your harvest to serve as the \"seed\" for your next year's crop. Be sure to store it in a cool, dark place.",
  "tyn_model":[
    "oca",
    "water",
    "oca tubers",
    "garden fleece",
    "tray",
    "potatoes",
    "garden store",
    "sprouting tray",
    "tubers",
    "potting soil",
    "compost",
    "complete organic fertilizer",
    "fertilizers",
    "soil",
    "onions",
    "rocks",
    "stakes",
    "table fork",
    "spade",
    "spinach",
    "oxalic acid",
    "sunning tubers",
    "brown paper",
    "seed tubers",
    "“seed",
    "”  ",
    "seed"
  ],
  "tyn_section":[

  ]
}