{
  "title":"How to Get Screentones on MediBang Paint Pro",
  "url":"https://www.wikihow.com/Get-Screentones-on-MediBang-Paint-Pro",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Digital Technology Art and Craft Projects"
  ],
  "steps":[
    {
      "headline":"Open MediBang Paint Pro, and either open or create your image.",
      "description":""
    },
    {
      "headline":"Create a new layer.",
      "description":"On the bottom right, under the rectangle with layers but above the word reference, there are a series of buttons you can click. Press the one that looks like a numberless piece of paper with the corner folded over. This should be the first button."
    },
    {
      "headline":"Use the fill tool (the paint bucket) and color in the area that you want to have screentones with black, white, or another neutral color.",
      "description":"Make sure that you do this in the new layer you have just created. For this tutorial, the background is white, so we went ahead and filled in the image white as well. If you do something similar, know that even though the background and the fill are the same color and you won't be able to see them, you must not skip this step. Otherwise, you won't be able to control where your screentones go."
    },
    {
      "headline":"Click Protect Alpha.",
      "description":"It is the first of three checkboxes above the rectangle showing your layers. When you've done this, a little x will appear in the box. If this x is there, Protect Alpha is on. Protect Alpha is a neat little tool that will only let you draw on areas that you have previously drawn on. Because you filled the place you want the tones in the last step, this option will make it so that the tones will only go there."
    },
    {
      "headline":"Click the material button.",
      "description":"It will open the menu shown here. Look on your top left. Above the color square, you will find a series of buttons. Click the one that has a speech box with tones on it. It's third, next to the upload button, and the button with a cloud in it before that."
    },
    {
      "headline":"Choose a tone or material you like, and then click, drag, and drop it onto your canvas.",
      "description":"The canvas is the area you're working on, namely where the image is. You'll find that the tone replaces the fill you had before. Experiment, and find a tone or material you like best."
    },
    {
      "headline":"Work with your tone.",
      "description":"Using the menu at the bottom, you can rotate it, zoom in or out, and move it around by clicking and dragging with your mouse. If you don't like something you did, you can use the reset buttons next to the particular option you've been using."
    },
    {
      "headline":"Click OK at the bottom left of the tone settings and exit out of the tone menu.",
      "description":""
    },
    {
      "headline":"Uncheck Protect Alpha, and admire your handiwork!",
      "description":""
    }
  ],
  "text":" Open MediBang Paint Pro, and either open or create your image.  Create a new layer. On the bottom right, under the rectangle with layers but above the word reference, there are a series of buttons you can click. Press the one that looks like a numberless piece of paper with the corner folded over. This should be the first button. Use the fill tool (the paint bucket) and color in the area that you want to have screentones with black, white, or another neutral color. Make sure that you do this in the new layer you have just created. For this tutorial, the background is white, so we went ahead and filled in the image white as well. If you do something similar, know that even though the background and the fill are the same color and you won't be able to see them, you must not skip this step. Otherwise, you won't be able to control where your screentones go. Click Protect Alpha. It is the first of three checkboxes above the rectangle showing your layers. When you've done this, a little x will appear in the box. If this x is there, Protect Alpha is on. Protect Alpha is a neat little tool that will only let you draw on areas that you have previously drawn on. Because you filled the place you want the tones in the last step, this option will make it so that the tones will only go there. Click the material button. It will open the menu shown here. Look on your top left. Above the color square, you will find a series of buttons. Click the one that has a speech box with tones on it. It's third, next to the upload button, and the button with a cloud in it before that. Choose a tone or material you like, and then click, drag, and drop it onto your canvas. The canvas is the area you're working on, namely where the image is. You'll find that the tone replaces the fill you had before. Experiment, and find a tone or material you like best. Work with your tone. Using the menu at the bottom, you can rotate it, zoom in or out, and move it around by clicking and dragging with your mouse. If you don't like something you did, you can use the reset buttons next to the particular option you've been using. Click OK at the bottom left of the tone settings and exit out of the tone menu.  Uncheck Protect Alpha, and admire your handiwork! ",
  "tyn_model":[
    "canvas",
    "medibang paint",
    "paint bucket",
    "protect alpha",
    "mouse"
  ],
  "tyn_section":[

  ]
}