{
  "title":"How to Play Dance Dance Revolution",
  "url":"https://www.wikihow.com/Play-Dance-Dance-Revolution",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Dance Dance Revolution"
  ],
  "steps":[
    {
      "headline":"Be bold.",
      "description":"Everyone was a beginner once. You're doing this to have fun and to improve."
    },
    {
      "headline":"Insert your money or tokens into the arcade machine.",
      "description":""
    },
    {
      "headline":"In the newer versions, choose a song that is rated as Level 3 or lower.",
      "description":"(The scale is from Level 1 to 20, though no Level 20 step-charts exist yet). In the older versions, choose a song with only 1 or 2 feet. (The scale is from 1 foot to 10 feet.) It should also be for a fairly slow song, and on the \"Light\" or \"Basic\" difficulty."
    },
    {
      "headline":"As the arrows that scroll up from the bottom of the screen reach the top with the static gray arrows (\"receptors\"), step on the corresponding arrow on the pad with your foot.",
      "description":""
    },
    {
      "headline":"Try to keep your Dance Gauge up by performing well, but don't worry if it empties out.",
      "description":"Just keep going. Play the song lots of times until you get a B or above on it, then move on to another song."
    },
    {
      "headline":"After mastering a few songs, revisit songs you've played, but on a higher difficulty.",
      "description":""
    },
    {
      "headline":"Keep the arrow colors in mind.",
      "description":"With the \"Note\" color option, Red ones are on the beat (quarter notes), blue ones are half a beat away (8th notes), yellow ones are a quarter beat away (16th notes), and green notes are everything else. In the lower difficulties, the vast majority of the arrows will be red, with some blue ones appearing occasionally."
    },
    {
      "headline":"Practise, practise, practise.",
      "description":"Learn to time the steps, so that you receive a Marvelous for each arrow. In the order of best to worst timing, the judgments are Marvelous, Perfect, Great, Good, and Miss (or Boo) (though it varies by version: older versions don't have Marvelous)."
    },
    {
      "headline":"Gradually increase in difficulty as you increase in ability.",
      "description":""
    }
  ],
  "text":" Be bold. Everyone was a beginner once. You're doing this to have fun and to improve. Insert your money or tokens into the arcade machine.  In the newer versions, choose a song that is rated as Level 3 or lower. (The scale is from Level 1 to 20, though no Level 20 step-charts exist yet). In the older versions, choose a song with only 1 or 2 feet. (The scale is from 1 foot to 10 feet.) It should also be for a fairly slow song, and on the \"Light\" or \"Basic\" difficulty. As the arrows that scroll up from the bottom of the screen reach the top with the static gray arrows (\"receptors\"), step on the corresponding arrow on the pad with your foot.  Try to keep your Dance Gauge up by performing well, but don't worry if it empties out. Just keep going. Play the song lots of times until you get a B or above on it, then move on to another song. After mastering a few songs, revisit songs you've played, but on a higher difficulty.  Keep the arrow colors in mind. With the \"Note\" color option, Red ones are on the beat (quarter notes), blue ones are half a beat away (8th notes), yellow ones are a quarter beat away (16th notes), and green notes are everything else. In the lower difficulties, the vast majority of the arrows will be red, with some blue ones appearing occasionally. Practise, practise, practise. Learn to time the steps, so that you receive a Marvelous for each arrow. In the order of best to worst timing, the judgments are Marvelous, Perfect, Great, Good, and Miss (or Boo) (though it varies by version: older versions don't have Marvelous). Gradually increase in difficulty as you increase in ability. ",
  "tyn_model":[
    "arcade machine",
    "arrows"
  ],
  "tyn_section":[

  ]
}