{
  "title":"How to Grow Dwarf Pineapples",
  "url":"https://www.wikihow.com/Grow-Dwarf-Pineapples",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Fruit"
  ],
  "steps":[
    {
      "headline":"Compose a loose, well-drained growing medium.",
      "description":"Try large bark chips, osmunda fiber, large-size calcine clay, or tree fern fiber. Add small amounts of peat moss or vermiculite to hold water."
    },
    {
      "headline":"Plant the dwarf pineapple in a pot with the growing medium.",
      "description":"There are various ways to obtain a young plant. Cut or break off young side shoots or \"pups\" from an existing plant when they're half the size of the adult. Cut a dwarf pineapple fruit, leaving a little bit of the fruit attached to the topknot. Divide the \"ratoons\" (root parts) of mature plants."
    },
    {
      "headline":"Put the plant in an indoor area where it will receive partial to full sunlight.",
      "description":"Bromeliads in general prosper in the east, south, or west window where they can get 3 to 4 hours of full sun every day. Overall, dwarf pineapples require bright, warm conditions."
    },
    {
      "headline":"Water the plant once a week  by filling the cup or basin formed by the base of the leaves.",
      "description":"There's no need to water the growing medium because overflow from the cup is enough to do the trick."
    },
    {
      "headline":"Fertilize every 6-8 weeks with half-strength organic fertilizer during watering.",
      "description":""
    },
    {
      "headline":"Harvest the dwarf pineapples and then replant the top.",
      "description":"If you don't harvest the pineapple, it will likely bloom into a flower."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Compose a loose, well-drained growing medium. Try large bark chips, osmunda fiber, large-size calcine clay, or tree fern fiber. Add small amounts of peat moss or vermiculite to hold water. Plant the dwarf pineapple in a pot with the growing medium. There are various ways to obtain a young plant. Cut or break off young side shoots or \"pups\" from an existing plant when they're half the size of the adult. Cut a dwarf pineapple fruit, leaving a little bit of the fruit attached to the topknot. Divide the \"ratoons\" (root parts) of mature plants. Put the plant in an indoor area where it will receive partial to full sunlight. Bromeliads in general prosper in the east, south, or west window where they can get 3 to 4 hours of full sun every day. Overall, dwarf pineapples require bright, warm conditions. Water the plant once a week  by filling the cup or basin formed by the base of the leaves. There's no need to water the growing medium because overflow from the cup is enough to do the trick. Fertilize every 6-8 weeks with half-strength organic fertilizer during watering.  Harvest the dwarf pineapples and then replant the top. If you don't harvest the pineapple, it will likely bloom into a flower. Finished. ",
  "tyn_model":[
    "water",
    "pineapple",
    "pineapples",
    "osmunda fiber",
    "calcine clay",
    "tree fern fiber",
    "peat moss",
    "pot",
    "growing medium",
    "organic fertilizer"
  ],
  "tyn_section":[

  ]
}