{
  "title":"How to Make a Planet Model",
  "url":"https://www.wikihow.com/Make-a-Planet-Model",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "methods":[
    {
      "name":"Making a Papier Mache Planet Model",
      "steps":[
        {
          "headline":"Decide which planet to make.",
          "description":"This will help you determine how large to make your planet. While this isn't too important if you're only making one, if you decide to make a whole solar system of planets, you may want to make them somewhat to scale. For example, you'd want to make Mars or Mercury much smaller than Saturn or Jupiter."
        },
        {
          "headline":"Blow up a balloon.",
          "description":"Don't blow the balloon up too much, or it will become oval in shape. Try to add just enough air to make it circular, while making it as large or small as you'd like. Place the balloon tied-end down in a bowl. This will hold it still and make it easier to apply the papier mache."
        },
        {
          "headline":"Make your adhesive.",
          "description":"You can use either glue and water, raw flour and water, or flour and water that's been cooked. There are different advantages to each: the glue and water is easy to mix up, the raw flour and water paste is stronger, and the boiled flour and water paste dries clear. For glue and water paste, use about 1/4 cup of white school glue and add water just till it becomes slightly runny. For raw flour and water, mix enough water into flour until you get the consistency you'd like. Remember that thicker paste will take longer to dry and that you'll need to let your paper mache balloon dry overnight. For boiled flour and water, whisk together 1/2 cup flour of flour and 2 1/2 cups of water over medium heat until the mixture boils. It will thicken into a gel as it cools."
        },
        {
          "headline":"Shred your papers.",
          "description":"You can use newspapers, brown craft paper, or construction paper. Use whatever you have easy access to and be sure to rip your paper into pieces or strips. Avoid cutting the papers. The straight lines will be visible once the paper mache dries. The torn edges of your ripped papers will blend in better."
        },
        {
          "headline":"Apply your paper to the balloon.",
          "description":"Dip the strips or pieces of paper into your paste. Be sure to completely coat the paper with the glue, but slide your fingers over the paper to remove excess paste. Lay the strips or pieces over your entire balloon. Add another layer of strips over your entire balloon. Use your hands to smooth out any bubbles or bumps on the surface of your balloon, unless you want to give your planet a bumpy texture."
        },
        {
          "headline":"Let your papier mache balloon dry.",
          "description":"Leave it in a warm place to dry overnight. The paper and paste must be completely dry before you begin painting or decorating your model. If you don't let it dry, it may mold. In some cases, it may take longer to dry. If your balloon has a lot of paste or layers, it may take more time. Try letting it dry a few days."
        },
        {
          "headline":"Pop the balloon.",
          "description":"Once your paper mache is dry, pop the balloon using a pin or a thumbtack. Remove the deflated balloon and any bits of balloon that may be inside your hollow planet."
        },
        {
          "headline":"Paint your planet.",
          "description":"For a simple model, use acrylic to paint your planet with its predominant color. For the Sun, use yellow. For Mercury, use grey. For Venus, use yellowish-white. For Earth, use blue-green. For Mars, use red. For Jupiter, use orange with white striations. For Saturn, use pale yellow. For Uranus, use light blue. For Neptune, use blue. For Pluto, use light brown."
        }
      ]
    },
    {
      "name":"Making a Styrofoam\\/Thermocol Model",
      "steps":[
        {
          "headline":"Decide which planet to make.",
          "description":"This will help you determine how large to make your planet. While this isn't too important if you're only making one, if you decide to make a whole solar system of planets, you may want to make them somewhat to scale. For example, you'd want to make Mars or Mercury much smaller than Saturn or Jupiter."
        },
        {
          "headline":"Select styrofoam (thermocol) balls.",
          "description":"If you're only doing one planet, make it whatever size you'd like, but if you decide to make an entire solar system, choose different sizes. This will allow you to accurately depict the scale of the planets. For the Sun, use a 5 or 6-inch ball. For Mercury, use a 1-inch ball. For Venus, use a 1.5-inch ball. For Earth, use a 1.5-inch ball. For Mars, use a 1.25-inch ball. For Jupiter, use a 4-inch ball. For Saturn, use a 3-inch ball. For Uranus, use a 2.5-inch ball. For Neptune, use a 2-inch ball. For Pluto, use a 1.25-inch ball."
        },
        {
          "headline":"Paint your planet.",
          "description":"For a simple model, use acrylic to paint your planet with its predominant color. For the Sun, use yellow. For Mercury, use grey. For Venus, use yellowish-white. For Earth, use blue-green. For Mars, use red. For Jupiter, use orange with white striations. For Saturn, use pale yellow. For Uranus, use light blue. For Neptune, use blue. For Pluto, use light brown."
        },
        {
          "headline":"Add texture or defining characteristics to your model.",
          "description":"If your planet has several colors, go back and dab the other color over the surface. If your planet has rings, attach wire or a styrofoam ring around the planet. For rings, you can also cut the styrofoam planet model in half horizontally and glue an old cd through the center. Reattach the styrofoam halves with glue. The CD should appear as rings around the planet. For craters, you can chip out bits of styrofoam to make a craggy surface. You'll want to dab fresh paint over these areas."
        },
        {
          "headline":"Prepare dowel rods if you want to make a solar system.",
          "description":"If you've made all the planets to scale, take dowel rods and cut them to size. This will ensure that the planets are the appropriate distance apart. You won't need any dowel rods for the sun, since it will be the center of the system model. For Mercury, use a 2.25-inch rod. For Venus, use a 4-inch rod. For Earth, use 5-inch rod. For Mars, use 6-inch rod. For Jupiter, a 7-inch rod. For Saturn, use an 8-inch rod. For Uranus, use a 10-inch rod. For Neptune, use an 11.5-inch rod. For Pluto, use a 14-inch rod."
        },
        {
          "headline":"Attach planets to the sun.",
          "description":"Using the trimmed dowel rods, stick the rod into the corresponding planet. Then, stick the opposite end of the dowel rod into the sun. Be sure to stick rods around the entire circumference of the sun. Start with Mercury, closest to the sun, and work outward.Here's a mnemonic to remember the order of the planets:My Very Excellent Mother Just Served Us Nine Pizzas.=Mercury Venus Earth Mars Jupiter Saturn Uranus Neptune Pluto(If you aren't including Pluto, think My Very Excellent Mother Just Served Us Noodles instead."
        }
      ]
    }
  ],
  "text":" Making a Papier Mache Planet Model Decide which planet to make. This will help you determine how large to make your planet. While this isn't too important if you're only making one, if you decide to make a whole solar system of planets, you may want to make them somewhat to scale. For example, you'd want to make Mars or Mercury much smaller than Saturn or Jupiter. Blow up a balloon. Don't blow the balloon up too much, or it will become oval in shape. Try to add just enough air to make it circular, while making it as large or small as you'd like. Place the balloon tied-end down in a bowl. This will hold it still and make it easier to apply the papier mache. Make your adhesive. You can use either glue and water, raw flour and water, or flour and water that's been cooked. There are different advantages to each: the glue and water is easy to mix up, the raw flour and water paste is stronger, and the boiled flour and water paste dries clear. For glue and water paste, use about 1/4 cup of white school glue and add water just till it becomes slightly runny. For raw flour and water, mix enough water into flour until you get the consistency you'd like. Remember that thicker paste will take longer to dry and that you'll need to let your paper mache balloon dry overnight. For boiled flour and water, whisk together 1/2 cup flour of flour and 2 1/2 cups of water over medium heat until the mixture boils. It will thicken into a gel as it cools. Shred your papers. You can use newspapers, brown craft paper, or construction paper. Use whatever you have easy access to and be sure to rip your paper into pieces or strips. Avoid cutting the papers. The straight lines will be visible once the paper mache dries. The torn edges of your ripped papers will blend in better. Apply your paper to the balloon. Dip the strips or pieces of paper into your paste. Be sure to completely coat the paper with the glue, but slide your fingers over the paper to remove excess paste. Lay the strips or pieces over your entire balloon. Add another layer of strips over your entire balloon. Use your hands to smooth out any bubbles or bumps on the surface of your balloon, unless you want to give your planet a bumpy texture. Let your papier mache balloon dry. Leave it in a warm place to dry overnight. The paper and paste must be completely dry before you begin painting or decorating your model. If you don't let it dry, it may mold. In some cases, it may take longer to dry. If your balloon has a lot of paste or layers, it may take more time. Try letting it dry a few days. Pop the balloon. Once your paper mache is dry, pop the balloon using a pin or a thumbtack. Remove the deflated balloon and any bits of balloon that may be inside your hollow planet. Paint your planet. For a simple model, use acrylic to paint your planet with its predominant color. For the Sun, use yellow. For Mercury, use grey. For Venus, use yellowish-white. For Earth, use blue-green. For Mars, use red. For Jupiter, use orange with white striations. For Saturn, use pale yellow. For Uranus, use light blue. For Neptune, use blue. For Pluto, use light brown. Making a Styrofoam\\/Thermocol Model Decide which planet to make. This will help you determine how large to make your planet. While this isn't too important if you're only making one, if you decide to make a whole solar system of planets, you may want to make them somewhat to scale. For example, you'd want to make Mars or Mercury much smaller than Saturn or Jupiter. Select styrofoam (thermocol) balls. If you're only doing one planet, make it whatever size you'd like, but if you decide to make an entire solar system, choose different sizes. This will allow you to accurately depict the scale of the planets. For the Sun, use a 5 or 6-inch ball. For Mercury, use a 1-inch ball. For Venus, use a 1.5-inch ball. For Earth, use a 1.5-inch ball. For Mars, use a 1.25-inch ball. For Jupiter, use a 4-inch ball. For Saturn, use a 3-inch ball. For Uranus, use a 2.5-inch ball. For Neptune, use a 2-inch ball. For Pluto, use a 1.25-inch ball. Paint your planet. For a simple model, use acrylic to paint your planet with its predominant color. For the Sun, use yellow. For Mercury, use grey. For Venus, use yellowish-white. For Earth, use blue-green. For Mars, use red. For Jupiter, use orange with white striations. For Saturn, use pale yellow. For Uranus, use light blue. For Neptune, use blue. For Pluto, use light brown. Add texture or defining characteristics to your model. If your planet has several colors, go back and dab the other color over the surface. If your planet has rings, attach wire or a styrofoam ring around the planet. For rings, you can also cut the styrofoam planet model in half horizontally and glue an old cd through the center. Reattach the styrofoam halves with glue. The CD should appear as rings around the planet. For craters, you can chip out bits of styrofoam to make a craggy surface. You'll want to dab fresh paint over these areas. Prepare dowel rods if you want to make a solar system. If you've made all the planets to scale, take dowel rods and cut them to size. This will ensure that the planets are the appropriate distance apart. You won't need any dowel rods for the sun, since it will be the center of the system model. For Mercury, use a 2.25-inch rod. For Venus, use a 4-inch rod. For Earth, use 5-inch rod. For Mars, use 6-inch rod. For Jupiter, a 7-inch rod. For Saturn, use an 8-inch rod. For Uranus, use a 10-inch rod. For Neptune, use an 11.5-inch rod. For Pluto, use a 14-inch rod. Attach planets to the sun. Using the trimmed dowel rods, stick the rod into the corresponding planet. Then, stick the opposite end of the dowel rod into the sun. Be sure to stick rods around the entire circumference of the sun. Start with Mercury, closest to the sun, and work outward.Here's a mnemonic to remember the order of the planets:My Very Excellent Mother Just Served Us Nine Pizzas.=Mercury Venus Earth Mars Jupiter Saturn Uranus Neptune Pluto(If you aren't including Pluto, think My Very Excellent Mother Just Served Us Noodles instead.",
  "tyn_model":[
    "water",
    "balloon",
    "paper",
    "glue",
    "dowel rods",
    "raw flour",
    "flour",
    "papier mache",
    "boiled flour",
    "acrylic",
    "styrofoam",
    "bowl",
    "adhesive",
    "paper mache balloon",
    "newspapers",
    "brown craft paper",
    "construction paper",
    "papier mache balloon",
    "neptune",
    "styrofoam (",
    "wire",
    "styrofoam ring",
    "styrofoam planet",
    "paint",
    "rod",
    "dowel",
    "rods",
    "noodles"
  ],
  "tyn_section":[

  ]
}