{
  "title":"How to Prune Jasmine",
  "url":"https://www.wikihow.com/Prune-Jasmine",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "methods":[
    {
      "name":"Pruning Outdoor Jasmine Vines",
      "steps":[
        {
          "headline":"Prune immediately after flowering.",
          "description":"Give summer jasmine a hard prune annually, in late summer or early autumn. Winter jasmine needs a heavy prune in late spring, immediately after it has finished blooming. Winter jasmine blooms from June to October in the Southern Hemisphere, and from March to April in the Northern Hemisphere. Summer jasmine blooms from April through June in the Northern Hemisphere, and from November through January in the Southern Hemisphere. Flowers form on the previous year's growth. Pruning immediately after flowering gives that growth time to mature so your plant can flower fully next season."
        },
        {
          "headline":"Focus on one stem section at a time.",
          "description":"Pruning an older, well-established jasmine vine can be challenging. You may be tempted to yank at vines to pull them apart. If your jasmine is thick, start at the bottom and work up a single stem, clearing excessive growth as you go. Then move to the next stem. If the vines are tangled, cut away the smaller branches to reveal the main vine. Then you can separate it from others and retrain it."
        },
        {
          "headline":"Cut down dead and damaged vines to ground level.",
          "description":"Dead, diseased, or severely damaged vines should be removed completely. Remove dead or damaged leaves entirely from their stems, but leave the vertical vine if it remains healthy. Once every other year, identify weaker vines that are thin with fewer blooms. Cut them down to ground level as well. This will encourage the plant to grow stronger vines. Aim to cut back no more than ⅓ of the total vines."
        },
        {
          "headline":"Thin out crowded or crossing branches.",
          "description":"Step back and observe the directions of the branches. Look for vines that are growing out away from the supports. Remove weaker stems from the new growth to allow air and light to reach into the vine. This also ensures your vines don't get so heavy that they damage their supports or cause them to collapse. Branches that cross other branches will rub against each other and damage each other. Remove the branch that isn't growing in the right direction relative to your supports and the way you've trained the vines. Thinning the growth will keep your jasmine vines looking neat and encourage better flowering."
        },
        {
          "headline":"Shorten vines to keep the jasmine from getting top-heavy.",
          "description":"Cutting back some of the vines to about 3 feet (0.91 m) will keep your plant from growing off-balanced or damaging your fence or other supports. Shortened vines will grow back within 1 or 2 seasons. Jasmine can handle heavy pruning, so cutting back to this height shouldn't impact the plant's flowering next season."
        },
        {
          "headline":"Unravel and retrain vines growing in the wrong direction.",
          "description":"As you're pruning your jasmine, you may notice vines that are growing in a direction you don't want. If you don't want to cut these vines away, twist them gently into the right direction and tie them with twine. Tie tight enough that the vine will stay in place, but not so tight that you damage the vine. Check your twine once a week or so to make sure it's not digging into the vine."
        },
        {
          "headline":"Keep your jasmine trim with light pruning throughout the year.",
          "description":"Jasmine grows vigorously. Continue to prune throughout the year, focusing on removing any dead or damaged leaves or stems. Light monthly pruning will make the hard prune after blooming easier. In addition to dead or damaged leaves and stems, you can also remove stems that are growing out directly from the fence or other supports."
        },
        {
          "headline":"Renovate overgrown jasmine by cutting back to the base.",
          "description":"Jasmine grows vigorously and can withstand hard pruning. If your jasmine has outgrown its space, you can cut the entire plant back to within 2 feet (61 cm) of ground level. Select strong, healthy shoots to retrain on your wall or fence. Once cut back this way, your jasmine may not flower again for 2 or 3 years."
        }
      ]
    },
    {
      "name":"Maintaining Potted Jasmine Indoors",
      "steps":[
        {
          "headline":"Do a hard pruning immediately after blooming.",
          "description":"As soon as your jasmine has stopped blooming, cut away the flowering shoots and ⅓ of the new growth to help control the size of your plant. Remove all stems that have already flowered, bare lower stems, and dead or damaged leaves. After pruning, use a hoop or wire trellis in the pot to help support the vines if you want your jasmine to grow vertically. You can also let the vines hang over the edge of the pot. Indoor jasmine may bloom year-round, but requires a rest period during the fall. Keep the non-flowering plant in a dark area, don’t fertilize it, and limit watering for 4 to 5 weeks."
        },
        {
          "headline":"Remove dead flowers and branches as soon as they appear.",
          "description":"If you don't get rid of dead flowers and branches, your jasmine will stop growing. Pinch off dead flowers and cut non-flowering branches down to the base of the stem. If your jasmine is dropping leaves, this may be a sign that it's not getting enough sun. Try to move it to a place where it can receive more direct sunlight."
        },
        {
          "headline":"Trim as necessary to prevent overgrowth.",
          "description":"Jasmine plants grow vigorously. Indoors, they will quickly overtake their pots if not trimmed regularly. Prune away 10 to 20 percent of new growth as needed weekly, except when the plant is blooming. Avoid regular pruning while the plant is blooming, except to remove dead flowers and foliage. Follow up with a hard pruning when blooming has stopped. Give the plant a couple of weeks to recover before resuming your weekly trimming routine."
        },
        {
          "headline":"Repot in spring only when completely pot bound.",
          "description":"Jasmine plants tend to bloom best when they are slightly pot bound. If your jasmine is in a larger pot, you may see lots of leaves and fewer flowers. Repot when roots start growing through drainage holes in the pot, or when you can see roots through the top of the soil. Your jasmine's new pot shouldn't be more than 1 or 2 inches (2.5 or 5.1 cm) larger than the old one."
        },
        {
          "headline":"Root-prune when repotting your jasmine.",
          "description":"If you root-prune your jasmine, you typically can return it to the same pot rather than using a larger pot. Root-pruning can help you keep the size of your indoor jasmine under control. The best time to do root-pruning is right after the plant has bloomed. Remove the plant from the pot and cut back 1/3 of the roots from the outside and base. At the same time, cut back the plant's foliage until it is about 1/3 its original size. Do not root-prune unless you top-prune as well."
        }
      ]
    },
    {
      "name":"Training Jasmine Vines",
      "steps":[
        {
          "headline":"Set supports about 2 inches (5.1 cm) away from the wall.",
          "description":"If you want your jasmine to grow freely up a wall or fence, your supports should be far enough out that the vines can twine around the supports and grow loosely. Generally, the lowest wire or wooden batten of your support structure should be at least 12 inches (30 cm) above soil level. This will help prevent excessive dampness and rot, and make it easier for you to prune the lower parts of the vines."
        },
        {
          "headline":"Start young plants on bamboo canes.",
          "description":"Jasmine plants typically are started in pots, then transferred to the garden once they've started growing vines. Set bamboo canes directly in the pots, and twine the young vines around these canes. Vines should start to appear within 4 weeks. Allow the plant to grow until its roots fill the starter or seedling pot, then move outside in early spring. Leave the vines trained around the bamboo canes when you move your jasmine outdoors. When you plant your jasmine, set it out 8 to 12 inches (20 to 30 cm) from the supports to make sure the roots of the plant will be exposed to adequate rainfall. Make sure the plant is 12 to 18 inches (30 to 46 cm) away from the wall or any solid structure, so it has enough room to develop a complete root system."
        },
        {
          "headline":"Use the canes to angle the vines up the support.",
          "description":"Take the bamboo canes from the potted jasmine and weave them through the wires or wooden battens of your support to help train your vines in the right direction. Adjust the canes into a fan shape. This will give each of your vines room to grow before they start crowding and tangling with each other. Establishing a strong pattern early makes pruning easier as the plant grows. Tie the bamboo canes into place on the trellis or other support using gardening twine to help them stay in place."
        },
        {
          "headline":"Prune away weak growth that detracts from your main framework.",
          "description":"Once you've established the shape for your jasmine to grow, get rid of any outgrowing stems or branches that don't contribute to that shape. Trim once a week or so until the first flowering season to keep the jasmine growing in the direction you want. You may find you need to add a new row of bamboo canes to help train new growth. Remove the bamboo canes when your jasmine has formed thick woody stems. From this point, it should climb in the right direction on its own."
        },
        {
          "headline":"Tie in winter jasmine to train the growth.",
          "description":"Although winter jasmine can be grown vertically, it isn't really a climber. Tying vertical branches to a fence or trellis helps encourage the plant to grow upwards and cover the structure. String or twine are effective to tie in winter jasmine. You can also use twist ties. Be careful not to tie so tightly that you damage the plant."
        }
      ]
    }
  ],
  "text":" Pruning Outdoor Jasmine Vines Prune immediately after flowering. Give summer jasmine a hard prune annually, in late summer or early autumn. Winter jasmine needs a heavy prune in late spring, immediately after it has finished blooming. Winter jasmine blooms from June to October in the Southern Hemisphere, and from March to April in the Northern Hemisphere. Summer jasmine blooms from April through June in the Northern Hemisphere, and from November through January in the Southern Hemisphere. Flowers form on the previous year's growth. Pruning immediately after flowering gives that growth time to mature so your plant can flower fully next season. Focus on one stem section at a time. Pruning an older, well-established jasmine vine can be challenging. You may be tempted to yank at vines to pull them apart. If your jasmine is thick, start at the bottom and work up a single stem, clearing excessive growth as you go. Then move to the next stem. If the vines are tangled, cut away the smaller branches to reveal the main vine. Then you can separate it from others and retrain it. Cut down dead and damaged vines to ground level. Dead, diseased, or severely damaged vines should be removed completely. Remove dead or damaged leaves entirely from their stems, but leave the vertical vine if it remains healthy. Once every other year, identify weaker vines that are thin with fewer blooms. Cut them down to ground level as well. This will encourage the plant to grow stronger vines. Aim to cut back no more than ⅓ of the total vines. Thin out crowded or crossing branches. Step back and observe the directions of the branches. Look for vines that are growing out away from the supports. Remove weaker stems from the new growth to allow air and light to reach into the vine. This also ensures your vines don't get so heavy that they damage their supports or cause them to collapse. Branches that cross other branches will rub against each other and damage each other. Remove the branch that isn't growing in the right direction relative to your supports and the way you've trained the vines. Thinning the growth will keep your jasmine vines looking neat and encourage better flowering. Shorten vines to keep the jasmine from getting top-heavy. Cutting back some of the vines to about 3 feet (0.91 m) will keep your plant from growing off-balanced or damaging your fence or other supports. Shortened vines will grow back within 1 or 2 seasons. Jasmine can handle heavy pruning, so cutting back to this height shouldn't impact the plant's flowering next season. Unravel and retrain vines growing in the wrong direction. As you're pruning your jasmine, you may notice vines that are growing in a direction you don't want. If you don't want to cut these vines away, twist them gently into the right direction and tie them with twine. Tie tight enough that the vine will stay in place, but not so tight that you damage the vine. Check your twine once a week or so to make sure it's not digging into the vine. Keep your jasmine trim with light pruning throughout the year. Jasmine grows vigorously. Continue to prune throughout the year, focusing on removing any dead or damaged leaves or stems. Light monthly pruning will make the hard prune after blooming easier. In addition to dead or damaged leaves and stems, you can also remove stems that are growing out directly from the fence or other supports. Renovate overgrown jasmine by cutting back to the base. Jasmine grows vigorously and can withstand hard pruning. If your jasmine has outgrown its space, you can cut the entire plant back to within 2 feet (61 cm) of ground level. Select strong, healthy shoots to retrain on your wall or fence. Once cut back this way, your jasmine may not flower again for 2 or 3 years. Maintaining Potted Jasmine Indoors Do a hard pruning immediately after blooming. As soon as your jasmine has stopped blooming, cut away the flowering shoots and ⅓ of the new growth to help control the size of your plant. Remove all stems that have already flowered, bare lower stems, and dead or damaged leaves. After pruning, use a hoop or wire trellis in the pot to help support the vines if you want your jasmine to grow vertically. You can also let the vines hang over the edge of the pot. Indoor jasmine may bloom year-round, but requires a rest period during the fall. Keep the non-flowering plant in a dark area, don’t fertilize it, and limit watering for 4 to 5 weeks. Remove dead flowers and branches as soon as they appear. If you don't get rid of dead flowers and branches, your jasmine will stop growing. Pinch off dead flowers and cut non-flowering branches down to the base of the stem. If your jasmine is dropping leaves, this may be a sign that it's not getting enough sun. Try to move it to a place where it can receive more direct sunlight. Trim as necessary to prevent overgrowth. Jasmine plants grow vigorously. Indoors, they will quickly overtake their pots if not trimmed regularly. Prune away 10 to 20 percent of new growth as needed weekly, except when the plant is blooming. Avoid regular pruning while the plant is blooming, except to remove dead flowers and foliage. Follow up with a hard pruning when blooming has stopped. Give the plant a couple of weeks to recover before resuming your weekly trimming routine. Repot in spring only when completely pot bound. Jasmine plants tend to bloom best when they are slightly pot bound. If your jasmine is in a larger pot, you may see lots of leaves and fewer flowers. Repot when roots start growing through drainage holes in the pot, or when you can see roots through the top of the soil. Your jasmine's new pot shouldn't be more than 1 or 2 inches (2.5 or 5.1 cm) larger than the old one. Root-prune when repotting your jasmine. If you root-prune your jasmine, you typically can return it to the same pot rather than using a larger pot. Root-pruning can help you keep the size of your indoor jasmine under control. The best time to do root-pruning is right after the plant has bloomed. Remove the plant from the pot and cut back 1/3 of the roots from the outside and base. At the same time, cut back the plant's foliage until it is about 1/3 its original size. Do not root-prune unless you top-prune as well. Training Jasmine Vines Set supports about 2 inches (5.1 cm) away from the wall. If you want your jasmine to grow freely up a wall or fence, your supports should be far enough out that the vines can twine around the supports and grow loosely. Generally, the lowest wire or wooden batten of your support structure should be at least 12 inches (30 cm) above soil level. This will help prevent excessive dampness and rot, and make it easier for you to prune the lower parts of the vines. Start young plants on bamboo canes. Jasmine plants typically are started in pots, then transferred to the garden once they've started growing vines. Set bamboo canes directly in the pots, and twine the young vines around these canes. Vines should start to appear within 4 weeks. Allow the plant to grow until its roots fill the starter or seedling pot, then move outside in early spring. Leave the vines trained around the bamboo canes when you move your jasmine outdoors. When you plant your jasmine, set it out 8 to 12 inches (20 to 30 cm) from the supports to make sure the roots of the plant will be exposed to adequate rainfall. Make sure the plant is 12 to 18 inches (30 to 46 cm) away from the wall or any solid structure, so it has enough room to develop a complete root system. Use the canes to angle the vines up the support. Take the bamboo canes from the potted jasmine and weave them through the wires or wooden battens of your support to help train your vines in the right direction. Adjust the canes into a fan shape. This will give each of your vines room to grow before they start crowding and tangling with each other. Establishing a strong pattern early makes pruning easier as the plant grows. Tie the bamboo canes into place on the trellis or other support using gardening twine to help them stay in place. Prune away weak growth that detracts from your main framework. Once you've established the shape for your jasmine to grow, get rid of any outgrowing stems or branches that don't contribute to that shape. Trim once a week or so until the first flowering season to keep the jasmine growing in the direction you want. You may find you need to add a new row of bamboo canes to help train new growth. Remove the bamboo canes when your jasmine has formed thick woody stems. From this point, it should climb in the right direction on its own. Tie in winter jasmine to train the growth. Although winter jasmine can be grown vertically, it isn't really a climber. Tying vertical branches to a fence or trellis helps encourage the plant to grow upwards and cover the structure. String or twine are effective to tie in winter jasmine. You can also use twist ties. Be careful not to tie so tightly that you damage the plant.",
  "tyn_model":[
    "jasmine",
    "bamboo canes",
    "prune",
    "twine",
    "pot",
    "⅓ of",
    "vines",
    "canes",
    "potted jasmine",
    "gardening twine",
    "string",
    "twist ties"
  ],
  "tyn_section":[
    "Bamboo canes (to train outdoor vines)",
    "Wire hoop or trellis (to train potted jasmine)",
    "Pruning twine",
    "Pruning shears",
    "Loppers",
    "Anvil pruners (for dry branches and stems)"
  ]
}