{
  "title":"How to Hang Beaded Curtains",
  "url":"https://www.wikihow.com/Hang-Beaded-Curtains",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Treatments",
    "Curtains"
  ],
  "parts":[
    {
      "name":"Measuring and Positioning the Curtains",
      "steps":[
        {
          "headline":"Match the curtain beads' width to the window or doorway's width.",
          "description":"Measure the width of your curtain beads and compare them to the width of the window or doorway you plan to hang them on. If the curtains are wider than the window or doorway, cut 1 bead strand at a time with scissors until you reach your desired length. The curtain rod's width does not matter, as it can hang above the doorway or windowpane."
        },
        {
          "headline":"Hold the curtains up and center them against the wall.",
          "description":"Line the halfway point of the curtains up with the middle of the door or window, then adjust the curtains' position until it is completely centered. Use a level to make sure that the curtains are straight and even. Using a level and holding the curtains can be tough by yourself. Ask a friend to hold the curtains steady while you check the level's measurements."
        },
        {
          "headline":"Mark the nail or hanger holes with pencil.",
          "description":"Check the back of the curtain rod for holes—there should be 1 on each side. This is where you will attach the curtain to the wall. Align the curtains to the wall at the height where you'll hang it on the wall and mark the wall just behind the hole with a pencil. If you'd prefer not to write on your wall, place a piece of painter's tape up and mark on it instead. Hang the curtains at least 1–1.5 inches (2.5–3.8 cm) above the doorway or window."
        }
      ]
    },
    {
      "name":"Attaching the Hooks or Nails",
      "steps":[
        {
          "headline":"Put on a pair of safety goggles and, if needed, earplugs.",
          "description":"To hang beaded curtains, you will need to handle either a hammer or drill. Wear safety goggles while handling the drill or hammer to prevent serious injuries. If you have sensitive hearing, wear earplugs while drilling or hammering. You can also wear a pair of work gloves to protect your hands while hammering, but don't put them on while drilling. Loose fabric can get caught in the drill bit and cause injuries."
        },
        {
          "headline":"Hammer in nails for small or medium-sized curtains.",
          "description":"Grip the hammer near the end of the hammer and, holding the nail over the marked wall, swing the hammer and tap the nail's head. Continue tapping the head until you hammer half of the nail into the wall. The nails should be approximately the same size as the curtain rod's holes, but not larger. Work carefully while hammering the wall to prevent hand injuries."
        },
        {
          "headline":"Attach hangers into the wall for large beaded curtains.",
          "description":"Drill a pilot hole by positioning the drill bit over the marked area and pushing it into the wall with firm, steady pressure. Depending on the wall hanger, push or screw it into the wall until only the hook extends from the wall. Cup hooks are the ideal hangers for hanging large beaded curtains. You can buy cup hooks at most home improvement stores or online. For especially large beaded curtains, use a heavy-duty hook to hang the curtains."
        },
        {
          "headline":"Test the nail or hanger's wall adherence.",
          "description":"Grab the nail or hanger with your hand and wiggle it back and forth. If it is too loose, screw, push, or hammer it further into the wall until it is no longer loose. If the nail or hanger is still loose, you may have made the hole too big. Fill the hole with spackle and make a new, smaller hole in its place."
        }
      ]
    },
    {
      "name":"Securing and Maintaining the Curtains",
      "steps":[
        {
          "headline":"Secure the curtain rod to the hangers or nails.",
          "description":"Locate your curtains' holes again and lift the curtain rod to the height of the hangers or nails. If you hammered nails to the wall, push the nails through the hole until the rod hangs tightly against the wall. For hangers, hook the curtain rod holes through the hangers to secure the rod in place."
        },
        {
          "headline":"Wiggle the curtain rod to test its adherence.",
          "description":"Grab the curtain rod and gently wiggle it with your hand. If the rod feels loose or seems like it may fall off, adjust the hangers' or nails' tightness or replace them with a heavy-duty hanger."
        },
        {
          "headline":"Check how centered the curtain rod is with a level.",
          "description":"Place a level over the center of the curtain rod and read the measurements. If the bubble remains in the center of the level, your curtain rod needs no additional adjustments. If your beaded curtains aren't level, try adjusting their fit against the hangers or nails. You may need to remove the hangers or nails and reattach them in another spot if adjusting doesn't help."
        },
        {
          "headline":"Loop the bead rings through the curtain rod if they're not attached.",
          "description":"Some beaded curtains are not directly attached to a curtain rod but come in loops. After adhering the rod to the wall, loop each beaded curtain ring through the rod to secure them in place on the wall. Every beaded curtain is different. Check your curtain's setup instructions to make sure you attach them correctly."
        },
        {
          "headline":"Clean the beaded curtains with a vacuum or washcloth.",
          "description":"To get rid of dust, turn on your vacuum and use the tube attachment to suck away any debris. If you don't have a vacuum on hand, dip a washcloth in water and wipe the curtain rod and beads. Repeat this process once or several times a week to keep your curtains in good condition."
        },
        {
          "headline":"Use baby oil to untangle beaded curtains.",
          "description":"If your beaded curtains get tangled, rub a few drops of baby oil into each knot. Work the knots with your fingers, pulling until you're able to separate the different strands. Baby oil makes the strands slippery and less likely to snag while you untangle them."
        }
      ]
    }
  ],
  "text":" Measuring and Positioning the Curtains Match the curtain beads' width to the window or doorway's width. Measure the width of your curtain beads and compare them to the width of the window or doorway you plan to hang them on. If the curtains are wider than the window or doorway, cut 1 bead strand at a time with scissors until you reach your desired length. The curtain rod's width does not matter, as it can hang above the doorway or windowpane. Hold the curtains up and center them against the wall. Line the halfway point of the curtains up with the middle of the door or window, then adjust the curtains' position until it is completely centered. Use a level to make sure that the curtains are straight and even. Using a level and holding the curtains can be tough by yourself. Ask a friend to hold the curtains steady while you check the level's measurements. Mark the nail or hanger holes with pencil. Check the back of the curtain rod for holes—there should be 1 on each side. This is where you will attach the curtain to the wall. Align the curtains to the wall at the height where you'll hang it on the wall and mark the wall just behind the hole with a pencil. If you'd prefer not to write on your wall, place a piece of painter's tape up and mark on it instead. Hang the curtains at least 1–1.5 inches (2.5–3.8 cm) above the doorway or window. Attaching the Hooks or Nails Put on a pair of safety goggles and, if needed, earplugs. To hang beaded curtains, you will need to handle either a hammer or drill. Wear safety goggles while handling the drill or hammer to prevent serious injuries. If you have sensitive hearing, wear earplugs while drilling or hammering. You can also wear a pair of work gloves to protect your hands while hammering, but don't put them on while drilling. Loose fabric can get caught in the drill bit and cause injuries. Hammer in nails for small or medium-sized curtains. Grip the hammer near the end of the hammer and, holding the nail over the marked wall, swing the hammer and tap the nail's head. Continue tapping the head until you hammer half of the nail into the wall. The nails should be approximately the same size as the curtain rod's holes, but not larger. Work carefully while hammering the wall to prevent hand injuries. Attach hangers into the wall for large beaded curtains. Drill a pilot hole by positioning the drill bit over the marked area and pushing it into the wall with firm, steady pressure. Depending on the wall hanger, push or screw it into the wall until only the hook extends from the wall. Cup hooks are the ideal hangers for hanging large beaded curtains. You can buy cup hooks at most home improvement stores or online. For especially large beaded curtains, use a heavy-duty hook to hang the curtains. Test the nail or hanger's wall adherence. Grab the nail or hanger with your hand and wiggle it back and forth. If it is too loose, screw, push, or hammer it further into the wall until it is no longer loose. If the nail or hanger is still loose, you may have made the hole too big. Fill the hole with spackle and make a new, smaller hole in its place. Securing and Maintaining the Curtains Secure the curtain rod to the hangers or nails. Locate your curtains' holes again and lift the curtain rod to the height of the hangers or nails. If you hammered nails to the wall, push the nails through the hole until the rod hangs tightly against the wall. For hangers, hook the curtain rod holes through the hangers to secure the rod in place. Wiggle the curtain rod to test its adherence. Grab the curtain rod and gently wiggle it with your hand. If the rod feels loose or seems like it may fall off, adjust the hangers' or nails' tightness or replace them with a heavy-duty hanger. Check how centered the curtain rod is with a level. Place a level over the center of the curtain rod and read the measurements. If the bubble remains in the center of the level, your curtain rod needs no additional adjustments. If your beaded curtains aren't level, try adjusting their fit against the hangers or nails. You may need to remove the hangers or nails and reattach them in another spot if adjusting doesn't help. Loop the bead rings through the curtain rod if they're not attached. Some beaded curtains are not directly attached to a curtain rod but come in loops. After adhering the rod to the wall, loop each beaded curtain ring through the rod to secure them in place on the wall. Every beaded curtain is different. Check your curtain's setup instructions to make sure you attach them correctly. Clean the beaded curtains with a vacuum or washcloth. To get rid of dust, turn on your vacuum and use the tube attachment to suck away any debris. If you don't have a vacuum on hand, dip a washcloth in water and wipe the curtain rod and beads. Repeat this process once or several times a week to keep your curtains in good condition. Use baby oil to untangle beaded curtains. If your beaded curtains get tangled, rub a few drops of baby oil into each knot. Work the knots with your fingers, pulling until you're able to separate the different strands. Baby oil makes the strands slippery and less likely to snag while you untangle them.",
  "tyn_model":[
    "curtain rod",
    "nails",
    "hammer",
    "curtains",
    "level",
    "nail",
    "vacuum",
    "baby oil",
    "pencil",
    "earplugs",
    "hangers",
    "cup hooks",
    "beaded curtains",
    "washcloth",
    "curtain beads",
    "scissors",
    "—there",
    "painter's tape",
    "drill",
    "drill bit",
    "heavy-duty hook",
    "spackle",
    "heavy-duty hanger",
    "water",
    "beads"
  ],
  "tyn_section":[
    "Tape measure",
    "Level",
    "Pencil",
    "Safety goggles",
    "Nails or hangers",
    "Drill or hammer",
    "Vacuum with tube attachment",
    "Washcloth",
    "Water",
    "Earplugs (optional)",
    "Masking tape (optional)"
  ]
}