{
  "title":"How to Decorate Jars for Christmas",
  "url":"https://www.wikihow.com/Decorate-Jars-for-Christmas",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating"
  ],
  "methods":[
    {
      "name":"Painting a Candy Cane Vase",
      "steps":[
        {
          "headline":"Place masking tape or blue painter's tape diagonally across a red or green mason a jar.",
          "description":"Starting at the bottom of the jar, stretch the tape diagonally towards the top of the jar and repeat every 2 inches for even spacing. The tape will act as a stencil for perfectly uniform candy cane stripes."
        },
        {
          "headline":"Apply Mod Podge to help white paint appear more white.",
          "description":"So that your white paint will be more vibrant against colored glass, apply a layer of Mod Podge with a small paint brush on exposed glass sections and allow it to dry."
        },
        {
          "headline":"Apply 2 layers of white paint over the Mod Podge.",
          "description":"Both chalk paint and acrylic enamel paints are water based, quick to dry and perfect for painting on glass. With the same small brush, apply a layer of white paint over dried Mod Podge. Allow the first later of paint to dry, then apply another coat."
        },
        {
          "headline":"Remove the tape once your paint is dry.",
          "description":"Now that you have neatly stenciled and painted your jar, carefully remove the masking or blue painter's tape to reveal green and white or red and white candy stripes!"
        },
        {
          "headline":"Add twine or grapevine wire and small jingle bells.",
          "description":"To add some extra character, string 2 jingle bells in complementary colors along a piece of brown twine or grapevine wire. Wrap the piece of twine 2 or 3 times around the neck of the jar, then tie in a neat bow. The final touch is adding a bouquet of flowers! Chalk paint is a good substitute if you are doing this project with kids\nSuggested color combinations for jungle bells are: silver bells for both red and green stripes, red bells with green stripes and green bells with red stripes."
        }
      ]
    },
    {
      "name":"Making a Red-Nosed Reindeer",
      "steps":[
        {
          "headline":"Construct the antlers out of brown pipe cleaners.",
          "description":"Wrap 1 brown pipe cleaner around the mouth of a jar. Bend 2 more pipe cleaners into the shape of antlers. Attach the antlers on either side of the jar and secure them by bending the ends around the circled pipe cleaner. Use a hot glue gun to secure antlers."
        },
        {
          "headline":"Apply wiggly eyes and a red pom pom as the nose.",
          "description":"With your hot glue gun, secure 2 wiggly eyes and 1-inch red pom pom in the front of the jar to make a cute face. It's easiest to configure the wiggly eyes and pom pom into a triangle- wiggly eyes right next to each other and the red pom directly under the two eyes."
        },
        {
          "headline":"Fill the jar with your hot chocolate mix or other chocolate treat.",
          "description":"To make the brown face of the reindeer, choose a chocolate treat or a homemade hot chocolate mix and your jar can now double as a treat container!"
        }
      ]
    },
    {
      "name":"Turning Any Type of Jar Into a Snow Globe",
      "steps":[
        {
          "headline":"Glue a figurine to the bottom of a cookie jar.",
          "description":"This project will work with any type of wide-mouth jar, whether it's a cookie jar or mason jar. With a hot glue gun, secure the base of small figurines like a pine tree, lamp post, reindeer or a snowman to the bottom of your jar. If you are using a mason jar, an interesting twist is to flip it on its lid and glue your figurines to the underside of the lid. Figurines can be found in the Christmas section of most one-stop stores or a crafting store. You can use a combination of a snowman and a lamppost or a toy truck and a Christmas tree to complete your mini Christmas scene."
        },
        {
          "headline":"Fill the bottom of the cookie jar with \"snow.\"",
          "description":"Place faux snow or epsom salt on the bottom of the jar, enough to cover the base of the figurine. Epsom salt can be purchased at a dollar store or online. Faux snow can be found at any crafting store and also online."
        },
        {
          "headline":"Fill your jar with \"snow\" first before adding small toys without a base.",
          "description":"Your snow globe jar can also be decorated with small toys or ornaments. If your item doesn't have a base that can be glued to the bottom of the jar, place your epsom salt or faux snow in first, then place your toy on top of the snow. This project can serve as a charming kitchen accent for a counter top or as a gift\nYou may want to look for miniature vintage items, such as a toy truck or ornaments, on your preferred online shops or an antique store."
        }
      ]
    }
  ],
  "text":" Painting a Candy Cane Vase Place masking tape or blue painter's tape diagonally across a red or green mason a jar. Starting at the bottom of the jar, stretch the tape diagonally towards the top of the jar and repeat every 2 inches for even spacing. The tape will act as a stencil for perfectly uniform candy cane stripes. Apply Mod Podge to help white paint appear more white. So that your white paint will be more vibrant against colored glass, apply a layer of Mod Podge with a small paint brush on exposed glass sections and allow it to dry. Apply 2 layers of white paint over the Mod Podge. Both chalk paint and acrylic enamel paints are water based, quick to dry and perfect for painting on glass. With the same small brush, apply a layer of white paint over dried Mod Podge. Allow the first later of paint to dry, then apply another coat. Remove the tape once your paint is dry. Now that you have neatly stenciled and painted your jar, carefully remove the masking or blue painter's tape to reveal green and white or red and white candy stripes! Add twine or grapevine wire and small jingle bells. To add some extra character, string 2 jingle bells in complementary colors along a piece of brown twine or grapevine wire. Wrap the piece of twine 2 or 3 times around the neck of the jar, then tie in a neat bow. The final touch is adding a bouquet of flowers! Chalk paint is a good substitute if you are doing this project with kids\nSuggested color combinations for jungle bells are: silver bells for both red and green stripes, red bells with green stripes and green bells with red stripes. Making a Red-Nosed Reindeer Construct the antlers out of brown pipe cleaners. Wrap 1 brown pipe cleaner around the mouth of a jar. Bend 2 more pipe cleaners into the shape of antlers. Attach the antlers on either side of the jar and secure them by bending the ends around the circled pipe cleaner. Use a hot glue gun to secure antlers. Apply wiggly eyes and a red pom pom as the nose. With your hot glue gun, secure 2 wiggly eyes and 1-inch red pom pom in the front of the jar to make a cute face. It's easiest to configure the wiggly eyes and pom pom into a triangle- wiggly eyes right next to each other and the red pom directly under the two eyes. Fill the jar with your hot chocolate mix or other chocolate treat. To make the brown face of the reindeer, choose a chocolate treat or a homemade hot chocolate mix and your jar can now double as a treat container! Turning Any Type of Jar Into a Snow Globe Glue a figurine to the bottom of a cookie jar. This project will work with any type of wide-mouth jar, whether it's a cookie jar or mason jar. With a hot glue gun, secure the base of small figurines like a pine tree, lamp post, reindeer or a snowman to the bottom of your jar. If you are using a mason jar, an interesting twist is to flip it on its lid and glue your figurines to the underside of the lid. Figurines can be found in the Christmas section of most one-stop stores or a crafting store. You can use a combination of a snowman and a lamppost or a toy truck and a Christmas tree to complete your mini Christmas scene. Fill the bottom of the cookie jar with \"snow.\" Place faux snow or epsom salt on the bottom of the jar, enough to cover the base of the figurine. Epsom salt can be purchased at a dollar store or online. Faux snow can be found at any crafting store and also online. Fill your jar with \"snow\" first before adding small toys without a base. Your snow globe jar can also be decorated with small toys or ornaments. If your item doesn't have a base that can be glued to the bottom of the jar, place your epsom salt or faux snow in first, then place your toy on top of the snow. This project can serve as a charming kitchen accent for a counter top or as a gift\nYou may want to look for miniature vintage items, such as a toy truck or ornaments, on your preferred online shops or an antique store.",
  "tyn_model":[
    "mod podge",
    "paint",
    "snow",
    "cookie jar",
    "epsom salt",
    "white paint",
    "chalk paint",
    "twine",
    "grapevine wire",
    "hot glue",
    "hot chocolate mix",
    "mason jar",
    "toy truck",
    "candy cane vase",
    "masking tape",
    "blue painter's tape",
    "candy cane",
    "paint brush",
    "acrylic enamel paints",
    "small brush",
    "masking or blue painter's tape",
    "brown twine",
    "flowers",
    "brown pipe cleaners",
    "brown pipe cleaner",
    "pipe cleaners",
    "pipe cleaner",
    "hot glue gun",
    "faux snow or",
    "snow globe"
  ],
  "tyn_section":[
    "Candy Cane Vase",
    "White chalk paint or acrylic enamel paint",
    "Blue painter's tape or masking tape",
    "Mod podge",
    "Mason jar in any size",
    "Small paint brush",
    "Flowers",
    "Red-Nosed Reindeer",
    "Mason jar",
    "Brown pipe cleaners",
    "Wiggly eyes",
    "1 inch red pom poms",
    "Hot chocolate mix or chocolate treats",
    "Hot glue gun",
    "Cooking Jar Snow Globe",
    "Faux snow or epsom salt",
    "Small toy, Christmas figurine or ornament",
    "Brown twine or grapevine ribbon",
    "Decorative ribbon"
  ]
}