{
  "title":"How to Cook Bluefish",
  "url":"https://www.wikihow.com/Cook-Bluefish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Making Grilled Bluefish",
      "steps":[
        {
          "headline":"Preheat your grill for 10-20 minutes.",
          "description":"Gas grills are pretty easy to turn on and they take 10 minutes or so to heat up. Charcoal grills take about 20 minutes. It's best to use a chimney starter when lighting a charcoal grill as opposed to lighter fluid, since lighter fluid can impart a chemical flavor. Make sure the lid is open and when you're lighting the grill. Clean ashes from your charcoal grill before using it."
        },
        {
          "headline":"Scrub the grill with a brass-wire brush and oil it after.",
          "description":"When you've heated the grill, thoroughly scrub the grate with a brass-wire brush. Next, dip a paper towel in some canola or macadamia oil. Using a pair of tongs, grab the paper towel and rub it across the grate of the grill. You don't need to use a lot of oil. A small dab should do."
        },
        {
          "headline":"Sprinkle salt and pepper on your fillets.",
          "description":"It's all about personal preference when it comes to how much salt and pepper to season your fillets with. If you're unsure, 2 to 3 pinches of salt and 1 pinch of black pepper should do."
        },
        {
          "headline":"Coat the fillets with a tablespoon of olive oil.",
          "description":"You can either use a spoon to drizzle the oil over the fillets or you can use a pastry brush to gently smear the oil across the surface of the fillets. No matter which method you use, try to make sure the whole fish is evenly coated with the oil."
        },
        {
          "headline":"Drizzle some lemon juice on a plate.",
          "description":"When the fish is finished on the grill, you'll be placing it on a plate. By putting some lemon juice on the plate, you'll add flavor to your bluefish. The lemon will easily soak into the cooked bluefish. There's no need to soak the plate in lemon juice. All you need is a small drizzle across the plate. You don't want your fish to taste completely like citrus."
        },
        {
          "headline":"Place the fish on the grill skin side down and close the lid.",
          "description":"Cook the fish in the grill for 3 minutes without touching the lid. After 3 minutes, turn the heat down to medium, open the lid, and flip the fillets onto the flesh side. Close the lid again and cook the fillets for another 3 minutes for every inch of thickness in the fillets."
        },
        {
          "headline":"Test to see if the fish are done with a spatula.",
          "description":"Place the spatula under the fillet and lift the fillet up. If the flakes on the fillet separate, that means the fillets are cooked. If the flakes don't separate, cook the fillets for another couple of minutes. Don't worry if the fillet breaks. The skin will hold it together so the fillet will still look intact when you serve it."
        },
        {
          "headline":"Remove the fillets from the grill using tongs.",
          "description":"Keep the fillets skin side up when removing them from the grill to ensure they don't get soggy. Place the fillets on the plate you drizzled with lemon earlier."
        },
        {
          "headline":"Season the fillets with herbs and serve.",
          "description":"Sprinkle your parsley, cilantro, mint, or another herb onto the fillets. Once that's done, your bluefish is ready to serve. Refrigerate your cooked bluefish within 2 hours of cooking in shallow airtight containers. Consume the bluefish within 4 days."
        }
      ]
    },
    {
      "name":"Making Pan-Fried Bluefish",
      "steps":[
        {
          "headline":"Set up a dredging station.",
          "description":"Get large bowls or large containers and fill one with milk, one with flour, and one with cornmeal. You will be placing your fillets into these containers. They will allow you to properly coat your bluefish. Containers like the ones you get from Chinese restaurants are perfect for this. They're very useful for a lot of other things too, so keep them around the next time you get Chinese takeout."
        },
        {
          "headline":"Rinse your fillets and place them on paper towels to drain.",
          "description":"You don't need to thoroughly or rigorously rinse your fillets before using them. A gentle rinse under some cold water will do. Place them on a plate with paper towels after and give them some time to dry."
        },
        {
          "headline":"Place the fillets into the container with flour.",
          "description":"Plain flour is best for your first attempt at making bluefish fillets this way. Grab the fillets and place them gently into the flour, one at a time. Then flip each fillet over and cover the other side in flour too. Make sure both sides of each fillet are well covered before moving onto the next step. You can also use self-rising flour. It won't make a huge difference to the process,"
        },
        {
          "headline":"Dip the fillets into the milk container.",
          "description":"The process is more or less the same here. Dip each coated fillet into the milk and make sure both sides are well  covered by the milk before moving on. Some seafood restaurants will use evaporated milk to soak their seafood before they fry it. Evaporated milk is a bit thicker than other types of milk so it holds the breading in place better. You can just use any milk you have in the house."
        },
        {
          "headline":"Lay the fillets on a plate.",
          "description":"After you have dipped the fillets into the milk bath, lay them out on a plate, giving them time to dry. Don't use a paper towel this time as you don't want to drain the fillets of the milk coating. Don't lay the fillets on top of each other. Make sure you keep them separated."
        },
        {
          "headline":"Season the bluefish fillets.",
          "description":"Get your salt and sprinkle it over the bluefish very liberally. Salt helps bring out the flavor of the bluefish itself. It's up to you how much of the other seasonings you use. It's a good idea to use black pepper even if you decide to not use any of the other seasonings. If you want to add some spice to the bluefish, sprinkle some of your cayenne pepper on the fillets. You can use paprika as well to help add more flavor to the fillets and enhance their taste."
        },
        {
          "headline":"Put the seasoned fillets into the cornmeal container.",
          "description":"Once you've added all of your seasonings to the fillets, place them into your container full of cornmeal. Make sure you have coated both sides of the fillets in cornmeal before moving onto the next step. Shake off any excess cornmeal when finished. Excess cornmeal will burn in the pan and ruin the taste of the cooking oil. This will ruin the taste of your bluefish fillets. You can also add your seasonings into the cornmeal container and season your fillets by rolling them around in the cornmeal."
        },
        {
          "headline":"Heat up your frying pan and place the fillets on a plate.",
          "description":"While you're heating up the cooking oil in the frying pan, place your bluefish fillets on a plate for a few minutes. Pour in ⁄2 inch (1.3 cm) of oil into the frying pan."
        },
        {
          "headline":"Use tongs to place the fillets into the frying oil.",
          "description":"You can also use your hand but it's not a great idea to get your skin too close to hot oil. To be safe, use a pair of tongs and gently place the fillets into the frying pan. Don't add all of your fillets at once. They need space to properly cook so don't crowd the pan. Fry 2 or 3 fillets at a time."
        },
        {
          "headline":"Flip the fillets when the edges turn brown.",
          "description":"You can use your tongs again to flip the fillets or you can use a spatula or a fork. Once you've flipped the fillets, give them 2 more minutes in the pan."
        },
        {
          "headline":"Place the finished fillets on a plate with a paper towel.",
          "description":"Use multiple layers of paper towels to drain the fillets of oil more effectively. If you have to cook more fillets, turn your oven on at 200 °C (392 °F). Place the cooked fillets in it to keep them hot. Remove the paper towels before placing them in the oven. Once your fillets are cooked and drained, you can now serve them. Put your cooked bluefish in your fridge within 2 hours of cooking in shallow airtight containers. Consume the bluefish within 4 days."
        }
      ]
    },
    {
      "name":"Making Baked Bluefish",
      "steps":[
        {
          "headline":"Preheat your oven to 350 °F (177 °C).",
          "description":"It takes around 15 minutes to preheat an oven to this temperature. It might take longer or shorter depending on things like the age of the oven."
        },
        {
          "headline":"Cut a piece of foil that is large enough to cover your bluefish fillet.",
          "description":"If you're using a thin foil, use 2 or 3 layers of foil to cover your bluefish fillet. Anything other than heavy duty foil is thin. Place the foil in a roasting pan to heat it up."
        },
        {
          "headline":"Wash the bluefish fillets.",
          "description":"You don't need to be very rigorous when rinsing your bluefish fillets, just make sure they're clean. Gently rinse them under cold water for 30 seconds or so."
        },
        {
          "headline":"Season and garnish the fillet in the center of the foil.",
          "description":"Sprinkle 2 to 3 pinches of salt and 1 pinch of black pepper on the fillet. Once that's done, place your lemon slices along the fillet. Cut some squares of butter and arrange them on top of the lemon slices. Place your herbs on top of the butter and the lemon."
        },
        {
          "headline":"Create a tub shape with your foil.",
          "description":"To make sure there's no leakage from the foil in the oven, form the foil into a bathtub shape. Make sure there's no gaps in the bottom of the foil. If you want to be extra safe, you can cover your layers of foil with another layer to ensure there's no chance of leakage."
        },
        {
          "headline":"Pour your white wine and lemon juice onto the fillet.",
          "description":"You don't need to go overboard with the wine and lemon juice, a quick drizzle will do. When finished, double-check to make sure there's no gaps in the foil so the juices can't leak out."
        },
        {
          "headline":"Place the foil and fillet in the oven for 15-20 minutes.",
          "description":"After this time has passed, the fillet should be well cooked. Take the foil from the oven and carefully pry it oven. Gently lift the fillet from the foil and place it on a plate.Your fillets are now cooked and ready to be served. Put your cooked bluefish in your fridge within 2 hours of cooking in shallow airtight containers. Consume the bluefish within 4 days."
        }
      ]
    }
  ],
  "text":" Making Grilled Bluefish Preheat your grill for 10-20 minutes. Gas grills are pretty easy to turn on and they take 10 minutes or so to heat up. Charcoal grills take about 20 minutes. It's best to use a chimney starter when lighting a charcoal grill as opposed to lighter fluid, since lighter fluid can impart a chemical flavor. Make sure the lid is open and when you're lighting the grill. Clean ashes from your charcoal grill before using it. Scrub the grill with a brass-wire brush and oil it after. When you've heated the grill, thoroughly scrub the grate with a brass-wire brush. Next, dip a paper towel in some canola or macadamia oil. Using a pair of tongs, grab the paper towel and rub it across the grate of the grill. You don't need to use a lot of oil. A small dab should do. Sprinkle salt and pepper on your fillets. It's all about personal preference when it comes to how much salt and pepper to season your fillets with. If you're unsure, 2 to 3 pinches of salt and 1 pinch of black pepper should do. Coat the fillets with a tablespoon of olive oil. You can either use a spoon to drizzle the oil over the fillets or you can use a pastry brush to gently smear the oil across the surface of the fillets. No matter which method you use, try to make sure the whole fish is evenly coated with the oil. Drizzle some lemon juice on a plate. When the fish is finished on the grill, you'll be placing it on a plate. By putting some lemon juice on the plate, you'll add flavor to your bluefish. The lemon will easily soak into the cooked bluefish. There's no need to soak the plate in lemon juice. All you need is a small drizzle across the plate. You don't want your fish to taste completely like citrus. Place the fish on the grill skin side down and close the lid. Cook the fish in the grill for 3 minutes without touching the lid. After 3 minutes, turn the heat down to medium, open the lid, and flip the fillets onto the flesh side. Close the lid again and cook the fillets for another 3 minutes for every inch of thickness in the fillets. Test to see if the fish are done with a spatula. Place the spatula under the fillet and lift the fillet up. If the flakes on the fillet separate, that means the fillets are cooked. If the flakes don't separate, cook the fillets for another couple of minutes. Don't worry if the fillet breaks. The skin will hold it together so the fillet will still look intact when you serve it. Remove the fillets from the grill using tongs. Keep the fillets skin side up when removing them from the grill to ensure they don't get soggy. Place the fillets on the plate you drizzled with lemon earlier. Season the fillets with herbs and serve. Sprinkle your parsley, cilantro, mint, or another herb onto the fillets. Once that's done, your bluefish is ready to serve. Refrigerate your cooked bluefish within 2 hours of cooking in shallow airtight containers. Consume the bluefish within 4 days. Making Pan-Fried Bluefish Set up a dredging station. Get large bowls or large containers and fill one with milk, one with flour, and one with cornmeal. You will be placing your fillets into these containers. They will allow you to properly coat your bluefish. Containers like the ones you get from Chinese restaurants are perfect for this. They're very useful for a lot of other things too, so keep them around the next time you get Chinese takeout. Rinse your fillets and place them on paper towels to drain. You don't need to thoroughly or rigorously rinse your fillets before using them. A gentle rinse under some cold water will do. Place them on a plate with paper towels after and give them some time to dry. Place the fillets into the container with flour. Plain flour is best for your first attempt at making bluefish fillets this way. Grab the fillets and place them gently into the flour, one at a time. Then flip each fillet over and cover the other side in flour too. Make sure both sides of each fillet are well covered before moving onto the next step. You can also use self-rising flour. It won't make a huge difference to the process, Dip the fillets into the milk container. The process is more or less the same here. Dip each coated fillet into the milk and make sure both sides are well  covered by the milk before moving on. Some seafood restaurants will use evaporated milk to soak their seafood before they fry it. Evaporated milk is a bit thicker than other types of milk so it holds the breading in place better. You can just use any milk you have in the house. Lay the fillets on a plate. After you have dipped the fillets into the milk bath, lay them out on a plate, giving them time to dry. Don't use a paper towel this time as you don't want to drain the fillets of the milk coating. Don't lay the fillets on top of each other. Make sure you keep them separated. Season the bluefish fillets. Get your salt and sprinkle it over the bluefish very liberally. Salt helps bring out the flavor of the bluefish itself. It's up to you how much of the other seasonings you use. It's a good idea to use black pepper even if you decide to not use any of the other seasonings. If you want to add some spice to the bluefish, sprinkle some of your cayenne pepper on the fillets. You can use paprika as well to help add more flavor to the fillets and enhance their taste. Put the seasoned fillets into the cornmeal container. Once you've added all of your seasonings to the fillets, place them into your container full of cornmeal. Make sure you have coated both sides of the fillets in cornmeal before moving onto the next step. Shake off any excess cornmeal when finished. Excess cornmeal will burn in the pan and ruin the taste of the cooking oil. This will ruin the taste of your bluefish fillets. You can also add your seasonings into the cornmeal container and season your fillets by rolling them around in the cornmeal. Heat up your frying pan and place the fillets on a plate. While you're heating up the cooking oil in the frying pan, place your bluefish fillets on a plate for a few minutes. Pour in ⁄2 inch (1.3 cm) of oil into the frying pan. Use tongs to place the fillets into the frying oil. You can also use your hand but it's not a great idea to get your skin too close to hot oil. To be safe, use a pair of tongs and gently place the fillets into the frying pan. Don't add all of your fillets at once. They need space to properly cook so don't crowd the pan. Fry 2 or 3 fillets at a time. Flip the fillets when the edges turn brown. You can use your tongs again to flip the fillets or you can use a spatula or a fork. Once you've flipped the fillets, give them 2 more minutes in the pan. Place the finished fillets on a plate with a paper towel. Use multiple layers of paper towels to drain the fillets of oil more effectively. If you have to cook more fillets, turn your oven on at 200 °C (392 °F). Place the cooked fillets in it to keep them hot. Remove the paper towels before placing them in the oven. Once your fillets are cooked and drained, you can now serve them. Put your cooked bluefish in your fridge within 2 hours of cooking in shallow airtight containers. Consume the bluefish within 4 days. Making Baked Bluefish Preheat your oven to 350 °F (177 °C). It takes around 15 minutes to preheat an oven to this temperature. It might take longer or shorter depending on things like the age of the oven. Cut a piece of foil that is large enough to cover your bluefish fillet. If you're using a thin foil, use 2 or 3 layers of foil to cover your bluefish fillet. Anything other than heavy duty foil is thin. Place the foil in a roasting pan to heat it up. Wash the bluefish fillets. You don't need to be very rigorous when rinsing your bluefish fillets, just make sure they're clean. Gently rinse them under cold water for 30 seconds or so. Season and garnish the fillet in the center of the foil. Sprinkle 2 to 3 pinches of salt and 1 pinch of black pepper on the fillet. Once that's done, place your lemon slices along the fillet. Cut some squares of butter and arrange them on top of the lemon slices. Place your herbs on top of the butter and the lemon. Create a tub shape with your foil. To make sure there's no leakage from the foil in the oven, form the foil into a bathtub shape. Make sure there's no gaps in the bottom of the foil. If you want to be extra safe, you can cover your layers of foil with another layer to ensure there's no chance of leakage. Pour your white wine and lemon juice onto the fillet. You don't need to go overboard with the wine and lemon juice, a quick drizzle will do. When finished, double-check to make sure there's no gaps in the foil so the juices can't leak out. Place the foil and fillet in the oven for 15-20 minutes. After this time has passed, the fillet should be well cooked. Take the foil from the oven and carefully pry it oven. Gently lift the fillet from the foil and place it on a plate.Your fillets are now cooked and ready to be served. Put your cooked bluefish in your fridge within 2 hours of cooking in shallow airtight containers. Consume the bluefish within 4 days.",
  "tyn_model":[
    "foil",
    "plate",
    "grill",
    "lemon",
    "milk",
    "oven",
    "flour",
    "oil",
    "cornmeal",
    "salt",
    "paper towels",
    "frying pan",
    "black pepper",
    "spatula",
    "bluefish",
    "seasonings",
    "charcoal grill",
    "brass-wire brush",
    "paper towel",
    "salt and pepper",
    "lemon juice",
    "herbs",
    "airtight containers",
    "water",
    "evaporated milk",
    "cornmeal container",
    "cooking oil",
    "butter",
    "gas grills",
    "charcoal grills",
    "chimney starter",
    "lighter fluid",
    "canola or",
    "macadamia oil",
    "olive oil",
    "spoon",
    "pastry brush",
    "citrus",
    "fish",
    "parsley",
    "cilantro",
    "mint",
    "bowls",
    "self-rising",
    "cayenne pepper",
    "paprika",
    "frying oil",
    "fork",
    "pan",
    "roasting pan",
    "white wine",
    "wine"
  ],
  "tyn_section":[
    "Grilled Bluefish",
    "Gas or charcoal grill",
    "Chimney starter",
    "Tongs",
    "Brass-wire brush",
    "Paper towels",
    "Spatula",
    "Pan-fried Bluefish",
    "Large bowls or containers",
    "Frying pan",
    "Baked Bluefish",
    "Oven",
    "Foil, preferably heavy duty"
  ]
}