{
  "title":"How to Make a Cheese Omelette",
  "url":"https://www.wikihow.com/Make-a-Cheese-Omelette",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Omelets"
  ],
  "methods":[
    {
      "name":"Making a Basic Cheese Omelette",
      "steps":[
        {
          "headline":"Break two eggs into a bowl.",
          "description":"Make sure that the eggs are room temperature. Cold eggs can lead to a tough, over-cooked omelette."
        },
        {
          "headline":"Beat the eggs with a fork or whisk.",
          "description":"You want to break up the yolks until there are no strands or globs left. The mixture should be a little frothy. If you wish, you can add a pinch of salt and a dash of pepper at this point. Consider adding a few small pieces of cold butter to the beaten eggs. This will result in a richer, fluffier omelette. For a lighter, fluffier omelette, add a little bit of water to the egg mixture. The steam from the heating water will cause the eggs to fluff up when cooked."
        },
        {
          "headline":"Butter an 8-inch (20.32-centimeter) skillet.",
          "description":"Turn on your stove and set the heat to medium. Place the skillet on the burner and drop 2 teaspoons of butter or margarine onto the surface. Using the handle, tilt the skillet around until the entire surface is covered with the melting butter. This will prevent the eggs from sticking to the surface of the pan. If you do not have a skillet, you can use a non-stick frying pan instead."
        },
        {
          "headline":"Pour the egg mix onto the skillet.",
          "description":"Shake and tilt the skillet so that the egg mixture coats the bottom."
        },
        {
          "headline":"Continue spreading the egg around with a spatula.",
          "description":"As the top of the omelette begins to set, run your spatula around the edges of the omelette. Lift them up slightly to let the uncooked egg flow under the omelette."
        },
        {
          "headline":"Add the cheese just before the omelette finishes cooking.",
          "description":"When the omelette is still runny and shiny on top, sprinkle the cheese down the middle of it. The omelette will continue cooking after you fold it in half. If you wait until the omelette is fully-cooked! the result will be a very dry omelette. Consider adding some other ingredients as well, such as sliced up mushrooms, herbs, or bits of ham. Make sure that any ingredients you add are already cooked (with the exception of cheese and herbs). For more ideas, refer to the section in this article on adding variations to your omelette."
        },
        {
          "headline":"Fold the omelet in half.",
          "description":"Slide the spatula under one part of the omelette and lift, flipping the omelette over onto itself."
        },
        {
          "headline":"Finish cooking the omelette, then transfer it to a plate.",
          "description":"When the underside of the omelette starts to turn golden brown, take the skillet off the burner. Use a spatula to slide the omelette off the skillet and onto a plate."
        },
        {
          "headline":"Garnish and serve the omelette.",
          "description":"You can serve the omelette as it is, or you can garnish it with some herbs, such as chives, basil, oregano, or parsley. You can also serve it with a few slices of fried bacon or toast. Although omelettes are typically served for breakfast, you can eat yours for lunch or dinner as well!"
        }
      ]
    },
    {
      "name":"Baking an Omelette in the Oven",
      "steps":[
        {
          "headline":"Preheat your oven to 375°F (190°C).",
          "description":"Make sure that the baking rack is in the center of the even. Omelettes are usually fried, but if you have to feed a lot of people, baking them is the best way to go. Not only will you be making multiple servings all at once, but you also won't have to worry about the first batch of omelettes getting cold while you work on the others."
        },
        {
          "headline":"Prepare your baking dish.",
          "description":"Select a 9 by 13-inch (22.86 by 33.02-centimeter) baking dish. A glass or ceramic casserole dish will work the best. Lightly grease the inside of the dish with butter, making sure to cover the bottom and the sides."
        },
        {
          "headline":"Mix the eggs and milk together in a large bowl.",
          "description":"Break open 10 eggs into a bowl and pour in 2 cups (450 milliliters) of milk. Beat everything together with a whisk until the yolks are all broken, and the milk is combined with the eggs."
        },
        {
          "headline":"Chop the parsley.",
          "description":"Take a few sprigs of flat-leafed parsley and chop it into fine bits. You will need enough chopped parsley to fill ¼ cup (5 grams)."
        },
        {
          "headline":"Dice the cooked ham.",
          "description":"Using a sharp knife, cut the ham into long, horizontal strips. Then, cut across the strips vertically, making little cubes. You will need enough to fill 1 cup (150 grams). If the ham is not yet cooked, you will need to warm it up after you have chopped it. Simply scoop the ham into a dish and heat it in the microwave for a few seconds."
        },
        {
          "headline":"Add the cheese, ham, and parsley to the egg mixture.",
          "description":"Mix everything together with a whisk. Make sure that all of the ingredients are evenly distributed. If you do not have, or if you do not like Parmesan cheese, use Cheddar cheese instead and omit the parsley. Use chopped chives for garnish at the very end."
        },
        {
          "headline":"Pour the mixture into the baking dish.",
          "description":"Hold the bowl over the baking dish and tilt it, allowing the egg mixture to pour into the dish. You can use a spoon or spatula to help ease the mixture out of the bowl and spread it evenly."
        },
        {
          "headline":"Put the dish into the oven.",
          "description":"Do not cover the dish or wrap foil over the top. Let the omelette bake in the oven for 45 minutes."
        },
        {
          "headline":"Take the omelette out of the oven when it is finished.",
          "description":"You can tell if it is finished when the top is golden-brown. If you are still in doubt, stick a knife into the omelette and pull it out. If the knife comes out clean, the omelette is ready. Let the omelette cool for 5 minutes before serving it."
        },
        {
          "headline":"Serve the omelette.",
          "description":"Cut the omelette into squares, and use a spatula to transfer each square onto a plate. If you wish to add some color to the omelette, you may chop up one chive and sprinkle the pieces over the top."
        }
      ]
    },
    {
      "name":"Adding Variations to the Omelette",
      "steps":[
        {
          "headline":"Consider adding variations to your omelette.",
          "description":"A cheese omelette can be made using different types of cheese. It can also be enhanced with additional ingredients, such as mushrooms, herbs, and ham. What ever ingredients you add to the omelette will need to be already cooked, with the exception of herbs and cheese. This section will give you some recipe variations and ideas."
        },
        {
          "headline":"Use different types of cheese.",
          "description":"You can experiment using different types of cheese in your omelette, such as Feta cheese and Parmesan cheese. Keep in mind, however, that different types of cheese pair better with different types of ingredients. Here are some examples:\nFeta cheese pairs best with tomatoes, spinach, and broccoli. Parmesan cheese works best with ham, onions, and mushrooms. Cheddar cheese works well with almost anything, but especially bacon, ham, and tomatoes."
        },
        {
          "headline":"Limit your ingredients.",
          "description":"When choosing your ingredients, try not to add too many; this may cause the omelette to fall apart when you try to fold it or move it to a plate. Instead, consider limiting yourself to two or three extra ingredients (excluding the eggs and seasoning)."
        },
        {
          "headline":"Add some color to your omelette with tomatoes and spring onion.",
          "description":"Dice 1 tomato and mix it with ½ tablespoon of olive oil, 1 tablespoon of Cheddar cheese, 3 chopped basil leaves, and 1 chopped spring onion. Grease your skillet with ½ tablespoon of olive oil, and fry your omelette as usual. Once it begins to set, add the tomato and cheese mixture on top, and fold it over. Let the omelette cook for 30 more seconds before removing it from the heat and serving it."
        },
        {
          "headline":"Make a ham and cheese omelette.",
          "description":"Cook your omelette as usual, but add a slice of finely-chopped ham to the cheese mixture. After you fold the omelette in half, but before your serve it, garnish it with a sprinkle of chopped up ham."
        },
        {
          "headline":"Add sliced mushrooms to the omelette.",
          "description":"Heat a handful of sliced mushrooms in 1 tablespoon of olive oil for 2 to 3 minutes, or until the mushrooms are golden-brown. Scoop the mushrooms from the pan and mix then with ¼ cup (25 grams) of grated Cheddar cheese and chopped parsley. Cook your omelette as normal, and add sprinkle the cheese-parsley-mushroom mixture. down the middle before folding it in half and serving it."
        }
      ]
    }
  ],
  "text":" Making a Basic Cheese Omelette Break two eggs into a bowl. Make sure that the eggs are room temperature. Cold eggs can lead to a tough, over-cooked omelette. Beat the eggs with a fork or whisk. You want to break up the yolks until there are no strands or globs left. The mixture should be a little frothy. If you wish, you can add a pinch of salt and a dash of pepper at this point. Consider adding a few small pieces of cold butter to the beaten eggs. This will result in a richer, fluffier omelette. For a lighter, fluffier omelette, add a little bit of water to the egg mixture. The steam from the heating water will cause the eggs to fluff up when cooked. Butter an 8-inch (20.32-centimeter) skillet. Turn on your stove and set the heat to medium. Place the skillet on the burner and drop 2 teaspoons of butter or margarine onto the surface. Using the handle, tilt the skillet around until the entire surface is covered with the melting butter. This will prevent the eggs from sticking to the surface of the pan. If you do not have a skillet, you can use a non-stick frying pan instead. Pour the egg mix onto the skillet. Shake and tilt the skillet so that the egg mixture coats the bottom. Continue spreading the egg around with a spatula. As the top of the omelette begins to set, run your spatula around the edges of the omelette. Lift them up slightly to let the uncooked egg flow under the omelette. Add the cheese just before the omelette finishes cooking. When the omelette is still runny and shiny on top, sprinkle the cheese down the middle of it. The omelette will continue cooking after you fold it in half. If you wait until the omelette is fully-cooked! the result will be a very dry omelette. Consider adding some other ingredients as well, such as sliced up mushrooms, herbs, or bits of ham. Make sure that any ingredients you add are already cooked (with the exception of cheese and herbs). For more ideas, refer to the section in this article on adding variations to your omelette. Fold the omelet in half. Slide the spatula under one part of the omelette and lift, flipping the omelette over onto itself. Finish cooking the omelette, then transfer it to a plate. When the underside of the omelette starts to turn golden brown, take the skillet off the burner. Use a spatula to slide the omelette off the skillet and onto a plate. Garnish and serve the omelette. You can serve the omelette as it is, or you can garnish it with some herbs, such as chives, basil, oregano, or parsley. You can also serve it with a few slices of fried bacon or toast. Although omelettes are typically served for breakfast, you can eat yours for lunch or dinner as well! Baking an Omelette in the Oven Preheat your oven to 375°F (190°C). Make sure that the baking rack is in the center of the even. Omelettes are usually fried, but if you have to feed a lot of people, baking them is the best way to go. Not only will you be making multiple servings all at once, but you also won't have to worry about the first batch of omelettes getting cold while you work on the others. Prepare your baking dish. Select a 9 by 13-inch (22.86 by 33.02-centimeter) baking dish. A glass or ceramic casserole dish will work the best. Lightly grease the inside of the dish with butter, making sure to cover the bottom and the sides. Mix the eggs and milk together in a large bowl. Break open 10 eggs into a bowl and pour in 2 cups (450 milliliters) of milk. Beat everything together with a whisk until the yolks are all broken, and the milk is combined with the eggs. Chop the parsley. Take a few sprigs of flat-leafed parsley and chop it into fine bits. You will need enough chopped parsley to fill ¼ cup (5 grams). Dice the cooked ham. Using a sharp knife, cut the ham into long, horizontal strips. Then, cut across the strips vertically, making little cubes. You will need enough to fill 1 cup (150 grams). If the ham is not yet cooked, you will need to warm it up after you have chopped it. Simply scoop the ham into a dish and heat it in the microwave for a few seconds. Add the cheese, ham, and parsley to the egg mixture. Mix everything together with a whisk. Make sure that all of the ingredients are evenly distributed. If you do not have, or if you do not like Parmesan cheese, use Cheddar cheese instead and omit the parsley. Use chopped chives for garnish at the very end. Pour the mixture into the baking dish. Hold the bowl over the baking dish and tilt it, allowing the egg mixture to pour into the dish. You can use a spoon or spatula to help ease the mixture out of the bowl and spread it evenly. Put the dish into the oven. Do not cover the dish or wrap foil over the top. Let the omelette bake in the oven for 45 minutes. Take the omelette out of the oven when it is finished. You can tell if it is finished when the top is golden-brown. If you are still in doubt, stick a knife into the omelette and pull it out. If the knife comes out clean, the omelette is ready. Let the omelette cool for 5 minutes before serving it. Serve the omelette. Cut the omelette into squares, and use a spatula to transfer each square onto a plate. If you wish to add some color to the omelette, you may chop up one chive and sprinkle the pieces over the top. Adding Variations to the Omelette Consider adding variations to your omelette. A cheese omelette can be made using different types of cheese. It can also be enhanced with additional ingredients, such as mushrooms, herbs, and ham. What ever ingredients you add to the omelette will need to be already cooked, with the exception of herbs and cheese. This section will give you some recipe variations and ideas. Use different types of cheese. You can experiment using different types of cheese in your omelette, such as Feta cheese and Parmesan cheese. Keep in mind, however, that different types of cheese pair better with different types of ingredients. Here are some examples:\nFeta cheese pairs best with tomatoes, spinach, and broccoli. Parmesan cheese works best with ham, onions, and mushrooms. Cheddar cheese works well with almost anything, but especially bacon, ham, and tomatoes. Limit your ingredients. When choosing your ingredients, try not to add too many; this may cause the omelette to fall apart when you try to fold it or move it to a plate. Instead, consider limiting yourself to two or three extra ingredients (excluding the eggs and seasoning). Add some color to your omelette with tomatoes and spring onion. Dice 1 tomato and mix it with ½ tablespoon of olive oil, 1 tablespoon of Cheddar cheese, 3 chopped basil leaves, and 1 chopped spring onion. Grease your skillet with ½ tablespoon of olive oil, and fry your omelette as usual. Once it begins to set, add the tomato and cheese mixture on top, and fold it over. Let the omelette cook for 30 more seconds before removing it from the heat and serving it. Make a ham and cheese omelette. Cook your omelette as usual, but add a slice of finely-chopped ham to the cheese mixture. After you fold the omelette in half, but before your serve it, garnish it with a sprinkle of chopped up ham. Add sliced mushrooms to the omelette. Heat a handful of sliced mushrooms in 1 tablespoon of olive oil for 2 to 3 minutes, or until the mushrooms are golden-brown. Scoop the mushrooms from the pan and mix then with ¼ cup (25 grams) of grated Cheddar cheese and chopped parsley. Cook your omelette as normal, and add sprinkle the cheese-parsley-mushroom mixture. down the middle before folding it in half and serving it.",
  "tyn_model":[
    "cheese",
    "ham",
    "eggs",
    "skillet",
    "mushrooms",
    "spatula",
    "parsley",
    "oven",
    "bowl",
    "butter",
    "baking dish",
    "cheddar cheese",
    "whisk",
    "herbs",
    "plate",
    "milk",
    "knife",
    "dish",
    "tomatoes",
    "olive oil",
    "water",
    "chives",
    "basil",
    "parmesan cheese",
    "tomato",
    "fork",
    "salt",
    "pepper",
    "cold butter",
    "stove",
    "margarine",
    "non-stick frying pan",
    "egg",
    "bacon",
    "baking rack",
    "large bowl",
    "flat-leafed parsley",
    "microwave",
    "spoon",
    "foil",
    "chive",
    "feta cheese",
    "spinach",
    "broccoli"
  ],
  "tyn_section":[
    "8-inch (20.32-centimeter) skillet or non-stick frying pan (frying method)",
    "9 by 13-inch (22.86 by 33.02-centimeter) baking dish (oven method)",
    "Bowl",
    "Fork or whisk",
    "Spatula"
  ]
}