{
  "title":"How to Prune a Spider Plant",
  "url":"https://www.wikihow.com/Prune-a-Spider-Plant",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "methods":[
    {
      "name":"Pruning to Maintain a Healthy Plant",
      "steps":[
        {
          "headline":"Use a household cleanser to sterilize your pruning shears.",
          "description":"Spray or wipe the cutting blades of your pruning shears with a standard household cleanser or rubbing alcohol. Dry the blades completely once you've finished sterilizing them. While you can use a 10% bleach solution, the bleach will corrode the blades on your shears if you regularly use it on the shears. If you'd like a natural product, use a mild household cleanser. You can also use rubbing alcohol or white vinegar."
        },
        {
          "headline":"Cut away any leaves that are brown or yellow.",
          "description":"Take your clean shears and cut off damaged leaves near the center of the spider plant. Avoid simply cutting off the brown part of the leaf, since this will leave an open wound on the leaf. If the leaves aren't a healthy green, the plant may be getting too much sunlight. Move the plant to an area where it gets 4 to 6 hours of sunlight. Tap water with too much fluoride or chlorine can also damage the leaves. Consider filtering the water or using distilled water."
        },
        {
          "headline":"Prune foliage at the base of the plant if it becomes overgrown.",
          "description":"Spider plants usually grow around 12 in (30 cm) in diameter and 12 in (30 cm) tall. If your plant is getting too large for its space, cut away healthy, growing leaves near the base of the plant until you've removed some of the excess growth. You may want to re-pot overgrown plants. Choose a container that's a 3 to 4 in (7.5 to 10 cm) larger in diameter."
        },
        {
          "headline":"Trim the roots of the spider plant if it becomes root bound.",
          "description":"If the leaves on your spider plant continue to turn yellow, tip the plant out of its pot to check its roots. Use your shears to prune the roots by trimming away the outer sides and bottom of the roots. Try to remove about 1 in (2.5 cm) of roots so your plant will have more space and soil when you put it back in the pot. Remember to add new soil to the pot so your plant gets enough nutrients. Ensure the soil stays moist and the plant is protected from direct sunlight while it's recovering from the pruning. Being rootbound means that the plant's roots have taken up all the space inside the pot, meaning that the plant won't grow anymore until you prune it."
        },
        {
          "headline":"Do a regular pruning in the spring.",
          "description":"Spider plants that thrive can grow out of their containers and begin trailing over the sides. If your plant is 2 to 3 feet (60 to 90 cm), consider pruning it annually. If you do a severe prune, you can go a few years in between pruning. Consider doing root pruning every 2 years or so if your spider plants are growing a lot of foliage."
        }
      ]
    },
    {
      "name":"Removing and Propagating the Baby Plants",
      "steps":[
        {
          "headline":"Plan to propagate when there are lots of baby plants.",
          "description":"As your spider plant grows, it will send off little baby shoots that look like smaller versions of the parent plant. If too many baby spider plants grow off the plant, the main plant will droop over to the side. To keep the main plant growing strong, remove and propagate the baby plants or discard them."
        },
        {
          "headline":"Prune the stem between the baby and main spider plant.",
          "description":"If you want to remove some of the baby plants that are growing off of the main plant, take your shears and cut the baby stem near the base of the main plant. Discard the baby plant or trim the stem and propagate the baby plant."
        },
        {
          "headline":"Plant the baby spider plants in separate containers.",
          "description":"Choose baby spider plants that have roots growing at their base and set the root of one of the plants into a new container filled with soil. The container should have holes at the bottom for good drainage and be 4 to 5 in (10 to 12.5 cm) larger than the width of the baby plant. Press well-draining soil around the base of the plant. If the baby plants don't have roots, put them in a container with water. Keep them in the water until they sprout roots. Replace the water in the container every few days, or when it becomes oily or dirty."
        },
        {
          "headline":"Water the new spider plant until water runs out of the bottom.",
          "description":"It's important to thoroughly soak the roots of the baby spider plant in its new pot. Water it frequently to keep the soil moist. They should take root and start growing within a few weeks. After a few weeks, the new spider plant should put on new growth. Let the soil dry out a bit in between watering."
        }
      ]
    }
  ],
  "text":" Pruning to Maintain a Healthy Plant Use a household cleanser to sterilize your pruning shears. Spray or wipe the cutting blades of your pruning shears with a standard household cleanser or rubbing alcohol. Dry the blades completely once you've finished sterilizing them. While you can use a 10% bleach solution, the bleach will corrode the blades on your shears if you regularly use it on the shears. If you'd like a natural product, use a mild household cleanser. You can also use rubbing alcohol or white vinegar. Cut away any leaves that are brown or yellow. Take your clean shears and cut off damaged leaves near the center of the spider plant. Avoid simply cutting off the brown part of the leaf, since this will leave an open wound on the leaf. If the leaves aren't a healthy green, the plant may be getting too much sunlight. Move the plant to an area where it gets 4 to 6 hours of sunlight. Tap water with too much fluoride or chlorine can also damage the leaves. Consider filtering the water or using distilled water. Prune foliage at the base of the plant if it becomes overgrown. Spider plants usually grow around 12 in (30 cm) in diameter and 12 in (30 cm) tall. If your plant is getting too large for its space, cut away healthy, growing leaves near the base of the plant until you've removed some of the excess growth. You may want to re-pot overgrown plants. Choose a container that's a 3 to 4 in (7.5 to 10 cm) larger in diameter. Trim the roots of the spider plant if it becomes root bound. If the leaves on your spider plant continue to turn yellow, tip the plant out of its pot to check its roots. Use your shears to prune the roots by trimming away the outer sides and bottom of the roots. Try to remove about 1 in (2.5 cm) of roots so your plant will have more space and soil when you put it back in the pot. Remember to add new soil to the pot so your plant gets enough nutrients. Ensure the soil stays moist and the plant is protected from direct sunlight while it's recovering from the pruning. Being rootbound means that the plant's roots have taken up all the space inside the pot, meaning that the plant won't grow anymore until you prune it. Do a regular pruning in the spring. Spider plants that thrive can grow out of their containers and begin trailing over the sides. If your plant is 2 to 3 feet (60 to 90 cm), consider pruning it annually. If you do a severe prune, you can go a few years in between pruning. Consider doing root pruning every 2 years or so if your spider plants are growing a lot of foliage. Removing and Propagating the Baby Plants Plan to propagate when there are lots of baby plants. As your spider plant grows, it will send off little baby shoots that look like smaller versions of the parent plant. If too many baby spider plants grow off the plant, the main plant will droop over to the side. To keep the main plant growing strong, remove and propagate the baby plants or discard them. Prune the stem between the baby and main spider plant. If you want to remove some of the baby plants that are growing off of the main plant, take your shears and cut the baby stem near the base of the main plant. Discard the baby plant or trim the stem and propagate the baby plant. Plant the baby spider plants in separate containers. Choose baby spider plants that have roots growing at their base and set the root of one of the plants into a new container filled with soil. The container should have holes at the bottom for good drainage and be 4 to 5 in (10 to 12.5 cm) larger than the width of the baby plant. Press well-draining soil around the base of the plant. If the baby plants don't have roots, put them in a container with water. Keep them in the water until they sprout roots. Replace the water in the container every few days, or when it becomes oily or dirty. Water the new spider plant until water runs out of the bottom. It's important to thoroughly soak the roots of the baby spider plant in its new pot. Water it frequently to keep the soil moist. They should take root and start growing within a few weeks. After a few weeks, the new spider plant should put on new growth. Let the soil dry out a bit in between watering.",
  "sentences":[
    " Pruning to Maintain a Healthy Plant Use a household cleanser to sterilize your pruning shears.",
    "Spray or wipe the cutting blades of your pruning shears with a standard household cleanser or rubbing alcohol.",
    "Dry the blades completely once you've finished sterilizing them.",
    "While you can use a 10% bleach solution, the bleach will corrode the blades on your shears if you regularly use it on the shears.",
    "If you'd like a natural product, use a mild household cleanser.",
    "You can also use rubbing alcohol or white vinegar.",
    "Cut away any leaves that are brown or yellow.",
    "Take your clean shears and cut off damaged leaves near the center of the spider plant.",
    "Avoid simply cutting off the brown part of the leaf, since this will leave an open wound on the leaf.",
    "If the leaves aren't a healthy green, the plant may be getting too much sunlight.",
    "Move the plant to an area where it gets 4 to 6 hours of sunlight.",
    "Tap water with too much fluoride or chlorine can also damage the leaves.",
    "Consider filtering the water or using distilled water.",
    "Prune foliage at the base of the plant if it becomes overgrown.",
    "Spider plants usually grow around 12 in (30 cm) in diameter and 12 in (30 cm) tall.",
    "If your plant is getting too large for its space, cut away healthy, growing leaves near the base of the plant until you've removed some of the excess growth.",
    "You may want to re-pot overgrown plants.",
    "Choose a container that's a 3 to 4 in (7.5 to 10 cm) larger in diameter.",
    "Trim the roots of the spider plant if it becomes root bound.",
    "If the leaves on your spider plant continue to turn yellow, tip the plant out of its pot to check its roots.",
    "Use your shears to prune the roots by trimming away the outer sides and bottom of the roots.",
    "Try to remove about 1 in (2.5 cm) of roots so your plant will have more space and soil when you put it back in the pot.",
    "Remember to add new soil to the pot so your plant gets enough nutrients.",
    "Ensure the soil stays moist and the plant is protected from direct sunlight while it's recovering from the pruning.",
    "Being rootbound means that the plant's roots have taken up all the space inside the pot, meaning that the plant won't grow anymore until you prune it.",
    "Do a regular pruning in the spring.",
    "Spider plants that thrive can grow out of their containers and begin trailing over the sides.",
    "If your plant is 2 to 3 feet (60 to 90 cm), consider pruning it annually.",
    "If you do a severe prune, you can go a few years in between pruning.",
    "Consider doing root pruning every 2 years or so if your spider plants are growing a lot of foliage.",
    "Removing and Propagating the Baby Plants Plan to propagate when there are lots of baby plants.",
    "As your spider plant grows, it will send off little baby shoots that look like smaller versions of the parent plant.",
    "If too many baby spider plants grow off the plant, the main plant will droop over to the side.",
    "To keep the main plant growing strong, remove and propagate the baby plants or discard them.",
    "Prune the stem between the baby and main spider plant.",
    "If you want to remove some of the baby plants that are growing off of the main plant, take your shears and cut the baby stem near the base of the main plant.",
    "Discard the baby plant or trim the stem and propagate the baby plant.",
    "Plant the baby spider plants in separate containers.",
    "Choose baby spider plants that have roots growing at their base and set the root of one of the plants into a new container filled with soil.",
    "The container should have holes at the bottom for good drainage and be 4 to 5 in (10 to 12.5 cm) larger than the width of the baby plant.",
    "Press well-draining soil around the base of the plant.",
    "If the baby plants don't have roots, put them in a container with water.",
    "Keep them in the water until they sprout roots.",
    "Replace the water in the container every few days, or when it becomes oily or dirty.",
    "Water the new spider plant until water runs out of the bottom.",
    "It's important to thoroughly soak the roots of the baby spider plant in its new pot.",
    "Water it frequently to keep the soil moist.",
    "They should take root and start growing within a few weeks.",
    "After a few weeks, the new spider plant should put on new growth.",
    "Let the soil dry out a bit in between watering."
  ],
  "tyn_section":[
    "Pruning shears",
    "Rubbing alcohol or 10% bleach solution",
    "New container with soil (optional)"
  ],
  "tyn_model":[
    "water",
    "shears",
    "pot",
    "household cleanser",
    "container",
    "pruning shears",
    "rubbing alcohol",
    "soil",
    "bleach",
    "white vinegar",
    "distilled water",
    "containers"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0833333333,
    "f1":0.1333333333,
    "avg_pos":0.4166666667
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1666666667,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.25,
    "f1":0.3636363636
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0833333333,
    "f1":0.1333333333
  }
}