{
  "title":"How to Make Water Slime",
  "url":"https://www.wikihow.com/Make-Water-Slime",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Putty Dough and Slime"
  ],
  "methods":[
    {
      "name":"Clear Slime with Borax",
      "steps":[
        {
          "headline":"Mix ⁄2 cup (120 mL) of water and ⁄2 cup (120 mL) of clear glue in a bowl.",
          "description":"Use a measuring cup to measure out ⁄2 cup (120 mL) of clear school glue and pour it into a medium-sized bowl. Then, measure out ⁄2 cup (120 mL) of water and pour it over the glue in the bowl. Stir the 2 ingredients thoroughly with a spoon until they're fully mixed together. Most bottles of school glue contain 4 ounces (120 mL), which amounts to ⁄2 cup (120 mL). If your glue says 4 ounces on the packaging, you can just empty out the whole bottle into the bowl! You can double the recipe and use 1 cup (240 mL) of clear glue and 1 cup (240 mL) of water. Do not use white school glue! Using clear PVA glue is the key to making this slime clear."
        },
        {
          "headline":"Add 1-3 drops of blue food coloring if you want to make blue water slime.",
          "description":"Real water is clear, but you can tint your slime to look blue if you want a dramatic look. Your slime will still be see-through if you add food coloring, but it won't be crystal clear. If you want this, stir in 1-3 drops of blue food coloring with a spoon. If you don't have blue food coloring on hand, then try 1-3 drops of liquid watercolor paint instead. Don't use acrylic paint, because you'll end up with slime that isn't see-through.Tip: Experiment with combinations to create custom colors for your slime! For example, you could add 1 drop of green food coloring and 2 drops of blue food coloring to create a pretty teal color."
        },
        {
          "headline":"Mix 1/4 teaspoon (1.4 g) of Borax with ⁄2 cup (120 mL) of warm water.",
          "description":"Get out a separate bowl to make the Borax solution. Then, measure out ⁄2 cup (120 mL) of warm water from your tap and pour it in the clean bowl. Use a spoon to stir in 1/4 teaspoon (1.4 g) of Borax powder. Mix them together until the Borax completely dissolves. Be sure to use warm water! If you use room temperature water, the Borax won't dissolve. If you're doubling the recipe, use 1 cup (240 mL) of warm water and 1/2 teaspoon (2.8 g) of Borax powder. Keep in mind that Borax can cause skin, eye, and lung irritation. Handle the concentrated powder carefully and keep it out of the reach of small children."
        },
        {
          "headline":"Pour the Borax solution into the bowl of glue solution and stir well.",
          "description":"Mix the 2 solutions together with a spoon until the mixture begins to thicken. Keep stirring the mixture until it starts to leave the sides of the bowl. Don't worry if there's still Borax water left in the bowl. As long as the glue clumps together, you're all set to go. Don't whisk or whip the slime with the spoon as you stir it, or you'll introduce air bubbles. Air bubbles will make ruin the crystal clear look you're going for."
        },
        {
          "headline":"Pull the slime out of the bowl and knead it with your hands.",
          "description":"Continue to knead the slime until it comes together. The more you knead, the firmer and less-sticky it will become. Knead the slime for about 3 minutes. If there are any bubbles in the slime, let it sit in a plastic container for a few hours; they should disappear over time."
        },
        {
          "headline":"Keep the slime in an airtight container when you're not using it.",
          "description":"This type of slime is pretty oozy! A plastic container with a tight-fitting lid is the best storage option, but a plastic freezer bag will also work. Store the slime at room temperature. Make sure that your hands are clean before you play with the slime to keep it looking clear. If you store it properly in an airtight container, this type of slime should last at least 1 week, if not longer."
        }
      ]
    },
    {
      "name":"Clear Slime with Saline Solution",
      "steps":[
        {
          "headline":"Mix ⁄2 cup (120 mL) of clear glue and ⁄4 cup (59 mL) of water in a bowl.",
          "description":"Measure out ⁄2 cup (120 mL) of clear school glue and pour it into a bowl. Add ⁄4 cup (59 mL) of water, then stir it in with a spoon. Keep stirring until the water is completely mixed in and the texture is consistent.Tip: Add 1 to 2 drops of blue food coloring if you want \"ocean water\" slime!"
        },
        {
          "headline":"Stir in 1½ tablespoons (22.5 mL) of saline solution and set the slime aside.",
          "description":"Make sure that the saline solution contains both boric acid and sodium borate; otherwise, the glue won't turn into slime. Once you stir in the saline solution with a spoon, set the mixture aside."
        },
        {
          "headline":"Mix 1/2 teaspoon (6 g) of baking soda and 1 cup (240 mL) of warm water in a separate bowl.",
          "description":"Pour 1 cup (240 mL) of warm water into a glass, then add 1/2 teaspoon (6 g) of baking soda. Stir them together with a spoon until the baking soda dissolves, then set the glass aside so that the water can cool down. Be sure to use baking soda and not baking powder! They're not the same thing."
        },
        {
          "headline":"Combine the glue mixture with the baking soda mixture and stir gently.",
          "description":"Pour the glue-saline solution into the baking soda water solution; it will automatically come together into a glob. Give the mixture a few stirs with a spoon. The baking soda water activates the slime."
        },
        {
          "headline":"Pull the glob out of the water and knead it to firm it up.",
          "description":"There will be a lot of water leftover in the bowl, which is fine and normal! Just take the glob out of the water and knead it between your fingers for a few minutes until it thickens up and reaches a slime-like consistency. Discard the leftover baking soda water when you are done."
        },
        {
          "headline":"Store the slime in an airtight container when you're not playing with it.",
          "description":"After about a week, the consistency of the slime may start to change, but it could last longer than that. Make sure that your hands are clean when you play with the slime, or it'll get dirty!"
        }
      ]
    },
    {
      "name":"Jiggly Slime with Shampoo and Water",
      "steps":[
        {
          "headline":"Pour ⁄2 cup (120 mL) of clear, thick shampoo into a bowl.",
          "description":"The color of the shampoo is up to you, but clear will look the most water-like. Choose a shampoo with a thick, gel-like consistency. Avoid shampoo that has a thin, watery consistency."
        },
        {
          "headline":"Add 1-2 drops of food coloring if you want to make ocean slime.",
          "description":"You may want to skip this if your shampoo is already colored, or you can experiment with mixing colors. For example, you could add blue food coloring to yellow shampoo to make green slime. A little bit goes a long way, so 1-2 drops is all you need. If you don't have food coloring, use 2-3 drops of liquid watercolor paint."
        },
        {
          "headline":"Stir ⁄2 cup (120 mL) of water into the bowl of shampoo with a spoon.",
          "description":"The water will make the consistency thin at first, but the longer you stir it, the thicker it will get. Keep stirring the ingredients until the shampoo regains its original thick consistency. You can use less water if you want thicker slime, or more water if you want thinner slime. Don't stir too hard or too fast to prevent bubbles from forming."
        },
        {
          "headline":"Transfer the slime to an airtight container and refrigerate it for 2 days.",
          "description":"Do not touch or play with the slime during this time. As the mixture chills in the fridge, it will harden into slime! You can try speeding the process up by putting the slime into the freezer for 3-4 hours, but the results may not be as good."
        },
        {
          "headline":"Keep the slime in its container when you're not using it.",
          "description":"Because this slime contains very simple ingredients, it probably won't last for more than 2-3 days. If it starts to lose it's texture, you could try revitalizing it by stirring it back up again, then putting it back into the fridge for 2 days. If the slime starts to get too runny while you're playing with it, try putting it back into the fridge or freezer for a few hours, and see if that helps."
        }
      ]
    },
    {
      "name":"Easy Slime with Cornstarch and Water",
      "steps":[
        {
          "headline":"Put 1 cup (128 g) of dry cornstarch into a medium-sized bowl.",
          "description":"Use a measuring cup to measure out the cornstarch. Dump the cornstarch into a mixing bowl. Use a spoon to break up any clumps of cornstarch in the bowl."
        },
        {
          "headline":"Pour ⁄2 cup (120 mL) of warm water into the bowl and stir the mixture.",
          "description":"You'll be adding warm water little by little to create the consistency you want. You can just go to the tap with a glass and fill it with warm water. Start adding water to the bowl with a quick splash, say about 1 tablespoon (15 mL) of warm water. Stir the cornstarch and water together thoroughly with a spoon. As you stir, you will notice the mixture thickening. Warm water will prevent the cornstarch from clumping."
        },
        {
          "headline":"Add 1-2 drops of food coloring, if desired.",
          "description":"If you want to make colored slime, go ahead and add the food coloring of your choice to the mixture. You only need 1-2 drops, but you can experiment with adding more or less to achieve the exact shade that you want."
        },
        {
          "headline":"Keep stirring with a spoon and adding water until the mixture gets thick and slime-like.",
          "description":"The exact consistency is up to you, just make sure your slime is thick enough to hold together! If the slime feels too thin, add a little bit of cornstarch and keep stirring. If the slime feels too thick, add a little more water."
        },
        {
          "headline":"Scoop out the slime and play with it!",
          "description":"The gooey texture of this slime makes it super fun to play with. After you're done playing with it, store the slime in a plastic baggie with a zippered top to keep it moist. You can toss out the slime once it starts to look dirty."
        }
      ]
    }
  ],
  "text":" Clear Slime with Borax Mix ⁄2 cup (120 mL) of water and ⁄2 cup (120 mL) of clear glue in a bowl. Use a measuring cup to measure out ⁄2 cup (120 mL) of clear school glue and pour it into a medium-sized bowl. Then, measure out ⁄2 cup (120 mL) of water and pour it over the glue in the bowl. Stir the 2 ingredients thoroughly with a spoon until they're fully mixed together. Most bottles of school glue contain 4 ounces (120 mL), which amounts to ⁄2 cup (120 mL). If your glue says 4 ounces on the packaging, you can just empty out the whole bottle into the bowl! You can double the recipe and use 1 cup (240 mL) of clear glue and 1 cup (240 mL) of water. Do not use white school glue! Using clear PVA glue is the key to making this slime clear. Add 1-3 drops of blue food coloring if you want to make blue water slime. Real water is clear, but you can tint your slime to look blue if you want a dramatic look. Your slime will still be see-through if you add food coloring, but it won't be crystal clear. If you want this, stir in 1-3 drops of blue food coloring with a spoon. If you don't have blue food coloring on hand, then try 1-3 drops of liquid watercolor paint instead. Don't use acrylic paint, because you'll end up with slime that isn't see-through.Tip: Experiment with combinations to create custom colors for your slime! For example, you could add 1 drop of green food coloring and 2 drops of blue food coloring to create a pretty teal color. Mix 1/4 teaspoon (1.4 g) of Borax with ⁄2 cup (120 mL) of warm water. Get out a separate bowl to make the Borax solution. Then, measure out ⁄2 cup (120 mL) of warm water from your tap and pour it in the clean bowl. Use a spoon to stir in 1/4 teaspoon (1.4 g) of Borax powder. Mix them together until the Borax completely dissolves. Be sure to use warm water! If you use room temperature water, the Borax won't dissolve. If you're doubling the recipe, use 1 cup (240 mL) of warm water and 1/2 teaspoon (2.8 g) of Borax powder. Keep in mind that Borax can cause skin, eye, and lung irritation. Handle the concentrated powder carefully and keep it out of the reach of small children. Pour the Borax solution into the bowl of glue solution and stir well. Mix the 2 solutions together with a spoon until the mixture begins to thicken. Keep stirring the mixture until it starts to leave the sides of the bowl. Don't worry if there's still Borax water left in the bowl. As long as the glue clumps together, you're all set to go. Don't whisk or whip the slime with the spoon as you stir it, or you'll introduce air bubbles. Air bubbles will make ruin the crystal clear look you're going for. Pull the slime out of the bowl and knead it with your hands. Continue to knead the slime until it comes together. The more you knead, the firmer and less-sticky it will become. Knead the slime for about 3 minutes. If there are any bubbles in the slime, let it sit in a plastic container for a few hours; they should disappear over time. Keep the slime in an airtight container when you're not using it. This type of slime is pretty oozy! A plastic container with a tight-fitting lid is the best storage option, but a plastic freezer bag will also work. Store the slime at room temperature. Make sure that your hands are clean before you play with the slime to keep it looking clear. If you store it properly in an airtight container, this type of slime should last at least 1 week, if not longer. Clear Slime with Saline Solution Mix ⁄2 cup (120 mL) of clear glue and ⁄4 cup (59 mL) of water in a bowl. Measure out ⁄2 cup (120 mL) of clear school glue and pour it into a bowl. Add ⁄4 cup (59 mL) of water, then stir it in with a spoon. Keep stirring until the water is completely mixed in and the texture is consistent.Tip: Add 1 to 2 drops of blue food coloring if you want \"ocean water\" slime! Stir in 1½ tablespoons (22.5 mL) of saline solution and set the slime aside. Make sure that the saline solution contains both boric acid and sodium borate; otherwise, the glue won't turn into slime. Once you stir in the saline solution with a spoon, set the mixture aside. Mix 1/2 teaspoon (6 g) of baking soda and 1 cup (240 mL) of warm water in a separate bowl. Pour 1 cup (240 mL) of warm water into a glass, then add 1/2 teaspoon (6 g) of baking soda. Stir them together with a spoon until the baking soda dissolves, then set the glass aside so that the water can cool down. Be sure to use baking soda and not baking powder! They're not the same thing. Combine the glue mixture with the baking soda mixture and stir gently. Pour the glue-saline solution into the baking soda water solution; it will automatically come together into a glob. Give the mixture a few stirs with a spoon. The baking soda water activates the slime. Pull the glob out of the water and knead it to firm it up. There will be a lot of water leftover in the bowl, which is fine and normal! Just take the glob out of the water and knead it between your fingers for a few minutes until it thickens up and reaches a slime-like consistency. Discard the leftover baking soda water when you are done. Store the slime in an airtight container when you're not playing with it. After about a week, the consistency of the slime may start to change, but it could last longer than that. Make sure that your hands are clean when you play with the slime, or it'll get dirty! Jiggly Slime with Shampoo and Water Pour ⁄2 cup (120 mL) of clear, thick shampoo into a bowl. The color of the shampoo is up to you, but clear will look the most water-like. Choose a shampoo with a thick, gel-like consistency. Avoid shampoo that has a thin, watery consistency. Add 1-2 drops of food coloring if you want to make ocean slime. You may want to skip this if your shampoo is already colored, or you can experiment with mixing colors. For example, you could add blue food coloring to yellow shampoo to make green slime. A little bit goes a long way, so 1-2 drops is all you need. If you don't have food coloring, use 2-3 drops of liquid watercolor paint. Stir ⁄2 cup (120 mL) of water into the bowl of shampoo with a spoon. The water will make the consistency thin at first, but the longer you stir it, the thicker it will get. Keep stirring the ingredients until the shampoo regains its original thick consistency. You can use less water if you want thicker slime, or more water if you want thinner slime. Don't stir too hard or too fast to prevent bubbles from forming. Transfer the slime to an airtight container and refrigerate it for 2 days. Do not touch or play with the slime during this time. As the mixture chills in the fridge, it will harden into slime! You can try speeding the process up by putting the slime into the freezer for 3-4 hours, but the results may not be as good. Keep the slime in its container when you're not using it. Because this slime contains very simple ingredients, it probably won't last for more than 2-3 days. If it starts to lose it's texture, you could try revitalizing it by stirring it back up again, then putting it back into the fridge for 2 days. If the slime starts to get too runny while you're playing with it, try putting it back into the fridge or freezer for a few hours, and see if that helps. Easy Slime with Cornstarch and Water Put 1 cup (128 g) of dry cornstarch into a medium-sized bowl. Use a measuring cup to measure out the cornstarch. Dump the cornstarch into a mixing bowl. Use a spoon to break up any clumps of cornstarch in the bowl. Pour ⁄2 cup (120 mL) of warm water into the bowl and stir the mixture. You'll be adding warm water little by little to create the consistency you want. You can just go to the tap with a glass and fill it with warm water. Start adding water to the bowl with a quick splash, say about 1 tablespoon (15 mL) of warm water. Stir the cornstarch and water together thoroughly with a spoon. As you stir, you will notice the mixture thickening. Warm water will prevent the cornstarch from clumping. Add 1-2 drops of food coloring, if desired. If you want to make colored slime, go ahead and add the food coloring of your choice to the mixture. You only need 1-2 drops, but you can experiment with adding more or less to achieve the exact shade that you want. Keep stirring with a spoon and adding water until the mixture gets thick and slime-like. The exact consistency is up to you, just make sure your slime is thick enough to hold together! If the slime feels too thin, add a little bit of cornstarch and keep stirring. If the slime feels too thick, add a little more water. Scoop out the slime and play with it! The gooey texture of this slime makes it super fun to play with. After you're done playing with it, store the slime in a plastic baggie with a zippered top to keep it moist. You can toss out the slime once it starts to look dirty.",
  "sentences":[
    " Clear Slime with Borax Mix ⁄2 cup (120 mL) of water and ⁄2 cup (120 mL) of clear glue in a bowl.",
    "Use a measuring cup to measure out ⁄2 cup (120 mL) of clear school glue and pour it into a medium-sized bowl.",
    "Then, measure out ⁄2 cup (120 mL) of water and pour it over the glue in the bowl.",
    "Stir the 2 ingredients thoroughly with a spoon until they're fully mixed together.",
    "Most bottles of school glue contain 4 ounces (120 mL), which amounts to ⁄2 cup (120 mL).",
    "If your glue says 4 ounces on the packaging, you can just empty out the whole bottle into the bowl!",
    "You can double the recipe and use 1 cup (240 mL) of clear glue and 1 cup (240 mL) of water.",
    "Do not use white school glue!",
    "Using clear PVA glue is the key to making this slime clear.",
    "Add 1-3 drops of blue food coloring if you want to make blue water slime.",
    "Real water is clear, but you can tint your slime to look blue if you want a dramatic look.",
    "Your slime will still be see-through if you add food coloring, but it won't be crystal clear.",
    "If you want this, stir in 1-3 drops of blue food coloring with a spoon.",
    "If you don't have blue food coloring on hand, then try 1-3 drops of liquid watercolor paint instead.",
    "Don't use acrylic paint, because you'll end up with slime that isn't see-through.Tip: Experiment with combinations to create custom colors for your slime!",
    "For example, you could add 1 drop of green food coloring and 2 drops of blue food coloring to create a pretty teal color.",
    "Mix 1/4 teaspoon (1.4 g) of Borax with ⁄2 cup (120 mL) of warm water.",
    "Get out a separate bowl to make the Borax solution.",
    "Then, measure out ⁄2 cup (120 mL) of warm water from your tap and pour it in the clean bowl.",
    "Use a spoon to stir in 1/4 teaspoon (1.4 g) of Borax powder.",
    "Mix them together until the Borax completely dissolves.",
    "Be sure to use warm water!",
    "If you use room temperature water, the Borax won't dissolve.",
    "If you're doubling the recipe, use 1 cup (240 mL) of warm water and 1/2 teaspoon (2.8 g) of Borax powder.",
    "Keep in mind that Borax can cause skin, eye, and lung irritation.",
    "Handle the concentrated powder carefully and keep it out of the reach of small children.",
    "Pour the Borax solution into the bowl of glue solution and stir well.",
    "Mix the 2 solutions together with a spoon until the mixture begins to thicken.",
    "Keep stirring the mixture until it starts to leave the sides of the bowl.",
    "Don't worry if there's still Borax water left in the bowl.",
    "As long as the glue clumps together, you're all set to go.",
    "Don't whisk or whip the slime with the spoon as you stir it, or you'll introduce air bubbles.",
    "Air bubbles will make ruin the crystal clear look you're going for.",
    "Pull the slime out of the bowl and knead it with your hands.",
    "Continue to knead the slime until it comes together.",
    "The more you knead, the firmer and less-sticky it will become.",
    "Knead the slime for about 3 minutes.",
    "If there are any bubbles in the slime, let it sit in a plastic container for a few hours; they should disappear over time.",
    "Keep the slime in an airtight container when you're not using it.",
    "This type of slime is pretty oozy!",
    "A plastic container with a tight-fitting lid is the best storage option, but a plastic freezer bag will also work.",
    "Store the slime at room temperature.",
    "Make sure that your hands are clean before you play with the slime to keep it looking clear.",
    "If you store it properly in an airtight container, this type of slime should last at least 1 week, if not longer.",
    "Clear Slime with Saline Solution Mix ⁄2 cup (120 mL) of clear glue and ⁄4 cup (59 mL) of water in a bowl.",
    "Measure out ⁄2 cup (120 mL) of clear school glue and pour it into a bowl.",
    "Add ⁄4 cup (59 mL) of water, then stir it in with a spoon.",
    "Keep stirring until the water is completely mixed in and the texture is consistent.Tip: Add 1 to 2 drops of blue food coloring if you want \"ocean water\" slime!",
    "Stir in 1½ tablespoons (22.5 mL) of saline solution and set the slime aside.",
    "Make sure that the saline solution contains both boric acid and sodium borate; otherwise, the glue won't turn into slime.",
    "Once you stir in the saline solution with a spoon, set the mixture aside.",
    "Mix 1/2 teaspoon (6 g) of baking soda and 1 cup (240 mL) of warm water in a separate bowl.",
    "Pour 1 cup (240 mL) of warm water into a glass, then add 1/2 teaspoon (6 g) of baking soda.",
    "Stir them together with a spoon until the baking soda dissolves, then set the glass aside so that the water can cool down.",
    "Be sure to use baking soda and not baking powder!",
    "They're not the same thing.",
    "Combine the glue mixture with the baking soda mixture and stir gently.",
    "Pour the glue-saline solution into the baking soda water solution; it will automatically come together into a glob.",
    "Give the mixture a few stirs with a spoon.",
    "The baking soda water activates the slime.",
    "Pull the glob out of the water and knead it to firm it up.",
    "There will be a lot of water leftover in the bowl, which is fine and normal!",
    "Just take the glob out of the water and knead it between your fingers for a few minutes until it thickens up and reaches a slime-like consistency.",
    "Discard the leftover baking soda water when you are done.",
    "Store the slime in an airtight container when you're not playing with it.",
    "After about a week, the consistency of the slime may start to change, but it could last longer than that.",
    "Make sure that your hands are clean when you play with the slime, or it'll get dirty!",
    "Jiggly Slime with Shampoo and Water Pour ⁄2 cup (120 mL) of clear, thick shampoo into a bowl.",
    "The color of the shampoo is up to you, but clear will look the most water-like.",
    "Choose a shampoo with a thick, gel-like consistency.",
    "Avoid shampoo that has a thin, watery consistency.",
    "Add 1-2 drops of food coloring if you want to make ocean slime.",
    "You may want to skip this if your shampoo is already colored, or you can experiment with mixing colors.",
    "For example, you could add blue food coloring to yellow shampoo to make green slime.",
    "A little bit goes a long way, so 1-2 drops is all you need.",
    "If you don't have food coloring, use 2-3 drops of liquid watercolor paint.",
    "Stir ⁄2 cup (120 mL) of water into the bowl of shampoo with a spoon.",
    "The water will make the consistency thin at first, but the longer you stir it, the thicker it will get.",
    "Keep stirring the ingredients until the shampoo regains its original thick consistency.",
    "You can use less water if you want thicker slime, or more water if you want thinner slime.",
    "Don't stir too hard or too fast to prevent bubbles from forming.",
    "Transfer the slime to an airtight container and refrigerate it for 2 days.",
    "Do not touch or play with the slime during this time.",
    "As the mixture chills in the fridge, it will harden into slime!",
    "You can try speeding the process up by putting the slime into the freezer for 3-4 hours, but the results may not be as good.",
    "Keep the slime in its container when you're not using it.",
    "Because this slime contains very simple ingredients, it probably won't last for more than 2-3 days.",
    "If it starts to lose it's texture, you could try revitalizing it by stirring it back up again, then putting it back into the fridge for 2 days.",
    "If the slime starts to get too runny while you're playing with it, try putting it back into the fridge or freezer for a few hours, and see if that helps.",
    "Easy Slime with Cornstarch and Water Put 1 cup (128 g) of dry cornstarch into a medium-sized bowl.",
    "Use a measuring cup to measure out the cornstarch.",
    "Dump the cornstarch into a mixing bowl.",
    "Use a spoon to break up any clumps of cornstarch in the bowl.",
    "Pour ⁄2 cup (120 mL) of warm water into the bowl and stir the mixture.",
    "You'll be adding warm water little by little to create the consistency you want.",
    "You can just go to the tap with a glass and fill it with warm water.",
    "Start adding water to the bowl with a quick splash, say about 1 tablespoon (15 mL) of warm water.",
    "Stir the cornstarch and water together thoroughly with a spoon.",
    "As you stir, you will notice the mixture thickening.",
    "Warm water will prevent the cornstarch from clumping.",
    "Add 1-2 drops of food coloring, if desired.",
    "If you want to make colored slime, go ahead and add the food coloring of your choice to the mixture.",
    "You only need 1-2 drops, but you can experiment with adding more or less to achieve the exact shade that you want.",
    "Keep stirring with a spoon and adding water until the mixture gets thick and slime-like.",
    "The exact consistency is up to you, just make sure your slime is thick enough to hold together!",
    "If the slime feels too thin, add a little bit of cornstarch and keep stirring.",
    "If the slime feels too thick, add a little more water.",
    "Scoop out the slime and play with it!",
    "The gooey texture of this slime makes it super fun to play with.",
    "After you're done playing with it, store the slime in a plastic baggie with a zippered top to keep it moist.",
    "You can toss out the slime once it starts to look dirty."
  ],
  "tyn_section":[
    "Bowl",
    "Glass",
    "Spoon",
    "Plastic zipper baggie",
    "Cup",
    "Airtight container",
    "2 bowls",
    "2 spoons",
    "Airtight storage container"
  ],
  "tyn_model":[
    "water",
    "bowl",
    "spoon",
    "shampoo",
    "food coloring",
    "baking soda",
    "glue",
    "blue food coloring",
    "warm water",
    "airtight container",
    "clear glue",
    "borax",
    "clear school glue",
    "liquid watercolor paint",
    "borax powder",
    "saline solution",
    "glass",
    "cornstarch",
    "school glue",
    "clear pva glue",
    "acrylic paint",
    "borax water",
    "freezer bag",
    "clear slime",
    "boric acid",
    "sodium borate",
    "baking powder",
    "fridge",
    "freezer",
    "measuring cup",
    "mixing bowl"
  ],
  "simple_metrics":{
    "r":0.4444444444,
    "p":0.1290322581,
    "f1":0.2,
    "avg_pos":0.0322580645
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1935483871,
    "f1":0.3
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1935483871,
    "f1":0.3
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5555555556,
    "p":0.1290322581,
    "f1":0.2094240838
  }
}