{
  "title":"How to Grow Cilantro Indoors",
  "url":"https://www.wikihow.com/Grow-Cilantro-Indoors",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Starting Seeds in an Indoor Pot",
      "steps":[
        {
          "headline":"Buy seeds with “slow-to-bolt” on the package.",
          "description":"Cilantro “bolts” (or “goes to seed”) quickly after sprouting up, often within a few weeks. Once it does, its flavor turns too bitter for use in cuisine. “Slow to bolt” cilantro seeds will last a couple more weeks before bolting. Once the plant bolts, its best use is for seed harvesting or self-propagation."
        },
        {
          "headline":"Fill a deep, well-draining pot with indoor potting mix.",
          "description":"Cilantro is in the same plant family as carrots, and similarly develops a deep taproot. Therefore, it needs to grow in a pot that is at least 8 inches (20 cm) deep, if not 12 inches (30 cm) or more. Make sure the pot has a drain opening in the bottom. Cilantro prefers moist but well-drained soil. Cilantro will grow well in any indoor potting mix."
        },
        {
          "headline":"Plant the seeds and cover them very lightly.",
          "description":"Spread several seeds (perhaps 6-8) over the top of your potting mix in the pot. Just barely cover them with no more than 0.25 inches (0.64 cm) of additional potting soil. Mist the pot with a spray bottle until the potting mix is damp to the touch."
        }
      ]
    },
    {
      "name":"Giving Seeds a Head Start Before Planting",
      "steps":[
        {
          "headline":"Soak 6-8 seeds in a shallow water dish overnight.",
          "description":"Buy a pack of \"slow-to-bolt\" cilantro seeds, which will last a week or more longer before \"going to seed\" and losing their culinary value. Just sprinkle them into a small dish, add a bit of water, and leave them to soak for around 12 hours. This quick soak will encourage the seeds to begin sprouting more quickly, as compared to planting them directly into potting mix."
        },
        {
          "headline":"Seal the seeds in a plastic bag and place them in a sunny indoor spot.",
          "description":"After their overnight soak, pick the seeds out of the water dish and drop them into a clear zip-close bag. Place the bag on a sunny windowsill for a day or two. Each day, spray a bit of water in the bag if it doesn’t appear to be slightly moist inside anymore. You’ll move on to the next step once you see a tiny white sprout emerging from each seed."
        },
        {
          "headline":"Add a small handful of potting soil to encourage sprouting.",
          "description":"Don’t fill the bag with potting mix; just sprinkle in enough so that the seeds can nestle in amongst the soil. Spray some water inside to moisten the soil. You’ll plant the seeds once you see signs of tiny roots and stems developing."
        },
        {
          "headline":"Move the sprouting seeds to their intended pot(s).",
          "description":"As with directly-sown seeds, use a deep pot (at least 8 inches (20 cm)) that drains well, and fill it with an indoor potting mix. Just barely cover the seedlings with potting mix and mist the soil to moisten it. Try to point the roots downward and the stem(s) upward, but don’t be too particular about it—they’ll figure out which way to go!"
        }
      ]
    },
    {
      "name":"Re-Potting from Grow Kits or Starter Pots",
      "steps":[
        {
          "headline":"Plant seedlings instead of seeds to get fresh cilantro even quicker.",
          "description":"Cilantro grows very quickly no matter how you start it. It only takes around 4-6 weeks for cilantro to go from seed to harvest. However, seedlings in starter pots or grow kits may be ready to harvest in only 2 weeks. That said, cilantro grown from seeds rather than transplanted seedlings usually grows better and lasts longer. This is because cilantro has long taproots that don’t like being disturbed (as happens during re-potting). Therefore, you have to decide whether it's worth saving 3 weeks or so of waiting in return for cilantro that may be less abundant and flavorful."
        },
        {
          "headline":"Buy starter pots or grow kits with 2 to 3 in (5.1 to 7.6 cm) seedlings.",
          "description":"At this height, the seedlings have a nice head start toward their ideal harvesting height of 6 inches (15 cm), but the taproots still aren’t too large. This makes the chances of a successful re-potting much higher."
        },
        {
          "headline":"Transfer the seedling and soil to a 12 in (30 cm) deep pot.",
          "description":"Add enough indoor potting mix to the new pot to make up for the depth difference between it and the cilantro’s current pot (make your best guess). Try to pop out all of the soil in the current pot, if possible—work around the edges with a plastic knife to loosen the soil if needed. Place the soil and cilantro seedling in the new pot, then add potting mix around the sides to fill in the gaps. Spray the soil to moisten it after the transfer."
        }
      ]
    },
    {
      "name":"Encouraging Abundant Growth",
      "steps":[
        {
          "headline":"Pluck out all but the strongest seedling after about 2 weeks.",
          "description":"If you have multiple seedlings in a single 8 to 12 in (20 to 30 cm) deep pot, it’s best to thin things down to the single strongest seedling. Use your fingers to pluck out the weaker seedlings after roughly 2 weeks, at which point they should be 2 to 3 inches (5.1 to 7.6 cm) high. If you’re growing cilantro in an even larger round or rectangular pot, thin the seedlings so they are spaced 6 to 8 inches (15 to 20 cm) apart."
        },
        {
          "headline":"Keep the soil consistently moist but not muddy.",
          "description":"Cilantro grows best in soil that’s always moist but never waterlogged. At least once per day, test the soil by pressing your finger to the surface. If it feels dry, spray it with some water until it is damp but not soaked. If your soil stays damp for several days after a light watering, use a pot with better drainage next time you grow cilantro."
        },
        {
          "headline":"Place the plant in a spot with around 6 hours of morning sunlight.",
          "description":"Cilantro likes getting at least 6 but no more than 8 hours of sunlight per day. It also prefers morning to afternoon sunlight, as it doesn’t grow as well if it gets overheated. Find a windowsill, shelf, or table in your house that gets ample morning sunlight. If that’s not possible, look for a spot that gets the afternoon sun with a slight bit of shading."
        },
        {
          "headline":"Use an indoor grow light for 14 hours daily instead.",
          "description":"If you’re not able to rely on the sun to nourish your cilantro, a standard indoor plant light will work just fine. Set it up about 6 inches (15 cm) above the the plant’s top and keep it on for 14 hours per day. 14 hours of the average grow light is equivalent to 6 hours of sunlight. Adjust the light as your plant grows taller to keep it 6 inches (15 cm) above."
        },
        {
          "headline":"Maintain a temperature of 60–75 °F (16–24 °C) and 40%-50% humidity.",
          "description":"While cilantro grows well outdoors in many climates, typical indoor conditions are nearly ideal for it. It manages well in temperatures between 60 and 75 °F (16 and 24 °C), but really seems to thrive right at about 70 °F (21 °C). Cilantro isn’t too picky when it comes to humidity. However, if your home is particularly humid (above 60%) or dry (below 35%), consider using a dehumidifier or humidifier, respectively."
        }
      ]
    },
    {
      "name":"Harvesting Cilantro",
      "steps":[
        {
          "headline":"Harvest entire stems once the plant is 6 inches (15 cm) tall.",
          "description":"Cilantro’s leaves and stems are equally delicious in recipes, so use them both! Snip off entire stems just above the soil line with scissors. Older, larger leaves tend to be less flavorful than newer, smaller ones, but you probably won’t notice the difference once you chop them up and put them in your pico de gallo!"
        },
        {
          "headline":"Use the stems and leaves immediately after harvesting them.",
          "description":"Harvested cilantro loses its distinctive flavor quickly, so it’s best to cut only as much as you need while creating a dish. That’s why it’s so convenient to have it growing indoors! You can put snipped cilantro stems in a cup of water for a few hours, if necessary, but the flavor will suffer. Cilantro does not store well either refrigerated or frozen."
        },
        {
          "headline":"Snip off flowers immediately to encourage leaf growth.",
          "description":"Every time a flower appears on your cilantro plant, it diverts energy away from leaf production. It also moves the plant one step closer to “bolting” (or “going to seed”), after which it won’t be useful in recipes. Just snip the new flowers off with scissors, or pinch them off with your fingers. This will slow down the bolting process, but it’s impossible to stop it from taking over eventually."
        },
        {
          "headline":"Plant the seeds of \"bolted\" cilantro to propagate the herb.",
          "description":"Once the flowers start cropping up all over and the leaves stop appearing, you may choose to just pull up the plant and start over with new seeds or seedlings. However, you can also encourage the plant to self-propagate if you wish. Eventually, the flowers will drop seeds into the surrounding potting mix, and you can watch to see if new seedlings emerge. If you want to facilitate the process, pluck some of the seeds from the seed heads within the flower blooms. You can plant these in the same pot (and remove the old plant), or start them in a new pot."
        }
      ]
    }
  ],
  "text":" Starting Seeds in an Indoor Pot Buy seeds with “slow-to-bolt” on the package. Cilantro “bolts” (or “goes to seed”) quickly after sprouting up, often within a few weeks. Once it does, its flavor turns too bitter for use in cuisine. “Slow to bolt” cilantro seeds will last a couple more weeks before bolting. Once the plant bolts, its best use is for seed harvesting or self-propagation. Fill a deep, well-draining pot with indoor potting mix. Cilantro is in the same plant family as carrots, and similarly develops a deep taproot. Therefore, it needs to grow in a pot that is at least 8 inches (20 cm) deep, if not 12 inches (30 cm) or more. Make sure the pot has a drain opening in the bottom. Cilantro prefers moist but well-drained soil. Cilantro will grow well in any indoor potting mix. Plant the seeds and cover them very lightly. Spread several seeds (perhaps 6-8) over the top of your potting mix in the pot. Just barely cover them with no more than 0.25 inches (0.64 cm) of additional potting soil. Mist the pot with a spray bottle until the potting mix is damp to the touch. Giving Seeds a Head Start Before Planting Soak 6-8 seeds in a shallow water dish overnight. Buy a pack of \"slow-to-bolt\" cilantro seeds, which will last a week or more longer before \"going to seed\" and losing their culinary value. Just sprinkle them into a small dish, add a bit of water, and leave them to soak for around 12 hours. This quick soak will encourage the seeds to begin sprouting more quickly, as compared to planting them directly into potting mix. Seal the seeds in a plastic bag and place them in a sunny indoor spot. After their overnight soak, pick the seeds out of the water dish and drop them into a clear zip-close bag. Place the bag on a sunny windowsill for a day or two. Each day, spray a bit of water in the bag if it doesn’t appear to be slightly moist inside anymore. You’ll move on to the next step once you see a tiny white sprout emerging from each seed. Add a small handful of potting soil to encourage sprouting. Don’t fill the bag with potting mix; just sprinkle in enough so that the seeds can nestle in amongst the soil. Spray some water inside to moisten the soil. You’ll plant the seeds once you see signs of tiny roots and stems developing. Move the sprouting seeds to their intended pot(s). As with directly-sown seeds, use a deep pot (at least 8 inches (20 cm)) that drains well, and fill it with an indoor potting mix. Just barely cover the seedlings with potting mix and mist the soil to moisten it. Try to point the roots downward and the stem(s) upward, but don’t be too particular about it—they’ll figure out which way to go! Re-Potting from Grow Kits or Starter Pots Plant seedlings instead of seeds to get fresh cilantro even quicker. Cilantro grows very quickly no matter how you start it. It only takes around 4-6 weeks for cilantro to go from seed to harvest. However, seedlings in starter pots or grow kits may be ready to harvest in only 2 weeks. That said, cilantro grown from seeds rather than transplanted seedlings usually grows better and lasts longer. This is because cilantro has long taproots that don’t like being disturbed (as happens during re-potting). Therefore, you have to decide whether it's worth saving 3 weeks or so of waiting in return for cilantro that may be less abundant and flavorful. Buy starter pots or grow kits with 2 to 3 in (5.1 to 7.6 cm) seedlings. At this height, the seedlings have a nice head start toward their ideal harvesting height of 6 inches (15 cm), but the taproots still aren’t too large. This makes the chances of a successful re-potting much higher. Transfer the seedling and soil to a 12 in (30 cm) deep pot. Add enough indoor potting mix to the new pot to make up for the depth difference between it and the cilantro’s current pot (make your best guess). Try to pop out all of the soil in the current pot, if possible—work around the edges with a plastic knife to loosen the soil if needed. Place the soil and cilantro seedling in the new pot, then add potting mix around the sides to fill in the gaps. Spray the soil to moisten it after the transfer. Encouraging Abundant Growth Pluck out all but the strongest seedling after about 2 weeks. If you have multiple seedlings in a single 8 to 12 in (20 to 30 cm) deep pot, it’s best to thin things down to the single strongest seedling. Use your fingers to pluck out the weaker seedlings after roughly 2 weeks, at which point they should be 2 to 3 inches (5.1 to 7.6 cm) high. If you’re growing cilantro in an even larger round or rectangular pot, thin the seedlings so they are spaced 6 to 8 inches (15 to 20 cm) apart. Keep the soil consistently moist but not muddy. Cilantro grows best in soil that’s always moist but never waterlogged. At least once per day, test the soil by pressing your finger to the surface. If it feels dry, spray it with some water until it is damp but not soaked. If your soil stays damp for several days after a light watering, use a pot with better drainage next time you grow cilantro. Place the plant in a spot with around 6 hours of morning sunlight. Cilantro likes getting at least 6 but no more than 8 hours of sunlight per day. It also prefers morning to afternoon sunlight, as it doesn’t grow as well if it gets overheated. Find a windowsill, shelf, or table in your house that gets ample morning sunlight. If that’s not possible, look for a spot that gets the afternoon sun with a slight bit of shading. Use an indoor grow light for 14 hours daily instead. If you’re not able to rely on the sun to nourish your cilantro, a standard indoor plant light will work just fine. Set it up about 6 inches (15 cm) above the the plant’s top and keep it on for 14 hours per day. 14 hours of the average grow light is equivalent to 6 hours of sunlight. Adjust the light as your plant grows taller to keep it 6 inches (15 cm) above. Maintain a temperature of 60–75 °F (16–24 °C) and 40%-50% humidity. While cilantro grows well outdoors in many climates, typical indoor conditions are nearly ideal for it. It manages well in temperatures between 60 and 75 °F (16 and 24 °C), but really seems to thrive right at about 70 °F (21 °C). Cilantro isn’t too picky when it comes to humidity. However, if your home is particularly humid (above 60%) or dry (below 35%), consider using a dehumidifier or humidifier, respectively. Harvesting Cilantro Harvest entire stems once the plant is 6 inches (15 cm) tall. Cilantro’s leaves and stems are equally delicious in recipes, so use them both! Snip off entire stems just above the soil line with scissors. Older, larger leaves tend to be less flavorful than newer, smaller ones, but you probably won’t notice the difference once you chop them up and put them in your pico de gallo! Use the stems and leaves immediately after harvesting them. Harvested cilantro loses its distinctive flavor quickly, so it’s best to cut only as much as you need while creating a dish. That’s why it’s so convenient to have it growing indoors! You can put snipped cilantro stems in a cup of water for a few hours, if necessary, but the flavor will suffer. Cilantro does not store well either refrigerated or frozen. Snip off flowers immediately to encourage leaf growth. Every time a flower appears on your cilantro plant, it diverts energy away from leaf production. It also moves the plant one step closer to “bolting” (or “going to seed”), after which it won’t be useful in recipes. Just snip the new flowers off with scissors, or pinch them off with your fingers. This will slow down the bolting process, but it’s impossible to stop it from taking over eventually. Plant the seeds of \"bolted\" cilantro to propagate the herb. Once the flowers start cropping up all over and the leaves stop appearing, you may choose to just pull up the plant and start over with new seeds or seedlings. However, you can also encourage the plant to self-propagate if you wish. Eventually, the flowers will drop seeds into the surrounding potting mix, and you can watch to see if new seedlings emerge. If you want to facilitate the process, pluck some of the seeds from the seed heads within the flower blooms. You can plant these in the same pot (and remove the old plant), or start them in a new pot.",
  "sentences":[
    " Starting Seeds in an Indoor Pot Buy seeds with “slow-to-bolt” on the package.",
    "Cilantro “bolts” (or “goes to seed”) quickly after sprouting up, often within a few weeks.",
    "Once it does, its flavor turns too bitter for use in cuisine.",
    "“Slow to bolt” cilantro seeds will last a couple more weeks before bolting.",
    "Once the plant bolts, its best use is for seed harvesting or self-propagation.",
    "Fill a deep, well-draining pot with indoor potting mix.",
    "Cilantro is in the same plant family as carrots, and similarly develops a deep taproot.",
    "Therefore, it needs to grow in a pot that is at least 8 inches (20 cm) deep, if not 12 inches (30 cm) or more.",
    "Make sure the pot has a drain opening in the bottom.",
    "Cilantro prefers moist but well-drained soil.",
    "Cilantro will grow well in any indoor potting mix.",
    "Plant the seeds and cover them very lightly.",
    "Spread several seeds (perhaps 6-8) over the top of your potting mix in the pot.",
    "Just barely cover them with no more than 0.25 inches (0.64 cm) of additional potting soil.",
    "Mist the pot with a spray bottle until the potting mix is damp to the touch.",
    "Giving Seeds a Head Start Before Planting Soak 6-8 seeds in a shallow water dish overnight.",
    "Buy a pack of \"slow-to-bolt\" cilantro seeds, which will last a week or more longer before \"going to seed\" and losing their culinary value.",
    "Just sprinkle them into a small dish, add a bit of water, and leave them to soak for around 12 hours.",
    "This quick soak will encourage the seeds to begin sprouting more quickly, as compared to planting them directly into potting mix.",
    "Seal the seeds in a plastic bag and place them in a sunny indoor spot.",
    "After their overnight soak, pick the seeds out of the water dish and drop them into a clear zip-close bag.",
    "Place the bag on a sunny windowsill for a day or two.",
    "Each day, spray a bit of water in the bag if it doesn’t appear to be slightly moist inside anymore.",
    "You’ll move on to the next step once you see a tiny white sprout emerging from each seed.",
    "Add a small handful of potting soil to encourage sprouting.",
    "Don’t fill the bag with potting mix; just sprinkle in enough so that the seeds can nestle in amongst the soil.",
    "Spray some water inside to moisten the soil.",
    "You’ll plant the seeds once you see signs of tiny roots and stems developing.",
    "Move the sprouting seeds to their intended pot(s).",
    "As with directly-sown seeds, use a deep pot (at least 8 inches (20 cm)) that drains well, and fill it with an indoor potting mix.",
    "Just barely cover the seedlings with potting mix and mist the soil to moisten it.",
    "Try to point the roots downward and the stem(s) upward, but don’t be too particular about it—they’ll figure out which way to go!",
    "Re-Potting from Grow Kits or Starter Pots Plant seedlings instead of seeds to get fresh cilantro even quicker.",
    "Cilantro grows very quickly no matter how you start it.",
    "It only takes around 4-6 weeks for cilantro to go from seed to harvest.",
    "However, seedlings in starter pots or grow kits may be ready to harvest in only 2 weeks.",
    "That said, cilantro grown from seeds rather than transplanted seedlings usually grows better and lasts longer.",
    "This is because cilantro has long taproots that don’t like being disturbed (as happens during re-potting).",
    "Therefore, you have to decide whether it's worth saving 3 weeks or so of waiting in return for cilantro that may be less abundant and flavorful.",
    "Buy starter pots or grow kits with 2 to 3 in (5.1 to 7.6 cm) seedlings.",
    "At this height, the seedlings have a nice head start toward their ideal harvesting height of 6 inches (15 cm), but the taproots still aren’t too large.",
    "This makes the chances of a successful re-potting much higher.",
    "Transfer the seedling and soil to a 12 in (30 cm) deep pot.",
    "Add enough indoor potting mix to the new pot to make up for the depth difference between it and the cilantro’s current pot (make your best guess).",
    "Try to pop out all of the soil in the current pot, if possible—work around the edges with a plastic knife to loosen the soil if needed.",
    "Place the soil and cilantro seedling in the new pot, then add potting mix around the sides to fill in the gaps.",
    "Spray the soil to moisten it after the transfer.",
    "Encouraging Abundant Growth Pluck out all but the strongest seedling after about 2 weeks.",
    "If you have multiple seedlings in a single 8 to 12 in (20 to 30 cm) deep pot, it’s best to thin things down to the single strongest seedling.",
    "Use your fingers to pluck out the weaker seedlings after roughly 2 weeks, at which point they should be 2 to 3 inches (5.1 to 7.6 cm) high.",
    "If you’re growing cilantro in an even larger round or rectangular pot, thin the seedlings so they are spaced 6 to 8 inches (15 to 20 cm) apart.",
    "Keep the soil consistently moist but not muddy.",
    "Cilantro grows best in soil that’s always moist but never waterlogged.",
    "At least once per day, test the soil by pressing your finger to the surface.",
    "If it feels dry, spray it with some water until it is damp but not soaked.",
    "If your soil stays damp for several days after a light watering, use a pot with better drainage next time you grow cilantro.",
    "Place the plant in a spot with around 6 hours of morning sunlight.",
    "Cilantro likes getting at least 6 but no more than 8 hours of sunlight per day.",
    "It also prefers morning to afternoon sunlight, as it doesn’t grow as well if it gets overheated.",
    "Find a windowsill, shelf, or table in your house that gets ample morning sunlight.",
    "If that’s not possible, look for a spot that gets the afternoon sun with a slight bit of shading.",
    "Use an indoor grow light for 14 hours daily instead.",
    "If you’re not able to rely on the sun to nourish your cilantro, a standard indoor plant light will work just fine.",
    "Set it up about 6 inches (15 cm) above the the plant’s top and keep it on for 14 hours per day.",
    "14 hours of the average grow light is equivalent to 6 hours of sunlight.",
    "Adjust the light as your plant grows taller to keep it 6 inches (15 cm) above.",
    "Maintain a temperature of 60–75 °F (16–24 °C) and 40%-50% humidity.",
    "While cilantro grows well outdoors in many climates, typical indoor conditions are nearly ideal for it.",
    "It manages well in temperatures between 60 and 75 °F (16 and 24 °C), but really seems to thrive right at about 70 °F (21 °C).",
    "Cilantro isn’t too picky when it comes to humidity.",
    "However, if your home is particularly humid (above 60%) or dry (below 35%), consider using a dehumidifier or humidifier, respectively.",
    "Harvesting Cilantro Harvest entire stems once the plant is 6 inches (15 cm) tall.",
    "Cilantro’s leaves and stems are equally delicious in recipes, so use them both!",
    "Snip off entire stems just above the soil line with scissors.",
    "Older, larger leaves tend to be less flavorful than newer, smaller ones, but you probably won’t notice the difference once you chop them up and put them in your pico de gallo!",
    "Use the stems and leaves immediately after harvesting them.",
    "Harvested cilantro loses its distinctive flavor quickly, so it’s best to cut only as much as you need while creating a dish.",
    "That’s why it’s so convenient to have it growing indoors!",
    "You can put snipped cilantro stems in a cup of water for a few hours, if necessary, but the flavor will suffer.",
    "Cilantro does not store well either refrigerated or frozen.",
    "Snip off flowers immediately to encourage leaf growth.",
    "Every time a flower appears on your cilantro plant, it diverts energy away from leaf production.",
    "It also moves the plant one step closer to “bolting” (or “going to seed”), after which it won’t be useful in recipes.",
    "Just snip the new flowers off with scissors, or pinch them off with your fingers.",
    "This will slow down the bolting process, but it’s impossible to stop it from taking over eventually.",
    "Plant the seeds of \"bolted\" cilantro to propagate the herb.",
    "Once the flowers start cropping up all over and the leaves stop appearing, you may choose to just pull up the plant and start over with new seeds or seedlings.",
    "However, you can also encourage the plant to self-propagate if you wish.",
    "Eventually, the flowers will drop seeds into the surrounding potting mix, and you can watch to see if new seedlings emerge.",
    "If you want to facilitate the process, pluck some of the seeds from the seed heads within the flower blooms.",
    "You can plant these in the same pot (and remove the old plant), or start them in a new pot."
  ],
  "tyn_section":[
    "cilantro seeds",
    "8 to 12 in (20 to 30 cm) deep pot",
    "indoor potting mix",
    "spray bottle for watering"
  ],
  "tyn_model":[
    "cilantro",
    "potting mix",
    "pot",
    "water",
    "indoor potting mix",
    "seeds",
    "“slow",
    "” (",
    "”)",
    "potting soil",
    "scissors",
    "” on",
    "“bolts",
    "“goes",
    "” cilantro",
    "carrots",
    "spray bottle",
    "shallow water dish",
    "small dish",
    "plastic bag",
    "water dish",
    "—they’ll",
    "grow kits",
    "pots",
    "soil",
    "—work",
    "plastic knife",
    "indoor grow light",
    "indoor plant light",
    "dehumidifier or humidifier",
    "pico de gallo",
    "“bolting",
    "“going"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0303030303,
    "f1":0.0540540541,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.1515151515,
    "f1":0.2521008403
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.1818181818,
    "f1":0.2926829268
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0606060606,
    "f1":0.0975609756
  }
}