{
  "title":"How to Remove Undercoating",
  "url":"https://www.wikihow.com/Remove-Undercoating",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Removing Undercoating with a Wire Wheel",
      "steps":[
        {
          "headline":"Attach your wire wheel to a drill or grinder.",
          "description":"Use a wire wheel with a power drill or hand grinder. To attach the wire wheel, follow the directions outlined on your particular wheel. Typically, you secure it to the top of your tool and twist it into place. A wire wheel is a circular sander featuring crimped, tempered steel bristles. It works well to easily remove rust, corrosion, paint, and primer. Most wire wheels are 6 in (15 cm) in diameter."
        },
        {
          "headline":"Hold the wire wheel up to your undercoating.",
          "description":"Before you do this, put on safety goggles. To use the wire wheel, simply plug in your drill or grinder, and place it against the undercoating. With little effort, the wire wheel will remove the undercoating. This is the fastest and easiest removal option. You can start removing the undercoating wherever you'd like. Start at the top of your wheel panel and work your way down to the bottom, for example."
        },
        {
          "headline":"Buff away the undercoating in 4–6 in (10–15 cm) sections at a time.",
          "description":"The wire wheel swirls the undercoating around, which easily lifts it off of your vehicle. Working in smaller sections makes it easy to remove all of your undercoating. Continue buffing the undercoating off until your vehicle is completely clean."
        }
      ]
    },
    {
      "name":"Using an Air Scraper",
      "steps":[
        {
          "headline":"Use the medium-sized scraper for best results.",
          "description":"An air scraper is a battery-operated device that quickly removes paint, rust, and glue without damaging the metal underneath. It consists of a built-in regulator that provides control and precision. Most air scrapers come with a small, medium, and large scraping tool. You can use any of these to remove the undercoating, but the medium scraper often works best. To fasten the scraper to the tool, review the instructions in your user manual. Typically, you place the scraper at the top of the tool and screw it into place."
        },
        {
          "headline":"Turn on the air scraper.",
          "description":"Before you use the air scraper, ensure you are wearing safety goggles. Each air scraper is slightly different, but typically there is an on and off switch toward the bottom. In addition, your air scraper may have adjustments for the PSI or blows per minute, depending on your particular model. Most air scrapers use 2100 blows per minute and 90 PSI."
        },
        {
          "headline":"Put the tip of the scraper against your undercoating and slide it across.",
          "description":"The air scraper easily removes the undercoating. Simply hold the scraper against the wheel panel or undercarriage, and push it forward with light pressure. This is considerably easier than using a heat gun and scraper, for instance."
        },
        {
          "headline":"Work in 3–5 in (7.6–12.7 cm) sections to remove all of the undercoating.",
          "description":"To remove all of your undercoating, run your scraper in small sections. You can work from front to back if you'd like. Most of the undercoating will come off with ease using an air scraper."
        }
      ]
    },
    {
      "name":"Heating and Scraping the Undercoating",
      "steps":[
        {
          "headline":"Use a heat gun to warm up the undercoating in small sections.",
          "description":"A heat gun warms up the existing undercoating, so you can easily scrape it off. Plug in your heat gun, use a high heat setting, and hold the tip about 2–3 in (5.1–7.6 cm) away from the undercoating. For best results, work in 2–4 in (5.1–10.2 cm) sections at a time. A heat gun is a tool used to strip paint, shrink heat tubing or film, shrink-wrap packages, or soften adhesives. Alternatively, you can use a propane torch instead of a heat gun. The propane torch will heat up the undercoating faster, but they are more dangerous and can start a fire. The propane torch may heat up the undercoating faster than the heat gun."
        },
        {
          "headline":"Scrape the undercoating away with a small paint scraper.",
          "description":"Before you do this, put on safety goggles. As you warm up the undercoating, use a small or medium-sized paint scraper to remove the undercoating. Hold the paint scraper directly against the undercoating, and push it forward with moderate pressure. As you do this, be sure to keep your hand out of the way of your heat gun. You can start scraping wherever on your car you'd like. It doesn't matter where you begin. For instance, start at the top of your wheel panel."
        },
        {
          "headline":"Continue heating and scraping until the undercoating is gone.",
          "description":"Remove the undercoating wherever you'd like, such as around the wheel panels or undercarriage of your car. It can take several hours to remove all of the undercoating using this method. The undercoating is completely removed when there is no dark or black residue remaining. With this method, your undercoating may look scratched up rather than smooth."
        }
      ]
    }
  ],
  "text":" Removing Undercoating with a Wire Wheel Attach your wire wheel to a drill or grinder. Use a wire wheel with a power drill or hand grinder. To attach the wire wheel, follow the directions outlined on your particular wheel. Typically, you secure it to the top of your tool and twist it into place. A wire wheel is a circular sander featuring crimped, tempered steel bristles. It works well to easily remove rust, corrosion, paint, and primer. Most wire wheels are 6 in (15 cm) in diameter. Hold the wire wheel up to your undercoating. Before you do this, put on safety goggles. To use the wire wheel, simply plug in your drill or grinder, and place it against the undercoating. With little effort, the wire wheel will remove the undercoating. This is the fastest and easiest removal option. You can start removing the undercoating wherever you'd like. Start at the top of your wheel panel and work your way down to the bottom, for example. Buff away the undercoating in 4–6 in (10–15 cm) sections at a time. The wire wheel swirls the undercoating around, which easily lifts it off of your vehicle. Working in smaller sections makes it easy to remove all of your undercoating. Continue buffing the undercoating off until your vehicle is completely clean. Using an Air Scraper Use the medium-sized scraper for best results. An air scraper is a battery-operated device that quickly removes paint, rust, and glue without damaging the metal underneath. It consists of a built-in regulator that provides control and precision. Most air scrapers come with a small, medium, and large scraping tool. You can use any of these to remove the undercoating, but the medium scraper often works best. To fasten the scraper to the tool, review the instructions in your user manual. Typically, you place the scraper at the top of the tool and screw it into place. Turn on the air scraper. Before you use the air scraper, ensure you are wearing safety goggles. Each air scraper is slightly different, but typically there is an on and off switch toward the bottom. In addition, your air scraper may have adjustments for the PSI or blows per minute, depending on your particular model. Most air scrapers use 2100 blows per minute and 90 PSI. Put the tip of the scraper against your undercoating and slide it across. The air scraper easily removes the undercoating. Simply hold the scraper against the wheel panel or undercarriage, and push it forward with light pressure. This is considerably easier than using a heat gun and scraper, for instance. Work in 3–5 in (7.6–12.7 cm) sections to remove all of the undercoating. To remove all of your undercoating, run your scraper in small sections. You can work from front to back if you'd like. Most of the undercoating will come off with ease using an air scraper. Heating and Scraping the Undercoating Use a heat gun to warm up the undercoating in small sections. A heat gun warms up the existing undercoating, so you can easily scrape it off. Plug in your heat gun, use a high heat setting, and hold the tip about 2–3 in (5.1–7.6 cm) away from the undercoating. For best results, work in 2–4 in (5.1–10.2 cm) sections at a time. A heat gun is a tool used to strip paint, shrink heat tubing or film, shrink-wrap packages, or soften adhesives. Alternatively, you can use a propane torch instead of a heat gun. The propane torch will heat up the undercoating faster, but they are more dangerous and can start a fire. The propane torch may heat up the undercoating faster than the heat gun. Scrape the undercoating away with a small paint scraper. Before you do this, put on safety goggles. As you warm up the undercoating, use a small or medium-sized paint scraper to remove the undercoating. Hold the paint scraper directly against the undercoating, and push it forward with moderate pressure. As you do this, be sure to keep your hand out of the way of your heat gun. You can start scraping wherever on your car you'd like. It doesn't matter where you begin. For instance, start at the top of your wheel panel. Continue heating and scraping until the undercoating is gone. Remove the undercoating wherever you'd like, such as around the wheel panels or undercarriage of your car. It can take several hours to remove all of the undercoating using this method. The undercoating is completely removed when there is no dark or black residue remaining. With this method, your undercoating may look scratched up rather than smooth.",
  "sentences":[
    " Removing Undercoating with a Wire Wheel Attach your wire wheel to a drill or grinder.",
    "Use a wire wheel with a power drill or hand grinder.",
    "To attach the wire wheel, follow the directions outlined on your particular wheel.",
    "Typically, you secure it to the top of your tool and twist it into place.",
    "A wire wheel is a circular sander featuring crimped, tempered steel bristles.",
    "It works well to easily remove rust, corrosion, paint, and primer.",
    "Most wire wheels are 6 in (15 cm) in diameter.",
    "Hold the wire wheel up to your undercoating.",
    "Before you do this, put on safety goggles.",
    "To use the wire wheel, simply plug in your drill or grinder, and place it against the undercoating.",
    "With little effort, the wire wheel will remove the undercoating.",
    "This is the fastest and easiest removal option.",
    "You can start removing the undercoating wherever you'd like.",
    "Start at the top of your wheel panel and work your way down to the bottom, for example.",
    "Buff away the undercoating in 4–6 in (10–15 cm) sections at a time.",
    "The wire wheel swirls the undercoating around, which easily lifts it off of your vehicle.",
    "Working in smaller sections makes it easy to remove all of your undercoating.",
    "Continue buffing the undercoating off until your vehicle is completely clean.",
    "Using an Air Scraper Use the medium-sized scraper for best results.",
    "An air scraper is a battery-operated device that quickly removes paint, rust, and glue without damaging the metal underneath.",
    "It consists of a built-in regulator that provides control and precision.",
    "Most air scrapers come with a small, medium, and large scraping tool.",
    "You can use any of these to remove the undercoating, but the medium scraper often works best.",
    "To fasten the scraper to the tool, review the instructions in your user manual.",
    "Typically, you place the scraper at the top of the tool and screw it into place.",
    "Turn on the air scraper.",
    "Before you use the air scraper, ensure you are wearing safety goggles.",
    "Each air scraper is slightly different, but typically there is an on and off switch toward the bottom.",
    "In addition, your air scraper may have adjustments for the PSI or blows per minute, depending on your particular model.",
    "Most air scrapers use 2100 blows per minute and 90 PSI.",
    "Put the tip of the scraper against your undercoating and slide it across.",
    "The air scraper easily removes the undercoating.",
    "Simply hold the scraper against the wheel panel or undercarriage, and push it forward with light pressure.",
    "This is considerably easier than using a heat gun and scraper, for instance.",
    "Work in 3–5 in (7.6–12.7 cm) sections to remove all of the undercoating.",
    "To remove all of your undercoating, run your scraper in small sections.",
    "You can work from front to back if you'd like.",
    "Most of the undercoating will come off with ease using an air scraper.",
    "Heating and Scraping the Undercoating Use a heat gun to warm up the undercoating in small sections.",
    "A heat gun warms up the existing undercoating, so you can easily scrape it off.",
    "Plug in your heat gun, use a high heat setting, and hold the tip about 2–3 in (5.1–7.6 cm) away from the undercoating.",
    "For best results, work in 2–4 in (5.1–10.2 cm) sections at a time.",
    "A heat gun is a tool used to strip paint, shrink heat tubing or film, shrink-wrap packages, or soften adhesives.",
    "Alternatively, you can use a propane torch instead of a heat gun.",
    "The propane torch will heat up the undercoating faster, but they are more dangerous and can start a fire.",
    "The propane torch may heat up the undercoating faster than the heat gun.",
    "Scrape the undercoating away with a small paint scraper.",
    "Before you do this, put on safety goggles.",
    "As you warm up the undercoating, use a small or medium-sized paint scraper to remove the undercoating.",
    "Hold the paint scraper directly against the undercoating, and push it forward with moderate pressure.",
    "As you do this, be sure to keep your hand out of the way of your heat gun.",
    "You can start scraping wherever on your car you'd like.",
    "It doesn't matter where you begin.",
    "For instance, start at the top of your wheel panel.",
    "Continue heating and scraping until the undercoating is gone.",
    "Remove the undercoating wherever you'd like, such as around the wheel panels or undercarriage of your car.",
    "It can take several hours to remove all of the undercoating using this method.",
    "The undercoating is completely removed when there is no dark or black residue remaining.",
    "With this method, your undercoating may look scratched up rather than smooth."
  ],
  "tyn_section":[
    "Safety goggles",
    "Wire wheel",
    "Drill or grinder",
    "Power outlet",
    "Air scraper",
    "Heat gun",
    "Small paint scraper"
  ],
  "tyn_model":[
    "wire wheel",
    "air scraper",
    "scraper",
    "heat gun",
    "drill or grinder",
    "air scrapers",
    "propane torch",
    "paint scraper",
    "removing undercoating",
    "power drill or hand grinder",
    "sander",
    "primer",
    "safety goggles",
    "glue",
    "paint",
    "heat tubing",
    "propane",
    "small paint scraper",
    "heating"
  ],
  "simple_metrics":{
    "r":0.8571428571,
    "p":0.3157894737,
    "f1":0.4615384615,
    "avg_pos":0.6315789474
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.4736842105,
    "f1":0.6101694915
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.6315789474,
    "f1":0.7272727273
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8571428571,
    "p":0.3684210526,
    "f1":0.5153374233
  }
}