{
  "title":"How to Bake Trout",
  "url":"https://www.wikihow.com/Bake-Trout",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Making Foil Packets",
      "steps":[
        {
          "headline":"Preheat the oven to 400 °F (204 °C) and cut the heavy duty aluminum foil.",
          "description":"As the oven heats to the appropriate temperature, prepare squares of heavy duty aluminum foil for wrapping your fish. Cut each square so that it is 3 in (7.6 cm) longer than the fish on each side. Make sure you have enough squares of foil to wrap each piece of fish. If you don’t have heavy duty aluminum foil, you can use 2 sheets of regular aluminum foil to wrap the fish."
        },
        {
          "headline":"Rinse and dry the skin with a paper towel to remove excess moisture.",
          "description":"To ensure that the fish are safe to eat, rinse the skin with running water from the tap. Then, use a paper towel to absorb excess moisture from the skin and the flesh. Try to avoid soaking the inner flesh of the trout. Focus on rinsing the skin, which can harbor bacteria."
        },
        {
          "headline":"Spread olive oil onto the aluminum foil and place the trout skin-side down.",
          "description":"Using a brush or spoon, drizzle about 1 tablespoon (15 mL) of olive oil over the dull side of the foil, making sure to coat an area large enough to fit the fish. Then, lay the fish onto the foil, with the skin side touching the oiled part of the foil. If you don’t have olive oil, you can use a different oil, such as canola oil or avocado oil."
        },
        {
          "headline":"Brush olive oil over the flesh side and sprinkle with salt and pepper.",
          "description":"Once the fish is on the foil, brush the fish with about 1 tablespoon (15 mL) of oil. Apply a pinch of salt and pepper to the flesh and skin sides of the fish. Remember that you can apply additional salt and pepper to the trout after the fish has cooked. Oversalting can sometimes cause the fish to become dry and will compromise the taste of your dish!"
        },
        {
          "headline":"Place 2 sprigs of parsley and 2 lemon slices on the flesh of each filet.",
          "description":"For additional flavor, lay 2 whole sprigs of parsley in the middle of the fish, and top them with 2 lemon slices. As the foil packets heat up, these will infuse the trout with a refreshing citrus taste that isn’t overpowering. If you don’t have parsley available, you can substitute sprigs of dill or rosemary for a similar effect."
        },
        {
          "headline":"Fold the foil into a packet so that the fish is completely wrapped.",
          "description":"Using your hands, bring the edges of the foil up and over the sides of the fish, and fold the ends of the packet over 2 times to seal in the moisture. Make sure there are no holes in the sides of the packets where steam might escape. If the foil tears while you’re folding the packet, simply wrap another piece of foil around the torn packet."
        }
      ]
    },
    {
      "name":"Baking and Serving the Trout",
      "steps":[
        {
          "headline":"Arrange the packets to lay flat on a baking sheet.",
          "description":"Leave about 1 to 2 inches (2.5 to 5.1 cm) of space in between each packet on the baking sheet. Make sure each packet is placed on the sheet with the folded part of the foil facing up. Spread the packets across the sheet as evenly as possible. Piling all of the packets on one side can lead to uneven cooking temperatures."
        },
        {
          "headline":"Bake the fish on a baking sheet for 10-15 minutes.",
          "description":"After the fish have been in the oven for 10 minutes, remove them and carefully open one of the packets. Flake off a small piece of the flesh to make sure that it’s properly cooked. If the flesh doesn’t flake, place the fish back into the oven for an additional 2-3 minutes."
        },
        {
          "headline":"Cut open the foil packets to release the steam.",
          "description":"Once the packets have cooled for 1-2 minutes, use scissors to cut the packets carefully across the top. Keep your fingers away from the openings to avoid getting burned by the steam! After the steam rises from the packets, you can use your hands to carefully pull the sides of the foil away from the fish."
        },
        {
          "headline":"Broil the opened packets for 3 minutes if you want a browned top.",
          "description":"If you like a crispy, browned top on your fish, turn your oven to its broil setting. Then, slide the trout in open packets back into the oven to cook for an additional 3 minutes. This method will also make the parsley and lemon on the fish slightly crispy."
        },
        {
          "headline":"Add more herbs, fresh lemon slices, salt, and pepper to taste.",
          "description":"The herbs and lemon slices inside of the packet will likely be slightly wilted once the fish is ready to serve. Replace them with fresh sprigs of parsley and lemon slices, and sprinkle salt and pepper over the skin to taste. If you want extra flavor, pour the juices left in the foil packet over the flesh of the trout before adding the seasons. For leftover trout, seal the fish in an airtight container and place it in the refrigerator, where it will remain fresh for up to 3 days. If the trout is still in its foil packet, you can leave it wrapped in the foil as long as it’s inside of an airtight container."
        }
      ]
    }
  ],
  "text":" Making Foil Packets Preheat the oven to 400 °F (204 °C) and cut the heavy duty aluminum foil. As the oven heats to the appropriate temperature, prepare squares of heavy duty aluminum foil for wrapping your fish. Cut each square so that it is 3 in (7.6 cm) longer than the fish on each side. Make sure you have enough squares of foil to wrap each piece of fish. If you don’t have heavy duty aluminum foil, you can use 2 sheets of regular aluminum foil to wrap the fish. Rinse and dry the skin with a paper towel to remove excess moisture. To ensure that the fish are safe to eat, rinse the skin with running water from the tap. Then, use a paper towel to absorb excess moisture from the skin and the flesh. Try to avoid soaking the inner flesh of the trout. Focus on rinsing the skin, which can harbor bacteria. Spread olive oil onto the aluminum foil and place the trout skin-side down. Using a brush or spoon, drizzle about 1 tablespoon (15 mL) of olive oil over the dull side of the foil, making sure to coat an area large enough to fit the fish. Then, lay the fish onto the foil, with the skin side touching the oiled part of the foil. If you don’t have olive oil, you can use a different oil, such as canola oil or avocado oil. Brush olive oil over the flesh side and sprinkle with salt and pepper. Once the fish is on the foil, brush the fish with about 1 tablespoon (15 mL) of oil. Apply a pinch of salt and pepper to the flesh and skin sides of the fish. Remember that you can apply additional salt and pepper to the trout after the fish has cooked. Oversalting can sometimes cause the fish to become dry and will compromise the taste of your dish! Place 2 sprigs of parsley and 2 lemon slices on the flesh of each filet. For additional flavor, lay 2 whole sprigs of parsley in the middle of the fish, and top them with 2 lemon slices. As the foil packets heat up, these will infuse the trout with a refreshing citrus taste that isn’t overpowering. If you don’t have parsley available, you can substitute sprigs of dill or rosemary for a similar effect. Fold the foil into a packet so that the fish is completely wrapped. Using your hands, bring the edges of the foil up and over the sides of the fish, and fold the ends of the packet over 2 times to seal in the moisture. Make sure there are no holes in the sides of the packets where steam might escape. If the foil tears while you’re folding the packet, simply wrap another piece of foil around the torn packet. Baking and Serving the Trout Arrange the packets to lay flat on a baking sheet. Leave about 1 to 2 inches (2.5 to 5.1 cm) of space in between each packet on the baking sheet. Make sure each packet is placed on the sheet with the folded part of the foil facing up. Spread the packets across the sheet as evenly as possible. Piling all of the packets on one side can lead to uneven cooking temperatures. Bake the fish on a baking sheet for 10-15 minutes. After the fish have been in the oven for 10 minutes, remove them and carefully open one of the packets. Flake off a small piece of the flesh to make sure that it’s properly cooked. If the flesh doesn’t flake, place the fish back into the oven for an additional 2-3 minutes. Cut open the foil packets to release the steam. Once the packets have cooled for 1-2 minutes, use scissors to cut the packets carefully across the top. Keep your fingers away from the openings to avoid getting burned by the steam! After the steam rises from the packets, you can use your hands to carefully pull the sides of the foil away from the fish. Broil the opened packets for 3 minutes if you want a browned top. If you like a crispy, browned top on your fish, turn your oven to its broil setting. Then, slide the trout in open packets back into the oven to cook for an additional 3 minutes. This method will also make the parsley and lemon on the fish slightly crispy. Add more herbs, fresh lemon slices, salt, and pepper to taste. The herbs and lemon slices inside of the packet will likely be slightly wilted once the fish is ready to serve. Replace them with fresh sprigs of parsley and lemon slices, and sprinkle salt and pepper over the skin to taste. If you want extra flavor, pour the juices left in the foil packet over the flesh of the trout before adding the seasons. For leftover trout, seal the fish in an airtight container and place it in the refrigerator, where it will remain fresh for up to 3 days. If the trout is still in its foil packet, you can leave it wrapped in the foil as long as it’s inside of an airtight container.",
  "sentences":[
    " Making Foil Packets Preheat the oven to 400 °F (204 °C) and cut the heavy duty aluminum foil.",
    "As the oven heats to the appropriate temperature, prepare squares of heavy duty aluminum foil for wrapping your fish.",
    "Cut each square so that it is 3 in (7.6 cm) longer than the fish on each side.",
    "Make sure you have enough squares of foil to wrap each piece of fish.",
    "If you don’t have heavy duty aluminum foil, you can use 2 sheets of regular aluminum foil to wrap the fish.",
    "Rinse and dry the skin with a paper towel to remove excess moisture.",
    "To ensure that the fish are safe to eat, rinse the skin with running water from the tap.",
    "Then, use a paper towel to absorb excess moisture from the skin and the flesh.",
    "Try to avoid soaking the inner flesh of the trout.",
    "Focus on rinsing the skin, which can harbor bacteria.",
    "Spread olive oil onto the aluminum foil and place the trout skin-side down.",
    "Using a brush or spoon, drizzle about 1 tablespoon (15 mL) of olive oil over the dull side of the foil, making sure to coat an area large enough to fit the fish.",
    "Then, lay the fish onto the foil, with the skin side touching the oiled part of the foil.",
    "If you don’t have olive oil, you can use a different oil, such as canola oil or avocado oil.",
    "Brush olive oil over the flesh side and sprinkle with salt and pepper.",
    "Once the fish is on the foil, brush the fish with about 1 tablespoon (15 mL) of oil.",
    "Apply a pinch of salt and pepper to the flesh and skin sides of the fish.",
    "Remember that you can apply additional salt and pepper to the trout after the fish has cooked.",
    "Oversalting can sometimes cause the fish to become dry and will compromise the taste of your dish!",
    "Place 2 sprigs of parsley and 2 lemon slices on the flesh of each filet.",
    "For additional flavor, lay 2 whole sprigs of parsley in the middle of the fish, and top them with 2 lemon slices.",
    "As the foil packets heat up, these will infuse the trout with a refreshing citrus taste that isn’t overpowering.",
    "If you don’t have parsley available, you can substitute sprigs of dill or rosemary for a similar effect.",
    "Fold the foil into a packet so that the fish is completely wrapped.",
    "Using your hands, bring the edges of the foil up and over the sides of the fish, and fold the ends of the packet over 2 times to seal in the moisture.",
    "Make sure there are no holes in the sides of the packets where steam might escape.",
    "If the foil tears while you’re folding the packet, simply wrap another piece of foil around the torn packet.",
    "Baking and Serving the Trout Arrange the packets to lay flat on a baking sheet.",
    "Leave about 1 to 2 inches (2.5 to 5.1 cm) of space in between each packet on the baking sheet.",
    "Make sure each packet is placed on the sheet with the folded part of the foil facing up.",
    "Spread the packets across the sheet as evenly as possible.",
    "Piling all of the packets on one side can lead to uneven cooking temperatures.",
    "Bake the fish on a baking sheet for 10-15 minutes.",
    "After the fish have been in the oven for 10 minutes, remove them and carefully open one of the packets.",
    "Flake off a small piece of the flesh to make sure that it’s properly cooked.",
    "If the flesh doesn’t flake, place the fish back into the oven for an additional 2-3 minutes.",
    "Cut open the foil packets to release the steam.",
    "Once the packets have cooled for 1-2 minutes, use scissors to cut the packets carefully across the top.",
    "Keep your fingers away from the openings to avoid getting burned by the steam!",
    "After the steam rises from the packets, you can use your hands to carefully pull the sides of the foil away from the fish.",
    "Broil the opened packets for 3 minutes if you want a browned top.",
    "If you like a crispy, browned top on your fish, turn your oven to its broil setting.",
    "Then, slide the trout in open packets back into the oven to cook for an additional 3 minutes.",
    "This method will also make the parsley and lemon on the fish slightly crispy.",
    "Add more herbs, fresh lemon slices, salt, and pepper to taste.",
    "The herbs and lemon slices inside of the packet will likely be slightly wilted once the fish is ready to serve.",
    "Replace them with fresh sprigs of parsley and lemon slices, and sprinkle salt and pepper over the skin to taste.",
    "If you want extra flavor, pour the juices left in the foil packet over the flesh of the trout before adding the seasons.",
    "For leftover trout, seal the fish in an airtight container and place it in the refrigerator, where it will remain fresh for up to 3 days.",
    "If the trout is still in its foil packet, you can leave it wrapped in the foil as long as it’s inside of an airtight container."
  ],
  "tyn_section":[
    "Heavy duty aluminum foil",
    "Rainbow trout, butterflied",
    "Oven",
    "Baking sheet",
    "Lemon",
    "Fresh parsley",
    "Salt and pepper",
    "Kitchen shears"
  ],
  "tyn_model":[
    "foil",
    "oven",
    "trout",
    "lemon",
    "parsley",
    "olive oil",
    "salt and pepper",
    "heavy duty aluminum foil",
    "baking sheet",
    "aluminum foil",
    "paper towel",
    "fish",
    "herbs",
    "airtight container",
    "water",
    "canola oil",
    "avocado oil",
    "oil",
    "dill",
    "rosemary",
    "scissors",
    "broil",
    "salt",
    "pepper",
    "foil packet",
    "refrigerator"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.1923076923,
    "f1":0.2941176471,
    "avg_pos":0.2692307692
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.2692307692,
    "f1":0.3962264151
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.3461538462,
    "f1":0.4736842105
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.1923076923,
    "f1":0.2941176471
  }
}