{
  "title":"How to Decorate Felt",
  "url":"https://www.wikihow.com/Decorate-Felt",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Stitching Felt",
      "steps":[
        {
          "headline":"Choose your desired pattern.",
          "description":"You might want to sew your name or a logo into something you own. If you're starting out with felt, you should go for shapes like a star or a square. When you get more experienced you can go for things like animals or flowers. Felt stretches so it’s a bad idea to use it on tight pieces of clothing as the design will become distorted quite easily."
        },
        {
          "headline":"Press the felt lightly with a steam iron before stitching.",
          "description":"The logic here is that you want your felt to be as flat as possible before use. Stitching creased felt into your project is a bad idea as it will be very difficult to get the creases out later. Do not iron the felt. The heat from ironing the felt will damage the fibers and alter the shape of the felt, ruining your design."
        },
        {
          "headline":"Lay your design as flat as possible on the garment.",
          "description":"To keep both items steady and connected, slide a pin through the center of the felt and the backing garment. Make sure to keep both items as flat as you can."
        },
        {
          "headline":"Measure your thread so it is 5 times longer than the area you're going to stitch.",
          "description":"During the stitching, you are going to have to remove a stitch at least once and this means you will have to unthread your needle. Thread the needle and knot the end of the thread."
        },
        {
          "headline":"Outline a smaller shape about .25 inches (0.64 cm) inside the edges of your design.",
          "description":"Use a marker or a pencil if you're afraid of making a mistake.This smaller shape will be where you stitch the felt and garment together."
        },
        {
          "headline":"Put your needle through the back of your garment and through the felt.",
          "description":"This is an important step as it decides how far apart your stitches will be from each other."
        },
        {
          "headline":"Put the needle back down through the felt and garment at another point on the outline.",
          "description":"Use a short distance for best results. Felt is a compact material and short stitching will bind it together more effectively than long stitching."
        },
        {
          "headline":"Sew along the outline.",
          "description":"Push the needle through the outline and pull it back through at another point. Repeat this until you've finished stitching the outline of the shape."
        },
        {
          "headline":"Insert your needle under the loop of the first stitch you made.",
          "description":"Once you reach the end of the outline, stitch from right to left under the first stitch you made. Pull your thread through to the back and knot it securely. Cut the excess thread with a scissors. Congratulations! You've sewn your felt onto your garment. It might not be perfect the first time, but with practice you'll improve very quickly."
        }
      ]
    },
    {
      "name":"Embroidering Felt with a Stabilizer",
      "steps":[
        {
          "headline":"Cut out a square patch of felt and an equally large patch of stabilizer.",
          "description":"For your first project, you should start small, cutting out 2 inches (5.1 cm) patches of both materials. No matter what shape your design is, cut out square patches of each material. A rotary cutter could be used to efficiently cut out a large amount of squares in one sitting."
        },
        {
          "headline":"Print out your design or outline it with black marker.",
          "description":"If you’ve drawn your design, make sure the outline is easy to see through tracing paper. If you found your design online, print it out in black and white for easiest visibility."
        },
        {
          "headline":"Trace your design onto the stabilizer.",
          "description":"Lay the stabilizer flat on your design and using a pen or marker with a thin point, trace your design as precisely as possible."
        },
        {
          "headline":"Attach the stabilizer to the felt.",
          "description":"Using pins, stick the stabilizer with your design directly on top of your square of felt. You should make sure the stabilizer fits neatly over the felt."
        },
        {
          "headline":"Embroider the design onto the felt.",
          "description":"Start at a corner or where two points meet. If your design is a circle, start at any point. Stitch along the shape. Push the needle through the felt and stabilizer and pull it back out as close as possible to the entry point. Repeat this for the rest of your design. This is all about practice. You won't get it perfect on your very first try but be patient and take your time. Make sure to not pull the stitches through the stabilizer. When finished, cut the thread."
        },
        {
          "headline":"Remove the stabilizer.",
          "description":"While the stabilizer you used is called “tear away” stabilizer, tearing it off now could damage or ruin all the work you’ve done on the felt. Use scissors to cut the stabilizer. Use tweezers or small pliers to remove it from the stitches. Be careful and patient here. It’s easy to make a mistake if you’re not being cautious."
        }
      ]
    },
    {
      "name":"Cutting Felt with Scissors",
      "steps":[
        {
          "headline":"Trace your design.",
          "description":"Lay the freezer paper with the stickier side faced down on top of your desired design. Use a pen with a thin nib to be as accurate as possible."
        },
        {
          "headline":"Use scissors to cut out your designs.",
          "description":"Cut around each shape and try and stay ¼ of an inch away from the outline of the design. There is no need to try and be too accurate with cutting at this stage."
        },
        {
          "headline":"Iron the freezer paper to your felt.",
          "description":"Using a warm or medium hot iron, gently press the iron over the freezer paper, staying on no area for more than two seconds. When finished, the paper should be stuck to your paper but you should still be able to pull away with a bit of force. If it’s coming off to easily, press it again until it sticks properly."
        },
        {
          "headline":"Cut out the shapes along the trace lines.",
          "description":"Using your fabric or sewing scissors to adequately cut the felt and paper, cut the trace lines as close as possible. Ideally you want to cut slightly inside the trace lines to be safe. You don’t want the lines to be visible on the finished product."
        },
        {
          "headline":"Peel away the freezer paper.",
          "description":"With the freezer paper gone, you are now left with perfectly cut felt pieces of your designs. The designs are now ready to be sewn onto any garment you’d like."
        }
      ]
    }
  ],
  "text":" Stitching Felt Choose your desired pattern. You might want to sew your name or a logo into something you own. If you're starting out with felt, you should go for shapes like a star or a square. When you get more experienced you can go for things like animals or flowers. Felt stretches so it’s a bad idea to use it on tight pieces of clothing as the design will become distorted quite easily. Press the felt lightly with a steam iron before stitching. The logic here is that you want your felt to be as flat as possible before use. Stitching creased felt into your project is a bad idea as it will be very difficult to get the creases out later. Do not iron the felt. The heat from ironing the felt will damage the fibers and alter the shape of the felt, ruining your design. Lay your design as flat as possible on the garment. To keep both items steady and connected, slide a pin through the center of the felt and the backing garment. Make sure to keep both items as flat as you can. Measure your thread so it is 5 times longer than the area you're going to stitch. During the stitching, you are going to have to remove a stitch at least once and this means you will have to unthread your needle. Thread the needle and knot the end of the thread. Outline a smaller shape about .25 inches (0.64 cm) inside the edges of your design. Use a marker or a pencil if you're afraid of making a mistake.This smaller shape will be where you stitch the felt and garment together. Put your needle through the back of your garment and through the felt. This is an important step as it decides how far apart your stitches will be from each other. Put the needle back down through the felt and garment at another point on the outline. Use a short distance for best results. Felt is a compact material and short stitching will bind it together more effectively than long stitching. Sew along the outline. Push the needle through the outline and pull it back through at another point. Repeat this until you've finished stitching the outline of the shape. Insert your needle under the loop of the first stitch you made. Once you reach the end of the outline, stitch from right to left under the first stitch you made. Pull your thread through to the back and knot it securely. Cut the excess thread with a scissors. Congratulations! You've sewn your felt onto your garment. It might not be perfect the first time, but with practice you'll improve very quickly. Embroidering Felt with a Stabilizer Cut out a square patch of felt and an equally large patch of stabilizer. For your first project, you should start small, cutting out 2 inches (5.1 cm) patches of both materials. No matter what shape your design is, cut out square patches of each material. A rotary cutter could be used to efficiently cut out a large amount of squares in one sitting. Print out your design or outline it with black marker. If you’ve drawn your design, make sure the outline is easy to see through tracing paper. If you found your design online, print it out in black and white for easiest visibility. Trace your design onto the stabilizer. Lay the stabilizer flat on your design and using a pen or marker with a thin point, trace your design as precisely as possible. Attach the stabilizer to the felt. Using pins, stick the stabilizer with your design directly on top of your square of felt. You should make sure the stabilizer fits neatly over the felt. Embroider the design onto the felt. Start at a corner or where two points meet. If your design is a circle, start at any point. Stitch along the shape. Push the needle through the felt and stabilizer and pull it back out as close as possible to the entry point. Repeat this for the rest of your design. This is all about practice. You won't get it perfect on your very first try but be patient and take your time. Make sure to not pull the stitches through the stabilizer. When finished, cut the thread. Remove the stabilizer. While the stabilizer you used is called “tear away” stabilizer, tearing it off now could damage or ruin all the work you’ve done on the felt. Use scissors to cut the stabilizer. Use tweezers or small pliers to remove it from the stitches. Be careful and patient here. It’s easy to make a mistake if you’re not being cautious. Cutting Felt with Scissors Trace your design. Lay the freezer paper with the stickier side faced down on top of your desired design. Use a pen with a thin nib to be as accurate as possible. Use scissors to cut out your designs. Cut around each shape and try and stay ¼ of an inch away from the outline of the design. There is no need to try and be too accurate with cutting at this stage. Iron the freezer paper to your felt. Using a warm or medium hot iron, gently press the iron over the freezer paper, staying on no area for more than two seconds. When finished, the paper should be stuck to your paper but you should still be able to pull away with a bit of force. If it’s coming off to easily, press it again until it sticks properly. Cut out the shapes along the trace lines. Using your fabric or sewing scissors to adequately cut the felt and paper, cut the trace lines as close as possible. Ideally you want to cut slightly inside the trace lines to be safe. You don’t want the lines to be visible on the finished product. Peel away the freezer paper. With the freezer paper gone, you are now left with perfectly cut felt pieces of your designs. The designs are now ready to be sewn onto any garment you’d like.",
  "sentences":[
    " Stitching Felt Choose your desired pattern.",
    "You might want to sew your name or a logo into something you own.",
    "If you're starting out with felt, you should go for shapes like a star or a square.",
    "When you get more experienced you can go for things like animals or flowers.",
    "Felt stretches so it’s a bad idea to use it on tight pieces of clothing as the design will become distorted quite easily.",
    "Press the felt lightly with a steam iron before stitching.",
    "The logic here is that you want your felt to be as flat as possible before use.",
    "Stitching creased felt into your project is a bad idea as it will be very difficult to get the creases out later.",
    "Do not iron the felt.",
    "The heat from ironing the felt will damage the fibers and alter the shape of the felt, ruining your design.",
    "Lay your design as flat as possible on the garment.",
    "To keep both items steady and connected, slide a pin through the center of the felt and the backing garment.",
    "Make sure to keep both items as flat as you can.",
    "Measure your thread so it is 5 times longer than the area you're going to stitch.",
    "During the stitching, you are going to have to remove a stitch at least once and this means you will have to unthread your needle.",
    "Thread the needle and knot the end of the thread.",
    "Outline a smaller shape about .25 inches (0.64 cm) inside the edges of your design.",
    "Use a marker or a pencil if you're afraid of making a mistake.This smaller shape will be where you stitch the felt and garment together.",
    "Put your needle through the back of your garment and through the felt.",
    "This is an important step as it decides how far apart your stitches will be from each other.",
    "Put the needle back down through the felt and garment at another point on the outline.",
    "Use a short distance for best results.",
    "Felt is a compact material and short stitching will bind it together more effectively than long stitching.",
    "Sew along the outline.",
    "Push the needle through the outline and pull it back through at another point.",
    "Repeat this until you've finished stitching the outline of the shape.",
    "Insert your needle under the loop of the first stitch you made.",
    "Once you reach the end of the outline, stitch from right to left under the first stitch you made.",
    "Pull your thread through to the back and knot it securely.",
    "Cut the excess thread with a scissors.",
    "Congratulations!",
    "You've sewn your felt onto your garment.",
    "It might not be perfect the first time, but with practice you'll improve very quickly.",
    "Embroidering Felt with a Stabilizer Cut out a square patch of felt and an equally large patch of stabilizer.",
    "For your first project, you should start small, cutting out 2 inches (5.1 cm) patches of both materials.",
    "No matter what shape your design is, cut out square patches of each material.",
    "A rotary cutter could be used to efficiently cut out a large amount of squares in one sitting.",
    "Print out your design or outline it with black marker.",
    "If you’ve drawn your design, make sure the outline is easy to see through tracing paper.",
    "If you found your design online, print it out in black and white for easiest visibility.",
    "Trace your design onto the stabilizer.",
    "Lay the stabilizer flat on your design and using a pen or marker with a thin point, trace your design as precisely as possible.",
    "Attach the stabilizer to the felt.",
    "Using pins, stick the stabilizer with your design directly on top of your square of felt.",
    "You should make sure the stabilizer fits neatly over the felt.",
    "Embroider the design onto the felt.",
    "Start at a corner or where two points meet.",
    "If your design is a circle, start at any point.",
    "Stitch along the shape.",
    "Push the needle through the felt and stabilizer and pull it back out as close as possible to the entry point.",
    "Repeat this for the rest of your design.",
    "This is all about practice.",
    "You won't get it perfect on your very first try but be patient and take your time.",
    "Make sure to not pull the stitches through the stabilizer.",
    "When finished, cut the thread.",
    "Remove the stabilizer.",
    "While the stabilizer you used is called “tear away” stabilizer, tearing it off now could damage or ruin all the work you’ve done on the felt.",
    "Use scissors to cut the stabilizer.",
    "Use tweezers or small pliers to remove it from the stitches.",
    "Be careful and patient here.",
    "It’s easy to make a mistake if you’re not being cautious.",
    "Cutting Felt with Scissors Trace your design.",
    "Lay the freezer paper with the stickier side faced down on top of your desired design.",
    "Use a pen with a thin nib to be as accurate as possible.",
    "Use scissors to cut out your designs.",
    "Cut around each shape and try and stay ¼ of an inch away from the outline of the design.",
    "There is no need to try and be too accurate with cutting at this stage.",
    "Iron the freezer paper to your felt.",
    "Using a warm or medium hot iron, gently press the iron over the freezer paper, staying on no area for more than two seconds.",
    "When finished, the paper should be stuck to your paper but you should still be able to pull away with a bit of force.",
    "If it’s coming off to easily, press it again until it sticks properly.",
    "Cut out the shapes along the trace lines.",
    "Using your fabric or sewing scissors to adequately cut the felt and paper, cut the trace lines as close as possible.",
    "Ideally you want to cut slightly inside the trace lines to be safe.",
    "You don’t want the lines to be visible on the finished product.",
    "Peel away the freezer paper.",
    "With the freezer paper gone, you are now left with perfectly cut felt pieces of your designs.",
    "The designs are now ready to be sewn onto any garment you’d like."
  ],
  "tyn_section":[
    "A sewing needle",
    "Thread",
    "Scissors",
    "A steam iron",
    "Pins",
    "A marker or a pencil",
    "A tear away stabilizer",
    "An embroidery needle",
    "A rotary cutter",
    "A printer or a black marker",
    "Pliers or tweezers",
    "Freezer paper or greaseproof paper",
    "A pen",
    "An iron",
    "Paper scissors",
    "Fabric scissors"
  ],
  "tyn_model":[
    "felt",
    "needle",
    "stabilizer",
    "freezer paper",
    "iron",
    "thread",
    "scissors",
    "paper",
    "steam iron",
    "pin",
    "marker",
    "pencil",
    "rotary cutter",
    "black marker",
    "tracing paper",
    "pen or marker",
    "pins",
    "“tear",
    "” stabilizer",
    "tweezers",
    "pliers",
    "pen",
    "fabric"
  ],
  "simple_metrics":{
    "r":0.1875,
    "p":0.1304347826,
    "f1":0.1538461538,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.4347826087,
    "f1":0.5128205128
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9375,
    "p":0.6956521739,
    "f1":0.7986688852
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3125,
    "p":0.2173913043,
    "f1":0.2564102564
  }
}