{
  "title":"How to Suede Paint a Wall",
  "url":"https://www.wikihow.com/Suede-Paint-a-Wall",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Preparing to Paint",
      "steps":[
        {
          "headline":"Buy suede paint.",
          "description":"Paints come in a variety of different categories of “sheen” or “finish,” which differ in how much light they allow to reflect off a wall. For this project, you’ll need to buy paint that is specifically designed to have a suede finish. Although suede paint is not the most commonly used, you can generally find it at most hardware stores like Home Depot. Ralph Lauren and Valspar both also make their own versions of brushed suede paint. You can also create a suede finish on your wall by painting a coat of suede paint over a base coat of normal paint that will show through. If you choose to go this route, make sure you buy ordinary paint as well."
        },
        {
          "headline":"Repair any cracks, holes, or other imperfections in the wall.",
          "description":"Identify any holes in the wall you plan to paint and fill them. If there are popped nails or screws in the wall that you don’t want to leave in, remove them and fill in the hole with joint or spackling compound. If you come across any exposed drywall, seal it with stain-blocking primer before filling it. To more easily spot flaws in the wall, turn off the lights, close the curtains, and hold a trouble light close to the wall to better spot holes and cracks."
        },
        {
          "headline":"Make sure the wall is clean and smooth.",
          "description":"Remove any protrusions in the wall, and dust the wall from top to bottom to get rid of any dust or dirt before you begin painting. Use sandpaper or a sanding pole to sand the wall from floor to ceiling, focusing especially on areas you had to repair in the previous step. Don’t apply too much pressure during the sanding process, especially if you’re using a sanding pole, or else you may inadvertently damage the wall itself. Use a long-reach duster to remove any dust and debris from the wall, including any grit left over from the sanding process."
        },
        {
          "headline":"Remove fixtures such as outlet plates and switch covers.",
          "description":"Before removing any fixtures, shut off the circuit breakers to the room you’ll be painting in. Using a screwdriver, carefully unscrew the fixtures from the wall and set them aside, storing them together with the screws you just removed. Remove any light fixtures attached to the wall as well. Once this is done, and any exposed light fixture wires are safely wrapped, you can restore power to the room. For larger fixtures, you can also cover them in painter’s plastic to protect them from unwanted paint, securing the plastic in place with painter’s tape."
        },
        {
          "headline":"Cover any areas you don’t want to paint.",
          "description":"Place painter’s tape over moldings or other surfaces you don’t want to paint, pressing down on the tape with a putty knife to ensure no paint bleeds through to the surface below. Lay a tarp down on the floor where you’ll be working, and cover any furniture near the wall with painter’s plastic secured with tape. If you’re able to, move furniture out of the room you intend to paint in, to protect it from wayward paint droplets and to give yourself more work space."
        },
        {
          "headline":"Mix the paint and put some in a paint pail and paint tray.",
          "description":"Don’t work directly from the gallon can your paint came in. Instead, mix the paint with a wooden paint stick, and pour about 1 inch (2.5 cm) into a paint pail and into a paint tray respectively. This will prevent you from dipping your brush too deeply and will give you a much lighter can of paint to work with. You will use the paint in the pail when painting with your brush, and use the paint in the tray when painting with your roller."
        }
      ]
    },
    {
      "name":"Applying the Paint",
      "steps":[
        {
          "headline":"Paint along the edges of the wall before applying the base coat.",
          "description":"Before you begin painting with the roller, use your brush to first paint those parts of the wall that are too tight for rollers, such as along the ceiling line, molding, and corners of the wall. Dip your brush so that about ⅔ of the bristles are loaded with paint. Paint using horizontal and vertical strokes as you paint alongside the ceiling or the side of the wall, respectively. Your paint strokes should run for roughly 12 inches (30 cm) at a time. The technical term for this part of the painting process is “cutting in.”\nIf you’re suede painting your wall by painting suede paint over ordinary paint, make sure you’re using the ordinary paint at this point. You won’t be using your suede paint until you apply the top coat. Use a slight wiggling motion to apply paint in tight corners or to fill in areas you missed on your first pass."
        },
        {
          "headline":"Use your roller to apply the base coat to the rest of the wall.",
          "description":"Dip your paint roller into the paint tray and begin painting in a corner of the wall near the ceiling. Apply the paint in a large “M” shape, roughly 3 feet (0.91 m) long and 3 feet (0.91 m) high, then paint over that M in a vertical rolling motion to ultimately fill in that section of wall. Repeat this process in the adjacent section of the wall, and continue repeating it until the entire wall is painted. Again, if you’re suede painting your wall by painting suede paint over ordinary paint, make sure you’re using the ordinary paint for this part of the process. Once the base coat has been applied, use the roller to apply another coat, this time only rolling from top to bottom along the entire wall, to smooth out any lap marks. Wait 4-6 hours for this base coat to dry before moving on to your top coat."
        },
        {
          "headline":"Use your brush to apply a top coat of suede paint in an X pattern.",
          "description":"The technique you use to apply this top coat will be very important; painting with overlapping X’s will create the variations in color tone typical of a suede finish. Starting in the top left corner of your wall, use your brush to paint an “X” shape roughly 1 foot (0.30 m) long and 1 foot (0.30 m) high. Then fill in the area around this X with more X’s roughly half as big and slightly overlapping one another. Repeat this process, moving diagonally across the wall in the direction of the bottom right corner, until the entire wall is painted. The sizes of your X’s do not need to be precise; in this instance, it’s more important that you use the proper technique of slightly overlapping X’s in order to bring about the suede finish."
        }
      ]
    }
  ],
  "text":" Preparing to Paint Buy suede paint. Paints come in a variety of different categories of “sheen” or “finish,” which differ in how much light they allow to reflect off a wall. For this project, you’ll need to buy paint that is specifically designed to have a suede finish. Although suede paint is not the most commonly used, you can generally find it at most hardware stores like Home Depot. Ralph Lauren and Valspar both also make their own versions of brushed suede paint. You can also create a suede finish on your wall by painting a coat of suede paint over a base coat of normal paint that will show through. If you choose to go this route, make sure you buy ordinary paint as well. Repair any cracks, holes, or other imperfections in the wall. Identify any holes in the wall you plan to paint and fill them. If there are popped nails or screws in the wall that you don’t want to leave in, remove them and fill in the hole with joint or spackling compound. If you come across any exposed drywall, seal it with stain-blocking primer before filling it. To more easily spot flaws in the wall, turn off the lights, close the curtains, and hold a trouble light close to the wall to better spot holes and cracks. Make sure the wall is clean and smooth. Remove any protrusions in the wall, and dust the wall from top to bottom to get rid of any dust or dirt before you begin painting. Use sandpaper or a sanding pole to sand the wall from floor to ceiling, focusing especially on areas you had to repair in the previous step. Don’t apply too much pressure during the sanding process, especially if you’re using a sanding pole, or else you may inadvertently damage the wall itself. Use a long-reach duster to remove any dust and debris from the wall, including any grit left over from the sanding process. Remove fixtures such as outlet plates and switch covers. Before removing any fixtures, shut off the circuit breakers to the room you’ll be painting in. Using a screwdriver, carefully unscrew the fixtures from the wall and set them aside, storing them together with the screws you just removed. Remove any light fixtures attached to the wall as well. Once this is done, and any exposed light fixture wires are safely wrapped, you can restore power to the room. For larger fixtures, you can also cover them in painter’s plastic to protect them from unwanted paint, securing the plastic in place with painter’s tape. Cover any areas you don’t want to paint. Place painter’s tape over moldings or other surfaces you don’t want to paint, pressing down on the tape with a putty knife to ensure no paint bleeds through to the surface below. Lay a tarp down on the floor where you’ll be working, and cover any furniture near the wall with painter’s plastic secured with tape. If you’re able to, move furniture out of the room you intend to paint in, to protect it from wayward paint droplets and to give yourself more work space. Mix the paint and put some in a paint pail and paint tray. Don’t work directly from the gallon can your paint came in. Instead, mix the paint with a wooden paint stick, and pour about 1 inch (2.5 cm) into a paint pail and into a paint tray respectively. This will prevent you from dipping your brush too deeply and will give you a much lighter can of paint to work with. You will use the paint in the pail when painting with your brush, and use the paint in the tray when painting with your roller. Applying the Paint Paint along the edges of the wall before applying the base coat. Before you begin painting with the roller, use your brush to first paint those parts of the wall that are too tight for rollers, such as along the ceiling line, molding, and corners of the wall. Dip your brush so that about ⅔ of the bristles are loaded with paint. Paint using horizontal and vertical strokes as you paint alongside the ceiling or the side of the wall, respectively. Your paint strokes should run for roughly 12 inches (30 cm) at a time. The technical term for this part of the painting process is “cutting in.”\nIf you’re suede painting your wall by painting suede paint over ordinary paint, make sure you’re using the ordinary paint at this point. You won’t be using your suede paint until you apply the top coat. Use a slight wiggling motion to apply paint in tight corners or to fill in areas you missed on your first pass. Use your roller to apply the base coat to the rest of the wall. Dip your paint roller into the paint tray and begin painting in a corner of the wall near the ceiling. Apply the paint in a large “M” shape, roughly 3 feet (0.91 m) long and 3 feet (0.91 m) high, then paint over that M in a vertical rolling motion to ultimately fill in that section of wall. Repeat this process in the adjacent section of the wall, and continue repeating it until the entire wall is painted. Again, if you’re suede painting your wall by painting suede paint over ordinary paint, make sure you’re using the ordinary paint for this part of the process. Once the base coat has been applied, use the roller to apply another coat, this time only rolling from top to bottom along the entire wall, to smooth out any lap marks. Wait 4-6 hours for this base coat to dry before moving on to your top coat. Use your brush to apply a top coat of suede paint in an X pattern. The technique you use to apply this top coat will be very important; painting with overlapping X’s will create the variations in color tone typical of a suede finish. Starting in the top left corner of your wall, use your brush to paint an “X” shape roughly 1 foot (0.30 m) long and 1 foot (0.30 m) high. Then fill in the area around this X with more X’s roughly half as big and slightly overlapping one another. Repeat this process, moving diagonally across the wall in the direction of the bottom right corner, until the entire wall is painted. The sizes of your X’s do not need to be precise; in this instance, it’s more important that you use the proper technique of slightly overlapping X’s in order to bring about the suede finish.",
  "sentences":[
    " Preparing to Paint Buy suede paint.",
    "Paints come in a variety of different categories of “sheen” or “finish,” which differ in how much light they allow to reflect off a wall.",
    "For this project, you’ll need to buy paint that is specifically designed to have a suede finish.",
    "Although suede paint is not the most commonly used, you can generally find it at most hardware stores like Home Depot.",
    "Ralph Lauren and Valspar both also make their own versions of brushed suede paint.",
    "You can also create a suede finish on your wall by painting a coat of suede paint over a base coat of normal paint that will show through.",
    "If you choose to go this route, make sure you buy ordinary paint as well.",
    "Repair any cracks, holes, or other imperfections in the wall.",
    "Identify any holes in the wall you plan to paint and fill them.",
    "If there are popped nails or screws in the wall that you don’t want to leave in, remove them and fill in the hole with joint or spackling compound.",
    "If you come across any exposed drywall, seal it with stain-blocking primer before filling it.",
    "To more easily spot flaws in the wall, turn off the lights, close the curtains, and hold a trouble light close to the wall to better spot holes and cracks.",
    "Make sure the wall is clean and smooth.",
    "Remove any protrusions in the wall, and dust the wall from top to bottom to get rid of any dust or dirt before you begin painting.",
    "Use sandpaper or a sanding pole to sand the wall from floor to ceiling, focusing especially on areas you had to repair in the previous step.",
    "Don’t apply too much pressure during the sanding process, especially if you’re using a sanding pole, or else you may inadvertently damage the wall itself.",
    "Use a long-reach duster to remove any dust and debris from the wall, including any grit left over from the sanding process.",
    "Remove fixtures such as outlet plates and switch covers.",
    "Before removing any fixtures, shut off the circuit breakers to the room you’ll be painting in.",
    "Using a screwdriver, carefully unscrew the fixtures from the wall and set them aside, storing them together with the screws you just removed.",
    "Remove any light fixtures attached to the wall as well.",
    "Once this is done, and any exposed light fixture wires are safely wrapped, you can restore power to the room.",
    "For larger fixtures, you can also cover them in painter’s plastic to protect them from unwanted paint, securing the plastic in place with painter’s tape.",
    "Cover any areas you don’t want to paint.",
    "Place painter’s tape over moldings or other surfaces you don’t want to paint, pressing down on the tape with a putty knife to ensure no paint bleeds through to the surface below.",
    "Lay a tarp down on the floor where you’ll be working, and cover any furniture near the wall with painter’s plastic secured with tape.",
    "If you’re able to, move furniture out of the room you intend to paint in, to protect it from wayward paint droplets and to give yourself more work space.",
    "Mix the paint and put some in a paint pail and paint tray.",
    "Don’t work directly from the gallon can your paint came in.",
    "Instead, mix the paint with a wooden paint stick, and pour about 1 inch (2.5 cm) into a paint pail and into a paint tray respectively.",
    "This will prevent you from dipping your brush too deeply and will give you a much lighter can of paint to work with.",
    "You will use the paint in the pail when painting with your brush, and use the paint in the tray when painting with your roller.",
    "Applying the Paint Paint along the edges of the wall before applying the base coat.",
    "Before you begin painting with the roller, use your brush to first paint those parts of the wall that are too tight for rollers, such as along the ceiling line, molding, and corners of the wall.",
    "Dip your brush so that about ⅔ of the bristles are loaded with paint.",
    "Paint using horizontal and vertical strokes as you paint alongside the ceiling or the side of the wall, respectively.",
    "Your paint strokes should run for roughly 12 inches (30 cm) at a time.",
    "The technical term for this part of the painting process is “cutting in.”\nIf you’re suede painting your wall by painting suede paint over ordinary paint, make sure you’re using the ordinary paint at this point.",
    "You won’t be using your suede paint until you apply the top coat.",
    "Use a slight wiggling motion to apply paint in tight corners or to fill in areas you missed on your first pass.",
    "Use your roller to apply the base coat to the rest of the wall.",
    "Dip your paint roller into the paint tray and begin painting in a corner of the wall near the ceiling.",
    "Apply the paint in a large “M” shape, roughly 3 feet (0.91 m) long and 3 feet (0.91 m) high, then paint over that M in a vertical rolling motion to ultimately fill in that section of wall.",
    "Repeat this process in the adjacent section of the wall, and continue repeating it until the entire wall is painted.",
    "Again, if you’re suede painting your wall by painting suede paint over ordinary paint, make sure you’re using the ordinary paint for this part of the process.",
    "Once the base coat has been applied, use the roller to apply another coat, this time only rolling from top to bottom along the entire wall, to smooth out any lap marks.",
    "Wait 4-6 hours for this base coat to dry before moving on to your top coat.",
    "Use your brush to apply a top coat of suede paint in an X pattern.",
    "The technique you use to apply this top coat will be very important; painting with overlapping X’s will create the variations in color tone typical of a suede finish.",
    "Starting in the top left corner of your wall, use your brush to paint an “X” shape roughly 1 foot (0.30 m) long and 1 foot (0.30 m) high.",
    "Then fill in the area around this X with more X’s roughly half as big and slightly overlapping one another.",
    "Repeat this process, moving diagonally across the wall in the direction of the bottom right corner, until the entire wall is painted.",
    "The sizes of your X’s do not need to be precise; in this instance, it’s more important that you use the proper technique of slightly overlapping X’s in order to bring about the suede finish."
  ],
  "tyn_section":[
    "Brushed suede paint",
    "Paint brush",
    "Paint roller",
    "Paint pail",
    "Paint tray",
    "Painter’s tape",
    "Painter’s plastic",
    "Sandpaper or a sanding pole",
    "Spackling compound or joint compound",
    "Wooden paint stick",
    "Screwdriver",
    "Tarp"
  ],
  "tyn_model":[
    "paint",
    "suede paint",
    "brush",
    "ordinary paint",
    "paint tray",
    "roller",
    "sanding pole",
    "painter’s plastic",
    "painter’s tape",
    "paint pail",
    "” shape",
    "paints",
    "“sheen",
    "” or",
    "“finish",
    "” which",
    "sandpaper",
    "circuit breakers",
    "screwdriver",
    "light fixture",
    "putty knife",
    "tarp",
    "tape",
    "wooden paint stick",
    "paint paint",
    "⅔ of",
    "“cutting",
    "”\n",
    "paint roller",
    "“m",
    "“x",
    "suede"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.25,
    "f1":0.3636363636,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.4375,
    "f1":0.5737704918
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9166666667,
    "p":0.53125,
    "f1":0.6726618705
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.28125,
    "f1":0.4090909091
  }
}