{
  "title":"How to Cook Banana",
  "url":"https://www.wikihow.com/Cook-Banana",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Pan-Frying Bananas",
      "steps":[
        {
          "headline":"Peel your bananas.",
          "description":"Use recently ripened bananas with no black spots or bruising on the peel. To open the banana peel, pinch the end opposite the stem and pull it apart. It's much easier to open a peel this way. There's also a smaller chance of damaging the banana itself."
        },
        {
          "headline":"Cut your bananas into .5 inches (1.3 cm) thick slices.",
          "description":"After you've peeled your bananas, slice them into.5 inches (1.3 cm) thick segments with a knife. It can be quite tricky to slice a curved banana evenly but do your best to slice the bananas as evenly as possible."
        },
        {
          "headline":"Add your ingredients to a pan and heat the pan for 3 minutes.",
          "description":"Put your honey, cinnamon, salt, oil or butter, into the pan and heat it so the oil or butter warms up. It's up to you what oil you want to use here. The best oils to use are coconut oil or butter. You can use any neutral oil in place of coconut oil or butter."
        },
        {
          "headline":"Add the banana slices to the pan and cook for 4 to 5 minutes.",
          "description":"When the bananas start to get sticky and turn a brownish gold in color, the banana slices have started to caramelize. Frequently stir the bananas as they cook to prevent burning. The bananas are burning if they start to turn dark brown and lose their gold color. Electric stoves are less powerful than gas stoves. Turn your electric stove to medium high heat. Gas stoves should work fine at medium heat."
        },
        {
          "headline":"Remove your slices from the pan and serve.",
          "description":"Once the bananas have caramelized, remove them from the pan and place them as a topping on another food or serve them as they are on a plate. You can eat the caramelized bananas in a sandwich or on French toast."
        }
      ]
    },
    {
      "name":"Baking Your Bananas",
      "steps":[
        {
          "headline":"Preheat your oven to 200 °C (392 °F).",
          "description":"If you have a gas oven, gas mark number 6 should preheat your gas oven to the same temperature. Preheating your oven to 200 °C (392 °F) will ensure that your bananas are properly baked when they are placed in the oven."
        },
        {
          "headline":"Place your unpeeled ripe bananas on a baking tray.",
          "description":"It's vital for this method that you don't peel your bananas beforehand. Make sure the bananas aren't touching each other on the tray. The peel acts as a coating and ensures that your bananas get well baked in the oven."
        },
        {
          "headline":"Put the tray in the oven for 20 minutes.",
          "description":"After the 20 minutes are up, take your bananas out of the oven using oven gloves. Lay the tray down for 1 minute to let the bananas cool down."
        },
        {
          "headline":"Peel the bananas and sprinkle them with sugar and drizzle with juice.",
          "description":"Peel the bananas while they're still hot. Lightly sprinkle the peeled bananas with your brown sugar. A quick sprinkle of your chosen juice should be enough to add some taste. Don't add more than 25 millilitres (0.0066 US gal) of juice."
        },
        {
          "headline":"Serve your bananas with whipped cream.",
          "description":"Place your bananas on a plate and either spray the whipped cream on the side of the plate or on top of the bananas."
        }
      ]
    },
    {
      "name":"Microwaving Your Bananas",
      "steps":[
        {
          "headline":"Peel and slice your bananas and place them into a bowl.",
          "description":"Remove the peel by pinching the opposite side to the stem and peel the skin away. Slice your bananas into .5 inches (1.3 cm) thick pieces."
        },
        {
          "headline":"Add your honey and juice to the bowl.",
          "description":"Pour all of your honey and either your lemon or lime juice to the bowl to enhance the flavor of the banana. Try to ensure that the honey and juice are evenly spread across all of the banana slices. You can use orange juice if you'd like. Be wary of the stark contrast in flavor between orange juice and the banana."
        },
        {
          "headline":"Cover the bowl with plastic wrapping and microwave it for 90 seconds.",
          "description":"Make sure your bowl is suitable for microwaving. Put the microwave on at either medium or medium-high heat. To find out if your bowl is safe for microwaving, check underneath the bowl for symbols with wavy lines. These symbols indicate that the bowl is safe to use in a microwave."
        },
        {
          "headline":"Serve after allowing the dish to cool or serve hot.",
          "description":"If you're serving the bananas hot, add some vanilla ice cream to the bowl to enhance the taste and provide a contrast to the heat. It's up to you what you add to the bowl. You can add roasted nuts, maple syrup, whatever you'd like to make it suit your tastes."
        }
      ]
    }
  ],
  "text":" Pan-Frying Bananas Peel your bananas. Use recently ripened bananas with no black spots or bruising on the peel. To open the banana peel, pinch the end opposite the stem and pull it apart. It's much easier to open a peel this way. There's also a smaller chance of damaging the banana itself. Cut your bananas into .5 inches (1.3 cm) thick slices. After you've peeled your bananas, slice them into.5 inches (1.3 cm) thick segments with a knife. It can be quite tricky to slice a curved banana evenly but do your best to slice the bananas as evenly as possible. Add your ingredients to a pan and heat the pan for 3 minutes. Put your honey, cinnamon, salt, oil or butter, into the pan and heat it so the oil or butter warms up. It's up to you what oil you want to use here. The best oils to use are coconut oil or butter. You can use any neutral oil in place of coconut oil or butter. Add the banana slices to the pan and cook for 4 to 5 minutes. When the bananas start to get sticky and turn a brownish gold in color, the banana slices have started to caramelize. Frequently stir the bananas as they cook to prevent burning. The bananas are burning if they start to turn dark brown and lose their gold color. Electric stoves are less powerful than gas stoves. Turn your electric stove to medium high heat. Gas stoves should work fine at medium heat. Remove your slices from the pan and serve. Once the bananas have caramelized, remove them from the pan and place them as a topping on another food or serve them as they are on a plate. You can eat the caramelized bananas in a sandwich or on French toast. Baking Your Bananas Preheat your oven to 200 °C (392 °F). If you have a gas oven, gas mark number 6 should preheat your gas oven to the same temperature. Preheating your oven to 200 °C (392 °F) will ensure that your bananas are properly baked when they are placed in the oven. Place your unpeeled ripe bananas on a baking tray. It's vital for this method that you don't peel your bananas beforehand. Make sure the bananas aren't touching each other on the tray. The peel acts as a coating and ensures that your bananas get well baked in the oven. Put the tray in the oven for 20 minutes. After the 20 minutes are up, take your bananas out of the oven using oven gloves. Lay the tray down for 1 minute to let the bananas cool down. Peel the bananas and sprinkle them with sugar and drizzle with juice. Peel the bananas while they're still hot. Lightly sprinkle the peeled bananas with your brown sugar. A quick sprinkle of your chosen juice should be enough to add some taste. Don't add more than 25 millilitres (0.0066 US gal) of juice. Serve your bananas with whipped cream. Place your bananas on a plate and either spray the whipped cream on the side of the plate or on top of the bananas. Microwaving Your Bananas Peel and slice your bananas and place them into a bowl. Remove the peel by pinching the opposite side to the stem and peel the skin away. Slice your bananas into .5 inches (1.3 cm) thick pieces. Add your honey and juice to the bowl. Pour all of your honey and either your lemon or lime juice to the bowl to enhance the flavor of the banana. Try to ensure that the honey and juice are evenly spread across all of the banana slices. You can use orange juice if you'd like. Be wary of the stark contrast in flavor between orange juice and the banana. Cover the bowl with plastic wrapping and microwave it for 90 seconds. Make sure your bowl is suitable for microwaving. Put the microwave on at either medium or medium-high heat. To find out if your bowl is safe for microwaving, check underneath the bowl for symbols with wavy lines. These symbols indicate that the bowl is safe to use in a microwave. Serve after allowing the dish to cool or serve hot. If you're serving the bananas hot, add some vanilla ice cream to the bowl to enhance the taste and provide a contrast to the heat. It's up to you what you add to the bowl. You can add roasted nuts, maple syrup, whatever you'd like to make it suit your tastes.",
  "sentences":[
    " Pan-Frying Bananas Peel your bananas.",
    "Use recently ripened bananas with no black spots or bruising on the peel.",
    "To open the banana peel, pinch the end opposite the stem and pull it apart.",
    "It's much easier to open a peel this way.",
    "There's also a smaller chance of damaging the banana itself.",
    "Cut your bananas into .5 inches (1.3 cm) thick slices.",
    "After you've peeled your bananas, slice them into.5 inches (1.3 cm) thick segments with a knife.",
    "It can be quite tricky to slice a curved banana evenly but do your best to slice the bananas as evenly as possible.",
    "Add your ingredients to a pan and heat the pan for 3 minutes.",
    "Put your honey, cinnamon, salt, oil or butter, into the pan and heat it so the oil or butter warms up.",
    "It's up to you what oil you want to use here.",
    "The best oils to use are coconut oil or butter.",
    "You can use any neutral oil in place of coconut oil or butter.",
    "Add the banana slices to the pan and cook for 4 to 5 minutes.",
    "When the bananas start to get sticky and turn a brownish gold in color, the banana slices have started to caramelize.",
    "Frequently stir the bananas as they cook to prevent burning.",
    "The bananas are burning if they start to turn dark brown and lose their gold color.",
    "Electric stoves are less powerful than gas stoves.",
    "Turn your electric stove to medium high heat.",
    "Gas stoves should work fine at medium heat.",
    "Remove your slices from the pan and serve.",
    "Once the bananas have caramelized, remove them from the pan and place them as a topping on another food or serve them as they are on a plate.",
    "You can eat the caramelized bananas in a sandwich or on French toast.",
    "Baking Your Bananas Preheat your oven to 200 °C (392 °F).",
    "If you have a gas oven, gas mark number 6 should preheat your gas oven to the same temperature.",
    "Preheating your oven to 200 °C (392 °F) will ensure that your bananas are properly baked when they are placed in the oven.",
    "Place your unpeeled ripe bananas on a baking tray.",
    "It's vital for this method that you don't peel your bananas beforehand.",
    "Make sure the bananas aren't touching each other on the tray.",
    "The peel acts as a coating and ensures that your bananas get well baked in the oven.",
    "Put the tray in the oven for 20 minutes.",
    "After the 20 minutes are up, take your bananas out of the oven using oven gloves.",
    "Lay the tray down for 1 minute to let the bananas cool down.",
    "Peel the bananas and sprinkle them with sugar and drizzle with juice.",
    "Peel the bananas while they're still hot.",
    "Lightly sprinkle the peeled bananas with your brown sugar.",
    "A quick sprinkle of your chosen juice should be enough to add some taste.",
    "Don't add more than 25 millilitres (0.0066 US gal) of juice.",
    "Serve your bananas with whipped cream.",
    "Place your bananas on a plate and either spray the whipped cream on the side of the plate or on top of the bananas.",
    "Microwaving Your Bananas Peel and slice your bananas and place them into a bowl.",
    "Remove the peel by pinching the opposite side to the stem and peel the skin away.",
    "Slice your bananas into .5 inches (1.3 cm) thick pieces.",
    "Add your honey and juice to the bowl.",
    "Pour all of your honey and either your lemon or lime juice to the bowl to enhance the flavor of the banana.",
    "Try to ensure that the honey and juice are evenly spread across all of the banana slices.",
    "You can use orange juice if you'd like.",
    "Be wary of the stark contrast in flavor between orange juice and the banana.",
    "Cover the bowl with plastic wrapping and microwave it for 90 seconds.",
    "Make sure your bowl is suitable for microwaving.",
    "Put the microwave on at either medium or medium-high heat.",
    "To find out if your bowl is safe for microwaving, check underneath the bowl for symbols with wavy lines.",
    "These symbols indicate that the bowl is safe to use in a microwave.",
    "Serve after allowing the dish to cool or serve hot.",
    "If you're serving the bananas hot, add some vanilla ice cream to the bowl to enhance the taste and provide a contrast to the heat.",
    "It's up to you what you add to the bowl.",
    "You can add roasted nuts, maple syrup, whatever you'd like to make it suit your tastes."
  ],
  "tyn_section":[
    "Pan-Fried Bananas",
    "A knife",
    "A frying pan",
    "A gas or electric stove",
    "Oven Baked Bananas",
    "A gas or electric oven",
    "A baking tray",
    "Microwaved Bananas",
    "A microwave",
    "A microwave-safe bowl",
    "Plastic wrapping"
  ],
  "tyn_model":[
    "bananas",
    "bowl",
    "banana",
    "oven",
    "honey",
    "tray",
    "microwave",
    "pan",
    "coconut oil",
    "butter",
    "whipped cream",
    "plate",
    "orange juice",
    "knife",
    "cinnamon",
    "salt",
    "oil or butter",
    "oil",
    "electric stove",
    "gas oven",
    "baking tray",
    "oven gloves",
    "sugar",
    "brown sugar",
    "lemon",
    "plastic wrapping",
    "vanilla ice cream",
    "maple syrup"
  ],
  "simple_metrics":{
    "r":0.0909090909,
    "p":0.0357142857,
    "f1":0.0512820513,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5454545455,
    "p":0.1785714286,
    "f1":0.269058296
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3928571429,
    "f1":0.5641025641
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1818181818,
    "p":0.0714285714,
    "f1":0.1025641026
  }
}