{
  "title":"How to Cook Frozen Prawns",
  "url":"https://www.wikihow.com/Cook-Frozen-Prawns",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Cooking Frozen Prawns without Thawing",
      "steps":[
        {
          "headline":"Rinse the prawns to remove ice crystals for baking or sautéing.",
          "description":"Place the prawns in a colander and run them under water quickly. You just want to break up the clumps and remove any excess ice crystals on the outside of the prawns. If you're using a wet cooking method, such as poaching, you can simply bang the bag on the counter to break up the clumps. There's no need to rinse. You can use shelled or unshelled prawns for these cooking methods."
        },
        {
          "headline":"Poach the prawns in boiling water with additional flavors.",
          "description":"Fill a small pot with water, and place it over high heat. Stir in several heavy pinches of salt and any spices or flavors you'd like. Bring the pot to a boil, and then remove it from the heat. Stir in the prawns, and cover the pot. The prawns should be done in 5-6 minutes, when they're pink and opaque. Add in aromatics and other flavors like half a lemon with the juice squeezed in, 3-4 garlic cloves, 1/4 of an onion, a handful of parsley, and/or 12-15 peppercorns. The amounts do not need to be precise, as they are just adding flavor. You can be as light or as heavy-handed as you'd like. Try a 1/2 a teaspoon (2.5 g) of salt to 8 to 9 cups (1.9 to 2.1 L) of water, which will easily hold 1 pound (0.45 kg) of prawns."
        },
        {
          "headline":"Roast the prawns in a hot oven.",
          "description":"Place the rack in the oven about 6 inches (15 cm) from the broiler. Turn on the broiler, and place a rimmed baking sheet in the oven to heat for 10 minutes. Toss the frozen, rinsed prawns in the seasoning mix of your choice, such as a Cajun seasoning mix. Once the pan is hot, pull it out with a oven mitt, and pour the prawns on the pan. Put them back in the oven to cook for about 5 minutes. You can make your own Cajun blend or simply buy some from the store. You could also use taco seasoning or just sprinkle on some rosemary, basil, and garlic. The prawns will curl slightly when they're done. If the prawns clump up as you pour them, use tongs to spread them out."
        },
        {
          "headline":"Sauté prawns in a pan with a little oil and garlic.",
          "description":"Heat a pan on the stove to high heat, and pour in a spoonful of olive oil and a couple of pats of butter. Cook 1-2 cloves of minced garlic in the pan for about 1 minute. Pat the prawns dry, and add them to the oil. Sprinkle on some salt and pepper. Cook them 5-7 minutes, stirring frequently, until they turn pink. Try not to crowd the prawns, as they won't sear as well."
        }
      ]
    },
    {
      "name":"Defrosting Frozen Prawns",
      "steps":[
        {
          "headline":"Place the prawns in the refrigerator overnight.",
          "description":"This method takes a while, but it's also the easiest. Simply take the prawns out of their freezer bag, and put them in a covered dish. Set them in the refrigerator. They should be defrosted the next day. Once they're defrosted, they're ready to cook."
        },
        {
          "headline":"Soak the prawns in salt water for about 20 minutes.",
          "description":"For a rapid defrost, add 2 tablespoons (29.6 ml) (34 g) of salt to 4 cups (0.95 L) of cold water. Take the prawns out of the bag, and add them to the water, making sure they are completely submerged. Leave them for 20 minutes. Drain the water off once the prawns are defrosted. They should feel squishy rather than solid. The salt helps add flavor to the prawns. Do not refreeze the defrosted prawns without cooking them."
        },
        {
          "headline":"Thaw prawns under running water for the fastest method.",
          "description":"Put the prawns in a colander, and place them under running water. As the water runs, move the prawns around to help incorporate the water. This method typically takes 5-10 minutes to defrost the prawns. Make sure your water is cool. Warm water can begin to cook the prawns. Don't refreeze the prawns without cooking them first."
        },
        {
          "headline":"Avoid defrosting prawns in the microwave.",
          "description":"While you can use the microwave to thaw prawns, you'll likely end up partially cooking them while doing it. You're more likely to end up with chewy, rubbery prawns if you defrost them this way."
        }
      ]
    },
    {
      "name":"Cooking Defrosted Prawns",
      "steps":[
        {
          "headline":"Boil prawns in salt water.",
          "description":"Add 2 tablespoons (29.6 ml) of salt (34 g) to about 8 cups (1.9 L) of water in a pot. Bring the water to a boil, and pour in the prawns. This should be enough water for about 1 pound (0.45 kg) of prawns. Once the water comes back to a boil, turn the heat down and cook the prawns for 3-6 minutes, until they turn pink and opaque. The prawns will float to the top when they're done. To stop the cooking process, you can run the prawns under cold water. You can leave the shells on to cook them this way."
        },
        {
          "headline":"Butterfly and grill the prawns.",
          "description":"Heat up the grill first. If it's a gas grill, put on medium heat. If you have a charcoal grill, let the initial heat die down some before you grill the shrimp. Cut along the back of the prawn, creating an opening. Pull the prawn open in the back, making a wide, flat prawn. Place the prawns on the grill, and cook them until they're pink and opaque, which usually takes just 3-5 minutes. If the prawns still have their shells, leave them on, but trim off the legs. You can still butterfly the prawns, even with their shells on. Adding a little oil or butter to the prawns before grilling will add flavor."
        },
        {
          "headline":"Sauté prawns in a pan.",
          "description":"Place a pan over high heat, and add a pat or 2 of butter and a spoonful of olive oil. Once the oil is hot and the butter is melted, add a little minced garlic (1-2 cloves) to the pan, and let it cook by itself for 30 seconds to 1 minute. Pour in the prawns, and sprinkle them with a dash of salt and freshly ground black pepper. You don't want to crowd the pan, but the amount you can add depends on the size of your pan. Cook them 3-5 minutes, stirring often. Take them off the heat when they turn pink. It helps to pat the prawns dry before adding them to the pan, as they will sear better. While you can leave the shells on for this process, it's easier to peel them before cooking when you're sautéing them."
        }
      ]
    }
  ],
  "text":" Cooking Frozen Prawns without Thawing Rinse the prawns to remove ice crystals for baking or sautéing. Place the prawns in a colander and run them under water quickly. You just want to break up the clumps and remove any excess ice crystals on the outside of the prawns. If you're using a wet cooking method, such as poaching, you can simply bang the bag on the counter to break up the clumps. There's no need to rinse. You can use shelled or unshelled prawns for these cooking methods. Poach the prawns in boiling water with additional flavors. Fill a small pot with water, and place it over high heat. Stir in several heavy pinches of salt and any spices or flavors you'd like. Bring the pot to a boil, and then remove it from the heat. Stir in the prawns, and cover the pot. The prawns should be done in 5-6 minutes, when they're pink and opaque. Add in aromatics and other flavors like half a lemon with the juice squeezed in, 3-4 garlic cloves, 1/4 of an onion, a handful of parsley, and/or 12-15 peppercorns. The amounts do not need to be precise, as they are just adding flavor. You can be as light or as heavy-handed as you'd like. Try a 1/2 a teaspoon (2.5 g) of salt to 8 to 9 cups (1.9 to 2.1 L) of water, which will easily hold 1 pound (0.45 kg) of prawns. Roast the prawns in a hot oven. Place the rack in the oven about 6 inches (15 cm) from the broiler. Turn on the broiler, and place a rimmed baking sheet in the oven to heat for 10 minutes. Toss the frozen, rinsed prawns in the seasoning mix of your choice, such as a Cajun seasoning mix. Once the pan is hot, pull it out with a oven mitt, and pour the prawns on the pan. Put them back in the oven to cook for about 5 minutes. You can make your own Cajun blend or simply buy some from the store. You could also use taco seasoning or just sprinkle on some rosemary, basil, and garlic. The prawns will curl slightly when they're done. If the prawns clump up as you pour them, use tongs to spread them out. Sauté prawns in a pan with a little oil and garlic. Heat a pan on the stove to high heat, and pour in a spoonful of olive oil and a couple of pats of butter. Cook 1-2 cloves of minced garlic in the pan for about 1 minute. Pat the prawns dry, and add them to the oil. Sprinkle on some salt and pepper. Cook them 5-7 minutes, stirring frequently, until they turn pink. Try not to crowd the prawns, as they won't sear as well. Defrosting Frozen Prawns Place the prawns in the refrigerator overnight. This method takes a while, but it's also the easiest. Simply take the prawns out of their freezer bag, and put them in a covered dish. Set them in the refrigerator. They should be defrosted the next day. Once they're defrosted, they're ready to cook. Soak the prawns in salt water for about 20 minutes. For a rapid defrost, add 2 tablespoons (29.6 ml) (34 g) of salt to 4 cups (0.95 L) of cold water. Take the prawns out of the bag, and add them to the water, making sure they are completely submerged. Leave them for 20 minutes. Drain the water off once the prawns are defrosted. They should feel squishy rather than solid. The salt helps add flavor to the prawns. Do not refreeze the defrosted prawns without cooking them. Thaw prawns under running water for the fastest method. Put the prawns in a colander, and place them under running water. As the water runs, move the prawns around to help incorporate the water. This method typically takes 5-10 minutes to defrost the prawns. Make sure your water is cool. Warm water can begin to cook the prawns. Don't refreeze the prawns without cooking them first. Avoid defrosting prawns in the microwave. While you can use the microwave to thaw prawns, you'll likely end up partially cooking them while doing it. You're more likely to end up with chewy, rubbery prawns if you defrost them this way. Cooking Defrosted Prawns Boil prawns in salt water. Add 2 tablespoons (29.6 ml) of salt (34 g) to about 8 cups (1.9 L) of water in a pot. Bring the water to a boil, and pour in the prawns. This should be enough water for about 1 pound (0.45 kg) of prawns. Once the water comes back to a boil, turn the heat down and cook the prawns for 3-6 minutes, until they turn pink and opaque. The prawns will float to the top when they're done. To stop the cooking process, you can run the prawns under cold water. You can leave the shells on to cook them this way. Butterfly and grill the prawns. Heat up the grill first. If it's a gas grill, put on medium heat. If you have a charcoal grill, let the initial heat die down some before you grill the shrimp. Cut along the back of the prawn, creating an opening. Pull the prawn open in the back, making a wide, flat prawn. Place the prawns on the grill, and cook them until they're pink and opaque, which usually takes just 3-5 minutes. If the prawns still have their shells, leave them on, but trim off the legs. You can still butterfly the prawns, even with their shells on. Adding a little oil or butter to the prawns before grilling will add flavor. Sauté prawns in a pan. Place a pan over high heat, and add a pat or 2 of butter and a spoonful of olive oil. Once the oil is hot and the butter is melted, add a little minced garlic (1-2 cloves) to the pan, and let it cook by itself for 30 seconds to 1 minute. Pour in the prawns, and sprinkle them with a dash of salt and freshly ground black pepper. You don't want to crowd the pan, but the amount you can add depends on the size of your pan. Cook them 3-5 minutes, stirring often. Take them off the heat when they turn pink. It helps to pat the prawns dry before adding them to the pan, as they will sear better. While you can leave the shells on for this process, it's easier to peel them before cooking when you're sautéing them.",
  "sentences":[
    " Cooking Frozen Prawns without Thawing Rinse the prawns to remove ice crystals for baking or sautéing.",
    "Place the prawns in a colander and run them under water quickly.",
    "You just want to break up the clumps and remove any excess ice crystals on the outside of the prawns.",
    "If you're using a wet cooking method, such as poaching, you can simply bang the bag on the counter to break up the clumps.",
    "There's no need to rinse.",
    "You can use shelled or unshelled prawns for these cooking methods.",
    "Poach the prawns in boiling water with additional flavors.",
    "Fill a small pot with water, and place it over high heat.",
    "Stir in several heavy pinches of salt and any spices or flavors you'd like.",
    "Bring the pot to a boil, and then remove it from the heat.",
    "Stir in the prawns, and cover the pot.",
    "The prawns should be done in 5-6 minutes, when they're pink and opaque.",
    "Add in aromatics and other flavors like half a lemon with the juice squeezed in, 3-4 garlic cloves, 1/4 of an onion, a handful of parsley, and/or 12-15 peppercorns.",
    "The amounts do not need to be precise, as they are just adding flavor.",
    "You can be as light or as heavy-handed as you'd like.",
    "Try a 1/2 a teaspoon (2.5 g) of salt to 8 to 9 cups (1.9 to 2.1 L) of water, which will easily hold 1 pound (0.45 kg) of prawns.",
    "Roast the prawns in a hot oven.",
    "Place the rack in the oven about 6 inches (15 cm) from the broiler.",
    "Turn on the broiler, and place a rimmed baking sheet in the oven to heat for 10 minutes.",
    "Toss the frozen, rinsed prawns in the seasoning mix of your choice, such as a Cajun seasoning mix.",
    "Once the pan is hot, pull it out with a oven mitt, and pour the prawns on the pan.",
    "Put them back in the oven to cook for about 5 minutes.",
    "You can make your own Cajun blend or simply buy some from the store.",
    "You could also use taco seasoning or just sprinkle on some rosemary, basil, and garlic.",
    "The prawns will curl slightly when they're done.",
    "If the prawns clump up as you pour them, use tongs to spread them out.",
    "Sauté prawns in a pan with a little oil and garlic.",
    "Heat a pan on the stove to high heat, and pour in a spoonful of olive oil and a couple of pats of butter.",
    "Cook 1-2 cloves of minced garlic in the pan for about 1 minute.",
    "Pat the prawns dry, and add them to the oil.",
    "Sprinkle on some salt and pepper.",
    "Cook them 5-7 minutes, stirring frequently, until they turn pink.",
    "Try not to crowd the prawns, as they won't sear as well.",
    "Defrosting Frozen Prawns Place the prawns in the refrigerator overnight.",
    "This method takes a while, but it's also the easiest.",
    "Simply take the prawns out of their freezer bag, and put them in a covered dish.",
    "Set them in the refrigerator.",
    "They should be defrosted the next day.",
    "Once they're defrosted, they're ready to cook.",
    "Soak the prawns in salt water for about 20 minutes.",
    "For a rapid defrost, add 2 tablespoons (29.6 ml) (34 g) of salt to 4 cups (0.95 L) of cold water.",
    "Take the prawns out of the bag, and add them to the water, making sure they are completely submerged.",
    "Leave them for 20 minutes.",
    "Drain the water off once the prawns are defrosted.",
    "They should feel squishy rather than solid.",
    "The salt helps add flavor to the prawns.",
    "Do not refreeze the defrosted prawns without cooking them.",
    "Thaw prawns under running water for the fastest method.",
    "Put the prawns in a colander, and place them under running water.",
    "As the water runs, move the prawns around to help incorporate the water.",
    "This method typically takes 5-10 minutes to defrost the prawns.",
    "Make sure your water is cool.",
    "Warm water can begin to cook the prawns.",
    "Don't refreeze the prawns without cooking them first.",
    "Avoid defrosting prawns in the microwave.",
    "While you can use the microwave to thaw prawns, you'll likely end up partially cooking them while doing it.",
    "You're more likely to end up with chewy, rubbery prawns if you defrost them this way.",
    "Cooking Defrosted Prawns Boil prawns in salt water.",
    "Add 2 tablespoons (29.6 ml) of salt (34 g) to about 8 cups (1.9 L) of water in a pot.",
    "Bring the water to a boil, and pour in the prawns.",
    "This should be enough water for about 1 pound (0.45 kg) of prawns.",
    "Once the water comes back to a boil, turn the heat down and cook the prawns for 3-6 minutes, until they turn pink and opaque.",
    "The prawns will float to the top when they're done.",
    "To stop the cooking process, you can run the prawns under cold water.",
    "You can leave the shells on to cook them this way.",
    "Butterfly and grill the prawns.",
    "Heat up the grill first.",
    "If it's a gas grill, put on medium heat.",
    "If you have a charcoal grill, let the initial heat die down some before you grill the shrimp.",
    "Cut along the back of the prawn, creating an opening.",
    "Pull the prawn open in the back, making a wide, flat prawn.",
    "Place the prawns on the grill, and cook them until they're pink and opaque, which usually takes just 3-5 minutes.",
    "If the prawns still have their shells, leave them on, but trim off the legs.",
    "You can still butterfly the prawns, even with their shells on.",
    "Adding a little oil or butter to the prawns before grilling will add flavor.",
    "Sauté prawns in a pan.",
    "Place a pan over high heat, and add a pat or 2 of butter and a spoonful of olive oil.",
    "Once the oil is hot and the butter is melted, add a little minced garlic (1-2 cloves) to the pan, and let it cook by itself for 30 seconds to 1 minute.",
    "Pour in the prawns, and sprinkle them with a dash of salt and freshly ground black pepper.",
    "You don't want to crowd the pan, but the amount you can add depends on the size of your pan.",
    "Cook them 3-5 minutes, stirring often.",
    "Take them off the heat when they turn pink.",
    "It helps to pat the prawns dry before adding them to the pan, as they will sear better.",
    "While you can leave the shells on for this process, it's easier to peel them before cooking when you're sautéing them."
  ],
  "tyn_section":[
    "Colander",
    "Pot or pan",
    "Oven mitt",
    "Salt",
    "Oil or butter, optional",
    "Seasonings, optional"
  ],
  "tyn_model":[
    "water",
    "salt",
    "garlic",
    "pan",
    "oven",
    "butter",
    "pot",
    "oil",
    "grill",
    "colander",
    "broiler",
    "olive oil",
    "refrigerator",
    "salt water",
    "microwave",
    "poaching",
    "small pot",
    "lemon",
    "onion",
    "parsley",
    "baking sheet",
    "seasoning mix",
    "cajun seasoning",
    "oven mitt",
    "taco seasoning",
    "basil",
    "stove",
    "salt and pepper",
    "freezer bag",
    "covered dish",
    "cold water",
    "gas grill",
    "charcoal grill",
    "shrimp",
    "freshly ground black pepper"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0857142857,
    "f1":0.1463414634,
    "avg_pos":0.2571428571
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1428571429,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.2285714286,
    "f1":0.3404255319
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0857142857,
    "f1":0.1463414634
  }
}