{
  "title":"How to Cook Dinengdeng",
  "url":"https://www.wikihow.com/Cook-Dinengdeng",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Philippine Dishes"
  ],
  "parts":[
    {
      "name":"Frying the Fish",
      "steps":[
        {
          "headline":"Rub salt over 2 to 3 pieces of a medium-sized fish.",
          "description":"Gut, clean, and debone 2 or 3 medium-sized fish, such as king fish or mackerel. Rub 1 tablespoon (14.8 ml) (17 g) of salt over each piece of fish. You can also use larger fish, like tilapia. For these, you only need 1 or 2 pieces."
        },
        {
          "headline":"Heat ⁄2 cup (120 mL) of oil in a pan.",
          "description":"Pour ⁄2 cup (120 mL) of your desired cooking oil into a pan. Turn the stove up to medium-high heat and wait for the oil to get hot. You'll know it's ready once it starts to form bubbles. Different types of oils heat up at different rates, so pay close attention to the pan and don't step away from the stove. Good choices of oil include: canola, extra-light olive oil, grapeseed, peanut, safflower, soybean, and sunflower."
        },
        {
          "headline":"Fry the fish in the oil for 3 to 4 minutes, or until it turns golden brown.",
          "description":"How long this takes depends on what type of fish you are frying and how thick it is. The thicker the fish are, the longer they will take to turn golden brown. Expect this to take about 3 to 4 minutes, however. Use a spatula to lower the fish into the oil. This way, you won't cause the oil to splatter."
        },
        {
          "headline":"Flip the fish over and fry the other side for another 3 to 4 minutes.",
          "description":"Slide a spatula under each fish, then use it to flip them over. Continue to cook the fish until they turn golden brown. This should take another 3 to 4 minutes."
        },
        {
          "headline":"Set the fish aside on a plate.",
          "description":"Use a spatula to transfer the fish from the pan and onto a plate. You can also set them on a baking sheet and place it into a warm oven; this will keep the fried warm while you prepare the rest of the soup."
        }
      ]
    },
    {
      "name":"Preparing the Broth",
      "steps":[
        {
          "headline":"Boil the labong in water for 7 to 10 minutes.",
          "description":"Fill a pot with 4 cups (950 mL) of water and bring it to a boil over medium heat. Add 2 cups (262 g) of julienned labong and allow them to cook for 7 to 10 minutes, or until they turn tender. You can use other vegetables too, such as sweet potatoes or lima beans. If you use sweet potatoes, peel them and cut them into smaller chunks first. This will help them cook faster. You can try substituting canned bamboo shoots. Cut them into matchsticks first, then boil them until they turn tender."
        },
        {
          "headline":"Drain the labong and set it aside.",
          "description":"Pour the labong through a strainer once it's done cooking. Discard the cooking water, then set the labong aside on a plate or in a bowl."
        },
        {
          "headline":"Place the onion into 5 cups (1,200 mL) of boiling water.",
          "description":"Fill the pot with 5 cups (1,200 mL) of water and bring it to a boil over medium heat. Peel a small onion, then cut it into quarters. Drop the onion pieces into the water. Don't start the cooking timer for the onion; move on to preparing the bagoong as soon as the water starts to boil. You can use other vegetables here too, such as okra, bitter melon, and moringa pods. These don't need to be cooked as long as labong, potatoes, or beans."
        },
        {
          "headline":"Dilute the bagoong with ⁄2 cup (120 mL) of boiling water.",
          "description":"Measure ⁄2 cup (120 mL) of bagoong into a bowl or small pot. Pour ⁄2 cup (120 mL) of boiling water into it, then give the mixture a stir. Do not use regular fish sauce. It's not the same thing. Bagoong is made from fish or krill and has a grainier texture."
        },
        {
          "headline":"Strain the bagoong and discard any pieces of fish or krill.",
          "description":"Hold a fine, mesh sieve over bowl. Pour the diluted bagoong through the sieve and into the bowl. Scrape both sides of the sieve with a spoon or rubber spatula in order to get every last bit of pulp out. Discard any fish or krill bits that are caught in the sieve."
        }
      ]
    },
    {
      "name":"Assembling the Soup",
      "steps":[
        {
          "headline":"Stir the bagoong into the pot containing the onion.",
          "description":"Pour the diluted and strained bagoong into the pot containing the boiling onion. Stir the mixture into the soup until the dissolves. Use a rubber spatula to scrape the bowl clean, if needed."
        },
        {
          "headline":"Place the labong into the pot and simmer the soup for 3 to 5 minutes.",
          "description":"Turn the heat down on the stove to low or medium-low first. Once the water starts to simmer, add the drained labong that you set aside earlier back into the pot. Let it cook for 3 to 5 minutes."
        },
        {
          "headline":"Slip the fried fish into the pot, if you want to make it soft.",
          "description":"If you prefer a crispier texture for the fish, skip this step and leave it out. You'll add it in last. Don't stir the fish if you add it in, otherwise it will break into pieces."
        },
        {
          "headline":"Let the soup simmer for 3 to 5 minutes.",
          "description":"This will allow the vegetables to finish cooking. If you added the fish in, then it will soften the fish up some more."
        },
        {
          "headline":"Add the saluyot leaves and cook the soup for 2 to 4 minutes.",
          "description":"Pull the leaves off of a bunch of saluyot until you have enough to fill 4 cups (120 g). Toss the leaves into the pot, and allow them to cook until they wilt, about 2 to 4 minutes. You can include tender vegetables too, such as alakon blossoms and jute leaves. Cook the leaves long enough for them to wilt."
        },
        {
          "headline":"Season the soup with salt and pepper, then serve it.",
          "description":"If you did not add the fish earlier, ladle the soup into bowls first, then set the fried fish on top. Saving the fish for last like this will help it retain its crispy texture. Cover any leftovers and store them in the fridge for up to 3 or 4 days."
        }
      ]
    }
  ],
  "text":" Frying the Fish Rub salt over 2 to 3 pieces of a medium-sized fish. Gut, clean, and debone 2 or 3 medium-sized fish, such as king fish or mackerel. Rub 1 tablespoon (14.8 ml) (17 g) of salt over each piece of fish. You can also use larger fish, like tilapia. For these, you only need 1 or 2 pieces. Heat ⁄2 cup (120 mL) of oil in a pan. Pour ⁄2 cup (120 mL) of your desired cooking oil into a pan. Turn the stove up to medium-high heat and wait for the oil to get hot. You'll know it's ready once it starts to form bubbles. Different types of oils heat up at different rates, so pay close attention to the pan and don't step away from the stove. Good choices of oil include: canola, extra-light olive oil, grapeseed, peanut, safflower, soybean, and sunflower. Fry the fish in the oil for 3 to 4 minutes, or until it turns golden brown. How long this takes depends on what type of fish you are frying and how thick it is. The thicker the fish are, the longer they will take to turn golden brown. Expect this to take about 3 to 4 minutes, however. Use a spatula to lower the fish into the oil. This way, you won't cause the oil to splatter. Flip the fish over and fry the other side for another 3 to 4 minutes. Slide a spatula under each fish, then use it to flip them over. Continue to cook the fish until they turn golden brown. This should take another 3 to 4 minutes. Set the fish aside on a plate. Use a spatula to transfer the fish from the pan and onto a plate. You can also set them on a baking sheet and place it into a warm oven; this will keep the fried warm while you prepare the rest of the soup. Preparing the Broth Boil the labong in water for 7 to 10 minutes. Fill a pot with 4 cups (950 mL) of water and bring it to a boil over medium heat. Add 2 cups (262 g) of julienned labong and allow them to cook for 7 to 10 minutes, or until they turn tender. You can use other vegetables too, such as sweet potatoes or lima beans. If you use sweet potatoes, peel them and cut them into smaller chunks first. This will help them cook faster. You can try substituting canned bamboo shoots. Cut them into matchsticks first, then boil them until they turn tender. Drain the labong and set it aside. Pour the labong through a strainer once it's done cooking. Discard the cooking water, then set the labong aside on a plate or in a bowl. Place the onion into 5 cups (1,200 mL) of boiling water. Fill the pot with 5 cups (1,200 mL) of water and bring it to a boil over medium heat. Peel a small onion, then cut it into quarters. Drop the onion pieces into the water. Don't start the cooking timer for the onion; move on to preparing the bagoong as soon as the water starts to boil. You can use other vegetables here too, such as okra, bitter melon, and moringa pods. These don't need to be cooked as long as labong, potatoes, or beans. Dilute the bagoong with ⁄2 cup (120 mL) of boiling water. Measure ⁄2 cup (120 mL) of bagoong into a bowl or small pot. Pour ⁄2 cup (120 mL) of boiling water into it, then give the mixture a stir. Do not use regular fish sauce. It's not the same thing. Bagoong is made from fish or krill and has a grainier texture. Strain the bagoong and discard any pieces of fish or krill. Hold a fine, mesh sieve over bowl. Pour the diluted bagoong through the sieve and into the bowl. Scrape both sides of the sieve with a spoon or rubber spatula in order to get every last bit of pulp out. Discard any fish or krill bits that are caught in the sieve. Assembling the Soup Stir the bagoong into the pot containing the onion. Pour the diluted and strained bagoong into the pot containing the boiling onion. Stir the mixture into the soup until the dissolves. Use a rubber spatula to scrape the bowl clean, if needed. Place the labong into the pot and simmer the soup for 3 to 5 minutes. Turn the heat down on the stove to low or medium-low first. Once the water starts to simmer, add the drained labong that you set aside earlier back into the pot. Let it cook for 3 to 5 minutes. Slip the fried fish into the pot, if you want to make it soft. If you prefer a crispier texture for the fish, skip this step and leave it out. You'll add it in last. Don't stir the fish if you add it in, otherwise it will break into pieces. Let the soup simmer for 3 to 5 minutes. This will allow the vegetables to finish cooking. If you added the fish in, then it will soften the fish up some more. Add the saluyot leaves and cook the soup for 2 to 4 minutes. Pull the leaves off of a bunch of saluyot until you have enough to fill 4 cups (120 g). Toss the leaves into the pot, and allow them to cook until they wilt, about 2 to 4 minutes. You can include tender vegetables too, such as alakon blossoms and jute leaves. Cook the leaves long enough for them to wilt. Season the soup with salt and pepper, then serve it. If you did not add the fish earlier, ladle the soup into bowls first, then set the fried fish on top. Saving the fish for last like this will help it retain its crispy texture. Cover any leftovers and store them in the fridge for up to 3 or 4 days.",
  "sentences":[
    " Frying the Fish Rub salt over 2 to 3 pieces of a medium-sized fish.",
    "Gut, clean, and debone 2 or 3 medium-sized fish, such as king fish or mackerel.",
    "Rub 1 tablespoon (14.8 ml) (17 g) of salt over each piece of fish.",
    "You can also use larger fish, like tilapia.",
    "For these, you only need 1 or 2 pieces.",
    "Heat ⁄2 cup (120 mL) of oil in a pan.",
    "Pour ⁄2 cup (120 mL) of your desired cooking oil into a pan.",
    "Turn the stove up to medium-high heat and wait for the oil to get hot.",
    "You'll know it's ready once it starts to form bubbles.",
    "Different types of oils heat up at different rates, so pay close attention to the pan and don't step away from the stove.",
    "Good choices of oil include: canola, extra-light olive oil, grapeseed, peanut, safflower, soybean, and sunflower.",
    "Fry the fish in the oil for 3 to 4 minutes, or until it turns golden brown.",
    "How long this takes depends on what type of fish you are frying and how thick it is.",
    "The thicker the fish are, the longer they will take to turn golden brown.",
    "Expect this to take about 3 to 4 minutes, however.",
    "Use a spatula to lower the fish into the oil.",
    "This way, you won't cause the oil to splatter.",
    "Flip the fish over and fry the other side for another 3 to 4 minutes.",
    "Slide a spatula under each fish, then use it to flip them over.",
    "Continue to cook the fish until they turn golden brown.",
    "This should take another 3 to 4 minutes.",
    "Set the fish aside on a plate.",
    "Use a spatula to transfer the fish from the pan and onto a plate.",
    "You can also set them on a baking sheet and place it into a warm oven; this will keep the fried warm while you prepare the rest of the soup.",
    "Preparing the Broth Boil the labong in water for 7 to 10 minutes.",
    "Fill a pot with 4 cups (950 mL) of water and bring it to a boil over medium heat.",
    "Add 2 cups (262 g) of julienned labong and allow them to cook for 7 to 10 minutes, or until they turn tender.",
    "You can use other vegetables too, such as sweet potatoes or lima beans.",
    "If you use sweet potatoes, peel them and cut them into smaller chunks first.",
    "This will help them cook faster.",
    "You can try substituting canned bamboo shoots.",
    "Cut them into matchsticks first, then boil them until they turn tender.",
    "Drain the labong and set it aside.",
    "Pour the labong through a strainer once it's done cooking.",
    "Discard the cooking water, then set the labong aside on a plate or in a bowl.",
    "Place the onion into 5 cups (1,200 mL) of boiling water.",
    "Fill the pot with 5 cups (1,200 mL) of water and bring it to a boil over medium heat.",
    "Peel a small onion, then cut it into quarters.",
    "Drop the onion pieces into the water.",
    "Don't start the cooking timer for the onion; move on to preparing the bagoong as soon as the water starts to boil.",
    "You can use other vegetables here too, such as okra, bitter melon, and moringa pods.",
    "These don't need to be cooked as long as labong, potatoes, or beans.",
    "Dilute the bagoong with ⁄2 cup (120 mL) of boiling water.",
    "Measure ⁄2 cup (120 mL) of bagoong into a bowl or small pot.",
    "Pour ⁄2 cup (120 mL) of boiling water into it, then give the mixture a stir.",
    "Do not use regular fish sauce.",
    "It's not the same thing.",
    "Bagoong is made from fish or krill and has a grainier texture.",
    "Strain the bagoong and discard any pieces of fish or krill.",
    "Hold a fine, mesh sieve over bowl.",
    "Pour the diluted bagoong through the sieve and into the bowl.",
    "Scrape both sides of the sieve with a spoon or rubber spatula in order to get every last bit of pulp out.",
    "Discard any fish or krill bits that are caught in the sieve.",
    "Assembling the Soup Stir the bagoong into the pot containing the onion.",
    "Pour the diluted and strained bagoong into the pot containing the boiling onion.",
    "Stir the mixture into the soup until the dissolves.",
    "Use a rubber spatula to scrape the bowl clean, if needed.",
    "Place the labong into the pot and simmer the soup for 3 to 5 minutes.",
    "Turn the heat down on the stove to low or medium-low first.",
    "Once the water starts to simmer, add the drained labong that you set aside earlier back into the pot.",
    "Let it cook for 3 to 5 minutes.",
    "Slip the fried fish into the pot, if you want to make it soft.",
    "If you prefer a crispier texture for the fish, skip this step and leave it out.",
    "You'll add it in last.",
    "Don't stir the fish if you add it in, otherwise it will break into pieces.",
    "Let the soup simmer for 3 to 5 minutes.",
    "This will allow the vegetables to finish cooking.",
    "If you added the fish in, then it will soften the fish up some more.",
    "Add the saluyot leaves and cook the soup for 2 to 4 minutes.",
    "Pull the leaves off of a bunch of saluyot until you have enough to fill 4 cups (120 g).",
    "Toss the leaves into the pot, and allow them to cook until they wilt, about 2 to 4 minutes.",
    "You can include tender vegetables too, such as alakon blossoms and jute leaves.",
    "Cook the leaves long enough for them to wilt.",
    "Season the soup with salt and pepper, then serve it.",
    "If you did not add the fish earlier, ladle the soup into bowls first, then set the fried fish on top.",
    "Saving the fish for last like this will help it retain its crispy texture.",
    "Cover any leftovers and store them in the fridge for up to 3 or 4 days."
  ],
  "tyn_section":[
    "Frying pan",
    "Spatula",
    "Plate",
    "Bowl",
    "Cooking pot",
    "Fine, mesh sieve",
    "Strainer",
    "Rubber spatula"
  ],
  "tyn_model":[
    "fish",
    "pot",
    "water",
    "oil",
    "bowl",
    "sieve",
    "stove",
    "spatula",
    "plate",
    "salt",
    "pan",
    "vegetables",
    "sweet potatoes",
    "boiling water",
    "rubber spatula",
    "onion",
    "saluyot",
    "king fish",
    "mackerel",
    "tilapia",
    "cooking oil",
    "canola",
    "olive oil",
    "peanut",
    "sunflower",
    "baking sheet",
    "oven",
    "strainer",
    "cooking water",
    "bitter melon",
    "potatoes",
    "fish sauce",
    "bagoong",
    "spoon",
    "labong",
    "jute leaves",
    "salt and pepper"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.1351351351,
    "f1":0.2222222222,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.875,
    "p":0.1891891892,
    "f1":0.3111111111
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2702702703,
    "f1":0.4255319149
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.1351351351,
    "f1":0.2222222222
  }
}