{
  "title":"How to Make a Candle Stand",
  "url":"https://www.wikihow.com/Make-a-Candle-Stand",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "methods":[
    {
      "name":"Making a Stand from a Soda Can",
      "steps":[
        {
          "headline":"Use a razor blade to carefully cut off the top of a soda can.",
          "description":"Wash and dry the can before you cut it. Then, very carefully insert the tip of the razor blade into the aluminum inside of the lip of the can. Cut around the circle to remove the top. You can move the blade up and down to saw through the metal if that is helpful. You want to remove the inner metal, so you can easily access the inside of the soda can. Be very careful not to cut your fingers as you do this! Use a box cutter or X-ACTO knife if that is easier."
        },
        {
          "headline":"Apply a liberal amount of spray adhesive on the body of the can.",
          "description":"Hold the can of spray adhesive 2–4 in (5.1–10.2 cm) away from your can, and spray a thorough, even coat around all of the sides. You do not need to spray the inside or bottom of the can."
        },
        {
          "headline":"Glue the first piece of twine to the top edge of the can.",
          "description":"Apply 1 small bead of hot glue to the upper edge of the can underneath the metal lip. Then, stick the end of your twine into the glue, and carefully wrap the twine around the can. Hold the twine in place so it does not come out of the glue as you do this. The bead of glue acts as an anchor for the rest of your twine. You can use neutral-colored twine or colorful, dyed twine options."
        },
        {
          "headline":"Wrap the can entirely in twine, pressing down as you go.",
          "description":"As you wrap the can, leave no space in between the layers of twine. Smooth over the twine with your fingers to ensure it adheres to the spray glue. This way, you create a seamless design, so no one can tell it was a soda can prior."
        },
        {
          "headline":"Apply a dab of hot glue at the bottom of the can and trim the string.",
          "description":"When you cover the can completely, put a small bit of glue onto the bottom edge to act as a stopping point. Do this where the body of the can starts to curve inward. Trim the string to the length of the glue, and then press the end into the hot glue. This way, the twine stays in place."
        },
        {
          "headline":"Weigh down your candle stand with small stones if desired.",
          "description":"While this is optional, putting small pebbles or rocks into your can help it stay in place. Fill the bottom 1 inch (2.5 cm) or so full of rocks from your yard, for instance. This is especially helpful if using your candle stand outside on a windy day."
        },
        {
          "headline":"Use a tea candle or candlestick with your newly-created stand.",
          "description":"To use a tea candle, set the metal base at the bottom of your stand. If using a candlestick, simply stand it up in the center of your stand. Both options work great with this form of candle stand."
        }
      ]
    },
    {
      "name":"Creating a Floral Candle Holder",
      "steps":[
        {
          "headline":"Cut off the top section of your 16.9 oz (500 mL) bottle carefully.",
          "description":"Make your cut approximately where the label starts at the top of the bottle. If there is still a label on the bottle, you can remove it at this time. Press the tip of your razor blade or box cutter into the plastic, and continue cutting around the bottle to remove the top. Be careful not to cut your fingers or hands as you do this."
        },
        {
          "headline":"Cut your bottle into 6 even sections to make a floral effect.",
          "description":"To make a floral-inspired candle stand, make 6 vertical lines across the body of your bottle. Then, cut each of your marks using a sharp pair of scissors. Make your cuts from the top of the bottle to the base of the label. This makes petals out of the top of your bottle. If you cut too far into the bottom of your bottle, it may not stand up correctly."
        },
        {
          "headline":"Apply spray paint if you want to change the color of the bottle.",
          "description":"While this is optional, spraying a light, even layer of colored paint can add some brightness to your candleholder. This is a good idea if your bottle is clear and you want to make it opaque. Hold the spray paint about 4–6 in (10–15 cm) away from your bottle so you can gradually apply the paint. For instance, spray the inside of the bottle red to give them some contrast against white details."
        },
        {
          "headline":"Use a paint marker to decorate your bottle with small accents.",
          "description":"Draw designs of your choice onto the bottle with your marker. You can add polka dots, dashed lines, or swirls, for instance. Draw whatever you'd like to make your candle stand your own."
        },
        {
          "headline":"Fold down all 6 sections to create your floral shape.",
          "description":"Hold the thumb of 1 hand on the outside of the bottle at the beginning of your petal and use your other hand to bend the petal over top of your thumb. Push on the plastic until the section stays horizontally on its own. Do this for all of your petals."
        },
        {
          "headline":"Cut 1-2 additional 16.9 oz (500 mL) bottles to make more floral shapes.",
          "description":"Repeat the steps above for your additional bottles. For instance, cut off the top about 1/3 of the way or more, and cut 6 vertical lines in another bottle to add detail. Stack the bottles inside each other to check your shape and size, and make adjustments as needed. Your second and third bottles can be the same size, or you can cut them smaller to create a full display. You can use a green bottle of a similar size to make green petals, and cut them slightly smaller than the first petals\nIf you’d like, you can round the edges or paint the other bottles additional colors."
        },
        {
          "headline":"Add a disposable white cup to use as your main candle holder.",
          "description":"To create your main candle stand, trim the top of the cup to your desired size. You can chop off the plastic lip, or you can cut it so it stands about 2 in (5.1 cm) tall. This will house your candle when put inside your stand. You'll place this cup inside of your other plastic bottles when you assemble the candle stand."
        },
        {
          "headline":"Use hot glue to adhere all of your bottles and cups together.",
          "description":"Pick the bottle you want to use as your outer piece, and place 3-5 small dabs of hot glue onto the inside bottom of the bottle. Then, place your next bottle inside of the first, and push down on the bottom to adhere the 2. Put another 3-5 small dabs of hot glue along the bottom, then either place your next bottle inside or put your disposable plastic cup."
        },
        {
          "headline":"Place a candlestick into your candle stand.",
          "description":"Once your candle stand is assembled, put a candlestick directly into the center of the plastic cup. You can light your candle and enjoy the ambiance. It is best to use a candlestick with this stand, as tea candles could melt the plastic bottle. If your candle does not want to stay in your stand, use a lighter to gently heat up the bottom of the stick. Then, place the semi-melted waxy end into the stand."
        }
      ]
    },
    {
      "name":"Using a Clay Pot as Your Stand",
      "steps":[
        {
          "headline":"Paint the outside and inside of your pot whatever color you’d like.",
          "description":"You can use any small-sized, terracotta, garden pot. Use a quarter-size amount of paint and a small, round paintbrush to cover the outside and/or inside of your pot. Apply 1 or more coats, based on your desired look. Use a neutral color like white or gray or go with a bright color like pink or blue. If applying multiple coats, wait about 5 minutes or so in between layers so the paint can dry."
        },
        {
          "headline":"Use hot glue to secure embellishments of your choice to the outside.",
          "description":"You can decorate your candle stand with nearly anything you’d like. For instance, use circular beads to create a textured effect. Apply 1 small dab of glue onto each bead, and place them immediately next to each other across the pot. You can also use things like tissue paper, plastic accents, stickers, ribbon, and string."
        },
        {
          "headline":"Cover the pot based on your personal style and taste.",
          "description":"If you want to create a cohesive look, continue your decorative style across the entirety of your pot. For instance, keep gluing small circular beads onto your pot until it is covered from top to bottom. This way, your candle stand looks attractive and presentable. This will depend on your particular style and desired outcome. Use your creativity to make your candle stand your own!"
        },
        {
          "headline":"Paint over your embellishments if you want to add additional color.",
          "description":"While this is optional, using acrylic paint is a great way to take your candle stand to the next level. Squeeze out a dime-size amount of paint onto a pallet, and dip your brush into the paint. Then, apply the paint across your small beads. This gives the beads a two-toned effect. You can add details to the inside of your candle stand if you’d like. Additionally, use a paint marker to add subtle details across your pot, like polka-dots on each bead."
        },
        {
          "headline":"Place a candlestick or tea candle inside of your pot.",
          "description":"You can use either candle option in your newly-created candle stand. Place the tea candle at the bottom of the pot, or put the candlestick in the middle of the stand. To help your candlestick stay in place, heat up the bottom with a lighter to soften the wax. Then, place the semi-melted end into the pot. When you are ready to enjoy your candle, light the wick with a match or lighter."
        }
      ]
    }
  ],
  "text":" Making a Stand from a Soda Can Use a razor blade to carefully cut off the top of a soda can. Wash and dry the can before you cut it. Then, very carefully insert the tip of the razor blade into the aluminum inside of the lip of the can. Cut around the circle to remove the top. You can move the blade up and down to saw through the metal if that is helpful. You want to remove the inner metal, so you can easily access the inside of the soda can. Be very careful not to cut your fingers as you do this! Use a box cutter or X-ACTO knife if that is easier. Apply a liberal amount of spray adhesive on the body of the can. Hold the can of spray adhesive 2–4 in (5.1–10.2 cm) away from your can, and spray a thorough, even coat around all of the sides. You do not need to spray the inside or bottom of the can. Glue the first piece of twine to the top edge of the can. Apply 1 small bead of hot glue to the upper edge of the can underneath the metal lip. Then, stick the end of your twine into the glue, and carefully wrap the twine around the can. Hold the twine in place so it does not come out of the glue as you do this. The bead of glue acts as an anchor for the rest of your twine. You can use neutral-colored twine or colorful, dyed twine options. Wrap the can entirely in twine, pressing down as you go. As you wrap the can, leave no space in between the layers of twine. Smooth over the twine with your fingers to ensure it adheres to the spray glue. This way, you create a seamless design, so no one can tell it was a soda can prior. Apply a dab of hot glue at the bottom of the can and trim the string. When you cover the can completely, put a small bit of glue onto the bottom edge to act as a stopping point. Do this where the body of the can starts to curve inward. Trim the string to the length of the glue, and then press the end into the hot glue. This way, the twine stays in place. Weigh down your candle stand with small stones if desired. While this is optional, putting small pebbles or rocks into your can help it stay in place. Fill the bottom 1 inch (2.5 cm) or so full of rocks from your yard, for instance. This is especially helpful if using your candle stand outside on a windy day. Use a tea candle or candlestick with your newly-created stand. To use a tea candle, set the metal base at the bottom of your stand. If using a candlestick, simply stand it up in the center of your stand. Both options work great with this form of candle stand. Creating a Floral Candle Holder Cut off the top section of your 16.9 oz (500 mL) bottle carefully. Make your cut approximately where the label starts at the top of the bottle. If there is still a label on the bottle, you can remove it at this time. Press the tip of your razor blade or box cutter into the plastic, and continue cutting around the bottle to remove the top. Be careful not to cut your fingers or hands as you do this. Cut your bottle into 6 even sections to make a floral effect. To make a floral-inspired candle stand, make 6 vertical lines across the body of your bottle. Then, cut each of your marks using a sharp pair of scissors. Make your cuts from the top of the bottle to the base of the label. This makes petals out of the top of your bottle. If you cut too far into the bottom of your bottle, it may not stand up correctly. Apply spray paint if you want to change the color of the bottle. While this is optional, spraying a light, even layer of colored paint can add some brightness to your candleholder. This is a good idea if your bottle is clear and you want to make it opaque. Hold the spray paint about 4–6 in (10–15 cm) away from your bottle so you can gradually apply the paint. For instance, spray the inside of the bottle red to give them some contrast against white details. Use a paint marker to decorate your bottle with small accents. Draw designs of your choice onto the bottle with your marker. You can add polka dots, dashed lines, or swirls, for instance. Draw whatever you'd like to make your candle stand your own. Fold down all 6 sections to create your floral shape. Hold the thumb of 1 hand on the outside of the bottle at the beginning of your petal and use your other hand to bend the petal over top of your thumb. Push on the plastic until the section stays horizontally on its own. Do this for all of your petals. Cut 1-2 additional 16.9 oz (500 mL) bottles to make more floral shapes. Repeat the steps above for your additional bottles. For instance, cut off the top about 1/3 of the way or more, and cut 6 vertical lines in another bottle to add detail. Stack the bottles inside each other to check your shape and size, and make adjustments as needed. Your second and third bottles can be the same size, or you can cut them smaller to create a full display. You can use a green bottle of a similar size to make green petals, and cut them slightly smaller than the first petals\nIf you’d like, you can round the edges or paint the other bottles additional colors. Add a disposable white cup to use as your main candle holder. To create your main candle stand, trim the top of the cup to your desired size. You can chop off the plastic lip, or you can cut it so it stands about 2 in (5.1 cm) tall. This will house your candle when put inside your stand. You'll place this cup inside of your other plastic bottles when you assemble the candle stand. Use hot glue to adhere all of your bottles and cups together. Pick the bottle you want to use as your outer piece, and place 3-5 small dabs of hot glue onto the inside bottom of the bottle. Then, place your next bottle inside of the first, and push down on the bottom to adhere the 2. Put another 3-5 small dabs of hot glue along the bottom, then either place your next bottle inside or put your disposable plastic cup. Place a candlestick into your candle stand. Once your candle stand is assembled, put a candlestick directly into the center of the plastic cup. You can light your candle and enjoy the ambiance. It is best to use a candlestick with this stand, as tea candles could melt the plastic bottle. If your candle does not want to stay in your stand, use a lighter to gently heat up the bottom of the stick. Then, place the semi-melted waxy end into the stand. Using a Clay Pot as Your Stand Paint the outside and inside of your pot whatever color you’d like. You can use any small-sized, terracotta, garden pot. Use a quarter-size amount of paint and a small, round paintbrush to cover the outside and/or inside of your pot. Apply 1 or more coats, based on your desired look. Use a neutral color like white or gray or go with a bright color like pink or blue. If applying multiple coats, wait about 5 minutes or so in between layers so the paint can dry. Use hot glue to secure embellishments of your choice to the outside. You can decorate your candle stand with nearly anything you’d like. For instance, use circular beads to create a textured effect. Apply 1 small dab of glue onto each bead, and place them immediately next to each other across the pot. You can also use things like tissue paper, plastic accents, stickers, ribbon, and string. Cover the pot based on your personal style and taste. If you want to create a cohesive look, continue your decorative style across the entirety of your pot. For instance, keep gluing small circular beads onto your pot until it is covered from top to bottom. This way, your candle stand looks attractive and presentable. This will depend on your particular style and desired outcome. Use your creativity to make your candle stand your own! Paint over your embellishments if you want to add additional color. While this is optional, using acrylic paint is a great way to take your candle stand to the next level. Squeeze out a dime-size amount of paint onto a pallet, and dip your brush into the paint. Then, apply the paint across your small beads. This gives the beads a two-toned effect. You can add details to the inside of your candle stand if you’d like. Additionally, use a paint marker to add subtle details across your pot, like polka-dots on each bead. Place a candlestick or tea candle inside of your pot. You can use either candle option in your newly-created candle stand. Place the tea candle at the bottom of the pot, or put the candlestick in the middle of the stand. To help your candlestick stay in place, heat up the bottom with a lighter to soften the wax. Then, place the semi-melted end into the pot. When you are ready to enjoy your candle, light the wick with a match or lighter.",
  "sentences":[
    " Making a Stand from a Soda Can Use a razor blade to carefully cut off the top of a soda can.",
    "Wash and dry the can before you cut it.",
    "Then, very carefully insert the tip of the razor blade into the aluminum inside of the lip of the can.",
    "Cut around the circle to remove the top.",
    "You can move the blade up and down to saw through the metal if that is helpful.",
    "You want to remove the inner metal, so you can easily access the inside of the soda can.",
    "Be very careful not to cut your fingers as you do this!",
    "Use a box cutter or X-ACTO knife if that is easier.",
    "Apply a liberal amount of spray adhesive on the body of the can.",
    "Hold the can of spray adhesive 2–4 in (5.1–10.2 cm) away from your can, and spray a thorough, even coat around all of the sides.",
    "You do not need to spray the inside or bottom of the can.",
    "Glue the first piece of twine to the top edge of the can.",
    "Apply 1 small bead of hot glue to the upper edge of the can underneath the metal lip.",
    "Then, stick the end of your twine into the glue, and carefully wrap the twine around the can.",
    "Hold the twine in place so it does not come out of the glue as you do this.",
    "The bead of glue acts as an anchor for the rest of your twine.",
    "You can use neutral-colored twine or colorful, dyed twine options.",
    "Wrap the can entirely in twine, pressing down as you go.",
    "As you wrap the can, leave no space in between the layers of twine.",
    "Smooth over the twine with your fingers to ensure it adheres to the spray glue.",
    "This way, you create a seamless design, so no one can tell it was a soda can prior.",
    "Apply a dab of hot glue at the bottom of the can and trim the string.",
    "When you cover the can completely, put a small bit of glue onto the bottom edge to act as a stopping point.",
    "Do this where the body of the can starts to curve inward.",
    "Trim the string to the length of the glue, and then press the end into the hot glue.",
    "This way, the twine stays in place.",
    "Weigh down your candle stand with small stones if desired.",
    "While this is optional, putting small pebbles or rocks into your can help it stay in place.",
    "Fill the bottom 1 inch (2.5 cm) or so full of rocks from your yard, for instance.",
    "This is especially helpful if using your candle stand outside on a windy day.",
    "Use a tea candle or candlestick with your newly-created stand.",
    "To use a tea candle, set the metal base at the bottom of your stand.",
    "If using a candlestick, simply stand it up in the center of your stand.",
    "Both options work great with this form of candle stand.",
    "Creating a Floral Candle Holder Cut off the top section of your 16.9 oz (500 mL) bottle carefully.",
    "Make your cut approximately where the label starts at the top of the bottle.",
    "If there is still a label on the bottle, you can remove it at this time.",
    "Press the tip of your razor blade or box cutter into the plastic, and continue cutting around the bottle to remove the top.",
    "Be careful not to cut your fingers or hands as you do this.",
    "Cut your bottle into 6 even sections to make a floral effect.",
    "To make a floral-inspired candle stand, make 6 vertical lines across the body of your bottle.",
    "Then, cut each of your marks using a sharp pair of scissors.",
    "Make your cuts from the top of the bottle to the base of the label.",
    "This makes petals out of the top of your bottle.",
    "If you cut too far into the bottom of your bottle, it may not stand up correctly.",
    "Apply spray paint if you want to change the color of the bottle.",
    "While this is optional, spraying a light, even layer of colored paint can add some brightness to your candleholder.",
    "This is a good idea if your bottle is clear and you want to make it opaque.",
    "Hold the spray paint about 4–6 in (10–15 cm) away from your bottle so you can gradually apply the paint.",
    "For instance, spray the inside of the bottle red to give them some contrast against white details.",
    "Use a paint marker to decorate your bottle with small accents.",
    "Draw designs of your choice onto the bottle with your marker.",
    "You can add polka dots, dashed lines, or swirls, for instance.",
    "Draw whatever you'd like to make your candle stand your own.",
    "Fold down all 6 sections to create your floral shape.",
    "Hold the thumb of 1 hand on the outside of the bottle at the beginning of your petal and use your other hand to bend the petal over top of your thumb.",
    "Push on the plastic until the section stays horizontally on its own.",
    "Do this for all of your petals.",
    "Cut 1-2 additional 16.9 oz (500 mL) bottles to make more floral shapes.",
    "Repeat the steps above for your additional bottles.",
    "For instance, cut off the top about 1/3 of the way or more, and cut 6 vertical lines in another bottle to add detail.",
    "Stack the bottles inside each other to check your shape and size, and make adjustments as needed.",
    "Your second and third bottles can be the same size, or you can cut them smaller to create a full display.",
    "You can use a green bottle of a similar size to make green petals, and cut them slightly smaller than the first petals\nIf you’d like, you can round the edges or paint the other bottles additional colors.",
    "Add a disposable white cup to use as your main candle holder.",
    "To create your main candle stand, trim the top of the cup to your desired size.",
    "You can chop off the plastic lip, or you can cut it so it stands about 2 in (5.1 cm) tall.",
    "This will house your candle when put inside your stand.",
    "You'll place this cup inside of your other plastic bottles when you assemble the candle stand.",
    "Use hot glue to adhere all of your bottles and cups together.",
    "Pick the bottle you want to use as your outer piece, and place 3-5 small dabs of hot glue onto the inside bottom of the bottle.",
    "Then, place your next bottle inside of the first, and push down on the bottom to adhere the 2.",
    "Put another 3-5 small dabs of hot glue along the bottom, then either place your next bottle inside or put your disposable plastic cup.",
    "Place a candlestick into your candle stand.",
    "Once your candle stand is assembled, put a candlestick directly into the center of the plastic cup.",
    "You can light your candle and enjoy the ambiance.",
    "It is best to use a candlestick with this stand, as tea candles could melt the plastic bottle.",
    "If your candle does not want to stay in your stand, use a lighter to gently heat up the bottom of the stick.",
    "Then, place the semi-melted waxy end into the stand.",
    "Using a Clay Pot as Your Stand Paint the outside and inside of your pot whatever color you’d like.",
    "You can use any small-sized, terracotta, garden pot.",
    "Use a quarter-size amount of paint and a small, round paintbrush to cover the outside and/or inside of your pot.",
    "Apply 1 or more coats, based on your desired look.",
    "Use a neutral color like white or gray or go with a bright color like pink or blue.",
    "If applying multiple coats, wait about 5 minutes or so in between layers so the paint can dry.",
    "Use hot glue to secure embellishments of your choice to the outside.",
    "You can decorate your candle stand with nearly anything you’d like.",
    "For instance, use circular beads to create a textured effect.",
    "Apply 1 small dab of glue onto each bead, and place them immediately next to each other across the pot.",
    "You can also use things like tissue paper, plastic accents, stickers, ribbon, and string.",
    "Cover the pot based on your personal style and taste.",
    "If you want to create a cohesive look, continue your decorative style across the entirety of your pot.",
    "For instance, keep gluing small circular beads onto your pot until it is covered from top to bottom.",
    "This way, your candle stand looks attractive and presentable.",
    "This will depend on your particular style and desired outcome.",
    "Use your creativity to make your candle stand your own!",
    "Paint over your embellishments if you want to add additional color.",
    "While this is optional, using acrylic paint is a great way to take your candle stand to the next level.",
    "Squeeze out a dime-size amount of paint onto a pallet, and dip your brush into the paint.",
    "Then, apply the paint across your small beads.",
    "This gives the beads a two-toned effect.",
    "You can add details to the inside of your candle stand if you’d like.",
    "Additionally, use a paint marker to add subtle details across your pot, like polka-dots on each bead.",
    "Place a candlestick or tea candle inside of your pot.",
    "You can use either candle option in your newly-created candle stand.",
    "Place the tea candle at the bottom of the pot, or put the candlestick in the middle of the stand.",
    "To help your candlestick stay in place, heat up the bottom with a lighter to soften the wax.",
    "Then, place the semi-melted end into the pot.",
    "When you are ready to enjoy your candle, light the wick with a match or lighter."
  ],
  "tyn_section":[
    "Spray Adhesive",
    "Empty soda can",
    "Twine",
    "Hot glue gun",
    "Tea candle or candlestick",
    "16.9 oz (500 mL) plastic bottle(s)",
    "Razor blade or box cutter",
    "Scissors",
    "Paint marker",
    "Spray paint (optional)",
    "Disposable cup",
    "Candlestick",
    "Small clay pot",
    "Paint and paintbrush",
    "Embellishments"
  ],
  "tyn_model":[
    "twine",
    "candle stand",
    "hot glue",
    "candlestick",
    "glue",
    "paint",
    "soda can",
    "tea candle",
    "bottle",
    "bottles",
    "lighter",
    "razor blade",
    "box cutter",
    "spray adhesive",
    "rocks",
    "spray paint",
    "paint marker",
    "pot",
    "razor",
    "saw",
    "spray glue",
    "scissors",
    "marker",
    "candle",
    "plastic",
    "disposable white cup",
    "disposable plastic cup",
    "clay pot",
    "tissue paper",
    "stickers",
    "ribbon",
    "string",
    "acrylic paint",
    "match"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1470588235,
    "f1":0.2040816327,
    "avg_pos":0.3823529412
  },
  "jacc_metrics_0.5":{
    "r":0.7333333333,
    "p":0.4117647059,
    "f1":0.5273972603
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8666666667,
    "p":0.5882352941,
    "f1":0.7008086253
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.3235294118,
    "f1":0.4356435644
  }
}