{
  "title":"How to Prepare and Cook Kelp",
  "url":"https://www.wikihow.com/Prepare-and-Cook-Kelp",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Mixing Kelp Salad",
      "steps":[
        {
          "headline":"Rehydrate dry seaweed in cold water for 5 to 10 minutes.",
          "description":"Put 1 ounce (30 g) of dry mixed seaweed into a large bowl and pour in enough cold water to cover the kelp. Leave the kelp to soak for at least 5 minutes to get crunchy kelp or 10 minutes to get soft kelp."
        },
        {
          "headline":"Whisk the vinegar, oil, soy sauce, sugar, salt, and ginger juice together.",
          "description":"Make a tangy salad dressing by pouring 4 teaspoons (20 ml) of rice vinegar into a small bowl. Whisk in 1 tablespoon (15 ml) of toasted sesame oil, 1 tablespoon (15 ml) of soy sauce, 1 tablespoon (12.5 g) of sugar, 1/2 teaspoon (2.5 g) of salt, and ⁄2 teaspoon (2.5 ml) of ginger juice. You can find ginger juice in the juice aisle at most grocery stores. If you're having trouble finding it, check Asian markets or substitute freshly grated ginger."
        },
        {
          "headline":"Drain the seaweed and squeeze out the extra water.",
          "description":"Set a fine mesh strainer over the sink and pour the rehydrated kelp into it. Then gather the kelp between your hands and squeeze it firmly so the excess water drains into the sink."
        },
        {
          "headline":"Toss the kelp into a bowl along with the dressing.",
          "description":"Put the kelp into a serving bowl and pour the dressing over it. Mix the kelp with the dressing until the kelp is completely coated. Avoid mixing the kelp with the dressing ahead of time or the salad may become too soggy."
        },
        {
          "headline":"Garnish the kelp salad with sesame seeds and scallions.",
          "description":"Sprinkle 1 tablespoon (8 g) of toasted sesame seeds and 1 finely chopped scallion over the kelp salad. Serve the salad immediately. Avoid storing the kelp salad because it will become soggy the longer it's stored."
        }
      ]
    },
    {
      "name":"Cooking Korean Kelp Soup",
      "steps":[
        {
          "headline":"Rehydrate the dried kelp in 5 cups (1.2 l) of water for 30 to 40 minutes.",
          "description":"Put 1 ounce (28 g) of dried kelp into a large bowl and pour in 5 cups (1.2 l) of cold water. Set the kelp aside to soak for 30 to 40 minutes. The kelp should be completely soft once it's finished rehydrating."
        },
        {
          "headline":"Set a fine mesh strainer in the sink and drain the kelp.",
          "description":"Use your hands to squeeze the kelp and remove excess water. Discard the soaking liquid. If the kelp is large, you can use scissors to cut it into strips that are as large as you like."
        },
        {
          "headline":"Stir-fry the kelp over medium-high heat for 3 to 5 minutes.",
          "description":"Pour 2 tablespoons (30 ml) of sesame oil into a large pot and turn the burner to medium-high. Once the oil shimmers, stir in the drained kelp and stir it frequently as it cooks. The kelp will absorb the flavor of the sesame oil as it cooks."
        },
        {
          "headline":"Add the remaining 7 cups (1.7 l) of water, salt, and Korean soy sauce.",
          "description":"Pour the water and 2 tablespoons (30 ml) of Korean soy sauce into the pot. Stir in 1 teaspoon (5.5 g) of salt and combine the ingredients. If you can't find Korean soy sauce, you can substitute readily available soy sauce."
        },
        {
          "headline":"Bring the soup to a boil and simmer the soup for 20 to 30 minutes.",
          "description":"Once the soup begins to bubble vigorously, turn the burner down to medium heat. Let the uncovered soup bubble gently for 20 to 30 minutes. The kelp will soften as it simmers."
        },
        {
          "headline":"Taste and serve the Korean kelp soup.",
          "description":"The soup will become saltier the longer it simmers. Turn off the burner and taste the soup. Stir in more salt if you prefer it to be saltier. Serve the soup while it's hot. Store the leftover kelp soup in an airtight container for up to 3 days. Keep in mind that the kelp will continue to soften as it's stored."
        }
      ]
    },
    {
      "name":"Making Stir-Fried Kelp Noodles",
      "steps":[
        {
          "headline":"Rinse and drain a 12-ounce (340 g) package of kelp noodles.",
          "description":"Open the package and put the kelp noodles into a fine mesh strainer. Hold the noodles under warm running water and use your fingers to separate the noodles as you rinse. Set the noodles aside while you cook the vegetables."
        },
        {
          "headline":"Sauté the onion in coconut oil over medium heat for 3 to 5 minutes.",
          "description":"Pour 1 tablespoon (15 ml) of coconut oil into a cast-iron skillet and turn the burner to medium. Once the oil shimmers, stir in 1 small minced onion and cook it until it softens. Stir the onion frequently to prevent it from sticking to the bottom of the skillet."
        },
        {
          "headline":"Stir in the sliced mushrooms and cook them for 5 minutes.",
          "description":"Slice ⁄2 pound (230 g) pound of cremini mushrooms into 1/2 in (1.3 cm) thick pieces and stir them into the onions. The mushrooms will soften and release their liquid."
        },
        {
          "headline":"Add the beef and garlic and cook it for 5 to 7 minutes.",
          "description":"Put 1 pound (450 g) of ground beef and 5 cloves of minced garlic into the skillet. Stir to break up the meat and mix it with the onion. Cook the beef until it's completely browned. If you'd like vegetarian noodles, leave out the ground beef."
        },
        {
          "headline":"Stir in the broccoli slaw and baby spinach.",
          "description":"Add 1 cup (170 g) of broccoli slaw and a 5-ounce (140 g) package of baby spinach. Stir the mixture over medium-high heat for about 1 minute so the spinach wilts."
        },
        {
          "headline":"Toss the kelp noodles, coconut aminos, and vinegar into the skillet.",
          "description":"Put the drained kelp noodles into the skillet and pour 1 tablespoon (15 ml) of coconut aminos and 1 tablespoon (15 ml) of coconut vinegar over it. Use tongs to mix the noodles with the beef and vegetable mixture."
        },
        {
          "headline":"Cook the noodles for 3 to 5 minutes before you serve them.",
          "description":"Keep the burner on medium-high and let the noodles cook for a few minutes so they soften more. Then taste the noodles and stir in an extra tablespoon of coconut aminos or coconut vinegar if you'd like the dish to be saltier or tangier. Turn off the burner and serve the noodles immediately. Store the leftover noodles in an airtight container in the refrigerator for up to 3 days."
        }
      ]
    }
  ],
  "text":" Mixing Kelp Salad Rehydrate dry seaweed in cold water for 5 to 10 minutes. Put 1 ounce (30 g) of dry mixed seaweed into a large bowl and pour in enough cold water to cover the kelp. Leave the kelp to soak for at least 5 minutes to get crunchy kelp or 10 minutes to get soft kelp. Whisk the vinegar, oil, soy sauce, sugar, salt, and ginger juice together. Make a tangy salad dressing by pouring 4 teaspoons (20 ml) of rice vinegar into a small bowl. Whisk in 1 tablespoon (15 ml) of toasted sesame oil, 1 tablespoon (15 ml) of soy sauce, 1 tablespoon (12.5 g) of sugar, 1/2 teaspoon (2.5 g) of salt, and ⁄2 teaspoon (2.5 ml) of ginger juice. You can find ginger juice in the juice aisle at most grocery stores. If you're having trouble finding it, check Asian markets or substitute freshly grated ginger. Drain the seaweed and squeeze out the extra water. Set a fine mesh strainer over the sink and pour the rehydrated kelp into it. Then gather the kelp between your hands and squeeze it firmly so the excess water drains into the sink. Toss the kelp into a bowl along with the dressing. Put the kelp into a serving bowl and pour the dressing over it. Mix the kelp with the dressing until the kelp is completely coated. Avoid mixing the kelp with the dressing ahead of time or the salad may become too soggy. Garnish the kelp salad with sesame seeds and scallions. Sprinkle 1 tablespoon (8 g) of toasted sesame seeds and 1 finely chopped scallion over the kelp salad. Serve the salad immediately. Avoid storing the kelp salad because it will become soggy the longer it's stored. Cooking Korean Kelp Soup Rehydrate the dried kelp in 5 cups (1.2 l) of water for 30 to 40 minutes. Put 1 ounce (28 g) of dried kelp into a large bowl and pour in 5 cups (1.2 l) of cold water. Set the kelp aside to soak for 30 to 40 minutes. The kelp should be completely soft once it's finished rehydrating. Set a fine mesh strainer in the sink and drain the kelp. Use your hands to squeeze the kelp and remove excess water. Discard the soaking liquid. If the kelp is large, you can use scissors to cut it into strips that are as large as you like. Stir-fry the kelp over medium-high heat for 3 to 5 minutes. Pour 2 tablespoons (30 ml) of sesame oil into a large pot and turn the burner to medium-high. Once the oil shimmers, stir in the drained kelp and stir it frequently as it cooks. The kelp will absorb the flavor of the sesame oil as it cooks. Add the remaining 7 cups (1.7 l) of water, salt, and Korean soy sauce. Pour the water and 2 tablespoons (30 ml) of Korean soy sauce into the pot. Stir in 1 teaspoon (5.5 g) of salt and combine the ingredients. If you can't find Korean soy sauce, you can substitute readily available soy sauce. Bring the soup to a boil and simmer the soup for 20 to 30 minutes. Once the soup begins to bubble vigorously, turn the burner down to medium heat. Let the uncovered soup bubble gently for 20 to 30 minutes. The kelp will soften as it simmers. Taste and serve the Korean kelp soup. The soup will become saltier the longer it simmers. Turn off the burner and taste the soup. Stir in more salt if you prefer it to be saltier. Serve the soup while it's hot. Store the leftover kelp soup in an airtight container for up to 3 days. Keep in mind that the kelp will continue to soften as it's stored. Making Stir-Fried Kelp Noodles Rinse and drain a 12-ounce (340 g) package of kelp noodles. Open the package and put the kelp noodles into a fine mesh strainer. Hold the noodles under warm running water and use your fingers to separate the noodles as you rinse. Set the noodles aside while you cook the vegetables. Sauté the onion in coconut oil over medium heat for 3 to 5 minutes. Pour 1 tablespoon (15 ml) of coconut oil into a cast-iron skillet and turn the burner to medium. Once the oil shimmers, stir in 1 small minced onion and cook it until it softens. Stir the onion frequently to prevent it from sticking to the bottom of the skillet. Stir in the sliced mushrooms and cook them for 5 minutes. Slice ⁄2 pound (230 g) pound of cremini mushrooms into 1/2 in (1.3 cm) thick pieces and stir them into the onions. The mushrooms will soften and release their liquid. Add the beef and garlic and cook it for 5 to 7 minutes. Put 1 pound (450 g) of ground beef and 5 cloves of minced garlic into the skillet. Stir to break up the meat and mix it with the onion. Cook the beef until it's completely browned. If you'd like vegetarian noodles, leave out the ground beef. Stir in the broccoli slaw and baby spinach. Add 1 cup (170 g) of broccoli slaw and a 5-ounce (140 g) package of baby spinach. Stir the mixture over medium-high heat for about 1 minute so the spinach wilts. Toss the kelp noodles, coconut aminos, and vinegar into the skillet. Put the drained kelp noodles into the skillet and pour 1 tablespoon (15 ml) of coconut aminos and 1 tablespoon (15 ml) of coconut vinegar over it. Use tongs to mix the noodles with the beef and vegetable mixture. Cook the noodles for 3 to 5 minutes before you serve them. Keep the burner on medium-high and let the noodles cook for a few minutes so they soften more. Then taste the noodles and stir in an extra tablespoon of coconut aminos or coconut vinegar if you'd like the dish to be saltier or tangier. Turn off the burner and serve the noodles immediately. Store the leftover noodles in an airtight container in the refrigerator for up to 3 days.",
  "sentences":[
    " Mixing Kelp Salad Rehydrate dry seaweed in cold water for 5 to 10 minutes.",
    "Put 1 ounce (30 g) of dry mixed seaweed into a large bowl and pour in enough cold water to cover the kelp.",
    "Leave the kelp to soak for at least 5 minutes to get crunchy kelp or 10 minutes to get soft kelp.",
    "Whisk the vinegar, oil, soy sauce, sugar, salt, and ginger juice together.",
    "Make a tangy salad dressing by pouring 4 teaspoons (20 ml) of rice vinegar into a small bowl.",
    "Whisk in 1 tablespoon (15 ml) of toasted sesame oil, 1 tablespoon (15 ml) of soy sauce, 1 tablespoon (12.5 g) of sugar, 1/2 teaspoon (2.5 g) of salt, and ⁄2 teaspoon (2.5 ml) of ginger juice.",
    "You can find ginger juice in the juice aisle at most grocery stores.",
    "If you're having trouble finding it, check Asian markets or substitute freshly grated ginger.",
    "Drain the seaweed and squeeze out the extra water.",
    "Set a fine mesh strainer over the sink and pour the rehydrated kelp into it.",
    "Then gather the kelp between your hands and squeeze it firmly so the excess water drains into the sink.",
    "Toss the kelp into a bowl along with the dressing.",
    "Put the kelp into a serving bowl and pour the dressing over it.",
    "Mix the kelp with the dressing until the kelp is completely coated.",
    "Avoid mixing the kelp with the dressing ahead of time or the salad may become too soggy.",
    "Garnish the kelp salad with sesame seeds and scallions.",
    "Sprinkle 1 tablespoon (8 g) of toasted sesame seeds and 1 finely chopped scallion over the kelp salad.",
    "Serve the salad immediately.",
    "Avoid storing the kelp salad because it will become soggy the longer it's stored.",
    "Cooking Korean Kelp Soup Rehydrate the dried kelp in 5 cups (1.2 l) of water for 30 to 40 minutes.",
    "Put 1 ounce (28 g) of dried kelp into a large bowl and pour in 5 cups (1.2 l) of cold water.",
    "Set the kelp aside to soak for 30 to 40 minutes.",
    "The kelp should be completely soft once it's finished rehydrating.",
    "Set a fine mesh strainer in the sink and drain the kelp.",
    "Use your hands to squeeze the kelp and remove excess water.",
    "Discard the soaking liquid.",
    "If the kelp is large, you can use scissors to cut it into strips that are as large as you like.",
    "Stir-fry the kelp over medium-high heat for 3 to 5 minutes.",
    "Pour 2 tablespoons (30 ml) of sesame oil into a large pot and turn the burner to medium-high.",
    "Once the oil shimmers, stir in the drained kelp and stir it frequently as it cooks.",
    "The kelp will absorb the flavor of the sesame oil as it cooks.",
    "Add the remaining 7 cups (1.7 l) of water, salt, and Korean soy sauce.",
    "Pour the water and 2 tablespoons (30 ml) of Korean soy sauce into the pot.",
    "Stir in 1 teaspoon (5.5 g) of salt and combine the ingredients.",
    "If you can't find Korean soy sauce, you can substitute readily available soy sauce.",
    "Bring the soup to a boil and simmer the soup for 20 to 30 minutes.",
    "Once the soup begins to bubble vigorously, turn the burner down to medium heat.",
    "Let the uncovered soup bubble gently for 20 to 30 minutes.",
    "The kelp will soften as it simmers.",
    "Taste and serve the Korean kelp soup.",
    "The soup will become saltier the longer it simmers.",
    "Turn off the burner and taste the soup.",
    "Stir in more salt if you prefer it to be saltier.",
    "Serve the soup while it's hot.",
    "Store the leftover kelp soup in an airtight container for up to 3 days.",
    "Keep in mind that the kelp will continue to soften as it's stored.",
    "Making Stir-Fried Kelp Noodles Rinse and drain a 12-ounce (340 g) package of kelp noodles.",
    "Open the package and put the kelp noodles into a fine mesh strainer.",
    "Hold the noodles under warm running water and use your fingers to separate the noodles as you rinse.",
    "Set the noodles aside while you cook the vegetables.",
    "Sauté the onion in coconut oil over medium heat for 3 to 5 minutes.",
    "Pour 1 tablespoon (15 ml) of coconut oil into a cast-iron skillet and turn the burner to medium.",
    "Once the oil shimmers, stir in 1 small minced onion and cook it until it softens.",
    "Stir the onion frequently to prevent it from sticking to the bottom of the skillet.",
    "Stir in the sliced mushrooms and cook them for 5 minutes.",
    "Slice ⁄2 pound (230 g) pound of cremini mushrooms into 1/2 in (1.3 cm) thick pieces and stir them into the onions.",
    "The mushrooms will soften and release their liquid.",
    "Add the beef and garlic and cook it for 5 to 7 minutes.",
    "Put 1 pound (450 g) of ground beef and 5 cloves of minced garlic into the skillet.",
    "Stir to break up the meat and mix it with the onion.",
    "Cook the beef until it's completely browned.",
    "If you'd like vegetarian noodles, leave out the ground beef.",
    "Stir in the broccoli slaw and baby spinach.",
    "Add 1 cup (170 g) of broccoli slaw and a 5-ounce (140 g) package of baby spinach.",
    "Stir the mixture over medium-high heat for about 1 minute so the spinach wilts.",
    "Toss the kelp noodles, coconut aminos, and vinegar into the skillet.",
    "Put the drained kelp noodles into the skillet and pour 1 tablespoon (15 ml) of coconut aminos and 1 tablespoon (15 ml) of coconut vinegar over it.",
    "Use tongs to mix the noodles with the beef and vegetable mixture.",
    "Cook the noodles for 3 to 5 minutes before you serve them.",
    "Keep the burner on medium-high and let the noodles cook for a few minutes so they soften more.",
    "Then taste the noodles and stir in an extra tablespoon of coconut aminos or coconut vinegar if you'd like the dish to be saltier or tangier.",
    "Turn off the burner and serve the noodles immediately.",
    "Store the leftover noodles in an airtight container in the refrigerator for up to 3 days."
  ],
  "tyn_section":[
    "Kelp Salad",
    "Measuring cups and spoons",
    "Large bowl",
    "Small bowl",
    "Whisk",
    "Korean Kelp Soup",
    "Fine mesh strainer",
    "Scissors",
    "Large pot",
    "Spoon",
    "Stir-Fried Kelp Noodles",
    "Large skillet",
    "Tongs"
  ],
  "tyn_model":[
    "salt",
    "water",
    "soy sauce",
    "kelp noodles",
    "onion",
    "skillet",
    "cold water",
    "ginger juice",
    "fine mesh strainer",
    "kelp salad",
    "burner",
    "beef",
    "coconut aminos",
    "large bowl",
    "vinegar",
    "sugar",
    "sesame oil",
    "korean soy sauce",
    "airtight container",
    "coconut oil",
    "mushrooms",
    "garlic",
    "ground beef",
    "broccoli slaw",
    "baby spinach",
    "coconut vinegar",
    "oil",
    "rice vinegar",
    "small bowl",
    "toasted sesame oil",
    "ginger",
    "seaweed",
    "bowl",
    "serving bowl",
    "sesame seeds",
    "scallions",
    "toasted sesame seeds",
    "scissors",
    "large pot",
    "pot",
    "korean kelp soup",
    "kelp soup",
    "stir-fried kelp noodles",
    "cast-iron skillet",
    "cremini mushrooms",
    "onions",
    "vegetable",
    "refrigerator"
  ],
  "simple_metrics":{
    "r":0.6153846154,
    "p":0.1666666667,
    "f1":0.262295082,
    "avg_pos":0.1875
  },
  "jacc_metrics_0.5":{
    "r":0.6923076923,
    "p":0.2708333333,
    "f1":0.3893510815
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6923076923,
    "p":0.3125,
    "f1":0.4306220096
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6153846154,
    "p":0.2083333333,
    "f1":0.3112840467
  }
}