{
  "title":"How to Bake a Whole Fish",
  "url":"https://www.wikihow.com/Bake-a-Whole-Fish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Baking Herb and Garlic-Stuffed Fish",
      "steps":[
        {
          "headline":"Preheat the oven to 400 °F (204 °C) and cut 3 slits in the fish.",
          "description":"Place a cleaned 2 ⁄2 pounds (1.1 kg) fish on a cutting board. Use a sharp knife to make 3 diagonal slits that are 1/2 in (1.3 cm) deep. Turn the fish over and make 3 more diagonal slits. Use snapper, bass, or any of your favorite fish in this recipe."
        },
        {
          "headline":"Stuff the fish with bay, herbs, and half of the garlic and lemon.",
          "description":"Push 4 of the lemon slices into the cavity of the fish. Then insert 2 fresh bay leaves, 1 bundle of fresh herbs, and 2 of the smashed cloves of garlic. Use several sprigs of fresh herbs such as thyme, oregano, marjoram, and parsley."
        },
        {
          "headline":"Lay the fish on foil and season it with salt, olive oil, lemon, and herbs.",
          "description":"Tear off a large sheet of aluminum foil and lay it on a rimmed baking sheet. Arrange the remaining 4 slices of lemon and 2 smashed cloves of garlic on the center of the foil. Then lay the stuffed fish on them and drizzle a little extra-virgin olive oil over it. Sprinkle a few pinches of kosher salt across the fish."
        },
        {
          "headline":"Fold the foil up around the the fish and pour in the wine.",
          "description":"Ensure that the edges of the foil are pointing up, so it looks like a basket. Pour 2 cups (470 ml) of dry white wine into the foil with the fish and then gather the edges of the foil. Fold them over to seal the packet of foil shut. Use a dry white wine such as pinot grigio or chardonnay."
        },
        {
          "headline":"Bake the whole fish for 30 to 35 minutes.",
          "description":"Put the baking sheet with the fish in the preheated oven. Cook the fish until it's flaky and cooked throughout. To test if the fish is finished, insert a fork into the thickest part and twist it a little. The fish should flake and come away with the fork. If it's not, cook it a few more minutes and check again."
        },
        {
          "headline":"Serve the whole fish immediately.",
          "description":"Turn off the oven and transfer the whole fish to a serving platter. Consider serving the fish with a green salad, cooked pasta, or steamed rice. Refrigerate the leftover fish in an airtight container for up to 3 to 4 days."
        }
      ]
    },
    {
      "name":"Making Indian-Spiced Fish",
      "steps":[
        {
          "headline":"Mix half of the turmeric, chili powder, and salt.",
          "description":"To make the dry spice rub, put 1/2 teaspoon (1.5 g) of the turmeric powder into a small bowl. Stir in 1 teaspoon (2.5 g) of the chili powder and 1/2 teaspoon (2.5 g) of salt."
        },
        {
          "headline":"Rub the dry mix over 2 whole fish and marinate it for 1 hour.",
          "description":"Place 2 whole prepared fish on a baking sheet. Put half of the dry spice rub onto each fish. Use your fingers to rub the spice across both sides of each fish. Put the fish in the fridge to marinate for at least 1 hour. Marinate the fish up to 6 hours before you're ready to cook it. Use tilapia, snapper, or any of your favorite fish for this recipe."
        },
        {
          "headline":"Fry the fish in 4 tablespoons (59 ml) of the oil for 4 minutes.",
          "description":"Pour the vegetable oil into a skillet and turn the burner to medium-high. Once the oil shimmers, lower both of the marinated fish into the skillet. Fry the fish for 2 minutes and then flip them over. Fry the fish for 2 more minutes. Both sides should be golden brown, but the centers of the fish won't be completely cooked at this point."
        },
        {
          "headline":"Remove the fish and drain some of the oil from the skillet.",
          "description":"Lay a few paper towels on a plate and transfer the fish to the towels. Carefully pour out all but 2 tablespoons (30 ml) of the oil from the skillet. The paper towels will absorb some of the excess oil from the fish. You'll use the oil in the skillet to make the masala. Discard the excess oil that you poured out of the skillet."
        },
        {
          "headline":"Fry the mustard, curry leaves, and onion for 3 to 5 minutes.",
          "description":"Turn the burner to medium and stir 1/4 teaspoon (3 g) of mustard seeds into the skillet. Add 2 torn curry leaves and fry them until they start to crackle. Stir in 1 minced onion and continue to cook the mixture until the onion softens. Stir the onion mixture frequently to prevent it from sticking to the skillet."
        },
        {
          "headline":"Add the ginger, garlic, chili, and tomatoes.",
          "description":"Stir 1 in (2.5 cm) of freshly grated ginger into the skillet along with 3 to 4 cloves of chopped garlic, 2 chopped green chilies, and 2 chopped tomatoes. Stir and cook the mixture for about 5 minutes. The tomatoes should begin to soften and break down as they cook."
        },
        {
          "headline":"Stir in the turmeric, chili powder, coriander, and masala.",
          "description":"Add the remaining 1/4 teaspoon (1 g) of turmeric powder, 1 teaspoon (2.55 g) of chili powder, 1 teaspoon (2.5 g) of ground coriander, and 1/2 teaspoon (1 g) of garam masala. Stir and heat the spices for 1 minute. You can taste the sauce at this point and add a little salt according to your taste."
        },
        {
          "headline":"Add water, lime juice, and cilantro leaves to the skillet.",
          "description":"Pour ⁄4 cup (59 ml) of water and the juice of 1/2 a lime to the skillet. Stir in 2 chopped sprigs of cilantro and cook the masala for 5 to 10 minutes. The masala should thicken as the liquid evaporates."
        },
        {
          "headline":"Preheat the oven to 400 °F (204 °C) and assemble the packets of fish.",
          "description":"Tear off 2 large sheets of aluminum foil and lay them on a baking sheet. Spoon about 1/2 cup (115 g) of masala onto the middle of each piece of foil. Then remove the fish from the refrigerator and put each fish onto the masala in the foil. Spoon a little more of the masala over each fish and then fold the foil up to make a packet. Ensure that you seal the edges of the foil tightly."
        },
        {
          "headline":"Bake the fish in foil for 25 to 30 minutes.",
          "description":"Put the baking sheet with fish packets in the preheated oven. Bake the fish until they're completely cooked through. To test, open 1 of the packets and insert a fork into the thickest part of the fish. Turn the fork a little to see if it flakes. If the fish doesn't flake, seal the foil packet shut and bake the fish for another 5 minutes before you check again."
        },
        {
          "headline":"Serve the Indian-style fish.",
          "description":"Turn off the oven and remove the fish. Carefully peel back the foil, taking care not to burn yourself as the steam escapes. Transfer the fish to serving plates and spoon more of the masala over them. Consider serving the fish with steamed rice, slices of lime, and rings of red onion. Store the leftover fish in an airtight container. Refrigerate the fish for up to 3 to 4 days."
        }
      ]
    },
    {
      "name":"Cooking Fish in Garlic-Chili Sauce",
      "steps":[
        {
          "headline":"Preheat the oven to 375 °F (191 °C) and mix the garlic-chili sauce.",
          "description":"Pour 4 tablespoons (59 ml) of oyster sauce into a bowl along with 4 tablespoons (59 ml) of soy sauce and 1 tablespoon (15 ml) of fish sauce. Stir in 8 to 10 cloves of minced or pressed garlic, 2 tablespoons (25 g) of brown sugar, 1/4 teaspoon (0.5 g) of black pepper, 1 tablespoon (15 ml) of lime or lemon juice, and 1 to 3 sliced red chilies or 2 teaspoons of Thai chili sauce. Stir until the brown sugar is dissolved and set the sauce aside."
        },
        {
          "headline":"Slice 3 vertical slits on both sides of a whole fish.",
          "description":"Get out 1 whole red snapper or gray mullet. If you're using rainbow trout or tilapia, get out 2 fish since they're smaller. Use a sharp knife to cut 3 vertical slits on each side of the fish. The slits will allow the marinade to soak into the flesh of the fish."
        },
        {
          "headline":"Lay the fish on foil and pour 3 tablespoons (44 ml) of sauce over it.",
          "description":"Tear off a large sheet of aluminum foil and lay the fish in the center. Pour at least 3 tablespoons (44 ml) of garlic-chili sauce over the fish and turn it over so both sides are coated. The sauce should get into the slits you cut in the sides of the fish. If you're using 2 smaller fish, spoon about 2 tablespoons (30 ml) onto each fish."
        },
        {
          "headline":"Seal the foil shut and put the packet directly onto the oven rack.",
          "description":"Bring the sides of the foil together and fold them over tightly. This should make a sealed packet. Put the packet of fish in the preheated oven. If you're worried that the sauce will leak out of the packet, you can place the packet on a baking sheet."
        },
        {
          "headline":"Bake the whole fish for 20 to 25 minutes.",
          "description":"Then check the fish to determine if it's completely cooked throughout. Remove the packet and carefully peel away the foil. Insert a fork into the thickest part of the fish to see if it flakes. If it doesn't, close the packet and bake the fish for another 5 to 10 minutes before checking again."
        },
        {
          "headline":"Remove and serve the whole fish with garlic-chili sauce.",
          "description":"Turn off the oven and take the packet out. Open the foil carefully and transfer the whole fish to a serving platter. Spoon the remaining garlic-chili sauce over the fish and garnish it with slices or wedges of fresh lemon. For a fresh herbal flavor, consider chopping a handful of fresh cilantro or basil and sprinkling it over the fish. Refrigerate the leftover fish in an airtight container for up to 3 to 4 days."
        }
      ]
    }
  ],
  "text":" Baking Herb and Garlic-Stuffed Fish Preheat the oven to 400 °F (204 °C) and cut 3 slits in the fish. Place a cleaned 2 ⁄2 pounds (1.1 kg) fish on a cutting board. Use a sharp knife to make 3 diagonal slits that are 1/2 in (1.3 cm) deep. Turn the fish over and make 3 more diagonal slits. Use snapper, bass, or any of your favorite fish in this recipe. Stuff the fish with bay, herbs, and half of the garlic and lemon. Push 4 of the lemon slices into the cavity of the fish. Then insert 2 fresh bay leaves, 1 bundle of fresh herbs, and 2 of the smashed cloves of garlic. Use several sprigs of fresh herbs such as thyme, oregano, marjoram, and parsley. Lay the fish on foil and season it with salt, olive oil, lemon, and herbs. Tear off a large sheet of aluminum foil and lay it on a rimmed baking sheet. Arrange the remaining 4 slices of lemon and 2 smashed cloves of garlic on the center of the foil. Then lay the stuffed fish on them and drizzle a little extra-virgin olive oil over it. Sprinkle a few pinches of kosher salt across the fish. Fold the foil up around the the fish and pour in the wine. Ensure that the edges of the foil are pointing up, so it looks like a basket. Pour 2 cups (470 ml) of dry white wine into the foil with the fish and then gather the edges of the foil. Fold them over to seal the packet of foil shut. Use a dry white wine such as pinot grigio or chardonnay. Bake the whole fish for 30 to 35 minutes. Put the baking sheet with the fish in the preheated oven. Cook the fish until it's flaky and cooked throughout. To test if the fish is finished, insert a fork into the thickest part and twist it a little. The fish should flake and come away with the fork. If it's not, cook it a few more minutes and check again. Serve the whole fish immediately. Turn off the oven and transfer the whole fish to a serving platter. Consider serving the fish with a green salad, cooked pasta, or steamed rice. Refrigerate the leftover fish in an airtight container for up to 3 to 4 days. Making Indian-Spiced Fish Mix half of the turmeric, chili powder, and salt. To make the dry spice rub, put 1/2 teaspoon (1.5 g) of the turmeric powder into a small bowl. Stir in 1 teaspoon (2.5 g) of the chili powder and 1/2 teaspoon (2.5 g) of salt. Rub the dry mix over 2 whole fish and marinate it for 1 hour. Place 2 whole prepared fish on a baking sheet. Put half of the dry spice rub onto each fish. Use your fingers to rub the spice across both sides of each fish. Put the fish in the fridge to marinate for at least 1 hour. Marinate the fish up to 6 hours before you're ready to cook it. Use tilapia, snapper, or any of your favorite fish for this recipe. Fry the fish in 4 tablespoons (59 ml) of the oil for 4 minutes. Pour the vegetable oil into a skillet and turn the burner to medium-high. Once the oil shimmers, lower both of the marinated fish into the skillet. Fry the fish for 2 minutes and then flip them over. Fry the fish for 2 more minutes. Both sides should be golden brown, but the centers of the fish won't be completely cooked at this point. Remove the fish and drain some of the oil from the skillet. Lay a few paper towels on a plate and transfer the fish to the towels. Carefully pour out all but 2 tablespoons (30 ml) of the oil from the skillet. The paper towels will absorb some of the excess oil from the fish. You'll use the oil in the skillet to make the masala. Discard the excess oil that you poured out of the skillet. Fry the mustard, curry leaves, and onion for 3 to 5 minutes. Turn the burner to medium and stir 1/4 teaspoon (3 g) of mustard seeds into the skillet. Add 2 torn curry leaves and fry them until they start to crackle. Stir in 1 minced onion and continue to cook the mixture until the onion softens. Stir the onion mixture frequently to prevent it from sticking to the skillet. Add the ginger, garlic, chili, and tomatoes. Stir 1 in (2.5 cm) of freshly grated ginger into the skillet along with 3 to 4 cloves of chopped garlic, 2 chopped green chilies, and 2 chopped tomatoes. Stir and cook the mixture for about 5 minutes. The tomatoes should begin to soften and break down as they cook. Stir in the turmeric, chili powder, coriander, and masala. Add the remaining 1/4 teaspoon (1 g) of turmeric powder, 1 teaspoon (2.55 g) of chili powder, 1 teaspoon (2.5 g) of ground coriander, and 1/2 teaspoon (1 g) of garam masala. Stir and heat the spices for 1 minute. You can taste the sauce at this point and add a little salt according to your taste. Add water, lime juice, and cilantro leaves to the skillet. Pour ⁄4 cup (59 ml) of water and the juice of 1/2 a lime to the skillet. Stir in 2 chopped sprigs of cilantro and cook the masala for 5 to 10 minutes. The masala should thicken as the liquid evaporates. Preheat the oven to 400 °F (204 °C) and assemble the packets of fish. Tear off 2 large sheets of aluminum foil and lay them on a baking sheet. Spoon about 1/2 cup (115 g) of masala onto the middle of each piece of foil. Then remove the fish from the refrigerator and put each fish onto the masala in the foil. Spoon a little more of the masala over each fish and then fold the foil up to make a packet. Ensure that you seal the edges of the foil tightly. Bake the fish in foil for 25 to 30 minutes. Put the baking sheet with fish packets in the preheated oven. Bake the fish until they're completely cooked through. To test, open 1 of the packets and insert a fork into the thickest part of the fish. Turn the fork a little to see if it flakes. If the fish doesn't flake, seal the foil packet shut and bake the fish for another 5 minutes before you check again. Serve the Indian-style fish. Turn off the oven and remove the fish. Carefully peel back the foil, taking care not to burn yourself as the steam escapes. Transfer the fish to serving plates and spoon more of the masala over them. Consider serving the fish with steamed rice, slices of lime, and rings of red onion. Store the leftover fish in an airtight container. Refrigerate the fish for up to 3 to 4 days. Cooking Fish in Garlic-Chili Sauce Preheat the oven to 375 °F (191 °C) and mix the garlic-chili sauce. Pour 4 tablespoons (59 ml) of oyster sauce into a bowl along with 4 tablespoons (59 ml) of soy sauce and 1 tablespoon (15 ml) of fish sauce. Stir in 8 to 10 cloves of minced or pressed garlic, 2 tablespoons (25 g) of brown sugar, 1/4 teaspoon (0.5 g) of black pepper, 1 tablespoon (15 ml) of lime or lemon juice, and 1 to 3 sliced red chilies or 2 teaspoons of Thai chili sauce. Stir until the brown sugar is dissolved and set the sauce aside. Slice 3 vertical slits on both sides of a whole fish. Get out 1 whole red snapper or gray mullet. If you're using rainbow trout or tilapia, get out 2 fish since they're smaller. Use a sharp knife to cut 3 vertical slits on each side of the fish. The slits will allow the marinade to soak into the flesh of the fish. Lay the fish on foil and pour 3 tablespoons (44 ml) of sauce over it. Tear off a large sheet of aluminum foil and lay the fish in the center. Pour at least 3 tablespoons (44 ml) of garlic-chili sauce over the fish and turn it over so both sides are coated. The sauce should get into the slits you cut in the sides of the fish. If you're using 2 smaller fish, spoon about 2 tablespoons (30 ml) onto each fish. Seal the foil shut and put the packet directly onto the oven rack. Bring the sides of the foil together and fold them over tightly. This should make a sealed packet. Put the packet of fish in the preheated oven. If you're worried that the sauce will leak out of the packet, you can place the packet on a baking sheet. Bake the whole fish for 20 to 25 minutes. Then check the fish to determine if it's completely cooked throughout. Remove the packet and carefully peel away the foil. Insert a fork into the thickest part of the fish to see if it flakes. If it doesn't, close the packet and bake the fish for another 5 to 10 minutes before checking again. Remove and serve the whole fish with garlic-chili sauce. Turn off the oven and take the packet out. Open the foil carefully and transfer the whole fish to a serving platter. Spoon the remaining garlic-chili sauce over the fish and garnish it with slices or wedges of fresh lemon. For a fresh herbal flavor, consider chopping a handful of fresh cilantro or basil and sprinkling it over the fish. Refrigerate the leftover fish in an airtight container for up to 3 to 4 days.",
  "sentences":[
    " Baking Herb and Garlic-Stuffed Fish Preheat the oven to 400 °F (204 °C) and cut 3 slits in the fish.",
    "Place a cleaned 2 ⁄2 pounds (1.1 kg) fish on a cutting board.",
    "Use a sharp knife to make 3 diagonal slits that are 1/2 in (1.3 cm) deep.",
    "Turn the fish over and make 3 more diagonal slits.",
    "Use snapper, bass, or any of your favorite fish in this recipe.",
    "Stuff the fish with bay, herbs, and half of the garlic and lemon.",
    "Push 4 of the lemon slices into the cavity of the fish.",
    "Then insert 2 fresh bay leaves, 1 bundle of fresh herbs, and 2 of the smashed cloves of garlic.",
    "Use several sprigs of fresh herbs such as thyme, oregano, marjoram, and parsley.",
    "Lay the fish on foil and season it with salt, olive oil, lemon, and herbs.",
    "Tear off a large sheet of aluminum foil and lay it on a rimmed baking sheet.",
    "Arrange the remaining 4 slices of lemon and 2 smashed cloves of garlic on the center of the foil.",
    "Then lay the stuffed fish on them and drizzle a little extra-virgin olive oil over it.",
    "Sprinkle a few pinches of kosher salt across the fish.",
    "Fold the foil up around the the fish and pour in the wine.",
    "Ensure that the edges of the foil are pointing up, so it looks like a basket.",
    "Pour 2 cups (470 ml) of dry white wine into the foil with the fish and then gather the edges of the foil.",
    "Fold them over to seal the packet of foil shut.",
    "Use a dry white wine such as pinot grigio or chardonnay.",
    "Bake the whole fish for 30 to 35 minutes.",
    "Put the baking sheet with the fish in the preheated oven.",
    "Cook the fish until it's flaky and cooked throughout.",
    "To test if the fish is finished, insert a fork into the thickest part and twist it a little.",
    "The fish should flake and come away with the fork.",
    "If it's not, cook it a few more minutes and check again.",
    "Serve the whole fish immediately.",
    "Turn off the oven and transfer the whole fish to a serving platter.",
    "Consider serving the fish with a green salad, cooked pasta, or steamed rice.",
    "Refrigerate the leftover fish in an airtight container for up to 3 to 4 days.",
    "Making Indian-Spiced Fish Mix half of the turmeric, chili powder, and salt.",
    "To make the dry spice rub, put 1/2 teaspoon (1.5 g) of the turmeric powder into a small bowl.",
    "Stir in 1 teaspoon (2.5 g) of the chili powder and 1/2 teaspoon (2.5 g) of salt.",
    "Rub the dry mix over 2 whole fish and marinate it for 1 hour.",
    "Place 2 whole prepared fish on a baking sheet.",
    "Put half of the dry spice rub onto each fish.",
    "Use your fingers to rub the spice across both sides of each fish.",
    "Put the fish in the fridge to marinate for at least 1 hour.",
    "Marinate the fish up to 6 hours before you're ready to cook it.",
    "Use tilapia, snapper, or any of your favorite fish for this recipe.",
    "Fry the fish in 4 tablespoons (59 ml) of the oil for 4 minutes.",
    "Pour the vegetable oil into a skillet and turn the burner to medium-high.",
    "Once the oil shimmers, lower both of the marinated fish into the skillet.",
    "Fry the fish for 2 minutes and then flip them over.",
    "Fry the fish for 2 more minutes.",
    "Both sides should be golden brown, but the centers of the fish won't be completely cooked at this point.",
    "Remove the fish and drain some of the oil from the skillet.",
    "Lay a few paper towels on a plate and transfer the fish to the towels.",
    "Carefully pour out all but 2 tablespoons (30 ml) of the oil from the skillet.",
    "The paper towels will absorb some of the excess oil from the fish.",
    "You'll use the oil in the skillet to make the masala.",
    "Discard the excess oil that you poured out of the skillet.",
    "Fry the mustard, curry leaves, and onion for 3 to 5 minutes.",
    "Turn the burner to medium and stir 1/4 teaspoon (3 g) of mustard seeds into the skillet.",
    "Add 2 torn curry leaves and fry them until they start to crackle.",
    "Stir in 1 minced onion and continue to cook the mixture until the onion softens.",
    "Stir the onion mixture frequently to prevent it from sticking to the skillet.",
    "Add the ginger, garlic, chili, and tomatoes.",
    "Stir 1 in (2.5 cm) of freshly grated ginger into the skillet along with 3 to 4 cloves of chopped garlic, 2 chopped green chilies, and 2 chopped tomatoes.",
    "Stir and cook the mixture for about 5 minutes.",
    "The tomatoes should begin to soften and break down as they cook.",
    "Stir in the turmeric, chili powder, coriander, and masala.",
    "Add the remaining 1/4 teaspoon (1 g) of turmeric powder, 1 teaspoon (2.55 g) of chili powder, 1 teaspoon (2.5 g) of ground coriander, and 1/2 teaspoon (1 g) of garam masala.",
    "Stir and heat the spices for 1 minute.",
    "You can taste the sauce at this point and add a little salt according to your taste.",
    "Add water, lime juice, and cilantro leaves to the skillet.",
    "Pour ⁄4 cup (59 ml) of water and the juice of 1/2 a lime to the skillet.",
    "Stir in 2 chopped sprigs of cilantro and cook the masala for 5 to 10 minutes.",
    "The masala should thicken as the liquid evaporates.",
    "Preheat the oven to 400 °F (204 °C) and assemble the packets of fish.",
    "Tear off 2 large sheets of aluminum foil and lay them on a baking sheet.",
    "Spoon about 1/2 cup (115 g) of masala onto the middle of each piece of foil.",
    "Then remove the fish from the refrigerator and put each fish onto the masala in the foil.",
    "Spoon a little more of the masala over each fish and then fold the foil up to make a packet.",
    "Ensure that you seal the edges of the foil tightly.",
    "Bake the fish in foil for 25 to 30 minutes.",
    "Put the baking sheet with fish packets in the preheated oven.",
    "Bake the fish until they're completely cooked through.",
    "To test, open 1 of the packets and insert a fork into the thickest part of the fish.",
    "Turn the fork a little to see if it flakes.",
    "If the fish doesn't flake, seal the foil packet shut and bake the fish for another 5 minutes before you check again.",
    "Serve the Indian-style fish.",
    "Turn off the oven and remove the fish.",
    "Carefully peel back the foil, taking care not to burn yourself as the steam escapes.",
    "Transfer the fish to serving plates and spoon more of the masala over them.",
    "Consider serving the fish with steamed rice, slices of lime, and rings of red onion.",
    "Store the leftover fish in an airtight container.",
    "Refrigerate the fish for up to 3 to 4 days.",
    "Cooking Fish in Garlic-Chili Sauce Preheat the oven to 375 °F (191 °C) and mix the garlic-chili sauce.",
    "Pour 4 tablespoons (59 ml) of oyster sauce into a bowl along with 4 tablespoons (59 ml) of soy sauce and 1 tablespoon (15 ml) of fish sauce.",
    "Stir in 8 to 10 cloves of minced or pressed garlic, 2 tablespoons (25 g) of brown sugar, 1/4 teaspoon (0.5 g) of black pepper, 1 tablespoon (15 ml) of lime or lemon juice, and 1 to 3 sliced red chilies or 2 teaspoons of Thai chili sauce.",
    "Stir until the brown sugar is dissolved and set the sauce aside.",
    "Slice 3 vertical slits on both sides of a whole fish.",
    "Get out 1 whole red snapper or gray mullet.",
    "If you're using rainbow trout or tilapia, get out 2 fish since they're smaller.",
    "Use a sharp knife to cut 3 vertical slits on each side of the fish.",
    "The slits will allow the marinade to soak into the flesh of the fish.",
    "Lay the fish on foil and pour 3 tablespoons (44 ml) of sauce over it.",
    "Tear off a large sheet of aluminum foil and lay the fish in the center.",
    "Pour at least 3 tablespoons (44 ml) of garlic-chili sauce over the fish and turn it over so both sides are coated.",
    "The sauce should get into the slits you cut in the sides of the fish.",
    "If you're using 2 smaller fish, spoon about 2 tablespoons (30 ml) onto each fish.",
    "Seal the foil shut and put the packet directly onto the oven rack.",
    "Bring the sides of the foil together and fold them over tightly.",
    "This should make a sealed packet.",
    "Put the packet of fish in the preheated oven.",
    "If you're worried that the sauce will leak out of the packet, you can place the packet on a baking sheet.",
    "Bake the whole fish for 20 to 25 minutes.",
    "Then check the fish to determine if it's completely cooked throughout.",
    "Remove the packet and carefully peel away the foil.",
    "Insert a fork into the thickest part of the fish to see if it flakes.",
    "If it doesn't, close the packet and bake the fish for another 5 to 10 minutes before checking again.",
    "Remove and serve the whole fish with garlic-chili sauce.",
    "Turn off the oven and take the packet out.",
    "Open the foil carefully and transfer the whole fish to a serving platter.",
    "Spoon the remaining garlic-chili sauce over the fish and garnish it with slices or wedges of fresh lemon.",
    "For a fresh herbal flavor, consider chopping a handful of fresh cilantro or basil and sprinkling it over the fish.",
    "Refrigerate the leftover fish in an airtight container for up to 3 to 4 days."
  ],
  "tyn_section":[
    "Herb and Garlic-Stuffed Fish",
    "Measuring cups and spoons",
    "Knife and cutting board",
    "Foil",
    "Rimmed baking sheet",
    "Serving platter",
    "Fork",
    "Indian-Spiced Fish",
    "Small bowl",
    "Spoon",
    "Baking sheet",
    "Skillet",
    "Aluminum foil",
    "Fish in Garlic-Chili Sauce",
    "Bowl"
  ],
  "tyn_model":[
    "foil",
    "skillet",
    "oven",
    "garlic",
    "baking sheet",
    "lemon",
    "fork",
    "salt",
    "turmeric",
    "chili powder",
    "oil",
    "onion",
    "garlic-chili sauce",
    "fish",
    "aluminum foil",
    "airtight container",
    "tomatoes",
    "sharp knife",
    "snapper",
    "bay",
    "herbs",
    "fresh herbs",
    "serving platter",
    "steamed rice",
    "tilapia",
    "burner",
    "paper towels",
    "curry leaves",
    "ginger",
    "water",
    "cilantro",
    "brown sugar",
    "baking herb and garlic",
    "cutting board",
    "bass",
    "thyme",
    "oregano",
    "marjoram",
    "parsley",
    "olive oil",
    "extra-virgin olive oil",
    "kosher salt",
    "wine",
    "dry white wine",
    "pinot",
    "green salad",
    "small bowl",
    "fridge",
    "vegetable oil",
    "plate",
    "mustard",
    "mustard seeds",
    "chili",
    "green chilies",
    "coriander",
    "masala",
    "ground coriander",
    "garam masala",
    "lime juice",
    "refrigerator",
    "fish packets",
    "serving plates",
    "lime",
    "red onion",
    "garlic-chili",
    "oyster sauce",
    "bowl",
    "soy sauce",
    "fish sauce",
    "black pepper",
    "lime or lemon",
    "red chilies",
    "thai chili sauce",
    "red snapper",
    "mullet",
    "rainbow trout",
    "oven rack",
    "basil"
  ],
  "simple_metrics":{
    "r":0.5333333333,
    "p":0.1025641026,
    "f1":0.1720430108,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.1538461538,
    "f1":0.2580645161
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8666666667,
    "p":0.1923076923,
    "f1":0.3147699758
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.1025641026,
    "f1":0.1751824818
  }
}