{
  "title":"How to Plan Tile Layout",
  "url":"https://www.wikihow.com/Plan-Tile-Layout",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Tiles and Tiling"
  ],
  "parts":[
    {
      "name":"Establishing Your Layout Lines",
      "steps":[
        {
          "headline":"Calculate the square footage of the room.",
          "description":"To determine the square footage of a square or rectangular room, simply find the length of 2 adjacent walls in square feet and multiply them together. For irregularly-shaped areas like closets, alcoves, and counters, multiply the length and width of the extra space separately, then add this number to the square footage of the main part of the room. If you're measuring a rectangular room that's 18 square feet (1.7 m) x 12 square feet (1.1 m), for example, the total square footage would be 216 square feet (20.1 m). Figuring out the room's square footage will tell you exactly how much tile you'll need for your flooring project, which may influence the size and style you go with."
        },
        {
          "headline":"Note the size of your tiles.",
          "description":"Once you’ve picked out a style you like, jot down the tile’s dimensions in a notebook or on a separate sheet of paper. You’ll need to know their exact length and width in order to determine how many will fit within the floor space of the room you’re tiling. The size of the tiles should be plainly displayed on the product listing, packaging, or order invoice. It may be a good idea to measure the tiles yourself just in case the listed dimensions are off by a centimeter or 2."
        },
        {
          "headline":"Find the length of the room’s longest walls.",
          "description":"Run a tape measure along the wall from corner to corner. Record this number in your notebook, being sure to specify which measurements are which. If the room you’re working in is perfectly square, you can start with either set of opposing walls. Be sure to measure the wall using the same unit as your tiles. If the length and width of the tiles is given in inches, for example, you’ll want to measure the room in inches, as well."
        },
        {
          "headline":"Mark the midpoint of each wall.",
          "description":"Divide the total length of the walls in half, then draw a small notch or dot on the floor at this spot using a carpenter’s pencil. Aligning the midpoints of each wall will help you find the room’s center. For a wall that’s 16 feet (4.9 m) long, for instance, you would make your mark at 8 feet (2.4 m). If the room you’re measuring is perfectly square, you can go ahead and draw a line straight across to the opposite wall save time."
        },
        {
          "headline":"Draw a line connecting the midpoints of both walls.",
          "description":"To ensure that the line is straight, run the tip of your pencil along the edge of a yardstick or straight edge, using a framing square to ensure a precise 90-degree angle. Slide your yardstick down and double-check its orientation every few feet to keep the line from becoming crooked. You can also use a chalk line tool for greater efficiency and exactness. Simply extend the retractable wire between the 2 walls, then pull up and release the wire quickly to leave behind a perfectly straight line of chalk."
        },
        {
          "headline":"Repeat the process on the room’s shorter walls.",
          "description":"Measure the length of the remaining pair of walls, then mark the midpoint of each. Draw a line connecting the opposing midpoints through the center of the room. This line will intersect the first line, indicating the exact center of the room. When tiling adjoining rooms, draw your lines so that they run from 1 room to the next. Make sure the line is positioned in the center of both rooms."
        },
        {
          "headline":"Use the \"3-4-5\" method to find the center of irregularly-shaped rooms.",
          "description":"Measure and mark 4 feet (1.2 m) outward from the center of the line you drew from the longest wall. Then, make a second mark 3 feet (0.91 m) down along the center of the wall line. Stretch your tape measure between the 3 ft (0.91 m) mark and the 4 ft (1.2 m) mark. The distance between the 2 marks should be exactly 5 ft (1.5 m). Make a final mark where the tape measure crosses the 4 ft (1.2 m) mark to pinpoint the room's center. This method is useful for establishing a starting point in rooms with odd dimensions."
        }
      ]
    },
    {
      "name":"Dry-Fitting the Tiles",
      "steps":[
        {
          "headline":"Arrange the tiles outward from the center of the room.",
          "description":"To get started, place a tile at each of the 4 corners where the wall lines intersect. Beginning at the center of the room rather than at the walls will prevent you from ending up with gaps or unsightly narrow tiles around the outer perimeter of the room. Symmetrical central tiles will also serve as an attractive focal point for the room."
        },
        {
          "headline":"Use spacers to separate each tile.",
          "description":"After you lay down a tile, place a tile spacer at either end before putting down the next tile in the row. The spacers will ensure that your layout remains neat and even and that no 2 tiles are set too close together. Spacers also serve to show the minimum distance you'll need to leave between each tile for your grout lines. Tile spacers come in many different sizes. The amount of space you leave between tiles will depend on the look you’re trying to achieve, but ⁄8 in (0.32 cm) spacers are standard for most flooring projects."
        },
        {
          "headline":"Work your way toward the wall.",
          "description":"Starting from the 4 central tiles, lay out the remaining tiles in a straight line until you reach the wall. Then, return to the center and work your way toward the opposite wall to form a single row. Be sure to complete 1 row before moving on to the next."
        },
        {
          "headline":"Lay your tile in 2–3 ft (0.61–0.91 m) sections.",
          "description":"The optimum size of each section will vary based on the dimensions of your tile. If you’re working with 12 in (30 cm) square tiles, your section groupings might be comprised of 2-3 tiles in each direction (for a total of 4-6 tiles per section). If you need a visual aid to help you keep track of your sections, snap a series of chalk lines to clearly mark where each next group of tiles should go. Dry-fitting your tile in sections usually results in straighter, more precise grout lines."
        },
        {
          "headline":"Mark the last tile in each row to indicate where to cut it if needed.",
          "description":"As you near the edges of the room, you may find that you don’t have enough space to set the final tile. When this happens, you’ll need to cut your end tiles to ensure a proper fit. Measure the distance between the last full tile you laid down and the wall and mark this measurement on the end tile. You can cut the tile later using a masonry saw. If the space left over at the end of a row is especially narrow, pick up the rest of the tiles in the row and shift them down half a tile’s length towards the opposite wall. Adjust your other rows accordingly. That way, you'll have a larger partial tile at either end rather than a tiny sliver visible along only 1 wall."
        },
        {
          "headline":"Trim end tiles to fit around household fixtures.",
          "description":"It may also be necessary to cut tiles when they run up against door jambs, cabinet bases, air vents, fireplaces, and similar obstacles. To do this, record the length and width of the object protruding into the tile space, then mark those measurements on the tile using a straight edge. Use a wooden shim or scrap piece of cardboard to account for the grout lines in your measurements. Make sure the lines you draw on your tiles are plainly visible. They'll serve as a guide when it comes time to do your cutting."
        },
        {
          "headline":"Install the tile.",
          "description":"Once you’re satisfied with your layout, all that’s left to do is call a tiling contractor and have your tile put in professionally. You might also consider tackling the job yourself if you’re handy with home improvement projects. When you’re done, you’ll have a handsome, custom-designed tiled floor to show for your efforts. Take care of any necessary last-minute adjustments before you break out the mortar and grout. By the time you’ve begun setting the tiles, it will be too late to make changes. Keep in mind that the tiles will have to come up prior to installation. This isn't an issue—when the time comes, simply lay them out again in the same formation you used during the dry-fitting phase."
        }
      ]
    }
  ],
  "text":" Establishing Your Layout Lines Calculate the square footage of the room. To determine the square footage of a square or rectangular room, simply find the length of 2 adjacent walls in square feet and multiply them together. For irregularly-shaped areas like closets, alcoves, and counters, multiply the length and width of the extra space separately, then add this number to the square footage of the main part of the room. If you're measuring a rectangular room that's 18 square feet (1.7 m) x 12 square feet (1.1 m), for example, the total square footage would be 216 square feet (20.1 m). Figuring out the room's square footage will tell you exactly how much tile you'll need for your flooring project, which may influence the size and style you go with. Note the size of your tiles. Once you’ve picked out a style you like, jot down the tile’s dimensions in a notebook or on a separate sheet of paper. You’ll need to know their exact length and width in order to determine how many will fit within the floor space of the room you’re tiling. The size of the tiles should be plainly displayed on the product listing, packaging, or order invoice. It may be a good idea to measure the tiles yourself just in case the listed dimensions are off by a centimeter or 2. Find the length of the room’s longest walls. Run a tape measure along the wall from corner to corner. Record this number in your notebook, being sure to specify which measurements are which. If the room you’re working in is perfectly square, you can start with either set of opposing walls. Be sure to measure the wall using the same unit as your tiles. If the length and width of the tiles is given in inches, for example, you’ll want to measure the room in inches, as well. Mark the midpoint of each wall. Divide the total length of the walls in half, then draw a small notch or dot on the floor at this spot using a carpenter’s pencil. Aligning the midpoints of each wall will help you find the room’s center. For a wall that’s 16 feet (4.9 m) long, for instance, you would make your mark at 8 feet (2.4 m). If the room you’re measuring is perfectly square, you can go ahead and draw a line straight across to the opposite wall save time. Draw a line connecting the midpoints of both walls. To ensure that the line is straight, run the tip of your pencil along the edge of a yardstick or straight edge, using a framing square to ensure a precise 90-degree angle. Slide your yardstick down and double-check its orientation every few feet to keep the line from becoming crooked. You can also use a chalk line tool for greater efficiency and exactness. Simply extend the retractable wire between the 2 walls, then pull up and release the wire quickly to leave behind a perfectly straight line of chalk. Repeat the process on the room’s shorter walls. Measure the length of the remaining pair of walls, then mark the midpoint of each. Draw a line connecting the opposing midpoints through the center of the room. This line will intersect the first line, indicating the exact center of the room. When tiling adjoining rooms, draw your lines so that they run from 1 room to the next. Make sure the line is positioned in the center of both rooms. Use the \"3-4-5\" method to find the center of irregularly-shaped rooms. Measure and mark 4 feet (1.2 m) outward from the center of the line you drew from the longest wall. Then, make a second mark 3 feet (0.91 m) down along the center of the wall line. Stretch your tape measure between the 3 ft (0.91 m) mark and the 4 ft (1.2 m) mark. The distance between the 2 marks should be exactly 5 ft (1.5 m). Make a final mark where the tape measure crosses the 4 ft (1.2 m) mark to pinpoint the room's center. This method is useful for establishing a starting point in rooms with odd dimensions. Dry-Fitting the Tiles Arrange the tiles outward from the center of the room. To get started, place a tile at each of the 4 corners where the wall lines intersect. Beginning at the center of the room rather than at the walls will prevent you from ending up with gaps or unsightly narrow tiles around the outer perimeter of the room. Symmetrical central tiles will also serve as an attractive focal point for the room. Use spacers to separate each tile. After you lay down a tile, place a tile spacer at either end before putting down the next tile in the row. The spacers will ensure that your layout remains neat and even and that no 2 tiles are set too close together. Spacers also serve to show the minimum distance you'll need to leave between each tile for your grout lines. Tile spacers come in many different sizes. The amount of space you leave between tiles will depend on the look you’re trying to achieve, but ⁄8 in (0.32 cm) spacers are standard for most flooring projects. Work your way toward the wall. Starting from the 4 central tiles, lay out the remaining tiles in a straight line until you reach the wall. Then, return to the center and work your way toward the opposite wall to form a single row. Be sure to complete 1 row before moving on to the next. Lay your tile in 2–3 ft (0.61–0.91 m) sections. The optimum size of each section will vary based on the dimensions of your tile. If you’re working with 12 in (30 cm) square tiles, your section groupings might be comprised of 2-3 tiles in each direction (for a total of 4-6 tiles per section). If you need a visual aid to help you keep track of your sections, snap a series of chalk lines to clearly mark where each next group of tiles should go. Dry-fitting your tile in sections usually results in straighter, more precise grout lines. Mark the last tile in each row to indicate where to cut it if needed. As you near the edges of the room, you may find that you don’t have enough space to set the final tile. When this happens, you’ll need to cut your end tiles to ensure a proper fit. Measure the distance between the last full tile you laid down and the wall and mark this measurement on the end tile. You can cut the tile later using a masonry saw. If the space left over at the end of a row is especially narrow, pick up the rest of the tiles in the row and shift them down half a tile’s length towards the opposite wall. Adjust your other rows accordingly. That way, you'll have a larger partial tile at either end rather than a tiny sliver visible along only 1 wall. Trim end tiles to fit around household fixtures. It may also be necessary to cut tiles when they run up against door jambs, cabinet bases, air vents, fireplaces, and similar obstacles. To do this, record the length and width of the object protruding into the tile space, then mark those measurements on the tile using a straight edge. Use a wooden shim or scrap piece of cardboard to account for the grout lines in your measurements. Make sure the lines you draw on your tiles are plainly visible. They'll serve as a guide when it comes time to do your cutting. Install the tile. Once you’re satisfied with your layout, all that’s left to do is call a tiling contractor and have your tile put in professionally. You might also consider tackling the job yourself if you’re handy with home improvement projects. When you’re done, you’ll have a handsome, custom-designed tiled floor to show for your efforts. Take care of any necessary last-minute adjustments before you break out the mortar and grout. By the time you’ve begun setting the tiles, it will be too late to make changes. Keep in mind that the tiles will have to come up prior to installation. This isn't an issue—when the time comes, simply lay them out again in the same formation you used during the dry-fitting phase.",
  "sentences":[
    " Establishing Your Layout Lines Calculate the square footage of the room.",
    "To determine the square footage of a square or rectangular room, simply find the length of 2 adjacent walls in square feet and multiply them together.",
    "For irregularly-shaped areas like closets, alcoves, and counters, multiply the length and width of the extra space separately, then add this number to the square footage of the main part of the room.",
    "If you're measuring a rectangular room that's 18 square feet (1.7 m) x 12 square feet (1.1 m), for example, the total square footage would be 216 square feet (20.1 m).",
    "Figuring out the room's square footage will tell you exactly how much tile you'll need for your flooring project, which may influence the size and style you go with.",
    "Note the size of your tiles.",
    "Once you’ve picked out a style you like, jot down the tile’s dimensions in a notebook or on a separate sheet of paper.",
    "You’ll need to know their exact length and width in order to determine how many will fit within the floor space of the room you’re tiling.",
    "The size of the tiles should be plainly displayed on the product listing, packaging, or order invoice.",
    "It may be a good idea to measure the tiles yourself just in case the listed dimensions are off by a centimeter or 2.",
    "Find the length of the room’s longest walls.",
    "Run a tape measure along the wall from corner to corner.",
    "Record this number in your notebook, being sure to specify which measurements are which.",
    "If the room you’re working in is perfectly square, you can start with either set of opposing walls.",
    "Be sure to measure the wall using the same unit as your tiles.",
    "If the length and width of the tiles is given in inches, for example, you’ll want to measure the room in inches, as well.",
    "Mark the midpoint of each wall.",
    "Divide the total length of the walls in half, then draw a small notch or dot on the floor at this spot using a carpenter’s pencil.",
    "Aligning the midpoints of each wall will help you find the room’s center.",
    "For a wall that’s 16 feet (4.9 m) long, for instance, you would make your mark at 8 feet (2.4 m).",
    "If the room you’re measuring is perfectly square, you can go ahead and draw a line straight across to the opposite wall save time.",
    "Draw a line connecting the midpoints of both walls.",
    "To ensure that the line is straight, run the tip of your pencil along the edge of a yardstick or straight edge, using a framing square to ensure a precise 90-degree angle.",
    "Slide your yardstick down and double-check its orientation every few feet to keep the line from becoming crooked.",
    "You can also use a chalk line tool for greater efficiency and exactness.",
    "Simply extend the retractable wire between the 2 walls, then pull up and release the wire quickly to leave behind a perfectly straight line of chalk.",
    "Repeat the process on the room’s shorter walls.",
    "Measure the length of the remaining pair of walls, then mark the midpoint of each.",
    "Draw a line connecting the opposing midpoints through the center of the room.",
    "This line will intersect the first line, indicating the exact center of the room.",
    "When tiling adjoining rooms, draw your lines so that they run from 1 room to the next.",
    "Make sure the line is positioned in the center of both rooms.",
    "Use the \"3-4-5\" method to find the center of irregularly-shaped rooms.",
    "Measure and mark 4 feet (1.2 m) outward from the center of the line you drew from the longest wall.",
    "Then, make a second mark 3 feet (0.91 m) down along the center of the wall line.",
    "Stretch your tape measure between the 3 ft (0.91 m) mark and the 4 ft (1.2 m) mark.",
    "The distance between the 2 marks should be exactly 5 ft (1.5 m).",
    "Make a final mark where the tape measure crosses the 4 ft (1.2 m) mark to pinpoint the room's center.",
    "This method is useful for establishing a starting point in rooms with odd dimensions.",
    "Dry-Fitting the Tiles Arrange the tiles outward from the center of the room.",
    "To get started, place a tile at each of the 4 corners where the wall lines intersect.",
    "Beginning at the center of the room rather than at the walls will prevent you from ending up with gaps or unsightly narrow tiles around the outer perimeter of the room.",
    "Symmetrical central tiles will also serve as an attractive focal point for the room.",
    "Use spacers to separate each tile.",
    "After you lay down a tile, place a tile spacer at either end before putting down the next tile in the row.",
    "The spacers will ensure that your layout remains neat and even and that no 2 tiles are set too close together.",
    "Spacers also serve to show the minimum distance you'll need to leave between each tile for your grout lines.",
    "Tile spacers come in many different sizes.",
    "The amount of space you leave between tiles will depend on the look you’re trying to achieve, but ⁄8 in (0.32 cm) spacers are standard for most flooring projects.",
    "Work your way toward the wall.",
    "Starting from the 4 central tiles, lay out the remaining tiles in a straight line until you reach the wall.",
    "Then, return to the center and work your way toward the opposite wall to form a single row.",
    "Be sure to complete 1 row before moving on to the next.",
    "Lay your tile in 2–3 ft (0.61–0.91 m) sections.",
    "The optimum size of each section will vary based on the dimensions of your tile.",
    "If you’re working with 12 in (30 cm) square tiles, your section groupings might be comprised of 2-3 tiles in each direction (for a total of 4-6 tiles per section).",
    "If you need a visual aid to help you keep track of your sections, snap a series of chalk lines to clearly mark where each next group of tiles should go.",
    "Dry-fitting your tile in sections usually results in straighter, more precise grout lines.",
    "Mark the last tile in each row to indicate where to cut it if needed.",
    "As you near the edges of the room, you may find that you don’t have enough space to set the final tile.",
    "When this happens, you’ll need to cut your end tiles to ensure a proper fit.",
    "Measure the distance between the last full tile you laid down and the wall and mark this measurement on the end tile.",
    "You can cut the tile later using a masonry saw.",
    "If the space left over at the end of a row is especially narrow, pick up the rest of the tiles in the row and shift them down half a tile’s length towards the opposite wall.",
    "Adjust your other rows accordingly.",
    "That way, you'll have a larger partial tile at either end rather than a tiny sliver visible along only 1 wall.",
    "Trim end tiles to fit around household fixtures.",
    "It may also be necessary to cut tiles when they run up against door jambs, cabinet bases, air vents, fireplaces, and similar obstacles.",
    "To do this, record the length and width of the object protruding into the tile space, then mark those measurements on the tile using a straight edge.",
    "Use a wooden shim or scrap piece of cardboard to account for the grout lines in your measurements.",
    "Make sure the lines you draw on your tiles are plainly visible.",
    "They'll serve as a guide when it comes time to do your cutting.",
    "Install the tile.",
    "Once you’re satisfied with your layout, all that’s left to do is call a tiling contractor and have your tile put in professionally.",
    "You might also consider tackling the job yourself if you’re handy with home improvement projects.",
    "When you’re done, you’ll have a handsome, custom-designed tiled floor to show for your efforts.",
    "Take care of any necessary last-minute adjustments before you break out the mortar and grout.",
    "By the time you’ve begun setting the tiles, it will be too late to make changes.",
    "Keep in mind that the tiles will have to come up prior to installation.",
    "This isn't an issue—when the time comes, simply lay them out again in the same formation you used during the dry-fitting phase."
  ],
  "tyn_section":[
    "Flooring tiles",
    "Tape measure",
    "Yardstick",
    "Framing square",
    "Tile spacers",
    "Carpenter’s pencil",
    "Notebook or scrap paper",
    "Chalk line (optional)"
  ],
  "tyn_model":[
    "tiles",
    "tile",
    "tape measure",
    "grout",
    "chalk",
    "carpenter’s pencil",
    "pencil",
    "chalk line",
    "retractable wire",
    "tile spacer",
    "masonry saw",
    "cardboard",
    "tiling contractor",
    "mortar",
    "—when"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.1333333333,
    "f1":0.1739130435,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.4,
    "f1":0.487804878
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.5333333333,
    "f1":0.5755395683
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.2,
    "f1":0.2608695652
  }
}