{
  "title":"How to Remove Baseboards",
  "url":"https://www.wikihow.com/Remove-Baseboards",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs"
  ],
  "parts":[
    {
      "name":"Removing the Baseboard from the Wall",
      "steps":[
        {
          "headline":"Kneel in front of the edge of a baseboard with your tools at the ready.",
          "description":"You're starting at the edge instead of the center to give the pressure caused by prying an exit. If you start in the center, the pressure will be solely on the board, and you'll run the risk of snapping the board and damaging the drywall. You'll also prolong the removal process. A good place to start is where the door casting meets the baseboard."
        },
        {
          "headline":"Cut through the caulk binding the board to the wall.",
          "description":"Take your utility knife and position it at the top of the edge of the baseboard. This is where the caulk is located. Slowly but firmly press the blade into the caulk and run it along the end of the baseboard. You want to break this adhesive so that, when you're prying, it doesn't pull your drywall away with the board. Return to your starting position once you have finished."
        },
        {
          "headline":"Wedge your taping knife between the board and the wall to create space.",
          "description":"Position your taping knife at the top edge of the newly made score. Grab your hammer and tap the knife in deeper to give yourself more of a hold. Flex the knife in the grove a bit to create some spacing. If you have shoe molding, go ahead and remove it first with your taping knife using this same process."
        },
        {
          "headline":"Find the nails in the space and place your taping knife above them.",
          "description":"Take the taping knife out of the grove for a moment and check for any nails. If you don't find any, move along the board a little and repeat step 3. You're finding the nail so you have a place to position your crowbar and make pulling off the baseboard easier. If your baseboards are glued on, you can skip this step and move onto the next. If you have a trim puller, you can use that instead of the taping knife."
        },
        {
          "headline":"Pull back the space between the taping knife and board with a crowbar.",
          "description":"Place the claw of your crowbar between the blade of the knife and the board. Gently pull your end of the bar up to separate the board from the wall. Carefully apply more pressure if needed, but don't yank or force anything. If you feel you're going to crack the trim or damage the drywall, you may need to settle a second taping knife in front of the first to further disperse the pressure. If you have a trim tool, you need neither the crowbar or taping knife for this step. The trim tool will do the job of both by itself."
        },
        {
          "headline":"Work along down the baseboard while repeating steps 3 through 5.",
          "description":"You'll steadily free the baseboard from the wall while doing this. Stop once you make it to the end of the current board and the start of the next."
        },
        {
          "headline":"Pull the board free with your hand if needed.",
          "description":"If the entire board doesn't come off after step 6, grab the board by the edge where you started and pull gently. If your board still doesn't come free, it's probably behind the board immediately next to it. Remove this board if this is the case. Both boards should come free when you reach this step again."
        }
      ]
    },
    {
      "name":"Wrapping up Baseboard Removal",
      "steps":[
        {
          "headline":"Pull the nails out of the back of the board with a pair of nippers.",
          "description":"Clamp your nippers at the base of the nail and pull or rock them out. For safety purposes, make sure that you place every nail in a secure place away from you, and then set your boards aside.Do not bang the nails out through the front of the board. This will put more holes in the trim than necessary and leave you with a mess of wood pieces to clean."
        },
        {
          "headline":"Mark your boards if you plan on using them again.",
          "description":"Now that your board is removed, you'll want to take a sharpie or some other type of marker and jot down a number on both the board and the portion of the wall that used to be immediately behind it. The number on the board should correspond with the number on the wall. This way, you'll know what goes where you're ready to reinstall."
        },
        {
          "headline":"Scrape any remaining caulk off the wall.",
          "description":"Take your taping knife and gently chip away at the caulk. Come at it from the side rather than from the top or bottom to avoid accidentally chipping the drywall. You can leave a dustpan underneath you while you work to catch the falling chippings."
        }
      ]
    }
  ],
  "text":" Removing the Baseboard from the Wall Kneel in front of the edge of a baseboard with your tools at the ready. You're starting at the edge instead of the center to give the pressure caused by prying an exit. If you start in the center, the pressure will be solely on the board, and you'll run the risk of snapping the board and damaging the drywall. You'll also prolong the removal process. A good place to start is where the door casting meets the baseboard. Cut through the caulk binding the board to the wall. Take your utility knife and position it at the top of the edge of the baseboard. This is where the caulk is located. Slowly but firmly press the blade into the caulk and run it along the end of the baseboard. You want to break this adhesive so that, when you're prying, it doesn't pull your drywall away with the board. Return to your starting position once you have finished. Wedge your taping knife between the board and the wall to create space. Position your taping knife at the top edge of the newly made score. Grab your hammer and tap the knife in deeper to give yourself more of a hold. Flex the knife in the grove a bit to create some spacing. If you have shoe molding, go ahead and remove it first with your taping knife using this same process. Find the nails in the space and place your taping knife above them. Take the taping knife out of the grove for a moment and check for any nails. If you don't find any, move along the board a little and repeat step 3. You're finding the nail so you have a place to position your crowbar and make pulling off the baseboard easier. If your baseboards are glued on, you can skip this step and move onto the next. If you have a trim puller, you can use that instead of the taping knife. Pull back the space between the taping knife and board with a crowbar. Place the claw of your crowbar between the blade of the knife and the board. Gently pull your end of the bar up to separate the board from the wall. Carefully apply more pressure if needed, but don't yank or force anything. If you feel you're going to crack the trim or damage the drywall, you may need to settle a second taping knife in front of the first to further disperse the pressure. If you have a trim tool, you need neither the crowbar or taping knife for this step. The trim tool will do the job of both by itself. Work along down the baseboard while repeating steps 3 through 5. You'll steadily free the baseboard from the wall while doing this. Stop once you make it to the end of the current board and the start of the next. Pull the board free with your hand if needed. If the entire board doesn't come off after step 6, grab the board by the edge where you started and pull gently. If your board still doesn't come free, it's probably behind the board immediately next to it. Remove this board if this is the case. Both boards should come free when you reach this step again. Wrapping up Baseboard Removal Pull the nails out of the back of the board with a pair of nippers. Clamp your nippers at the base of the nail and pull or rock them out. For safety purposes, make sure that you place every nail in a secure place away from you, and then set your boards aside.Do not bang the nails out through the front of the board. This will put more holes in the trim than necessary and leave you with a mess of wood pieces to clean. Mark your boards if you plan on using them again. Now that your board is removed, you'll want to take a sharpie or some other type of marker and jot down a number on both the board and the portion of the wall that used to be immediately behind it. The number on the board should correspond with the number on the wall. This way, you'll know what goes where you're ready to reinstall. Scrape any remaining caulk off the wall. Take your taping knife and gently chip away at the caulk. Come at it from the side rather than from the top or bottom to avoid accidentally chipping the drywall. You can leave a dustpan underneath you while you work to catch the falling chippings.",
  "sentences":[
    " Removing the Baseboard from the Wall Kneel in front of the edge of a baseboard with your tools at the ready.",
    "You're starting at the edge instead of the center to give the pressure caused by prying an exit.",
    "If you start in the center, the pressure will be solely on the board, and you'll run the risk of snapping the board and damaging the drywall.",
    "You'll also prolong the removal process.",
    "A good place to start is where the door casting meets the baseboard.",
    "Cut through the caulk binding the board to the wall.",
    "Take your utility knife and position it at the top of the edge of the baseboard.",
    "This is where the caulk is located.",
    "Slowly but firmly press the blade into the caulk and run it along the end of the baseboard.",
    "You want to break this adhesive so that, when you're prying, it doesn't pull your drywall away with the board.",
    "Return to your starting position once you have finished.",
    "Wedge your taping knife between the board and the wall to create space.",
    "Position your taping knife at the top edge of the newly made score.",
    "Grab your hammer and tap the knife in deeper to give yourself more of a hold.",
    "Flex the knife in the grove a bit to create some spacing.",
    "If you have shoe molding, go ahead and remove it first with your taping knife using this same process.",
    "Find the nails in the space and place your taping knife above them.",
    "Take the taping knife out of the grove for a moment and check for any nails.",
    "If you don't find any, move along the board a little and repeat step 3.",
    "You're finding the nail so you have a place to position your crowbar and make pulling off the baseboard easier.",
    "If your baseboards are glued on, you can skip this step and move onto the next.",
    "If you have a trim puller, you can use that instead of the taping knife.",
    "Pull back the space between the taping knife and board with a crowbar.",
    "Place the claw of your crowbar between the blade of the knife and the board.",
    "Gently pull your end of the bar up to separate the board from the wall.",
    "Carefully apply more pressure if needed, but don't yank or force anything.",
    "If you feel you're going to crack the trim or damage the drywall, you may need to settle a second taping knife in front of the first to further disperse the pressure.",
    "If you have a trim tool, you need neither the crowbar or taping knife for this step.",
    "The trim tool will do the job of both by itself.",
    "Work along down the baseboard while repeating steps 3 through 5.",
    "You'll steadily free the baseboard from the wall while doing this.",
    "Stop once you make it to the end of the current board and the start of the next.",
    "Pull the board free with your hand if needed.",
    "If the entire board doesn't come off after step 6, grab the board by the edge where you started and pull gently.",
    "If your board still doesn't come free, it's probably behind the board immediately next to it.",
    "Remove this board if this is the case.",
    "Both boards should come free when you reach this step again.",
    "Wrapping up Baseboard Removal Pull the nails out of the back of the board with a pair of nippers.",
    "Clamp your nippers at the base of the nail and pull or rock them out.",
    "For safety purposes, make sure that you place every nail in a secure place away from you, and then set your boards aside.Do not bang the nails out through the front of the board.",
    "This will put more holes in the trim than necessary and leave you with a mess of wood pieces to clean.",
    "Mark your boards if you plan on using them again.",
    "Now that your board is removed, you'll want to take a sharpie or some other type of marker and jot down a number on both the board and the portion of the wall that used to be immediately behind it.",
    "The number on the board should correspond with the number on the wall.",
    "This way, you'll know what goes where you're ready to reinstall.",
    "Scrape any remaining caulk off the wall.",
    "Take your taping knife and gently chip away at the caulk.",
    "Come at it from the side rather than from the top or bottom to avoid accidentally chipping the drywall.",
    "You can leave a dustpan underneath you while you work to catch the falling chippings."
  ],
  "tyn_section":[
    "Crowbar",
    "Taping Knife",
    "Utility Knife",
    "Nippers",
    "Trim Remover Tool"
  ],
  "tyn_model":[
    "taping knife",
    "crowbar",
    "knife",
    "nails",
    "nippers",
    "baseboard",
    "drywall",
    "utility knife",
    "hammer",
    "shoe molding",
    "trim tool",
    "board",
    "sharpie",
    "marker",
    "dustpan"
  ],
  "simple_metrics":{
    "r":0.8,
    "p":0.2666666667,
    "f1":0.4,
    "avg_pos":0.0666666667
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.4,
    "f1":0.5714285714
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4,
    "f1":0.5714285714
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  }
}