{
  "title":"How to Keep White Sheets White",
  "url":"https://www.wikihow.com/Keep-White-Sheets-White",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms",
    "Bed Linen",
    "Bed Sheets"
  ],
  "methods":[
    {
      "name":"Removing Stains and Discoloration",
      "steps":[
        {
          "headline":"Fill a plastic bin halfway full of warm water.",
          "description":"Use a large rectangular plastic bin to soak your sheets. Let warm water run from your faucet for about 30 seconds so it can warm up to at least 70 °F (21 °C). Hold the bin under your faucet to fill it with water, then place it on a flat surface after it is about halfway full. This should be enough water to completely cover your sheets. If you don’t have a rectangular bin, use a bucket instead."
        },
        {
          "headline":"Add 1/4 cup (60 g) of baking soda to the bin of water.",
          "description":"Use a measuring cup to scoop your baking soda, and pour it directly into the water in your bin or bucket. Baking soda is great to use when lightening your sheets because it helps lift stubborn stains and colored spots."
        },
        {
          "headline":"Pour in 1 cup (237 mL) of white vinegar to deodorize and fight stains.",
          "description":"Use a measuring cup to get about 1 cup (237 mL) of white distilled vinegar, and pour it into the bin of water. White distilled vinegar works particularly well to get rid of any unpleasant odors that may linger in your sheets. It also helps get rid of stains and yellowed areas. Avoid using apple cider vinegar as a replacement for white distilled vinegar. Apple cider vinegar can give your sheets a brownish tint."
        },
        {
          "headline":"Use 2 tbsp (30 mL) of dish soap to create some bubbles.",
          "description":"Add dish soap to your bin of water to provide a deep, thorough clean. The dish soap cleans and disinfects your sheets, and the bubbles it creates help deeply penetrate the fabric. You can simply squeeze in a few drops rather than measuring an exact amount if you’d like. A bit more soap won’t hurt your sheets."
        },
        {
          "headline":"Squeeze 1 lemon over the bin for an all-natural whitener.",
          "description":"Carefully cut a lemon in half horizontally, and hand-squeeze the juice into your bin from both halves. Get as much juice out of the lemon as you can, and then throw away the peels. Lemon juice naturally helps lift and remove stubborn stains."
        },
        {
          "headline":"Use a spoon to mix your concoction thoroughly.",
          "description":"After you add the baking soda, vinegar, dish soap, and lemon to your bin of water, grab a kitchen utensil to stir up your ingredients. Mix up the solution for 10-30 seconds or so."
        },
        {
          "headline":"Submerge your sheets in the water.",
          "description":"Once you mix up your ingredients, dunk your fitted and top sheet inside. Soak your pillowcases as you do this as well. Push the fabric down with your kitchen utensil so all of the fabric is covered in the solution. Mix up the sheets to ensure they are completely covered."
        },
        {
          "headline":"Let your sheets soak in your cleaning solution for at least 30 minutes.",
          "description":"Set a timer for 30 minutes to keep track of the time. You want your sheets to soak for a while in order to remove stains and get rid of the yellow tint. For a very thorough clean, leave your sheets inside for up to an hour."
        },
        {
          "headline":"Wring your sheets out thoroughly to remove the extra water.",
          "description":"After your sheets soak for a while, remove the sheet from the bin and squeeze the water out of the fabric. Do this for the top sheet, fitted sheet, and pillowcases. This way, you can easily wash and dry your sheets. If your sheets are excessively soaked when you put them in the washer, it may increase your washing time."
        },
        {
          "headline":"Wash your sheets in the washing machine.",
          "description":"Once you wring out your sheets, place the damp fabric inside your washing machine. Run them through a cycle with hot water to rinse out the ingredients from your cleaning solution and get a deeper clean."
        }
      ]
    },
    {
      "name":"Washing the Sheets Correctly",
      "steps":[
        {
          "headline":"Wash 1 set of sheets at a time to avoid overloading the machine.",
          "description":"Don’t load up your machine with several sets of sheets. Instead, put 1 fitted sheet, 1 top sheet, and 2-4 pillowcases in the washer after you wring them out. If your washer is too full, your wash cycle may take a long time, and you could damage your machine."
        },
        {
          "headline":"Add laundry detergent to your washing machine.",
          "description":"Locate the laundry detergent compartment on your machine, typically located on the left side towards the top. Then, pour detergent into the compartment until you reach the “Fill” line. Close the compartment and shut the door of your washer when you are finished. Consider using a laundry detergent with a whitening booster to make your sheets even brighter."
        },
        {
          "headline":"Use a hot water setting on your washer to get rid of debris.",
          "description":"When washing white fabric, you want to use the highest heat setting. Some machines may have a “White” setting already, which you can use. If not, turn the dial to select the hottest setting possible. A hot wash cycle should last about 1 hour and 30 minutes, depending on your particular machine. Typically, the hottest setting on your washing machine is 90–95 °F (32–35 °C)."
        },
        {
          "headline":"Choose a prewash cycle if your machine has the option.",
          "description":"The prewash cycle adds about 30 minutes or so to your wash, providing a thorough, deep clean. While this is optional, it’s a good idea if your sheets are very yellowed or stained."
        },
        {
          "headline":"Hang your sheets to dry for best results.",
          "description":"Lay your sheets flat over a clothing line or railing in a sunny spot outside. While you can use your dryer, sunlight helps lighten your white sheets even more, and the breeze makes your sheets smell fresh. Your sheets should be dry in 1-3 hours, depending on the temperature and amount of sunlight available. If it is an overcast or rainy day, place your sheets inside the dryer and use a normal dry cycle."
        }
      ]
    },
    {
      "name":"Preserving Your Sheets",
      "steps":[
        {
          "headline":"Remove any makeup before you go to bed.",
          "description":"Makeup can leave unwanted spots or stains on your sheets due to the pigment in the products. You can saturate a cotton ball with makeup remover or use a makeup remover wipe. This way, your sheets do not get discolored over time."
        },
        {
          "headline":"Avoid eating food in your bed to prevent stains.",
          "description":"If you eat a meal or drink a dark beverage in bed, you can easily spill it onto your sheets. To keep your sheets in great shape, eat at a table instead. For instance, food like ketchup, pasta sauce, and red wine can leave behind stubborn stains."
        },
        {
          "headline":"Tend to any spills immediately.",
          "description":"If you wind up spilling something on your white sheets, make sure you clean up the mess right away. Wet a sponge or rag, apply a drop or 2 of dish soap, and wring out the extra water. Then, rub the sponge or rag over the spot in a circular motion until the stain is removed. To help lift stubborn stains, hold the spot under cold water as you do this."
        },
        {
          "headline":"Wash your sheets once a week or every other week for best results.",
          "description":"As you sleep, you transfer dead skin, body oils, and sweat onto your sheets, which can give them a yellowish color over time. By regularly washing your sheets, you can keep this buildup to a minimum so your sheets stay white and fresh."
        }
      ]
    }
  ],
  "text":" Removing Stains and Discoloration Fill a plastic bin halfway full of warm water. Use a large rectangular plastic bin to soak your sheets. Let warm water run from your faucet for about 30 seconds so it can warm up to at least 70 °F (21 °C). Hold the bin under your faucet to fill it with water, then place it on a flat surface after it is about halfway full. This should be enough water to completely cover your sheets. If you don’t have a rectangular bin, use a bucket instead. Add 1/4 cup (60 g) of baking soda to the bin of water. Use a measuring cup to scoop your baking soda, and pour it directly into the water in your bin or bucket. Baking soda is great to use when lightening your sheets because it helps lift stubborn stains and colored spots. Pour in 1 cup (237 mL) of white vinegar to deodorize and fight stains. Use a measuring cup to get about 1 cup (237 mL) of white distilled vinegar, and pour it into the bin of water. White distilled vinegar works particularly well to get rid of any unpleasant odors that may linger in your sheets. It also helps get rid of stains and yellowed areas. Avoid using apple cider vinegar as a replacement for white distilled vinegar. Apple cider vinegar can give your sheets a brownish tint. Use 2 tbsp (30 mL) of dish soap to create some bubbles. Add dish soap to your bin of water to provide a deep, thorough clean. The dish soap cleans and disinfects your sheets, and the bubbles it creates help deeply penetrate the fabric. You can simply squeeze in a few drops rather than measuring an exact amount if you’d like. A bit more soap won’t hurt your sheets. Squeeze 1 lemon over the bin for an all-natural whitener. Carefully cut a lemon in half horizontally, and hand-squeeze the juice into your bin from both halves. Get as much juice out of the lemon as you can, and then throw away the peels. Lemon juice naturally helps lift and remove stubborn stains. Use a spoon to mix your concoction thoroughly. After you add the baking soda, vinegar, dish soap, and lemon to your bin of water, grab a kitchen utensil to stir up your ingredients. Mix up the solution for 10-30 seconds or so. Submerge your sheets in the water. Once you mix up your ingredients, dunk your fitted and top sheet inside. Soak your pillowcases as you do this as well. Push the fabric down with your kitchen utensil so all of the fabric is covered in the solution. Mix up the sheets to ensure they are completely covered. Let your sheets soak in your cleaning solution for at least 30 minutes. Set a timer for 30 minutes to keep track of the time. You want your sheets to soak for a while in order to remove stains and get rid of the yellow tint. For a very thorough clean, leave your sheets inside for up to an hour. Wring your sheets out thoroughly to remove the extra water. After your sheets soak for a while, remove the sheet from the bin and squeeze the water out of the fabric. Do this for the top sheet, fitted sheet, and pillowcases. This way, you can easily wash and dry your sheets. If your sheets are excessively soaked when you put them in the washer, it may increase your washing time. Wash your sheets in the washing machine. Once you wring out your sheets, place the damp fabric inside your washing machine. Run them through a cycle with hot water to rinse out the ingredients from your cleaning solution and get a deeper clean. Washing the Sheets Correctly Wash 1 set of sheets at a time to avoid overloading the machine. Don’t load up your machine with several sets of sheets. Instead, put 1 fitted sheet, 1 top sheet, and 2-4 pillowcases in the washer after you wring them out. If your washer is too full, your wash cycle may take a long time, and you could damage your machine. Add laundry detergent to your washing machine. Locate the laundry detergent compartment on your machine, typically located on the left side towards the top. Then, pour detergent into the compartment until you reach the “Fill” line. Close the compartment and shut the door of your washer when you are finished. Consider using a laundry detergent with a whitening booster to make your sheets even brighter. Use a hot water setting on your washer to get rid of debris. When washing white fabric, you want to use the highest heat setting. Some machines may have a “White” setting already, which you can use. If not, turn the dial to select the hottest setting possible. A hot wash cycle should last about 1 hour and 30 minutes, depending on your particular machine. Typically, the hottest setting on your washing machine is 90–95 °F (32–35 °C). Choose a prewash cycle if your machine has the option. The prewash cycle adds about 30 minutes or so to your wash, providing a thorough, deep clean. While this is optional, it’s a good idea if your sheets are very yellowed or stained. Hang your sheets to dry for best results. Lay your sheets flat over a clothing line or railing in a sunny spot outside. While you can use your dryer, sunlight helps lighten your white sheets even more, and the breeze makes your sheets smell fresh. Your sheets should be dry in 1-3 hours, depending on the temperature and amount of sunlight available. If it is an overcast or rainy day, place your sheets inside the dryer and use a normal dry cycle. Preserving Your Sheets Remove any makeup before you go to bed. Makeup can leave unwanted spots or stains on your sheets due to the pigment in the products. You can saturate a cotton ball with makeup remover or use a makeup remover wipe. This way, your sheets do not get discolored over time. Avoid eating food in your bed to prevent stains. If you eat a meal or drink a dark beverage in bed, you can easily spill it onto your sheets. To keep your sheets in great shape, eat at a table instead. For instance, food like ketchup, pasta sauce, and red wine can leave behind stubborn stains. Tend to any spills immediately. If you wind up spilling something on your white sheets, make sure you clean up the mess right away. Wet a sponge or rag, apply a drop or 2 of dish soap, and wring out the extra water. Then, rub the sponge or rag over the spot in a circular motion until the stain is removed. To help lift stubborn stains, hold the spot under cold water as you do this. Wash your sheets once a week or every other week for best results. As you sleep, you transfer dead skin, body oils, and sweat onto your sheets, which can give them a yellowish color over time. By regularly washing your sheets, you can keep this buildup to a minimum so your sheets stay white and fresh.",
  "sentences":[
    " Removing Stains and Discoloration Fill a plastic bin halfway full of warm water.",
    "Use a large rectangular plastic bin to soak your sheets.",
    "Let warm water run from your faucet for about 30 seconds so it can warm up to at least 70 °F (21 °C).",
    "Hold the bin under your faucet to fill it with water, then place it on a flat surface after it is about halfway full.",
    "This should be enough water to completely cover your sheets.",
    "If you don’t have a rectangular bin, use a bucket instead.",
    "Add 1/4 cup (60 g) of baking soda to the bin of water.",
    "Use a measuring cup to scoop your baking soda, and pour it directly into the water in your bin or bucket.",
    "Baking soda is great to use when lightening your sheets because it helps lift stubborn stains and colored spots.",
    "Pour in 1 cup (237 mL) of white vinegar to deodorize and fight stains.",
    "Use a measuring cup to get about 1 cup (237 mL) of white distilled vinegar, and pour it into the bin of water.",
    "White distilled vinegar works particularly well to get rid of any unpleasant odors that may linger in your sheets.",
    "It also helps get rid of stains and yellowed areas.",
    "Avoid using apple cider vinegar as a replacement for white distilled vinegar.",
    "Apple cider vinegar can give your sheets a brownish tint.",
    "Use 2 tbsp (30 mL) of dish soap to create some bubbles.",
    "Add dish soap to your bin of water to provide a deep, thorough clean.",
    "The dish soap cleans and disinfects your sheets, and the bubbles it creates help deeply penetrate the fabric.",
    "You can simply squeeze in a few drops rather than measuring an exact amount if you’d like.",
    "A bit more soap won’t hurt your sheets.",
    "Squeeze 1 lemon over the bin for an all-natural whitener.",
    "Carefully cut a lemon in half horizontally, and hand-squeeze the juice into your bin from both halves.",
    "Get as much juice out of the lemon as you can, and then throw away the peels.",
    "Lemon juice naturally helps lift and remove stubborn stains.",
    "Use a spoon to mix your concoction thoroughly.",
    "After you add the baking soda, vinegar, dish soap, and lemon to your bin of water, grab a kitchen utensil to stir up your ingredients.",
    "Mix up the solution for 10-30 seconds or so.",
    "Submerge your sheets in the water.",
    "Once you mix up your ingredients, dunk your fitted and top sheet inside.",
    "Soak your pillowcases as you do this as well.",
    "Push the fabric down with your kitchen utensil so all of the fabric is covered in the solution.",
    "Mix up the sheets to ensure they are completely covered.",
    "Let your sheets soak in your cleaning solution for at least 30 minutes.",
    "Set a timer for 30 minutes to keep track of the time.",
    "You want your sheets to soak for a while in order to remove stains and get rid of the yellow tint.",
    "For a very thorough clean, leave your sheets inside for up to an hour.",
    "Wring your sheets out thoroughly to remove the extra water.",
    "After your sheets soak for a while, remove the sheet from the bin and squeeze the water out of the fabric.",
    "Do this for the top sheet, fitted sheet, and pillowcases.",
    "This way, you can easily wash and dry your sheets.",
    "If your sheets are excessively soaked when you put them in the washer, it may increase your washing time.",
    "Wash your sheets in the washing machine.",
    "Once you wring out your sheets, place the damp fabric inside your washing machine.",
    "Run them through a cycle with hot water to rinse out the ingredients from your cleaning solution and get a deeper clean.",
    "Washing the Sheets Correctly Wash 1 set of sheets at a time to avoid overloading the machine.",
    "Don’t load up your machine with several sets of sheets.",
    "Instead, put 1 fitted sheet, 1 top sheet, and 2-4 pillowcases in the washer after you wring them out.",
    "If your washer is too full, your wash cycle may take a long time, and you could damage your machine.",
    "Add laundry detergent to your washing machine.",
    "Locate the laundry detergent compartment on your machine, typically located on the left side towards the top.",
    "Then, pour detergent into the compartment until you reach the “Fill” line.",
    "Close the compartment and shut the door of your washer when you are finished.",
    "Consider using a laundry detergent with a whitening booster to make your sheets even brighter.",
    "Use a hot water setting on your washer to get rid of debris.",
    "When washing white fabric, you want to use the highest heat setting.",
    "Some machines may have a “White” setting already, which you can use.",
    "If not, turn the dial to select the hottest setting possible.",
    "A hot wash cycle should last about 1 hour and 30 minutes, depending on your particular machine.",
    "Typically, the hottest setting on your washing machine is 90–95 °F (32–35 °C).",
    "Choose a prewash cycle if your machine has the option.",
    "The prewash cycle adds about 30 minutes or so to your wash, providing a thorough, deep clean.",
    "While this is optional, it’s a good idea if your sheets are very yellowed or stained.",
    "Hang your sheets to dry for best results.",
    "Lay your sheets flat over a clothing line or railing in a sunny spot outside.",
    "While you can use your dryer, sunlight helps lighten your white sheets even more, and the breeze makes your sheets smell fresh.",
    "Your sheets should be dry in 1-3 hours, depending on the temperature and amount of sunlight available.",
    "If it is an overcast or rainy day, place your sheets inside the dryer and use a normal dry cycle.",
    "Preserving Your Sheets Remove any makeup before you go to bed.",
    "Makeup can leave unwanted spots or stains on your sheets due to the pigment in the products.",
    "You can saturate a cotton ball with makeup remover or use a makeup remover wipe.",
    "This way, your sheets do not get discolored over time.",
    "Avoid eating food in your bed to prevent stains.",
    "If you eat a meal or drink a dark beverage in bed, you can easily spill it onto your sheets.",
    "To keep your sheets in great shape, eat at a table instead.",
    "For instance, food like ketchup, pasta sauce, and red wine can leave behind stubborn stains.",
    "Tend to any spills immediately.",
    "If you wind up spilling something on your white sheets, make sure you clean up the mess right away.",
    "Wet a sponge or rag, apply a drop or 2 of dish soap, and wring out the extra water.",
    "Then, rub the sponge or rag over the spot in a circular motion until the stain is removed.",
    "To help lift stubborn stains, hold the spot under cold water as you do this.",
    "Wash your sheets once a week or every other week for best results.",
    "As you sleep, you transfer dead skin, body oils, and sweat onto your sheets, which can give them a yellowish color over time.",
    "By regularly washing your sheets, you can keep this buildup to a minimum so your sheets stay white and fresh."
  ],
  "tyn_section":[
    "Sheets",
    "Plastic bin or bucket",
    "Warm water",
    "1/4 cup (60 g) of baking soda",
    "1 cup (237 mL) of white distilled vinegar",
    "2 tbsp (30 mL) of dish soap",
    "1 lemon",
    "Knife",
    "Washing machine",
    "Laundry detergent",
    "Clothing line or railing"
  ],
  "tyn_model":[
    "water",
    "sheets",
    "dish soap",
    "lemon",
    "washer",
    "baking soda",
    "white distilled vinegar",
    "bucket",
    "apple cider vinegar",
    "kitchen utensil",
    "laundry detergent",
    "detergent",
    "dryer",
    "makeup",
    "makeup remover",
    "sponge",
    "plastic bin",
    "bin",
    "measuring cup",
    "white vinegar",
    "soap",
    "all-natural whitener",
    "spoon",
    "vinegar",
    "fitted sheet",
    "washing machine",
    "“fill",
    "” line",
    "“white",
    "” setting",
    "red wine"
  ],
  "simple_metrics":{
    "r":0.2727272727,
    "p":0.0967741935,
    "f1":0.1428571429,
    "avg_pos":0.0322580645
  },
  "jacc_metrics_0.5":{
    "r":0.5454545455,
    "p":0.2258064516,
    "f1":0.319391635
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6363636364,
    "p":0.2580645161,
    "f1":0.3672131148
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2727272727,
    "p":0.0967741935,
    "f1":0.1428571429
  }
}