{
  "title":"How to Steam Vegetables Without a Steamer",
  "url":"https://www.wikihow.com/Steam-Vegetables-Without-a-Steamer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Steaming Vegetables in a Colander and a Pot",
      "steps":[
        {
          "headline":"Fill a large pot with approximately ⁄2 inch (1.3 cm) of water.",
          "description":"Your metal colander is going to need to hang inside and along the rim of your pot. So your pot needs to be wide enough to fit your metal colander inside, but not have your colander fall in, and tall enough so the colander does not touch the water."
        },
        {
          "headline":"Place your metal colander inside the pot.",
          "description":"Make sure that the colander is not touching the water within the pot. If you do not have a metal colander, you can use a metal strainer instead. Your colander or strainer cannot be made of plastic; it has to be resistant to the heat of the boiling water. If your metal colander does not fit inside your pot, then you can hold it in place over the pot. In this instance, however, you should use a pot holder or a colander that has a heat-resistant handle so you do not burn yourself."
        },
        {
          "headline":"Pour your cleaned and chopped vegetables into the colander.",
          "description":"You can steam one type of vegetable or steam a myriad of vegetables together. Some vegetables will take longer than others to steam. Vegetables that have similar textures or thicknesses should steam for about the same time. Broccoli and cauliflower, or peas and carrots, steam well together. Broccoli and peas, however, would not steam well together. The broccoli would wind up under-steamed, or the peas would be over-steamed. Just try not to over-stuff your colander, as this could alter or prevent some of the vegetables from steaming properly."
        },
        {
          "headline":"Bring the water to a boil, and then lower it to a simmer once it is boiling.",
          "description":"You don’t want the water to evaporate before the vegetables have a chance to thoroughly steam. So make sure to bring the water down to a simmer after it comes to a boil."
        },
        {
          "headline":"Cover the colander and pot with the pot’s lid.",
          "description":"You want the colander and pot to be covered as much as possible to prevent the steam from escaping. The more steam that escapes, the longer the vegetables will take to steam. If the lid on your pot begins to rattle, you can slightly crack the lid to allow ventilation for the steam. If you do not have a lid for your pot, you can use a piece of aluminum foil and seal it around the top of the pot. If your pot is already hot, just make sure not to burn yourself while putting on the foil."
        },
        {
          "headline":"Check on the vegetables after 5 minutes of steaming.",
          "description":"All vegetables have different steaming times, and these times will vary even more depending on how filled the colander is. So after 5 minutes check on the crispness and tenderness of the vegetables. Leave the vegetables cooking for another 2 to 5 minutes depending on your texture preference. Typically, broccoli will take about 5 to 7 minutes to steam and maintain a crisp texture. At 10 minutes the broccoli will be tender and soft."
        },
        {
          "headline":"Remove the colander from the pot when the vegetables are tender.",
          "description":"When the vegetables reach your desired texture, do not let them rest in the colander because the vegetables will continue to steam. You are now ready to plate the steamed vegetables and serve them with your meal. Just make sure to use pot holders when lifting the colander out so you do not burn yourself."
        }
      ]
    },
    {
      "name":"Using a Heat Proof Plate and Aluminum Foil",
      "steps":[
        {
          "headline":"Choose a pot that has a tight lid and a thick bottom.",
          "description":"The lid should be secure enough to allow moisture to build up inside the pot and steam the vegetables. Having a pot with a thicker bottom will spread the heat more evenly than one with a thinner bottom. A deep pot will allow for more steam to build up between the vegetables and will cook them better. If you do not want to use a pot, or do not have one that will fit your heat proof plate, then you can use a large skillet instead. The process will be the same, but you will need to have a lid that will cover the skillet."
        },
        {
          "headline":"Pour ⁄2 inch (1.3 cm) of water into the bottom of your pot.",
          "description":"If you are cooking a large amount of vegetables, or if the lid to your pot does not seal well, then you may need to add more water. You want enough water in the pot to steam the vegetables and keep them from burning, but not so much water that the vegetables boil. If your lid does not have a tight seal, then more of the moisture will escape while steaming, so you will have to start with more water."
        },
        {
          "headline":"Make 3 balls of aluminum foil that are roughly the size of a golf ball.",
          "description":"The foil will layer the bottom of the pot, and elevate the heat proof plate. This will create a makeshift steaming basket. Depending on the size or depth of your pot, you may need to make more than the 3 foil balls. Use your best judgement based on the size of your pot."
        },
        {
          "headline":"Rest a heat proof plate inside the pot and on top of the foil balls.",
          "description":"The plate will hold the vegetables away from the bottom of the pot and foil. This will prevent the vegetables from sticking, burning, or boiling while inside the pot."
        },
        {
          "headline":"Cover the pot, and bring the water to a boil.",
          "description":"The boiling water will build up steam within the pot. Condensation will build up on the plate, making it slick enough so the vegetables do not stick to it."
        },
        {
          "headline":"Layer the vegetables onto the plate in the pot, then cover the pot.",
          "description":"If you are just steaming one type of vegetable, then layer it into the pot so everything fits comfortably. If you are steaming different vegetables at once, then you are going to want to put the vegetables that will take longer to cook on the bottom layer, and work up from there. Vegetables like cauliflower and broccoli would go on the bottom, and vegetables like carrots, Brussels sprouts, and peas would be on the medium and upper layers."
        },
        {
          "headline":"Steam the vegetables on medium-high heat for 5 minutes.",
          "description":"Steaming vegetables does take longer than boiling them, so be patient. Since the vegetables are not cooked in water, they will maintain their vivid coloring, but should be tender to eat. If you feel like the vegetables need to be cooked longer, then continue steaming them until the vegetables are your texture preference. Be mindful how often you check on the vegetables. While you don’t want to over-cook the vegetables, each time you remove the lid from the pot the steam will escape. So the more times you open the lid of the pot, the longer the vegetables will take to cook."
        },
        {
          "headline":"Use a spoon or tongs to carefully remove the vegetables from the plate.",
          "description":"Steam will have built up inside the pot, so make sure not to burn yourself as you spoon out the vegetables. You are now ready to serve and eat the freshly steamed vegetables."
        }
      ]
    },
    {
      "name":"Microwaving Vegetables to Steam Quickly",
      "steps":[
        {
          "headline":"Place your cleaned and chopped vegetables into a microwave-safe bowl.",
          "description":"You are going to need a bowl that has a lid to help generate steam. So make sure that the bowl you are using has a cover to rest on top of it. Make sure to check if your bowl is microwave safe. Some containers will say, “Microwave Safe,” on the bottom, and others will have a small symbol that resembles a microwave with wavy lines in it. If your bowl does not indicate that it is safe to use in the microwave, then it is best to use another container. While microwaving is the quickest way to steam vegetables, it can give the vegetables a slightly shriveled appearance. This is because the microwave is steaming and partially cooking the vegetables."
        },
        {
          "headline":"Add 1 tablespoon (15 mL) of water to the bowl.",
          "description":"The amount of water you add depends on the amount of vegetables you have in your bowl. If you are steaming a large amount of vegetables, then consider adding a little more water. If you are steaming leafy vegetables like spinach, then you do not have to add any water to the bowl. The water that is left behind on the rinsed leafy vegetables will be enough to steam them."
        },
        {
          "headline":"Rest the lid on the bowl, but do not snap it closed.",
          "description":"You want there to be space for the steam to escape, otherwise the lid might pop off in the microwave. This would not only make a mess in your microwave, but also will prevent your vegetables from steaming properly."
        },
        {
          "headline":"Microwave the vegetables for 2 to 5 minutes, then check them.",
          "description":"Most vegetables should be properly steamed after 5 minutes, but that time can vary depending on the amount and type of vegetables you have in the bowl. So take a fork and prod some of the smallest and largest vegetables, and check the tenderness and texture. Broccoli will typically take about 2 or 3 minutes steam, while denser vegetables like potatoes will take 5 minutes or more to steam thoroughly. If you want the vegetables to be more tender, then put the bowl with the rested lid back in the microwave for 1 minute intervals until the vegetables are steamed to your liking."
        }
      ]
    }
  ],
  "text":" Steaming Vegetables in a Colander and a Pot Fill a large pot with approximately ⁄2 inch (1.3 cm) of water. Your metal colander is going to need to hang inside and along the rim of your pot. So your pot needs to be wide enough to fit your metal colander inside, but not have your colander fall in, and tall enough so the colander does not touch the water. Place your metal colander inside the pot. Make sure that the colander is not touching the water within the pot. If you do not have a metal colander, you can use a metal strainer instead. Your colander or strainer cannot be made of plastic; it has to be resistant to the heat of the boiling water. If your metal colander does not fit inside your pot, then you can hold it in place over the pot. In this instance, however, you should use a pot holder or a colander that has a heat-resistant handle so you do not burn yourself. Pour your cleaned and chopped vegetables into the colander. You can steam one type of vegetable or steam a myriad of vegetables together. Some vegetables will take longer than others to steam. Vegetables that have similar textures or thicknesses should steam for about the same time. Broccoli and cauliflower, or peas and carrots, steam well together. Broccoli and peas, however, would not steam well together. The broccoli would wind up under-steamed, or the peas would be over-steamed. Just try not to over-stuff your colander, as this could alter or prevent some of the vegetables from steaming properly. Bring the water to a boil, and then lower it to a simmer once it is boiling. You don’t want the water to evaporate before the vegetables have a chance to thoroughly steam. So make sure to bring the water down to a simmer after it comes to a boil. Cover the colander and pot with the pot’s lid. You want the colander and pot to be covered as much as possible to prevent the steam from escaping. The more steam that escapes, the longer the vegetables will take to steam. If the lid on your pot begins to rattle, you can slightly crack the lid to allow ventilation for the steam. If you do not have a lid for your pot, you can use a piece of aluminum foil and seal it around the top of the pot. If your pot is already hot, just make sure not to burn yourself while putting on the foil. Check on the vegetables after 5 minutes of steaming. All vegetables have different steaming times, and these times will vary even more depending on how filled the colander is. So after 5 minutes check on the crispness and tenderness of the vegetables. Leave the vegetables cooking for another 2 to 5 minutes depending on your texture preference. Typically, broccoli will take about 5 to 7 minutes to steam and maintain a crisp texture. At 10 minutes the broccoli will be tender and soft. Remove the colander from the pot when the vegetables are tender. When the vegetables reach your desired texture, do not let them rest in the colander because the vegetables will continue to steam. You are now ready to plate the steamed vegetables and serve them with your meal. Just make sure to use pot holders when lifting the colander out so you do not burn yourself. Using a Heat Proof Plate and Aluminum Foil Choose a pot that has a tight lid and a thick bottom. The lid should be secure enough to allow moisture to build up inside the pot and steam the vegetables. Having a pot with a thicker bottom will spread the heat more evenly than one with a thinner bottom. A deep pot will allow for more steam to build up between the vegetables and will cook them better. If you do not want to use a pot, or do not have one that will fit your heat proof plate, then you can use a large skillet instead. The process will be the same, but you will need to have a lid that will cover the skillet. Pour ⁄2 inch (1.3 cm) of water into the bottom of your pot. If you are cooking a large amount of vegetables, or if the lid to your pot does not seal well, then you may need to add more water. You want enough water in the pot to steam the vegetables and keep them from burning, but not so much water that the vegetables boil. If your lid does not have a tight seal, then more of the moisture will escape while steaming, so you will have to start with more water. Make 3 balls of aluminum foil that are roughly the size of a golf ball. The foil will layer the bottom of the pot, and elevate the heat proof plate. This will create a makeshift steaming basket. Depending on the size or depth of your pot, you may need to make more than the 3 foil balls. Use your best judgement based on the size of your pot. Rest a heat proof plate inside the pot and on top of the foil balls. The plate will hold the vegetables away from the bottom of the pot and foil. This will prevent the vegetables from sticking, burning, or boiling while inside the pot. Cover the pot, and bring the water to a boil. The boiling water will build up steam within the pot. Condensation will build up on the plate, making it slick enough so the vegetables do not stick to it. Layer the vegetables onto the plate in the pot, then cover the pot. If you are just steaming one type of vegetable, then layer it into the pot so everything fits comfortably. If you are steaming different vegetables at once, then you are going to want to put the vegetables that will take longer to cook on the bottom layer, and work up from there. Vegetables like cauliflower and broccoli would go on the bottom, and vegetables like carrots, Brussels sprouts, and peas would be on the medium and upper layers. Steam the vegetables on medium-high heat for 5 minutes. Steaming vegetables does take longer than boiling them, so be patient. Since the vegetables are not cooked in water, they will maintain their vivid coloring, but should be tender to eat. If you feel like the vegetables need to be cooked longer, then continue steaming them until the vegetables are your texture preference. Be mindful how often you check on the vegetables. While you don’t want to over-cook the vegetables, each time you remove the lid from the pot the steam will escape. So the more times you open the lid of the pot, the longer the vegetables will take to cook. Use a spoon or tongs to carefully remove the vegetables from the plate. Steam will have built up inside the pot, so make sure not to burn yourself as you spoon out the vegetables. You are now ready to serve and eat the freshly steamed vegetables. Microwaving Vegetables to Steam Quickly Place your cleaned and chopped vegetables into a microwave-safe bowl. You are going to need a bowl that has a lid to help generate steam. So make sure that the bowl you are using has a cover to rest on top of it. Make sure to check if your bowl is microwave safe. Some containers will say, “Microwave Safe,” on the bottom, and others will have a small symbol that resembles a microwave with wavy lines in it. If your bowl does not indicate that it is safe to use in the microwave, then it is best to use another container. While microwaving is the quickest way to steam vegetables, it can give the vegetables a slightly shriveled appearance. This is because the microwave is steaming and partially cooking the vegetables. Add 1 tablespoon (15 mL) of water to the bowl. The amount of water you add depends on the amount of vegetables you have in your bowl. If you are steaming a large amount of vegetables, then consider adding a little more water. If you are steaming leafy vegetables like spinach, then you do not have to add any water to the bowl. The water that is left behind on the rinsed leafy vegetables will be enough to steam them. Rest the lid on the bowl, but do not snap it closed. You want there to be space for the steam to escape, otherwise the lid might pop off in the microwave. This would not only make a mess in your microwave, but also will prevent your vegetables from steaming properly. Microwave the vegetables for 2 to 5 minutes, then check them. Most vegetables should be properly steamed after 5 minutes, but that time can vary depending on the amount and type of vegetables you have in the bowl. So take a fork and prod some of the smallest and largest vegetables, and check the tenderness and texture. Broccoli will typically take about 2 or 3 minutes steam, while denser vegetables like potatoes will take 5 minutes or more to steam thoroughly. If you want the vegetables to be more tender, then put the bowl with the rested lid back in the microwave for 1 minute intervals until the vegetables are steamed to your liking.",
  "sentences":[
    " Steaming Vegetables in a Colander and a Pot Fill a large pot with approximately ⁄2 inch (1.3 cm) of water.",
    "Your metal colander is going to need to hang inside and along the rim of your pot.",
    "So your pot needs to be wide enough to fit your metal colander inside, but not have your colander fall in, and tall enough so the colander does not touch the water.",
    "Place your metal colander inside the pot.",
    "Make sure that the colander is not touching the water within the pot.",
    "If you do not have a metal colander, you can use a metal strainer instead.",
    "Your colander or strainer cannot be made of plastic; it has to be resistant to the heat of the boiling water.",
    "If your metal colander does not fit inside your pot, then you can hold it in place over the pot.",
    "In this instance, however, you should use a pot holder or a colander that has a heat-resistant handle so you do not burn yourself.",
    "Pour your cleaned and chopped vegetables into the colander.",
    "You can steam one type of vegetable or steam a myriad of vegetables together.",
    "Some vegetables will take longer than others to steam.",
    "Vegetables that have similar textures or thicknesses should steam for about the same time.",
    "Broccoli and cauliflower, or peas and carrots, steam well together.",
    "Broccoli and peas, however, would not steam well together.",
    "The broccoli would wind up under-steamed, or the peas would be over-steamed.",
    "Just try not to over-stuff your colander, as this could alter or prevent some of the vegetables from steaming properly.",
    "Bring the water to a boil, and then lower it to a simmer once it is boiling.",
    "You don’t want the water to evaporate before the vegetables have a chance to thoroughly steam.",
    "So make sure to bring the water down to a simmer after it comes to a boil.",
    "Cover the colander and pot with the pot’s lid.",
    "You want the colander and pot to be covered as much as possible to prevent the steam from escaping.",
    "The more steam that escapes, the longer the vegetables will take to steam.",
    "If the lid on your pot begins to rattle, you can slightly crack the lid to allow ventilation for the steam.",
    "If you do not have a lid for your pot, you can use a piece of aluminum foil and seal it around the top of the pot.",
    "If your pot is already hot, just make sure not to burn yourself while putting on the foil.",
    "Check on the vegetables after 5 minutes of steaming.",
    "All vegetables have different steaming times, and these times will vary even more depending on how filled the colander is.",
    "So after 5 minutes check on the crispness and tenderness of the vegetables.",
    "Leave the vegetables cooking for another 2 to 5 minutes depending on your texture preference.",
    "Typically, broccoli will take about 5 to 7 minutes to steam and maintain a crisp texture.",
    "At 10 minutes the broccoli will be tender and soft.",
    "Remove the colander from the pot when the vegetables are tender.",
    "When the vegetables reach your desired texture, do not let them rest in the colander because the vegetables will continue to steam.",
    "You are now ready to plate the steamed vegetables and serve them with your meal.",
    "Just make sure to use pot holders when lifting the colander out so you do not burn yourself.",
    "Using a Heat Proof Plate and Aluminum Foil Choose a pot that has a tight lid and a thick bottom.",
    "The lid should be secure enough to allow moisture to build up inside the pot and steam the vegetables.",
    "Having a pot with a thicker bottom will spread the heat more evenly than one with a thinner bottom.",
    "A deep pot will allow for more steam to build up between the vegetables and will cook them better.",
    "If you do not want to use a pot, or do not have one that will fit your heat proof plate, then you can use a large skillet instead.",
    "The process will be the same, but you will need to have a lid that will cover the skillet.",
    "Pour ⁄2 inch (1.3 cm) of water into the bottom of your pot.",
    "If you are cooking a large amount of vegetables, or if the lid to your pot does not seal well, then you may need to add more water.",
    "You want enough water in the pot to steam the vegetables and keep them from burning, but not so much water that the vegetables boil.",
    "If your lid does not have a tight seal, then more of the moisture will escape while steaming, so you will have to start with more water.",
    "Make 3 balls of aluminum foil that are roughly the size of a golf ball.",
    "The foil will layer the bottom of the pot, and elevate the heat proof plate.",
    "This will create a makeshift steaming basket.",
    "Depending on the size or depth of your pot, you may need to make more than the 3 foil balls.",
    "Use your best judgement based on the size of your pot.",
    "Rest a heat proof plate inside the pot and on top of the foil balls.",
    "The plate will hold the vegetables away from the bottom of the pot and foil.",
    "This will prevent the vegetables from sticking, burning, or boiling while inside the pot.",
    "Cover the pot, and bring the water to a boil.",
    "The boiling water will build up steam within the pot.",
    "Condensation will build up on the plate, making it slick enough so the vegetables do not stick to it.",
    "Layer the vegetables onto the plate in the pot, then cover the pot.",
    "If you are just steaming one type of vegetable, then layer it into the pot so everything fits comfortably.",
    "If you are steaming different vegetables at once, then you are going to want to put the vegetables that will take longer to cook on the bottom layer, and work up from there.",
    "Vegetables like cauliflower and broccoli would go on the bottom, and vegetables like carrots, Brussels sprouts, and peas would be on the medium and upper layers.",
    "Steam the vegetables on medium-high heat for 5 minutes.",
    "Steaming vegetables does take longer than boiling them, so be patient.",
    "Since the vegetables are not cooked in water, they will maintain their vivid coloring, but should be tender to eat.",
    "If you feel like the vegetables need to be cooked longer, then continue steaming them until the vegetables are your texture preference.",
    "Be mindful how often you check on the vegetables.",
    "While you don’t want to over-cook the vegetables, each time you remove the lid from the pot the steam will escape.",
    "So the more times you open the lid of the pot, the longer the vegetables will take to cook.",
    "Use a spoon or tongs to carefully remove the vegetables from the plate.",
    "Steam will have built up inside the pot, so make sure not to burn yourself as you spoon out the vegetables.",
    "You are now ready to serve and eat the freshly steamed vegetables.",
    "Microwaving Vegetables to Steam Quickly Place your cleaned and chopped vegetables into a microwave-safe bowl.",
    "You are going to need a bowl that has a lid to help generate steam.",
    "So make sure that the bowl you are using has a cover to rest on top of it.",
    "Make sure to check if your bowl is microwave safe.",
    "Some containers will say, “Microwave Safe,” on the bottom, and others will have a small symbol that resembles a microwave with wavy lines in it.",
    "If your bowl does not indicate that it is safe to use in the microwave, then it is best to use another container.",
    "While microwaving is the quickest way to steam vegetables, it can give the vegetables a slightly shriveled appearance.",
    "This is because the microwave is steaming and partially cooking the vegetables.",
    "Add 1 tablespoon (15 mL) of water to the bowl.",
    "The amount of water you add depends on the amount of vegetables you have in your bowl.",
    "If you are steaming a large amount of vegetables, then consider adding a little more water.",
    "If you are steaming leafy vegetables like spinach, then you do not have to add any water to the bowl.",
    "The water that is left behind on the rinsed leafy vegetables will be enough to steam them.",
    "Rest the lid on the bowl, but do not snap it closed.",
    "You want there to be space for the steam to escape, otherwise the lid might pop off in the microwave.",
    "This would not only make a mess in your microwave, but also will prevent your vegetables from steaming properly.",
    "Microwave the vegetables for 2 to 5 minutes, then check them.",
    "Most vegetables should be properly steamed after 5 minutes, but that time can vary depending on the amount and type of vegetables you have in the bowl.",
    "So take a fork and prod some of the smallest and largest vegetables, and check the tenderness and texture.",
    "Broccoli will typically take about 2 or 3 minutes steam, while denser vegetables like potatoes will take 5 minutes or more to steam thoroughly.",
    "If you want the vegetables to be more tender, then put the bowl with the rested lid back in the microwave for 1 minute intervals until the vegetables are steamed to your liking."
  ],
  "tyn_section":[
    "Cleaned and cut vegetables that are ready to be steamed",
    "A large cooking pot",
    "Aluminum foil",
    "A heat proof plate",
    "A microwave safe bowl with a lid",
    "A metal colander or a metal strainer",
    "Water"
  ],
  "tyn_model":[
    "pot",
    "vegetables",
    "water",
    "colander",
    "bowl",
    "microwave",
    "broccoli",
    "foil",
    "peas",
    "plate",
    "aluminum foil",
    "heat proof plate",
    "strainer",
    "carrots",
    "large pot",
    "pot holder",
    "cauliflower",
    "pot holders",
    "large skillet",
    "skillet",
    "brussels sprouts",
    "spoon",
    "microwave-",
    "microwave safe",
    "containers",
    "“microwave",
    "” on",
    "container",
    "fork",
    "potatoes"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0666666667,
    "f1":0.1081081081,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.1666666667,
    "f1":0.2580645161
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.2,
    "f1":0.3125
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.1,
    "f1":0.1621621622
  }
}