{
  "title":"How to Iron Pants",
  "url":"https://www.wikihow.com/Iron-Pants",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Ironing"
  ],
  "parts":[
    {
      "name":"Prepping Your Surface and Iron",
      "steps":[
        {
          "headline":"Check the tag of your pants to ensure you can iron the material.",
          "description":"Washing instructions are listed on the garment tag of your pants. If it is unsafe to use an iron on your pants, it will list this with the washing instructions. The garment tag also explains what heat setting to use when ironing your pants. You can iron pants made from cotton, corduroy, denim, linen, nylon, polyester, or wool, for instance."
        },
        {
          "headline":"Use an ironing board for best results.",
          "description":"While you can iron on nearly any flat surface, an ironing board makes it easy to smooth away any wrinkles. Adjust the ironing board to a comfortable height, and make sure the legs are locked before you start ironing. For instance, you can place your pant leg around the narrow end to iron to remove stubborn wrinkles. Alternatively, use a table with a fire-resistant tablecloth if you don’t have an ironing board handy."
        },
        {
          "headline":"Fill up the steam compartment on your iron with fresh water.",
          "description":"Most irons have a small water fill-up tank located on the backside of the iron. Look for the plastic compartment towards the top of the iron. Then, use water from your faucet to fill up the vessel to the designated fill line. The water creates steam as you iron, helpful when eliminating folds or wrinkles."
        },
        {
          "headline":"Choose your desired temperature setting.",
          "description":"Most irons indicate temperature based on the material of your pants. Turn on the iron, and then adjust the dial or indicator to the temperature you’d like to use. For instance, wool pants should be ironed on a lower temperature than cotton pants. Denim pants require a high heat setting and steam."
        }
      ]
    },
    {
      "name":"Removing Wrinkles and Creases",
      "steps":[
        {
          "headline":"Start by ironing the pockets to prevent further wrinkles.",
          "description":"If your pockets are wrinkled and you iron over them, you can easily create more wrinkles. To prevent this, pull the pocket inside out, and press it flat with the iron. Do this for both of the front and back pockets. This is an easy trick to help speed up the ironing process."
        },
        {
          "headline":"Smooth out the waistband and top section.",
          "description":"Place your iron across the waistband, and let it sit for 2-5 seconds. Then, lift up on the iron, rather than moving it across the top. This helps your pants lay flat. Once the waistband is wrinkle-free, you can tuck the pockets back inside your pants. Do this for the front and back of the waistband."
        },
        {
          "headline":"Lay your pants lengthwise across the ironing board to iron the legs.",
          "description":"Move the iron back and forth across 1 pant leg at a time, starting from top to bottom. Continually move the iron across the pant leg until the fabric is free of wrinkles or creases. Your pants should be parallel with the ironing board when you do this, and both legs should face the same direction. Don’t forget to iron the front and back of your pants!"
        },
        {
          "headline":"Fold your pants at the crease to easily iron it.",
          "description":"Many classic dress pants have a crease down the center of the leg. To create this or follow your existing fold, lay 1 pant leg on the ironing board so that the inseams are directly over each other. Press the iron down at the top and bottom of the leg, and then fill in space by pressing the rest of the crease between the 2 iron points. Ensure the inseams are lined up as you do this to create a smooth, straight crease. Your crease should stop approximately at the bottom of the pockets on the front of the leg."
        }
      ]
    },
    {
      "name":"Hanging or Folding Your Pants",
      "steps":[
        {
          "headline":"Let your pants cool down for 2-5 minutes.",
          "description":"Before you hang or fold your pants, let them sit on your ironing board for a few minutes until they are cool to the touch. If you fold your pants before they cool, you can create additional creases or wrinkles."
        },
        {
          "headline":"Hang your pants to keep them wrinkle-free.",
          "description":"If you have a pants hanger, you can simply secure each side to the waistband of your pants. If using a shirt hanger, fold the pants in half. Then, drape the pants over top of the bottom of the hanger, and place the hanger in your closet. If there is a crease, fold the pants along the crease. If there is not a crease, you can fold them in half long ways."
        },
        {
          "headline":"Fold your pants to store them in a dresser or drawer.",
          "description":"Hanging is the best way to ensure your clothes don’t get wrinkled, but you can also fold up your pants and store them elsewhere. Bring the hem of the pants to the waistband to fold them in half. Then, place them in your closet. Alternatively, fold your pants in thirds if you need to save space. Bring the hem of the pants towards the crotch, then fold the waistband to the folded edge you just made."
        }
      ]
    }
  ],
  "text":" Prepping Your Surface and Iron Check the tag of your pants to ensure you can iron the material. Washing instructions are listed on the garment tag of your pants. If it is unsafe to use an iron on your pants, it will list this with the washing instructions. The garment tag also explains what heat setting to use when ironing your pants. You can iron pants made from cotton, corduroy, denim, linen, nylon, polyester, or wool, for instance. Use an ironing board for best results. While you can iron on nearly any flat surface, an ironing board makes it easy to smooth away any wrinkles. Adjust the ironing board to a comfortable height, and make sure the legs are locked before you start ironing. For instance, you can place your pant leg around the narrow end to iron to remove stubborn wrinkles. Alternatively, use a table with a fire-resistant tablecloth if you don’t have an ironing board handy. Fill up the steam compartment on your iron with fresh water. Most irons have a small water fill-up tank located on the backside of the iron. Look for the plastic compartment towards the top of the iron. Then, use water from your faucet to fill up the vessel to the designated fill line. The water creates steam as you iron, helpful when eliminating folds or wrinkles. Choose your desired temperature setting. Most irons indicate temperature based on the material of your pants. Turn on the iron, and then adjust the dial or indicator to the temperature you’d like to use. For instance, wool pants should be ironed on a lower temperature than cotton pants. Denim pants require a high heat setting and steam. Removing Wrinkles and Creases Start by ironing the pockets to prevent further wrinkles. If your pockets are wrinkled and you iron over them, you can easily create more wrinkles. To prevent this, pull the pocket inside out, and press it flat with the iron. Do this for both of the front and back pockets. This is an easy trick to help speed up the ironing process. Smooth out the waistband and top section. Place your iron across the waistband, and let it sit for 2-5 seconds. Then, lift up on the iron, rather than moving it across the top. This helps your pants lay flat. Once the waistband is wrinkle-free, you can tuck the pockets back inside your pants. Do this for the front and back of the waistband. Lay your pants lengthwise across the ironing board to iron the legs. Move the iron back and forth across 1 pant leg at a time, starting from top to bottom. Continually move the iron across the pant leg until the fabric is free of wrinkles or creases. Your pants should be parallel with the ironing board when you do this, and both legs should face the same direction. Don’t forget to iron the front and back of your pants! Fold your pants at the crease to easily iron it. Many classic dress pants have a crease down the center of the leg. To create this or follow your existing fold, lay 1 pant leg on the ironing board so that the inseams are directly over each other. Press the iron down at the top and bottom of the leg, and then fill in space by pressing the rest of the crease between the 2 iron points. Ensure the inseams are lined up as you do this to create a smooth, straight crease. Your crease should stop approximately at the bottom of the pockets on the front of the leg. Hanging or Folding Your Pants Let your pants cool down for 2-5 minutes. Before you hang or fold your pants, let them sit on your ironing board for a few minutes until they are cool to the touch. If you fold your pants before they cool, you can create additional creases or wrinkles. Hang your pants to keep them wrinkle-free. If you have a pants hanger, you can simply secure each side to the waistband of your pants. If using a shirt hanger, fold the pants in half. Then, drape the pants over top of the bottom of the hanger, and place the hanger in your closet. If there is a crease, fold the pants along the crease. If there is not a crease, you can fold them in half long ways. Fold your pants to store them in a dresser or drawer. Hanging is the best way to ensure your clothes don’t get wrinkled, but you can also fold up your pants and store them elsewhere. Bring the hem of the pants to the waistband to fold them in half. Then, place them in your closet. Alternatively, fold your pants in thirds if you need to save space. Bring the hem of the pants towards the crotch, then fold the waistband to the folded edge you just made.",
  "sentences":[
    " Prepping Your Surface and Iron Check the tag of your pants to ensure you can iron the material.",
    "Washing instructions are listed on the garment tag of your pants.",
    "If it is unsafe to use an iron on your pants, it will list this with the washing instructions.",
    "The garment tag also explains what heat setting to use when ironing your pants.",
    "You can iron pants made from cotton, corduroy, denim, linen, nylon, polyester, or wool, for instance.",
    "Use an ironing board for best results.",
    "While you can iron on nearly any flat surface, an ironing board makes it easy to smooth away any wrinkles.",
    "Adjust the ironing board to a comfortable height, and make sure the legs are locked before you start ironing.",
    "For instance, you can place your pant leg around the narrow end to iron to remove stubborn wrinkles.",
    "Alternatively, use a table with a fire-resistant tablecloth if you don’t have an ironing board handy.",
    "Fill up the steam compartment on your iron with fresh water.",
    "Most irons have a small water fill-up tank located on the backside of the iron.",
    "Look for the plastic compartment towards the top of the iron.",
    "Then, use water from your faucet to fill up the vessel to the designated fill line.",
    "The water creates steam as you iron, helpful when eliminating folds or wrinkles.",
    "Choose your desired temperature setting.",
    "Most irons indicate temperature based on the material of your pants.",
    "Turn on the iron, and then adjust the dial or indicator to the temperature you’d like to use.",
    "For instance, wool pants should be ironed on a lower temperature than cotton pants.",
    "Denim pants require a high heat setting and steam.",
    "Removing Wrinkles and Creases Start by ironing the pockets to prevent further wrinkles.",
    "If your pockets are wrinkled and you iron over them, you can easily create more wrinkles.",
    "To prevent this, pull the pocket inside out, and press it flat with the iron.",
    "Do this for both of the front and back pockets.",
    "This is an easy trick to help speed up the ironing process.",
    "Smooth out the waistband and top section.",
    "Place your iron across the waistband, and let it sit for 2-5 seconds.",
    "Then, lift up on the iron, rather than moving it across the top.",
    "This helps your pants lay flat.",
    "Once the waistband is wrinkle-free, you can tuck the pockets back inside your pants.",
    "Do this for the front and back of the waistband.",
    "Lay your pants lengthwise across the ironing board to iron the legs.",
    "Move the iron back and forth across 1 pant leg at a time, starting from top to bottom.",
    "Continually move the iron across the pant leg until the fabric is free of wrinkles or creases.",
    "Your pants should be parallel with the ironing board when you do this, and both legs should face the same direction.",
    "Don’t forget to iron the front and back of your pants!",
    "Fold your pants at the crease to easily iron it.",
    "Many classic dress pants have a crease down the center of the leg.",
    "To create this or follow your existing fold, lay 1 pant leg on the ironing board so that the inseams are directly over each other.",
    "Press the iron down at the top and bottom of the leg, and then fill in space by pressing the rest of the crease between the 2 iron points.",
    "Ensure the inseams are lined up as you do this to create a smooth, straight crease.",
    "Your crease should stop approximately at the bottom of the pockets on the front of the leg.",
    "Hanging or Folding Your Pants Let your pants cool down for 2-5 minutes.",
    "Before you hang or fold your pants, let them sit on your ironing board for a few minutes until they are cool to the touch.",
    "If you fold your pants before they cool, you can create additional creases or wrinkles.",
    "Hang your pants to keep them wrinkle-free.",
    "If you have a pants hanger, you can simply secure each side to the waistband of your pants.",
    "If using a shirt hanger, fold the pants in half.",
    "Then, drape the pants over top of the bottom of the hanger, and place the hanger in your closet.",
    "If there is a crease, fold the pants along the crease.",
    "If there is not a crease, you can fold them in half long ways.",
    "Fold your pants to store them in a dresser or drawer.",
    "Hanging is the best way to ensure your clothes don’t get wrinkled, but you can also fold up your pants and store them elsewhere.",
    "Bring the hem of the pants to the waistband to fold them in half.",
    "Then, place them in your closet.",
    "Alternatively, fold your pants in thirds if you need to save space.",
    "Bring the hem of the pants towards the crotch, then fold the waistband to the folded edge you just made."
  ],
  "tyn_section":[
    "Pants",
    "Ironing board",
    "Water",
    "Hanger (optional)",
    "Dresser or closet"
  ],
  "tyn_model":[
    "iron",
    "ironing board",
    "water",
    "pants",
    "irons",
    "pants hanger",
    "shirt hanger"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.4285714286,
    "f1":0.5,
    "avg_pos":0.4285714286
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.5714285714,
    "f1":0.5853658537
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.7142857143,
    "f1":0.7547169811
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.4285714286,
    "f1":0.5
  }
}