{
  "title":"How to Keep Food Warm for a Party",
  "url":"https://www.wikihow.com/Keep-Food-Warm-for-a-Party",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Using an Oven",
      "steps":[
        {
          "headline":"Preheat your oven to 150 °F (66 °C).",
          "description":"You don't want to burn your food when you put it in the oven to keep it warm. This temperature will warm up the oven to a nice temperature that won't cook your food as soon as you put it in the oven. Once your food is in the oven, you'll need to up the temperature to make sure it stays warm. If you have a gas oven, turn it on to the 1st gas mark. Then move the dial back so it's about a quarter of the way to the 1st gas mark. This will heat the oven to 150 °F (66 °C) or so."
        },
        {
          "headline":"Put your food on a baking sheet and make sure your containers are oven-safe.",
          "description":"You can find out if your containers are oven-safe by checking their underside. Oven-proof containers will have writing on their underside saying they're oven-safe or they'll have a picture of an oven. Lay the baking sheet on the inside of your container. Wavy lines with a temperature next to it denotes the maximum temperature that container can withstand in the oven."
        },
        {
          "headline":"Put your food in the oven and turn the heat to 200–250 °F (93–121 °C).",
          "description":"If you need to, put your food onto a baking tray before you put it in the oven. Open the oven door and use oven gloves to put your food in. Turn the heat up to 200–250 °F (93–121 °C) when you've placed the food in the oven and closed the door. If you have a gas oven, turn the dial to between 1/2 and 1 to reach this temperature. Don't put plates, bowls, or other implements in the oven if you're not sure if they can handle the heat from the oven. If you keep your food in the oven for a long period, you might reduce the quality of the food."
        },
        {
          "headline":"Check to make sure the food is above 140 °F (60 °C) every 15 minutes.",
          "description":"Use a food thermometer to test the heat of the food. Use oven gloves to remove the food from the oven. Stick the food thermometer into the food to test its temperature. Try to keep the temperature between 140 °F (60 °C) and 170 °F (77 °C). If the temperature is below 140 °F (60 °C), the food isn't staying warm. If this is the case, put the food back in the oven and turn the temperature up on the oven. If the temperature is above 220 °F (104 °C), your food is being cooked instead of being kept warm."
        },
        {
          "headline":"Take the food out of the oven when it's time to eat.",
          "description":"When all your guests have arrived, and small talk is finished, open the oven and take your food out. If you want, test it with your thermometer to make sure it's warm enough for serving. You can also have a small bite to test it. Serve the food to your party guests while it's warm."
        }
      ]
    },
    {
      "name":"Keeping Soups and Sauces Warm with a Stove",
      "steps":[
        {
          "headline":"Turn the burner on at its lowest setting.",
          "description":"After you've finished making your soup, you can keep it warm for a few hours by leaving it in the pot. Move the pot to a different hob on the stove and turn the burner on at the lowest setting."
        },
        {
          "headline":"Put a cover on the pot while it's on the burner.",
          "description":"By placing a cover on the pot, you'll keep the soup warm. The cover will stop most of the heat from escaping and this will ensure that the soup is heated more evenly throughout. If there's too much steam in the pot, tilt the cover at a slight angle to let it escape from the pot. Steam is also a sign that the burner is too hot. Turn the burner slightly down if you notice steam."
        },
        {
          "headline":"Stir the soup at 5-minute intervals.",
          "description":"While the stove is keeping the soup warm, it won't make sure that all of the soup is equally warm. By stirring the soup in the pot, you ensure that the soup is kept warm throughout."
        },
        {
          "headline":"Take the soup off the burner when you're ready.",
          "description":"Use oven gloves to lift the pot off the burner in case it's hot. Turn the burner off once you've removed the pot. Use a ladle to pour the soup into bowls from the pot. The soup is warm enough to serve if you can see steam rising from the surface."
        }
      ]
    },
    {
      "name":"Using Other Implements",
      "steps":[
        {
          "headline":"Use the microwave to keep your food warm.",
          "description":"While most people will associate the microwave with heating up food, and rightly so, you can also use it to keep your food warm. A microwave with a closed door is essentially a box that will trap heat. Place your food in the microwave and close the door to keep it warm. The microwave should only be used to keep food warm for 15 to 20 minutes. After this, the heat will escape, and the food will get cold."
        },
        {
          "headline":"Put soups or sauces in a thermos.",
          "description":"The thermos was designed for the specific purpose of keeping soup and other liquids warm for long periods of time. When you finish cooking the soup, use a ladle to pour it into your thermos straight away. The thermos will keep it warm for 4 to 5 hours."
        },
        {
          "headline":"Place your food in a crock-pot.",
          "description":"Crock-pots are also designed to trap heat and keep food warm. If you made potatoes or a stew, put them in the crock-pot and pop the lid on. The crock-pot can keep hot food warm for an hour or so. You can also put the crockpot in your oven to keep the food warm for hours. Heat your oven to 150 °F (66 °C) to keep the food warm. On a gas oven, turn the dial to the first mark."
        },
        {
          "headline":"Put food or bread in your toaster oven to keep it warm.",
          "description":"You can use your toaster oven as a second oven to keep smaller dishes or bread warm. Heat the oven up to 150 °F (66 °C) and put your food in it to keep it warm. Test the food regularly with a food thermometer to make sure it's above 140 °F (60 °C). If it's not, turn the heat up on the toaster oven."
        },
        {
          "headline":"Cover freshly baked dishes with several sheets of foil.",
          "description":"Foil is an insulator and if you wrap your food in several sheets of it as soon as it's finished, your food will stay warm for much longer. Wrap the sheets under a bowl or around the rim of a plate to keep the food on the container warm. Several sheets will do a better job than 1 sheet of foil by itself. Don't cover acidic foods with the foil as the aluminum will leech into the item."
        },
        {
          "headline":"Put your food in a chafing dish to keep it warm for longer.",
          "description":"Chafing dishes are a kind of stove, where fuel heats a pan of water which heats the food above it. If you're hosting a buffet, chafing dishes are the perfect items to display your food while also keeping it warm. Chafing dishes require small, portable, containers of fuel. Chafing dishes are not meant for cooking and should only be used to keep food warm."
        },
        {
          "headline":"Store your food in an insulated food carrier if you're transporting it.",
          "description":"Insulated food carriers are suitcase-like devices that are designed to keep food warm when it's moving from 1 place to another. Put your food in tupperware containers and place these containers into the bag. The food carrier will keep your food nice and warm while you make the journey with your food. Some bags have bottom and top compartments while others have straps to hold your food in place. The type of bag you need depends on what type of food and how much of it you're transporting."
        }
      ]
    }
  ],
  "text":" Using an Oven Preheat your oven to 150 °F (66 °C). You don't want to burn your food when you put it in the oven to keep it warm. This temperature will warm up the oven to a nice temperature that won't cook your food as soon as you put it in the oven. Once your food is in the oven, you'll need to up the temperature to make sure it stays warm. If you have a gas oven, turn it on to the 1st gas mark. Then move the dial back so it's about a quarter of the way to the 1st gas mark. This will heat the oven to 150 °F (66 °C) or so. Put your food on a baking sheet and make sure your containers are oven-safe. You can find out if your containers are oven-safe by checking their underside. Oven-proof containers will have writing on their underside saying they're oven-safe or they'll have a picture of an oven. Lay the baking sheet on the inside of your container. Wavy lines with a temperature next to it denotes the maximum temperature that container can withstand in the oven. Put your food in the oven and turn the heat to 200–250 °F (93–121 °C). If you need to, put your food onto a baking tray before you put it in the oven. Open the oven door and use oven gloves to put your food in. Turn the heat up to 200–250 °F (93–121 °C) when you've placed the food in the oven and closed the door. If you have a gas oven, turn the dial to between 1/2 and 1 to reach this temperature. Don't put plates, bowls, or other implements in the oven if you're not sure if they can handle the heat from the oven. If you keep your food in the oven for a long period, you might reduce the quality of the food. Check to make sure the food is above 140 °F (60 °C) every 15 minutes. Use a food thermometer to test the heat of the food. Use oven gloves to remove the food from the oven. Stick the food thermometer into the food to test its temperature. Try to keep the temperature between 140 °F (60 °C) and 170 °F (77 °C). If the temperature is below 140 °F (60 °C), the food isn't staying warm. If this is the case, put the food back in the oven and turn the temperature up on the oven. If the temperature is above 220 °F (104 °C), your food is being cooked instead of being kept warm. Take the food out of the oven when it's time to eat. When all your guests have arrived, and small talk is finished, open the oven and take your food out. If you want, test it with your thermometer to make sure it's warm enough for serving. You can also have a small bite to test it. Serve the food to your party guests while it's warm. Keeping Soups and Sauces Warm with a Stove Turn the burner on at its lowest setting. After you've finished making your soup, you can keep it warm for a few hours by leaving it in the pot. Move the pot to a different hob on the stove and turn the burner on at the lowest setting. Put a cover on the pot while it's on the burner. By placing a cover on the pot, you'll keep the soup warm. The cover will stop most of the heat from escaping and this will ensure that the soup is heated more evenly throughout. If there's too much steam in the pot, tilt the cover at a slight angle to let it escape from the pot. Steam is also a sign that the burner is too hot. Turn the burner slightly down if you notice steam. Stir the soup at 5-minute intervals. While the stove is keeping the soup warm, it won't make sure that all of the soup is equally warm. By stirring the soup in the pot, you ensure that the soup is kept warm throughout. Take the soup off the burner when you're ready. Use oven gloves to lift the pot off the burner in case it's hot. Turn the burner off once you've removed the pot. Use a ladle to pour the soup into bowls from the pot. The soup is warm enough to serve if you can see steam rising from the surface. Using Other Implements Use the microwave to keep your food warm. While most people will associate the microwave with heating up food, and rightly so, you can also use it to keep your food warm. A microwave with a closed door is essentially a box that will trap heat. Place your food in the microwave and close the door to keep it warm. The microwave should only be used to keep food warm for 15 to 20 minutes. After this, the heat will escape, and the food will get cold. Put soups or sauces in a thermos. The thermos was designed for the specific purpose of keeping soup and other liquids warm for long periods of time. When you finish cooking the soup, use a ladle to pour it into your thermos straight away. The thermos will keep it warm for 4 to 5 hours. Place your food in a crock-pot. Crock-pots are also designed to trap heat and keep food warm. If you made potatoes or a stew, put them in the crock-pot and pop the lid on. The crock-pot can keep hot food warm for an hour or so. You can also put the crockpot in your oven to keep the food warm for hours. Heat your oven to 150 °F (66 °C) to keep the food warm. On a gas oven, turn the dial to the first mark. Put food or bread in your toaster oven to keep it warm. You can use your toaster oven as a second oven to keep smaller dishes or bread warm. Heat the oven up to 150 °F (66 °C) and put your food in it to keep it warm. Test the food regularly with a food thermometer to make sure it's above 140 °F (60 °C). If it's not, turn the heat up on the toaster oven. Cover freshly baked dishes with several sheets of foil. Foil is an insulator and if you wrap your food in several sheets of it as soon as it's finished, your food will stay warm for much longer. Wrap the sheets under a bowl or around the rim of a plate to keep the food on the container warm. Several sheets will do a better job than 1 sheet of foil by itself. Don't cover acidic foods with the foil as the aluminum will leech into the item. Put your food in a chafing dish to keep it warm for longer. Chafing dishes are a kind of stove, where fuel heats a pan of water which heats the food above it. If you're hosting a buffet, chafing dishes are the perfect items to display your food while also keeping it warm. Chafing dishes require small, portable, containers of fuel. Chafing dishes are not meant for cooking and should only be used to keep food warm. Store your food in an insulated food carrier if you're transporting it. Insulated food carriers are suitcase-like devices that are designed to keep food warm when it's moving from 1 place to another. Put your food in tupperware containers and place these containers into the bag. The food carrier will keep your food nice and warm while you make the journey with your food. Some bags have bottom and top compartments while others have straps to hold your food in place. The type of bag you need depends on what type of food and how much of it you're transporting.",
  "sentences":[
    " Using an Oven Preheat your oven to 150 °F (66 °C).",
    "You don't want to burn your food when you put it in the oven to keep it warm.",
    "This temperature will warm up the oven to a nice temperature that won't cook your food as soon as you put it in the oven.",
    "Once your food is in the oven, you'll need to up the temperature to make sure it stays warm.",
    "If you have a gas oven, turn it on to the 1st gas mark.",
    "Then move the dial back so it's about a quarter of the way to the 1st gas mark.",
    "This will heat the oven to 150 °F (66 °C) or so.",
    "Put your food on a baking sheet and make sure your containers are oven-safe.",
    "You can find out if your containers are oven-safe by checking their underside.",
    "Oven-proof containers will have writing on their underside saying they're oven-safe or they'll have a picture of an oven.",
    "Lay the baking sheet on the inside of your container.",
    "Wavy lines with a temperature next to it denotes the maximum temperature that container can withstand in the oven.",
    "Put your food in the oven and turn the heat to 200–250 °F (93–121 °C).",
    "If you need to, put your food onto a baking tray before you put it in the oven.",
    "Open the oven door and use oven gloves to put your food in.",
    "Turn the heat up to 200–250 °F (93–121 °C) when you've placed the food in the oven and closed the door.",
    "If you have a gas oven, turn the dial to between 1/2 and 1 to reach this temperature.",
    "Don't put plates, bowls, or other implements in the oven if you're not sure if they can handle the heat from the oven.",
    "If you keep your food in the oven for a long period, you might reduce the quality of the food.",
    "Check to make sure the food is above 140 °F (60 °C) every 15 minutes.",
    "Use a food thermometer to test the heat of the food.",
    "Use oven gloves to remove the food from the oven.",
    "Stick the food thermometer into the food to test its temperature.",
    "Try to keep the temperature between 140 °F (60 °C) and 170 °F (77 °C).",
    "If the temperature is below 140 °F (60 °C), the food isn't staying warm.",
    "If this is the case, put the food back in the oven and turn the temperature up on the oven.",
    "If the temperature is above 220 °F (104 °C), your food is being cooked instead of being kept warm.",
    "Take the food out of the oven when it's time to eat.",
    "When all your guests have arrived, and small talk is finished, open the oven and take your food out.",
    "If you want, test it with your thermometer to make sure it's warm enough for serving.",
    "You can also have a small bite to test it.",
    "Serve the food to your party guests while it's warm.",
    "Keeping Soups and Sauces Warm with a Stove Turn the burner on at its lowest setting.",
    "After you've finished making your soup, you can keep it warm for a few hours by leaving it in the pot.",
    "Move the pot to a different hob on the stove and turn the burner on at the lowest setting.",
    "Put a cover on the pot while it's on the burner.",
    "By placing a cover on the pot, you'll keep the soup warm.",
    "The cover will stop most of the heat from escaping and this will ensure that the soup is heated more evenly throughout.",
    "If there's too much steam in the pot, tilt the cover at a slight angle to let it escape from the pot.",
    "Steam is also a sign that the burner is too hot.",
    "Turn the burner slightly down if you notice steam.",
    "Stir the soup at 5-minute intervals.",
    "While the stove is keeping the soup warm, it won't make sure that all of the soup is equally warm.",
    "By stirring the soup in the pot, you ensure that the soup is kept warm throughout.",
    "Take the soup off the burner when you're ready.",
    "Use oven gloves to lift the pot off the burner in case it's hot.",
    "Turn the burner off once you've removed the pot.",
    "Use a ladle to pour the soup into bowls from the pot.",
    "The soup is warm enough to serve if you can see steam rising from the surface.",
    "Using Other Implements Use the microwave to keep your food warm.",
    "While most people will associate the microwave with heating up food, and rightly so, you can also use it to keep your food warm.",
    "A microwave with a closed door is essentially a box that will trap heat.",
    "Place your food in the microwave and close the door to keep it warm.",
    "The microwave should only be used to keep food warm for 15 to 20 minutes.",
    "After this, the heat will escape, and the food will get cold.",
    "Put soups or sauces in a thermos.",
    "The thermos was designed for the specific purpose of keeping soup and other liquids warm for long periods of time.",
    "When you finish cooking the soup, use a ladle to pour it into your thermos straight away.",
    "The thermos will keep it warm for 4 to 5 hours.",
    "Place your food in a crock-pot.",
    "Crock-pots are also designed to trap heat and keep food warm.",
    "If you made potatoes or a stew, put them in the crock-pot and pop the lid on.",
    "The crock-pot can keep hot food warm for an hour or so.",
    "You can also put the crockpot in your oven to keep the food warm for hours.",
    "Heat your oven to 150 °F (66 °C) to keep the food warm.",
    "On a gas oven, turn the dial to the first mark.",
    "Put food or bread in your toaster oven to keep it warm.",
    "You can use your toaster oven as a second oven to keep smaller dishes or bread warm.",
    "Heat the oven up to 150 °F (66 °C) and put your food in it to keep it warm.",
    "Test the food regularly with a food thermometer to make sure it's above 140 °F (60 °C).",
    "If it's not, turn the heat up on the toaster oven.",
    "Cover freshly baked dishes with several sheets of foil.",
    "Foil is an insulator and if you wrap your food in several sheets of it as soon as it's finished, your food will stay warm for much longer.",
    "Wrap the sheets under a bowl or around the rim of a plate to keep the food on the container warm.",
    "Several sheets will do a better job than 1 sheet of foil by itself.",
    "Don't cover acidic foods with the foil as the aluminum will leech into the item.",
    "Put your food in a chafing dish to keep it warm for longer.",
    "Chafing dishes are a kind of stove, where fuel heats a pan of water which heats the food above it.",
    "If you're hosting a buffet, chafing dishes are the perfect items to display your food while also keeping it warm.",
    "Chafing dishes require small, portable, containers of fuel.",
    "Chafing dishes are not meant for cooking and should only be used to keep food warm.",
    "Store your food in an insulated food carrier if you're transporting it.",
    "Insulated food carriers are suitcase-like devices that are designed to keep food warm when it's moving from 1 place to another.",
    "Put your food in tupperware containers and place these containers into the bag.",
    "The food carrier will keep your food nice and warm while you make the journey with your food.",
    "Some bags have bottom and top compartments while others have straps to hold your food in place.",
    "The type of bag you need depends on what type of food and how much of it you're transporting."
  ],
  "tyn_section":[
    "Gas or electric oven",
    "Baking tray",
    "Food thermometer",
    "Stove",
    "Pot",
    "Ladle",
    "Bowls",
    "Microwave",
    "Thermos",
    "Crock-pot",
    "Toaster oven",
    "Foil",
    "Chafing dish",
    "Insulated food carrier"
  ],
  "tyn_model":[
    "oven",
    "pot",
    "burner",
    "microwave",
    "thermos",
    "foil",
    "oven gloves",
    "food thermometer",
    "stove",
    "toaster oven",
    "chafing dishes",
    "baking sheet",
    "bowls",
    "food",
    "ladle",
    "crock",
    "oven-proof containers",
    "baking tray",
    "plates",
    "thermometer",
    "soup",
    "crock-pot",
    "pots",
    "potatoes",
    "crockpot",
    "bowl",
    "plate",
    "aluminum",
    "chafing dish",
    "water",
    "insulated food carrier",
    "insulated food carriers",
    "tupperware containers",
    "food carrier"
  ],
  "simple_metrics":{
    "r":0.9285714286,
    "p":0.3823529412,
    "f1":0.5416666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.9285714286,
    "p":0.5294117647,
    "f1":0.674351585
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9285714286,
    "p":0.6176470588,
    "f1":0.7418478261
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.9285714286,
    "p":0.4117647059,
    "f1":0.5705329154
  }
}