{
  "title":"How to Defrost Bacon Quickly",
  "url":"https://www.wikihow.com/Defrost-Bacon-Quickly",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork",
    "Bacon"
  ],
  "methods":[
    {
      "name":"Using the Microwave",
      "steps":[
        {
          "headline":"Place the bacon on a paper towel in a microwave-safe dish.",
          "description":"Line a microwave proof dish with a paper towel. If you are using a large dish, use 2 paper towels so that the base is completely covered. The paper towels will help to absorb the excess bacon fat. Remove the bacon from its original packaging and place it on the paper towels. Spread the bacon out as much as possible to speed up the thawing process. If it is clumped together, let it defrost for 2 minutes before spreading it out on the plate. This will make it easier to separate."
        },
        {
          "headline":"Cover the bacon with a paper towel.",
          "description":"The high fat content in bacon can cause it to spit oil into the microwave, which can make a mess. Place a paper towel over the bacon to absorb the fat. Use a regular kitchen paper towel. These can be purchased from the supermarket."
        },
        {
          "headline":"Press the meat defrost button on the microwave.",
          "description":"If your microwave requires you to enter the weight of the bacon, check the weight of the bacon on the packet and enter the correct weight. The microwave will use this information to create a defrost time. If your microwave automatically defrosts, simply press the \"meat defrost\" button and then press start. The microwave will automatically set the amount of time for the bacon to defrost. If you don’t have the original bacon packet, use kitchen scales to weigh the bacon. Microwaving the bacon will likely take less than 15 minutes."
        },
        {
          "headline":"Cook the bacon as soon as it has defrosted.",
          "description":"When the microwave stops, carefully transfer the dish to the bench and remove the paper towels from the bacon. Cook the bacon immediately to avoid bacteria multiplying in the meat and making you sick. Fry the bacon in a pan, bake it in the oven, or cook it in the microwave."
        },
        {
          "headline":"Store cooked bacon in the refrigerator for up to 5 days.",
          "description":"Place the cooked bacon in an airtight container before placing it in the refrigerator. Don't eat the bacon if it has a an unpleasant taste."
        }
      ]
    },
    {
      "name":"Defrosting in Cold Water",
      "steps":[
        {
          "headline":"Place the bacon into a watertight plastic bag if the packaging is open.",
          "description":"If the original packaging of the bacon has been opened or damaged, you will need to transfer it into a watertight bag so that the bacon is not damaged by water or bacteria. Ziplock bags work well as they are easy to seal and open. Purchase watertight bags from the supermarket. Keep the bacon in the original packaging if the packaging is intact."
        },
        {
          "headline":"Submerge the bag of bacon in cold water.",
          "description":"Fill the sink, or a large bowl, with cold tap water. Place the watertight bag of bacon into the water. Don’t use the sink if you need to wash dishes in the next hour."
        },
        {
          "headline":"Replace the water every 30 minutes until the bacon is thawed.",
          "description":"The water will warm up over time, especially if you live in a warm climate. Replace the water every half hour so that the bacon continues to defrost rapidly. The bacon is thawed once it is floppy, rather than stiff. 1 pound (0.45 kg) of bacon will take about an hour to thaw."
        },
        {
          "headline":"Cook the bacon in the oven, a pan, or in the microwave.",
          "description":"The bacon needs to be cooked once it has thawed to stop the bacteria breeding. It is safe to cook bacon that hasn’t completely thawed. Cook the bacon using your favorite method."
        },
        {
          "headline":"Refrigerate cooked bacon for up to 5 days.",
          "description":"Once your bacon has been cooked, place it in an airtight container. If the bacon has an unpleasant smell, don’t eat it. If you want to use the cooked bacon at a later day, place it in an airtight container in the freezer for up to 3 months. Use any of the above methods to defrost the frozen bacon."
        }
      ]
    }
  ],
  "text":" Using the Microwave Place the bacon on a paper towel in a microwave-safe dish. Line a microwave proof dish with a paper towel. If you are using a large dish, use 2 paper towels so that the base is completely covered. The paper towels will help to absorb the excess bacon fat. Remove the bacon from its original packaging and place it on the paper towels. Spread the bacon out as much as possible to speed up the thawing process. If it is clumped together, let it defrost for 2 minutes before spreading it out on the plate. This will make it easier to separate. Cover the bacon with a paper towel. The high fat content in bacon can cause it to spit oil into the microwave, which can make a mess. Place a paper towel over the bacon to absorb the fat. Use a regular kitchen paper towel. These can be purchased from the supermarket. Press the meat defrost button on the microwave. If your microwave requires you to enter the weight of the bacon, check the weight of the bacon on the packet and enter the correct weight. The microwave will use this information to create a defrost time. If your microwave automatically defrosts, simply press the \"meat defrost\" button and then press start. The microwave will automatically set the amount of time for the bacon to defrost. If you don’t have the original bacon packet, use kitchen scales to weigh the bacon. Microwaving the bacon will likely take less than 15 minutes. Cook the bacon as soon as it has defrosted. When the microwave stops, carefully transfer the dish to the bench and remove the paper towels from the bacon. Cook the bacon immediately to avoid bacteria multiplying in the meat and making you sick. Fry the bacon in a pan, bake it in the oven, or cook it in the microwave. Store cooked bacon in the refrigerator for up to 5 days. Place the cooked bacon in an airtight container before placing it in the refrigerator. Don't eat the bacon if it has a an unpleasant taste. Defrosting in Cold Water Place the bacon into a watertight plastic bag if the packaging is open. If the original packaging of the bacon has been opened or damaged, you will need to transfer it into a watertight bag so that the bacon is not damaged by water or bacteria. Ziplock bags work well as they are easy to seal and open. Purchase watertight bags from the supermarket. Keep the bacon in the original packaging if the packaging is intact. Submerge the bag of bacon in cold water. Fill the sink, or a large bowl, with cold tap water. Place the watertight bag of bacon into the water. Don’t use the sink if you need to wash dishes in the next hour. Replace the water every 30 minutes until the bacon is thawed. The water will warm up over time, especially if you live in a warm climate. Replace the water every half hour so that the bacon continues to defrost rapidly. The bacon is thawed once it is floppy, rather than stiff. 1 pound (0.45 kg) of bacon will take about an hour to thaw. Cook the bacon in the oven, a pan, or in the microwave. The bacon needs to be cooked once it has thawed to stop the bacteria breeding. It is safe to cook bacon that hasn’t completely thawed. Cook the bacon using your favorite method. Refrigerate cooked bacon for up to 5 days. Once your bacon has been cooked, place it in an airtight container. If the bacon has an unpleasant smell, don’t eat it. If you want to use the cooked bacon at a later day, place it in an airtight container in the freezer for up to 3 months. Use any of the above methods to defrost the frozen bacon.",
  "sentences":[
    " Using the Microwave Place the bacon on a paper towel in a microwave-safe dish.",
    "Line a microwave proof dish with a paper towel.",
    "If you are using a large dish, use 2 paper towels so that the base is completely covered.",
    "The paper towels will help to absorb the excess bacon fat.",
    "Remove the bacon from its original packaging and place it on the paper towels.",
    "Spread the bacon out as much as possible to speed up the thawing process.",
    "If it is clumped together, let it defrost for 2 minutes before spreading it out on the plate.",
    "This will make it easier to separate.",
    "Cover the bacon with a paper towel.",
    "The high fat content in bacon can cause it to spit oil into the microwave, which can make a mess.",
    "Place a paper towel over the bacon to absorb the fat.",
    "Use a regular kitchen paper towel.",
    "These can be purchased from the supermarket.",
    "Press the meat defrost button on the microwave.",
    "If your microwave requires you to enter the weight of the bacon, check the weight of the bacon on the packet and enter the correct weight.",
    "The microwave will use this information to create a defrost time.",
    "If your microwave automatically defrosts, simply press the \"meat defrost\" button and then press start.",
    "The microwave will automatically set the amount of time for the bacon to defrost.",
    "If you don’t have the original bacon packet, use kitchen scales to weigh the bacon.",
    "Microwaving the bacon will likely take less than 15 minutes.",
    "Cook the bacon as soon as it has defrosted.",
    "When the microwave stops, carefully transfer the dish to the bench and remove the paper towels from the bacon.",
    "Cook the bacon immediately to avoid bacteria multiplying in the meat and making you sick.",
    "Fry the bacon in a pan, bake it in the oven, or cook it in the microwave.",
    "Store cooked bacon in the refrigerator for up to 5 days.",
    "Place the cooked bacon in an airtight container before placing it in the refrigerator.",
    "Don't eat the bacon if it has a an unpleasant taste.",
    "Defrosting in Cold Water Place the bacon into a watertight plastic bag if the packaging is open.",
    "If the original packaging of the bacon has been opened or damaged, you will need to transfer it into a watertight bag so that the bacon is not damaged by water or bacteria.",
    "Ziplock bags work well as they are easy to seal and open.",
    "Purchase watertight bags from the supermarket.",
    "Keep the bacon in the original packaging if the packaging is intact.",
    "Submerge the bag of bacon in cold water.",
    "Fill the sink, or a large bowl, with cold tap water.",
    "Place the watertight bag of bacon into the water.",
    "Don’t use the sink if you need to wash dishes in the next hour.",
    "Replace the water every 30 minutes until the bacon is thawed.",
    "The water will warm up over time, especially if you live in a warm climate.",
    "Replace the water every half hour so that the bacon continues to defrost rapidly.",
    "The bacon is thawed once it is floppy, rather than stiff.",
    "1 pound (0.45 kg) of bacon will take about an hour to thaw.",
    "Cook the bacon in the oven, a pan, or in the microwave.",
    "The bacon needs to be cooked once it has thawed to stop the bacteria breeding.",
    "It is safe to cook bacon that hasn’t completely thawed.",
    "Cook the bacon using your favorite method.",
    "Refrigerate cooked bacon for up to 5 days.",
    "Once your bacon has been cooked, place it in an airtight container.",
    "If the bacon has an unpleasant smell, don’t eat it.",
    "If you want to use the cooked bacon at a later day, place it in an airtight container in the freezer for up to 3 months.",
    "Use any of the above methods to defrost the frozen bacon."
  ],
  "tyn_section":[
    "Paper towels",
    "Microwave-safe dish",
    "Microwave",
    "Kitchen scales (optional)",
    "Airtight container (to store leftovers)",
    "Large bowl or sink",
    "Watertight plastic bag"
  ],
  "tyn_model":[
    "bacon",
    "microwave",
    "water",
    "paper towel",
    "paper towels",
    "airtight container",
    "oven",
    "refrigerator",
    "microwave-safe dish",
    "microwave proof dish",
    "plate",
    "kitchen paper towel",
    "kitchen scales",
    "watertight plastic bag",
    "ziplock bags",
    "watertight bags",
    "freezer"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.2352941176,
    "f1":0.3333333333,
    "avg_pos":0.2352941176
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.2941176471,
    "f1":0.4166666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.4705882353,
    "f1":0.6075949367
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.2941176471,
    "f1":0.4166666667
  }
}