{
  "title":"How to Boil Dumplings",
  "url":"https://www.wikihow.com/Boil-Dumplings",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Boiling Chinese Dumplings in a Pot",
      "steps":[
        {
          "headline":"Make the dough for the dumplings if you haven't already.",
          "description":"A basic dough can be made by mixing flour, water, and salt together in a large bowl with a wooden spoon. Knead the dough and let it rest for about 2 hours. When it is ready, cut it up into small chunks. You can drop the dough balls directly into the water or roll them out to turn them into wrappers for Chinese dumplings. You may also be able to buy fresh, uncooked dumplings. Ask around at local restaurants that serve fresh dumplings."
        },
        {
          "headline":"Fill and fold the wrappers.",
          "description":"Chinese dumplings are often filled with mixtures of meat and vegetables. For example, cook up a pork and cabbage filling using ground pork, napa cabbage, soy sauce, and herbs and spices. Place a small amount of filling in the center of the wrapper, then fold the wrapper over on itself. Add different ingredients to customize the filling. For instance, you can make a filling out of pork and cabbage or out of vegetables."
        },
        {
          "headline":"Freeze dumplings if you aren't cooking them right away.",
          "description":"Avoid leaving the dumplings out at room temperature for more than 30 minutes. To preserve them, place a piece of parchment paper over a baking sheet. Dust the paper with flour or cornstarch, arrange the dumplings in a single layer on the paper, then put the tray in the oven for 30 minutes. Once the dumplings freeze, move them to airtight containers or freezer bags. Freezing is especially important for filled dumplings. The dough will absorb moisture from the filling and fall apart when you cook it."
        },
        {
          "headline":"Bring a pot of water to a boil over high heat.",
          "description":"Fill a large pot about ⅔ full with cold water and place it on your stove. To speed up the boiling time, cover the pot first. Wait for the water to rapidly bubble."
        },
        {
          "headline":"Stir a small batch of dumplings into the water.",
          "description":"Cook a small number of dumplings at any given time. You can add about 8 dumplings to an average-sized pot. The dumplings should form a single layer at the bottom of the pan. Stir them in so they don't stick together. Frozen homemade dumplings do not need to be thawed. If you buy preserved dumplings, like the kind from your supermarket freezer aisle, you can usually let them thaw for about 15 minutes as you boil to the water or prepare a dipping sauce. If you have a particularly big pot or small dumplings, you may be able to cook the dumplings in larger batches."
        },
        {
          "headline":"Wait 3 to 4 minutes for the dumplings to float.",
          "description":"The dumplings will bob up to the surface after a few minutes. Stay near the pot to avoid overcooking them. Check to see if the dumplings look cooked through and remove any that have fallen apart."
        },
        {
          "headline":"Boil the dumplings for 6 minutes until they look transparent.",
          "description":"After the dumplings rise to the surface, leave them in the pot for a little bit longer. The inner part of the dumpling, including the filling for Chinese dumplings, tends to cook slower than the outer portion. When the dumplings have cooked evenly, they should appear puffed up and transparent. You can also try adding ⁄2 cup (120 mL) of cold water to the pot after the dumplings rise. Wait for the water to boil and the dumplings to float again. Repeat this until they are cooked through."
        },
        {
          "headline":"Move the dumplings immediately to a serving plate.",
          "description":"Too much water is bad for the dumplings, so fish them out with a slotted spoon right away. Place them in a single layer on a plate or tray. Avoid stacking them or else they may absorb water and fall apart. You can pour the pot's contents into a strainer as well to drain the water."
        },
        {
          "headline":"Store leftover dumplings in an airtight container in the refrigerator.",
          "description":"Put the dumplings in a sealed plastic container. Cooked dumplings will last about 4 days this way. In the freezer, they last up to 3 months and may become soggy and tasteless when stored for longer than that. Raw homemade dumplings should be put in a resealable freezer bag. Squeeze as much air out of the bag as you can. The dumplings will last at least 2 weeks in the freezer, possibly a few months, and can quickly be cooked when you need them."
        }
      ]
    },
    {
      "name":"Cooking Drop Dumplings in Broth",
      "steps":[
        {
          "headline":"Mix the dough if you are making fresh dumplings.",
          "description":"Mix together flour, baking soda, sugar, and salt in a bowl. Gradually mix in butter to bring the dough together. Mix in some milk afterwards to soften it. Another way is to buy prepared dough or frozen drop dumplings. Defrost frozen dumplings first."
        },
        {
          "headline":"Boil water or stock over high heat on the stove.",
          "description":"Water works fine, but consider using any kind of stock to give the dumplings more flavor. You can also boil a soup or stew, such as one with carrots, peas, and chicken. Get the liquid nice and bubbly."
        },
        {
          "headline":"Drop the dough into the boiling liquid.",
          "description":"Make sure all of the dumplings are a similar size so they cook at the same rate. You can scoop the dough up with a spoon, then push it off into the pot. Continue doing this until all of the dough chunks are in the pot. Keep the dumplings relatively small, about the size of a spoon. Large dumplings have a tendency to cook unevenly, which means you get a mouthful of raw dough when you bite into them."
        },
        {
          "headline":"Cover and simmer the dumplings over medium heat for 15 minutes.",
          "description":"Turn the heat down on the stove so the liquid doesn't overflow the pot. Cover the pot to trap the remaining heat in, then set your timer. The dumplings will be soft and flavorful when they're done."
        },
        {
          "headline":"Serve the dumplings in the liquid they were cooked in.",
          "description":"Drop dumplings are often served as is. All you need is a serving spoon or ladle. Scoop out the dumplings and broth, then pour them into a bowl to enjoy them. You can use a slotted spoon to remove the dumplings if you boiled them in water or don't want the broth."
        },
        {
          "headline":"Store the dumplings for up to 3 days in the refrigerator.",
          "description":"Pour the dumplings and broth into a resealable plastic container. If possible, separate the dumplings from the liquid so they don't get soggy so quickly. For better results, make as many dumplings as you need for the dish and don't try to store them. The broth can last about 1 week in the refrigerator and 3 months in the freezer, so you may be better off making fresh dumplings and adding them to the broth when you want to use it again. You can try storing the dumplings in the freezer, but chances are they will get mushy and not taste very good even when separated from the liquid."
        }
      ]
    },
    {
      "name":"Boiling Potstickers in a Pan",
      "steps":[
        {
          "headline":"Heat cooking oil over medium heat in a nonstick skillet.",
          "description":"Pour about 1 tablespoon (15 mL) of olive or vegetable oil into a pan. Heat the oil until it shimmers  and appears about to smoke. Make sure the pan is non-stick or cast iron so the dumplings don't stick and tear apart when you move them later."
        },
        {
          "headline":"Place the potstickers in the pan.",
          "description":"When cooking the dumplings, keep the folded side facing up. The thicker side with the filling should be against the pan. If you can't get them to stand up, you can also lay them flat in the pan. Cook only about 8 to 12 dumplings at a time, keeping them in a single layer so all the dumplings are in the oil. Potstickers are basically the same as Chinese dumplings except they are seared and boiled in a pan. They may be smaller and thinner than dumplings boiled in a pot. The amount of potstickers you can cook at a time depends on the size of your pan and dumplings."
        },
        {
          "headline":"Pour 2 tablespoons (30 mL) of water into the pan.",
          "description":"Add the water, making sure the stove's heat is set to medium. Using a mixing spoon or another utensil, swirl the oil and water around to coat the dumplings in it. Swirling the liquids around in the pot a little leads to a better sear, so make sure all the dumplings get covered."
        },
        {
          "headline":"Cover the pan and cook them for 3 to 4 minutes.",
          "description":"The water will evaporate as the potstickers boil. When this happens, uncover the pans and check to see if the potstickers are cooked through. They should look transparent and feel soft and warm in the center. The potstickers should also have a golden brown crust on the bottom. You can lift them with tongs to check. If they don't, leave the cover off the pan and cook them until they brown."
        },
        {
          "headline":"Cook the potstickers in water for 4 minutes if they aren't done.",
          "description":"Add about ⁄3 cup (79 mL) of water to the pan. Cover the pan again and let the dumplings continue to boil. Most of the water should evaporate by the time the potstickers are finished. If there is a little water left, you can uncover the pan and let the water evaporate. Frozen dumplings may need the extra cooking time. For fresh potstickers, you may need to use a little more water to get them to finish without burning."
        },
        {
          "headline":"Serve the potstickers with a dipping sauce.",
          "description":"Take the dumplings out of the pan right away so they cannot continue to boil or brown. Use a slotted spoon to scoop them out and place them on a plate. Potstickers are often eaten with a dipping sauce, such as a mixture of dark vinegar, soy sauce, and sesame oil. The best time to make the dipping sauce is while you wait for the water to boil. If you make fresh dumplings, you can also do it while waiting for the dough to rise. Customize the dipping sauce with different ingredients like rice wine vinegar and scallions."
        },
        {
          "headline":"Store leftover potstickers in a resealable container in the refrigerator.",
          "description":"The potstickers will last about 3 days in the refrigerator. Keep them covered so they don't absorb moisture and fall apart. Since they can be cooked fast and in small batches, you may not even get a chance to store them before they're all gone, but consider storing the raw dumplings and cooking only what you plan on eating. They also store well in the freezer. Lay them out on parchment paper to freeze for 30 minutes, then move them into a resealable bag. They should last about 3 months."
        }
      ]
    }
  ],
  "text":" Boiling Chinese Dumplings in a Pot Make the dough for the dumplings if you haven't already. A basic dough can be made by mixing flour, water, and salt together in a large bowl with a wooden spoon. Knead the dough and let it rest for about 2 hours. When it is ready, cut it up into small chunks. You can drop the dough balls directly into the water or roll them out to turn them into wrappers for Chinese dumplings. You may also be able to buy fresh, uncooked dumplings. Ask around at local restaurants that serve fresh dumplings. Fill and fold the wrappers. Chinese dumplings are often filled with mixtures of meat and vegetables. For example, cook up a pork and cabbage filling using ground pork, napa cabbage, soy sauce, and herbs and spices. Place a small amount of filling in the center of the wrapper, then fold the wrapper over on itself. Add different ingredients to customize the filling. For instance, you can make a filling out of pork and cabbage or out of vegetables. Freeze dumplings if you aren't cooking them right away. Avoid leaving the dumplings out at room temperature for more than 30 minutes. To preserve them, place a piece of parchment paper over a baking sheet. Dust the paper with flour or cornstarch, arrange the dumplings in a single layer on the paper, then put the tray in the oven for 30 minutes. Once the dumplings freeze, move them to airtight containers or freezer bags. Freezing is especially important for filled dumplings. The dough will absorb moisture from the filling and fall apart when you cook it. Bring a pot of water to a boil over high heat. Fill a large pot about ⅔ full with cold water and place it on your stove. To speed up the boiling time, cover the pot first. Wait for the water to rapidly bubble. Stir a small batch of dumplings into the water. Cook a small number of dumplings at any given time. You can add about 8 dumplings to an average-sized pot. The dumplings should form a single layer at the bottom of the pan. Stir them in so they don't stick together. Frozen homemade dumplings do not need to be thawed. If you buy preserved dumplings, like the kind from your supermarket freezer aisle, you can usually let them thaw for about 15 minutes as you boil to the water or prepare a dipping sauce. If you have a particularly big pot or small dumplings, you may be able to cook the dumplings in larger batches. Wait 3 to 4 minutes for the dumplings to float. The dumplings will bob up to the surface after a few minutes. Stay near the pot to avoid overcooking them. Check to see if the dumplings look cooked through and remove any that have fallen apart. Boil the dumplings for 6 minutes until they look transparent. After the dumplings rise to the surface, leave them in the pot for a little bit longer. The inner part of the dumpling, including the filling for Chinese dumplings, tends to cook slower than the outer portion. When the dumplings have cooked evenly, they should appear puffed up and transparent. You can also try adding ⁄2 cup (120 mL) of cold water to the pot after the dumplings rise. Wait for the water to boil and the dumplings to float again. Repeat this until they are cooked through. Move the dumplings immediately to a serving plate. Too much water is bad for the dumplings, so fish them out with a slotted spoon right away. Place them in a single layer on a plate or tray. Avoid stacking them or else they may absorb water and fall apart. You can pour the pot's contents into a strainer as well to drain the water. Store leftover dumplings in an airtight container in the refrigerator. Put the dumplings in a sealed plastic container. Cooked dumplings will last about 4 days this way. In the freezer, they last up to 3 months and may become soggy and tasteless when stored for longer than that. Raw homemade dumplings should be put in a resealable freezer bag. Squeeze as much air out of the bag as you can. The dumplings will last at least 2 weeks in the freezer, possibly a few months, and can quickly be cooked when you need them. Cooking Drop Dumplings in Broth Mix the dough if you are making fresh dumplings. Mix together flour, baking soda, sugar, and salt in a bowl. Gradually mix in butter to bring the dough together. Mix in some milk afterwards to soften it. Another way is to buy prepared dough or frozen drop dumplings. Defrost frozen dumplings first. Boil water or stock over high heat on the stove. Water works fine, but consider using any kind of stock to give the dumplings more flavor. You can also boil a soup or stew, such as one with carrots, peas, and chicken. Get the liquid nice and bubbly. Drop the dough into the boiling liquid. Make sure all of the dumplings are a similar size so they cook at the same rate. You can scoop the dough up with a spoon, then push it off into the pot. Continue doing this until all of the dough chunks are in the pot. Keep the dumplings relatively small, about the size of a spoon. Large dumplings have a tendency to cook unevenly, which means you get a mouthful of raw dough when you bite into them. Cover and simmer the dumplings over medium heat for 15 minutes. Turn the heat down on the stove so the liquid doesn't overflow the pot. Cover the pot to trap the remaining heat in, then set your timer. The dumplings will be soft and flavorful when they're done. Serve the dumplings in the liquid they were cooked in. Drop dumplings are often served as is. All you need is a serving spoon or ladle. Scoop out the dumplings and broth, then pour them into a bowl to enjoy them. You can use a slotted spoon to remove the dumplings if you boiled them in water or don't want the broth. Store the dumplings for up to 3 days in the refrigerator. Pour the dumplings and broth into a resealable plastic container. If possible, separate the dumplings from the liquid so they don't get soggy so quickly. For better results, make as many dumplings as you need for the dish and don't try to store them. The broth can last about 1 week in the refrigerator and 3 months in the freezer, so you may be better off making fresh dumplings and adding them to the broth when you want to use it again. You can try storing the dumplings in the freezer, but chances are they will get mushy and not taste very good even when separated from the liquid. Boiling Potstickers in a Pan Heat cooking oil over medium heat in a nonstick skillet. Pour about 1 tablespoon (15 mL) of olive or vegetable oil into a pan. Heat the oil until it shimmers  and appears about to smoke. Make sure the pan is non-stick or cast iron so the dumplings don't stick and tear apart when you move them later. Place the potstickers in the pan. When cooking the dumplings, keep the folded side facing up. The thicker side with the filling should be against the pan. If you can't get them to stand up, you can also lay them flat in the pan. Cook only about 8 to 12 dumplings at a time, keeping them in a single layer so all the dumplings are in the oil. Potstickers are basically the same as Chinese dumplings except they are seared and boiled in a pan. They may be smaller and thinner than dumplings boiled in a pot. The amount of potstickers you can cook at a time depends on the size of your pan and dumplings. Pour 2 tablespoons (30 mL) of water into the pan. Add the water, making sure the stove's heat is set to medium. Using a mixing spoon or another utensil, swirl the oil and water around to coat the dumplings in it. Swirling the liquids around in the pot a little leads to a better sear, so make sure all the dumplings get covered. Cover the pan and cook them for 3 to 4 minutes. The water will evaporate as the potstickers boil. When this happens, uncover the pans and check to see if the potstickers are cooked through. They should look transparent and feel soft and warm in the center. The potstickers should also have a golden brown crust on the bottom. You can lift them with tongs to check. If they don't, leave the cover off the pan and cook them until they brown. Cook the potstickers in water for 4 minutes if they aren't done. Add about ⁄3 cup (79 mL) of water to the pan. Cover the pan again and let the dumplings continue to boil. Most of the water should evaporate by the time the potstickers are finished. If there is a little water left, you can uncover the pan and let the water evaporate. Frozen dumplings may need the extra cooking time. For fresh potstickers, you may need to use a little more water to get them to finish without burning. Serve the potstickers with a dipping sauce. Take the dumplings out of the pan right away so they cannot continue to boil or brown. Use a slotted spoon to scoop them out and place them on a plate. Potstickers are often eaten with a dipping sauce, such as a mixture of dark vinegar, soy sauce, and sesame oil. The best time to make the dipping sauce is while you wait for the water to boil. If you make fresh dumplings, you can also do it while waiting for the dough to rise. Customize the dipping sauce with different ingredients like rice wine vinegar and scallions. Store leftover potstickers in a resealable container in the refrigerator. The potstickers will last about 3 days in the refrigerator. Keep them covered so they don't absorb moisture and fall apart. Since they can be cooked fast and in small batches, you may not even get a chance to store them before they're all gone, but consider storing the raw dumplings and cooking only what you plan on eating. They also store well in the freezer. Lay them out on parchment paper to freeze for 30 minutes, then move them into a resealable bag. They should last about 3 months.",
  "sentences":[
    " Boiling Chinese Dumplings in a Pot Make the dough for the dumplings if you haven't already.",
    "A basic dough can be made by mixing flour, water, and salt together in a large bowl with a wooden spoon.",
    "Knead the dough and let it rest for about 2 hours.",
    "When it is ready, cut it up into small chunks.",
    "You can drop the dough balls directly into the water or roll them out to turn them into wrappers for Chinese dumplings.",
    "You may also be able to buy fresh, uncooked dumplings.",
    "Ask around at local restaurants that serve fresh dumplings.",
    "Fill and fold the wrappers.",
    "Chinese dumplings are often filled with mixtures of meat and vegetables.",
    "For example, cook up a pork and cabbage filling using ground pork, napa cabbage, soy sauce, and herbs and spices.",
    "Place a small amount of filling in the center of the wrapper, then fold the wrapper over on itself.",
    "Add different ingredients to customize the filling.",
    "For instance, you can make a filling out of pork and cabbage or out of vegetables.",
    "Freeze dumplings if you aren't cooking them right away.",
    "Avoid leaving the dumplings out at room temperature for more than 30 minutes.",
    "To preserve them, place a piece of parchment paper over a baking sheet.",
    "Dust the paper with flour or cornstarch, arrange the dumplings in a single layer on the paper, then put the tray in the oven for 30 minutes.",
    "Once the dumplings freeze, move them to airtight containers or freezer bags.",
    "Freezing is especially important for filled dumplings.",
    "The dough will absorb moisture from the filling and fall apart when you cook it.",
    "Bring a pot of water to a boil over high heat.",
    "Fill a large pot about ⅔ full with cold water and place it on your stove.",
    "To speed up the boiling time, cover the pot first.",
    "Wait for the water to rapidly bubble.",
    "Stir a small batch of dumplings into the water.",
    "Cook a small number of dumplings at any given time.",
    "You can add about 8 dumplings to an average-sized pot.",
    "The dumplings should form a single layer at the bottom of the pan.",
    "Stir them in so they don't stick together.",
    "Frozen homemade dumplings do not need to be thawed.",
    "If you buy preserved dumplings, like the kind from your supermarket freezer aisle, you can usually let them thaw for about 15 minutes as you boil to the water or prepare a dipping sauce.",
    "If you have a particularly big pot or small dumplings, you may be able to cook the dumplings in larger batches.",
    "Wait 3 to 4 minutes for the dumplings to float.",
    "The dumplings will bob up to the surface after a few minutes.",
    "Stay near the pot to avoid overcooking them.",
    "Check to see if the dumplings look cooked through and remove any that have fallen apart.",
    "Boil the dumplings for 6 minutes until they look transparent.",
    "After the dumplings rise to the surface, leave them in the pot for a little bit longer.",
    "The inner part of the dumpling, including the filling for Chinese dumplings, tends to cook slower than the outer portion.",
    "When the dumplings have cooked evenly, they should appear puffed up and transparent.",
    "You can also try adding ⁄2 cup (120 mL) of cold water to the pot after the dumplings rise.",
    "Wait for the water to boil and the dumplings to float again.",
    "Repeat this until they are cooked through.",
    "Move the dumplings immediately to a serving plate.",
    "Too much water is bad for the dumplings, so fish them out with a slotted spoon right away.",
    "Place them in a single layer on a plate or tray.",
    "Avoid stacking them or else they may absorb water and fall apart.",
    "You can pour the pot's contents into a strainer as well to drain the water.",
    "Store leftover dumplings in an airtight container in the refrigerator.",
    "Put the dumplings in a sealed plastic container.",
    "Cooked dumplings will last about 4 days this way.",
    "In the freezer, they last up to 3 months and may become soggy and tasteless when stored for longer than that.",
    "Raw homemade dumplings should be put in a resealable freezer bag.",
    "Squeeze as much air out of the bag as you can.",
    "The dumplings will last at least 2 weeks in the freezer, possibly a few months, and can quickly be cooked when you need them.",
    "Cooking Drop Dumplings in Broth Mix the dough if you are making fresh dumplings.",
    "Mix together flour, baking soda, sugar, and salt in a bowl.",
    "Gradually mix in butter to bring the dough together.",
    "Mix in some milk afterwards to soften it.",
    "Another way is to buy prepared dough or frozen drop dumplings.",
    "Defrost frozen dumplings first.",
    "Boil water or stock over high heat on the stove.",
    "Water works fine, but consider using any kind of stock to give the dumplings more flavor.",
    "You can also boil a soup or stew, such as one with carrots, peas, and chicken.",
    "Get the liquid nice and bubbly.",
    "Drop the dough into the boiling liquid.",
    "Make sure all of the dumplings are a similar size so they cook at the same rate.",
    "You can scoop the dough up with a spoon, then push it off into the pot.",
    "Continue doing this until all of the dough chunks are in the pot.",
    "Keep the dumplings relatively small, about the size of a spoon.",
    "Large dumplings have a tendency to cook unevenly, which means you get a mouthful of raw dough when you bite into them.",
    "Cover and simmer the dumplings over medium heat for 15 minutes.",
    "Turn the heat down on the stove so the liquid doesn't overflow the pot.",
    "Cover the pot to trap the remaining heat in, then set your timer.",
    "The dumplings will be soft and flavorful when they're done.",
    "Serve the dumplings in the liquid they were cooked in.",
    "Drop dumplings are often served as is.",
    "All you need is a serving spoon or ladle.",
    "Scoop out the dumplings and broth, then pour them into a bowl to enjoy them.",
    "You can use a slotted spoon to remove the dumplings if you boiled them in water or don't want the broth.",
    "Store the dumplings for up to 3 days in the refrigerator.",
    "Pour the dumplings and broth into a resealable plastic container.",
    "If possible, separate the dumplings from the liquid so they don't get soggy so quickly.",
    "For better results, make as many dumplings as you need for the dish and don't try to store them.",
    "The broth can last about 1 week in the refrigerator and 3 months in the freezer, so you may be better off making fresh dumplings and adding them to the broth when you want to use it again.",
    "You can try storing the dumplings in the freezer, but chances are they will get mushy and not taste very good even when separated from the liquid.",
    "Boiling Potstickers in a Pan Heat cooking oil over medium heat in a nonstick skillet.",
    "Pour about 1 tablespoon (15 mL) of olive or vegetable oil into a pan.",
    "Heat the oil until it shimmers  and appears about to smoke.",
    "Make sure the pan is non-stick or cast iron so the dumplings don't stick and tear apart when you move them later.",
    "Place the potstickers in the pan.",
    "When cooking the dumplings, keep the folded side facing up.",
    "The thicker side with the filling should be against the pan.",
    "If you can't get them to stand up, you can also lay them flat in the pan.",
    "Cook only about 8 to 12 dumplings at a time, keeping them in a single layer so all the dumplings are in the oil.",
    "Potstickers are basically the same as Chinese dumplings except they are seared and boiled in a pan.",
    "They may be smaller and thinner than dumplings boiled in a pot.",
    "The amount of potstickers you can cook at a time depends on the size of your pan and dumplings.",
    "Pour 2 tablespoons (30 mL) of water into the pan.",
    "Add the water, making sure the stove's heat is set to medium.",
    "Using a mixing spoon or another utensil, swirl the oil and water around to coat the dumplings in it.",
    "Swirling the liquids around in the pot a little leads to a better sear, so make sure all the dumplings get covered.",
    "Cover the pan and cook them for 3 to 4 minutes.",
    "The water will evaporate as the potstickers boil.",
    "When this happens, uncover the pans and check to see if the potstickers are cooked through.",
    "They should look transparent and feel soft and warm in the center.",
    "The potstickers should also have a golden brown crust on the bottom.",
    "You can lift them with tongs to check.",
    "If they don't, leave the cover off the pan and cook them until they brown.",
    "Cook the potstickers in water for 4 minutes if they aren't done.",
    "Add about ⁄3 cup (79 mL) of water to the pan.",
    "Cover the pan again and let the dumplings continue to boil.",
    "Most of the water should evaporate by the time the potstickers are finished.",
    "If there is a little water left, you can uncover the pan and let the water evaporate.",
    "Frozen dumplings may need the extra cooking time.",
    "For fresh potstickers, you may need to use a little more water to get them to finish without burning.",
    "Serve the potstickers with a dipping sauce.",
    "Take the dumplings out of the pan right away so they cannot continue to boil or brown.",
    "Use a slotted spoon to scoop them out and place them on a plate.",
    "Potstickers are often eaten with a dipping sauce, such as a mixture of dark vinegar, soy sauce, and sesame oil.",
    "The best time to make the dipping sauce is while you wait for the water to boil.",
    "If you make fresh dumplings, you can also do it while waiting for the dough to rise.",
    "Customize the dipping sauce with different ingredients like rice wine vinegar and scallions.",
    "Store leftover potstickers in a resealable container in the refrigerator.",
    "The potstickers will last about 3 days in the refrigerator.",
    "Keep them covered so they don't absorb moisture and fall apart.",
    "Since they can be cooked fast and in small batches, you may not even get a chance to store them before they're all gone, but consider storing the raw dumplings and cooking only what you plan on eating.",
    "They also store well in the freezer.",
    "Lay them out on parchment paper to freeze for 30 minutes, then move them into a resealable bag.",
    "They should last about 3 months."
  ],
  "tyn_section":[
    "Stove",
    "Pot",
    "Slotted spoon",
    "Baking tray",
    "Parchment paper",
    "Plate",
    "Lid",
    "Spoon",
    "Bowl",
    "Pan",
    "Tongs",
    "Measuring cup"
  ],
  "tyn_model":[
    "water",
    "pot",
    "pan",
    "broth",
    "stove",
    "refrigerator",
    "potstickers",
    "flour",
    "slotted spoon",
    "oil",
    "salt",
    "soy sauce",
    "parchment paper",
    "plate",
    "freezer",
    "bowl",
    "stock",
    "spoon",
    "wooden spoon",
    "napa cabbage",
    "herbs",
    "spices",
    "vegetables",
    "baking sheet",
    "tray",
    "oven",
    "airtight containers",
    "freezer bags",
    "⅔ full",
    "cold water",
    "strainer",
    "airtight container",
    "sealed plastic container",
    "resealable freezer bag",
    "cooking drop dumplings",
    "baking soda",
    "sugar",
    "butter",
    "milk",
    "carrots",
    "peas",
    "chicken",
    "serving spoon",
    "ladle",
    "resealable plastic container",
    "cooking oil",
    "nonstick skillet",
    "olive or vegetable oil",
    "mixing spoon",
    "pans",
    "dark vinegar",
    "sesame oil",
    "rice wine vinegar",
    "scallions",
    "resealable container",
    "resealable bag"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1428571429,
    "f1":0.2352941176,
    "avg_pos":0.0714285714
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.2142857143,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.25,
    "f1":0.375
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1428571429,
    "f1":0.2352941176
  }
}