{
  "title":"How to Cut Mattress Foam",
  "url":"https://www.wikihow.com/Cut-Mattress-Foam",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "parts":[
    {
      "name":"Measuring and Marking the Mattress Foam",
      "steps":[
        {
          "headline":"Remove the zip cover and any lining on the mattress foam.",
          "description":"Most mattress foam comes with an outer covering that protects the foam inside. To remove it, simply unzip the cover and pull it off. If there’s additional lining underneath the zip cover, use a pair of scissors to cut and remove it. Be careful as you’re cutting so you don’t cut into the mattress foam with the scissors. You can dispose of the zip cover and any lining after you take it off since it won’t fit your mattress foam anymore once you cut it, or you can try altering and sewing it so you can reuse it. If you toss out the old zip cover, you may need to buy a new one depending on what you’ll be using the mattress foam for."
        },
        {
          "headline":"Use measuring tape to determine where you should cut the foam.",
          "description":"If you want to cut your mattress foam in half, measure from one side of the foam to the other and then divide that number in half to figure out where you’ll want to make the cut. If you know how wide or long you want the piece of foam you’re cutting to be, measure that distance with the measuring tape and use a marker to mark the mattress at that point so you can reference it later. Try not to press down on the foam while you're measuring it so you don't distort the size and shape. Measure 2 or 3 times so you know that your measurement is accurate."
        },
        {
          "headline":"Mark the line you want to cut with a marker.",
          "description":"Take a long ruler or straight edge and line it up with the point you measured on the mattress. Then, carefully draw a straight line along the edge of the ruler with a marker. Depending on the shape and size of the piece you want to cut, you may need to draw multiple lines. Make sure the straight edge or ruler isn’t slanted before drawing your line by measuring the distance from both ends of the tool to the edge of the mattress. If the distance isn’t the same from both ends, the straight edge or ruler is slanted. If you’re cutting the mattress foam to fit a smaller bed frame, you’ll want to draw a straight line from one short end of the foam to the other. If you’re not cutting a straight line, you can draw the curve you want to cut on a large piece of paper, cut it out, and then trace the curve onto the mattress foam with marker. You can freehand the curve on the paper, or you can trace the curved object you’ll be using the mattress foam for."
        },
        {
          "headline":"Elevate the mattress foam so the marked line doesn’t have anything under it.",
          "description":"Since you’ll be cutting through the foam with a knife, you don’t want the line to be on a solid surface or you could end up chipping and scratching it. Rest the foam on a stable, elevated surface so that the space directly under the marked line is open. For example, you could rest the mattress foam on a table so that the marked line is hanging off the edge. If you’re cutting a large mattress foam in half, try resting it on 2 box springs that have some space in between them. That way, the line down the center of the foam will sit right over the open space."
        }
      ]
    },
    {
      "name":"Cutting the Foam with a Knife",
      "steps":[
        {
          "headline":"Use an electric carving knife to cut the foam if you want a clean edge.",
          "description":"Electric carving knives are usually used to slice through food, but you can also use one to easily cut your mattress foam. Because the serrated edges of the knife saw back and forth when it’s plugged in, you can get a cleaner, straighter edge with it. If you don’t have an electric carving knife but you’d like to use one to cut your mattress foam, you can find one online or at your local department store."
        },
        {
          "headline":"Try a regular kitchen knife if you don’t want to get an electric one.",
          "description":"Although the cut may not be as clean and straight as it would be with an electric carving knife, a kitchen knife will also do the trick. Especially if you plan on putting a new cover over your cut piece of mattress foam that will hide the edge, a kitchen knife is an easy, cheap option. If you decide to use a kitchen knife, try to use one that has serrated edges if possible. The longer the blade, the easier it will be to cut through your mattress foam. If you don't have a kitchen knife that will work, you may be able to use a pair of heavy-duty scissors if the mattress foam you're cutting is ⁄8 inch (0.32 cm) or less thick. Just keep in mind that the cut may not be as clean as if you were using a knife."
        },
        {
          "headline":"Hold the knife at a 90-degree angle to the foam at the edge.",
          "description":"This will make it easier to cut deep into the mattress foam. Position the knife so the sharp edge of the blade is lined up with the line you marked on the foam."
        },
        {
          "headline":"Cut along the marked line using an up-and-down motion.",
          "description":"If you’re using an electric carving knife, you may not need to move the knife up and down since it will be moving on its own. Once you reach the end of the line, pull out the knife and separate the piece of foam or continue with the next marked line. Go slowly and make sure you’re following along with the line so your edge is as straight as possible. If you’re using scissors, cut along the line you marked like you would if you were cutting fabric or paper."
        },
        {
          "headline":"Repeat on the other side if the knife doesn’t go all the way through.",
          "description":"If you’re using a knife with a short blade, it may not cut all the way through your mattress foam. If that’s the case, flip the foam over and measure and mark another line on the opposite side. Then, cut through that line the same way you did on the other side so that the foam separates into 2 pieces. Make sure you measure carefully so the lines on each side of the foam match up."
        }
      ]
    },
    {
      "name":"Finishing up",
      "steps":[
        {
          "headline":"Double check your measurements using measuring tape.",
          "description":"Measure from the newly cut edge to the opposite side of your mattress foam. If it’s the right size, you’re all set! If it’s not, you can always repeat the process and cut off a little more foam if necessary. Unfortunately, if your measurement is too short, you won’t be able to add any foam back on. However, if you’ll be covering your mattress foam with a zip cover, you could try cutting a strip of foam that makes up the difference and placing it next to the larger piece inside the cover."
        },
        {
          "headline":"Smooth out any jagged edges with a knife.",
          "description":"While some minor jagged edges won’t make much of a difference if you’re going to be putting a cover on your mattress foam, you may want to fix them if your foam is going to be exposed. To smooth out the edges, take a kitchen knife and carefully cut off any jagged pieces that are sticking out so the cut is nice and straight. Don’t cut off too much of the foam or you might end up altering the size of it."
        },
        {
          "headline":"Put the new or altered zip cover over the mattress foam if you’ll be using one.",
          "description":"If you don’t want to alter or sew the old zip cover to fit your cut mattress foam, you can order a custom mattress cover online using the dimensions of your foam. Once you have a cover, simply unzip it all the way, place your mattress foam inside, and zip the cover up again."
        }
      ]
    }
  ],
  "text":" Measuring and Marking the Mattress Foam Remove the zip cover and any lining on the mattress foam. Most mattress foam comes with an outer covering that protects the foam inside. To remove it, simply unzip the cover and pull it off. If there’s additional lining underneath the zip cover, use a pair of scissors to cut and remove it. Be careful as you’re cutting so you don’t cut into the mattress foam with the scissors. You can dispose of the zip cover and any lining after you take it off since it won’t fit your mattress foam anymore once you cut it, or you can try altering and sewing it so you can reuse it. If you toss out the old zip cover, you may need to buy a new one depending on what you’ll be using the mattress foam for. Use measuring tape to determine where you should cut the foam. If you want to cut your mattress foam in half, measure from one side of the foam to the other and then divide that number in half to figure out where you’ll want to make the cut. If you know how wide or long you want the piece of foam you’re cutting to be, measure that distance with the measuring tape and use a marker to mark the mattress at that point so you can reference it later. Try not to press down on the foam while you're measuring it so you don't distort the size and shape. Measure 2 or 3 times so you know that your measurement is accurate. Mark the line you want to cut with a marker. Take a long ruler or straight edge and line it up with the point you measured on the mattress. Then, carefully draw a straight line along the edge of the ruler with a marker. Depending on the shape and size of the piece you want to cut, you may need to draw multiple lines. Make sure the straight edge or ruler isn’t slanted before drawing your line by measuring the distance from both ends of the tool to the edge of the mattress. If the distance isn’t the same from both ends, the straight edge or ruler is slanted. If you’re cutting the mattress foam to fit a smaller bed frame, you’ll want to draw a straight line from one short end of the foam to the other. If you’re not cutting a straight line, you can draw the curve you want to cut on a large piece of paper, cut it out, and then trace the curve onto the mattress foam with marker. You can freehand the curve on the paper, or you can trace the curved object you’ll be using the mattress foam for. Elevate the mattress foam so the marked line doesn’t have anything under it. Since you’ll be cutting through the foam with a knife, you don’t want the line to be on a solid surface or you could end up chipping and scratching it. Rest the foam on a stable, elevated surface so that the space directly under the marked line is open. For example, you could rest the mattress foam on a table so that the marked line is hanging off the edge. If you’re cutting a large mattress foam in half, try resting it on 2 box springs that have some space in between them. That way, the line down the center of the foam will sit right over the open space. Cutting the Foam with a Knife Use an electric carving knife to cut the foam if you want a clean edge. Electric carving knives are usually used to slice through food, but you can also use one to easily cut your mattress foam. Because the serrated edges of the knife saw back and forth when it’s plugged in, you can get a cleaner, straighter edge with it. If you don’t have an electric carving knife but you’d like to use one to cut your mattress foam, you can find one online or at your local department store. Try a regular kitchen knife if you don’t want to get an electric one. Although the cut may not be as clean and straight as it would be with an electric carving knife, a kitchen knife will also do the trick. Especially if you plan on putting a new cover over your cut piece of mattress foam that will hide the edge, a kitchen knife is an easy, cheap option. If you decide to use a kitchen knife, try to use one that has serrated edges if possible. The longer the blade, the easier it will be to cut through your mattress foam. If you don't have a kitchen knife that will work, you may be able to use a pair of heavy-duty scissors if the mattress foam you're cutting is ⁄8 inch (0.32 cm) or less thick. Just keep in mind that the cut may not be as clean as if you were using a knife. Hold the knife at a 90-degree angle to the foam at the edge. This will make it easier to cut deep into the mattress foam. Position the knife so the sharp edge of the blade is lined up with the line you marked on the foam. Cut along the marked line using an up-and-down motion. If you’re using an electric carving knife, you may not need to move the knife up and down since it will be moving on its own. Once you reach the end of the line, pull out the knife and separate the piece of foam or continue with the next marked line. Go slowly and make sure you’re following along with the line so your edge is as straight as possible. If you’re using scissors, cut along the line you marked like you would if you were cutting fabric or paper. Repeat on the other side if the knife doesn’t go all the way through. If you’re using a knife with a short blade, it may not cut all the way through your mattress foam. If that’s the case, flip the foam over and measure and mark another line on the opposite side. Then, cut through that line the same way you did on the other side so that the foam separates into 2 pieces. Make sure you measure carefully so the lines on each side of the foam match up. Finishing up Double check your measurements using measuring tape. Measure from the newly cut edge to the opposite side of your mattress foam. If it’s the right size, you’re all set! If it’s not, you can always repeat the process and cut off a little more foam if necessary. Unfortunately, if your measurement is too short, you won’t be able to add any foam back on. However, if you’ll be covering your mattress foam with a zip cover, you could try cutting a strip of foam that makes up the difference and placing it next to the larger piece inside the cover. Smooth out any jagged edges with a knife. While some minor jagged edges won’t make much of a difference if you’re going to be putting a cover on your mattress foam, you may want to fix them if your foam is going to be exposed. To smooth out the edges, take a kitchen knife and carefully cut off any jagged pieces that are sticking out so the cut is nice and straight. Don’t cut off too much of the foam or you might end up altering the size of it. Put the new or altered zip cover over the mattress foam if you’ll be using one. If you don’t want to alter or sew the old zip cover to fit your cut mattress foam, you can order a custom mattress cover online using the dimensions of your foam. Once you have a cover, simply unzip it all the way, place your mattress foam inside, and zip the cover up again.",
  "sentences":[
    " Measuring and Marking the Mattress Foam Remove the zip cover and any lining on the mattress foam.",
    "Most mattress foam comes with an outer covering that protects the foam inside.",
    "To remove it, simply unzip the cover and pull it off.",
    "If there’s additional lining underneath the zip cover, use a pair of scissors to cut and remove it.",
    "Be careful as you’re cutting so you don’t cut into the mattress foam with the scissors.",
    "You can dispose of the zip cover and any lining after you take it off since it won’t fit your mattress foam anymore once you cut it, or you can try altering and sewing it so you can reuse it.",
    "If you toss out the old zip cover, you may need to buy a new one depending on what you’ll be using the mattress foam for.",
    "Use measuring tape to determine where you should cut the foam.",
    "If you want to cut your mattress foam in half, measure from one side of the foam to the other and then divide that number in half to figure out where you’ll want to make the cut.",
    "If you know how wide or long you want the piece of foam you’re cutting to be, measure that distance with the measuring tape and use a marker to mark the mattress at that point so you can reference it later.",
    "Try not to press down on the foam while you're measuring it so you don't distort the size and shape.",
    "Measure 2 or 3 times so you know that your measurement is accurate.",
    "Mark the line you want to cut with a marker.",
    "Take a long ruler or straight edge and line it up with the point you measured on the mattress.",
    "Then, carefully draw a straight line along the edge of the ruler with a marker.",
    "Depending on the shape and size of the piece you want to cut, you may need to draw multiple lines.",
    "Make sure the straight edge or ruler isn’t slanted before drawing your line by measuring the distance from both ends of the tool to the edge of the mattress.",
    "If the distance isn’t the same from both ends, the straight edge or ruler is slanted.",
    "If you’re cutting the mattress foam to fit a smaller bed frame, you’ll want to draw a straight line from one short end of the foam to the other.",
    "If you’re not cutting a straight line, you can draw the curve you want to cut on a large piece of paper, cut it out, and then trace the curve onto the mattress foam with marker.",
    "You can freehand the curve on the paper, or you can trace the curved object you’ll be using the mattress foam for.",
    "Elevate the mattress foam so the marked line doesn’t have anything under it.",
    "Since you’ll be cutting through the foam with a knife, you don’t want the line to be on a solid surface or you could end up chipping and scratching it.",
    "Rest the foam on a stable, elevated surface so that the space directly under the marked line is open.",
    "For example, you could rest the mattress foam on a table so that the marked line is hanging off the edge.",
    "If you’re cutting a large mattress foam in half, try resting it on 2 box springs that have some space in between them.",
    "That way, the line down the center of the foam will sit right over the open space.",
    "Cutting the Foam with a Knife Use an electric carving knife to cut the foam if you want a clean edge.",
    "Electric carving knives are usually used to slice through food, but you can also use one to easily cut your mattress foam.",
    "Because the serrated edges of the knife saw back and forth when it’s plugged in, you can get a cleaner, straighter edge with it.",
    "If you don’t have an electric carving knife but you’d like to use one to cut your mattress foam, you can find one online or at your local department store.",
    "Try a regular kitchen knife if you don’t want to get an electric one.",
    "Although the cut may not be as clean and straight as it would be with an electric carving knife, a kitchen knife will also do the trick.",
    "Especially if you plan on putting a new cover over your cut piece of mattress foam that will hide the edge, a kitchen knife is an easy, cheap option.",
    "If you decide to use a kitchen knife, try to use one that has serrated edges if possible.",
    "The longer the blade, the easier it will be to cut through your mattress foam.",
    "If you don't have a kitchen knife that will work, you may be able to use a pair of heavy-duty scissors if the mattress foam you're cutting is ⁄8 inch (0.32 cm) or less thick.",
    "Just keep in mind that the cut may not be as clean as if you were using a knife.",
    "Hold the knife at a 90-degree angle to the foam at the edge.",
    "This will make it easier to cut deep into the mattress foam.",
    "Position the knife so the sharp edge of the blade is lined up with the line you marked on the foam.",
    "Cut along the marked line using an up-and-down motion.",
    "If you’re using an electric carving knife, you may not need to move the knife up and down since it will be moving on its own.",
    "Once you reach the end of the line, pull out the knife and separate the piece of foam or continue with the next marked line.",
    "Go slowly and make sure you’re following along with the line so your edge is as straight as possible.",
    "If you’re using scissors, cut along the line you marked like you would if you were cutting fabric or paper.",
    "Repeat on the other side if the knife doesn’t go all the way through.",
    "If you’re using a knife with a short blade, it may not cut all the way through your mattress foam.",
    "If that’s the case, flip the foam over and measure and mark another line on the opposite side.",
    "Then, cut through that line the same way you did on the other side so that the foam separates into 2 pieces.",
    "Make sure you measure carefully so the lines on each side of the foam match up.",
    "Finishing up Double check your measurements using measuring tape.",
    "Measure from the newly cut edge to the opposite side of your mattress foam.",
    "If it’s the right size, you’re all set!",
    "If it’s not, you can always repeat the process and cut off a little more foam if necessary.",
    "Unfortunately, if your measurement is too short, you won’t be able to add any foam back on.",
    "However, if you’ll be covering your mattress foam with a zip cover, you could try cutting a strip of foam that makes up the difference and placing it next to the larger piece inside the cover.",
    "Smooth out any jagged edges with a knife.",
    "While some minor jagged edges won’t make much of a difference if you’re going to be putting a cover on your mattress foam, you may want to fix them if your foam is going to be exposed.",
    "To smooth out the edges, take a kitchen knife and carefully cut off any jagged pieces that are sticking out so the cut is nice and straight.",
    "Don’t cut off too much of the foam or you might end up altering the size of it.",
    "Put the new or altered zip cover over the mattress foam if you’ll be using one.",
    "If you don’t want to alter or sew the old zip cover to fit your cut mattress foam, you can order a custom mattress cover online using the dimensions of your foam.",
    "Once you have a cover, simply unzip it all the way, place your mattress foam inside, and zip the cover up again."
  ],
  "tyn_section":[
    "Scissors",
    "Measuring tape",
    "Marker",
    "Kitchen knife or electric carving knife"
  ],
  "tyn_model":[
    "mattress foam",
    "knife",
    "kitchen knife",
    "scissors",
    "marker",
    "ruler",
    "measuring tape",
    "foam",
    "electric carving knife",
    "zip cover",
    "paper",
    "mattress",
    "electric carving",
    "electric carving knives",
    "measure",
    "mattress cover"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.1875,
    "f1":0.3,
    "avg_pos":0.1875
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.25,
    "f1":0.4
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4375,
    "f1":0.6086956522
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.1875,
    "f1":0.3
  }
}