{
  "title":"How to Fix Faux Leather Peeling",
  "url":"https://www.wikihow.com/Fix-Faux-Leather-Peeling",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Leatherworking"
  ],
  "methods":[
    {
      "name":"Replacing Faux Leather on Shoes",
      "steps":[
        {
          "headline":"Sand the flaking faux leather off with 180 grit sandpaper.",
          "description":"Before you begin any kind of repair job, you’ll first need to get all of the flaking, peeling faux leather off of the shoes. Sand the top and sides of the shoes wherever you note flakes. Sand in tight circles and be sure to apply plenty of pressure to the shoe. You can purchase sandpaper at any hardware store. Pick up at least 4 sheets for this project."
        },
        {
          "headline":"Color in any discolored cracks with a marker that matches the shoes.",
          "description":"Use a thick permanent marker and trace the tip over any parts of the shoe that appear faded or discolored once the peeling faux leather has been removed. This will improve the appearance of the shoes. So, if you’re repairing brown shoes, use a brown permanent marker. Do your best to find a marker that matches the color of the shoes. You may not be able to find a perfect match, though, unless the shoes are black. You can buy permanent markers at any office supply store and most grocery stores."
        },
        {
          "headline":"Use a clean rag to rub shoe polish on the surface of the shoes.",
          "description":"Dip a rag into a tin of shoe polish and smear it across the surface of the sanded shoe. Work in long, even strokes across the top and sides of the shoes. Be sure to apply the shoe polish evenly, so that the shoes have a uniform color across all surfaces. As with the marker, the shoe polish should match the color of the shoe. In most cases, a generic black or brown polish will be fine. You can buy shoe polish at some grocery stores and at large retailers or department stores."
        },
        {
          "headline":"Paint shoe goo over the shoe with a ⁄2 inch (1.3 cm) paintbrush.",
          "description":"Squeeze a dollop of shoe goo out onto the tops of the shoes, and use the paintbrush to smear the thick goo around. Make sure to cover every surface of the shoe, down to the seam where the fabric meets the sole. This will seal the shoes and help protect the composite fabric that underlies the faux leather. You can buy shoe goo at any shoe-supply store and at many large department stores."
        },
        {
          "headline":"Let the shoe goo dry for 24 hours.",
          "description":"To see if the thick goo is dry, tap it with a finger. If your finger comes away clean and the goo doesn’t feel wet, it’s most likely fully dry. If your finger comes away with some goo on it, give the goo another 12 hours to dry. After the shoes are dry, you can start wearing them as soon as you like."
        }
      ]
    },
    {
      "name":"Repairing Faux Leather Furniture with Leather Paint",
      "steps":[
        {
          "headline":"Pull off loose bits of faux leather to clean the surface for repair.",
          "description":"Use your fingers to pluck off any bits of faux leather that are still partially attached to the back or seat of your chair or sofa. Avoid pulling off more bits than necessary, though, as you might end up worsening the damage to the furniture. Be sure to throw these leather bits away in a garbage can; otherwise, they’ll make a mess in your home."
        },
        {
          "headline":"Paint on a layer of leather paint that matches your furniture.",
          "description":"You can find leather paint at large art stores or leather-supply stores. Dip a ⁄2 inch (1.3 cm) paintbrush into the jar of leather paint, and paint an even layer across the section of faux leather you’ve just peeled. Work in long horizontal strokes to ensure that the entire peeling area is fully covered. You can purchase leather paint at any leather goods store. It may also be available at large art supply stores. If you’re unable to find a color of leather paint that matches your sofa or chair, skip this step. Move directly to applying high-gloss finish leather paint."
        },
        {
          "headline":"Give the paint at least 30 minutes to dry.",
          "description":"If you try to apply subsequent layers of leather paint over the first before it’s completely dry, you’ll just end up smearing the layers together. To see if the paint is dry, lightly tap it with your finger. If your finger comes away clean and the paint doesn’t feel sticky, it’s dry."
        },
        {
          "headline":"Apply a layer of high-gloss finish leather paint.",
          "description":"Once the layer of leather paint has dried, you can apply high-gloss finish. As with the matte paint, dip your ⁄2 inch (1.3 cm) paintbrush into the high-gloss finish and paint a layer over the peeling section of the faux leather. Give the finish 30 minutes to dry. Finish leather paint is colorless and will seal the painted area of the couch or chair that you’re repairing."
        },
        {
          "headline":"Put on 3–4 additional layers of high-gloss finish leather paint.",
          "description":"The multiple layers of finish should hold the fabric together and will prevent further peeling in that area of the couch or chair. Apply a thick, generous coat each time. When the finish first goes on, it will appear opaque and white, but the color will fade as the finish dries. Give each coat at least 30 minutes to dry before applying the next coat. When all the coats have dried, the repaired section will look reasonably similar to non-peeling sections of the faux leather."
        }
      ]
    },
    {
      "name":"Fixing Faux Leather Furniture with Soft Filler",
      "steps":[
        {
          "headline":"Cut off the peeling faux leather with a razor blade.",
          "description":"Before repairing the faux leather, you’ll first need to remove all of the flaking pieces. Use your fingers and a razor blade to peel, scrape, and cut away the peeling sections of faux leather from your chair or sofa. Don’t slice off more faux leather than necessary, though. Only remove what’s already loose and flaking. You can purchase 5-packs of razor blades at most hardware stores. Exercise caution when using a razor blade and never cut towards yourself."
        },
        {
          "headline":"Apply leather soft filler to the peeled area with a putty knife.",
          "description":"Scoop out a 1 inch (2.5 cm) dollop of soft filler with a putty knife. Still using the knife, smear the filler across the peeled section of the leather furniture. Smooth out the filler so that it’s a uniform thickness across the peeled section. Try not to get filler on the unpeeled sections of the faux leather. Soft filler will bond with the base fabric of the faux leather and create a new vinyl-like surface. You can purchase it at any leather store and at many craft supply stores."
        },
        {
          "headline":"Push the soft filler off of the furniture seams and smooth the surface.",
          "description":"If you happened to apply any filler to the furniture’s seams, you can use a stiff piece of paper to rub if off. Use the edge of an index or business card to push filler out of the seam. Then, run the long edge of the card over the top of the fabric you’re repairing to smooth out the layer of filler. Clearing the seams and feathering the edges of the soft filler will give the repair job a more professional look."
        },
        {
          "headline":"Let the soft filler cure for 20 minutes.",
          "description":"The filler will cure relatively quickly. It’s important that you don’t touch the filler while it’s curing. If you have small children or pets in your home, keep them out of the room with the curing filler. If you’re repairing a small chair, you could move the chair outdoors and let it sit in the sun if the weather is pleasant. This will speed up the curing process."
        },
        {
          "headline":"Apply a second layer of soft filler to the patch you’re repairing.",
          "description":"Once the first layer has dried, use your putty knife to apply a second thick layer of filler to the leather. As before, avoid spreading the filler onto undamaged parts of the faux leather."
        },
        {
          "headline":"Add texture to the repair job by pressing plastic wrap against it.",
          "description":"Tear off a 12 in (30 cm) piece of plastic wrap and warp it around your hand. Press your plastic-covered palm against the semi-dry second layer of soft filler. When you lift your hand off, the area will be slightly textured. Repeat this process until you’ve lightly textured the entire section you’re repairing. Texture will help the repaired section match the rest of the faux leather. If the surface of your faux leather furniture is completely smooth, you won’t need to add any texturing to the soft filler. In that case, you can skip this step."
        },
        {
          "headline":"Apply leather paint to the repaired patch with a damp sponge.",
          "description":"Squeeze a generous amount of leather paint onto a dampened sponge. The dollop should be about 2 inches (5.1 cm) in diameter. Then, use the sponge to smear the leather paint across the entire repaired section of the faux leather. Work in long, smooth strokes, and apply a uniformly thin coat across the section you’re repairing. Overlap the paint with the undamaged faux leather by about ⁄2 inch (1.3 cm) so that the sections blend together. You can find leather paint at any leather goods store and at many large hobby shops. Look through the store’s selection to find a color of leather paint that matches the furniture you’re repairing. If you can’t find a color of paint that matches your chair or sofa, try mixing together a shade of paint that’s slightly lighter than your furniture and 1 that’s slightly darker."
        }
      ]
    }
  ],
  "text":" Replacing Faux Leather on Shoes Sand the flaking faux leather off with 180 grit sandpaper. Before you begin any kind of repair job, you’ll first need to get all of the flaking, peeling faux leather off of the shoes. Sand the top and sides of the shoes wherever you note flakes. Sand in tight circles and be sure to apply plenty of pressure to the shoe. You can purchase sandpaper at any hardware store. Pick up at least 4 sheets for this project. Color in any discolored cracks with a marker that matches the shoes. Use a thick permanent marker and trace the tip over any parts of the shoe that appear faded or discolored once the peeling faux leather has been removed. This will improve the appearance of the shoes. So, if you’re repairing brown shoes, use a brown permanent marker. Do your best to find a marker that matches the color of the shoes. You may not be able to find a perfect match, though, unless the shoes are black. You can buy permanent markers at any office supply store and most grocery stores. Use a clean rag to rub shoe polish on the surface of the shoes. Dip a rag into a tin of shoe polish and smear it across the surface of the sanded shoe. Work in long, even strokes across the top and sides of the shoes. Be sure to apply the shoe polish evenly, so that the shoes have a uniform color across all surfaces. As with the marker, the shoe polish should match the color of the shoe. In most cases, a generic black or brown polish will be fine. You can buy shoe polish at some grocery stores and at large retailers or department stores. Paint shoe goo over the shoe with a ⁄2 inch (1.3 cm) paintbrush. Squeeze a dollop of shoe goo out onto the tops of the shoes, and use the paintbrush to smear the thick goo around. Make sure to cover every surface of the shoe, down to the seam where the fabric meets the sole. This will seal the shoes and help protect the composite fabric that underlies the faux leather. You can buy shoe goo at any shoe-supply store and at many large department stores. Let the shoe goo dry for 24 hours. To see if the thick goo is dry, tap it with a finger. If your finger comes away clean and the goo doesn’t feel wet, it’s most likely fully dry. If your finger comes away with some goo on it, give the goo another 12 hours to dry. After the shoes are dry, you can start wearing them as soon as you like. Repairing Faux Leather Furniture with Leather Paint Pull off loose bits of faux leather to clean the surface for repair. Use your fingers to pluck off any bits of faux leather that are still partially attached to the back or seat of your chair or sofa. Avoid pulling off more bits than necessary, though, as you might end up worsening the damage to the furniture. Be sure to throw these leather bits away in a garbage can; otherwise, they’ll make a mess in your home. Paint on a layer of leather paint that matches your furniture. You can find leather paint at large art stores or leather-supply stores. Dip a ⁄2 inch (1.3 cm) paintbrush into the jar of leather paint, and paint an even layer across the section of faux leather you’ve just peeled. Work in long horizontal strokes to ensure that the entire peeling area is fully covered. You can purchase leather paint at any leather goods store. It may also be available at large art supply stores. If you’re unable to find a color of leather paint that matches your sofa or chair, skip this step. Move directly to applying high-gloss finish leather paint. Give the paint at least 30 minutes to dry. If you try to apply subsequent layers of leather paint over the first before it’s completely dry, you’ll just end up smearing the layers together. To see if the paint is dry, lightly tap it with your finger. If your finger comes away clean and the paint doesn’t feel sticky, it’s dry. Apply a layer of high-gloss finish leather paint. Once the layer of leather paint has dried, you can apply high-gloss finish. As with the matte paint, dip your ⁄2 inch (1.3 cm) paintbrush into the high-gloss finish and paint a layer over the peeling section of the faux leather. Give the finish 30 minutes to dry. Finish leather paint is colorless and will seal the painted area of the couch or chair that you’re repairing. Put on 3–4 additional layers of high-gloss finish leather paint. The multiple layers of finish should hold the fabric together and will prevent further peeling in that area of the couch or chair. Apply a thick, generous coat each time. When the finish first goes on, it will appear opaque and white, but the color will fade as the finish dries. Give each coat at least 30 minutes to dry before applying the next coat. When all the coats have dried, the repaired section will look reasonably similar to non-peeling sections of the faux leather. Fixing Faux Leather Furniture with Soft Filler Cut off the peeling faux leather with a razor blade. Before repairing the faux leather, you’ll first need to remove all of the flaking pieces. Use your fingers and a razor blade to peel, scrape, and cut away the peeling sections of faux leather from your chair or sofa. Don’t slice off more faux leather than necessary, though. Only remove what’s already loose and flaking. You can purchase 5-packs of razor blades at most hardware stores. Exercise caution when using a razor blade and never cut towards yourself. Apply leather soft filler to the peeled area with a putty knife. Scoop out a 1 inch (2.5 cm) dollop of soft filler with a putty knife. Still using the knife, smear the filler across the peeled section of the leather furniture. Smooth out the filler so that it’s a uniform thickness across the peeled section. Try not to get filler on the unpeeled sections of the faux leather. Soft filler will bond with the base fabric of the faux leather and create a new vinyl-like surface. You can purchase it at any leather store and at many craft supply stores. Push the soft filler off of the furniture seams and smooth the surface. If you happened to apply any filler to the furniture’s seams, you can use a stiff piece of paper to rub if off. Use the edge of an index or business card to push filler out of the seam. Then, run the long edge of the card over the top of the fabric you’re repairing to smooth out the layer of filler. Clearing the seams and feathering the edges of the soft filler will give the repair job a more professional look. Let the soft filler cure for 20 minutes. The filler will cure relatively quickly. It’s important that you don’t touch the filler while it’s curing. If you have small children or pets in your home, keep them out of the room with the curing filler. If you’re repairing a small chair, you could move the chair outdoors and let it sit in the sun if the weather is pleasant. This will speed up the curing process. Apply a second layer of soft filler to the patch you’re repairing. Once the first layer has dried, use your putty knife to apply a second thick layer of filler to the leather. As before, avoid spreading the filler onto undamaged parts of the faux leather. Add texture to the repair job by pressing plastic wrap against it. Tear off a 12 in (30 cm) piece of plastic wrap and warp it around your hand. Press your plastic-covered palm against the semi-dry second layer of soft filler. When you lift your hand off, the area will be slightly textured. Repeat this process until you’ve lightly textured the entire section you’re repairing. Texture will help the repaired section match the rest of the faux leather. If the surface of your faux leather furniture is completely smooth, you won’t need to add any texturing to the soft filler. In that case, you can skip this step. Apply leather paint to the repaired patch with a damp sponge. Squeeze a generous amount of leather paint onto a dampened sponge. The dollop should be about 2 inches (5.1 cm) in diameter. Then, use the sponge to smear the leather paint across the entire repaired section of the faux leather. Work in long, smooth strokes, and apply a uniformly thin coat across the section you’re repairing. Overlap the paint with the undamaged faux leather by about ⁄2 inch (1.3 cm) so that the sections blend together. You can find leather paint at any leather goods store and at many large hobby shops. Look through the store’s selection to find a color of leather paint that matches the furniture you’re repairing. If you can’t find a color of paint that matches your chair or sofa, try mixing together a shade of paint that’s slightly lighter than your furniture and 1 that’s slightly darker.",
  "sentences":[
    " Replacing Faux Leather on Shoes Sand the flaking faux leather off with 180 grit sandpaper.",
    "Before you begin any kind of repair job, you’ll first need to get all of the flaking, peeling faux leather off of the shoes.",
    "Sand the top and sides of the shoes wherever you note flakes.",
    "Sand in tight circles and be sure to apply plenty of pressure to the shoe.",
    "You can purchase sandpaper at any hardware store.",
    "Pick up at least 4 sheets for this project.",
    "Color in any discolored cracks with a marker that matches the shoes.",
    "Use a thick permanent marker and trace the tip over any parts of the shoe that appear faded or discolored once the peeling faux leather has been removed.",
    "This will improve the appearance of the shoes.",
    "So, if you’re repairing brown shoes, use a brown permanent marker.",
    "Do your best to find a marker that matches the color of the shoes.",
    "You may not be able to find a perfect match, though, unless the shoes are black.",
    "You can buy permanent markers at any office supply store and most grocery stores.",
    "Use a clean rag to rub shoe polish on the surface of the shoes.",
    "Dip a rag into a tin of shoe polish and smear it across the surface of the sanded shoe.",
    "Work in long, even strokes across the top and sides of the shoes.",
    "Be sure to apply the shoe polish evenly, so that the shoes have a uniform color across all surfaces.",
    "As with the marker, the shoe polish should match the color of the shoe.",
    "In most cases, a generic black or brown polish will be fine.",
    "You can buy shoe polish at some grocery stores and at large retailers or department stores.",
    "Paint shoe goo over the shoe with a ⁄2 inch (1.3 cm) paintbrush.",
    "Squeeze a dollop of shoe goo out onto the tops of the shoes, and use the paintbrush to smear the thick goo around.",
    "Make sure to cover every surface of the shoe, down to the seam where the fabric meets the sole.",
    "This will seal the shoes and help protect the composite fabric that underlies the faux leather.",
    "You can buy shoe goo at any shoe-supply store and at many large department stores.",
    "Let the shoe goo dry for 24 hours.",
    "To see if the thick goo is dry, tap it with a finger.",
    "If your finger comes away clean and the goo doesn’t feel wet, it’s most likely fully dry.",
    "If your finger comes away with some goo on it, give the goo another 12 hours to dry.",
    "After the shoes are dry, you can start wearing them as soon as you like.",
    "Repairing Faux Leather Furniture with Leather Paint Pull off loose bits of faux leather to clean the surface for repair.",
    "Use your fingers to pluck off any bits of faux leather that are still partially attached to the back or seat of your chair or sofa.",
    "Avoid pulling off more bits than necessary, though, as you might end up worsening the damage to the furniture.",
    "Be sure to throw these leather bits away in a garbage can; otherwise, they’ll make a mess in your home.",
    "Paint on a layer of leather paint that matches your furniture.",
    "You can find leather paint at large art stores or leather-supply stores.",
    "Dip a ⁄2 inch (1.3 cm) paintbrush into the jar of leather paint, and paint an even layer across the section of faux leather you’ve just peeled.",
    "Work in long horizontal strokes to ensure that the entire peeling area is fully covered.",
    "You can purchase leather paint at any leather goods store.",
    "It may also be available at large art supply stores.",
    "If you’re unable to find a color of leather paint that matches your sofa or chair, skip this step.",
    "Move directly to applying high-gloss finish leather paint.",
    "Give the paint at least 30 minutes to dry.",
    "If you try to apply subsequent layers of leather paint over the first before it’s completely dry, you’ll just end up smearing the layers together.",
    "To see if the paint is dry, lightly tap it with your finger.",
    "If your finger comes away clean and the paint doesn’t feel sticky, it’s dry.",
    "Apply a layer of high-gloss finish leather paint.",
    "Once the layer of leather paint has dried, you can apply high-gloss finish.",
    "As with the matte paint, dip your ⁄2 inch (1.3 cm) paintbrush into the high-gloss finish and paint a layer over the peeling section of the faux leather.",
    "Give the finish 30 minutes to dry.",
    "Finish leather paint is colorless and will seal the painted area of the couch or chair that you’re repairing.",
    "Put on 3–4 additional layers of high-gloss finish leather paint.",
    "The multiple layers of finish should hold the fabric together and will prevent further peeling in that area of the couch or chair.",
    "Apply a thick, generous coat each time.",
    "When the finish first goes on, it will appear opaque and white, but the color will fade as the finish dries.",
    "Give each coat at least 30 minutes to dry before applying the next coat.",
    "When all the coats have dried, the repaired section will look reasonably similar to non-peeling sections of the faux leather.",
    "Fixing Faux Leather Furniture with Soft Filler Cut off the peeling faux leather with a razor blade.",
    "Before repairing the faux leather, you’ll first need to remove all of the flaking pieces.",
    "Use your fingers and a razor blade to peel, scrape, and cut away the peeling sections of faux leather from your chair or sofa.",
    "Don’t slice off more faux leather than necessary, though.",
    "Only remove what’s already loose and flaking.",
    "You can purchase 5-packs of razor blades at most hardware stores.",
    "Exercise caution when using a razor blade and never cut towards yourself.",
    "Apply leather soft filler to the peeled area with a putty knife.",
    "Scoop out a 1 inch (2.5 cm) dollop of soft filler with a putty knife.",
    "Still using the knife, smear the filler across the peeled section of the leather furniture.",
    "Smooth out the filler so that it’s a uniform thickness across the peeled section.",
    "Try not to get filler on the unpeeled sections of the faux leather.",
    "Soft filler will bond with the base fabric of the faux leather and create a new vinyl-like surface.",
    "You can purchase it at any leather store and at many craft supply stores.",
    "Push the soft filler off of the furniture seams and smooth the surface.",
    "If you happened to apply any filler to the furniture’s seams, you can use a stiff piece of paper to rub if off.",
    "Use the edge of an index or business card to push filler out of the seam.",
    "Then, run the long edge of the card over the top of the fabric you’re repairing to smooth out the layer of filler.",
    "Clearing the seams and feathering the edges of the soft filler will give the repair job a more professional look.",
    "Let the soft filler cure for 20 minutes.",
    "The filler will cure relatively quickly.",
    "It’s important that you don’t touch the filler while it’s curing.",
    "If you have small children or pets in your home, keep them out of the room with the curing filler.",
    "If you’re repairing a small chair, you could move the chair outdoors and let it sit in the sun if the weather is pleasant.",
    "This will speed up the curing process.",
    "Apply a second layer of soft filler to the patch you’re repairing.",
    "Once the first layer has dried, use your putty knife to apply a second thick layer of filler to the leather.",
    "As before, avoid spreading the filler onto undamaged parts of the faux leather.",
    "Add texture to the repair job by pressing plastic wrap against it.",
    "Tear off a 12 in (30 cm) piece of plastic wrap and warp it around your hand.",
    "Press your plastic-covered palm against the semi-dry second layer of soft filler.",
    "When you lift your hand off, the area will be slightly textured.",
    "Repeat this process until you’ve lightly textured the entire section you’re repairing.",
    "Texture will help the repaired section match the rest of the faux leather.",
    "If the surface of your faux leather furniture is completely smooth, you won’t need to add any texturing to the soft filler.",
    "In that case, you can skip this step.",
    "Apply leather paint to the repaired patch with a damp sponge.",
    "Squeeze a generous amount of leather paint onto a dampened sponge.",
    "The dollop should be about 2 inches (5.1 cm) in diameter.",
    "Then, use the sponge to smear the leather paint across the entire repaired section of the faux leather.",
    "Work in long, smooth strokes, and apply a uniformly thin coat across the section you’re repairing.",
    "Overlap the paint with the undamaged faux leather by about ⁄2 inch (1.3 cm) so that the sections blend together.",
    "You can find leather paint at any leather goods store and at many large hobby shops.",
    "Look through the store’s selection to find a color of leather paint that matches the furniture you’re repairing.",
    "If you can’t find a color of paint that matches your chair or sofa, try mixing together a shade of paint that’s slightly lighter than your furniture and 1 that’s slightly darker."
  ],
  "tyn_section":[
    "180 grit sandpaper",
    "Black shoe polish",
    "Rag",
    "Black permanent marker",
    "Shoe goo",
    "1⁄2",
    "1",
    "⁄",
    "2",
    " inch (1.3 cm) paintbrush",
    "Leather paint that matches your furniture",
    "High-gloss finish leather paint",
    "Razor blade",
    "Leather soft filler",
    "Putty knife",
    "Index card",
    "Saran wrap",
    "Leather paint",
    "Damp sponge"
  ],
  "tyn_model":[
    "leather paint",
    "filler",
    "paint",
    "soft filler",
    "shoe polish",
    "marker",
    "shoe goo",
    "paintbrush",
    "high-gloss finish leather paint",
    "putty knife",
    "permanent marker",
    "high-gloss finish",
    "fabric",
    "razor blade",
    "razor",
    "plastic wrap",
    "sponge",
    "180 grit sandpaper",
    "sandpaper",
    "permanent markers",
    "leather-supply stores",
    "leather soft filler",
    "knife",
    "paper",
    "index or business card",
    "plastic-",
    "damp sponge",
    "leather goods store"
  ],
  "simple_metrics":{
    "r":0.4210526316,
    "p":0.2857142857,
    "f1":0.3404255319,
    "avg_pos":0.6071428571
  },
  "jacc_metrics_0.5":{
    "r":0.5789473684,
    "p":0.6071428571,
    "f1":0.5927099842
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6842105263,
    "p":0.75,
    "f1":0.7155963303
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5263157895,
    "p":0.3928571429,
    "f1":0.4498977505
  }
}