{
  "title":"How to Build an Arcade Cabinet",
  "url":"https://www.wikihow.com/Build-an-Arcade-Cabinet",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Furniture Fixes",
    "Furniture Makeover and Repurposing Projects"
  ],
  "methods":[
    {
      "name":"Exploring Cabinet Options and Alternatives",
      "steps":[
        {
          "headline":"Buy and assemble a pre-cut arcade cabinet kit.",
          "description":"You can find these online starting at around $500 USD. The kit should arrive with detailed assembly instructions and all the pre-cut pieces you need, usually made of MDF (an engineered wood fiberboard). Essentially, this will be like assembling any other type of boxed furniture—you’ll need lots of patience and the ability to drive in many screws. Most kits only provide the wooden shell for the cabinet, meaning you’ll still need to acquire a monitor, control panel, gaming system, etc., and install them."
        },
        {
          "headline":"Download plans with templates and cut the wood yourself.",
          "description":"Look online for detailed plans, which should include templates for the various pieces of wood needed to create the cabinet. Follow the plans to measure, mark, and cut the wood (usually a combination of dimensional lumber and MDF) to match the templates, then to assemble the cabinet with a drill and screws. At minimum, you’ll need a pair of sawhorses and a jigsaw to cut the pieces of wood properly. Make sure you wear eye protection and take other safety measures whenever you cut wood. You may be able to find plans online for free, but you’ll still need to invest in building materials and all the gaming mechanisms (monitor, control panel, etc. )."
        },
        {
          "headline":"Create your own design and build from scratch.",
          "description":"If you want complete control over the look of your arcade cabinet, first take some time to check out existing design plans online. Then, create your own design on paper and use accurate measurements to transfer your templates to sheets of MDF and pieces of dimensional lumber. After a lot of cutting, drilling, screwing, sanding, painting, and installing, you’ll have an arcade cabinet that’s uniquely yours! This type of DIY project might take a few days if you’re able to dedicate yourself fully to it, but is more likely to take several weeks or even a couple months if you’re only able to tackle it during your spare time."
        },
        {
          "headline":"Transform a standard desk into an “arcade cabinet” facsimile.",
          "description":"Basically, if you have a wood desk with a large drawer under the desktop, you can “hack” a simple form of arcade cabinet. This involves drilling holes in the desktop for installing the buttons and joysticks (or cutting a larger opening for dropping in a 2-person gaming controller), mounting the screen to the back of the desktop, and installing the gaming system and wiring everything together inside the drawer. You can find several versions of this hack online that utilize a relatively small and inexpensive desk from Ikea. Some versions even utilize an extra drawer that is installed upright on the back of the desktop to help enclose the monitor."
        }
      ]
    },
    {
      "name":"Repurposing an Old Arcade Cabinet",
      "steps":[
        {
          "headline":"Locate and buy a broken-down arcade cabinet.",
          "description":"Search on Craigslist or similar websites for people selling old arcade cabinets. Due to the decline in the number of video arcades over the past 20 years or so, it probably won't be difficult to find cabinets for sale in your area. You may be able to find a non-functional cabinet in the $100-$150 USD range. The cabinet doesn’t need to look pretty at this point, but find one that’s still structurally sound if possible."
        },
        {
          "headline":"Pull out the interior components.",
          "description":"If your arcade cabinet hasn’t already been “gutted,” remove the back panel and take out the electronics. If you have some wiring skills and would like to keep some of the original components—the speakers, the lights for the coin slots, etc.—feel free to do so. If it still works, you may want to keep and reuse the cabinet’s existing CRT monitor. However, in most cases, it’s easier to replace it with either an old CRT TV or monitor or a modern flat-screen version. The flat-screen won’t have quite the same retro feel, but it makes the whole cabinet much lighter."
        },
        {
          "headline":"Repaint the cabinet exterior.",
          "description":"Apply wood filler to any small holes or cracks, then thoroughly sand all the wood parts of the exterior with 120-220 grit sandpaper. Wipe the cabinet down with a tack cloth to remove any dust, then use painter’s tape to cover any areas you don’t want to paint. Follow this up by applying 1 coat of primer with a brush and/or roller, then finish with 2 coats of paint. For the best adhesion and durability on a wooden cabinet, choose interior latex primer and paint with a semi-gloss finish. Follow the drying times between coats listed on your chosen primer and paint. You can order vinyl decal stickers to add to your cabinet after the paint dries, or try your hand at painting your own artwork on it!"
        },
        {
          "headline":"Mount a remote-controlled power strip inside the cabinet.",
          "description":"Attach the power strip to an interior wall of the cabinet with screws or mounting tape, then drill a hole or cut a notch into the cabinet so you can feed the cord out. This way, you’ll only need one outlet to plug into in order to power all the new components inside your cabinet. By using a remote-controlled power strip, you’ll be able to turn on all the new components—gaming system, monitor, etc.—with the push of a single button. Remote-controlled power strips usually have a remote (with on/off buttons) that fits into a mountable cradle. You can mount this onto the side, top, or back of your finished cabinet."
        },
        {
          "headline":"Mount the new flat-screen monitor.",
          "description":"Cut a rectangular piece of plywood that fits over the opening left behind by the old CRT monitor. Connect one side of a TV mounting bracket to the back of your flat-screen TV or monitor with the included bolts, and the other side to the plywood with wood screws. Lay the mounted TV in place and secure the plywood into the cabinet frame with wood screws. Depending on the size of the previous CRT monitor, either a 24 in (61 cm) or 27 in (69 cm) LCD monitor with a 16:9 ratio will likely fit best. Before mounting the TV, consider painting the plywood black to make it less noticeable. Many old arcade cabinets had a plexiglass (or actual glass) panel that covered the monitor. You can reuse the existing panel (depending on its condition), cut a new sheet of plexiglass to fit, or omit the panel altogether."
        },
        {
          "headline":"Replace the control panel.",
          "description":"Depending on your skill level and the condition of the existing control panel, you may be able to salvage and rewire the current buttons, joystick, etc. However, it’s probably easier to start fresh. You can pull out the old control panel components, buy a 2-person retro-style gaming controller online, feed its USB cord into the cabinet, and attach the controller (with mounting tape or adhesive) to the steel panel that housed the former controls. Alternatively—and only if you know a decent amount about wiring—you can buy the new gaming controller, take it apart, and install its buttons and joysticks into the vacated openings in the steel control panel. You may, however, have to take the steel panel to a metal shop to have additional holes drilled or the existing ones adjusted."
        },
        {
          "headline":"Install speakers and lighting into the top section of the cabinet.",
          "description":"Above the monitor, you’ll find the section of the cabinet with the marquee that identifies the game. This is also where the speakers usually are. The easiest audio option is to lay a set of computer speakers face-down over the existing speaker holes in the cabinet, then secure them in place with mounting tape or screwed-in brackets. If you’d like the marquee to light up when you play, mount an 18 in (46 cm) fluorescent light fixture inside it and plug it into the power strip. If you also want the coin slots in the lower cabinet to light up, you might try to wire a couple small LED lights in place (depending on your wiring skills). Or, you can install another fluorescent light bar on the inside of the lower cabinet near the coin slots and let it illuminate them."
        },
        {
          "headline":"Install your gaming system(s).",
          "description":"Arcade cabinets provide plenty of interior space for one or more gaming systems. Depending on your preferences, you might install a PC, a home gaming system, or a small, single-board computer (such as the Raspberry Pi series). Follow the instructions for each for hooking them up to the monitor and joystick controls. Then, plug into the power strip and get ready to play! If you need help setting up your preferred gaming system, follow the included instructions or look online for tutorials. All told, plan to spend around $500-$1000 USD on this arcade cabinet, depending on the amount of hardware (monitor, gaming system, etc.) you already own."
        }
      ]
    },
    {
      "name":"Building a Tabletop Cabinet from Plywood",
      "steps":[
        {
          "headline":"Complete your cut list out of 0.75 in (1.9 cm)-thick plywood.",
          "description":"Use a table saw to make the cuts, and make sure to wear eye protection and follow all other saw safety precautions. You’ll fine-tune and assemble the following pieces into the tabletop arcade cabinet:\nPart A: 2 side pieces, each 18 in × 25 in (46 cm × 64 cm)\nB: marquee top, 6.75 in × 22 in (17.1 cm × 55.9 cm)\nC: monitor panel, 18 in × 22 in (46 cm × 56 cm)\nD: control panel top, 7.875 in × 22 in (20.00 cm × 55.88 cm)\nE: control panel front, 3.125 in × 22 in (7.94 cm × 55.88 cm)\nF (G): back (with cutout door), 20.75 in × 22 in (52.7 cm × 55.9 cm)\nH: marquee bottom, 4 in × 22 in (10 cm × 56 cm)\nI: bottom, 17.5 in × 22 in (44 cm × 56 cm)\nK: monitor cleat, 4 in × 22 in (10 cm × 56 cm)"
        },
        {
          "headline":"Add beveled edges to several cut pieces.",
          "description":"In order to join properly, several pieces from the cut list need bevels. Follow the instructions for your table saw to set the blade to the correct angles for the following cuts:\nB: one long edge at 57.5 deg (set saw to 32.5 deg)\nC: one long edge at 63.7 deg (set saw to 26.3 deg)\nD: one long edge at 63.7 deg (set saw to 26.3 deg), other long edge at 77.5 deg (set saw to 12.5 deg)\nE: one long edge at 77.5 deg (set saw to 12.5 deg)\nF: one long edge at 57.5 deg (set saw to 32.5 deg)"
        },
        {
          "headline":"Cut out the monitor opening in the monitor panel (part C).",
          "description":"Use a circular saw to cut a 19 in × 10.875 in (48.26 cm × 27.62 cm) rectangle out of the monitor panel, so that the cutout is 1.5 in (3.8 cm) from the sides of the panel, and 4.6875 in (11.906 cm) from the top of the panel. Then, use a drill to cut two 0.75 in (1.9 cm) holes in the top left and top right corners of the monitor panel; each hole should be 1 in (2.5 cm) from the top of the panel and 2 in (5.1 cm) from the side. The cutout above assumes a 21.5 in (55 cm) flatscreen monitor. Your cutout dimensions may vary based on the specific display you choose."
        },
        {
          "headline":"Cut the door (G) out of the back panel (F).",
          "description":"Use your circular saw and cut a 17.75 in × 14.5625 in (45.085 cm × 36.989 cm) rectangle out of the center of the back panel. The door cutout should be 3 in (7.6 cm) from the top and bottom of the back panel, and 2 in (5.1 cm) from the sides. Later, you can screw in small hinges and a latch to keep the door in place."
        },
        {
          "headline":"Cut mortises into parts B and H, and drill holes into part H. Cut a mortise that is 0.75 in (1.9 cm) deep, 0.1875 in (0.476 cm) wide, and 0.75 in (1.9 cm) set back from the long, non-beveled edge of the marquee top (B).",
          "description":"Cut the same type of mortise into one of the long edges of the marquee bottom (H). With the mortise facing down and on the top edge, drill the following holes into part H:\ntwo 1.5 in (3.8 cm) holes, each centered 1.75 in (4.4 cm) from the bottom and 4.25 in (10.8 cm) from the sides of H.\none 0.75 in (1.9 cm) hole, centered 1.75 in (4.4 cm) from the left side and 1.625 in (4.13 cm) from the bottom of H.\nThe mortises will allow the marquee (part J)—the translucent panel that identifies an arcade game, and which you can order online—to slide into place, while the large holes are speaker outputs."
        },
        {
          "headline":"Cut holes for the joysticks and buttons into the control panel top (D) and front (E).",
          "description":"The number, size, and location of the holes will depend on the type of control panel you intend to wire into your arcade cabinet. Use your chosen control panel as a template to determine the correct holes to drill into parts D and E.\nEssentially, you’ll buy a 2-person, arcade-style control panel, take it apart, install the buttons and joysticks into parts D and E, and re-wire everything back together. Alternatively, you could cut out an opening into part D that is large enough for you to drop the purchased control panel into place, then secure it (if desired) with glue or clips."
        },
        {
          "headline":"Assemble parts B through K using glue, clamps, and nails.",
          "description":"For each connection point, apply wood glue to the edges, apply several temporary clamps to hold the joint in place, and use a nail gun to shoot in several 1.75 in (4.4 cm) brad nails along the connection point. Allow the glue on each joint to dry before removing the clamps and moving onto the next connection point. It is much easier to visualize how the pieces fit together than to describe it in words. Check out the “exploded view” (page 4) at https://thewoodwhisperer.com/files/TWW-Arcade-Cabinet-V2.pdf, and follow along the assembly video at https://www.thewoodwhisperer.com/videos/bartop-arcade-raspberry-pi/."
        },
        {
          "headline":"Use assembled parts B-K to trace the outlines for the side pieces (part A).",
          "description":"Lay the assembled (but without sides) tabletop cabinet on top of one of the part A pieces of plywood. Use a pencil to trace the angular outline onto A. Lay the other side of the cabinet on the other piece of part A plywood and repeat the process. Then carefully cut out each side piece along these lines. Use a table saw for cutting, and possibly a small hand saw for some of the tighter angles. Check out the “exploded view” (page 4) at https://www.thewoodwhisperer.com/videos/bartop-arcade-raspberry-pi/ to get an idea of what your side panels will look like."
        },
        {
          "headline":"Glue and nail the side panels in place after installing your gaming system.",
          "description":"Even though you’ve added an access door (G) to the back panel (F), you won’t be able to install the monitor, gaming system, speakers, lighting, control panel, and all the associated wiring once you close up the arcade cabinet. Therefore, acquire and install these elements into the cabinet before you attach the side panels with glue, clamps, and 1.75 in (4.4 cm) brad nails. A small, single-board computer (such as Raspberry Pi) makes a great gaming system choice for this tabletop cabinet, but you may also be able to fit other types of gaming systems inside. Look for tutorials online regarding how to install a Raspberry Pi system (or other gaming system) and the other needed elements (monitor, speakers, controls, etc. )."
        }
      ]
    }
  ],
  "text":" Exploring Cabinet Options and Alternatives Buy and assemble a pre-cut arcade cabinet kit. You can find these online starting at around $500 USD. The kit should arrive with detailed assembly instructions and all the pre-cut pieces you need, usually made of MDF (an engineered wood fiberboard). Essentially, this will be like assembling any other type of boxed furniture—you’ll need lots of patience and the ability to drive in many screws. Most kits only provide the wooden shell for the cabinet, meaning you’ll still need to acquire a monitor, control panel, gaming system, etc., and install them. Download plans with templates and cut the wood yourself. Look online for detailed plans, which should include templates for the various pieces of wood needed to create the cabinet. Follow the plans to measure, mark, and cut the wood (usually a combination of dimensional lumber and MDF) to match the templates, then to assemble the cabinet with a drill and screws. At minimum, you’ll need a pair of sawhorses and a jigsaw to cut the pieces of wood properly. Make sure you wear eye protection and take other safety measures whenever you cut wood. You may be able to find plans online for free, but you’ll still need to invest in building materials and all the gaming mechanisms (monitor, control panel, etc. ). Create your own design and build from scratch. If you want complete control over the look of your arcade cabinet, first take some time to check out existing design plans online. Then, create your own design on paper and use accurate measurements to transfer your templates to sheets of MDF and pieces of dimensional lumber. After a lot of cutting, drilling, screwing, sanding, painting, and installing, you’ll have an arcade cabinet that’s uniquely yours! This type of DIY project might take a few days if you’re able to dedicate yourself fully to it, but is more likely to take several weeks or even a couple months if you’re only able to tackle it during your spare time. Transform a standard desk into an “arcade cabinet” facsimile. Basically, if you have a wood desk with a large drawer under the desktop, you can “hack” a simple form of arcade cabinet. This involves drilling holes in the desktop for installing the buttons and joysticks (or cutting a larger opening for dropping in a 2-person gaming controller), mounting the screen to the back of the desktop, and installing the gaming system and wiring everything together inside the drawer. You can find several versions of this hack online that utilize a relatively small and inexpensive desk from Ikea. Some versions even utilize an extra drawer that is installed upright on the back of the desktop to help enclose the monitor. Repurposing an Old Arcade Cabinet Locate and buy a broken-down arcade cabinet. Search on Craigslist or similar websites for people selling old arcade cabinets. Due to the decline in the number of video arcades over the past 20 years or so, it probably won't be difficult to find cabinets for sale in your area. You may be able to find a non-functional cabinet in the $100-$150 USD range. The cabinet doesn’t need to look pretty at this point, but find one that’s still structurally sound if possible. Pull out the interior components. If your arcade cabinet hasn’t already been “gutted,” remove the back panel and take out the electronics. If you have some wiring skills and would like to keep some of the original components—the speakers, the lights for the coin slots, etc.—feel free to do so. If it still works, you may want to keep and reuse the cabinet’s existing CRT monitor. However, in most cases, it’s easier to replace it with either an old CRT TV or monitor or a modern flat-screen version. The flat-screen won’t have quite the same retro feel, but it makes the whole cabinet much lighter. Repaint the cabinet exterior. Apply wood filler to any small holes or cracks, then thoroughly sand all the wood parts of the exterior with 120-220 grit sandpaper. Wipe the cabinet down with a tack cloth to remove any dust, then use painter’s tape to cover any areas you don’t want to paint. Follow this up by applying 1 coat of primer with a brush and/or roller, then finish with 2 coats of paint. For the best adhesion and durability on a wooden cabinet, choose interior latex primer and paint with a semi-gloss finish. Follow the drying times between coats listed on your chosen primer and paint. You can order vinyl decal stickers to add to your cabinet after the paint dries, or try your hand at painting your own artwork on it! Mount a remote-controlled power strip inside the cabinet. Attach the power strip to an interior wall of the cabinet with screws or mounting tape, then drill a hole or cut a notch into the cabinet so you can feed the cord out. This way, you’ll only need one outlet to plug into in order to power all the new components inside your cabinet. By using a remote-controlled power strip, you’ll be able to turn on all the new components—gaming system, monitor, etc.—with the push of a single button. Remote-controlled power strips usually have a remote (with on/off buttons) that fits into a mountable cradle. You can mount this onto the side, top, or back of your finished cabinet. Mount the new flat-screen monitor. Cut a rectangular piece of plywood that fits over the opening left behind by the old CRT monitor. Connect one side of a TV mounting bracket to the back of your flat-screen TV or monitor with the included bolts, and the other side to the plywood with wood screws. Lay the mounted TV in place and secure the plywood into the cabinet frame with wood screws. Depending on the size of the previous CRT monitor, either a 24 in (61 cm) or 27 in (69 cm) LCD monitor with a 16:9 ratio will likely fit best. Before mounting the TV, consider painting the plywood black to make it less noticeable. Many old arcade cabinets had a plexiglass (or actual glass) panel that covered the monitor. You can reuse the existing panel (depending on its condition), cut a new sheet of plexiglass to fit, or omit the panel altogether. Replace the control panel. Depending on your skill level and the condition of the existing control panel, you may be able to salvage and rewire the current buttons, joystick, etc. However, it’s probably easier to start fresh. You can pull out the old control panel components, buy a 2-person retro-style gaming controller online, feed its USB cord into the cabinet, and attach the controller (with mounting tape or adhesive) to the steel panel that housed the former controls. Alternatively—and only if you know a decent amount about wiring—you can buy the new gaming controller, take it apart, and install its buttons and joysticks into the vacated openings in the steel control panel. You may, however, have to take the steel panel to a metal shop to have additional holes drilled or the existing ones adjusted. Install speakers and lighting into the top section of the cabinet. Above the monitor, you’ll find the section of the cabinet with the marquee that identifies the game. This is also where the speakers usually are. The easiest audio option is to lay a set of computer speakers face-down over the existing speaker holes in the cabinet, then secure them in place with mounting tape or screwed-in brackets. If you’d like the marquee to light up when you play, mount an 18 in (46 cm) fluorescent light fixture inside it and plug it into the power strip. If you also want the coin slots in the lower cabinet to light up, you might try to wire a couple small LED lights in place (depending on your wiring skills). Or, you can install another fluorescent light bar on the inside of the lower cabinet near the coin slots and let it illuminate them. Install your gaming system(s). Arcade cabinets provide plenty of interior space for one or more gaming systems. Depending on your preferences, you might install a PC, a home gaming system, or a small, single-board computer (such as the Raspberry Pi series). Follow the instructions for each for hooking them up to the monitor and joystick controls. Then, plug into the power strip and get ready to play! If you need help setting up your preferred gaming system, follow the included instructions or look online for tutorials. All told, plan to spend around $500-$1000 USD on this arcade cabinet, depending on the amount of hardware (monitor, gaming system, etc.) you already own. Building a Tabletop Cabinet from Plywood Complete your cut list out of 0.75 in (1.9 cm)-thick plywood. Use a table saw to make the cuts, and make sure to wear eye protection and follow all other saw safety precautions. You’ll fine-tune and assemble the following pieces into the tabletop arcade cabinet:\nPart A: 2 side pieces, each 18 in × 25 in (46 cm × 64 cm)\nB: marquee top, 6.75 in × 22 in (17.1 cm × 55.9 cm)\nC: monitor panel, 18 in × 22 in (46 cm × 56 cm)\nD: control panel top, 7.875 in × 22 in (20.00 cm × 55.88 cm)\nE: control panel front, 3.125 in × 22 in (7.94 cm × 55.88 cm)\nF (G): back (with cutout door), 20.75 in × 22 in (52.7 cm × 55.9 cm)\nH: marquee bottom, 4 in × 22 in (10 cm × 56 cm)\nI: bottom, 17.5 in × 22 in (44 cm × 56 cm)\nK: monitor cleat, 4 in × 22 in (10 cm × 56 cm) Add beveled edges to several cut pieces. In order to join properly, several pieces from the cut list need bevels. Follow the instructions for your table saw to set the blade to the correct angles for the following cuts:\nB: one long edge at 57.5 deg (set saw to 32.5 deg)\nC: one long edge at 63.7 deg (set saw to 26.3 deg)\nD: one long edge at 63.7 deg (set saw to 26.3 deg), other long edge at 77.5 deg (set saw to 12.5 deg)\nE: one long edge at 77.5 deg (set saw to 12.5 deg)\nF: one long edge at 57.5 deg (set saw to 32.5 deg) Cut out the monitor opening in the monitor panel (part C). Use a circular saw to cut a 19 in × 10.875 in (48.26 cm × 27.62 cm) rectangle out of the monitor panel, so that the cutout is 1.5 in (3.8 cm) from the sides of the panel, and 4.6875 in (11.906 cm) from the top of the panel. Then, use a drill to cut two 0.75 in (1.9 cm) holes in the top left and top right corners of the monitor panel; each hole should be 1 in (2.5 cm) from the top of the panel and 2 in (5.1 cm) from the side. The cutout above assumes a 21.5 in (55 cm) flatscreen monitor. Your cutout dimensions may vary based on the specific display you choose. Cut the door (G) out of the back panel (F). Use your circular saw and cut a 17.75 in × 14.5625 in (45.085 cm × 36.989 cm) rectangle out of the center of the back panel. The door cutout should be 3 in (7.6 cm) from the top and bottom of the back panel, and 2 in (5.1 cm) from the sides. Later, you can screw in small hinges and a latch to keep the door in place. Cut mortises into parts B and H, and drill holes into part H. Cut a mortise that is 0.75 in (1.9 cm) deep, 0.1875 in (0.476 cm) wide, and 0.75 in (1.9 cm) set back from the long, non-beveled edge of the marquee top (B). Cut the same type of mortise into one of the long edges of the marquee bottom (H). With the mortise facing down and on the top edge, drill the following holes into part H:\ntwo 1.5 in (3.8 cm) holes, each centered 1.75 in (4.4 cm) from the bottom and 4.25 in (10.8 cm) from the sides of H.\none 0.75 in (1.9 cm) hole, centered 1.75 in (4.4 cm) from the left side and 1.625 in (4.13 cm) from the bottom of H.\nThe mortises will allow the marquee (part J)—the translucent panel that identifies an arcade game, and which you can order online—to slide into place, while the large holes are speaker outputs. Cut holes for the joysticks and buttons into the control panel top (D) and front (E). The number, size, and location of the holes will depend on the type of control panel you intend to wire into your arcade cabinet. Use your chosen control panel as a template to determine the correct holes to drill into parts D and E.\nEssentially, you’ll buy a 2-person, arcade-style control panel, take it apart, install the buttons and joysticks into parts D and E, and re-wire everything back together. Alternatively, you could cut out an opening into part D that is large enough for you to drop the purchased control panel into place, then secure it (if desired) with glue or clips. Assemble parts B through K using glue, clamps, and nails. For each connection point, apply wood glue to the edges, apply several temporary clamps to hold the joint in place, and use a nail gun to shoot in several 1.75 in (4.4 cm) brad nails along the connection point. Allow the glue on each joint to dry before removing the clamps and moving onto the next connection point. It is much easier to visualize how the pieces fit together than to describe it in words. Check out the “exploded view” (page 4) at https://thewoodwhisperer.com/files/TWW-Arcade-Cabinet-V2.pdf, and follow along the assembly video at https://www.thewoodwhisperer.com/videos/bartop-arcade-raspberry-pi/. Use assembled parts B-K to trace the outlines for the side pieces (part A). Lay the assembled (but without sides) tabletop cabinet on top of one of the part A pieces of plywood. Use a pencil to trace the angular outline onto A. Lay the other side of the cabinet on the other piece of part A plywood and repeat the process. Then carefully cut out each side piece along these lines. Use a table saw for cutting, and possibly a small hand saw for some of the tighter angles. Check out the “exploded view” (page 4) at https://www.thewoodwhisperer.com/videos/bartop-arcade-raspberry-pi/ to get an idea of what your side panels will look like. Glue and nail the side panels in place after installing your gaming system. Even though you’ve added an access door (G) to the back panel (F), you won’t be able to install the monitor, gaming system, speakers, lighting, control panel, and all the associated wiring once you close up the arcade cabinet. Therefore, acquire and install these elements into the cabinet before you attach the side panels with glue, clamps, and 1.75 in (4.4 cm) brad nails. A small, single-board computer (such as Raspberry Pi) makes a great gaming system choice for this tabletop cabinet, but you may also be able to fit other types of gaming systems inside. Look for tutorials online regarding how to install a Raspberry Pi system (or other gaming system) and the other needed elements (monitor, speakers, controls, etc. ).",
  "sentences":[
    " Exploring Cabinet Options and Alternatives Buy and assemble a pre-cut arcade cabinet kit.",
    "You can find these online starting at around $500 USD.",
    "The kit should arrive with detailed assembly instructions and all the pre-cut pieces you need, usually made of MDF (an engineered wood fiberboard).",
    "Essentially, this will be like assembling any other type of boxed furniture—you’ll need lots of patience and the ability to drive in many screws.",
    "Most kits only provide the wooden shell for the cabinet, meaning you’ll still need to acquire a monitor, control panel, gaming system, etc., and install them.",
    "Download plans with templates and cut the wood yourself.",
    "Look online for detailed plans, which should include templates for the various pieces of wood needed to create the cabinet.",
    "Follow the plans to measure, mark, and cut the wood (usually a combination of dimensional lumber and MDF) to match the templates, then to assemble the cabinet with a drill and screws.",
    "At minimum, you’ll need a pair of sawhorses and a jigsaw to cut the pieces of wood properly.",
    "Make sure you wear eye protection and take other safety measures whenever you cut wood.",
    "You may be able to find plans online for free, but you’ll still need to invest in building materials and all the gaming mechanisms (monitor, control panel, etc.",
    ").",
    "Create your own design and build from scratch.",
    "If you want complete control over the look of your arcade cabinet, first take some time to check out existing design plans online.",
    "Then, create your own design on paper and use accurate measurements to transfer your templates to sheets of MDF and pieces of dimensional lumber.",
    "After a lot of cutting, drilling, screwing, sanding, painting, and installing, you’ll have an arcade cabinet that’s uniquely yours!",
    "This type of DIY project might take a few days if you’re able to dedicate yourself fully to it, but is more likely to take several weeks or even a couple months if you’re only able to tackle it during your spare time.",
    "Transform a standard desk into an “arcade cabinet” facsimile.",
    "Basically, if you have a wood desk with a large drawer under the desktop, you can “hack” a simple form of arcade cabinet.",
    "This involves drilling holes in the desktop for installing the buttons and joysticks (or cutting a larger opening for dropping in a 2-person gaming controller), mounting the screen to the back of the desktop, and installing the gaming system and wiring everything together inside the drawer.",
    "You can find several versions of this hack online that utilize a relatively small and inexpensive desk from Ikea.",
    "Some versions even utilize an extra drawer that is installed upright on the back of the desktop to help enclose the monitor.",
    "Repurposing an Old Arcade Cabinet Locate and buy a broken-down arcade cabinet.",
    "Search on Craigslist or similar websites for people selling old arcade cabinets.",
    "Due to the decline in the number of video arcades over the past 20 years or so, it probably won't be difficult to find cabinets for sale in your area.",
    "You may be able to find a non-functional cabinet in the $100-$150 USD range.",
    "The cabinet doesn’t need to look pretty at this point, but find one that’s still structurally sound if possible.",
    "Pull out the interior components.",
    "If your arcade cabinet hasn’t already been “gutted,” remove the back panel and take out the electronics.",
    "If you have some wiring skills and would like to keep some of the original components—the speakers, the lights for the coin slots, etc.—feel free to do so.",
    "If it still works, you may want to keep and reuse the cabinet’s existing CRT monitor.",
    "However, in most cases, it’s easier to replace it with either an old CRT TV or monitor or a modern flat-screen version.",
    "The flat-screen won’t have quite the same retro feel, but it makes the whole cabinet much lighter.",
    "Repaint the cabinet exterior.",
    "Apply wood filler to any small holes or cracks, then thoroughly sand all the wood parts of the exterior with 120-220 grit sandpaper.",
    "Wipe the cabinet down with a tack cloth to remove any dust, then use painter’s tape to cover any areas you don’t want to paint.",
    "Follow this up by applying 1 coat of primer with a brush and/or roller, then finish with 2 coats of paint.",
    "For the best adhesion and durability on a wooden cabinet, choose interior latex primer and paint with a semi-gloss finish.",
    "Follow the drying times between coats listed on your chosen primer and paint.",
    "You can order vinyl decal stickers to add to your cabinet after the paint dries, or try your hand at painting your own artwork on it!",
    "Mount a remote-controlled power strip inside the cabinet.",
    "Attach the power strip to an interior wall of the cabinet with screws or mounting tape, then drill a hole or cut a notch into the cabinet so you can feed the cord out.",
    "This way, you’ll only need one outlet to plug into in order to power all the new components inside your cabinet.",
    "By using a remote-controlled power strip, you’ll be able to turn on all the new components—gaming system, monitor, etc.—with the push of a single button.",
    "Remote-controlled power strips usually have a remote (with on/off buttons) that fits into a mountable cradle.",
    "You can mount this onto the side, top, or back of your finished cabinet.",
    "Mount the new flat-screen monitor.",
    "Cut a rectangular piece of plywood that fits over the opening left behind by the old CRT monitor.",
    "Connect one side of a TV mounting bracket to the back of your flat-screen TV or monitor with the included bolts, and the other side to the plywood with wood screws.",
    "Lay the mounted TV in place and secure the plywood into the cabinet frame with wood screws.",
    "Depending on the size of the previous CRT monitor, either a 24 in (61 cm) or 27 in (69 cm) LCD monitor with a 16:9 ratio will likely fit best.",
    "Before mounting the TV, consider painting the plywood black to make it less noticeable.",
    "Many old arcade cabinets had a plexiglass (or actual glass) panel that covered the monitor.",
    "You can reuse the existing panel (depending on its condition), cut a new sheet of plexiglass to fit, or omit the panel altogether.",
    "Replace the control panel.",
    "Depending on your skill level and the condition of the existing control panel, you may be able to salvage and rewire the current buttons, joystick, etc.",
    "However, it’s probably easier to start fresh.",
    "You can pull out the old control panel components, buy a 2-person retro-style gaming controller online, feed its USB cord into the cabinet, and attach the controller (with mounting tape or adhesive) to the steel panel that housed the former controls.",
    "Alternatively—and only if you know a decent amount about wiring—you can buy the new gaming controller, take it apart, and install its buttons and joysticks into the vacated openings in the steel control panel.",
    "You may, however, have to take the steel panel to a metal shop to have additional holes drilled or the existing ones adjusted.",
    "Install speakers and lighting into the top section of the cabinet.",
    "Above the monitor, you’ll find the section of the cabinet with the marquee that identifies the game.",
    "This is also where the speakers usually are.",
    "The easiest audio option is to lay a set of computer speakers face-down over the existing speaker holes in the cabinet, then secure them in place with mounting tape or screwed-in brackets.",
    "If you’d like the marquee to light up when you play, mount an 18 in (46 cm) fluorescent light fixture inside it and plug it into the power strip.",
    "If you also want the coin slots in the lower cabinet to light up, you might try to wire a couple small LED lights in place (depending on your wiring skills).",
    "Or, you can install another fluorescent light bar on the inside of the lower cabinet near the coin slots and let it illuminate them.",
    "Install your gaming system(s).",
    "Arcade cabinets provide plenty of interior space for one or more gaming systems.",
    "Depending on your preferences, you might install a PC, a home gaming system, or a small, single-board computer (such as the Raspberry Pi series).",
    "Follow the instructions for each for hooking them up to the monitor and joystick controls.",
    "Then, plug into the power strip and get ready to play!",
    "If you need help setting up your preferred gaming system, follow the included instructions or look online for tutorials.",
    "All told, plan to spend around $500-$1000 USD on this arcade cabinet, depending on the amount of hardware (monitor, gaming system, etc.)",
    "you already own.",
    "Building a Tabletop Cabinet from Plywood Complete your cut list out of 0.75 in (1.9 cm)-thick plywood.",
    "Use a table saw to make the cuts, and make sure to wear eye protection and follow all other saw safety precautions.",
    "You’ll fine-tune and assemble the following pieces into the tabletop arcade cabinet:\nPart A: 2 side pieces, each 18 in × 25 in (46 cm × 64 cm)\nB: marquee top, 6.75 in × 22 in (17.1 cm × 55.9 cm)\nC: monitor panel, 18 in × 22 in (46 cm × 56 cm)\nD: control panel top, 7.875 in × 22 in (20.00 cm × 55.88 cm)\nE: control panel front, 3.125 in × 22 in (7.94 cm × 55.88 cm)\nF (G): back (with cutout door), 20.75 in × 22 in (52.7 cm × 55.9 cm)\nH: marquee bottom, 4 in × 22 in (10 cm × 56 cm)\nI: bottom, 17.5 in × 22 in (44 cm × 56 cm)\nK: monitor cleat, 4 in × 22 in (10 cm × 56 cm) Add beveled edges to several cut pieces.",
    "In order to join properly, several pieces from the cut list need bevels.",
    "Follow the instructions for your table saw to set the blade to the correct angles for the following cuts:\nB: one long edge at 57.5 deg (set saw to 32.5 deg)\nC: one long edge at 63.7 deg (set saw to 26.3 deg)\nD: one long edge at 63.7 deg (set saw to 26.3 deg), other long edge at 77.5 deg (set saw to 12.5 deg)\nE: one long edge at 77.5 deg (set saw to 12.5 deg)\nF: one long edge at 57.5 deg (set saw to 32.5 deg) Cut out the monitor opening in the monitor panel (part C).",
    "Use a circular saw to cut a 19 in × 10.875 in (48.26 cm × 27.62 cm) rectangle out of the monitor panel, so that the cutout is 1.5 in (3.8 cm) from the sides of the panel, and 4.6875 in (11.906 cm) from the top of the panel.",
    "Then, use a drill to cut two 0.75 in (1.9 cm) holes in the top left and top right corners of the monitor panel; each hole should be 1 in (2.5 cm) from the top of the panel and 2 in (5.1 cm) from the side.",
    "The cutout above assumes a 21.5 in (55 cm) flatscreen monitor.",
    "Your cutout dimensions may vary based on the specific display you choose.",
    "Cut the door (G) out of the back panel (F).",
    "Use your circular saw and cut a 17.75 in × 14.5625 in (45.085 cm × 36.989 cm) rectangle out of the center of the back panel.",
    "The door cutout should be 3 in (7.6 cm) from the top and bottom of the back panel, and 2 in (5.1 cm) from the sides.",
    "Later, you can screw in small hinges and a latch to keep the door in place.",
    "Cut mortises into parts B and H, and drill holes into part H. Cut a mortise that is 0.75 in (1.9 cm) deep, 0.1875 in (0.476 cm) wide, and 0.75 in (1.9 cm) set back from the long, non-beveled edge of the marquee top (B).",
    "Cut the same type of mortise into one of the long edges of the marquee bottom (H).",
    "With the mortise facing down and on the top edge, drill the following holes into part H:\ntwo 1.5 in (3.8 cm) holes, each centered 1.75 in (4.4 cm) from the bottom and 4.25 in (10.8 cm) from the sides of H.\none 0.75 in (1.9 cm) hole, centered 1.75 in (4.4 cm) from the left side and 1.625 in (4.13 cm) from the bottom of H.\nThe mortises will allow the marquee (part J)—the translucent panel that identifies an arcade game, and which you can order online—to slide into place, while the large holes are speaker outputs.",
    "Cut holes for the joysticks and buttons into the control panel top (D) and front (E).",
    "The number, size, and location of the holes will depend on the type of control panel you intend to wire into your arcade cabinet.",
    "Use your chosen control panel as a template to determine the correct holes to drill into parts D and E.\nEssentially, you’ll buy a 2-person, arcade-style control panel, take it apart, install the buttons and joysticks into parts D and E, and re-wire everything back together.",
    "Alternatively, you could cut out an opening into part D that is large enough for you to drop the purchased control panel into place, then secure it (if desired) with glue or clips.",
    "Assemble parts B through K using glue, clamps, and nails.",
    "For each connection point, apply wood glue to the edges, apply several temporary clamps to hold the joint in place, and use a nail gun to shoot in several 1.75 in (4.4 cm) brad nails along the connection point.",
    "Allow the glue on each joint to dry before removing the clamps and moving onto the next connection point.",
    "It is much easier to visualize how the pieces fit together than to describe it in words.",
    "Check out the “exploded view” (page 4) at https://thewoodwhisperer.com/files/TWW-Arcade-Cabinet-V2.pdf, and follow along the assembly video at https://www.thewoodwhisperer.com/videos/bartop-arcade-raspberry-pi/.",
    "Use assembled parts B-K to trace the outlines for the side pieces (part A).",
    "Lay the assembled (but without sides) tabletop cabinet on top of one of the part A pieces of plywood.",
    "Use a pencil to trace the angular outline onto A.",
    "Lay the other side of the cabinet on the other piece of part A plywood and repeat the process.",
    "Then carefully cut out each side piece along these lines.",
    "Use a table saw for cutting, and possibly a small hand saw for some of the tighter angles.",
    "Check out the “exploded view” (page 4) at https://www.thewoodwhisperer.com/videos/bartop-arcade-raspberry-pi/ to get an idea of what your side panels will look like.",
    "Glue and nail the side panels in place after installing your gaming system.",
    "Even though you’ve added an access door (G) to the back panel (F), you won’t be able to install the monitor, gaming system, speakers, lighting, control panel, and all the associated wiring once you close up the arcade cabinet.",
    "Therefore, acquire and install these elements into the cabinet before you attach the side panels with glue, clamps, and 1.75 in (4.4 cm) brad nails.",
    "A small, single-board computer (such as Raspberry Pi) makes a great gaming system choice for this tabletop cabinet, but you may also be able to fit other types of gaming systems inside.",
    "Look for tutorials online regarding how to install a Raspberry Pi system (or other gaming system) and the other needed elements (monitor, speakers, controls, etc.",
    ")."
  ],
  "tyn_section":[
    "Empty arcade cabinet",
    "120-220 grit sandpaper",
    "Primer, paint, and brushes",
    "CRT or flat-screen monitor",
    "2-person gaming controller",
    "Gaming system(s) of your choice",
    "Speakers",
    "Accent lighting (optional)",
    "Remote-controlled power strip",
    "One 4 ft × 8 ft (1.2 m × 2.4 m) sheet of 0.75 in (1.9 cm) plywood",
    "Table saw",
    "Drill",
    "Nail gun with 1.75 in (4.4 cm) brad nails",
    "Wood glue",
    "Clamps",
    "Router",
    "Electronics components (gaming system, monitor, controls, etc.) of your choice"
  ],
  "tyn_model":[
    "× 22",
    "plywood",
    "arcade cabinet",
    "saw",
    "control panel",
    "glue",
    "paint",
    "speakers",
    "× 56",
    "screws",
    "drill",
    "crt monitor",
    "monitor",
    "raspberry pi",
    "table saw",
    "dimensional lumber",
    "primer",
    "remote-controlled power strip",
    "wood screws",
    "tv",
    "tabletop cabinet",
    "× 55.9",
    "× 55.88",
    "circular saw",
    "mortise",
    "nails",
    "“exploded",
    "” (",
    "engineered wood fiberboard",
    "—you’ll",
    "sawhorses",
    "jigsaw",
    "“arcade cabinet",
    "” facsimile",
    "“hack",
    "” a",
    "desk",
    "cabinets",
    "“gutted",
    "” remove",
    "—the",
    "crt tv",
    "wood filler",
    "120-220 grit sandpaper",
    "painter’s tape",
    "interior latex primer",
    "vinyl decal stickers",
    "—gaming",
    "remote-controlled power strips",
    "flat-screen monitor",
    "flat-screen tv",
    "—and",
    "—you",
    "gaming controller",
    "fluorescent light fixture",
    "fluorescent light bar",
    "gaming system",
    "× 25",
    "× 64",
    "monitor panel",
    "monitor cleat",
    "× 10.875",
    "× 27.62",
    "flatscreen monitor",
    "× 14.5625",
    "× 36.989",
    "mortises",
    "—to",
    "speaker",
    "buttons",
    "wood glue",
    "nail gun",
    "pencil"
  ],
  "simple_metrics":{
    "r":0.3529411765,
    "p":0.0821917808,
    "f1":0.1333333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5294117647,
    "p":0.1780821918,
    "f1":0.2665148064
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5294117647,
    "p":0.2191780822,
    "f1":0.3100107643
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4705882353,
    "p":0.1095890411,
    "f1":0.1777777778
  }
}