{
  "title":"How to Cook Chinese Rice",
  "url":"https://www.wikihow.com/Cook-Chinese-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "parts":[
    {
      "name":"Cooking the Rice",
      "steps":[
        {
          "headline":"Rinse the rice.",
          "description":"Measure out the amount of rice you would like to use with a measuring cup. Place the rice in a bowl or saucepan and place the it in your sink. Run cool water over the rice until it is one inch above the rice line. Stir the rice with your hand or a wooden spoon. Drain the water from the saucepan and repeat until the water is clear."
        },
        {
          "headline":"Add rice to a saucepan.",
          "description":"If you did not already use a saucepan to rinse the rice, add the rice to a 3-quart saucepan. It should be large enough to accommodate the rice plus double the amount of water. For example, if you measured out one cup of rice, you will use two cups of water. If you used three cups of rice, you will use six cups of water, and so on."
        },
        {
          "headline":"Bring the rice to a boil.",
          "description":"Stir occasionally as you wait for the rice to boil. Once it boils, turn the heat down to the lowest heat possible and cover the pan with a lid."
        },
        {
          "headline":"Simmer on low heat for 10-15 minutes.",
          "description":"There is no need to stir or open the lid. Doing so will allow steam to escape, thus affecting how well the rice will cook. Check the rice sparingly or use a pan with a clear lid to check its progress."
        },
        {
          "headline":"Set the rice aside.",
          "description":"Once the 10-15 minutes are up, open the lid and use a fork to fluff up the rice. Place the cooked rice in a bowl until you are ready to use it later."
        }
      ]
    },
    {
      "name":"Preparing the Vegetables",
      "steps":[
        {
          "headline":"Chop up an onion.",
          "description":"Chinese rice generally uses white onion, as it has a mild flavor that blends well with rest of the ingredients. Grab a cutting board and sharp chef’s knife to cut up your vegetables. When you are finished chopping the onions, set them aside to use later. Slice half an inch off the top of the onion and discard it. Rest the onion on the flat surface you just created and cut it in half vertically. Peel and discard the papery skin. You may also discard the outer layer if need be. Lay the onion half flat on the cutting board and hold the root end, which will face away from you. Make vertical cuts into the onion, taking care to leave half an inch near the root. You can make the cuts wider since Chinese rice generally uses larger bits of onion. Rotate the onion and begin cutting through it again, perpendicular to the first lines you sliced. As you cut, you will see that the pieces are perfectly chopped and the root end is holding the slices intact, thus making chopping easier. When you get close to the root end, simply discard it."
        },
        {
          "headline":"Slice the red bell peppers.",
          "description":"It is important use red bell peppers, as they have a distinct flavor profile that resonates well with fried rice. Rinse off your cutting board and grab your chef’s knife to begin cutting the red bell peppers that will be added to your rice. Cut off the top of the pepper. Pull out the seeds and the fibrous white bits. Lay the pepper on the cutting board with the cut top down. Slice through the middle. Cut the pepper into thin strips lengthwise. You can make these strips about half an inch thick for Chinese rice or whatever is your preference."
        },
        {
          "headline":"Cook the broccoli.",
          "description":"If you would like to add broccoli to your Chinese rice, you may need to saute it in a pan until it is slightly soft. Broccoli takes a bit longer to cook than onions and peppers. This will ensure that the broccoli is soft when you are ready to cook with it and that your other vegetables won’t burn while you wait for it to soften. Place a skillet on medium heat. Add enough vegetable oil so that it lightly coats the bottom of the pan. Avoid using more than what will simply coat the surface of the pan. Add broccoli and stir occasionally with a wooden spoon. When it has softened a bit, add to a bowl and set aside."
        },
        {
          "headline":"Combine all of the chopped vegetables in a bowl.",
          "description":"Set the bowl aside until you are ready to begin sauteing them."
        }
      ]
    },
    {
      "name":"Cooking Scrambled Eggs",
      "steps":[
        {
          "headline":"Beat egg mixture until smooth.",
          "description":"Combine 4 eggs, ¼ cup of milk, either full fat milk or 2% (it will thicken the mixture more effectively than skim milk), and salt into a small or medium-sized bowl. Use a fork or whisk to beat the mixture until it is blended and smooth. Adding milk is optional. This is suggested for thickening the mixture but is not necessary."
        },
        {
          "headline":"Heat 2 tablespoons of butter.",
          "description":"Place a medium to large size skillet on the stove and turn the heat to medium. Let the butter melt as the skillet heats up."
        },
        {
          "headline":"Add the egg mixture to the hot skillet.",
          "description":"Allow the eggs to set until you can see that the bottom of the mixture is a bit more solid. Use a wooden spoon to break up the mixture into pieces and stir the eggs around."
        },
        {
          "headline":"Set the eggs aside in a bowl until you are ready to use them.",
          "description":"The eggs will no longer be runny when they are finished cooking. After they have cooked, scoop them into a bowl and set it aside."
        }
      ]
    },
    {
      "name":"Sauteing the Ingredients",
      "steps":[
        {
          "headline":"Turn your stove burner to medium.",
          "description":"You do not want it to be too hot or else you will burn your ingredients before it has a chance to cook."
        },
        {
          "headline":"Place a large skillet with high edges or a wok onto the burner.",
          "description":"A wok is the best choice for cooking Chinese rice since its curved shape and high sides allow food to be cooked more evenly. This is because any food that takes longer to cook can go at the bottom of the wok where it is the hottest before adding the rest of the food that doesn’t take as long to cook."
        },
        {
          "headline":"Add vegetable oil to the pan or wok.",
          "description":"If you’re using a wok, you won’t need to use as much oil. A skillet will require more oil, as it has a wider surface at the bottom compared to a wok."
        },
        {
          "headline":"Add in the vegetables.",
          "description":"As the wok or skillet is heating up, add onions, peppers and broccoli. Stir the vegetables frequently so that they do not end up burning."
        },
        {
          "headline":"Pour in the eggs and rice.",
          "description":"After the vegetables have been browning for about two minutes, add the eggs and rice. Stir it around as soon as you add it and stir the mixture frequently."
        },
        {
          "headline":"Add soy sauce.",
          "description":"After you have poured the rice in the pan, pour about 1/2 a cup of soy sauce and mix everything up. You may need to adjust how much soy sauce you add depending on the amount of rice you used and your taste preferences. Generally speaking, you may add a quarter cup of soy sauce for every cup of cooked rice you are adding to the pan."
        },
        {
          "headline":"Stir frequently.",
          "description":"Keep mixing everything together until you see that the rice has gone from white to a brownish color, due to the use of soy sauce, and that the onions and peppers have fully cooked."
        },
        {
          "headline":"Serve the Chinese rice.",
          "description":"Some people put it into a small round bowl, then flip the bowl upside-down onto the plate so the rice is served in a neat mound. You can serve this dish with either a fork or chopsticks, which can be found at grocery stores. Try serving Chinese rice with stir-fried vegetables or cooked chicken."
        }
      ]
    }
  ],
  "text":" Cooking the Rice Rinse the rice. Measure out the amount of rice you would like to use with a measuring cup. Place the rice in a bowl or saucepan and place the it in your sink. Run cool water over the rice until it is one inch above the rice line. Stir the rice with your hand or a wooden spoon. Drain the water from the saucepan and repeat until the water is clear. Add rice to a saucepan. If you did not already use a saucepan to rinse the rice, add the rice to a 3-quart saucepan. It should be large enough to accommodate the rice plus double the amount of water. For example, if you measured out one cup of rice, you will use two cups of water. If you used three cups of rice, you will use six cups of water, and so on. Bring the rice to a boil. Stir occasionally as you wait for the rice to boil. Once it boils, turn the heat down to the lowest heat possible and cover the pan with a lid. Simmer on low heat for 10-15 minutes. There is no need to stir or open the lid. Doing so will allow steam to escape, thus affecting how well the rice will cook. Check the rice sparingly or use a pan with a clear lid to check its progress. Set the rice aside. Once the 10-15 minutes are up, open the lid and use a fork to fluff up the rice. Place the cooked rice in a bowl until you are ready to use it later. Preparing the Vegetables Chop up an onion. Chinese rice generally uses white onion, as it has a mild flavor that blends well with rest of the ingredients. Grab a cutting board and sharp chef’s knife to cut up your vegetables. When you are finished chopping the onions, set them aside to use later. Slice half an inch off the top of the onion and discard it. Rest the onion on the flat surface you just created and cut it in half vertically. Peel and discard the papery skin. You may also discard the outer layer if need be. Lay the onion half flat on the cutting board and hold the root end, which will face away from you. Make vertical cuts into the onion, taking care to leave half an inch near the root. You can make the cuts wider since Chinese rice generally uses larger bits of onion. Rotate the onion and begin cutting through it again, perpendicular to the first lines you sliced. As you cut, you will see that the pieces are perfectly chopped and the root end is holding the slices intact, thus making chopping easier. When you get close to the root end, simply discard it. Slice the red bell peppers. It is important use red bell peppers, as they have a distinct flavor profile that resonates well with fried rice. Rinse off your cutting board and grab your chef’s knife to begin cutting the red bell peppers that will be added to your rice. Cut off the top of the pepper. Pull out the seeds and the fibrous white bits. Lay the pepper on the cutting board with the cut top down. Slice through the middle. Cut the pepper into thin strips lengthwise. You can make these strips about half an inch thick for Chinese rice or whatever is your preference. Cook the broccoli. If you would like to add broccoli to your Chinese rice, you may need to saute it in a pan until it is slightly soft. Broccoli takes a bit longer to cook than onions and peppers. This will ensure that the broccoli is soft when you are ready to cook with it and that your other vegetables won’t burn while you wait for it to soften. Place a skillet on medium heat. Add enough vegetable oil so that it lightly coats the bottom of the pan. Avoid using more than what will simply coat the surface of the pan. Add broccoli and stir occasionally with a wooden spoon. When it has softened a bit, add to a bowl and set aside. Combine all of the chopped vegetables in a bowl. Set the bowl aside until you are ready to begin sauteing them. Cooking Scrambled Eggs Beat egg mixture until smooth. Combine 4 eggs, ¼ cup of milk, either full fat milk or 2% (it will thicken the mixture more effectively than skim milk), and salt into a small or medium-sized bowl. Use a fork or whisk to beat the mixture until it is blended and smooth. Adding milk is optional. This is suggested for thickening the mixture but is not necessary. Heat 2 tablespoons of butter. Place a medium to large size skillet on the stove and turn the heat to medium. Let the butter melt as the skillet heats up. Add the egg mixture to the hot skillet. Allow the eggs to set until you can see that the bottom of the mixture is a bit more solid. Use a wooden spoon to break up the mixture into pieces and stir the eggs around. Set the eggs aside in a bowl until you are ready to use them. The eggs will no longer be runny when they are finished cooking. After they have cooked, scoop them into a bowl and set it aside. Sauteing the Ingredients Turn your stove burner to medium. You do not want it to be too hot or else you will burn your ingredients before it has a chance to cook. Place a large skillet with high edges or a wok onto the burner. A wok is the best choice for cooking Chinese rice since its curved shape and high sides allow food to be cooked more evenly. This is because any food that takes longer to cook can go at the bottom of the wok where it is the hottest before adding the rest of the food that doesn’t take as long to cook. Add vegetable oil to the pan or wok. If you’re using a wok, you won’t need to use as much oil. A skillet will require more oil, as it has a wider surface at the bottom compared to a wok. Add in the vegetables. As the wok or skillet is heating up, add onions, peppers and broccoli. Stir the vegetables frequently so that they do not end up burning. Pour in the eggs and rice. After the vegetables have been browning for about two minutes, add the eggs and rice. Stir it around as soon as you add it and stir the mixture frequently. Add soy sauce. After you have poured the rice in the pan, pour about 1/2 a cup of soy sauce and mix everything up. You may need to adjust how much soy sauce you add depending on the amount of rice you used and your taste preferences. Generally speaking, you may add a quarter cup of soy sauce for every cup of cooked rice you are adding to the pan. Stir frequently. Keep mixing everything together until you see that the rice has gone from white to a brownish color, due to the use of soy sauce, and that the onions and peppers have fully cooked. Serve the Chinese rice. Some people put it into a small round bowl, then flip the bowl upside-down onto the plate so the rice is served in a neat mound. You can serve this dish with either a fork or chopsticks, which can be found at grocery stores. Try serving Chinese rice with stir-fried vegetables or cooked chicken.",
  "sentences":[
    " Cooking the Rice Rinse the rice.",
    "Measure out the amount of rice you would like to use with a measuring cup.",
    "Place the rice in a bowl or saucepan and place the it in your sink.",
    "Run cool water over the rice until it is one inch above the rice line.",
    "Stir the rice with your hand or a wooden spoon.",
    "Drain the water from the saucepan and repeat until the water is clear.",
    "Add rice to a saucepan.",
    "If you did not already use a saucepan to rinse the rice, add the rice to a 3-quart saucepan.",
    "It should be large enough to accommodate the rice plus double the amount of water.",
    "For example, if you measured out one cup of rice, you will use two cups of water.",
    "If you used three cups of rice, you will use six cups of water, and so on.",
    "Bring the rice to a boil.",
    "Stir occasionally as you wait for the rice to boil.",
    "Once it boils, turn the heat down to the lowest heat possible and cover the pan with a lid.",
    "Simmer on low heat for 10-15 minutes.",
    "There is no need to stir or open the lid.",
    "Doing so will allow steam to escape, thus affecting how well the rice will cook.",
    "Check the rice sparingly or use a pan with a clear lid to check its progress.",
    "Set the rice aside.",
    "Once the 10-15 minutes are up, open the lid and use a fork to fluff up the rice.",
    "Place the cooked rice in a bowl until you are ready to use it later.",
    "Preparing the Vegetables Chop up an onion.",
    "Chinese rice generally uses white onion, as it has a mild flavor that blends well with rest of the ingredients.",
    "Grab a cutting board and sharp chef’s knife to cut up your vegetables.",
    "When you are finished chopping the onions, set them aside to use later.",
    "Slice half an inch off the top of the onion and discard it.",
    "Rest the onion on the flat surface you just created and cut it in half vertically.",
    "Peel and discard the papery skin.",
    "You may also discard the outer layer if need be.",
    "Lay the onion half flat on the cutting board and hold the root end, which will face away from you.",
    "Make vertical cuts into the onion, taking care to leave half an inch near the root.",
    "You can make the cuts wider since Chinese rice generally uses larger bits of onion.",
    "Rotate the onion and begin cutting through it again, perpendicular to the first lines you sliced.",
    "As you cut, you will see that the pieces are perfectly chopped and the root end is holding the slices intact, thus making chopping easier.",
    "When you get close to the root end, simply discard it.",
    "Slice the red bell peppers.",
    "It is important use red bell peppers, as they have a distinct flavor profile that resonates well with fried rice.",
    "Rinse off your cutting board and grab your chef’s knife to begin cutting the red bell peppers that will be added to your rice.",
    "Cut off the top of the pepper.",
    "Pull out the seeds and the fibrous white bits.",
    "Lay the pepper on the cutting board with the cut top down.",
    "Slice through the middle.",
    "Cut the pepper into thin strips lengthwise.",
    "You can make these strips about half an inch thick for Chinese rice or whatever is your preference.",
    "Cook the broccoli.",
    "If you would like to add broccoli to your Chinese rice, you may need to saute it in a pan until it is slightly soft.",
    "Broccoli takes a bit longer to cook than onions and peppers.",
    "This will ensure that the broccoli is soft when you are ready to cook with it and that your other vegetables won’t burn while you wait for it to soften.",
    "Place a skillet on medium heat.",
    "Add enough vegetable oil so that it lightly coats the bottom of the pan.",
    "Avoid using more than what will simply coat the surface of the pan.",
    "Add broccoli and stir occasionally with a wooden spoon.",
    "When it has softened a bit, add to a bowl and set aside.",
    "Combine all of the chopped vegetables in a bowl.",
    "Set the bowl aside until you are ready to begin sauteing them.",
    "Cooking Scrambled Eggs Beat egg mixture until smooth.",
    "Combine 4 eggs, ¼ cup of milk, either full fat milk or 2% (it will thicken the mixture more effectively than skim milk), and salt into a small or medium-sized bowl.",
    "Use a fork or whisk to beat the mixture until it is blended and smooth.",
    "Adding milk is optional.",
    "This is suggested for thickening the mixture but is not necessary.",
    "Heat 2 tablespoons of butter.",
    "Place a medium to large size skillet on the stove and turn the heat to medium.",
    "Let the butter melt as the skillet heats up.",
    "Add the egg mixture to the hot skillet.",
    "Allow the eggs to set until you can see that the bottom of the mixture is a bit more solid.",
    "Use a wooden spoon to break up the mixture into pieces and stir the eggs around.",
    "Set the eggs aside in a bowl until you are ready to use them.",
    "The eggs will no longer be runny when they are finished cooking.",
    "After they have cooked, scoop them into a bowl and set it aside.",
    "Sauteing the Ingredients Turn your stove burner to medium.",
    "You do not want it to be too hot or else you will burn your ingredients before it has a chance to cook.",
    "Place a large skillet with high edges or a wok onto the burner.",
    "A wok is the best choice for cooking Chinese rice since its curved shape and high sides allow food to be cooked more evenly.",
    "This is because any food that takes longer to cook can go at the bottom of the wok where it is the hottest before adding the rest of the food that doesn’t take as long to cook.",
    "Add vegetable oil to the pan or wok.",
    "If you’re using a wok, you won’t need to use as much oil.",
    "A skillet will require more oil, as it has a wider surface at the bottom compared to a wok.",
    "Add in the vegetables.",
    "As the wok or skillet is heating up, add onions, peppers and broccoli.",
    "Stir the vegetables frequently so that they do not end up burning.",
    "Pour in the eggs and rice.",
    "After the vegetables have been browning for about two minutes, add the eggs and rice.",
    "Stir it around as soon as you add it and stir the mixture frequently.",
    "Add soy sauce.",
    "After you have poured the rice in the pan, pour about 1/2 a cup of soy sauce and mix everything up.",
    "You may need to adjust how much soy sauce you add depending on the amount of rice you used and your taste preferences.",
    "Generally speaking, you may add a quarter cup of soy sauce for every cup of cooked rice you are adding to the pan.",
    "Stir frequently.",
    "Keep mixing everything together until you see that the rice has gone from white to a brownish color, due to the use of soy sauce, and that the onions and peppers have fully cooked.",
    "Serve the Chinese rice.",
    "Some people put it into a small round bowl, then flip the bowl upside-down onto the plate so the rice is served in a neat mound.",
    "You can serve this dish with either a fork or chopsticks, which can be found at grocery stores.",
    "Try serving Chinese rice with stir-fried vegetables or cooked chicken."
  ],
  "tyn_section":[
    "Large pan or wok",
    "Cutting board",
    "Chef’s knife"
  ],
  "tyn_model":[
    "rice",
    "bowl",
    "eggs",
    "onion",
    "wok",
    "water",
    "broccoli",
    "skillet",
    "soy sauce",
    "pan",
    "onions",
    "wooden spoon",
    "saucepan",
    "fork",
    "vegetables",
    "red bell peppers",
    "pepper",
    "peppers",
    "cutting board",
    "chef’s knife",
    "chinese rice",
    "vegetable oil",
    "milk",
    "butter",
    "oil",
    "measuring cup",
    "bowl or saucepan",
    "3-quart saucepan",
    "white onion",
    "full fat milk",
    "skim milk",
    "salt",
    "whisk",
    "stove",
    "egg",
    "stove burner",
    "large skillet",
    "plate"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.0526315789,
    "f1":0.0975609756,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.0526315789,
    "f1":0.0975609756
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.0526315789,
    "f1":0.0975609756
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.0526315789,
    "f1":0.0975609756
  }
}