{
  "title":"How to Make Thick Slime",
  "url":"https://www.wikihow.com/Make-Thick-Slime",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Putty Dough and Slime"
  ],
  "methods":[
    {
      "name":"Using Borax to Thicken up Basic Slime",
      "steps":[
        {
          "headline":"Combine 1 tablespoon of Borax with 1 cup (240 mL) of water.",
          "description":"Run the water into a measuring cup until you have exactly 1 cup (240 mL). Add the Borax powder to the water, then stir the mixture until the powder dissolves completely. Set the Borax solution aside. The Borax is the “activator” for your slime, causing the glue to go from a sticky liquid to a spongy semi-solid goo that retains its shape when squished, squeezed, and stretched. If you don’t want to use Borax, you can also substitute an equal amount of a contact lens solution containing boric acid, which will create a similar chemical reaction when combined with the glue. There's no need to mix contact lens solution with water since it's already a liquid. Adding 1–2 tablespoons (15–30 mL) can make your slime a little stretchier, though."
        },
        {
          "headline":"Pour 4–8  fl oz (120–240 mL) of PVA glue into a large mixing bowl.",
          "description":"Be sure to keep your glue separate from the Borax solution for now. The glue will serve as the base for your slime, so use as much as you like. If you only want a handful of slime to play with, 4 fluid ounces (120 mL) or so should be plenty. If you want to make enough to keep both hands busy, start with 6–8 fluid ounces (180–240 mL). Instead of buying multiple small bottles, pick up one big bottle and use as much as you think is necessary. Only use plain white or clear PVA glue, like the kind used for school projects. No other type of glue will work for making thick slime."
        },
        {
          "headline":"Add an equal amount of water to the glue.",
          "description":"Measure out the water and pour it directly on top of the glue in your mixing bowl. You need to use a 1:1 ratio of water to glue to make sure that your slime comes out with the right texture. If you used an entire bottle of glue, an easy way to ensure that you’re getting the right amount of water is to refill the bottle under the faucet, shake it up, then add it to the glue. Make sure you add just the right amount of water. Too little moisture could cause your finished slime to turn out dry and cakey, while too much could make it thinner than you’d like."
        },
        {
          "headline":"Squeeze food coloring into the mixture if you want to change its color.",
          "description":"Add about 4-6 drops for every 4 fluid ounces (120 mL) of glue you use. A little bit of food coloring goes a long way, so be careful not to overdo it. Green, blue, purple, pink, and yellow are all good colors for gooey, rubbery slime. This is also the best time to mix in glitter, plastic stars, miniature styrofoam balls, hand lotion, or any other additives you wish to incorporate. Use only about ¼-½ cup (75-150 g) of each to avoid throwing off the texture of your slime. If you decide not to add food coloring, your slime will end up being a plain white color (or transparent, if you opted for clear glue)."
        },
        {
          "headline":"Mix the ingredients together thoroughly.",
          "description":"Stir the glue, water, and food coloring from the bottom until the food coloring is evenly distributed throughout. You can either use your hand to do this or grab a spatula or large spoon if you don’t want to get messy."
        },
        {
          "headline":"Add a small amount of activator solution to your ingredients.",
          "description":"Drizzle a splash of Borax or contact lens solution into your slime mixture. Then, grab your spoon or spatula and stir it into your other ingredients. You should notice your slime starting to set up right away. Try not to add more than 2–3 fluid ounces (59–89 mL) of activator solution at a time. If your slime is too wet, it will be hard to knead and take longer to thicken up."
        },
        {
          "headline":"Knead your slime until it takes on the desired thickness.",
          "description":"Now comes the fun part! Dump out the solidifying slime and squish, squeeze, pull, and fold it with both hands until it begins to take on a uniform texture. Then, add more Borax or contact lens solution and continue kneading. You should end up using all of the solution by the time you're done. Kneading your slime well is the key to getting it nice and thick. The longer you work it, the stronger it will become. When you’re not playing with your slime, keep it in a sealed plastic bag or similar airtight container. It should retain its texture for weeks or months, as long as it's stored correctly.Tip: Wash your hands with soap and water before you begin kneading to keep your slime free of dust, dirt, and debris."
        }
      ]
    },
    {
      "name":"Mixing up Thick Slime with Liquid Starch",
      "steps":[
        {
          "headline":"Pour about 4 fluid ounces (120 mL) of glue into a large mixing bowl.",
          "description":"For best results, use plain white PVA or Elmer’s glue. This may not seem like a lot at first, but keep in mind that it will expand a little once you add your other ingredients. You can always add a little extra glue later on if you decide you want to make more slime. This recipe will only work with glues that contain the ingredient PVA."
        },
        {
          "headline":"Add ⁄4 cup (59 mL) of water to the glue.",
          "description":"Run the water into a measuring cup before transferring it to your mixing bowl. That way, you can make sure you’re using just the right amount. Stir the two ingredients together until they form a thin, milky solution. It’s important to make sure that you add the correct proportion of water. Too much will make your slime wet and sloppy, while too little could cause it to come out dry and crumbly."
        },
        {
          "headline":"Incorporate any additives you want to include in your slime.",
          "description":"Once you’ve combined equal parts glue and water, you can squeeze in 4-6 drops of food coloring to make your slime more vibrant, or add a pinch of glitter, some miniature styrofoam balls, or other fun mix-ins. Afterwards, give the mixture another stir to make sure your additives are distributed evenly. 2-3 pumps of hand lotion can make thick slimes more flexible and less likely to break when they’re stretched out.Tip: Adding 8-12 drops of baby oil to your slime will give it a glossy sheen. This can be a useful way to remedy the kind of flat, chalky finishes that starch-based slimes tend to have."
        },
        {
          "headline":"Add 2  fl oz (59 mL) of liquid starch gradually while mixing your slime.",
          "description":"The key to achieving a smooth, thick consistency is to pour in the starch little by little while keeping your ingredients moving in the bowl. Start with ⁄2–1 fluid ounce (15–30 mL), then pause long enough to stir it all up. Continue in this way until you’ve used up all of the starch. If you don’t have any liquid starch, you can also make a slurry using 1 tablespoon of cornstarch and about 2 fluid ounces (59 mL) of water. The more of the slurry you mix in, the thicker you slime will be. Keep stirring the mixture until all of the extra liquid has been absorbed."
        },
        {
          "headline":"Finish kneading the slime by hand.",
          "description":"Once your slime has set up to the point where it no longer sticks to the sides of the bowl, scoop it up and begin squeezing and stretching it with both hands. It will thicken up more and more as you knead it. When you’re satisfied with the texture of your slime, you can start having some fun with it! Take your time kneading your slime. Kneading is an essential part of the thickening process, as it helps form stronger bonds between the molecules that make up the slime. Store your slime in a resealable plastic bag or lidded container when you're not playing with it. It should retain its texture for at least a 3-4 weeks. Once it begins to dry out, harden, or come apart, throw it out and whip up a new batch."
        }
      ]
    }
  ],
  "text":" Using Borax to Thicken up Basic Slime Combine 1 tablespoon of Borax with 1 cup (240 mL) of water. Run the water into a measuring cup until you have exactly 1 cup (240 mL). Add the Borax powder to the water, then stir the mixture until the powder dissolves completely. Set the Borax solution aside. The Borax is the “activator” for your slime, causing the glue to go from a sticky liquid to a spongy semi-solid goo that retains its shape when squished, squeezed, and stretched. If you don’t want to use Borax, you can also substitute an equal amount of a contact lens solution containing boric acid, which will create a similar chemical reaction when combined with the glue. There's no need to mix contact lens solution with water since it's already a liquid. Adding 1–2 tablespoons (15–30 mL) can make your slime a little stretchier, though. Pour 4–8  fl oz (120–240 mL) of PVA glue into a large mixing bowl. Be sure to keep your glue separate from the Borax solution for now. The glue will serve as the base for your slime, so use as much as you like. If you only want a handful of slime to play with, 4 fluid ounces (120 mL) or so should be plenty. If you want to make enough to keep both hands busy, start with 6–8 fluid ounces (180–240 mL). Instead of buying multiple small bottles, pick up one big bottle and use as much as you think is necessary. Only use plain white or clear PVA glue, like the kind used for school projects. No other type of glue will work for making thick slime. Add an equal amount of water to the glue. Measure out the water and pour it directly on top of the glue in your mixing bowl. You need to use a 1:1 ratio of water to glue to make sure that your slime comes out with the right texture. If you used an entire bottle of glue, an easy way to ensure that you’re getting the right amount of water is to refill the bottle under the faucet, shake it up, then add it to the glue. Make sure you add just the right amount of water. Too little moisture could cause your finished slime to turn out dry and cakey, while too much could make it thinner than you’d like. Squeeze food coloring into the mixture if you want to change its color. Add about 4-6 drops for every 4 fluid ounces (120 mL) of glue you use. A little bit of food coloring goes a long way, so be careful not to overdo it. Green, blue, purple, pink, and yellow are all good colors for gooey, rubbery slime. This is also the best time to mix in glitter, plastic stars, miniature styrofoam balls, hand lotion, or any other additives you wish to incorporate. Use only about ¼-½ cup (75-150 g) of each to avoid throwing off the texture of your slime. If you decide not to add food coloring, your slime will end up being a plain white color (or transparent, if you opted for clear glue). Mix the ingredients together thoroughly. Stir the glue, water, and food coloring from the bottom until the food coloring is evenly distributed throughout. You can either use your hand to do this or grab a spatula or large spoon if you don’t want to get messy. Add a small amount of activator solution to your ingredients. Drizzle a splash of Borax or contact lens solution into your slime mixture. Then, grab your spoon or spatula and stir it into your other ingredients. You should notice your slime starting to set up right away. Try not to add more than 2–3 fluid ounces (59–89 mL) of activator solution at a time. If your slime is too wet, it will be hard to knead and take longer to thicken up. Knead your slime until it takes on the desired thickness. Now comes the fun part! Dump out the solidifying slime and squish, squeeze, pull, and fold it with both hands until it begins to take on a uniform texture. Then, add more Borax or contact lens solution and continue kneading. You should end up using all of the solution by the time you're done. Kneading your slime well is the key to getting it nice and thick. The longer you work it, the stronger it will become. When you’re not playing with your slime, keep it in a sealed plastic bag or similar airtight container. It should retain its texture for weeks or months, as long as it's stored correctly.Tip: Wash your hands with soap and water before you begin kneading to keep your slime free of dust, dirt, and debris. Mixing up Thick Slime with Liquid Starch Pour about 4 fluid ounces (120 mL) of glue into a large mixing bowl. For best results, use plain white PVA or Elmer’s glue. This may not seem like a lot at first, but keep in mind that it will expand a little once you add your other ingredients. You can always add a little extra glue later on if you decide you want to make more slime. This recipe will only work with glues that contain the ingredient PVA. Add ⁄4 cup (59 mL) of water to the glue. Run the water into a measuring cup before transferring it to your mixing bowl. That way, you can make sure you’re using just the right amount. Stir the two ingredients together until they form a thin, milky solution. It’s important to make sure that you add the correct proportion of water. Too much will make your slime wet and sloppy, while too little could cause it to come out dry and crumbly. Incorporate any additives you want to include in your slime. Once you’ve combined equal parts glue and water, you can squeeze in 4-6 drops of food coloring to make your slime more vibrant, or add a pinch of glitter, some miniature styrofoam balls, or other fun mix-ins. Afterwards, give the mixture another stir to make sure your additives are distributed evenly. 2-3 pumps of hand lotion can make thick slimes more flexible and less likely to break when they’re stretched out.Tip: Adding 8-12 drops of baby oil to your slime will give it a glossy sheen. This can be a useful way to remedy the kind of flat, chalky finishes that starch-based slimes tend to have. Add 2  fl oz (59 mL) of liquid starch gradually while mixing your slime. The key to achieving a smooth, thick consistency is to pour in the starch little by little while keeping your ingredients moving in the bowl. Start with ⁄2–1 fluid ounce (15–30 mL), then pause long enough to stir it all up. Continue in this way until you’ve used up all of the starch. If you don’t have any liquid starch, you can also make a slurry using 1 tablespoon of cornstarch and about 2 fluid ounces (59 mL) of water. The more of the slurry you mix in, the thicker you slime will be. Keep stirring the mixture until all of the extra liquid has been absorbed. Finish kneading the slime by hand. Once your slime has set up to the point where it no longer sticks to the sides of the bowl, scoop it up and begin squeezing and stretching it with both hands. It will thicken up more and more as you knead it. When you’re satisfied with the texture of your slime, you can start having some fun with it! Take your time kneading your slime. Kneading is an essential part of the thickening process, as it helps form stronger bonds between the molecules that make up the slime. Store your slime in a resealable plastic bag or lidded container when you're not playing with it. It should retain its texture for at least a 3-4 weeks. Once it begins to dry out, harden, or come apart, throw it out and whip up a new batch.",
  "sentences":[
    " Using Borax to Thicken up Basic Slime Combine 1 tablespoon of Borax with 1 cup (240 mL) of water.",
    "Run the water into a measuring cup until you have exactly 1 cup (240 mL).",
    "Add the Borax powder to the water, then stir the mixture until the powder dissolves completely.",
    "Set the Borax solution aside.",
    "The Borax is the “activator” for your slime, causing the glue to go from a sticky liquid to a spongy semi-solid goo that retains its shape when squished, squeezed, and stretched.",
    "If you don’t want to use Borax, you can also substitute an equal amount of a contact lens solution containing boric acid, which will create a similar chemical reaction when combined with the glue.",
    "There's no need to mix contact lens solution with water since it's already a liquid.",
    "Adding 1–2 tablespoons (15–30 mL) can make your slime a little stretchier, though.",
    "Pour 4–8  fl oz (120–240 mL) of PVA glue into a large mixing bowl.",
    "Be sure to keep your glue separate from the Borax solution for now.",
    "The glue will serve as the base for your slime, so use as much as you like.",
    "If you only want a handful of slime to play with, 4 fluid ounces (120 mL) or so should be plenty.",
    "If you want to make enough to keep both hands busy, start with 6–8 fluid ounces (180–240 mL).",
    "Instead of buying multiple small bottles, pick up one big bottle and use as much as you think is necessary.",
    "Only use plain white or clear PVA glue, like the kind used for school projects.",
    "No other type of glue will work for making thick slime.",
    "Add an equal amount of water to the glue.",
    "Measure out the water and pour it directly on top of the glue in your mixing bowl.",
    "You need to use a 1:1 ratio of water to glue to make sure that your slime comes out with the right texture.",
    "If you used an entire bottle of glue, an easy way to ensure that you’re getting the right amount of water is to refill the bottle under the faucet, shake it up, then add it to the glue.",
    "Make sure you add just the right amount of water.",
    "Too little moisture could cause your finished slime to turn out dry and cakey, while too much could make it thinner than you’d like.",
    "Squeeze food coloring into the mixture if you want to change its color.",
    "Add about 4-6 drops for every 4 fluid ounces (120 mL) of glue you use.",
    "A little bit of food coloring goes a long way, so be careful not to overdo it.",
    "Green, blue, purple, pink, and yellow are all good colors for gooey, rubbery slime.",
    "This is also the best time to mix in glitter, plastic stars, miniature styrofoam balls, hand lotion, or any other additives you wish to incorporate.",
    "Use only about ¼-½ cup (75-150 g) of each to avoid throwing off the texture of your slime.",
    "If you decide not to add food coloring, your slime will end up being a plain white color (or transparent, if you opted for clear glue).",
    "Mix the ingredients together thoroughly.",
    "Stir the glue, water, and food coloring from the bottom until the food coloring is evenly distributed throughout.",
    "You can either use your hand to do this or grab a spatula or large spoon if you don’t want to get messy.",
    "Add a small amount of activator solution to your ingredients.",
    "Drizzle a splash of Borax or contact lens solution into your slime mixture.",
    "Then, grab your spoon or spatula and stir it into your other ingredients.",
    "You should notice your slime starting to set up right away.",
    "Try not to add more than 2–3 fluid ounces (59–89 mL) of activator solution at a time.",
    "If your slime is too wet, it will be hard to knead and take longer to thicken up.",
    "Knead your slime until it takes on the desired thickness.",
    "Now comes the fun part!",
    "Dump out the solidifying slime and squish, squeeze, pull, and fold it with both hands until it begins to take on a uniform texture.",
    "Then, add more Borax or contact lens solution and continue kneading.",
    "You should end up using all of the solution by the time you're done.",
    "Kneading your slime well is the key to getting it nice and thick.",
    "The longer you work it, the stronger it will become.",
    "When you’re not playing with your slime, keep it in a sealed plastic bag or similar airtight container.",
    "It should retain its texture for weeks or months, as long as it's stored correctly.Tip: Wash your hands with soap and water before you begin kneading to keep your slime free of dust, dirt, and debris.",
    "Mixing up Thick Slime with Liquid Starch Pour about 4 fluid ounces (120 mL) of glue into a large mixing bowl.",
    "For best results, use plain white PVA or Elmer’s glue.",
    "This may not seem like a lot at first, but keep in mind that it will expand a little once you add your other ingredients.",
    "You can always add a little extra glue later on if you decide you want to make more slime.",
    "This recipe will only work with glues that contain the ingredient PVA.",
    "Add ⁄4 cup (59 mL) of water to the glue.",
    "Run the water into a measuring cup before transferring it to your mixing bowl.",
    "That way, you can make sure you’re using just the right amount.",
    "Stir the two ingredients together until they form a thin, milky solution.",
    "It’s important to make sure that you add the correct proportion of water.",
    "Too much will make your slime wet and sloppy, while too little could cause it to come out dry and crumbly.",
    "Incorporate any additives you want to include in your slime.",
    "Once you’ve combined equal parts glue and water, you can squeeze in 4-6 drops of food coloring to make your slime more vibrant, or add a pinch of glitter, some miniature styrofoam balls, or other fun mix-ins.",
    "Afterwards, give the mixture another stir to make sure your additives are distributed evenly.",
    "2-3 pumps of hand lotion can make thick slimes more flexible and less likely to break when they’re stretched out.Tip: Adding 8-12 drops of baby oil to your slime will give it a glossy sheen.",
    "This can be a useful way to remedy the kind of flat, chalky finishes that starch-based slimes tend to have.",
    "Add 2  fl oz (59 mL) of liquid starch gradually while mixing your slime.",
    "The key to achieving a smooth, thick consistency is to pour in the starch little by little while keeping your ingredients moving in the bowl.",
    "Start with ⁄2–1 fluid ounce (15–30 mL), then pause long enough to stir it all up.",
    "Continue in this way until you’ve used up all of the starch.",
    "If you don’t have any liquid starch, you can also make a slurry using 1 tablespoon of cornstarch and about 2 fluid ounces (59 mL) of water.",
    "The more of the slurry you mix in, the thicker you slime will be.",
    "Keep stirring the mixture until all of the extra liquid has been absorbed.",
    "Finish kneading the slime by hand.",
    "Once your slime has set up to the point where it no longer sticks to the sides of the bowl, scoop it up and begin squeezing and stretching it with both hands.",
    "It will thicken up more and more as you knead it.",
    "When you’re satisfied with the texture of your slime, you can start having some fun with it!",
    "Take your time kneading your slime.",
    "Kneading is an essential part of the thickening process, as it helps form stronger bonds between the molecules that make up the slime.",
    "Store your slime in a resealable plastic bag or lidded container when you're not playing with it.",
    "It should retain its texture for at least a 3-4 weeks.",
    "Once it begins to dry out, harden, or come apart, throw it out and whip up a new batch."
  ],
  "tyn_section":[
    "Large mixing bowl",
    "Liquid measuring cup",
    "Dry measuring cups",
    "Spatula or spoon",
    "Soap and water"
  ],
  "tyn_model":[
    "water",
    "glue",
    "borax",
    "food coloring",
    "liquid starch",
    "measuring cup",
    "contact lens solution",
    "large mixing bowl",
    "mixing bowl",
    "glitter",
    "styrofoam balls",
    "hand lotion",
    "spatula",
    "spoon",
    "activator solution",
    "contact lens",
    "slime",
    "bowl",
    "“activator",
    "” for",
    "boric acid",
    "pva glue",
    "plastic stars",
    "clear glue",
    "borax or",
    "airtight container",
    "elmer’s glue",
    "baby oil",
    "starch",
    "cornstarch",
    "resealable plastic bag"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0322580645,
    "f1":0.0555555556,
    "avg_pos":0.2258064516
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.0967741935,
    "f1":0.1558441558
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.2258064516,
    "f1":0.3522012579
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.0967741935,
    "f1":0.1558441558
  }
}