{
  "title":"How to Divide a Room with Curtains",
  "url":"https://www.wikihow.com/Divide-a-Room-with-Curtains",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating",
    "Interior Design for Rooms"
  ],
  "parts":[
    {
      "name":"Measuring the Space",
      "steps":[
        {
          "headline":"Mark the line where your curtains will hang.",
          "description":"Use masking tape or something similar to run a straight line along the floor where you want to put up your curtains. This will help you make sure that your curtains are perpendicular to your walls, as well as giving you a guide while hanging them. If you can line your curtains up with a wall stud, they might hold sturdier than if you secure them into other parts of the wall. Locate the studs in your walls and see if any of these spots would work well for a dividing curtain."
        },
        {
          "headline":"Determine the material your wall is made of.",
          "description":"Different materials and construction techniques will need different types of screws and preparation. Make sure you know what your chosen wall is made out of to make sure the curtains will stay steady. Drywall and plaster will likely need an anchor before you screw anything into them. Your local hardware store should be able to give you advice if you’re unsure what you need. If you’re trying to screw something into brick or concrete, you’ll need a hammer drill, a rotary hammer, or something similar. You can often rent these if you do not have one on hand."
        },
        {
          "headline":"Find and mark the point where your screws will go.",
          "description":"Measure a distance up the wall where you will want your curtains to hang, and mark it with a small line. Repeat on the opposite wall, making sure to keep the height of the mark exactly the same to prevent your curtains from hanging crooked. Use a plumb-bob or something similar to ensure your marks on the wall line up with the masking tape line on the floor. Hold the string to the ceiling and shift it around until it lines up perfectly with the masking tape, using this as a guide to place your mark on the wall."
        }
      ]
    },
    {
      "name":"Attaching the Cable",
      "steps":[
        {
          "headline":"Mount a screw eye in each wall.",
          "description":"Screw eyes are regular screws with a loop on the end to tie wire or threads onto. Line a screw eye up with the mark you made on the wall, and screw it firmly into place. This will be holding the weight of your curtains, so make sure it is tight and won’t come free when weight is added. Repeat on the opposite wall. If your curtains will be strung across a wide area, you might need to install another screw eye in the ceiling at the centre point to act as a support. Make sure you install the screw eyes to maintain a straight line between them."
        },
        {
          "headline":"Cut a piece of steel wire rope to length.",
          "description":"Steel wire rope is a strong and durable woven rope made from strands of wire and should be available at your local hardware store. Measure the distance between the screw eyes with a tape measure. Use wire rope cutters to cut a piece of steel wire rope to the same length, making sure to leave around 6 inches (15 cm) for securing the steel wire rope to the screw eyes. If you don’t have wire rope cutters, wrap the section of the rope you want to cut with electrical tape and use a hammer and chisel to sever it at your desired point. Keep in mind the pressure your rope will be under when choosing a material. Picture hanging wire will be easier to work with, but may not be as strong as a thicker piece of steel wire rope."
        },
        {
          "headline":"Use wire clamps to connect the rope to the screw eye.",
          "description":"Thread one end of the steel wire rope through the screw eye. Fold the end back over onto the wire to create a small loop. Wrap two or three wire clamps onto the end of this loop, and tighten them to hold the wire in place and secure it to the screw eye."
        },
        {
          "headline":"Attach the other end of the wire to a turnbuckle.",
          "description":"A turnbuckle will allow you to tighten or loosen the wire after you have hung it up, and should be available at your local hardware store. Loosen both ends of the turnbuckle almost all of the way. Loop the wire through one of the hoops and use wire clamps to secure it in place. Make sure to use a turnbuckle strong enough to hold up your curtains. If you plan on using a heavier material, you may need a stronger turnbuckle."
        },
        {
          "headline":"Use an S-Hook to attach the turnbuckle to the other screw eye.",
          "description":"Run one end of the S-Hook through the remaining screw eye and attach the other end to the turnbuckle. This should hold the wire in place across the room and allow you to check that everything is working as expected."
        },
        {
          "headline":"Tighten the turnbuckle.",
          "description":"Grasp the middle section of the turnbuckle and rotate it so that the two screws move closer together. The wire should tighten until it creates a sturdy and straight line between the two screw eyes. Once you attach the curtains, the wire may sag a little under their weight. This can cause the curtains to slide closed as the curtain clips move towards the lower, middle point. Tighten the turnbuckle as needed to stop this from happening."
        }
      ]
    },
    {
      "name":"Hanging up the Curtains",
      "steps":[
        {
          "headline":"Find dividing curtains that fit the size and feel of the space.",
          "description":"Home goods stores should have a variety of different dividing curtains perfect for all sorts of styles. First and foremost, make sure that the curtains you choose will be long and tall enough to fully cover the space you've prepared. When it comes to colour and style, consider the other colours and styles in the space to help choose the perfect curtains."
        },
        {
          "headline":"Make your own dividing curtains if you want to choose your own fabric.",
          "description":"You can make your own curtains with a large piece of fabric, a grommet kit and some curtain clips. Cut your chosen piece of fabric to the length and height of your curtain wire, and install grommets along the top edge of the fabric roughly every 10 inches (25 cm). Instead of using grommets and curtain clips, you could instead use cafe clips which directly attach to the fabric. Thread these over the wire rope and attach them to the fabric at regular intervals to hang your curtains. Thicker materials such as canvas will be heavier but may do more to block out light and sound, whereas lighter materials can give an airier feel to the room. Keep this in mind when choosing your fabric. If you have small children or pets, it might be easier to leave the curtains a foot or so off the ground. This will allow them to move around without having to deal with the curtains and might prevent the curtains from being pulled on."
        },
        {
          "headline":"Hang your curtains on the steel wire rope.",
          "description":"Thread a curtain clip through each of your installed grommets, and thread these over the top of your wire rope. Make sure that they move smoothly by opening and closing the curtains a few times and make any necessary adjustments. Some dividing curtains may be designed to attach directly to the wire. If so, loosen the turnbuckle and unhook the S-Hook to allow you to thread the curtains on. Once they're attached and in place, you can reattach the S-Hook and tighten the turnbuckle as needed. If you want to keep the ends of the curtains in place, hook one of the curtain clips through a grommet and attach it to the opening of the screw eye. You might need to tighten the turnbuckle after you attach the curtains. Simply follow the same method you used earlier until the wire rope is taut once again."
        }
      ]
    }
  ],
  "text":" Measuring the Space Mark the line where your curtains will hang. Use masking tape or something similar to run a straight line along the floor where you want to put up your curtains. This will help you make sure that your curtains are perpendicular to your walls, as well as giving you a guide while hanging them. If you can line your curtains up with a wall stud, they might hold sturdier than if you secure them into other parts of the wall. Locate the studs in your walls and see if any of these spots would work well for a dividing curtain. Determine the material your wall is made of. Different materials and construction techniques will need different types of screws and preparation. Make sure you know what your chosen wall is made out of to make sure the curtains will stay steady. Drywall and plaster will likely need an anchor before you screw anything into them. Your local hardware store should be able to give you advice if you’re unsure what you need. If you’re trying to screw something into brick or concrete, you’ll need a hammer drill, a rotary hammer, or something similar. You can often rent these if you do not have one on hand. Find and mark the point where your screws will go. Measure a distance up the wall where you will want your curtains to hang, and mark it with a small line. Repeat on the opposite wall, making sure to keep the height of the mark exactly the same to prevent your curtains from hanging crooked. Use a plumb-bob or something similar to ensure your marks on the wall line up with the masking tape line on the floor. Hold the string to the ceiling and shift it around until it lines up perfectly with the masking tape, using this as a guide to place your mark on the wall. Attaching the Cable Mount a screw eye in each wall. Screw eyes are regular screws with a loop on the end to tie wire or threads onto. Line a screw eye up with the mark you made on the wall, and screw it firmly into place. This will be holding the weight of your curtains, so make sure it is tight and won’t come free when weight is added. Repeat on the opposite wall. If your curtains will be strung across a wide area, you might need to install another screw eye in the ceiling at the centre point to act as a support. Make sure you install the screw eyes to maintain a straight line between them. Cut a piece of steel wire rope to length. Steel wire rope is a strong and durable woven rope made from strands of wire and should be available at your local hardware store. Measure the distance between the screw eyes with a tape measure. Use wire rope cutters to cut a piece of steel wire rope to the same length, making sure to leave around 6 inches (15 cm) for securing the steel wire rope to the screw eyes. If you don’t have wire rope cutters, wrap the section of the rope you want to cut with electrical tape and use a hammer and chisel to sever it at your desired point. Keep in mind the pressure your rope will be under when choosing a material. Picture hanging wire will be easier to work with, but may not be as strong as a thicker piece of steel wire rope. Use wire clamps to connect the rope to the screw eye. Thread one end of the steel wire rope through the screw eye. Fold the end back over onto the wire to create a small loop. Wrap two or three wire clamps onto the end of this loop, and tighten them to hold the wire in place and secure it to the screw eye. Attach the other end of the wire to a turnbuckle. A turnbuckle will allow you to tighten or loosen the wire after you have hung it up, and should be available at your local hardware store. Loosen both ends of the turnbuckle almost all of the way. Loop the wire through one of the hoops and use wire clamps to secure it in place. Make sure to use a turnbuckle strong enough to hold up your curtains. If you plan on using a heavier material, you may need a stronger turnbuckle. Use an S-Hook to attach the turnbuckle to the other screw eye. Run one end of the S-Hook through the remaining screw eye and attach the other end to the turnbuckle. This should hold the wire in place across the room and allow you to check that everything is working as expected. Tighten the turnbuckle. Grasp the middle section of the turnbuckle and rotate it so that the two screws move closer together. The wire should tighten until it creates a sturdy and straight line between the two screw eyes. Once you attach the curtains, the wire may sag a little under their weight. This can cause the curtains to slide closed as the curtain clips move towards the lower, middle point. Tighten the turnbuckle as needed to stop this from happening. Hanging up the Curtains Find dividing curtains that fit the size and feel of the space. Home goods stores should have a variety of different dividing curtains perfect for all sorts of styles. First and foremost, make sure that the curtains you choose will be long and tall enough to fully cover the space you've prepared. When it comes to colour and style, consider the other colours and styles in the space to help choose the perfect curtains. Make your own dividing curtains if you want to choose your own fabric. You can make your own curtains with a large piece of fabric, a grommet kit and some curtain clips. Cut your chosen piece of fabric to the length and height of your curtain wire, and install grommets along the top edge of the fabric roughly every 10 inches (25 cm). Instead of using grommets and curtain clips, you could instead use cafe clips which directly attach to the fabric. Thread these over the wire rope and attach them to the fabric at regular intervals to hang your curtains. Thicker materials such as canvas will be heavier but may do more to block out light and sound, whereas lighter materials can give an airier feel to the room. Keep this in mind when choosing your fabric. If you have small children or pets, it might be easier to leave the curtains a foot or so off the ground. This will allow them to move around without having to deal with the curtains and might prevent the curtains from being pulled on. Hang your curtains on the steel wire rope. Thread a curtain clip through each of your installed grommets, and thread these over the top of your wire rope. Make sure that they move smoothly by opening and closing the curtains a few times and make any necessary adjustments. Some dividing curtains may be designed to attach directly to the wire. If so, loosen the turnbuckle and unhook the S-Hook to allow you to thread the curtains on. Once they're attached and in place, you can reattach the S-Hook and tighten the turnbuckle as needed. If you want to keep the ends of the curtains in place, hook one of the curtain clips through a grommet and attach it to the opening of the screw eye. You might need to tighten the turnbuckle after you attach the curtains. Simply follow the same method you used earlier until the wire rope is taut once again.",
  "sentences":[
    " Measuring the Space Mark the line where your curtains will hang.",
    "Use masking tape or something similar to run a straight line along the floor where you want to put up your curtains.",
    "This will help you make sure that your curtains are perpendicular to your walls, as well as giving you a guide while hanging them.",
    "If you can line your curtains up with a wall stud, they might hold sturdier than if you secure them into other parts of the wall.",
    "Locate the studs in your walls and see if any of these spots would work well for a dividing curtain.",
    "Determine the material your wall is made of.",
    "Different materials and construction techniques will need different types of screws and preparation.",
    "Make sure you know what your chosen wall is made out of to make sure the curtains will stay steady.",
    "Drywall and plaster will likely need an anchor before you screw anything into them.",
    "Your local hardware store should be able to give you advice if you’re unsure what you need.",
    "If you’re trying to screw something into brick or concrete, you’ll need a hammer drill, a rotary hammer, or something similar.",
    "You can often rent these if you do not have one on hand.",
    "Find and mark the point where your screws will go.",
    "Measure a distance up the wall where you will want your curtains to hang, and mark it with a small line.",
    "Repeat on the opposite wall, making sure to keep the height of the mark exactly the same to prevent your curtains from hanging crooked.",
    "Use a plumb-bob or something similar to ensure your marks on the wall line up with the masking tape line on the floor.",
    "Hold the string to the ceiling and shift it around until it lines up perfectly with the masking tape, using this as a guide to place your mark on the wall.",
    "Attaching the Cable Mount a screw eye in each wall.",
    "Screw eyes are regular screws with a loop on the end to tie wire or threads onto.",
    "Line a screw eye up with the mark you made on the wall, and screw it firmly into place.",
    "This will be holding the weight of your curtains, so make sure it is tight and won’t come free when weight is added.",
    "Repeat on the opposite wall.",
    "If your curtains will be strung across a wide area, you might need to install another screw eye in the ceiling at the centre point to act as a support.",
    "Make sure you install the screw eyes to maintain a straight line between them.",
    "Cut a piece of steel wire rope to length.",
    "Steel wire rope is a strong and durable woven rope made from strands of wire and should be available at your local hardware store.",
    "Measure the distance between the screw eyes with a tape measure.",
    "Use wire rope cutters to cut a piece of steel wire rope to the same length, making sure to leave around 6 inches (15 cm) for securing the steel wire rope to the screw eyes.",
    "If you don’t have wire rope cutters, wrap the section of the rope you want to cut with electrical tape and use a hammer and chisel to sever it at your desired point.",
    "Keep in mind the pressure your rope will be under when choosing a material.",
    "Picture hanging wire will be easier to work with, but may not be as strong as a thicker piece of steel wire rope.",
    "Use wire clamps to connect the rope to the screw eye.",
    "Thread one end of the steel wire rope through the screw eye.",
    "Fold the end back over onto the wire to create a small loop.",
    "Wrap two or three wire clamps onto the end of this loop, and tighten them to hold the wire in place and secure it to the screw eye.",
    "Attach the other end of the wire to a turnbuckle.",
    "A turnbuckle will allow you to tighten or loosen the wire after you have hung it up, and should be available at your local hardware store.",
    "Loosen both ends of the turnbuckle almost all of the way.",
    "Loop the wire through one of the hoops and use wire clamps to secure it in place.",
    "Make sure to use a turnbuckle strong enough to hold up your curtains.",
    "If you plan on using a heavier material, you may need a stronger turnbuckle.",
    "Use an S-Hook to attach the turnbuckle to the other screw eye.",
    "Run one end of the S-Hook through the remaining screw eye and attach the other end to the turnbuckle.",
    "This should hold the wire in place across the room and allow you to check that everything is working as expected.",
    "Tighten the turnbuckle.",
    "Grasp the middle section of the turnbuckle and rotate it so that the two screws move closer together.",
    "The wire should tighten until it creates a sturdy and straight line between the two screw eyes.",
    "Once you attach the curtains, the wire may sag a little under their weight.",
    "This can cause the curtains to slide closed as the curtain clips move towards the lower, middle point.",
    "Tighten the turnbuckle as needed to stop this from happening.",
    "Hanging up the Curtains Find dividing curtains that fit the size and feel of the space.",
    "Home goods stores should have a variety of different dividing curtains perfect for all sorts of styles.",
    "First and foremost, make sure that the curtains you choose will be long and tall enough to fully cover the space you've prepared.",
    "When it comes to colour and style, consider the other colours and styles in the space to help choose the perfect curtains.",
    "Make your own dividing curtains if you want to choose your own fabric.",
    "You can make your own curtains with a large piece of fabric, a grommet kit and some curtain clips.",
    "Cut your chosen piece of fabric to the length and height of your curtain wire, and install grommets along the top edge of the fabric roughly every 10 inches (25 cm).",
    "Instead of using grommets and curtain clips, you could instead use cafe clips which directly attach to the fabric.",
    "Thread these over the wire rope and attach them to the fabric at regular intervals to hang your curtains.",
    "Thicker materials such as canvas will be heavier but may do more to block out light and sound, whereas lighter materials can give an airier feel to the room.",
    "Keep this in mind when choosing your fabric.",
    "If you have small children or pets, it might be easier to leave the curtains a foot or so off the ground.",
    "This will allow them to move around without having to deal with the curtains and might prevent the curtains from being pulled on.",
    "Hang your curtains on the steel wire rope.",
    "Thread a curtain clip through each of your installed grommets, and thread these over the top of your wire rope.",
    "Make sure that they move smoothly by opening and closing the curtains a few times and make any necessary adjustments.",
    "Some dividing curtains may be designed to attach directly to the wire.",
    "If so, loosen the turnbuckle and unhook the S-Hook to allow you to thread the curtains on.",
    "Once they're attached and in place, you can reattach the S-Hook and tighten the turnbuckle as needed.",
    "If you want to keep the ends of the curtains in place, hook one of the curtain clips through a grommet and attach it to the opening of the screw eye.",
    "You might need to tighten the turnbuckle after you attach the curtains.",
    "Simply follow the same method you used earlier until the wire rope is taut once again."
  ],
  "tyn_section":[
    "Masking tape",
    "Tape measure",
    "Screw eyes",
    "Steel wire rope or picture hanging wire",
    "Wire clamps",
    "Turnbuckle",
    "S-Hook",
    "Fabric",
    "Grommet kit",
    "Curtain hooks",
    "Cafe clips"
  ],
  "tyn_model":[
    "curtains",
    "wire",
    "fabric",
    "steel wire rope",
    "turnbuckle",
    "masking tape",
    "screw eye",
    "wire clamps",
    "wire rope",
    "screw eyes",
    "wire rope cutters",
    "curtain clips",
    "screws",
    "drywall",
    "plaster",
    "hammer drill",
    "rotary hammer",
    "plumb-bob",
    "cable",
    "tape measure",
    "electrical tape",
    "hammer",
    "curtain",
    "grommet kit",
    "grommets",
    "canvas",
    "grommet"
  ],
  "simple_metrics":{
    "r":0.6363636364,
    "p":0.2592592593,
    "f1":0.3684210526,
    "avg_pos":0.1851851852
  },
  "jacc_metrics_0.5":{
    "r":0.8181818182,
    "p":0.4074074074,
    "f1":0.543956044
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9090909091,
    "p":0.5555555556,
    "f1":0.6896551724
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6363636364,
    "p":0.2592592593,
    "f1":0.3684210526
  }
}