{
  "title":"How to Make Dumplings with Self Rising Flour",
  "url":"https://www.wikihow.com/Make-Dumplings-with-Self-Rising-Flour",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Chinese Dishes"
  ],
  "methods":[
    {
      "name":"Making Rolled Dumplings",
      "steps":[
        {
          "headline":"Put the flour, butter, milk, egg, and parsley into a bowl.",
          "description":"Get out a large mixing bowl and put 1 1/2 cups (187 g) of self-rising flour into it along with 3 tablespoons (42 g) of melted butter, 2 tablespoons (30 ml) of milk or buttermilk, and 1 beaten egg. For a fresh herb flavor, add 1 tablespoon (4 g) of chopped fresh parsley. If you don't have butter, you can substitute vegetable shortening."
        },
        {
          "headline":"Mix the ingredients into a soft dough.",
          "description":"Stir the dumpling ingredients until the flour absorbs the butter, milk, and egg. Then use your hands to gently knead the dough until it comes together into a ball. Stop kneading as soon as the crumbs from the bottom of the bowl are incorporated into the dough. Working the dough too much will make tough dumplings."
        },
        {
          "headline":"Roll the dough ⁄4 inch (0.64 cm) thick.",
          "description":"Sprinkle some flour on your work surface and place the dumpling dough on it. Use a rolling pin to roll the dough into an even ⁄4 inch (0.64 cm) thickness. While you don't have to roll the dough into a specific shape, try to roll it into a square or a rectangle. This will make it easier to cut the dough into small squares."
        },
        {
          "headline":"Cut the dough into 2 in (5.1 cm) pieces.",
          "description":"Use a knife or pasta cutter wheel to slice the dough into 2 in (5.1 cm) thick strips. Then turn the knife or cutter 90-degrees and cut the strips into 2 in (5.1 cm) squares. For wavy dumplings, use a fluted pastry wheel to cut the dough. If you prefer long, thin dumplings, leave the dough in long strips and don't cut them into squares."
        },
        {
          "headline":"Lay the dumpling squares in a pot of hot soup or broth.",
          "description":"Heat at least 4 cups (950 ml) of hot soup or broth in a large pot on the stove. Place the dumpling pieces on top of the soup. You'll probably need to overlap the dough pieces a little to get them to fit in the pan. Avoid pushing the dough down into the soup or broth."
        },
        {
          "headline":"Simmer the uncovered dumplings for 10 minutes.",
          "description":"Turn the burner to medium so the soup or broth bubbles gently. Gently stir the dumplings occasionally as they cook. This will prevent them from baking into a large clump. Simmer the dumplings until they're no longer doughy. Turn off the burner and serve the soup or broth with some of the rolled dumplings. To test if the dumplings are doughy, insert a toothpick into the thickest one. It should come out clean if the dumplings are finished cooking."
        }
      ]
    },
    {
      "name":"Creating Dropped Feather Dumplings",
      "steps":[
        {
          "headline":"Cut the shortening into the flour until it's crumbly.",
          "description":"Put 1 1/2 cups (187 g) of self-rising flour into a bowl and add 3 tablespoons (36 g) of vegetable shortening. Use a fork, pastry cutter, or your fingers to mix the shortening into the flour until it starts to clump together. Consider chilling the shortening to make it easier to cut into the flour."
        },
        {
          "headline":"Stir in the chives and milk.",
          "description":"Add 1/2 tablespoon (0.1 g) of dried chives or 1 tablespoon (3 g) of freshly snipped chives. Then stir in ⁄4 cup (180 ml) of milk until the flour is absorbed. You should now have a firm dough. Don't worry if it's not completely smooth because the batter will still be slightly lumpy."
        },
        {
          "headline":"Scoop the dumpling batter into a pot of hot stew or broth.",
          "description":"Heat a pot of stew, soup, or broth over medium heat. Then use two spoons or a small cookie scoop to drop a mound of dumpling batter onto the hot liquid. Continue dropping the batter until you've used it all and the top of the liquid is covered with dumplings.Tip: If you use a wide pot, you'll have a larger surface area for cooking the dumplings."
        },
        {
          "headline":"Cover and simmer the dumplings for 10 to 15 minutes.",
          "description":"Turn the burner to medium-low so the liquid doesn't boil. Cook the dumplings until they're not doughy in the center when you insert a toothpick. Then serve the dumplings with some of the soup or stew. If you made small dumplings, they'll cook faster than large ones so begin checking them at the 10 minute mark."
        }
      ]
    },
    {
      "name":"Making Round Herb Dumplings",
      "steps":[
        {
          "headline":"Stir the flour with salt, pepper, and the herbs.",
          "description":"Put 1 1/4 cup (150 g) of self-raising flour into a mixing bowl and add a pinch of salt and pepper. Chop 2 tablespoons (7.5 g) of fresh parsley or thyme and add the herbs. Stir the dry ingredients until the herbs are incorporated.Tip: You can substitute any of your favorite herbs for the parsley or thyme. For example, use chopped rosemary or sage."
        },
        {
          "headline":"Stir in the egg yolk and olive oil.",
          "description":"Separate the white and yolk of 1 egg and discard the white. Put the yolk into a small ramekin and beat it a little with a fork. Add the beaten yolk to the bowl with the dry ingredients along with 1 teaspoon (4.9 ml) of olive oil. Stir until the yolk is combined. If you don't want to throw the egg white away, save it to use in another recipe."
        },
        {
          "headline":"Mix in cold water to form a soft dough.",
          "description":"Stir in 4 tablespoons (59 ml) of ice water, 1 tablespoon (15 ml) at a time. You should see the dough start to pull away from the sides of the bowl. Use your hands to knead the mixture into a pliable dough. If the dough comes together before you've added all of the water, you don't need to use it all. Adding too much water will make the dumplings heavy."
        },
        {
          "headline":"Shape the dough into 8 large balls.",
          "description":"Use a knife and cut the dough or pull off pieces of dough using your fingers. Divide the dough into 8 equal pieces and then roll them gently between your palms to make large balls. If the dough sticks to your palms, dust them lightly with flour."
        },
        {
          "headline":"Put the dumplings onto broth or stew and simmer them for 15 minutes.",
          "description":"Heat a pot of soup or stew on the stove. Press each of the round dumplings down into the hot liquid so they're halfway submerged. Cover the pot and simmer the dumplings over medium heat. If you're using stew, ensure that the stew meat is cooked before you add the dumplings."
        },
        {
          "headline":"Simmer the uncovered dumplings for 15 minutes.",
          "description":"Remove the lid from the pot and let the soup or stew bubble gently. Cook the dumplings for 15 more minutes with the lid off so some of the moisture evaporates and the dumplings finish cooking. Serve the hot soup or stew with the round herb dumplings. Insert a toothpick into the center of a dumpling. It should come out clean if they've finished cooking. If you prefer, put the pot in a 375 °F (191 °C) oven and bake the dumplings for 30 minutes."
        }
      ]
    }
  ],
  "text":" Making Rolled Dumplings Put the flour, butter, milk, egg, and parsley into a bowl. Get out a large mixing bowl and put 1 1/2 cups (187 g) of self-rising flour into it along with 3 tablespoons (42 g) of melted butter, 2 tablespoons (30 ml) of milk or buttermilk, and 1 beaten egg. For a fresh herb flavor, add 1 tablespoon (4 g) of chopped fresh parsley. If you don't have butter, you can substitute vegetable shortening. Mix the ingredients into a soft dough. Stir the dumpling ingredients until the flour absorbs the butter, milk, and egg. Then use your hands to gently knead the dough until it comes together into a ball. Stop kneading as soon as the crumbs from the bottom of the bowl are incorporated into the dough. Working the dough too much will make tough dumplings. Roll the dough ⁄4 inch (0.64 cm) thick. Sprinkle some flour on your work surface and place the dumpling dough on it. Use a rolling pin to roll the dough into an even ⁄4 inch (0.64 cm) thickness. While you don't have to roll the dough into a specific shape, try to roll it into a square or a rectangle. This will make it easier to cut the dough into small squares. Cut the dough into 2 in (5.1 cm) pieces. Use a knife or pasta cutter wheel to slice the dough into 2 in (5.1 cm) thick strips. Then turn the knife or cutter 90-degrees and cut the strips into 2 in (5.1 cm) squares. For wavy dumplings, use a fluted pastry wheel to cut the dough. If you prefer long, thin dumplings, leave the dough in long strips and don't cut them into squares. Lay the dumpling squares in a pot of hot soup or broth. Heat at least 4 cups (950 ml) of hot soup or broth in a large pot on the stove. Place the dumpling pieces on top of the soup. You'll probably need to overlap the dough pieces a little to get them to fit in the pan. Avoid pushing the dough down into the soup or broth. Simmer the uncovered dumplings for 10 minutes. Turn the burner to medium so the soup or broth bubbles gently. Gently stir the dumplings occasionally as they cook. This will prevent them from baking into a large clump. Simmer the dumplings until they're no longer doughy. Turn off the burner and serve the soup or broth with some of the rolled dumplings. To test if the dumplings are doughy, insert a toothpick into the thickest one. It should come out clean if the dumplings are finished cooking. Creating Dropped Feather Dumplings Cut the shortening into the flour until it's crumbly. Put 1 1/2 cups (187 g) of self-rising flour into a bowl and add 3 tablespoons (36 g) of vegetable shortening. Use a fork, pastry cutter, or your fingers to mix the shortening into the flour until it starts to clump together. Consider chilling the shortening to make it easier to cut into the flour. Stir in the chives and milk. Add 1/2 tablespoon (0.1 g) of dried chives or 1 tablespoon (3 g) of freshly snipped chives. Then stir in ⁄4 cup (180 ml) of milk until the flour is absorbed. You should now have a firm dough. Don't worry if it's not completely smooth because the batter will still be slightly lumpy. Scoop the dumpling batter into a pot of hot stew or broth. Heat a pot of stew, soup, or broth over medium heat. Then use two spoons or a small cookie scoop to drop a mound of dumpling batter onto the hot liquid. Continue dropping the batter until you've used it all and the top of the liquid is covered with dumplings.Tip: If you use a wide pot, you'll have a larger surface area for cooking the dumplings. Cover and simmer the dumplings for 10 to 15 minutes. Turn the burner to medium-low so the liquid doesn't boil. Cook the dumplings until they're not doughy in the center when you insert a toothpick. Then serve the dumplings with some of the soup or stew. If you made small dumplings, they'll cook faster than large ones so begin checking them at the 10 minute mark. Making Round Herb Dumplings Stir the flour with salt, pepper, and the herbs. Put 1 1/4 cup (150 g) of self-raising flour into a mixing bowl and add a pinch of salt and pepper. Chop 2 tablespoons (7.5 g) of fresh parsley or thyme and add the herbs. Stir the dry ingredients until the herbs are incorporated.Tip: You can substitute any of your favorite herbs for the parsley or thyme. For example, use chopped rosemary or sage. Stir in the egg yolk and olive oil. Separate the white and yolk of 1 egg and discard the white. Put the yolk into a small ramekin and beat it a little with a fork. Add the beaten yolk to the bowl with the dry ingredients along with 1 teaspoon (4.9 ml) of olive oil. Stir until the yolk is combined. If you don't want to throw the egg white away, save it to use in another recipe. Mix in cold water to form a soft dough. Stir in 4 tablespoons (59 ml) of ice water, 1 tablespoon (15 ml) at a time. You should see the dough start to pull away from the sides of the bowl. Use your hands to knead the mixture into a pliable dough. If the dough comes together before you've added all of the water, you don't need to use it all. Adding too much water will make the dumplings heavy. Shape the dough into 8 large balls. Use a knife and cut the dough or pull off pieces of dough using your fingers. Divide the dough into 8 equal pieces and then roll them gently between your palms to make large balls. If the dough sticks to your palms, dust them lightly with flour. Put the dumplings onto broth or stew and simmer them for 15 minutes. Heat a pot of soup or stew on the stove. Press each of the round dumplings down into the hot liquid so they're halfway submerged. Cover the pot and simmer the dumplings over medium heat. If you're using stew, ensure that the stew meat is cooked before you add the dumplings. Simmer the uncovered dumplings for 15 minutes. Remove the lid from the pot and let the soup or stew bubble gently. Cook the dumplings for 15 more minutes with the lid off so some of the moisture evaporates and the dumplings finish cooking. Serve the hot soup or stew with the round herb dumplings. Insert a toothpick into the center of a dumpling. It should come out clean if they've finished cooking. If you prefer, put the pot in a 375 °F (191 °C) oven and bake the dumplings for 30 minutes.",
  "sentences":[
    " Making Rolled Dumplings Put the flour, butter, milk, egg, and parsley into a bowl.",
    "Get out a large mixing bowl and put 1 1/2 cups (187 g) of self-rising flour into it along with 3 tablespoons (42 g) of melted butter, 2 tablespoons (30 ml) of milk or buttermilk, and 1 beaten egg.",
    "For a fresh herb flavor, add 1 tablespoon (4 g) of chopped fresh parsley.",
    "If you don't have butter, you can substitute vegetable shortening.",
    "Mix the ingredients into a soft dough.",
    "Stir the dumpling ingredients until the flour absorbs the butter, milk, and egg.",
    "Then use your hands to gently knead the dough until it comes together into a ball.",
    "Stop kneading as soon as the crumbs from the bottom of the bowl are incorporated into the dough.",
    "Working the dough too much will make tough dumplings.",
    "Roll the dough ⁄4 inch (0.64 cm) thick.",
    "Sprinkle some flour on your work surface and place the dumpling dough on it.",
    "Use a rolling pin to roll the dough into an even ⁄4 inch (0.64 cm) thickness.",
    "While you don't have to roll the dough into a specific shape, try to roll it into a square or a rectangle.",
    "This will make it easier to cut the dough into small squares.",
    "Cut the dough into 2 in (5.1 cm) pieces.",
    "Use a knife or pasta cutter wheel to slice the dough into 2 in (5.1 cm) thick strips.",
    "Then turn the knife or cutter 90-degrees and cut the strips into 2 in (5.1 cm) squares.",
    "For wavy dumplings, use a fluted pastry wheel to cut the dough.",
    "If you prefer long, thin dumplings, leave the dough in long strips and don't cut them into squares.",
    "Lay the dumpling squares in a pot of hot soup or broth.",
    "Heat at least 4 cups (950 ml) of hot soup or broth in a large pot on the stove.",
    "Place the dumpling pieces on top of the soup.",
    "You'll probably need to overlap the dough pieces a little to get them to fit in the pan.",
    "Avoid pushing the dough down into the soup or broth.",
    "Simmer the uncovered dumplings for 10 minutes.",
    "Turn the burner to medium so the soup or broth bubbles gently.",
    "Gently stir the dumplings occasionally as they cook.",
    "This will prevent them from baking into a large clump.",
    "Simmer the dumplings until they're no longer doughy.",
    "Turn off the burner and serve the soup or broth with some of the rolled dumplings.",
    "To test if the dumplings are doughy, insert a toothpick into the thickest one.",
    "It should come out clean if the dumplings are finished cooking.",
    "Creating Dropped Feather Dumplings Cut the shortening into the flour until it's crumbly.",
    "Put 1 1/2 cups (187 g) of self-rising flour into a bowl and add 3 tablespoons (36 g) of vegetable shortening.",
    "Use a fork, pastry cutter, or your fingers to mix the shortening into the flour until it starts to clump together.",
    "Consider chilling the shortening to make it easier to cut into the flour.",
    "Stir in the chives and milk.",
    "Add 1/2 tablespoon (0.1 g) of dried chives or 1 tablespoon (3 g) of freshly snipped chives.",
    "Then stir in ⁄4 cup (180 ml) of milk until the flour is absorbed.",
    "You should now have a firm dough.",
    "Don't worry if it's not completely smooth because the batter will still be slightly lumpy.",
    "Scoop the dumpling batter into a pot of hot stew or broth.",
    "Heat a pot of stew, soup, or broth over medium heat.",
    "Then use two spoons or a small cookie scoop to drop a mound of dumpling batter onto the hot liquid.",
    "Continue dropping the batter until you've used it all and the top of the liquid is covered with dumplings.Tip: If you use a wide pot, you'll have a larger surface area for cooking the dumplings.",
    "Cover and simmer the dumplings for 10 to 15 minutes.",
    "Turn the burner to medium-low so the liquid doesn't boil.",
    "Cook the dumplings until they're not doughy in the center when you insert a toothpick.",
    "Then serve the dumplings with some of the soup or stew.",
    "If you made small dumplings, they'll cook faster than large ones so begin checking them at the 10 minute mark.",
    "Making Round Herb Dumplings Stir the flour with salt, pepper, and the herbs.",
    "Put 1 1/4 cup (150 g) of self-raising flour into a mixing bowl and add a pinch of salt and pepper.",
    "Chop 2 tablespoons (7.5 g) of fresh parsley or thyme and add the herbs.",
    "Stir the dry ingredients until the herbs are incorporated.Tip: You can substitute any of your favorite herbs for the parsley or thyme.",
    "For example, use chopped rosemary or sage.",
    "Stir in the egg yolk and olive oil.",
    "Separate the white and yolk of 1 egg and discard the white.",
    "Put the yolk into a small ramekin and beat it a little with a fork.",
    "Add the beaten yolk to the bowl with the dry ingredients along with 1 teaspoon (4.9 ml) of olive oil.",
    "Stir until the yolk is combined.",
    "If you don't want to throw the egg white away, save it to use in another recipe.",
    "Mix in cold water to form a soft dough.",
    "Stir in 4 tablespoons (59 ml) of ice water, 1 tablespoon (15 ml) at a time.",
    "You should see the dough start to pull away from the sides of the bowl.",
    "Use your hands to knead the mixture into a pliable dough.",
    "If the dough comes together before you've added all of the water, you don't need to use it all.",
    "Adding too much water will make the dumplings heavy.",
    "Shape the dough into 8 large balls.",
    "Use a knife and cut the dough or pull off pieces of dough using your fingers.",
    "Divide the dough into 8 equal pieces and then roll them gently between your palms to make large balls.",
    "If the dough sticks to your palms, dust them lightly with flour.",
    "Put the dumplings onto broth or stew and simmer them for 15 minutes.",
    "Heat a pot of soup or stew on the stove.",
    "Press each of the round dumplings down into the hot liquid so they're halfway submerged.",
    "Cover the pot and simmer the dumplings over medium heat.",
    "If you're using stew, ensure that the stew meat is cooked before you add the dumplings.",
    "Simmer the uncovered dumplings for 15 minutes.",
    "Remove the lid from the pot and let the soup or stew bubble gently.",
    "Cook the dumplings for 15 more minutes with the lid off so some of the moisture evaporates and the dumplings finish cooking.",
    "Serve the hot soup or stew with the round herb dumplings.",
    "Insert a toothpick into the center of a dumpling.",
    "It should come out clean if they've finished cooking.",
    "If you prefer, put the pot in a 375 °F (191 °C) oven and bake the dumplings for 30 minutes."
  ],
  "tyn_section":[
    "Rolled Dumplings",
    "Mixing bowl",
    "Measuring cups and spoons",
    "Spoon",
    "Rolling pin",
    "Knife or pasta cutter wheel",
    "Large pot",
    "Toothpick",
    "Dropped Feather Dumplings",
    "Spoons",
    "Large pot with a lid",
    "Cookie scoop, optional",
    "Round Herb Dumplings",
    "Ramekin",
    "Fork",
    "Pot with a lid"
  ],
  "tyn_model":[
    "flour",
    "broth",
    "pot",
    "bowl",
    "milk",
    "butter",
    "egg",
    "parsley",
    "knife",
    "soup",
    "chives",
    "self-rising flour",
    "vegetable shortening",
    "burner",
    "toothpick",
    "fork",
    "herbs",
    "olive oil",
    "water",
    "large mixing bowl",
    "melted butter",
    "milk or buttermilk",
    "rolling pin",
    "pasta cutter",
    "fluted pastry wheel",
    "pastry cutter",
    "hot stew",
    "spoons",
    "salt",
    "pepper",
    "self-raising flour",
    "mixing bowl",
    "salt and pepper",
    "fresh parsley",
    "thyme",
    "rosemary",
    "sage",
    "egg yolk",
    "ramekin",
    "cold water",
    "ice water",
    "soup or stew",
    "stove",
    "stew",
    "oven"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.1333333333,
    "f1":0.1967213115,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4375,
    "p":0.2,
    "f1":0.2745098039
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2222222222,
    "f1":0.3076923077
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.1555555556,
    "f1":0.219895288
  }
}