{
  "title":"How to Make Tortilla Roll Ups",
  "url":"https://www.wikihow.com/Make-Tortilla-Roll-Ups",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine"
  ],
  "parts":[
    {
      "name":"Mixing the Cream Cheese",
      "steps":[
        {
          "headline":"Soften 16 ounces (450 g) of cream cheese in a mixing bowl.",
          "description":"Put the cream cheese in a glass bowl and put it in the microwave on high for 10-15 seconds. If the cream cheese isn’t soft and malleable, put it in the microwave for an additional 5 seconds. You can also leave cream cheese in its packaging for 1 hour at room temperature to soften it to the right consistency. Substituting Cream Cheese Spreads\nCream cheese spread doesn’t need to be softened before using it and can bring new flavors to your roll ups. Try jalapeño cream cheese to give your savory rolls a spicy kick. Pick strawberry cream cheese to simulate a cheesecake flavor. Opt for pumpkin spice cream cheese for a classic fall taste."
        },
        {
          "headline":"Fold in 1 pack of ranch dressing mix and green onion for a savory flavor.",
          "description":"Dump 1 oz (28 g) of the powdered mix into the bowl with cream cheese, then finely chop 2 green onions. Use a rubber spatula to mix the seasoning and onion into the cream cheese thoroughly. Try using 1 oz (28 g) of other seasonings, like oregano, fresh parsley, or dill, to change the flavoring."
        },
        {
          "headline":"Mix in cinnamon and sugar to make a sweet roll.",
          "description":"Mix 4 tablespoons (85 g) of white sugar with 1 teaspoon (2.3 g) of cinnamon into the softened cream cheese. Stir the cream cheese mixture with your rubber spatula until it's combined. Add 2 tablespoons (30 ml) of melted unsalted butter to make your roll ups more flavorful."
        },
        {
          "headline":"Spread your cream cheese mixture across 4 flour tortillas.",
          "description":"Use your rubber spatula to place 4 oz (115 g) of the cream cheese in the center of each of the 12 in (30 cm) tortillas. Spread the cream cheese thin across the tortilla’s surface. Try using different tortillas, such as sundried tomato or spinach, to add color and new flavors to your roll ups. Opt for whole wheat tortillas if you want a healthier option."
        }
      ]
    },
    {
      "name":"Adding Fillings to Your Roll Ups",
      "steps":[
        {
          "headline":"Layer sliced ham and cheese for a traditional savory flavor.",
          "description":"Place 3-4 slices of deli ham in the center of each of your tortillas. Put 2-3 slices of your favorite type of cheese on top of the ham for a classic sandwich taste. Try using American, Swiss, or cheddar cheeses for the best flavors."
        },
        {
          "headline":"Sprinkle in taco seasoning, chilis, cheese, and garlic powder to make a taco roll.",
          "description":"Use a 1 oz (28 g) packet of taco seasoning between the 4 tortillas. Spread 6 ounces (170 g) of minced chilis and 1 cup (113 g) of shredded cheese between the tortillas. Sprinkle garlic powder to flavor, or about ⅛ teaspoon (0.4 g). Use 4 ounces (110 g) of shredded chicken or taco beef between your roll ups to add more protein. Try using cheddar or Monterrey jack cheese for the best flavors."
        },
        {
          "headline":"Put in finely chopped broccoli, carrots, and peppers for a vegetarian option.",
          "description":"Chop the broccoli, carrots, and peppers into thin slices and place them in the center of your tortillas. Use about 3 cups (350 g) of vegetables total. Try different types of vegetables, like cucumbers and cauliflower, to change the flavor."
        },
        {
          "headline":"Slice fresh strawberries to give your roll up a naturally sweet flavor.",
          "description":"Dice 1 cup (200 g) of strawberries and spread them evenly across your sweet cream cheese mixture. Drizzle a small amount of honey on top of the strawberries to add more sweetness to the roll. Add other fruits, such as diced banana or kiwi, to the fruit roll up to create a delicious dessert snack. You can use more than 1 cup (200 g) of fruit, but it may be more difficult to roll up your tortillas."
        },
        {
          "headline":"Add chopped walnuts and diced apples to make a tasty fall snack.",
          "description":"Mix 1 cup (125 g) of chopped walnuts with 4-5 medium-sized diced apples in a mixing bowl. Once they are thoroughly combined, split the apple and nut mixture between the tortillas and spread them evenly on top of the cream cheese. Try different apples to change the flavor. For example, Granny Smith apples will add tartness to your roll ups while Red Delicious apples will make your rolls sweeter."
        },
        {
          "headline":"Use peanut butter and hazelnut spread for a chocolatey candy flavor.",
          "description":"Spread ¼ cup (65 g) of smooth peanut butter on each of your tortillas. Try to spread it evenly across the tortilla as best as you can. Then spread a thin layer of hazelnut spread, or about ⅛-¼ cup (32-65 g), on top of the peanut butter. Try crunchy peanut butter if you want different textures inside your roll up. Put the zest of 1 orange in the roll up if you want a hint of citrus flavor in the roll."
        }
      ]
    },
    {
      "name":"Wrapping and Serving Your Roll Ups",
      "steps":[
        {
          "headline":"Wrap the tortillas and toppings tightly.",
          "description":"Take one end of the tortilla and roll it into a tight cylinder. Try your best to hold the toppings in place so they don’t fall out of the roll up. Roll each one of the tortillas tight. Leave the ends of your roll open rather than tucking them in."
        },
        {
          "headline":"Cover the rolls with aluminum foil and refrigerate them for 2 hours.",
          "description":"Use a tight layer of aluminum foil to hold the wrap together. Completely cover the rolls so they aren’t exposed to germs. Put the rolls in your fridge for 2 hours before you plan on serving them. You can leave the rolls in the fridge overnight if you don’t plan on serving them right away."
        },
        {
          "headline":"Cut the roll into 1 in (2.5 cm) pieces.",
          "description":"Unwrap the rolls and use a sharp knife to cut the rolls into sections. Each roll should give you around 12 pieces. Make sure the knife is sharp so you don’t squash the rolls.Tip: If you need more servings of your tortilla roll-ups, make the individual rolls ⁄2 inch (1.3 cm) thick instead."
        },
        {
          "headline":"Arrange the roll ups on a platter to serve them.",
          "description":"Set the individual pieces on their sides on a large serving platter about ⁄2 inch (1.3 cm) apart from one another. Stick toothpicks into each piece so they’re held together and so you can easily pick the pieces up. Keep sweet and savory roll ups on separate platters so you don’t mix the flavors. Consider labeling your platter with the ingredients in the roll ups if you’re taking them to a party so others know what’s inside."
        }
      ]
    }
  ],
  "text":" Mixing the Cream Cheese Soften 16 ounces (450 g) of cream cheese in a mixing bowl. Put the cream cheese in a glass bowl and put it in the microwave on high for 10-15 seconds. If the cream cheese isn’t soft and malleable, put it in the microwave for an additional 5 seconds. You can also leave cream cheese in its packaging for 1 hour at room temperature to soften it to the right consistency. Substituting Cream Cheese Spreads\nCream cheese spread doesn’t need to be softened before using it and can bring new flavors to your roll ups. Try jalapeño cream cheese to give your savory rolls a spicy kick. Pick strawberry cream cheese to simulate a cheesecake flavor. Opt for pumpkin spice cream cheese for a classic fall taste. Fold in 1 pack of ranch dressing mix and green onion for a savory flavor. Dump 1 oz (28 g) of the powdered mix into the bowl with cream cheese, then finely chop 2 green onions. Use a rubber spatula to mix the seasoning and onion into the cream cheese thoroughly. Try using 1 oz (28 g) of other seasonings, like oregano, fresh parsley, or dill, to change the flavoring. Mix in cinnamon and sugar to make a sweet roll. Mix 4 tablespoons (85 g) of white sugar with 1 teaspoon (2.3 g) of cinnamon into the softened cream cheese. Stir the cream cheese mixture with your rubber spatula until it's combined. Add 2 tablespoons (30 ml) of melted unsalted butter to make your roll ups more flavorful. Spread your cream cheese mixture across 4 flour tortillas. Use your rubber spatula to place 4 oz (115 g) of the cream cheese in the center of each of the 12 in (30 cm) tortillas. Spread the cream cheese thin across the tortilla’s surface. Try using different tortillas, such as sundried tomato or spinach, to add color and new flavors to your roll ups. Opt for whole wheat tortillas if you want a healthier option. Adding Fillings to Your Roll Ups Layer sliced ham and cheese for a traditional savory flavor. Place 3-4 slices of deli ham in the center of each of your tortillas. Put 2-3 slices of your favorite type of cheese on top of the ham for a classic sandwich taste. Try using American, Swiss, or cheddar cheeses for the best flavors. Sprinkle in taco seasoning, chilis, cheese, and garlic powder to make a taco roll. Use a 1 oz (28 g) packet of taco seasoning between the 4 tortillas. Spread 6 ounces (170 g) of minced chilis and 1 cup (113 g) of shredded cheese between the tortillas. Sprinkle garlic powder to flavor, or about ⅛ teaspoon (0.4 g). Use 4 ounces (110 g) of shredded chicken or taco beef between your roll ups to add more protein. Try using cheddar or Monterrey jack cheese for the best flavors. Put in finely chopped broccoli, carrots, and peppers for a vegetarian option. Chop the broccoli, carrots, and peppers into thin slices and place them in the center of your tortillas. Use about 3 cups (350 g) of vegetables total. Try different types of vegetables, like cucumbers and cauliflower, to change the flavor. Slice fresh strawberries to give your roll up a naturally sweet flavor. Dice 1 cup (200 g) of strawberries and spread them evenly across your sweet cream cheese mixture. Drizzle a small amount of honey on top of the strawberries to add more sweetness to the roll. Add other fruits, such as diced banana or kiwi, to the fruit roll up to create a delicious dessert snack. You can use more than 1 cup (200 g) of fruit, but it may be more difficult to roll up your tortillas. Add chopped walnuts and diced apples to make a tasty fall snack. Mix 1 cup (125 g) of chopped walnuts with 4-5 medium-sized diced apples in a mixing bowl. Once they are thoroughly combined, split the apple and nut mixture between the tortillas and spread them evenly on top of the cream cheese. Try different apples to change the flavor. For example, Granny Smith apples will add tartness to your roll ups while Red Delicious apples will make your rolls sweeter. Use peanut butter and hazelnut spread for a chocolatey candy flavor. Spread ¼ cup (65 g) of smooth peanut butter on each of your tortillas. Try to spread it evenly across the tortilla as best as you can. Then spread a thin layer of hazelnut spread, or about ⅛-¼ cup (32-65 g), on top of the peanut butter. Try crunchy peanut butter if you want different textures inside your roll up. Put the zest of 1 orange in the roll up if you want a hint of citrus flavor in the roll. Wrapping and Serving Your Roll Ups Wrap the tortillas and toppings tightly. Take one end of the tortilla and roll it into a tight cylinder. Try your best to hold the toppings in place so they don’t fall out of the roll up. Roll each one of the tortillas tight. Leave the ends of your roll open rather than tucking them in. Cover the rolls with aluminum foil and refrigerate them for 2 hours. Use a tight layer of aluminum foil to hold the wrap together. Completely cover the rolls so they aren’t exposed to germs. Put the rolls in your fridge for 2 hours before you plan on serving them. You can leave the rolls in the fridge overnight if you don’t plan on serving them right away. Cut the roll into 1 in (2.5 cm) pieces. Unwrap the rolls and use a sharp knife to cut the rolls into sections. Each roll should give you around 12 pieces. Make sure the knife is sharp so you don’t squash the rolls.Tip: If you need more servings of your tortilla roll-ups, make the individual rolls ⁄2 inch (1.3 cm) thick instead. Arrange the roll ups on a platter to serve them. Set the individual pieces on their sides on a large serving platter about ⁄2 inch (1.3 cm) apart from one another. Stick toothpicks into each piece so they’re held together and so you can easily pick the pieces up. Keep sweet and savory roll ups on separate platters so you don’t mix the flavors. Consider labeling your platter with the ingredients in the roll ups if you’re taking them to a party so others know what’s inside.",
  "sentences":[
    " Mixing the Cream Cheese Soften 16 ounces (450 g) of cream cheese in a mixing bowl.",
    "Put the cream cheese in a glass bowl and put it in the microwave on high for 10-15 seconds.",
    "If the cream cheese isn’t soft and malleable, put it in the microwave for an additional 5 seconds.",
    "You can also leave cream cheese in its packaging for 1 hour at room temperature to soften it to the right consistency.",
    "Substituting Cream Cheese Spreads\nCream cheese spread doesn’t need to be softened before using it and can bring new flavors to your roll ups.",
    "Try jalapeño cream cheese to give your savory rolls a spicy kick.",
    "Pick strawberry cream cheese to simulate a cheesecake flavor.",
    "Opt for pumpkin spice cream cheese for a classic fall taste.",
    "Fold in 1 pack of ranch dressing mix and green onion for a savory flavor.",
    "Dump 1 oz (28 g) of the powdered mix into the bowl with cream cheese, then finely chop 2 green onions.",
    "Use a rubber spatula to mix the seasoning and onion into the cream cheese thoroughly.",
    "Try using 1 oz (28 g) of other seasonings, like oregano, fresh parsley, or dill, to change the flavoring.",
    "Mix in cinnamon and sugar to make a sweet roll.",
    "Mix 4 tablespoons (85 g) of white sugar with 1 teaspoon (2.3 g) of cinnamon into the softened cream cheese.",
    "Stir the cream cheese mixture with your rubber spatula until it's combined.",
    "Add 2 tablespoons (30 ml) of melted unsalted butter to make your roll ups more flavorful.",
    "Spread your cream cheese mixture across 4 flour tortillas.",
    "Use your rubber spatula to place 4 oz (115 g) of the cream cheese in the center of each of the 12 in (30 cm) tortillas.",
    "Spread the cream cheese thin across the tortilla’s surface.",
    "Try using different tortillas, such as sundried tomato or spinach, to add color and new flavors to your roll ups.",
    "Opt for whole wheat tortillas if you want a healthier option.",
    "Adding Fillings to Your Roll Ups Layer sliced ham and cheese for a traditional savory flavor.",
    "Place 3-4 slices of deli ham in the center of each of your tortillas.",
    "Put 2-3 slices of your favorite type of cheese on top of the ham for a classic sandwich taste.",
    "Try using American, Swiss, or cheddar cheeses for the best flavors.",
    "Sprinkle in taco seasoning, chilis, cheese, and garlic powder to make a taco roll.",
    "Use a 1 oz (28 g) packet of taco seasoning between the 4 tortillas.",
    "Spread 6 ounces (170 g) of minced chilis and 1 cup (113 g) of shredded cheese between the tortillas.",
    "Sprinkle garlic powder to flavor, or about ⅛ teaspoon (0.4 g).",
    "Use 4 ounces (110 g) of shredded chicken or taco beef between your roll ups to add more protein.",
    "Try using cheddar or Monterrey jack cheese for the best flavors.",
    "Put in finely chopped broccoli, carrots, and peppers for a vegetarian option.",
    "Chop the broccoli, carrots, and peppers into thin slices and place them in the center of your tortillas.",
    "Use about 3 cups (350 g) of vegetables total.",
    "Try different types of vegetables, like cucumbers and cauliflower, to change the flavor.",
    "Slice fresh strawberries to give your roll up a naturally sweet flavor.",
    "Dice 1 cup (200 g) of strawberries and spread them evenly across your sweet cream cheese mixture.",
    "Drizzle a small amount of honey on top of the strawberries to add more sweetness to the roll.",
    "Add other fruits, such as diced banana or kiwi, to the fruit roll up to create a delicious dessert snack.",
    "You can use more than 1 cup (200 g) of fruit, but it may be more difficult to roll up your tortillas.",
    "Add chopped walnuts and diced apples to make a tasty fall snack.",
    "Mix 1 cup (125 g) of chopped walnuts with 4-5 medium-sized diced apples in a mixing bowl.",
    "Once they are thoroughly combined, split the apple and nut mixture between the tortillas and spread them evenly on top of the cream cheese.",
    "Try different apples to change the flavor.",
    "For example, Granny Smith apples will add tartness to your roll ups while Red Delicious apples will make your rolls sweeter.",
    "Use peanut butter and hazelnut spread for a chocolatey candy flavor.",
    "Spread ¼ cup (65 g) of smooth peanut butter on each of your tortillas.",
    "Try to spread it evenly across the tortilla as best as you can.",
    "Then spread a thin layer of hazelnut spread, or about ⅛-¼ cup (32-65 g), on top of the peanut butter.",
    "Try crunchy peanut butter if you want different textures inside your roll up.",
    "Put the zest of 1 orange in the roll up if you want a hint of citrus flavor in the roll.",
    "Wrapping and Serving Your Roll Ups Wrap the tortillas and toppings tightly.",
    "Take one end of the tortilla and roll it into a tight cylinder.",
    "Try your best to hold the toppings in place so they don’t fall out of the roll up.",
    "Roll each one of the tortillas tight.",
    "Leave the ends of your roll open rather than tucking them in.",
    "Cover the rolls with aluminum foil and refrigerate them for 2 hours.",
    "Use a tight layer of aluminum foil to hold the wrap together.",
    "Completely cover the rolls so they aren’t exposed to germs.",
    "Put the rolls in your fridge for 2 hours before you plan on serving them.",
    "You can leave the rolls in the fridge overnight if you don’t plan on serving them right away.",
    "Cut the roll into 1 in (2.5 cm) pieces.",
    "Unwrap the rolls and use a sharp knife to cut the rolls into sections.",
    "Each roll should give you around 12 pieces.",
    "Make sure the knife is sharp so you don’t squash the rolls.Tip: If you need more servings of your tortilla roll-ups, make the individual rolls ⁄2 inch (1.3 cm) thick instead.",
    "Arrange the roll ups on a platter to serve them.",
    "Set the individual pieces on their sides on a large serving platter about ⁄2 inch (1.3 cm) apart from one another.",
    "Stick toothpicks into each piece so they’re held together and so you can easily pick the pieces up.",
    "Keep sweet and savory roll ups on separate platters so you don’t mix the flavors.",
    "Consider labeling your platter with the ingredients in the roll ups if you’re taking them to a party so others know what’s inside."
  ],
  "tyn_section":[
    "Glass mixing bowl",
    "Microwave",
    "Rubber spatula",
    "Aluminum foil",
    "Refrigerator",
    "Sharp knife",
    "Serving platter"
  ],
  "tyn_model":[
    "cream cheese",
    "tortillas",
    "peanut butter",
    "rubber spatula",
    "strawberries",
    "apples",
    "mixing bowl",
    "microwave",
    "cinnamon",
    "ham",
    "cheese",
    "taco seasoning",
    "chilis",
    "garlic powder",
    "broccoli",
    "carrots",
    "peppers",
    "walnuts",
    "hazelnut",
    "aluminum foil",
    "knife",
    "glass bowl",
    "cream cheese spread",
    "jalapeño cream cheese",
    "pumpkin spice cream cheese",
    "ranch dressing",
    "green onion",
    "bowl",
    "green onions",
    "onion",
    "oregano",
    "parsley",
    "sugar",
    "white sugar",
    "unsalted butter",
    "sundried tomato",
    "spinach",
    "deli ham",
    "shredded cheese",
    "⅛ teaspoon",
    "taco beef",
    "vegetables",
    "cucumbers",
    "sweet cream cheese",
    "honey",
    "banana",
    "fruit",
    "apple",
    "nut",
    "tortilla",
    "tortilla roll",
    "platter",
    "large serving platter",
    "toothpicks"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.0555555556,
    "f1":0.0983606557,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.1481481481,
    "f1":0.2526315789
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.1666666667,
    "f1":0.2790697674
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.1111111111,
    "f1":0.1923076923
  }
}