{
  "title":"How to Season Baked Fish",
  "url":"https://www.wikihow.com/Season-Baked-Fish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Creating a Crispy Seasoning",
      "steps":[
        {
          "headline":"Whisk 1 egg with 1 teaspoon (5 mL) of water.",
          "description":"Crack the egg into a small bowl and add the water. Use a handheld whisk to mix the egg and water until they are thoroughly combined. This mixture will help the breadcrumbs stick to the fish. Use a teaspoon to remove any eggshell from the mixture, if necessary."
        },
        {
          "headline":"Mix ⅓ cup (31 g) of bread crumbs with ¼ tsp (1.25 g) of garlic salt.",
          "description":"Measure the garlic salt and bread crumbs into a small bowl. Use a spoon to mix the ingredients until the salt is evenly dispersed in the bread crumbs. If you don’t have garlic salt, use regular salt instead."
        },
        {
          "headline":"Dip the fish into the egg and water mixture.",
          "description":"Dunk the fish into the bowl and move it around until it is completely covered with egg and water. If the bowl isn’t big enough to fit the fish in, use a pastry brush to paint the egg mixture onto the fish instead. This can be a slightly messy process. Remove any rings from your hand to avoid them getting covered in egg."
        },
        {
          "headline":"Coat the fish with the breadcrumbs mixture and place it onto a tray.",
          "description":"Dip the egg-coated fish into the breadcrumbs and salt mixture. Move the fish around and turn it over until it is completely coated with breadcrumbs. This seasoning mixture will help the fish to have a delicious crunchy texture once it is cooked. Lay the fish onto an oven-safe tray so that it is ready to bake."
        }
      ]
    },
    {
      "name":"Trying Other Seasonings",
      "steps":[
        {
          "headline":"Use salt and pepper if you want to enhance the flavour of the fish.",
          "description":"Mix 2 tablespoons of olive oil, ½ tsp of salt (2.8 grams), and ½ tsp (1 gram) of cracked pepper in a small bowl. This traditional seasoning mixture helps to bring out the natural flavour of the fish and the pepper adds a little extra spice. Use extra-virgin olive oil if you want the fish to have delicious hints of olive."
        },
        {
          "headline":"Make a mayonnaise sauce if you enjoy creamy seasonings.",
          "description":"This is a great option if you want to add a creamy texture and a refreshing flavour to your fish. Measure 1 tablespoon (15 grams) of mayonnaise, ⅛ teaspoon (0.3 grams) of onion powder, 1 tablespoon (14.5mL) of lime juice, and ⅛ teaspoon (0.8 grams) of black pepper into a bowl. Use a spoon to mix the ingredients into a smooth sauce. If possible, use real lime juice as this has the freshest flavour."
        },
        {
          "headline":"Create a herb seasoning if you want a fresh and earthy flavour.",
          "description":"This seasoning is refreshing and full of flavour. Mix 4 tablespoons (59.2 mL) of melted butter, 2 tablespoons (9.7 mL) of lemon juice, 1 minced garlic clove, 1 teaspoon (4.2 grams) of sugar, ½ teaspoon (1 gram) of pepper, ½ teaspoon (0.8 grams) of fresh chopped thyme, and 1 tablespoon (3.8 grams) of fresh chopped parsley in a small mixing bowl until they are thoroughly combined. If you don’t have any fresh herbs available, substitute them for dried herbs. Use fresh lime juice if possible as this will have a stronger taste. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tUse thyme to complement any fish. Chef Alex Hong, who's worked in the restaurant industry for over 10 years, says, \"There are a lot of super mild fishes, then there's stuff like salmon that's very fishy and intense. But really, the common herb for that is thyme, especially when paired with a lot of citrus.\""
        },
        {
          "headline":"Make a paprika and lemon seasoning to give the fish colour.",
          "description":"Paprika gives fish a beautiful red colour. Mix 3 tablespoons (44.4 mL) of melted butter, 1 tablespoon (4.9 mL) of lemon juice, ¼ teaspoon (1.4 grams) of salt, and ¼ teaspoon (0.5 grams) of paprika in a small bowl. Continue to stir the ingredients until they are thoroughly combined. The lemon in this seasoning adds a refreshing contrast to the earthy taste of the paprika. If you don’t have melted butter, use melted margarine instead."
        }
      ]
    },
    {
      "name":"Applying Seasoning to Baked Fish",
      "steps":[
        {
          "headline":"Pat the fish with a paper towel to remove any excess liquid.",
          "description":"This helps to prevent the fish from drying out and going mushy. Lay a paper towel over the top of the fish and gently push down to help draw out any moisture. If the paper towel becomes saturated, use a second paper towel to dry the rest of the liquid."
        },
        {
          "headline":"Place the fish in an oven dish with the skin side facing down.",
          "description":"This allows the top side of the fish to become nice and crispy. Place the fish in an heat-safe dish that is large enough for the fish to lie flat. This ensures that the fish cooks evenly. Place baking paper under the fish to make it easier to clean the oven dish."
        },
        {
          "headline":"Pour the seasoning evenly over the fish.",
          "description":"Pour the seasoning down the middle of the fish so that it runs down the sides of the fish and creates an even coating. If the seasoning is thick and creamy, use a knife to spread the seasoning evenly across the fish. If portions of the fish aren’t coated in seasoning, use a pastry brush to spread the seasoning over them."
        }
      ]
    }
  ],
  "text":" Creating a Crispy Seasoning Whisk 1 egg with 1 teaspoon (5 mL) of water. Crack the egg into a small bowl and add the water. Use a handheld whisk to mix the egg and water until they are thoroughly combined. This mixture will help the breadcrumbs stick to the fish. Use a teaspoon to remove any eggshell from the mixture, if necessary. Mix ⅓ cup (31 g) of bread crumbs with ¼ tsp (1.25 g) of garlic salt. Measure the garlic salt and bread crumbs into a small bowl. Use a spoon to mix the ingredients until the salt is evenly dispersed in the bread crumbs. If you don’t have garlic salt, use regular salt instead. Dip the fish into the egg and water mixture. Dunk the fish into the bowl and move it around until it is completely covered with egg and water. If the bowl isn’t big enough to fit the fish in, use a pastry brush to paint the egg mixture onto the fish instead. This can be a slightly messy process. Remove any rings from your hand to avoid them getting covered in egg. Coat the fish with the breadcrumbs mixture and place it onto a tray. Dip the egg-coated fish into the breadcrumbs and salt mixture. Move the fish around and turn it over until it is completely coated with breadcrumbs. This seasoning mixture will help the fish to have a delicious crunchy texture once it is cooked. Lay the fish onto an oven-safe tray so that it is ready to bake. Trying Other Seasonings Use salt and pepper if you want to enhance the flavour of the fish. Mix 2 tablespoons of olive oil, ½ tsp of salt (2.8 grams), and ½ tsp (1 gram) of cracked pepper in a small bowl. This traditional seasoning mixture helps to bring out the natural flavour of the fish and the pepper adds a little extra spice. Use extra-virgin olive oil if you want the fish to have delicious hints of olive. Make a mayonnaise sauce if you enjoy creamy seasonings. This is a great option if you want to add a creamy texture and a refreshing flavour to your fish. Measure 1 tablespoon (15 grams) of mayonnaise, ⅛ teaspoon (0.3 grams) of onion powder, 1 tablespoon (14.5mL) of lime juice, and ⅛ teaspoon (0.8 grams) of black pepper into a bowl. Use a spoon to mix the ingredients into a smooth sauce. If possible, use real lime juice as this has the freshest flavour. Create a herb seasoning if you want a fresh and earthy flavour. This seasoning is refreshing and full of flavour. Mix 4 tablespoons (59.2 mL) of melted butter, 2 tablespoons (9.7 mL) of lemon juice, 1 minced garlic clove, 1 teaspoon (4.2 grams) of sugar, ½ teaspoon (1 gram) of pepper, ½ teaspoon (0.8 grams) of fresh chopped thyme, and 1 tablespoon (3.8 grams) of fresh chopped parsley in a small mixing bowl until they are thoroughly combined. If you don’t have any fresh herbs available, substitute them for dried herbs. Use fresh lime juice if possible as this will have a stronger taste. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tUse thyme to complement any fish. Chef Alex Hong, who's worked in the restaurant industry for over 10 years, says, \"There are a lot of super mild fishes, then there's stuff like salmon that's very fishy and intense. But really, the common herb for that is thyme, especially when paired with a lot of citrus.\" Make a paprika and lemon seasoning to give the fish colour. Paprika gives fish a beautiful red colour. Mix 3 tablespoons (44.4 mL) of melted butter, 1 tablespoon (4.9 mL) of lemon juice, ¼ teaspoon (1.4 grams) of salt, and ¼ teaspoon (0.5 grams) of paprika in a small bowl. Continue to stir the ingredients until they are thoroughly combined. The lemon in this seasoning adds a refreshing contrast to the earthy taste of the paprika. If you don’t have melted butter, use melted margarine instead. Applying Seasoning to Baked Fish Pat the fish with a paper towel to remove any excess liquid. This helps to prevent the fish from drying out and going mushy. Lay a paper towel over the top of the fish and gently push down to help draw out any moisture. If the paper towel becomes saturated, use a second paper towel to dry the rest of the liquid. Place the fish in an oven dish with the skin side facing down. This allows the top side of the fish to become nice and crispy. Place the fish in an heat-safe dish that is large enough for the fish to lie flat. This ensures that the fish cooks evenly. Place baking paper under the fish to make it easier to clean the oven dish. Pour the seasoning evenly over the fish. Pour the seasoning down the middle of the fish so that it runs down the sides of the fish and creates an even coating. If the seasoning is thick and creamy, use a knife to spread the seasoning evenly across the fish. If portions of the fish aren’t coated in seasoning, use a pastry brush to spread the seasoning over them.",
  "sentences":[
    " Creating a Crispy Seasoning Whisk 1 egg with 1 teaspoon (5 mL) of water.",
    "Crack the egg into a small bowl and add the water.",
    "Use a handheld whisk to mix the egg and water until they are thoroughly combined.",
    "This mixture will help the breadcrumbs stick to the fish.",
    "Use a teaspoon to remove any eggshell from the mixture, if necessary.",
    "Mix ⅓ cup (31 g) of bread crumbs with ¼ tsp (1.25 g) of garlic salt.",
    "Measure the garlic salt and bread crumbs into a small bowl.",
    "Use a spoon to mix the ingredients until the salt is evenly dispersed in the bread crumbs.",
    "If you don’t have garlic salt, use regular salt instead.",
    "Dip the fish into the egg and water mixture.",
    "Dunk the fish into the bowl and move it around until it is completely covered with egg and water.",
    "If the bowl isn’t big enough to fit the fish in, use a pastry brush to paint the egg mixture onto the fish instead.",
    "This can be a slightly messy process.",
    "Remove any rings from your hand to avoid them getting covered in egg.",
    "Coat the fish with the breadcrumbs mixture and place it onto a tray.",
    "Dip the egg-coated fish into the breadcrumbs and salt mixture.",
    "Move the fish around and turn it over until it is completely coated with breadcrumbs.",
    "This seasoning mixture will help the fish to have a delicious crunchy texture once it is cooked.",
    "Lay the fish onto an oven-safe tray so that it is ready to bake.",
    "Trying Other Seasonings Use salt and pepper if you want to enhance the flavour of the fish.",
    "Mix 2 tablespoons of olive oil, ½ tsp of salt (2.8 grams), and ½ tsp (1 gram) of cracked pepper in a small bowl.",
    "This traditional seasoning mixture helps to bring out the natural flavour of the fish and the pepper adds a little extra spice.",
    "Use extra-virgin olive oil if you want the fish to have delicious hints of olive.",
    "Make a mayonnaise sauce if you enjoy creamy seasonings.",
    "This is a great option if you want to add a creamy texture and a refreshing flavour to your fish.",
    "Measure 1 tablespoon (15 grams) of mayonnaise, ⅛ teaspoon (0.3 grams) of onion powder, 1 tablespoon (14.5mL) of lime juice, and ⅛ teaspoon (0.8 grams) of black pepper into a bowl.",
    "Use a spoon to mix the ingredients into a smooth sauce.",
    "If possible, use real lime juice as this has the freshest flavour.",
    "Create a herb seasoning if you want a fresh and earthy flavour.",
    "This seasoning is refreshing and full of flavour.",
    "Mix 4 tablespoons (59.2 mL) of melted butter, 2 tablespoons (9.7 mL) of lemon juice, 1 minced garlic clove, 1 teaspoon (4.2 grams) of sugar, ½ teaspoon (1 gram) of pepper, ½ teaspoon (0.8 grams) of fresh chopped thyme, and 1 tablespoon (3.8 grams) of fresh chopped parsley in a small mixing bowl until they are thoroughly combined.",
    "If you don’t have any fresh herbs available, substitute them for dried herbs.",
    "Use fresh lime juice if possible as this will have a stronger taste.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco.",
    "He has been working in restaurants for over ten years.",
    "Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants.",
    "Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tUse thyme to complement any fish.",
    "Chef Alex Hong, who's worked in the restaurant industry for over 10 years, says, \"There are a lot of super mild fishes, then there's stuff like salmon that's very fishy and intense.",
    "But really, the common herb for that is thyme, especially when paired with a lot of citrus.\"",
    "Make a paprika and lemon seasoning to give the fish colour.",
    "Paprika gives fish a beautiful red colour.",
    "Mix 3 tablespoons (44.4 mL) of melted butter, 1 tablespoon (4.9 mL) of lemon juice, ¼ teaspoon (1.4 grams) of salt, and ¼ teaspoon (0.5 grams) of paprika in a small bowl.",
    "Continue to stir the ingredients until they are thoroughly combined.",
    "The lemon in this seasoning adds a refreshing contrast to the earthy taste of the paprika.",
    "If you don’t have melted butter, use melted margarine instead.",
    "Applying Seasoning to Baked Fish Pat the fish with a paper towel to remove any excess liquid.",
    "This helps to prevent the fish from drying out and going mushy.",
    "Lay a paper towel over the top of the fish and gently push down to help draw out any moisture.",
    "If the paper towel becomes saturated, use a second paper towel to dry the rest of the liquid.",
    "Place the fish in an oven dish with the skin side facing down.",
    "This allows the top side of the fish to become nice and crispy.",
    "Place the fish in an heat-safe dish that is large enough for the fish to lie flat.",
    "This ensures that the fish cooks evenly.",
    "Place baking paper under the fish to make it easier to clean the oven dish.",
    "Pour the seasoning evenly over the fish.",
    "Pour the seasoning down the middle of the fish so that it runs down the sides of the fish and creates an even coating.",
    "If the seasoning is thick and creamy, use a knife to spread the seasoning evenly across the fish.",
    "If portions of the fish aren’t coated in seasoning, use a pastry brush to spread the seasoning over them."
  ],
  "tyn_section":[
    "2 small bowls",
    "Whisk",
    "Oven tray",
    "Measuring spoons",
    "Spoon",
    "Small bowl",
    "Paper towels"
  ],
  "tyn_model":[
    "seasoning",
    "water",
    "salt",
    "paprika",
    "paper towel",
    "small bowl",
    "egg",
    "bowl",
    "lime juice",
    "bread crumbs",
    "garlic salt",
    "spoon",
    "pastry brush",
    "tray",
    "pepper",
    "⅛ teaspoon",
    "melted butter",
    "lemon juice",
    "herbs",
    "thyme",
    "lemon",
    "oven dish",
    "handheld whisk",
    "⅓ cup",
    "regular salt",
    "salt and pepper",
    "olive oil",
    "cracked pepper",
    "extra-virgin olive oil",
    "mayonnaise sauce",
    "mayonnaise",
    "onion powder",
    "black pepper",
    "garlic",
    "sugar",
    "fresh chopped thyme",
    "parsley",
    "small mixing bowl",
    "sorrel",
    "culinary institute of america",
    "quince",
    "fish",
    "salmon",
    "citrus",
    "butter",
    "margarine",
    "baking paper",
    "knife"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0416666667,
    "f1":0.0727272727,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.125,
    "f1":0.2051282051
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.1875,
    "f1":0.297029703
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.0625,
    "f1":0.1025641026
  }
}