{
  "title":"How to Clean a Salt Block",
  "url":"https://www.wikihow.com/Clean-a-Salt-Block",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Cookware"
  ],
  "methods":[
    {
      "name":"Rinsing the Salt Block",
      "steps":[
        {
          "headline":"Let the block sit overnight after you've cooked on it.",
          "description":"Do not clean the block immediately after using it. It's better for the block if you let it sit for 4–6 hours prior to cleaning. The heat from your oven will have raised the temperature of the interior of the block, and you'll damage the block if you clean it before it's completely cool. If you try to clean the salt block before 4–6 hours have passed, the block may break or crack in 2."
        },
        {
          "headline":"Rinse the salt block under warm tap water.",
          "description":"Carry your cooled salt block to the sink and turn on a moderate stream of warm tap water. Hold the block beneath the water for about 30 seconds. The tap water will rinse off any food remnants, spices, herbs, or other seasonings that may be on the surface of the block. Avoid rinsing the salt block with hot water, as the hot water will cause the salt to gradually erode. It's not necessary to use soap when you rinse the salt block, since the salt is naturally antibacterial."
        },
        {
          "headline":"Scrub the dirty surface of the block with a wet sponge.",
          "description":"Depending on what you cooked on top of the salt block, there will be some food residue left behind. If you cooked fatty meat, you'll likely see glazing on the salt. Turn off the tap water, and rub a wet sponge over the cooking surface of the salt block. You should see the surface of the block lighten as you remove food stains. Do not leave the tap water running while you scrub the block. Doing so will erode the salt more quickly."
        },
        {
          "headline":"Turn the tap back on and rinse the salt block.",
          "description":"Once you've scrubbed away whatever food residue and glazing were on the salt block, turn the tap back on. Rinse off the salt block again, using your hand to brush off any crumbs or food remnants. Keep the block under warm tap water for 15–20 seconds. Rinsing the block for a second time will remove any lingering food particles that otherwise would remain on the surface of the block."
        },
        {
          "headline":"Dry the salt block with a clean cotton cloth.",
          "description":"Dab the cotton cloth across the wet surfaces of the salt block until you've removed all traces of water. If you don't have a clean cotton cloth on hand, you can use paper towels instead. If you neglect to dry the block and put it away wet, the residual water will soak into the salt and weaken its structure."
        },
        {
          "headline":"Store the block in a humidity-free location.",
          "description":"Keep the salt block in an area of your kitchen with air flow, where humidity and dank air can't build up. For example, keep the salt block on your counter, leaning back against the backsplash. Or, set the block on your windowsill to maximize the airflow it receives. Do not store the salt block in a damp cellar or humid pantry cabinet."
        }
      ]
    },
    {
      "name":"Removing Tough Stains",
      "steps":[
        {
          "headline":"Remove light stains with a kitchen scrubber sponge.",
          "description":"Rub the coarse, green side of a dry scrubber sponge across the surface of the block in small, circular strokes. This method of cleaning removes the uppermost layer of salt from the block. The scrubber will also remove any food bits or mild stains that were left behind by food. This is a great way to clean salt blocks that were used for serving food and were not used in an oven or grill."
        },
        {
          "headline":"Scrub tough stains with a steel wool scouring pad.",
          "description":"If you've used your salt block to cook, for example, juicy hamburgers or fatty steaks, you may find that an ordinary sponge isn't enough to remove the food residue. In this case, use a steel wool pad instead of the sponge when you're clearing off the salt block. Scrub the steel wool pad over the stain until it's been removed. If you don't already own a steel wool pad, you can purchase one at any large supermarket or home-supply store. They're inexpensive and should cost less than $3 USD."
        },
        {
          "headline":"Scrape off caked-on stains with a razor blade.",
          "description":"Set the razor blade against the surface of the salt block at a 45° angle. Slide it forward so the edge of the blade goes under food residue that's caked on the surface of the block. If you're worried that caked-on stains may be difficult to get off once they've set, scrape them off once the salt block is cool enough to touch. Scrape off caked-on material before rinsing your salt block and scrubbing it with a sponge. Since this method of cleaning doesn't involve water, you don't need to wait 4–6 hours before scraping off stains. Purchase a set of razor blades and a holder (so you don't cut your fingers) at a hardware store or large home-supply store."
        }
      ]
    }
  ],
  "text":" Rinsing the Salt Block Let the block sit overnight after you've cooked on it. Do not clean the block immediately after using it. It's better for the block if you let it sit for 4–6 hours prior to cleaning. The heat from your oven will have raised the temperature of the interior of the block, and you'll damage the block if you clean it before it's completely cool. If you try to clean the salt block before 4–6 hours have passed, the block may break or crack in 2. Rinse the salt block under warm tap water. Carry your cooled salt block to the sink and turn on a moderate stream of warm tap water. Hold the block beneath the water for about 30 seconds. The tap water will rinse off any food remnants, spices, herbs, or other seasonings that may be on the surface of the block. Avoid rinsing the salt block with hot water, as the hot water will cause the salt to gradually erode. It's not necessary to use soap when you rinse the salt block, since the salt is naturally antibacterial. Scrub the dirty surface of the block with a wet sponge. Depending on what you cooked on top of the salt block, there will be some food residue left behind. If you cooked fatty meat, you'll likely see glazing on the salt. Turn off the tap water, and rub a wet sponge over the cooking surface of the salt block. You should see the surface of the block lighten as you remove food stains. Do not leave the tap water running while you scrub the block. Doing so will erode the salt more quickly. Turn the tap back on and rinse the salt block. Once you've scrubbed away whatever food residue and glazing were on the salt block, turn the tap back on. Rinse off the salt block again, using your hand to brush off any crumbs or food remnants. Keep the block under warm tap water for 15–20 seconds. Rinsing the block for a second time will remove any lingering food particles that otherwise would remain on the surface of the block. Dry the salt block with a clean cotton cloth. Dab the cotton cloth across the wet surfaces of the salt block until you've removed all traces of water. If you don't have a clean cotton cloth on hand, you can use paper towels instead. If you neglect to dry the block and put it away wet, the residual water will soak into the salt and weaken its structure. Store the block in a humidity-free location. Keep the salt block in an area of your kitchen with air flow, where humidity and dank air can't build up. For example, keep the salt block on your counter, leaning back against the backsplash. Or, set the block on your windowsill to maximize the airflow it receives. Do not store the salt block in a damp cellar or humid pantry cabinet. Removing Tough Stains Remove light stains with a kitchen scrubber sponge. Rub the coarse, green side of a dry scrubber sponge across the surface of the block in small, circular strokes. This method of cleaning removes the uppermost layer of salt from the block. The scrubber will also remove any food bits or mild stains that were left behind by food. This is a great way to clean salt blocks that were used for serving food and were not used in an oven or grill. Scrub tough stains with a steel wool scouring pad. If you've used your salt block to cook, for example, juicy hamburgers or fatty steaks, you may find that an ordinary sponge isn't enough to remove the food residue. In this case, use a steel wool pad instead of the sponge when you're clearing off the salt block. Scrub the steel wool pad over the stain until it's been removed. If you don't already own a steel wool pad, you can purchase one at any large supermarket or home-supply store. They're inexpensive and should cost less than $3 USD. Scrape off caked-on stains with a razor blade. Set the razor blade against the surface of the salt block at a 45° angle. Slide it forward so the edge of the blade goes under food residue that's caked on the surface of the block. If you're worried that caked-on stains may be difficult to get off once they've set, scrape them off once the salt block is cool enough to touch. Scrape off caked-on material before rinsing your salt block and scrubbing it with a sponge. Since this method of cleaning doesn't involve water, you don't need to wait 4–6 hours before scraping off stains. Purchase a set of razor blades and a holder (so you don't cut your fingers) at a hardware store or large home-supply store.",
  "sentences":[
    " Rinsing the Salt Block Let the block sit overnight after you've cooked on it.",
    "Do not clean the block immediately after using it.",
    "It's better for the block if you let it sit for 4–6 hours prior to cleaning.",
    "The heat from your oven will have raised the temperature of the interior of the block, and you'll damage the block if you clean it before it's completely cool.",
    "If you try to clean the salt block before 4–6 hours have passed, the block may break or crack in 2.",
    "Rinse the salt block under warm tap water.",
    "Carry your cooled salt block to the sink and turn on a moderate stream of warm tap water.",
    "Hold the block beneath the water for about 30 seconds.",
    "The tap water will rinse off any food remnants, spices, herbs, or other seasonings that may be on the surface of the block.",
    "Avoid rinsing the salt block with hot water, as the hot water will cause the salt to gradually erode.",
    "It's not necessary to use soap when you rinse the salt block, since the salt is naturally antibacterial.",
    "Scrub the dirty surface of the block with a wet sponge.",
    "Depending on what you cooked on top of the salt block, there will be some food residue left behind.",
    "If you cooked fatty meat, you'll likely see glazing on the salt.",
    "Turn off the tap water, and rub a wet sponge over the cooking surface of the salt block.",
    "You should see the surface of the block lighten as you remove food stains.",
    "Do not leave the tap water running while you scrub the block.",
    "Doing so will erode the salt more quickly.",
    "Turn the tap back on and rinse the salt block.",
    "Once you've scrubbed away whatever food residue and glazing were on the salt block, turn the tap back on.",
    "Rinse off the salt block again, using your hand to brush off any crumbs or food remnants.",
    "Keep the block under warm tap water for 15–20 seconds.",
    "Rinsing the block for a second time will remove any lingering food particles that otherwise would remain on the surface of the block.",
    "Dry the salt block with a clean cotton cloth.",
    "Dab the cotton cloth across the wet surfaces of the salt block until you've removed all traces of water.",
    "If you don't have a clean cotton cloth on hand, you can use paper towels instead.",
    "If you neglect to dry the block and put it away wet, the residual water will soak into the salt and weaken its structure.",
    "Store the block in a humidity-free location.",
    "Keep the salt block in an area of your kitchen with air flow, where humidity and dank air can't build up.",
    "For example, keep the salt block on your counter, leaning back against the backsplash.",
    "Or, set the block on your windowsill to maximize the airflow it receives.",
    "Do not store the salt block in a damp cellar or humid pantry cabinet.",
    "Removing Tough Stains Remove light stains with a kitchen scrubber sponge.",
    "Rub the coarse, green side of a dry scrubber sponge across the surface of the block in small, circular strokes.",
    "This method of cleaning removes the uppermost layer of salt from the block.",
    "The scrubber will also remove any food bits or mild stains that were left behind by food.",
    "This is a great way to clean salt blocks that were used for serving food and were not used in an oven or grill.",
    "Scrub tough stains with a steel wool scouring pad.",
    "If you've used your salt block to cook, for example, juicy hamburgers or fatty steaks, you may find that an ordinary sponge isn't enough to remove the food residue.",
    "In this case, use a steel wool pad instead of the sponge when you're clearing off the salt block.",
    "Scrub the steel wool pad over the stain until it's been removed.",
    "If you don't already own a steel wool pad, you can purchase one at any large supermarket or home-supply store.",
    "They're inexpensive and should cost less than $3 USD.",
    "Scrape off caked-on stains with a razor blade.",
    "Set the razor blade against the surface of the salt block at a 45° angle.",
    "Slide it forward so the edge of the blade goes under food residue that's caked on the surface of the block.",
    "If you're worried that caked-on stains may be difficult to get off once they've set, scrape them off once the salt block is cool enough to touch.",
    "Scrape off caked-on material before rinsing your salt block and scrubbing it with a sponge.",
    "Since this method of cleaning doesn't involve water, you don't need to wait 4–6 hours before scraping off stains.",
    "Purchase a set of razor blades and a holder (so you don't cut your fingers) at a hardware store or large home-supply store."
  ],
  "tyn_section":[
    "Salt block",
    "Kitchen tap",
    "Sponge",
    "Cotton cloth",
    "Paper towels (optional)",
    "Scrubber sponge",
    "Steel wool scouring pad",
    "Razor blade"
  ],
  "tyn_model":[
    "salt",
    "salt block",
    "tap water",
    "water",
    "sponge",
    "steel wool pad",
    "wet sponge",
    "tap",
    "oven",
    "soap",
    "cotton cloth",
    "paper towels",
    "kitchen scrubber sponge",
    "dry scrubber sponge",
    "scrubber",
    "salt blocks",
    "steel wool scouring pad",
    "razor blade",
    "razor",
    "razor blades"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.25,
    "f1":0.3571428571,
    "avg_pos":0.05
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.7,
    "f1":0.8235294118
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.85,
    "f1":0.9189189189
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.875,
    "p":0.45,
    "f1":0.5943396226
  }
}