{
  "title":"How to Make Oats with Milk",
  "url":"https://www.wikihow.com/Make-Oats-with-Milk",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Breakfast Cereal",
    "Oatmeal and Porridge"
  ],
  "methods":[
    {
      "name":"Cooking Oats with Milk on the Stovetop",
      "steps":[
        {
          "headline":"Boil 1 cup (250 mL) of milk on the stovetop.",
          "description":"Measure 1 cup (250 mL) of your favourite type of milk into a small saucepan. Place the saucepan on the stovetop at a high heat and wait for it to boil. If you are lactose intolerant, almond, coconut, soy, and oat milk will work for this recipe. If you want creamy tasting oats, use full-fat milk. Multiply the ingredients by the number of people you are serving. For example, if you are serving 5 people, add 5 portions of each ingredient."
        },
        {
          "headline":"Mix ½ cup (45 grams) of rolled oats into the milk.",
          "description":"Measure the oats and carefully pour them into the hot milk. Use a wooden spoon to the mix the oats and milk until they are thoroughly combined. Rolled oats are sometimes labelled as old-fashioned oats. Add a pinch of salt, if desired."
        },
        {
          "headline":"Cook the oats for 5 minutes over medium heat.",
          "description":"Turn the heat down to medium to stop the oats from sticking to the bottom of the saucepan. Stir the oats approximately every minute to ensure that they cook evenly. Cook quick oats for 1 minute and steel-cut oats for 20 minutes. Use a spoon to taste the oats and check that they are cooked to your desired consistency. If they’re still a little firm, leave them to cook for 1 more minute."
        },
        {
          "headline":"Leave the oats to cool for 3 minutes.",
          "description":"Remove the saucepan of oats from the heat and place it on a wooden chopping board or heat-proof pad. This allows the oats to continue to soften and makes them a more palatable temperature to eat. If the oats still feel too hot to eat after 3 minutes, leave them to cool for another 2 minutes."
        }
      ]
    },
    {
      "name":"Making Oats with Milk in the Microwave",
      "steps":[
        {
          "headline":"Mix 1 cup (250 mL) of milk and ½ cup (45 grams) of rolled oats into a bowl.",
          "description":"Measure the rolled oats and milk into a microwave-safe bowl that can hold at least 2 cups (500 mL) of liquid. Stir the rolled oats and milk with a spoon until they are thoroughly combined. Use your favourite type of milk. Full-fat milk will give the oats the creamiest taste, whereas low-fat milk will give a lighter taste. Nut milk and soy milk also work with this recipe. Multiply the ingredients by the number of people you are serving. For example, if you are serving 5 people, add 5 portions of each ingredient. Add a pinch of salt, if desired."
        },
        {
          "headline":"Microwave the oats on high for 3 minutes.",
          "description":"Place the bowl of oats into the microwave. Set the microwave to cook the oats for 3 minutes on the hottest setting. If your microwave doesn’t have a turning wheel, turn the bowl around after 1.5 minutes. Microwave steel-cut oats and quick-oats for 1 ½ minutes."
        },
        {
          "headline":"Stir the cooked oats.",
          "description":"Remove the cooked oats from the microwave and use a spoon to stir the mixture until the liquid is evenly distributed through the oats. Use an oven mitt when touching the hot bowl to avoid burns. Leave the oats to cool until they are your desired temperature."
        }
      ]
    },
    {
      "name":"Making Overnight Oats",
      "steps":[
        {
          "headline":"Measure the oats and milk into a container with a lid.",
          "description":"Add 1/2 cup (125 mL) of milk and 1/2 cup old fashioned oats into a container. Mason jars and plastic bowls work well for this method. Use full-fat milk for a creamy taste or use low-fat milk for a lighter texture. Multiply the ingredients by the number of people you are serving. For example, if you are serving 5 people, add 5 portions of each ingredient."
        },
        {
          "headline":"Mix the oats and milk with a spoon.",
          "description":"Stir the ingredients until the oats are completely dispersed through the milk. Make sure to stir the oats that are at the bottom of the container. If you’re having trouble mixing the oats, put the lid on tightly and shake the container."
        },
        {
          "headline":"Place the container in the fridge overnight.",
          "description":"Put the lid on the container of oats and transfer it to the fridge. Leave the oats in the fridge overnight or for 8 hours. Enjoy the oats cold in the morning. Serve the oats with your favourite toppings."
        }
      ]
    },
    {
      "name":"Adding Toppings to Your Oats",
      "steps":[
        {
          "headline":"Top your oats with your favourite fruit if you want a fresh taste.",
          "description":"Chop your favourite seasonal fruit into slices and place it on top of the oats. Alternatively, use tinned fruit to add a fresh flavour to your breakfast. Blackberry and apple is a delicious flavour combination. Chopped bananas add natural sweetness to the oats. Freshly-sliced plums and apples are a sweet and refreshing choice."
        },
        {
          "headline":"Drizzle honey or syrup on top of the oats for added sweetness.",
          "description":"Choose a runny honey or a syrup, such as maple syrup or golden syrup. Pour a small amount of the sweetener evenly over the oats to add a delicious, sweet flavour. Maple syrup works well with sliced plums and pears. Honey tastes delicious with apples and berries."
        },
        {
          "headline":"Pour milk, yoghurt, or cream over the oats for a rich, creamy texture.",
          "description":"Adding extra liquid also helps to cool the oats down. If you want an extra creamy flavour, opt for cream. If you prefer a lighter flavour, use milk instead. Experiment with different flavoured yoghurts, such as Greek, fruit, or honey-flavoured yoghurt. Greek yoghurt, honey, and berries are a delicious combination on top of oats."
        }
      ]
    }
  ],
  "text":" Cooking Oats with Milk on the Stovetop Boil 1 cup (250 mL) of milk on the stovetop. Measure 1 cup (250 mL) of your favourite type of milk into a small saucepan. Place the saucepan on the stovetop at a high heat and wait for it to boil. If you are lactose intolerant, almond, coconut, soy, and oat milk will work for this recipe. If you want creamy tasting oats, use full-fat milk. Multiply the ingredients by the number of people you are serving. For example, if you are serving 5 people, add 5 portions of each ingredient. Mix ½ cup (45 grams) of rolled oats into the milk. Measure the oats and carefully pour them into the hot milk. Use a wooden spoon to the mix the oats and milk until they are thoroughly combined. Rolled oats are sometimes labelled as old-fashioned oats. Add a pinch of salt, if desired. Cook the oats for 5 minutes over medium heat. Turn the heat down to medium to stop the oats from sticking to the bottom of the saucepan. Stir the oats approximately every minute to ensure that they cook evenly. Cook quick oats for 1 minute and steel-cut oats for 20 minutes. Use a spoon to taste the oats and check that they are cooked to your desired consistency. If they’re still a little firm, leave them to cook for 1 more minute. Leave the oats to cool for 3 minutes. Remove the saucepan of oats from the heat and place it on a wooden chopping board or heat-proof pad. This allows the oats to continue to soften and makes them a more palatable temperature to eat. If the oats still feel too hot to eat after 3 minutes, leave them to cool for another 2 minutes. Making Oats with Milk in the Microwave Mix 1 cup (250 mL) of milk and ½ cup (45 grams) of rolled oats into a bowl. Measure the rolled oats and milk into a microwave-safe bowl that can hold at least 2 cups (500 mL) of liquid. Stir the rolled oats and milk with a spoon until they are thoroughly combined. Use your favourite type of milk. Full-fat milk will give the oats the creamiest taste, whereas low-fat milk will give a lighter taste. Nut milk and soy milk also work with this recipe. Multiply the ingredients by the number of people you are serving. For example, if you are serving 5 people, add 5 portions of each ingredient. Add a pinch of salt, if desired. Microwave the oats on high for 3 minutes. Place the bowl of oats into the microwave. Set the microwave to cook the oats for 3 minutes on the hottest setting. If your microwave doesn’t have a turning wheel, turn the bowl around after 1.5 minutes. Microwave steel-cut oats and quick-oats for 1 ½ minutes. Stir the cooked oats. Remove the cooked oats from the microwave and use a spoon to stir the mixture until the liquid is evenly distributed through the oats. Use an oven mitt when touching the hot bowl to avoid burns. Leave the oats to cool until they are your desired temperature. Making Overnight Oats Measure the oats and milk into a container with a lid. Add 1/2 cup (125 mL) of milk and 1/2 cup old fashioned oats into a container. Mason jars and plastic bowls work well for this method. Use full-fat milk for a creamy taste or use low-fat milk for a lighter texture. Multiply the ingredients by the number of people you are serving. For example, if you are serving 5 people, add 5 portions of each ingredient. Mix the oats and milk with a spoon. Stir the ingredients until the oats are completely dispersed through the milk. Make sure to stir the oats that are at the bottom of the container. If you’re having trouble mixing the oats, put the lid on tightly and shake the container. Place the container in the fridge overnight. Put the lid on the container of oats and transfer it to the fridge. Leave the oats in the fridge overnight or for 8 hours. Enjoy the oats cold in the morning. Serve the oats with your favourite toppings. Adding Toppings to Your Oats Top your oats with your favourite fruit if you want a fresh taste. Chop your favourite seasonal fruit into slices and place it on top of the oats. Alternatively, use tinned fruit to add a fresh flavour to your breakfast. Blackberry and apple is a delicious flavour combination. Chopped bananas add natural sweetness to the oats. Freshly-sliced plums and apples are a sweet and refreshing choice. Drizzle honey or syrup on top of the oats for added sweetness. Choose a runny honey or a syrup, such as maple syrup or golden syrup. Pour a small amount of the sweetener evenly over the oats to add a delicious, sweet flavour. Maple syrup works well with sliced plums and pears. Honey tastes delicious with apples and berries. Pour milk, yoghurt, or cream over the oats for a rich, creamy texture. Adding extra liquid also helps to cool the oats down. If you want an extra creamy flavour, opt for cream. If you prefer a lighter flavour, use milk instead. Experiment with different flavoured yoghurts, such as Greek, fruit, or honey-flavoured yoghurt. Greek yoghurt, honey, and berries are a delicious combination on top of oats.",
  "sentences":[
    " Cooking Oats with Milk on the Stovetop Boil 1 cup (250 mL) of milk on the stovetop.",
    "Measure 1 cup (250 mL) of your favourite type of milk into a small saucepan.",
    "Place the saucepan on the stovetop at a high heat and wait for it to boil.",
    "If you are lactose intolerant, almond, coconut, soy, and oat milk will work for this recipe.",
    "If you want creamy tasting oats, use full-fat milk.",
    "Multiply the ingredients by the number of people you are serving.",
    "For example, if you are serving 5 people, add 5 portions of each ingredient.",
    "Mix ½ cup (45 grams) of rolled oats into the milk.",
    "Measure the oats and carefully pour them into the hot milk.",
    "Use a wooden spoon to the mix the oats and milk until they are thoroughly combined.",
    "Rolled oats are sometimes labelled as old-fashioned oats.",
    "Add a pinch of salt, if desired.",
    "Cook the oats for 5 minutes over medium heat.",
    "Turn the heat down to medium to stop the oats from sticking to the bottom of the saucepan.",
    "Stir the oats approximately every minute to ensure that they cook evenly.",
    "Cook quick oats for 1 minute and steel-cut oats for 20 minutes.",
    "Use a spoon to taste the oats and check that they are cooked to your desired consistency.",
    "If they’re still a little firm, leave them to cook for 1 more minute.",
    "Leave the oats to cool for 3 minutes.",
    "Remove the saucepan of oats from the heat and place it on a wooden chopping board or heat-proof pad.",
    "This allows the oats to continue to soften and makes them a more palatable temperature to eat.",
    "If the oats still feel too hot to eat after 3 minutes, leave them to cool for another 2 minutes.",
    "Making Oats with Milk in the Microwave Mix 1 cup (250 mL) of milk and ½ cup (45 grams) of rolled oats into a bowl.",
    "Measure the rolled oats and milk into a microwave-safe bowl that can hold at least 2 cups (500 mL) of liquid.",
    "Stir the rolled oats and milk with a spoon until they are thoroughly combined.",
    "Use your favourite type of milk.",
    "Full-fat milk will give the oats the creamiest taste, whereas low-fat milk will give a lighter taste.",
    "Nut milk and soy milk also work with this recipe.",
    "Multiply the ingredients by the number of people you are serving.",
    "For example, if you are serving 5 people, add 5 portions of each ingredient.",
    "Add a pinch of salt, if desired.",
    "Microwave the oats on high for 3 minutes.",
    "Place the bowl of oats into the microwave.",
    "Set the microwave to cook the oats for 3 minutes on the hottest setting.",
    "If your microwave doesn’t have a turning wheel, turn the bowl around after 1.5 minutes.",
    "Microwave steel-cut oats and quick-oats for 1 ½ minutes.",
    "Stir the cooked oats.",
    "Remove the cooked oats from the microwave and use a spoon to stir the mixture until the liquid is evenly distributed through the oats.",
    "Use an oven mitt when touching the hot bowl to avoid burns.",
    "Leave the oats to cool until they are your desired temperature.",
    "Making Overnight Oats Measure the oats and milk into a container with a lid.",
    "Add 1/2 cup (125 mL) of milk and 1/2 cup old fashioned oats into a container.",
    "Mason jars and plastic bowls work well for this method.",
    "Use full-fat milk for a creamy taste or use low-fat milk for a lighter texture.",
    "Multiply the ingredients by the number of people you are serving.",
    "For example, if you are serving 5 people, add 5 portions of each ingredient.",
    "Mix the oats and milk with a spoon.",
    "Stir the ingredients until the oats are completely dispersed through the milk.",
    "Make sure to stir the oats that are at the bottom of the container.",
    "If you’re having trouble mixing the oats, put the lid on tightly and shake the container.",
    "Place the container in the fridge overnight.",
    "Put the lid on the container of oats and transfer it to the fridge.",
    "Leave the oats in the fridge overnight or for 8 hours.",
    "Enjoy the oats cold in the morning.",
    "Serve the oats with your favourite toppings.",
    "Adding Toppings to Your Oats Top your oats with your favourite fruit if you want a fresh taste.",
    "Chop your favourite seasonal fruit into slices and place it on top of the oats.",
    "Alternatively, use tinned fruit to add a fresh flavour to your breakfast.",
    "Blackberry and apple is a delicious flavour combination.",
    "Chopped bananas add natural sweetness to the oats.",
    "Freshly-sliced plums and apples are a sweet and refreshing choice.",
    "Drizzle honey or syrup on top of the oats for added sweetness.",
    "Choose a runny honey or a syrup, such as maple syrup or golden syrup.",
    "Pour a small amount of the sweetener evenly over the oats to add a delicious, sweet flavour.",
    "Maple syrup works well with sliced plums and pears.",
    "Honey tastes delicious with apples and berries.",
    "Pour milk, yoghurt, or cream over the oats for a rich, creamy texture.",
    "Adding extra liquid also helps to cool the oats down.",
    "If you want an extra creamy flavour, opt for cream.",
    "If you prefer a lighter flavour, use milk instead.",
    "Experiment with different flavoured yoghurts, such as Greek, fruit, or honey-flavoured yoghurt.",
    "Greek yoghurt, honey, and berries are a delicious combination on top of oats."
  ],
  "tyn_section":[
    "Stovetop",
    "Wooden spoon",
    "Measuring cups",
    "Small saucepan",
    "Wooden chopping board",
    "Microwave",
    "Microwavable bowl with a 2- cup volume",
    "Oven mitt",
    "Spoon",
    "Overnight Oats",
    "Container"
  ],
  "tyn_model":[
    "oats",
    "milk",
    "container",
    "spoon",
    "bowl",
    "microwave",
    "honey",
    "saucepan",
    "fridge",
    "yoghurt",
    "salt",
    "plums",
    "syrup",
    "maple syrup",
    "cream",
    "small saucepan",
    "oat milk",
    "full-fat milk",
    "wooden spoon",
    "steel-",
    "microwave-safe bowl",
    "nut milk",
    "steel-cut oats",
    "quick-oats",
    "oven mitt",
    "old fashioned oats",
    "mason jars",
    "bananas",
    "apples",
    "golden syrup",
    "sweetener",
    "pears",
    "yoghurts",
    "berries"
  ],
  "simple_metrics":{
    "r":0.5454545455,
    "p":0.1764705882,
    "f1":0.2666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6363636364,
    "p":0.2352941176,
    "f1":0.3435582822
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6363636364,
    "p":0.2647058824,
    "f1":0.3738872404
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5454545455,
    "p":0.1764705882,
    "f1":0.2666666667
  }
}