{
  "title":"How to Roast Pork Leg",
  "url":"https://www.wikihow.com/Roast-Pork-Leg",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork"
  ],
  "methods":[
    {
      "name":"Roasting Traditional Pork Leg",
      "steps":[
        {
          "headline":"Preheat your oven to 465 °F (241 °C).",
          "description":"Electric ovens take between 10 to 15 minutes to preheat, while gas ovens take about 5 to 10 minutes. Be sure to place the oven rack into the highest position before turning it on. Use an oven thermometer if you have one—it's a more accurate measurement of internal oven temperature."
        },
        {
          "headline":"Score the surface of your pork leg.",
          "description":"Place your 4 pounds (1.8 kg) of pork leg into a shallow roasting pan. Using a smooth chef's knife, score diagonal lines on top of the meat in a vertical pattern, taking care that each is spaced about 1 inch (2.5 cm) from each other. Afterward, repeat the process with diagonal lines in the opposite direction to create a crosshatch pattern. Penetrate the meat about ⁄8 to ⁄4 inch (0.32 to 0.64 cm) with each cut."
        },
        {
          "headline":"Rub salt and oil into the scored area of the pork leg.",
          "description":"Pour your 2 tablespoons (30 mL) of oil over the scored area followed by 1 teaspoon (5.69 grams) of sea salt. Use a basting brush to brush the oil and salt across the scored surface of the meat, making sure that it's covered as evenly as possible. Make sure there aren't any clumps or patches of salt or oil concentrated to one area. Use a silicone basting brush for the best results."
        },
        {
          "headline":"Roast your pork leg at 465 °F (241 °C) for 25 minutes.",
          "description":"Place your roasting pan onto the top oven rack. Keep the oven door closed and don't open it until 25 minutes has passed. After 25 minutes, check the skin to make sure it is crisp and golden in color. If it isn't, continue roasting your pork leg in 5- to 10-minute intervals until it is."
        },
        {
          "headline":"Reduce the temperature to 355 °F (179 °C) and continue roasting for about 1 hour.",
          "description":"After reducing the temperature, continue roasting the pork leg for 30 minutes per 2.2 pounds (1.00 kg). In this case, the pork leg is 4.4 pounds (2.0 kg), which means you should cook it for another 1 hour. Insert a meat thermometer into the thickest part of the pork—it should read 160 °F (71 °C) when the pork is done. If you like your pork a bit crispy, cook it for 35 minutes per 2.2 pounds (1.00 kg), which is another 1 hour and 10 minutes for a 4.4 lb (2.0 kg) roast."
        },
        {
          "headline":"Cool your pork leg for 10 minutes and serve.",
          "description":"Remove the roasting pan from the oven, cover it with aluminum foil, and let it sit. Once it has cooled, slice it into 1 to 2 inch (2.5 to 5.1 cm) pieces and serve it with your choice of sides—pumpkin, roasted potato, steamed vegetables, apple jelly, and gravy are all great choices. Store your leftover pork covered in the refrigerator for up to 3 to 4 days or in the freezer for up to 2 to 3 months."
        }
      ]
    },
    {
      "name":"Making Cuban Pork Leg",
      "steps":[
        {
          "headline":"Mix your powders, flakes, cumin, and standard salt in a jar.",
          "description":"Add 1 tablespoon (14.2 grams) of the following into an airtight glass jar: lemon pepper, garlic powder, onion powder, dried oregano, dried parsley flakes, and achiote powder (also known as annatto powder). Finally, add 1/2 tablespoon (7.1 grams) of ground cumin and shake the jar until everything is blended as evenly as possible. After making your roast, store your leftover Delicioso Adobo seasoning in an airtight jar and place it in a dry, cool place for up to 2 weeks. It is the seasoning that adds flavor to the pork leg."
        },
        {
          "headline":"Crush your garlic cloves into a paste.",
          "description":"Place your 12 garlic cloves onto a cutting board. Hold each clove by its side and carefully cut them in half lengthwise. Now, place the side of your knife against the top of each one and press down with your non-dominant hand. Apply firm and steady pressure while rocking the blade back and forth with your dominant hand until the cloves turn into a paste. Alternate between crushing and mincing. To mince, hold your knife against the board and rock it back and forth over the crushed garlic. Keep your non-dominant hand on top of the knife to keep it steady. Don't stop until the garlic is a spreadable and sticky paste."
        },
        {
          "headline":"Chop 6 sprigs of oregano leaves into the garlic paste.",
          "description":"Start by holding the stem with one hand and peeling off the leaves with the other. Always pull the leaves against the grain so the stem will peel off easily. Throw your oregano into the paste and place your knife over it. Keep the tip of the knife on the cutting board and rock it up and down firmly to chop the oregano pieces up. Place your non-dominant hand on top of the knife to keep it steady."
        },
        {
          "headline":"Juice 4 fresh limes into a small bowl.",
          "description":"Start by cutting each lime in half with a small knife. Remove a piece of skin from the side opposite to the cut side to ensure that you get juice from all sides of the lime. Now, press the cut side of the lime piece over your juicer and squeeze the body over a small bowl. Keep doing this until all of the juice is out. Repeat this process with each lime piece. If you don't have a juicer, place each lime piece in between a pair of tongs with the cut side facing down. Now, squeeze out the juice with the tongs over your small bowl. Put your limes in the microwave for 20 to 30 seconds prior to juicing to increase the flow of citrus juice. Just be sure to let them cool for 1 minute before juicing."
        },
        {
          "headline":"Mix your garlic paste with the prepared seasoning, Mojo sauce, and lemon and orange juice.",
          "description":"Put your garlic paste into a large mixing bowl and add ½ cup (64 grams) of the prepared seasoning you made (called Delicioso Adobo), 1 cup (240 mL) of store-bought Mojo sauce, 2 cups (470 mL) of orange juice, and 8 tablespoons (120 mL) of lime juice. Use a spoon or small whisk to mix everything together into a consistent paste. If you don't have Mojo sauce, use any sauce that has some variation of the combination of olive oil, water, salt, garlic, paprika, pepper, and cumin."
        },
        {
          "headline":"Place your pork leg into a roasting pan and score its surface.",
          "description":"Gently place your 14 to 16 lb (6.4 to 7.3 kg) bone-in whole fresh pork leg into a roasting pan. Now, score the top surface of the meat with a smooth chef's knife in a crosshatch pattern, making sure that each cut penetrates the meat about ⁄8 to ⁄4 inch (0.32 to 0.64 cm) deep. To make a crosshatch pattern, score diagonal lines along the top of the meat, moving vertically with each one so that they are spaced about 1 inch (2.5 cm) apart. Now, do the same with diagonal lines in the opposite direction."
        },
        {
          "headline":"Pour your garlic marinade across the pork.",
          "description":"Tilt the mixing bowl carefully over the pork and cover it in marinade. Be sure that the marinade is evenly distributed over the pork's surface and penetrates the meat through the crosshatch scores. Use enough marinade to cover the pork once across and save the rest. Store the remaining marinade in an airtight container and refrigerate it."
        },
        {
          "headline":"Place your marinated pork leg in the refrigerator for 4-12 hours.",
          "description":"Cover your roasting pan with its lid and place it into the refrigerator. At the halfway point, turn the leg around to help the marinade move around the entire pork. Turn it around once about 1 to 2 hours before you remove it if you'd like. If you don't have a lid for your roasting pan, cover it with cling wrap and be sure that there are no cracks."
        },
        {
          "headline":"Remove the pork from the fridge and let it sit uncovered for 30 minutes before cooking.",
          "description":"Place the roasting pan onto a counter or other safe area and let it sit at room temperature. By letting the pork sit, the temperature increase when it enters the oven isn't as sharp, which promotes more even cooking. Be sure that the cover is removed."
        },
        {
          "headline":"Preheat your oven to 450 °F (232 °C).",
          "description":"Electric ovens typically take about 10 to 15 minutes to preheat. For gas ovens, they should preheat in about 5 to 10 minutes. Position the oven rack into the lowest position and then turn your oven to 450 °F (232 °C). Use an oven thermometer if you have one, as they are often more accurate."
        },
        {
          "headline":"Roast your pork leg for 30 minutes at 450 °F (232 °C).",
          "description":"Place your uncovered pork onto the lower oven rack and let it roast. After 30 minutes, check on the meat—it should be falling apart. If it is, turn your oven to 350 °F (177 °C). If the pork leg meat isn't falling apart yet, continue to cook it in 5-minute intervals and check on it afterward until it is."
        },
        {
          "headline":"Continue roasting your pork at 350 °F (177 °C) for 5 to 5.5 hours.",
          "description":"Every 30 minutes, scoop up some of the marinade you set aside and pour it over the top of the pork. This is called basting, which keeps your pork moist with marinade. Be sure to save enough for the entire duration of the roast. If you have an instant-read meat thermometer, insert it into the thickest part of the pork and check that it is 160 °F (71 °C)."
        },
        {
          "headline":"Let your roast sit for 20 to 30 minutes and then serve.",
          "description":"Loosely cover the roasting pan with foil during cooling. When you're ready to serve, cut it into 1 to 2 inch (2.5 to 5.1 cm) slices depending on your preference. Serve it with your choice of sides, such as brussels sprouts, fruits, or green beans with hazelnuts. Store your leftover pork covered for 3 to 4 days in the refrigerator or 2 to 3 months in the freezer."
        }
      ]
    }
  ],
  "text":" Roasting Traditional Pork Leg Preheat your oven to 465 °F (241 °C). Electric ovens take between 10 to 15 minutes to preheat, while gas ovens take about 5 to 10 minutes. Be sure to place the oven rack into the highest position before turning it on. Use an oven thermometer if you have one—it's a more accurate measurement of internal oven temperature. Score the surface of your pork leg. Place your 4 pounds (1.8 kg) of pork leg into a shallow roasting pan. Using a smooth chef's knife, score diagonal lines on top of the meat in a vertical pattern, taking care that each is spaced about 1 inch (2.5 cm) from each other. Afterward, repeat the process with diagonal lines in the opposite direction to create a crosshatch pattern. Penetrate the meat about ⁄8 to ⁄4 inch (0.32 to 0.64 cm) with each cut. Rub salt and oil into the scored area of the pork leg. Pour your 2 tablespoons (30 mL) of oil over the scored area followed by 1 teaspoon (5.69 grams) of sea salt. Use a basting brush to brush the oil and salt across the scored surface of the meat, making sure that it's covered as evenly as possible. Make sure there aren't any clumps or patches of salt or oil concentrated to one area. Use a silicone basting brush for the best results. Roast your pork leg at 465 °F (241 °C) for 25 minutes. Place your roasting pan onto the top oven rack. Keep the oven door closed and don't open it until 25 minutes has passed. After 25 minutes, check the skin to make sure it is crisp and golden in color. If it isn't, continue roasting your pork leg in 5- to 10-minute intervals until it is. Reduce the temperature to 355 °F (179 °C) and continue roasting for about 1 hour. After reducing the temperature, continue roasting the pork leg for 30 minutes per 2.2 pounds (1.00 kg). In this case, the pork leg is 4.4 pounds (2.0 kg), which means you should cook it for another 1 hour. Insert a meat thermometer into the thickest part of the pork—it should read 160 °F (71 °C) when the pork is done. If you like your pork a bit crispy, cook it for 35 minutes per 2.2 pounds (1.00 kg), which is another 1 hour and 10 minutes for a 4.4 lb (2.0 kg) roast. Cool your pork leg for 10 minutes and serve. Remove the roasting pan from the oven, cover it with aluminum foil, and let it sit. Once it has cooled, slice it into 1 to 2 inch (2.5 to 5.1 cm) pieces and serve it with your choice of sides—pumpkin, roasted potato, steamed vegetables, apple jelly, and gravy are all great choices. Store your leftover pork covered in the refrigerator for up to 3 to 4 days or in the freezer for up to 2 to 3 months. Making Cuban Pork Leg Mix your powders, flakes, cumin, and standard salt in a jar. Add 1 tablespoon (14.2 grams) of the following into an airtight glass jar: lemon pepper, garlic powder, onion powder, dried oregano, dried parsley flakes, and achiote powder (also known as annatto powder). Finally, add 1/2 tablespoon (7.1 grams) of ground cumin and shake the jar until everything is blended as evenly as possible. After making your roast, store your leftover Delicioso Adobo seasoning in an airtight jar and place it in a dry, cool place for up to 2 weeks. It is the seasoning that adds flavor to the pork leg. Crush your garlic cloves into a paste. Place your 12 garlic cloves onto a cutting board. Hold each clove by its side and carefully cut them in half lengthwise. Now, place the side of your knife against the top of each one and press down with your non-dominant hand. Apply firm and steady pressure while rocking the blade back and forth with your dominant hand until the cloves turn into a paste. Alternate between crushing and mincing. To mince, hold your knife against the board and rock it back and forth over the crushed garlic. Keep your non-dominant hand on top of the knife to keep it steady. Don't stop until the garlic is a spreadable and sticky paste. Chop 6 sprigs of oregano leaves into the garlic paste. Start by holding the stem with one hand and peeling off the leaves with the other. Always pull the leaves against the grain so the stem will peel off easily. Throw your oregano into the paste and place your knife over it. Keep the tip of the knife on the cutting board and rock it up and down firmly to chop the oregano pieces up. Place your non-dominant hand on top of the knife to keep it steady. Juice 4 fresh limes into a small bowl. Start by cutting each lime in half with a small knife. Remove a piece of skin from the side opposite to the cut side to ensure that you get juice from all sides of the lime. Now, press the cut side of the lime piece over your juicer and squeeze the body over a small bowl. Keep doing this until all of the juice is out. Repeat this process with each lime piece. If you don't have a juicer, place each lime piece in between a pair of tongs with the cut side facing down. Now, squeeze out the juice with the tongs over your small bowl. Put your limes in the microwave for 20 to 30 seconds prior to juicing to increase the flow of citrus juice. Just be sure to let them cool for 1 minute before juicing. Mix your garlic paste with the prepared seasoning, Mojo sauce, and lemon and orange juice. Put your garlic paste into a large mixing bowl and add ½ cup (64 grams) of the prepared seasoning you made (called Delicioso Adobo), 1 cup (240 mL) of store-bought Mojo sauce, 2 cups (470 mL) of orange juice, and 8 tablespoons (120 mL) of lime juice. Use a spoon or small whisk to mix everything together into a consistent paste. If you don't have Mojo sauce, use any sauce that has some variation of the combination of olive oil, water, salt, garlic, paprika, pepper, and cumin. Place your pork leg into a roasting pan and score its surface. Gently place your 14 to 16 lb (6.4 to 7.3 kg) bone-in whole fresh pork leg into a roasting pan. Now, score the top surface of the meat with a smooth chef's knife in a crosshatch pattern, making sure that each cut penetrates the meat about ⁄8 to ⁄4 inch (0.32 to 0.64 cm) deep. To make a crosshatch pattern, score diagonal lines along the top of the meat, moving vertically with each one so that they are spaced about 1 inch (2.5 cm) apart. Now, do the same with diagonal lines in the opposite direction. Pour your garlic marinade across the pork. Tilt the mixing bowl carefully over the pork and cover it in marinade. Be sure that the marinade is evenly distributed over the pork's surface and penetrates the meat through the crosshatch scores. Use enough marinade to cover the pork once across and save the rest. Store the remaining marinade in an airtight container and refrigerate it. Place your marinated pork leg in the refrigerator for 4-12 hours. Cover your roasting pan with its lid and place it into the refrigerator. At the halfway point, turn the leg around to help the marinade move around the entire pork. Turn it around once about 1 to 2 hours before you remove it if you'd like. If you don't have a lid for your roasting pan, cover it with cling wrap and be sure that there are no cracks. Remove the pork from the fridge and let it sit uncovered for 30 minutes before cooking. Place the roasting pan onto a counter or other safe area and let it sit at room temperature. By letting the pork sit, the temperature increase when it enters the oven isn't as sharp, which promotes more even cooking. Be sure that the cover is removed. Preheat your oven to 450 °F (232 °C). Electric ovens typically take about 10 to 15 minutes to preheat. For gas ovens, they should preheat in about 5 to 10 minutes. Position the oven rack into the lowest position and then turn your oven to 450 °F (232 °C). Use an oven thermometer if you have one, as they are often more accurate. Roast your pork leg for 30 minutes at 450 °F (232 °C). Place your uncovered pork onto the lower oven rack and let it roast. After 30 minutes, check on the meat—it should be falling apart. If it is, turn your oven to 350 °F (177 °C). If the pork leg meat isn't falling apart yet, continue to cook it in 5-minute intervals and check on it afterward until it is. Continue roasting your pork at 350 °F (177 °C) for 5 to 5.5 hours. Every 30 minutes, scoop up some of the marinade you set aside and pour it over the top of the pork. This is called basting, which keeps your pork moist with marinade. Be sure to save enough for the entire duration of the roast. If you have an instant-read meat thermometer, insert it into the thickest part of the pork and check that it is 160 °F (71 °C). Let your roast sit for 20 to 30 minutes and then serve. Loosely cover the roasting pan with foil during cooling. When you're ready to serve, cut it into 1 to 2 inch (2.5 to 5.1 cm) slices depending on your preference. Serve it with your choice of sides, such as brussels sprouts, fruits, or green beans with hazelnuts. Store your leftover pork covered for 3 to 4 days in the refrigerator or 2 to 3 months in the freezer.",
  "sentences":[
    " Roasting Traditional Pork Leg Preheat your oven to 465 °F (241 °C).",
    "Electric ovens take between 10 to 15 minutes to preheat, while gas ovens take about 5 to 10 minutes.",
    "Be sure to place the oven rack into the highest position before turning it on.",
    "Use an oven thermometer if you have one—it's a more accurate measurement of internal oven temperature.",
    "Score the surface of your pork leg.",
    "Place your 4 pounds (1.8 kg) of pork leg into a shallow roasting pan.",
    "Using a smooth chef's knife, score diagonal lines on top of the meat in a vertical pattern, taking care that each is spaced about 1 inch (2.5 cm) from each other.",
    "Afterward, repeat the process with diagonal lines in the opposite direction to create a crosshatch pattern.",
    "Penetrate the meat about ⁄8 to ⁄4 inch (0.32 to 0.64 cm) with each cut.",
    "Rub salt and oil into the scored area of the pork leg.",
    "Pour your 2 tablespoons (30 mL) of oil over the scored area followed by 1 teaspoon (5.69 grams) of sea salt.",
    "Use a basting brush to brush the oil and salt across the scored surface of the meat, making sure that it's covered as evenly as possible.",
    "Make sure there aren't any clumps or patches of salt or oil concentrated to one area.",
    "Use a silicone basting brush for the best results.",
    "Roast your pork leg at 465 °F (241 °C) for 25 minutes.",
    "Place your roasting pan onto the top oven rack.",
    "Keep the oven door closed and don't open it until 25 minutes has passed.",
    "After 25 minutes, check the skin to make sure it is crisp and golden in color.",
    "If it isn't, continue roasting your pork leg in 5- to 10-minute intervals until it is.",
    "Reduce the temperature to 355 °F (179 °C) and continue roasting for about 1 hour.",
    "After reducing the temperature, continue roasting the pork leg for 30 minutes per 2.2 pounds (1.00 kg).",
    "In this case, the pork leg is 4.4 pounds (2.0 kg), which means you should cook it for another 1 hour.",
    "Insert a meat thermometer into the thickest part of the pork—it should read 160 °F (71 °C) when the pork is done.",
    "If you like your pork a bit crispy, cook it for 35 minutes per 2.2 pounds (1.00 kg), which is another 1 hour and 10 minutes for a 4.4 lb (2.0 kg) roast.",
    "Cool your pork leg for 10 minutes and serve.",
    "Remove the roasting pan from the oven, cover it with aluminum foil, and let it sit.",
    "Once it has cooled, slice it into 1 to 2 inch (2.5 to 5.1 cm) pieces and serve it with your choice of sides—pumpkin, roasted potato, steamed vegetables, apple jelly, and gravy are all great choices.",
    "Store your leftover pork covered in the refrigerator for up to 3 to 4 days or in the freezer for up to 2 to 3 months.",
    "Making Cuban Pork Leg Mix your powders, flakes, cumin, and standard salt in a jar.",
    "Add 1 tablespoon (14.2 grams) of the following into an airtight glass jar: lemon pepper, garlic powder, onion powder, dried oregano, dried parsley flakes, and achiote powder (also known as annatto powder).",
    "Finally, add 1/2 tablespoon (7.1 grams) of ground cumin and shake the jar until everything is blended as evenly as possible.",
    "After making your roast, store your leftover Delicioso Adobo seasoning in an airtight jar and place it in a dry, cool place for up to 2 weeks.",
    "It is the seasoning that adds flavor to the pork leg.",
    "Crush your garlic cloves into a paste.",
    "Place your 12 garlic cloves onto a cutting board.",
    "Hold each clove by its side and carefully cut them in half lengthwise.",
    "Now, place the side of your knife against the top of each one and press down with your non-dominant hand.",
    "Apply firm and steady pressure while rocking the blade back and forth with your dominant hand until the cloves turn into a paste.",
    "Alternate between crushing and mincing.",
    "To mince, hold your knife against the board and rock it back and forth over the crushed garlic.",
    "Keep your non-dominant hand on top of the knife to keep it steady.",
    "Don't stop until the garlic is a spreadable and sticky paste.",
    "Chop 6 sprigs of oregano leaves into the garlic paste.",
    "Start by holding the stem with one hand and peeling off the leaves with the other.",
    "Always pull the leaves against the grain so the stem will peel off easily.",
    "Throw your oregano into the paste and place your knife over it.",
    "Keep the tip of the knife on the cutting board and rock it up and down firmly to chop the oregano pieces up.",
    "Place your non-dominant hand on top of the knife to keep it steady.",
    "Juice 4 fresh limes into a small bowl.",
    "Start by cutting each lime in half with a small knife.",
    "Remove a piece of skin from the side opposite to the cut side to ensure that you get juice from all sides of the lime.",
    "Now, press the cut side of the lime piece over your juicer and squeeze the body over a small bowl.",
    "Keep doing this until all of the juice is out.",
    "Repeat this process with each lime piece.",
    "If you don't have a juicer, place each lime piece in between a pair of tongs with the cut side facing down.",
    "Now, squeeze out the juice with the tongs over your small bowl.",
    "Put your limes in the microwave for 20 to 30 seconds prior to juicing to increase the flow of citrus juice.",
    "Just be sure to let them cool for 1 minute before juicing.",
    "Mix your garlic paste with the prepared seasoning, Mojo sauce, and lemon and orange juice.",
    "Put your garlic paste into a large mixing bowl and add ½ cup (64 grams) of the prepared seasoning you made (called Delicioso Adobo), 1 cup (240 mL) of store-bought Mojo sauce, 2 cups (470 mL) of orange juice, and 8 tablespoons (120 mL) of lime juice.",
    "Use a spoon or small whisk to mix everything together into a consistent paste.",
    "If you don't have Mojo sauce, use any sauce that has some variation of the combination of olive oil, water, salt, garlic, paprika, pepper, and cumin.",
    "Place your pork leg into a roasting pan and score its surface.",
    "Gently place your 14 to 16 lb (6.4 to 7.3 kg) bone-in whole fresh pork leg into a roasting pan.",
    "Now, score the top surface of the meat with a smooth chef's knife in a crosshatch pattern, making sure that each cut penetrates the meat about ⁄8 to ⁄4 inch (0.32 to 0.64 cm) deep.",
    "To make a crosshatch pattern, score diagonal lines along the top of the meat, moving vertically with each one so that they are spaced about 1 inch (2.5 cm) apart.",
    "Now, do the same with diagonal lines in the opposite direction.",
    "Pour your garlic marinade across the pork.",
    "Tilt the mixing bowl carefully over the pork and cover it in marinade.",
    "Be sure that the marinade is evenly distributed over the pork's surface and penetrates the meat through the crosshatch scores.",
    "Use enough marinade to cover the pork once across and save the rest.",
    "Store the remaining marinade in an airtight container and refrigerate it.",
    "Place your marinated pork leg in the refrigerator for 4-12 hours.",
    "Cover your roasting pan with its lid and place it into the refrigerator.",
    "At the halfway point, turn the leg around to help the marinade move around the entire pork.",
    "Turn it around once about 1 to 2 hours before you remove it if you'd like.",
    "If you don't have a lid for your roasting pan, cover it with cling wrap and be sure that there are no cracks.",
    "Remove the pork from the fridge and let it sit uncovered for 30 minutes before cooking.",
    "Place the roasting pan onto a counter or other safe area and let it sit at room temperature.",
    "By letting the pork sit, the temperature increase when it enters the oven isn't as sharp, which promotes more even cooking.",
    "Be sure that the cover is removed.",
    "Preheat your oven to 450 °F (232 °C).",
    "Electric ovens typically take about 10 to 15 minutes to preheat.",
    "For gas ovens, they should preheat in about 5 to 10 minutes.",
    "Position the oven rack into the lowest position and then turn your oven to 450 °F (232 °C).",
    "Use an oven thermometer if you have one, as they are often more accurate.",
    "Roast your pork leg for 30 minutes at 450 °F (232 °C).",
    "Place your uncovered pork onto the lower oven rack and let it roast.",
    "After 30 minutes, check on the meat—it should be falling apart.",
    "If it is, turn your oven to 350 °F (177 °C).",
    "If the pork leg meat isn't falling apart yet, continue to cook it in 5-minute intervals and check on it afterward until it is.",
    "Continue roasting your pork at 350 °F (177 °C) for 5 to 5.5 hours.",
    "Every 30 minutes, scoop up some of the marinade you set aside and pour it over the top of the pork.",
    "This is called basting, which keeps your pork moist with marinade.",
    "Be sure to save enough for the entire duration of the roast.",
    "If you have an instant-read meat thermometer, insert it into the thickest part of the pork and check that it is 160 °F (71 °C).",
    "Let your roast sit for 20 to 30 minutes and then serve.",
    "Loosely cover the roasting pan with foil during cooling.",
    "When you're ready to serve, cut it into 1 to 2 inch (2.5 to 5.1 cm) slices depending on your preference.",
    "Serve it with your choice of sides, such as brussels sprouts, fruits, or green beans with hazelnuts.",
    "Store your leftover pork covered for 3 to 4 days in the refrigerator or 2 to 3 months in the freezer."
  ],
  "tyn_section":[
    "Shallow roasting pan",
    "Smooth chef's knife",
    "Silicone basting brush",
    "Meat thermometer",
    "Airtight glass jar",
    "Cutting board",
    "Large chef's knife",
    "Small kitchen knife",
    "Large mixing bowl",
    "Small mixing bowl",
    "Cling wrap"
  ],
  "tyn_model":[
    "oven",
    "roasting pan",
    "garlic",
    "knife",
    "salt",
    "oil",
    "—it",
    "oven rack",
    "pork",
    "oregano",
    "small bowl",
    "mojo sauce",
    "chef's knife",
    "basting brush",
    "pork leg",
    "meat thermometer",
    "cumin",
    "cutting board",
    "limes",
    "lime",
    "juicer",
    "orange juice",
    "refrigerator",
    "oven thermometer",
    "shallow roasting pan",
    "sea salt",
    "aluminum foil",
    "—pumpkin",
    "roasted potato",
    "steamed vegetables",
    "apple jelly",
    "standard salt",
    "airtight glass jar",
    "lemon pepper",
    "garlic powder",
    "onion powder",
    "dried oregano",
    "dried parsley flakes",
    "achiote powder",
    "annatto powder",
    "ground cumin",
    "airtight jar",
    "small knife",
    "microwave",
    "prepared seasoning",
    "lemon",
    "large mixing bowl",
    "lime juice",
    "spoon",
    "small whisk",
    "olive oil",
    "water",
    "pepper",
    "garlic marinade",
    "mixing bowl",
    "airtight container",
    "cling wrap",
    "fridge",
    "marinade",
    "foil",
    "green beans",
    "hazelnuts"
  ],
  "simple_metrics":{
    "r":0.5454545455,
    "p":0.0967741935,
    "f1":0.1643835616,
    "avg_pos":0.3870967742
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.2096774194,
    "f1":0.3466666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2419354839,
    "f1":0.3896103896
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.2096774194,
    "f1":0.3466666667
  }
}