{
  "title":"How to Make Scotch Eggs",
  "url":"https://www.wikihow.com/Make-Scotch-Eggs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Egg Basics"
  ],
  "parts":[
    {
      "name":"Boiling the Eggs",
      "steps":[
        {
          "headline":"Gather and prep all ingredients.",
          "description":""
        },
        {
          "headline":"Put 6 of the eggs into a pot and pour in water to cover them.",
          "description":"Use a pot that's at least 2 quarts (1.9 liters) in size and ensure the eggs are covered by 1 in (2.5 cm) of cold water. Use any type of eggs you like. Keep in mind that if you're using extra-large eggs, you may need to make more sausage mixture or if you're using small eggs (such as quail eggs), you can make more than 6."
        },
        {
          "headline":"Bring the water to a boil and then turn off the heat.",
          "description":"Turn the burner to high so the water begins to boil vigorously. Turn off the burner and put a lid on the pot."
        },
        {
          "headline":"Leave the eggs in the hot water for 5 to 8 minutes.",
          "description":"If you'd like runnier eggs, take them out after 5 minutes. For softly set eggs, leave them in the hot water for 6 minutes. For hard yolks, keep them in the water for 6 to 8 minutes."
        },
        {
          "headline":"Transfer the eggs to ice water and let them sit for 5 minutes.",
          "description":"Set a large bowl of ice water on your work surface. Use a slotted spoon to lift each of the eggs out of the hot water and place them in the ice water. Leave the eggs to chill for 5 minutes.The ice water will stop the eggs from cooking further."
        },
        {
          "headline":"Drain and peel the eggs.",
          "description":"Remove the cold eggs from the ice water and crack them on the counter. Carefully peel away the shells and rinse each egg to remove any bits of the shell. Set the eggs aside while you prepare the sausage mixture."
        }
      ]
    },
    {
      "name":"Covering the Eggs with Sausage",
      "steps":[
        {
          "headline":"Mix the pork, Worcestershire, mustard, cornstarch, mace, and herbs.",
          "description":"Put 1 pound (450 g) of ground pork sausage into a bowl along with 1 tablespoon (15 ml) of Worcestershire sauce, 1 tablespoon (18 g) of spicy mustard, 2 teaspoons (5 g) of cornstarch, 1⁄4 teaspoon (0.5 g) of ground mace or nutmeg, 2 finely chopped sage leaves, and 2 finely chopped thyme sprigs. Stir until the sausage mixture is completely combined. If you prefer, use your choice of ground meat such as chicken, lamb, beef, or turkey."
        },
        {
          "headline":"Divide the sausage mixture into 6 portions.",
          "description":"Lay a sheet of waxed paper or a plate on your work surface. Then use a large cookie scoop or your hands to portion out 6 scoops of sausage mixture. Place these on the waxed paper or plate. Ensure that each portion is equal in size."
        },
        {
          "headline":"Wrap 1 portion of sausage mixture completely around each egg.",
          "description":"Take 1 portion of sausage mixture and put it in the palm of your hand. Use your other hand to flatten it into a large circle. Place 1 of the peeled eggs in the center and then wrap the sausage mixture around the entire surface of the egg. Repeat this for each of the eggs. Ensure the sausage is an even thickness so the Scotch eggs fry evenly."
        }
      ]
    },
    {
      "name":"Coating the Eggs with Bread Crumbs",
      "steps":[
        {
          "headline":"Set up a dredging station of milk with egg, flour, and bread crumbs.",
          "description":"Place 3 shallow bowls on your work surface. Crack the remaining whole egg into a bowl and beat it with ⁄4 cup (59 ml) of milk. Measure 1/2 cup (60 g) of flour into another bowl and put 2 cups (180 g) of panko bread crumbs into the last bowl. If you prefer, you could leave out the bread crumbs and just use flour, but the Scotch eggs won't be as crunchy. Instead of panko bread crumbs, you can also use dried bread crumbs, crushed corn flakes, or instant maize such as Golden Morn."
        },
        {
          "headline":"Roll each egg in flour.",
          "description":"Lower each sausage-covered egg into the bowl with the flour. Gently roll the egg to cover it completely with flour. Then lift the egg up and shake off the extra flour back into the bowl."
        },
        {
          "headline":"Dip each floured egg in the egg mixture.",
          "description":"Place the floured eggs in the bowl with the egg and milk mixture. Roll the eggs a few times so they're covered with the liquid. Then lift them up so the excess liquid falls into the bowl."
        },
        {
          "headline":"Coat each egg in the bread crumbs.",
          "description":"Put the eggs directly into the bread crumbs and roll them until they're completely covered with the bread crumbs. Set the assembled Scotch eggs on a plate until the oil is ready for frying."
        }
      ]
    },
    {
      "name":"Frying the Scotch Eggs",
      "steps":[
        {
          "headline":"Chill the Scotch eggs for 30 minutes.",
          "description":"Place the plate of assembled Scotch eggs in the refrigerator and let the eggs chill while you heat the oil."
        },
        {
          "headline":"Heat 2 in (5 cm) of oil to 350 °F (177 °C).",
          "description":"Pour 2 in (5 cm) of vegetable or canola oil into a 6 quart (5.6 liter) pot and turn the burner to medium-high. Place a deep-fry thermometer into the oil and continue to heat it until the oil reaches 350 °F (177 °C). If you don't have a thermometer, drop a small piece of bread onto the oil to test the temperature. Your oil is the right temperature if the bread sizzles and browns, but does not burn. If you'd rather bake the Scotch eggs, place the assembled eggs on an ungreased baking sheet. Bake them in a 400 °F (204 °C) oven for 35 minutes. The sausage should be completely cooked."
        },
        {
          "headline":"Fry half of the Scotch eggs for 7 minutes.",
          "description":"Slowly lower 3 of the chilled Scotch eggs into the hot oil. They should begin to sizzle and brown. Use a long spoon to gently rotate the eggs as they fry. Use a slotted spoon to remove the eggs once they're completely browned on all sides. Let the oil come back up to temperature and then fry the rest of the chilled eggs. The cooking time varies depending on the amount of sausage meat on each egg, and how evenly the egg is wrapped. If you're worried about cooking the pork all the way, move the cooked egg to a preheated 190ºC (375ºF) oven for a couple minutes."
        },
        {
          "headline":"Cool the Scotch eggs for 10 minutes before you serve them.",
          "description":"Lay the eggs on a paper towel-lined plate to drain. Then let them rest before you serve them with your choice of sauce such as ketchup or creamy mustard. Refrigerate leftover Scotch eggs in an airtight container for up to 1 week. Eat them cold or reheat them in the oven until they're hot throughout."
        }
      ]
    }
  ],
  "text":" Boiling the Eggs Gather and prep all ingredients.  Put 6 of the eggs into a pot and pour in water to cover them. Use a pot that's at least 2 quarts (1.9 liters) in size and ensure the eggs are covered by 1 in (2.5 cm) of cold water. Use any type of eggs you like. Keep in mind that if you're using extra-large eggs, you may need to make more sausage mixture or if you're using small eggs (such as quail eggs), you can make more than 6. Bring the water to a boil and then turn off the heat. Turn the burner to high so the water begins to boil vigorously. Turn off the burner and put a lid on the pot. Leave the eggs in the hot water for 5 to 8 minutes. If you'd like runnier eggs, take them out after 5 minutes. For softly set eggs, leave them in the hot water for 6 minutes. For hard yolks, keep them in the water for 6 to 8 minutes. Transfer the eggs to ice water and let them sit for 5 minutes. Set a large bowl of ice water on your work surface. Use a slotted spoon to lift each of the eggs out of the hot water and place them in the ice water. Leave the eggs to chill for 5 minutes.The ice water will stop the eggs from cooking further. Drain and peel the eggs. Remove the cold eggs from the ice water and crack them on the counter. Carefully peel away the shells and rinse each egg to remove any bits of the shell. Set the eggs aside while you prepare the sausage mixture. Covering the Eggs with Sausage Mix the pork, Worcestershire, mustard, cornstarch, mace, and herbs. Put 1 pound (450 g) of ground pork sausage into a bowl along with 1 tablespoon (15 ml) of Worcestershire sauce, 1 tablespoon (18 g) of spicy mustard, 2 teaspoons (5 g) of cornstarch, 1⁄4 teaspoon (0.5 g) of ground mace or nutmeg, 2 finely chopped sage leaves, and 2 finely chopped thyme sprigs. Stir until the sausage mixture is completely combined. If you prefer, use your choice of ground meat such as chicken, lamb, beef, or turkey. Divide the sausage mixture into 6 portions. Lay a sheet of waxed paper or a plate on your work surface. Then use a large cookie scoop or your hands to portion out 6 scoops of sausage mixture. Place these on the waxed paper or plate. Ensure that each portion is equal in size. Wrap 1 portion of sausage mixture completely around each egg. Take 1 portion of sausage mixture and put it in the palm of your hand. Use your other hand to flatten it into a large circle. Place 1 of the peeled eggs in the center and then wrap the sausage mixture around the entire surface of the egg. Repeat this for each of the eggs. Ensure the sausage is an even thickness so the Scotch eggs fry evenly. Coating the Eggs with Bread Crumbs Set up a dredging station of milk with egg, flour, and bread crumbs. Place 3 shallow bowls on your work surface. Crack the remaining whole egg into a bowl and beat it with ⁄4 cup (59 ml) of milk. Measure 1/2 cup (60 g) of flour into another bowl and put 2 cups (180 g) of panko bread crumbs into the last bowl. If you prefer, you could leave out the bread crumbs and just use flour, but the Scotch eggs won't be as crunchy. Instead of panko bread crumbs, you can also use dried bread crumbs, crushed corn flakes, or instant maize such as Golden Morn. Roll each egg in flour. Lower each sausage-covered egg into the bowl with the flour. Gently roll the egg to cover it completely with flour. Then lift the egg up and shake off the extra flour back into the bowl. Dip each floured egg in the egg mixture. Place the floured eggs in the bowl with the egg and milk mixture. Roll the eggs a few times so they're covered with the liquid. Then lift them up so the excess liquid falls into the bowl. Coat each egg in the bread crumbs. Put the eggs directly into the bread crumbs and roll them until they're completely covered with the bread crumbs. Set the assembled Scotch eggs on a plate until the oil is ready for frying. Frying the Scotch Eggs Chill the Scotch eggs for 30 minutes. Place the plate of assembled Scotch eggs in the refrigerator and let the eggs chill while you heat the oil. Heat 2 in (5 cm) of oil to 350 °F (177 °C). Pour 2 in (5 cm) of vegetable or canola oil into a 6 quart (5.6 liter) pot and turn the burner to medium-high. Place a deep-fry thermometer into the oil and continue to heat it until the oil reaches 350 °F (177 °C). If you don't have a thermometer, drop a small piece of bread onto the oil to test the temperature. Your oil is the right temperature if the bread sizzles and browns, but does not burn. If you'd rather bake the Scotch eggs, place the assembled eggs on an ungreased baking sheet. Bake them in a 400 °F (204 °C) oven for 35 minutes. The sausage should be completely cooked. Fry half of the Scotch eggs for 7 minutes. Slowly lower 3 of the chilled Scotch eggs into the hot oil. They should begin to sizzle and brown. Use a long spoon to gently rotate the eggs as they fry. Use a slotted spoon to remove the eggs once they're completely browned on all sides. Let the oil come back up to temperature and then fry the rest of the chilled eggs. The cooking time varies depending on the amount of sausage meat on each egg, and how evenly the egg is wrapped. If you're worried about cooking the pork all the way, move the cooked egg to a preheated 190ºC (375ºF) oven for a couple minutes. Cool the Scotch eggs for 10 minutes before you serve them. Lay the eggs on a paper towel-lined plate to drain. Then let them rest before you serve them with your choice of sauce such as ketchup or creamy mustard. Refrigerate leftover Scotch eggs in an airtight container for up to 1 week. Eat them cold or reheat them in the oven until they're hot throughout.",
  "sentences":[
    " Boiling the Eggs Gather and prep all ingredients.",
    "Put 6 of the eggs into a pot and pour in water to cover them.",
    "Use a pot that's at least 2 quarts (1.9 liters) in size and ensure the eggs are covered by 1 in (2.5 cm) of cold water.",
    "Use any type of eggs you like.",
    "Keep in mind that if you're using extra-large eggs, you may need to make more sausage mixture or if you're using small eggs (such as quail eggs), you can make more than 6.",
    "Bring the water to a boil and then turn off the heat.",
    "Turn the burner to high so the water begins to boil vigorously.",
    "Turn off the burner and put a lid on the pot.",
    "Leave the eggs in the hot water for 5 to 8 minutes.",
    "If you'd like runnier eggs, take them out after 5 minutes.",
    "For softly set eggs, leave them in the hot water for 6 minutes.",
    "For hard yolks, keep them in the water for 6 to 8 minutes.",
    "Transfer the eggs to ice water and let them sit for 5 minutes.",
    "Set a large bowl of ice water on your work surface.",
    "Use a slotted spoon to lift each of the eggs out of the hot water and place them in the ice water.",
    "Leave the eggs to chill for 5 minutes.The ice water will stop the eggs from cooking further.",
    "Drain and peel the eggs.",
    "Remove the cold eggs from the ice water and crack them on the counter.",
    "Carefully peel away the shells and rinse each egg to remove any bits of the shell.",
    "Set the eggs aside while you prepare the sausage mixture.",
    "Covering the Eggs with Sausage Mix the pork, Worcestershire, mustard, cornstarch, mace, and herbs.",
    "Put 1 pound (450 g) of ground pork sausage into a bowl along with 1 tablespoon (15 ml) of Worcestershire sauce, 1 tablespoon (18 g) of spicy mustard, 2 teaspoons (5 g) of cornstarch, 1⁄4 teaspoon (0.5 g) of ground mace or nutmeg, 2 finely chopped sage leaves, and 2 finely chopped thyme sprigs.",
    "Stir until the sausage mixture is completely combined.",
    "If you prefer, use your choice of ground meat such as chicken, lamb, beef, or turkey.",
    "Divide the sausage mixture into 6 portions.",
    "Lay a sheet of waxed paper or a plate on your work surface.",
    "Then use a large cookie scoop or your hands to portion out 6 scoops of sausage mixture.",
    "Place these on the waxed paper or plate.",
    "Ensure that each portion is equal in size.",
    "Wrap 1 portion of sausage mixture completely around each egg.",
    "Take 1 portion of sausage mixture and put it in the palm of your hand.",
    "Use your other hand to flatten it into a large circle.",
    "Place 1 of the peeled eggs in the center and then wrap the sausage mixture around the entire surface of the egg.",
    "Repeat this for each of the eggs.",
    "Ensure the sausage is an even thickness so the Scotch eggs fry evenly.",
    "Coating the Eggs with Bread Crumbs Set up a dredging station of milk with egg, flour, and bread crumbs.",
    "Place 3 shallow bowls on your work surface.",
    "Crack the remaining whole egg into a bowl and beat it with ⁄4 cup (59 ml) of milk.",
    "Measure 1/2 cup (60 g) of flour into another bowl and put 2 cups (180 g) of panko bread crumbs into the last bowl.",
    "If you prefer, you could leave out the bread crumbs and just use flour, but the Scotch eggs won't be as crunchy.",
    "Instead of panko bread crumbs, you can also use dried bread crumbs, crushed corn flakes, or instant maize such as Golden Morn.",
    "Roll each egg in flour.",
    "Lower each sausage-covered egg into the bowl with the flour.",
    "Gently roll the egg to cover it completely with flour.",
    "Then lift the egg up and shake off the extra flour back into the bowl.",
    "Dip each floured egg in the egg mixture.",
    "Place the floured eggs in the bowl with the egg and milk mixture.",
    "Roll the eggs a few times so they're covered with the liquid.",
    "Then lift them up so the excess liquid falls into the bowl.",
    "Coat each egg in the bread crumbs.",
    "Put the eggs directly into the bread crumbs and roll them until they're completely covered with the bread crumbs.",
    "Set the assembled Scotch eggs on a plate until the oil is ready for frying.",
    "Frying the Scotch Eggs Chill the Scotch eggs for 30 minutes.",
    "Place the plate of assembled Scotch eggs in the refrigerator and let the eggs chill while you heat the oil.",
    "Heat 2 in (5 cm) of oil to 350 °F (177 °C).",
    "Pour 2 in (5 cm) of vegetable or canola oil into a 6 quart (5.6 liter) pot and turn the burner to medium-high.",
    "Place a deep-fry thermometer into the oil and continue to heat it until the oil reaches 350 °F (177 °C).",
    "If you don't have a thermometer, drop a small piece of bread onto the oil to test the temperature.",
    "Your oil is the right temperature if the bread sizzles and browns, but does not burn.",
    "If you'd rather bake the Scotch eggs, place the assembled eggs on an ungreased baking sheet.",
    "Bake them in a 400 °F (204 °C) oven for 35 minutes.",
    "The sausage should be completely cooked.",
    "Fry half of the Scotch eggs for 7 minutes.",
    "Slowly lower 3 of the chilled Scotch eggs into the hot oil.",
    "They should begin to sizzle and brown.",
    "Use a long spoon to gently rotate the eggs as they fry.",
    "Use a slotted spoon to remove the eggs once they're completely browned on all sides.",
    "Let the oil come back up to temperature and then fry the rest of the chilled eggs.",
    "The cooking time varies depending on the amount of sausage meat on each egg, and how evenly the egg is wrapped.",
    "If you're worried about cooking the pork all the way, move the cooked egg to a preheated 190ºC (375ºF) oven for a couple minutes.",
    "Cool the Scotch eggs for 10 minutes before you serve them.",
    "Lay the eggs on a paper towel-lined plate to drain.",
    "Then let them rest before you serve them with your choice of sauce such as ketchup or creamy mustard.",
    "Refrigerate leftover Scotch eggs in an airtight container for up to 1 week.",
    "Eat them cold or reheat them in the oven until they're hot throughout."
  ],
  "tyn_section":[
    "2 quart (1.9 liter) pot with lid",
    "Slotted spoon",
    "Mixing bowls",
    "Shallow bowls",
    "Measuring cups and spoons",
    "Knife and cutting board",
    "Waxed paper or plate",
    "6 quart (5.6 liter) pot",
    "Deep-fry thermometer"
  ],
  "tyn_model":[
    "eggs",
    "scotch eggs",
    "bowl",
    "oil",
    "water",
    "flour",
    "ice water",
    "sausage",
    "egg",
    "plate",
    "milk",
    "bread crumbs",
    "oven",
    "pot",
    "burner",
    "slotted spoon",
    "cornstarch",
    "waxed paper",
    "cold water",
    "pork",
    "worcestershire,",
    "mustard",
    "mace",
    "herbs",
    "ground pork sausage",
    "worcestershire sauce",
    "spicy mustard",
    "ground mace or nutmeg",
    "sage",
    "thyme",
    "panko bread crumbs",
    "corn flakes",
    "refrigerator",
    "vegetable or canola oil",
    "deep-fry thermometer",
    "baking sheet",
    "paper towel-lined plate",
    "creamy mustard",
    "airtight container"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.0512820513,
    "f1":0.0833333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0769230769,
    "f1":0.125
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.1025641026,
    "f1":0.1568627451
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2222222222,
    "p":0.0512820513,
    "f1":0.0833333333
  }
}