{
  "title":"How to Paint Furniture Shabby Chic",
  "url":"https://www.wikihow.com/Paint-Furniture-Shabby-Chic",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Preparing the Furniture for Painting",
      "steps":[
        {
          "headline":"Move the furniture to a well-ventilated area if possible.",
          "description":"Take the furniture outside or to a room with plenty of windows that can be opened. This will prevent you from breathing in dangerous fumes while you’re painting. Have a friend help you move the furniture if it’s too large or heavy for you to move alone. If you can’t take it outside, put fans in the room where you’re painting to help circulate the air."
        },
        {
          "headline":"Cover the area underneath the furniture with a drop cloth.",
          "description":"Lay a drop cloth under the piece of furniture to protect the floor or ground beneath it from spills or splatters. You can buy a drop cloth at a hardware store or from an online retailer. If you don’t have a drop cloth, use an old bed sheet, a plastic tarp, or a large trash bag."
        },
        {
          "headline":"Remove any drawers or hardware.",
          "description":"If you’re painting something with drawers, like a dresser or end table, pull out the drawers and set them aside. Take off any hardware as well, like drawer pulls or knobs, using a screwdriver. Take out the drawers even if you plan on painting them. You’ll paint those separately.Tip: If you can’t remove the hardware, cover it with painter’s tape. Press the tape securely around all areas you don’t want painted so that the paint doesn’t seep underneath."
        },
        {
          "headline":"Sand the furniture with a medium-grit sandpaper to get rid of any gloss.",
          "description":"Choose a sandpaper that’s between 150 and 220 grit and run it all over the piece of furniture. Sanding the cabinets creates a rough surface that the paint can adhere to better. Wear a mask and protective eyewear when sanding. Wipe the cabinets with a damp cloth after sanding, if necessary, to clean off any dust."
        }
      ]
    },
    {
      "name":"Creating Distressed Furniture with Paint",
      "steps":[
        {
          "headline":"Paint a thin layer of your darker color all over the furniture.",
          "description":"Take the darkest of your 2 paint colors and use a paintbrush to apply a very thin layer onto the furniture. Brush the paint so thin that you can still see some of the cracks or crevices of the original furniture underneath. Use either latex or oil-based furniture paint. If you removed any drawers from your piece that you want painted, too, paint those now.Tip: If you aren't sure what type of paint to use, pick latex furniture paint if you want something easy to apply. For paint that lasts the longest and is very durable, choose oil-based."
        },
        {
          "headline":"Let the paint dry for 24 hours.",
          "description":"Once you’ve covered the furniture in your base layer, leave it to dry overnight. It will dry fastest in a warm, dry area. After 24 hours, check that it’s no longer tacky to the touch. If you don’t let it dry for long enough, your next layer will just smear the first layer instead of going on smoothly over top."
        },
        {
          "headline":"Mix 2 parts of your lighter paint with 1 part water in a plastic container.",
          "description":"Pour the paint and water into the container and use a wooden stir stick to blend them together. This dilutes the paint to make it more of a wash than a thick paint. How much paint you need depends on the size of your furniture. For example, a tall bookcase will require more paint than a wall mirror. You can use a reusable plastic container, a paint bucket, or a paint tray to mix the paint and water."
        },
        {
          "headline":"Paint the wash over the base layer with a foam brush.",
          "description":"For this top coat, use a foam brush to apply the paint wash all over your piece of furniture. Keep the layer thin so it dries evenly and not streaky. If you notice the paint bubbling when you brush it on, you used too much water. Add a little more paint to the mixture before continuing to apply it. You can use a foam roller instead of a foam brush if you’d prefer."
        },
        {
          "headline":"Wipe some spots with a paper towel before the paint dries.",
          "description":"In any areas that you want the furniture to look more worn, use a paper towel to wipe off some of the paint wash while it’s still wet. This allows the darker layer to show through, giving it a vintage vibe. You can wipe off as much or as little of the top layer as you’d like. The more you wipe off, the more distressed it will look. If you remove too much, simply brush it back on and blend it into the rest of the wash."
        },
        {
          "headline":"Let the top layer dry for at least 24 hours.",
          "description":"After you’ve wiped away any spots you want to, let the furniture sit overnight to dry. Check the paint can to find the exact drying time for your specific brand and type. If you aren’t sure how long your paint takes to dry, it’s best to err on the side of caution and let it sit for longer rather than shorter than 24 hours."
        },
        {
          "headline":"Sand the edges and corners of the furniture for an even more distressed look.",
          "description":"Once your top layer of paint is completely dry, take a piece of fine-grit sandpaper, which is 180 to 220 grit, and run it over the edges and corners if you want more old-looking sections. Brush the sandpaper firmly over the areas you’re distressing to remove some or all of the paint in that spot. You can sand any section of the furniture as well, like the top or the fronts of the drawers. If you don't have sandpaper, you can use steel wool. Once the distressed look is created, you can paint the furniture in any color you want to provide a vibrant look."
        }
      ]
    },
    {
      "name":"Whitewashing Wood Furniture",
      "steps":[
        {
          "headline":"Mix 2 parts white latex paint with 1 part water in a paint tray.",
          "description":"Pour the white latex paint and the water into the tray, then blend them together with a wooden stir stick. Combine them until thoroughly mixed. Latex paint works best for whitewashing because it’s water-based. You can use a paint bucket or plastic container instead of a paint tray if you’d like. However, the tray will be easiest for you to dip your roller in."
        },
        {
          "headline":"Roll a thin layer of the paint wash onto your furniture.",
          "description":"Once it’s mixed, dip a small foam roller into the wash and use it to apply a layer all over your piece. Roll long, even strokes so the paint wash goes on evenly and doesn’t clump up anywhere. If there are any small spaces that your roller can’t fit into, use a foam brush to paint them. Paint any drawers that you removed from the furniture, too."
        },
        {
          "headline":"Wipe a sponge against the grain to remove some of the paint while it's wet.",
          "description":"Before the paint dries, take a sponge and wipe it over the entire piece of furniture to create that streaky look. Run the sponge in the opposite direction of the grain to lift the paint. To determine the direction of the grain, look at which way the rings or fibers in the wood are pointing. That's called with the grain."
        },
        {
          "headline":"Let the paint dry for at least 24 hours.",
          "description":"After you've wiped it down, leave the furniture overnight to dry. If you want to know the exact drying time for your specific paint brand and type, look on the back of the can. Once it dries, decide if you're satisfied with the results. If the whitewashing is too thin, go back and add another layer.Tip: To make your whitewashing last longer and to protect it from chips, paint a polycrylic sealant over the furniture."
        }
      ]
    }
  ],
  "text":" Preparing the Furniture for Painting Move the furniture to a well-ventilated area if possible. Take the furniture outside or to a room with plenty of windows that can be opened. This will prevent you from breathing in dangerous fumes while you’re painting. Have a friend help you move the furniture if it’s too large or heavy for you to move alone. If you can’t take it outside, put fans in the room where you’re painting to help circulate the air. Cover the area underneath the furniture with a drop cloth. Lay a drop cloth under the piece of furniture to protect the floor or ground beneath it from spills or splatters. You can buy a drop cloth at a hardware store or from an online retailer. If you don’t have a drop cloth, use an old bed sheet, a plastic tarp, or a large trash bag. Remove any drawers or hardware. If you’re painting something with drawers, like a dresser or end table, pull out the drawers and set them aside. Take off any hardware as well, like drawer pulls or knobs, using a screwdriver. Take out the drawers even if you plan on painting them. You’ll paint those separately.Tip: If you can’t remove the hardware, cover it with painter’s tape. Press the tape securely around all areas you don’t want painted so that the paint doesn’t seep underneath. Sand the furniture with a medium-grit sandpaper to get rid of any gloss. Choose a sandpaper that’s between 150 and 220 grit and run it all over the piece of furniture. Sanding the cabinets creates a rough surface that the paint can adhere to better. Wear a mask and protective eyewear when sanding. Wipe the cabinets with a damp cloth after sanding, if necessary, to clean off any dust. Creating Distressed Furniture with Paint Paint a thin layer of your darker color all over the furniture. Take the darkest of your 2 paint colors and use a paintbrush to apply a very thin layer onto the furniture. Brush the paint so thin that you can still see some of the cracks or crevices of the original furniture underneath. Use either latex or oil-based furniture paint. If you removed any drawers from your piece that you want painted, too, paint those now.Tip: If you aren't sure what type of paint to use, pick latex furniture paint if you want something easy to apply. For paint that lasts the longest and is very durable, choose oil-based. Let the paint dry for 24 hours. Once you’ve covered the furniture in your base layer, leave it to dry overnight. It will dry fastest in a warm, dry area. After 24 hours, check that it’s no longer tacky to the touch. If you don’t let it dry for long enough, your next layer will just smear the first layer instead of going on smoothly over top. Mix 2 parts of your lighter paint with 1 part water in a plastic container. Pour the paint and water into the container and use a wooden stir stick to blend them together. This dilutes the paint to make it more of a wash than a thick paint. How much paint you need depends on the size of your furniture. For example, a tall bookcase will require more paint than a wall mirror. You can use a reusable plastic container, a paint bucket, or a paint tray to mix the paint and water. Paint the wash over the base layer with a foam brush. For this top coat, use a foam brush to apply the paint wash all over your piece of furniture. Keep the layer thin so it dries evenly and not streaky. If you notice the paint bubbling when you brush it on, you used too much water. Add a little more paint to the mixture before continuing to apply it. You can use a foam roller instead of a foam brush if you’d prefer. Wipe some spots with a paper towel before the paint dries. In any areas that you want the furniture to look more worn, use a paper towel to wipe off some of the paint wash while it’s still wet. This allows the darker layer to show through, giving it a vintage vibe. You can wipe off as much or as little of the top layer as you’d like. The more you wipe off, the more distressed it will look. If you remove too much, simply brush it back on and blend it into the rest of the wash. Let the top layer dry for at least 24 hours. After you’ve wiped away any spots you want to, let the furniture sit overnight to dry. Check the paint can to find the exact drying time for your specific brand and type. If you aren’t sure how long your paint takes to dry, it’s best to err on the side of caution and let it sit for longer rather than shorter than 24 hours. Sand the edges and corners of the furniture for an even more distressed look. Once your top layer of paint is completely dry, take a piece of fine-grit sandpaper, which is 180 to 220 grit, and run it over the edges and corners if you want more old-looking sections. Brush the sandpaper firmly over the areas you’re distressing to remove some or all of the paint in that spot. You can sand any section of the furniture as well, like the top or the fronts of the drawers. If you don't have sandpaper, you can use steel wool. Once the distressed look is created, you can paint the furniture in any color you want to provide a vibrant look. Whitewashing Wood Furniture Mix 2 parts white latex paint with 1 part water in a paint tray. Pour the white latex paint and the water into the tray, then blend them together with a wooden stir stick. Combine them until thoroughly mixed. Latex paint works best for whitewashing because it’s water-based. You can use a paint bucket or plastic container instead of a paint tray if you’d like. However, the tray will be easiest for you to dip your roller in. Roll a thin layer of the paint wash onto your furniture. Once it’s mixed, dip a small foam roller into the wash and use it to apply a layer all over your piece. Roll long, even strokes so the paint wash goes on evenly and doesn’t clump up anywhere. If there are any small spaces that your roller can’t fit into, use a foam brush to paint them. Paint any drawers that you removed from the furniture, too. Wipe a sponge against the grain to remove some of the paint while it's wet. Before the paint dries, take a sponge and wipe it over the entire piece of furniture to create that streaky look. Run the sponge in the opposite direction of the grain to lift the paint. To determine the direction of the grain, look at which way the rings or fibers in the wood are pointing. That's called with the grain. Let the paint dry for at least 24 hours. After you've wiped it down, leave the furniture overnight to dry. If you want to know the exact drying time for your specific paint brand and type, look on the back of the can. Once it dries, decide if you're satisfied with the results. If the whitewashing is too thin, go back and add another layer.Tip: To make your whitewashing last longer and to protect it from chips, paint a polycrylic sealant over the furniture.",
  "sentences":[
    " Preparing the Furniture for Painting Move the furniture to a well-ventilated area if possible.",
    "Take the furniture outside or to a room with plenty of windows that can be opened.",
    "This will prevent you from breathing in dangerous fumes while you’re painting.",
    "Have a friend help you move the furniture if it’s too large or heavy for you to move alone.",
    "If you can’t take it outside, put fans in the room where you’re painting to help circulate the air.",
    "Cover the area underneath the furniture with a drop cloth.",
    "Lay a drop cloth under the piece of furniture to protect the floor or ground beneath it from spills or splatters.",
    "You can buy a drop cloth at a hardware store or from an online retailer.",
    "If you don’t have a drop cloth, use an old bed sheet, a plastic tarp, or a large trash bag.",
    "Remove any drawers or hardware.",
    "If you’re painting something with drawers, like a dresser or end table, pull out the drawers and set them aside.",
    "Take off any hardware as well, like drawer pulls or knobs, using a screwdriver.",
    "Take out the drawers even if you plan on painting them.",
    "You’ll paint those separately.Tip: If you can’t remove the hardware, cover it with painter’s tape.",
    "Press the tape securely around all areas you don’t want painted so that the paint doesn’t seep underneath.",
    "Sand the furniture with a medium-grit sandpaper to get rid of any gloss.",
    "Choose a sandpaper that’s between 150 and 220 grit and run it all over the piece of furniture.",
    "Sanding the cabinets creates a rough surface that the paint can adhere to better.",
    "Wear a mask and protective eyewear when sanding.",
    "Wipe the cabinets with a damp cloth after sanding, if necessary, to clean off any dust.",
    "Creating Distressed Furniture with Paint Paint a thin layer of your darker color all over the furniture.",
    "Take the darkest of your 2 paint colors and use a paintbrush to apply a very thin layer onto the furniture.",
    "Brush the paint so thin that you can still see some of the cracks or crevices of the original furniture underneath.",
    "Use either latex or oil-based furniture paint.",
    "If you removed any drawers from your piece that you want painted, too, paint those now.Tip: If you aren't sure what type of paint to use, pick latex furniture paint if you want something easy to apply.",
    "For paint that lasts the longest and is very durable, choose oil-based.",
    "Let the paint dry for 24 hours.",
    "Once you’ve covered the furniture in your base layer, leave it to dry overnight.",
    "It will dry fastest in a warm, dry area.",
    "After 24 hours, check that it’s no longer tacky to the touch.",
    "If you don’t let it dry for long enough, your next layer will just smear the first layer instead of going on smoothly over top.",
    "Mix 2 parts of your lighter paint with 1 part water in a plastic container.",
    "Pour the paint and water into the container and use a wooden stir stick to blend them together.",
    "This dilutes the paint to make it more of a wash than a thick paint.",
    "How much paint you need depends on the size of your furniture.",
    "For example, a tall bookcase will require more paint than a wall mirror.",
    "You can use a reusable plastic container, a paint bucket, or a paint tray to mix the paint and water.",
    "Paint the wash over the base layer with a foam brush.",
    "For this top coat, use a foam brush to apply the paint wash all over your piece of furniture.",
    "Keep the layer thin so it dries evenly and not streaky.",
    "If you notice the paint bubbling when you brush it on, you used too much water.",
    "Add a little more paint to the mixture before continuing to apply it.",
    "You can use a foam roller instead of a foam brush if you’d prefer.",
    "Wipe some spots with a paper towel before the paint dries.",
    "In any areas that you want the furniture to look more worn, use a paper towel to wipe off some of the paint wash while it’s still wet.",
    "This allows the darker layer to show through, giving it a vintage vibe.",
    "You can wipe off as much or as little of the top layer as you’d like.",
    "The more you wipe off, the more distressed it will look.",
    "If you remove too much, simply brush it back on and blend it into the rest of the wash. Let the top layer dry for at least 24 hours.",
    "After you’ve wiped away any spots you want to, let the furniture sit overnight to dry.",
    "Check the paint can to find the exact drying time for your specific brand and type.",
    "If you aren’t sure how long your paint takes to dry, it’s best to err on the side of caution and let it sit for longer rather than shorter than 24 hours.",
    "Sand the edges and corners of the furniture for an even more distressed look.",
    "Once your top layer of paint is completely dry, take a piece of fine-grit sandpaper, which is 180 to 220 grit, and run it over the edges and corners if you want more old-looking sections.",
    "Brush the sandpaper firmly over the areas you’re distressing to remove some or all of the paint in that spot.",
    "You can sand any section of the furniture as well, like the top or the fronts of the drawers.",
    "If you don't have sandpaper, you can use steel wool.",
    "Once the distressed look is created, you can paint the furniture in any color you want to provide a vibrant look.",
    "Whitewashing Wood Furniture Mix 2 parts white latex paint with 1 part water in a paint tray.",
    "Pour the white latex paint and the water into the tray, then blend them together with a wooden stir stick.",
    "Combine them until thoroughly mixed.",
    "Latex paint works best for whitewashing because it’s water-based.",
    "You can use a paint bucket or plastic container instead of a paint tray if you’d like.",
    "However, the tray will be easiest for you to dip your roller in.",
    "Roll a thin layer of the paint wash onto your furniture.",
    "Once it’s mixed, dip a small foam roller into the wash and use it to apply a layer all over your piece.",
    "Roll long, even strokes so the paint wash goes on evenly and doesn’t clump up anywhere.",
    "If there are any small spaces that your roller can’t fit into, use a foam brush to paint them.",
    "Paint any drawers that you removed from the furniture, too.",
    "Wipe a sponge against the grain to remove some of the paint while it's wet.",
    "Before the paint dries, take a sponge and wipe it over the entire piece of furniture to create that streaky look.",
    "Run the sponge in the opposite direction of the grain to lift the paint.",
    "To determine the direction of the grain, look at which way the rings or fibers in the wood are pointing.",
    "That's called with the grain.",
    "Let the paint dry for at least 24 hours.",
    "After you've wiped it down, leave the furniture overnight to dry.",
    "If you want to know the exact drying time for your specific paint brand and type, look on the back of the can.",
    "Once it dries, decide if you're satisfied with the results.",
    "If the whitewashing is too thin, go back and add another layer.Tip: To make your whitewashing last longer and to protect it from chips, paint a polycrylic sealant over the furniture."
  ],
  "tyn_section":[
    "Drop cloth",
    "Medium-grit sandpaper",
    "Protective eyewear and mask",
    "Screwdriver (optional)",
    "Cloth (optional)",
    "Paintbrush",
    "Foam brush",
    "Plastic container",
    "Wooden stir stick",
    "Water",
    "2 different colors of furniture paint",
    "Paper towels",
    "Fine-grit sandpaper (optional)",
    "Latex paint",
    "Paint tray",
    "Foam roller",
    "Sponge"
  ],
  "tyn_model":[
    "paint",
    "water",
    "drop cloth",
    "sandpaper",
    "foam brush",
    "paint tray",
    "sponge",
    "furniture paint",
    "paint bucket",
    "foam roller",
    "paper towel",
    "white latex paint",
    "paint wash",
    "furniture",
    "fans",
    "screwdriver",
    "painter’s tape",
    "tape",
    "protective eyewear",
    "paintbrush",
    "oil-based",
    "reusable plastic container",
    "fine-grit sandpaper",
    "wooden stir stick",
    "latex paint",
    "roller",
    "polycrylic sealant"
  ],
  "simple_metrics":{
    "r":0.5294117647,
    "p":0.3333333333,
    "f1":0.4090909091,
    "avg_pos":0.0740740741
  },
  "jacc_metrics_0.5":{
    "r":0.8235294118,
    "p":0.6296296296,
    "f1":0.7136431784
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.7777777778,
    "f1":0.875
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6470588235,
    "p":0.4444444444,
    "f1":0.5269461078
  }
}