{
  "title":"How to Make Wrap Bracelets",
  "url":"https://www.wikihow.com/Make-Wrap-Bracelets",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Beading"
  ],
  "parts":[
    {
      "name":"Making a Beaded Wrap Bracelet",
      "steps":[
        {
          "headline":"Cut 18 inches (46 cm) of 1-millimeter cord for each layer.",
          "description":"So if you want the cord to wrap around your arm once, cut 18 inches (46 cm) of cord. For it to wrap around your arm twice, cut 36 inches (91 cm) of cord, and so on. You need a lot of cord because it runs along each side of the beads."
        },
        {
          "headline":"Thread a button onto the cord.",
          "description":"If your button has 2 holes, thread the cord up through 1 hole and out the other, then pull the cord so the button is in the middle. If it has 4 holes, thread it up through one hole, and down through the hole that's diagonal to it. Thread it up through another hole, and down through the hole that's catty-cornered to that one. The cord should come out the bottom of the button when you're finished. Make sure the button is centered on the cord. Some buttons also just have a small shank on the back for the cord to go through."
        },
        {
          "headline":"Make an overhand knot in the cord just behind the button.",
          "description":"To make an overhand knot, treat the 2 lengths of cord as a single cord. Wrap the 2 lengths of cord around themselves to make a loop. Pull the ends of the cord through the loop on the other side, then tighten it up to form the knot. As you tighten the cord, pull it up toward the button so the knot sits just behind it."
        },
        {
          "headline":"Attach the thread to the left length of cord.",
          "description":"Cut a length of thread that's 24 to 36 inches (61 to 91 cm) long, approximately. Thread it through the needle, and pull the ends together so the needle is in the middle of the thread. Tie the 2 ends of the thread (together as one thread) into a knot around the cord near the cord's knot to secure it to the bracelet."
        },
        {
          "headline":"Thread a bead on the needle before wrapping the thread around the right cord.",
          "description":"Slip a bead onto the thread and push it all the way down so it's next to the left cord. Loop the thread around the right cord. Make the loop directly across from the knot you made when tying on the thread."
        },
        {
          "headline":"Slip the needle back through the bead.",
          "description":"After you wrap the thread around the right side, come back through the bead from the other direction. Tighten the thread up so that you pull both sides of the cord tight around the ends of the bead."
        },
        {
          "headline":"Wrap the thread around the left cord and repeat the process.",
          "description":"Go around the left cord, then slip the needle through the next bead. Go around the right cord, and push the needle back through the bead. Wrap it around the left cord, and continue the process. Keep going until the bracelet is the length you want. Wrap it around your wrist to check the size."
        },
        {
          "headline":"Tie the thread off when the bracelet is long enough.",
          "description":"When you reach the end, tie the thread on the left side after you put on the last bead. That will hold the beads in place. If you run out of thread partway through, snip the thread just below the needle. Cut another length of thread, and run it through the needle. Gather the ends you just snipped off and the new ends together as 1 thread and tie an overhand knot. Keep going with the new thread."
        },
        {
          "headline":"Tie 2 overhand knots at the end of the cord.",
          "description":"This knot will help hold the beads in place, so tie it right up against the last bead. For the second knot, move down about 1 inch (2.5 cm), and tie a second knot. Check to see if the space between the knots will fit over your button. If it doesn't fit over the button, untie the second knot and move it a bit further down. If it's too loose to hold the button in place as a closure, tie it a bit closer to the first knot."
        },
        {
          "headline":"Add a bead to each end of the cord and tie them off.",
          "description":"Measure 2–4 inches (5.1–10.2 cm) below the last knot on 1 side of the cord, and place the bead there. Tie an overhand knot just under the bead. Do the same on the other side. These beads will dangle below the bracelet for a decorative effect. However, if you don't want to make this part, cut the cord off just below the second knot you made with both ends of the cord."
        }
      ]
    },
    {
      "name":"Creating a Crocheted Wrap Bracelet",
      "steps":[
        {
          "headline":"Make a slip knot near the end of a spool of crochet thread.",
          "description":"Hold the end of the thread in your left hand. The end should be near your pinkie and the rest of the thread should come out the top near your thumb. Wrap the spool end of the thread around your first 2 fingers. As you come back around, pinch part of the thread and pull it through the loop you just made over your fingers. Tighten up the thread so that you have a loop sticking out from a small knot. Place the slip knot over a crochet hook, and tighten it up so it fits loosely on the hook."
        },
        {
          "headline":"Wrap the thread from the hook around the fingers on your left hand.",
          "description":"Hold the hook in your right hand. Starting 2 to 4 inches (5.1 to 10.2 cm) above the knot, wrap the thread over your left pointer finger and weave it through your fingers. Wrap it once around your pinkie. This process helps create tension so that you can easily pull the thread through the loop. Use your pointer finger to hold the thread up away from the knot to create the tension. As you need more thread, let it flow through your fingers."
        },
        {
          "headline":"Pull the thread through the loop to make a chain stitch.",
          "description":"Wrap the crochet hook around the thread once, catching it on the other side with the hook. Pull the thread through the slip knot on the hook to create your first chain. Repeat the process to make another chain stitch. Tighten the stitch up lightly as needed by pulling on the thread you have in your left hand."
        },
        {
          "headline":"Make enough chain stitches to create the length of bracelet you want.",
          "description":"Crochet a length of thread into chain stitches until you think your bracelet is long enough and then check it. For instance, if you want it to wrap around your arm 3 times, check it after you think you've made enough chains by wrapping it around your arm. If you want it to wrap around more times, crochet it to that length."
        },
        {
          "headline":"Create a large chain stitch near the end.",
          "description":"Instead of tightening the chain up against the previous stitch, leave about 1 inch (2.5 cm) of space in the stitch. This space will act as a loop over a button to hold the bracelet in place."
        },
        {
          "headline":"Add another chain stitch after the loop.",
          "description":"To complete the chain stitching, hold on to the large chain stitch with your left hand (while still weaving the thread through your fingers) and make a normal chain stitch. To hold both at the same time, hold the thread woven through your fingers with your pointer finger up, but grasp the chain between your thumb and middle finger."
        },
        {
          "headline":"Prepare to go back along the chain.",
          "description":"Hold the chain in your left hand (along with the thread woven through your fingers). You should see a series of Vs. If you don't, flip the chain to the other side. Locate the chain stitch that's just on the other side of the big chain stitch. Within the chain, you should see 2 threads on top and 1 across the bottom."
        },
        {
          "headline":"Slip stitch into the first chain stitch on the other side of the big chain.",
          "description":"Insert your hook in the chain between the 2 threads on top and the 1 thread on the bottom. Loop the main thread around the hook on the other side and pull it through the chain stitch back toward you. Continue pulling the thread through the loop on your hook to finish the slip stitch."
        },
        {
          "headline":"Slip stitch all the way across.",
          "description":"Find the next chain stitch, and repeat the process. Put the hook in between the top and bottom of the stitch and pull the thread through the chain stitch and the loop on your hook. Keep going, placing a slip stitch in each chain stitch until you reach the end. At this point, cut the thread, leaving a tail of 3 to 4 inches (7.6 to 10.2 cm)."
        },
        {
          "headline":"Tie a button on the end.",
          "description":"Slip the thread through the holes in the button, going up through one hole and down through the other. Use the other tail to do the same. A large needle will help with this process. Tie a knot behind the button with both tails, and then trim the ends. Add a drop of glue on the knot behind the button for extra security."
        }
      ]
    },
    {
      "name":"Studding a Leather Wrap Bracelet",
      "steps":[
        {
          "headline":"Measure a leather or suede strip to fit your wrist.",
          "description":"The strip should be at least 0.75 in (1.9 cm) wide. Wrap it around your wrist twice, leaving an extra 1 inch (2.5 cm) or so for mistakes. Cut the leather or suede to the appropriate length."
        },
        {
          "headline":"Decide where you want your brass studs to go.",
          "description":"Lay the strip down in front of you. You can put studs together in a line or make small pairs of them across the strip. You can also space them out. Keep in mind that you'll need a little bit of space for the stud head. Make a dot where you'd like to place each stud. Use a permanent marker to make the dot."
        },
        {
          "headline":"Make a slit where you want each of the studs to go.",
          "description":"Lay the leather down on a flat surface that you don't mind cutting, such as a cutting mat or even several layers of newspaper. Press the tip of a craft knife into the leather to create a small slit."
        },
        {
          "headline":"Insert brass studs meant for paper.",
          "description":"Push the stud through the slit you just made. Open the prongs, laying them flat against the back of the leather to secure them in place. Repeat the process with the rest of the studs."
        },
        {
          "headline":"Create a closure with a final stud.",
          "description":"Insert the stud at one end of the leather. Instead of flattening the prongs, fold the ends back on themselves, working towards the outside. You should have 2 little loops and a fairly loose stud. Cut a small slit in the other end of the leather. Put the top of the stud through the slit to close the bracelet. If the stud won't fit through the slit, make it bigger."
        },
        {
          "headline":"Back the leather with felt or fleece if you don't like the feel of the studs.",
          "description":"Cut a strip of fabric to fit the back of the bracelet. Glue it in place with leather glue over the backs of the studs for a softer finish. Hot glue would also work."
        }
      ]
    }
  ],
  "text":" Making a Beaded Wrap Bracelet Cut 18 inches (46 cm) of 1-millimeter cord for each layer. So if you want the cord to wrap around your arm once, cut 18 inches (46 cm) of cord. For it to wrap around your arm twice, cut 36 inches (91 cm) of cord, and so on. You need a lot of cord because it runs along each side of the beads. Thread a button onto the cord. If your button has 2 holes, thread the cord up through 1 hole and out the other, then pull the cord so the button is in the middle. If it has 4 holes, thread it up through one hole, and down through the hole that's diagonal to it. Thread it up through another hole, and down through the hole that's catty-cornered to that one. The cord should come out the bottom of the button when you're finished. Make sure the button is centered on the cord. Some buttons also just have a small shank on the back for the cord to go through. Make an overhand knot in the cord just behind the button. To make an overhand knot, treat the 2 lengths of cord as a single cord. Wrap the 2 lengths of cord around themselves to make a loop. Pull the ends of the cord through the loop on the other side, then tighten it up to form the knot. As you tighten the cord, pull it up toward the button so the knot sits just behind it. Attach the thread to the left length of cord. Cut a length of thread that's 24 to 36 inches (61 to 91 cm) long, approximately. Thread it through the needle, and pull the ends together so the needle is in the middle of the thread. Tie the 2 ends of the thread (together as one thread) into a knot around the cord near the cord's knot to secure it to the bracelet. Thread a bead on the needle before wrapping the thread around the right cord. Slip a bead onto the thread and push it all the way down so it's next to the left cord. Loop the thread around the right cord. Make the loop directly across from the knot you made when tying on the thread. Slip the needle back through the bead. After you wrap the thread around the right side, come back through the bead from the other direction. Tighten the thread up so that you pull both sides of the cord tight around the ends of the bead. Wrap the thread around the left cord and repeat the process. Go around the left cord, then slip the needle through the next bead. Go around the right cord, and push the needle back through the bead. Wrap it around the left cord, and continue the process. Keep going until the bracelet is the length you want. Wrap it around your wrist to check the size. Tie the thread off when the bracelet is long enough. When you reach the end, tie the thread on the left side after you put on the last bead. That will hold the beads in place. If you run out of thread partway through, snip the thread just below the needle. Cut another length of thread, and run it through the needle. Gather the ends you just snipped off and the new ends together as 1 thread and tie an overhand knot. Keep going with the new thread. Tie 2 overhand knots at the end of the cord. This knot will help hold the beads in place, so tie it right up against the last bead. For the second knot, move down about 1 inch (2.5 cm), and tie a second knot. Check to see if the space between the knots will fit over your button. If it doesn't fit over the button, untie the second knot and move it a bit further down. If it's too loose to hold the button in place as a closure, tie it a bit closer to the first knot. Add a bead to each end of the cord and tie them off. Measure 2–4 inches (5.1–10.2 cm) below the last knot on 1 side of the cord, and place the bead there. Tie an overhand knot just under the bead. Do the same on the other side. These beads will dangle below the bracelet for a decorative effect. However, if you don't want to make this part, cut the cord off just below the second knot you made with both ends of the cord. Creating a Crocheted Wrap Bracelet Make a slip knot near the end of a spool of crochet thread. Hold the end of the thread in your left hand. The end should be near your pinkie and the rest of the thread should come out the top near your thumb. Wrap the spool end of the thread around your first 2 fingers. As you come back around, pinch part of the thread and pull it through the loop you just made over your fingers. Tighten up the thread so that you have a loop sticking out from a small knot. Place the slip knot over a crochet hook, and tighten it up so it fits loosely on the hook. Wrap the thread from the hook around the fingers on your left hand. Hold the hook in your right hand. Starting 2 to 4 inches (5.1 to 10.2 cm) above the knot, wrap the thread over your left pointer finger and weave it through your fingers. Wrap it once around your pinkie. This process helps create tension so that you can easily pull the thread through the loop. Use your pointer finger to hold the thread up away from the knot to create the tension. As you need more thread, let it flow through your fingers. Pull the thread through the loop to make a chain stitch. Wrap the crochet hook around the thread once, catching it on the other side with the hook. Pull the thread through the slip knot on the hook to create your first chain. Repeat the process to make another chain stitch. Tighten the stitch up lightly as needed by pulling on the thread you have in your left hand. Make enough chain stitches to create the length of bracelet you want. Crochet a length of thread into chain stitches until you think your bracelet is long enough and then check it. For instance, if you want it to wrap around your arm 3 times, check it after you think you've made enough chains by wrapping it around your arm. If you want it to wrap around more times, crochet it to that length. Create a large chain stitch near the end. Instead of tightening the chain up against the previous stitch, leave about 1 inch (2.5 cm) of space in the stitch. This space will act as a loop over a button to hold the bracelet in place. Add another chain stitch after the loop. To complete the chain stitching, hold on to the large chain stitch with your left hand (while still weaving the thread through your fingers) and make a normal chain stitch. To hold both at the same time, hold the thread woven through your fingers with your pointer finger up, but grasp the chain between your thumb and middle finger. Prepare to go back along the chain. Hold the chain in your left hand (along with the thread woven through your fingers). You should see a series of Vs. If you don't, flip the chain to the other side. Locate the chain stitch that's just on the other side of the big chain stitch. Within the chain, you should see 2 threads on top and 1 across the bottom. Slip stitch into the first chain stitch on the other side of the big chain. Insert your hook in the chain between the 2 threads on top and the 1 thread on the bottom. Loop the main thread around the hook on the other side and pull it through the chain stitch back toward you. Continue pulling the thread through the loop on your hook to finish the slip stitch. Slip stitch all the way across. Find the next chain stitch, and repeat the process. Put the hook in between the top and bottom of the stitch and pull the thread through the chain stitch and the loop on your hook. Keep going, placing a slip stitch in each chain stitch until you reach the end. At this point, cut the thread, leaving a tail of 3 to 4 inches (7.6 to 10.2 cm). Tie a button on the end. Slip the thread through the holes in the button, going up through one hole and down through the other. Use the other tail to do the same. A large needle will help with this process. Tie a knot behind the button with both tails, and then trim the ends. Add a drop of glue on the knot behind the button for extra security. Studding a Leather Wrap Bracelet Measure a leather or suede strip to fit your wrist. The strip should be at least 0.75 in (1.9 cm) wide. Wrap it around your wrist twice, leaving an extra 1 inch (2.5 cm) or so for mistakes. Cut the leather or suede to the appropriate length. Decide where you want your brass studs to go. Lay the strip down in front of you. You can put studs together in a line or make small pairs of them across the strip. You can also space them out. Keep in mind that you'll need a little bit of space for the stud head. Make a dot where you'd like to place each stud. Use a permanent marker to make the dot. Make a slit where you want each of the studs to go. Lay the leather down on a flat surface that you don't mind cutting, such as a cutting mat or even several layers of newspaper. Press the tip of a craft knife into the leather to create a small slit. Insert brass studs meant for paper. Push the stud through the slit you just made. Open the prongs, laying them flat against the back of the leather to secure them in place. Repeat the process with the rest of the studs. Create a closure with a final stud. Insert the stud at one end of the leather. Instead of flattening the prongs, fold the ends back on themselves, working towards the outside. You should have 2 little loops and a fairly loose stud. Cut a small slit in the other end of the leather. Put the top of the stud through the slit to close the bracelet. If the stud won't fit through the slit, make it bigger. Back the leather with felt or fleece if you don't like the feel of the studs. Cut a strip of fabric to fit the back of the bracelet. Glue it in place with leather glue over the backs of the studs for a softer finish. Hot glue would also work.",
  "sentences":[
    " Making a Beaded Wrap Bracelet Cut 18 inches (46 cm) of 1-millimeter cord for each layer.",
    "So if you want the cord to wrap around your arm once, cut 18 inches (46 cm) of cord.",
    "For it to wrap around your arm twice, cut 36 inches (91 cm) of cord, and so on.",
    "You need a lot of cord because it runs along each side of the beads.",
    "Thread a button onto the cord.",
    "If your button has 2 holes, thread the cord up through 1 hole and out the other, then pull the cord so the button is in the middle.",
    "If it has 4 holes, thread it up through one hole, and down through the hole that's diagonal to it.",
    "Thread it up through another hole, and down through the hole that's catty-cornered to that one.",
    "The cord should come out the bottom of the button when you're finished.",
    "Make sure the button is centered on the cord.",
    "Some buttons also just have a small shank on the back for the cord to go through.",
    "Make an overhand knot in the cord just behind the button.",
    "To make an overhand knot, treat the 2 lengths of cord as a single cord.",
    "Wrap the 2 lengths of cord around themselves to make a loop.",
    "Pull the ends of the cord through the loop on the other side, then tighten it up to form the knot.",
    "As you tighten the cord, pull it up toward the button so the knot sits just behind it.",
    "Attach the thread to the left length of cord.",
    "Cut a length of thread that's 24 to 36 inches (61 to 91 cm) long, approximately.",
    "Thread it through the needle, and pull the ends together so the needle is in the middle of the thread.",
    "Tie the 2 ends of the thread (together as one thread) into a knot around the cord near the cord's knot to secure it to the bracelet.",
    "Thread a bead on the needle before wrapping the thread around the right cord.",
    "Slip a bead onto the thread and push it all the way down so it's next to the left cord.",
    "Loop the thread around the right cord.",
    "Make the loop directly across from the knot you made when tying on the thread.",
    "Slip the needle back through the bead.",
    "After you wrap the thread around the right side, come back through the bead from the other direction.",
    "Tighten the thread up so that you pull both sides of the cord tight around the ends of the bead.",
    "Wrap the thread around the left cord and repeat the process.",
    "Go around the left cord, then slip the needle through the next bead.",
    "Go around the right cord, and push the needle back through the bead.",
    "Wrap it around the left cord, and continue the process.",
    "Keep going until the bracelet is the length you want.",
    "Wrap it around your wrist to check the size.",
    "Tie the thread off when the bracelet is long enough.",
    "When you reach the end, tie the thread on the left side after you put on the last bead.",
    "That will hold the beads in place.",
    "If you run out of thread partway through, snip the thread just below the needle.",
    "Cut another length of thread, and run it through the needle.",
    "Gather the ends you just snipped off and the new ends together as 1 thread and tie an overhand knot.",
    "Keep going with the new thread.",
    "Tie 2 overhand knots at the end of the cord.",
    "This knot will help hold the beads in place, so tie it right up against the last bead.",
    "For the second knot, move down about 1 inch (2.5 cm), and tie a second knot.",
    "Check to see if the space between the knots will fit over your button.",
    "If it doesn't fit over the button, untie the second knot and move it a bit further down.",
    "If it's too loose to hold the button in place as a closure, tie it a bit closer to the first knot.",
    "Add a bead to each end of the cord and tie them off.",
    "Measure 2–4 inches (5.1–10.2 cm) below the last knot on 1 side of the cord, and place the bead there.",
    "Tie an overhand knot just under the bead.",
    "Do the same on the other side.",
    "These beads will dangle below the bracelet for a decorative effect.",
    "However, if you don't want to make this part, cut the cord off just below the second knot you made with both ends of the cord.",
    "Creating a Crocheted Wrap Bracelet Make a slip knot near the end of a spool of crochet thread.",
    "Hold the end of the thread in your left hand.",
    "The end should be near your pinkie and the rest of the thread should come out the top near your thumb.",
    "Wrap the spool end of the thread around your first 2 fingers.",
    "As you come back around, pinch part of the thread and pull it through the loop you just made over your fingers.",
    "Tighten up the thread so that you have a loop sticking out from a small knot.",
    "Place the slip knot over a crochet hook, and tighten it up so it fits loosely on the hook.",
    "Wrap the thread from the hook around the fingers on your left hand.",
    "Hold the hook in your right hand.",
    "Starting 2 to 4 inches (5.1 to 10.2 cm) above the knot, wrap the thread over your left pointer finger and weave it through your fingers.",
    "Wrap it once around your pinkie.",
    "This process helps create tension so that you can easily pull the thread through the loop.",
    "Use your pointer finger to hold the thread up away from the knot to create the tension.",
    "As you need more thread, let it flow through your fingers.",
    "Pull the thread through the loop to make a chain stitch.",
    "Wrap the crochet hook around the thread once, catching it on the other side with the hook.",
    "Pull the thread through the slip knot on the hook to create your first chain.",
    "Repeat the process to make another chain stitch.",
    "Tighten the stitch up lightly as needed by pulling on the thread you have in your left hand.",
    "Make enough chain stitches to create the length of bracelet you want.",
    "Crochet a length of thread into chain stitches until you think your bracelet is long enough and then check it.",
    "For instance, if you want it to wrap around your arm 3 times, check it after you think you've made enough chains by wrapping it around your arm.",
    "If you want it to wrap around more times, crochet it to that length.",
    "Create a large chain stitch near the end.",
    "Instead of tightening the chain up against the previous stitch, leave about 1 inch (2.5 cm) of space in the stitch.",
    "This space will act as a loop over a button to hold the bracelet in place.",
    "Add another chain stitch after the loop.",
    "To complete the chain stitching, hold on to the large chain stitch with your left hand (while still weaving the thread through your fingers) and make a normal chain stitch.",
    "To hold both at the same time, hold the thread woven through your fingers with your pointer finger up, but grasp the chain between your thumb and middle finger.",
    "Prepare to go back along the chain.",
    "Hold the chain in your left hand (along with the thread woven through your fingers).",
    "You should see a series of Vs.",
    "If you don't, flip the chain to the other side.",
    "Locate the chain stitch that's just on the other side of the big chain stitch.",
    "Within the chain, you should see 2 threads on top and 1 across the bottom.",
    "Slip stitch into the first chain stitch on the other side of the big chain.",
    "Insert your hook in the chain between the 2 threads on top and the 1 thread on the bottom.",
    "Loop the main thread around the hook on the other side and pull it through the chain stitch back toward you.",
    "Continue pulling the thread through the loop on your hook to finish the slip stitch.",
    "Slip stitch all the way across.",
    "Find the next chain stitch, and repeat the process.",
    "Put the hook in between the top and bottom of the stitch and pull the thread through the chain stitch and the loop on your hook.",
    "Keep going, placing a slip stitch in each chain stitch until you reach the end.",
    "At this point, cut the thread, leaving a tail of 3 to 4 inches (7.6 to 10.2 cm).",
    "Tie a button on the end.",
    "Slip the thread through the holes in the button, going up through one hole and down through the other.",
    "Use the other tail to do the same.",
    "A large needle will help with this process.",
    "Tie a knot behind the button with both tails, and then trim the ends.",
    "Add a drop of glue on the knot behind the button for extra security.",
    "Studding a Leather Wrap Bracelet Measure a leather or suede strip to fit your wrist.",
    "The strip should be at least 0.75 in (1.9 cm) wide.",
    "Wrap it around your wrist twice, leaving an extra 1 inch (2.5 cm) or so for mistakes.",
    "Cut the leather or suede to the appropriate length.",
    "Decide where you want your brass studs to go.",
    "Lay the strip down in front of you.",
    "You can put studs together in a line or make small pairs of them across the strip.",
    "You can also space them out.",
    "Keep in mind that you'll need a little bit of space for the stud head.",
    "Make a dot where you'd like to place each stud.",
    "Use a permanent marker to make the dot.",
    "Make a slit where you want each of the studs to go.",
    "Lay the leather down on a flat surface that you don't mind cutting, such as a cutting mat or even several layers of newspaper.",
    "Press the tip of a craft knife into the leather to create a small slit.",
    "Insert brass studs meant for paper.",
    "Push the stud through the slit you just made.",
    "Open the prongs, laying them flat against the back of the leather to secure them in place.",
    "Repeat the process with the rest of the studs.",
    "Create a closure with a final stud.",
    "Insert the stud at one end of the leather.",
    "Instead of flattening the prongs, fold the ends back on themselves, working towards the outside.",
    "You should have 2 little loops and a fairly loose stud.",
    "Cut a small slit in the other end of the leather.",
    "Put the top of the stud through the slit to close the bracelet.",
    "If the stud won't fit through the slit, make it bigger.",
    "Back the leather with felt or fleece if you don't like the feel of the studs.",
    "Cut a strip of fabric to fit the back of the bracelet.",
    "Glue it in place with leather glue over the backs of the studs for a softer finish.",
    "Hot glue would also work."
  ],
  "tyn_section":[
    "1-millimeter cord, leather or waxed linen",
    "Thread in a similar color",
    "Beading needle",
    "Beads (4-millimeter size works well)",
    "1 button",
    "Scissors",
    "Size 10 crochet thread",
    "Size C/2 crochet hook (2.75 millimeters)",
    "Button",
    "Needle",
    "Glue, optional",
    "Leather or suede strip",
    "Brass brads for paper",
    "Craft knife",
    "Felt or fleece, optional"
  ],
  "tyn_model":[
    "thread",
    "cord",
    "beads",
    "crochet hook",
    "beaded wrap bracelet",
    "buttons",
    "needle",
    "bracelet",
    "crocheted wrap bracelet",
    "crochet thread",
    "glue",
    "leather wrap bracelet",
    "permanent marker",
    "cutting mat",
    "newspaper",
    "craft knife",
    "prongs",
    "leather",
    "fleece",
    "fabric",
    "leather glue",
    "hot glue"
  ],
  "simple_metrics":{
    "r":0.1333333333,
    "p":0.0909090909,
    "f1":0.1081081081,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2666666667,
    "p":0.1363636364,
    "f1":0.1804511278
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.1818181818,
    "f1":0.2352941176
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1333333333,
    "p":0.0909090909,
    "f1":0.1081081081
  }
}