{
  "title":"How to Make Thanksgiving Dinner for Two",
  "url":"https://www.wikihow.com/Make-Thanksgiving-Dinner-for-Two",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "parts":[
    {
      "name":"Herb-Roasted Turkey Breasts",
      "steps":[
        {
          "headline":"Lift the turkey skin and sprinkle it with spices.",
          "description":"Start with 3 pounds (1.4 kg) of turkey breast, thawed following the package’s instructions. Place it on a flat, clean surface, like a cutting board, and gently lift up the skin. Sprinkle it evenly with 4 fresh sage leaves, 1 tbsp (2.4 g) of fresh chopped thyme, 1 tsp (5 g) of salt, and ¼ tsp (0.5 g) of black pepper. You can also add other spices to suit your taste, like rosemary or oregano.Why choose turkey breast?Turkey breast is all juicy, white meat, making it one of the most popular parts of the bird. It’s easier to cook than the full bird too, especially for a small crowd."
        },
        {
          "headline":"Put the skin back and drizzle the turkey with olive oil.",
          "description":"Set the skin back down on top of the spices. Lightly drizzle the turkey breasts with olive oil, which will help it cook better and give it a fuller flavor."
        },
        {
          "headline":"Bake the turkey for 2-2.5 hours at 325 °F (163 °C).",
          "description":"Preheat your oven to 325 °F (163 °C). When it’s ready, place your turkey breasts in a baking dish and use oven mitts to set it inside. Let it bake for 2-2.5 hours, or according to the package instructions, until the turkey reaches an internal temperature of 170 °F (77 °C). The turkey should turn a golden brown when it’s done."
        },
        {
          "headline":"Let the turkey cool, then slice and serve.",
          "description":"Pull out the turkey with oven mitts when you’re done and allow it to cool for about 15 minutes. Then simply slice it width-wise and serve! If you have any leftover, wrap it tightly in plastic wrap and foil and place it in the freezer. When you’re ready to reheat it, place it in a shallow pan with a bit of water and heat it for 15 minutes per pound, until its internal temperature is 160 °F (71 °C)."
        }
      ]
    },
    {
      "name":"Mashed Potato Side Dish for Two",
      "steps":[
        {
          "headline":"Bring a pot of water to a boil.",
          "description":"Pour water into a medium saucepan and add a generous amount of salt. Set it on the stove over high heat until it starts to boil. You can let the water boil while you start to prep your potatoes."
        },
        {
          "headline":"Peel 1.5 pounds (0.68 kg) of potatoes and cube them.",
          "description":"Use a potato peeler to remove the skin from your potatoes. Using a chef’s knife, cut them in half and then in quarters, lengthwise. Then, chop the quarters into thin strips and finally small cubes. The smaller the cubes, the easier they’ll be to mash later on."
        },
        {
          "headline":"Boil the potatoes for 15-20 minutes.",
          "description":"Once the water is boiling, carefully pour in your potatoes and let them simmer for 15-20 minutes. They should be soft and almost falling apart before you take them off."
        },
        {
          "headline":"Warm butter and milk or cream in the microwave.",
          "description":"As your potatoes boil, melt 1 tbsp (14 g) of unsalted butter in the microwave until it’s just liquid. In a separate bowl, heat ½ cup (250 mL) of whole milk or heavy cream until it’s warm.Tip: For an even richer taste, use heavy cream and add a spoonful of cream cheese or sour cream, too! Let the cream cheese or sour cream warm up to room temperature before adding."
        },
        {
          "headline":"Drain the potatoes, add the butter, and mash them up.",
          "description":"Use potholders to lift the potato pot from the stove and pour the boiling water out in the sink. Set them back on the stove over medium heat and pour in the butter. Stir the potatoes vigorously to help evaporate any residual water and start smashing and breaking them apart with a wooden spoon or fork to get a “mashed” texture. For a smoother texture, use a potato masher."
        },
        {
          "headline":"Pour in the milk or cream slowly and add salt and pepper to taste.",
          "description":"Once all the leftover water has evaporated and you’ve smashed the potatoes to your desired texture, slowly pour in your milk or cream and any cream cheese or sour cream you want to add. Stir continuously as you pour and keep cooking and stirring until the potatoes are hot, smooth, and creamy. Then turn off the heat and serve! Add salt and pepper to taste, and serve with butter or gravy. This recipe doesn’t make very much mashed potatoes, but if you still have a bit leftover, you can store them in an airtight container in your refrigerator for up to 5 days."
        }
      ]
    },
    {
      "name":"Single Serving Stuffing Cups",
      "steps":[
        {
          "headline":"Butter your muffin tray and preheat the oven to 300 °F (149 °C).",
          "description":"Start to prepare your cooking area by turning on your oven and starting to preheat it. Meanwhile, melt a small amount of butter in the microwave and paint it onto each muffin cup with a pastry brush, making sure to get all sides and the bottom of the cup. Set the muffin tray aside while you prepare the stuffing."
        },
        {
          "headline":"Toast your cubed bread in the oven for 10 minutes.",
          "description":"Place your bread cubes on 2 sheet pans, making sure to keep them to a single layer. Set them inside the oven for about 10 minutes, removing them when they’re just barely toasted."
        },
        {
          "headline":"Sauté ⁄2 pound (0.23 kg) of pancetta for 7 minutes, then drain the grease.",
          "description":"Place your cubed pancetta in a large sauté pan and cook it over medium-high heat, stirring often. Let it cook for 7 minutes, until it’s crispy and lightly browned. Pour the pancetta onto a few paper towels to drain the excess grease. You can also use bacon in a pinch, but it will give your stuffing a smokier flavor."
        },
        {
          "headline":"Cook the vegetables in the pancetta grease for 10 minutes.",
          "description":"Frying the pancetta will leave a few leftover spoonfuls of grease, which you’ll use to cook your veggies! Lower the heat to medium and add your onion, celery, leek, salt, and pepper. Cook them for 10 minutes. The vegetables should be soft and translucent when they’re done."
        },
        {
          "headline":"Add the sage and thyme to the pan and cook until it’s fragrant, then turn off the heat.",
          "description":"Once your vegetables are cooked, add 5 chopped sage leaves and 3 sprigs of fresh thyme. Let the mixture cook until you can just smell the herbs, then turn the heat off."
        },
        {
          "headline":"Pour in the pancetta, bread, and chicken stock and toss the mixture.",
          "description":"Add the pancetta, bread cubes, and 1 cup (236 mL) of chicken stock into your mixture. Toss everything until the pan is well-mixed.Tip: Depending on the saltiness of your pancetta and chicken stock, your stuffing might need a little more salt at this point, or it might be good to go. Do a quick taste test to check, adding more if necessary."
        },
        {
          "headline":"Mix in 2 lightly-beaten eggs.",
          "description":"Crack your two eggs in a separate bowl and beat them just slightly, until they’re somewhat mixed but with lumps still visible. Add them into your stuffing mix and stir it with a spoon."
        },
        {
          "headline":"Pack spoonfuls of stuffing into the cups of your muffin tray.",
          "description":"Use a spoon to transfer heaps of stuffing into each muffin mold. Pack it in tightly, filling each cup almost to the top. Packing your stuffing tightly will help the stuffing stick together so that your muffins don’t fall apart."
        },
        {
          "headline":"Bake the stuffing for 20-25 minutes.",
          "description":"Set your muffin tray in the oven and bake it for 20-25 minutes, until the top is a bit browned. Remove them with oven mitts when you’re done and let them cool for a few minutes. Then, take each muffin out of the tray by loosening the edges with a butter knife, then popping them out one by one. Serve the stuffing muffins warm. If you have any leftover, place them in an airtight container and refrigerate for up to 5 days."
        }
      ]
    },
    {
      "name":"Pumpkin Pie Cupcakes",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C) and grease a cupcake pan.",
          "description":"To start your pumpkin pie cupcake preparation, first set your oven to preheat. Then, hold your cupcake pan over the sink and coat each cupcake mold with baking spray, making sure to hit the bottom and all the sides. Set your cupcake pan aside for now. Try not to get too much baking spray on the edges of the pan."
        },
        {
          "headline":"Combine your dry ingredients in a bowl.",
          "description":"While your oven preheats, combine the ⅔ cup (85 g) of flour, ¼ tsp (1.5 g) of baking soda, ¼ tsp (2 g) of baking powder, and 2 tsp (3.4 g) of pumpkin spice in a medium bowl. Stir them with a wooden spoon until you get an even mixture."
        },
        {
          "headline":"Mix together your pumpkin puree, sugar, and other wet ingredients in a separate bowl.",
          "description":"Pour 15 oz of pumpkin puree, ¾ cup (170 g) of sugar, 2 eggs, 1 tsp (5 mL) of vanilla, and ¾ cup (177 mL) of evaporated milk into a large mixing bowl. Stir them together to get a smooth, even mixture. You can use a wooden spoon or a whisk to combine the wet ingredients."
        },
        {
          "headline":"Mix the dry and wet ingredients together.",
          "description":"Slowly pour the dry ingredients into the wet mixture. Use a wooden spoon to to mix them together until they’re evenly combined."
        },
        {
          "headline":"Spoon the mixture into each cup and bake for 20 minutes.",
          "description":"Use a regular spoon to transfer the pumpkin pie mixture into the cups of your cupcake pan. Fill each cup about ⅓ of the way full, which will allow it to rise while baking. Then, set your cupcake pan in the oven to bake for 20 minutes. If you’re using a 12-cup cupcake tray, your mixture should be enough for one batch."
        },
        {
          "headline":"Let the cupcakes cool, then serve or store in the refrigerator.",
          "description":"Take the cupcakes out of the oven when they’re hardening slightly and golden on top. Let them cool in the pan for 20 minutes, then pop them out and let them cool completely on a rack. Top them with whipped cream and cinnamon or pumpkin spice and enjoy! You can store any extra cupcakes in an airtight container in the refrigerator for up to a week.Tip: These cupcakes are soft and gooey in the middle, similar to a pie filling, so you can get the traditional pumpkin pie flavor and texture!"
        }
      ]
    }
  ],
  "text":" Herb-Roasted Turkey Breasts Lift the turkey skin and sprinkle it with spices. Start with 3 pounds (1.4 kg) of turkey breast, thawed following the package’s instructions. Place it on a flat, clean surface, like a cutting board, and gently lift up the skin. Sprinkle it evenly with 4 fresh sage leaves, 1 tbsp (2.4 g) of fresh chopped thyme, 1 tsp (5 g) of salt, and ¼ tsp (0.5 g) of black pepper. You can also add other spices to suit your taste, like rosemary or oregano.Why choose turkey breast?Turkey breast is all juicy, white meat, making it one of the most popular parts of the bird. It’s easier to cook than the full bird too, especially for a small crowd. Put the skin back and drizzle the turkey with olive oil. Set the skin back down on top of the spices. Lightly drizzle the turkey breasts with olive oil, which will help it cook better and give it a fuller flavor. Bake the turkey for 2-2.5 hours at 325 °F (163 °C). Preheat your oven to 325 °F (163 °C). When it’s ready, place your turkey breasts in a baking dish and use oven mitts to set it inside. Let it bake for 2-2.5 hours, or according to the package instructions, until the turkey reaches an internal temperature of 170 °F (77 °C). The turkey should turn a golden brown when it’s done. Let the turkey cool, then slice and serve. Pull out the turkey with oven mitts when you’re done and allow it to cool for about 15 minutes. Then simply slice it width-wise and serve! If you have any leftover, wrap it tightly in plastic wrap and foil and place it in the freezer. When you’re ready to reheat it, place it in a shallow pan with a bit of water and heat it for 15 minutes per pound, until its internal temperature is 160 °F (71 °C). Mashed Potato Side Dish for Two Bring a pot of water to a boil. Pour water into a medium saucepan and add a generous amount of salt. Set it on the stove over high heat until it starts to boil. You can let the water boil while you start to prep your potatoes. Peel 1.5 pounds (0.68 kg) of potatoes and cube them. Use a potato peeler to remove the skin from your potatoes. Using a chef’s knife, cut them in half and then in quarters, lengthwise. Then, chop the quarters into thin strips and finally small cubes. The smaller the cubes, the easier they’ll be to mash later on. Boil the potatoes for 15-20 minutes. Once the water is boiling, carefully pour in your potatoes and let them simmer for 15-20 minutes. They should be soft and almost falling apart before you take them off. Warm butter and milk or cream in the microwave. As your potatoes boil, melt 1 tbsp (14 g) of unsalted butter in the microwave until it’s just liquid. In a separate bowl, heat ½ cup (250 mL) of whole milk or heavy cream until it’s warm.Tip: For an even richer taste, use heavy cream and add a spoonful of cream cheese or sour cream, too! Let the cream cheese or sour cream warm up to room temperature before adding. Drain the potatoes, add the butter, and mash them up. Use potholders to lift the potato pot from the stove and pour the boiling water out in the sink. Set them back on the stove over medium heat and pour in the butter. Stir the potatoes vigorously to help evaporate any residual water and start smashing and breaking them apart with a wooden spoon or fork to get a “mashed” texture. For a smoother texture, use a potato masher. Pour in the milk or cream slowly and add salt and pepper to taste. Once all the leftover water has evaporated and you’ve smashed the potatoes to your desired texture, slowly pour in your milk or cream and any cream cheese or sour cream you want to add. Stir continuously as you pour and keep cooking and stirring until the potatoes are hot, smooth, and creamy. Then turn off the heat and serve! Add salt and pepper to taste, and serve with butter or gravy. This recipe doesn’t make very much mashed potatoes, but if you still have a bit leftover, you can store them in an airtight container in your refrigerator for up to 5 days. Single Serving Stuffing Cups Butter your muffin tray and preheat the oven to 300 °F (149 °C). Start to prepare your cooking area by turning on your oven and starting to preheat it. Meanwhile, melt a small amount of butter in the microwave and paint it onto each muffin cup with a pastry brush, making sure to get all sides and the bottom of the cup. Set the muffin tray aside while you prepare the stuffing. Toast your cubed bread in the oven for 10 minutes. Place your bread cubes on 2 sheet pans, making sure to keep them to a single layer. Set them inside the oven for about 10 minutes, removing them when they’re just barely toasted. Sauté ⁄2 pound (0.23 kg) of pancetta for 7 minutes, then drain the grease. Place your cubed pancetta in a large sauté pan and cook it over medium-high heat, stirring often. Let it cook for 7 minutes, until it’s crispy and lightly browned. Pour the pancetta onto a few paper towels to drain the excess grease. You can also use bacon in a pinch, but it will give your stuffing a smokier flavor. Cook the vegetables in the pancetta grease for 10 minutes. Frying the pancetta will leave a few leftover spoonfuls of grease, which you’ll use to cook your veggies! Lower the heat to medium and add your onion, celery, leek, salt, and pepper. Cook them for 10 minutes. The vegetables should be soft and translucent when they’re done. Add the sage and thyme to the pan and cook until it’s fragrant, then turn off the heat. Once your vegetables are cooked, add 5 chopped sage leaves and 3 sprigs of fresh thyme. Let the mixture cook until you can just smell the herbs, then turn the heat off. Pour in the pancetta, bread, and chicken stock and toss the mixture. Add the pancetta, bread cubes, and 1 cup (236 mL) of chicken stock into your mixture. Toss everything until the pan is well-mixed.Tip: Depending on the saltiness of your pancetta and chicken stock, your stuffing might need a little more salt at this point, or it might be good to go. Do a quick taste test to check, adding more if necessary. Mix in 2 lightly-beaten eggs. Crack your two eggs in a separate bowl and beat them just slightly, until they’re somewhat mixed but with lumps still visible. Add them into your stuffing mix and stir it with a spoon. Pack spoonfuls of stuffing into the cups of your muffin tray. Use a spoon to transfer heaps of stuffing into each muffin mold. Pack it in tightly, filling each cup almost to the top. Packing your stuffing tightly will help the stuffing stick together so that your muffins don’t fall apart. Bake the stuffing for 20-25 minutes. Set your muffin tray in the oven and bake it for 20-25 minutes, until the top is a bit browned. Remove them with oven mitts when you’re done and let them cool for a few minutes. Then, take each muffin out of the tray by loosening the edges with a butter knife, then popping them out one by one. Serve the stuffing muffins warm. If you have any leftover, place them in an airtight container and refrigerate for up to 5 days. Pumpkin Pie Cupcakes Preheat the oven to 350 °F (177 °C) and grease a cupcake pan. To start your pumpkin pie cupcake preparation, first set your oven to preheat. Then, hold your cupcake pan over the sink and coat each cupcake mold with baking spray, making sure to hit the bottom and all the sides. Set your cupcake pan aside for now. Try not to get too much baking spray on the edges of the pan. Combine your dry ingredients in a bowl. While your oven preheats, combine the ⅔ cup (85 g) of flour, ¼ tsp (1.5 g) of baking soda, ¼ tsp (2 g) of baking powder, and 2 tsp (3.4 g) of pumpkin spice in a medium bowl. Stir them with a wooden spoon until you get an even mixture. Mix together your pumpkin puree, sugar, and other wet ingredients in a separate bowl. Pour 15 oz of pumpkin puree, ¾ cup (170 g) of sugar, 2 eggs, 1 tsp (5 mL) of vanilla, and ¾ cup (177 mL) of evaporated milk into a large mixing bowl. Stir them together to get a smooth, even mixture. You can use a wooden spoon or a whisk to combine the wet ingredients. Mix the dry and wet ingredients together. Slowly pour the dry ingredients into the wet mixture. Use a wooden spoon to to mix them together until they’re evenly combined. Spoon the mixture into each cup and bake for 20 minutes. Use a regular spoon to transfer the pumpkin pie mixture into the cups of your cupcake pan. Fill each cup about ⅓ of the way full, which will allow it to rise while baking. Then, set your cupcake pan in the oven to bake for 20 minutes. If you’re using a 12-cup cupcake tray, your mixture should be enough for one batch. Let the cupcakes cool, then serve or store in the refrigerator. Take the cupcakes out of the oven when they’re hardening slightly and golden on top. Let them cool in the pan for 20 minutes, then pop them out and let them cool completely on a rack. Top them with whipped cream and cinnamon or pumpkin spice and enjoy! You can store any extra cupcakes in an airtight container in the refrigerator for up to a week.Tip: These cupcakes are soft and gooey in the middle, similar to a pie filling, so you can get the traditional pumpkin pie flavor and texture!",
  "sentences":[
    " Herb-Roasted Turkey Breasts Lift the turkey skin and sprinkle it with spices.",
    "Start with 3 pounds (1.4 kg) of turkey breast, thawed following the package’s instructions.",
    "Place it on a flat, clean surface, like a cutting board, and gently lift up the skin.",
    "Sprinkle it evenly with 4 fresh sage leaves, 1 tbsp (2.4 g) of fresh chopped thyme, 1 tsp (5 g) of salt, and ¼ tsp (0.5 g) of black pepper.",
    "You can also add other spices to suit your taste, like rosemary or oregano.Why choose turkey breast?Turkey breast is all juicy, white meat, making it one of the most popular parts of the bird.",
    "It’s easier to cook than the full bird too, especially for a small crowd.",
    "Put the skin back and drizzle the turkey with olive oil.",
    "Set the skin back down on top of the spices.",
    "Lightly drizzle the turkey breasts with olive oil, which will help it cook better and give it a fuller flavor.",
    "Bake the turkey for 2-2.5 hours at 325 °F (163 °C).",
    "Preheat your oven to 325 °F (163 °C).",
    "When it’s ready, place your turkey breasts in a baking dish and use oven mitts to set it inside.",
    "Let it bake for 2-2.5 hours, or according to the package instructions, until the turkey reaches an internal temperature of 170 °F (77 °C).",
    "The turkey should turn a golden brown when it’s done.",
    "Let the turkey cool, then slice and serve.",
    "Pull out the turkey with oven mitts when you’re done and allow it to cool for about 15 minutes.",
    "Then simply slice it width-wise and serve!",
    "If you have any leftover, wrap it tightly in plastic wrap and foil and place it in the freezer.",
    "When you’re ready to reheat it, place it in a shallow pan with a bit of water and heat it for 15 minutes per pound, until its internal temperature is 160 °F (71 °C).",
    "Mashed Potato Side Dish for Two Bring a pot of water to a boil.",
    "Pour water into a medium saucepan and add a generous amount of salt.",
    "Set it on the stove over high heat until it starts to boil.",
    "You can let the water boil while you start to prep your potatoes.",
    "Peel 1.5 pounds (0.68 kg) of potatoes and cube them.",
    "Use a potato peeler to remove the skin from your potatoes.",
    "Using a chef’s knife, cut them in half and then in quarters, lengthwise.",
    "Then, chop the quarters into thin strips and finally small cubes.",
    "The smaller the cubes, the easier they’ll be to mash later on.",
    "Boil the potatoes for 15-20 minutes.",
    "Once the water is boiling, carefully pour in your potatoes and let them simmer for 15-20 minutes.",
    "They should be soft and almost falling apart before you take them off.",
    "Warm butter and milk or cream in the microwave.",
    "As your potatoes boil, melt 1 tbsp (14 g) of unsalted butter in the microwave until it’s just liquid.",
    "In a separate bowl, heat ½ cup (250 mL) of whole milk or heavy cream until it’s warm.Tip: For an even richer taste, use heavy cream and add a spoonful of cream cheese or sour cream, too!",
    "Let the cream cheese or sour cream warm up to room temperature before adding.",
    "Drain the potatoes, add the butter, and mash them up.",
    "Use potholders to lift the potato pot from the stove and pour the boiling water out in the sink.",
    "Set them back on the stove over medium heat and pour in the butter.",
    "Stir the potatoes vigorously to help evaporate any residual water and start smashing and breaking them apart with a wooden spoon or fork to get a “mashed” texture.",
    "For a smoother texture, use a potato masher.",
    "Pour in the milk or cream slowly and add salt and pepper to taste.",
    "Once all the leftover water has evaporated and you’ve smashed the potatoes to your desired texture, slowly pour in your milk or cream and any cream cheese or sour cream you want to add.",
    "Stir continuously as you pour and keep cooking and stirring until the potatoes are hot, smooth, and creamy.",
    "Then turn off the heat and serve!",
    "Add salt and pepper to taste, and serve with butter or gravy.",
    "This recipe doesn’t make very much mashed potatoes, but if you still have a bit leftover, you can store them in an airtight container in your refrigerator for up to 5 days.",
    "Single Serving Stuffing Cups Butter your muffin tray and preheat the oven to 300 °F (149 °C).",
    "Start to prepare your cooking area by turning on your oven and starting to preheat it.",
    "Meanwhile, melt a small amount of butter in the microwave and paint it onto each muffin cup with a pastry brush, making sure to get all sides and the bottom of the cup.",
    "Set the muffin tray aside while you prepare the stuffing.",
    "Toast your cubed bread in the oven for 10 minutes.",
    "Place your bread cubes on 2 sheet pans, making sure to keep them to a single layer.",
    "Set them inside the oven for about 10 minutes, removing them when they’re just barely toasted.",
    "Sauté ⁄2 pound (0.23 kg) of pancetta for 7 minutes, then drain the grease.",
    "Place your cubed pancetta in a large sauté pan and cook it over medium-high heat, stirring often.",
    "Let it cook for 7 minutes, until it’s crispy and lightly browned.",
    "Pour the pancetta onto a few paper towels to drain the excess grease.",
    "You can also use bacon in a pinch, but it will give your stuffing a smokier flavor.",
    "Cook the vegetables in the pancetta grease for 10 minutes.",
    "Frying the pancetta will leave a few leftover spoonfuls of grease, which you’ll use to cook your veggies!",
    "Lower the heat to medium and add your onion, celery, leek, salt, and pepper.",
    "Cook them for 10 minutes.",
    "The vegetables should be soft and translucent when they’re done.",
    "Add the sage and thyme to the pan and cook until it’s fragrant, then turn off the heat.",
    "Once your vegetables are cooked, add 5 chopped sage leaves and 3 sprigs of fresh thyme.",
    "Let the mixture cook until you can just smell the herbs, then turn the heat off.",
    "Pour in the pancetta, bread, and chicken stock and toss the mixture.",
    "Add the pancetta, bread cubes, and 1 cup (236 mL) of chicken stock into your mixture.",
    "Toss everything until the pan is well-mixed.Tip: Depending on the saltiness of your pancetta and chicken stock, your stuffing might need a little more salt at this point, or it might be good to go.",
    "Do a quick taste test to check, adding more if necessary.",
    "Mix in 2 lightly-beaten eggs.",
    "Crack your two eggs in a separate bowl and beat them just slightly, until they’re somewhat mixed but with lumps still visible.",
    "Add them into your stuffing mix and stir it with a spoon.",
    "Pack spoonfuls of stuffing into the cups of your muffin tray.",
    "Use a spoon to transfer heaps of stuffing into each muffin mold.",
    "Pack it in tightly, filling each cup almost to the top.",
    "Packing your stuffing tightly will help the stuffing stick together so that your muffins don’t fall apart.",
    "Bake the stuffing for 20-25 minutes.",
    "Set your muffin tray in the oven and bake it for 20-25 minutes, until the top is a bit browned.",
    "Remove them with oven mitts when you’re done and let them cool for a few minutes.",
    "Then, take each muffin out of the tray by loosening the edges with a butter knife, then popping them out one by one.",
    "Serve the stuffing muffins warm.",
    "If you have any leftover, place them in an airtight container and refrigerate for up to 5 days.",
    "Pumpkin Pie Cupcakes Preheat the oven to 350 °F (177 °C) and grease a cupcake pan.",
    "To start your pumpkin pie cupcake preparation, first set your oven to preheat.",
    "Then, hold your cupcake pan over the sink and coat each cupcake mold with baking spray, making sure to hit the bottom and all the sides.",
    "Set your cupcake pan aside for now.",
    "Try not to get too much baking spray on the edges of the pan.",
    "Combine your dry ingredients in a bowl.",
    "While your oven preheats, combine the ⅔ cup (85 g) of flour, ¼ tsp (1.5 g) of baking soda, ¼ tsp (2 g) of baking powder, and 2 tsp (3.4 g) of pumpkin spice in a medium bowl.",
    "Stir them with a wooden spoon until you get an even mixture.",
    "Mix together your pumpkin puree, sugar, and other wet ingredients in a separate bowl.",
    "Pour 15 oz of pumpkin puree, ¾ cup (170 g) of sugar, 2 eggs, 1 tsp (5 mL) of vanilla, and ¾ cup (177 mL) of evaporated milk into a large mixing bowl.",
    "Stir them together to get a smooth, even mixture.",
    "You can use a wooden spoon or a whisk to combine the wet ingredients.",
    "Mix the dry and wet ingredients together.",
    "Slowly pour the dry ingredients into the wet mixture.",
    "Use a wooden spoon to to mix them together until they’re evenly combined.",
    "Spoon the mixture into each cup and bake for 20 minutes.",
    "Use a regular spoon to transfer the pumpkin pie mixture into the cups of your cupcake pan.",
    "Fill each cup about ⅓ of the way full, which will allow it to rise while baking.",
    "Then, set your cupcake pan in the oven to bake for 20 minutes.",
    "If you’re using a 12-cup cupcake tray, your mixture should be enough for one batch.",
    "Let the cupcakes cool, then serve or store in the refrigerator.",
    "Take the cupcakes out of the oven when they’re hardening slightly and golden on top.",
    "Let them cool in the pan for 20 minutes, then pop them out and let them cool completely on a rack.",
    "Top them with whipped cream and cinnamon or pumpkin spice and enjoy!",
    "You can store any extra cupcakes in an airtight container in the refrigerator for up to a week.Tip: These cupcakes are soft and gooey in the middle, similar to a pie filling, so you can get the traditional pumpkin pie flavor and texture!"
  ],
  "tyn_section":[
    "Cutting board",
    "Baking dish",
    "Knife (to slice and serve)",
    "Medium saucepan",
    "Potato peeler",
    "Knife",
    "Bowls",
    "Fork, wooden spoon, or masher to mash the potatoes",
    "Muffin tray",
    "Pastry brush",
    "2 sheet pans",
    "Large sauté pan",
    "Paper towels",
    "Wooden spoon",
    "Bowl",
    "Whisk or fork",
    "Spoon",
    "Cupcake pan",
    "Baking spray",
    "2 mixing bowls"
  ],
  "tyn_model":[
    "oven",
    "potatoes",
    "water",
    "salt",
    "cupcake pan",
    "turkey",
    "butter",
    "wooden spoon",
    "muffin tray",
    "pancetta",
    "spices",
    "sage",
    "oven mitts",
    "milk",
    "cream",
    "microwave",
    "cream cheese",
    "sour cream",
    "pepper",
    "airtight container",
    "chicken stock",
    "eggs",
    "thyme",
    "olive oil",
    "heavy cream",
    "bread",
    "bowl",
    "spoon",
    "baking spray",
    "pumpkin spice",
    "pumpkin puree",
    "sugar",
    "pumpkin pie",
    "turkey skin",
    "turkey breast",
    "black pepper",
    "rosemary",
    "turkey breast?turkey",
    "baking dish",
    "plastic wrap",
    "foil",
    "freezer",
    "medium saucepan",
    "stove",
    "potato peeler",
    "chef’s knife",
    "unsalted butter",
    "whole milk",
    "potato pot",
    "“mashed",
    "” texture",
    "potato masher",
    "butter or gravy",
    "pastry brush",
    "large sauté pan",
    "paper towels",
    "bacon",
    "vegetables",
    "onion",
    "celery",
    "leek",
    "pan",
    "fresh thyme",
    "herbs",
    "stuffing",
    "tray",
    "butter knife",
    "stuffing muffins",
    "pumpkin pie cupcake",
    "⅔ cup",
    "flour",
    "baking soda",
    "baking powder",
    "medium bowl",
    "vanilla",
    "evaporated milk",
    "large mixing bowl",
    "whisk",
    "regular spoon",
    "⅓ of",
    "cupcake tray",
    "refrigerator",
    "whipped cream"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.1445783133,
    "f1":0.2330097087,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.65,
    "p":0.2168674699,
    "f1":0.3252258513
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7,
    "p":0.3012048193,
    "f1":0.421179302
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.1445783133,
    "f1":0.2330097087
  }
}