{
  "title":"How to Remove an Over‐the‐Range Microwave",
  "url":"https://www.wikihow.com/Remove-an-Over%E2%80%90the%E2%80%90Range-Microwave",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "parts":[
    {
      "name":"Removing the Top Screws",
      "steps":[
        {
          "headline":"Pull your range out of the way if you want to access your microwave easier.",
          "description":"Pull an electric range out from the wall and disconnect the power supply. If you have a gas stove, pull your range out slightly to expose the gas hose and valve. Turn off the gas valve before loosening the hose with a wrench and pulling the range out the rest of the way. Set up a step ladder where your range used to be so you can access your microwave without obstruction. You don’t need to move your range if you don’t want to."
        },
        {
          "headline":"Unplug the microwave from the outlet and feed it through the hole in your cabinets.",
          "description":"Open the cabinets above your microwave and locate the outlet where it’s plugged in. Once you unplug it, feed the cord through the hole in the bottom of your cabinet so it doesn’t get caught when you try to pull it out. Always make sure your microwave is unplugged before moving it so you don’t get shocked."
        },
        {
          "headline":"Unscrew the mounting screws on top of your microwave.",
          "description":"Locate the 2-3 screws on the bottom of the cabinet connecting to the top of your microwave. Keep one hand underneath the front of the microwave to support it so it doesn’t fall. Use an electric screwdriver to turn the screws. Have a partner help support the microwave from underneath so it doesn’t drop."
        }
      ]
    },
    {
      "name":"Taking out the Microwave",
      "steps":[
        {
          "headline":"Tilt the microwave forward on the mounting bracket.",
          "description":"The mounting bracket holds the back of your microwave on the wall. Hold the front of the microwave with both hands so it doesn’t fall forward. Start tilting the microwave forward so the tabs on the bracket loosen. Keep tilting your microwave until it’s at about a 30-degree angle. The microwave will pull the mounting bracket off of the wall and damage it if you let it go. If the microwave is too heavy for you to support, have a partner help you hold it."
        },
        {
          "headline":"Lift the microwave slightly to take it off of the wall.",
          "description":"Support the microwave from underneath and lift it slightly to pop the tabs from the mounting bracket out from the bottom of the microwave. As you’re lifting the microwave, slowly take steps backward until the microwave is out of the opening. Set the microwave on your counter so you don’t have to bend down."
        },
        {
          "headline":"Unscrew the mounting bracket from the wall.",
          "description":"The mounting bracket will be attached to your wall with 3 or 4 screws. Use an electric screwdriver to remove the screws and take the bracket off of the wall. Don’t try hanging a new microwave on an existing mounting bracket.Tip: New microwaves come with their own mounting brackets, so you don’t need to save the old ones."
        }
      ]
    }
  ],
  "text":" Removing the Top Screws Pull your range out of the way if you want to access your microwave easier. Pull an electric range out from the wall and disconnect the power supply. If you have a gas stove, pull your range out slightly to expose the gas hose and valve. Turn off the gas valve before loosening the hose with a wrench and pulling the range out the rest of the way. Set up a step ladder where your range used to be so you can access your microwave without obstruction. You don’t need to move your range if you don’t want to. Unplug the microwave from the outlet and feed it through the hole in your cabinets. Open the cabinets above your microwave and locate the outlet where it’s plugged in. Once you unplug it, feed the cord through the hole in the bottom of your cabinet so it doesn’t get caught when you try to pull it out. Always make sure your microwave is unplugged before moving it so you don’t get shocked. Unscrew the mounting screws on top of your microwave. Locate the 2-3 screws on the bottom of the cabinet connecting to the top of your microwave. Keep one hand underneath the front of the microwave to support it so it doesn’t fall. Use an electric screwdriver to turn the screws. Have a partner help support the microwave from underneath so it doesn’t drop. Taking out the Microwave Tilt the microwave forward on the mounting bracket. The mounting bracket holds the back of your microwave on the wall. Hold the front of the microwave with both hands so it doesn’t fall forward. Start tilting the microwave forward so the tabs on the bracket loosen. Keep tilting your microwave until it’s at about a 30-degree angle. The microwave will pull the mounting bracket off of the wall and damage it if you let it go. If the microwave is too heavy for you to support, have a partner help you hold it. Lift the microwave slightly to take it off of the wall. Support the microwave from underneath and lift it slightly to pop the tabs from the mounting bracket out from the bottom of the microwave. As you’re lifting the microwave, slowly take steps backward until the microwave is out of the opening. Set the microwave on your counter so you don’t have to bend down. Unscrew the mounting bracket from the wall. The mounting bracket will be attached to your wall with 3 or 4 screws. Use an electric screwdriver to remove the screws and take the bracket off of the wall. Don’t try hanging a new microwave on an existing mounting bracket.Tip: New microwaves come with their own mounting brackets, so you don’t need to save the old ones.",
  "sentences":[
    " Removing the Top Screws Pull your range out of the way if you want to access your microwave easier.",
    "Pull an electric range out from the wall and disconnect the power supply.",
    "If you have a gas stove, pull your range out slightly to expose the gas hose and valve.",
    "Turn off the gas valve before loosening the hose with a wrench and pulling the range out the rest of the way.",
    "Set up a step ladder where your range used to be so you can access your microwave without obstruction.",
    "You don’t need to move your range if you don’t want to.",
    "Unplug the microwave from the outlet and feed it through the hole in your cabinets.",
    "Open the cabinets above your microwave and locate the outlet where it’s plugged in.",
    "Once you unplug it, feed the cord through the hole in the bottom of your cabinet so it doesn’t get caught when you try to pull it out.",
    "Always make sure your microwave is unplugged before moving it so you don’t get shocked.",
    "Unscrew the mounting screws on top of your microwave.",
    "Locate the 2-3 screws on the bottom of the cabinet connecting to the top of your microwave.",
    "Keep one hand underneath the front of the microwave to support it so it doesn’t fall.",
    "Use an electric screwdriver to turn the screws.",
    "Have a partner help support the microwave from underneath so it doesn’t drop.",
    "Taking out the Microwave Tilt the microwave forward on the mounting bracket.",
    "The mounting bracket holds the back of your microwave on the wall.",
    "Hold the front of the microwave with both hands so it doesn’t fall forward.",
    "Start tilting the microwave forward so the tabs on the bracket loosen.",
    "Keep tilting your microwave until it’s at about a 30-degree angle.",
    "The microwave will pull the mounting bracket off of the wall and damage it if you let it go.",
    "If the microwave is too heavy for you to support, have a partner help you hold it.",
    "Lift the microwave slightly to take it off of the wall.",
    "Support the microwave from underneath and lift it slightly to pop the tabs from the mounting bracket out from the bottom of the microwave.",
    "As you’re lifting the microwave, slowly take steps backward until the microwave is out of the opening.",
    "Set the microwave on your counter so you don’t have to bend down.",
    "Unscrew the mounting bracket from the wall.",
    "The mounting bracket will be attached to your wall with 3 or 4 screws.",
    "Use an electric screwdriver to remove the screws and take the bracket off of the wall.",
    "Don’t try hanging a new microwave on an existing mounting bracket.Tip: New microwaves come with their own mounting brackets, so you don’t need to save the old ones."
  ],
  "tyn_section":[
    "Wrench",
    "Stepladder",
    "Electric screwdriver"
  ],
  "tyn_model":[
    "microwave",
    "electric screwdriver",
    "electric range",
    "microwaves"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.5,
    "f1":0.4
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857
  }
}