{
  "title":"How to Cook a Duck",
  "url":"https://www.wikihow.com/Cook-a-Duck",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Decide how many people you will be feeding.",
          "description":"A standard adult serving is 1/3 lb of duck (.15 kg)."
        },
        {
          "headline":"Look for duck meat that has a high quality grading, such as USDA Grade A.",
          "description":"This grade of duck meat will be a 6-8-week-old duckling raised indoors and fed with fortified corn and soybeans."
        },
        {
          "headline":"Select your preferred cut of duck meat.",
          "description":"A whole duck with skin on is the most popular and commonly found selection. However, you can have the meat divided, de-boned and the duck skin and fat layer removed by a butcher."
        }
      ]
    },
    {
      "name":"Whole Roasted Duck",
      "steps":[
        {
          "headline":"Place the duck on a cutting board.",
          "description":"Cut off the tips of the wings. Remove any excess fat from the neck and inside the body cavity."
        },
        {
          "headline":"Rinse the inside and outside of the duck with cold water.",
          "description":"Pat it dry with a paper towel."
        },
        {
          "headline":"Pierce the skin and thick fat layer of the duck.",
          "description":"Use a knife or skewer, and make piercings at one-inch (2.5 cm) intervals. Be sure to pierce all the way through the fat layer just below the skin, but not into the meat. You will feel resistance when you get to the meat layer. You can skip this step if you purchased duck meat with the skin and fat layer removed."
        },
        {
          "headline":"Put the prepared duck, breast side up, on a rack inside a roasting pan.",
          "description":"The duck will not cook properly if it is not on a rack where the fat layer can drain off the meat."
        },
        {
          "headline":"Pour 2-to-3 cups of boiling water over the duck.",
          "description":"Allow the water to collect in the bottom of the pan. The boiling water will begin to melt the fat layer and help the skin to crisp while cooking."
        },
        {
          "headline":"Rub salt and pepper on the inside and outside of the duck.",
          "description":""
        },
        {
          "headline":"Open the preheated oven (425°F) and insert the duck and roasting pan.",
          "description":"Do not cover the duck."
        },
        {
          "headline":"Roast the duck for about 3 hours, turning the duck every 30 minutes.",
          "description":""
        },
        {
          "headline":"Remove the roasting pan from the oven and test to make sure the duck is finished cooking.",
          "description":"Insert a cooking thermometer into the thickest portion of the duck meat, either the breast or thigh. Be sure the thermometer is not touching any bones. A fully cooked duck should have an internal temperature of 165 degrees Fahrenheit (74 degrees Celsius). Check to see if the duck skin is crispy and the fat layer has fully melted and drained from the duck. If so, your duck has finished cooking. If not, switch your oven to broil and return the roasting pan and duck to the oven. Broil for about 10 minutes."
        },
        {
          "headline":"Transfer the duck to a cutting board.",
          "description":"Allow it to rest for 15 minutes before carving."
        },
        {
          "headline":"Served.",
          "description":""
        }
      ]
    },
    {
      "name":"Pan-Seared Duck Breasts",
      "steps":[
        {
          "headline":"Remove the duck breasts from the refrigerator.",
          "description":"Rise them in cool water and pat dry with a paper towel. Use a knife to score the skin in a cross-hatch pattern on both sides. The cross-hatching will help the skin get crispy. Avoid cutting into the meat."
        },
        {
          "headline":"Salt the breasts on both sides.",
          "description":"Set them on a plate and allow them to come to room temperature."
        },
        {
          "headline":"Scrape the moisture from the duck breasts.",
          "description":"Use the blunt side of a knife to scrape off the moisture that has emerged from the salted breasts. Excess moisture will prevent the skin from getting crispy."
        },
        {
          "headline":"Heat a cast iron skillet or nonstick frying pan over medium heat.",
          "description":"Lay the duck breasts in the pan with the skin sides down. Cook for 3 to 5 minutes, depending on the size of the breasts."
        },
        {
          "headline":"Turn the breasts to the other side with a pair of tongs.",
          "description":"Cook for an additional 3-5 minutes. After you flip the breasts, salt the now-exposed skin. This will help the skin get even crispier and more flavorful."
        },
        {
          "headline":"Stand the duck breasts on their sides to cook the edges.",
          "description":"Lean the breasts against each other so the edges can cook for about a minute on each side."
        },
        {
          "headline":"Remove the breasts from the pan.",
          "description":"Place them on a cutting board and allow them to rest for 5 minutes before slicing to serve."
        }
      ]
    },
    {
      "name":"Braised Duck Legs",
      "steps":[
        {
          "headline":"Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius).",
          "description":""
        },
        {
          "headline":"Heat a cast iron skillet or other oven-safe skillet over medium heat.",
          "description":"Place the duck legs in the pan with the skin sides down. Sprinkle the legs with salt and pepper and allow them to cook until the skin is brown, about 3 minutes. Flip the legs over with tongs and cook them on the meat side for another minute. Place them on a plate."
        },
        {
          "headline":"Pour the fat from the skillet into a container.",
          "description":"Add 2 Tablespoons of fat back to the skillet, keeping it at medium heat."
        },
        {
          "headline":"Add the vegetables to the skillet.",
          "description":"Sauté them until the onions are translucent, about 5 minutes."
        },
        {
          "headline":"Place the duck legs back in the skillet.",
          "description":""
        },
        {
          "headline":"Pour the chicken stock into the skillet with the duck legs and vegetables.",
          "description":""
        },
        {
          "headline":"Place the skillet in the oven.",
          "description":"Cook for 30 minutes. Turn the heat down to 350 degrees Fahrenheit (177 degrees Celsius) and cook for another 30 minutes."
        },
        {
          "headline":"Remove the skillet from the oven.",
          "description":"The duck legs are done with their meat is tender and the liquid surrounding them is reduced by half."
        }
      ]
    }
  ],
  "text":" Steps Decide how many people you will be feeding. A standard adult serving is 1/3 lb of duck (.15 kg). Look for duck meat that has a high quality grading, such as USDA Grade A. This grade of duck meat will be a 6-8-week-old duckling raised indoors and fed with fortified corn and soybeans. Select your preferred cut of duck meat. A whole duck with skin on is the most popular and commonly found selection. However, you can have the meat divided, de-boned and the duck skin and fat layer removed by a butcher. Whole Roasted Duck Place the duck on a cutting board. Cut off the tips of the wings. Remove any excess fat from the neck and inside the body cavity. Rinse the inside and outside of the duck with cold water. Pat it dry with a paper towel. Pierce the skin and thick fat layer of the duck. Use a knife or skewer, and make piercings at one-inch (2.5 cm) intervals. Be sure to pierce all the way through the fat layer just below the skin, but not into the meat. You will feel resistance when you get to the meat layer. You can skip this step if you purchased duck meat with the skin and fat layer removed. Put the prepared duck, breast side up, on a rack inside a roasting pan. The duck will not cook properly if it is not on a rack where the fat layer can drain off the meat. Pour 2-to-3 cups of boiling water over the duck. Allow the water to collect in the bottom of the pan. The boiling water will begin to melt the fat layer and help the skin to crisp while cooking. Rub salt and pepper on the inside and outside of the duck.  Open the preheated oven (425°F) and insert the duck and roasting pan. Do not cover the duck. Roast the duck for about 3 hours, turning the duck every 30 minutes.  Remove the roasting pan from the oven and test to make sure the duck is finished cooking. Insert a cooking thermometer into the thickest portion of the duck meat, either the breast or thigh. Be sure the thermometer is not touching any bones. A fully cooked duck should have an internal temperature of 165 degrees Fahrenheit (74 degrees Celsius). Check to see if the duck skin is crispy and the fat layer has fully melted and drained from the duck. If so, your duck has finished cooking. If not, switch your oven to broil and return the roasting pan and duck to the oven. Broil for about 10 minutes. Transfer the duck to a cutting board. Allow it to rest for 15 minutes before carving. Served.  Pan-Seared Duck Breasts Remove the duck breasts from the refrigerator. Rise them in cool water and pat dry with a paper towel. Use a knife to score the skin in a cross-hatch pattern on both sides. The cross-hatching will help the skin get crispy. Avoid cutting into the meat. Salt the breasts on both sides. Set them on a plate and allow them to come to room temperature. Scrape the moisture from the duck breasts. Use the blunt side of a knife to scrape off the moisture that has emerged from the salted breasts. Excess moisture will prevent the skin from getting crispy. Heat a cast iron skillet or nonstick frying pan over medium heat. Lay the duck breasts in the pan with the skin sides down. Cook for 3 to 5 minutes, depending on the size of the breasts. Turn the breasts to the other side with a pair of tongs. Cook for an additional 3-5 minutes. After you flip the breasts, salt the now-exposed skin. This will help the skin get even crispier and more flavorful. Stand the duck breasts on their sides to cook the edges. Lean the breasts against each other so the edges can cook for about a minute on each side. Remove the breasts from the pan. Place them on a cutting board and allow them to rest for 5 minutes before slicing to serve. Braised Duck Legs Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius).  Heat a cast iron skillet or other oven-safe skillet over medium heat. Place the duck legs in the pan with the skin sides down. Sprinkle the legs with salt and pepper and allow them to cook until the skin is brown, about 3 minutes. Flip the legs over with tongs and cook them on the meat side for another minute. Place them on a plate. Pour the fat from the skillet into a container. Add 2 Tablespoons of fat back to the skillet, keeping it at medium heat. Add the vegetables to the skillet. Sauté them until the onions are translucent, about 5 minutes. Place the duck legs back in the skillet.  Pour the chicken stock into the skillet with the duck legs and vegetables.  Place the skillet in the oven. Cook for 30 minutes. Turn the heat down to 350 degrees Fahrenheit (177 degrees Celsius) and cook for another 30 minutes. Remove the skillet from the oven. The duck legs are done with their meat is tender and the liquid surrounding them is reduced by half.",
  "sentences":[
    " Steps Decide how many people you will be feeding.",
    "A standard adult serving is 1/3 lb of duck (.15 kg).",
    "Look for duck meat that has a high quality grading, such as USDA Grade A.",
    "This grade of duck meat will be a 6-8-week-old duckling raised indoors and fed with fortified corn and soybeans.",
    "Select your preferred cut of duck meat.",
    "A whole duck with skin on is the most popular and commonly found selection.",
    "However, you can have the meat divided, de-boned and the duck skin and fat layer removed by a butcher.",
    "Whole Roasted Duck Place the duck on a cutting board.",
    "Cut off the tips of the wings.",
    "Remove any excess fat from the neck and inside the body cavity.",
    "Rinse the inside and outside of the duck with cold water.",
    "Pat it dry with a paper towel.",
    "Pierce the skin and thick fat layer of the duck.",
    "Use a knife or skewer, and make piercings at one-inch (2.5 cm) intervals.",
    "Be sure to pierce all the way through the fat layer just below the skin, but not into the meat.",
    "You will feel resistance when you get to the meat layer.",
    "You can skip this step if you purchased duck meat with the skin and fat layer removed.",
    "Put the prepared duck, breast side up, on a rack inside a roasting pan.",
    "The duck will not cook properly if it is not on a rack where the fat layer can drain off the meat.",
    "Pour 2-to-3 cups of boiling water over the duck.",
    "Allow the water to collect in the bottom of the pan.",
    "The boiling water will begin to melt the fat layer and help the skin to crisp while cooking.",
    "Rub salt and pepper on the inside and outside of the duck.",
    "Open the preheated oven (425°F) and insert the duck and roasting pan.",
    "Do not cover the duck.",
    "Roast the duck for about 3 hours, turning the duck every 30 minutes.",
    "Remove the roasting pan from the oven and test to make sure the duck is finished cooking.",
    "Insert a cooking thermometer into the thickest portion of the duck meat, either the breast or thigh.",
    "Be sure the thermometer is not touching any bones.",
    "A fully cooked duck should have an internal temperature of 165 degrees Fahrenheit (74 degrees Celsius).",
    "Check to see if the duck skin is crispy and the fat layer has fully melted and drained from the duck.",
    "If so, your duck has finished cooking.",
    "If not, switch your oven to broil and return the roasting pan and duck to the oven.",
    "Broil for about 10 minutes.",
    "Transfer the duck to a cutting board.",
    "Allow it to rest for 15 minutes before carving.",
    "Served.",
    "Pan-Seared Duck Breasts Remove the duck breasts from the refrigerator.",
    "Rise them in cool water and pat dry with a paper towel.",
    "Use a knife to score the skin in a cross-hatch pattern on both sides.",
    "The cross-hatching will help the skin get crispy.",
    "Avoid cutting into the meat.",
    "Salt the breasts on both sides.",
    "Set them on a plate and allow them to come to room temperature.",
    "Scrape the moisture from the duck breasts.",
    "Use the blunt side of a knife to scrape off the moisture that has emerged from the salted breasts.",
    "Excess moisture will prevent the skin from getting crispy.",
    "Heat a cast iron skillet or nonstick frying pan over medium heat.",
    "Lay the duck breasts in the pan with the skin sides down.",
    "Cook for 3 to 5 minutes, depending on the size of the breasts.",
    "Turn the breasts to the other side with a pair of tongs.",
    "Cook for an additional 3-5 minutes.",
    "After you flip the breasts, salt the now-exposed skin.",
    "This will help the skin get even crispier and more flavorful.",
    "Stand the duck breasts on their sides to cook the edges.",
    "Lean the breasts against each other so the edges can cook for about a minute on each side.",
    "Remove the breasts from the pan.",
    "Place them on a cutting board and allow them to rest for 5 minutes before slicing to serve.",
    "Braised Duck Legs Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius).",
    "Heat a cast iron skillet or other oven-safe skillet over medium heat.",
    "Place the duck legs in the pan with the skin sides down.",
    "Sprinkle the legs with salt and pepper and allow them to cook until the skin is brown, about 3 minutes.",
    "Flip the legs over with tongs and cook them on the meat side for another minute.",
    "Place them on a plate.",
    "Pour the fat from the skillet into a container.",
    "Add 2 Tablespoons of fat back to the skillet, keeping it at medium heat.",
    "Add the vegetables to the skillet.",
    "Sauté them until the onions are translucent, about 5 minutes.",
    "Place the duck legs back in the skillet.",
    "Pour the chicken stock into the skillet with the duck legs and vegetables.",
    "Place the skillet in the oven.",
    "Cook for 30 minutes.",
    "Turn the heat down to 350 degrees Fahrenheit (177 degrees Celsius) and cook for another 30 minutes.",
    "Remove the skillet from the oven.",
    "The duck legs are done with their meat is tender and the liquid surrounding them is reduced by half."
  ],
  "tyn_section":[
    "Ingredients listed above",
    "Roasting pan with rack or stand",
    "Oven",
    "Internal cooking thermometer",
    "Cutting board",
    "Paper towels",
    "Knife or skewer",
    "Oven-safe skillet"
  ],
  "tyn_model":[
    "duck",
    "oven",
    "skillet",
    "duck meat",
    "roasting pan",
    "water",
    "knife",
    "duck breasts",
    "cutting board",
    "paper towel",
    "salt and pepper",
    "salt",
    "plate",
    "cast iron skillet",
    "duck legs",
    "butcher",
    "cold water",
    "cooking thermometer",
    "refrigerator",
    "nonstick frying pan",
    "oven-safe skillet",
    "container",
    "vegetables",
    "onions",
    "chicken stock"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.12,
    "f1":0.1818181818,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.32,
    "f1":0.4686192469
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.16,
    "f1":0.2424242424
  }
}