{
  "title":"How to Make Bread Sauce",
  "url":"https://www.wikihow.com/Make-Bread-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Sauces"
  ],
  "methods":[
    {
      "name":"Making a Traditional Bread Sauce",
      "steps":[
        {
          "headline":"Prepare the bread crumbs 24 hours in advance.",
          "description":"With a bread knife, cut the loaf of fresh white bread into thick slices. Remove the crust from edges of each slice and set aside along with the ends of the bread. Place the slices on a drying rack and leave on your counter to become stale overnight. If you’ve forgotten this step, you can dry the bread out in the oven. Preheat the oven to a very low temperature. After removing the crust, place the thick slices of bread on a baking sheet and put it in the oven. Once the bread feels dry to the touch, remove it from the oven. Do not toast the bread."
        },
        {
          "headline":"Peel, quarter, and stuff the onion with cloves.",
          "description":"Remove the outer layers of the white onion. Cut the peeled onion into quarters. Stud each quarter with one clove."
        },
        {
          "headline":"Combine the ingredients in a saucepan.",
          "description":"Pour 1 liter of full fat milk into the sauce pan. Add the quartered onions, 2 bay leaves, 1 teaspoon whole white peppercorn, 2 blades of mace, and 1 teaspoon table salt. If you are using ground mace, sprinkle it into the milk."
        },
        {
          "headline":"Bring the contents to a near boil and then let them infuse.",
          "description":"Gradually heat the mixture. Just before it starts to boil, remove the saucepan from the heat. Cover the saucepan and let the mixture infuse for 1 to 2 hours."
        },
        {
          "headline":"Rip apart the stale bread and add the crumbs to the sauce.",
          "description":"Retrieve your stale white bread and a mixing bowl. As you hold the bread over the opening of the bowl, tear each slice into cubes. The mixing bowl will catch the cubes and all of the crumbs."
        },
        {
          "headline":"Add the bread to the infused sauce and heat.",
          "description":"Return the saucepan to a burner set on very low heat. Uncover the pan and pour in the breadcrumbs. The bread crumbs will absorb the milk, thickening the sauce. Cook the sauce until thick, approximately fifteen minutes. Before you add the crumbs, you may strain the milk. This will remove the onion, bay leaves, peppercorns, and mace."
        },
        {
          "headline":"Add butter, cream, and nutmeg to the sauce.",
          "description":"Prior to serving, stir in 30 grams (2 tablespoons) of butter. Add a splash of cream or milk to the sauce if desired. Grate the fresh nutmeg over the sauce. You may also add more salt."
        },
        {
          "headline":"Serve.",
          "description":"Pour the sauce into a warmed gravy boat or bowl. Grate more fresh nutmeg over the top of the sauce. Bring the fragrant sauce to the table for your guests to eat with their meat."
        }
      ]
    },
    {
      "name":"Making a Gluten-Free Bread Sauce",
      "steps":[
        {
          "headline":"Prepare the bread crumbs in advance.",
          "description":"Slice a loaf of gluten-free white bread into thick pieces. Cut the crust from each edge of the slices and discard the ends. Put the slices on a drying rack and leave on your counter to become stale overnight. If you’ve forgotten this step, you can dry the bread out in the oven. Preheat the oven to a very low temperature. Remove the crust from each thick slice of gluten-free bread. Put the bread on a baking sheet and place in the oven. Once the bread feels dry to the touch, remove it from the oven. Do not toast the bread."
        },
        {
          "headline":"Combine the onion, milk, cloves, and bay leaves in a pan.",
          "description":"Peel and grate the white onion. Pour 1 liter of whole milk into a saucepan. Add the grated onion, a pinch of cloves, and 2 bay leaves to the saucepan."
        },
        {
          "headline":"Bring the mixture to a near boil.",
          "description":"Place the saucepan on a burner. Allow the contents to heat gradually. Do not allow the sauce to boil."
        },
        {
          "headline":"Add the breadcrumbs and reduce the heat.",
          "description":"As the sauce heats, rip apart the stale bread into cubes over a mixing bowl. Just before the sauce comes to a boil, stir in the bread crumbs. Reduce the heat immediately."
        },
        {
          "headline":"Simmer the sauce over low heat until it is thick.",
          "description":"Allow the sauce to simmer on low for approximately ten minutes. During this time, the bread crumbs will absorb the milk and thicken the sauce. Once the sauce is thick, remove the pan from the heat."
        },
        {
          "headline":"Remove the bay leaves, add butter, and stir in cream.",
          "description":"Use a slotted spoon to fish out the bay leaves. Add a knob of butter (approximately 1 ½ to 2 tablespoons). Pour in three tablespoons of double cream."
        },
        {
          "headline":"Season and serve the sauce.",
          "description":"Season the sauce with salt, pepper, and freshly grated nutmeg to taste. Pour the bread sauce into a warmed bowl or gravy boat. Serve the sauce as an accompaniment to your turkey."
        }
      ]
    },
    {
      "name":"Making a Vegan Bread Sauce",
      "steps":[
        {
          "headline":"Prepare the bread crumbs in advance.",
          "description":"Cut the fresh white bread of your choice into thick slices. With a knife, remove the crust from each slice. Place the bread on a drying rack and leave on the counter overnight to become stale. If you’ve forgotten this step, you can dry the bread in the oven. Preheat the oven to a very low temperature. Cut the bread and remove the crust. Put the bread on a baking sheet and place in the oven. Once the bread feels dry to the touch, remove it from the oven. Do not toast the bread."
        },
        {
          "headline":"Insert the cloves into the peeled onion.",
          "description":"Peel the large white onion. Cut the onion into quarters. Stud each quarter with 1 to 2 cloves."
        },
        {
          "headline":"Combine the onion and milk in a saucepan and bring to a boil.",
          "description":"Pour ½ pint soy milk into a sauce pan. Add the onion to the pan. Gradually heat the soy milk to a boil."
        },
        {
          "headline":"Let the mixture infuse for 1 hour.",
          "description":"Once the soy milk comes to a boil, remove it from the heat. Cover the pan with a lid. Allow the mixture to infuse for 1 hour."
        },
        {
          "headline":"Rip apart the stale bread and add the crumbs to the sauce.",
          "description":"While the sauce infuses, prepare your bread crumbs. Tear apart the stale bread into cubes over a mixing bowl. The mixing bowl will catch the cubes and all of the crumbs."
        },
        {
          "headline":"Add vegan margarine, bread crumbs, and seasonings to the sauce.",
          "description":"After 1 hour, uncover the infused sauce. Add 1 knob (1 ½ to 2 tablespoons) of vegan margarine. Pour in the bread crumbs. Season the sauce with salt and pepper to taste."
        },
        {
          "headline":"Simmer the sauce over low heat for 15 minutes.",
          "description":"Return the saucepan to a burner. Let the sauce simmer over a very low heat until it is thick. This will take approximately 15 minutes."
        },
        {
          "headline":"Remove the onion, add vegan cream, and serve.",
          "description":"Once the sauce is thick, remove the pan from the heat. Take out the onion and add a splash of vegan cream if desired. Pour the bread sauce into a warmed bowl or gravy boat and serve to your guests."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Traditional Bread Sauce Prepare the bread crumbs 24 hours in advance. With a bread knife, cut the loaf of fresh white bread into thick slices. Remove the crust from edges of each slice and set aside along with the ends of the bread. Place the slices on a drying rack and leave on your counter to become stale overnight. If you’ve forgotten this step, you can dry the bread out in the oven. Preheat the oven to a very low temperature. After removing the crust, place the thick slices of bread on a baking sheet and put it in the oven. Once the bread feels dry to the touch, remove it from the oven. Do not toast the bread. Peel, quarter, and stuff the onion with cloves. Remove the outer layers of the white onion. Cut the peeled onion into quarters. Stud each quarter with one clove. Combine the ingredients in a saucepan. Pour 1 liter of full fat milk into the sauce pan. Add the quartered onions, 2 bay leaves, 1 teaspoon whole white peppercorn, 2 blades of mace, and 1 teaspoon table salt. If you are using ground mace, sprinkle it into the milk. Bring the contents to a near boil and then let them infuse. Gradually heat the mixture. Just before it starts to boil, remove the saucepan from the heat. Cover the saucepan and let the mixture infuse for 1 to 2 hours. Rip apart the stale bread and add the crumbs to the sauce. Retrieve your stale white bread and a mixing bowl. As you hold the bread over the opening of the bowl, tear each slice into cubes. The mixing bowl will catch the cubes and all of the crumbs. Add the bread to the infused sauce and heat. Return the saucepan to a burner set on very low heat. Uncover the pan and pour in the breadcrumbs. The bread crumbs will absorb the milk, thickening the sauce. Cook the sauce until thick, approximately fifteen minutes. Before you add the crumbs, you may strain the milk. This will remove the onion, bay leaves, peppercorns, and mace. Add butter, cream, and nutmeg to the sauce. Prior to serving, stir in 30 grams (2 tablespoons) of butter. Add a splash of cream or milk to the sauce if desired. Grate the fresh nutmeg over the sauce. You may also add more salt. Serve. Pour the sauce into a warmed gravy boat or bowl. Grate more fresh nutmeg over the top of the sauce. Bring the fragrant sauce to the table for your guests to eat with their meat. Making a Gluten-Free Bread Sauce Prepare the bread crumbs in advance. Slice a loaf of gluten-free white bread into thick pieces. Cut the crust from each edge of the slices and discard the ends. Put the slices on a drying rack and leave on your counter to become stale overnight. If you’ve forgotten this step, you can dry the bread out in the oven. Preheat the oven to a very low temperature. Remove the crust from each thick slice of gluten-free bread. Put the bread on a baking sheet and place in the oven. Once the bread feels dry to the touch, remove it from the oven. Do not toast the bread. Combine the onion, milk, cloves, and bay leaves in a pan. Peel and grate the white onion. Pour 1 liter of whole milk into a saucepan. Add the grated onion, a pinch of cloves, and 2 bay leaves to the saucepan. Bring the mixture to a near boil. Place the saucepan on a burner. Allow the contents to heat gradually. Do not allow the sauce to boil. Add the breadcrumbs and reduce the heat. As the sauce heats, rip apart the stale bread into cubes over a mixing bowl. Just before the sauce comes to a boil, stir in the bread crumbs. Reduce the heat immediately. Simmer the sauce over low heat until it is thick. Allow the sauce to simmer on low for approximately ten minutes. During this time, the bread crumbs will absorb the milk and thicken the sauce. Once the sauce is thick, remove the pan from the heat. Remove the bay leaves, add butter, and stir in cream. Use a slotted spoon to fish out the bay leaves. Add a knob of butter (approximately 1 ½ to 2 tablespoons). Pour in three tablespoons of double cream. Season and serve the sauce. Season the sauce with salt, pepper, and freshly grated nutmeg to taste. Pour the bread sauce into a warmed bowl or gravy boat. Serve the sauce as an accompaniment to your turkey. Making a Vegan Bread Sauce Prepare the bread crumbs in advance. Cut the fresh white bread of your choice into thick slices. With a knife, remove the crust from each slice. Place the bread on a drying rack and leave on the counter overnight to become stale. If you’ve forgotten this step, you can dry the bread in the oven. Preheat the oven to a very low temperature. Cut the bread and remove the crust. Put the bread on a baking sheet and place in the oven. Once the bread feels dry to the touch, remove it from the oven. Do not toast the bread. Insert the cloves into the peeled onion. Peel the large white onion. Cut the onion into quarters. Stud each quarter with 1 to 2 cloves. Combine the onion and milk in a saucepan and bring to a boil. Pour ½ pint soy milk into a sauce pan. Add the onion to the pan. Gradually heat the soy milk to a boil. Let the mixture infuse for 1 hour. Once the soy milk comes to a boil, remove it from the heat. Cover the pan with a lid. Allow the mixture to infuse for 1 hour. Rip apart the stale bread and add the crumbs to the sauce. While the sauce infuses, prepare your bread crumbs. Tear apart the stale bread into cubes over a mixing bowl. The mixing bowl will catch the cubes and all of the crumbs. Add vegan margarine, bread crumbs, and seasonings to the sauce. After 1 hour, uncover the infused sauce. Add 1 knob (1 ½ to 2 tablespoons) of vegan margarine. Pour in the bread crumbs. Season the sauce with salt and pepper to taste. Simmer the sauce over low heat for 15 minutes. Return the saucepan to a burner. Let the sauce simmer over a very low heat until it is thick. This will take approximately 15 minutes. Remove the onion, add vegan cream, and serve. Once the sauce is thick, remove the pan from the heat. Take out the onion and add a splash of vegan cream if desired. Pour the bread sauce into a warmed bowl or gravy boat and serve to your guests. Finished. ",
  "sentences":[
    " Making a Traditional Bread Sauce Prepare the bread crumbs 24 hours in advance.",
    "With a bread knife, cut the loaf of fresh white bread into thick slices.",
    "Remove the crust from edges of each slice and set aside along with the ends of the bread.",
    "Place the slices on a drying rack and leave on your counter to become stale overnight.",
    "If you’ve forgotten this step, you can dry the bread out in the oven.",
    "Preheat the oven to a very low temperature.",
    "After removing the crust, place the thick slices of bread on a baking sheet and put it in the oven.",
    "Once the bread feels dry to the touch, remove it from the oven.",
    "Do not toast the bread.",
    "Peel, quarter, and stuff the onion with cloves.",
    "Remove the outer layers of the white onion.",
    "Cut the peeled onion into quarters.",
    "Stud each quarter with one clove.",
    "Combine the ingredients in a saucepan.",
    "Pour 1 liter of full fat milk into the sauce pan.",
    "Add the quartered onions, 2 bay leaves, 1 teaspoon whole white peppercorn, 2 blades of mace, and 1 teaspoon table salt.",
    "If you are using ground mace, sprinkle it into the milk.",
    "Bring the contents to a near boil and then let them infuse.",
    "Gradually heat the mixture.",
    "Just before it starts to boil, remove the saucepan from the heat.",
    "Cover the saucepan and let the mixture infuse for 1 to 2 hours.",
    "Rip apart the stale bread and add the crumbs to the sauce.",
    "Retrieve your stale white bread and a mixing bowl.",
    "As you hold the bread over the opening of the bowl, tear each slice into cubes.",
    "The mixing bowl will catch the cubes and all of the crumbs.",
    "Add the bread to the infused sauce and heat.",
    "Return the saucepan to a burner set on very low heat.",
    "Uncover the pan and pour in the breadcrumbs.",
    "The bread crumbs will absorb the milk, thickening the sauce.",
    "Cook the sauce until thick, approximately fifteen minutes.",
    "Before you add the crumbs, you may strain the milk.",
    "This will remove the onion, bay leaves, peppercorns, and mace.",
    "Add butter, cream, and nutmeg to the sauce.",
    "Prior to serving, stir in 30 grams (2 tablespoons) of butter.",
    "Add a splash of cream or milk to the sauce if desired.",
    "Grate the fresh nutmeg over the sauce.",
    "You may also add more salt.",
    "Serve.",
    "Pour the sauce into a warmed gravy boat or bowl.",
    "Grate more fresh nutmeg over the top of the sauce.",
    "Bring the fragrant sauce to the table for your guests to eat with their meat.",
    "Making a Gluten-Free Bread Sauce Prepare the bread crumbs in advance.",
    "Slice a loaf of gluten-free white bread into thick pieces.",
    "Cut the crust from each edge of the slices and discard the ends.",
    "Put the slices on a drying rack and leave on your counter to become stale overnight.",
    "If you’ve forgotten this step, you can dry the bread out in the oven.",
    "Preheat the oven to a very low temperature.",
    "Remove the crust from each thick slice of gluten-free bread.",
    "Put the bread on a baking sheet and place in the oven.",
    "Once the bread feels dry to the touch, remove it from the oven.",
    "Do not toast the bread.",
    "Combine the onion, milk, cloves, and bay leaves in a pan.",
    "Peel and grate the white onion.",
    "Pour 1 liter of whole milk into a saucepan.",
    "Add the grated onion, a pinch of cloves, and 2 bay leaves to the saucepan.",
    "Bring the mixture to a near boil.",
    "Place the saucepan on a burner.",
    "Allow the contents to heat gradually.",
    "Do not allow the sauce to boil.",
    "Add the breadcrumbs and reduce the heat.",
    "As the sauce heats, rip apart the stale bread into cubes over a mixing bowl.",
    "Just before the sauce comes to a boil, stir in the bread crumbs.",
    "Reduce the heat immediately.",
    "Simmer the sauce over low heat until it is thick.",
    "Allow the sauce to simmer on low for approximately ten minutes.",
    "During this time, the bread crumbs will absorb the milk and thicken the sauce.",
    "Once the sauce is thick, remove the pan from the heat.",
    "Remove the bay leaves, add butter, and stir in cream.",
    "Use a slotted spoon to fish out the bay leaves.",
    "Add a knob of butter (approximately 1 ½ to 2 tablespoons).",
    "Pour in three tablespoons of double cream.",
    "Season and serve the sauce.",
    "Season the sauce with salt, pepper, and freshly grated nutmeg to taste.",
    "Pour the bread sauce into a warmed bowl or gravy boat.",
    "Serve the sauce as an accompaniment to your turkey.",
    "Making a Vegan Bread Sauce Prepare the bread crumbs in advance.",
    "Cut the fresh white bread of your choice into thick slices.",
    "With a knife, remove the crust from each slice.",
    "Place the bread on a drying rack and leave on the counter overnight to become stale.",
    "If you’ve forgotten this step, you can dry the bread in the oven.",
    "Preheat the oven to a very low temperature.",
    "Cut the bread and remove the crust.",
    "Put the bread on a baking sheet and place in the oven.",
    "Once the bread feels dry to the touch, remove it from the oven.",
    "Do not toast the bread.",
    "Insert the cloves into the peeled onion.",
    "Peel the large white onion.",
    "Cut the onion into quarters.",
    "Stud each quarter with 1 to 2 cloves.",
    "Combine the onion and milk in a saucepan and bring to a boil.",
    "Pour ½ pint soy milk into a sauce pan.",
    "Add the onion to the pan.",
    "Gradually heat the soy milk to a boil.",
    "Let the mixture infuse for 1 hour.",
    "Once the soy milk comes to a boil, remove it from the heat.",
    "Cover the pan with a lid.",
    "Allow the mixture to infuse for 1 hour.",
    "Rip apart the stale bread and add the crumbs to the sauce.",
    "While the sauce infuses, prepare your bread crumbs.",
    "Tear apart the stale bread into cubes over a mixing bowl.",
    "The mixing bowl will catch the cubes and all of the crumbs.",
    "Add vegan margarine, bread crumbs, and seasonings to the sauce.",
    "After 1 hour, uncover the infused sauce.",
    "Add 1 knob (1 ½ to 2 tablespoons) of vegan margarine.",
    "Pour in the bread crumbs.",
    "Season the sauce with salt and pepper to taste.",
    "Simmer the sauce over low heat for 15 minutes.",
    "Return the saucepan to a burner.",
    "Let the sauce simmer over a very low heat until it is thick.",
    "This will take approximately 15 minutes.",
    "Remove the onion, add vegan cream, and serve.",
    "Once the sauce is thick, remove the pan from the heat.",
    "Take out the onion and add a splash of vegan cream if desired.",
    "Pour the bread sauce into a warmed bowl or gravy boat and serve to your guests.",
    "Finished."
  ],
  "tyn_section":[
    "1L saucepan",
    "Wooden spoon or whisk",
    "Measuring utensils"
  ],
  "tyn_model":[
    "oven",
    "onion",
    "saucepan",
    "bread crumbs",
    "milk",
    "mixing bowl",
    "bread",
    "pan",
    "butter",
    "baking sheet",
    "cloves",
    "white onion",
    "bay leaves",
    "cream",
    "nutmeg",
    "gravy boat",
    "soy milk",
    "sauce pan",
    "white bread",
    "bowl",
    "salt",
    "bread sauce",
    "vegan margarine",
    "vegan cream",
    "bread knife",
    "fresh white bread",
    "full fat milk",
    "onions",
    "whole white peppercorn",
    "mace",
    "table salt",
    "ground mace",
    "burner",
    "gluten-free bread sauce",
    "gluten-free white bread",
    "gluten-free bread",
    "whole milk",
    "slotted spoon",
    "double cream",
    "pepper",
    "turkey",
    "knife",
    "seasonings",
    "salt and pepper"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0227272727,
    "f1":0.0425531915
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.0227272727,
    "f1":0.0425531915
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}