{
  "title":"How to Pack for an American Girl Doll",
  "url":"https://www.wikihow.com/Pack-for-an-American-Girl-Doll",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Dolls and Doll Houses",
    "Fashion Dolls",
    "American Girl Dolls"
  ],
  "methods":[
    {
      "name":"Choosing the doll",
      "steps":[
        {
          "headline":"Choose the doll you want to take with you.",
          "description":"It's easier if you bring dolls with straight hair, or short hair like Kit Kittredge. It's harder to care for dolls with long curly hair when you're traveling, and there's a risk of getting their hair messy from wind, food crumbs, etc."
        },
        {
          "headline":"Consider taking two dolls.",
          "description":"If you do, this means packing more things for them but it's a good idea to let them share clothes or you'll carry too much. The more you take, the easier is to lose things. If you do decide to bring an American girl doll with curly hair and/or if she has a water spray bottle to use, make sure the spray bottle is empty, this way your trip will be comfortable."
        }
      ]
    },
    {
      "name":"Making a packing list",
      "steps":[
        {
          "headline":"Make a list of stuff you're going to pack for your doll.",
          "description":"The list will help you choose what to take. But it's also useful to take with you, as you can check it off each time you leave a place you're staying at, to make sure you have all the things you brought along."
        },
        {
          "headline":"Make a list for a short trip.",
          "description":"This could include:\n2 pairs of casual clothing\n2 pairs of pajamas\nDon't waste space packing extra things you don't need for a short trip."
        },
        {
          "headline":"Make a long trip list.",
          "description":"This could include:\nSeveral sets of casual clothing\n2 or more pairs of pajamas\nBathing suit (even if it's cold, pools are often inside hotels)\nSnow gear like skates (depending on time of year)."
        },
        {
          "headline":"Pack cosmetics.",
          "description":"Pack your doll's hairbrush, hair pick (for curly haired dolls), anything you absolutely need. Maybe include a hair helper kit, if you have one."
        },
        {
          "headline":"Limit the toy kits to just two.",
          "description":"Again, remember how easy it is to lose things while traveling."
        },
        {
          "headline":"Bring the doll's stuffed animal.",
          "description":"Your doll loves her stuffed animal, so always remember them."
        }
      ]
    },
    {
      "name":"Packing the bag",
      "steps":[
        {
          "headline":"Choose a suitable bag.",
          "description":"A small bag is best and one you can find easily, such as something brightly colored. Add a bell to it so that it if falls over, you hear it. Try to pack everything in a single bag rather than having more than one bag."
        },
        {
          "headline":"Pack it all up in a bag.",
          "description":"Now off you go!"
        }
      ]
    }
  ],
  "text":" Choosing the doll Choose the doll you want to take with you. It's easier if you bring dolls with straight hair, or short hair like Kit Kittredge. It's harder to care for dolls with long curly hair when you're traveling, and there's a risk of getting their hair messy from wind, food crumbs, etc. Consider taking two dolls. If you do, this means packing more things for them but it's a good idea to let them share clothes or you'll carry too much. The more you take, the easier is to lose things. If you do decide to bring an American girl doll with curly hair and/or if she has a water spray bottle to use, make sure the spray bottle is empty, this way your trip will be comfortable. Making a packing list Make a list of stuff you're going to pack for your doll. The list will help you choose what to take. But it's also useful to take with you, as you can check it off each time you leave a place you're staying at, to make sure you have all the things you brought along. Make a list for a short trip. This could include:\n2 pairs of casual clothing\n2 pairs of pajamas\nDon't waste space packing extra things you don't need for a short trip. Make a long trip list. This could include:\nSeveral sets of casual clothing\n2 or more pairs of pajamas\nBathing suit (even if it's cold, pools are often inside hotels)\nSnow gear like skates (depending on time of year). Pack cosmetics. Pack your doll's hairbrush, hair pick (for curly haired dolls), anything you absolutely need. Maybe include a hair helper kit, if you have one. Limit the toy kits to just two. Again, remember how easy it is to lose things while traveling. Bring the doll's stuffed animal. Your doll loves her stuffed animal, so always remember them. Packing the bag Choose a suitable bag. A small bag is best and one you can find easily, such as something brightly colored. Add a bell to it so that it if falls over, you hear it. Try to pack everything in a single bag rather than having more than one bag. Pack it all up in a bag. Now off you go!",
  "sentences":[
    " Choosing the doll Choose the doll you want to take with you.",
    "It's easier if you bring dolls with straight hair, or short hair like Kit Kittredge.",
    "It's harder to care for dolls with long curly hair when you're traveling, and there's a risk of getting their hair messy from wind, food crumbs, etc.",
    "Consider taking two dolls.",
    "If you do, this means packing more things for them but it's a good idea to let them share clothes or you'll carry too much.",
    "The more you take, the easier is to lose things.",
    "If you do decide to bring an American girl doll with curly hair and/or if she has a water spray bottle to use, make sure the spray bottle is empty, this way your trip will be comfortable.",
    "Making a packing list Make a list of stuff you're going to pack for your doll.",
    "The list will help you choose what to take.",
    "But it's also useful to take with you, as you can check it off each time you leave a place you're staying at, to make sure you have all the things you brought along.",
    "Make a list for a short trip.",
    "This could include:\n2 pairs of casual clothing\n2 pairs of pajamas\nDon't waste space packing extra things you don't need for a short trip.",
    "Make a long trip list.",
    "This could include:\nSeveral sets of casual clothing\n2 or more pairs of pajamas\nBathing suit (even if it's cold, pools are often inside hotels)\nSnow gear like skates (depending on time of year).",
    "Pack cosmetics.",
    "Pack your doll's hairbrush, hair pick (for curly haired dolls), anything you absolutely need.",
    "Maybe include a hair helper kit, if you have one.",
    "Limit the toy kits to just two.",
    "Again, remember how easy it is to lose things while traveling.",
    "Bring the doll's stuffed animal.",
    "Your doll loves her stuffed animal, so always remember them.",
    "Packing the bag Choose a suitable bag.",
    "A small bag is best and one you can find easily, such as something brightly colored.",
    "Add a bell to it so that it if falls over, you hear it.",
    "Try to pack everything in a single bag rather than having more than one bag.",
    "Pack it all up in a bag.",
    "Now off you go!"
  ],
  "tyn_section":[
    "Mini suitcase (you can get a travel set at Target. If you can't get one, pack a little bag.)",
    "Doll",
    "Clothes",
    "Hair care kit and other accessories",
    "Toys and stuffed animals (long trips only)"
  ],
  "tyn_model":[
    "dolls",
    "pajamas",
    "bathing suit",
    "cosmetics",
    "toy kits",
    "bag"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}