{
  "title":"How to Make Simple But Effective Paper Art Projects",
  "url":"https://www.wikihow.com/Make-Simple-But-Effective-Paper-Art-Projects",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"Using Crayons",
      "steps":[
        {
          "headline":"Make a picture using the crayon resist technique.",
          "description":"Use high-quality wax crayons to create a picture, as these will provide more resistance to the paint. It is also recommended to use paper created for watercolor for the best results. Draw a picture using brightly colored crayons. Use whatever inspiration you need. By varying the pressure of your coloring, you can make different effects when you apply the paint. Paint over your picture with dark watercolor paint. A brightly colored picture with a dark background makes for a striking contrast."
        },
        {
          "headline":"Make a picture with crayon etching.",
          "description":"For best results use a sturdy paper like poster board. Cover the paper with different colors and shapes. Using bright colors is recommended. Cover the paper with its bright colors with a black crayon. Make sure there is a thick layer of black crayon over the paper. You can also use poster paint or India ink to cover the colors. Scratch out a design on the paper using a popsicle stick, paper clip, or similar implement."
        },
        {
          "headline":"Make a stained glass effect with melted crayons.",
          "description":"Use a cheese grater or crayon sharpener (often included with a box of crayons) to make crayon shavings. You can save money by using old or broken crayons. Cut two large pieces of waxed paper. Sprinkle the crayon shavings onto the waxed paper. You can create a pattern or sprinkle the shavings in random shapes. Cover the waxed paper and shavings with the second piece of waxed paper to create a paper \"sandwich\". Set the paper sandwich on a piece of newsprint or paper towel on a stable surface. An ironing board works well. Run an iron on a low setting over the waxed paper sandwich until the crayon shavings are melted. Let the paper sandwich cool for a few minutes before handling. Display the stained glass artwork where the light can shine through it. A window works well."
        }
      ]
    },
    {
      "name":"Using Colored Pencils",
      "steps":[
        {
          "headline":"Gather some colored pencils.",
          "description":"Often considered a children's medium, colored pencils can be used to create some amazing special effects. Select a brand to suit your project. Apart from pencils for specialized use, colored pencils come in two varieties, wax-based and oil-based. The main difference between wax and oil-based pencils is that wax-based pencils have a softer texture than oil-based. The different textures require different techniques for blending colors."
        },
        {
          "headline":"Layer your colors.",
          "description":"There are three basic techniques for blending colors: layering, blending, and burnishing.. To layer colors, select a paper with some tooth so you can use a light to medium pressure to add as much color as you need. Apply your base color to the paper. Add secondary color using light to medium pressure. Use complementary colors to create shadowy areas. Blending complementary colors into an object creates a more realistic shadow than using a black pencil."
        },
        {
          "headline":"Blend your colors.",
          "description":"After you have layered on your colors, you can mix them together by blending. There are two basic methods for blending. Dry blending. After layering your colors, rub the area you want to blend with a paper towel or tissue until you reach the desired amount of blending. Solvent blending. Dip a brush in household rubbing alcohol or mineral spirits and lightly go over the area you want to blend. Be careful not to \"scrub\" with the solvent as this can damage the colors or tear the paper."
        },
        {
          "headline":"Try burnishing your drawing.",
          "description":"Burnishing is a technique where you apply layers of colors to the paper using heavy pressure, \"grinding\" the colors into the paper, resulting in rich and vibrant color. Start by applying your base colors. Apply several layers using a light to medium pressure. You can apply dark or lighter colors in any order depending on the effect you want to achieve. Apply your burnishing pencil. You can use a colorless or a colored pencil to achieve your effect. You may want to practice your colors on scrap paper before you burnish your project."
        }
      ]
    },
    {
      "name":"Drawing With Pastels",
      "steps":[
        {
          "headline":"Select your pastels.",
          "description":"Pastels are a type of art medium that come in stick form, similar to chalk or crayons. There are many types of pastels, but for a student or casual artist soft, hard, and oil pastels are the types most commonly used. Draw with soft pastels. This type of pastel is best for drawing when you want to blend colors. Blending can be achieved by adding layers of different colors, or applying colors side by side and smudging. Since soft pastels are easily smudged, finished drawings must be stabilized by applying a protective substance called fixative. You can buy fixative online or at an art supply store. Add details with hard pastels. Hard pastels less brilliant in color than soft pastels, but produce sharper lines and are used for adding fine detail to a drawing. Create vibrant drawings with oil pastels. Oil pastels have a denser texture than soft pastels and are not as easy to blend. They are also more stable on paper and do not require a fixative to be applied."
        },
        {
          "headline":"Select your paper.",
          "description":"For the best results, use a paper with some texture, or tooth, that the pigment can adhere to. Use pastel paper, watercolor paper, or canvas."
        },
        {
          "headline":"Select your technique.",
          "description":"There are many ways you can use pastels for drawing. You can use pastels on their own, or with different mediums like watercolor. There is no right or wrong way. Use pastels like drawing pencils. Hold the pastel like a pencil and begin drawing using the end of the pastel. Create large color blocks with the side of the pastel. Don't be afraid to break a pastel to get the size you want. Apply pastel dust to the drawing. With a craft knife or scissors, scrape the pastel to create dust over the area where you want to apply color, then use a palette knife to press the dust into the paper surface."
        }
      ]
    },
    {
      "name":"Using Paints",
      "steps":[
        {
          "headline":"Create an unusual backdrop effect with salt and watercolor.",
          "description":"Cover a paper with a layer of watercolor paint. This technique is known as a wash.\nSprinkle a layer of salt over the paper. Larger crystals such as kosher salt work best with this technique. Brush off the salt crystals after the paint dries. Draw or paint your picture with watercolor, acrylic, pencil, or any medium you want."
        },
        {
          "headline":"Create a wash with tissue paper.",
          "description":"Cover the paper with a layer of watercolor paper. Crumple a piece of tissue paper and press it down on the wet paint, making sure to cover the entire surface. Let the paint dry slightly, but not completely. Carefully remove the tissue paper. Create your picture after the paint has dried completely."
        },
        {
          "headline":"Use acrylics for texture.",
          "description":"Acrylic paints are water-based paints that lend themselves to a variety of techniques. You can use them straight from the tube, or thin them with water. Paint with wet acrylics. You can add a little water to make the paints flow more smoothly, or add more water to make the acrylic more like watercolor. For a wet-on-wet technique, mix acrylic paint with water until it is the consistency of watercolor, then drip or splatter a second color of the same consistency onto the base layer. Paint with dry acrylics. Acrylic paint straight from the tube has a thick consistency that can be applied to paper with a brush or pallet knife to create a textured surface."
        },
        {
          "headline":"Create marbled paper with milk paint.",
          "description":"You can create marbled effects using a shallow tray, watercolor paper, milk, and food coloring. Cut the paper to fit easily in the tray. Pour sufficient milk into the tray to cover the bottom with a thin layer. The milk should be either whole or 2%. Any type of milk can be used, but almond milk is recommended. Add drops of food coloring. Add a few drops of dish soap. Swirl the colors with a cotton swab to create a marbled effect. Place the paper on top of the milk mixture. Press down. Carefully lift the paper from the tray and set aside to dry. Continue with additional sheets."
        }
      ]
    }
  ],
  "text":" Using Crayons Make a picture using the crayon resist technique. Use high-quality wax crayons to create a picture, as these will provide more resistance to the paint. It is also recommended to use paper created for watercolor for the best results. Draw a picture using brightly colored crayons. Use whatever inspiration you need. By varying the pressure of your coloring, you can make different effects when you apply the paint. Paint over your picture with dark watercolor paint. A brightly colored picture with a dark background makes for a striking contrast. Make a picture with crayon etching. For best results use a sturdy paper like poster board. Cover the paper with different colors and shapes. Using bright colors is recommended. Cover the paper with its bright colors with a black crayon. Make sure there is a thick layer of black crayon over the paper. You can also use poster paint or India ink to cover the colors. Scratch out a design on the paper using a popsicle stick, paper clip, or similar implement. Make a stained glass effect with melted crayons. Use a cheese grater or crayon sharpener (often included with a box of crayons) to make crayon shavings. You can save money by using old or broken crayons. Cut two large pieces of waxed paper. Sprinkle the crayon shavings onto the waxed paper. You can create a pattern or sprinkle the shavings in random shapes. Cover the waxed paper and shavings with the second piece of waxed paper to create a paper \"sandwich\". Set the paper sandwich on a piece of newsprint or paper towel on a stable surface. An ironing board works well. Run an iron on a low setting over the waxed paper sandwich until the crayon shavings are melted. Let the paper sandwich cool for a few minutes before handling. Display the stained glass artwork where the light can shine through it. A window works well. Using Colored Pencils Gather some colored pencils. Often considered a children's medium, colored pencils can be used to create some amazing special effects. Select a brand to suit your project. Apart from pencils for specialized use, colored pencils come in two varieties, wax-based and oil-based. The main difference between wax and oil-based pencils is that wax-based pencils have a softer texture than oil-based. The different textures require different techniques for blending colors. Layer your colors. There are three basic techniques for blending colors: layering, blending, and burnishing.. To layer colors, select a paper with some tooth so you can use a light to medium pressure to add as much color as you need. Apply your base color to the paper. Add secondary color using light to medium pressure. Use complementary colors to create shadowy areas. Blending complementary colors into an object creates a more realistic shadow than using a black pencil. Blend your colors. After you have layered on your colors, you can mix them together by blending. There are two basic methods for blending. Dry blending. After layering your colors, rub the area you want to blend with a paper towel or tissue until you reach the desired amount of blending. Solvent blending. Dip a brush in household rubbing alcohol or mineral spirits and lightly go over the area you want to blend. Be careful not to \"scrub\" with the solvent as this can damage the colors or tear the paper. Try burnishing your drawing. Burnishing is a technique where you apply layers of colors to the paper using heavy pressure, \"grinding\" the colors into the paper, resulting in rich and vibrant color. Start by applying your base colors. Apply several layers using a light to medium pressure. You can apply dark or lighter colors in any order depending on the effect you want to achieve. Apply your burnishing pencil. You can use a colorless or a colored pencil to achieve your effect. You may want to practice your colors on scrap paper before you burnish your project. Drawing With Pastels Select your pastels. Pastels are a type of art medium that come in stick form, similar to chalk or crayons. There are many types of pastels, but for a student or casual artist soft, hard, and oil pastels are the types most commonly used. Draw with soft pastels. This type of pastel is best for drawing when you want to blend colors. Blending can be achieved by adding layers of different colors, or applying colors side by side and smudging. Since soft pastels are easily smudged, finished drawings must be stabilized by applying a protective substance called fixative. You can buy fixative online or at an art supply store. Add details with hard pastels. Hard pastels less brilliant in color than soft pastels, but produce sharper lines and are used for adding fine detail to a drawing. Create vibrant drawings with oil pastels. Oil pastels have a denser texture than soft pastels and are not as easy to blend. They are also more stable on paper and do not require a fixative to be applied. Select your paper. For the best results, use a paper with some texture, or tooth, that the pigment can adhere to. Use pastel paper, watercolor paper, or canvas. Select your technique. There are many ways you can use pastels for drawing. You can use pastels on their own, or with different mediums like watercolor. There is no right or wrong way. Use pastels like drawing pencils. Hold the pastel like a pencil and begin drawing using the end of the pastel. Create large color blocks with the side of the pastel. Don't be afraid to break a pastel to get the size you want. Apply pastel dust to the drawing. With a craft knife or scissors, scrape the pastel to create dust over the area where you want to apply color, then use a palette knife to press the dust into the paper surface. Using Paints Create an unusual backdrop effect with salt and watercolor. Cover a paper with a layer of watercolor paint. This technique is known as a wash.\nSprinkle a layer of salt over the paper. Larger crystals such as kosher salt work best with this technique. Brush off the salt crystals after the paint dries. Draw or paint your picture with watercolor, acrylic, pencil, or any medium you want. Create a wash with tissue paper. Cover the paper with a layer of watercolor paper. Crumple a piece of tissue paper and press it down on the wet paint, making sure to cover the entire surface. Let the paint dry slightly, but not completely. Carefully remove the tissue paper. Create your picture after the paint has dried completely. Use acrylics for texture. Acrylic paints are water-based paints that lend themselves to a variety of techniques. You can use them straight from the tube, or thin them with water. Paint with wet acrylics. You can add a little water to make the paints flow more smoothly, or add more water to make the acrylic more like watercolor. For a wet-on-wet technique, mix acrylic paint with water until it is the consistency of watercolor, then drip or splatter a second color of the same consistency onto the base layer. Paint with dry acrylics. Acrylic paint straight from the tube has a thick consistency that can be applied to paper with a brush or pallet knife to create a textured surface. Create marbled paper with milk paint. You can create marbled effects using a shallow tray, watercolor paper, milk, and food coloring. Cut the paper to fit easily in the tray. Pour sufficient milk into the tray to cover the bottom with a thin layer. The milk should be either whole or 2%. Any type of milk can be used, but almond milk is recommended. Add drops of food coloring. Add a few drops of dish soap. Swirl the colors with a cotton swab to create a marbled effect. Place the paper on top of the milk mixture. Press down. Carefully lift the paper from the tray and set aside to dry. Continue with additional sheets.",
  "sentences":[
    " Using Crayons Make a picture using the crayon resist technique.",
    "Use high-quality wax crayons to create a picture, as these will provide more resistance to the paint.",
    "It is also recommended to use paper created for watercolor for the best results.",
    "Draw a picture using brightly colored crayons.",
    "Use whatever inspiration you need.",
    "By varying the pressure of your coloring, you can make different effects when you apply the paint.",
    "Paint over your picture with dark watercolor paint.",
    "A brightly colored picture with a dark background makes for a striking contrast.",
    "Make a picture with crayon etching.",
    "For best results use a sturdy paper like poster board.",
    "Cover the paper with different colors and shapes.",
    "Using bright colors is recommended.",
    "Cover the paper with its bright colors with a black crayon.",
    "Make sure there is a thick layer of black crayon over the paper.",
    "You can also use poster paint or India ink to cover the colors.",
    "Scratch out a design on the paper using a popsicle stick, paper clip, or similar implement.",
    "Make a stained glass effect with melted crayons.",
    "Use a cheese grater or crayon sharpener (often included with a box of crayons) to make crayon shavings.",
    "You can save money by using old or broken crayons.",
    "Cut two large pieces of waxed paper.",
    "Sprinkle the crayon shavings onto the waxed paper.",
    "You can create a pattern or sprinkle the shavings in random shapes.",
    "Cover the waxed paper and shavings with the second piece of waxed paper to create a paper \"sandwich\".",
    "Set the paper sandwich on a piece of newsprint or paper towel on a stable surface.",
    "An ironing board works well.",
    "Run an iron on a low setting over the waxed paper sandwich until the crayon shavings are melted.",
    "Let the paper sandwich cool for a few minutes before handling.",
    "Display the stained glass artwork where the light can shine through it.",
    "A window works well.",
    "Using Colored Pencils Gather some colored pencils.",
    "Often considered a children's medium, colored pencils can be used to create some amazing special effects.",
    "Select a brand to suit your project.",
    "Apart from pencils for specialized use, colored pencils come in two varieties, wax-based and oil-based.",
    "The main difference between wax and oil-based pencils is that wax-based pencils have a softer texture than oil-based.",
    "The different textures require different techniques for blending colors.",
    "Layer your colors.",
    "There are three basic techniques for blending colors: layering, blending, and burnishing.. To layer colors, select a paper with some tooth so you can use a light to medium pressure to add as much color as you need.",
    "Apply your base color to the paper.",
    "Add secondary color using light to medium pressure.",
    "Use complementary colors to create shadowy areas.",
    "Blending complementary colors into an object creates a more realistic shadow than using a black pencil.",
    "Blend your colors.",
    "After you have layered on your colors, you can mix them together by blending.",
    "There are two basic methods for blending.",
    "Dry blending.",
    "After layering your colors, rub the area you want to blend with a paper towel or tissue until you reach the desired amount of blending.",
    "Solvent blending.",
    "Dip a brush in household rubbing alcohol or mineral spirits and lightly go over the area you want to blend.",
    "Be careful not to \"scrub\" with the solvent as this can damage the colors or tear the paper.",
    "Try burnishing your drawing.",
    "Burnishing is a technique where you apply layers of colors to the paper using heavy pressure, \"grinding\" the colors into the paper, resulting in rich and vibrant color.",
    "Start by applying your base colors.",
    "Apply several layers using a light to medium pressure.",
    "You can apply dark or lighter colors in any order depending on the effect you want to achieve.",
    "Apply your burnishing pencil.",
    "You can use a colorless or a colored pencil to achieve your effect.",
    "You may want to practice your colors on scrap paper before you burnish your project.",
    "Drawing With Pastels Select your pastels.",
    "Pastels are a type of art medium that come in stick form, similar to chalk or crayons.",
    "There are many types of pastels, but for a student or casual artist soft, hard, and oil pastels are the types most commonly used.",
    "Draw with soft pastels.",
    "This type of pastel is best for drawing when you want to blend colors.",
    "Blending can be achieved by adding layers of different colors, or applying colors side by side and smudging.",
    "Since soft pastels are easily smudged, finished drawings must be stabilized by applying a protective substance called fixative.",
    "You can buy fixative online or at an art supply store.",
    "Add details with hard pastels.",
    "Hard pastels less brilliant in color than soft pastels, but produce sharper lines and are used for adding fine detail to a drawing.",
    "Create vibrant drawings with oil pastels.",
    "Oil pastels have a denser texture than soft pastels and are not as easy to blend.",
    "They are also more stable on paper and do not require a fixative to be applied.",
    "Select your paper.",
    "For the best results, use a paper with some texture, or tooth, that the pigment can adhere to.",
    "Use pastel paper, watercolor paper, or canvas.",
    "Select your technique.",
    "There are many ways you can use pastels for drawing.",
    "You can use pastels on their own, or with different mediums like watercolor.",
    "There is no right or wrong way.",
    "Use pastels like drawing pencils.",
    "Hold the pastel like a pencil and begin drawing using the end of the pastel.",
    "Create large color blocks with the side of the pastel.",
    "Don't be afraid to break a pastel to get the size you want.",
    "Apply pastel dust to the drawing.",
    "With a craft knife or scissors, scrape the pastel to create dust over the area where you want to apply color, then use a palette knife to press the dust into the paper surface.",
    "Using Paints Create an unusual backdrop effect with salt and watercolor.",
    "Cover a paper with a layer of watercolor paint.",
    "This technique is known as a wash.\nSprinkle a layer of salt over the paper.",
    "Larger crystals such as kosher salt work best with this technique.",
    "Brush off the salt crystals after the paint dries.",
    "Draw or paint your picture with watercolor, acrylic, pencil, or any medium you want.",
    "Create a wash with tissue paper.",
    "Cover the paper with a layer of watercolor paper.",
    "Crumple a piece of tissue paper and press it down on the wet paint, making sure to cover the entire surface.",
    "Let the paint dry slightly, but not completely.",
    "Carefully remove the tissue paper.",
    "Create your picture after the paint has dried completely.",
    "Use acrylics for texture.",
    "Acrylic paints are water-based paints that lend themselves to a variety of techniques.",
    "You can use them straight from the tube, or thin them with water.",
    "Paint with wet acrylics.",
    "You can add a little water to make the paints flow more smoothly, or add more water to make the acrylic more like watercolor.",
    "For a wet-on-wet technique, mix acrylic paint with water until it is the consistency of watercolor, then drip or splatter a second color of the same consistency onto the base layer.",
    "Paint with dry acrylics.",
    "Acrylic paint straight from the tube has a thick consistency that can be applied to paper with a brush or pallet knife to create a textured surface.",
    "Create marbled paper with milk paint.",
    "You can create marbled effects using a shallow tray, watercolor paper, milk, and food coloring.",
    "Cut the paper to fit easily in the tray.",
    "Pour sufficient milk into the tray to cover the bottom with a thin layer.",
    "The milk should be either whole or 2%.",
    "Any type of milk can be used, but almond milk is recommended.",
    "Add drops of food coloring.",
    "Add a few drops of dish soap.",
    "Swirl the colors with a cotton swab to create a marbled effect.",
    "Place the paper on top of the milk mixture.",
    "Press down.",
    "Carefully lift the paper from the tray and set aside to dry.",
    "Continue with additional sheets."
  ],
  "tyn_section":[
    "Crayon Resist",
    "High-quality wax crayons (bright colors are recommended)",
    "Watercolor paper",
    "Watercolor paint (dark colors are recommended)",
    "Crayon Etching",
    "Brightly colored crayons",
    "Black crayon large enough to cover the entire paper.",
    "Sturdy paper",
    "Popsicle stick or other implement for scraping",
    "Stained Glass Art",
    "Crayon shavings",
    "Waxed paper",
    "Iron",
    "Colored Pencil Art",
    "High-quality colored pencils",
    "Sketch paper",
    "(Optional) Colorless blending pencil",
    "(Optional) Rubbing alcohol or other solvent",
    "Watercolor Paint Art",
    "Paints",
    "Brushes",
    "(Optional) Coarse salt",
    "(Optional) Tissue paper",
    "Acrylic Paint Art",
    "Acrylic paints",
    "Thick paper",
    "(Optional) Pallet knife",
    "Marbled Milk Paper",
    "Food coloring",
    "Shallow pan or tray",
    "Milk",
    "Dish soap"
  ],
  "tyn_model":[
    "pastels",
    "paper",
    "crayons",
    "crayon",
    "milk",
    "waxed paper",
    "colored pencils",
    "water",
    "pastel",
    "watercolor paper",
    "salt",
    "tissue paper",
    "tray",
    "watercolor paint",
    "oil pastels",
    "paints",
    "acrylic paint",
    "food coloring",
    "paint",
    "poster paint",
    "popsicle stick",
    "cheese grater",
    "crayon sharpener",
    "ironing board",
    "iron",
    "stained glass artwork",
    "pencils",
    "wax-based pencils",
    "black pencil",
    "paper towel",
    "brush",
    "rubbing alcohol",
    "mineral spirits",
    "solvent",
    "burnishing pencil",
    "colorless or a colored pencil",
    "scrap paper",
    "chalk",
    "fixative",
    "pastel paper",
    "canvas",
    "drawing pencils",
    "pencil",
    "pastel dust",
    "craft knife",
    "palette knife",
    "kosher salt",
    "watercolor,",
    "acrylic paints",
    "pallet knife",
    "milk paint",
    "almond milk",
    "dish soap",
    "cotton swab"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.1481481481,
    "f1":0.1860465116,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.3333333333,
    "f1":0.4347826087
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8125,
    "p":0.537037037,
    "f1":0.6466552316
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.40625,
    "p":0.2407407407,
    "f1":0.3023255814
  }
}