{
  "title":"How to Cook Baby Back Ribs",
  "url":"https://www.wikihow.com/Cook-Baby-Back-Ribs",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Gather your ingredients",
      "steps":[
        {
          "headline":"Select your choice of meat.",
          "description":"Pork is the most tender cut of baby back ribs."
        },
        {
          "headline":"Check to see if the white membrane is removed from the bottom of the ribs.",
          "description":"If purchasing from a butcher, have the butcher remove the membrane for you, or you can cut it off at home."
        },
        {
          "headline":"Prepare a seasoning rub for the baby back ribs.",
          "description":"There are several prepackaged rubs on the market, or you can make your own from your favorite seasonings. The most common seasonings include salt, brown sugar, black and red pepper, chili powder, garlic and onion powders."
        },
        {
          "headline":"Decide what type of sauce you want for the ribs.",
          "description":"Like the rubs, you can purchase a prepared sauce or make your own. Common sauce ingredients are dry red wine, honey, ketchup, vinegar, Worcestershire, cayenne pepper and garlic."
        },
        {
          "headline":"Locate a baking dish large enough to hold the entire rack of baby back ribs, yet small enough to fit in your oven.",
          "description":""
        },
        {
          "headline":"Tear off a piece of heavy-duty aluminum foil that is large enough to wrap around the entire rack of ribs and place it in the baking dish.",
          "description":""
        }
      ]
    },
    {
      "name":"Prepare the baby back ribs",
      "steps":[
        {
          "headline":"Rub the top and bottom sides of the baby back ribs with the seasoning rub.",
          "description":"You will want to press the rub deep into the meat of the ribs."
        },
        {
          "headline":"Lay the ribs bottom side down on the foil.",
          "description":""
        },
        {
          "headline":"Wrap the foil around the ribs and crimp the edges, sealing the entire surface area of the ribs.",
          "description":""
        },
        {
          "headline":"Place the baking dish with the ribs in the refrigerator and let it sit overnight.",
          "description":""
        }
      ]
    },
    {
      "name":"Cook the baby back ribs",
      "steps":[
        {
          "headline":"Preheat your oven to 300 °F (149 °C), (150 degrees Centigrade).",
          "description":""
        },
        {
          "headline":"Remove the baby back ribs from the refrigerator and let them sit on the counter while the oven preheats.",
          "description":"They should be almost room temperature before placing them in the oven."
        },
        {
          "headline":"Cook the ribs for 2 hours and then remove them from the oven.",
          "description":"Leave the oven on, as you will be returning the ribs to cook with the sauce."
        },
        {
          "headline":"Open the foil carefully and check the ribs to see if they are cooking properly.",
          "description":"At this point, the meat should begin to pull away from the bones and the bones should be loose in their sockets."
        },
        {
          "headline":"Pour the purchased or homemade sauce over the ribs and close the foil.",
          "description":""
        },
        {
          "headline":"Return the ribs to the oven and cook for 30 more minutes.",
          "description":"If your baby back ribs were starting to dry out when you added the sauce, reduce the cooking time to about 20 minutes."
        }
      ]
    },
    {
      "name":"Glaze the baby back ribs",
      "steps":[
        {
          "headline":"Remove the ribs from the oven.",
          "description":""
        },
        {
          "headline":"Switch your oven to the broil setting.",
          "description":""
        },
        {
          "headline":"Pour off the sauce from the ribs into a medium-sized saucepan.",
          "description":""
        },
        {
          "headline":"Heat and stir the sauce over medium heat until it is thick and syrupy.",
          "description":""
        },
        {
          "headline":"Use a basting brush to coat the top portion of the ribs with the heated sauce.",
          "description":""
        },
        {
          "headline":"Leave the ribs unwrapped and place them on the top rack of your oven.",
          "description":""
        },
        {
          "headline":"Broil for about 3 minutes, making sure the ribs do not start to burn.",
          "description":""
        },
        {
          "headline":"Remove the ribs from your oven, flip the ribs over and baste the bottom side with the heated sauce.",
          "description":""
        },
        {
          "headline":"Return the ribs, unwrapped, to the oven to broil for another 3 minutes.",
          "description":""
        },
        {
          "headline":"Take out the baby back ribs from the oven, let cool for 10-15 minutes and enjoy.",
          "description":""
        }
      ]
    }
  ],
  "text":" Gather your ingredients Select your choice of meat. Pork is the most tender cut of baby back ribs. Check to see if the white membrane is removed from the bottom of the ribs. If purchasing from a butcher, have the butcher remove the membrane for you, or you can cut it off at home. Prepare a seasoning rub for the baby back ribs. There are several prepackaged rubs on the market, or you can make your own from your favorite seasonings. The most common seasonings include salt, brown sugar, black and red pepper, chili powder, garlic and onion powders. Decide what type of sauce you want for the ribs. Like the rubs, you can purchase a prepared sauce or make your own. Common sauce ingredients are dry red wine, honey, ketchup, vinegar, Worcestershire, cayenne pepper and garlic. Locate a baking dish large enough to hold the entire rack of baby back ribs, yet small enough to fit in your oven.  Tear off a piece of heavy-duty aluminum foil that is large enough to wrap around the entire rack of ribs and place it in the baking dish.  Prepare the baby back ribs Rub the top and bottom sides of the baby back ribs with the seasoning rub. You will want to press the rub deep into the meat of the ribs. Lay the ribs bottom side down on the foil.  Wrap the foil around the ribs and crimp the edges, sealing the entire surface area of the ribs.  Place the baking dish with the ribs in the refrigerator and let it sit overnight.  Cook the baby back ribs Preheat your oven to 300 °F (149 °C), (150 degrees Centigrade).  Remove the baby back ribs from the refrigerator and let them sit on the counter while the oven preheats. They should be almost room temperature before placing them in the oven. Cook the ribs for 2 hours and then remove them from the oven. Leave the oven on, as you will be returning the ribs to cook with the sauce. Open the foil carefully and check the ribs to see if they are cooking properly. At this point, the meat should begin to pull away from the bones and the bones should be loose in their sockets. Pour the purchased or homemade sauce over the ribs and close the foil.  Return the ribs to the oven and cook for 30 more minutes. If your baby back ribs were starting to dry out when you added the sauce, reduce the cooking time to about 20 minutes. Glaze the baby back ribs Remove the ribs from the oven.  Switch your oven to the broil setting.  Pour off the sauce from the ribs into a medium-sized saucepan.  Heat and stir the sauce over medium heat until it is thick and syrupy.  Use a basting brush to coat the top portion of the ribs with the heated sauce.  Leave the ribs unwrapped and place them on the top rack of your oven.  Broil for about 3 minutes, making sure the ribs do not start to burn.  Remove the ribs from your oven, flip the ribs over and baste the bottom side with the heated sauce.  Return the ribs, unwrapped, to the oven to broil for another 3 minutes.  Take out the baby back ribs from the oven, let cool for 10-15 minutes and enjoy. ",
  "sentences":[
    " Gather your ingredients Select your choice of meat.",
    "Pork is the most tender cut of baby back ribs.",
    "Check to see if the white membrane is removed from the bottom of the ribs.",
    "If purchasing from a butcher, have the butcher remove the membrane for you, or you can cut it off at home.",
    "Prepare a seasoning rub for the baby back ribs.",
    "There are several prepackaged rubs on the market, or you can make your own from your favorite seasonings.",
    "The most common seasonings include salt, brown sugar, black and red pepper, chili powder, garlic and onion powders.",
    "Decide what type of sauce you want for the ribs.",
    "Like the rubs, you can purchase a prepared sauce or make your own.",
    "Common sauce ingredients are dry red wine, honey, ketchup, vinegar, Worcestershire, cayenne pepper and garlic.",
    "Locate a baking dish large enough to hold the entire rack of baby back ribs, yet small enough to fit in your oven.",
    "Tear off a piece of heavy-duty aluminum foil that is large enough to wrap around the entire rack of ribs and place it in the baking dish.",
    "Prepare the baby back ribs Rub the top and bottom sides of the baby back ribs with the seasoning rub.",
    "You will want to press the rub deep into the meat of the ribs.",
    "Lay the ribs bottom side down on the foil.",
    "Wrap the foil around the ribs and crimp the edges, sealing the entire surface area of the ribs.",
    "Place the baking dish with the ribs in the refrigerator and let it sit overnight.",
    "Cook the baby back ribs Preheat your oven to 300 °F (149 °C), (150 degrees Centigrade).",
    "Remove the baby back ribs from the refrigerator and let them sit on the counter while the oven preheats.",
    "They should be almost room temperature before placing them in the oven.",
    "Cook the ribs for 2 hours and then remove them from the oven.",
    "Leave the oven on, as you will be returning the ribs to cook with the sauce.",
    "Open the foil carefully and check the ribs to see if they are cooking properly.",
    "At this point, the meat should begin to pull away from the bones and the bones should be loose in their sockets.",
    "Pour the purchased or homemade sauce over the ribs and close the foil.",
    "Return the ribs to the oven and cook for 30 more minutes.",
    "If your baby back ribs were starting to dry out when you added the sauce, reduce the cooking time to about 20 minutes.",
    "Glaze the baby back ribs Remove the ribs from the oven.",
    "Switch your oven to the broil setting.",
    "Pour off the sauce from the ribs into a medium-sized saucepan.",
    "Heat and stir the sauce over medium heat until it is thick and syrupy.",
    "Use a basting brush to coat the top portion of the ribs with the heated sauce.",
    "Leave the ribs unwrapped and place them on the top rack of your oven.",
    "Broil for about 3 minutes, making sure the ribs do not start to burn.",
    "Remove the ribs from your oven, flip the ribs over and baste the bottom side with the heated sauce.",
    "Return the ribs, unwrapped, to the oven to broil for another 3 minutes.",
    "Take out the baby back ribs from the oven, let cool for 10-15 minutes and enjoy."
  ],
  "tyn_section":[
    "Baby back ribs",
    "Dry seasoning rub",
    "Sauce",
    "Medium-sized saucepan",
    "Baking dish",
    "Oven with bake and broil settings",
    "Heavy-duty aluminum foil",
    "Basting brush"
  ],
  "tyn_model":[
    "oven",
    "baby back ribs",
    "ribs",
    "foil",
    "baking dish",
    "garlic",
    "refrigerator",
    "pork",
    "seasoning rub",
    "seasonings",
    "salt",
    "brown sugar",
    "black and red pepper",
    "chili powder",
    "dry red wine",
    "honey",
    "ketchup",
    "vinegar",
    "worcestershire,",
    "cayenne pepper",
    "heavy-duty aluminum foil",
    "homemade sauce",
    "broil",
    "medium-sized saucepan",
    "basting brush"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.2,
    "f1":0.303030303,
    "avg_pos":0.04
  },
  "jacc_metrics_0.5":{
    "r":0.875,
    "p":0.28,
    "f1":0.4242424242
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.36,
    "f1":0.5101214575
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.24,
    "f1":0.3636363636
  }
}