{
  "title":"How to Tie a Butcher's Knot",
  "url":"https://www.wikihow.com/Tie-a-Butcher%27s-Knot",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "methods":[
    {
      "name":"Using One Long Piece of Twine",
      "steps":[
        {
          "headline":"Measure and cut a length of kitchen twine.",
          "description":"Lay it next to your meat so you can measure before you cut. This will ensure that you have cut the proper length of twine to entirely wrap your meat (or package). If the meat isn't rolled your meat, measure a length 5 times as long as the meat. If you’ve rolled your meat, measure enough twine to wrap it around twice. To roll the meat, first, fold in any edges that are not even. The meat should roughly look like a rectangle. Start at one end of the meat, and roll it up tightly, keeping in mind that uniform rolls will cook more evenly. If thinner edges are hanging out, they will cook faster than the roll itself. Take care to keep stuffing intact as you roll it up."
        },
        {
          "headline":"Slide the twine under the left end of the meat and leave one side longer.",
          "description":"The longer side of the twine should have enough length to completely wrap and tie the meat. Leave enough length on the short end to tie a knot. The short end of the knot should have a few extra inches."
        },
        {
          "headline":"Tie an overhand knot on top of the meat.",
          "description":"Loop one end of the twine and push the other end through it. Pull tightly to secure the knot. This will hold the string in place as you tie the meat."
        },
        {
          "headline":"Run twine longwise, hold in place with the other hand, and wrap.",
          "description":"Space the ties  ⁄4 to 1 ⁄4 in (1.9 to 3.2 cm) apart. This will hold the meat's shape and help keep the stuffing in place. Holding the twine in place helps keep its position while you wrap."
        },
        {
          "headline":"Slip the end over and under the wrapped twine, at the top.",
          "description":"Make sure the twine is pulled tightly through. This secures the wrap and holds the meat’s shape."
        },
        {
          "headline":"Wrap and tie the rest of the roll.",
          "description":"Make sure your ties are snug, but not so tight that the meat bulges. Bulging meat may result in lost stuffing. The desired result is a roll that stays in place and looks even and beautiful when cooked."
        },
        {
          "headline":"Wind the twine longwise around the meat and back up to the top.",
          "description":"You’ll need to flip the meat over to run it longwise down the middle of the underside and back up to the top. The twine will be perpendicular to the rest of the twine, and it should line up with the very first knot you made. Try holding the meat in one hand as you wrap the twine with the other."
        },
        {
          "headline":"Tie an overhand knot and trim the ends.",
          "description":"Make a loop with one end of the twine and pass the other end through it. Evenly trim the ends so that they are a few inches in length. This will keep them from dragging in the roasting pan."
        }
      ]
    },
    {
      "name":"Tying Multiple Pieces of Twine",
      "steps":[
        {
          "headline":"Cut a length of twine.",
          "description":"Cut enough twine to go around rolled meat twice. Measure 5 times the length of meat that hasn’t been rolled up yet. To roll the meat, trim or fold in any edges that are not even. Try to get it in a rectangle. Roll the end of the meet up tightly. You want a uniform roll so that it cooks evenly. Thicker rolled meat will cook slower than thin edges that are hanging out. Watch for stuffing that might fall out as you roll."
        },
        {
          "headline":"Slide the twine under the meat and bring the ends up.",
          "description":"There should be slightly more twine in your right hand than in your left hand. Reverse these instructions if you are left-handed."
        },
        {
          "headline":"Wrap the longer end counterclockwise around the shorter one.",
          "description":"Do this as close to the meat as possible to ensure that you get a nice snug wrap and to prepare to tie a slip knot. Alternately, you can tie an overhand knot. Loop one end of the twine then pass the other end through the loop. Pull the knot tight."
        },
        {
          "headline":"Make a loop and push the end up under it, then tighten.",
          "description":"This is a slip knot. Tighten it up by pulling the left side then the right. The left side of the string will tighten around the meat while the right side tightens the knot. A slipknot can be tightened or loosened as needed."
        },
        {
          "headline":"Loop the twine, push the other end through it, and tighten.",
          "description":"Do this twice to create a double overhand knot. This secures your twine and your meat roll. Don’t forget to snip the ends of the twine for a neat appearance and to avoid dragging the ends in your roaster pan."
        },
        {
          "headline":"Tie the next piece about an inch from the one before.",
          "description":"Spacing each tie correctly, meaning 0 ⁄4 to 1 ⁄4 in (1.9 to 3.2 cm) from the previous one, will keep your meat in place and help it cook evenly. If the meat is stuffed, this will keep the stuffing from falling out."
        },
        {
          "headline":"Continue tying lengths of twine until all of the meat is tied up.",
          "description":"Make enough ties to hold the meat’s shape and keep the filling in place if you stuffed the meat. Remember to snip the ends after each tie to keep the roll tidy."
        }
      ]
    }
  ],
  "text":" Using One Long Piece of Twine Measure and cut a length of kitchen twine. Lay it next to your meat so you can measure before you cut. This will ensure that you have cut the proper length of twine to entirely wrap your meat (or package). If the meat isn't rolled your meat, measure a length 5 times as long as the meat. If you’ve rolled your meat, measure enough twine to wrap it around twice. To roll the meat, first, fold in any edges that are not even. The meat should roughly look like a rectangle. Start at one end of the meat, and roll it up tightly, keeping in mind that uniform rolls will cook more evenly. If thinner edges are hanging out, they will cook faster than the roll itself. Take care to keep stuffing intact as you roll it up. Slide the twine under the left end of the meat and leave one side longer. The longer side of the twine should have enough length to completely wrap and tie the meat. Leave enough length on the short end to tie a knot. The short end of the knot should have a few extra inches. Tie an overhand knot on top of the meat. Loop one end of the twine and push the other end through it. Pull tightly to secure the knot. This will hold the string in place as you tie the meat. Run twine longwise, hold in place with the other hand, and wrap. Space the ties  ⁄4 to 1 ⁄4 in (1.9 to 3.2 cm) apart. This will hold the meat's shape and help keep the stuffing in place. Holding the twine in place helps keep its position while you wrap. Slip the end over and under the wrapped twine, at the top. Make sure the twine is pulled tightly through. This secures the wrap and holds the meat’s shape. Wrap and tie the rest of the roll. Make sure your ties are snug, but not so tight that the meat bulges. Bulging meat may result in lost stuffing. The desired result is a roll that stays in place and looks even and beautiful when cooked. Wind the twine longwise around the meat and back up to the top. You’ll need to flip the meat over to run it longwise down the middle of the underside and back up to the top. The twine will be perpendicular to the rest of the twine, and it should line up with the very first knot you made. Try holding the meat in one hand as you wrap the twine with the other. Tie an overhand knot and trim the ends. Make a loop with one end of the twine and pass the other end through it. Evenly trim the ends so that they are a few inches in length. This will keep them from dragging in the roasting pan. Tying Multiple Pieces of Twine Cut a length of twine. Cut enough twine to go around rolled meat twice. Measure 5 times the length of meat that hasn’t been rolled up yet. To roll the meat, trim or fold in any edges that are not even. Try to get it in a rectangle. Roll the end of the meet up tightly. You want a uniform roll so that it cooks evenly. Thicker rolled meat will cook slower than thin edges that are hanging out. Watch for stuffing that might fall out as you roll. Slide the twine under the meat and bring the ends up. There should be slightly more twine in your right hand than in your left hand. Reverse these instructions if you are left-handed. Wrap the longer end counterclockwise around the shorter one. Do this as close to the meat as possible to ensure that you get a nice snug wrap and to prepare to tie a slip knot. Alternately, you can tie an overhand knot. Loop one end of the twine then pass the other end through the loop. Pull the knot tight. Make a loop and push the end up under it, then tighten. This is a slip knot. Tighten it up by pulling the left side then the right. The left side of the string will tighten around the meat while the right side tightens the knot. A slipknot can be tightened or loosened as needed. Loop the twine, push the other end through it, and tighten. Do this twice to create a double overhand knot. This secures your twine and your meat roll. Don’t forget to snip the ends of the twine for a neat appearance and to avoid dragging the ends in your roaster pan. Tie the next piece about an inch from the one before. Spacing each tie correctly, meaning 0 ⁄4 to 1 ⁄4 in (1.9 to 3.2 cm) from the previous one, will keep your meat in place and help it cook evenly. If the meat is stuffed, this will keep the stuffing from falling out. Continue tying lengths of twine until all of the meat is tied up. Make enough ties to hold the meat’s shape and keep the filling in place if you stuffed the meat. Remember to snip the ends after each tie to keep the roll tidy.",
  "sentences":[
    " Using One Long Piece of Twine Measure and cut a length of kitchen twine.",
    "Lay it next to your meat so you can measure before you cut.",
    "This will ensure that you have cut the proper length of twine to entirely wrap your meat (or package).",
    "If the meat isn't rolled your meat, measure a length 5 times as long as the meat.",
    "If you’ve rolled your meat, measure enough twine to wrap it around twice.",
    "To roll the meat, first, fold in any edges that are not even.",
    "The meat should roughly look like a rectangle.",
    "Start at one end of the meat, and roll it up tightly, keeping in mind that uniform rolls will cook more evenly.",
    "If thinner edges are hanging out, they will cook faster than the roll itself.",
    "Take care to keep stuffing intact as you roll it up.",
    "Slide the twine under the left end of the meat and leave one side longer.",
    "The longer side of the twine should have enough length to completely wrap and tie the meat.",
    "Leave enough length on the short end to tie a knot.",
    "The short end of the knot should have a few extra inches.",
    "Tie an overhand knot on top of the meat.",
    "Loop one end of the twine and push the other end through it.",
    "Pull tightly to secure the knot.",
    "This will hold the string in place as you tie the meat.",
    "Run twine longwise, hold in place with the other hand, and wrap.",
    "Space the ties  ⁄4 to 1 ⁄4 in (1.9 to 3.2 cm) apart.",
    "This will hold the meat's shape and help keep the stuffing in place.",
    "Holding the twine in place helps keep its position while you wrap.",
    "Slip the end over and under the wrapped twine, at the top.",
    "Make sure the twine is pulled tightly through.",
    "This secures the wrap and holds the meat’s shape.",
    "Wrap and tie the rest of the roll.",
    "Make sure your ties are snug, but not so tight that the meat bulges.",
    "Bulging meat may result in lost stuffing.",
    "The desired result is a roll that stays in place and looks even and beautiful when cooked.",
    "Wind the twine longwise around the meat and back up to the top.",
    "You’ll need to flip the meat over to run it longwise down the middle of the underside and back up to the top.",
    "The twine will be perpendicular to the rest of the twine, and it should line up with the very first knot you made.",
    "Try holding the meat in one hand as you wrap the twine with the other.",
    "Tie an overhand knot and trim the ends.",
    "Make a loop with one end of the twine and pass the other end through it.",
    "Evenly trim the ends so that they are a few inches in length.",
    "This will keep them from dragging in the roasting pan.",
    "Tying Multiple Pieces of Twine Cut a length of twine.",
    "Cut enough twine to go around rolled meat twice.",
    "Measure 5 times the length of meat that hasn’t been rolled up yet.",
    "To roll the meat, trim or fold in any edges that are not even.",
    "Try to get it in a rectangle.",
    "Roll the end of the meet up tightly.",
    "You want a uniform roll so that it cooks evenly.",
    "Thicker rolled meat will cook slower than thin edges that are hanging out.",
    "Watch for stuffing that might fall out as you roll.",
    "Slide the twine under the meat and bring the ends up.",
    "There should be slightly more twine in your right hand than in your left hand.",
    "Reverse these instructions if you are left-handed.",
    "Wrap the longer end counterclockwise around the shorter one.",
    "Do this as close to the meat as possible to ensure that you get a nice snug wrap and to prepare to tie a slip knot.",
    "Alternately, you can tie an overhand knot.",
    "Loop one end of the twine then pass the other end through the loop.",
    "Pull the knot tight.",
    "Make a loop and push the end up under it, then tighten.",
    "This is a slip knot.",
    "Tighten it up by pulling the left side then the right.",
    "The left side of the string will tighten around the meat while the right side tightens the knot.",
    "A slipknot can be tightened or loosened as needed.",
    "Loop the twine, push the other end through it, and tighten.",
    "Do this twice to create a double overhand knot.",
    "This secures your twine and your meat roll.",
    "Don’t forget to snip the ends of the twine for a neat appearance and to avoid dragging the ends in your roaster pan.",
    "Tie the next piece about an inch from the one before.",
    "Spacing each tie correctly, meaning 0 ⁄4 to 1 ⁄4 in (1.9 to 3.2 cm) from the previous one, will keep your meat in place and help it cook evenly.",
    "If the meat is stuffed, this will keep the stuffing from falling out.",
    "Continue tying lengths of twine until all of the meat is tied up.",
    "Make enough ties to hold the meat’s shape and keep the filling in place if you stuffed the meat.",
    "Remember to snip the ends after each tie to keep the roll tidy."
  ],
  "tyn_section":[
    "Kitchen twine or string",
    "Scissors or a sharp knife"
  ],
  "tyn_model":[
    "twine",
    "meat",
    "kitchen twine",
    "roasting pan",
    "roaster pan"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}