{
  "title":"How to Print on a Mug",
  "url":"https://www.wikihow.com/Print-on-a-Mug",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Clay Projects"
  ],
  "methods":[
    {
      "name":"Using a Sublimation Printer and Iron",
      "steps":[
        {
          "headline":"Print out your text or image on a sublimation printer to the correct size.",
          "description":"A sublimation printer prints out your image using ink that can be transferred using heat. This printer also prints the image back to front so that the image isn’t mirrored when it is transferred to the mug. Open the file that contains the text or image that you want to print. Press “File,” select “Print Settings,” tap \"Custom Size,” and then enter the height and width that you would like the image. Always use sublimation paper in a sublimation printer, as regular paper won’t allow the ink to transfer onto your mug."
        },
        {
          "headline":"Place the inked side of the print onto the mug.",
          "description":"Place the print face down onto the mug in your desired position. Check that print is the right way up, as the ink is almost impossible to remove once it has adhered to the mug. Images or text can be placed on the bottom, side, or handle of your mug. Mugs that have a smooth finish work best for this method, as bumpy finishes can make the print look uneven and patchy."
        },
        {
          "headline":"Secure the print in place with heat-proof tape.",
          "description":"This ensures that the print looks sharp and clear on your mug. Place a strip of heat-proof tape on each of the edges of the print to hold it in place. Try not to place the tape over the actual text or image. If possible, place the tape over the white space. Purchase heat-proof tape from a hardware store."
        },
        {
          "headline":"Rub the iron over the back of the print until it goes slightly brown.",
          "description":"Turn your iron onto a low-medium setting and wait for it to heat up. Once it is warm, gently rub it back and forth over the entire print until the paper has a light brown tinge and the image starts to show through the paper. Try to rub the iron over the print as evenly as possible. In order to do this, you will need to slowly swivel the mug around so that the iron touches the entire print. If you want to print a large number of mugs commercially, consider purchasing an automatic mug press. This allows you to heat the sublimation print in the mug press, instead of using an iron."
        },
        {
          "headline":"Remove the tape and the print to reveal the new image on your mug.",
          "description":"Carefully peel back the tape and then lift the printing paper away from your mug. Your freshly printed mug is ready to be used! Avoid placing your printed mug in the dishwasher, as this can damage the print."
        }
      ]
    },
    {
      "name":"Utilizing a Professional Print Company",
      "steps":[
        {
          "headline":"Search for a custom printing website or shop.",
          "description":"There are countless companies that offer mug printing services. Search online for “Custom Mug Printing” or approach your local print shop. Ask the printing company whether they provide the mug or if you need to provide it. Most online mug printing companies don’t give you the option of printing on your own mug. If you want to print on a specific mug, it is best to take it to a print shop. VistaPrint, Shutterfly, and CafePress are inexpensive and popular online mug printing companies."
        },
        {
          "headline":"Give the print company your mug design.",
          "description":"Send the printing company a digital copy of your mug design. Most companies will require you to supply the image in a pdf, docx, or Indesign file. Email the image to the company at the highest resolution that your email provider allows, as this ensures that the image will be as clear as possible. The print company will adjust your image or text to fit onto the mug."
        },
        {
          "headline":"Wait for the mug to be printed.",
          "description":"If you take your mug to a print shop it will often only take a few hours to be printed. If you commission an online print company to print on your mug it will normally take 1-10 business days to be printed and delivered to you."
        }
      ]
    }
  ],
  "text":" Using a Sublimation Printer and Iron Print out your text or image on a sublimation printer to the correct size. A sublimation printer prints out your image using ink that can be transferred using heat. This printer also prints the image back to front so that the image isn’t mirrored when it is transferred to the mug. Open the file that contains the text or image that you want to print. Press “File,” select “Print Settings,” tap \"Custom Size,” and then enter the height and width that you would like the image. Always use sublimation paper in a sublimation printer, as regular paper won’t allow the ink to transfer onto your mug. Place the inked side of the print onto the mug. Place the print face down onto the mug in your desired position. Check that print is the right way up, as the ink is almost impossible to remove once it has adhered to the mug. Images or text can be placed on the bottom, side, or handle of your mug. Mugs that have a smooth finish work best for this method, as bumpy finishes can make the print look uneven and patchy. Secure the print in place with heat-proof tape. This ensures that the print looks sharp and clear on your mug. Place a strip of heat-proof tape on each of the edges of the print to hold it in place. Try not to place the tape over the actual text or image. If possible, place the tape over the white space. Purchase heat-proof tape from a hardware store. Rub the iron over the back of the print until it goes slightly brown. Turn your iron onto a low-medium setting and wait for it to heat up. Once it is warm, gently rub it back and forth over the entire print until the paper has a light brown tinge and the image starts to show through the paper. Try to rub the iron over the print as evenly as possible. In order to do this, you will need to slowly swivel the mug around so that the iron touches the entire print. If you want to print a large number of mugs commercially, consider purchasing an automatic mug press. This allows you to heat the sublimation print in the mug press, instead of using an iron. Remove the tape and the print to reveal the new image on your mug. Carefully peel back the tape and then lift the printing paper away from your mug. Your freshly printed mug is ready to be used! Avoid placing your printed mug in the dishwasher, as this can damage the print. Utilizing a Professional Print Company Search for a custom printing website or shop. There are countless companies that offer mug printing services. Search online for “Custom Mug Printing” or approach your local print shop. Ask the printing company whether they provide the mug or if you need to provide it. Most online mug printing companies don’t give you the option of printing on your own mug. If you want to print on a specific mug, it is best to take it to a print shop. VistaPrint, Shutterfly, and CafePress are inexpensive and popular online mug printing companies. Give the print company your mug design. Send the printing company a digital copy of your mug design. Most companies will require you to supply the image in a pdf, docx, or Indesign file. Email the image to the company at the highest resolution that your email provider allows, as this ensures that the image will be as clear as possible. The print company will adjust your image or text to fit onto the mug. Wait for the mug to be printed. If you take your mug to a print shop it will often only take a few hours to be printed. If you commission an online print company to print on your mug it will normally take 1-10 business days to be printed and delivered to you.",
  "sentences":[
    " Using a Sublimation Printer and Iron Print out your text or image on a sublimation printer to the correct size.",
    "A sublimation printer prints out your image using ink that can be transferred using heat.",
    "This printer also prints the image back to front so that the image isn’t mirrored when it is transferred to the mug.",
    "Open the file that contains the text or image that you want to print.",
    "Press “File,” select “Print Settings,” tap \"Custom Size,” and then enter the height and width that you would like the image.",
    "Always use sublimation paper in a sublimation printer, as regular paper won’t allow the ink to transfer onto your mug.",
    "Place the inked side of the print onto the mug.",
    "Place the print face down onto the mug in your desired position.",
    "Check that print is the right way up, as the ink is almost impossible to remove once it has adhered to the mug.",
    "Images or text can be placed on the bottom, side, or handle of your mug.",
    "Mugs that have a smooth finish work best for this method, as bumpy finishes can make the print look uneven and patchy.",
    "Secure the print in place with heat-proof tape.",
    "This ensures that the print looks sharp and clear on your mug.",
    "Place a strip of heat-proof tape on each of the edges of the print to hold it in place.",
    "Try not to place the tape over the actual text or image.",
    "If possible, place the tape over the white space.",
    "Purchase heat-proof tape from a hardware store.",
    "Rub the iron over the back of the print until it goes slightly brown.",
    "Turn your iron onto a low-medium setting and wait for it to heat up.",
    "Once it is warm, gently rub it back and forth over the entire print until the paper has a light brown tinge and the image starts to show through the paper.",
    "Try to rub the iron over the print as evenly as possible.",
    "In order to do this, you will need to slowly swivel the mug around so that the iron touches the entire print.",
    "If you want to print a large number of mugs commercially, consider purchasing an automatic mug press.",
    "This allows you to heat the sublimation print in the mug press, instead of using an iron.",
    "Remove the tape and the print to reveal the new image on your mug.",
    "Carefully peel back the tape and then lift the printing paper away from your mug.",
    "Your freshly printed mug is ready to be used!",
    "Avoid placing your printed mug in the dishwasher, as this can damage the print.",
    "Utilizing a Professional Print Company Search for a custom printing website or shop.",
    "There are countless companies that offer mug printing services.",
    "Search online for “Custom Mug Printing” or approach your local print shop.",
    "Ask the printing company whether they provide the mug or if you need to provide it.",
    "Most online mug printing companies don’t give you the option of printing on your own mug.",
    "If you want to print on a specific mug, it is best to take it to a print shop.",
    "VistaPrint, Shutterfly, and CafePress are inexpensive and popular online mug printing companies.",
    "Give the print company your mug design.",
    "Send the printing company a digital copy of your mug design.",
    "Most companies will require you to supply the image in a pdf, docx, or Indesign file.",
    "Email the image to the company at the highest resolution that your email provider allows, as this ensures that the image will be as clear as possible.",
    "The print company will adjust your image or text to fit onto the mug.",
    "Wait for the mug to be printed.",
    "If you take your mug to a print shop it will often only take a few hours to be printed.",
    "If you commission an online print company to print on your mug it will normally take 1-10 business days to be printed and delivered to you."
  ],
  "tyn_section":[
    "Using a Sublimination Printer and Iron",
    "Sublimation printer",
    "Iron",
    "Heat-proof tape",
    "Mug"
  ],
  "tyn_model":[
    "mug",
    "iron",
    "sublimation printer",
    "heat-proof tape",
    "printer",
    "“file",
    "” select",
    "“print",
    "” tap",
    "” and",
    "sublimation paper",
    "ink",
    "mug press",
    "“custom",
    "” or"
  ],
  "simple_metrics":{
    "r":0.8,
    "p":0.2666666667,
    "f1":0.4,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.4,
    "f1":0.5333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.4666666667,
    "f1":0.5894736842
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8,
    "p":0.2666666667,
    "f1":0.4
  }
}