{
  "title":"How to Play Canasta",
  "url":"https://www.wikihow.com/Play-Canasta",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games",
    "Shedding Card Games"
  ],
  "parts":[
    {
      "name":"Setting up the Game",
      "steps":[
        {
          "headline":"Pair into partners if you’re playing with more than 2 people.",
          "description":"A standard game of canasta is played with 4 people, although you can play with anywhere from 2 to 6 players by varying the rules slightly. Teams can be chosen randomly by pulling from a shuffled deck of cards. The players with the highest or the lowest cards pair together. When determining the card rank, consider spades to be highest, followed by hearts, diamonds, and clubs. These rankings don’t matter at all in the game and are only worth remembering when you’re setting up the game. For example, if the highest cards drawn are a king and queen, then those players form a partnership. Canasta can be played with an odd number of players. Break into teams of 2, but alternate which team member sits out each round."
        },
        {
          "headline":"Shuffle 2 standard decks with the jokers included.",
          "description":"A standard deck is 52 cards, not counting the jokers. That gives you 108 cards total, since canasta is one of those games where the jokers matter. This is the number of cards you need for most games, including a standard 4-player game. Note that some games of 6-player canasta include an extra deck for a total of 162 cards."
        },
        {
          "headline":"Deal cards clockwise around the table according to the number of players.",
          "description":"Select 1 player to be the dealer. Have that person shuffle the cards and begin dealing them 1 at a time starting with the person to their left. For a standard 4-player game of canasta, deal the cards face down until everyone has 11. For a 2-handed, or 2-player, game, deal 15 cards per player. For 3-handed canasta, start with 13 cards. Take 2 cards each time you pick from the draw pile."
        },
        {
          "headline":"Stack the remaining cards to form the draw pile.",
          "description":"The leftover cards form the draw pile for players to pick from during their turn. At the beginning of your turn, you get to pick a card. Take the top card off the pile and add it to your hand. When the draw pile runs out of cards, the round ends after the next player cannot make a play. Keep an eye on the draw pile since it is an important source of new cards. Once it is gone, the round will end not long after it. Play as many cards as you can before this happens."
        },
        {
          "headline":"Turn the top card over to set up a discard pile.",
          "description":"Place the discard pile next to the draw pile, but first check which card is face up. The face up card needs to be a “natural,” which means it can’t be a bonus card. If it is a bonus card, keep turning over cards until you get a natural. The bonus cards are the jokers, 2s, and red 3s. Be on the lookout for cards you need in the draw pile. To take the pile, you need to be able to match it with cards in your hand to score points."
        }
      ]
    },
    {
      "name":"Playing the First Round",
      "steps":[
        {
          "headline":"Pick from the draw pile at the start of your turn if you need another card.",
          "description":"Play starts with the player on the dealer’s left and goes clockwise around the table. If you don’t like what you see on the discard pile, start your turn by taking the top card off the draw pile. Add the card to your hand and look for possible scoring opportunities. If you draw a red 3, play it and pick another card. Then, continue your turn as you normally would. You have to pick up a card at the start of your turn unless you’re taking from the discard pile. At the start of your turn, you have the choice to choose from either pile. It's one or the other."
        },
        {
          "headline":"Take the discard pile if you are able to make a match with the top card.",
          "description":"If the top card on the discard pile catches your eye, take it instead of picking from the draw pile. It can only be taken if you are able to use it right away to score points. Keep in mind, however, that you have to take the entire discard pile along with it! The discard pile is one of the most exciting parts of canasta. By taking the discard pile, you might end up with a lot extra cards to deal with, but you also get many more potential scoring opportunities."
        },
        {
          "headline":"Begin melding cards into sets of 3 or more during your turn.",
          "description":"After opening your turn, search your hand for cards you can lay face up in front of you for points. Melding in canasta basically means matching same-rank cards, possibly with some wildcards as well. The initial meld in your hand needs to be worth at least 50 points before you play it. Once you play that first meld, you can play whatever combinations you see fit during the round. The initial meld requirement increases as the game goes on. Once you accumulate 1,500 points, your meld has to be worth at least 90 points. At 3,000 points, it needs to be worth 120 points. If you happen to have a negative amount of points at the beginning of a round, your initial meld only has to be worth 15 points. Remember that each meld must have at least 2 natural cards to be played. You can add to existing melds you or your partner start, but you can’t add to an opponent’s meld."
        },
        {
          "headline":"Discard a card face up at the end of your turn.",
          "description":"No matter what you do during your turn, end it by getting rid of one of your cards. Place it face up so the next player can think about taking it during their turn. Keep the discard pile square so nobody can see the cards underneath the one you laid down. Try to get rid of less valuable cards and ones you don’t think you can use to score points. It takes a little bit of strategy, so do your best to keep track of the cards on the table. If someone used most of the 4s to make a meld, for instance, the one you’re holding isn’t very useful."
        },
        {
          "headline":"Go out by using up all the cards in your hand.",
          "description":"Meld your remaining cards or meld and discard to “go out.” When you go out, you don’t get to play until the next round begins with a fresh hand, so pick your chances with caution! Going out isn’t always the best move, especially when you’re playing with a partner. For instance, you could choose to extend the game so you can make more matches. Your partner might also have high-value cards that would go to waste. If you are able to go out in a single hand, you get a 200 point bonus instead of 100. It is very hard to do, so you won’t see it happen too often."
        }
      ]
    },
    {
      "name":"Scoring Points and Melding",
      "steps":[
        {
          "headline":"Memorize the point value of all the scoring cards in the game.",
          "description":"In order to understand the scoring system, you will need to know the value of the cards. The values don’t change throughout the game. Playing the cards in a “meld” during your turn nets you points, but holding onto the cards at the end of the round costs you points. Jokers are worth 50 points. Aces and deuces are worth 20 points. Any card from an 8 to a King is worth 10 points. Cards ranked from 4 to 7 are worth only 5 points. Black 3s are also worth 5 points if you are able to use them."
        },
        {
          "headline":"Use red 3s as a bonus card to score additional points.",
          "description":"Red 3s are different from the other cards and are kept separate on the table. Each red 3 is worth 100 points. As soon as you get one, lay it face up in front of you. Collect as many of the red 3s as you can for bigger bonuses. If you get all of the red 3s during a round, they are worth 200 points each. There are 4 of them in total, adding up to 800 points. It is rare, but it will put you way ahead of the competition. Failing to play a red 3 by the end of a round nets you a 500 point penalty, so be careful!"
        },
        {
          "headline":"Play black 3s to block the next player in turn from taking the discard pile.",
          "description":"That gives your partner a chance to pick up the discard pile on his turn. Black 3s also have some additional scoring quirks for you to be aware of. Black 3s can only be melded for points when they are the last cards in your hand. For that reason, they tend to be more useful for throwing off your opponents than scoring points."
        },
        {
          "headline":"Use jokers and 2s as wildcards to score or freeze.",
          "description":"Think of these cards as replacements for ones you’re missing in your hand. When you score points by matching at least 3 cards of the same rank, use a wildcard to replace another missing card. These cards also allow you to freeze the discard pile to prevent your opponent from taking it. If you do this, turn the card sideways on the discard pile to indicate it is frozen. For example, if you have 2 jacks, you could complete a meld by playing a 2 with it. Place the set of cards face up in front of you. You need to have 2 natural, matching cards to begin a meld. You can't start a meld with 2 wildcards, but you can use up to 3 of them to finish a meld. Normally, you freeze the discard pile with a wildcard when you are desperate. When the pile is frozen this way, nobody can take the discard pile until someone uses the top card to make a natural meld."
        },
        {
          "headline":"Make different melds to score points during the game.",
          "description":"There are a few different types of melds to keep in mind as you play. Each meld must have at least 2 natural cards in order to be valid. You can add wildcards to the meld in order to score more points and make game-changing moves like completing a 7-card canasta. A meld of 7 cards is a canasta. A natural canasta, or one with no wildcards, is worth 500 bonus points. A dirty or mixed canasta, which has at least 1 wildcard, is worth 300 bonus points. The goal of the game is to make as many canastas as you can before the game ends. In fact, most rules force you to make at least 1 before you are able to stop playing a round."
        }
      ]
    },
    {
      "name":"Completing the Game",
      "steps":[
        {
          "headline":"Continue play until the stock is exhausted or all players have gone out.",
          "description":"If no one has gone out by the time all the cards in the stock have been drawn, play continues as long as someone can take the top card of the discard pile and put it with a new or existing meld. However, no player down to a single card can take a discard pile of a single card. Play ends when any player with more than 1 card in hand cannot take the discard pile. If the last card from the draw pile is a bonus card, play it and end the round right away."
        },
        {
          "headline":"Score all the cards played once each round comes to an end.",
          "description":"You score points for each meld you made and lose points for anything left in your hand. Use the card values to calculate the point total and write it down. Remember to include any bonus points earned! When you’re done, shuffle and deal all the cards to start the next round. Use the point values of the individual cards to total up the melds and any leftover cards. Subtract the value of the cards in your hands from your total score. Mixed canastas made with wildcards are worth 300 points, but natural canastas are worth 500. Any player who goes out by melding all their cards gets 100 bonus points. They get 200 if they did it in a single turn. Red 3s are worth 100 points each unless you have all 4 of them. Then they are worth 200. However, if you have any left in your hand, you lose 100 points."
        },
        {
          "headline":"End the game when a team reaches 5,000 total points.",
          "description":"A game of canasta plays out over multiple rounds, so keep a running tally of the point totals. The first team to race to 5,000 points wins. If multiple people get there in the same round, then whoever has the most points wins."
        }
      ]
    },
    {
      "name":"Strategizing to Win",
      "steps":[
        {
          "headline":"Keep track of what cards go into the discard pile.",
          "description":"Knowing what cards are up for grabs is the key to determining when you should act. Track cards as they appear on the board. Also, pay attention to how your opponent plays to see what they are interested in picking up. You can use this information to react and accumulate as many points as you can find. For example, you know there are only 8 Jacks. If your opponent lays down a few of them, you know you won’t see much more of them in the draw pile. You might have already seen a few in the discard pile."
        },
        {
          "headline":"Save melds in your hand to throw off your opponent’s tracking.",
          "description":"This might seem a little counterintuitive, but it makes sense once you get used to tracking the cards that appear. Laying down your cards literally shows your hand. Your opponent could use this information to withhold valuable cards you need or change their own strategy. You may feel proud of the cool collection you have in your hand, but think twice before putting it down. As long as you have 2 cards of the same rank in your hand, you can pick cards of that rank off the discard pile."
        },
        {
          "headline":"Pick up the discard pile when it is full of high cards.",
          "description":"You aren’t going to get a lot out of a discard pile with a single 5 in it. Low cards are worth so little that they often aren’t worth taking. There also isn’t much of a point to taking small discard piles. Bigger discard piles, however, offer plenty of opportunities to make melds. Take the discard pile if you really need it. You might need that last card to complete a canasta and go out, for instance. Be careful to avoid losing lots of points by getting stuck with a big discard pile. Weigh your options carefully and check how many cards are left on the board first."
        },
        {
          "headline":"Discard cards to trick your opponent into following your lead.",
          "description":"So you suspect your opponent is holding onto something you need. Try throwing down one of your cards to see what your opponent does. This works best when the discard pile is frozen so nobody can pick it up unless they can make a meld. Your opponent might put down that card you need. Keep 2 cards of the same rank so you can pick up the pile when your opponent puts down what you need. Another option is to put down what your opponent needs to force them to pick up a giant pile of subpar cards. Go out after that to leave them high and dry with a lot of cards."
        },
        {
          "headline":"Get rid of your wildcards when you are able to make a good match.",
          "description":"The 2s and Jokers are great cards with a lot of value. While you don’t want them to be stuck in your hand, you also can’t afford to waste them. For that reason, use them whenever you have a chance to make a meld. Don’t risk putting them in the discard pile in an attempt to freeze out your opponent. If your opponent is about to go out, play your valuable wildcards as soon as possible. On the other hand, if your opponent has a lot of cards, put your wildcards down to hurt their score. Remember that you can add to existing melds you have. You are better off making a meld than throwing away a wildcard that your opponent might later get."
        },
        {
          "headline":"End the game as the draw or discard pile runs low.",
          "description":"The draw pile goes quickly, especially in games with 4 or more players. On the other hand, your opponent might take a big discard pile and have 25 cards in their hand. Great, now you have a chance to make off with all the points. Make your melds, go out as soon as possible, and win the round. Even if you don’t have a lot of points on the table, you could hurt your opponent’s chances of winning by forcing them to take a negative amount of points. Surprise moves are the best offense in canasta. Remember that you need at least 1 canasta in order to go out. If you’re struggling when the draw pile winds down, you could lose a lot of points from your hand."
        }
      ]
    }
  ],
  "text":" Setting up the Game Pair into partners if you’re playing with more than 2 people. A standard game of canasta is played with 4 people, although you can play with anywhere from 2 to 6 players by varying the rules slightly. Teams can be chosen randomly by pulling from a shuffled deck of cards. The players with the highest or the lowest cards pair together. When determining the card rank, consider spades to be highest, followed by hearts, diamonds, and clubs. These rankings don’t matter at all in the game and are only worth remembering when you’re setting up the game. For example, if the highest cards drawn are a king and queen, then those players form a partnership. Canasta can be played with an odd number of players. Break into teams of 2, but alternate which team member sits out each round. Shuffle 2 standard decks with the jokers included. A standard deck is 52 cards, not counting the jokers. That gives you 108 cards total, since canasta is one of those games where the jokers matter. This is the number of cards you need for most games, including a standard 4-player game. Note that some games of 6-player canasta include an extra deck for a total of 162 cards. Deal cards clockwise around the table according to the number of players. Select 1 player to be the dealer. Have that person shuffle the cards and begin dealing them 1 at a time starting with the person to their left. For a standard 4-player game of canasta, deal the cards face down until everyone has 11. For a 2-handed, or 2-player, game, deal 15 cards per player. For 3-handed canasta, start with 13 cards. Take 2 cards each time you pick from the draw pile. Stack the remaining cards to form the draw pile. The leftover cards form the draw pile for players to pick from during their turn. At the beginning of your turn, you get to pick a card. Take the top card off the pile and add it to your hand. When the draw pile runs out of cards, the round ends after the next player cannot make a play. Keep an eye on the draw pile since it is an important source of new cards. Once it is gone, the round will end not long after it. Play as many cards as you can before this happens. Turn the top card over to set up a discard pile. Place the discard pile next to the draw pile, but first check which card is face up. The face up card needs to be a “natural,” which means it can’t be a bonus card. If it is a bonus card, keep turning over cards until you get a natural. The bonus cards are the jokers, 2s, and red 3s. Be on the lookout for cards you need in the draw pile. To take the pile, you need to be able to match it with cards in your hand to score points. Playing the First Round Pick from the draw pile at the start of your turn if you need another card. Play starts with the player on the dealer’s left and goes clockwise around the table. If you don’t like what you see on the discard pile, start your turn by taking the top card off the draw pile. Add the card to your hand and look for possible scoring opportunities. If you draw a red 3, play it and pick another card. Then, continue your turn as you normally would. You have to pick up a card at the start of your turn unless you’re taking from the discard pile. At the start of your turn, you have the choice to choose from either pile. It's one or the other. Take the discard pile if you are able to make a match with the top card. If the top card on the discard pile catches your eye, take it instead of picking from the draw pile. It can only be taken if you are able to use it right away to score points. Keep in mind, however, that you have to take the entire discard pile along with it! The discard pile is one of the most exciting parts of canasta. By taking the discard pile, you might end up with a lot extra cards to deal with, but you also get many more potential scoring opportunities. Begin melding cards into sets of 3 or more during your turn. After opening your turn, search your hand for cards you can lay face up in front of you for points. Melding in canasta basically means matching same-rank cards, possibly with some wildcards as well. The initial meld in your hand needs to be worth at least 50 points before you play it. Once you play that first meld, you can play whatever combinations you see fit during the round. The initial meld requirement increases as the game goes on. Once you accumulate 1,500 points, your meld has to be worth at least 90 points. At 3,000 points, it needs to be worth 120 points. If you happen to have a negative amount of points at the beginning of a round, your initial meld only has to be worth 15 points. Remember that each meld must have at least 2 natural cards to be played. You can add to existing melds you or your partner start, but you can’t add to an opponent’s meld. Discard a card face up at the end of your turn. No matter what you do during your turn, end it by getting rid of one of your cards. Place it face up so the next player can think about taking it during their turn. Keep the discard pile square so nobody can see the cards underneath the one you laid down. Try to get rid of less valuable cards and ones you don’t think you can use to score points. It takes a little bit of strategy, so do your best to keep track of the cards on the table. If someone used most of the 4s to make a meld, for instance, the one you’re holding isn’t very useful. Go out by using up all the cards in your hand. Meld your remaining cards or meld and discard to “go out.” When you go out, you don’t get to play until the next round begins with a fresh hand, so pick your chances with caution! Going out isn’t always the best move, especially when you’re playing with a partner. For instance, you could choose to extend the game so you can make more matches. Your partner might also have high-value cards that would go to waste. If you are able to go out in a single hand, you get a 200 point bonus instead of 100. It is very hard to do, so you won’t see it happen too often. Scoring Points and Melding Memorize the point value of all the scoring cards in the game. In order to understand the scoring system, you will need to know the value of the cards. The values don’t change throughout the game. Playing the cards in a “meld” during your turn nets you points, but holding onto the cards at the end of the round costs you points. Jokers are worth 50 points. Aces and deuces are worth 20 points. Any card from an 8 to a King is worth 10 points. Cards ranked from 4 to 7 are worth only 5 points. Black 3s are also worth 5 points if you are able to use them. Use red 3s as a bonus card to score additional points. Red 3s are different from the other cards and are kept separate on the table. Each red 3 is worth 100 points. As soon as you get one, lay it face up in front of you. Collect as many of the red 3s as you can for bigger bonuses. If you get all of the red 3s during a round, they are worth 200 points each. There are 4 of them in total, adding up to 800 points. It is rare, but it will put you way ahead of the competition. Failing to play a red 3 by the end of a round nets you a 500 point penalty, so be careful! Play black 3s to block the next player in turn from taking the discard pile. That gives your partner a chance to pick up the discard pile on his turn. Black 3s also have some additional scoring quirks for you to be aware of. Black 3s can only be melded for points when they are the last cards in your hand. For that reason, they tend to be more useful for throwing off your opponents than scoring points. Use jokers and 2s as wildcards to score or freeze. Think of these cards as replacements for ones you’re missing in your hand. When you score points by matching at least 3 cards of the same rank, use a wildcard to replace another missing card. These cards also allow you to freeze the discard pile to prevent your opponent from taking it. If you do this, turn the card sideways on the discard pile to indicate it is frozen. For example, if you have 2 jacks, you could complete a meld by playing a 2 with it. Place the set of cards face up in front of you. You need to have 2 natural, matching cards to begin a meld. You can't start a meld with 2 wildcards, but you can use up to 3 of them to finish a meld. Normally, you freeze the discard pile with a wildcard when you are desperate. When the pile is frozen this way, nobody can take the discard pile until someone uses the top card to make a natural meld. Make different melds to score points during the game. There are a few different types of melds to keep in mind as you play. Each meld must have at least 2 natural cards in order to be valid. You can add wildcards to the meld in order to score more points and make game-changing moves like completing a 7-card canasta. A meld of 7 cards is a canasta. A natural canasta, or one with no wildcards, is worth 500 bonus points. A dirty or mixed canasta, which has at least 1 wildcard, is worth 300 bonus points. The goal of the game is to make as many canastas as you can before the game ends. In fact, most rules force you to make at least 1 before you are able to stop playing a round. Completing the Game Continue play until the stock is exhausted or all players have gone out. If no one has gone out by the time all the cards in the stock have been drawn, play continues as long as someone can take the top card of the discard pile and put it with a new or existing meld. However, no player down to a single card can take a discard pile of a single card. Play ends when any player with more than 1 card in hand cannot take the discard pile. If the last card from the draw pile is a bonus card, play it and end the round right away. Score all the cards played once each round comes to an end. You score points for each meld you made and lose points for anything left in your hand. Use the card values to calculate the point total and write it down. Remember to include any bonus points earned! When you’re done, shuffle and deal all the cards to start the next round. Use the point values of the individual cards to total up the melds and any leftover cards. Subtract the value of the cards in your hands from your total score. Mixed canastas made with wildcards are worth 300 points, but natural canastas are worth 500. Any player who goes out by melding all their cards gets 100 bonus points. They get 200 if they did it in a single turn. Red 3s are worth 100 points each unless you have all 4 of them. Then they are worth 200. However, if you have any left in your hand, you lose 100 points. End the game when a team reaches 5,000 total points. A game of canasta plays out over multiple rounds, so keep a running tally of the point totals. The first team to race to 5,000 points wins. If multiple people get there in the same round, then whoever has the most points wins. Strategizing to Win Keep track of what cards go into the discard pile. Knowing what cards are up for grabs is the key to determining when you should act. Track cards as they appear on the board. Also, pay attention to how your opponent plays to see what they are interested in picking up. You can use this information to react and accumulate as many points as you can find. For example, you know there are only 8 Jacks. If your opponent lays down a few of them, you know you won’t see much more of them in the draw pile. You might have already seen a few in the discard pile. Save melds in your hand to throw off your opponent’s tracking. This might seem a little counterintuitive, but it makes sense once you get used to tracking the cards that appear. Laying down your cards literally shows your hand. Your opponent could use this information to withhold valuable cards you need or change their own strategy. You may feel proud of the cool collection you have in your hand, but think twice before putting it down. As long as you have 2 cards of the same rank in your hand, you can pick cards of that rank off the discard pile. Pick up the discard pile when it is full of high cards. You aren’t going to get a lot out of a discard pile with a single 5 in it. Low cards are worth so little that they often aren’t worth taking. There also isn’t much of a point to taking small discard piles. Bigger discard piles, however, offer plenty of opportunities to make melds. Take the discard pile if you really need it. You might need that last card to complete a canasta and go out, for instance. Be careful to avoid losing lots of points by getting stuck with a big discard pile. Weigh your options carefully and check how many cards are left on the board first. Discard cards to trick your opponent into following your lead. So you suspect your opponent is holding onto something you need. Try throwing down one of your cards to see what your opponent does. This works best when the discard pile is frozen so nobody can pick it up unless they can make a meld. Your opponent might put down that card you need. Keep 2 cards of the same rank so you can pick up the pile when your opponent puts down what you need. Another option is to put down what your opponent needs to force them to pick up a giant pile of subpar cards. Go out after that to leave them high and dry with a lot of cards. Get rid of your wildcards when you are able to make a good match. The 2s and Jokers are great cards with a lot of value. While you don’t want them to be stuck in your hand, you also can’t afford to waste them. For that reason, use them whenever you have a chance to make a meld. Don’t risk putting them in the discard pile in an attempt to freeze out your opponent. If your opponent is about to go out, play your valuable wildcards as soon as possible. On the other hand, if your opponent has a lot of cards, put your wildcards down to hurt their score. Remember that you can add to existing melds you have. You are better off making a meld than throwing away a wildcard that your opponent might later get. End the game as the draw or discard pile runs low. The draw pile goes quickly, especially in games with 4 or more players. On the other hand, your opponent might take a big discard pile and have 25 cards in their hand. Great, now you have a chance to make off with all the points. Make your melds, go out as soon as possible, and win the round. Even if you don’t have a lot of points on the table, you could hurt your opponent’s chances of winning by forcing them to take a negative amount of points. Surprise moves are the best offense in canasta. Remember that you need at least 1 canasta in order to go out. If you’re struggling when the draw pile winds down, you could lose a lot of points from your hand.",
  "sentences":[
    " Setting up the Game Pair into partners if you’re playing with more than 2 people.",
    "A standard game of canasta is played with 4 people, although you can play with anywhere from 2 to 6 players by varying the rules slightly.",
    "Teams can be chosen randomly by pulling from a shuffled deck of cards.",
    "The players with the highest or the lowest cards pair together.",
    "When determining the card rank, consider spades to be highest, followed by hearts, diamonds, and clubs.",
    "These rankings don’t matter at all in the game and are only worth remembering when you’re setting up the game.",
    "For example, if the highest cards drawn are a king and queen, then those players form a partnership.",
    "Canasta can be played with an odd number of players.",
    "Break into teams of 2, but alternate which team member sits out each round.",
    "Shuffle 2 standard decks with the jokers included.",
    "A standard deck is 52 cards, not counting the jokers.",
    "That gives you 108 cards total, since canasta is one of those games where the jokers matter.",
    "This is the number of cards you need for most games, including a standard 4-player game.",
    "Note that some games of 6-player canasta include an extra deck for a total of 162 cards.",
    "Deal cards clockwise around the table according to the number of players.",
    "Select 1 player to be the dealer.",
    "Have that person shuffle the cards and begin dealing them 1 at a time starting with the person to their left.",
    "For a standard 4-player game of canasta, deal the cards face down until everyone has 11.",
    "For a 2-handed, or 2-player, game, deal 15 cards per player.",
    "For 3-handed canasta, start with 13 cards.",
    "Take 2 cards each time you pick from the draw pile.",
    "Stack the remaining cards to form the draw pile.",
    "The leftover cards form the draw pile for players to pick from during their turn.",
    "At the beginning of your turn, you get to pick a card.",
    "Take the top card off the pile and add it to your hand.",
    "When the draw pile runs out of cards, the round ends after the next player cannot make a play.",
    "Keep an eye on the draw pile since it is an important source of new cards.",
    "Once it is gone, the round will end not long after it.",
    "Play as many cards as you can before this happens.",
    "Turn the top card over to set up a discard pile.",
    "Place the discard pile next to the draw pile, but first check which card is face up.",
    "The face up card needs to be a “natural,” which means it can’t be a bonus card.",
    "If it is a bonus card, keep turning over cards until you get a natural.",
    "The bonus cards are the jokers, 2s, and red 3s.",
    "Be on the lookout for cards you need in the draw pile.",
    "To take the pile, you need to be able to match it with cards in your hand to score points.",
    "Playing the First Round Pick from the draw pile at the start of your turn if you need another card.",
    "Play starts with the player on the dealer’s left and goes clockwise around the table.",
    "If you don’t like what you see on the discard pile, start your turn by taking the top card off the draw pile.",
    "Add the card to your hand and look for possible scoring opportunities.",
    "If you draw a red 3, play it and pick another card.",
    "Then, continue your turn as you normally would.",
    "You have to pick up a card at the start of your turn unless you’re taking from the discard pile.",
    "At the start of your turn, you have the choice to choose from either pile.",
    "It's one or the other.",
    "Take the discard pile if you are able to make a match with the top card.",
    "If the top card on the discard pile catches your eye, take it instead of picking from the draw pile.",
    "It can only be taken if you are able to use it right away to score points.",
    "Keep in mind, however, that you have to take the entire discard pile along with it!",
    "The discard pile is one of the most exciting parts of canasta.",
    "By taking the discard pile, you might end up with a lot extra cards to deal with, but you also get many more potential scoring opportunities.",
    "Begin melding cards into sets of 3 or more during your turn.",
    "After opening your turn, search your hand for cards you can lay face up in front of you for points.",
    "Melding in canasta basically means matching same-rank cards, possibly with some wildcards as well.",
    "The initial meld in your hand needs to be worth at least 50 points before you play it.",
    "Once you play that first meld, you can play whatever combinations you see fit during the round.",
    "The initial meld requirement increases as the game goes on.",
    "Once you accumulate 1,500 points, your meld has to be worth at least 90 points.",
    "At 3,000 points, it needs to be worth 120 points.",
    "If you happen to have a negative amount of points at the beginning of a round, your initial meld only has to be worth 15 points.",
    "Remember that each meld must have at least 2 natural cards to be played.",
    "You can add to existing melds you or your partner start, but you can’t add to an opponent’s meld.",
    "Discard a card face up at the end of your turn.",
    "No matter what you do during your turn, end it by getting rid of one of your cards.",
    "Place it face up so the next player can think about taking it during their turn.",
    "Keep the discard pile square so nobody can see the cards underneath the one you laid down.",
    "Try to get rid of less valuable cards and ones you don’t think you can use to score points.",
    "It takes a little bit of strategy, so do your best to keep track of the cards on the table.",
    "If someone used most of the 4s to make a meld, for instance, the one you’re holding isn’t very useful.",
    "Go out by using up all the cards in your hand.",
    "Meld your remaining cards or meld and discard to “go out.” When you go out, you don’t get to play until the next round begins with a fresh hand, so pick your chances with caution!",
    "Going out isn’t always the best move, especially when you’re playing with a partner.",
    "For instance, you could choose to extend the game so you can make more matches.",
    "Your partner might also have high-value cards that would go to waste.",
    "If you are able to go out in a single hand, you get a 200 point bonus instead of 100.",
    "It is very hard to do, so you won’t see it happen too often.",
    "Scoring Points and Melding Memorize the point value of all the scoring cards in the game.",
    "In order to understand the scoring system, you will need to know the value of the cards.",
    "The values don’t change throughout the game.",
    "Playing the cards in a “meld” during your turn nets you points, but holding onto the cards at the end of the round costs you points.",
    "Jokers are worth 50 points.",
    "Aces and deuces are worth 20 points.",
    "Any card from an 8 to a King is worth 10 points.",
    "Cards ranked from 4 to 7 are worth only 5 points.",
    "Black 3s are also worth 5 points if you are able to use them.",
    "Use red 3s as a bonus card to score additional points.",
    "Red 3s are different from the other cards and are kept separate on the table.",
    "Each red 3 is worth 100 points.",
    "As soon as you get one, lay it face up in front of you.",
    "Collect as many of the red 3s as you can for bigger bonuses.",
    "If you get all of the red 3s during a round, they are worth 200 points each.",
    "There are 4 of them in total, adding up to 800 points.",
    "It is rare, but it will put you way ahead of the competition.",
    "Failing to play a red 3 by the end of a round nets you a 500 point penalty, so be careful!",
    "Play black 3s to block the next player in turn from taking the discard pile.",
    "That gives your partner a chance to pick up the discard pile on his turn.",
    "Black 3s also have some additional scoring quirks for you to be aware of.",
    "Black 3s can only be melded for points when they are the last cards in your hand.",
    "For that reason, they tend to be more useful for throwing off your opponents than scoring points.",
    "Use jokers and 2s as wildcards to score or freeze.",
    "Think of these cards as replacements for ones you’re missing in your hand.",
    "When you score points by matching at least 3 cards of the same rank, use a wildcard to replace another missing card.",
    "These cards also allow you to freeze the discard pile to prevent your opponent from taking it.",
    "If you do this, turn the card sideways on the discard pile to indicate it is frozen.",
    "For example, if you have 2 jacks, you could complete a meld by playing a 2 with it.",
    "Place the set of cards face up in front of you.",
    "You need to have 2 natural, matching cards to begin a meld.",
    "You can't start a meld with 2 wildcards, but you can use up to 3 of them to finish a meld.",
    "Normally, you freeze the discard pile with a wildcard when you are desperate.",
    "When the pile is frozen this way, nobody can take the discard pile until someone uses the top card to make a natural meld.",
    "Make different melds to score points during the game.",
    "There are a few different types of melds to keep in mind as you play.",
    "Each meld must have at least 2 natural cards in order to be valid.",
    "You can add wildcards to the meld in order to score more points and make game-changing moves like completing a 7-card canasta.",
    "A meld of 7 cards is a canasta.",
    "A natural canasta, or one with no wildcards, is worth 500 bonus points.",
    "A dirty or mixed canasta, which has at least 1 wildcard, is worth 300 bonus points.",
    "The goal of the game is to make as many canastas as you can before the game ends.",
    "In fact, most rules force you to make at least 1 before you are able to stop playing a round.",
    "Completing the Game Continue play until the stock is exhausted or all players have gone out.",
    "If no one has gone out by the time all the cards in the stock have been drawn, play continues as long as someone can take the top card of the discard pile and put it with a new or existing meld.",
    "However, no player down to a single card can take a discard pile of a single card.",
    "Play ends when any player with more than 1 card in hand cannot take the discard pile.",
    "If the last card from the draw pile is a bonus card, play it and end the round right away.",
    "Score all the cards played once each round comes to an end.",
    "You score points for each meld you made and lose points for anything left in your hand.",
    "Use the card values to calculate the point total and write it down.",
    "Remember to include any bonus points earned!",
    "When you’re done, shuffle and deal all the cards to start the next round.",
    "Use the point values of the individual cards to total up the melds and any leftover cards.",
    "Subtract the value of the cards in your hands from your total score.",
    "Mixed canastas made with wildcards are worth 300 points, but natural canastas are worth 500.",
    "Any player who goes out by melding all their cards gets 100 bonus points.",
    "They get 200 if they did it in a single turn.",
    "Red 3s are worth 100 points each unless you have all 4 of them.",
    "Then they are worth 200.",
    "However, if you have any left in your hand, you lose 100 points.",
    "End the game when a team reaches 5,000 total points.",
    "A game of canasta plays out over multiple rounds, so keep a running tally of the point totals.",
    "The first team to race to 5,000 points wins.",
    "If multiple people get there in the same round, then whoever has the most points wins.",
    "Strategizing to Win Keep track of what cards go into the discard pile.",
    "Knowing what cards are up for grabs is the key to determining when you should act.",
    "Track cards as they appear on the board.",
    "Also, pay attention to how your opponent plays to see what they are interested in picking up.",
    "You can use this information to react and accumulate as many points as you can find.",
    "For example, you know there are only 8 Jacks.",
    "If your opponent lays down a few of them, you know you won’t see much more of them in the draw pile.",
    "You might have already seen a few in the discard pile.",
    "Save melds in your hand to throw off your opponent’s tracking.",
    "This might seem a little counterintuitive, but it makes sense once you get used to tracking the cards that appear.",
    "Laying down your cards literally shows your hand.",
    "Your opponent could use this information to withhold valuable cards you need or change their own strategy.",
    "You may feel proud of the cool collection you have in your hand, but think twice before putting it down.",
    "As long as you have 2 cards of the same rank in your hand, you can pick cards of that rank off the discard pile.",
    "Pick up the discard pile when it is full of high cards.",
    "You aren’t going to get a lot out of a discard pile with a single 5 in it.",
    "Low cards are worth so little that they often aren’t worth taking.",
    "There also isn’t much of a point to taking small discard piles.",
    "Bigger discard piles, however, offer plenty of opportunities to make melds.",
    "Take the discard pile if you really need it.",
    "You might need that last card to complete a canasta and go out, for instance.",
    "Be careful to avoid losing lots of points by getting stuck with a big discard pile.",
    "Weigh your options carefully and check how many cards are left on the board first.",
    "Discard cards to trick your opponent into following your lead.",
    "So you suspect your opponent is holding onto something you need.",
    "Try throwing down one of your cards to see what your opponent does.",
    "This works best when the discard pile is frozen so nobody can pick it up unless they can make a meld.",
    "Your opponent might put down that card you need.",
    "Keep 2 cards of the same rank so you can pick up the pile when your opponent puts down what you need.",
    "Another option is to put down what your opponent needs to force them to pick up a giant pile of subpar cards.",
    "Go out after that to leave them high and dry with a lot of cards.",
    "Get rid of your wildcards when you are able to make a good match.",
    "The 2s and Jokers are great cards with a lot of value.",
    "While you don’t want them to be stuck in your hand, you also can’t afford to waste them.",
    "For that reason, use them whenever you have a chance to make a meld.",
    "Don’t risk putting them in the discard pile in an attempt to freeze out your opponent.",
    "If your opponent is about to go out, play your valuable wildcards as soon as possible.",
    "On the other hand, if your opponent has a lot of cards, put your wildcards down to hurt their score.",
    "Remember that you can add to existing melds you have.",
    "You are better off making a meld than throwing away a wildcard that your opponent might later get.",
    "End the game as the draw or discard pile runs low.",
    "The draw pile goes quickly, especially in games with 4 or more players.",
    "On the other hand, your opponent might take a big discard pile and have 25 cards in their hand.",
    "Great, now you have a chance to make off with all the points.",
    "Make your melds, go out as soon as possible, and win the round.",
    "Even if you don’t have a lot of points on the table, you could hurt your opponent’s chances of winning by forcing them to take a negative amount of points.",
    "Surprise moves are the best offense in canasta.",
    "Remember that you need at least 1 canasta in order to go out.",
    "If you’re struggling when the draw pile winds down, you could lose a lot of points from your hand."
  ],
  "tyn_section":[
    "2 to 6 players",
    "2 decks of cards with jokers",
    "Extra decks of cards for alternative rules",
    "Paper score pads",
    "Pencils",
    "Calculator"
  ],
  "tyn_model":[
    "cards",
    "canasta",
    "jokers",
    "wildcards",
    "card",
    "wildcard",
    "canastas",
    "spades",
    "hearts",
    "diamonds",
    "clubs",
    "“natural",
    "” which",
    "discard",
    "“go",
    "” when",
    "“meld",
    "” during"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}