{
  "title":"How to Store Fresh Turmeric",
  "url":"https://www.wikihow.com/Store-Fresh-Turmeric",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Storing Fresh Tumeric Root in Your Refrigerator",
      "steps":[
        {
          "headline":"Wash the fresh turmeric root, using a brush to remove dirt.",
          "description":"Whether you bought the turmeric root from the market or grew it at home, cleaning it is very important. If you just harvested it, it likely still has dirt on it. If you bought it, who knows how far and wide your fresh turmeric root has traveled since it was pulled out of the ground. Wash it thoroughly with warm water to get rid of germs and chemicals. Use your fingers or a veggie brush to give the root a quick scrub, removing any dirt that is stuck to it. If you're using a brush, angle it to get into all the corners of the gnarled root."
        },
        {
          "headline":"Pat the turmeric root dry with a paper towel.",
          "description":"One of the biggest problems with refrigerating turmeric root is mold growth. Drying your turmeric root thoroughly will help avoid this problem, so blot the root with a paper towel to get rid of excess moisture."
        },
        {
          "headline":"Wrap the turmeric in a second paper towel and place it in a sealed bag.",
          "description":"After you've dried the turmeric root, wrap the whole thing in a dry paper towel. The paper towel will absorb extra moisture, ensuring your turmeric root doesn’t develop mold. The paper towel should be loosely wrapped around the root. Place the root and the paper towel into a resealable plastic bag, squeeze all the extra air out of the bag, and seal it. Alternately, you can store fresh turmeric root in a rolled up paper bag. The paper bag will work similarly to the paper towel, by absorbing excess moisture."
        },
        {
          "headline":"Place the bagged turmeric root into your refrigerator.",
          "description":"Find a visible place in your fridge where you won’t forget about your bagged turmeric root. When stored this way, the turmeric root should keep for up to 2 weeks. If you notice any mold developing, cut off the moldy spot and replace the paper towel."
        }
      ]
    },
    {
      "name":"Freezing Fresh Tumeric Root",
      "steps":[
        {
          "headline":"Wash the turmeric root and use a brush to remove dirt.",
          "description":"Your fresh turmeric root has traveled quite a bit since it was pulled out of the ground. Wash it thoroughly with warm water to get rid of any germs or chemicals it may have accumulated. Use a veggie brush to give the root a quick scrub, removing any dirt that is stuck to it. Angle the brush to get into all the nooks and crannies of the gnarled root."
        },
        {
          "headline":"Dry the turmeric root completely.",
          "description":"Since you will be freezing this turmeric, be sure it is completely dry before you put it in the freezer. Squeeze the turmeric with a paper towel or clean cloth. Thoroughly drying the root will help avoid freezer burn. Freezer burn can make food taste unappealing, so it is worth the time it takes to dry the turmeric to avoid having to throw it away after a month in your freezer."
        },
        {
          "headline":"Cut the turmeric into smaller pieces.",
          "description":"If you cut it into pieces, the turmeric root will be more manageable to work with when it's frozen. Visualize how much turmeric you would use in 1 recipe (or for 1 cup of tea, etc. ), and cut the root into pieces that will allow you to grab 1 or 2 when you need to use them. If you aren’t sure what size, start with pieces around 2 inches (5.1 cm) long. Turmeric will stain your hands a yellow/orange color. You can avoid this by wearing gloves. Avoid touching your clothes until you’ve washed your hands or removed the gloves. Hot water and a bit of dish soap should do the trick."
        },
        {
          "headline":"Place the turmeric pieces into a freezer-safe bag.",
          "description":"Use whichever size resealable plastic bag you prefer, and fill it up with your freshly-cut turmeric root. Roll the bag as you seal it to squeeze out all the excess air."
        },
        {
          "headline":"Place the bag filled with fresh turmeric into your freezer.",
          "description":"Find a spot in your freezer where the turmeric root won’t get lost. The turmeric will last up to six months in the freezer. Do your future self a favor by writing the date on the bag with a sharpie pen. That way, you’ll know when it is time to throw it away. Turmeric root will be slightly softer when defrosted, but will still taste good. You can use a microplaner to grate the frozen turmeric root if you don’t want to wait for the knob to thaw."
        }
      ]
    },
    {
      "name":"Dehydrating Fresh Tumeric Root",
      "steps":[
        {
          "headline":"Wash the fresh turmeric root.",
          "description":"Wash your turmeric root thoroughly with warm water to get rid of germs and chemicals. If you’d like, you can use a vegetable brush to give it an extra scrub. You will be peeling the skin off before dehydrating, so don’t worry if there is still dirt stuck to the turmeric."
        },
        {
          "headline":"Use a vegetable peeler to peel off the skin of the turmeric root.",
          "description":"The health benefits of turmeric root are found inside the root. Peeling off the skin will make your final product more potent. Use a vegetable peeler to remove the skin. Since turmeric root is often gnarled like ginger, you will have to work at different angles to get all of the skin off. A little bit of skin is okay, so don’t stress if you can’t remove the skin from especially challenging corners of the root."
        },
        {
          "headline":"Cut the turmeric root into thin, equally sized slices.",
          "description":"Cutting the turmeric root into thin slices will help it dry faster and more evenly. Try your best to keep them the same size so that they dry at the same time. Turmeric will stain your hands a yellow/orange color. You can avoid this by wearing gloves. Avoid touching your clothes until you’ve washed it off of your hands or removed your gloves."
        },
        {
          "headline":"Place the cut turmeric root onto your dehydrator’s drying tray.",
          "description":"Load up your dehydrators drying tray with the pieces of turmeric, making sure that they aren’t touching. Leave enough space around each piece so that the pieces dry thoroughly."
        },
        {
          "headline":"Dry the turmeric pieces at 105 °F (41 °C) for 4 hours.",
          "description":"Set your dehydrator and enjoy your life for 4 hours. Check on the turmeric pieces once 4 hours have passed. Find the largest and thickest pieces and see if they are dry. If they are, great! That means you are done with the drying process. If not, remove any smaller pieces that have dried, and set the rest to dry for another hour or two."
        },
        {
          "headline":"Use a spice grinder to grind the pieces of dried root in batches.",
          "description":"Once you have a pile of small dried turmeric pieces, it is time to start grinding them into powder form. Work in small batches as you grind the root pieces in your spice grinder. Place each round of ground powder into the airtight container you’ll use to store the spice. You can use a coffee grinder to grind spices, just never use it for coffee! Coffee beans are so robust that every spice you grind will taste like coffee."
        },
        {
          "headline":"Store your dried turmeric root powder in an airtight container.",
          "description":"Stored turmeric will keep for up to a year, if not longer. Storing your powder in an airtight container to use in the future is the best way to keep it fresh. Try using a mason jar, plastic Tupperware, or an empty baby food jar that has been thoroughly washed and dried. You can also use a resealable plastic bag, though an airtight container is the best option."
        }
      ]
    }
  ],
  "text":" Storing Fresh Tumeric Root in Your Refrigerator Wash the fresh turmeric root, using a brush to remove dirt. Whether you bought the turmeric root from the market or grew it at home, cleaning it is very important. If you just harvested it, it likely still has dirt on it. If you bought it, who knows how far and wide your fresh turmeric root has traveled since it was pulled out of the ground. Wash it thoroughly with warm water to get rid of germs and chemicals. Use your fingers or a veggie brush to give the root a quick scrub, removing any dirt that is stuck to it. If you're using a brush, angle it to get into all the corners of the gnarled root. Pat the turmeric root dry with a paper towel. One of the biggest problems with refrigerating turmeric root is mold growth. Drying your turmeric root thoroughly will help avoid this problem, so blot the root with a paper towel to get rid of excess moisture. Wrap the turmeric in a second paper towel and place it in a sealed bag. After you've dried the turmeric root, wrap the whole thing in a dry paper towel. The paper towel will absorb extra moisture, ensuring your turmeric root doesn’t develop mold. The paper towel should be loosely wrapped around the root. Place the root and the paper towel into a resealable plastic bag, squeeze all the extra air out of the bag, and seal it. Alternately, you can store fresh turmeric root in a rolled up paper bag. The paper bag will work similarly to the paper towel, by absorbing excess moisture. Place the bagged turmeric root into your refrigerator. Find a visible place in your fridge where you won’t forget about your bagged turmeric root. When stored this way, the turmeric root should keep for up to 2 weeks. If you notice any mold developing, cut off the moldy spot and replace the paper towel. Freezing Fresh Tumeric Root Wash the turmeric root and use a brush to remove dirt. Your fresh turmeric root has traveled quite a bit since it was pulled out of the ground. Wash it thoroughly with warm water to get rid of any germs or chemicals it may have accumulated. Use a veggie brush to give the root a quick scrub, removing any dirt that is stuck to it. Angle the brush to get into all the nooks and crannies of the gnarled root. Dry the turmeric root completely. Since you will be freezing this turmeric, be sure it is completely dry before you put it in the freezer. Squeeze the turmeric with a paper towel or clean cloth. Thoroughly drying the root will help avoid freezer burn. Freezer burn can make food taste unappealing, so it is worth the time it takes to dry the turmeric to avoid having to throw it away after a month in your freezer. Cut the turmeric into smaller pieces. If you cut it into pieces, the turmeric root will be more manageable to work with when it's frozen. Visualize how much turmeric you would use in 1 recipe (or for 1 cup of tea, etc. ), and cut the root into pieces that will allow you to grab 1 or 2 when you need to use them. If you aren’t sure what size, start with pieces around 2 inches (5.1 cm) long. Turmeric will stain your hands a yellow/orange color. You can avoid this by wearing gloves. Avoid touching your clothes until you’ve washed your hands or removed the gloves. Hot water and a bit of dish soap should do the trick. Place the turmeric pieces into a freezer-safe bag. Use whichever size resealable plastic bag you prefer, and fill it up with your freshly-cut turmeric root. Roll the bag as you seal it to squeeze out all the excess air. Place the bag filled with fresh turmeric into your freezer. Find a spot in your freezer where the turmeric root won’t get lost. The turmeric will last up to six months in the freezer. Do your future self a favor by writing the date on the bag with a sharpie pen. That way, you’ll know when it is time to throw it away. Turmeric root will be slightly softer when defrosted, but will still taste good. You can use a microplaner to grate the frozen turmeric root if you don’t want to wait for the knob to thaw. Dehydrating Fresh Tumeric Root Wash the fresh turmeric root. Wash your turmeric root thoroughly with warm water to get rid of germs and chemicals. If you’d like, you can use a vegetable brush to give it an extra scrub. You will be peeling the skin off before dehydrating, so don’t worry if there is still dirt stuck to the turmeric. Use a vegetable peeler to peel off the skin of the turmeric root. The health benefits of turmeric root are found inside the root. Peeling off the skin will make your final product more potent. Use a vegetable peeler to remove the skin. Since turmeric root is often gnarled like ginger, you will have to work at different angles to get all of the skin off. A little bit of skin is okay, so don’t stress if you can’t remove the skin from especially challenging corners of the root. Cut the turmeric root into thin, equally sized slices. Cutting the turmeric root into thin slices will help it dry faster and more evenly. Try your best to keep them the same size so that they dry at the same time. Turmeric will stain your hands a yellow/orange color. You can avoid this by wearing gloves. Avoid touching your clothes until you’ve washed it off of your hands or removed your gloves. Place the cut turmeric root onto your dehydrator’s drying tray. Load up your dehydrators drying tray with the pieces of turmeric, making sure that they aren’t touching. Leave enough space around each piece so that the pieces dry thoroughly. Dry the turmeric pieces at 105 °F (41 °C) for 4 hours. Set your dehydrator and enjoy your life for 4 hours. Check on the turmeric pieces once 4 hours have passed. Find the largest and thickest pieces and see if they are dry. If they are, great! That means you are done with the drying process. If not, remove any smaller pieces that have dried, and set the rest to dry for another hour or two. Use a spice grinder to grind the pieces of dried root in batches. Once you have a pile of small dried turmeric pieces, it is time to start grinding them into powder form. Work in small batches as you grind the root pieces in your spice grinder. Place each round of ground powder into the airtight container you’ll use to store the spice. You can use a coffee grinder to grind spices, just never use it for coffee! Coffee beans are so robust that every spice you grind will taste like coffee. Store your dried turmeric root powder in an airtight container. Stored turmeric will keep for up to a year, if not longer. Storing your powder in an airtight container to use in the future is the best way to keep it fresh. Try using a mason jar, plastic Tupperware, or an empty baby food jar that has been thoroughly washed and dried. You can also use a resealable plastic bag, though an airtight container is the best option.",
  "sentences":[
    " Storing Fresh Tumeric Root in Your Refrigerator Wash the fresh turmeric root, using a brush to remove dirt.",
    "Whether you bought the turmeric root from the market or grew it at home, cleaning it is very important.",
    "If you just harvested it, it likely still has dirt on it.",
    "If you bought it, who knows how far and wide your fresh turmeric root has traveled since it was pulled out of the ground.",
    "Wash it thoroughly with warm water to get rid of germs and chemicals.",
    "Use your fingers or a veggie brush to give the root a quick scrub, removing any dirt that is stuck to it.",
    "If you're using a brush, angle it to get into all the corners of the gnarled root.",
    "Pat the turmeric root dry with a paper towel.",
    "One of the biggest problems with refrigerating turmeric root is mold growth.",
    "Drying your turmeric root thoroughly will help avoid this problem, so blot the root with a paper towel to get rid of excess moisture.",
    "Wrap the turmeric in a second paper towel and place it in a sealed bag.",
    "After you've dried the turmeric root, wrap the whole thing in a dry paper towel.",
    "The paper towel will absorb extra moisture, ensuring your turmeric root doesn’t develop mold.",
    "The paper towel should be loosely wrapped around the root.",
    "Place the root and the paper towel into a resealable plastic bag, squeeze all the extra air out of the bag, and seal it.",
    "Alternately, you can store fresh turmeric root in a rolled up paper bag.",
    "The paper bag will work similarly to the paper towel, by absorbing excess moisture.",
    "Place the bagged turmeric root into your refrigerator.",
    "Find a visible place in your fridge where you won’t forget about your bagged turmeric root.",
    "When stored this way, the turmeric root should keep for up to 2 weeks.",
    "If you notice any mold developing, cut off the moldy spot and replace the paper towel.",
    "Freezing Fresh Tumeric Root Wash the turmeric root and use a brush to remove dirt.",
    "Your fresh turmeric root has traveled quite a bit since it was pulled out of the ground.",
    "Wash it thoroughly with warm water to get rid of any germs or chemicals it may have accumulated.",
    "Use a veggie brush to give the root a quick scrub, removing any dirt that is stuck to it.",
    "Angle the brush to get into all the nooks and crannies of the gnarled root.",
    "Dry the turmeric root completely.",
    "Since you will be freezing this turmeric, be sure it is completely dry before you put it in the freezer.",
    "Squeeze the turmeric with a paper towel or clean cloth.",
    "Thoroughly drying the root will help avoid freezer burn.",
    "Freezer burn can make food taste unappealing, so it is worth the time it takes to dry the turmeric to avoid having to throw it away after a month in your freezer.",
    "Cut the turmeric into smaller pieces.",
    "If you cut it into pieces, the turmeric root will be more manageable to work with when it's frozen.",
    "Visualize how much turmeric you would use in 1 recipe (or for 1 cup of tea, etc.",
    "), and cut the root into pieces that will allow you to grab 1 or 2 when you need to use them.",
    "If you aren’t sure what size, start with pieces around 2 inches (5.1 cm) long.",
    "Turmeric will stain your hands a yellow/orange color.",
    "You can avoid this by wearing gloves.",
    "Avoid touching your clothes until you’ve washed your hands or removed the gloves.",
    "Hot water and a bit of dish soap should do the trick.",
    "Place the turmeric pieces into a freezer-safe bag.",
    "Use whichever size resealable plastic bag you prefer, and fill it up with your freshly-cut turmeric root.",
    "Roll the bag as you seal it to squeeze out all the excess air.",
    "Place the bag filled with fresh turmeric into your freezer.",
    "Find a spot in your freezer where the turmeric root won’t get lost.",
    "The turmeric will last up to six months in the freezer.",
    "Do your future self a favor by writing the date on the bag with a sharpie pen.",
    "That way, you’ll know when it is time to throw it away.",
    "Turmeric root will be slightly softer when defrosted, but will still taste good.",
    "You can use a microplaner to grate the frozen turmeric root if you don’t want to wait for the knob to thaw.",
    "Dehydrating Fresh Tumeric Root Wash the fresh turmeric root.",
    "Wash your turmeric root thoroughly with warm water to get rid of germs and chemicals.",
    "If you’d like, you can use a vegetable brush to give it an extra scrub.",
    "You will be peeling the skin off before dehydrating, so don’t worry if there is still dirt stuck to the turmeric.",
    "Use a vegetable peeler to peel off the skin of the turmeric root.",
    "The health benefits of turmeric root are found inside the root.",
    "Peeling off the skin will make your final product more potent.",
    "Use a vegetable peeler to remove the skin.",
    "Since turmeric root is often gnarled like ginger, you will have to work at different angles to get all of the skin off.",
    "A little bit of skin is okay, so don’t stress if you can’t remove the skin from especially challenging corners of the root.",
    "Cut the turmeric root into thin, equally sized slices.",
    "Cutting the turmeric root into thin slices will help it dry faster and more evenly.",
    "Try your best to keep them the same size so that they dry at the same time.",
    "Turmeric will stain your hands a yellow/orange color.",
    "You can avoid this by wearing gloves.",
    "Avoid touching your clothes until you’ve washed it off of your hands or removed your gloves.",
    "Place the cut turmeric root onto your dehydrator’s drying tray.",
    "Load up your dehydrators drying tray with the pieces of turmeric, making sure that they aren’t touching.",
    "Leave enough space around each piece so that the pieces dry thoroughly.",
    "Dry the turmeric pieces at 105 °F (41 °C) for 4 hours.",
    "Set your dehydrator and enjoy your life for 4 hours.",
    "Check on the turmeric pieces once 4 hours have passed.",
    "Find the largest and thickest pieces and see if they are dry.",
    "If they are, great!",
    "That means you are done with the drying process.",
    "If not, remove any smaller pieces that have dried, and set the rest to dry for another hour or two.",
    "Use a spice grinder to grind the pieces of dried root in batches.",
    "Once you have a pile of small dried turmeric pieces, it is time to start grinding them into powder form.",
    "Work in small batches as you grind the root pieces in your spice grinder.",
    "Place each round of ground powder into the airtight container you’ll use to store the spice.",
    "You can use a coffee grinder to grind spices, just never use it for coffee!",
    "Coffee beans are so robust that every spice you grind will taste like coffee.",
    "Store your dried turmeric root powder in an airtight container.",
    "Stored turmeric will keep for up to a year, if not longer.",
    "Storing your powder in an airtight container to use in the future is the best way to keep it fresh.",
    "Try using a mason jar, plastic Tupperware, or an empty baby food jar that has been thoroughly washed and dried.",
    "You can also use a resealable plastic bag, though an airtight container is the best option."
  ],
  "tyn_section":[
    "When Storing Turmeric in the Refrigerator",
    "Fresh turmeric root",
    "Vegetable scrub brush",
    "Paper towels",
    "Sealable or paper bag",
    "Gloves (optional but recommended)",
    "When Storing Turmeric in the Freezer",
    "Knife",
    "Paper towel or cloth towel",
    "Freezer-safe bag",
    "When Dehydrating Turmeric Root",
    "Vegetable peeler",
    "Dehydrator",
    "Spice or clean coffee grinder",
    "Gloves (optional but recommended",
    "Sealable jar"
  ],
  "tyn_model":[
    "turmeric",
    "paper towel",
    "turmeric root",
    "water",
    "airtight container",
    "resealable plastic bag",
    "veggie brush",
    "vegetable peeler",
    "dehydrator",
    "spice grinder",
    "paper bag",
    "freezer burn",
    "dish soap",
    "freezer-safe bag",
    "sharpie pen",
    "microplaner to",
    "vegetable brush",
    "dehydrators drying",
    "coffee grinder",
    "coffee beans",
    "tupperware,",
    "baby food jar"
  ],
  "simple_metrics":{
    "r":0.1875,
    "p":0.1363636364,
    "f1":0.1578947368,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.3181818182,
    "f1":0.3888888889
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.4545454545,
    "f1":0.5263157895
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3125,
    "p":0.2272727273,
    "f1":0.2631578947
  }
}