{
  "title":"How to Sew Corners",
  "url":"https://www.wikihow.com/Sew-Corners",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Skills"
  ],
  "methods":[
    {
      "name":"Sewing Boxed Corners",
      "steps":[
        {
          "headline":"Pull apart the fabric at the seams where you'd like to make a corner.",
          "description":"Keep the fabric inside out and find the corner where you'd like to make the box corner. Use your fingertips to pull apart the fabric at the seam. Your fabric should look like a triangle at the end and the seam should run down its center. Both layers of fabric should now be pointing in opposite directions instead of laying flat together."
        },
        {
          "headline":"Line up the seams from the side and bottom of your fabric.",
          "description":"Hold the fabric so they stay slightly separated at the seam. Then hold both sides of the fabric and position it so the seam on the edge matches up with the seam on the bottom.Tip: To test if the seams line up, insert a sewing pin through the seam on the edge. It should come out through the seam on the bottom."
        },
        {
          "headline":"Measure where you'd like to sew the box corner.",
          "description":"If you're following a pattern, it may give you a measurement to follow. For example, if the pattern says to stitch a perpendicular line 1 inch (2.5 cm) from the top of the seam, lay a ruler along the seam. Measure from the tip of the sewing, not the tips of the fabric, and make a mark on your fabric with a pencil. If your pattern doesn't give you a measurement, choose your own measurement. For example, if you'd like a short box, measure only ⁄2 inch (1.3 cm) from the top. To make a wide box, measure 2 to 4 inches (5.1 to 10.2 cm) from the top."
        },
        {
          "headline":"Draw a line that's perpendicular to the seam.",
          "description":"Turn the ruler so it's at a 90-degree angle from the seam. Ensure that it passes through the mark you just made. Then use a pencil to draw a line going from 1 side of the fabric to the other. Once you draw the line, it will look like the base of a triangle."
        },
        {
          "headline":"Sew straight stitches across the line.",
          "description":"Hold or pin the fabric and take it to your sewing machine. Make a couple of straight stitches onto the line you just marked and do a few backstitches. Then sew straight stitches until you reach the end of the line. Make several backstitches and then sew straight until you get to the end. The backstitches will support the corners. This is especially important if you'll be stuffing the item."
        },
        {
          "headline":"Trim the excess fabric and turn out the corner.",
          "description":"Take a pair of scissors and trim off the extra fabric leaving a ⁄4 inch (0.64 cm) seam allowance. Then flip the fabric so it's right side out. Push both of the corners you've just made so the fabric points out. You'll now have a box corner that will give depth and support to your item."
        }
      ]
    },
    {
      "name":"Stitching Mitered Corners",
      "steps":[
        {
          "headline":"Fold the edges of the fabric over twice to create your border.",
          "description":"Place the fabric right-side down so the pattern is down. Fold each edge over towards the center of the fabric by ⁄4 to ⁄2 inch (0.64 to 1.27 cm). Then fold again to make the fold as wide as you want the border to be.Tip: Use a ruler or fabric measuring tape to ensure that each of your folds are the same size. You shouldn't see the raw edges of the fabric after you've made the second fold."
        },
        {
          "headline":"Run an iron over the folded edges and open the fabric to see the crease.",
          "description":"Place the fabric on an ironing board and slowly press the iron over the edges a couple of times. Then open the last fold you made. The fabric will still have the first fold, but you'll be able to see a definite crease. Ironing will keep the fabric in place and create a crease so you can sew the corners easier."
        },
        {
          "headline":"Multiply the border width by 2 and mark it on the fabric.",
          "description":"To create a guideline for sewing the corners, take the width of the border you want and multiply it by 2. Then use a ruler to measure that distance from 1 of the corners and mark the fabric with a pencil. Turn the ruler and mark the other edge for the same corner. For example, if you want a 1 inch (2.5 cm) border, multiply 1 inch (2.5 cm) by 2 to get 2 inches (5.1 cm). Measure and mark a 2 inches (5.1 cm) distance from each corner. If pencil won't show up on your fabric, use a pen."
        },
        {
          "headline":"Draw a line between the 2 marks on each corner.",
          "description":"Take your ruler and place it across both of the marks for your corner. Then use the pencil to draw a line so the marks are connected. Repeat this for each corner you're sewing. This will create a 45-degree angle."
        },
        {
          "headline":"Fold the corner in 1/2 diagonally.",
          "description":"The marks that you made on the sides of the corner should match up and the wrong side of the fabric should be facing up. Then insert a sewing pin to hold the corner together. Remember to do this for each of your corners."
        },
        {
          "headline":"Sew straight across the line using a sewing machine.",
          "description":"Make a few straight stitches and then back stitch a couple of stitches. Continue to stitch straight across the line that you drew for each corner. Once you reach the end of the line, make a few backstitches and then lift the foot up so you can remove the fabric. Sewing a few backstitches at the beginning and end of the line will prevent the stitches from unraveling."
        },
        {
          "headline":"Cut away the excess fabric for each corner.",
          "description":"Use a sharp pair of scissors and cut the extra fabric ⁄4 inch (0.64 cm) from the line you just stitched. Cut in a straight line so your corner fabric stays smooth. Ensure that you don't cut too closely to the seam or the stitches might become loose."
        },
        {
          "headline":"Push the corner inside out and make the corner pointy.",
          "description":"Remove the fabric from the sewing machine and turn the corner inside out. The raw edges should be inside and the neat corner should be visible. To make the corner come to a point, insert a chopstick or knitting need and push gently."
        },
        {
          "headline":"Iron the corners to make them lay flat.",
          "description":"Although you can use the fabric with the corners right away, it may help to iron the corners for a few seconds. This will ensure that they stay flat."
        }
      ]
    }
  ],
  "text":" Sewing Boxed Corners Pull apart the fabric at the seams where you'd like to make a corner. Keep the fabric inside out and find the corner where you'd like to make the box corner. Use your fingertips to pull apart the fabric at the seam. Your fabric should look like a triangle at the end and the seam should run down its center. Both layers of fabric should now be pointing in opposite directions instead of laying flat together. Line up the seams from the side and bottom of your fabric. Hold the fabric so they stay slightly separated at the seam. Then hold both sides of the fabric and position it so the seam on the edge matches up with the seam on the bottom.Tip: To test if the seams line up, insert a sewing pin through the seam on the edge. It should come out through the seam on the bottom. Measure where you'd like to sew the box corner. If you're following a pattern, it may give you a measurement to follow. For example, if the pattern says to stitch a perpendicular line 1 inch (2.5 cm) from the top of the seam, lay a ruler along the seam. Measure from the tip of the sewing, not the tips of the fabric, and make a mark on your fabric with a pencil. If your pattern doesn't give you a measurement, choose your own measurement. For example, if you'd like a short box, measure only ⁄2 inch (1.3 cm) from the top. To make a wide box, measure 2 to 4 inches (5.1 to 10.2 cm) from the top. Draw a line that's perpendicular to the seam. Turn the ruler so it's at a 90-degree angle from the seam. Ensure that it passes through the mark you just made. Then use a pencil to draw a line going from 1 side of the fabric to the other. Once you draw the line, it will look like the base of a triangle. Sew straight stitches across the line. Hold or pin the fabric and take it to your sewing machine. Make a couple of straight stitches onto the line you just marked and do a few backstitches. Then sew straight stitches until you reach the end of the line. Make several backstitches and then sew straight until you get to the end. The backstitches will support the corners. This is especially important if you'll be stuffing the item. Trim the excess fabric and turn out the corner. Take a pair of scissors and trim off the extra fabric leaving a ⁄4 inch (0.64 cm) seam allowance. Then flip the fabric so it's right side out. Push both of the corners you've just made so the fabric points out. You'll now have a box corner that will give depth and support to your item. Stitching Mitered Corners Fold the edges of the fabric over twice to create your border. Place the fabric right-side down so the pattern is down. Fold each edge over towards the center of the fabric by ⁄4 to ⁄2 inch (0.64 to 1.27 cm). Then fold again to make the fold as wide as you want the border to be.Tip: Use a ruler or fabric measuring tape to ensure that each of your folds are the same size. You shouldn't see the raw edges of the fabric after you've made the second fold. Run an iron over the folded edges and open the fabric to see the crease. Place the fabric on an ironing board and slowly press the iron over the edges a couple of times. Then open the last fold you made. The fabric will still have the first fold, but you'll be able to see a definite crease. Ironing will keep the fabric in place and create a crease so you can sew the corners easier. Multiply the border width by 2 and mark it on the fabric. To create a guideline for sewing the corners, take the width of the border you want and multiply it by 2. Then use a ruler to measure that distance from 1 of the corners and mark the fabric with a pencil. Turn the ruler and mark the other edge for the same corner. For example, if you want a 1 inch (2.5 cm) border, multiply 1 inch (2.5 cm) by 2 to get 2 inches (5.1 cm). Measure and mark a 2 inches (5.1 cm) distance from each corner. If pencil won't show up on your fabric, use a pen. Draw a line between the 2 marks on each corner. Take your ruler and place it across both of the marks for your corner. Then use the pencil to draw a line so the marks are connected. Repeat this for each corner you're sewing. This will create a 45-degree angle. Fold the corner in 1/2 diagonally. The marks that you made on the sides of the corner should match up and the wrong side of the fabric should be facing up. Then insert a sewing pin to hold the corner together. Remember to do this for each of your corners. Sew straight across the line using a sewing machine. Make a few straight stitches and then back stitch a couple of stitches. Continue to stitch straight across the line that you drew for each corner. Once you reach the end of the line, make a few backstitches and then lift the foot up so you can remove the fabric. Sewing a few backstitches at the beginning and end of the line will prevent the stitches from unraveling. Cut away the excess fabric for each corner. Use a sharp pair of scissors and cut the extra fabric ⁄4 inch (0.64 cm) from the line you just stitched. Cut in a straight line so your corner fabric stays smooth. Ensure that you don't cut too closely to the seam or the stitches might become loose. Push the corner inside out and make the corner pointy. Remove the fabric from the sewing machine and turn the corner inside out. The raw edges should be inside and the neat corner should be visible. To make the corner come to a point, insert a chopstick or knitting need and push gently. Iron the corners to make them lay flat. Although you can use the fabric with the corners right away, it may help to iron the corners for a few seconds. This will ensure that they stay flat.",
  "sentences":[
    " Sewing Boxed Corners Pull apart the fabric at the seams where you'd like to make a corner.",
    "Keep the fabric inside out and find the corner where you'd like to make the box corner.",
    "Use your fingertips to pull apart the fabric at the seam.",
    "Your fabric should look like a triangle at the end and the seam should run down its center.",
    "Both layers of fabric should now be pointing in opposite directions instead of laying flat together.",
    "Line up the seams from the side and bottom of your fabric.",
    "Hold the fabric so they stay slightly separated at the seam.",
    "Then hold both sides of the fabric and position it so the seam on the edge matches up with the seam on the bottom.Tip: To test if the seams line up, insert a sewing pin through the seam on the edge.",
    "It should come out through the seam on the bottom.",
    "Measure where you'd like to sew the box corner.",
    "If you're following a pattern, it may give you a measurement to follow.",
    "For example, if the pattern says to stitch a perpendicular line 1 inch (2.5 cm) from the top of the seam, lay a ruler along the seam.",
    "Measure from the tip of the sewing, not the tips of the fabric, and make a mark on your fabric with a pencil.",
    "If your pattern doesn't give you a measurement, choose your own measurement.",
    "For example, if you'd like a short box, measure only ⁄2 inch (1.3 cm) from the top.",
    "To make a wide box, measure 2 to 4 inches (5.1 to 10.2 cm) from the top.",
    "Draw a line that's perpendicular to the seam.",
    "Turn the ruler so it's at a 90-degree angle from the seam.",
    "Ensure that it passes through the mark you just made.",
    "Then use a pencil to draw a line going from 1 side of the fabric to the other.",
    "Once you draw the line, it will look like the base of a triangle.",
    "Sew straight stitches across the line.",
    "Hold or pin the fabric and take it to your sewing machine.",
    "Make a couple of straight stitches onto the line you just marked and do a few backstitches.",
    "Then sew straight stitches until you reach the end of the line.",
    "Make several backstitches and then sew straight until you get to the end.",
    "The backstitches will support the corners.",
    "This is especially important if you'll be stuffing the item.",
    "Trim the excess fabric and turn out the corner.",
    "Take a pair of scissors and trim off the extra fabric leaving a ⁄4 inch (0.64 cm) seam allowance.",
    "Then flip the fabric so it's right side out.",
    "Push both of the corners you've just made so the fabric points out.",
    "You'll now have a box corner that will give depth and support to your item.",
    "Stitching Mitered Corners Fold the edges of the fabric over twice to create your border.",
    "Place the fabric right-side down so the pattern is down.",
    "Fold each edge over towards the center of the fabric by ⁄4 to ⁄2 inch (0.64 to 1.27 cm).",
    "Then fold again to make the fold as wide as you want the border to be.Tip: Use a ruler or fabric measuring tape to ensure that each of your folds are the same size.",
    "You shouldn't see the raw edges of the fabric after you've made the second fold.",
    "Run an iron over the folded edges and open the fabric to see the crease.",
    "Place the fabric on an ironing board and slowly press the iron over the edges a couple of times.",
    "Then open the last fold you made.",
    "The fabric will still have the first fold, but you'll be able to see a definite crease.",
    "Ironing will keep the fabric in place and create a crease so you can sew the corners easier.",
    "Multiply the border width by 2 and mark it on the fabric.",
    "To create a guideline for sewing the corners, take the width of the border you want and multiply it by 2.",
    "Then use a ruler to measure that distance from 1 of the corners and mark the fabric with a pencil.",
    "Turn the ruler and mark the other edge for the same corner.",
    "For example, if you want a 1 inch (2.5 cm) border, multiply 1 inch (2.5 cm) by 2 to get 2 inches (5.1 cm).",
    "Measure and mark a 2 inches (5.1 cm) distance from each corner.",
    "If pencil won't show up on your fabric, use a pen.",
    "Draw a line between the 2 marks on each corner.",
    "Take your ruler and place it across both of the marks for your corner.",
    "Then use the pencil to draw a line so the marks are connected.",
    "Repeat this for each corner you're sewing.",
    "This will create a 45-degree angle.",
    "Fold the corner in 1/2 diagonally.",
    "The marks that you made on the sides of the corner should match up and the wrong side of the fabric should be facing up.",
    "Then insert a sewing pin to hold the corner together.",
    "Remember to do this for each of your corners.",
    "Sew straight across the line using a sewing machine.",
    "Make a few straight stitches and then back stitch a couple of stitches.",
    "Continue to stitch straight across the line that you drew for each corner.",
    "Once you reach the end of the line, make a few backstitches and then lift the foot up so you can remove the fabric.",
    "Sewing a few backstitches at the beginning and end of the line will prevent the stitches from unraveling.",
    "Cut away the excess fabric for each corner.",
    "Use a sharp pair of scissors and cut the extra fabric ⁄4 inch (0.64 cm) from the line you just stitched.",
    "Cut in a straight line so your corner fabric stays smooth.",
    "Ensure that you don't cut too closely to the seam or the stitches might become loose.",
    "Push the corner inside out and make the corner pointy.",
    "Remove the fabric from the sewing machine and turn the corner inside out.",
    "The raw edges should be inside and the neat corner should be visible.",
    "To make the corner come to a point, insert a chopstick or knitting need and push gently.",
    "Iron the corners to make them lay flat.",
    "Although you can use the fabric with the corners right away, it may help to iron the corners for a few seconds.",
    "This will ensure that they stay flat."
  ],
  "tyn_section":[
    "Sewing machine",
    "Thread",
    "Fabric",
    "Scissors",
    "Ruler",
    "Pencil",
    "Iron and ironing board"
  ],
  "tyn_model":[
    "fabric",
    "ruler",
    "pencil",
    "iron",
    "sewing machine",
    "sewing pin",
    "scissors",
    "fabric measuring tape",
    "ironing board",
    "ironing",
    "pen",
    "chopstick",
    "knitting need"
  ],
  "simple_metrics":{
    "r":0.7142857143,
    "p":0.3846153846,
    "f1":0.5,
    "avg_pos":0.3076923077
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.4615384615,
    "f1":0.6
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.6153846154,
    "f1":0.7164179104
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.3846153846,
    "f1":0.5
  }
}