{
  "title":"How to Replace Rotted Wood Around a Window",
  "url":"https://www.wikihow.com/Replace-Rotted-Wood-Around-a-Window",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Replacement"
  ],
  "methods":[
    {
      "name":"Repairing Minor Rot with Epoxy",
      "steps":[
        {
          "headline":"Probe the wood to determine the extent of the rot.",
          "description":"As wood rots, it becomes “punky,” which means it takes on a soft, spongy texture. To gauge how bad the problem is, go around the entire window frame applying pressure to the wood every 2–3 inches (5.1–7.6 cm) with your fingertip or a small tool like an awl or screwdriver. If you feel it give, it most likely means that there’s rot in that section. Wood rot is often accompanied by peeling, wrinkled, or discolored paint. Be sure to touch-test the entire surface of each piece. Otherwise, you may miss a spot.Tip: It’s best to use epoxy when the piece you’re repairing is still 80-85% intact, or when it would be especially costly or difficult to try to replace the piece with new wood."
        },
        {
          "headline":"Scrape out small rotted spots with a screwdriver or chisel.",
          "description":"Dig the tip of your tool into the bad wood and work it free of the frame. You shouldn’t encounter too much resistance since the decay will have made it soft. However, you’ll still want to work carefully to avoid damaging the surrounding wood. Continue gouging and scraping until only hard, healthy wood remains. Take your time and focus on eliminating as much of the rotted wood as you can. If you leave any behind, it could easily spread to another part of the frame. If you discover that the rot is more extensive than you originally thought, you may have no choice but to cut replacement pieces to install in the sections that can’t be salvaged."
        },
        {
          "headline":"Mix up your epoxy according to the manufacturer’s directions.",
          "description":"Most epoxies consist of two separate bonding components that need to be combined in equal parts in order to be effective. Follow the mixing instructions listed on the packaging to prepare enough epoxy to patch each individual spot you uncovered while probing. Make sure you pick up a wood filler epoxy that's designed specifically for use on wood surfaces. If possible, do your mixing on a surface that the epoxy won’t stick to, such as a sheet of plexiglass, plastic tarp, or freezer bag, or the shiny side of a strip of packing tape."
        },
        {
          "headline":"Apply the epoxy to the damaged area using a putty knife.",
          "description":"Slather on enough to overfill the spot slightly—you can sand away the excess later. After building up each spot, glide the flat side of your putty knife over the epoxy a few times as though you were frosting a cake. This will help produce a smoother finish that you can hide easily with a couple coats of paint. Some two-part epoxy kits are sold with applicator guns that make it possible to mix and apply the filler simultaneously. Keep in mind that you'll still need to use a putty knife to spread the epoxy even if you're using a gun to apply it. It’s better to use too much epoxy than too little. Partially-filled holes and crevices could result in unsightly dents and depressions once the area has been repainted. You’ll only have about 30-60 minutes from the time that you mix up your epoxy before it begins to dry, so make an effort to work quickly and efficiently. If you’re patching multiple windows, whip up a fresh batch before starting on the next."
        },
        {
          "headline":"Allow the epoxy to cure for at least 3-4 hours.",
          "description":"As it sits, it will gradually expand to continue filling out the damaged area. It will then harden to form a strong, watertight seal that will do a much better job of keeping unwanted moisture out than new wood or paint alone. You may need to let freshly-applied epoxy sit for up to 24 hours if the weather is particularly cool or damp. Avoid handling the epoxy in any way as it cures. Doing so could deform it, ruining all of your hard work."
        },
        {
          "headline":"Sand the dried epoxy flush with the surrounding wood.",
          "description":"Start with an 80-grit sheet to shave off the excess filler, then switch to a 120-grit sheet to take care of the fine detailing. Run the sandpaper over the epoxy in tight, smooth circles to ensure a defect-free finish. The idea is to shape it to the contours of the section of the window you’re repairing. Wear a facemask and safety glasses to protect yourself from dust and be sure to vacuum up the loose residue afterward. By the time you’re finished, the only indication that the spot has been patched should be the difference in color between the wood and the epoxy."
        },
        {
          "headline":"Touch up the patched piece with 2-3 coats of exterior paint.",
          "description":"Brush at least 2 coats onto the epoxy and surrounding wood surface to ensure full coverage and consistency of color. Allow the surface to dry for the recommended length of time between coats. When you’re satisfied with the look of your window, let the paint set for at least 24 hours before making any additional modifications. An angled trim brush will work best for painting narrow trim, decorative moulding, and other small, intricate features."
        }
      ]
    },
    {
      "name":"Installing Replacement Pieces for Badly Rotted Wood",
      "steps":[
        {
          "headline":"Inspect the entire window to gauge how extensive the rot is.",
          "description":"Work your way around all four edges of the frame pressing on the wood with a finger or small hand tool. Pay attention to any spots that feel soft or spongy to the touch. These places will often be accompanied by visual symptoms of decay, such as chipping, splintering, and peeling or discolored paint. In areas with multiple boards or small pieces, note the exact point at which the normal, healthy wood gives way to rot. Preserving as much intact wood as possible will cut down on both the required labor and overall budget for your project."
        },
        {
          "headline":"Cut or pry out the entire rotted section.",
          "description":"Loosen affected trim and casing pieces with a prybar, then pull them free by hand. If you happen to come across a piece you can’t budge, reach for a cutting tool that you can maneuver in tight spaces, such as a reciprocating saw or skill saw. Make a series of shallow cross cuts into the rotted wood, stopping just short of the healthy wood beneath. After scoring the wood, force it out using your prybar. An awl, putty knife, or similar tool may also come in handy for scraping wood pulp out of joints and gaps. Work carefully to minimize unnecessary damage to the nearby siding or sheathing materials.Tip: If your window has particularly complex construction, it may be a good idea to snap a photo of it before you begin the dismantling process. That way, you’ll have a reliable reference that will show you how everything is supposed to fit together."
        },
        {
          "headline":"Measure each of the pieces you remove individually.",
          "description":"Use a ruler or measuring tape to find the length, width, and thickness of each element you pull from the window. Record your measurements on a separate piece of paper and label them appropriately. Your replacement materials will need to match these dimensions as closely as possible. Making a note of standout features, such as mitered corners or fastening sites, can help you replicate them later on."
        },
        {
          "headline":"Seal any cracks in the exposed sheathing underneath.",
          "description":"Visible openings around the edges of the window will need to be addressed before you can go on to installing your replacement pieces. Run the nozzle of a caulk gun over small and medium-sized cracks, and use canisters of expanding spray foam insulation to fill larger openings. If the surrounding sheathing shows signs of water damage, you may also opt to install adhesive flashing to prevent any further moisture from getting in. You’re more likely to run into cracks and gaps in board sheathing, which is found on many older homes. It’s important to seal up every last aperture you can get to—a small crack has the potential to become a big one in no time at all."
        },
        {
          "headline":"Cut new wood to fit the rotted sections.",
          "description":"Use the measurements you took earlier to cut your replacement wood to identical dimensions. Focus on making clean, neat cuts that will enable you to simply slip the new piece into place without the need for further adjustments. Don’t forget to miter the ends of decorative moulding to a 45-degree angle. Shop around for wood with a similar thickness and grain pattern to that of the window’s original components. If you’re not sure what type of wood was used to construct your home, take a photo or sample piece from a healthy, intact section of the window down to your local home improvement center to have it examined by a professional. A miter box or speed square can make it easier to line up multiple 90- and 45-degree angled cuts quickly and with maximum precision."
        },
        {
          "headline":"Install the new pieces using galvanized nails.",
          "description":"Home improvement experts typically recommend using 8D finishing nails to secure window trim. Drive a nail into the top and bottom corner of each piece, then do the same at the center. Repeat this process for each individual element you’re installing. For especially large windows, space additional nails 16 inches (41 cm) apart along the length in pairs to make sure your new pieces hold. If necessary, fill sunken nail holes with wood putty to bring them level with the surface of the wood."
        },
        {
          "headline":"Paint your replacement pieces as needed.",
          "description":"Brush on 2-3 coats of exterior paint in a shade matching the surrounding intact elements. Let each coat dry for the amount of time recommended by the manufacturer before starting on the next one, and allow your topcoat to dry for 24 hours. Plan on applying at least 2 coats to achieve full coverage on unfinished wood. If you’re making improvements to an older home and have no way of identifying the exact shade of paint used, just try to match it as best you can. A set of paint chips or color-matching app can help you with your comparison. Another option is to simply repaint all of the window trim. A brand new paint job will guarantee that you won’t end up with any color inconsistencies. And if the existing paint is fading, it’s probably time to repaint anyway."
        }
      ]
    }
  ],
  "text":" Repairing Minor Rot with Epoxy Probe the wood to determine the extent of the rot. As wood rots, it becomes “punky,” which means it takes on a soft, spongy texture. To gauge how bad the problem is, go around the entire window frame applying pressure to the wood every 2–3 inches (5.1–7.6 cm) with your fingertip or a small tool like an awl or screwdriver. If you feel it give, it most likely means that there’s rot in that section. Wood rot is often accompanied by peeling, wrinkled, or discolored paint. Be sure to touch-test the entire surface of each piece. Otherwise, you may miss a spot.Tip: It’s best to use epoxy when the piece you’re repairing is still 80-85% intact, or when it would be especially costly or difficult to try to replace the piece with new wood. Scrape out small rotted spots with a screwdriver or chisel. Dig the tip of your tool into the bad wood and work it free of the frame. You shouldn’t encounter too much resistance since the decay will have made it soft. However, you’ll still want to work carefully to avoid damaging the surrounding wood. Continue gouging and scraping until only hard, healthy wood remains. Take your time and focus on eliminating as much of the rotted wood as you can. If you leave any behind, it could easily spread to another part of the frame. If you discover that the rot is more extensive than you originally thought, you may have no choice but to cut replacement pieces to install in the sections that can’t be salvaged. Mix up your epoxy according to the manufacturer’s directions. Most epoxies consist of two separate bonding components that need to be combined in equal parts in order to be effective. Follow the mixing instructions listed on the packaging to prepare enough epoxy to patch each individual spot you uncovered while probing. Make sure you pick up a wood filler epoxy that's designed specifically for use on wood surfaces. If possible, do your mixing on a surface that the epoxy won’t stick to, such as a sheet of plexiglass, plastic tarp, or freezer bag, or the shiny side of a strip of packing tape. Apply the epoxy to the damaged area using a putty knife. Slather on enough to overfill the spot slightly—you can sand away the excess later. After building up each spot, glide the flat side of your putty knife over the epoxy a few times as though you were frosting a cake. This will help produce a smoother finish that you can hide easily with a couple coats of paint. Some two-part epoxy kits are sold with applicator guns that make it possible to mix and apply the filler simultaneously. Keep in mind that you'll still need to use a putty knife to spread the epoxy even if you're using a gun to apply it. It’s better to use too much epoxy than too little. Partially-filled holes and crevices could result in unsightly dents and depressions once the area has been repainted. You’ll only have about 30-60 minutes from the time that you mix up your epoxy before it begins to dry, so make an effort to work quickly and efficiently. If you’re patching multiple windows, whip up a fresh batch before starting on the next. Allow the epoxy to cure for at least 3-4 hours. As it sits, it will gradually expand to continue filling out the damaged area. It will then harden to form a strong, watertight seal that will do a much better job of keeping unwanted moisture out than new wood or paint alone. You may need to let freshly-applied epoxy sit for up to 24 hours if the weather is particularly cool or damp. Avoid handling the epoxy in any way as it cures. Doing so could deform it, ruining all of your hard work. Sand the dried epoxy flush with the surrounding wood. Start with an 80-grit sheet to shave off the excess filler, then switch to a 120-grit sheet to take care of the fine detailing. Run the sandpaper over the epoxy in tight, smooth circles to ensure a defect-free finish. The idea is to shape it to the contours of the section of the window you’re repairing. Wear a facemask and safety glasses to protect yourself from dust and be sure to vacuum up the loose residue afterward. By the time you’re finished, the only indication that the spot has been patched should be the difference in color between the wood and the epoxy. Touch up the patched piece with 2-3 coats of exterior paint. Brush at least 2 coats onto the epoxy and surrounding wood surface to ensure full coverage and consistency of color. Allow the surface to dry for the recommended length of time between coats. When you’re satisfied with the look of your window, let the paint set for at least 24 hours before making any additional modifications. An angled trim brush will work best for painting narrow trim, decorative moulding, and other small, intricate features. Installing Replacement Pieces for Badly Rotted Wood Inspect the entire window to gauge how extensive the rot is. Work your way around all four edges of the frame pressing on the wood with a finger or small hand tool. Pay attention to any spots that feel soft or spongy to the touch. These places will often be accompanied by visual symptoms of decay, such as chipping, splintering, and peeling or discolored paint. In areas with multiple boards or small pieces, note the exact point at which the normal, healthy wood gives way to rot. Preserving as much intact wood as possible will cut down on both the required labor and overall budget for your project. Cut or pry out the entire rotted section. Loosen affected trim and casing pieces with a prybar, then pull them free by hand. If you happen to come across a piece you can’t budge, reach for a cutting tool that you can maneuver in tight spaces, such as a reciprocating saw or skill saw. Make a series of shallow cross cuts into the rotted wood, stopping just short of the healthy wood beneath. After scoring the wood, force it out using your prybar. An awl, putty knife, or similar tool may also come in handy for scraping wood pulp out of joints and gaps. Work carefully to minimize unnecessary damage to the nearby siding or sheathing materials.Tip: If your window has particularly complex construction, it may be a good idea to snap a photo of it before you begin the dismantling process. That way, you’ll have a reliable reference that will show you how everything is supposed to fit together. Measure each of the pieces you remove individually. Use a ruler or measuring tape to find the length, width, and thickness of each element you pull from the window. Record your measurements on a separate piece of paper and label them appropriately. Your replacement materials will need to match these dimensions as closely as possible. Making a note of standout features, such as mitered corners or fastening sites, can help you replicate them later on. Seal any cracks in the exposed sheathing underneath. Visible openings around the edges of the window will need to be addressed before you can go on to installing your replacement pieces. Run the nozzle of a caulk gun over small and medium-sized cracks, and use canisters of expanding spray foam insulation to fill larger openings. If the surrounding sheathing shows signs of water damage, you may also opt to install adhesive flashing to prevent any further moisture from getting in. You’re more likely to run into cracks and gaps in board sheathing, which is found on many older homes. It’s important to seal up every last aperture you can get to—a small crack has the potential to become a big one in no time at all. Cut new wood to fit the rotted sections. Use the measurements you took earlier to cut your replacement wood to identical dimensions. Focus on making clean, neat cuts that will enable you to simply slip the new piece into place without the need for further adjustments. Don’t forget to miter the ends of decorative moulding to a 45-degree angle. Shop around for wood with a similar thickness and grain pattern to that of the window’s original components. If you’re not sure what type of wood was used to construct your home, take a photo or sample piece from a healthy, intact section of the window down to your local home improvement center to have it examined by a professional. A miter box or speed square can make it easier to line up multiple 90- and 45-degree angled cuts quickly and with maximum precision. Install the new pieces using galvanized nails. Home improvement experts typically recommend using 8D finishing nails to secure window trim. Drive a nail into the top and bottom corner of each piece, then do the same at the center. Repeat this process for each individual element you’re installing. For especially large windows, space additional nails 16 inches (41 cm) apart along the length in pairs to make sure your new pieces hold. If necessary, fill sunken nail holes with wood putty to bring them level with the surface of the wood. Paint your replacement pieces as needed. Brush on 2-3 coats of exterior paint in a shade matching the surrounding intact elements. Let each coat dry for the amount of time recommended by the manufacturer before starting on the next one, and allow your topcoat to dry for 24 hours. Plan on applying at least 2 coats to achieve full coverage on unfinished wood. If you’re making improvements to an older home and have no way of identifying the exact shade of paint used, just try to match it as best you can. A set of paint chips or color-matching app can help you with your comparison. Another option is to simply repaint all of the window trim. A brand new paint job will guarantee that you won’t end up with any color inconsistencies. And if the existing paint is fading, it’s probably time to repaint anyway.",
  "sentences":[
    " Repairing Minor Rot with Epoxy Probe the wood to determine the extent of the rot.",
    "As wood rots, it becomes “punky,” which means it takes on a soft, spongy texture.",
    "To gauge how bad the problem is, go around the entire window frame applying pressure to the wood every 2–3 inches (5.1–7.6 cm) with your fingertip or a small tool like an awl or screwdriver.",
    "If you feel it give, it most likely means that there’s rot in that section.",
    "Wood rot is often accompanied by peeling, wrinkled, or discolored paint.",
    "Be sure to touch-test the entire surface of each piece.",
    "Otherwise, you may miss a spot.Tip: It’s best to use epoxy when the piece you’re repairing is still 80-85% intact, or when it would be especially costly or difficult to try to replace the piece with new wood.",
    "Scrape out small rotted spots with a screwdriver or chisel.",
    "Dig the tip of your tool into the bad wood and work it free of the frame.",
    "You shouldn’t encounter too much resistance since the decay will have made it soft.",
    "However, you’ll still want to work carefully to avoid damaging the surrounding wood.",
    "Continue gouging and scraping until only hard, healthy wood remains.",
    "Take your time and focus on eliminating as much of the rotted wood as you can.",
    "If you leave any behind, it could easily spread to another part of the frame.",
    "If you discover that the rot is more extensive than you originally thought, you may have no choice but to cut replacement pieces to install in the sections that can’t be salvaged.",
    "Mix up your epoxy according to the manufacturer’s directions.",
    "Most epoxies consist of two separate bonding components that need to be combined in equal parts in order to be effective.",
    "Follow the mixing instructions listed on the packaging to prepare enough epoxy to patch each individual spot you uncovered while probing.",
    "Make sure you pick up a wood filler epoxy that's designed specifically for use on wood surfaces.",
    "If possible, do your mixing on a surface that the epoxy won’t stick to, such as a sheet of plexiglass, plastic tarp, or freezer bag, or the shiny side of a strip of packing tape.",
    "Apply the epoxy to the damaged area using a putty knife.",
    "Slather on enough to overfill the spot slightly—you can sand away the excess later.",
    "After building up each spot, glide the flat side of your putty knife over the epoxy a few times as though you were frosting a cake.",
    "This will help produce a smoother finish that you can hide easily with a couple coats of paint.",
    "Some two-part epoxy kits are sold with applicator guns that make it possible to mix and apply the filler simultaneously.",
    "Keep in mind that you'll still need to use a putty knife to spread the epoxy even if you're using a gun to apply it.",
    "It’s better to use too much epoxy than too little.",
    "Partially-filled holes and crevices could result in unsightly dents and depressions once the area has been repainted.",
    "You’ll only have about 30-60 minutes from the time that you mix up your epoxy before it begins to dry, so make an effort to work quickly and efficiently.",
    "If you’re patching multiple windows, whip up a fresh batch before starting on the next.",
    "Allow the epoxy to cure for at least 3-4 hours.",
    "As it sits, it will gradually expand to continue filling out the damaged area.",
    "It will then harden to form a strong, watertight seal that will do a much better job of keeping unwanted moisture out than new wood or paint alone.",
    "You may need to let freshly-applied epoxy sit for up to 24 hours if the weather is particularly cool or damp.",
    "Avoid handling the epoxy in any way as it cures.",
    "Doing so could deform it, ruining all of your hard work.",
    "Sand the dried epoxy flush with the surrounding wood.",
    "Start with an 80-grit sheet to shave off the excess filler, then switch to a 120-grit sheet to take care of the fine detailing.",
    "Run the sandpaper over the epoxy in tight, smooth circles to ensure a defect-free finish.",
    "The idea is to shape it to the contours of the section of the window you’re repairing.",
    "Wear a facemask and safety glasses to protect yourself from dust and be sure to vacuum up the loose residue afterward.",
    "By the time you’re finished, the only indication that the spot has been patched should be the difference in color between the wood and the epoxy.",
    "Touch up the patched piece with 2-3 coats of exterior paint.",
    "Brush at least 2 coats onto the epoxy and surrounding wood surface to ensure full coverage and consistency of color.",
    "Allow the surface to dry for the recommended length of time between coats.",
    "When you’re satisfied with the look of your window, let the paint set for at least 24 hours before making any additional modifications.",
    "An angled trim brush will work best for painting narrow trim, decorative moulding, and other small, intricate features.",
    "Installing Replacement Pieces for Badly Rotted Wood Inspect the entire window to gauge how extensive the rot is.",
    "Work your way around all four edges of the frame pressing on the wood with a finger or small hand tool.",
    "Pay attention to any spots that feel soft or spongy to the touch.",
    "These places will often be accompanied by visual symptoms of decay, such as chipping, splintering, and peeling or discolored paint.",
    "In areas with multiple boards or small pieces, note the exact point at which the normal, healthy wood gives way to rot.",
    "Preserving as much intact wood as possible will cut down on both the required labor and overall budget for your project.",
    "Cut or pry out the entire rotted section.",
    "Loosen affected trim and casing pieces with a prybar, then pull them free by hand.",
    "If you happen to come across a piece you can’t budge, reach for a cutting tool that you can maneuver in tight spaces, such as a reciprocating saw or skill saw.",
    "Make a series of shallow cross cuts into the rotted wood, stopping just short of the healthy wood beneath.",
    "After scoring the wood, force it out using your prybar.",
    "An awl, putty knife, or similar tool may also come in handy for scraping wood pulp out of joints and gaps.",
    "Work carefully to minimize unnecessary damage to the nearby siding or sheathing materials.Tip: If your window has particularly complex construction, it may be a good idea to snap a photo of it before you begin the dismantling process.",
    "That way, you’ll have a reliable reference that will show you how everything is supposed to fit together.",
    "Measure each of the pieces you remove individually.",
    "Use a ruler or measuring tape to find the length, width, and thickness of each element you pull from the window.",
    "Record your measurements on a separate piece of paper and label them appropriately.",
    "Your replacement materials will need to match these dimensions as closely as possible.",
    "Making a note of standout features, such as mitered corners or fastening sites, can help you replicate them later on.",
    "Seal any cracks in the exposed sheathing underneath.",
    "Visible openings around the edges of the window will need to be addressed before you can go on to installing your replacement pieces.",
    "Run the nozzle of a caulk gun over small and medium-sized cracks, and use canisters of expanding spray foam insulation to fill larger openings.",
    "If the surrounding sheathing shows signs of water damage, you may also opt to install adhesive flashing to prevent any further moisture from getting in.",
    "You’re more likely to run into cracks and gaps in board sheathing, which is found on many older homes.",
    "It’s important to seal up every last aperture you can get to—a small crack has the potential to become a big one in no time at all.",
    "Cut new wood to fit the rotted sections.",
    "Use the measurements you took earlier to cut your replacement wood to identical dimensions.",
    "Focus on making clean, neat cuts that will enable you to simply slip the new piece into place without the need for further adjustments.",
    "Don’t forget to miter the ends of decorative moulding to a 45-degree angle.",
    "Shop around for wood with a similar thickness and grain pattern to that of the window’s original components.",
    "If you’re not sure what type of wood was used to construct your home, take a photo or sample piece from a healthy, intact section of the window down to your local home improvement center to have it examined by a professional.",
    "A miter box or speed square can make it easier to line up multiple 90- and 45-degree angled cuts quickly and with maximum precision.",
    "Install the new pieces using galvanized nails.",
    "Home improvement experts typically recommend using 8D finishing nails to secure window trim.",
    "Drive a nail into the top and bottom corner of each piece, then do the same at the center.",
    "Repeat this process for each individual element you’re installing.",
    "For especially large windows, space additional nails 16 inches (41 cm) apart along the length in pairs to make sure your new pieces hold.",
    "If necessary, fill sunken nail holes with wood putty to bring them level with the surface of the wood.",
    "Paint your replacement pieces as needed.",
    "Brush on 2-3 coats of exterior paint in a shade matching the surrounding intact elements.",
    "Let each coat dry for the amount of time recommended by the manufacturer before starting on the next one, and allow your topcoat to dry for 24 hours.",
    "Plan on applying at least 2 coats to achieve full coverage on unfinished wood.",
    "If you’re making improvements to an older home and have no way of identifying the exact shade of paint used, just try to match it as best you can.",
    "A set of paint chips or color-matching app can help you with your comparison.",
    "Another option is to simply repaint all of the window trim.",
    "A brand new paint job will guarantee that you won’t end up with any color inconsistencies.",
    "And if the existing paint is fading, it’s probably time to repaint anyway."
  ],
  "tyn_section":[
    "Awl, screwdriver, or chisel",
    "Wood filler epoxy",
    "Putty knife",
    "80-grit sandpaper",
    "120-grit sandpaper",
    "Exterior paint",
    "Angled trim brush",
    "Facemask and safety goggles",
    "Shop vacuum",
    "Pry bar",
    "Ruler or tape measure",
    "Paper and pencil",
    "Replacement wood",
    "Circular saw",
    "Miter box or speed square",
    "8D galvanized finishing nails",
    "Reciprocating saw or skill saw (optional)",
    "Awl, screwdriver, or chisel (optional)",
    "Caulk, spray foam insulation, or adhesive window flashing (optional)",
    "Wood putty (optional)"
  ],
  "tyn_model":[
    "epoxy",
    "paint",
    "putty knife",
    "filler",
    "nails",
    "“punky",
    "” which",
    "screwdriver",
    "chisel",
    "wood filler",
    "—you",
    "sandpaper",
    "reciprocating saw",
    "skill saw",
    "awl, putty knife",
    "ruler",
    "paper",
    "caulk gun",
    "spray foam insulation",
    "adhesive",
    "—a",
    "decorative moulding",
    "wood",
    "home improvement center",
    "miter box",
    "galvanized nails",
    "home improvement experts typically recommend using",
    "nail",
    "wood putty",
    "exterior paint",
    "paint chips"
  ],
  "simple_metrics":{
    "r":0.1,
    "p":0.064516129,
    "f1":0.0784313725,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.2903225806,
    "f1":0.3364485981
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.5161290323,
    "f1":0.5549132948
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.1612903226,
    "f1":0.1785714286
  }
}