{
  "title":"How to Parboil Chicken",
  "url":"https://www.wikihow.com/Parboil-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "parts":[
    {
      "name":"Simmering the Chicken",
      "steps":[
        {
          "headline":"Put the chicken into a stockpot.",
          "description":"You can use a whole chicken or as many pieces as you can fit into a stockpot. Decide if you'd like to parboil boneless chicken or if you want to leave the bones in for additional flavor. Then place the chicken into a stockpot on the stove. If you want to parboil several whole chickens, you'll need to work in batches or use several pots."
        },
        {
          "headline":"Pour a flavorful liquid into the stockpot.",
          "description":"Although you can simply pour enough water to cover the chicken, use chicken broth, apple cider, or vegetable stock in order to add flavor to the chicken. Ensure that the chicken is covered by at least 1 inch (2.5 cm) of liquid.Tip: To tenderize the chicken as it parboils, consider adding salt to the liquid. Mix in 1 teaspoon (5.5 g) of salt for every 4 cups (950 ml) of liquid. You can also include a chopped onion, 2 to 3 carrots, 2 to 3 stalks of celery, the peel of 1 lemon peel, or 1 head of garlic cloves for each chicken to add extra flavor."
        },
        {
          "headline":"Bring the liquid to a boil.",
          "description":"Turn the burner on to medium and leave the lid off of the stockpot. Heat the chicken in the liquid until the liquid begins to boil vigorously. The amount of time this takes will depend on how much chicken you're parboiling and how much liquid you have in the stockpot but it should take less than 15 minutes."
        },
        {
          "headline":"Simmer the covered chicken on low.",
          "description":"Turn the burner down to low and put the lid on the stockpot. The liquid should bubble gently and the chicken will lose its pink coloring once it's finished parboiling. Follow these guidelines for how long to parboil your chicken:\n30 to 40 minutes for a whole chicken\n15 to 20 minutes for chicken wings\n10 minutes for chicken breasts\n5 minutes for chicken legs, thighs, or quarters"
        },
        {
          "headline":"Remove the chicken and pat it dry.",
          "description":"Turn off the burner and use tongs to take the parboiled chicken out of the liquid. Transfer the chicken to a plate and pat it dry with paper towels before you continue to cook it in your recipe. Remember that the chicken isn't completely cooked at this point. Use good hygiene practices, such as washing your hands and preventing cross-contamination, when working with the chicken."
        },
        {
          "headline":"Finish cooking the chicken according to your recipe.",
          "description":"Because you're heating the chicken but not cooking it completely, the chicken may continue to grow harmful bacteria as it's stored. This is why it's important to cook the chicken to a food-safe temperature of 165 °F (74 °C) immediately after parboiling it. To prevent foodborne illnesses, avoid parboiling the chicken and refrigerating it before you cook with it."
        }
      ]
    },
    {
      "name":"Cooking with the Parboiled Chicken",
      "steps":[
        {
          "headline":"Bake the parboiled chicken to create crunchy pieces.",
          "description":"If you're making wings but don't want to deep fry them, parboil them and spread them on a baking sheet. Preheat the oven and then roast the chicken at 450 °F (232 °C) for 20 to 30 minutes or until they're caramelized and crisp. If you're baking breasts, thighs, or drumsticks add 5 to 10 minutes to the baking time. Spread your favorite sauce over the baked chicken pieces. For example, coat them with buffalo wing sauce or blue cheese dip."
        },
        {
          "headline":"Toss parboiled drumsticks on the grill for perfectly cooked chicken.",
          "description":"Brush the grill grate and heat a gas or charcoal grill to medium-high heat. Place the parboiled chicken pieces on the preheated grill and cook the chicken for 20 to 40 minutes. Use tongs to turn the chicken frequently and brush the chicken with barbecue sauce during the last 15 minutes of cooking.Variation: If you don't like the flavor of barbecue sauce, rub the chicken with a dry spice rub instead or drizzle the grilled chicken with a fresh, herb sauce instead. Remember to insert an instant-read meat thermometer into the thickest part of the chicken. The temperature should reach 165 °F (74 °C) before you pull the grilled chicken off of the grill. While this works well with drumsticks, you can use any cut of chicken. Keep in mind that larger pieces, such as breasts, will take longer to grill while smaller pieces, such as wings will cook faster."
        },
        {
          "headline":"Bread or batter the parboiled chicken and deep fry it until it's crispy.",
          "description":"Dip the parboiled chicken pieces in beaten egg and then coat the pieces with a batter of your choice. For example, use a crunchy breadcrumb coating or a beer batter. Then fry the chicken pieces in 2 inches (5.1 cm) of 350 °F (177 °C) oil until they're crunchy and cooked throughout. Use tongs to carefully turn the pieces as they fry. Depending on the size of your chicken pieces, it may take 10 to 20 minutes to fry them in hot oil."
        },
        {
          "headline":"Add parboiled chicken pieces to your favorite clear soup.",
          "description":"To make classic or Vietnamese chicken noodle soup, parboil chicken and set it aside while you heat fresh stock in the pot. Simmer your choice of chopped vegetables, such as carrots or celery, and return the whole chicken pieces to the pot. Cook the soup over medium heat until the chicken is cooked throughout. If you prefer, shred the cooked chicken and return it to the soup before serving. To give your soup a fresh taste, add chopped basil or parsley just before serving the soup."
        }
      ]
    }
  ],
  "text":" Simmering the Chicken Put the chicken into a stockpot. You can use a whole chicken or as many pieces as you can fit into a stockpot. Decide if you'd like to parboil boneless chicken or if you want to leave the bones in for additional flavor. Then place the chicken into a stockpot on the stove. If you want to parboil several whole chickens, you'll need to work in batches or use several pots. Pour a flavorful liquid into the stockpot. Although you can simply pour enough water to cover the chicken, use chicken broth, apple cider, or vegetable stock in order to add flavor to the chicken. Ensure that the chicken is covered by at least 1 inch (2.5 cm) of liquid.Tip: To tenderize the chicken as it parboils, consider adding salt to the liquid. Mix in 1 teaspoon (5.5 g) of salt for every 4 cups (950 ml) of liquid. You can also include a chopped onion, 2 to 3 carrots, 2 to 3 stalks of celery, the peel of 1 lemon peel, or 1 head of garlic cloves for each chicken to add extra flavor. Bring the liquid to a boil. Turn the burner on to medium and leave the lid off of the stockpot. Heat the chicken in the liquid until the liquid begins to boil vigorously. The amount of time this takes will depend on how much chicken you're parboiling and how much liquid you have in the stockpot but it should take less than 15 minutes. Simmer the covered chicken on low. Turn the burner down to low and put the lid on the stockpot. The liquid should bubble gently and the chicken will lose its pink coloring once it's finished parboiling. Follow these guidelines for how long to parboil your chicken:\n30 to 40 minutes for a whole chicken\n15 to 20 minutes for chicken wings\n10 minutes for chicken breasts\n5 minutes for chicken legs, thighs, or quarters Remove the chicken and pat it dry. Turn off the burner and use tongs to take the parboiled chicken out of the liquid. Transfer the chicken to a plate and pat it dry with paper towels before you continue to cook it in your recipe. Remember that the chicken isn't completely cooked at this point. Use good hygiene practices, such as washing your hands and preventing cross-contamination, when working with the chicken. Finish cooking the chicken according to your recipe. Because you're heating the chicken but not cooking it completely, the chicken may continue to grow harmful bacteria as it's stored. This is why it's important to cook the chicken to a food-safe temperature of 165 °F (74 °C) immediately after parboiling it. To prevent foodborne illnesses, avoid parboiling the chicken and refrigerating it before you cook with it. Cooking with the Parboiled Chicken Bake the parboiled chicken to create crunchy pieces. If you're making wings but don't want to deep fry them, parboil them and spread them on a baking sheet. Preheat the oven and then roast the chicken at 450 °F (232 °C) for 20 to 30 minutes or until they're caramelized and crisp. If you're baking breasts, thighs, or drumsticks add 5 to 10 minutes to the baking time. Spread your favorite sauce over the baked chicken pieces. For example, coat them with buffalo wing sauce or blue cheese dip. Toss parboiled drumsticks on the grill for perfectly cooked chicken. Brush the grill grate and heat a gas or charcoal grill to medium-high heat. Place the parboiled chicken pieces on the preheated grill and cook the chicken for 20 to 40 minutes. Use tongs to turn the chicken frequently and brush the chicken with barbecue sauce during the last 15 minutes of cooking.Variation: If you don't like the flavor of barbecue sauce, rub the chicken with a dry spice rub instead or drizzle the grilled chicken with a fresh, herb sauce instead. Remember to insert an instant-read meat thermometer into the thickest part of the chicken. The temperature should reach 165 °F (74 °C) before you pull the grilled chicken off of the grill. While this works well with drumsticks, you can use any cut of chicken. Keep in mind that larger pieces, such as breasts, will take longer to grill while smaller pieces, such as wings will cook faster. Bread or batter the parboiled chicken and deep fry it until it's crispy. Dip the parboiled chicken pieces in beaten egg and then coat the pieces with a batter of your choice. For example, use a crunchy breadcrumb coating or a beer batter. Then fry the chicken pieces in 2 inches (5.1 cm) of 350 °F (177 °C) oil until they're crunchy and cooked throughout. Use tongs to carefully turn the pieces as they fry. Depending on the size of your chicken pieces, it may take 10 to 20 minutes to fry them in hot oil. Add parboiled chicken pieces to your favorite clear soup. To make classic or Vietnamese chicken noodle soup, parboil chicken and set it aside while you heat fresh stock in the pot. Simmer your choice of chopped vegetables, such as carrots or celery, and return the whole chicken pieces to the pot. Cook the soup over medium heat until the chicken is cooked throughout. If you prefer, shred the cooked chicken and return it to the soup before serving. To give your soup a fresh taste, add chopped basil or parsley just before serving the soup.",
  "sentences":[
    " Simmering the Chicken Put the chicken into a stockpot.",
    "You can use a whole chicken or as many pieces as you can fit into a stockpot.",
    "Decide if you'd like to parboil boneless chicken or if you want to leave the bones in for additional flavor.",
    "Then place the chicken into a stockpot on the stove.",
    "If you want to parboil several whole chickens, you'll need to work in batches or use several pots.",
    "Pour a flavorful liquid into the stockpot.",
    "Although you can simply pour enough water to cover the chicken, use chicken broth, apple cider, or vegetable stock in order to add flavor to the chicken.",
    "Ensure that the chicken is covered by at least 1 inch (2.5 cm) of liquid.Tip: To tenderize the chicken as it parboils, consider adding salt to the liquid.",
    "Mix in 1 teaspoon (5.5 g) of salt for every 4 cups (950 ml) of liquid.",
    "You can also include a chopped onion, 2 to 3 carrots, 2 to 3 stalks of celery, the peel of 1 lemon peel, or 1 head of garlic cloves for each chicken to add extra flavor.",
    "Bring the liquid to a boil.",
    "Turn the burner on to medium and leave the lid off of the stockpot.",
    "Heat the chicken in the liquid until the liquid begins to boil vigorously.",
    "The amount of time this takes will depend on how much chicken you're parboiling and how much liquid you have in the stockpot but it should take less than 15 minutes.",
    "Simmer the covered chicken on low.",
    "Turn the burner down to low and put the lid on the stockpot.",
    "The liquid should bubble gently and the chicken will lose its pink coloring once it's finished parboiling.",
    "Follow these guidelines for how long to parboil your chicken:\n30 to 40 minutes for a whole chicken\n15 to 20 minutes for chicken wings\n10 minutes for chicken breasts\n5 minutes for chicken legs, thighs, or quarters Remove the chicken and pat it dry.",
    "Turn off the burner and use tongs to take the parboiled chicken out of the liquid.",
    "Transfer the chicken to a plate and pat it dry with paper towels before you continue to cook it in your recipe.",
    "Remember that the chicken isn't completely cooked at this point.",
    "Use good hygiene practices, such as washing your hands and preventing cross-contamination, when working with the chicken.",
    "Finish cooking the chicken according to your recipe.",
    "Because you're heating the chicken but not cooking it completely, the chicken may continue to grow harmful bacteria as it's stored.",
    "This is why it's important to cook the chicken to a food-safe temperature of 165 °F (74 °C) immediately after parboiling it.",
    "To prevent foodborne illnesses, avoid parboiling the chicken and refrigerating it before you cook with it.",
    "Cooking with the Parboiled Chicken Bake the parboiled chicken to create crunchy pieces.",
    "If you're making wings but don't want to deep fry them, parboil them and spread them on a baking sheet.",
    "Preheat the oven and then roast the chicken at 450 °F (232 °C) for 20 to 30 minutes or until they're caramelized and crisp.",
    "If you're baking breasts, thighs, or drumsticks add 5 to 10 minutes to the baking time.",
    "Spread your favorite sauce over the baked chicken pieces.",
    "For example, coat them with buffalo wing sauce or blue cheese dip.",
    "Toss parboiled drumsticks on the grill for perfectly cooked chicken.",
    "Brush the grill grate and heat a gas or charcoal grill to medium-high heat.",
    "Place the parboiled chicken pieces on the preheated grill and cook the chicken for 20 to 40 minutes.",
    "Use tongs to turn the chicken frequently and brush the chicken with barbecue sauce during the last 15 minutes of cooking.Variation: If you don't like the flavor of barbecue sauce, rub the chicken with a dry spice rub instead or drizzle the grilled chicken with a fresh, herb sauce instead.",
    "Remember to insert an instant-read meat thermometer into the thickest part of the chicken.",
    "The temperature should reach 165 °F (74 °C) before you pull the grilled chicken off of the grill.",
    "While this works well with drumsticks, you can use any cut of chicken.",
    "Keep in mind that larger pieces, such as breasts, will take longer to grill while smaller pieces, such as wings will cook faster.",
    "Bread or batter the parboiled chicken and deep fry it until it's crispy.",
    "Dip the parboiled chicken pieces in beaten egg and then coat the pieces with a batter of your choice.",
    "For example, use a crunchy breadcrumb coating or a beer batter.",
    "Then fry the chicken pieces in 2 inches (5.1 cm) of 350 °F (177 °C) oil until they're crunchy and cooked throughout.",
    "Use tongs to carefully turn the pieces as they fry.",
    "Depending on the size of your chicken pieces, it may take 10 to 20 minutes to fry them in hot oil.",
    "Add parboiled chicken pieces to your favorite clear soup.",
    "To make classic or Vietnamese chicken noodle soup, parboil chicken and set it aside while you heat fresh stock in the pot.",
    "Simmer your choice of chopped vegetables, such as carrots or celery, and return the whole chicken pieces to the pot.",
    "Cook the soup over medium heat until the chicken is cooked throughout.",
    "If you prefer, shred the cooked chicken and return it to the soup before serving.",
    "To give your soup a fresh taste, add chopped basil or parsley just before serving the soup."
  ],
  "tyn_section":[
    "Stockpot",
    "Tongs",
    "Plate",
    "Paper towels"
  ],
  "tyn_model":[
    "chicken",
    "stockpot",
    "grill",
    "burner",
    "salt",
    "carrots",
    "celery",
    "barbecue sauce",
    "pot",
    "stove",
    "chickens",
    "water",
    "chicken broth",
    "apple cider",
    "vegetable stock",
    "lemon",
    "garlic",
    "chicken wings",
    "chicken breasts",
    "plate",
    "paper towels",
    "baking sheet",
    "oven",
    "buffalo wing",
    "blue cheese dip",
    "grill grate",
    "gas or charcoal",
    "meat thermometer",
    "drumsticks",
    "beaten egg",
    "350 °f (",
    "oil",
    "hot oil",
    "chicken noodle soup",
    "stock",
    "basil",
    "parsley"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.0810810811,
    "f1":0.1463414634,
    "avg_pos":0.027027027
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.0810810811,
    "f1":0.1463414634
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.0810810811,
    "f1":0.1463414634
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.0810810811,
    "f1":0.1463414634
  }
}