{
  "title":"How to Trim a Sago Palm",
  "url":"https://www.wikihow.com/Trim-a-Sago-Palm",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "parts":[
    {
      "name":"Pruning the Fronds",
      "steps":[
        {
          "headline":"Trim sago palms annually in autumn.",
          "description":"This is the end of the growing season for sago palms so it is the best time to prune them since they won't be producing new growth. You will be less likely to accidentally weaken the sago palm by cutting healthy new fronds. Cutting off healthy fronds can weaken the sago palm and make it more exposed to diseases and pests."
        },
        {
          "headline":"Trim frost-damaged sago palms at the beginning of spring.",
          "description":"Sago palms can survive cold winters, but often experience frost damage as a result. Wait until spring, when there will be no more frosts, to prune away frost-damaged foliage. This will help to prepare the sago palms for healthy new growth in spring."
        },
        {
          "headline":"Put on gloves and long sleeves to protect your skin during trimming.",
          "description":"Put on a pair of gardening gloves before you start pruning to protect your hands from the spiky spines. Use a long-sleeved shirt to protect the skin on your arms. The sago palm is toxic to humans and animals when ingested. Keep pets and small children away from the trees."
        },
        {
          "headline":"Cut off all yellow and brown fronds right against the trunk of the sago.",
          "description":"Use gardening shears or clippers to cut off all the old and dying leaves, especially towards the base of the tree where they are oldest. Cut them off as close to and as flat against the trunk as you can. Only cut off dead or damaged fronds unless you absolutely need to cut off green fronds for ornamental purposes."
        },
        {
          "headline":"Remove all fronds from the trunk of the plant only for ornamental purposes.",
          "description":"Cut off all the fronds flat against the trunk if you want to expose the trunk and give it a “pineapple” look for decorative purposes. Don't ever cut off any healthy fronds between the 10 o'clock and 2 o'clock positions. Keep in mind that removing healthy fronds from the trunk can weaken your sago. This is only recommended for landscaping purposes when you absolutely want your sago to look a certain way."
        },
        {
          "headline":"Remove all the leaf litter and debris from around the tree when you are done.",
          "description":"Clear the area around the base of the sago palm to provide more air flow. Safely dispose of the debris in a yard waste bin or at a dump. Always use gardening gloves and long sleeves when you are disposing of the debris. The male plant can be allergenic."
        }
      ]
    },
    {
      "name":"Removing the Pups and Cones",
      "steps":[
        {
          "headline":"Dig up sago palm pups or pop them off the trunk with a hand trowel.",
          "description":"The pups are offsets growing around the base or along the sides of the sago palm. Dig around them and lift them out of the ground with a hand trowel, or use the edge of a trowel to pry them off the trunk of the tree to remove them. You can also use a knife to dig them up or pop them off the trunk if you don't have a hand trowel. You should remove pups in early spring or late fall, before and after the growing season. This can be done at the same time you do annual trimming or are pruning frost damage. Early spring is best if you plan on replanting them."
        },
        {
          "headline":"Remove foliage and dry out the pups if you want to transplant them.",
          "description":"Use garden clippers to cut off all the foliage of the pups. Lay them outside to dry for a week before you replant them. New sago palms should be planted in sandy well-drained soil during early spring."
        },
        {
          "headline":"Remove cones from the sago palms whenever they form.",
          "description":"Sago palms will divert energy to growing cones instead of foliage, so you need to remove the cones whenever you see them to help your sago palm keep growing fronds instead of cones. Slice the cone away as close to the trunk as you can with a knife. Not all sago palms will produce a cone, but both male and female sago palms can produce them. The female cones last much longer than the male cones, and will sap away growing energy from your sago palms for months."
        }
      ]
    }
  ],
  "text":" Pruning the Fronds Trim sago palms annually in autumn. This is the end of the growing season for sago palms so it is the best time to prune them since they won't be producing new growth. You will be less likely to accidentally weaken the sago palm by cutting healthy new fronds. Cutting off healthy fronds can weaken the sago palm and make it more exposed to diseases and pests. Trim frost-damaged sago palms at the beginning of spring. Sago palms can survive cold winters, but often experience frost damage as a result. Wait until spring, when there will be no more frosts, to prune away frost-damaged foliage. This will help to prepare the sago palms for healthy new growth in spring. Put on gloves and long sleeves to protect your skin during trimming. Put on a pair of gardening gloves before you start pruning to protect your hands from the spiky spines. Use a long-sleeved shirt to protect the skin on your arms. The sago palm is toxic to humans and animals when ingested. Keep pets and small children away from the trees. Cut off all yellow and brown fronds right against the trunk of the sago. Use gardening shears or clippers to cut off all the old and dying leaves, especially towards the base of the tree where they are oldest. Cut them off as close to and as flat against the trunk as you can. Only cut off dead or damaged fronds unless you absolutely need to cut off green fronds for ornamental purposes. Remove all fronds from the trunk of the plant only for ornamental purposes. Cut off all the fronds flat against the trunk if you want to expose the trunk and give it a “pineapple” look for decorative purposes. Don't ever cut off any healthy fronds between the 10 o'clock and 2 o'clock positions. Keep in mind that removing healthy fronds from the trunk can weaken your sago. This is only recommended for landscaping purposes when you absolutely want your sago to look a certain way. Remove all the leaf litter and debris from around the tree when you are done. Clear the area around the base of the sago palm to provide more air flow. Safely dispose of the debris in a yard waste bin or at a dump. Always use gardening gloves and long sleeves when you are disposing of the debris. The male plant can be allergenic. Removing the Pups and Cones Dig up sago palm pups or pop them off the trunk with a hand trowel. The pups are offsets growing around the base or along the sides of the sago palm. Dig around them and lift them out of the ground with a hand trowel, or use the edge of a trowel to pry them off the trunk of the tree to remove them. You can also use a knife to dig them up or pop them off the trunk if you don't have a hand trowel. You should remove pups in early spring or late fall, before and after the growing season. This can be done at the same time you do annual trimming or are pruning frost damage. Early spring is best if you plan on replanting them. Remove foliage and dry out the pups if you want to transplant them. Use garden clippers to cut off all the foliage of the pups. Lay them outside to dry for a week before you replant them. New sago palms should be planted in sandy well-drained soil during early spring. Remove cones from the sago palms whenever they form. Sago palms will divert energy to growing cones instead of foliage, so you need to remove the cones whenever you see them to help your sago palm keep growing fronds instead of cones. Slice the cone away as close to the trunk as you can with a knife. Not all sago palms will produce a cone, but both male and female sago palms can produce them. The female cones last much longer than the male cones, and will sap away growing energy from your sago palms for months.",
  "sentences":[
    " Pruning the Fronds Trim sago palms annually in autumn.",
    "This is the end of the growing season for sago palms so it is the best time to prune them since they won't be producing new growth.",
    "You will be less likely to accidentally weaken the sago palm by cutting healthy new fronds.",
    "Cutting off healthy fronds can weaken the sago palm and make it more exposed to diseases and pests.",
    "Trim frost-damaged sago palms at the beginning of spring.",
    "Sago palms can survive cold winters, but often experience frost damage as a result.",
    "Wait until spring, when there will be no more frosts, to prune away frost-damaged foliage.",
    "This will help to prepare the sago palms for healthy new growth in spring.",
    "Put on gloves and long sleeves to protect your skin during trimming.",
    "Put on a pair of gardening gloves before you start pruning to protect your hands from the spiky spines.",
    "Use a long-sleeved shirt to protect the skin on your arms.",
    "The sago palm is toxic to humans and animals when ingested.",
    "Keep pets and small children away from the trees.",
    "Cut off all yellow and brown fronds right against the trunk of the sago.",
    "Use gardening shears or clippers to cut off all the old and dying leaves, especially towards the base of the tree where they are oldest.",
    "Cut them off as close to and as flat against the trunk as you can.",
    "Only cut off dead or damaged fronds unless you absolutely need to cut off green fronds for ornamental purposes.",
    "Remove all fronds from the trunk of the plant only for ornamental purposes.",
    "Cut off all the fronds flat against the trunk if you want to expose the trunk and give it a “pineapple” look for decorative purposes.",
    "Don't ever cut off any healthy fronds between the 10 o'clock and 2 o'clock positions.",
    "Keep in mind that removing healthy fronds from the trunk can weaken your sago.",
    "This is only recommended for landscaping purposes when you absolutely want your sago to look a certain way.",
    "Remove all the leaf litter and debris from around the tree when you are done.",
    "Clear the area around the base of the sago palm to provide more air flow.",
    "Safely dispose of the debris in a yard waste bin or at a dump.",
    "Always use gardening gloves and long sleeves when you are disposing of the debris.",
    "The male plant can be allergenic.",
    "Removing the Pups and Cones Dig up sago palm pups or pop them off the trunk with a hand trowel.",
    "The pups are offsets growing around the base or along the sides of the sago palm.",
    "Dig around them and lift them out of the ground with a hand trowel, or use the edge of a trowel to pry them off the trunk of the tree to remove them.",
    "You can also use a knife to dig them up or pop them off the trunk if you don't have a hand trowel.",
    "You should remove pups in early spring or late fall, before and after the growing season.",
    "This can be done at the same time you do annual trimming or are pruning frost damage.",
    "Early spring is best if you plan on replanting them.",
    "Remove foliage and dry out the pups if you want to transplant them.",
    "Use garden clippers to cut off all the foliage of the pups.",
    "Lay them outside to dry for a week before you replant them.",
    "New sago palms should be planted in sandy well-drained soil during early spring.",
    "Remove cones from the sago palms whenever they form.",
    "Sago palms will divert energy to growing cones instead of foliage, so you need to remove the cones whenever you see them to help your sago palm keep growing fronds instead of cones.",
    "Slice the cone away as close to the trunk as you can with a knife.",
    "Not all sago palms will produce a cone, but both male and female sago palms can produce them.",
    "The female cones last much longer than the male cones, and will sap away growing energy from your sago palms for months."
  ],
  "tyn_section":[
    "Gardening gloves",
    "Long-sleeved shirt",
    "Gardening clippers or shears",
    "Knife",
    "Hand trowel"
  ],
  "tyn_model":[
    "trowel",
    "sago palms",
    "sago palm",
    "knife",
    "prune",
    "gloves",
    "sago",
    "gardening shears",
    "“pineapple",
    "” look",
    "gardening gloves",
    "garden clippers"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1666666667,
    "f1":0.2352941176,
    "avg_pos":0.8333333333
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.4166666667,
    "f1":0.5479452055
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.4166666667,
    "f1":0.5479452055
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1666666667,
    "f1":0.2352941176
  }
}