{
  "title":"How to Draw a Realistic Looking Horse",
  "url":"https://www.wikihow.com/Draw-a-Realistic-Looking-Horse",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"Drawing a Horse Using General Steps",
      "steps":[
        {
          "headline":"Find a picture of a horse.",
          "description":"This is optional, but it is very helpful to have a picture as a guide when drawing. It is also recommended to use the horse guild or book."
        },
        {
          "headline":"Be familiar with horse anatomy.",
          "description":"Get to know how the head, body, mane, tail, etc. of a horse look. Also learn about where the legs of a horse are positioned when they are moving. This will help to create a realistic horse, and is also helpful when you don't have a picture for a reference."
        },
        {
          "headline":"Use simple shapes to create the basic structure of the horse.",
          "description":"Start with a few ovals and circles for the body. Make the head by drawing a large oval or circle, then a small circle near it for the muzzle. Connect them with two lines to make a head shape. Then use two lines to connect the head and body. This will create the neck. For the legs, draw straight lines, with circles for the joints. Add a curved line for the tailbone. Note: If you need to, you can trace the basic outline from the picture instead. Later you can practice drawing the basic outline yourself."
        },
        {
          "headline":"Define the details of the horse.",
          "description":"Darken the curves of the body and head. 'Flesh' out the legs. This is also a good time to sketch in shapes for the mane and tail. make sure you don't darken the lines too much. If you do, it will be hard to fix if you make a mistake, and it will take out that 'realistic' look. Animals are soft, fleshy creatures, and don't have hard, stone carved lines."
        },
        {
          "headline":"Begin shading.",
          "description":"Lightly color in the horse. Don't worry about shadows, or markings. Smudging the shading helps to give the horse a soft, 'live' look. Make sure to erase the circles."
        },
        {
          "headline":"Darken shaded areas to give your work depth.",
          "description":"It's important to remember where your 'source of light' is coming from. make sure you don't darken the 'highlights' of the horse. Also, the darkness of your shading depends on what color your horse is. If you are drawing a light colored horse, use less shading on the overall horse. If you're drawing a dark colored horse, use more. Again, smudging helps to make it more realistic. Also, be sure to use the picture as a reference! This will really help with your shading!"
        },
        {
          "headline":"Add the mane and tail.",
          "description":"If they are white, you may not need to shade at all. Just add soft lines to show texture. If they are very dark (Such as black) Shade it to a very dark gray. Then add black lines to show texture."
        },
        {
          "headline":"Critique your work.",
          "description":"If something doesn't look right, fix it! That's what erasers are for. Also, it's a good idea to add your own personal touches here and there. You don't have to copy the picture exactly."
        },
        {
          "headline":"Touch up.",
          "description":"Erase any shading that got where it isn't supposed to be. Fix minor things. Add final touches to the shading."
        },
        {
          "headline":"Add background.",
          "description":"You don't have to add background if you are happy with your picture. If you are inexperienced with drawing, this may be challenging; but if you want to try, go for it!"
        },
        {
          "headline":"Sign the work.",
          "description":"Add your signature to your drawing."
        },
        {
          "headline":"Be proud of your finished drawing.",
          "description":"If you want, you can still do a little more 'touching up'. Drawings never really have to be 'finished' if you want to continue adding on to it."
        }
      ]
    },
    {
      "name":"Using a Guide for Proportions",
      "steps":[
        {
          "headline":"Gather all the necessary materials.",
          "description":"The materials you will need include paper, pencil, pencil sharpener and eraser gum. For coloring, you can chose from colored pencils, crayons, markers or watercolors. Use quality paper so your color will come out nicely."
        },
        {
          "headline":"Draw a square.",
          "description":"Divide it in three equal rectangles."
        },
        {
          "headline":"Sketch the head of the horse.",
          "description":"Draw circles and curve lines to shape it."
        },
        {
          "headline":"Draw two big circles and a small one in the middle of the rectangle.",
          "description":"Unite the big ones with curved lines. This will be the body."
        },
        {
          "headline":"Draw circles, squares, and rectangles in the lower rectangular sketch.",
          "description":"These will be the legs."
        },
        {
          "headline":"Choose a pose for your horse.",
          "description":"When the horse's pose is ready, continue with a mode detail drawing. Start with the head."
        },
        {
          "headline":"Add the lines for the horse's back.",
          "description":"Draw a curve and keep the line smooth."
        },
        {
          "headline":"Follow the line of the neck.",
          "description":"Next, draw the forelegs."
        },
        {
          "headline":"Draw in the back of the horse from where you left off.",
          "description":""
        },
        {
          "headline":"Add the tail and mane.",
          "description":"Use long, curved lines for the hair as you see in the image."
        },
        {
          "headline":"Refine the lines of the drawing.",
          "description":"Erase any extra lines."
        },
        {
          "headline":"Add color.",
          "description":""
        }
      ]
    }
  ],
  "text":" Drawing a Horse Using General Steps Find a picture of a horse. This is optional, but it is very helpful to have a picture as a guide when drawing. It is also recommended to use the horse guild or book. Be familiar with horse anatomy. Get to know how the head, body, mane, tail, etc. of a horse look. Also learn about where the legs of a horse are positioned when they are moving. This will help to create a realistic horse, and is also helpful when you don't have a picture for a reference. Use simple shapes to create the basic structure of the horse. Start with a few ovals and circles for the body. Make the head by drawing a large oval or circle, then a small circle near it for the muzzle. Connect them with two lines to make a head shape. Then use two lines to connect the head and body. This will create the neck. For the legs, draw straight lines, with circles for the joints. Add a curved line for the tailbone. Note: If you need to, you can trace the basic outline from the picture instead. Later you can practice drawing the basic outline yourself. Define the details of the horse. Darken the curves of the body and head. 'Flesh' out the legs. This is also a good time to sketch in shapes for the mane and tail. make sure you don't darken the lines too much. If you do, it will be hard to fix if you make a mistake, and it will take out that 'realistic' look. Animals are soft, fleshy creatures, and don't have hard, stone carved lines. Begin shading. Lightly color in the horse. Don't worry about shadows, or markings. Smudging the shading helps to give the horse a soft, 'live' look. Make sure to erase the circles. Darken shaded areas to give your work depth. It's important to remember where your 'source of light' is coming from. make sure you don't darken the 'highlights' of the horse. Also, the darkness of your shading depends on what color your horse is. If you are drawing a light colored horse, use less shading on the overall horse. If you're drawing a dark colored horse, use more. Again, smudging helps to make it more realistic. Also, be sure to use the picture as a reference! This will really help with your shading! Add the mane and tail. If they are white, you may not need to shade at all. Just add soft lines to show texture. If they are very dark (Such as black) Shade it to a very dark gray. Then add black lines to show texture. Critique your work. If something doesn't look right, fix it! That's what erasers are for. Also, it's a good idea to add your own personal touches here and there. You don't have to copy the picture exactly. Touch up. Erase any shading that got where it isn't supposed to be. Fix minor things. Add final touches to the shading. Add background. You don't have to add background if you are happy with your picture. If you are inexperienced with drawing, this may be challenging; but if you want to try, go for it! Sign the work. Add your signature to your drawing. Be proud of your finished drawing. If you want, you can still do a little more 'touching up'. Drawings never really have to be 'finished' if you want to continue adding on to it. Using a Guide for Proportions Gather all the necessary materials. The materials you will need include paper, pencil, pencil sharpener and eraser gum. For coloring, you can chose from colored pencils, crayons, markers or watercolors. Use quality paper so your color will come out nicely. Draw a square. Divide it in three equal rectangles. Sketch the head of the horse. Draw circles and curve lines to shape it. Draw two big circles and a small one in the middle of the rectangle. Unite the big ones with curved lines. This will be the body. Draw circles, squares, and rectangles in the lower rectangular sketch. These will be the legs. Choose a pose for your horse. When the horse's pose is ready, continue with a mode detail drawing. Start with the head. Add the lines for the horse's back. Draw a curve and keep the line smooth. Follow the line of the neck. Next, draw the forelegs. Draw in the back of the horse from where you left off.  Add the tail and mane. Use long, curved lines for the hair as you see in the image. Refine the lines of the drawing. Erase any extra lines. Add color. ",
  "sentences":[
    " Drawing a Horse Using General Steps Find a picture of a horse.",
    "This is optional, but it is very helpful to have a picture as a guide when drawing.",
    "It is also recommended to use the horse guild or book.",
    "Be familiar with horse anatomy.",
    "Get to know how the head, body, mane, tail, etc.",
    "of a horse look.",
    "Also learn about where the legs of a horse are positioned when they are moving.",
    "This will help to create a realistic horse, and is also helpful when you don't have a picture for a reference.",
    "Use simple shapes to create the basic structure of the horse.",
    "Start with a few ovals and circles for the body.",
    "Make the head by drawing a large oval or circle, then a small circle near it for the muzzle.",
    "Connect them with two lines to make a head shape.",
    "Then use two lines to connect the head and body.",
    "This will create the neck.",
    "For the legs, draw straight lines, with circles for the joints.",
    "Add a curved line for the tailbone.",
    "Note: If you need to, you can trace the basic outline from the picture instead.",
    "Later you can practice drawing the basic outline yourself.",
    "Define the details of the horse.",
    "Darken the curves of the body and head.",
    "'Flesh' out the legs.",
    "This is also a good time to sketch in shapes for the mane and tail.",
    "make sure you don't darken the lines too much.",
    "If you do, it will be hard to fix if you make a mistake, and it will take out that 'realistic' look.",
    "Animals are soft, fleshy creatures, and don't have hard, stone carved lines.",
    "Begin shading.",
    "Lightly color in the horse.",
    "Don't worry about shadows, or markings.",
    "Smudging the shading helps to give the horse a soft, 'live' look.",
    "Make sure to erase the circles.",
    "Darken shaded areas to give your work depth.",
    "It's important to remember where your 'source of light' is coming from.",
    "make sure you don't darken the 'highlights' of the horse.",
    "Also, the darkness of your shading depends on what color your horse is.",
    "If you are drawing a light colored horse, use less shading on the overall horse.",
    "If you're drawing a dark colored horse, use more.",
    "Again, smudging helps to make it more realistic.",
    "Also, be sure to use the picture as a reference!",
    "This will really help with your shading!",
    "Add the mane and tail.",
    "If they are white, you may not need to shade at all.",
    "Just add soft lines to show texture.",
    "If they are very dark (Such as black) Shade it to a very dark gray.",
    "Then add black lines to show texture.",
    "Critique your work.",
    "If something doesn't look right, fix it!",
    "That's what erasers are for.",
    "Also, it's a good idea to add your own personal touches here and there.",
    "You don't have to copy the picture exactly.",
    "Touch up.",
    "Erase any shading that got where it isn't supposed to be.",
    "Fix minor things.",
    "Add final touches to the shading.",
    "Add background.",
    "You don't have to add background if you are happy with your picture.",
    "If you are inexperienced with drawing, this may be challenging; but if you want to try, go for it!",
    "Sign the work.",
    "Add your signature to your drawing.",
    "Be proud of your finished drawing.",
    "If you want, you can still do a little more 'touching up'.",
    "Drawings never really have to be 'finished' if you want to continue adding on to it.",
    "Using a Guide for Proportions Gather all the necessary materials.",
    "The materials you will need include paper, pencil, pencil sharpener and eraser gum.",
    "For coloring, you can chose from colored pencils, crayons, markers or watercolors.",
    "Use quality paper so your color will come out nicely.",
    "Draw a square.",
    "Divide it in three equal rectangles.",
    "Sketch the head of the horse.",
    "Draw circles and curve lines to shape it.",
    "Draw two big circles and a small one in the middle of the rectangle.",
    "Unite the big ones with curved lines.",
    "This will be the body.",
    "Draw circles, squares, and rectangles in the lower rectangular sketch.",
    "These will be the legs.",
    "Choose a pose for your horse.",
    "When the horse's pose is ready, continue with a mode detail drawing.",
    "Start with the head.",
    "Add the lines for the horse's back.",
    "Draw a curve and keep the line smooth.",
    "Follow the line of the neck.",
    "Next, draw the forelegs.",
    "Draw in the back of the horse from where you left off.",
    "Add the tail and mane.",
    "Use long, curved lines for the hair as you see in the image.",
    "Refine the lines of the drawing.",
    "Erase any extra lines.",
    "Add color."
  ],
  "tyn_section":[
    "A pencil",
    "Drawing Paper",
    "An eraser",
    "A picture of a horse"
  ],
  "tyn_model":[
    "horse",
    "paper",
    "horse guild",
    "book",
    "animals",
    "smudging",
    "erasers",
    "pencil",
    "pencil sharpener",
    "eraser gum",
    "colored pencils",
    "crayons",
    "markers",
    "watercolors",
    "color"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1333333333,
    "f1":0.2105263158
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2666666667,
    "f1":0.393442623
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}