{
  "title":"How to Adjust Sliding Glass Door Rollers",
  "url":"https://www.wikihow.com/Adjust-Sliding-Glass-Door-Rollers",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Door Types",
    "Sliding Doors"
  ],
  "methods":[
    {
      "name":"Changing the Position of the Rollers",
      "steps":[
        {
          "headline":"Locate the adjustment screws on the lower edges of the door.",
          "description":"Most sliding glass doors contain two sets of rollers, one on each side of the bottom of the door. You can alter the height of these rollers by accessing the adjustment screws, which are set into slots on the door's outer edges, perpendicular with the rollers themselves. If you don't see the adjustment screw slots at first glance, look more closely—it can be easy to miss the adjustment screws if they're hidden with plugs of the same color. Some larger sliding glass doors may have rollers on both the top and bottom edges.Tip: The plugs covering adjustment screw slots can typically be pried off using a fingernail or the tip of a screwdriver."
        },
        {
          "headline":"Use a screwdriver to turn the screws and move the rollers up or down.",
          "description":"On most models, rotating the screws to the left (counterclockwise) will raise them, while rotating them to the right (clockwise) will lower them. The idea is to get them sitting perfectly flush with the track. This may involve a little bit of trial-and-error. Take a peek inside the slots at the screws to see whether you need a flat head or Phillips head screwdriver. You may only need to adjust one of the screws to get your door back on track, or you might have to tinker with both sets if the rollers are severely out of alignment."
        },
        {
          "headline":"Continue adjusting the rollers until the door glides smoothly.",
          "description":"It may take a few attempts before you get the door rolling without resistance. By the time you're finished, the door should be sitting perfectly level on the track, and there should be an equal amount of space between the door and the track on both the top and bottom. If you're not sure whether the door is straight, pull it slightly ajar and check the reveal, or the area where the inner edge meets the door jamb. It may be easier to spot alignment issues that way than by looking at the frame. Remember to replace the plugs that cover the adjustment screw slots if your door has them."
        }
      ]
    },
    {
      "name":"Cleaning the Rollers",
      "steps":[
        {
          "headline":"Retract the adjustment screws fully to remove the door from its track.",
          "description":"Locate the adjustment screw slots on the lower side edges of the door and use a screwdriver to turn the screws to the left (counterclockwise) as far as they'll go. This will lower the rollers completely. Take hold of either side of the door and carefully guide the upper edge out of the top track before lifting the lower edge out of the bottom track. If your sliding glass door features a door stop at the top of the frame, you may need to unscrew it before you can remove the door from the track.Tip: Sliding glass doors are often very heavy—too heavy for one person to handle on their own. Have someone else help you remove the door and haul it over to your work surface."
        },
        {
          "headline":"Place the door on a flat, stable surface.",
          "description":"Once you've removed your door, carry it over to a countertop, workbench, crafting table, or pair of sawhorses. Being able to set the door down will allow you to work on the rollers obstructed without worrying about the door falling over or becoming damaged accidentally. If you don't have anywhere else to work on your door, you can also stretch a dropcloth out on the ground and set the door down carefully on top."
        },
        {
          "headline":"Pry out the roller units with your screwdriver.",
          "description":"Turn the adjustment screws all the way to the right (clockwise) to fully extend the rollers. Then, wedge the tip of the screwdriver into the space between the first set of rollers and the doorframe and lift the handle gently to coax the entire construction out. Repeat the process with the rollers on the opposite side of the door. If it's not possible to remove your door's rollers with a screwdriver, you'll need to shift the side panels of the door upward enough to slide the rollers clear of the track. You can do this by tapping them with a rubber mallet. Keep the extracted roller units together the entire time they're out of the doorframe, and be careful not to drop them, or they could break."
        },
        {
          "headline":"Wipe the rollers clean using rubbing alcohol.",
          "description":"Soak a cotton ball or the corner of a rag in the alcohol and use it to polish the removed rollers. Focus on areas that show signs of heavy grime or discoloration. Re-wet your cleaning pad with fresh alcohol before turning your attention to the second set of rollers. If you need something a little stronger to cut through stubborn buildup, try using denatured alcohol instead. Denatured alcohol is especially useful for dissolving grease and sticky substances from metal. There's no need to dry the clean rollers manually, as the alcohol will quickly evaporate on its own."
        },
        {
          "headline":"Force the roller units back into the channel on the underside of the door.",
          "description":"Line up the top of each unit with the opening and press straight up on them firmly to snap them back into place. Once they're secure, turn the adjustment screws on the lower edges of the door all the way counterclockwise to put them back in their fully retracted position and prepare the door for reinstallation. If you're having trouble getting the rollers to go back in, tap them gently with a mallet and wooden block. Don't forget to tap the door panels back into their original position if you had to shift them up in order to remove your rollers."
        },
        {
          "headline":"Guide the door back into its track, starting at the top.",
          "description":"Align the upper edge of the door with the inside of the top track and “walk” the lower edge forward until it rests up against the bottom track. Lift up on the door and shift the lower edge into the bottom track, then set it down delicately. Don't let go of the door until you've confirmed that it's seated squarely inside both tracks. After mounting your door, open and close it a few times to test it out. If dirty rollers were the issue, it should glide smoothly without resistance or sticking."
        }
      ]
    },
    {
      "name":"Maintaining the Track",
      "steps":[
        {
          "headline":"Scrub the entire track with a wire brush.",
          "description":"Slide both doors to one end of the track to leave the opposite half exposed. Run your wire brush along the inside of the track, making sure to work the bristles deep into every crack, crevice, and contour. When you're done cleaning the first half of the track, pull both doors over to the other end and go over the second half. For extra cleaning power, dip your brush in a mild soapy water solution before you begin scrubbing. You may need to use a little elbow grease to whisk away long-standing dirt and grime, especially on doors that open to the outside. It will be much easier to clean your sliding glass door's track if you've already removed the door to clean the rollers."
        },
        {
          "headline":"Vacuum or wipe up the loose debris.",
          "description":"Once you've successfully dislodged all of the dirt clogging up the track, grab a shop vacuum and suction it up to get rid of the mess. If you don't have a vacuum handy, wet a clean cloth and wring out the excess water so that it's just slightly damp, then use it to pick up the debris by hand. Portable hand vacuums are also perfectly suited for this task. Get in the habit of vacuuming your sliding glass door track regularly between more intensive cleanings. In fact, with frequent vacuuming, more intensive cleanings may not even be necessary."
        },
        {
          "headline":"Lubricate the track with a dirt-repelling silicone spray.",
          "description":"Position the nozzle of the spray can 3–4 inches (7.6–10.2 cm) away from the track and move it slowly from one end to the other while holding down the spray button. Coat the track with a thin, even layer of lubricant, then clean up any excess lubricant that's found its way onto the surrounding floor with a folded paper towel. You can pick up a can of silicone lubricant at any hardware store or home improvement center for just a few dollars. Another less messy option is to rub the length of the track with a block of paraffin wax.Warning: It's important to only clean your sliding glass door's track with a silicone-based spray or paraffin wax. Ordinary lubricants like WD-40 can actually attract dust and dirt and gum up your tracks faster than normal."
        }
      ]
    }
  ],
  "text":" Changing the Position of the Rollers Locate the adjustment screws on the lower edges of the door. Most sliding glass doors contain two sets of rollers, one on each side of the bottom of the door. You can alter the height of these rollers by accessing the adjustment screws, which are set into slots on the door's outer edges, perpendicular with the rollers themselves. If you don't see the adjustment screw slots at first glance, look more closely—it can be easy to miss the adjustment screws if they're hidden with plugs of the same color. Some larger sliding glass doors may have rollers on both the top and bottom edges.Tip: The plugs covering adjustment screw slots can typically be pried off using a fingernail or the tip of a screwdriver. Use a screwdriver to turn the screws and move the rollers up or down. On most models, rotating the screws to the left (counterclockwise) will raise them, while rotating them to the right (clockwise) will lower them. The idea is to get them sitting perfectly flush with the track. This may involve a little bit of trial-and-error. Take a peek inside the slots at the screws to see whether you need a flat head or Phillips head screwdriver. You may only need to adjust one of the screws to get your door back on track, or you might have to tinker with both sets if the rollers are severely out of alignment. Continue adjusting the rollers until the door glides smoothly. It may take a few attempts before you get the door rolling without resistance. By the time you're finished, the door should be sitting perfectly level on the track, and there should be an equal amount of space between the door and the track on both the top and bottom. If you're not sure whether the door is straight, pull it slightly ajar and check the reveal, or the area where the inner edge meets the door jamb. It may be easier to spot alignment issues that way than by looking at the frame. Remember to replace the plugs that cover the adjustment screw slots if your door has them. Cleaning the Rollers Retract the adjustment screws fully to remove the door from its track. Locate the adjustment screw slots on the lower side edges of the door and use a screwdriver to turn the screws to the left (counterclockwise) as far as they'll go. This will lower the rollers completely. Take hold of either side of the door and carefully guide the upper edge out of the top track before lifting the lower edge out of the bottom track. If your sliding glass door features a door stop at the top of the frame, you may need to unscrew it before you can remove the door from the track.Tip: Sliding glass doors are often very heavy—too heavy for one person to handle on their own. Have someone else help you remove the door and haul it over to your work surface. Place the door on a flat, stable surface. Once you've removed your door, carry it over to a countertop, workbench, crafting table, or pair of sawhorses. Being able to set the door down will allow you to work on the rollers obstructed without worrying about the door falling over or becoming damaged accidentally. If you don't have anywhere else to work on your door, you can also stretch a dropcloth out on the ground and set the door down carefully on top. Pry out the roller units with your screwdriver. Turn the adjustment screws all the way to the right (clockwise) to fully extend the rollers. Then, wedge the tip of the screwdriver into the space between the first set of rollers and the doorframe and lift the handle gently to coax the entire construction out. Repeat the process with the rollers on the opposite side of the door. If it's not possible to remove your door's rollers with a screwdriver, you'll need to shift the side panels of the door upward enough to slide the rollers clear of the track. You can do this by tapping them with a rubber mallet. Keep the extracted roller units together the entire time they're out of the doorframe, and be careful not to drop them, or they could break. Wipe the rollers clean using rubbing alcohol. Soak a cotton ball or the corner of a rag in the alcohol and use it to polish the removed rollers. Focus on areas that show signs of heavy grime or discoloration. Re-wet your cleaning pad with fresh alcohol before turning your attention to the second set of rollers. If you need something a little stronger to cut through stubborn buildup, try using denatured alcohol instead. Denatured alcohol is especially useful for dissolving grease and sticky substances from metal. There's no need to dry the clean rollers manually, as the alcohol will quickly evaporate on its own. Force the roller units back into the channel on the underside of the door. Line up the top of each unit with the opening and press straight up on them firmly to snap them back into place. Once they're secure, turn the adjustment screws on the lower edges of the door all the way counterclockwise to put them back in their fully retracted position and prepare the door for reinstallation. If you're having trouble getting the rollers to go back in, tap them gently with a mallet and wooden block. Don't forget to tap the door panels back into their original position if you had to shift them up in order to remove your rollers. Guide the door back into its track, starting at the top. Align the upper edge of the door with the inside of the top track and “walk” the lower edge forward until it rests up against the bottom track. Lift up on the door and shift the lower edge into the bottom track, then set it down delicately. Don't let go of the door until you've confirmed that it's seated squarely inside both tracks. After mounting your door, open and close it a few times to test it out. If dirty rollers were the issue, it should glide smoothly without resistance or sticking. Maintaining the Track Scrub the entire track with a wire brush. Slide both doors to one end of the track to leave the opposite half exposed. Run your wire brush along the inside of the track, making sure to work the bristles deep into every crack, crevice, and contour. When you're done cleaning the first half of the track, pull both doors over to the other end and go over the second half. For extra cleaning power, dip your brush in a mild soapy water solution before you begin scrubbing. You may need to use a little elbow grease to whisk away long-standing dirt and grime, especially on doors that open to the outside. It will be much easier to clean your sliding glass door's track if you've already removed the door to clean the rollers. Vacuum or wipe up the loose debris. Once you've successfully dislodged all of the dirt clogging up the track, grab a shop vacuum and suction it up to get rid of the mess. If you don't have a vacuum handy, wet a clean cloth and wring out the excess water so that it's just slightly damp, then use it to pick up the debris by hand. Portable hand vacuums are also perfectly suited for this task. Get in the habit of vacuuming your sliding glass door track regularly between more intensive cleanings. In fact, with frequent vacuuming, more intensive cleanings may not even be necessary. Lubricate the track with a dirt-repelling silicone spray. Position the nozzle of the spray can 3–4 inches (7.6–10.2 cm) away from the track and move it slowly from one end to the other while holding down the spray button. Coat the track with a thin, even layer of lubricant, then clean up any excess lubricant that's found its way onto the surrounding floor with a folded paper towel. You can pick up a can of silicone lubricant at any hardware store or home improvement center for just a few dollars. Another less messy option is to rub the length of the track with a block of paraffin wax.Warning: It's important to only clean your sliding glass door's track with a silicone-based spray or paraffin wax. Ordinary lubricants like WD-40 can actually attract dust and dirt and gum up your tracks faster than normal.",
  "sentences":[
    " Changing the Position of the Rollers Locate the adjustment screws on the lower edges of the door.",
    "Most sliding glass doors contain two sets of rollers, one on each side of the bottom of the door.",
    "You can alter the height of these rollers by accessing the adjustment screws, which are set into slots on the door's outer edges, perpendicular with the rollers themselves.",
    "If you don't see the adjustment screw slots at first glance, look more closely—it can be easy to miss the adjustment screws if they're hidden with plugs of the same color.",
    "Some larger sliding glass doors may have rollers on both the top and bottom edges.Tip: The plugs covering adjustment screw slots can typically be pried off using a fingernail or the tip of a screwdriver.",
    "Use a screwdriver to turn the screws and move the rollers up or down.",
    "On most models, rotating the screws to the left (counterclockwise) will raise them, while rotating them to the right (clockwise) will lower them.",
    "The idea is to get them sitting perfectly flush with the track.",
    "This may involve a little bit of trial-and-error.",
    "Take a peek inside the slots at the screws to see whether you need a flat head or Phillips head screwdriver.",
    "You may only need to adjust one of the screws to get your door back on track, or you might have to tinker with both sets if the rollers are severely out of alignment.",
    "Continue adjusting the rollers until the door glides smoothly.",
    "It may take a few attempts before you get the door rolling without resistance.",
    "By the time you're finished, the door should be sitting perfectly level on the track, and there should be an equal amount of space between the door and the track on both the top and bottom.",
    "If you're not sure whether the door is straight, pull it slightly ajar and check the reveal, or the area where the inner edge meets the door jamb.",
    "It may be easier to spot alignment issues that way than by looking at the frame.",
    "Remember to replace the plugs that cover the adjustment screw slots if your door has them.",
    "Cleaning the Rollers Retract the adjustment screws fully to remove the door from its track.",
    "Locate the adjustment screw slots on the lower side edges of the door and use a screwdriver to turn the screws to the left (counterclockwise) as far as they'll go.",
    "This will lower the rollers completely.",
    "Take hold of either side of the door and carefully guide the upper edge out of the top track before lifting the lower edge out of the bottom track.",
    "If your sliding glass door features a door stop at the top of the frame, you may need to unscrew it before you can remove the door from the track.Tip: Sliding glass doors are often very heavy—too heavy for one person to handle on their own.",
    "Have someone else help you remove the door and haul it over to your work surface.",
    "Place the door on a flat, stable surface.",
    "Once you've removed your door, carry it over to a countertop, workbench, crafting table, or pair of sawhorses.",
    "Being able to set the door down will allow you to work on the rollers obstructed without worrying about the door falling over or becoming damaged accidentally.",
    "If you don't have anywhere else to work on your door, you can also stretch a dropcloth out on the ground and set the door down carefully on top.",
    "Pry out the roller units with your screwdriver.",
    "Turn the adjustment screws all the way to the right (clockwise) to fully extend the rollers.",
    "Then, wedge the tip of the screwdriver into the space between the first set of rollers and the doorframe and lift the handle gently to coax the entire construction out.",
    "Repeat the process with the rollers on the opposite side of the door.",
    "If it's not possible to remove your door's rollers with a screwdriver, you'll need to shift the side panels of the door upward enough to slide the rollers clear of the track.",
    "You can do this by tapping them with a rubber mallet.",
    "Keep the extracted roller units together the entire time they're out of the doorframe, and be careful not to drop them, or they could break.",
    "Wipe the rollers clean using rubbing alcohol.",
    "Soak a cotton ball or the corner of a rag in the alcohol and use it to polish the removed rollers.",
    "Focus on areas that show signs of heavy grime or discoloration.",
    "Re-wet your cleaning pad with fresh alcohol before turning your attention to the second set of rollers.",
    "If you need something a little stronger to cut through stubborn buildup, try using denatured alcohol instead.",
    "Denatured alcohol is especially useful for dissolving grease and sticky substances from metal.",
    "There's no need to dry the clean rollers manually, as the alcohol will quickly evaporate on its own.",
    "Force the roller units back into the channel on the underside of the door.",
    "Line up the top of each unit with the opening and press straight up on them firmly to snap them back into place.",
    "Once they're secure, turn the adjustment screws on the lower edges of the door all the way counterclockwise to put them back in their fully retracted position and prepare the door for reinstallation.",
    "If you're having trouble getting the rollers to go back in, tap them gently with a mallet and wooden block.",
    "Don't forget to tap the door panels back into their original position if you had to shift them up in order to remove your rollers.",
    "Guide the door back into its track, starting at the top.",
    "Align the upper edge of the door with the inside of the top track and “walk” the lower edge forward until it rests up against the bottom track.",
    "Lift up on the door and shift the lower edge into the bottom track, then set it down delicately.",
    "Don't let go of the door until you've confirmed that it's seated squarely inside both tracks.",
    "After mounting your door, open and close it a few times to test it out.",
    "If dirty rollers were the issue, it should glide smoothly without resistance or sticking.",
    "Maintaining the Track Scrub the entire track with a wire brush.",
    "Slide both doors to one end of the track to leave the opposite half exposed.",
    "Run your wire brush along the inside of the track, making sure to work the bristles deep into every crack, crevice, and contour.",
    "When you're done cleaning the first half of the track, pull both doors over to the other end and go over the second half.",
    "For extra cleaning power, dip your brush in a mild soapy water solution before you begin scrubbing.",
    "You may need to use a little elbow grease to whisk away long-standing dirt and grime, especially on doors that open to the outside.",
    "It will be much easier to clean your sliding glass door's track if you've already removed the door to clean the rollers.",
    "Vacuum or wipe up the loose debris.",
    "Once you've successfully dislodged all of the dirt clogging up the track, grab a shop vacuum and suction it up to get rid of the mess.",
    "If you don't have a vacuum handy, wet a clean cloth and wring out the excess water so that it's just slightly damp, then use it to pick up the debris by hand.",
    "Portable hand vacuums are also perfectly suited for this task.",
    "Get in the habit of vacuuming your sliding glass door track regularly between more intensive cleanings.",
    "In fact, with frequent vacuuming, more intensive cleanings may not even be necessary.",
    "Lubricate the track with a dirt-repelling silicone spray.",
    "Position the nozzle of the spray can 3–4 inches (7.6–10.2 cm) away from the track and move it slowly from one end to the other while holding down the spray button.",
    "Coat the track with a thin, even layer of lubricant, then clean up any excess lubricant that's found its way onto the surrounding floor with a folded paper towel.",
    "You can pick up a can of silicone lubricant at any hardware store or home improvement center for just a few dollars.",
    "Another less messy option is to rub the length of the track with a block of paraffin wax.Warning: It's important to only clean your sliding glass door's track with a silicone-based spray or paraffin wax.",
    "Ordinary lubricants like WD-40 can actually attract dust and dirt and gum up your tracks faster than normal."
  ],
  "tyn_section":[
    "Flat or Phillips head screwdriver",
    "Flat, stable work surface",
    "Cotton ball or old rag",
    "Rubbing alcohol or denatured alcohol",
    "Rubber mallet (optional)",
    "Wooden block (optional)",
    "Dropcloth (optional)",
    "Wire brush",
    "Shop vacuum or damp cloth",
    "Silicone-based lubricant spray",
    "Paper towels",
    "Mild soap solution (optional)",
    "Paraffin wax block (optional)"
  ],
  "tyn_model":[
    "screwdriver",
    "alcohol",
    "sliding glass doors",
    "adjustment screw",
    "sliding glass door",
    "roller",
    "adjustment screws",
    "wire brush",
    "vacuum",
    "paraffin wax",
    "—it",
    "screws",
    "phillips head screwdriver",
    "—too",
    "sawhorses",
    "dropcloth",
    "rubber mallet",
    "rubbing alcohol",
    "cotton ball",
    "cleaning pad",
    "mallet",
    "wooden block",
    "“walk",
    "” the",
    "mild soapy water",
    "water",
    "vacuums",
    "vacuuming",
    "silicone spray",
    "paper towel",
    "silicone lubricant",
    "silicone-based spray"
  ],
  "simple_metrics":{
    "r":0.0769230769,
    "p":0.03125,
    "f1":0.0444444444,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6153846154,
    "p":0.25,
    "f1":0.3555555556
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7692307692,
    "p":0.34375,
    "f1":0.475161987
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3076923077,
    "p":0.125,
    "f1":0.1777777778
  }
}