{
  "title":"How to Adjust Kitchen Cabinet Doors",
  "url":"https://www.wikihow.com/Adjust-Kitchen-Cabinet-Doors",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Cabinets and Cupboards"
  ],
  "methods":[
    {
      "name":"Tightening Loose Cabinet Doors",
      "steps":[
        {
          "headline":"Open the cabinet doors and locate the hinge screws on the inside.",
          "description":"The cabinet doors will have 2 vertical fixed door screws that attach each hinge to each door. There are 2 vertical adjustable cupboard screws and 2 horizontal screws on the inside of the cupboard for each hinge. The leftmost screw is the adjusting screw, and the screw on the right is the locking screw. If your cupboard doors are loose, don’t assume you need to replace the hinges. Oftentimes, all you need to do is tighten or adjust the various screws to tighten the doors again."
        },
        {
          "headline":"Tighten the locking screw all the way if it is loose.",
          "description":"The horizontal screw furthest to the right on the hinges inside the cupboard is the locking screw. Use a screwdriver to screw it clockwise as far as it will go to tighten it and check if the cabinet doors are still loose. If the door is tight at this point, then you don’t need to do anything else. If it is still loose, then proceed with tightening the rest of the screws."
        },
        {
          "headline":"Tighten the fixed door screws and adjustable cupboard screws next.",
          "description":"Screw all the vertical screws as tight as they will go if the cupboard door is still loose after tightening the locking screw. The only screw you will not have touched at this point is the leftmost horizontal screw on the inside of the cupboard (this screw is only used for adjusting the doors side-to-side). After tightening all of these screws, your cabinet doors will be tight again, but they might be slightly misaligned. Proceed to make adjustments to align them properly."
        }
      ]
    },
    {
      "name":"Adjusting Misaligned Doors",
      "steps":[
        {
          "headline":"Open the cabinet door and locate the screws used for aligning the door.",
          "description":"Cabinet door hinges have 2 vertical fixed door screws that attach the hinge to the door and 2 vertical adjustable cupboard screws that attach the hinges to the cupboard. Each hinge has a horizontal adjusting screw (closest to the front of the cupboard) and a horizontal locking screw (closest to the back of the cupboard). You will be using all of the screws for adjustments except for the screws that hold the hinges to the doors. In other words, you will only be adjusting the screws that hold the hinges to the inside of the cupboard."
        },
        {
          "headline":"Use the horizontal adjusting screw to adjust a door side to side.",
          "description":"Turn the adjusting screws clockwise with a screwdriver in each set of hinges to move the door closer to the edge of the cabinet. Turn them counterclockwise to move the door further away from the edge of the cabinet. You might have to slightly unscrew the locking screw to use the adjusting screw. Make sure to tighten it completely after you align the door."
        },
        {
          "headline":"Adjust a door up or down with the vertical adjustable cupboard screws.",
          "description":"Loosen both of the adjustable cupboard screws in each set of hinges until you can move the door up and down. Align the door vertically how you want it and tighten the screws again. These screws are usually in slotted holes that make it easy to slide the door up and down to adjust it without having to remove the screws completely."
        },
        {
          "headline":"Adjust the angle of a door by turning 1 of the adjustable cupboard screws.",
          "description":"Use the adjusting screw on just 1 set of hinges to correct the angle of a crooked cabinet door. Turn 1 screw in 1 direction and the other in the other direction to make large adjustments. For example, if there is more space between the cabinet door and the edge of the cabinet at the top of the door, then turn the adjusting screw in the top hinge clockwise to move the door closer to the edge of the cabinet at the top."
        },
        {
          "headline":"Close the cabinet doors to check the alignment.",
          "description":"The cabinet doors will be symmetrical and close properly if you made the correct adjustments. Note any misalignment that is still occurring, open the cabinet doors back up, and make adjustments with the necessary screws. Try making 1 minor adjustment at a time to perfect the alignment of the cabinet doors."
        }
      ]
    },
    {
      "name":"Fixing Cabinet Doors That Don’t Close Properly",
      "steps":[
        {
          "headline":"Close the door and look on the side where the hinges are to see if it is binding.",
          "description":"Binding means the cupboard door is touching the cupboard frame as it closes and is too tight. Your cabinet doors will not close properly when they are binding. If your cabinet doors make a lot of creaking noises when you open and close them, then it could be a sign they are binding and you should check them and fix them."
        },
        {
          "headline":"Locate and loosen the locking screws with a screwdriver.",
          "description":"Open up the cupboard doors and locate the locking screws; which are the horizontal screws on the part of the hinges closest to the back of the cupboard. Use a screwdriver to loosen them so that you can adjust the cabinet doors. You won’t need to adjust any other screws to fix binding cabinet doors."
        },
        {
          "headline":"Pull the door towards you and away from the cupboard frame to create a gap.",
          "description":"The ideal gap between a cabinet door and the frame of the cupboard is no more than 1 millimetre (0.039 in). This will allow your cabinet doors to close properly. You won’t notice a big difference in the position of the door while you pull it towards you, but all it takes is a small adjustment to stop a cabinet door from binding against the cupboard."
        },
        {
          "headline":"Tighten the locking screws again to hold the cabinet doors in position.",
          "description":"Use a screwdriver to turn the locking screws clockwise. Tighten them as much as you can to secure the cabinet doors in their new position. It may be helpful to have a helper hold each door in place for you so you can tighten the screws again without shifting the position of the cabinet doors."
        },
        {
          "headline":"Close and open the cabinet doors to see if the binding is fixed.",
          "description":"The doors will close flush against the frame and there will be no creaking if you have adjusted the doors correctly. Repeat the process if the doors are still not closing properly yet. This is the final type of adjustment you can make to fix cabinet door alignment problems. When you know how to tighten loose cabinet doors, adjust poorly aligned doors, and fix binding, you will be able to get almost any kitchen cabinet door to work properly!"
        }
      ]
    }
  ],
  "text":" Tightening Loose Cabinet Doors Open the cabinet doors and locate the hinge screws on the inside. The cabinet doors will have 2 vertical fixed door screws that attach each hinge to each door. There are 2 vertical adjustable cupboard screws and 2 horizontal screws on the inside of the cupboard for each hinge. The leftmost screw is the adjusting screw, and the screw on the right is the locking screw. If your cupboard doors are loose, don’t assume you need to replace the hinges. Oftentimes, all you need to do is tighten or adjust the various screws to tighten the doors again. Tighten the locking screw all the way if it is loose. The horizontal screw furthest to the right on the hinges inside the cupboard is the locking screw. Use a screwdriver to screw it clockwise as far as it will go to tighten it and check if the cabinet doors are still loose. If the door is tight at this point, then you don’t need to do anything else. If it is still loose, then proceed with tightening the rest of the screws. Tighten the fixed door screws and adjustable cupboard screws next. Screw all the vertical screws as tight as they will go if the cupboard door is still loose after tightening the locking screw. The only screw you will not have touched at this point is the leftmost horizontal screw on the inside of the cupboard (this screw is only used for adjusting the doors side-to-side). After tightening all of these screws, your cabinet doors will be tight again, but they might be slightly misaligned. Proceed to make adjustments to align them properly. Adjusting Misaligned Doors Open the cabinet door and locate the screws used for aligning the door. Cabinet door hinges have 2 vertical fixed door screws that attach the hinge to the door and 2 vertical adjustable cupboard screws that attach the hinges to the cupboard. Each hinge has a horizontal adjusting screw (closest to the front of the cupboard) and a horizontal locking screw (closest to the back of the cupboard). You will be using all of the screws for adjustments except for the screws that hold the hinges to the doors. In other words, you will only be adjusting the screws that hold the hinges to the inside of the cupboard. Use the horizontal adjusting screw to adjust a door side to side. Turn the adjusting screws clockwise with a screwdriver in each set of hinges to move the door closer to the edge of the cabinet. Turn them counterclockwise to move the door further away from the edge of the cabinet. You might have to slightly unscrew the locking screw to use the adjusting screw. Make sure to tighten it completely after you align the door. Adjust a door up or down with the vertical adjustable cupboard screws. Loosen both of the adjustable cupboard screws in each set of hinges until you can move the door up and down. Align the door vertically how you want it and tighten the screws again. These screws are usually in slotted holes that make it easy to slide the door up and down to adjust it without having to remove the screws completely. Adjust the angle of a door by turning 1 of the adjustable cupboard screws. Use the adjusting screw on just 1 set of hinges to correct the angle of a crooked cabinet door. Turn 1 screw in 1 direction and the other in the other direction to make large adjustments. For example, if there is more space between the cabinet door and the edge of the cabinet at the top of the door, then turn the adjusting screw in the top hinge clockwise to move the door closer to the edge of the cabinet at the top. Close the cabinet doors to check the alignment. The cabinet doors will be symmetrical and close properly if you made the correct adjustments. Note any misalignment that is still occurring, open the cabinet doors back up, and make adjustments with the necessary screws. Try making 1 minor adjustment at a time to perfect the alignment of the cabinet doors. Fixing Cabinet Doors That Don’t Close Properly Close the door and look on the side where the hinges are to see if it is binding. Binding means the cupboard door is touching the cupboard frame as it closes and is too tight. Your cabinet doors will not close properly when they are binding. If your cabinet doors make a lot of creaking noises when you open and close them, then it could be a sign they are binding and you should check them and fix them. Locate and loosen the locking screws with a screwdriver. Open up the cupboard doors and locate the locking screws; which are the horizontal screws on the part of the hinges closest to the back of the cupboard. Use a screwdriver to loosen them so that you can adjust the cabinet doors. You won’t need to adjust any other screws to fix binding cabinet doors. Pull the door towards you and away from the cupboard frame to create a gap. The ideal gap between a cabinet door and the frame of the cupboard is no more than 1 millimetre (0.039 in). This will allow your cabinet doors to close properly. You won’t notice a big difference in the position of the door while you pull it towards you, but all it takes is a small adjustment to stop a cabinet door from binding against the cupboard. Tighten the locking screws again to hold the cabinet doors in position. Use a screwdriver to turn the locking screws clockwise. Tighten them as much as you can to secure the cabinet doors in their new position. It may be helpful to have a helper hold each door in place for you so you can tighten the screws again without shifting the position of the cabinet doors. Close and open the cabinet doors to see if the binding is fixed. The doors will close flush against the frame and there will be no creaking if you have adjusted the doors correctly. Repeat the process if the doors are still not closing properly yet. This is the final type of adjustment you can make to fix cabinet door alignment problems. When you know how to tighten loose cabinet doors, adjust poorly aligned doors, and fix binding, you will be able to get almost any kitchen cabinet door to work properly!",
  "sentences":[
    " Tightening Loose Cabinet Doors Open the cabinet doors and locate the hinge screws on the inside.",
    "The cabinet doors will have 2 vertical fixed door screws that attach each hinge to each door.",
    "There are 2 vertical adjustable cupboard screws and 2 horizontal screws on the inside of the cupboard for each hinge.",
    "The leftmost screw is the adjusting screw, and the screw on the right is the locking screw.",
    "If your cupboard doors are loose, don’t assume you need to replace the hinges.",
    "Oftentimes, all you need to do is tighten or adjust the various screws to tighten the doors again.",
    "Tighten the locking screw all the way if it is loose.",
    "The horizontal screw furthest to the right on the hinges inside the cupboard is the locking screw.",
    "Use a screwdriver to screw it clockwise as far as it will go to tighten it and check if the cabinet doors are still loose.",
    "If the door is tight at this point, then you don’t need to do anything else.",
    "If it is still loose, then proceed with tightening the rest of the screws.",
    "Tighten the fixed door screws and adjustable cupboard screws next.",
    "Screw all the vertical screws as tight as they will go if the cupboard door is still loose after tightening the locking screw.",
    "The only screw you will not have touched at this point is the leftmost horizontal screw on the inside of the cupboard (this screw is only used for adjusting the doors side-to-side).",
    "After tightening all of these screws, your cabinet doors will be tight again, but they might be slightly misaligned.",
    "Proceed to make adjustments to align them properly.",
    "Adjusting Misaligned Doors Open the cabinet door and locate the screws used for aligning the door.",
    "Cabinet door hinges have 2 vertical fixed door screws that attach the hinge to the door and 2 vertical adjustable cupboard screws that attach the hinges to the cupboard.",
    "Each hinge has a horizontal adjusting screw (closest to the front of the cupboard) and a horizontal locking screw (closest to the back of the cupboard).",
    "You will be using all of the screws for adjustments except for the screws that hold the hinges to the doors.",
    "In other words, you will only be adjusting the screws that hold the hinges to the inside of the cupboard.",
    "Use the horizontal adjusting screw to adjust a door side to side.",
    "Turn the adjusting screws clockwise with a screwdriver in each set of hinges to move the door closer to the edge of the cabinet.",
    "Turn them counterclockwise to move the door further away from the edge of the cabinet.",
    "You might have to slightly unscrew the locking screw to use the adjusting screw.",
    "Make sure to tighten it completely after you align the door.",
    "Adjust a door up or down with the vertical adjustable cupboard screws.",
    "Loosen both of the adjustable cupboard screws in each set of hinges until you can move the door up and down.",
    "Align the door vertically how you want it and tighten the screws again.",
    "These screws are usually in slotted holes that make it easy to slide the door up and down to adjust it without having to remove the screws completely.",
    "Adjust the angle of a door by turning 1 of the adjustable cupboard screws.",
    "Use the adjusting screw on just 1 set of hinges to correct the angle of a crooked cabinet door.",
    "Turn 1 screw in 1 direction and the other in the other direction to make large adjustments.",
    "For example, if there is more space between the cabinet door and the edge of the cabinet at the top of the door, then turn the adjusting screw in the top hinge clockwise to move the door closer to the edge of the cabinet at the top.",
    "Close the cabinet doors to check the alignment.",
    "The cabinet doors will be symmetrical and close properly if you made the correct adjustments.",
    "Note any misalignment that is still occurring, open the cabinet doors back up, and make adjustments with the necessary screws.",
    "Try making 1 minor adjustment at a time to perfect the alignment of the cabinet doors.",
    "Fixing Cabinet Doors That Don’t Close Properly Close the door and look on the side where the hinges are to see if it is binding.",
    "Binding means the cupboard door is touching the cupboard frame as it closes and is too tight.",
    "Your cabinet doors will not close properly when they are binding.",
    "If your cabinet doors make a lot of creaking noises when you open and close them, then it could be a sign they are binding and you should check them and fix them.",
    "Locate and loosen the locking screws with a screwdriver.",
    "Open up the cupboard doors and locate the locking screws; which are the horizontal screws on the part of the hinges closest to the back of the cupboard.",
    "Use a screwdriver to loosen them so that you can adjust the cabinet doors.",
    "You won’t need to adjust any other screws to fix binding cabinet doors.",
    "Pull the door towards you and away from the cupboard frame to create a gap.",
    "The ideal gap between a cabinet door and the frame of the cupboard is no more than 1 millimetre (0.039 in).",
    "This will allow your cabinet doors to close properly.",
    "You won’t notice a big difference in the position of the door while you pull it towards you, but all it takes is a small adjustment to stop a cabinet door from binding against the cupboard.",
    "Tighten the locking screws again to hold the cabinet doors in position.",
    "Use a screwdriver to turn the locking screws clockwise.",
    "Tighten them as much as you can to secure the cabinet doors in their new position.",
    "It may be helpful to have a helper hold each door in place for you so you can tighten the screws again without shifting the position of the cabinet doors.",
    "Close and open the cabinet doors to see if the binding is fixed.",
    "The doors will close flush against the frame and there will be no creaking if you have adjusted the doors correctly.",
    "Repeat the process if the doors are still not closing properly yet.",
    "This is the final type of adjustment you can make to fix cabinet door alignment problems.",
    "When you know how to tighten loose cabinet doors, adjust poorly aligned doors, and fix binding, you will be able to get almost any kitchen cabinet door to work properly!"
  ],
  "tyn_section":[
    "Screwdriver"
  ],
  "tyn_model":[
    "screwdriver",
    "screws",
    "adjustable cupboard screws"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  }
}