{
  "title":"How to Get Acrylic Paint Out of Jeans",
  "url":"https://www.wikihow.com/Get-Acrylic-Paint-Out-of-Jeans",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Plastic"
  ],
  "methods":[
    {
      "name":"Cleaning Acrylic Paint off While It's Wet",
      "steps":[
        {
          "headline":"Scoop up any excess paint with a table knife or other tool.",
          "description":"Try to get as much paint off the jeans as you can. If you have a huge dollop, run a table knife or other smooth tool over the area to pull the extra paint off."
        },
        {
          "headline":"Use running water to get the wet paint out.",
          "description":"Turn your jeans inside out so the stain is on the inside. Hold your jeans up to the faucet and let the water run through the fabric. This should clean out the majority of the wet paint. Use your fingers to rub at the paint while flushing it with warm water. You can also flush the spot with warm water using a sponge if you can't place the spot under running water. Get it very wet with water and sponge at the stain. However, flushing it under running will get out more of the paint."
        },
        {
          "headline":"Blot at the stain with a mixture of warm water and dishwashing soap.",
          "description":"Pour an equal amount of warm water and dishwashing soap into a cup. Stir the soap in and then dip an old rag in it. Rub it into the stain, dipping the rag into the water again as the stain absorbs it."
        },
        {
          "headline":"Flush the stain and wash the jeans as you normally would.",
          "description":"Place the area under running water to rinse out the paint and the soap. If there's still a stain, try the method again or pick another technique. If the paint is gone, throw your jeans in the wash for a normal cycle."
        }
      ]
    },
    {
      "name":"Working on Dried Acrylic Paint with Rubbing Alcohol",
      "steps":[
        {
          "headline":"Scratch across the paint with a butter knife.",
          "description":"Scrape it back and forth over the stain to work off the excess paint. Don't gouge the fabric, though, as that could lead to a divot or hole in your jeans."
        },
        {
          "headline":"Wash the area off with water.",
          "description":"Turn the jeans inside out and hold them under warm running water. This may not do much if the paint is dried, but it can loosen some chunks that aren't well adhered to the surface."
        },
        {
          "headline":"Scrub the stain with rubbing alcohol.",
          "description":"Flip the jeans right-side out. Dampen a toothbrush, clean rag, or cotton ball in rubbing alcohol, then rub it across the dried paint. Keep scrubbing back and forth, dipping into the rubbing alcohol as needed. If you're using a toothbrush, wipe it off with rubbing alcohol and a paper towel when it gets covered with paint. If you're using rags or cotton balls, just switch to a new one."
        },
        {
          "headline":"Rinse the stain and put your jeans in the wash.",
          "description":"Turn the jeans inside-out again. Hold the area under running water until all the paint is gone. If you still see a little stain, try adding detergent to the area to pretreat it before putting it in the wash. Run a small load for your jeans. Always wash stained clothing by itself to make sure the paint doesn't get on anything else."
        }
      ]
    },
    {
      "name":"Using a Paint Remover",
      "steps":[
        {
          "headline":"Scrape off the excess dried paint with a butter knife.",
          "description":"Rub the edge of the butter knife over the paint. As you do, any extra paint should flake off. Throw the flakes away as they come off, but don't rub too hard, as you could damage the fabric."
        },
        {
          "headline":"Flip your jeans inside out so that the paint is on the inside.",
          "description":"That way, you can flush the stain out from the back. Don't try to rinse the stain out with water now, as that will just dilute the paint remover. You may want to put on gloves at this point to protect your hands."
        },
        {
          "headline":"Put some paper towels underneath the stain to catch the excess fluid.",
          "description":"You can also use old rags you don't mind throwing away. Either way, you need something behind the stain so paint remover and paint don't go everywhere."
        },
        {
          "headline":"Blot at the stain with turpentine or paint thinner.",
          "description":"Pour the chemical into a throwaway container, such as a yogurt container or an old can. Dip cotton balls or an old rag in the solution and dab at the back of the stain. If you're getting paint on your rag or the towels underneath, move the rag or towels around so you're working with a clean area. You can also switch out cotton balls or paper towels if you need to."
        },
        {
          "headline":"Scrub the area with a toothbrush if the stain doesn't want to come out.",
          "description":"Pour some of the chemical right on the stain, making sure you have a good padding of paper towels behind the stain. Rub the brush back and forth over the stain on both sides, using a circular motion. If your brush becomes too caked with paint, use some of the removal agent and an old rag or paper towel to clean it off."
        },
        {
          "headline":"Soak up the chemical with paper towels.",
          "description":"Put new paper towels behind the stain. Dab at the stain to pick up as much of the chemical as you can. Change out your paper towels if they become too soaked with the chemical to pick up any more."
        },
        {
          "headline":"Wash your jeans as you normally would.",
          "description":"Once the paint is gone, scrub the area with a little laundry detergent. Then, throw your jeans in the washing machine and run them through a cycle before drying them."
        }
      ]
    }
  ],
  "text":" Cleaning Acrylic Paint off While It's Wet Scoop up any excess paint with a table knife or other tool. Try to get as much paint off the jeans as you can. If you have a huge dollop, run a table knife or other smooth tool over the area to pull the extra paint off. Use running water to get the wet paint out. Turn your jeans inside out so the stain is on the inside. Hold your jeans up to the faucet and let the water run through the fabric. This should clean out the majority of the wet paint. Use your fingers to rub at the paint while flushing it with warm water. You can also flush the spot with warm water using a sponge if you can't place the spot under running water. Get it very wet with water and sponge at the stain. However, flushing it under running will get out more of the paint. Blot at the stain with a mixture of warm water and dishwashing soap. Pour an equal amount of warm water and dishwashing soap into a cup. Stir the soap in and then dip an old rag in it. Rub it into the stain, dipping the rag into the water again as the stain absorbs it. Flush the stain and wash the jeans as you normally would. Place the area under running water to rinse out the paint and the soap. If there's still a stain, try the method again or pick another technique. If the paint is gone, throw your jeans in the wash for a normal cycle. Working on Dried Acrylic Paint with Rubbing Alcohol Scratch across the paint with a butter knife. Scrape it back and forth over the stain to work off the excess paint. Don't gouge the fabric, though, as that could lead to a divot or hole in your jeans. Wash the area off with water. Turn the jeans inside out and hold them under warm running water. This may not do much if the paint is dried, but it can loosen some chunks that aren't well adhered to the surface. Scrub the stain with rubbing alcohol. Flip the jeans right-side out. Dampen a toothbrush, clean rag, or cotton ball in rubbing alcohol, then rub it across the dried paint. Keep scrubbing back and forth, dipping into the rubbing alcohol as needed. If you're using a toothbrush, wipe it off with rubbing alcohol and a paper towel when it gets covered with paint. If you're using rags or cotton balls, just switch to a new one. Rinse the stain and put your jeans in the wash. Turn the jeans inside-out again. Hold the area under running water until all the paint is gone. If you still see a little stain, try adding detergent to the area to pretreat it before putting it in the wash. Run a small load for your jeans. Always wash stained clothing by itself to make sure the paint doesn't get on anything else. Using a Paint Remover Scrape off the excess dried paint with a butter knife. Rub the edge of the butter knife over the paint. As you do, any extra paint should flake off. Throw the flakes away as they come off, but don't rub too hard, as you could damage the fabric. Flip your jeans inside out so that the paint is on the inside. That way, you can flush the stain out from the back. Don't try to rinse the stain out with water now, as that will just dilute the paint remover. You may want to put on gloves at this point to protect your hands. Put some paper towels underneath the stain to catch the excess fluid. You can also use old rags you don't mind throwing away. Either way, you need something behind the stain so paint remover and paint don't go everywhere. Blot at the stain with turpentine or paint thinner. Pour the chemical into a throwaway container, such as a yogurt container or an old can. Dip cotton balls or an old rag in the solution and dab at the back of the stain. If you're getting paint on your rag or the towels underneath, move the rag or towels around so you're working with a clean area. You can also switch out cotton balls or paper towels if you need to. Scrub the area with a toothbrush if the stain doesn't want to come out. Pour some of the chemical right on the stain, making sure you have a good padding of paper towels behind the stain. Rub the brush back and forth over the stain on both sides, using a circular motion. If your brush becomes too caked with paint, use some of the removal agent and an old rag or paper towel to clean it off. Soak up the chemical with paper towels. Put new paper towels behind the stain. Dab at the stain to pick up as much of the chemical as you can. Change out your paper towels if they become too soaked with the chemical to pick up any more. Wash your jeans as you normally would. Once the paint is gone, scrub the area with a little laundry detergent. Then, throw your jeans in the washing machine and run them through a cycle before drying them.",
  "sentences":[
    " Cleaning Acrylic Paint off While It's Wet Scoop up any excess paint with a table knife or other tool.",
    "Try to get as much paint off the jeans as you can.",
    "If you have a huge dollop, run a table knife or other smooth tool over the area to pull the extra paint off.",
    "Use running water to get the wet paint out.",
    "Turn your jeans inside out so the stain is on the inside.",
    "Hold your jeans up to the faucet and let the water run through the fabric.",
    "This should clean out the majority of the wet paint.",
    "Use your fingers to rub at the paint while flushing it with warm water.",
    "You can also flush the spot with warm water using a sponge if you can't place the spot under running water.",
    "Get it very wet with water and sponge at the stain.",
    "However, flushing it under running will get out more of the paint.",
    "Blot at the stain with a mixture of warm water and dishwashing soap.",
    "Pour an equal amount of warm water and dishwashing soap into a cup.",
    "Stir the soap in and then dip an old rag in it.",
    "Rub it into the stain, dipping the rag into the water again as the stain absorbs it.",
    "Flush the stain and wash the jeans as you normally would.",
    "Place the area under running water to rinse out the paint and the soap.",
    "If there's still a stain, try the method again or pick another technique.",
    "If the paint is gone, throw your jeans in the wash for a normal cycle.",
    "Working on Dried Acrylic Paint with Rubbing Alcohol Scratch across the paint with a butter knife.",
    "Scrape it back and forth over the stain to work off the excess paint.",
    "Don't gouge the fabric, though, as that could lead to a divot or hole in your jeans.",
    "Wash the area off with water.",
    "Turn the jeans inside out and hold them under warm running water.",
    "This may not do much if the paint is dried, but it can loosen some chunks that aren't well adhered to the surface.",
    "Scrub the stain with rubbing alcohol.",
    "Flip the jeans right-side out.",
    "Dampen a toothbrush, clean rag, or cotton ball in rubbing alcohol, then rub it across the dried paint.",
    "Keep scrubbing back and forth, dipping into the rubbing alcohol as needed.",
    "If you're using a toothbrush, wipe it off with rubbing alcohol and a paper towel when it gets covered with paint.",
    "If you're using rags or cotton balls, just switch to a new one.",
    "Rinse the stain and put your jeans in the wash.",
    "Turn the jeans inside-out again.",
    "Hold the area under running water until all the paint is gone.",
    "If you still see a little stain, try adding detergent to the area to pretreat it before putting it in the wash. Run a small load for your jeans.",
    "Always wash stained clothing by itself to make sure the paint doesn't get on anything else.",
    "Using a Paint Remover Scrape off the excess dried paint with a butter knife.",
    "Rub the edge of the butter knife over the paint.",
    "As you do, any extra paint should flake off.",
    "Throw the flakes away as they come off, but don't rub too hard, as you could damage the fabric.",
    "Flip your jeans inside out so that the paint is on the inside.",
    "That way, you can flush the stain out from the back.",
    "Don't try to rinse the stain out with water now, as that will just dilute the paint remover.",
    "You may want to put on gloves at this point to protect your hands.",
    "Put some paper towels underneath the stain to catch the excess fluid.",
    "You can also use old rags you don't mind throwing away.",
    "Either way, you need something behind the stain so paint remover and paint don't go everywhere.",
    "Blot at the stain with turpentine or paint thinner.",
    "Pour the chemical into a throwaway container, such as a yogurt container or an old can.",
    "Dip cotton balls or an old rag in the solution and dab at the back of the stain.",
    "If you're getting paint on your rag or the towels underneath, move the rag or towels around so you're working with a clean area.",
    "You can also switch out cotton balls or paper towels if you need to.",
    "Scrub the area with a toothbrush if the stain doesn't want to come out.",
    "Pour some of the chemical right on the stain, making sure you have a good padding of paper towels behind the stain.",
    "Rub the brush back and forth over the stain on both sides, using a circular motion.",
    "If your brush becomes too caked with paint, use some of the removal agent and an old rag or paper towel to clean it off.",
    "Soak up the chemical with paper towels.",
    "Put new paper towels behind the stain.",
    "Dab at the stain to pick up as much of the chemical as you can.",
    "Change out your paper towels if they become too soaked with the chemical to pick up any more.",
    "Wash your jeans as you normally would.",
    "Once the paint is gone, scrub the area with a little laundry detergent.",
    "Then, throw your jeans in the washing machine and run them through a cycle before drying them."
  ],
  "tyn_section":[
    "Butter knife",
    "Dishwashing soap",
    "Rag",
    "Rubbing alcohol",
    "Toothbrush, clean rag, or cotton ball",
    "Laundry detergent",
    "Paper towels or an old rag",
    "Turpentine or paint thinner",
    "Gloves",
    "Cotton balls",
    "Toothbrush, optional"
  ],
  "tyn_model":[
    "water",
    "paper towels",
    "rubbing alcohol",
    "paint",
    "warm water",
    "butter knife",
    "acrylic paint",
    "table knife",
    "sponge",
    "dishwashing soap",
    "soap",
    "paper towel",
    "cotton balls",
    "towels",
    "running water",
    "detergent",
    "paint remover",
    "turpentine",
    "paint thinner",
    "toothbrush",
    "laundry detergent",
    "washing machine"
  ],
  "simple_metrics":{
    "r":0.4545454545,
    "p":0.2272727273,
    "f1":0.303030303,
    "avg_pos":0.2272727273
  },
  "jacc_metrics_0.5":{
    "r":0.5454545455,
    "p":0.3636363636,
    "f1":0.4363636364
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6363636364,
    "p":0.4545454545,
    "f1":0.5303030303
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4545454545,
    "p":0.2272727273,
    "f1":0.303030303
  }
}