{
  "title":"How to Steam Milk Without a Steamer",
  "url":"https://www.wikihow.com/Steam-Milk-Without-a-Steamer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Steaming Milk"
  ],
  "methods":[
    {
      "name":"Steaming Milk in the Microwave with a Jar",
      "steps":[
        {
          "headline":"Pour your milk into a glass jar.",
          "description":"Any kind of milk works for this technique; however, skim milk works best, as it froths easily. Pour the milk into a glass jar and screw the lid on tightly. A regular espresso or flat white requires about 0.5 cups (120 mL) of milk. Fill the jar no more than halfway so that the milk has room to froth."
        },
        {
          "headline":"Shake the milk until it is frothy.",
          "description":"Shake the jar of milk up and down until it has doubled in volume. This normally takes about 30 to 60 seconds. If you have used full-fat milk, it may take an extra 30 seconds to achieve the same level of frothiness. Double-check that the lid is on tightly before you shake it to prevent milk spilling on the floor."
        },
        {
          "headline":"Microwave the milk uncovered for 30 seconds.",
          "description":"Take the lid off and place the jar of milk into the microwave. Adjust the microwave to the highest setting and then set it to heat for 30 seconds. The heat warms the milk and causes the foam to rise to the top of the jar."
        },
        {
          "headline":"Pour the milk and froth into your mug.",
          "description":"Hold the foam in the jar with a spoon and allow the milk to run into your mug. Then, spoon the foam on top of your mug to provide a fluffy top layer. This steamed milk has a very similar consistency to that made with a steamer."
        }
      ]
    },
    {
      "name":"Using the Stove and a French Press",
      "steps":[
        {
          "headline":"Warm up your milk to 60 °C (140 °F) on the stovetop.",
          "description":"Pour your milk into a small saucepan and set the stovetop to medium heat. Place the tip of a cooking thermometer in the milk to measure the temperature. Once it reaches 60 °C (140 °F), remove the saucepan from the heat. If you don’t have a cooking thermometer, heat the milk until it's warm but not too hot to touch. Turn down the heat if the milk starts to boil."
        },
        {
          "headline":"Pour the milk into your French press.",
          "description":"Before you tip in the milk, ensure that the French press is clean; otherwise, your milk will taste like coffee. Take the plunger lid off your French press and carefully tip the warm milk into the bowl. If you have a pump frother, use this instead."
        },
        {
          "headline":"Pump the plunger handle up and down until the milk is foamy.",
          "description":"Use 1 hand to hold down the plunger lid and use your other hand to move the plunger stick up and down. Pump the stick vigorously for about 60 seconds or until the milk reaches your desired level of fluffiness. If you don’t have a French press, foam the milk with a whisk or blend it for 30 seconds in a blender."
        },
        {
          "headline":"Pour the warm frothy milk into a mug.",
          "description":"Fill your mug with cocoa or coffee and then pour in the warm frothy milk. Alternatively, enjoy the frothy milk by itself as a creamy, calcium-rich treat."
        }
      ]
    },
    {
      "name":"Using the Microwave and a Whisk",
      "steps":[
        {
          "headline":"Warm up your milk for 30 seconds in the microwave.",
          "description":"Pour your milk into a microwave-safe jar or dish. Then, place it in the microwave on the highest setting for 30 seconds. This technique works with any type of milk; however, it is slightly quicker if you use low-fat milk. Glass and ceramic are good microwave-safe materials."
        },
        {
          "headline":"Whisk the milk until is foamy and bubbly.",
          "description":"Use a hand whisk or an electric whisk to foam the milk for about 30 seconds or until it doubles in volume. If you use an electric whisk, set it to the lowest speed to avoid the milk spilling over the edges of your bowl. If you don’t have a whisk, place the milk in a blender for 30 seconds instead."
        },
        {
          "headline":"Pour the milk into your hot drink or enjoy it by itself.",
          "description":"Carefully pour the milk into your hot drink and stir it gently with a spoon. Alternatively, pour it into a glass and enjoy its warm, creamy taste."
        }
      ]
    }
  ],
  "text":" Steaming Milk in the Microwave with a Jar Pour your milk into a glass jar. Any kind of milk works for this technique; however, skim milk works best, as it froths easily. Pour the milk into a glass jar and screw the lid on tightly. A regular espresso or flat white requires about 0.5 cups (120 mL) of milk. Fill the jar no more than halfway so that the milk has room to froth. Shake the milk until it is frothy. Shake the jar of milk up and down until it has doubled in volume. This normally takes about 30 to 60 seconds. If you have used full-fat milk, it may take an extra 30 seconds to achieve the same level of frothiness. Double-check that the lid is on tightly before you shake it to prevent milk spilling on the floor. Microwave the milk uncovered for 30 seconds. Take the lid off and place the jar of milk into the microwave. Adjust the microwave to the highest setting and then set it to heat for 30 seconds. The heat warms the milk and causes the foam to rise to the top of the jar. Pour the milk and froth into your mug. Hold the foam in the jar with a spoon and allow the milk to run into your mug. Then, spoon the foam on top of your mug to provide a fluffy top layer. This steamed milk has a very similar consistency to that made with a steamer. Using the Stove and a French Press Warm up your milk to 60 °C (140 °F) on the stovetop. Pour your milk into a small saucepan and set the stovetop to medium heat. Place the tip of a cooking thermometer in the milk to measure the temperature. Once it reaches 60 °C (140 °F), remove the saucepan from the heat. If you don’t have a cooking thermometer, heat the milk until it's warm but not too hot to touch. Turn down the heat if the milk starts to boil. Pour the milk into your French press. Before you tip in the milk, ensure that the French press is clean; otherwise, your milk will taste like coffee. Take the plunger lid off your French press and carefully tip the warm milk into the bowl. If you have a pump frother, use this instead. Pump the plunger handle up and down until the milk is foamy. Use 1 hand to hold down the plunger lid and use your other hand to move the plunger stick up and down. Pump the stick vigorously for about 60 seconds or until the milk reaches your desired level of fluffiness. If you don’t have a French press, foam the milk with a whisk or blend it for 30 seconds in a blender. Pour the warm frothy milk into a mug. Fill your mug with cocoa or coffee and then pour in the warm frothy milk. Alternatively, enjoy the frothy milk by itself as a creamy, calcium-rich treat. Using the Microwave and a Whisk Warm up your milk for 30 seconds in the microwave. Pour your milk into a microwave-safe jar or dish. Then, place it in the microwave on the highest setting for 30 seconds. This technique works with any type of milk; however, it is slightly quicker if you use low-fat milk. Glass and ceramic are good microwave-safe materials. Whisk the milk until is foamy and bubbly. Use a hand whisk or an electric whisk to foam the milk for about 30 seconds or until it doubles in volume. If you use an electric whisk, set it to the lowest speed to avoid the milk spilling over the edges of your bowl. If you don’t have a whisk, place the milk in a blender for 30 seconds instead. Pour the milk into your hot drink or enjoy it by itself. Carefully pour the milk into your hot drink and stir it gently with a spoon. Alternatively, pour it into a glass and enjoy its warm, creamy taste.",
  "sentences":[
    " Steaming Milk in the Microwave with a Jar Pour your milk into a glass jar.",
    "Any kind of milk works for this technique; however, skim milk works best, as it froths easily.",
    "Pour the milk into a glass jar and screw the lid on tightly.",
    "A regular espresso or flat white requires about 0.5 cups (120 mL) of milk.",
    "Fill the jar no more than halfway so that the milk has room to froth.",
    "Shake the milk until it is frothy.",
    "Shake the jar of milk up and down until it has doubled in volume.",
    "This normally takes about 30 to 60 seconds.",
    "If you have used full-fat milk, it may take an extra 30 seconds to achieve the same level of frothiness.",
    "Double-check that the lid is on tightly before you shake it to prevent milk spilling on the floor.",
    "Microwave the milk uncovered for 30 seconds.",
    "Take the lid off and place the jar of milk into the microwave.",
    "Adjust the microwave to the highest setting and then set it to heat for 30 seconds.",
    "The heat warms the milk and causes the foam to rise to the top of the jar.",
    "Pour the milk and froth into your mug.",
    "Hold the foam in the jar with a spoon and allow the milk to run into your mug.",
    "Then, spoon the foam on top of your mug to provide a fluffy top layer.",
    "This steamed milk has a very similar consistency to that made with a steamer.",
    "Using the Stove and a French Press Warm up your milk to 60 °C (140 °F) on the stovetop.",
    "Pour your milk into a small saucepan and set the stovetop to medium heat.",
    "Place the tip of a cooking thermometer in the milk to measure the temperature.",
    "Once it reaches 60 °C (140 °F), remove the saucepan from the heat.",
    "If you don’t have a cooking thermometer, heat the milk until it's warm but not too hot to touch.",
    "Turn down the heat if the milk starts to boil.",
    "Pour the milk into your French press.",
    "Before you tip in the milk, ensure that the French press is clean; otherwise, your milk will taste like coffee.",
    "Take the plunger lid off your French press and carefully tip the warm milk into the bowl.",
    "If you have a pump frother, use this instead.",
    "Pump the plunger handle up and down until the milk is foamy.",
    "Use 1 hand to hold down the plunger lid and use your other hand to move the plunger stick up and down.",
    "Pump the stick vigorously for about 60 seconds or until the milk reaches your desired level of fluffiness.",
    "If you don’t have a French press, foam the milk with a whisk or blend it for 30 seconds in a blender.",
    "Pour the warm frothy milk into a mug.",
    "Fill your mug with cocoa or coffee and then pour in the warm frothy milk.",
    "Alternatively, enjoy the frothy milk by itself as a creamy, calcium-rich treat.",
    "Using the Microwave and a Whisk Warm up your milk for 30 seconds in the microwave.",
    "Pour your milk into a microwave-safe jar or dish.",
    "Then, place it in the microwave on the highest setting for 30 seconds.",
    "This technique works with any type of milk; however, it is slightly quicker if you use low-fat milk.",
    "Glass and ceramic are good microwave-safe materials.",
    "Whisk the milk until is foamy and bubbly.",
    "Use a hand whisk or an electric whisk to foam the milk for about 30 seconds or until it doubles in volume.",
    "If you use an electric whisk, set it to the lowest speed to avoid the milk spilling over the edges of your bowl.",
    "If you don’t have a whisk, place the milk in a blender for 30 seconds instead.",
    "Pour the milk into your hot drink or enjoy it by itself.",
    "Carefully pour the milk into your hot drink and stir it gently with a spoon.",
    "Alternatively, pour it into a glass and enjoy its warm, creamy taste."
  ],
  "tyn_section":[
    "Glass jar with lid",
    "Spoon",
    "Microwave",
    "Mug",
    "Saucepan",
    "French press",
    "Cooking thermometer",
    "Microwave-safe bowl or jar",
    "Whisk (hand-held or electric)"
  ],
  "tyn_model":[
    "milk",
    "microwave",
    "french press",
    "mug",
    "whisk",
    "glass jar",
    "spoon",
    "cooking thermometer",
    "bowl",
    "blender",
    "electric whisk",
    "skim milk",
    "steamer",
    "stove",
    "small saucepan",
    "saucepan",
    "pump frother",
    "coffee",
    "microwave-safe jar",
    "glass"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.3,
    "f1":0.4137931034,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8888888889,
    "p":0.45,
    "f1":0.5975103734
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.45,
    "f1":0.5975103734
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.3,
    "f1":0.4137931034
  }
}