{
  "title":"How to Cut Squash",
  "url":"https://www.wikihow.com/Cut-Squash",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Squash"
  ],
  "methods":[
    {
      "name":"Cubing Butternut Squash",
      "steps":[
        {
          "headline":"Cut ⁄4 in (0.64 cm) off the top and bottom of the squash.",
          "description":"Lay the squash on its side on top of a cutting board. Use a large chef's knife that's about 8–10 inches (20–25 cm) long so it can cut through the squash completely. Hold the squash steady with your nondominant hand and use the knife to slice the top and bottom areas so they're flat.Make sure to remove the stem completely since you won't be able to cut through it. Curl the fingers on your nondominant hand into your palm so you don’t accidentally cut yourself."
        },
        {
          "headline":"Peel the squash if you want to remove the skin.",
          "description":"Keep the squash in place with your nondominant hand and hold a vegetable peeler in your dominant hand so it's at a 45-degree angle to the squash. Press the peeler into the squash, then pull it down along the length of the squash to remove the skin. Rotate the squash when you're finished peeling one side so you can peel the rest of the skin.You don't have to peel the squash if you don't want to. Try microwaving the squash for 30 seconds to heat up the skin and make it easier to peel."
        },
        {
          "headline":"Set the squash upright so the widest side is on the bottom.",
          "description":"Put the squash on your cutting board so one of the flat edges you cut is on the bottom. Make sure the widest part of the squash is closer to the cutting board so it doesn't tip over or move as much while you're cutting it.Put your cutting board on a level surface so it doesn't wobble while you're using it.Tip: If your squash wobbles back and forth while it's on the cutting board, cut another slice off the bottom to level it out."
        },
        {
          "headline":"Use a rocking motion to cut through the middle of the squash.",
          "description":"Use the same chef's knife as before and set the blade in the middle of the top flat side. Press the blade into the squash and put your hand on top so the squash can't move around. Rock your knife up and down to work through the squash until you cut through the bottom.If you have trouble cutting through the squash right away, try putting it in the microwave for 30 seconds to 1 minute to make it easier. Be careful since the inside of the squash will be hot. Don't keep your fingers below the knife blade since the blade could slip and you could cut yourself."
        },
        {
          "headline":"Scoop out the seeds with a metal spoon.",
          "description":"Look for the area inside your squash that contains the seeds and scrape them out. Use the edge of a metal spoon to remove all of the seeds so they don't get in the way while you're cutting the squash. Be sure to remove any of the stringy pieces of the squash that are hanging near the seeds as well.You can throw away or roast the seeds when you're finished."
        },
        {
          "headline":"Cut the squash into strips that are ⁄2–1 inch (1.3–2.5 cm) thick.",
          "description":"Turn the halves of squash over so the flat sides are against the cutting board and the longest side faces you. Start on one long side of the squash and use your knife to cut ⁄2–1 in (1.3–2.5 cm) strips to the other long side. Start with the tip of your knife on the board and rock it forward to cut through the squash.Keep your fingers curled on your nondominant hand so you don't cut yourself. The size of the strips depends on the recipe you're following. Check it before you start cutting your squash to make sure it's the right size."
        },
        {
          "headline":"Stack the slices and cut them in half lengthwise.",
          "description":"Take 3-4 strips you just cut and stack them on top of one another so they line up along an edge. Squeeze the long sides of your stack to hold them in place while you cut them in half lengthwise. When you're finished with your cut, you should have 6-8 pieces that are all uniform in size.You can cook the squash in strips if you want to.Tip: If the stack feels like it's slipping before you make your cut, remove one of the strips so it's sturdy. Otherwise, your knife could slip and you could hurt yourself."
        },
        {
          "headline":"Rotate the strips and cut them into cubes if you want.",
          "description":"Turn the strips 90-degrees so the longer edges are facing toward you. Use your knife to cut then strips into ⁄2–1 in (1.3–2.5 cm) cubes so they are all the same size. Keep cutting your squash until it's all cubed.A squash that's 1 ⁄2 pounds (0.68 kg) will give you about 4 ½ cups (0.92 kg) of cubed squash\nYou can store cut squash in your fridge for up to 4 days."
        }
      ]
    },
    {
      "name":"Cutting Acorn Squash",
      "steps":[
        {
          "headline":"Cut the stem off of the acorn squash.",
          "description":"Lay the acorn squash sideways so the stem and tip point toward the sides of your cutting board. Hold the middle of the squash steady with your nondominant hand. Place your chef’s knife about ⁄2 inch (1.3 cm) lower than the base of the stem, and slowly rock the blade back and forth to slice through the top. Try to make the cut as straight as possible. Even if your squash doesn’t have a stem, cut a slice off the top so you have a flat surface. Be sure to keep the fingers on your nondominant hand curled so you don’t accidentally cut them."
        },
        {
          "headline":"Flip the squash over so the cut side is face down.",
          "description":"Set the squash in the middle of your cutting board so the tip points up. Make sure the squash doesn’t wobble or move around when it’s set on the cut side or else your knife may slip and it will be more difficult to cut accurately. If the squash does wobble around, put it back on its side and cut another slice off the top to flatten it."
        },
        {
          "headline":"Rock your knife through the middle of the squash to cut it in half.",
          "description":"Hold the side of the acorn squash with your nondominant hand so you can support it. Place the blade of your knife through the middle of the squash’s tip and push in lightly. Once the blade is in the squash, push down on it with your dominant hand to make a rocking motion. It may take a little force to cut completely through the squash. Make sure your fingers aren’t in the way of the knife blade so you don’t accidentally cut yourself.Tip: If your knife gets stuck in the squash while you’re cutting, tap on the blade lightly with a rubber mallet to help it."
        },
        {
          "headline":"Scrape out the seeds with a metal spoon.",
          "description":"Push the edge of your spoon against the inside of the squash, and drag it through the center area that’s filled with seeds. Use short strokes to ensure you get all of the seeds out from the squash. You can either throw the seeds away or save them if you want to cook or plant them."
        },
        {
          "headline":"Slice the squash along the furrows if you want to make wedges.",
          "description":"The furrows are the grooves that run from the top to the bottom of the squash. Set the squash on your cutting board so the cut side is face down, and line up your knife along one of the grooves. Hold the squash with your nondominant hand as you push the knife into the furrow. Carefully slice from one end to the other to make the wedge. You can remove the skin from the squash with a vegetable peeler if you want, but the skin is edible."
        }
      ]
    },
    {
      "name":"Slicing Summer Squash",
      "steps":[
        {
          "headline":"Slice the summer squash into thin slices with a chef’s knife.",
          "description":"Lay the summer squash on your cutting board so the long side faces you. Hold the squash steady with your nondominant hand and place the knife at the base of the stem. Carefully slice into the summer squash at a 45-degree angle to remove the stem. Roll the squash by a half turn before making your next cut. Continue slicing down the length of the squash until you can’t cut any more slices. Cutting at an angle helps the edges get crispier when they cook and prevents them from getting soggy. Keep the fingers on your nondominant hand curled to use your knuckles for guiding the knife blade and to reduce the chance of cutting yourself. The thickness of the slices depends on the recipe you’re cooking, but a standard zucchini slice is usually about 1 ⁄2 inches (3.8 cm) thick."
        },
        {
          "headline":"Stack the slices and cut them into strips if you need to julienne them.",
          "description":"Put 3–5 slices on top of one another, and hold the stack together with your nondominant hand. Place your knife blade near the edge of the stack and press the blade straight down to slice through the pieces. Move the blade closer to the center of the stack as you cut your strips. You can make the squash strips as thick or thin as you want. Be careful not to cut your fingers while you’re holding the stack together."
        },
        {
          "headline":"Make cuts going the opposite direction if you want to dice the squash.",
          "description":"Keep the julienned squash in a stack and rotate it by 90 degrees so your cuts point to the sides of your cutting board. Make slices perpendicular to the first ones to cut the summer squash into small cubes. Curl the fingers on your nondominant hand into your palm as you cut so you’re less likely to hurt yourself."
        },
        {
          "headline":"Cut summer squash in half lengthwise to stuff them.",
          "description":"Cut the stem off of the summer squash, and then rotate it so the cut side faces you. Push the knife blade into the uncut end of the summer squash and slowly slice toward the cut end. Once you finish your cut, scrape a channel in the middle of the squash using a metal spoon so you have a place to put your stuffing. You can stuff the summer squash with anything you want, including meat, vegetables, or quinoa. Cut the boats into shorter slices if you want to make them smaller."
        }
      ]
    }
  ],
  "text":" Cubing Butternut Squash Cut ⁄4 in (0.64 cm) off the top and bottom of the squash. Lay the squash on its side on top of a cutting board. Use a large chef's knife that's about 8–10 inches (20–25 cm) long so it can cut through the squash completely. Hold the squash steady with your nondominant hand and use the knife to slice the top and bottom areas so they're flat.Make sure to remove the stem completely since you won't be able to cut through it. Curl the fingers on your nondominant hand into your palm so you don’t accidentally cut yourself. Peel the squash if you want to remove the skin. Keep the squash in place with your nondominant hand and hold a vegetable peeler in your dominant hand so it's at a 45-degree angle to the squash. Press the peeler into the squash, then pull it down along the length of the squash to remove the skin. Rotate the squash when you're finished peeling one side so you can peel the rest of the skin.You don't have to peel the squash if you don't want to. Try microwaving the squash for 30 seconds to heat up the skin and make it easier to peel. Set the squash upright so the widest side is on the bottom. Put the squash on your cutting board so one of the flat edges you cut is on the bottom. Make sure the widest part of the squash is closer to the cutting board so it doesn't tip over or move as much while you're cutting it.Put your cutting board on a level surface so it doesn't wobble while you're using it.Tip: If your squash wobbles back and forth while it's on the cutting board, cut another slice off the bottom to level it out. Use a rocking motion to cut through the middle of the squash. Use the same chef's knife as before and set the blade in the middle of the top flat side. Press the blade into the squash and put your hand on top so the squash can't move around. Rock your knife up and down to work through the squash until you cut through the bottom.If you have trouble cutting through the squash right away, try putting it in the microwave for 30 seconds to 1 minute to make it easier. Be careful since the inside of the squash will be hot. Don't keep your fingers below the knife blade since the blade could slip and you could cut yourself. Scoop out the seeds with a metal spoon. Look for the area inside your squash that contains the seeds and scrape them out. Use the edge of a metal spoon to remove all of the seeds so they don't get in the way while you're cutting the squash. Be sure to remove any of the stringy pieces of the squash that are hanging near the seeds as well.You can throw away or roast the seeds when you're finished. Cut the squash into strips that are ⁄2–1 inch (1.3–2.5 cm) thick. Turn the halves of squash over so the flat sides are against the cutting board and the longest side faces you. Start on one long side of the squash and use your knife to cut ⁄2–1 in (1.3–2.5 cm) strips to the other long side. Start with the tip of your knife on the board and rock it forward to cut through the squash.Keep your fingers curled on your nondominant hand so you don't cut yourself. The size of the strips depends on the recipe you're following. Check it before you start cutting your squash to make sure it's the right size. Stack the slices and cut them in half lengthwise. Take 3-4 strips you just cut and stack them on top of one another so they line up along an edge. Squeeze the long sides of your stack to hold them in place while you cut them in half lengthwise. When you're finished with your cut, you should have 6-8 pieces that are all uniform in size.You can cook the squash in strips if you want to.Tip: If the stack feels like it's slipping before you make your cut, remove one of the strips so it's sturdy. Otherwise, your knife could slip and you could hurt yourself. Rotate the strips and cut them into cubes if you want. Turn the strips 90-degrees so the longer edges are facing toward you. Use your knife to cut then strips into ⁄2–1 in (1.3–2.5 cm) cubes so they are all the same size. Keep cutting your squash until it's all cubed.A squash that's 1 ⁄2 pounds (0.68 kg) will give you about 4 ½ cups (0.92 kg) of cubed squash\nYou can store cut squash in your fridge for up to 4 days. Cutting Acorn Squash Cut the stem off of the acorn squash. Lay the acorn squash sideways so the stem and tip point toward the sides of your cutting board. Hold the middle of the squash steady with your nondominant hand. Place your chef’s knife about ⁄2 inch (1.3 cm) lower than the base of the stem, and slowly rock the blade back and forth to slice through the top. Try to make the cut as straight as possible. Even if your squash doesn’t have a stem, cut a slice off the top so you have a flat surface. Be sure to keep the fingers on your nondominant hand curled so you don’t accidentally cut them. Flip the squash over so the cut side is face down. Set the squash in the middle of your cutting board so the tip points up. Make sure the squash doesn’t wobble or move around when it’s set on the cut side or else your knife may slip and it will be more difficult to cut accurately. If the squash does wobble around, put it back on its side and cut another slice off the top to flatten it. Rock your knife through the middle of the squash to cut it in half. Hold the side of the acorn squash with your nondominant hand so you can support it. Place the blade of your knife through the middle of the squash’s tip and push in lightly. Once the blade is in the squash, push down on it with your dominant hand to make a rocking motion. It may take a little force to cut completely through the squash. Make sure your fingers aren’t in the way of the knife blade so you don’t accidentally cut yourself.Tip: If your knife gets stuck in the squash while you’re cutting, tap on the blade lightly with a rubber mallet to help it. Scrape out the seeds with a metal spoon. Push the edge of your spoon against the inside of the squash, and drag it through the center area that’s filled with seeds. Use short strokes to ensure you get all of the seeds out from the squash. You can either throw the seeds away or save them if you want to cook or plant them. Slice the squash along the furrows if you want to make wedges. The furrows are the grooves that run from the top to the bottom of the squash. Set the squash on your cutting board so the cut side is face down, and line up your knife along one of the grooves. Hold the squash with your nondominant hand as you push the knife into the furrow. Carefully slice from one end to the other to make the wedge. You can remove the skin from the squash with a vegetable peeler if you want, but the skin is edible. Slicing Summer Squash Slice the summer squash into thin slices with a chef’s knife. Lay the summer squash on your cutting board so the long side faces you. Hold the squash steady with your nondominant hand and place the knife at the base of the stem. Carefully slice into the summer squash at a 45-degree angle to remove the stem. Roll the squash by a half turn before making your next cut. Continue slicing down the length of the squash until you can’t cut any more slices. Cutting at an angle helps the edges get crispier when they cook and prevents them from getting soggy. Keep the fingers on your nondominant hand curled to use your knuckles for guiding the knife blade and to reduce the chance of cutting yourself. The thickness of the slices depends on the recipe you’re cooking, but a standard zucchini slice is usually about 1 ⁄2 inches (3.8 cm) thick. Stack the slices and cut them into strips if you need to julienne them. Put 3–5 slices on top of one another, and hold the stack together with your nondominant hand. Place your knife blade near the edge of the stack and press the blade straight down to slice through the pieces. Move the blade closer to the center of the stack as you cut your strips. You can make the squash strips as thick or thin as you want. Be careful not to cut your fingers while you’re holding the stack together. Make cuts going the opposite direction if you want to dice the squash. Keep the julienned squash in a stack and rotate it by 90 degrees so your cuts point to the sides of your cutting board. Make slices perpendicular to the first ones to cut the summer squash into small cubes. Curl the fingers on your nondominant hand into your palm as you cut so you’re less likely to hurt yourself. Cut summer squash in half lengthwise to stuff them. Cut the stem off of the summer squash, and then rotate it so the cut side faces you. Push the knife blade into the uncut end of the summer squash and slowly slice toward the cut end. Once you finish your cut, scrape a channel in the middle of the squash using a metal spoon so you have a place to put your stuffing. You can stuff the summer squash with anything you want, including meat, vegetables, or quinoa. Cut the boats into shorter slices if you want to make them smaller.",
  "sentences":[
    " Cubing Butternut Squash Cut ⁄4 in (0.64 cm) off the top and bottom of the squash.",
    "Lay the squash on its side on top of a cutting board.",
    "Use a large chef's knife that's about 8–10 inches (20–25 cm) long so it can cut through the squash completely.",
    "Hold the squash steady with your nondominant hand and use the knife to slice the top and bottom areas so they're flat.Make sure to remove the stem completely since you won't be able to cut through it.",
    "Curl the fingers on your nondominant hand into your palm so you don’t accidentally cut yourself.",
    "Peel the squash if you want to remove the skin.",
    "Keep the squash in place with your nondominant hand and hold a vegetable peeler in your dominant hand so it's at a 45-degree angle to the squash.",
    "Press the peeler into the squash, then pull it down along the length of the squash to remove the skin.",
    "Rotate the squash when you're finished peeling one side so you can peel the rest of the skin.You don't have to peel the squash if you don't want to.",
    "Try microwaving the squash for 30 seconds to heat up the skin and make it easier to peel.",
    "Set the squash upright so the widest side is on the bottom.",
    "Put the squash on your cutting board so one of the flat edges you cut is on the bottom.",
    "Make sure the widest part of the squash is closer to the cutting board so it doesn't tip over or move as much while you're cutting it.Put your cutting board on a level surface so it doesn't wobble while you're using it.Tip: If your squash wobbles back and forth while it's on the cutting board, cut another slice off the bottom to level it out.",
    "Use a rocking motion to cut through the middle of the squash.",
    "Use the same chef's knife as before and set the blade in the middle of the top flat side.",
    "Press the blade into the squash and put your hand on top so the squash can't move around.",
    "Rock your knife up and down to work through the squash until you cut through the bottom.If you have trouble cutting through the squash right away, try putting it in the microwave for 30 seconds to 1 minute to make it easier.",
    "Be careful since the inside of the squash will be hot.",
    "Don't keep your fingers below the knife blade since the blade could slip and you could cut yourself.",
    "Scoop out the seeds with a metal spoon.",
    "Look for the area inside your squash that contains the seeds and scrape them out.",
    "Use the edge of a metal spoon to remove all of the seeds so they don't get in the way while you're cutting the squash.",
    "Be sure to remove any of the stringy pieces of the squash that are hanging near the seeds as well.You can throw away or roast the seeds when you're finished.",
    "Cut the squash into strips that are ⁄2–1 inch (1.3–2.5 cm) thick.",
    "Turn the halves of squash over so the flat sides are against the cutting board and the longest side faces you.",
    "Start on one long side of the squash and use your knife to cut ⁄2–1 in (1.3–2.5 cm) strips to the other long side.",
    "Start with the tip of your knife on the board and rock it forward to cut through the squash.Keep your fingers curled on your nondominant hand so you don't cut yourself.",
    "The size of the strips depends on the recipe you're following.",
    "Check it before you start cutting your squash to make sure it's the right size.",
    "Stack the slices and cut them in half lengthwise.",
    "Take 3-4 strips you just cut and stack them on top of one another so they line up along an edge.",
    "Squeeze the long sides of your stack to hold them in place while you cut them in half lengthwise.",
    "When you're finished with your cut, you should have 6-8 pieces that are all uniform in size.You can cook the squash in strips if you want to.Tip: If the stack feels like it's slipping before you make your cut, remove one of the strips so it's sturdy.",
    "Otherwise, your knife could slip and you could hurt yourself.",
    "Rotate the strips and cut them into cubes if you want.",
    "Turn the strips 90-degrees so the longer edges are facing toward you.",
    "Use your knife to cut then strips into ⁄2–1 in (1.3–2.5 cm) cubes so they are all the same size.",
    "Keep cutting your squash until it's all cubed.A squash that's 1 ⁄2 pounds (0.68 kg) will give you about 4 ½ cups (0.92 kg) of cubed squash\nYou can store cut squash in your fridge for up to 4 days.",
    "Cutting Acorn Squash Cut the stem off of the acorn squash.",
    "Lay the acorn squash sideways so the stem and tip point toward the sides of your cutting board.",
    "Hold the middle of the squash steady with your nondominant hand.",
    "Place your chef’s knife about ⁄2 inch (1.3 cm) lower than the base of the stem, and slowly rock the blade back and forth to slice through the top.",
    "Try to make the cut as straight as possible.",
    "Even if your squash doesn’t have a stem, cut a slice off the top so you have a flat surface.",
    "Be sure to keep the fingers on your nondominant hand curled so you don’t accidentally cut them.",
    "Flip the squash over so the cut side is face down.",
    "Set the squash in the middle of your cutting board so the tip points up.",
    "Make sure the squash doesn’t wobble or move around when it’s set on the cut side or else your knife may slip and it will be more difficult to cut accurately.",
    "If the squash does wobble around, put it back on its side and cut another slice off the top to flatten it.",
    "Rock your knife through the middle of the squash to cut it in half.",
    "Hold the side of the acorn squash with your nondominant hand so you can support it.",
    "Place the blade of your knife through the middle of the squash’s tip and push in lightly.",
    "Once the blade is in the squash, push down on it with your dominant hand to make a rocking motion.",
    "It may take a little force to cut completely through the squash.",
    "Make sure your fingers aren’t in the way of the knife blade so you don’t accidentally cut yourself.Tip: If your knife gets stuck in the squash while you’re cutting, tap on the blade lightly with a rubber mallet to help it.",
    "Scrape out the seeds with a metal spoon.",
    "Push the edge of your spoon against the inside of the squash, and drag it through the center area that’s filled with seeds.",
    "Use short strokes to ensure you get all of the seeds out from the squash.",
    "You can either throw the seeds away or save them if you want to cook or plant them.",
    "Slice the squash along the furrows if you want to make wedges.",
    "The furrows are the grooves that run from the top to the bottom of the squash.",
    "Set the squash on your cutting board so the cut side is face down, and line up your knife along one of the grooves.",
    "Hold the squash with your nondominant hand as you push the knife into the furrow.",
    "Carefully slice from one end to the other to make the wedge.",
    "You can remove the skin from the squash with a vegetable peeler if you want, but the skin is edible.",
    "Slicing Summer Squash Slice the summer squash into thin slices with a chef’s knife.",
    "Lay the summer squash on your cutting board so the long side faces you.",
    "Hold the squash steady with your nondominant hand and place the knife at the base of the stem.",
    "Carefully slice into the summer squash at a 45-degree angle to remove the stem.",
    "Roll the squash by a half turn before making your next cut.",
    "Continue slicing down the length of the squash until you can’t cut any more slices.",
    "Cutting at an angle helps the edges get crispier when they cook and prevents them from getting soggy.",
    "Keep the fingers on your nondominant hand curled to use your knuckles for guiding the knife blade and to reduce the chance of cutting yourself.",
    "The thickness of the slices depends on the recipe you’re cooking, but a standard zucchini slice is usually about 1 ⁄2 inches (3.8 cm) thick.",
    "Stack the slices and cut them into strips if you need to julienne them.",
    "Put 3–5 slices on top of one another, and hold the stack together with your nondominant hand.",
    "Place your knife blade near the edge of the stack and press the blade straight down to slice through the pieces.",
    "Move the blade closer to the center of the stack as you cut your strips.",
    "You can make the squash strips as thick or thin as you want.",
    "Be careful not to cut your fingers while you’re holding the stack together.",
    "Make cuts going the opposite direction if you want to dice the squash.",
    "Keep the julienned squash in a stack and rotate it by 90 degrees so your cuts point to the sides of your cutting board.",
    "Make slices perpendicular to the first ones to cut the summer squash into small cubes.",
    "Curl the fingers on your nondominant hand into your palm as you cut so you’re less likely to hurt yourself.",
    "Cut summer squash in half lengthwise to stuff them.",
    "Cut the stem off of the summer squash, and then rotate it so the cut side faces you.",
    "Push the knife blade into the uncut end of the summer squash and slowly slice toward the cut end.",
    "Once you finish your cut, scrape a channel in the middle of the squash using a metal spoon so you have a place to put your stuffing.",
    "You can stuff the summer squash with anything you want, including meat, vegetables, or quinoa.",
    "Cut the boats into shorter slices if you want to make them smaller."
  ],
  "tyn_section":[
    "Chef’s knife",
    "Cutting board",
    "Metal spoon",
    "Vegetable peeler (optional)"
  ],
  "tyn_model":[
    "squash",
    "knife",
    "summer squash",
    "cutting board",
    "metal spoon",
    "acorn squash",
    "chef's knife",
    "vegetable peeler",
    "chef’s knife",
    "butternut squash",
    "peeler",
    "microwave",
    "knife blade",
    "rubber mallet",
    "spoon",
    "zucchini",
    "vegetables",
    "quinoa"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.1666666667,
    "f1":0.2727272727,
    "avg_pos":0.4444444444
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.5,
    "f1":0.6666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.2222222222,
    "f1":0.3636363636
  }
}