{
  "title":"How to Eat Oats",
  "url":"https://www.wikihow.com/Eat-Oats",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Breakfast Cereal",
    "Oatmeal and Porridge"
  ],
  "methods":[
    {
      "name":"Making Quick Snacks with Uncooked Oats",
      "steps":[
        {
          "headline":"Choose between rolled and steel cut oats.",
          "description":"Steel cut oats are created by shredding oat grains with a machine, giving them a thicker consistency. Rolled oats are flattened, and tend to be easier to chew. They’re both healthy options, but your meal's texture will be affected by which variety you use– steel cut oats will be a little crunchier, while rolled oats tend to be quite soft. Try to avoid buying oats that are pre-mixed with sugar. While they may sound healthy, sugared oats aren’t as good for you. They also tend to be excessively sweet. If you’re cooking or baking, you probably want rolled oats. If you’re adding oats as a garnish or topping, steel-cut is preferable."
        },
        {
          "headline":"Mix some oats into a cup of yogurt.",
          "description":"You can turn that boring old bowl of yogurt into something entirely new with a few tablespoons of oats. Mixing oats into your yogurt will add a crunchy texture and a nutty flavor profile, which works well alongside the simple flavor of a fruit yogurt. Even if you aren’t a fan of the texture, you can mix a tablespoon of oats into yogurt and let it rest for a minute or two and they’ll soften into the yogurt. You can add oats to traditional or Greek yogurt."
        },
        {
          "headline":"Add some oats to a smoothie.",
          "description":"A smoothie can provide an excellent medium for oats, since the thick texture and fruity flavors will pair well with the mildly nutty crunchiness of oats. To add oats to a smoothie, pour ⁄4 cup (59 ml) of uncooked oats into your blender before adding your other ingredients. If you like your smoothies on the thicker side, add an additional ⁄4 cup (59 ml) of oats. Oats will naturally thicken your smoothie, so start with a smaller amount before you blend it. You can always add more later."
        },
        {
          "headline":"Try some muesli for a different take on cereal.",
          "description":"Muesli is a Swiss version of cereal that combines raw oats, nuts, seeds, and fruit. To make muesli, all you have to do is add 4 parts rolled oats, 1 part dried fruit (of your choice), and 1 part nuts/seeds in a small bowl with some milk. The mix can also be used to top toast. Use an almond or soy milk instead of standard milk if you’re not a fan of dairy. You can add more fruit if you’d like to make it sweeter."
        }
      ]
    },
    {
      "name":"Making Oatmeal",
      "steps":[
        {
          "headline":"Combine your ingredients in a medium saucepan.",
          "description":"Add your rolled oats, salt, and cinnamon to a saucepan with your milk and water. Bring it to a boil and then immediately reduce your heat to low. Do not cover your pan. This recipe will not work with steel cut oats. Make sure that you’re using rolled oats to make your oatmeal. You can substitute the milk with almond or soy milk if you want a dairy-free option."
        },
        {
          "headline":"Simmer for 3-5 minutes based on your desired thickness.",
          "description":"Stir occasionally while your oatmeal simmers. If you like your oatmeal to be a little thinner, check the thickness around the 3-minute mark. If you prefer thicker oatmeal, you probably want to wait a full 5 minutes."
        },
        {
          "headline":"Pour your oatmeal into a large bowl and add your honey.",
          "description":"Top your oatmeal with a teaspoon of honey. Mix the oatmeal and the honey together with your spoon. This will have the added benefit of helping your oatmeal cool while you’re mixing it. If honey is not your thing, you can use brown sugar, maple syrup, or even calorie-free sweeteners like stevia to sweeten your oatmeal."
        },
        {
          "headline":"Add additional toppings based on your preferences.",
          "description":"To play up the nutty flavor of oatmeal, add some almonds or walnuts to it. You can also mix in some fresh fruit to create a sweeter dish. Sliced bananas, blueberries, and cut strawberries make excellent additions to a standard bowl of oatmeal. Try mixing in some peanut butter for a thicker dish if you’re fond of peanuts."
        },
        {
          "headline":"Try an instant oatmeal packet if you’re short on time.",
          "description":"Instant oatmeal packets are a simple and easy alternative to homemade oatmeal. Most instant oatmeal simply requires you to heat a prepared packet of oat mix with water or milk in the microwave. While it doesn’t tend to be as healthy or delicious as the real thing, it can be spiced up all the same with fresh fruit, peanut butter, or nuts. When choosing between brands of instant oatmeal, it’s generally a good idea to buy varieties with lower sugar contents. Instant oatmeals are sometimes heavily sugared, so try to look for plain, ideally organic options that you can sweeten yourself."
        }
      ]
    },
    {
      "name":"Baking Bread",
      "steps":[
        {
          "headline":"Mix your yeast into warm water and stir it.",
          "description":"Use a medium bowl to combine your yeast and water. Mix the yeast and water for 1-2 minutes until the yeast has fully dissolved. Stir in your honey and set it aside for a few minutes. It should take 5-10 minutes for the yeast to bloom. You can tell if yeast has bloomed by checking to see if it has thickened and expanded a little bit. Look at the edges of your bowl—if the yeast is pushing out a little bit, then it’s ready for your flour."
        },
        {
          "headline":"Stir your flours, oats, and salt in a large bowl.",
          "description":"While you’re waiting for the yeast to rise, mix both flours, your oats, and a little salt with a wooden spoon. Stir aggressively to get the combination fully mixed, and run your spoon against the edges and bottom of the bowl to ensure that you’re not missing any chunks of flour or oats. Keep an eye on your yeast while you’re doing this. It should be rising steadily, but you don’t want to take too long or your yeast could start to deflate."
        },
        {
          "headline":"Brush your loaf pan with some melted butter.",
          "description":"Use a cooking brush to coat the entirety of your loaf pan to ensure that your bread doesn’t burn in the pan. Apply your butter liberally in back-and-forth strokes across every section of your pan and set it aside."
        },
        {
          "headline":"Combine your ingredients in the large bowl.",
          "description":"Add your flours and yeast together and mix it by hand. [[Knead Dough|Knead] your dough by rubbing it vigorously with your hands. Push sections of your dough together repeatedly to thicken it in the larger bowl to ensure that the flours and oats are mixed evenly throughout. Pour the contents into your 8-cup loaf pan."
        },
        {
          "headline":"Bake your bread at 350 °F (177 °C) for 35-40 minutes.",
          "description":"Place your bread in the center of the middle rack and let it bake until it is golden and pushing out from the top of the pan. After it has done baking, you can broil it for 30 seconds to give the top of your bread a crusty-brown crunch. Remove it from the oven and let it cool. You can brush the top of your bread with some melted butter if you’d like."
        }
      ]
    },
    {
      "name":"Mixing Overnight Oats",
      "steps":[
        {
          "headline":"Find a small container or jar with a lockable lid.",
          "description":"You can use any kind of small portable container– a small tupperware, a mason jar, or a glass bottle are good options. Anything that can hold at least a cup of liquid and can be closed with an airtight lid will be fine for making overnight oats. Do not use steel cut oats for this recipe. They can only be cooked in hot water based on the thickness of their grain."
        },
        {
          "headline":"Pour your oats and milk or water into your container.",
          "description":"Start by pouring your oats into your container and then adding your milk or water. Milk will result in creamier overnight oats, but use water if you’re sensitive to dairy."
        },
        {
          "headline":"Add your chia seeds, salt, and fresh fruit.",
          "description":"Pour your chia seeds into the container and then add a pinch of salt by grabbing some between your thumb and forefinger and dropping it into the oats. You can add any fresh fruit if you’d like. Strawberries, raspberries, and blueberries are all popular additions to overnight oats. Fruit will make your overnight oats a little sweeter, since they tend to be full of natural sugar."
        },
        {
          "headline":"Close your container and shake it vigorously.",
          "description":"Make sure that your lid is shut all the way before shaking it. Hold your container and shake it up and down for about 5 seconds to mix your ingredients together."
        },
        {
          "headline":"Refrigerate your oats overnight and enjoy them in the morning.",
          "description":"Leaving your oats overnight will give your oats time to soak in the milk or water. The result will taste like fresh oatmeal, except cold! Overnight oats make for the perfect morning snack, especially if you like to get out of the door quickly. If you prefer warm oatmeal, you can always heat your overnight oats in the microwave before eating them."
        }
      ]
    }
  ],
  "text":" Making Quick Snacks with Uncooked Oats Choose between rolled and steel cut oats. Steel cut oats are created by shredding oat grains with a machine, giving them a thicker consistency. Rolled oats are flattened, and tend to be easier to chew. They’re both healthy options, but your meal's texture will be affected by which variety you use– steel cut oats will be a little crunchier, while rolled oats tend to be quite soft. Try to avoid buying oats that are pre-mixed with sugar. While they may sound healthy, sugared oats aren’t as good for you. They also tend to be excessively sweet. If you’re cooking or baking, you probably want rolled oats. If you’re adding oats as a garnish or topping, steel-cut is preferable. Mix some oats into a cup of yogurt. You can turn that boring old bowl of yogurt into something entirely new with a few tablespoons of oats. Mixing oats into your yogurt will add a crunchy texture and a nutty flavor profile, which works well alongside the simple flavor of a fruit yogurt. Even if you aren’t a fan of the texture, you can mix a tablespoon of oats into yogurt and let it rest for a minute or two and they’ll soften into the yogurt. You can add oats to traditional or Greek yogurt. Add some oats to a smoothie. A smoothie can provide an excellent medium for oats, since the thick texture and fruity flavors will pair well with the mildly nutty crunchiness of oats. To add oats to a smoothie, pour ⁄4 cup (59 ml) of uncooked oats into your blender before adding your other ingredients. If you like your smoothies on the thicker side, add an additional ⁄4 cup (59 ml) of oats. Oats will naturally thicken your smoothie, so start with a smaller amount before you blend it. You can always add more later. Try some muesli for a different take on cereal. Muesli is a Swiss version of cereal that combines raw oats, nuts, seeds, and fruit. To make muesli, all you have to do is add 4 parts rolled oats, 1 part dried fruit (of your choice), and 1 part nuts/seeds in a small bowl with some milk. The mix can also be used to top toast. Use an almond or soy milk instead of standard milk if you’re not a fan of dairy. You can add more fruit if you’d like to make it sweeter. Making Oatmeal Combine your ingredients in a medium saucepan. Add your rolled oats, salt, and cinnamon to a saucepan with your milk and water. Bring it to a boil and then immediately reduce your heat to low. Do not cover your pan. This recipe will not work with steel cut oats. Make sure that you’re using rolled oats to make your oatmeal. You can substitute the milk with almond or soy milk if you want a dairy-free option. Simmer for 3-5 minutes based on your desired thickness. Stir occasionally while your oatmeal simmers. If you like your oatmeal to be a little thinner, check the thickness around the 3-minute mark. If you prefer thicker oatmeal, you probably want to wait a full 5 minutes. Pour your oatmeal into a large bowl and add your honey. Top your oatmeal with a teaspoon of honey. Mix the oatmeal and the honey together with your spoon. This will have the added benefit of helping your oatmeal cool while you’re mixing it. If honey is not your thing, you can use brown sugar, maple syrup, or even calorie-free sweeteners like stevia to sweeten your oatmeal. Add additional toppings based on your preferences. To play up the nutty flavor of oatmeal, add some almonds or walnuts to it. You can also mix in some fresh fruit to create a sweeter dish. Sliced bananas, blueberries, and cut strawberries make excellent additions to a standard bowl of oatmeal. Try mixing in some peanut butter for a thicker dish if you’re fond of peanuts. Try an instant oatmeal packet if you’re short on time. Instant oatmeal packets are a simple and easy alternative to homemade oatmeal. Most instant oatmeal simply requires you to heat a prepared packet of oat mix with water or milk in the microwave. While it doesn’t tend to be as healthy or delicious as the real thing, it can be spiced up all the same with fresh fruit, peanut butter, or nuts. When choosing between brands of instant oatmeal, it’s generally a good idea to buy varieties with lower sugar contents. Instant oatmeals are sometimes heavily sugared, so try to look for plain, ideally organic options that you can sweeten yourself. Baking Bread Mix your yeast into warm water and stir it. Use a medium bowl to combine your yeast and water. Mix the yeast and water for 1-2 minutes until the yeast has fully dissolved. Stir in your honey and set it aside for a few minutes. It should take 5-10 minutes for the yeast to bloom. You can tell if yeast has bloomed by checking to see if it has thickened and expanded a little bit. Look at the edges of your bowl—if the yeast is pushing out a little bit, then it’s ready for your flour. Stir your flours, oats, and salt in a large bowl. While you’re waiting for the yeast to rise, mix both flours, your oats, and a little salt with a wooden spoon. Stir aggressively to get the combination fully mixed, and run your spoon against the edges and bottom of the bowl to ensure that you’re not missing any chunks of flour or oats. Keep an eye on your yeast while you’re doing this. It should be rising steadily, but you don’t want to take too long or your yeast could start to deflate. Brush your loaf pan with some melted butter. Use a cooking brush to coat the entirety of your loaf pan to ensure that your bread doesn’t burn in the pan. Apply your butter liberally in back-and-forth strokes across every section of your pan and set it aside. Combine your ingredients in the large bowl. Add your flours and yeast together and mix it by hand. [[Knead Dough|Knead] your dough by rubbing it vigorously with your hands. Push sections of your dough together repeatedly to thicken it in the larger bowl to ensure that the flours and oats are mixed evenly throughout. Pour the contents into your 8-cup loaf pan. Bake your bread at 350 °F (177 °C) for 35-40 minutes. Place your bread in the center of the middle rack and let it bake until it is golden and pushing out from the top of the pan. After it has done baking, you can broil it for 30 seconds to give the top of your bread a crusty-brown crunch. Remove it from the oven and let it cool. You can brush the top of your bread with some melted butter if you’d like. Mixing Overnight Oats Find a small container or jar with a lockable lid. You can use any kind of small portable container– a small tupperware, a mason jar, or a glass bottle are good options. Anything that can hold at least a cup of liquid and can be closed with an airtight lid will be fine for making overnight oats. Do not use steel cut oats for this recipe. They can only be cooked in hot water based on the thickness of their grain. Pour your oats and milk or water into your container. Start by pouring your oats into your container and then adding your milk or water. Milk will result in creamier overnight oats, but use water if you’re sensitive to dairy. Add your chia seeds, salt, and fresh fruit. Pour your chia seeds into the container and then add a pinch of salt by grabbing some between your thumb and forefinger and dropping it into the oats. You can add any fresh fruit if you’d like. Strawberries, raspberries, and blueberries are all popular additions to overnight oats. Fruit will make your overnight oats a little sweeter, since they tend to be full of natural sugar. Close your container and shake it vigorously. Make sure that your lid is shut all the way before shaking it. Hold your container and shake it up and down for about 5 seconds to mix your ingredients together. Refrigerate your oats overnight and enjoy them in the morning. Leaving your oats overnight will give your oats time to soak in the milk or water. The result will taste like fresh oatmeal, except cold! Overnight oats make for the perfect morning snack, especially if you like to get out of the door quickly. If you prefer warm oatmeal, you can always heat your overnight oats in the microwave before eating them.",
  "sentences":[
    " Making Quick Snacks with Uncooked Oats Choose between rolled and steel cut oats.",
    "Steel cut oats are created by shredding oat grains with a machine, giving them a thicker consistency.",
    "Rolled oats are flattened, and tend to be easier to chew.",
    "They’re both healthy options, but your meal's texture will be affected by which variety you use– steel cut oats will be a little crunchier, while rolled oats tend to be quite soft.",
    "Try to avoid buying oats that are pre-mixed with sugar.",
    "While they may sound healthy, sugared oats aren’t as good for you.",
    "They also tend to be excessively sweet.",
    "If you’re cooking or baking, you probably want rolled oats.",
    "If you’re adding oats as a garnish or topping, steel-cut is preferable.",
    "Mix some oats into a cup of yogurt.",
    "You can turn that boring old bowl of yogurt into something entirely new with a few tablespoons of oats.",
    "Mixing oats into your yogurt will add a crunchy texture and a nutty flavor profile, which works well alongside the simple flavor of a fruit yogurt.",
    "Even if you aren’t a fan of the texture, you can mix a tablespoon of oats into yogurt and let it rest for a minute or two and they’ll soften into the yogurt.",
    "You can add oats to traditional or Greek yogurt.",
    "Add some oats to a smoothie.",
    "A smoothie can provide an excellent medium for oats, since the thick texture and fruity flavors will pair well with the mildly nutty crunchiness of oats.",
    "To add oats to a smoothie, pour ⁄4 cup (59 ml) of uncooked oats into your blender before adding your other ingredients.",
    "If you like your smoothies on the thicker side, add an additional ⁄4 cup (59 ml) of oats.",
    "Oats will naturally thicken your smoothie, so start with a smaller amount before you blend it.",
    "You can always add more later.",
    "Try some muesli for a different take on cereal.",
    "Muesli is a Swiss version of cereal that combines raw oats, nuts, seeds, and fruit.",
    "To make muesli, all you have to do is add 4 parts rolled oats, 1 part dried fruit (of your choice), and 1 part nuts/seeds in a small bowl with some milk.",
    "The mix can also be used to top toast.",
    "Use an almond or soy milk instead of standard milk if you’re not a fan of dairy.",
    "You can add more fruit if you’d like to make it sweeter.",
    "Making Oatmeal Combine your ingredients in a medium saucepan.",
    "Add your rolled oats, salt, and cinnamon to a saucepan with your milk and water.",
    "Bring it to a boil and then immediately reduce your heat to low.",
    "Do not cover your pan.",
    "This recipe will not work with steel cut oats.",
    "Make sure that you’re using rolled oats to make your oatmeal.",
    "You can substitute the milk with almond or soy milk if you want a dairy-free option.",
    "Simmer for 3-5 minutes based on your desired thickness.",
    "Stir occasionally while your oatmeal simmers.",
    "If you like your oatmeal to be a little thinner, check the thickness around the 3-minute mark.",
    "If you prefer thicker oatmeal, you probably want to wait a full 5 minutes.",
    "Pour your oatmeal into a large bowl and add your honey.",
    "Top your oatmeal with a teaspoon of honey.",
    "Mix the oatmeal and the honey together with your spoon.",
    "This will have the added benefit of helping your oatmeal cool while you’re mixing it.",
    "If honey is not your thing, you can use brown sugar, maple syrup, or even calorie-free sweeteners like stevia to sweeten your oatmeal.",
    "Add additional toppings based on your preferences.",
    "To play up the nutty flavor of oatmeal, add some almonds or walnuts to it.",
    "You can also mix in some fresh fruit to create a sweeter dish.",
    "Sliced bananas, blueberries, and cut strawberries make excellent additions to a standard bowl of oatmeal.",
    "Try mixing in some peanut butter for a thicker dish if you’re fond of peanuts.",
    "Try an instant oatmeal packet if you’re short on time.",
    "Instant oatmeal packets are a simple and easy alternative to homemade oatmeal.",
    "Most instant oatmeal simply requires you to heat a prepared packet of oat mix with water or milk in the microwave.",
    "While it doesn’t tend to be as healthy or delicious as the real thing, it can be spiced up all the same with fresh fruit, peanut butter, or nuts.",
    "When choosing between brands of instant oatmeal, it’s generally a good idea to buy varieties with lower sugar contents.",
    "Instant oatmeals are sometimes heavily sugared, so try to look for plain, ideally organic options that you can sweeten yourself.",
    "Baking Bread Mix your yeast into warm water and stir it.",
    "Use a medium bowl to combine your yeast and water.",
    "Mix the yeast and water for 1-2 minutes until the yeast has fully dissolved.",
    "Stir in your honey and set it aside for a few minutes.",
    "It should take 5-10 minutes for the yeast to bloom.",
    "You can tell if yeast has bloomed by checking to see if it has thickened and expanded a little bit.",
    "Look at the edges of your bowl—if the yeast is pushing out a little bit, then it’s ready for your flour.",
    "Stir your flours, oats, and salt in a large bowl.",
    "While you’re waiting for the yeast to rise, mix both flours, your oats, and a little salt with a wooden spoon.",
    "Stir aggressively to get the combination fully mixed, and run your spoon against the edges and bottom of the bowl to ensure that you’re not missing any chunks of flour or oats.",
    "Keep an eye on your yeast while you’re doing this.",
    "It should be rising steadily, but you don’t want to take too long or your yeast could start to deflate.",
    "Brush your loaf pan with some melted butter.",
    "Use a cooking brush to coat the entirety of your loaf pan to ensure that your bread doesn’t burn in the pan.",
    "Apply your butter liberally in back-and-forth strokes across every section of your pan and set it aside.",
    "Combine your ingredients in the large bowl.",
    "Add your flours and yeast together and mix it by hand.",
    "[[Knead Dough|Knead] your dough by rubbing it vigorously with your hands.",
    "Push sections of your dough together repeatedly to thicken it in the larger bowl to ensure that the flours and oats are mixed evenly throughout.",
    "Pour the contents into your 8-cup loaf pan.",
    "Bake your bread at 350 °F (177 °C) for 35-40 minutes.",
    "Place your bread in the center of the middle rack and let it bake until it is golden and pushing out from the top of the pan.",
    "After it has done baking, you can broil it for 30 seconds to give the top of your bread a crusty-brown crunch.",
    "Remove it from the oven and let it cool.",
    "You can brush the top of your bread with some melted butter if you’d like.",
    "Mixing Overnight Oats Find a small container or jar with a lockable lid.",
    "You can use any kind of small portable container– a small tupperware, a mason jar, or a glass bottle are good options.",
    "Anything that can hold at least a cup of liquid and can be closed with an airtight lid will be fine for making overnight oats.",
    "Do not use steel cut oats for this recipe.",
    "They can only be cooked in hot water based on the thickness of their grain.",
    "Pour your oats and milk or water into your container.",
    "Start by pouring your oats into your container and then adding your milk or water.",
    "Milk will result in creamier overnight oats, but use water if you’re sensitive to dairy.",
    "Add your chia seeds, salt, and fresh fruit.",
    "Pour your chia seeds into the container and then add a pinch of salt by grabbing some between your thumb and forefinger and dropping it into the oats.",
    "You can add any fresh fruit if you’d like.",
    "Strawberries, raspberries, and blueberries are all popular additions to overnight oats.",
    "Fruit will make your overnight oats a little sweeter, since they tend to be full of natural sugar.",
    "Close your container and shake it vigorously.",
    "Make sure that your lid is shut all the way before shaking it.",
    "Hold your container and shake it up and down for about 5 seconds to mix your ingredients together.",
    "Refrigerate your oats overnight and enjoy them in the morning.",
    "Leaving your oats overnight will give your oats time to soak in the milk or water.",
    "The result will taste like fresh oatmeal, except cold!",
    "Overnight oats make for the perfect morning snack, especially if you like to get out of the door quickly.",
    "If you prefer warm oatmeal, you can always heat your overnight oats in the microwave before eating them."
  ],
  "tyn_section":[
    "Medium pan",
    "Wooden spoon",
    "Medium bowl",
    "Large bowl",
    "8-cup loaf pan",
    "Cooking brush",
    "Container with lid"
  ],
  "tyn_model":[
    "oats",
    "milk",
    "water",
    "yogurt",
    "oatmeal",
    "salt",
    "honey",
    "flours",
    "nuts",
    "large bowl",
    "yeast",
    "bowl",
    "muesli",
    "cereal",
    "spoon",
    "blueberries",
    "strawberries",
    "peanut butter",
    "instant oatmeal",
    "microwave",
    "flour",
    "loaf pan",
    "butter",
    "container",
    "oat grains",
    "– steel",
    "greek yogurt",
    "blender",
    "fruit",
    "almond or soy milk",
    "medium saucepan",
    "cinnamon",
    "saucepan",
    "almond or",
    "brown sugar",
    "maple syrup",
    "almonds",
    "walnuts",
    "bananas",
    "peanuts",
    "oat",
    "medium bowl",
    "—if",
    "wooden spoon",
    "melted butter",
    "cooking brush",
    "8-cup loaf pan",
    "bread",
    "oven",
    "– a",
    "mason jar",
    "chia seeds",
    "raspberries",
    "overnight oats"
  ],
  "simple_metrics":{
    "r":0.7142857143,
    "p":0.0925925926,
    "f1":0.1639344262,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.1481481481,
    "f1":0.245398773
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.1851851852,
    "f1":0.3125
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.1111111111,
    "f1":0.1923076923
  }
}