{
  "title":"How to Cut Potatoes Into Fries",
  "url":"https://www.wikihow.com/Cut-Potatoes-Into-Fries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Cutting Techniques"
  ],
  "methods":[
    {
      "name":"Cutting Classic Fries",
      "steps":[
        {
          "headline":"Rinse and peel the potatoes.",
          "description":"For classic french fries, scrub russet potatoes under cold water and then remove the peels. To make them easier to handle, you can pat the potatoes dry with a towel before you put them on a cutting board. Cut away eyes or rotten parts from the potato."
        },
        {
          "headline":"Cut each potato into ⁄4 to ⁄4 inch (0.64 to 1.91 cm) slices.",
          "description":"Trim off a sliver from the bottom of a potato and set the flat part of the potato on your cutting board. Then, use a sharp knife to carefully cut ⁄4 to ⁄4 inch (0.64 to 1.91 cm) slices lengthwise. You'll now have several potato planks on your cutting board."
        },
        {
          "headline":"Stack the potato slices and cut them into ⁄4 inch (0.64 cm) wide strips.",
          "description":"Lay 2 to 3 slices of potato on top of each other and line them up. Then, slice the stack into ⁄4 to ⁄8 inch (0.64 to 0.95 cm) slices. Repeat this with all of the potato stacks. Try to make the slices as even as possible so your fries cook at the same rate."
        },
        {
          "headline":"Cook the classic fries until they're crispy.",
          "description":"Once you've cut the fries, you can fry them in a skillet or deep fryer. If you prefer, spread them on a baking sheet and bake them until they're browned. You can also make crispy french fries using an air fryer."
        }
      ]
    },
    {
      "name":"Using a Mandoline to Cut Shoestring Fries",
      "steps":[
        {
          "headline":"Adjust the mandoline to the very fine julienne setting.",
          "description":"Place the mandolin on a flat surface and follow the owner's manual to adjust the setting. You may need to insert an extra blade to julienne the potatoes or raise a knob to adjust the blade for very fine julienne. Your owner's manual may also recommend that you wet the surface of the mandoline with a few drops of water. This can help the potatoes slide across the blade easier. Always use extreme caution when working with the mandoline, since it's easy to accidentally cut yourself on its sharp blade."
        },
        {
          "headline":"Push a potato onto the safeguard.",
          "description":"Ensure that the rinsed potato is firmly in place and doesn't wiggle. If you'd like your shoestring fries without their skins, peel the potato before you put it on the safeguard.Variation: If you don't have a mandoline but want to make shoestring fries, try grating the potatoes against the coarse side of a box grater. Keep in mind that these fries will be much shorter."
        },
        {
          "headline":"Run the potato up and down the mandoline to slice it.",
          "description":"Hold the safeguard that has the potato stuck on it against the top of the mandoline's board. Rub it down the board so the julienne blade slices the potato into shoestrings. Keep going back and forth until all of the potato is cut."
        },
        {
          "headline":"Soak the shoestring potatoes until you're ready to fry them.",
          "description":"Put the cut potatoes into a bowl of ice water and let them soak for 10 minutes to remove excess starch. Then, drain the potatoes and pat them completely dry. Fry the shoestring fries in 350 °F (177 °C) oil for 2 to 4 minutes, depending on how crispy you like them. Fry about 1 cup (325 g) of shoestring fries at a time so you don't lower the temperature of the oil too quickly."
        }
      ]
    },
    {
      "name":"Chopping Potatoes for Home Fries",
      "steps":[
        {
          "headline":"Cut each potato into ⁄2 inch (1.3 cm) thick slices.",
          "description":"Rinse each potato under cold water and pat them completely dry. Set the potatoes on a cutting board and hold one securely with one hand. Use your other hand to carefully make ⁄2 inch (1.3 cm) thick slices lengthwise.Variation: If you're turning baked potatoes into home fries, remove the peels and then cut each potato in half. Then, cut the halves into ⁄2 inch (1.3 cm) slices. Decide if you'd like to peel the potatoes or leave the skins on. Keep in mind that the skin of russet potatoes can be tough."
        },
        {
          "headline":"Stack the slices of potato and cut them into ⁄2 inch (1.3 cm) wide strips.",
          "description":"Set aside the bottom slice of potato that's round so it's easier to cut the rest of the potato. Then, arrange the slices on top of each other and cut them into long strips. At this point, the cut potatoes will look like classic french fries."
        },
        {
          "headline":"Cut the potato strips into ⁄2 inch (1.3 cm) cubes.",
          "description":"Keep the potato strips together and use your knife to cut them at a 90-degree angle. You can make the cubes around ⁄2 inch (1.3 cm) if you want them to cook quickly or make them around 1 inch (2.5 cm) for more substantial home fries. Keep in mind that larger home fries will take longer to cook."
        },
        {
          "headline":"Cook the home fries in a skillet until they're crispy on the outside.",
          "description":"For the best texture, boil the chopped potatoes for about 5 minutes. Then, drain the potatoes well and fry them in a skillet for another 5 to 6 minutes over medium heat. If you're using already cooked potatoes, you don't need to boil them since they'll fry up quickly."
        }
      ]
    },
    {
      "name":"Making Wedges for Steak Fries",
      "steps":[
        {
          "headline":"Rinse the potatoes and pat them dry.",
          "description":"Get out your choice of potatoes and scrub them gently under cold water to remove dirt. Then, use a clean towel to dry them completely.Tip: It's important to thoroughly dry the potatoes so they crisp up in the oven. Most steak fries leave the skin on the potatoes, so there's no need to peel them."
        },
        {
          "headline":"Slice the potatoes at an angle to make ⁄2 inch (1.3 cm) thick wedges.",
          "description":"Cut each potato in half lengthwise and lay them flat on the cut side. Then, hold your knife at an angle and cut down across each potato half to make wedges. Don't worry if the wedges aren't perfectly even. If the potatoes are very long, you can cut the wedges in half crosswise so they cook faster."
        },
        {
          "headline":"Bake the steak fries for 30 to 40 minutes at 400 °F (204 °C).",
          "description":"Toss the wedges with a little oil and seasonings of your choice. Then, spread them in a single layer on a baking sheet and roast the fries until they're golden brown. To get the fries crisp on both sides, try to flip them over halfway through the baking time. For an easy seasoning, sprinkle the fries with a dry steak seasoning mix."
        }
      ]
    }
  ],
  "text":" Cutting Classic Fries Rinse and peel the potatoes. For classic french fries, scrub russet potatoes under cold water and then remove the peels. To make them easier to handle, you can pat the potatoes dry with a towel before you put them on a cutting board. Cut away eyes or rotten parts from the potato. Cut each potato into ⁄4 to ⁄4 inch (0.64 to 1.91 cm) slices. Trim off a sliver from the bottom of a potato and set the flat part of the potato on your cutting board. Then, use a sharp knife to carefully cut ⁄4 to ⁄4 inch (0.64 to 1.91 cm) slices lengthwise. You'll now have several potato planks on your cutting board. Stack the potato slices and cut them into ⁄4 inch (0.64 cm) wide strips. Lay 2 to 3 slices of potato on top of each other and line them up. Then, slice the stack into ⁄4 to ⁄8 inch (0.64 to 0.95 cm) slices. Repeat this with all of the potato stacks. Try to make the slices as even as possible so your fries cook at the same rate. Cook the classic fries until they're crispy. Once you've cut the fries, you can fry them in a skillet or deep fryer. If you prefer, spread them on a baking sheet and bake them until they're browned. You can also make crispy french fries using an air fryer. Using a Mandoline to Cut Shoestring Fries Adjust the mandoline to the very fine julienne setting. Place the mandolin on a flat surface and follow the owner's manual to adjust the setting. You may need to insert an extra blade to julienne the potatoes or raise a knob to adjust the blade for very fine julienne. Your owner's manual may also recommend that you wet the surface of the mandoline with a few drops of water. This can help the potatoes slide across the blade easier. Always use extreme caution when working with the mandoline, since it's easy to accidentally cut yourself on its sharp blade. Push a potato onto the safeguard. Ensure that the rinsed potato is firmly in place and doesn't wiggle. If you'd like your shoestring fries without their skins, peel the potato before you put it on the safeguard.Variation: If you don't have a mandoline but want to make shoestring fries, try grating the potatoes against the coarse side of a box grater. Keep in mind that these fries will be much shorter. Run the potato up and down the mandoline to slice it. Hold the safeguard that has the potato stuck on it against the top of the mandoline's board. Rub it down the board so the julienne blade slices the potato into shoestrings. Keep going back and forth until all of the potato is cut. Soak the shoestring potatoes until you're ready to fry them. Put the cut potatoes into a bowl of ice water and let them soak for 10 minutes to remove excess starch. Then, drain the potatoes and pat them completely dry. Fry the shoestring fries in 350 °F (177 °C) oil for 2 to 4 minutes, depending on how crispy you like them. Fry about 1 cup (325 g) of shoestring fries at a time so you don't lower the temperature of the oil too quickly. Chopping Potatoes for Home Fries Cut each potato into ⁄2 inch (1.3 cm) thick slices. Rinse each potato under cold water and pat them completely dry. Set the potatoes on a cutting board and hold one securely with one hand. Use your other hand to carefully make ⁄2 inch (1.3 cm) thick slices lengthwise.Variation: If you're turning baked potatoes into home fries, remove the peels and then cut each potato in half. Then, cut the halves into ⁄2 inch (1.3 cm) slices. Decide if you'd like to peel the potatoes or leave the skins on. Keep in mind that the skin of russet potatoes can be tough. Stack the slices of potato and cut them into ⁄2 inch (1.3 cm) wide strips. Set aside the bottom slice of potato that's round so it's easier to cut the rest of the potato. Then, arrange the slices on top of each other and cut them into long strips. At this point, the cut potatoes will look like classic french fries. Cut the potato strips into ⁄2 inch (1.3 cm) cubes. Keep the potato strips together and use your knife to cut them at a 90-degree angle. You can make the cubes around ⁄2 inch (1.3 cm) if you want them to cook quickly or make them around 1 inch (2.5 cm) for more substantial home fries. Keep in mind that larger home fries will take longer to cook. Cook the home fries in a skillet until they're crispy on the outside. For the best texture, boil the chopped potatoes for about 5 minutes. Then, drain the potatoes well and fry them in a skillet for another 5 to 6 minutes over medium heat. If you're using already cooked potatoes, you don't need to boil them since they'll fry up quickly. Making Wedges for Steak Fries Rinse the potatoes and pat them dry. Get out your choice of potatoes and scrub them gently under cold water to remove dirt. Then, use a clean towel to dry them completely.Tip: It's important to thoroughly dry the potatoes so they crisp up in the oven. Most steak fries leave the skin on the potatoes, so there's no need to peel them. Slice the potatoes at an angle to make ⁄2 inch (1.3 cm) thick wedges. Cut each potato in half lengthwise and lay them flat on the cut side. Then, hold your knife at an angle and cut down across each potato half to make wedges. Don't worry if the wedges aren't perfectly even. If the potatoes are very long, you can cut the wedges in half crosswise so they cook faster. Bake the steak fries for 30 to 40 minutes at 400 °F (204 °C). Toss the wedges with a little oil and seasonings of your choice. Then, spread them in a single layer on a baking sheet and roast the fries until they're golden brown. To get the fries crisp on both sides, try to flip them over halfway through the baking time. For an easy seasoning, sprinkle the fries with a dry steak seasoning mix.",
  "sentences":[
    " Cutting Classic Fries Rinse and peel the potatoes.",
    "For classic french fries, scrub russet potatoes under cold water and then remove the peels.",
    "To make them easier to handle, you can pat the potatoes dry with a towel before you put them on a cutting board.",
    "Cut away eyes or rotten parts from the potato.",
    "Cut each potato into ⁄4 to ⁄4 inch (0.64 to 1.91 cm) slices.",
    "Trim off a sliver from the bottom of a potato and set the flat part of the potato on your cutting board.",
    "Then, use a sharp knife to carefully cut ⁄4 to ⁄4 inch (0.64 to 1.91 cm) slices lengthwise.",
    "You'll now have several potato planks on your cutting board.",
    "Stack the potato slices and cut them into ⁄4 inch (0.64 cm) wide strips.",
    "Lay 2 to 3 slices of potato on top of each other and line them up.",
    "Then, slice the stack into ⁄4 to ⁄8 inch (0.64 to 0.95 cm) slices.",
    "Repeat this with all of the potato stacks.",
    "Try to make the slices as even as possible so your fries cook at the same rate.",
    "Cook the classic fries until they're crispy.",
    "Once you've cut the fries, you can fry them in a skillet or deep fryer.",
    "If you prefer, spread them on a baking sheet and bake them until they're browned.",
    "You can also make crispy french fries using an air fryer.",
    "Using a Mandoline to Cut Shoestring Fries Adjust the mandoline to the very fine julienne setting.",
    "Place the mandolin on a flat surface and follow the owner's manual to adjust the setting.",
    "You may need to insert an extra blade to julienne the potatoes or raise a knob to adjust the blade for very fine julienne.",
    "Your owner's manual may also recommend that you wet the surface of the mandoline with a few drops of water.",
    "This can help the potatoes slide across the blade easier.",
    "Always use extreme caution when working with the mandoline, since it's easy to accidentally cut yourself on its sharp blade.",
    "Push a potato onto the safeguard.",
    "Ensure that the rinsed potato is firmly in place and doesn't wiggle.",
    "If you'd like your shoestring fries without their skins, peel the potato before you put it on the safeguard.Variation: If you don't have a mandoline but want to make shoestring fries, try grating the potatoes against the coarse side of a box grater.",
    "Keep in mind that these fries will be much shorter.",
    "Run the potato up and down the mandoline to slice it.",
    "Hold the safeguard that has the potato stuck on it against the top of the mandoline's board.",
    "Rub it down the board so the julienne blade slices the potato into shoestrings.",
    "Keep going back and forth until all of the potato is cut.",
    "Soak the shoestring potatoes until you're ready to fry them.",
    "Put the cut potatoes into a bowl of ice water and let them soak for 10 minutes to remove excess starch.",
    "Then, drain the potatoes and pat them completely dry.",
    "Fry the shoestring fries in 350 °F (177 °C) oil for 2 to 4 minutes, depending on how crispy you like them.",
    "Fry about 1 cup (325 g) of shoestring fries at a time so you don't lower the temperature of the oil too quickly.",
    "Chopping Potatoes for Home Fries Cut each potato into ⁄2 inch (1.3 cm) thick slices.",
    "Rinse each potato under cold water and pat them completely dry.",
    "Set the potatoes on a cutting board and hold one securely with one hand.",
    "Use your other hand to carefully make ⁄2 inch (1.3 cm) thick slices lengthwise.Variation: If you're turning baked potatoes into home fries, remove the peels and then cut each potato in half.",
    "Then, cut the halves into ⁄2 inch (1.3 cm) slices.",
    "Decide if you'd like to peel the potatoes or leave the skins on.",
    "Keep in mind that the skin of russet potatoes can be tough.",
    "Stack the slices of potato and cut them into ⁄2 inch (1.3 cm) wide strips.",
    "Set aside the bottom slice of potato that's round so it's easier to cut the rest of the potato.",
    "Then, arrange the slices on top of each other and cut them into long strips.",
    "At this point, the cut potatoes will look like classic french fries.",
    "Cut the potato strips into ⁄2 inch (1.3 cm) cubes.",
    "Keep the potato strips together and use your knife to cut them at a 90-degree angle.",
    "You can make the cubes around ⁄2 inch (1.3 cm) if you want them to cook quickly or make them around 1 inch (2.5 cm) for more substantial home fries.",
    "Keep in mind that larger home fries will take longer to cook.",
    "Cook the home fries in a skillet until they're crispy on the outside.",
    "For the best texture, boil the chopped potatoes for about 5 minutes.",
    "Then, drain the potatoes well and fry them in a skillet for another 5 to 6 minutes over medium heat.",
    "If you're using already cooked potatoes, you don't need to boil them since they'll fry up quickly.",
    "Making Wedges for Steak Fries Rinse the potatoes and pat them dry.",
    "Get out your choice of potatoes and scrub them gently under cold water to remove dirt.",
    "Then, use a clean towel to dry them completely.Tip: It's important to thoroughly dry the potatoes so they crisp up in the oven.",
    "Most steak fries leave the skin on the potatoes, so there's no need to peel them.",
    "Slice the potatoes at an angle to make ⁄2 inch (1.3 cm) thick wedges.",
    "Cut each potato in half lengthwise and lay them flat on the cut side.",
    "Then, hold your knife at an angle and cut down across each potato half to make wedges.",
    "Don't worry if the wedges aren't perfectly even.",
    "If the potatoes are very long, you can cut the wedges in half crosswise so they cook faster.",
    "Bake the steak fries for 30 to 40 minutes at 400 °F (204 °C).",
    "Toss the wedges with a little oil and seasonings of your choice.",
    "Then, spread them in a single layer on a baking sheet and roast the fries until they're golden brown.",
    "To get the fries crisp on both sides, try to flip them over halfway through the baking time.",
    "For an easy seasoning, sprinkle the fries with a dry steak seasoning mix."
  ],
  "tyn_section":[
    "Knife",
    "Cutting board",
    "Vegetable peeler, optional",
    "Vegetable peeler",
    "Mandoline",
    "Bowl",
    "Skillet",
    "Kitchen towel"
  ],
  "tyn_model":[
    "potatoes",
    "potato",
    "mandoline",
    "cutting board",
    "skillet",
    "water",
    "oil",
    "french fries",
    "russet potatoes",
    "baking sheet",
    "shoestring fries",
    "knife",
    "steak fries",
    "sharp knife",
    "potato planks",
    "deep fryer",
    "air fryer",
    "mandolin",
    "box grater",
    "julienne blade",
    "bowl",
    "ice water",
    "baked potatoes",
    "home fries",
    "oven",
    "seasonings",
    "steak seasoning"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.1851851852,
    "f1":0.2857142857,
    "avg_pos":0.4074074074
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.2222222222,
    "f1":0.3278688525
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.2222222222,
    "f1":0.3278688525
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.1851851852,
    "f1":0.2857142857
  }
}