{
  "title":"How to Grill Shrimp",
  "url":"https://www.wikihow.com/Grill-Shrimp",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Prawns and Shrimp"
  ],
  "methods":[
    {
      "name":"Cleaning and Seasoning the Shrimp",
      "steps":[
        {
          "headline":"Buy large frozen or fresh shrimp.",
          "description":"Jumbo and larger variations of shrimp are the best for grilling because they won’t fall through the grates of the grill and are easier to handle than smaller shrimp. Smaller shrimp are also more likely to overcook on the grill, which could lead to a rubbery or tough texture. Buy U/10 or U/20 shrimp. This means that there is either 10 or 20 shrimp per pound. Cook fresh shrimp the same day that you purchase them or freeze them If you plan on making them later. When you bring fresh shrimp home, keep them on a bed of ice so that they don’t go bad."
        },
        {
          "headline":"Thaw the shrimp if they are frozen.",
          "description":"You can leave the frozen shrimp in the refrigerator overnight, or rinse the shrimp under cold water for an hour. Once the shrimp are thawed, rinse them one last time under cold water and drain them in a colander. Then, use paper towels to pat them dry. When the shrimp are thawed, they should appear slightly translucent."
        },
        {
          "headline":"Peel the shrimp if you have to devein them.",
          "description":"You’ll know you have to devein the shrimp if there is a black vein running down the back of the shrimp. Start at the top of the shrimp and cut through shrimp’s shell with a pair of scissors. You can cut all the way down the tail, or stop before the tail to keep it on. Peel away the excess shell and throw it away. If you keep the tail on, it can serve as your handle for dipping and eating the grilled seafood. Don’t cut through the meat of the shrimp. Leaving the shell on may make your shrimp more flavorful."
        },
        {
          "headline":"Devein the shrimp if necessary.",
          "description":"Use a small, sharp knife to cut down the back of each peeled shrimp. Pull out the back vein and rinse the shrimp under cold water. You can purchase deveined shrimp at the grocery store."
        },
        {
          "headline":"Coat the shrimp with olive oil and sprinkle salt, pepper, and lemon juice.",
          "description":"Pour the olive oil and lemon juice over the shrimp, then sprinkle the spices on top of them. Toss the shrimp so that they are evenly covered in spices. This will enhance the flavor and add citrus notes to the shrimp. Experiment with other spices, like garlic powder, cumin, and ginger to impart different flavors to the shrimp."
        },
        {
          "headline":"Marinate your shrimp for extra flavor.",
          "description":"Create a marinade by combining oil and barbeque or hot sauce in a bowl. Add other flavors to the marinade like garlic, salt, pepper, and/or cumin. Coat the shrimp thoroughly in the marinade and leave the shrimp in the bowl for 30 minutes to an hour. You can also add ingredients like parsley, sugar, and lemon juice to the marinade. You can also purchase store-bought marinades as an alternative to making your own."
        }
      ]
    },
    {
      "name":"Grilling Shrimp Skewers",
      "steps":[
        {
          "headline":"Skewer the shrimp.",
          "description":"Purchase wooden or metal skewers from the grocery store or online. Drive the skewer through the tail and into the midsection of the shrimp to secure it to the skewer. The shrimp should be in a U shape on the skewer. Repeat this process until all of your shrimp are on skewers. If you use wooden skewers, soak them in water for a few hours before you start grilling so that they don’t catch on fire as you grill. You can also use a grilling basket instead of skewers if you have one."
        },
        {
          "headline":"Preheat the grill to 350–450 °F (177–232 °C).",
          "description":"Turn the knobs on the grill to preheat it if you’re using a gas grill. If you are using a charcoal grill, load the charcoal into the bottom of the grill and stack the charcoal in a pyramid shape. Then, pour lighter fluid over the charcoal and ignite it with a grill lighter. Let the fire on the coals go out and allow them to heat up for 10 minutes before you start grilling the shrimp. Some charcoal grills have an electric starter. If this is the case, hit the button or switch to ignite the coals after you’ve loaded it. It will take anywhere from 8-10 minutes for the coals to heat up. Preheating your grill will give the shrimp a more even cook."
        },
        {
          "headline":"Place the shrimp on the grill for 3 minutes.",
          "description":"You should hear the shrimp sizzle as it makes contact with the grill. As the shrimp cooks, the outside of the shrimp should turn a nice pink color when it is cooked while the meat inside should turn white and opaque."
        },
        {
          "headline":"Flip the shrimp over and cook for another 3 minutes.",
          "description":"Flip the shrimp over on the grill with a pair of tongs to evenly cook the other side. Do not overcook the shrimp or else it might become tough and chewy. The shrimp should curl up once they are cooked."
        },
        {
          "headline":"Remove the shrimp from the grill and serve them.",
          "description":"Place the shrimp on a plate and let them cool for 2-3 minutes before serving them. Grilled shrimp taste great with a vegetable side like corn or on their own! You can serve the shrimp on the skewers or remove them from the skewers and serve them separately. You can keep the leftover shrimp sealed in the refrigerator for 3-4 days."
        }
      ]
    },
    {
      "name":"Using Foil to Grill Shrimp",
      "steps":[
        {
          "headline":"Set your grill to 350–450 °F (177–232 °C).",
          "description":"If you're using a gas grill, you can set the temperature by turning the knobs on the front of the grill. If you're using a charcoal grill, pile the charcoal in a pyramid shape on the bottom of the grill. Use lighter fluid and a lighter to ignite the coals. Let the fire die, then wait 10 minutes so that all of the coals are at the right temperature. If you have an automatic starter, press the start button after you've loaded the grill with charcoal."
        },
        {
          "headline":"Place the shrimp in a piece of foil.",
          "description":"Unroll a sheet of foil that’s large enough to accommodate all of the shrimp that you want to grill. Lay the foil out on a flat surface and dump the shrimp into the middle of the tin foil. You can also add other ingredients like corn, sausage, and garlic to the packet. If you are grilling a lot of shrimp, you may want to create multiple packets."
        },
        {
          "headline":"Fold up the sides of the foil to create a packet.",
          "description":"Fold up the sides of the tin foil so that they are completely covered. Roll the top and bottom edge of the tin foil to keep them in a contained packet. Make sure that the packets are completely sealed before putting them on the grill."
        },
        {
          "headline":"Place the foil packet on the grill for 10-15 minutes.",
          "description":"If you added additional ingredients to the packet, cook the shrimp on the longer side. As the shrimp cooks, it will absorb the spices and marinade in the packet."
        },
        {
          "headline":"Unwrap the foil and serve immediately.",
          "description":"Use a pair of tongs to remove the tin foil packet from the grill. Open the top of the packet and serve the shrimp immediately. To add extra flavor season the shrimp with parsley, lemon juice, or butter after it’s cooked."
        }
      ]
    }
  ],
  "text":" Cleaning and Seasoning the Shrimp Buy large frozen or fresh shrimp. Jumbo and larger variations of shrimp are the best for grilling because they won’t fall through the grates of the grill and are easier to handle than smaller shrimp. Smaller shrimp are also more likely to overcook on the grill, which could lead to a rubbery or tough texture. Buy U/10 or U/20 shrimp. This means that there is either 10 or 20 shrimp per pound. Cook fresh shrimp the same day that you purchase them or freeze them If you plan on making them later. When you bring fresh shrimp home, keep them on a bed of ice so that they don’t go bad. Thaw the shrimp if they are frozen. You can leave the frozen shrimp in the refrigerator overnight, or rinse the shrimp under cold water for an hour. Once the shrimp are thawed, rinse them one last time under cold water and drain them in a colander. Then, use paper towels to pat them dry. When the shrimp are thawed, they should appear slightly translucent. Peel the shrimp if you have to devein them. You’ll know you have to devein the shrimp if there is a black vein running down the back of the shrimp. Start at the top of the shrimp and cut through shrimp’s shell with a pair of scissors. You can cut all the way down the tail, or stop before the tail to keep it on. Peel away the excess shell and throw it away. If you keep the tail on, it can serve as your handle for dipping and eating the grilled seafood. Don’t cut through the meat of the shrimp. Leaving the shell on may make your shrimp more flavorful. Devein the shrimp if necessary. Use a small, sharp knife to cut down the back of each peeled shrimp. Pull out the back vein and rinse the shrimp under cold water. You can purchase deveined shrimp at the grocery store. Coat the shrimp with olive oil and sprinkle salt, pepper, and lemon juice. Pour the olive oil and lemon juice over the shrimp, then sprinkle the spices on top of them. Toss the shrimp so that they are evenly covered in spices. This will enhance the flavor and add citrus notes to the shrimp. Experiment with other spices, like garlic powder, cumin, and ginger to impart different flavors to the shrimp. Marinate your shrimp for extra flavor. Create a marinade by combining oil and barbeque or hot sauce in a bowl. Add other flavors to the marinade like garlic, salt, pepper, and/or cumin. Coat the shrimp thoroughly in the marinade and leave the shrimp in the bowl for 30 minutes to an hour. You can also add ingredients like parsley, sugar, and lemon juice to the marinade. You can also purchase store-bought marinades as an alternative to making your own. Grilling Shrimp Skewers Skewer the shrimp. Purchase wooden or metal skewers from the grocery store or online. Drive the skewer through the tail and into the midsection of the shrimp to secure it to the skewer. The shrimp should be in a U shape on the skewer. Repeat this process until all of your shrimp are on skewers. If you use wooden skewers, soak them in water for a few hours before you start grilling so that they don’t catch on fire as you grill. You can also use a grilling basket instead of skewers if you have one. Preheat the grill to 350–450 °F (177–232 °C). Turn the knobs on the grill to preheat it if you’re using a gas grill. If you are using a charcoal grill, load the charcoal into the bottom of the grill and stack the charcoal in a pyramid shape. Then, pour lighter fluid over the charcoal and ignite it with a grill lighter. Let the fire on the coals go out and allow them to heat up for 10 minutes before you start grilling the shrimp. Some charcoal grills have an electric starter. If this is the case, hit the button or switch to ignite the coals after you’ve loaded it. It will take anywhere from 8-10 minutes for the coals to heat up. Preheating your grill will give the shrimp a more even cook. Place the shrimp on the grill for 3 minutes. You should hear the shrimp sizzle as it makes contact with the grill. As the shrimp cooks, the outside of the shrimp should turn a nice pink color when it is cooked while the meat inside should turn white and opaque. Flip the shrimp over and cook for another 3 minutes. Flip the shrimp over on the grill with a pair of tongs to evenly cook the other side. Do not overcook the shrimp or else it might become tough and chewy. The shrimp should curl up once they are cooked. Remove the shrimp from the grill and serve them. Place the shrimp on a plate and let them cool for 2-3 minutes before serving them. Grilled shrimp taste great with a vegetable side like corn or on their own! You can serve the shrimp on the skewers or remove them from the skewers and serve them separately. You can keep the leftover shrimp sealed in the refrigerator for 3-4 days. Using Foil to Grill Shrimp Set your grill to 350–450 °F (177–232 °C). If you're using a gas grill, you can set the temperature by turning the knobs on the front of the grill. If you're using a charcoal grill, pile the charcoal in a pyramid shape on the bottom of the grill. Use lighter fluid and a lighter to ignite the coals. Let the fire die, then wait 10 minutes so that all of the coals are at the right temperature. If you have an automatic starter, press the start button after you've loaded the grill with charcoal. Place the shrimp in a piece of foil. Unroll a sheet of foil that’s large enough to accommodate all of the shrimp that you want to grill. Lay the foil out on a flat surface and dump the shrimp into the middle of the tin foil. You can also add other ingredients like corn, sausage, and garlic to the packet. If you are grilling a lot of shrimp, you may want to create multiple packets. Fold up the sides of the foil to create a packet. Fold up the sides of the tin foil so that they are completely covered. Roll the top and bottom edge of the tin foil to keep them in a contained packet. Make sure that the packets are completely sealed before putting them on the grill. Place the foil packet on the grill for 10-15 minutes. If you added additional ingredients to the packet, cook the shrimp on the longer side. As the shrimp cooks, it will absorb the spices and marinade in the packet. Unwrap the foil and serve immediately. Use a pair of tongs to remove the tin foil packet from the grill. Open the top of the packet and serve the shrimp immediately. To add extra flavor season the shrimp with parsley, lemon juice, or butter after it’s cooked.",
  "sentences":[
    " Cleaning and Seasoning the Shrimp Buy large frozen or fresh shrimp.",
    "Jumbo and larger variations of shrimp are the best for grilling because they won’t fall through the grates of the grill and are easier to handle than smaller shrimp.",
    "Smaller shrimp are also more likely to overcook on the grill, which could lead to a rubbery or tough texture.",
    "Buy U/10 or U/20 shrimp.",
    "This means that there is either 10 or 20 shrimp per pound.",
    "Cook fresh shrimp the same day that you purchase them or freeze them If you plan on making them later.",
    "When you bring fresh shrimp home, keep them on a bed of ice so that they don’t go bad.",
    "Thaw the shrimp if they are frozen.",
    "You can leave the frozen shrimp in the refrigerator overnight, or rinse the shrimp under cold water for an hour.",
    "Once the shrimp are thawed, rinse them one last time under cold water and drain them in a colander.",
    "Then, use paper towels to pat them dry.",
    "When the shrimp are thawed, they should appear slightly translucent.",
    "Peel the shrimp if you have to devein them.",
    "You’ll know you have to devein the shrimp if there is a black vein running down the back of the shrimp.",
    "Start at the top of the shrimp and cut through shrimp’s shell with a pair of scissors.",
    "You can cut all the way down the tail, or stop before the tail to keep it on.",
    "Peel away the excess shell and throw it away.",
    "If you keep the tail on, it can serve as your handle for dipping and eating the grilled seafood.",
    "Don’t cut through the meat of the shrimp.",
    "Leaving the shell on may make your shrimp more flavorful.",
    "Devein the shrimp if necessary.",
    "Use a small, sharp knife to cut down the back of each peeled shrimp.",
    "Pull out the back vein and rinse the shrimp under cold water.",
    "You can purchase deveined shrimp at the grocery store.",
    "Coat the shrimp with olive oil and sprinkle salt, pepper, and lemon juice.",
    "Pour the olive oil and lemon juice over the shrimp, then sprinkle the spices on top of them.",
    "Toss the shrimp so that they are evenly covered in spices.",
    "This will enhance the flavor and add citrus notes to the shrimp.",
    "Experiment with other spices, like garlic powder, cumin, and ginger to impart different flavors to the shrimp.",
    "Marinate your shrimp for extra flavor.",
    "Create a marinade by combining oil and barbeque or hot sauce in a bowl.",
    "Add other flavors to the marinade like garlic, salt, pepper, and/or cumin.",
    "Coat the shrimp thoroughly in the marinade and leave the shrimp in the bowl for 30 minutes to an hour.",
    "You can also add ingredients like parsley, sugar, and lemon juice to the marinade.",
    "You can also purchase store-bought marinades as an alternative to making your own.",
    "Grilling Shrimp Skewers Skewer the shrimp.",
    "Purchase wooden or metal skewers from the grocery store or online.",
    "Drive the skewer through the tail and into the midsection of the shrimp to secure it to the skewer.",
    "The shrimp should be in a U shape on the skewer.",
    "Repeat this process until all of your shrimp are on skewers.",
    "If you use wooden skewers, soak them in water for a few hours before you start grilling so that they don’t catch on fire as you grill.",
    "You can also use a grilling basket instead of skewers if you have one.",
    "Preheat the grill to 350–450 °F (177–232 °C).",
    "Turn the knobs on the grill to preheat it if you’re using a gas grill.",
    "If you are using a charcoal grill, load the charcoal into the bottom of the grill and stack the charcoal in a pyramid shape.",
    "Then, pour lighter fluid over the charcoal and ignite it with a grill lighter.",
    "Let the fire on the coals go out and allow them to heat up for 10 minutes before you start grilling the shrimp.",
    "Some charcoal grills have an electric starter.",
    "If this is the case, hit the button or switch to ignite the coals after you’ve loaded it.",
    "It will take anywhere from 8-10 minutes for the coals to heat up.",
    "Preheating your grill will give the shrimp a more even cook.",
    "Place the shrimp on the grill for 3 minutes.",
    "You should hear the shrimp sizzle as it makes contact with the grill.",
    "As the shrimp cooks, the outside of the shrimp should turn a nice pink color when it is cooked while the meat inside should turn white and opaque.",
    "Flip the shrimp over and cook for another 3 minutes.",
    "Flip the shrimp over on the grill with a pair of tongs to evenly cook the other side.",
    "Do not overcook the shrimp or else it might become tough and chewy.",
    "The shrimp should curl up once they are cooked.",
    "Remove the shrimp from the grill and serve them.",
    "Place the shrimp on a plate and let them cool for 2-3 minutes before serving them.",
    "Grilled shrimp taste great with a vegetable side like corn or on their own!",
    "You can serve the shrimp on the skewers or remove them from the skewers and serve them separately.",
    "You can keep the leftover shrimp sealed in the refrigerator for 3-4 days.",
    "Using Foil to Grill Shrimp Set your grill to 350–450 °F (177–232 °C).",
    "If you're using a gas grill, you can set the temperature by turning the knobs on the front of the grill.",
    "If you're using a charcoal grill, pile the charcoal in a pyramid shape on the bottom of the grill.",
    "Use lighter fluid and a lighter to ignite the coals.",
    "Let the fire die, then wait 10 minutes so that all of the coals are at the right temperature.",
    "If you have an automatic starter, press the start button after you've loaded the grill with charcoal.",
    "Place the shrimp in a piece of foil.",
    "Unroll a sheet of foil that’s large enough to accommodate all of the shrimp that you want to grill.",
    "Lay the foil out on a flat surface and dump the shrimp into the middle of the tin foil.",
    "You can also add other ingredients like corn, sausage, and garlic to the packet.",
    "If you are grilling a lot of shrimp, you may want to create multiple packets.",
    "Fold up the sides of the foil to create a packet.",
    "Fold up the sides of the tin foil so that they are completely covered.",
    "Roll the top and bottom edge of the tin foil to keep them in a contained packet.",
    "Make sure that the packets are completely sealed before putting them on the grill.",
    "Place the foil packet on the grill for 10-15 minutes.",
    "If you added additional ingredients to the packet, cook the shrimp on the longer side.",
    "As the shrimp cooks, it will absorb the spices and marinade in the packet.",
    "Unwrap the foil and serve immediately.",
    "Use a pair of tongs to remove the tin foil packet from the grill.",
    "Open the top of the packet and serve the shrimp immediately.",
    "To add extra flavor season the shrimp with parsley, lemon juice, or butter after it’s cooked."
  ],
  "tyn_section":[
    "Grill",
    "Skewers",
    "Tongs",
    "Knife",
    "Charcoal (if using a charcoal grill)",
    "Grill basket (optional)",
    "Tinfoil"
  ],
  "tyn_model":[
    "shrimp",
    "grill",
    "foil",
    "charcoal",
    "lemon juice",
    "tin foil",
    "water",
    "refrigerator",
    "olive oil",
    "salt",
    "pepper",
    "spices",
    "cumin",
    "bowl",
    "garlic",
    "parsley",
    "skewers",
    "gas grill",
    "charcoal grill",
    "lighter fluid",
    "ice",
    "colander",
    "paper towels",
    "scissors",
    "seafood",
    "knife",
    "garlic powder",
    "ginger",
    "oil",
    "barbeque or hot sauce",
    "sugar",
    "grilling shrimp skewers",
    "skewer",
    "grilling basket",
    "grill lighter",
    "charcoal grills",
    "electric starter",
    "plate",
    "lighter",
    "butter"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.075,
    "f1":0.1276595745,
    "avg_pos":0.025
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.15,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5714285714,
    "p":0.175,
    "f1":0.2679425837
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.075,
    "f1":0.1276595745
  }
}