{
  "title":"How to Clean the Bottom of an Oven",
  "url":"https://www.wikihow.com/Clean-the-Bottom-of-an-Oven",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Using the Self-Cleaning Cycle",
      "steps":[
        {
          "headline":"Clear out the oven before you clean it.",
          "description":"Take out all of the oven racks so you can reach and clean the bottom more easily. Remove any other items like a pizza stone, baking stone, or any trays that may have been left in there. Clean the oven racks before you put them back into the oven after you clean the bottom. This can also be a good time to clean any baking stones or pizza stones you typically keep in the oven, particularly if there are stubborn stains on the stone that weren't removed when you performed regular cleaning after use."
        },
        {
          "headline":"Remove large food particles from the bottom of the oven.",
          "description":"Use an old sponge, paper towels, or a cloth to scrub off large bits of food and grease that may have collected on the bottom of your oven. Lots of built up grease and food can prevent a cleaning solution from being effective. A cleaning solution will be more effective when it’s applied directly to the surface of the bottom of the oven, rather than a large chunk of food."
        },
        {
          "headline":"Use your oven’s self-cleaning cycle.",
          "description":"If your oven has a self-cleaning cycle, allow it to run until it’s finished. Self-cleaning cycles will bake the grease and food particles and make them dry and crispy so they’re easier to remove. Depending on your oven, self-cleaning cycles can take up to 3 hours.Warning: Grease can create toxic smoke. If the oven begins to fill with lots of smoke, you may need to turn it off and clean the bottom of your oven by hand."
        },
        {
          "headline":"Wipe the bottom of your oven with a damp rag or paper towel.",
          "description":"After your oven has finished its self-cleaning cycle, there will be a layer of ash on the bottom of the oven. Use a damp cloth or paper towel to remove all of the ash from the inside of your oven before you add any cleaning solutions or it could cake together."
        }
      ]
    },
    {
      "name":"Applying an Industrial Cleaning Product",
      "steps":[
        {
          "headline":"Put on rubber cleaning gloves and safety glasses.",
          "description":"Chemical oven cleaners can be really caustic and can burn your skin and eyes. Wear safety glasses and a pair of sturdy rubber cleaning gloves to create a heavy-duty barrier between your skin and the oven cleaner. Don’t use disposable gloves as they may not be enough to prevent the cleaner from getting onto your skin."
        },
        {
          "headline":"Lay down newspapers or paper towels on the floor in front of the oven.",
          "description":"When you apply the oven cleaner to the bottom of your oven, some of it may spill or run out of the oven. Use newspapers or paper towels to soak up any excess cleaner."
        },
        {
          "headline":"Spray the cleaner onto the bottom of the oven using a sweeping motion.",
          "description":"Hold the spray can of cleaner about 8–10 inches (20–25 cm) from the surface of the bottom of the oven and apply the cleaner using back and forth sweeping motions.Tip: Do not spray on the heating elements of the oven or it could cause problems when you turn on your oven to use it. Keep the cleaning spray contained to the bottom of the oven."
        },
        {
          "headline":"Let the cleaner sit for at least 30 minutes.",
          "description":"Check the can to see the specific waiting time, but most oven cleaners need to sit for 30 minutes before you wipe it clean. Don’t disturb the oven while the cleaner is working. Keep the oven closed so the fumes are contained."
        },
        {
          "headline":"Wipe the bottom of the oven clean with a damp cloth.",
          "description":"After the oven cleaner has been allowed to sit for 30 minutes, open the oven and use a damp cloth to wipe the bottom clean. If there are any sticky patches of residue, you can use a scrub brush or sponge to scrub it. Get into the corners and crevices to remove all of the dirt and the cleaner."
        }
      ]
    },
    {
      "name":"Using Natural Cleaning Alternatives",
      "steps":[
        {
          "headline":"Use baking soda and vinegar to clean without toxic chemicals.",
          "description":"Mix ⁄2 cup (120 mL) of baking soda with 3 tablespoons (44 mL) of water in a bowl, and mix it to form a thick paste. Spread the paste on the bottom of your oven and let it sit for 12 hours, or overnight. Then wipe the bottom of your oven with a damp cloth. Fill a spray bottle with white vinegar, spray the inside of the oven, and wipe away the foamy mixture. The white vinegar will react with the baking soda and make a foamy cleaning mixture. You don’t need to let the foam sit in the oven. Wipe the oven clean right after you spray the vinegar. If you’re in a hurry, apply the baking soda paste, let it sit for 15 minutes, and then spray it with vinegar and wipe it away.Tip: Use a pumice or microfiber sponge for any difficult-to-remove stains."
        },
        {
          "headline":"Bake lemons in your oven to clean the bottom.",
          "description":"Preheat your oven to 250 °F (121 °C) and fill an oven-safe bowl about ⅓ of the way full with clean water. Slice 2 lemons in half and squeeze the juice into the water and then drop the lemons into the bowl of water. Place the bowl on a center rack and let it bake for 1 hour, then use a damp cloth to wipe the bottom of your oven. Let the oven cool down enough to where it’s still warm, but you can reach into it to wipe the bottom. Use a wet scouring pumice or microfiber sponge to scrub difficult stains."
        },
        {
          "headline":"Spread salt onto the bottom of the oven to clean it.",
          "description":"Preheat your oven to 150 °F (66 °C) and sprinkle regular table salt all over the bottom of the oven. Put on oven mitts to protect your hands and use a damp sponge or rag to scrub the bottom of the oven while the oven is still warm. The salt acts as an abrasive and will make the grime easy to wipe away."
        }
      ]
    }
  ],
  "text":" Using the Self-Cleaning Cycle Clear out the oven before you clean it. Take out all of the oven racks so you can reach and clean the bottom more easily. Remove any other items like a pizza stone, baking stone, or any trays that may have been left in there. Clean the oven racks before you put them back into the oven after you clean the bottom. This can also be a good time to clean any baking stones or pizza stones you typically keep in the oven, particularly if there are stubborn stains on the stone that weren't removed when you performed regular cleaning after use. Remove large food particles from the bottom of the oven. Use an old sponge, paper towels, or a cloth to scrub off large bits of food and grease that may have collected on the bottom of your oven. Lots of built up grease and food can prevent a cleaning solution from being effective. A cleaning solution will be more effective when it’s applied directly to the surface of the bottom of the oven, rather than a large chunk of food. Use your oven’s self-cleaning cycle. If your oven has a self-cleaning cycle, allow it to run until it’s finished. Self-cleaning cycles will bake the grease and food particles and make them dry and crispy so they’re easier to remove. Depending on your oven, self-cleaning cycles can take up to 3 hours.Warning: Grease can create toxic smoke. If the oven begins to fill with lots of smoke, you may need to turn it off and clean the bottom of your oven by hand. Wipe the bottom of your oven with a damp rag or paper towel. After your oven has finished its self-cleaning cycle, there will be a layer of ash on the bottom of the oven. Use a damp cloth or paper towel to remove all of the ash from the inside of your oven before you add any cleaning solutions or it could cake together. Applying an Industrial Cleaning Product Put on rubber cleaning gloves and safety glasses. Chemical oven cleaners can be really caustic and can burn your skin and eyes. Wear safety glasses and a pair of sturdy rubber cleaning gloves to create a heavy-duty barrier between your skin and the oven cleaner. Don’t use disposable gloves as they may not be enough to prevent the cleaner from getting onto your skin. Lay down newspapers or paper towels on the floor in front of the oven. When you apply the oven cleaner to the bottom of your oven, some of it may spill or run out of the oven. Use newspapers or paper towels to soak up any excess cleaner. Spray the cleaner onto the bottom of the oven using a sweeping motion. Hold the spray can of cleaner about 8–10 inches (20–25 cm) from the surface of the bottom of the oven and apply the cleaner using back and forth sweeping motions.Tip: Do not spray on the heating elements of the oven or it could cause problems when you turn on your oven to use it. Keep the cleaning spray contained to the bottom of the oven. Let the cleaner sit for at least 30 minutes. Check the can to see the specific waiting time, but most oven cleaners need to sit for 30 minutes before you wipe it clean. Don’t disturb the oven while the cleaner is working. Keep the oven closed so the fumes are contained. Wipe the bottom of the oven clean with a damp cloth. After the oven cleaner has been allowed to sit for 30 minutes, open the oven and use a damp cloth to wipe the bottom clean. If there are any sticky patches of residue, you can use a scrub brush or sponge to scrub it. Get into the corners and crevices to remove all of the dirt and the cleaner. Using Natural Cleaning Alternatives Use baking soda and vinegar to clean without toxic chemicals. Mix ⁄2 cup (120 mL) of baking soda with 3 tablespoons (44 mL) of water in a bowl, and mix it to form a thick paste. Spread the paste on the bottom of your oven and let it sit for 12 hours, or overnight. Then wipe the bottom of your oven with a damp cloth. Fill a spray bottle with white vinegar, spray the inside of the oven, and wipe away the foamy mixture. The white vinegar will react with the baking soda and make a foamy cleaning mixture. You don’t need to let the foam sit in the oven. Wipe the oven clean right after you spray the vinegar. If you’re in a hurry, apply the baking soda paste, let it sit for 15 minutes, and then spray it with vinegar and wipe it away.Tip: Use a pumice or microfiber sponge for any difficult-to-remove stains. Bake lemons in your oven to clean the bottom. Preheat your oven to 250 °F (121 °C) and fill an oven-safe bowl about ⅓ of the way full with clean water. Slice 2 lemons in half and squeeze the juice into the water and then drop the lemons into the bowl of water. Place the bowl on a center rack and let it bake for 1 hour, then use a damp cloth to wipe the bottom of your oven. Let the oven cool down enough to where it’s still warm, but you can reach into it to wipe the bottom. Use a wet scouring pumice or microfiber sponge to scrub difficult stains. Spread salt onto the bottom of the oven to clean it. Preheat your oven to 150 °F (66 °C) and sprinkle regular table salt all over the bottom of the oven. Put on oven mitts to protect your hands and use a damp sponge or rag to scrub the bottom of the oven while the oven is still warm. The salt acts as an abrasive and will make the grime easy to wipe away.",
  "sentences":[
    " Using the Self-Cleaning Cycle Clear out the oven before you clean it.",
    "Take out all of the oven racks so you can reach and clean the bottom more easily.",
    "Remove any other items like a pizza stone, baking stone, or any trays that may have been left in there.",
    "Clean the oven racks before you put them back into the oven after you clean the bottom.",
    "This can also be a good time to clean any baking stones or pizza stones you typically keep in the oven, particularly if there are stubborn stains on the stone that weren't removed when you performed regular cleaning after use.",
    "Remove large food particles from the bottom of the oven.",
    "Use an old sponge, paper towels, or a cloth to scrub off large bits of food and grease that may have collected on the bottom of your oven.",
    "Lots of built up grease and food can prevent a cleaning solution from being effective.",
    "A cleaning solution will be more effective when it’s applied directly to the surface of the bottom of the oven, rather than a large chunk of food.",
    "Use your oven’s self-cleaning cycle.",
    "If your oven has a self-cleaning cycle, allow it to run until it’s finished.",
    "Self-cleaning cycles will bake the grease and food particles and make them dry and crispy so they’re easier to remove.",
    "Depending on your oven, self-cleaning cycles can take up to 3 hours.Warning: Grease can create toxic smoke.",
    "If the oven begins to fill with lots of smoke, you may need to turn it off and clean the bottom of your oven by hand.",
    "Wipe the bottom of your oven with a damp rag or paper towel.",
    "After your oven has finished its self-cleaning cycle, there will be a layer of ash on the bottom of the oven.",
    "Use a damp cloth or paper towel to remove all of the ash from the inside of your oven before you add any cleaning solutions or it could cake together.",
    "Applying an Industrial Cleaning Product Put on rubber cleaning gloves and safety glasses.",
    "Chemical oven cleaners can be really caustic and can burn your skin and eyes.",
    "Wear safety glasses and a pair of sturdy rubber cleaning gloves to create a heavy-duty barrier between your skin and the oven cleaner.",
    "Don’t use disposable gloves as they may not be enough to prevent the cleaner from getting onto your skin.",
    "Lay down newspapers or paper towels on the floor in front of the oven.",
    "When you apply the oven cleaner to the bottom of your oven, some of it may spill or run out of the oven.",
    "Use newspapers or paper towels to soak up any excess cleaner.",
    "Spray the cleaner onto the bottom of the oven using a sweeping motion.",
    "Hold the spray can of cleaner about 8–10 inches (20–25 cm) from the surface of the bottom of the oven and apply the cleaner using back and forth sweeping motions.Tip: Do not spray on the heating elements of the oven or it could cause problems when you turn on your oven to use it.",
    "Keep the cleaning spray contained to the bottom of the oven.",
    "Let the cleaner sit for at least 30 minutes.",
    "Check the can to see the specific waiting time, but most oven cleaners need to sit for 30 minutes before you wipe it clean.",
    "Don’t disturb the oven while the cleaner is working.",
    "Keep the oven closed so the fumes are contained.",
    "Wipe the bottom of the oven clean with a damp cloth.",
    "After the oven cleaner has been allowed to sit for 30 minutes, open the oven and use a damp cloth to wipe the bottom clean.",
    "If there are any sticky patches of residue, you can use a scrub brush or sponge to scrub it.",
    "Get into the corners and crevices to remove all of the dirt and the cleaner.",
    "Using Natural Cleaning Alternatives Use baking soda and vinegar to clean without toxic chemicals.",
    "Mix ⁄2 cup (120 mL) of baking soda with 3 tablespoons (44 mL) of water in a bowl, and mix it to form a thick paste.",
    "Spread the paste on the bottom of your oven and let it sit for 12 hours, or overnight.",
    "Then wipe the bottom of your oven with a damp cloth.",
    "Fill a spray bottle with white vinegar, spray the inside of the oven, and wipe away the foamy mixture.",
    "The white vinegar will react with the baking soda and make a foamy cleaning mixture.",
    "You don’t need to let the foam sit in the oven.",
    "Wipe the oven clean right after you spray the vinegar.",
    "If you’re in a hurry, apply the baking soda paste, let it sit for 15 minutes, and then spray it with vinegar and wipe it away.Tip: Use a pumice or microfiber sponge for any difficult-to-remove stains.",
    "Bake lemons in your oven to clean the bottom.",
    "Preheat your oven to 250 °F (121 °C) and fill an oven-safe bowl about ⅓ of the way full with clean water.",
    "Slice 2 lemons in half and squeeze the juice into the water and then drop the lemons into the bowl of water.",
    "Place the bowl on a center rack and let it bake for 1 hour, then use a damp cloth to wipe the bottom of your oven.",
    "Let the oven cool down enough to where it’s still warm, but you can reach into it to wipe the bottom.",
    "Use a wet scouring pumice or microfiber sponge to scrub difficult stains.",
    "Spread salt onto the bottom of the oven to clean it.",
    "Preheat your oven to 150 °F (66 °C) and sprinkle regular table salt all over the bottom of the oven.",
    "Put on oven mitts to protect your hands and use a damp sponge or rag to scrub the bottom of the oven while the oven is still warm.",
    "The salt acts as an abrasive and will make the grime easy to wipe away."
  ],
  "tyn_section":[
    "Cloth, rag, sponge, or paper towels",
    "Rubber cleaning gloves",
    "Newspapers or paper towels",
    "Spray oven cleaner",
    "1⁄2",
    "1",
    "⁄",
    "2",
    " cup (120 mL) of baking soda",
    "Bowl (to mix)",
    "White vinegar",
    "Spray bottle",
    "2 lemons",
    "Table salt",
    "Scouring pumice or microfiber sponge (optional)"
  ],
  "tyn_model":[
    "oven",
    "baking soda",
    "water",
    "oven cleaner",
    "vinegar",
    "bowl",
    "oven racks",
    "sponge",
    "damp cloth",
    "oven cleaners",
    "newspapers",
    "white vinegar",
    "salt",
    "pizza stone",
    "paper towels",
    "food",
    "grease",
    "damp rag",
    "rubber cleaning gloves",
    "spray can",
    "cleaner",
    "spray bottle",
    "pumice or microfiber sponge",
    "lemons",
    "oven-safe bowl",
    "⅓ of",
    "scouring pumice or microfiber sponge",
    "table salt",
    "oven mitts"
  ],
  "simple_metrics":{
    "r":0.2666666667,
    "p":0.1379310345,
    "f1":0.1818181818,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5333333333,
    "p":0.3793103448,
    "f1":0.443324937
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7333333333,
    "p":0.5517241379,
    "f1":0.6296958855
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.2413793103,
    "f1":0.3010752688
  }
}