{
  "title":"How to Construct a Color Wheel",
  "url":"https://www.wikihow.com/Construct-a-Color-Wheel",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Coloring and Shading"
  ],
  "parts":[
    {
      "name":"Drawing the Circles",
      "steps":[
        {
          "headline":"Cut a piece of watercolor paper into a square.",
          "description":"Tear off a piece of watercolor paper, which is sturdy enough to withstand watercolor and acrylic paint. Measure the size of your paper and use a ruler to cut it into a square if it's a rectangle. For example, if your paper is 12 by 16 inches (30 cm × 41 cm), cut it down to 12 by 12 inches (30 cm × 30 cm). If you can't find watercolor paper, use paper that's designed to withstand paint, such as canvas paper."
        },
        {
          "headline":"Make a dot in the center of the paper.",
          "description":"Lay a ruler horizontally on the center of the square and make a small mark in the middle using a pencil. Then, turn the ruler vertically so it's lined up with your mark and make a small dot in the center. The small dot will be the center of your color wheel."
        },
        {
          "headline":"Use a compass to make a small circle 2 ⁄2 inches (6.4 cm) away from the center.",
          "description":"Attach a pencil to a drawing compass and stick the other leg of the compass on the center dot. Extend the pencil leg of the compass so it's about 2 ⁄2 inches (6.4 cm) from the dot. Then, slowly rotate the compass to make a small circle.Variation: To make a simple 12-color color wheel, just draw the large outer circle for the color wheel and don't make the smaller circles within it. If you don't have a drawing compass or don't need your color wheel to be precise, you can draw the circle freehand."
        },
        {
          "headline":"Make another circle that's 5 ⁄2 inches (14 cm) from the center dot.",
          "description":"To create another row for your color wheel, make a slightly larger circle beyond the small one you just made. Adjust your compass so it's 5 ⁄2 inches (14 cm) from the dot and rotate it to make a circle."
        },
        {
          "headline":"Draw the outer circle 8 ⁄2 inches (22 cm) from the center.",
          "description":"Move the leg of your drawing compass so it extends 8 ⁄2 inches (22 cm) from the middle of the color wheel and draw the largest circle. This will be the border for your color wheel. You should now have 3 rings for the color wheel that you'll divide into spaces."
        }
      ]
    },
    {
      "name":"Dividing and Labeling the 12 Spaces",
      "steps":[
        {
          "headline":"Write the numbers 1 through 12 clockwise around the outside of the wheel.",
          "description":"Use your pencil to write 12 at the top of the outer ring and 6 near the bottom of the ring. Fill in the rest of the numbers so they're evenly spaced just like on a clock. Writing the numbers will make it easier to evenly divide the wheel into triangular spaces."
        },
        {
          "headline":"Draw a straight line from between the 12 and 1 to between the 6 and 7.",
          "description":"Lay your ruler so it's in between the 12 and 1. Line up the other end of the ruler so it passes right between the 6 and 7. Then, use your pencil to draw a straight line through the center of the color wheel. The line should go through the center dot you drew in the middle of the color wheel."
        },
        {
          "headline":"Continue to make straight lines between the numbers so they cross the wheel.",
          "description":"Turn your paper or the ruler so the ruler is in between the next set of numbers. Then, draw another line across the wheel. Keep doing this until you've divided the wheel into 12 triangular spaces.Tip: If you're helping a child make a color wheel, don't worry about making the segments exact. Kids enjoy the process of mixing colors more than dividing the color wheel. The color wheel will now look like a dartboard if you've drawn the segments correctly."
        },
        {
          "headline":"Label each segment with the color you'll put there.",
          "description":"You can write the color or put an abbreviation directly under the number for the segment. Move around the color wheel clockwise and list every color. To make a classic color wheel these colors should correspond with the numbers you wrote for the segments:\n12 - Yellow\n1 - Yellow-green\n2 - Green\n3 - Blue-green\n4 - Blue\n5 - Blue-violet\n6 - Violet\n7 - Red-violet\n8 - Red\n9 - Red-orange\n10 - Orange\n11 - Yellow-orange"
        }
      ]
    },
    {
      "name":"Adding Primary Colors, Tints, and Shades",
      "steps":[
        {
          "headline":"Decide what type of paint to use.",
          "description":"Choose a medium that blends easily and you're comfortable with using. Experienced painters might choose watercolor or oil paint, for instance, while kids or beginners might like acrylic or tempera paint. Although you can use crayons or colored pencils, it may be harder to mix colors with these."
        },
        {
          "headline":"Put the primary paint colors on a paint palette.",
          "description":"Squirt a coin-sized amount of red, yellow, and blue paint onto a paint palette and leave the rest of the palette empty so you can mix colors. If you're using watercolor paints, mix red, blue, and yellow puddles on your palette."
        },
        {
          "headline":"Paint the primary colors in the biggest segments.",
          "description":"Dip your paintbrush into a primary color and paint the biggest segment of the outer circle for red, yellow, and blue. Painting with the pure color is called the hue. Remember to rinse your brush thoroughly in between colors."
        },
        {
          "headline":"Mix the secondary colors and paint the remaining hue segments.",
          "description":"Use the colors you labeled on the wheel as a guide to blend secondary colors. For example, mix yellow and blue on your palette to create green, a secondary color. Then, paint this green hue in the biggest segment of your wheel under the label \"#2/green\". To make the other secondary colors, mix:Tip: If you're only painting a 12-segment color wheel, you'll just paint the hues and skip painting the tints and shades. Yellow + red = orange\nBlue + red = purple"
        },
        {
          "headline":"Create the tertiary hues for your wheel.",
          "description":"At this point, half of the biggest segments should be filled with primary and secondary hues. Now, combine a primary color with the secondary color next to it to make a tertiary hue. Use these hues to fill in the biggest segments according to your color label. To make the tertiary hues, combine:\nRed + purple = red-purple\nRed + orange = red-orange\nBlue + purple = blue-purple\nBlue + green = blue-green\nYellow + orange = yellow-orange\nYellow + green = yellow-green"
        },
        {
          "headline":"Add white to create the tint for each color and paint the segment below each hue.",
          "description":"Now, blend enough white paint into each primary, secondary, and tertiary hue to lighten the color. Once you've blended enough to see a noticeable difference, paint the space directly below each hue. The tint is simply the hue plus white."
        },
        {
          "headline":"Add black to the hues to make shades of each color.",
          "description":"Rinse your brush well to remove any white paint and then blend a pure hue with a little black. This will darken the hue to make the shade for the color. Then, paint the smallest segment for each color using the shade. Remember to rinse your brush well so you don't muddle the paint."
        }
      ]
    }
  ],
  "text":" Drawing the Circles Cut a piece of watercolor paper into a square. Tear off a piece of watercolor paper, which is sturdy enough to withstand watercolor and acrylic paint. Measure the size of your paper and use a ruler to cut it into a square if it's a rectangle. For example, if your paper is 12 by 16 inches (30 cm × 41 cm), cut it down to 12 by 12 inches (30 cm × 30 cm). If you can't find watercolor paper, use paper that's designed to withstand paint, such as canvas paper. Make a dot in the center of the paper. Lay a ruler horizontally on the center of the square and make a small mark in the middle using a pencil. Then, turn the ruler vertically so it's lined up with your mark and make a small dot in the center. The small dot will be the center of your color wheel. Use a compass to make a small circle 2 ⁄2 inches (6.4 cm) away from the center. Attach a pencil to a drawing compass and stick the other leg of the compass on the center dot. Extend the pencil leg of the compass so it's about 2 ⁄2 inches (6.4 cm) from the dot. Then, slowly rotate the compass to make a small circle.Variation: To make a simple 12-color color wheel, just draw the large outer circle for the color wheel and don't make the smaller circles within it. If you don't have a drawing compass or don't need your color wheel to be precise, you can draw the circle freehand. Make another circle that's 5 ⁄2 inches (14 cm) from the center dot. To create another row for your color wheel, make a slightly larger circle beyond the small one you just made. Adjust your compass so it's 5 ⁄2 inches (14 cm) from the dot and rotate it to make a circle. Draw the outer circle 8 ⁄2 inches (22 cm) from the center. Move the leg of your drawing compass so it extends 8 ⁄2 inches (22 cm) from the middle of the color wheel and draw the largest circle. This will be the border for your color wheel. You should now have 3 rings for the color wheel that you'll divide into spaces. Dividing and Labeling the 12 Spaces Write the numbers 1 through 12 clockwise around the outside of the wheel. Use your pencil to write 12 at the top of the outer ring and 6 near the bottom of the ring. Fill in the rest of the numbers so they're evenly spaced just like on a clock. Writing the numbers will make it easier to evenly divide the wheel into triangular spaces. Draw a straight line from between the 12 and 1 to between the 6 and 7. Lay your ruler so it's in between the 12 and 1. Line up the other end of the ruler so it passes right between the 6 and 7. Then, use your pencil to draw a straight line through the center of the color wheel. The line should go through the center dot you drew in the middle of the color wheel. Continue to make straight lines between the numbers so they cross the wheel. Turn your paper or the ruler so the ruler is in between the next set of numbers. Then, draw another line across the wheel. Keep doing this until you've divided the wheel into 12 triangular spaces.Tip: If you're helping a child make a color wheel, don't worry about making the segments exact. Kids enjoy the process of mixing colors more than dividing the color wheel. The color wheel will now look like a dartboard if you've drawn the segments correctly. Label each segment with the color you'll put there. You can write the color or put an abbreviation directly under the number for the segment. Move around the color wheel clockwise and list every color. To make a classic color wheel these colors should correspond with the numbers you wrote for the segments:\n12 - Yellow\n1 - Yellow-green\n2 - Green\n3 - Blue-green\n4 - Blue\n5 - Blue-violet\n6 - Violet\n7 - Red-violet\n8 - Red\n9 - Red-orange\n10 - Orange\n11 - Yellow-orange Adding Primary Colors, Tints, and Shades Decide what type of paint to use. Choose a medium that blends easily and you're comfortable with using. Experienced painters might choose watercolor or oil paint, for instance, while kids or beginners might like acrylic or tempera paint. Although you can use crayons or colored pencils, it may be harder to mix colors with these. Put the primary paint colors on a paint palette. Squirt a coin-sized amount of red, yellow, and blue paint onto a paint palette and leave the rest of the palette empty so you can mix colors. If you're using watercolor paints, mix red, blue, and yellow puddles on your palette. Paint the primary colors in the biggest segments. Dip your paintbrush into a primary color and paint the biggest segment of the outer circle for red, yellow, and blue. Painting with the pure color is called the hue. Remember to rinse your brush thoroughly in between colors. Mix the secondary colors and paint the remaining hue segments. Use the colors you labeled on the wheel as a guide to blend secondary colors. For example, mix yellow and blue on your palette to create green, a secondary color. Then, paint this green hue in the biggest segment of your wheel under the label \"#2/green\". To make the other secondary colors, mix:Tip: If you're only painting a 12-segment color wheel, you'll just paint the hues and skip painting the tints and shades. Yellow + red = orange\nBlue + red = purple Create the tertiary hues for your wheel. At this point, half of the biggest segments should be filled with primary and secondary hues. Now, combine a primary color with the secondary color next to it to make a tertiary hue. Use these hues to fill in the biggest segments according to your color label. To make the tertiary hues, combine:\nRed + purple = red-purple\nRed + orange = red-orange\nBlue + purple = blue-purple\nBlue + green = blue-green\nYellow + orange = yellow-orange\nYellow + green = yellow-green Add white to create the tint for each color and paint the segment below each hue. Now, blend enough white paint into each primary, secondary, and tertiary hue to lighten the color. Once you've blended enough to see a noticeable difference, paint the space directly below each hue. The tint is simply the hue plus white. Add black to the hues to make shades of each color. Rinse your brush well to remove any white paint and then blend a pure hue with a little black. This will darken the hue to make the shade for the color. Then, paint the smallest segment for each color using the shade. Remember to rinse your brush well so you don't muddle the paint.",
  "sentences":[
    " Drawing the Circles Cut a piece of watercolor paper into a square.",
    "Tear off a piece of watercolor paper, which is sturdy enough to withstand watercolor and acrylic paint.",
    "Measure the size of your paper and use a ruler to cut it into a square if it's a rectangle.",
    "For example, if your paper is 12 by 16 inches (30 cm × 41 cm), cut it down to 12 by 12 inches (30 cm × 30 cm).",
    "If you can't find watercolor paper, use paper that's designed to withstand paint, such as canvas paper.",
    "Make a dot in the center of the paper.",
    "Lay a ruler horizontally on the center of the square and make a small mark in the middle using a pencil.",
    "Then, turn the ruler vertically so it's lined up with your mark and make a small dot in the center.",
    "The small dot will be the center of your color wheel.",
    "Use a compass to make a small circle 2 ⁄2 inches (6.4 cm) away from the center.",
    "Attach a pencil to a drawing compass and stick the other leg of the compass on the center dot.",
    "Extend the pencil leg of the compass so it's about 2 ⁄2 inches (6.4 cm) from the dot.",
    "Then, slowly rotate the compass to make a small circle.Variation: To make a simple 12-color color wheel, just draw the large outer circle for the color wheel and don't make the smaller circles within it.",
    "If you don't have a drawing compass or don't need your color wheel to be precise, you can draw the circle freehand.",
    "Make another circle that's 5 ⁄2 inches (14 cm) from the center dot.",
    "To create another row for your color wheel, make a slightly larger circle beyond the small one you just made.",
    "Adjust your compass so it's 5 ⁄2 inches (14 cm) from the dot and rotate it to make a circle.",
    "Draw the outer circle 8 ⁄2 inches (22 cm) from the center.",
    "Move the leg of your drawing compass so it extends 8 ⁄2 inches (22 cm) from the middle of the color wheel and draw the largest circle.",
    "This will be the border for your color wheel.",
    "You should now have 3 rings for the color wheel that you'll divide into spaces.",
    "Dividing and Labeling the 12 Spaces Write the numbers 1 through 12 clockwise around the outside of the wheel.",
    "Use your pencil to write 12 at the top of the outer ring and 6 near the bottom of the ring.",
    "Fill in the rest of the numbers so they're evenly spaced just like on a clock.",
    "Writing the numbers will make it easier to evenly divide the wheel into triangular spaces.",
    "Draw a straight line from between the 12 and 1 to between the 6 and 7.",
    "Lay your ruler so it's in between the 12 and 1.",
    "Line up the other end of the ruler so it passes right between the 6 and 7.",
    "Then, use your pencil to draw a straight line through the center of the color wheel.",
    "The line should go through the center dot you drew in the middle of the color wheel.",
    "Continue to make straight lines between the numbers so they cross the wheel.",
    "Turn your paper or the ruler so the ruler is in between the next set of numbers.",
    "Then, draw another line across the wheel.",
    "Keep doing this until you've divided the wheel into 12 triangular spaces.Tip: If you're helping a child make a color wheel, don't worry about making the segments exact.",
    "Kids enjoy the process of mixing colors more than dividing the color wheel.",
    "The color wheel will now look like a dartboard if you've drawn the segments correctly.",
    "Label each segment with the color you'll put there.",
    "You can write the color or put an abbreviation directly under the number for the segment.",
    "Move around the color wheel clockwise and list every color.",
    "To make a classic color wheel these colors should correspond with the numbers you wrote for the segments:\n12 - Yellow\n1 - Yellow-green\n2 - Green\n3 - Blue-green\n4 - Blue\n5 - Blue-violet\n6 - Violet\n7 - Red-violet\n8 - Red\n9 - Red-orange\n10 - Orange\n11 - Yellow-orange Adding Primary Colors, Tints, and Shades Decide what type of paint to use.",
    "Choose a medium that blends easily and you're comfortable with using.",
    "Experienced painters might choose watercolor or oil paint, for instance, while kids or beginners might like acrylic or tempera paint.",
    "Although you can use crayons or colored pencils, it may be harder to mix colors with these.",
    "Put the primary paint colors on a paint palette.",
    "Squirt a coin-sized amount of red, yellow, and blue paint onto a paint palette and leave the rest of the palette empty so you can mix colors.",
    "If you're using watercolor paints, mix red, blue, and yellow puddles on your palette.",
    "Paint the primary colors in the biggest segments.",
    "Dip your paintbrush into a primary color and paint the biggest segment of the outer circle for red, yellow, and blue.",
    "Painting with the pure color is called the hue.",
    "Remember to rinse your brush thoroughly in between colors.",
    "Mix the secondary colors and paint the remaining hue segments.",
    "Use the colors you labeled on the wheel as a guide to blend secondary colors.",
    "For example, mix yellow and blue on your palette to create green, a secondary color.",
    "Then, paint this green hue in the biggest segment of your wheel under the label \"#2/green\".",
    "To make the other secondary colors, mix:Tip: If you're only painting a 12-segment color wheel, you'll just paint the hues and skip painting the tints and shades.",
    "Yellow + red = orange\nBlue + red = purple Create the tertiary hues for your wheel.",
    "At this point, half of the biggest segments should be filled with primary and secondary hues.",
    "Now, combine a primary color with the secondary color next to it to make a tertiary hue.",
    "Use these hues to fill in the biggest segments according to your color label.",
    "To make the tertiary hues, combine:\nRed + purple = red-purple\nRed + orange = red-orange\nBlue + purple = blue-purple\nBlue + green = blue-green\nYellow + orange = yellow-orange\nYellow + green = yellow-green Add white to create the tint for each color and paint the segment below each hue.",
    "Now, blend enough white paint into each primary, secondary, and tertiary hue to lighten the color.",
    "Once you've blended enough to see a noticeable difference, paint the space directly below each hue.",
    "The tint is simply the hue plus white.",
    "Add black to the hues to make shades of each color.",
    "Rinse your brush well to remove any white paint and then blend a pure hue with a little black.",
    "This will darken the hue to make the shade for the color.",
    "Then, paint the smallest segment for each color using the shade.",
    "Remember to rinse your brush well so you don't muddle the paint."
  ],
  "tyn_section":[
    "Pencil",
    "Eraser",
    "Ruler",
    "12 in × 12 in (30 cm × 30 cm) sheet of sturdy paper or poster board",
    "Compass",
    "Watercolor paints or acrylic paints, optional",
    "Paintbrush",
    "Paint palette"
  ],
  "tyn_model":[
    "color wheel",
    "ruler",
    "pencil",
    "compass",
    "watercolor paper",
    "drawing compass",
    "paint",
    "brush",
    "paint palette",
    "white",
    "white paint",
    "watercolor and",
    "acrylic paint",
    "× 41",
    "× 30",
    "paper",
    "oil paint",
    "crayons",
    "colored pencils",
    "watercolor paints",
    "paintbrush",
    "palette"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.2272727273,
    "f1":0.3333333333,
    "avg_pos":0.0909090909
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.3636363636,
    "f1":0.4597701149
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.5454545455,
    "f1":0.6315789474
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.2272727273,
    "f1":0.3333333333
  }
}