{
  "title":"How to Clean Gutters",
  "url":"https://www.wikihow.com/Clean-Gutters",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Roofs",
    "Rain Gutters and Downspouts"
  ],
  "parts":[
    {
      "name":"Removing Large Debris",
      "steps":[
        {
          "headline":"Set up your workspace with tools, tarp, and ladder.",
          "description":"Before anything else, make sure you have all your tools available — there’s nothing worse than having to stop halfway through a project because you didn’t plan ahead! Once you are ready to begin, set up your ladder on solid, level ground to ensure stability, and spread a tarp underneath to collect debris. It doesn’t matter where you begin this project, since you will eventually clear the entire area of your gutters."
        },
        {
          "headline":"Wear appropriate clothing to protect yourself from nicks and cuts.",
          "description":"You want to wear durable clothing, in order to limit the risk of suffering minor bruises from large debris or even from the metal of the gutter itself. Long-sleeved shirts are a good idea, as are work pants and rubber gloves. Of course, cleaning your gutters is a messy task, so wear clothes that you can get dirty! It's a good idea to wear latex gloves under your work gloves, for extra protection."
        },
        {
          "headline":"Remove the largest debris by hand.",
          "description":"Before incorporating your tools, you should get rid of the largest debris using only your hands. This includes branches or twigs, or perhaps even an errant tennis ball or two — anything large that may have wound up in your gutter. Be careful to ensure your safety by practicing proper ladder technique."
        }
      ]
    },
    {
      "name":"Removing Small Debris",
      "steps":[
        {
          "headline":"Clear smaller debris with a scoop.",
          "description":"Once you have removed the branches and twigs — and tennis balls! — from your gutter, use the scoop to clear out smaller debris, such as leaves and other accumulations. Make sure you clear as much as you can (safely!) in one spot before moving your set-up to the next location. And since you’ve set up your tarp beneath you, remember that you can just toss the debris straight onto the ground. If you don’t have a scoop, a child’s sandbox shovel works great as well! If the scoop is uncomfortable, try simply using your hands for greater maneuverability."
        },
        {
          "headline":"Flush the gutter with a garden hose.",
          "description":"Once you've gotten rid of everything that you can collect with your hands and scoop, you need to get rid of the finest debris. Remove the strainers from the downspout and place a garden hose at the opposite end of the gutter. Set the nozzle to the spray function, and spray the hose down the length of the gutter. The rest of the debris will get swept away!"
        },
        {
          "headline":"Dispose of the debris via compost or dumpster.",
          "description":"Once you have finished clearing your gutter, you're going to have a tarp full of debris! If you have a compost pile, the easiest way to dispose of the debris is by adding it to the pile. However, if this is not an option, there are two alternatives: Either bring the debris to the dump or call your local Waste Management to schedule a pick-up. Before bringing debris to the dump, call to make sure they accept yard waste!"
        }
      ]
    },
    {
      "name":"Troubleshooting",
      "steps":[
        {
          "headline":"Remove clogs in the downspouts with a garden hose.",
          "description":"Flushing your gutters doubles as a check for clogged downspouts, so if your gutters aren't draining quickly you know you have a problem! The simplest way to remove a clog is by aiming the nozzle of your hose directly into the top of the spout. If the direct flow doesn't clear the clog, use a plumber's snake. If the clog still won't clear, call a professional."
        },
        {
          "headline":"Drain standing water by re-sloping your gutters.",
          "description":"If standing water remains in one of your gutters after a successful flushing, it likely means the gutter isn’t sloped correctly. Detach the gutter hangers and adjust the slope slightly, making sure that the water now flows freely into the downspout. Maintain this new angle, and reattach the hangers."
        },
        {
          "headline":"Repair leaking gutters with gutter sealant.",
          "description":"If the leak is coming from the seams of the gutter, first check that every gutter section is held tightly in place against each other. Apply gutter sealant to all of the joints, being sure to cover both sides. If the leak is coming from the end cap instead, add sealant along the inside of the joint as well."
        }
      ]
    }
  ],
  "text":" Removing Large Debris Set up your workspace with tools, tarp, and ladder. Before anything else, make sure you have all your tools available — there’s nothing worse than having to stop halfway through a project because you didn’t plan ahead! Once you are ready to begin, set up your ladder on solid, level ground to ensure stability, and spread a tarp underneath to collect debris. It doesn’t matter where you begin this project, since you will eventually clear the entire area of your gutters. Wear appropriate clothing to protect yourself from nicks and cuts. You want to wear durable clothing, in order to limit the risk of suffering minor bruises from large debris or even from the metal of the gutter itself. Long-sleeved shirts are a good idea, as are work pants and rubber gloves. Of course, cleaning your gutters is a messy task, so wear clothes that you can get dirty! It's a good idea to wear latex gloves under your work gloves, for extra protection. Remove the largest debris by hand. Before incorporating your tools, you should get rid of the largest debris using only your hands. This includes branches or twigs, or perhaps even an errant tennis ball or two — anything large that may have wound up in your gutter. Be careful to ensure your safety by practicing proper ladder technique. Removing Small Debris Clear smaller debris with a scoop. Once you have removed the branches and twigs — and tennis balls! — from your gutter, use the scoop to clear out smaller debris, such as leaves and other accumulations. Make sure you clear as much as you can (safely!) in one spot before moving your set-up to the next location. And since you’ve set up your tarp beneath you, remember that you can just toss the debris straight onto the ground. If you don’t have a scoop, a child’s sandbox shovel works great as well! If the scoop is uncomfortable, try simply using your hands for greater maneuverability. Flush the gutter with a garden hose. Once you've gotten rid of everything that you can collect with your hands and scoop, you need to get rid of the finest debris. Remove the strainers from the downspout and place a garden hose at the opposite end of the gutter. Set the nozzle to the spray function, and spray the hose down the length of the gutter. The rest of the debris will get swept away! Dispose of the debris via compost or dumpster. Once you have finished clearing your gutter, you're going to have a tarp full of debris! If you have a compost pile, the easiest way to dispose of the debris is by adding it to the pile. However, if this is not an option, there are two alternatives: Either bring the debris to the dump or call your local Waste Management to schedule a pick-up. Before bringing debris to the dump, call to make sure they accept yard waste! Troubleshooting Remove clogs in the downspouts with a garden hose. Flushing your gutters doubles as a check for clogged downspouts, so if your gutters aren't draining quickly you know you have a problem! The simplest way to remove a clog is by aiming the nozzle of your hose directly into the top of the spout. If the direct flow doesn't clear the clog, use a plumber's snake. If the clog still won't clear, call a professional. Drain standing water by re-sloping your gutters. If standing water remains in one of your gutters after a successful flushing, it likely means the gutter isn’t sloped correctly. Detach the gutter hangers and adjust the slope slightly, making sure that the water now flows freely into the downspout. Maintain this new angle, and reattach the hangers. Repair leaking gutters with gutter sealant. If the leak is coming from the seams of the gutter, first check that every gutter section is held tightly in place against each other. Apply gutter sealant to all of the joints, being sure to cover both sides. If the leak is coming from the end cap instead, add sealant along the inside of the joint as well.",
  "sentences":[
    " Removing Large Debris Set up your workspace with tools, tarp, and ladder.",
    "Before anything else, make sure you have all your tools available — there’s nothing worse than having to stop halfway through a project because you didn’t plan ahead!",
    "Once you are ready to begin, set up your ladder on solid, level ground to ensure stability, and spread a tarp underneath to collect debris.",
    "It doesn’t matter where you begin this project, since you will eventually clear the entire area of your gutters.",
    "Wear appropriate clothing to protect yourself from nicks and cuts.",
    "You want to wear durable clothing, in order to limit the risk of suffering minor bruises from large debris or even from the metal of the gutter itself.",
    "Long-sleeved shirts are a good idea, as are work pants and rubber gloves.",
    "Of course, cleaning your gutters is a messy task, so wear clothes that you can get dirty!",
    "It's a good idea to wear latex gloves under your work gloves, for extra protection.",
    "Remove the largest debris by hand.",
    "Before incorporating your tools, you should get rid of the largest debris using only your hands.",
    "This includes branches or twigs, or perhaps even an errant tennis ball or two — anything large that may have wound up in your gutter.",
    "Be careful to ensure your safety by practicing proper ladder technique.",
    "Removing Small Debris Clear smaller debris with a scoop.",
    "Once you have removed the branches and twigs — and tennis balls!",
    "— from your gutter, use the scoop to clear out smaller debris, such as leaves and other accumulations.",
    "Make sure you clear as much as you can (safely!)",
    "in one spot before moving your set-up to the next location.",
    "And since you’ve set up your tarp beneath you, remember that you can just toss the debris straight onto the ground.",
    "If you don’t have a scoop, a child’s sandbox shovel works great as well!",
    "If the scoop is uncomfortable, try simply using your hands for greater maneuverability.",
    "Flush the gutter with a garden hose.",
    "Once you've gotten rid of everything that you can collect with your hands and scoop, you need to get rid of the finest debris.",
    "Remove the strainers from the downspout and place a garden hose at the opposite end of the gutter.",
    "Set the nozzle to the spray function, and spray the hose down the length of the gutter.",
    "The rest of the debris will get swept away!",
    "Dispose of the debris via compost or dumpster.",
    "Once you have finished clearing your gutter, you're going to have a tarp full of debris!",
    "If you have a compost pile, the easiest way to dispose of the debris is by adding it to the pile.",
    "However, if this is not an option, there are two alternatives: Either bring the debris to the dump or call your local Waste Management to schedule a pick-up.",
    "Before bringing debris to the dump, call to make sure they accept yard waste!",
    "Troubleshooting Remove clogs in the downspouts with a garden hose.",
    "Flushing your gutters doubles as a check for clogged downspouts, so if your gutters aren't draining quickly you know you have a problem!",
    "The simplest way to remove a clog is by aiming the nozzle of your hose directly into the top of the spout.",
    "If the direct flow doesn't clear the clog, use a plumber's snake.",
    "If the clog still won't clear, call a professional.",
    "Drain standing water by re-sloping your gutters.",
    "If standing water remains in one of your gutters after a successful flushing, it likely means the gutter isn’t sloped correctly.",
    "Detach the gutter hangers and adjust the slope slightly, making sure that the water now flows freely into the downspout.",
    "Maintain this new angle, and reattach the hangers.",
    "Repair leaking gutters with gutter sealant.",
    "If the leak is coming from the seams of the gutter, first check that every gutter section is held tightly in place against each other.",
    "Apply gutter sealant to all of the joints, being sure to cover both sides.",
    "If the leak is coming from the end cap instead, add sealant along the inside of the joint as well."
  ],
  "tyn_section":[
    "Ladder",
    "Scoop",
    "Garden hose"
  ],
  "tyn_model":[
    "tarp",
    "scoop",
    "ladder",
    "garden hose",
    "water",
    "tools",
    "hose",
    "gutter sealant",
    "— there",
    "rubber gloves",
    "gutters",
    "— anything",
    "branches",
    "twigs",
    "— and",
    "— from",
    "shovel",
    "compost",
    "yard waste",
    "plumber's snake",
    "sealant"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.1428571429,
    "f1":0.25,
    "avg_pos":0.0952380952
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.1904761905,
    "f1":0.32
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.1904761905,
    "f1":0.32
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.1428571429,
    "f1":0.25
  }
}