{
  "title":"How to Fix a Sink Stopper",
  "url":"https://www.wikihow.com/Fix-a-Sink-Stopper",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Removing the Stopper Components",
      "steps":[
        {
          "headline":"Slide off the P-trap by removing the connecting nuts.",
          "description":"Look under the sink to find the curved pipe joining the sink’s tailpipe to the drainage pipe in the wall. It will have a pair of hexagonal nuts holding it to the other pipes. Turn them counterclockwise by hand or by using a wrench if needed. Move the nuts to the side so you can slide the P-trap off the other pipes. Place a bucket underneath the P-trap before removing it. It typically has some water in it. It may also smell a little nasty, but that is normal. Removing the P-trap isn’t strictly necessary when fixing a sink stopper. However, it’s worth inspecting and cleaning along with the other pipes."
        },
        {
          "headline":"Unscrew the retaining nut holding the pivot rod to the tailpipe.",
          "description":"This nut will be on the sink’s pipe above where the P-trap connects to it. It’s a round, plastic part that you can remove by hand and is recognizable by the horizontal rod passing through it. Twist it counterclockwise to remove it and set it aside. The retaining nut holds the levers that connect the stopper to its control on top of the sink. It’s not hard to spot since you can see these levers underneath the sink. If the nut looks rusted or leaky, you may need to replace it. Try cleaning or tightening it first before getting a new one."
        },
        {
          "headline":"Pull out the pivot rod and the sink stopper.",
          "description":"Removing the retaining nut frees the horizontal lever responsible for operating the stopper. Pull it out of the tailpipe so you’re able to get a good look at it. This will also free the sink stopper, which you can remove by pulling it out of the top of your sink. The pivot lever hooks to the hole at the bottom of the stopper. If the stopper is stuck, make sure the end of the pivot rod is free first. If the pivot rod and stopper weren't connected, that could be the issue. Reposition the stopper so the hole at the bottom faces the pivot rod. Then, push the end of the pivot rod into it."
        }
      ]
    },
    {
      "name":"Repairing a Stopper That Won’t Rise",
      "steps":[
        {
          "headline":"Squeeze the spring clip to detach the pivot rod.",
          "description":"The horizontal pivot rod attaches to a vertical rod called the clevis. A bent metal clip holds these mechanisms together. Push the ends of the clip together to slide it off the rod. This will also allow you to slide the clevis off of the rod. Some pivot rods may have small clips like little beads. They come in pairs. Twist the clips counterclockwise to slide them off the pivot rod."
        },
        {
          "headline":"Purchase a replacement pivot rod kit that matches your old one.",
          "description":"Sink pipes can vary, so the easiest way to get the part you need is by ordering a universal pivot ball replacement kit. The kit comes with a new pivot rod as well as several different ball sizes. Select the ball size that matches the one currently on the end of your sink's pivot rod. You can get pivot rod kits and parts by shopping online or checking out hardware stores. If you’re shopping in person, take the broken parts with you in order to find suitable replacements. Remember that you can reuse undamaged parts like the rubber washer and retaining nut covering the old rod’s pivot ball. If you need new ones, you will have to buy them separately."
        },
        {
          "headline":"Thread the ball onto the end of the pivot rod.",
          "description":"Generally, both ends of a pivot rod look the same, so it doesn’t matter where you attach the ball. Slide it about ¼ of the way along the length of the rod to install it. Test the rod by holding it up to the tailpipe, setting the ball in the opening on its side. The rod needs to span the distance from the pipe to the clevis. Slide the ball down the rod if you need to adjust it. Get it to sit right in the pipe’s opening to prevent leaks."
        },
        {
          "headline":"Rehook the drain plug to the pivot rod.",
          "description":"Examine the stopper to find out which way it needs to be inserted into the drain. Look for the hole at its bottom edge. That hole is where the end of the pivot rod needs to be. Drop the stopper into the sink, turning it so the hole faces the side opening, then push the ball end of the pivot rod into it. The pivot ball should rest right inside the pipe’s opening. Adjust it before locking the retaining nut in place. Keep in mind that the pivot rod isn’t locked into place yet. Hold onto it so it doesn’t fall back off the stopper."
        },
        {
          "headline":"Screw the retaining nut back onto the pivot rod.",
          "description":"Check the nut to make sure it has a rubber ring called a washer inside of it. Once the washer is in position, slide the nut onto the end of the pivot rod and all the way down to the ball. The nut covers the ball, capping the pipe’s opening. Turn it clockwise to lock it in place. The rubber washer seals the gap between the ball and the nut. If you notice leaks from that area, the washer is probably to blame. Make sure it’s pushed firmly into the retaining nut or, if it’s broken, replace it. Once you have the front end of the pivot rod secure, you can connect the opposite end to the vertical clevis if you needed to detach it."
        },
        {
          "headline":"Reattach the pivot rod to the clevis using the spring clip.",
          "description":"Slide one end of the spring clip onto the free end of the pivot rod. Then, push the pivot rod into the nearest slot on the clevis. Add the second end of the spring clip after that. Once everything is secure, test the stopper to see if it’s working correctly. Keep the pivot rod roughly parallel to the ground. If the stopper sits lower in the sink than you want, move the rod up to the next slot in the clevis. If you’re replacing or readjusting an old pivot rod, note which hole on the clevis the rod passed through. Consider marking it with a permanent marker and putting the new rod in the same slot at first."
        },
        {
          "headline":"Replace the P-trap by sliding it onto the sink’s tailpipe.",
          "description":"If you removed the P-trap earlier, align it between the tailpipe and the outlet pipe in the wall. Connect the shorter end to the tailpipe first, then position the longer end on the outlet pipe. Slide the hexagonal nuts over the connection points. Finish by turning the nuts clockwise by hand or with a wrench to lock the pipes in place. Remember that the U-shaped bend in the pipe sits close to the tailpipe and faces the floor. Since its ends are not the same length, you can easily figure out how to install the pipe by examining it. If the hexagonal nuts and P-trap are damaged, get replacements online or at a hardware store. Slip the nuts onto the pipes before installing the P-trap."
        }
      ]
    },
    {
      "name":"Adjusting a Stopper That Won’t Stay down",
      "steps":[
        {
          "headline":"Detach the pivot rod from the clevis by removing the spring clip.",
          "description":"The clevis is the vertical metal bar that the horizontal pivot rod attaches to beneath the sink. It’s responsible for the positioning of the sink stopper. To detach the pivot rod, squeeze the ends of the spring clip together. Slide it off and pull the end of the pivot rod free. Remember to check the pivot rod for damage if you haven’t already. It could also be responsible for a stuck stopper."
        },
        {
          "headline":"Put the spring clip on the end of the pivot rod.",
          "description":"Slide the pivot rod through one of the holes in the metal clip. The bend in the clip is meant to fit around the clevis. Don’t slide the other end of the clip onto the pivot rod until you have finished assembling the stopper mechanism. If you’re using bead-like clips, position them on opposite sides of the clevis. Slide one on the pivot rod, slide the pivot rod through the clevis, then add the second clip."
        },
        {
          "headline":"Align the pivot rod with one of the holes in the clevis.",
          "description":"The clevis will have 4 or 5 slots on it. The closest hole is fine when you’re installing a new pivot rod but reposition the pivot rod as needed. Try to keep the pivot rod parallel to the ground so the stopper sits at a reasonable height. Once you have the components connected, slide the other end of the spring clip onto the pivot rod to hold everything in place. Reposition the rod to the next slot on the clevis. To get the stopper to stay down, raise the pivot rod up one slot. You can drop the pivot rod to a lower slot if you need to raise the stopper."
        },
        {
          "headline":"Test the sink stopper to see if it works properly.",
          "description":"Get out from under the sink and pull the lever that controls the stopper. It should cause the stopper to lower into the drain pipe. If it doesn’t form a tight seal on the drain, you will need to readjust the pivot rod’s positioning again. Having someone else on hand helps a lot. Let them press the lever while you watch the stopper components move. You will get a better view of the parts and can identify what isn’t working without having to reach for the stopper lever!"
        },
        {
          "headline":"Loosen the screw on the clevis to fine-tune the stopper’s positioning.",
          "description":"The clevis has a screw at the top binding it to the stopper’s control lever. Remove the spring clip and pivot rod first before making an adjustment. Then, loosen the screw to free the clevis and reposition it. You can slide it up a little bit to raise the stopper or move it down to lower the stopper. Return the screw, spring clip, and pivot rod when you’re done. Repositioning the pivot rod is usually better, but sometimes it doesn’t align with the clevis properly. Adjusting the clevis solves that problem. You may need to adjust the clevis a few times to get the stopper where you want it to be. Test it after each adjustment."
        },
        {
          "headline":"Reattach the P-trap when you’re ready to use the sink again.",
          "description":"Lift the P-trap into the gap between the sink’s tailpipe and the outlet pipe in the wall. Fit the P-trap in place, then slide the hexagonal nuts over the connections. Turn both of the nuts clockwise to secure the pipes together. When you’re done, test out the sink to see if everything works correctly with no leaks. The shorter end of the P-trap fits on the tailpipe while the longer end connects to the outlet pipe. The U-shaped bend faces the floor. If you need to replace the hexagonal nuts or the P-trap, shop online or visit a hardware store. Slide the nuts onto the pipes first before attaching the P-trap."
        }
      ]
    }
  ],
  "text":" Removing the Stopper Components Slide off the P-trap by removing the connecting nuts. Look under the sink to find the curved pipe joining the sink’s tailpipe to the drainage pipe in the wall. It will have a pair of hexagonal nuts holding it to the other pipes. Turn them counterclockwise by hand or by using a wrench if needed. Move the nuts to the side so you can slide the P-trap off the other pipes. Place a bucket underneath the P-trap before removing it. It typically has some water in it. It may also smell a little nasty, but that is normal. Removing the P-trap isn’t strictly necessary when fixing a sink stopper. However, it’s worth inspecting and cleaning along with the other pipes. Unscrew the retaining nut holding the pivot rod to the tailpipe. This nut will be on the sink’s pipe above where the P-trap connects to it. It’s a round, plastic part that you can remove by hand and is recognizable by the horizontal rod passing through it. Twist it counterclockwise to remove it and set it aside. The retaining nut holds the levers that connect the stopper to its control on top of the sink. It’s not hard to spot since you can see these levers underneath the sink. If the nut looks rusted or leaky, you may need to replace it. Try cleaning or tightening it first before getting a new one. Pull out the pivot rod and the sink stopper. Removing the retaining nut frees the horizontal lever responsible for operating the stopper. Pull it out of the tailpipe so you’re able to get a good look at it. This will also free the sink stopper, which you can remove by pulling it out of the top of your sink. The pivot lever hooks to the hole at the bottom of the stopper. If the stopper is stuck, make sure the end of the pivot rod is free first. If the pivot rod and stopper weren't connected, that could be the issue. Reposition the stopper so the hole at the bottom faces the pivot rod. Then, push the end of the pivot rod into it. Repairing a Stopper That Won’t Rise Squeeze the spring clip to detach the pivot rod. The horizontal pivot rod attaches to a vertical rod called the clevis. A bent metal clip holds these mechanisms together. Push the ends of the clip together to slide it off the rod. This will also allow you to slide the clevis off of the rod. Some pivot rods may have small clips like little beads. They come in pairs. Twist the clips counterclockwise to slide them off the pivot rod. Purchase a replacement pivot rod kit that matches your old one. Sink pipes can vary, so the easiest way to get the part you need is by ordering a universal pivot ball replacement kit. The kit comes with a new pivot rod as well as several different ball sizes. Select the ball size that matches the one currently on the end of your sink's pivot rod. You can get pivot rod kits and parts by shopping online or checking out hardware stores. If you’re shopping in person, take the broken parts with you in order to find suitable replacements. Remember that you can reuse undamaged parts like the rubber washer and retaining nut covering the old rod’s pivot ball. If you need new ones, you will have to buy them separately. Thread the ball onto the end of the pivot rod. Generally, both ends of a pivot rod look the same, so it doesn’t matter where you attach the ball. Slide it about ¼ of the way along the length of the rod to install it. Test the rod by holding it up to the tailpipe, setting the ball in the opening on its side. The rod needs to span the distance from the pipe to the clevis. Slide the ball down the rod if you need to adjust it. Get it to sit right in the pipe’s opening to prevent leaks. Rehook the drain plug to the pivot rod. Examine the stopper to find out which way it needs to be inserted into the drain. Look for the hole at its bottom edge. That hole is where the end of the pivot rod needs to be. Drop the stopper into the sink, turning it so the hole faces the side opening, then push the ball end of the pivot rod into it. The pivot ball should rest right inside the pipe’s opening. Adjust it before locking the retaining nut in place. Keep in mind that the pivot rod isn’t locked into place yet. Hold onto it so it doesn’t fall back off the stopper. Screw the retaining nut back onto the pivot rod. Check the nut to make sure it has a rubber ring called a washer inside of it. Once the washer is in position, slide the nut onto the end of the pivot rod and all the way down to the ball. The nut covers the ball, capping the pipe’s opening. Turn it clockwise to lock it in place. The rubber washer seals the gap between the ball and the nut. If you notice leaks from that area, the washer is probably to blame. Make sure it’s pushed firmly into the retaining nut or, if it’s broken, replace it. Once you have the front end of the pivot rod secure, you can connect the opposite end to the vertical clevis if you needed to detach it. Reattach the pivot rod to the clevis using the spring clip. Slide one end of the spring clip onto the free end of the pivot rod. Then, push the pivot rod into the nearest slot on the clevis. Add the second end of the spring clip after that. Once everything is secure, test the stopper to see if it’s working correctly. Keep the pivot rod roughly parallel to the ground. If the stopper sits lower in the sink than you want, move the rod up to the next slot in the clevis. If you’re replacing or readjusting an old pivot rod, note which hole on the clevis the rod passed through. Consider marking it with a permanent marker and putting the new rod in the same slot at first. Replace the P-trap by sliding it onto the sink’s tailpipe. If you removed the P-trap earlier, align it between the tailpipe and the outlet pipe in the wall. Connect the shorter end to the tailpipe first, then position the longer end on the outlet pipe. Slide the hexagonal nuts over the connection points. Finish by turning the nuts clockwise by hand or with a wrench to lock the pipes in place. Remember that the U-shaped bend in the pipe sits close to the tailpipe and faces the floor. Since its ends are not the same length, you can easily figure out how to install the pipe by examining it. If the hexagonal nuts and P-trap are damaged, get replacements online or at a hardware store. Slip the nuts onto the pipes before installing the P-trap. Adjusting a Stopper That Won’t Stay down Detach the pivot rod from the clevis by removing the spring clip. The clevis is the vertical metal bar that the horizontal pivot rod attaches to beneath the sink. It’s responsible for the positioning of the sink stopper. To detach the pivot rod, squeeze the ends of the spring clip together. Slide it off and pull the end of the pivot rod free. Remember to check the pivot rod for damage if you haven’t already. It could also be responsible for a stuck stopper. Put the spring clip on the end of the pivot rod. Slide the pivot rod through one of the holes in the metal clip. The bend in the clip is meant to fit around the clevis. Don’t slide the other end of the clip onto the pivot rod until you have finished assembling the stopper mechanism. If you’re using bead-like clips, position them on opposite sides of the clevis. Slide one on the pivot rod, slide the pivot rod through the clevis, then add the second clip. Align the pivot rod with one of the holes in the clevis. The clevis will have 4 or 5 slots on it. The closest hole is fine when you’re installing a new pivot rod but reposition the pivot rod as needed. Try to keep the pivot rod parallel to the ground so the stopper sits at a reasonable height. Once you have the components connected, slide the other end of the spring clip onto the pivot rod to hold everything in place. Reposition the rod to the next slot on the clevis. To get the stopper to stay down, raise the pivot rod up one slot. You can drop the pivot rod to a lower slot if you need to raise the stopper. Test the sink stopper to see if it works properly. Get out from under the sink and pull the lever that controls the stopper. It should cause the stopper to lower into the drain pipe. If it doesn’t form a tight seal on the drain, you will need to readjust the pivot rod’s positioning again. Having someone else on hand helps a lot. Let them press the lever while you watch the stopper components move. You will get a better view of the parts and can identify what isn’t working without having to reach for the stopper lever! Loosen the screw on the clevis to fine-tune the stopper’s positioning. The clevis has a screw at the top binding it to the stopper’s control lever. Remove the spring clip and pivot rod first before making an adjustment. Then, loosen the screw to free the clevis and reposition it. You can slide it up a little bit to raise the stopper or move it down to lower the stopper. Return the screw, spring clip, and pivot rod when you’re done. Repositioning the pivot rod is usually better, but sometimes it doesn’t align with the clevis properly. Adjusting the clevis solves that problem. You may need to adjust the clevis a few times to get the stopper where you want it to be. Test it after each adjustment. Reattach the P-trap when you’re ready to use the sink again. Lift the P-trap into the gap between the sink’s tailpipe and the outlet pipe in the wall. Fit the P-trap in place, then slide the hexagonal nuts over the connections. Turn both of the nuts clockwise to secure the pipes together. When you’re done, test out the sink to see if everything works correctly with no leaks. The shorter end of the P-trap fits on the tailpipe while the longer end connects to the outlet pipe. The U-shaped bend faces the floor. If you need to replace the hexagonal nuts or the P-trap, shop online or visit a hardware store. Slide the nuts onto the pipes first before attaching the P-trap.",
  "sentences":[
    " Removing the Stopper Components Slide off the P-trap by removing the connecting nuts.",
    "Look under the sink to find the curved pipe joining the sink’s tailpipe to the drainage pipe in the wall.",
    "It will have a pair of hexagonal nuts holding it to the other pipes.",
    "Turn them counterclockwise by hand or by using a wrench if needed.",
    "Move the nuts to the side so you can slide the P-trap off the other pipes.",
    "Place a bucket underneath the P-trap before removing it.",
    "It typically has some water in it.",
    "It may also smell a little nasty, but that is normal.",
    "Removing the P-trap isn’t strictly necessary when fixing a sink stopper.",
    "However, it’s worth inspecting and cleaning along with the other pipes.",
    "Unscrew the retaining nut holding the pivot rod to the tailpipe.",
    "This nut will be on the sink’s pipe above where the P-trap connects to it.",
    "It’s a round, plastic part that you can remove by hand and is recognizable by the horizontal rod passing through it.",
    "Twist it counterclockwise to remove it and set it aside.",
    "The retaining nut holds the levers that connect the stopper to its control on top of the sink.",
    "It’s not hard to spot since you can see these levers underneath the sink.",
    "If the nut looks rusted or leaky, you may need to replace it.",
    "Try cleaning or tightening it first before getting a new one.",
    "Pull out the pivot rod and the sink stopper.",
    "Removing the retaining nut frees the horizontal lever responsible for operating the stopper.",
    "Pull it out of the tailpipe so you’re able to get a good look at it.",
    "This will also free the sink stopper, which you can remove by pulling it out of the top of your sink.",
    "The pivot lever hooks to the hole at the bottom of the stopper.",
    "If the stopper is stuck, make sure the end of the pivot rod is free first.",
    "If the pivot rod and stopper weren't connected, that could be the issue.",
    "Reposition the stopper so the hole at the bottom faces the pivot rod.",
    "Then, push the end of the pivot rod into it.",
    "Repairing a Stopper That Won’t Rise Squeeze the spring clip to detach the pivot rod.",
    "The horizontal pivot rod attaches to a vertical rod called the clevis.",
    "A bent metal clip holds these mechanisms together.",
    "Push the ends of the clip together to slide it off the rod.",
    "This will also allow you to slide the clevis off of the rod.",
    "Some pivot rods may have small clips like little beads.",
    "They come in pairs.",
    "Twist the clips counterclockwise to slide them off the pivot rod.",
    "Purchase a replacement pivot rod kit that matches your old one.",
    "Sink pipes can vary, so the easiest way to get the part you need is by ordering a universal pivot ball replacement kit.",
    "The kit comes with a new pivot rod as well as several different ball sizes.",
    "Select the ball size that matches the one currently on the end of your sink's pivot rod.",
    "You can get pivot rod kits and parts by shopping online or checking out hardware stores.",
    "If you’re shopping in person, take the broken parts with you in order to find suitable replacements.",
    "Remember that you can reuse undamaged parts like the rubber washer and retaining nut covering the old rod’s pivot ball.",
    "If you need new ones, you will have to buy them separately.",
    "Thread the ball onto the end of the pivot rod.",
    "Generally, both ends of a pivot rod look the same, so it doesn’t matter where you attach the ball.",
    "Slide it about ¼ of the way along the length of the rod to install it.",
    "Test the rod by holding it up to the tailpipe, setting the ball in the opening on its side.",
    "The rod needs to span the distance from the pipe to the clevis.",
    "Slide the ball down the rod if you need to adjust it.",
    "Get it to sit right in the pipe’s opening to prevent leaks.",
    "Rehook the drain plug to the pivot rod.",
    "Examine the stopper to find out which way it needs to be inserted into the drain.",
    "Look for the hole at its bottom edge.",
    "That hole is where the end of the pivot rod needs to be.",
    "Drop the stopper into the sink, turning it so the hole faces the side opening, then push the ball end of the pivot rod into it.",
    "The pivot ball should rest right inside the pipe’s opening.",
    "Adjust it before locking the retaining nut in place.",
    "Keep in mind that the pivot rod isn’t locked into place yet.",
    "Hold onto it so it doesn’t fall back off the stopper.",
    "Screw the retaining nut back onto the pivot rod.",
    "Check the nut to make sure it has a rubber ring called a washer inside of it.",
    "Once the washer is in position, slide the nut onto the end of the pivot rod and all the way down to the ball.",
    "The nut covers the ball, capping the pipe’s opening.",
    "Turn it clockwise to lock it in place.",
    "The rubber washer seals the gap between the ball and the nut.",
    "If you notice leaks from that area, the washer is probably to blame.",
    "Make sure it’s pushed firmly into the retaining nut or, if it’s broken, replace it.",
    "Once you have the front end of the pivot rod secure, you can connect the opposite end to the vertical clevis if you needed to detach it.",
    "Reattach the pivot rod to the clevis using the spring clip.",
    "Slide one end of the spring clip onto the free end of the pivot rod.",
    "Then, push the pivot rod into the nearest slot on the clevis.",
    "Add the second end of the spring clip after that.",
    "Once everything is secure, test the stopper to see if it’s working correctly.",
    "Keep the pivot rod roughly parallel to the ground.",
    "If the stopper sits lower in the sink than you want, move the rod up to the next slot in the clevis.",
    "If you’re replacing or readjusting an old pivot rod, note which hole on the clevis the rod passed through.",
    "Consider marking it with a permanent marker and putting the new rod in the same slot at first.",
    "Replace the P-trap by sliding it onto the sink’s tailpipe.",
    "If you removed the P-trap earlier, align it between the tailpipe and the outlet pipe in the wall.",
    "Connect the shorter end to the tailpipe first, then position the longer end on the outlet pipe.",
    "Slide the hexagonal nuts over the connection points.",
    "Finish by turning the nuts clockwise by hand or with a wrench to lock the pipes in place.",
    "Remember that the U-shaped bend in the pipe sits close to the tailpipe and faces the floor.",
    "Since its ends are not the same length, you can easily figure out how to install the pipe by examining it.",
    "If the hexagonal nuts and P-trap are damaged, get replacements online or at a hardware store.",
    "Slip the nuts onto the pipes before installing the P-trap.",
    "Adjusting a Stopper That Won’t Stay down Detach the pivot rod from the clevis by removing the spring clip.",
    "The clevis is the vertical metal bar that the horizontal pivot rod attaches to beneath the sink.",
    "It’s responsible for the positioning of the sink stopper.",
    "To detach the pivot rod, squeeze the ends of the spring clip together.",
    "Slide it off and pull the end of the pivot rod free.",
    "Remember to check the pivot rod for damage if you haven’t already.",
    "It could also be responsible for a stuck stopper.",
    "Put the spring clip on the end of the pivot rod.",
    "Slide the pivot rod through one of the holes in the metal clip.",
    "The bend in the clip is meant to fit around the clevis.",
    "Don’t slide the other end of the clip onto the pivot rod until you have finished assembling the stopper mechanism.",
    "If you’re using bead-like clips, position them on opposite sides of the clevis.",
    "Slide one on the pivot rod, slide the pivot rod through the clevis, then add the second clip.",
    "Align the pivot rod with one of the holes in the clevis.",
    "The clevis will have 4 or 5 slots on it.",
    "The closest hole is fine when you’re installing a new pivot rod but reposition the pivot rod as needed.",
    "Try to keep the pivot rod parallel to the ground so the stopper sits at a reasonable height.",
    "Once you have the components connected, slide the other end of the spring clip onto the pivot rod to hold everything in place.",
    "Reposition the rod to the next slot on the clevis.",
    "To get the stopper to stay down, raise the pivot rod up one slot.",
    "You can drop the pivot rod to a lower slot if you need to raise the stopper.",
    "Test the sink stopper to see if it works properly.",
    "Get out from under the sink and pull the lever that controls the stopper.",
    "It should cause the stopper to lower into the drain pipe.",
    "If it doesn’t form a tight seal on the drain, you will need to readjust the pivot rod’s positioning again.",
    "Having someone else on hand helps a lot.",
    "Let them press the lever while you watch the stopper components move.",
    "You will get a better view of the parts and can identify what isn’t working without having to reach for the stopper lever!",
    "Loosen the screw on the clevis to fine-tune the stopper’s positioning.",
    "The clevis has a screw at the top binding it to the stopper’s control lever.",
    "Remove the spring clip and pivot rod first before making an adjustment.",
    "Then, loosen the screw to free the clevis and reposition it.",
    "You can slide it up a little bit to raise the stopper or move it down to lower the stopper.",
    "Return the screw, spring clip, and pivot rod when you’re done.",
    "Repositioning the pivot rod is usually better, but sometimes it doesn’t align with the clevis properly.",
    "Adjusting the clevis solves that problem.",
    "You may need to adjust the clevis a few times to get the stopper where you want it to be.",
    "Test it after each adjustment.",
    "Reattach the P-trap when you’re ready to use the sink again.",
    "Lift the P-trap into the gap between the sink’s tailpipe and the outlet pipe in the wall.",
    "Fit the P-trap in place, then slide the hexagonal nuts over the connections.",
    "Turn both of the nuts clockwise to secure the pipes together.",
    "When you’re done, test out the sink to see if everything works correctly with no leaks.",
    "The shorter end of the P-trap fits on the tailpipe while the longer end connects to the outlet pipe.",
    "The U-shaped bend faces the floor.",
    "If you need to replace the hexagonal nuts or the P-trap, shop online or visit a hardware store.",
    "Slide the nuts onto the pipes first before attaching the P-trap."
  ],
  "tyn_section":[
    "Wrench or pliers",
    "Bucket",
    "Replacement pivot rod",
    "Replacement pivot rod ball",
    "New rubber washer if needed",
    "New retaining nut if needed",
    "Flat-head screwdriver",
    "New pivot rod and drain stopper if needed"
  ],
  "tyn_model":[
    "pivot rod",
    "stopper",
    "sink",
    "sink stopper",
    "nut",
    "nuts",
    "washer",
    "spring clip",
    "wrench",
    "rubber washer",
    "bucket",
    "water",
    "pivot lever",
    "pivot rods",
    "pivot ball",
    "drain plug",
    "rubber ring",
    "permanent marker",
    "hexagonal nuts",
    "clips",
    "clevis",
    "screw"
  ],
  "simple_metrics":{
    "r":0.125,
    "p":0.0454545455,
    "f1":0.0666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.375,
    "p":0.1363636364,
    "f1":0.2
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.2272727273,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0909090909,
    "f1":0.1333333333
  }
}