{
  "title":"How to Make an Edible Bouquet",
  "url":"https://www.wikihow.com/Make-an-Edible-Bouquet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Food Crafts"
  ],
  "methods":[
    {
      "name":"Preparing a Fruit Bouquet",
      "steps":[
        {
          "headline":"Choose which fruits to use in the bouquet.",
          "description":"Think about mixing fruits with sharp, juicy flavors along with mildly-flavored fruits. The tangy flavor of pineapple is a great match for more softly-flavored fruits like cantaloupes and grapes. Establish a color scheme for your bouquet before you start. For instance, if you want your bouquet to look like a sunset, consider using a combination of strawberries, cantaloupe, watermelon, and pineapple."
        },
        {
          "headline":"Clean and trim your fruit so it’s ready to eat.",
          "description":"Rinse your fruit with cool, running water to clean the surface. Depending on what kind of fruit you use, you may have to trim off some additional stems. Vinegar also works to wash fruit and other produce."
        },
        {
          "headline":"Cut your larger fruit into small, decorative pieces.",
          "description":"Use a sharp knife to slice the larger portions of fruit into bite-sized pieces. While small fruits like strawberries won’t require too much prep, fruits like pineapple, cantaloupe, and watermelon will need to be sliced into smaller portions. To add some creative flair to your bouquet, use a cookie cutter to slice your fruit into fun shapes. Use a flower-shaped cookie cutter to make your pineapple slices look like flower blossoms. These slices may end up being a little larger than bite-sized."
        },
        {
          "headline":"Skewer each piece of fruit through the center.",
          "description":"Stab each piece of fruit with a skewer until the wood breaks through the other end of the fruit slice. Use this end of the skewer to hold smaller pieces of fruit, like melon balls."
        },
        {
          "headline":"Dip some of your fruit pieces in chocolate.",
          "description":"Melt chocolate chips in the microwave or with a double boiler. Take a skewered piece of fruit and roll it around in the chocolate until it’s completely covered. This makes your bouquet more decorative, and also more delicious! Use a spoon to drizzle other types of chocolate in fun designs on top of the fruit."
        },
        {
          "headline":"Place the fruit skewers in a flipped colander.",
          "description":"Flip over a metal or plastic colander so that the rounded portion is facing up. Stick each dipped piece of skewered fruit into the holes of a flipped colander. Wait at least 30 minutes, or until the chocolate has completely dried."
        },
        {
          "headline":"Fill a vase with large cubes of floral foam.",
          "description":"Use a kitchen knife to cut chunks of floral foam into cubes. These cubes should be sizable, and provide a comfortable base for the bouquet. The floral foam pieces should reach three-quarters of the height of the vase or container that you’re using to hold the fruit. Consider cutting angular pieces of floral foam to tuck in with the larger cubes to provide a more secure base for the fruit. Slice off smaller portions of the floral foam to make it fit more snugly in the vase or container."
        },
        {
          "headline":"Cover the floral foam with foil to protect the fruit.",
          "description":"Cut a medium-sized sheet of aluminum foil to cover the top of the floral foam. Even though skewers will be holding the fruit in place, the foil will prevent any foam from touching the lower levels of fruit in the bouquet. Be sure to tuck in the foil around the edges of the floral foam with your fingers. This will keep the foil in place."
        },
        {
          "headline":"Stick the skewers of fruit into the floral foam.",
          "description":"Push the skewered fruit about an inch into the floral foam. Place the different fruit skewers around the foam to imitate the look of a flower bouquet. Consider interchanging different fruit skewers to allow for a variety of colors. For example, put skewers with grapes in between skewers of pineapple and cantaloupe. Use toothpicks to secure smaller fruit pieces."
        },
        {
          "headline":"Arrange pieces of lettuce on the vase’s bottom.",
          "description":"Take large, leafy pieces of lettuce and place them in and around the various skewers. Try to have the lettuce sticking out over the edge of the vase or container to emulate flower leaves. If you’d prefer, you can place the lettuce on top of the floral foam before putting the fruit skewers in place."
        }
      ]
    },
    {
      "name":"Creating a Bouquet of Herbs",
      "steps":[
        {
          "headline":"Pick nice-smelling herbs to use in the bouquet.",
          "description":"Select a combination of aromatic herbs to include. Rosemary, sage, and peppermint are great candidates. Consider including edible flowers like Rainbow Chard, broccoli, or nasturtium. If you’re having trouble finding a certain herb or flower in a grocery store or flower shop, consider checking online. If you’ve picked the herbs and flowers yourself, trim off the ends of the stems for a nicer presentation. You only need to have about 6 inches (15 cm) to 8 inches (20 cm) of stalk total. Lay the herbs on a flat surface to organize them. Set all of your herbs and edible flowers on a table or other flat surface to make sure that you have everything you need. While you can always add in more plants later, it’s easier to have everything you need ahead of time."
        },
        {
          "headline":"Put herbs into a bouquet with your dominant hand.",
          "description":"Use your non-dominant hand to hold the herbs and edible flowers in place as you begin to assemble the bouquet. This will help to keep the arrangement secure as you add more plants to it with your dominant hand. To make your bouquet more visually appealing, try pairing tall and short plants together, like lavender and mint. Use a variety of colors to make your bouquet as vibrant as possible. For example, pair a white echinacea flower with green and earth-toned herbs like rosemary and thyme. Combine sage, lavender, and mint for a great smelling bouquet. Carrot blossoms and fennel sprigs also work well together in a bouquet."
        },
        {
          "headline":"Tie the stems together to keep them secure.",
          "description":"Twist ribbon grass around the stems and stalks of your plants. Tuck the loose end into the wrapped grass to secure it in place. You can find ribbon grass in the garden section of most home improvement stores. You can also use string to tie your bouquet together."
        }
      ]
    },
    {
      "name":"Assembling a Bacon Bouquet",
      "steps":[
        {
          "headline":"Rip off the blossom portion from the fake roses.",
          "description":"Remove the fake rose petals from the stem. Make sure to keep the leaves beneath the rose petals intact. These will help to secure the bacon to the stem later on. If you’re having difficulty pulling the blossoms off, use a small pair of scissors and trim the flowers with short, even snips. Fake flowers can be found at most craft stores."
        },
        {
          "headline":"Preheat the oven to 375 °F (191 °C).",
          "description":"While the oven heats up, you can begin to prepare the bacon. By the time you are finished assembling the bacon roses, the oven should be at the right temperature."
        },
        {
          "headline":"Take a piece of bacon and roll it to form a rose.",
          "description":"Pick up a piece of raw bacon and roll it into a smaller coil. Try to leave some gaps between each layer of rolled bacon, as this will make the rose look more convincing. Use thick-cut bacon if you want more prominent rose petals."
        },
        {
          "headline":"Stick two toothpicks in the bacon to hold it in place.",
          "description":"Take a toothpick and skewer it through the bottom of the rose. After the first toothpick is secure, stab a second toothpick through the bottom of the rose so that it’s perpendicular to the first toothpick. This will help the bacon keep its shape in the cooking process."
        },
        {
          "headline":"Put a metal rack over a pan lined with foil.",
          "description":"Take a metal rack and place it on top of a pan. Be sure to place a sheet of aluminum foil on the bottom of the pan so that it sits beneath the metal rack. The foil will help catch any of the fat that drips down during the baking process."
        },
        {
          "headline":"Place the bacon on the rack.",
          "description":"Put each piece of rolled bacon on an oven-safe cooking rack. The bacon roses should be at least an inch apart. This method works best when you’re cooking 8 pieces of bacon at a time."
        },
        {
          "headline":"Slide the bacon into the oven for 45 minutes.",
          "description":"Place the metal pan and rack into the oven. It should take around 45 minutes for the bacon to cook completely, but check periodically to see how baked it is. Depending on the type of bacon you’re using, you may have a longer or shorter cooking time. Check the package of bacon to make sure."
        },
        {
          "headline":"Remove the toothpicks from the bacon.",
          "description":"Let the bacon cool for a few minutes before removing each toothpick. Take the toothpicks out above the pan, in case there’s any leftover grease that drips out. Throw out the toothpicks once you’ve removed them from the bacon."
        },
        {
          "headline":"Stick the cooked bacon on top of the fake rose.",
          "description":"Use one hand to hold the fake rose stem in place. Take a bacon rose in your opposite hand and slide it onto the stem. Try to place it in the center of the green plastic leaves. Some plastic roses may have a long, metal pin sticking through the center of the stem. Use this pin to hold the bacon rose securely in place."
        },
        {
          "headline":"Position the bacon roses nicely in a vase.",
          "description":"Take the assembled bacon roses and place them in a vase or jar. Position the plastic stems similarly to a flower bouquet. Try and have as many of the bacon roses be visible as possible. Consider adding small, real flowers to the vase as well. Baby’s breath is a tiny flower that can fit into small spaces."
        }
      ]
    }
  ],
  "text":" Preparing a Fruit Bouquet Choose which fruits to use in the bouquet. Think about mixing fruits with sharp, juicy flavors along with mildly-flavored fruits. The tangy flavor of pineapple is a great match for more softly-flavored fruits like cantaloupes and grapes. Establish a color scheme for your bouquet before you start. For instance, if you want your bouquet to look like a sunset, consider using a combination of strawberries, cantaloupe, watermelon, and pineapple. Clean and trim your fruit so it’s ready to eat. Rinse your fruit with cool, running water to clean the surface. Depending on what kind of fruit you use, you may have to trim off some additional stems. Vinegar also works to wash fruit and other produce. Cut your larger fruit into small, decorative pieces. Use a sharp knife to slice the larger portions of fruit into bite-sized pieces. While small fruits like strawberries won’t require too much prep, fruits like pineapple, cantaloupe, and watermelon will need to be sliced into smaller portions. To add some creative flair to your bouquet, use a cookie cutter to slice your fruit into fun shapes. Use a flower-shaped cookie cutter to make your pineapple slices look like flower blossoms. These slices may end up being a little larger than bite-sized. Skewer each piece of fruit through the center. Stab each piece of fruit with a skewer until the wood breaks through the other end of the fruit slice. Use this end of the skewer to hold smaller pieces of fruit, like melon balls. Dip some of your fruit pieces in chocolate. Melt chocolate chips in the microwave or with a double boiler. Take a skewered piece of fruit and roll it around in the chocolate until it’s completely covered. This makes your bouquet more decorative, and also more delicious! Use a spoon to drizzle other types of chocolate in fun designs on top of the fruit. Place the fruit skewers in a flipped colander. Flip over a metal or plastic colander so that the rounded portion is facing up. Stick each dipped piece of skewered fruit into the holes of a flipped colander. Wait at least 30 minutes, or until the chocolate has completely dried. Fill a vase with large cubes of floral foam. Use a kitchen knife to cut chunks of floral foam into cubes. These cubes should be sizable, and provide a comfortable base for the bouquet. The floral foam pieces should reach three-quarters of the height of the vase or container that you’re using to hold the fruit. Consider cutting angular pieces of floral foam to tuck in with the larger cubes to provide a more secure base for the fruit. Slice off smaller portions of the floral foam to make it fit more snugly in the vase or container. Cover the floral foam with foil to protect the fruit. Cut a medium-sized sheet of aluminum foil to cover the top of the floral foam. Even though skewers will be holding the fruit in place, the foil will prevent any foam from touching the lower levels of fruit in the bouquet. Be sure to tuck in the foil around the edges of the floral foam with your fingers. This will keep the foil in place. Stick the skewers of fruit into the floral foam. Push the skewered fruit about an inch into the floral foam. Place the different fruit skewers around the foam to imitate the look of a flower bouquet. Consider interchanging different fruit skewers to allow for a variety of colors. For example, put skewers with grapes in between skewers of pineapple and cantaloupe. Use toothpicks to secure smaller fruit pieces. Arrange pieces of lettuce on the vase’s bottom. Take large, leafy pieces of lettuce and place them in and around the various skewers. Try to have the lettuce sticking out over the edge of the vase or container to emulate flower leaves. If you’d prefer, you can place the lettuce on top of the floral foam before putting the fruit skewers in place. Creating a Bouquet of Herbs Pick nice-smelling herbs to use in the bouquet. Select a combination of aromatic herbs to include. Rosemary, sage, and peppermint are great candidates. Consider including edible flowers like Rainbow Chard, broccoli, or nasturtium. If you’re having trouble finding a certain herb or flower in a grocery store or flower shop, consider checking online. If you’ve picked the herbs and flowers yourself, trim off the ends of the stems for a nicer presentation. You only need to have about 6 inches (15 cm) to 8 inches (20 cm) of stalk total. Lay the herbs on a flat surface to organize them. Set all of your herbs and edible flowers on a table or other flat surface to make sure that you have everything you need. While you can always add in more plants later, it’s easier to have everything you need ahead of time. Put herbs into a bouquet with your dominant hand. Use your non-dominant hand to hold the herbs and edible flowers in place as you begin to assemble the bouquet. This will help to keep the arrangement secure as you add more plants to it with your dominant hand. To make your bouquet more visually appealing, try pairing tall and short plants together, like lavender and mint. Use a variety of colors to make your bouquet as vibrant as possible. For example, pair a white echinacea flower with green and earth-toned herbs like rosemary and thyme. Combine sage, lavender, and mint for a great smelling bouquet. Carrot blossoms and fennel sprigs also work well together in a bouquet. Tie the stems together to keep them secure. Twist ribbon grass around the stems and stalks of your plants. Tuck the loose end into the wrapped grass to secure it in place. You can find ribbon grass in the garden section of most home improvement stores. You can also use string to tie your bouquet together. Assembling a Bacon Bouquet Rip off the blossom portion from the fake roses. Remove the fake rose petals from the stem. Make sure to keep the leaves beneath the rose petals intact. These will help to secure the bacon to the stem later on. If you’re having difficulty pulling the blossoms off, use a small pair of scissors and trim the flowers with short, even snips. Fake flowers can be found at most craft stores. Preheat the oven to 375 °F (191 °C). While the oven heats up, you can begin to prepare the bacon. By the time you are finished assembling the bacon roses, the oven should be at the right temperature. Take a piece of bacon and roll it to form a rose. Pick up a piece of raw bacon and roll it into a smaller coil. Try to leave some gaps between each layer of rolled bacon, as this will make the rose look more convincing. Use thick-cut bacon if you want more prominent rose petals. Stick two toothpicks in the bacon to hold it in place. Take a toothpick and skewer it through the bottom of the rose. After the first toothpick is secure, stab a second toothpick through the bottom of the rose so that it’s perpendicular to the first toothpick. This will help the bacon keep its shape in the cooking process. Put a metal rack over a pan lined with foil. Take a metal rack and place it on top of a pan. Be sure to place a sheet of aluminum foil on the bottom of the pan so that it sits beneath the metal rack. The foil will help catch any of the fat that drips down during the baking process. Place the bacon on the rack. Put each piece of rolled bacon on an oven-safe cooking rack. The bacon roses should be at least an inch apart. This method works best when you’re cooking 8 pieces of bacon at a time. Slide the bacon into the oven for 45 minutes. Place the metal pan and rack into the oven. It should take around 45 minutes for the bacon to cook completely, but check periodically to see how baked it is. Depending on the type of bacon you’re using, you may have a longer or shorter cooking time. Check the package of bacon to make sure. Remove the toothpicks from the bacon. Let the bacon cool for a few minutes before removing each toothpick. Take the toothpicks out above the pan, in case there’s any leftover grease that drips out. Throw out the toothpicks once you’ve removed them from the bacon. Stick the cooked bacon on top of the fake rose. Use one hand to hold the fake rose stem in place. Take a bacon rose in your opposite hand and slide it onto the stem. Try to place it in the center of the green plastic leaves. Some plastic roses may have a long, metal pin sticking through the center of the stem. Use this pin to hold the bacon rose securely in place. Position the bacon roses nicely in a vase. Take the assembled bacon roses and place them in a vase or jar. Position the plastic stems similarly to a flower bouquet. Try and have as many of the bacon roses be visible as possible. Consider adding small, real flowers to the vase as well. Baby’s breath is a tiny flower that can fit into small spaces.",
  "sentences":[
    " Preparing a Fruit Bouquet Choose which fruits to use in the bouquet.",
    "Think about mixing fruits with sharp, juicy flavors along with mildly-flavored fruits.",
    "The tangy flavor of pineapple is a great match for more softly-flavored fruits like cantaloupes and grapes.",
    "Establish a color scheme for your bouquet before you start.",
    "For instance, if you want your bouquet to look like a sunset, consider using a combination of strawberries, cantaloupe, watermelon, and pineapple.",
    "Clean and trim your fruit so it’s ready to eat.",
    "Rinse your fruit with cool, running water to clean the surface.",
    "Depending on what kind of fruit you use, you may have to trim off some additional stems.",
    "Vinegar also works to wash fruit and other produce.",
    "Cut your larger fruit into small, decorative pieces.",
    "Use a sharp knife to slice the larger portions of fruit into bite-sized pieces.",
    "While small fruits like strawberries won’t require too much prep, fruits like pineapple, cantaloupe, and watermelon will need to be sliced into smaller portions.",
    "To add some creative flair to your bouquet, use a cookie cutter to slice your fruit into fun shapes.",
    "Use a flower-shaped cookie cutter to make your pineapple slices look like flower blossoms.",
    "These slices may end up being a little larger than bite-sized.",
    "Skewer each piece of fruit through the center.",
    "Stab each piece of fruit with a skewer until the wood breaks through the other end of the fruit slice.",
    "Use this end of the skewer to hold smaller pieces of fruit, like melon balls.",
    "Dip some of your fruit pieces in chocolate.",
    "Melt chocolate chips in the microwave or with a double boiler.",
    "Take a skewered piece of fruit and roll it around in the chocolate until it’s completely covered.",
    "This makes your bouquet more decorative, and also more delicious!",
    "Use a spoon to drizzle other types of chocolate in fun designs on top of the fruit.",
    "Place the fruit skewers in a flipped colander.",
    "Flip over a metal or plastic colander so that the rounded portion is facing up.",
    "Stick each dipped piece of skewered fruit into the holes of a flipped colander.",
    "Wait at least 30 minutes, or until the chocolate has completely dried.",
    "Fill a vase with large cubes of floral foam.",
    "Use a kitchen knife to cut chunks of floral foam into cubes.",
    "These cubes should be sizable, and provide a comfortable base for the bouquet.",
    "The floral foam pieces should reach three-quarters of the height of the vase or container that you’re using to hold the fruit.",
    "Consider cutting angular pieces of floral foam to tuck in with the larger cubes to provide a more secure base for the fruit.",
    "Slice off smaller portions of the floral foam to make it fit more snugly in the vase or container.",
    "Cover the floral foam with foil to protect the fruit.",
    "Cut a medium-sized sheet of aluminum foil to cover the top of the floral foam.",
    "Even though skewers will be holding the fruit in place, the foil will prevent any foam from touching the lower levels of fruit in the bouquet.",
    "Be sure to tuck in the foil around the edges of the floral foam with your fingers.",
    "This will keep the foil in place.",
    "Stick the skewers of fruit into the floral foam.",
    "Push the skewered fruit about an inch into the floral foam.",
    "Place the different fruit skewers around the foam to imitate the look of a flower bouquet.",
    "Consider interchanging different fruit skewers to allow for a variety of colors.",
    "For example, put skewers with grapes in between skewers of pineapple and cantaloupe.",
    "Use toothpicks to secure smaller fruit pieces.",
    "Arrange pieces of lettuce on the vase’s bottom.",
    "Take large, leafy pieces of lettuce and place them in and around the various skewers.",
    "Try to have the lettuce sticking out over the edge of the vase or container to emulate flower leaves.",
    "If you’d prefer, you can place the lettuce on top of the floral foam before putting the fruit skewers in place.",
    "Creating a Bouquet of Herbs Pick nice-smelling herbs to use in the bouquet.",
    "Select a combination of aromatic herbs to include.",
    "Rosemary, sage, and peppermint are great candidates.",
    "Consider including edible flowers like Rainbow Chard, broccoli, or nasturtium.",
    "If you’re having trouble finding a certain herb or flower in a grocery store or flower shop, consider checking online.",
    "If you’ve picked the herbs and flowers yourself, trim off the ends of the stems for a nicer presentation.",
    "You only need to have about 6 inches (15 cm) to 8 inches (20 cm) of stalk total.",
    "Lay the herbs on a flat surface to organize them.",
    "Set all of your herbs and edible flowers on a table or other flat surface to make sure that you have everything you need.",
    "While you can always add in more plants later, it’s easier to have everything you need ahead of time.",
    "Put herbs into a bouquet with your dominant hand.",
    "Use your non-dominant hand to hold the herbs and edible flowers in place as you begin to assemble the bouquet.",
    "This will help to keep the arrangement secure as you add more plants to it with your dominant hand.",
    "To make your bouquet more visually appealing, try pairing tall and short plants together, like lavender and mint.",
    "Use a variety of colors to make your bouquet as vibrant as possible.",
    "For example, pair a white echinacea flower with green and earth-toned herbs like rosemary and thyme.",
    "Combine sage, lavender, and mint for a great smelling bouquet.",
    "Carrot blossoms and fennel sprigs also work well together in a bouquet.",
    "Tie the stems together to keep them secure.",
    "Twist ribbon grass around the stems and stalks of your plants.",
    "Tuck the loose end into the wrapped grass to secure it in place.",
    "You can find ribbon grass in the garden section of most home improvement stores.",
    "You can also use string to tie your bouquet together.",
    "Assembling a Bacon Bouquet Rip off the blossom portion from the fake roses.",
    "Remove the fake rose petals from the stem.",
    "Make sure to keep the leaves beneath the rose petals intact.",
    "These will help to secure the bacon to the stem later on.",
    "If you’re having difficulty pulling the blossoms off, use a small pair of scissors and trim the flowers with short, even snips.",
    "Fake flowers can be found at most craft stores.",
    "Preheat the oven to 375 °F (191 °C).",
    "While the oven heats up, you can begin to prepare the bacon.",
    "By the time you are finished assembling the bacon roses, the oven should be at the right temperature.",
    "Take a piece of bacon and roll it to form a rose.",
    "Pick up a piece of raw bacon and roll it into a smaller coil.",
    "Try to leave some gaps between each layer of rolled bacon, as this will make the rose look more convincing.",
    "Use thick-cut bacon if you want more prominent rose petals.",
    "Stick two toothpicks in the bacon to hold it in place.",
    "Take a toothpick and skewer it through the bottom of the rose.",
    "After the first toothpick is secure, stab a second toothpick through the bottom of the rose so that it’s perpendicular to the first toothpick.",
    "This will help the bacon keep its shape in the cooking process.",
    "Put a metal rack over a pan lined with foil.",
    "Take a metal rack and place it on top of a pan.",
    "Be sure to place a sheet of aluminum foil on the bottom of the pan so that it sits beneath the metal rack.",
    "The foil will help catch any of the fat that drips down during the baking process.",
    "Place the bacon on the rack.",
    "Put each piece of rolled bacon on an oven-safe cooking rack.",
    "The bacon roses should be at least an inch apart.",
    "This method works best when you’re cooking 8 pieces of bacon at a time.",
    "Slide the bacon into the oven for 45 minutes.",
    "Place the metal pan and rack into the oven.",
    "It should take around 45 minutes for the bacon to cook completely, but check periodically to see how baked it is.",
    "Depending on the type of bacon you’re using, you may have a longer or shorter cooking time.",
    "Check the package of bacon to make sure.",
    "Remove the toothpicks from the bacon.",
    "Let the bacon cool for a few minutes before removing each toothpick.",
    "Take the toothpicks out above the pan, in case there’s any leftover grease that drips out.",
    "Throw out the toothpicks once you’ve removed them from the bacon.",
    "Stick the cooked bacon on top of the fake rose.",
    "Use one hand to hold the fake rose stem in place.",
    "Take a bacon rose in your opposite hand and slide it onto the stem.",
    "Try to place it in the center of the green plastic leaves.",
    "Some plastic roses may have a long, metal pin sticking through the center of the stem.",
    "Use this pin to hold the bacon rose securely in place.",
    "Position the bacon roses nicely in a vase.",
    "Take the assembled bacon roses and place them in a vase or jar.",
    "Position the plastic stems similarly to a flower bouquet.",
    "Try and have as many of the bacon roses be visible as possible.",
    "Consider adding small, real flowers to the vase as well.",
    "Baby’s breath is a tiny flower that can fit into small spaces."
  ],
  "tyn_section":[
    "Various fruits",
    "Lettuce",
    "Various herbs",
    "Various edible flowers",
    "Bacon",
    "Chopping knife",
    "Toothpicks",
    "Wooden skewers",
    "Colander",
    "Floral foam",
    "Container or vase",
    "Ribbon grass",
    "String (optional)",
    "Fake roses",
    "Small flowers (optional)"
  ],
  "tyn_model":[
    "bacon",
    "floral foam",
    "vase",
    "herbs",
    "foil",
    "oven",
    "pineapple",
    "chocolate",
    "fruit skewers",
    "lettuce",
    "cantaloupe",
    "bacon roses",
    "fruits",
    "grapes",
    "strawberries",
    "watermelon",
    "cookie cutter",
    "colander",
    "container",
    "aluminum foil",
    "skewers",
    "rosemary",
    "sage",
    "lavender",
    "mint",
    "ribbon grass",
    "metal rack",
    "pan",
    "bacon rose",
    "water",
    "vinegar",
    "knife",
    "skewer",
    "chocolate chips",
    "microwave",
    "double boiler",
    "spoon",
    "flipped colander",
    "kitchen knife",
    "fruit",
    "toothpicks",
    "broccoli",
    "herb",
    "thyme",
    "carrot",
    "fennel sprigs",
    "string",
    "roses",
    "scissors",
    "toothpick",
    "oven-safe cooking",
    "metal pan",
    "jar"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1132075472,
    "f1":0.1764705882,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.2830188679,
    "f1":0.4181184669
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8666666667,
    "p":0.358490566,
    "f1":0.5071868583
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1132075472,
    "f1":0.1764705882
  }
}