{
  "title":"How to Polish Corian Countertops",
  "url":"https://www.wikihow.com/Polish-Corian-Countertops",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning"
  ],
  "parts":[
    {
      "name":"Cleaning the Countertop",
      "steps":[
        {
          "headline":"Perform everyday cleaning with an ammonia-based household cleaner.",
          "description":"Spray the entire countertop with an ammonia-based household cleaner or countertop cleaner from a spray bottle. Wipe the countertop with a microfiber cloth in circular motions to clean it. Don’t use non-ammonia-based household sprays, such as some window cleaners, because they will leave residues behind."
        },
        {
          "headline":"Clean the countertop with warm soapy water if you don’t have a spray cleaner.",
          "description":"Fill a bowl with warm water and put 2-3 drops of liquid dish soap in it. Soak a sponge in the solution and wipe down the countertop in circular motions to clean it. Rinse the sponge to remove all the soap and wipe away the soap residue from the counter.Tip: Warm soapy water and ammonia-based household spray cleaners are equally effective for cleaning Corian countertops, so choose a method based on your personal preference and what you have available. Make sure to thoroughly wipe away all the soap residue so that soap scum doesn’t build up on the countertop."
        },
        {
          "headline":"Use an abrasive household cleaner to remove stains and residue buildup.",
          "description":"Wet a sponge then pour an abrasive household cleaner onto the scrubber side of the sponge. Scrub the countertop using small overlapping circular motions wherever you see stains or buildup of residue or soap scum. Rinse the sponge out and wipe the cleaner off the countertop with the soft absorbent side. You can use this cleaning method to keep your Corian countertops shiny. Perform the process 1-2 times a month, even if the countertop is not particularly dirty, to keep the finish looking glossy."
        },
        {
          "headline":"Wipe the countertop dry with a clean, dry microfiber cloth after every cleaning.",
          "description":"Wipe the countertop completely dry immediately after cleaning it to prevent buildup of residues. A film can build up even when you just let plain water sit on the counter, so it’s important to keep it dry at all times. Keep a kitchen towel or paper towels handy to wipe up spills on your countertop right away when they happen."
        }
      ]
    },
    {
      "name":"Buffing Out Fine Scratches",
      "steps":[
        {
          "headline":"Wipe down the countertop with an ammonia-based cleaner to remove residue.",
          "description":"Clean the countertop with an ammonia-based spray cleaner or warm soapy water for minor residue buildups, or with an abrasive cleaner for heavier buildups. Don’t dry off the countertop as you normally would after cleaning. It’s important to clean the countertop thoroughly because any dirt or grime can clog up the cleaning pad when you are attempting to buff out the scratches. This method works to remove minor scratches, scorch marks, and very stubborn stains."
        },
        {
          "headline":"Scrub out scratches with an abrasive cleaning pad and abrasive cleaner.",
          "description":"Wet the pad and pour some abrasive cleaner onto it. Rub over the scratch alternating between a linear back-and-forth motion and a side-to-side motion. Change the direction you are scrubbing every 3-4 strokes until the scratch disappears.Warning: Never cut or chop foods on your Corian countertops or you will scratch them. Don’t put hot pots, pans, or other objects directly onto Corian countertops or you will scorch them. An example of an abrasive cleaning pad you can use for this is a Scotch-Brite pad. You can buff your whole countertop at least once a month with an abrasive cleaner and an abrasive pad, working in circular motions instead of linear motions, to help the finish stay glossy and bright."
        },
        {
          "headline":"Rinse the countertop completely with plain water.",
          "description":"Wipe the countertop down with a clean wet sponge to remove all the abrasive cleaner residue. Rinse the sponge and repeat as necessary until the countertop is completely clean. If you notice that the scratch is still visible after rinsing away the cleaner residue from on top, you can repeat the buffing process to try and get rid of it. However, in some cases the scratch might be too deep and this method won’t make it completely disappear."
        },
        {
          "headline":"Dry the countertop thoroughly with a clean microfiber cloth.",
          "description":"Wipe the countertop dry immediately after you have finished rinsing it to prevent film buildup from the water. Inspect it to make sure that the scratch has been buffed out and that the area blends in with the rest of the countertop. If the spot where you buffed out the scratch looks different from the rest of the countertop, repeat the process using circular motions over a larger area to blend it in until it is less noticeable."
        }
      ]
    },
    {
      "name":"Restoring Shine with Countertop Polish",
      "steps":[
        {
          "headline":"Purchase a commercial countertop polish.",
          "description":"Commercial polishes made for other types of countertops, such as granite, will also work to polish your Corian countertops. These types of polishes are available at home improvement stores or online. Check the label to make sure that it is safe for your countertops. Many labels will specify that the polish can be used on Corian. If it doesn’t specifically mention Corian, then check to see if it is safe to use on granite."
        },
        {
          "headline":"Apply polish to the countertop in circular motions with a clean microfiber cloth.",
          "description":"Apply a small amount of the polish (or the amount recommended on the label) to a microfiber cloth. Rub it onto the Corian countertop in circular motions, reversing the direction your arm is making the circles in every 3-4 rotations.Tip: If you don’t want to put in the elbow grease and time required for polishing by hand, you can use a random-orbit electric sander with polishing pads to apply the polish instead. Make sure that the countertop is completely clean before you start applying polish to it."
        },
        {
          "headline":"Use another clean microfiber cloth to buff off the polish.",
          "description":"Work in alternating circular motions and wipe off the polish one section at a time. Grab another clean cloth if the one you are using gets too dirty with polish and isn’t buffing off the polish as effectively. Microfiber cloths are the best for buffing off the polish because they are super-soft and lint-free."
        },
        {
          "headline":"Get your countertop professionally refinished if you can’t restore the shine.",
          "description":"Some countertops are just too old and damaged to get the shine back. Hire a professional countertop refinisher to come and sand down your countertops and then repolish them to get back the factory-finished look. Once you have a polished Corian countertop, clean it regularly to keep it shiny and protect the finish, so you won’t have to get it refinished again any time soon."
        }
      ]
    }
  ],
  "text":" Cleaning the Countertop Perform everyday cleaning with an ammonia-based household cleaner. Spray the entire countertop with an ammonia-based household cleaner or countertop cleaner from a spray bottle. Wipe the countertop with a microfiber cloth in circular motions to clean it. Don’t use non-ammonia-based household sprays, such as some window cleaners, because they will leave residues behind. Clean the countertop with warm soapy water if you don’t have a spray cleaner. Fill a bowl with warm water and put 2-3 drops of liquid dish soap in it. Soak a sponge in the solution and wipe down the countertop in circular motions to clean it. Rinse the sponge to remove all the soap and wipe away the soap residue from the counter.Tip: Warm soapy water and ammonia-based household spray cleaners are equally effective for cleaning Corian countertops, so choose a method based on your personal preference and what you have available. Make sure to thoroughly wipe away all the soap residue so that soap scum doesn’t build up on the countertop. Use an abrasive household cleaner to remove stains and residue buildup. Wet a sponge then pour an abrasive household cleaner onto the scrubber side of the sponge. Scrub the countertop using small overlapping circular motions wherever you see stains or buildup of residue or soap scum. Rinse the sponge out and wipe the cleaner off the countertop with the soft absorbent side. You can use this cleaning method to keep your Corian countertops shiny. Perform the process 1-2 times a month, even if the countertop is not particularly dirty, to keep the finish looking glossy. Wipe the countertop dry with a clean, dry microfiber cloth after every cleaning. Wipe the countertop completely dry immediately after cleaning it to prevent buildup of residues. A film can build up even when you just let plain water sit on the counter, so it’s important to keep it dry at all times. Keep a kitchen towel or paper towels handy to wipe up spills on your countertop right away when they happen. Buffing Out Fine Scratches Wipe down the countertop with an ammonia-based cleaner to remove residue. Clean the countertop with an ammonia-based spray cleaner or warm soapy water for minor residue buildups, or with an abrasive cleaner for heavier buildups. Don’t dry off the countertop as you normally would after cleaning. It’s important to clean the countertop thoroughly because any dirt or grime can clog up the cleaning pad when you are attempting to buff out the scratches. This method works to remove minor scratches, scorch marks, and very stubborn stains. Scrub out scratches with an abrasive cleaning pad and abrasive cleaner. Wet the pad and pour some abrasive cleaner onto it. Rub over the scratch alternating between a linear back-and-forth motion and a side-to-side motion. Change the direction you are scrubbing every 3-4 strokes until the scratch disappears.Warning: Never cut or chop foods on your Corian countertops or you will scratch them. Don’t put hot pots, pans, or other objects directly onto Corian countertops or you will scorch them. An example of an abrasive cleaning pad you can use for this is a Scotch-Brite pad. You can buff your whole countertop at least once a month with an abrasive cleaner and an abrasive pad, working in circular motions instead of linear motions, to help the finish stay glossy and bright. Rinse the countertop completely with plain water. Wipe the countertop down with a clean wet sponge to remove all the abrasive cleaner residue. Rinse the sponge and repeat as necessary until the countertop is completely clean. If you notice that the scratch is still visible after rinsing away the cleaner residue from on top, you can repeat the buffing process to try and get rid of it. However, in some cases the scratch might be too deep and this method won’t make it completely disappear. Dry the countertop thoroughly with a clean microfiber cloth. Wipe the countertop dry immediately after you have finished rinsing it to prevent film buildup from the water. Inspect it to make sure that the scratch has been buffed out and that the area blends in with the rest of the countertop. If the spot where you buffed out the scratch looks different from the rest of the countertop, repeat the process using circular motions over a larger area to blend it in until it is less noticeable. Restoring Shine with Countertop Polish Purchase a commercial countertop polish. Commercial polishes made for other types of countertops, such as granite, will also work to polish your Corian countertops. These types of polishes are available at home improvement stores or online. Check the label to make sure that it is safe for your countertops. Many labels will specify that the polish can be used on Corian. If it doesn’t specifically mention Corian, then check to see if it is safe to use on granite. Apply polish to the countertop in circular motions with a clean microfiber cloth. Apply a small amount of the polish (or the amount recommended on the label) to a microfiber cloth. Rub it onto the Corian countertop in circular motions, reversing the direction your arm is making the circles in every 3-4 rotations.Tip: If you don’t want to put in the elbow grease and time required for polishing by hand, you can use a random-orbit electric sander with polishing pads to apply the polish instead. Make sure that the countertop is completely clean before you start applying polish to it. Use another clean microfiber cloth to buff off the polish. Work in alternating circular motions and wipe off the polish one section at a time. Grab another clean cloth if the one you are using gets too dirty with polish and isn’t buffing off the polish as effectively. Microfiber cloths are the best for buffing off the polish because they are super-soft and lint-free. Get your countertop professionally refinished if you can’t restore the shine. Some countertops are just too old and damaged to get the shine back. Hire a professional countertop refinisher to come and sand down your countertops and then repolish them to get back the factory-finished look. Once you have a polished Corian countertop, clean it regularly to keep it shiny and protect the finish, so you won’t have to get it refinished again any time soon.",
  "sentences":[
    " Cleaning the Countertop Perform everyday cleaning with an ammonia-based household cleaner.",
    "Spray the entire countertop with an ammonia-based household cleaner or countertop cleaner from a spray bottle.",
    "Wipe the countertop with a microfiber cloth in circular motions to clean it.",
    "Don’t use non-ammonia-based household sprays, such as some window cleaners, because they will leave residues behind.",
    "Clean the countertop with warm soapy water if you don’t have a spray cleaner.",
    "Fill a bowl with warm water and put 2-3 drops of liquid dish soap in it.",
    "Soak a sponge in the solution and wipe down the countertop in circular motions to clean it.",
    "Rinse the sponge to remove all the soap and wipe away the soap residue from the counter.Tip: Warm soapy water and ammonia-based household spray cleaners are equally effective for cleaning Corian countertops, so choose a method based on your personal preference and what you have available.",
    "Make sure to thoroughly wipe away all the soap residue so that soap scum doesn’t build up on the countertop.",
    "Use an abrasive household cleaner to remove stains and residue buildup.",
    "Wet a sponge then pour an abrasive household cleaner onto the scrubber side of the sponge.",
    "Scrub the countertop using small overlapping circular motions wherever you see stains or buildup of residue or soap scum.",
    "Rinse the sponge out and wipe the cleaner off the countertop with the soft absorbent side.",
    "You can use this cleaning method to keep your Corian countertops shiny.",
    "Perform the process 1-2 times a month, even if the countertop is not particularly dirty, to keep the finish looking glossy.",
    "Wipe the countertop dry with a clean, dry microfiber cloth after every cleaning.",
    "Wipe the countertop completely dry immediately after cleaning it to prevent buildup of residues.",
    "A film can build up even when you just let plain water sit on the counter, so it’s important to keep it dry at all times.",
    "Keep a kitchen towel or paper towels handy to wipe up spills on your countertop right away when they happen.",
    "Buffing Out Fine Scratches Wipe down the countertop with an ammonia-based cleaner to remove residue.",
    "Clean the countertop with an ammonia-based spray cleaner or warm soapy water for minor residue buildups, or with an abrasive cleaner for heavier buildups.",
    "Don’t dry off the countertop as you normally would after cleaning.",
    "It’s important to clean the countertop thoroughly because any dirt or grime can clog up the cleaning pad when you are attempting to buff out the scratches.",
    "This method works to remove minor scratches, scorch marks, and very stubborn stains.",
    "Scrub out scratches with an abrasive cleaning pad and abrasive cleaner.",
    "Wet the pad and pour some abrasive cleaner onto it.",
    "Rub over the scratch alternating between a linear back-and-forth motion and a side-to-side motion.",
    "Change the direction you are scrubbing every 3-4 strokes until the scratch disappears.Warning: Never cut or chop foods on your Corian countertops or you will scratch them.",
    "Don’t put hot pots, pans, or other objects directly onto Corian countertops or you will scorch them.",
    "An example of an abrasive cleaning pad you can use for this is a Scotch-Brite pad.",
    "You can buff your whole countertop at least once a month with an abrasive cleaner and an abrasive pad, working in circular motions instead of linear motions, to help the finish stay glossy and bright.",
    "Rinse the countertop completely with plain water.",
    "Wipe the countertop down with a clean wet sponge to remove all the abrasive cleaner residue.",
    "Rinse the sponge and repeat as necessary until the countertop is completely clean.",
    "If you notice that the scratch is still visible after rinsing away the cleaner residue from on top, you can repeat the buffing process to try and get rid of it.",
    "However, in some cases the scratch might be too deep and this method won’t make it completely disappear.",
    "Dry the countertop thoroughly with a clean microfiber cloth.",
    "Wipe the countertop dry immediately after you have finished rinsing it to prevent film buildup from the water.",
    "Inspect it to make sure that the scratch has been buffed out and that the area blends in with the rest of the countertop.",
    "If the spot where you buffed out the scratch looks different from the rest of the countertop, repeat the process using circular motions over a larger area to blend it in until it is less noticeable.",
    "Restoring Shine with Countertop Polish Purchase a commercial countertop polish.",
    "Commercial polishes made for other types of countertops, such as granite, will also work to polish your Corian countertops.",
    "These types of polishes are available at home improvement stores or online.",
    "Check the label to make sure that it is safe for your countertops.",
    "Many labels will specify that the polish can be used on Corian.",
    "If it doesn’t specifically mention Corian, then check to see if it is safe to use on granite.",
    "Apply polish to the countertop in circular motions with a clean microfiber cloth.",
    "Apply a small amount of the polish (or the amount recommended on the label) to a microfiber cloth.",
    "Rub it onto the Corian countertop in circular motions, reversing the direction your arm is making the circles in every 3-4 rotations.Tip: If you don’t want to put in the elbow grease and time required for polishing by hand, you can use a random-orbit electric sander with polishing pads to apply the polish instead.",
    "Make sure that the countertop is completely clean before you start applying polish to it.",
    "Use another clean microfiber cloth to buff off the polish.",
    "Work in alternating circular motions and wipe off the polish one section at a time.",
    "Grab another clean cloth if the one you are using gets too dirty with polish and isn’t buffing off the polish as effectively.",
    "Microfiber cloths are the best for buffing off the polish because they are super-soft and lint-free.",
    "Get your countertop professionally refinished if you can’t restore the shine.",
    "Some countertops are just too old and damaged to get the shine back.",
    "Hire a professional countertop refinisher to come and sand down your countertops and then repolish them to get back the factory-finished look.",
    "Once you have a polished Corian countertop, clean it regularly to keep it shiny and protect the finish, so you won’t have to get it refinished again any time soon."
  ],
  "tyn_section":[
    "Ammonia-based household cleaner",
    "Warm soapy water",
    "Sponges",
    "Microfiber cloths",
    "Abrasive household cleaner",
    "Abrasive cleaning pad",
    "Countertop polish"
  ],
  "tyn_model":[
    "sponge",
    "microfiber cloth",
    "abrasive cleaner",
    "polish",
    "water",
    "ammonia-based household cleaner",
    "soapy water",
    "abrasive cleaning pad",
    "countertop polish",
    "polishes",
    "granite",
    "countertop cleaner",
    "spray bottle",
    "ammonia-based household sprays",
    "window cleaners",
    "spray cleaner",
    "bowl",
    "liquid dish soap",
    "ammonia-based household spray cleaners",
    "household cleaner",
    "abrasive household cleaner",
    "kitchen towel",
    "ammonia-based cleaner",
    "ammonia-based spray cleaner",
    "cleaning pad",
    "scotch-brite pad",
    "abrasive pad",
    "random-orbit electric sander",
    "microfiber cloths",
    "countertop refinisher"
  ],
  "simple_metrics":{
    "r":0.7142857143,
    "p":0.1666666667,
    "f1":0.2702702703,
    "avg_pos":0.1666666667
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.4666666667,
    "f1":0.6043165468
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.6333333333,
    "f1":0.7284345048
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8571428571,
    "p":0.3666666667,
    "f1":0.513618677
  }
}