{
  "title":"How to Disinfect Something That Fell in Your Unflushed Toilet Bowl",
  "url":"https://www.wikihow.com/Disinfect-Something-That-Fell-in-Your-Unflushed-Toilet-Bowl",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Retrieving and Rinsing the Lost Item",
      "steps":[
        {
          "headline":"Grab a pair of rubber gloves.",
          "description":"If you’re lucky enough to drop something into a toilet in your own home, be prepared and have some rubber gloves on hand. Pulling these on before you stick your hand into germ-filled toilet water will make the task a lot more bearable. If you’re out somewhere and don’t have the benefit of gloves, you’ll have to decide whether it’s worth taking the plunge. Don’t flush anything that’s too big to fit through the pipes of the toilet. Then you’ll just have an additional mess to deal with. Assuming gloves are not an option, think on your feet and use some other object, such as a wad of paper towels or a plastic bag turned inside out, to protect your hand from the worst of the mess while you go after the dropped item. If you just can’t stand the notion of getting your hands dirty, certain objects, like jewelry or house keys, may be retrievable using a coat hanger that’s been bent into a hook."
        },
        {
          "headline":"Be quick about it.",
          "description":"Whether you’re wearing protective gloves or not, try to minimize the amount of time your hand spends in the toilet. In one quick motion, reach into the bowl, grab the item and pull it out, letting excess water drip into the bowl. Toilets are breeding grounds for all sorts of bacteria and viruses, so the less you’re able to expose yourself, the better. Take a firm grip on the object so that you don’t drop it. If it slides further down the drain opening, you might never get it back."
        },
        {
          "headline":"Rinse non-electronic items under hot water.",
          "description":"Assuming the thing you dropped wasn’t your smartphone or the remote control, you’ll want to rinse off as much of the water from the toilet as you can. Turn the sink on as hot as it will go. If soap is available, lather the item up to start superficially cleaning it right away. Run the item under the hot water, turning it over so that the stream bathes every part of it. Electronics and objects that are easily damaged by water should be dealt with by other means. A strong antibacterial soap and hot water may be all you need to disinfect items that have fallen into a clean toilet, but you may still feel better employing other methods."
        },
        {
          "headline":"Wash your hands thoroughly.",
          "description":"Before deep-cleaning the object, take a few minutes to wash your hands with soap and warm water. After all, they’ve just been inside the potty. If you were lucky enough to have latex gloves or dish gloves nearby, peel them off and throw them in the garbage before washing up. Be sure to scrub between your fingers and beneath your fingernails, where bacteria is good at hiding. It’s probably also a good idea to wipe down anything that the toilet water or salvaged item has touched with a disinfectant."
        }
      ]
    },
    {
      "name":"Cleaning With Disinfectant Products",
      "steps":[
        {
          "headline":"Use a disinfectant spray or wipe.",
          "description":"Buy a potent chemical disinfectant to kill whatever bacteria might be clinging to the dirty item. If the item has a smooth, solid surface, scrub it down with a disinfectant wipe. If the item is porous or has a lot of irregular angles or protrusions, spritz it with a cleaning spray to ensure that the disinfectant is distributed over its entire surface area. Products like Lysol Disinfectant Foam Cleaner, Clorox Disinfecting Bathroom Spray and Scrubbing Bubbles Super Concentrated Bathroom Cleaner can be found in most stores and will get the job done without the risk of any damage to your belongings. Disinfecting wipes can be used to clean anything from toys to jewelry to sunglasses. Sprays will do a better job of cleaning things like hair brushes and non-machine-washable clothing items. Try to find a disinfectant that doesn’t use bleach as an active ingredient. Bleach can discolor and even eat through some materials."
        },
        {
          "headline":"Clean all exposed parts of the item.",
          "description":"While applying the disinfectant, make sure that you’re covering as much of the retrieved item as you can. Bacteria can linger in hard-to-access nooks and grooves, and if not eliminated entirely could continue to reproduce and possibly make you sick. Don’t take any chances. Go over the item as many times as you need to to make sure it’s been properly sanitized. Stay away from electronics with wet sprays and soggy wipes. These items are best restored using a small amount of rubbing alcohol. The fumes from disinfectant cleaners can be overpowering. Always handle them in an open, well-ventilated area. Point the nozzle or hold the wipe away from your face as you work."
        },
        {
          "headline":"Let the item sit before drying.",
          "description":"Don’t rinse or towel off the item right away after you’ve treated it with disinfectant. Instead, set it aside and allow it to sit for a few minutes. The disinfectant will continue working on the bacteria resting on the surface. Afterwards, wipe the item down with a dry towel, being sure to remove all traces of the disinfectant chemicals. Rinse and dry the item once more after applying a disinfectant to make sure that it’s completely clean."
        }
      ]
    },
    {
      "name":"Sanitizing Sensitive Items With Rubbing Alcohol",
      "steps":[
        {
          "headline":"Grab a bottle of rubbing alcohol and some cotton balls.",
          "description":"Run down to your local pharmacy or supermarket and pick up a bottle of isopropyl alcohol and a package of cotton balls. Isopropyl alcohol, also known as a rubbing alcohol, is a great way to sterilize objects like cell phones, remote controls and other electronics that you can’t afford to get wet (or wetter). Choose an alcohol with a 70% concentration that is free of additives or fragrances. A small bottle of rubbing alcohol only costs a few dollars, but is useful for innumerable cleaning tasks."
        },
        {
          "headline":"Saturate a cotton ball with alcohol.",
          "description":"Remove the cap from the bottle of rubbing alcohol. Take a cotton ball and dip it into the alcohol, letting it soak into the fibers throughout. Shake the cotton ball a couple times to remove excess alcohol, then press it firmly against a clean cloth or the palm of your hand. You don’t want the cotton ball to be too wet, or alcohol could leak out and find its way into the sensitive openings of a phone, watch or pair of earbuds. This method of sterilization has long been used in medicine and is proven to be effective."
        },
        {
          "headline":"Wipe down the dropped item.",
          "description":"Use the alcohol-soaked cotton ball to swab whatever it was that was claimed by the latrine. Disinfecting with a damp cotton ball makes it possible to eradicate bacteria from the outer surface of the item without the risk of exposing delicate parts to any more unnecessary moisture. After you’re finished, pat the item with a clean towel to wick up any standing alcohol residue and let it air dry. Rubbing alcohol evaporates very quickly and doesn’t form a residue."
        }
      ]
    },
    {
      "name":"Boiling Sturdy Items",
      "steps":[
        {
          "headline":"Fill a large pot with water and bring it to a boil.",
          "description":"Run some water into a spacious pot or saucepan (depending on the size of the item you’re trying to sanitize). Place the pot over medium-high heat until the surface of the water just begins to bubble. The heat from the boiling water will instantly destroy microbial bugs on durable, hard-to-clean items. Boiling is a good way to thoroughly disinfect solid, one-piece objects that aren’t easily broken, such as toothbrushes, combs, drinking containers and just about anything made out of plastic or glass."
        },
        {
          "headline":"Submerge the infected item.",
          "description":"Using a pair of tongs or a strainer, lower the tainted object into the boiling water. The item will need to stay immersed for 1-20 minutes, depending on the size and material—any longer and it may be in danger of being warped by the heat. Whisk the item through the water to flush away bacteria concentrated on the surface. Make sure you have a way of protecting your hands from the heat. Consider taking the precaution of wearing a pair of dish gloves or oven mitts, even if you’re using tongs. Leaving plastic and fragile metal items submerged in boiling water for too long could cause them to melt."
        },
        {
          "headline":"Set the item aside to dry.",
          "description":"Pull the infected item out of the pot and give it a shake to remove excess water. Wrap the item in a clean, dry towel, then leave it out to air dry. Once the remaining moisture has evaporated, it should be as good as new. If the item has a lid or cover, leave it off to allow airflow and prevent mildew from forming inside."
        }
      ]
    }
  ],
  "text":" Retrieving and Rinsing the Lost Item Grab a pair of rubber gloves. If you’re lucky enough to drop something into a toilet in your own home, be prepared and have some rubber gloves on hand. Pulling these on before you stick your hand into germ-filled toilet water will make the task a lot more bearable. If you’re out somewhere and don’t have the benefit of gloves, you’ll have to decide whether it’s worth taking the plunge. Don’t flush anything that’s too big to fit through the pipes of the toilet. Then you’ll just have an additional mess to deal with. Assuming gloves are not an option, think on your feet and use some other object, such as a wad of paper towels or a plastic bag turned inside out, to protect your hand from the worst of the mess while you go after the dropped item. If you just can’t stand the notion of getting your hands dirty, certain objects, like jewelry or house keys, may be retrievable using a coat hanger that’s been bent into a hook. Be quick about it. Whether you’re wearing protective gloves or not, try to minimize the amount of time your hand spends in the toilet. In one quick motion, reach into the bowl, grab the item and pull it out, letting excess water drip into the bowl. Toilets are breeding grounds for all sorts of bacteria and viruses, so the less you’re able to expose yourself, the better. Take a firm grip on the object so that you don’t drop it. If it slides further down the drain opening, you might never get it back. Rinse non-electronic items under hot water. Assuming the thing you dropped wasn’t your smartphone or the remote control, you’ll want to rinse off as much of the water from the toilet as you can. Turn the sink on as hot as it will go. If soap is available, lather the item up to start superficially cleaning it right away. Run the item under the hot water, turning it over so that the stream bathes every part of it. Electronics and objects that are easily damaged by water should be dealt with by other means. A strong antibacterial soap and hot water may be all you need to disinfect items that have fallen into a clean toilet, but you may still feel better employing other methods. Wash your hands thoroughly. Before deep-cleaning the object, take a few minutes to wash your hands with soap and warm water. After all, they’ve just been inside the potty. If you were lucky enough to have latex gloves or dish gloves nearby, peel them off and throw them in the garbage before washing up. Be sure to scrub between your fingers and beneath your fingernails, where bacteria is good at hiding. It’s probably also a good idea to wipe down anything that the toilet water or salvaged item has touched with a disinfectant. Cleaning With Disinfectant Products Use a disinfectant spray or wipe. Buy a potent chemical disinfectant to kill whatever bacteria might be clinging to the dirty item. If the item has a smooth, solid surface, scrub it down with a disinfectant wipe. If the item is porous or has a lot of irregular angles or protrusions, spritz it with a cleaning spray to ensure that the disinfectant is distributed over its entire surface area. Products like Lysol Disinfectant Foam Cleaner, Clorox Disinfecting Bathroom Spray and Scrubbing Bubbles Super Concentrated Bathroom Cleaner can be found in most stores and will get the job done without the risk of any damage to your belongings. Disinfecting wipes can be used to clean anything from toys to jewelry to sunglasses. Sprays will do a better job of cleaning things like hair brushes and non-machine-washable clothing items. Try to find a disinfectant that doesn’t use bleach as an active ingredient. Bleach can discolor and even eat through some materials. Clean all exposed parts of the item. While applying the disinfectant, make sure that you’re covering as much of the retrieved item as you can. Bacteria can linger in hard-to-access nooks and grooves, and if not eliminated entirely could continue to reproduce and possibly make you sick. Don’t take any chances. Go over the item as many times as you need to to make sure it’s been properly sanitized. Stay away from electronics with wet sprays and soggy wipes. These items are best restored using a small amount of rubbing alcohol. The fumes from disinfectant cleaners can be overpowering. Always handle them in an open, well-ventilated area. Point the nozzle or hold the wipe away from your face as you work. Let the item sit before drying. Don’t rinse or towel off the item right away after you’ve treated it with disinfectant. Instead, set it aside and allow it to sit for a few minutes. The disinfectant will continue working on the bacteria resting on the surface. Afterwards, wipe the item down with a dry towel, being sure to remove all traces of the disinfectant chemicals. Rinse and dry the item once more after applying a disinfectant to make sure that it’s completely clean. Sanitizing Sensitive Items With Rubbing Alcohol Grab a bottle of rubbing alcohol and some cotton balls. Run down to your local pharmacy or supermarket and pick up a bottle of isopropyl alcohol and a package of cotton balls. Isopropyl alcohol, also known as a rubbing alcohol, is a great way to sterilize objects like cell phones, remote controls and other electronics that you can’t afford to get wet (or wetter). Choose an alcohol with a 70% concentration that is free of additives or fragrances. A small bottle of rubbing alcohol only costs a few dollars, but is useful for innumerable cleaning tasks. Saturate a cotton ball with alcohol. Remove the cap from the bottle of rubbing alcohol. Take a cotton ball and dip it into the alcohol, letting it soak into the fibers throughout. Shake the cotton ball a couple times to remove excess alcohol, then press it firmly against a clean cloth or the palm of your hand. You don’t want the cotton ball to be too wet, or alcohol could leak out and find its way into the sensitive openings of a phone, watch or pair of earbuds. This method of sterilization has long been used in medicine and is proven to be effective. Wipe down the dropped item. Use the alcohol-soaked cotton ball to swab whatever it was that was claimed by the latrine. Disinfecting with a damp cotton ball makes it possible to eradicate bacteria from the outer surface of the item without the risk of exposing delicate parts to any more unnecessary moisture. After you’re finished, pat the item with a clean towel to wick up any standing alcohol residue and let it air dry. Rubbing alcohol evaporates very quickly and doesn’t form a residue. Boiling Sturdy Items Fill a large pot with water and bring it to a boil. Run some water into a spacious pot or saucepan (depending on the size of the item you’re trying to sanitize). Place the pot over medium-high heat until the surface of the water just begins to bubble. The heat from the boiling water will instantly destroy microbial bugs on durable, hard-to-clean items. Boiling is a good way to thoroughly disinfect solid, one-piece objects that aren’t easily broken, such as toothbrushes, combs, drinking containers and just about anything made out of plastic or glass. Submerge the infected item. Using a pair of tongs or a strainer, lower the tainted object into the boiling water. The item will need to stay immersed for 1-20 minutes, depending on the size and material—any longer and it may be in danger of being warped by the heat. Whisk the item through the water to flush away bacteria concentrated on the surface. Make sure you have a way of protecting your hands from the heat. Consider taking the precaution of wearing a pair of dish gloves or oven mitts, even if you’re using tongs. Leaving plastic and fragile metal items submerged in boiling water for too long could cause them to melt. Set the item aside to dry. Pull the infected item out of the pot and give it a shake to remove excess water. Wrap the item in a clean, dry towel, then leave it out to air dry. Once the remaining moisture has evaporated, it should be as good as new. If the item has a lid or cover, leave it off to allow airflow and prevent mildew from forming inside.",
  "sentences":[
    " Retrieving and Rinsing the Lost Item Grab a pair of rubber gloves.",
    "If you’re lucky enough to drop something into a toilet in your own home, be prepared and have some rubber gloves on hand.",
    "Pulling these on before you stick your hand into germ-filled toilet water will make the task a lot more bearable.",
    "If you’re out somewhere and don’t have the benefit of gloves, you’ll have to decide whether it’s worth taking the plunge.",
    "Don’t flush anything that’s too big to fit through the pipes of the toilet.",
    "Then you’ll just have an additional mess to deal with.",
    "Assuming gloves are not an option, think on your feet and use some other object, such as a wad of paper towels or a plastic bag turned inside out, to protect your hand from the worst of the mess while you go after the dropped item.",
    "If you just can’t stand the notion of getting your hands dirty, certain objects, like jewelry or house keys, may be retrievable using a coat hanger that’s been bent into a hook.",
    "Be quick about it.",
    "Whether you’re wearing protective gloves or not, try to minimize the amount of time your hand spends in the toilet.",
    "In one quick motion, reach into the bowl, grab the item and pull it out, letting excess water drip into the bowl.",
    "Toilets are breeding grounds for all sorts of bacteria and viruses, so the less you’re able to expose yourself, the better.",
    "Take a firm grip on the object so that you don’t drop it.",
    "If it slides further down the drain opening, you might never get it back.",
    "Rinse non-electronic items under hot water.",
    "Assuming the thing you dropped wasn’t your smartphone or the remote control, you’ll want to rinse off as much of the water from the toilet as you can.",
    "Turn the sink on as hot as it will go.",
    "If soap is available, lather the item up to start superficially cleaning it right away.",
    "Run the item under the hot water, turning it over so that the stream bathes every part of it.",
    "Electronics and objects that are easily damaged by water should be dealt with by other means.",
    "A strong antibacterial soap and hot water may be all you need to disinfect items that have fallen into a clean toilet, but you may still feel better employing other methods.",
    "Wash your hands thoroughly.",
    "Before deep-cleaning the object, take a few minutes to wash your hands with soap and warm water.",
    "After all, they’ve just been inside the potty.",
    "If you were lucky enough to have latex gloves or dish gloves nearby, peel them off and throw them in the garbage before washing up.",
    "Be sure to scrub between your fingers and beneath your fingernails, where bacteria is good at hiding.",
    "It’s probably also a good idea to wipe down anything that the toilet water or salvaged item has touched with a disinfectant.",
    "Cleaning With Disinfectant Products Use a disinfectant spray or wipe.",
    "Buy a potent chemical disinfectant to kill whatever bacteria might be clinging to the dirty item.",
    "If the item has a smooth, solid surface, scrub it down with a disinfectant wipe.",
    "If the item is porous or has a lot of irregular angles or protrusions, spritz it with a cleaning spray to ensure that the disinfectant is distributed over its entire surface area.",
    "Products like Lysol Disinfectant Foam Cleaner, Clorox Disinfecting Bathroom Spray and Scrubbing Bubbles Super Concentrated Bathroom Cleaner can be found in most stores and will get the job done without the risk of any damage to your belongings.",
    "Disinfecting wipes can be used to clean anything from toys to jewelry to sunglasses.",
    "Sprays will do a better job of cleaning things like hair brushes and non-machine-washable clothing items.",
    "Try to find a disinfectant that doesn’t use bleach as an active ingredient.",
    "Bleach can discolor and even eat through some materials.",
    "Clean all exposed parts of the item.",
    "While applying the disinfectant, make sure that you’re covering as much of the retrieved item as you can.",
    "Bacteria can linger in hard-to-access nooks and grooves, and if not eliminated entirely could continue to reproduce and possibly make you sick.",
    "Don’t take any chances.",
    "Go over the item as many times as you need to to make sure it’s been properly sanitized.",
    "Stay away from electronics with wet sprays and soggy wipes.",
    "These items are best restored using a small amount of rubbing alcohol.",
    "The fumes from disinfectant cleaners can be overpowering.",
    "Always handle them in an open, well-ventilated area.",
    "Point the nozzle or hold the wipe away from your face as you work.",
    "Let the item sit before drying.",
    "Don’t rinse or towel off the item right away after you’ve treated it with disinfectant.",
    "Instead, set it aside and allow it to sit for a few minutes.",
    "The disinfectant will continue working on the bacteria resting on the surface.",
    "Afterwards, wipe the item down with a dry towel, being sure to remove all traces of the disinfectant chemicals.",
    "Rinse and dry the item once more after applying a disinfectant to make sure that it’s completely clean.",
    "Sanitizing Sensitive Items With Rubbing Alcohol Grab a bottle of rubbing alcohol and some cotton balls.",
    "Run down to your local pharmacy or supermarket and pick up a bottle of isopropyl alcohol and a package of cotton balls.",
    "Isopropyl alcohol, also known as a rubbing alcohol, is a great way to sterilize objects like cell phones, remote controls and other electronics that you can’t afford to get wet (or wetter).",
    "Choose an alcohol with a 70% concentration that is free of additives or fragrances.",
    "A small bottle of rubbing alcohol only costs a few dollars, but is useful for innumerable cleaning tasks.",
    "Saturate a cotton ball with alcohol.",
    "Remove the cap from the bottle of rubbing alcohol.",
    "Take a cotton ball and dip it into the alcohol, letting it soak into the fibers throughout.",
    "Shake the cotton ball a couple times to remove excess alcohol, then press it firmly against a clean cloth or the palm of your hand.",
    "You don’t want the cotton ball to be too wet, or alcohol could leak out and find its way into the sensitive openings of a phone, watch or pair of earbuds.",
    "This method of sterilization has long been used in medicine and is proven to be effective.",
    "Wipe down the dropped item.",
    "Use the alcohol-soaked cotton ball to swab whatever it was that was claimed by the latrine.",
    "Disinfecting with a damp cotton ball makes it possible to eradicate bacteria from the outer surface of the item without the risk of exposing delicate parts to any more unnecessary moisture.",
    "After you’re finished, pat the item with a clean towel to wick up any standing alcohol residue and let it air dry.",
    "Rubbing alcohol evaporates very quickly and doesn’t form a residue.",
    "Boiling Sturdy Items Fill a large pot with water and bring it to a boil.",
    "Run some water into a spacious pot or saucepan (depending on the size of the item you’re trying to sanitize).",
    "Place the pot over medium-high heat until the surface of the water just begins to bubble.",
    "The heat from the boiling water will instantly destroy microbial bugs on durable, hard-to-clean items.",
    "Boiling is a good way to thoroughly disinfect solid, one-piece objects that aren’t easily broken, such as toothbrushes, combs, drinking containers and just about anything made out of plastic or glass.",
    "Submerge the infected item.",
    "Using a pair of tongs or a strainer, lower the tainted object into the boiling water.",
    "The item will need to stay immersed for 1-20 minutes, depending on the size and material—any longer and it may be in danger of being warped by the heat.",
    "Whisk the item through the water to flush away bacteria concentrated on the surface.",
    "Make sure you have a way of protecting your hands from the heat.",
    "Consider taking the precaution of wearing a pair of dish gloves or oven mitts, even if you’re using tongs.",
    "Leaving plastic and fragile metal items submerged in boiling water for too long could cause them to melt.",
    "Set the item aside to dry.",
    "Pull the infected item out of the pot and give it a shake to remove excess water.",
    "Wrap the item in a clean, dry towel, then leave it out to air dry.",
    "Once the remaining moisture has evaporated, it should be as good as new.",
    "If the item has a lid or cover, leave it off to allow airflow and prevent mildew from forming inside."
  ],
  "tyn_section":[
    "Rubber gloves",
    "Water for rinsing",
    "Antibacterial soap",
    "Disinfecting spray or wipes",
    "Rubbing alcohol",
    "Cotton balls",
    "Boiling water",
    "Tongs or strainer",
    "Dry towels"
  ],
  "tyn_model":[
    "water",
    "rubbing alcohol",
    "alcohol",
    "toilet",
    "disinfectant",
    "cotton ball",
    "rubber gloves",
    "toilet water",
    "gloves",
    "bowl",
    "soap",
    "bleach",
    "cotton balls",
    "isopropyl alcohol",
    "pot",
    "coat hanger",
    "protective gloves",
    "toilets",
    "sink",
    "hot water",
    "disinfectant spray",
    "chemical disinfectant",
    "disinfectant wipe",
    "lysol disinfectant foam cleaner",
    "clorox disinfecting bathroom spray",
    "scrubbing bubbles super concentrated bathroom cleaner",
    "disinfecting wipes",
    "disinfectant cleaners",
    "towel",
    "latrine",
    "large pot",
    "saucepan",
    "strainer",
    "—any",
    "dish gloves"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0857142857,
    "f1":0.1363636364,
    "avg_pos":0.1714285714
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.2285714286,
    "f1":0.3404255319
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.4571428571,
    "f1":0.6037735849
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0857142857,
    "f1":0.1363636364
  }
}