{
  "title":"How to Start a Toy Hospital",
  "url":"https://www.wikihow.com/Start-a-Toy-Hospital",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Care and Repair of Toys"
  ],
  "steps":[
    {
      "headline":"Choose where you're going to have your hospital.",
      "description":"Maybe the living room, or the playroom? Or maybe you would want it in the privacy of your own bedroom? The choice is yours."
    },
    {
      "headline":"Organise the hospital.",
      "description":"Place the boxes in a neat row on the floor. Be careful where you put them, as you don't want people tripping over them. Then, fill the wash basin with warm water, and put it on a table. Lay some tea towels beside it."
    },
    {
      "headline":"Now it's time for your patients to come in.",
      "description":"Put the patients in the boxes. This will be their hospital beds. Put some bedding in the boxes to make sure your patients are comfy. Don't put one toy each in one bed, it'll take up more space."
    },
    {
      "headline":"Pick your first patient.",
      "description":"Try to choose the one who looks the worst. If one doesn't look too bad and can wait a while, don't pick him/her."
    },
    {
      "headline":"Wash the patient first.",
      "description":"Put the toy into the basin and gently scrub him/her with a soft sponge. If it's a teddy your washing, take out the stuffing first."
    },
    {
      "headline":"Dry your patient with the tea towels.",
      "description":"If it's a doll you're drying, brush her hair first, The knots come out easier when her hair is wet. But if it's a teddy, wrap him/her up in a tea towel and place him/her on the floor. Then, gently stand on him/her. He/she won't mind."
    },
    {
      "headline":"Give your toy a hospital bracelet.",
      "description":"You can do this by shredding a line out of a piece of paper, writing his/her name on it, and tying it to his/hers wrist or ankle. Your toy doesn't have a name? Go to \"How to Name a Teddy Bear\" or \"How to Name a Stuffed Animal or Toy\". Both of them are on wikiHow! (Laminate it to give the bracelet that shiny hospital look)."
    },
    {
      "headline":"Inspect your patient.",
      "description":"What is wrong with him/her? Is it something obvious, or something horribly wrong but you just can't put your finger on it? Here are some simple cures for some common toys:\nBarbies, BabyBorns, and other plastic dolls: Missing arms and legs are common among plastic dolls. Look EVERYWHERE for the missing piece -you never know where it might pop up. Sadly, if you can't find the missing piece, this symptom cannot be cured. Teddies, Bears, and other stuffed animals: Saggy teddies are common but easy to be dealt with. Simply take out the stuffing, and replace it with new stuffing. For missing eyes, sew new ones on. Buttons look a bit creepy, so if your teddy isn't goth or emo, don't use them. Zhu zhu pets, Furby, RC, and other robot toys: Are you completely sure that your toy is broken? It might just need a change of battery. WARNING: NEVER WASH YOUR ROBOT TOY."
    },
    {
      "headline":"Show people you mean business.",
      "description":"Get a notebook and pen and write down the hospital records of every patient, what was wrong with them, and how you cured them. And if you like, you could get a friend to help you run the hospital. Sort of an assistance nurse, but you don't have to."
    },
    {
      "headline":"That's all, so good luck, and good luck being a doctor!",
      "description":""
    }
  ],
  "text":" Choose where you're going to have your hospital. Maybe the living room, or the playroom? Or maybe you would want it in the privacy of your own bedroom? The choice is yours. Organise the hospital. Place the boxes in a neat row on the floor. Be careful where you put them, as you don't want people tripping over them. Then, fill the wash basin with warm water, and put it on a table. Lay some tea towels beside it. Now it's time for your patients to come in. Put the patients in the boxes. This will be their hospital beds. Put some bedding in the boxes to make sure your patients are comfy. Don't put one toy each in one bed, it'll take up more space. Pick your first patient. Try to choose the one who looks the worst. If one doesn't look too bad and can wait a while, don't pick him/her. Wash the patient first. Put the toy into the basin and gently scrub him/her with a soft sponge. If it's a teddy your washing, take out the stuffing first. Dry your patient with the tea towels. If it's a doll you're drying, brush her hair first, The knots come out easier when her hair is wet. But if it's a teddy, wrap him/her up in a tea towel and place him/her on the floor. Then, gently stand on him/her. He/she won't mind. Give your toy a hospital bracelet. You can do this by shredding a line out of a piece of paper, writing his/her name on it, and tying it to his/hers wrist or ankle. Your toy doesn't have a name? Go to \"How to Name a Teddy Bear\" or \"How to Name a Stuffed Animal or Toy\". Both of them are on wikiHow! (Laminate it to give the bracelet that shiny hospital look). Inspect your patient. What is wrong with him/her? Is it something obvious, or something horribly wrong but you just can't put your finger on it? Here are some simple cures for some common toys:\nBarbies, BabyBorns, and other plastic dolls: Missing arms and legs are common among plastic dolls. Look EVERYWHERE for the missing piece -you never know where it might pop up. Sadly, if you can't find the missing piece, this symptom cannot be cured. Teddies, Bears, and other stuffed animals: Saggy teddies are common but easy to be dealt with. Simply take out the stuffing, and replace it with new stuffing. For missing eyes, sew new ones on. Buttons look a bit creepy, so if your teddy isn't goth or emo, don't use them. Zhu zhu pets, Furby, RC, and other robot toys: Are you completely sure that your toy is broken? It might just need a change of battery. WARNING: NEVER WASH YOUR ROBOT TOY. Show people you mean business. Get a notebook and pen and write down the hospital records of every patient, what was wrong with them, and how you cured them. And if you like, you could get a friend to help you run the hospital. Sort of an assistance nurse, but you don't have to. That's all, so good luck, and good luck being a doctor! ",
  "sentences":[
    " Choose where you're going to have your hospital.",
    "Maybe the living room, or the playroom?",
    "Or maybe you would want it in the privacy of your own bedroom?",
    "The choice is yours.",
    "Organise the hospital.",
    "Place the boxes in a neat row on the floor.",
    "Be careful where you put them, as you don't want people tripping over them.",
    "Then, fill the wash basin with warm water, and put it on a table.",
    "Lay some tea towels beside it.",
    "Now it's time for your patients to come in.",
    "Put the patients in the boxes.",
    "This will be their hospital beds.",
    "Put some bedding in the boxes to make sure your patients are comfy.",
    "Don't put one toy each in one bed, it'll take up more space.",
    "Pick your first patient.",
    "Try to choose the one who looks the worst.",
    "If one doesn't look too bad and can wait a while, don't pick him/her.",
    "Wash the patient first.",
    "Put the toy into the basin and gently scrub him/her with a soft sponge.",
    "If it's a teddy your washing, take out the stuffing first.",
    "Dry your patient with the tea towels.",
    "If it's a doll you're drying, brush her hair first, The knots come out easier when her hair is wet.",
    "But if it's a teddy, wrap him/her up in a tea towel and place him/her on the floor.",
    "Then, gently stand on him/her.",
    "He/she won't mind.",
    "Give your toy a hospital bracelet.",
    "You can do this by shredding a line out of a piece of paper, writing his/her name on it, and tying it to his/hers wrist or ankle.",
    "Your toy doesn't have a name?",
    "Go to \"How to Name a Teddy Bear\" or \"How to Name a Stuffed Animal or Toy\".",
    "Both of them are on wikiHow!",
    "(Laminate it to give the bracelet that shiny hospital look).",
    "Inspect your patient.",
    "What is wrong with him/her?",
    "Is it something obvious, or something horribly wrong but you just can't put your finger on it?",
    "Here are some simple cures for some common toys:\nBarbies, BabyBorns, and other plastic dolls: Missing arms and legs are common among plastic dolls.",
    "Look EVERYWHERE for the missing piece -you never know where it might pop up.",
    "Sadly, if you can't find the missing piece, this symptom cannot be cured.",
    "Teddies, Bears, and other stuffed animals: Saggy teddies are common but easy to be dealt with.",
    "Simply take out the stuffing, and replace it with new stuffing.",
    "For missing eyes, sew new ones on.",
    "Buttons look a bit creepy, so if your teddy isn't goth or emo, don't use them.",
    "Zhu zhu pets, Furby, RC, and other robot toys: Are you completely sure that your toy is broken?",
    "It might just need a change of battery.",
    "WARNING: NEVER WASH YOUR ROBOT TOY.",
    "Show people you mean business.",
    "Get a notebook and pen and write down the hospital records of every patient, what was wrong with them, and how you cured them.",
    "And if you like, you could get a friend to help you run the hospital.",
    "Sort of an assistance nurse, but you don't have to.",
    "That's all, so good luck, and good luck being a doctor!"
  ],
  "tyn_section":[
    "Some boxes.",
    "A small wash basin.",
    "Some old toys.",
    "Bandages (But kitchen or toilet paper works fine.)",
    "Some tea towels.",
    "A notebook and pen",
    "Friends (optional.)",
    "Bedding (Blankets, Cushions, Anything soft.)"
  ],
  "tyn_model":[
    "tea towels",
    "stuffing",
    "wash basin",
    "water",
    "basin",
    "soft sponge",
    "tea towel",
    "barbies",
    "robot toy",
    "notebook",
    "pen",
    "doctor"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}