{
  "title":"How to Install Peel and Stick Vinyl Plank Flooring",
  "url":"https://www.wikihow.com/Install-Peel-and-Stick-Vinyl-Plank-Flooring",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Floor Types"
  ],
  "parts":[
    {
      "name":"Leveling and Cleaning the Subfloor",
      "steps":[
        {
          "headline":"Remove any baseboards or trim pieces around the perimeter of your room.",
          "description":"Locate the nails along your baseboards that are holding them in place and position the angled side of a pry bar on the baseboard above one of them. Lift the other end of the pry bar so it forces the board away from the wall and pulls the nail out. Work down the entire length of the baseboard and prying out each nail individually so the pieces don’t break. You may also have to remove your floor vents if you have any in the room.Tip: Label the back of each baseboard with a letter or number so you know where to put it back when it’s time to reinstall them."
        },
        {
          "headline":"Remove the old flooring to access the subfloor.",
          "description":"The way you remove the old flooring depends on what you currently have in your room. If you have carpet, use your pry bar to lift the edges of the carpeting and pad so you can easily remove it. If you’re taking out tiles, chisel out the old tiles and scrape off adhesives stuck on your subfloor. To remove linoleum or existing vinyl, slide the end of a vinyl floor scraper under the seams to lift up the pieces. You can install vinyl planks over other types of hard flooring, like existing vinyl, linoleum, or tiles, if it’s completely level and flush. However, you need to remove the existing flooring if you want a fresh start."
        },
        {
          "headline":"Install ⁄4 in (0.64 cm) luan plywood over a wood subfloor.",
          "description":"Luan plywood has a smooth surface and makes it easier to lay your planks on top. Get enough ⁄4 in (0.64 cm) luan to cover the entire floor in your room and apply a thin layer of flooring adhesive on the back side. Press the luan plywood onto your floor, and staple or nail the board down every 6–8 inches (15–20 cm) so it stays in place. The existing plywood for your subfloor may have various dents or wear that will show through your planks when you install them. Make sure the nails or staples you use to secure the luan is flush or lower than the surface of the plywood so they don’t form any bumps."
        },
        {
          "headline":"Put a leveling compound on a low concrete or ceramic floor.",
          "description":"Stir the leveling compound and then scoop some into a low spot on your floor with a flat trowel. Spread the compound out around the area with the edges of your trowel so it’s flat on the ground. Let the compound dry for 24 hours before checking the area with a level to see if you fixed it. You can buy leveling compound from your local hardware or home improvement store. You may apply the leveling compound just in the low areas or you can apply it to the entire subfloor to ensure it’s level. Contact professional flooring specialists if you notice large cracks or damage since there may be deeper problems causing them."
        },
        {
          "headline":"Sand or grind any raised areas of the subfloor until it’s level.",
          "description":"Lay a level across your floor to see if it’s perfectly flat. If you notice raised areas on your plywood or luan, then use a belt sander or a sanding block with 80- to 120-grit sandpaper to get a smooth finish. If you’re working on a concrete subfloor, use a concrete grinder to smooth the area out. Check multiple times with your level while you’re working to see if you’ve removed enough material. Wear safety glasses while working with a sander or grinder so you don’t get any of the dust or debris in your eyes. You can usually buy or rent sanders and grinders from your local hardware store. Contact a few stores ahead of time to see if there are any available that you can use."
        },
        {
          "headline":"Sweep the subfloor to get rid of any dust.",
          "description":"Dust prevents the adhesive on your planks from sticking well to your subfloor or underlayment. After you’ve leveled your floor completely, use a broom to sweep away any dust or debris that you made. Go over the area 2-3 times with your broom or until you don’t see any more dust when you’re finished sweeping. Don’t keep any windows open in the room where you’re installing your vinyl since dust and particles could blow in and make the room dirty again."
        }
      ]
    },
    {
      "name":"Measuring and Planning the Layout",
      "steps":[
        {
          "headline":"Find the area of the room where you’re installing the vinyl flooring.",
          "description":"Start your tape measure in the corner of your room and extend it for the full length to the other corner. Then, find the width of your room from one of the side walls to the other. Multiply your length and width measurements together to find the total area of your room. For example, if the length of your room is 11 feet (3.4 m) and the width is 13 feet (4.0 m), then the total area is 143 square feet (13.3 m). If you have an oddly shaped room, try breaking it into multiple rectangular shapes. Find the areas of the individual rectangles and add them together to find the total area."
        },
        {
          "headline":"Measure the size of one of the vinyl planks.",
          "description":"Check the length and the width of one of the vinyl planks you plan on installing. Use your tape measure or a ruler to take your measurements. Multiply the length and the width together to find the area of a single plank. For example, if the length of your plank is 2 ⁄2 feet (0.76 m) and the width is ⁄2 foot (0.15 m), then the total area of each plank is 1 ⁄4 square feet (0.12 m). Vinyl planks usually have a width between 6–11 inches (15–28 cm)."
        },
        {
          "headline":"Divide the area of the room by the plank’s area to find out how many you need.",
          "description":"Take the area of the room and divide it by the area of a single plank. When you solve the equation, you’ll know how many planks can fit on your floor. Get 10% more planks than you need so you have extras to use if you make a mistake later on. For example, if the area of the room is 143 square feet (13.3 m) and the area of a plank is 1 ⁄4 square feet (0.12 m), then you would need 115 planks total for your floor. With 10% extra, you would need 126 planks.Variation: You can also use the width of the plank and the width of your room to find how many rows you’ll be able to fit. Divide the width of the room by the width of a single plank to find your answer. In this example, if the width of the room is 13 feet (4.0 m) and the plank is ⁄2 foot (0.15 m) wide, then you can fit 26 rows on your floor."
        },
        {
          "headline":"Snap chalk lines through the center of your room so it’s split into 4 equal sections.",
          "description":"Measure down the length of your room again until you reach the halfway point and make a mark. Stretch a chalk line across your room and snap it against your floor. Then, measure across the width of your room up to the halfway point and snap another chalk line on the mark. Your room will be divided into 4 quarters with the chalk lines intersecting in the center of your room. Starting in the center of your room makes the planks look more even and reduces the chance that you need to cut narrow strips of your planks later on."
        },
        {
          "headline":"Lay a row of planks on the longest chalk line to see how they fit.",
          "description":"Place one of your planks in one of the corners made by the intersection of your chalk lines. Line up the longest side of the plank with the longest chalk line to enhance the look of your room. Add more planks to the end of the first one, making sure the seams are tight against one another. Start making additional rows of planks to see how they fit in your room. You can snap chalk lines or trace around your planks if you want to know exactly where to place them later on, but it’s not required. If your planks have arrows on the back, make sure they all point the same direction when you install them or else the pattern won’t look consistent."
        }
      ]
    },
    {
      "name":"Laying the Flooring",
      "steps":[
        {
          "headline":"Peel the backing paper off of the first plank you’re laying.",
          "description":"Flip the first plank over so it’s face down and grab the corner of the backing paper. Slowly peel the paper off of the plank, being careful not to touch the adhesive. Once you remove the backing paper, throw it away so it isn’t in the way later on. Don’t take the backing paper off of a plank until you’re ready to install it since the adhesive could get covered in dust and not stick as well. If you have trouble peeling the corner of the backing paper, carefully separate the plank and paper with a razor blade or utility knife until you can get a good grip."
        },
        {
          "headline":"Press the plank into one of the corners made by the center lines.",
          "description":"Flip the plank over so the patterned side is face-up, and be careful not to touch the adhesive. Align the plank so it’s flush against one of the corners where the chalk lines intersect. Once you have it lined up, set it against the floor and rub it down with the side of your hand so it sticks in place. Press it down firmly so the edges and corners don’t lift up from the floor. You can also start your planks against one of your walls if you want, but you may have to cut your planks into narrow strips later on if they don’t fit and your room won’t look as balanced."
        },
        {
          "headline":"Line up the ends of the planks to complete a row.",
          "description":"After you place your first plank, take the backing paper off of the next one you want to place. Line up the short ends of the planks and ensure the long edges are flush with one another. Press the second plank into place with the side of your hand, and continue adding more planks to finish your row. Use the chalk line as a guide to ensure your first row is straight.Tip: Make sure the arrows on the backs of the planks all point in the same direction or else the pieces won’t fit together as well and the pattern may look inconsistent."
        },
        {
          "headline":"Cut planks with a utility knife if you need to adjust their size.",
          "description":"Measure the distance from the end of the last plank in your row to the wall. Set your vinyl plank face-up on a safe cutting surface and transfer your measurement onto it. Drag a sharp utility knife along the mark you made 3-4 times to score it. Grab the edge of the plank and pull it up to snap off the piece you need. Peel the backing paper off the plank piece you cut and install it on the end of the row so the cut edge is against the wall. Always line up the cut edge of the vinyl plank against your wall since your cut may not perfectly line up with the edges of the other planks. Peel and stick vinyl flooring doesn’t expand so you can place it directly against the wall without leaving a gap."
        },
        {
          "headline":"Stagger the rows of planks so the seams are offset by halves or thirds.",
          "description":"Don’t line up the seams on your floor when you start your second row since it can make your floor look unnatural and affect the pattern. Move the first plank of your second row so it’s ½ or ⅓ of its length offset from the end of one of the planks in your first row. With each additional row you add, offset the ends of each plank to hide the seams better. For example, if your planks are 3 feet (0.91 m) long, then place the end of the plank in your second row 1–1 ⁄2 feet (0.30–0.46 m) from the end of the first plank in your first row."
        },
        {
          "headline":"Flatten the planks with a floor roller so they firmly adhere to the subfloor.",
          "description":"After you install all of the planks in your room, rent a floor roller from your local hardware store or buy a handheld one to use. Press the roller onto the planks and walk it across the length of your room. The roller will force out any air bubbles under the vinyl and make it adhere better."
        }
      ]
    }
  ],
  "text":" Leveling and Cleaning the Subfloor Remove any baseboards or trim pieces around the perimeter of your room. Locate the nails along your baseboards that are holding them in place and position the angled side of a pry bar on the baseboard above one of them. Lift the other end of the pry bar so it forces the board away from the wall and pulls the nail out. Work down the entire length of the baseboard and prying out each nail individually so the pieces don’t break. You may also have to remove your floor vents if you have any in the room.Tip: Label the back of each baseboard with a letter or number so you know where to put it back when it’s time to reinstall them. Remove the old flooring to access the subfloor. The way you remove the old flooring depends on what you currently have in your room. If you have carpet, use your pry bar to lift the edges of the carpeting and pad so you can easily remove it. If you’re taking out tiles, chisel out the old tiles and scrape off adhesives stuck on your subfloor. To remove linoleum or existing vinyl, slide the end of a vinyl floor scraper under the seams to lift up the pieces. You can install vinyl planks over other types of hard flooring, like existing vinyl, linoleum, or tiles, if it’s completely level and flush. However, you need to remove the existing flooring if you want a fresh start. Install ⁄4 in (0.64 cm) luan plywood over a wood subfloor. Luan plywood has a smooth surface and makes it easier to lay your planks on top. Get enough ⁄4 in (0.64 cm) luan to cover the entire floor in your room and apply a thin layer of flooring adhesive on the back side. Press the luan plywood onto your floor, and staple or nail the board down every 6–8 inches (15–20 cm) so it stays in place. The existing plywood for your subfloor may have various dents or wear that will show through your planks when you install them. Make sure the nails or staples you use to secure the luan is flush or lower than the surface of the plywood so they don’t form any bumps. Put a leveling compound on a low concrete or ceramic floor. Stir the leveling compound and then scoop some into a low spot on your floor with a flat trowel. Spread the compound out around the area with the edges of your trowel so it’s flat on the ground. Let the compound dry for 24 hours before checking the area with a level to see if you fixed it. You can buy leveling compound from your local hardware or home improvement store. You may apply the leveling compound just in the low areas or you can apply it to the entire subfloor to ensure it’s level. Contact professional flooring specialists if you notice large cracks or damage since there may be deeper problems causing them. Sand or grind any raised areas of the subfloor until it’s level. Lay a level across your floor to see if it’s perfectly flat. If you notice raised areas on your plywood or luan, then use a belt sander or a sanding block with 80- to 120-grit sandpaper to get a smooth finish. If you’re working on a concrete subfloor, use a concrete grinder to smooth the area out. Check multiple times with your level while you’re working to see if you’ve removed enough material. Wear safety glasses while working with a sander or grinder so you don’t get any of the dust or debris in your eyes. You can usually buy or rent sanders and grinders from your local hardware store. Contact a few stores ahead of time to see if there are any available that you can use. Sweep the subfloor to get rid of any dust. Dust prevents the adhesive on your planks from sticking well to your subfloor or underlayment. After you’ve leveled your floor completely, use a broom to sweep away any dust or debris that you made. Go over the area 2-3 times with your broom or until you don’t see any more dust when you’re finished sweeping. Don’t keep any windows open in the room where you’re installing your vinyl since dust and particles could blow in and make the room dirty again. Measuring and Planning the Layout Find the area of the room where you’re installing the vinyl flooring. Start your tape measure in the corner of your room and extend it for the full length to the other corner. Then, find the width of your room from one of the side walls to the other. Multiply your length and width measurements together to find the total area of your room. For example, if the length of your room is 11 feet (3.4 m) and the width is 13 feet (4.0 m), then the total area is 143 square feet (13.3 m). If you have an oddly shaped room, try breaking it into multiple rectangular shapes. Find the areas of the individual rectangles and add them together to find the total area. Measure the size of one of the vinyl planks. Check the length and the width of one of the vinyl planks you plan on installing. Use your tape measure or a ruler to take your measurements. Multiply the length and the width together to find the area of a single plank. For example, if the length of your plank is 2 ⁄2 feet (0.76 m) and the width is ⁄2 foot (0.15 m), then the total area of each plank is 1 ⁄4 square feet (0.12 m). Vinyl planks usually have a width between 6–11 inches (15–28 cm). Divide the area of the room by the plank’s area to find out how many you need. Take the area of the room and divide it by the area of a single plank. When you solve the equation, you’ll know how many planks can fit on your floor. Get 10% more planks than you need so you have extras to use if you make a mistake later on. For example, if the area of the room is 143 square feet (13.3 m) and the area of a plank is 1 ⁄4 square feet (0.12 m), then you would need 115 planks total for your floor. With 10% extra, you would need 126 planks.Variation: You can also use the width of the plank and the width of your room to find how many rows you’ll be able to fit. Divide the width of the room by the width of a single plank to find your answer. In this example, if the width of the room is 13 feet (4.0 m) and the plank is ⁄2 foot (0.15 m) wide, then you can fit 26 rows on your floor. Snap chalk lines through the center of your room so it’s split into 4 equal sections. Measure down the length of your room again until you reach the halfway point and make a mark. Stretch a chalk line across your room and snap it against your floor. Then, measure across the width of your room up to the halfway point and snap another chalk line on the mark. Your room will be divided into 4 quarters with the chalk lines intersecting in the center of your room. Starting in the center of your room makes the planks look more even and reduces the chance that you need to cut narrow strips of your planks later on. Lay a row of planks on the longest chalk line to see how they fit. Place one of your planks in one of the corners made by the intersection of your chalk lines. Line up the longest side of the plank with the longest chalk line to enhance the look of your room. Add more planks to the end of the first one, making sure the seams are tight against one another. Start making additional rows of planks to see how they fit in your room. You can snap chalk lines or trace around your planks if you want to know exactly where to place them later on, but it’s not required. If your planks have arrows on the back, make sure they all point the same direction when you install them or else the pattern won’t look consistent. Laying the Flooring Peel the backing paper off of the first plank you’re laying. Flip the first plank over so it’s face down and grab the corner of the backing paper. Slowly peel the paper off of the plank, being careful not to touch the adhesive. Once you remove the backing paper, throw it away so it isn’t in the way later on. Don’t take the backing paper off of a plank until you’re ready to install it since the adhesive could get covered in dust and not stick as well. If you have trouble peeling the corner of the backing paper, carefully separate the plank and paper with a razor blade or utility knife until you can get a good grip. Press the plank into one of the corners made by the center lines. Flip the plank over so the patterned side is face-up, and be careful not to touch the adhesive. Align the plank so it’s flush against one of the corners where the chalk lines intersect. Once you have it lined up, set it against the floor and rub it down with the side of your hand so it sticks in place. Press it down firmly so the edges and corners don’t lift up from the floor. You can also start your planks against one of your walls if you want, but you may have to cut your planks into narrow strips later on if they don’t fit and your room won’t look as balanced. Line up the ends of the planks to complete a row. After you place your first plank, take the backing paper off of the next one you want to place. Line up the short ends of the planks and ensure the long edges are flush with one another. Press the second plank into place with the side of your hand, and continue adding more planks to finish your row. Use the chalk line as a guide to ensure your first row is straight.Tip: Make sure the arrows on the backs of the planks all point in the same direction or else the pieces won’t fit together as well and the pattern may look inconsistent. Cut planks with a utility knife if you need to adjust their size. Measure the distance from the end of the last plank in your row to the wall. Set your vinyl plank face-up on a safe cutting surface and transfer your measurement onto it. Drag a sharp utility knife along the mark you made 3-4 times to score it. Grab the edge of the plank and pull it up to snap off the piece you need. Peel the backing paper off the plank piece you cut and install it on the end of the row so the cut edge is against the wall. Always line up the cut edge of the vinyl plank against your wall since your cut may not perfectly line up with the edges of the other planks. Peel and stick vinyl flooring doesn’t expand so you can place it directly against the wall without leaving a gap. Stagger the rows of planks so the seams are offset by halves or thirds. Don’t line up the seams on your floor when you start your second row since it can make your floor look unnatural and affect the pattern. Move the first plank of your second row so it’s ½ or ⅓ of its length offset from the end of one of the planks in your first row. With each additional row you add, offset the ends of each plank to hide the seams better. For example, if your planks are 3 feet (0.91 m) long, then place the end of the plank in your second row 1–1 ⁄2 feet (0.30–0.46 m) from the end of the first plank in your first row. Flatten the planks with a floor roller so they firmly adhere to the subfloor. After you install all of the planks in your room, rent a floor roller from your local hardware store or buy a handheld one to use. Press the roller onto the planks and walk it across the length of your room. The roller will force out any air bubbles under the vinyl and make it adhere better.",
  "sentences":[
    " Leveling and Cleaning the Subfloor Remove any baseboards or trim pieces around the perimeter of your room.",
    "Locate the nails along your baseboards that are holding them in place and position the angled side of a pry bar on the baseboard above one of them.",
    "Lift the other end of the pry bar so it forces the board away from the wall and pulls the nail out.",
    "Work down the entire length of the baseboard and prying out each nail individually so the pieces don’t break.",
    "You may also have to remove your floor vents if you have any in the room.Tip: Label the back of each baseboard with a letter or number so you know where to put it back when it’s time to reinstall them.",
    "Remove the old flooring to access the subfloor.",
    "The way you remove the old flooring depends on what you currently have in your room.",
    "If you have carpet, use your pry bar to lift the edges of the carpeting and pad so you can easily remove it.",
    "If you’re taking out tiles, chisel out the old tiles and scrape off adhesives stuck on your subfloor.",
    "To remove linoleum or existing vinyl, slide the end of a vinyl floor scraper under the seams to lift up the pieces.",
    "You can install vinyl planks over other types of hard flooring, like existing vinyl, linoleum, or tiles, if it’s completely level and flush.",
    "However, you need to remove the existing flooring if you want a fresh start.",
    "Install ⁄4 in (0.64 cm) luan plywood over a wood subfloor.",
    "Luan plywood has a smooth surface and makes it easier to lay your planks on top.",
    "Get enough ⁄4 in (0.64 cm) luan to cover the entire floor in your room and apply a thin layer of flooring adhesive on the back side.",
    "Press the luan plywood onto your floor, and staple or nail the board down every 6–8 inches (15–20 cm) so it stays in place.",
    "The existing plywood for your subfloor may have various dents or wear that will show through your planks when you install them.",
    "Make sure the nails or staples you use to secure the luan is flush or lower than the surface of the plywood so they don’t form any bumps.",
    "Put a leveling compound on a low concrete or ceramic floor.",
    "Stir the leveling compound and then scoop some into a low spot on your floor with a flat trowel.",
    "Spread the compound out around the area with the edges of your trowel so it’s flat on the ground.",
    "Let the compound dry for 24 hours before checking the area with a level to see if you fixed it.",
    "You can buy leveling compound from your local hardware or home improvement store.",
    "You may apply the leveling compound just in the low areas or you can apply it to the entire subfloor to ensure it’s level.",
    "Contact professional flooring specialists if you notice large cracks or damage since there may be deeper problems causing them.",
    "Sand or grind any raised areas of the subfloor until it’s level.",
    "Lay a level across your floor to see if it’s perfectly flat.",
    "If you notice raised areas on your plywood or luan, then use a belt sander or a sanding block with 80- to 120-grit sandpaper to get a smooth finish.",
    "If you’re working on a concrete subfloor, use a concrete grinder to smooth the area out.",
    "Check multiple times with your level while you’re working to see if you’ve removed enough material.",
    "Wear safety glasses while working with a sander or grinder so you don’t get any of the dust or debris in your eyes.",
    "You can usually buy or rent sanders and grinders from your local hardware store.",
    "Contact a few stores ahead of time to see if there are any available that you can use.",
    "Sweep the subfloor to get rid of any dust.",
    "Dust prevents the adhesive on your planks from sticking well to your subfloor or underlayment.",
    "After you’ve leveled your floor completely, use a broom to sweep away any dust or debris that you made.",
    "Go over the area 2-3 times with your broom or until you don’t see any more dust when you’re finished sweeping.",
    "Don’t keep any windows open in the room where you’re installing your vinyl since dust and particles could blow in and make the room dirty again.",
    "Measuring and Planning the Layout Find the area of the room where you’re installing the vinyl flooring.",
    "Start your tape measure in the corner of your room and extend it for the full length to the other corner.",
    "Then, find the width of your room from one of the side walls to the other.",
    "Multiply your length and width measurements together to find the total area of your room.",
    "For example, if the length of your room is 11 feet (3.4 m) and the width is 13 feet (4.0 m), then the total area is 143 square feet (13.3 m).",
    "If you have an oddly shaped room, try breaking it into multiple rectangular shapes.",
    "Find the areas of the individual rectangles and add them together to find the total area.",
    "Measure the size of one of the vinyl planks.",
    "Check the length and the width of one of the vinyl planks you plan on installing.",
    "Use your tape measure or a ruler to take your measurements.",
    "Multiply the length and the width together to find the area of a single plank.",
    "For example, if the length of your plank is 2 ⁄2 feet (0.76 m) and the width is ⁄2 foot (0.15 m), then the total area of each plank is 1 ⁄4 square feet (0.12 m).",
    "Vinyl planks usually have a width between 6–11 inches (15–28 cm).",
    "Divide the area of the room by the plank’s area to find out how many you need.",
    "Take the area of the room and divide it by the area of a single plank.",
    "When you solve the equation, you’ll know how many planks can fit on your floor.",
    "Get 10% more planks than you need so you have extras to use if you make a mistake later on.",
    "For example, if the area of the room is 143 square feet (13.3 m) and the area of a plank is 1 ⁄4 square feet (0.12 m), then you would need 115 planks total for your floor.",
    "With 10% extra, you would need 126 planks.Variation: You can also use the width of the plank and the width of your room to find how many rows you’ll be able to fit.",
    "Divide the width of the room by the width of a single plank to find your answer.",
    "In this example, if the width of the room is 13 feet (4.0 m) and the plank is ⁄2 foot (0.15 m) wide, then you can fit 26 rows on your floor.",
    "Snap chalk lines through the center of your room so it’s split into 4 equal sections.",
    "Measure down the length of your room again until you reach the halfway point and make a mark.",
    "Stretch a chalk line across your room and snap it against your floor.",
    "Then, measure across the width of your room up to the halfway point and snap another chalk line on the mark.",
    "Your room will be divided into 4 quarters with the chalk lines intersecting in the center of your room.",
    "Starting in the center of your room makes the planks look more even and reduces the chance that you need to cut narrow strips of your planks later on.",
    "Lay a row of planks on the longest chalk line to see how they fit.",
    "Place one of your planks in one of the corners made by the intersection of your chalk lines.",
    "Line up the longest side of the plank with the longest chalk line to enhance the look of your room.",
    "Add more planks to the end of the first one, making sure the seams are tight against one another.",
    "Start making additional rows of planks to see how they fit in your room.",
    "You can snap chalk lines or trace around your planks if you want to know exactly where to place them later on, but it’s not required.",
    "If your planks have arrows on the back, make sure they all point the same direction when you install them or else the pattern won’t look consistent.",
    "Laying the Flooring Peel the backing paper off of the first plank you’re laying.",
    "Flip the first plank over so it’s face down and grab the corner of the backing paper.",
    "Slowly peel the paper off of the plank, being careful not to touch the adhesive.",
    "Once you remove the backing paper, throw it away so it isn’t in the way later on.",
    "Don’t take the backing paper off of a plank until you’re ready to install it since the adhesive could get covered in dust and not stick as well.",
    "If you have trouble peeling the corner of the backing paper, carefully separate the plank and paper with a razor blade or utility knife until you can get a good grip.",
    "Press the plank into one of the corners made by the center lines.",
    "Flip the plank over so the patterned side is face-up, and be careful not to touch the adhesive.",
    "Align the plank so it’s flush against one of the corners where the chalk lines intersect.",
    "Once you have it lined up, set it against the floor and rub it down with the side of your hand so it sticks in place.",
    "Press it down firmly so the edges and corners don’t lift up from the floor.",
    "You can also start your planks against one of your walls if you want, but you may have to cut your planks into narrow strips later on if they don’t fit and your room won’t look as balanced.",
    "Line up the ends of the planks to complete a row.",
    "After you place your first plank, take the backing paper off of the next one you want to place.",
    "Line up the short ends of the planks and ensure the long edges are flush with one another.",
    "Press the second plank into place with the side of your hand, and continue adding more planks to finish your row.",
    "Use the chalk line as a guide to ensure your first row is straight.Tip: Make sure the arrows on the backs of the planks all point in the same direction or else the pieces won’t fit together as well and the pattern may look inconsistent.",
    "Cut planks with a utility knife if you need to adjust their size.",
    "Measure the distance from the end of the last plank in your row to the wall.",
    "Set your vinyl plank face-up on a safe cutting surface and transfer your measurement onto it.",
    "Drag a sharp utility knife along the mark you made 3-4 times to score it.",
    "Grab the edge of the plank and pull it up to snap off the piece you need.",
    "Peel the backing paper off the plank piece you cut and install it on the end of the row so the cut edge is against the wall.",
    "Always line up the cut edge of the vinyl plank against your wall since your cut may not perfectly line up with the edges of the other planks.",
    "Peel and stick vinyl flooring doesn’t expand so you can place it directly against the wall without leaving a gap.",
    "Stagger the rows of planks so the seams are offset by halves or thirds.",
    "Don’t line up the seams on your floor when you start your second row since it can make your floor look unnatural and affect the pattern.",
    "Move the first plank of your second row so it’s ½ or ⅓ of its length offset from the end of one of the planks in your first row.",
    "With each additional row you add, offset the ends of each plank to hide the seams better.",
    "For example, if your planks are 3 feet (0.91 m) long, then place the end of the plank in your second row 1–1 ⁄2 feet (0.30–0.46 m) from the end of the first plank in your first row.",
    "Flatten the planks with a floor roller so they firmly adhere to the subfloor.",
    "After you install all of the planks in your room, rent a floor roller from your local hardware store or buy a handheld one to use.",
    "Press the roller onto the planks and walk it across the length of your room.",
    "The roller will force out any air bubbles under the vinyl and make it adhere better."
  ],
  "tyn_section":[
    "Hammer",
    "Pry bar",
    "1⁄4",
    "1",
    "⁄",
    "4",
    " in (0.64 cm) luan plywood",
    "Nail or staple gun",
    "Cement leveling compound",
    "Trowel",
    "Sanding block or belt sander",
    "Level",
    "Broom",
    "Measuring tape",
    "Chalk line",
    "Carpenter’s square",
    "Utility knife",
    "Floor roller"
  ],
  "tyn_model":[
    "plank",
    "chalk",
    "planks",
    "vinyl planks",
    "leveling compound",
    "backing paper",
    "tiles",
    "luan plywood",
    "plywood",
    "nails",
    "linoleum",
    "trowel",
    "level",
    "broom",
    "tape measure",
    "paper",
    "adhesive",
    "utility knife",
    "vinyl plank",
    "floor roller",
    "roller",
    "carpet",
    "adhesives",
    "flooring adhesive",
    "belt sander",
    "sanding block",
    "concrete grinder",
    "sander",
    "grinder",
    "sanders",
    "grinders",
    "ruler",
    "razor blade",
    "sharp utility knife",
    "⅓ of"
  ],
  "simple_metrics":{
    "r":0.2777777778,
    "p":0.1428571429,
    "f1":0.1886792453,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3888888889,
    "p":0.2571428571,
    "f1":0.3095823096
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.3714285714,
    "f1":0.4452054795
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.2,
    "f1":0.25
  }
}