{
  "title":"How to Make a Jack in the Box",
  "url":"https://www.wikihow.com/Make-a-Jack-in-the-Box",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Constructing the Box",
      "steps":[
        {
          "headline":"Find a sturdy piece of cardboard.",
          "description":"You'll need a thick and sturdy piece of cardboard for the box to support itself. The kind from a large packing box should work well. You'll be cutting out 6 squares that are each 6\" x 6\" (15 cm x 15 cm), so your piece of cardboard will need to be at least 18\" x 12\" (45 cm x 30). If you can't find a piece that big, then several pieces will work fine too."
        },
        {
          "headline":"Draw six 6\" X 6\" (15 cm x 15 cm) boxes on the piece of cardboard.",
          "description":"These six squares will form the walls, floor, and lid of your Jack in the Box. Use a ruler to measure and make sure your lines are straight. Make sure you use a dark pen or marker. Otherwise, you may not be able to see your lines when you cut."
        },
        {
          "headline":"Cut out each box.",
          "description":"Use a pair of sharp scissors or a box cutter. Carefully cut along the lines you drew so the cardboard squares are the right size. If you're using a box cutter, make sure the cardboard is placed on a solid surface. Wear gloves during this step to prevent paper cuts or any injuries for the scissors or box cutter."
        },
        {
          "headline":"Glue 4 of the squares together, making a cube with no top or bottom.",
          "description":"Hot glue is the best choice for this step. White glue won't be strong enough to keep the box together. This forms the outside structure of the box. Glue the edges of the cardboard together to form the cube. If the glue doesn't seem to be making a strong seal, you can use strips of tape to secure the cube while the glue hardens."
        },
        {
          "headline":"Glue another square to the bottom of the cube.",
          "description":"Line up the square perfectly with the rest of the cube or your box will be uneven. This will form the floor of the box. Lay the square down flat and put glue around the edge. Then slowly lower the box onto the square, making sure the glue makes contact with all edges of the box."
        },
        {
          "headline":"Make a hinge with the final square.",
          "description":"Don't glue the final square to the box, or your Jack in the Box won't open. Instead, rest the square on top of the box, making sure to line up all the sides. Then, use a strip of tape to fasten one side of the square to the box. This will form a simple hinge that allows your box to open. Clear tape is the best choice here. Colored tape might throw off your designs when you decorate your box later on."
        }
      ]
    },
    {
      "name":"Sealing the Box",
      "steps":[
        {
          "headline":"Find 2 small magnets.",
          "description":"There are lots of ways you could make the seal for your box, but a simple method uses magnets. Start by finding 2 magnets. These should be square or circle and small, not more than 1 inch (2.5 cm) long. Craft or hardware stores usually have small magnets that are meant to hold boxes or cabinets closed. Looking for these should give you a good start. Remember to find out which sides of the magnets attract each other. Those are the two sides you'll line up when making your seal."
        },
        {
          "headline":"Glue one magnet to the bottom of the box's lid.",
          "description":"This should be on the opposite side where you placed the tape. On the edge of the lid and in the center, glue the first magnet."
        },
        {
          "headline":"Glue another magnet directly under the first magnet.",
          "description":"The next magnet should be placed on the inside wall of the box so the two magnets touch each other when the lid is closed. In this position, they will attract each other and keep the box sealed. To find the right position for the second magnet, start by closing the box slowly. This way you'll be able to see where the magnet will rest when the box is sealed. The best place for the second magnet is right under that point, so the two magnets touch when the lid is closed."
        },
        {
          "headline":"Test out your seal.",
          "description":"See if your seal is holding after you glue both magnets. Pull up slightly to see how tight the seal is. Flip the box upside down and see if it holds."
        }
      ]
    },
    {
      "name":"Making the Spring Puppet",
      "steps":[
        {
          "headline":"Glue a compression spring to the bottom of the box.",
          "description":"Draw a circle in the middle of the box's floor to see where you'll place the spring. Then put glue on the bottom of the spring and place it over the circle you drew. Hold the spring down for a few seconds to make sure the glue seals. Compression springs come in lots of sizes. For this project, you'll want one that's slightly taller than the box, or about 7 inches (18 cm). Your local craft store should have plenty of options. Test the seal by making sure the box stays closed when the spring is in place. If the box doesn't stay closed, your spring is too big or your seal is too loose."
        },
        {
          "headline":"Put a sock puppet on the spring.",
          "description":"Your Jack in the Box needs a character to pop out! A sock puppet is perfect because it can fit snugly over the spring. You could also draw and cut out a simple face from a piece of paper and glue it to the top of the spring for a simpler design."
        },
        {
          "headline":"Test your box.",
          "description":"With all the pieces in place, it's time to make sure your box is working! Put it on a table and lift up the lid. Your puppet should pop out of the box when you do this."
        },
        {
          "headline":"Decorate your box.",
          "description":"Now that your box is complete, you can decorate it however you want! Use markers to draw on its sides, glue sparkly paper over it, cover it with stickers--use your imagination!"
        }
      ]
    }
  ],
  "text":" Constructing the Box Find a sturdy piece of cardboard. You'll need a thick and sturdy piece of cardboard for the box to support itself. The kind from a large packing box should work well. You'll be cutting out 6 squares that are each 6\" x 6\" (15 cm x 15 cm), so your piece of cardboard will need to be at least 18\" x 12\" (45 cm x 30). If you can't find a piece that big, then several pieces will work fine too. Draw six 6\" X 6\" (15 cm x 15 cm) boxes on the piece of cardboard. These six squares will form the walls, floor, and lid of your Jack in the Box. Use a ruler to measure and make sure your lines are straight. Make sure you use a dark pen or marker. Otherwise, you may not be able to see your lines when you cut. Cut out each box. Use a pair of sharp scissors or a box cutter. Carefully cut along the lines you drew so the cardboard squares are the right size. If you're using a box cutter, make sure the cardboard is placed on a solid surface. Wear gloves during this step to prevent paper cuts or any injuries for the scissors or box cutter. Glue 4 of the squares together, making a cube with no top or bottom. Hot glue is the best choice for this step. White glue won't be strong enough to keep the box together. This forms the outside structure of the box. Glue the edges of the cardboard together to form the cube. If the glue doesn't seem to be making a strong seal, you can use strips of tape to secure the cube while the glue hardens. Glue another square to the bottom of the cube. Line up the square perfectly with the rest of the cube or your box will be uneven. This will form the floor of the box. Lay the square down flat and put glue around the edge. Then slowly lower the box onto the square, making sure the glue makes contact with all edges of the box. Make a hinge with the final square. Don't glue the final square to the box, or your Jack in the Box won't open. Instead, rest the square on top of the box, making sure to line up all the sides. Then, use a strip of tape to fasten one side of the square to the box. This will form a simple hinge that allows your box to open. Clear tape is the best choice here. Colored tape might throw off your designs when you decorate your box later on. Sealing the Box Find 2 small magnets. There are lots of ways you could make the seal for your box, but a simple method uses magnets. Start by finding 2 magnets. These should be square or circle and small, not more than 1 inch (2.5 cm) long. Craft or hardware stores usually have small magnets that are meant to hold boxes or cabinets closed. Looking for these should give you a good start. Remember to find out which sides of the magnets attract each other. Those are the two sides you'll line up when making your seal. Glue one magnet to the bottom of the box's lid. This should be on the opposite side where you placed the tape. On the edge of the lid and in the center, glue the first magnet. Glue another magnet directly under the first magnet. The next magnet should be placed on the inside wall of the box so the two magnets touch each other when the lid is closed. In this position, they will attract each other and keep the box sealed. To find the right position for the second magnet, start by closing the box slowly. This way you'll be able to see where the magnet will rest when the box is sealed. The best place for the second magnet is right under that point, so the two magnets touch when the lid is closed. Test out your seal. See if your seal is holding after you glue both magnets. Pull up slightly to see how tight the seal is. Flip the box upside down and see if it holds. Making the Spring Puppet Glue a compression spring to the bottom of the box. Draw a circle in the middle of the box's floor to see where you'll place the spring. Then put glue on the bottom of the spring and place it over the circle you drew. Hold the spring down for a few seconds to make sure the glue seals. Compression springs come in lots of sizes. For this project, you'll want one that's slightly taller than the box, or about 7 inches (18 cm). Your local craft store should have plenty of options. Test the seal by making sure the box stays closed when the spring is in place. If the box doesn't stay closed, your spring is too big or your seal is too loose. Put a sock puppet on the spring. Your Jack in the Box needs a character to pop out! A sock puppet is perfect because it can fit snugly over the spring. You could also draw and cut out a simple face from a piece of paper and glue it to the top of the spring for a simpler design. Test your box. With all the pieces in place, it's time to make sure your box is working! Put it on a table and lift up the lid. Your puppet should pop out of the box when you do this. Decorate your box. Now that your box is complete, you can decorate it however you want! Use markers to draw on its sides, glue sparkly paper over it, cover it with stickers--use your imagination!",
  "sentences":[
    " Constructing the Box Find a sturdy piece of cardboard.",
    "You'll need a thick and sturdy piece of cardboard for the box to support itself.",
    "The kind from a large packing box should work well.",
    "You'll be cutting out 6 squares that are each 6\" x 6\" (15 cm x 15 cm), so your piece of cardboard will need to be at least 18\" x 12\" (45 cm x 30).",
    "If you can't find a piece that big, then several pieces will work fine too.",
    "Draw six 6\" X 6\" (15 cm x 15 cm) boxes on the piece of cardboard.",
    "These six squares will form the walls, floor, and lid of your Jack in the Box.",
    "Use a ruler to measure and make sure your lines are straight.",
    "Make sure you use a dark pen or marker.",
    "Otherwise, you may not be able to see your lines when you cut.",
    "Cut out each box.",
    "Use a pair of sharp scissors or a box cutter.",
    "Carefully cut along the lines you drew so the cardboard squares are the right size.",
    "If you're using a box cutter, make sure the cardboard is placed on a solid surface.",
    "Wear gloves during this step to prevent paper cuts or any injuries for the scissors or box cutter.",
    "Glue 4 of the squares together, making a cube with no top or bottom.",
    "Hot glue is the best choice for this step.",
    "White glue won't be strong enough to keep the box together.",
    "This forms the outside structure of the box.",
    "Glue the edges of the cardboard together to form the cube.",
    "If the glue doesn't seem to be making a strong seal, you can use strips of tape to secure the cube while the glue hardens.",
    "Glue another square to the bottom of the cube.",
    "Line up the square perfectly with the rest of the cube or your box will be uneven.",
    "This will form the floor of the box.",
    "Lay the square down flat and put glue around the edge.",
    "Then slowly lower the box onto the square, making sure the glue makes contact with all edges of the box.",
    "Make a hinge with the final square.",
    "Don't glue the final square to the box, or your Jack in the Box won't open.",
    "Instead, rest the square on top of the box, making sure to line up all the sides.",
    "Then, use a strip of tape to fasten one side of the square to the box.",
    "This will form a simple hinge that allows your box to open.",
    "Clear tape is the best choice here.",
    "Colored tape might throw off your designs when you decorate your box later on.",
    "Sealing the Box Find 2 small magnets.",
    "There are lots of ways you could make the seal for your box, but a simple method uses magnets.",
    "Start by finding 2 magnets.",
    "These should be square or circle and small, not more than 1 inch (2.5 cm) long.",
    "Craft or hardware stores usually have small magnets that are meant to hold boxes or cabinets closed.",
    "Looking for these should give you a good start.",
    "Remember to find out which sides of the magnets attract each other.",
    "Those are the two sides you'll line up when making your seal.",
    "Glue one magnet to the bottom of the box's lid.",
    "This should be on the opposite side where you placed the tape.",
    "On the edge of the lid and in the center, glue the first magnet.",
    "Glue another magnet directly under the first magnet.",
    "The next magnet should be placed on the inside wall of the box so the two magnets touch each other when the lid is closed.",
    "In this position, they will attract each other and keep the box sealed.",
    "To find the right position for the second magnet, start by closing the box slowly.",
    "This way you'll be able to see where the magnet will rest when the box is sealed.",
    "The best place for the second magnet is right under that point, so the two magnets touch when the lid is closed.",
    "Test out your seal.",
    "See if your seal is holding after you glue both magnets.",
    "Pull up slightly to see how tight the seal is.",
    "Flip the box upside down and see if it holds.",
    "Making the Spring Puppet Glue a compression spring to the bottom of the box.",
    "Draw a circle in the middle of the box's floor to see where you'll place the spring.",
    "Then put glue on the bottom of the spring and place it over the circle you drew.",
    "Hold the spring down for a few seconds to make sure the glue seals.",
    "Compression springs come in lots of sizes.",
    "For this project, you'll want one that's slightly taller than the box, or about 7 inches (18 cm).",
    "Your local craft store should have plenty of options.",
    "Test the seal by making sure the box stays closed when the spring is in place.",
    "If the box doesn't stay closed, your spring is too big or your seal is too loose.",
    "Put a sock puppet on the spring.",
    "Your Jack in the Box needs a character to pop out!",
    "A sock puppet is perfect because it can fit snugly over the spring.",
    "You could also draw and cut out a simple face from a piece of paper and glue it to the top of the spring for a simpler design.",
    "Test your box.",
    "With all the pieces in place, it's time to make sure your box is working!",
    "Put it on a table and lift up the lid.",
    "Your puppet should pop out of the box when you do this.",
    "Decorate your box.",
    "Now that your box is complete, you can decorate it however you want!",
    "Use markers to draw on its sides, glue sparkly paper over it, cover it with stickers--use your imagination!"
  ],
  "tyn_section":[
    "Cardboard",
    "Hot glue",
    "Scissors",
    "Ruler",
    "Clear tape",
    "Gloves",
    "Pen or marker",
    "Compression spring",
    "Magnets"
  ],
  "tyn_model":[
    "glue",
    "cardboard",
    "magnets",
    "tape",
    "box cutter",
    "scissors",
    "sock puppet",
    "ruler",
    "marker",
    "hot glue",
    "white glue",
    "magnet",
    "compression spring",
    "compression springs",
    "table",
    "markers",
    "sparkly paper",
    "stickers"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.3333333333,
    "f1":0.4444444444,
    "avg_pos":0.0555555556
  },
  "jacc_metrics_0.5":{
    "r":0.7777777778,
    "p":0.4444444444,
    "f1":0.5656565657
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.6111111111,
    "f1":0.7242798354
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.3333333333,
    "f1":0.4444444444
  }
}