{
  "title":"How to Frost Glass",
  "url":"https://www.wikihow.com/Frost-Glass",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects"
  ],
  "methods":[
    {
      "name":"Frosting a Large Window",
      "steps":[
        {
          "headline":"Wash the window thoroughly.",
          "description":"Scrub to remove all dust and debris from the surface. After washing, dry the window completely. Make sure there is no paper or fabric left behind on the surface or else this will affect the final appearance of the frosted glass."
        },
        {
          "headline":"Tape a border along the inside of the window frame, using painter's tape.",
          "description":"This border will be the portion of window you don't want frosted. Blue painter's tape. Painter's tape is specifically designed to endure wet applications. It has a weak adhesive allowing it to be easily removed. For windows with lattice work or muntin bars (strips of wood between the glass), cover the wood with tape. If the 1-in. painter's tape width isn't a thick enough border, lay another piece alongside it. Use a tape measure to ensure that borders are symmetrical; uneven borders look bad. If your window does not have a frame, simply tape along the outside edges until you have created a border."
        },
        {
          "headline":"Cover the interior walls of the work area with masking paper or plastic sheeting.",
          "description":"Use painter's tape to hold it in place. Don't leave any openings or gaps where the spray could enter. When working indoors, open doors and windows and turn on fans to help circulate fresh air. Consider wearing a particle mask to protect your nose and mouth. The spray fumes are hazardous to your health. Take the window outside, if possible. This ensures a healthy work space and decreases the likelihood of \"overspray,\" and frosting spray drifting onto other objects."
        },
        {
          "headline":"Shake the frosting spray can for the suggested length, usually 1-2 minutes.",
          "description":"Find frosting spray at craft and home improvement stores. While shaking the can, you should hear the small ball inside begin to rattle. Test spray on a small piece of cardboard. If it sprays correctly, prepare to frost your glass. If it is not spraying at a steady rate, continue shaking and testing in 1 minute intervals."
        },
        {
          "headline":"Spray the window using large, back and forth motions to cover the surface evenly.",
          "description":"Hold the frosting can at least 12 inches (30.5 cm) from from the window's surface to avoid splotches and runs. Apply a light coating at first. It is easier to go back and add a second or third layer to even out the frosting, but it is difficult to remove gloppy or runny patches. Expect 5-10 minutes for the frosting to become visible on the glass."
        },
        {
          "headline":"Apply a second coat of frosting after your first coat has completely dried.",
          "description":"Use the same back-and-forth motion to create a smooth frosted surface. If necessary, apply a third or fourth layer of frosting until you get the desired effect. Follow the spray can's directions regarding the wait time required between coats."
        },
        {
          "headline":"Spray acrylic sealer onto the frosted window after it has completely dried.",
          "description":"If you are satisfied with the appearance of the frosting, apply sealer. Acrylic sealers protect glass from the elements such as moisture and dirt. The protective gloss coating is often permanent. If you are unhappy with the frosted surface after the sealant has already dried, you will need to scrape it off with a razor blade."
        },
        {
          "headline":"Remove the painter's tape carefully from the glass after the frosting has dried.",
          "description":"Peel slowly to avoid accidentally removing the frosting. If you worked indoors, remove the painter's tape cautiously. This will prevent removal of paint from the walls. Use mineral spirits to clean any overspray from your hands and other objects. Do not use mineral spirits to clean items with paint or nice finishes, as this could damage the quality."
        }
      ]
    },
    {
      "name":"Frosting a Glass-Panel Door",
      "steps":[
        {
          "headline":"Remove the door from its hinges and lay it on plastic bags.",
          "description":"Face the door so that the surfaces you intend to frost are facing up. A garage or backyard patio are ideal areas to frost glass. This will prevent inhalation of hazardous fumes and limit the amount of accidental spray."
        },
        {
          "headline":"Clean the window surfaces with a cloth and window cleaner.",
          "description":"Any residue left on the window will appear in your frosting and will not look as professional. Even if there is no dirt or residue on your windows, you should still wipe it down to ensure that it is dry. Frosting will not adhere well to windows that are moist or oily."
        },
        {
          "headline":"Place painter's tape around the outside edges of each window pane.",
          "description":"One tape edge should always be against the muntins (wooden frames separating panes). Since individual window panes are typically small on glass paneled doors, stay within the 1-inch margin of the painter's tape. Using too big of borders will allow more light in but will also reduce the surface area of the frosting."
        },
        {
          "headline":"Cover the door frame and the individual muntins with tape.",
          "description":"The only visible parts of the door should be the glass surfaces. Be sure to overlap tape strips and press firmly to avoid penetration of overspray to the wood."
        },
        {
          "headline":"Shake the spray can for 1-2 minutes.",
          "description":"Though each can's label advises a specific time, the spray generally requires just a couple of minutes for preparation. Spray some frosting onto something clear, like a piece of plastic, before applying to your window. Make sure that the nozzle sprays steadily and evenly. This will ensure that your frosted glass is smooth and consistent."
        },
        {
          "headline":"Spray the glass with a slow, sweeping motion.",
          "description":"Hold the spray can about 1 foot (0.3 m) from the surface so that the coat is light and even. Pay attention to the pressure you put on the nozzle, as this will affect how much and how quickly frosting is sprayed. Try to apply enough pressure to spray a steady stream, and do so in short bursts. This will help you apply a light coat that can be sprayed over with another light coat, if necessary. Let the first coat completely dry before spraying on a second coat. Apply each successive coat with the lightest possible amount, even if you have to spray on a third or fourth layer. Gradually applying frosting will limit areas with heavy paint and blemishes."
        },
        {
          "headline":"Remove the tape from the door frame, muntins, and glass.",
          "description":"Be sure that the frosting has dried first before removing the tape, as this could damage the outline. The drying process typically takes about 5 minutes, though you should allow an extra few minutes just to be certain. Also take into account how many layers you've applied and how heavy, as these factors will also affect drying time. If you are still uncertain about whether or not the paint has dried, leave it for half an hour in which the paint should most likely be dried by then. Avoid touching the frosted area to test its wetness. This will create a smudge in the frosting and will require more layers to repair it."
        }
      ]
    },
    {
      "name":"Designing your Frosted Glass",
      "steps":[
        {
          "headline":"Cover the area of the window you want to frost with a large sheet of paper.",
          "description":"Attach it with a removable type of tape, such as painter's tape or masking tape."
        },
        {
          "headline":"Sketch the design you want to create with a pencil.",
          "description":"Keep in mind that complex designs will be difficult to create with frosting spray, though it is possible with a lot of time and patience."
        },
        {
          "headline":"Remove the sketched paper from the window and lay it on a flat, scratch resistant surface.",
          "description":"Use a razor knife to cut out the design, making sure to leave the outline intact. Keep in mind when cutting that you are creating a large stencil so you will want an inverted image."
        },
        {
          "headline":"Clean the glass thoroughly with ammonia cleaner and a lint free cloth.",
          "description":"This will prevent any dirt smudges or flakes from appearing in your design. If your window has a filmy coating, clean it with vinegar first in order to strip away the oils. Window frosting spray will not stick to a window that is oily."
        },
        {
          "headline":"Attach the stencil to the window using the removable tape.",
          "description":"Make sure it is positioned exactly where you want the design to be. Tape around the perimeter of the stencil to create a strong hold. If the stencil should slip when the window frosting spray is drying, it will cause the image to smear."
        },
        {
          "headline":"Spray the exposed window under the stencil with the frosting spray.",
          "description":"The closer you are to the glass, the thicker and darker the frosting will be. If you are using multiple colors in the design, spray the colors one at a time and allow each one to dry before spraying the next color."
        },
        {
          "headline":"Allow the frosted design to dry thoroughly before removing the stencil.",
          "description":"You can speed up the drying process by directing a fan at the window, making sure it is on the low setting to prevent the stencil from shifting."
        },
        {
          "headline":"Remove the stencil when the image is completely dry.",
          "description":"Slowly peel off the tape while holding the stencil in place to prevent it from sliding across the image. Lift the stencil off the glass in a fluid motion."
        }
      ]
    }
  ],
  "text":" Frosting a Large Window Wash the window thoroughly. Scrub to remove all dust and debris from the surface. After washing, dry the window completely. Make sure there is no paper or fabric left behind on the surface or else this will affect the final appearance of the frosted glass. Tape a border along the inside of the window frame, using painter's tape. This border will be the portion of window you don't want frosted. Blue painter's tape. Painter's tape is specifically designed to endure wet applications. It has a weak adhesive allowing it to be easily removed. For windows with lattice work or muntin bars (strips of wood between the glass), cover the wood with tape. If the 1-in. painter's tape width isn't a thick enough border, lay another piece alongside it. Use a tape measure to ensure that borders are symmetrical; uneven borders look bad. If your window does not have a frame, simply tape along the outside edges until you have created a border. Cover the interior walls of the work area with masking paper or plastic sheeting. Use painter's tape to hold it in place. Don't leave any openings or gaps where the spray could enter. When working indoors, open doors and windows and turn on fans to help circulate fresh air. Consider wearing a particle mask to protect your nose and mouth. The spray fumes are hazardous to your health. Take the window outside, if possible. This ensures a healthy work space and decreases the likelihood of \"overspray,\" and frosting spray drifting onto other objects. Shake the frosting spray can for the suggested length, usually 1-2 minutes. Find frosting spray at craft and home improvement stores. While shaking the can, you should hear the small ball inside begin to rattle. Test spray on a small piece of cardboard. If it sprays correctly, prepare to frost your glass. If it is not spraying at a steady rate, continue shaking and testing in 1 minute intervals. Spray the window using large, back and forth motions to cover the surface evenly. Hold the frosting can at least 12 inches (30.5 cm) from from the window's surface to avoid splotches and runs. Apply a light coating at first. It is easier to go back and add a second or third layer to even out the frosting, but it is difficult to remove gloppy or runny patches. Expect 5-10 minutes for the frosting to become visible on the glass. Apply a second coat of frosting after your first coat has completely dried. Use the same back-and-forth motion to create a smooth frosted surface. If necessary, apply a third or fourth layer of frosting until you get the desired effect. Follow the spray can's directions regarding the wait time required between coats. Spray acrylic sealer onto the frosted window after it has completely dried. If you are satisfied with the appearance of the frosting, apply sealer. Acrylic sealers protect glass from the elements such as moisture and dirt. The protective gloss coating is often permanent. If you are unhappy with the frosted surface after the sealant has already dried, you will need to scrape it off with a razor blade. Remove the painter's tape carefully from the glass after the frosting has dried. Peel slowly to avoid accidentally removing the frosting. If you worked indoors, remove the painter's tape cautiously. This will prevent removal of paint from the walls. Use mineral spirits to clean any overspray from your hands and other objects. Do not use mineral spirits to clean items with paint or nice finishes, as this could damage the quality. Frosting a Glass-Panel Door Remove the door from its hinges and lay it on plastic bags. Face the door so that the surfaces you intend to frost are facing up. A garage or backyard patio are ideal areas to frost glass. This will prevent inhalation of hazardous fumes and limit the amount of accidental spray. Clean the window surfaces with a cloth and window cleaner. Any residue left on the window will appear in your frosting and will not look as professional. Even if there is no dirt or residue on your windows, you should still wipe it down to ensure that it is dry. Frosting will not adhere well to windows that are moist or oily. Place painter's tape around the outside edges of each window pane. One tape edge should always be against the muntins (wooden frames separating panes). Since individual window panes are typically small on glass paneled doors, stay within the 1-inch margin of the painter's tape. Using too big of borders will allow more light in but will also reduce the surface area of the frosting. Cover the door frame and the individual muntins with tape. The only visible parts of the door should be the glass surfaces. Be sure to overlap tape strips and press firmly to avoid penetration of overspray to the wood. Shake the spray can for 1-2 minutes. Though each can's label advises a specific time, the spray generally requires just a couple of minutes for preparation. Spray some frosting onto something clear, like a piece of plastic, before applying to your window. Make sure that the nozzle sprays steadily and evenly. This will ensure that your frosted glass is smooth and consistent. Spray the glass with a slow, sweeping motion. Hold the spray can about 1 foot (0.3 m) from the surface so that the coat is light and even. Pay attention to the pressure you put on the nozzle, as this will affect how much and how quickly frosting is sprayed. Try to apply enough pressure to spray a steady stream, and do so in short bursts. This will help you apply a light coat that can be sprayed over with another light coat, if necessary. Let the first coat completely dry before spraying on a second coat. Apply each successive coat with the lightest possible amount, even if you have to spray on a third or fourth layer. Gradually applying frosting will limit areas with heavy paint and blemishes. Remove the tape from the door frame, muntins, and glass. Be sure that the frosting has dried first before removing the tape, as this could damage the outline. The drying process typically takes about 5 minutes, though you should allow an extra few minutes just to be certain. Also take into account how many layers you've applied and how heavy, as these factors will also affect drying time. If you are still uncertain about whether or not the paint has dried, leave it for half an hour in which the paint should most likely be dried by then. Avoid touching the frosted area to test its wetness. This will create a smudge in the frosting and will require more layers to repair it. Designing your Frosted Glass Cover the area of the window you want to frost with a large sheet of paper. Attach it with a removable type of tape, such as painter's tape or masking tape. Sketch the design you want to create with a pencil. Keep in mind that complex designs will be difficult to create with frosting spray, though it is possible with a lot of time and patience. Remove the sketched paper from the window and lay it on a flat, scratch resistant surface. Use a razor knife to cut out the design, making sure to leave the outline intact. Keep in mind when cutting that you are creating a large stencil so you will want an inverted image. Clean the glass thoroughly with ammonia cleaner and a lint free cloth. This will prevent any dirt smudges or flakes from appearing in your design. If your window has a filmy coating, clean it with vinegar first in order to strip away the oils. Window frosting spray will not stick to a window that is oily. Attach the stencil to the window using the removable tape. Make sure it is positioned exactly where you want the design to be. Tape around the perimeter of the stencil to create a strong hold. If the stencil should slip when the window frosting spray is drying, it will cause the image to smear. Spray the exposed window under the stencil with the frosting spray. The closer you are to the glass, the thicker and darker the frosting will be. If you are using multiple colors in the design, spray the colors one at a time and allow each one to dry before spraying the next color. Allow the frosted design to dry thoroughly before removing the stencil. You can speed up the drying process by directing a fan at the window, making sure it is on the low setting to prevent the stencil from shifting. Remove the stencil when the image is completely dry. Slowly peel off the tape while holding the stencil in place to prevent it from sliding across the image. Lift the stencil off the glass in a fluid motion.",
  "sentences":[
    " Frosting a Large Window Wash the window thoroughly.",
    "Scrub to remove all dust and debris from the surface.",
    "After washing, dry the window completely.",
    "Make sure there is no paper or fabric left behind on the surface or else this will affect the final appearance of the frosted glass.",
    "Tape a border along the inside of the window frame, using painter's tape.",
    "This border will be the portion of window you don't want frosted.",
    "Blue painter's tape.",
    "Painter's tape is specifically designed to endure wet applications.",
    "It has a weak adhesive allowing it to be easily removed.",
    "For windows with lattice work or muntin bars (strips of wood between the glass), cover the wood with tape.",
    "If the 1-in.",
    "painter's tape width isn't a thick enough border, lay another piece alongside it.",
    "Use a tape measure to ensure that borders are symmetrical; uneven borders look bad.",
    "If your window does not have a frame, simply tape along the outside edges until you have created a border.",
    "Cover the interior walls of the work area with masking paper or plastic sheeting.",
    "Use painter's tape to hold it in place.",
    "Don't leave any openings or gaps where the spray could enter.",
    "When working indoors, open doors and windows and turn on fans to help circulate fresh air.",
    "Consider wearing a particle mask to protect your nose and mouth.",
    "The spray fumes are hazardous to your health.",
    "Take the window outside, if possible.",
    "This ensures a healthy work space and decreases the likelihood of \"overspray,\" and frosting spray drifting onto other objects.",
    "Shake the frosting spray can for the suggested length, usually 1-2 minutes.",
    "Find frosting spray at craft and home improvement stores.",
    "While shaking the can, you should hear the small ball inside begin to rattle.",
    "Test spray on a small piece of cardboard.",
    "If it sprays correctly, prepare to frost your glass.",
    "If it is not spraying at a steady rate, continue shaking and testing in 1 minute intervals.",
    "Spray the window using large, back and forth motions to cover the surface evenly.",
    "Hold the frosting can at least 12 inches (30.5 cm) from from the window's surface to avoid splotches and runs.",
    "Apply a light coating at first.",
    "It is easier to go back and add a second or third layer to even out the frosting, but it is difficult to remove gloppy or runny patches.",
    "Expect 5-10 minutes for the frosting to become visible on the glass.",
    "Apply a second coat of frosting after your first coat has completely dried.",
    "Use the same back-and-forth motion to create a smooth frosted surface.",
    "If necessary, apply a third or fourth layer of frosting until you get the desired effect.",
    "Follow the spray can's directions regarding the wait time required between coats.",
    "Spray acrylic sealer onto the frosted window after it has completely dried.",
    "If you are satisfied with the appearance of the frosting, apply sealer.",
    "Acrylic sealers protect glass from the elements such as moisture and dirt.",
    "The protective gloss coating is often permanent.",
    "If you are unhappy with the frosted surface after the sealant has already dried, you will need to scrape it off with a razor blade.",
    "Remove the painter's tape carefully from the glass after the frosting has dried.",
    "Peel slowly to avoid accidentally removing the frosting.",
    "If you worked indoors, remove the painter's tape cautiously.",
    "This will prevent removal of paint from the walls.",
    "Use mineral spirits to clean any overspray from your hands and other objects.",
    "Do not use mineral spirits to clean items with paint or nice finishes, as this could damage the quality.",
    "Frosting a Glass-Panel Door Remove the door from its hinges and lay it on plastic bags.",
    "Face the door so that the surfaces you intend to frost are facing up.",
    "A garage or backyard patio are ideal areas to frost glass.",
    "This will prevent inhalation of hazardous fumes and limit the amount of accidental spray.",
    "Clean the window surfaces with a cloth and window cleaner.",
    "Any residue left on the window will appear in your frosting and will not look as professional.",
    "Even if there is no dirt or residue on your windows, you should still wipe it down to ensure that it is dry.",
    "Frosting will not adhere well to windows that are moist or oily.",
    "Place painter's tape around the outside edges of each window pane.",
    "One tape edge should always be against the muntins (wooden frames separating panes).",
    "Since individual window panes are typically small on glass paneled doors, stay within the 1-inch margin of the painter's tape.",
    "Using too big of borders will allow more light in but will also reduce the surface area of the frosting.",
    "Cover the door frame and the individual muntins with tape.",
    "The only visible parts of the door should be the glass surfaces.",
    "Be sure to overlap tape strips and press firmly to avoid penetration of overspray to the wood.",
    "Shake the spray can for 1-2 minutes.",
    "Though each can's label advises a specific time, the spray generally requires just a couple of minutes for preparation.",
    "Spray some frosting onto something clear, like a piece of plastic, before applying to your window.",
    "Make sure that the nozzle sprays steadily and evenly.",
    "This will ensure that your frosted glass is smooth and consistent.",
    "Spray the glass with a slow, sweeping motion.",
    "Hold the spray can about 1 foot (0.3 m) from the surface so that the coat is light and even.",
    "Pay attention to the pressure you put on the nozzle, as this will affect how much and how quickly frosting is sprayed.",
    "Try to apply enough pressure to spray a steady stream, and do so in short bursts.",
    "This will help you apply a light coat that can be sprayed over with another light coat, if necessary.",
    "Let the first coat completely dry before spraying on a second coat.",
    "Apply each successive coat with the lightest possible amount, even if you have to spray on a third or fourth layer.",
    "Gradually applying frosting will limit areas with heavy paint and blemishes.",
    "Remove the tape from the door frame, muntins, and glass.",
    "Be sure that the frosting has dried first before removing the tape, as this could damage the outline.",
    "The drying process typically takes about 5 minutes, though you should allow an extra few minutes just to be certain.",
    "Also take into account how many layers you've applied and how heavy, as these factors will also affect drying time.",
    "If you are still uncertain about whether or not the paint has dried, leave it for half an hour in which the paint should most likely be dried by then.",
    "Avoid touching the frosted area to test its wetness.",
    "This will create a smudge in the frosting and will require more layers to repair it.",
    "Designing your Frosted Glass Cover the area of the window you want to frost with a large sheet of paper.",
    "Attach it with a removable type of tape, such as painter's tape or masking tape.",
    "Sketch the design you want to create with a pencil.",
    "Keep in mind that complex designs will be difficult to create with frosting spray, though it is possible with a lot of time and patience.",
    "Remove the sketched paper from the window and lay it on a flat, scratch resistant surface.",
    "Use a razor knife to cut out the design, making sure to leave the outline intact.",
    "Keep in mind when cutting that you are creating a large stencil so you will want an inverted image.",
    "Clean the glass thoroughly with ammonia cleaner and a lint free cloth.",
    "This will prevent any dirt smudges or flakes from appearing in your design.",
    "If your window has a filmy coating, clean it with vinegar first in order to strip away the oils.",
    "Window frosting spray will not stick to a window that is oily.",
    "Attach the stencil to the window using the removable tape.",
    "Make sure it is positioned exactly where you want the design to be.",
    "Tape around the perimeter of the stencil to create a strong hold.",
    "If the stencil should slip when the window frosting spray is drying, it will cause the image to smear.",
    "Spray the exposed window under the stencil with the frosting spray.",
    "The closer you are to the glass, the thicker and darker the frosting will be.",
    "If you are using multiple colors in the design, spray the colors one at a time and allow each one to dry before spraying the next color.",
    "Allow the frosted design to dry thoroughly before removing the stencil.",
    "You can speed up the drying process by directing a fan at the window, making sure it is on the low setting to prevent the stencil from shifting.",
    "Remove the stencil when the image is completely dry.",
    "Slowly peel off the tape while holding the stencil in place to prevent it from sliding across the image.",
    "Lift the stencil off the glass in a fluid motion."
  ],
  "tyn_section":[
    "Large sheet of paper",
    "Masking tape",
    "Razor knife",
    "Ammonia window cleaner",
    "Lint free cloth",
    "Vinegar",
    "Window frosting spray"
  ],
  "tyn_model":[
    "painter's tape",
    "tape",
    "frosting spray",
    "glass",
    "paint",
    "frosting",
    "mineral spirits",
    "spray can",
    "frosted glass",
    "paper",
    "window frosting",
    "tape measure",
    "masking paper",
    "fans",
    "particle mask",
    "cardboard",
    "acrylic sealer",
    "sealer",
    "acrylic sealers",
    "protective gloss",
    "glass-panel door",
    "cloth",
    "window cleaner",
    "pencil",
    "razor knife",
    "ammonia cleaner",
    "lint free cloth",
    "vinegar",
    "removable tape",
    "fan"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.1,
    "f1":0.1621621622,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.2666666667,
    "f1":0.406779661
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.4666666667,
    "f1":0.6043165468
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.2333333333,
    "f1":0.351758794
  }
}