{
  "title":"How to Roast an Artichoke",
  "url":"https://www.wikihow.com/Roast-an-Artichoke",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Lemon Roasted Artichokes",
      "steps":[
        {
          "headline":"Set the oven temperature to 425 °F (218 °C).",
          "description":"Heat up your oven ahead of time so you can roast your artichokes as soon as possible. Use the preheating time to get a head start on the preparation process. While you’re getting your ingredients together, set aside a baking sheet to use for the artichokes."
        },
        {
          "headline":"Slice off the stem and top of the artichoke.",
          "description":"Take the proper preparations by cutting off the stem along with the top, pointy end of the plant. While the stem is edible, it’s not the focus of this recipe. Instead, work on cutting off the sharp edges of the plant so it will be easier to garnish later on. Feel free to rinse the artichokes beforehand."
        },
        {
          "headline":"Cut the artichokes in half and remove the thistly center piece.",
          "description":"Slice the artichokes into halves by cutting them lengthwise. Once you have 2 separate pieces, the prickly choke of the plant will be visible. It’s equal in size to a peach pit, and just as inedible. Make sure any remnants of the choke are gone before you add any toppings to the artichoke pieces. Cut off the sharp portions of the leaves before you continue. While the leaves are edible, the sharp edges can be difficult and uncomfortable to eat."
        },
        {
          "headline":"Drizzle some lemon juice over the artichokes.",
          "description":"Ladle around 1 teaspoon (4.9 mL) of lemon juice over the 8 artichoke halves. You can add a little more, if you’d like—just make sure that there’s an even amount of each piece. If you add too much lemon juice, it might overpower the other flavors."
        },
        {
          "headline":"Widen the artichoke center with a kitchen knife.",
          "description":"Take a wide kitchen knife and spear the core of the artichoke. Place the knife where the choke previously was, and use the diameter of the knife to stretch out the inside of the artichoke. This makes it easier to fit more ingredients into the halves later on. Make sure that a garlic clove can comfortably fit in the center of each artichoke."
        },
        {
          "headline":"Pour a little olive oil on top of the artichokes.",
          "description":"Drizzle at least 1 teaspoon (4.9 mL) of oil over the artichokes. Like the lemon juice, you’re welcome to add more olive oil to each piece. However, keep in mind that the oil is supposed to help cook the artichoke, not overwhelm the flavor and texture. If you don’t have any olive oil on hand, feel free to use canola oil instead."
        },
        {
          "headline":"Place a garlic clove into the middle of each artichoke.",
          "description":"Take a peeled garlic clove and press it into the center of the artichoke. The clove will fit snugly into the core of the plant since you widened the center area with a knife. Only put one clove into each artichoke half. While garlic is delicious, it’s also pungent, and you don’t want to overpower the plant’s natural flavor. Take this time to season your artichoke slices with a pinch of salt, if you wish."
        },
        {
          "headline":"Wrap the artichokes with foil and put them in an oven-safe pan.",
          "description":"Cover each artichoke half with a square of aluminum foil. Ideally, the squares should be identically sized, since you’re aiming to make the artichoke pieces as uniform as possible. Use additional sheets of foil as needed to make sure the halves are completely covered. Get the foil squares ready before you start the cooking process to save time later."
        },
        {
          "headline":"Bake the artichokes for 1 hour and 20 minutes.",
          "description":"Transfer the wrapped artichokes to a baking sheet, which can be placed in the preheated oven. Since roasting is a slow-going process, you’ll be waiting a little while—an hour and 20 minutes, to be exact. Keep the oven light on so you can watch the artichokes while they roast. Although you won’t be able to see anything through the foil, you can hear and see them sizzle when the roasting process is finished. If you have any leftovers, cover them in foil or place them in a storage container. They can stay fresh in the refrigerator for a maximum of 5 days."
        }
      ]
    },
    {
      "name":"Roasted Baby Artichokes",
      "steps":[
        {
          "headline":"Preheat the oven temperature to 425 °F (218 °C).",
          "description":"Get the roasting process started and let your oven heat up as you work. Although baby artichokes are smaller than their larger relatives, they still need a high oven temperature to be roasted properly. Use this time to get your ingredients together so the artichokes are ready to go by the time the oven is preheated."
        },
        {
          "headline":"Combine water and lemon juice together in a bowl.",
          "description":"Pour 6 cups (1,400 mL) of water and 4 tablespoons (59 mL) of lemon juice into a bowl, and stir them together. Make sure that the 2 elements are mixed before adding in the artichokes, or else the lemon flavor might not be consistent throughout all of the pieces. If you don’t have a bowl that can hold enough water and lemon juice, use 2 smaller bowls and divide the mixture in half. Feel free to rinse the artichokes at this time. If you don’t have fresh lemons on hand, store bought lemon juice works just as well."
        },
        {
          "headline":"Trim the artichokes and cut them in half.",
          "description":"Use a sharp knife to prepare the artichokes for roasting. Remove the narrow stem hanging from the base of the artichoke, and slice off the hardened, sharp leaves on the outside of the plant. Once you’ve gotten rid of the sharp parts, cut each baby artichoke in half lengthwise. Since baby artichokes are smaller, they won’t have a choke. If there is a choke visible, it will be small and edible."
        },
        {
          "headline":"Submerge the artichoke pieces in the lemon solution.",
          "description":"Place the 24 baby artichoke halves into the bowl of lemon juice and water, and let them soak for 1-2 minutes. Make sure that each piece is completely covered in the lemon water. If needed, submerge the baby artichoke pieces in batches of 12 to save space in the bowl."
        },
        {
          "headline":"Remove the pieces from the bowl and place them on a baking sheet.",
          "description":"Take the halves out of the lemon juice bowl and place them on a baking sheet. Gently pat away any excess drippings from each piece with a paper towel. However, don’t remove all of the juice, or else you might compromise the artichoke’s flavor after it’s roasted. Place all of the pieces at even distances away from each other. If the size of your baking sheet allows it, leave a 0.5 inches (1.3 cm) of space or more between each baby artichoke piece. If you want less to clean up later on, consider lining the baking sheet with foil beforehand."
        },
        {
          "headline":"Sprinkle each artichoke slice with oil, salt, and pepper.",
          "description":"Garnish the artichoke pieces with 1 tablespoon (15 mL) of oil, as well as a few pinches of salt and pepper. This adds more flavor to the roasted artichoke, and helps the plant roast more efficiently in the oven. If you’d prefer to cut back on sodium, consider using cayenne pepper or cumin instead of salt."
        },
        {
          "headline":"Put the baking sheet in the oven for 10 minutes.",
          "description":"Place the line of baby artichokes into the oven, and let them sit for 10 minutes. If you want to keep a closer eye on the halves while they roast, keep the oven light on. Set a timer so you remember to go back to the oven to flip the pieces."
        },
        {
          "headline":"Flip the artichoke halves after 10 minutes.",
          "description":"Use a spatula or similar utensil to flip the artichoke pieces over. Once you’ve done this, place the halves back in the oven for another 5 minutes. This ensures that all sides of the baby artichokes are completely cooked, and that each piece will be identical in taste and texture. Consider making a lemon aioli to go with the baby artichokes. Save your extra artichokes by refrigerating them for 3-5 days. Make sure that they’re wrapped in foil or placed in a secure storage container."
        }
      ]
    },
    {
      "name":"Roasted Spicy Artichokes",
      "steps":[
        {
          "headline":"Set the oven temperature to 375 °F (191 °C).",
          "description":"Get your oven ready ahead of time by preheating it. While the oven gets ready, feel free to assemble the ingredients in the meantime. Since the preparation for these roasted artichokes doesn’t take long, you’ll be ready to put them in the oven by the time the oven has reached the correct temperature!"
        },
        {
          "headline":"Cut and trim each artichoke before roasting them.",
          "description":"Remove the stem and top from the artichoke before cutting them in half lengthwise. Use a normal cutting knife for this—if needed, you can always use a sharper knife. Be sure to slice off the harder and sharper leaves surrounding the plant. If the artichokes look especially dirty or dusty, consider rinsing them before you cut them."
        },
        {
          "headline":"Remove the thistly choke from the core of the plant.",
          "description":"Use a spoon to scoop the prickled choke out of the center of the artichoke. While many parts of the artichoke can be eaten, the choke is completely inedible. Discard this after removing it, and make sure that no spiky remnants are leftover inside of the artichoke halves. To make the disposal process easier, consider having a plastic bag on hand that can hold all of the artichoke scraps."
        },
        {
          "headline":"Place the artichoke slices 0.5 inches (1.3 cm) apart on a lined baking sheet.",
          "description":"Take the artichoke halves and space them evenly apart on a cooking sheet. Aim to have them be 0.5 inches (1.3 cm) apart or more, if your baking sheet allows. At this point, the sliced side of the artichoke should still be facing up while you’re in the process of seasoning. Use parchment paper to line the baking sheet."
        },
        {
          "headline":"Squeeze ¼ of a lime over each artichoke slice.",
          "description":"Cut 2 limes into quarters, and drizzle a quarter’s worth of juice onto all 8 artichoke halves. While similar to lemon juice, lime has a flavor that goes especially well with chili powder. Try to use ¼ of a lime on each artichoke piece, if possible. To save time, buy a bottle of lime juice from the store instead. Keep in mind that 1 lime equals about 2 tablespoons (30 mL) of lime juice, so pour about 1.3 teaspoons (6.4 mL) of juice onto each artichoke half."
        },
        {
          "headline":"Add even amounts of chili powder to each artichoke piece.",
          "description":"Sprinkle 1⅓ tsp (3.6 g) of chili powder onto each half. The lime juice helps the chili powder to adhere to the artichoke pieces. If you want an extra kick in your artichokes, feel free to add more chili powder as you see fit. If you want to add a different variety spice, consider adding ground peppercorn or cayenne pepper to the artichokes instead of chili powder!"
        },
        {
          "headline":"Bake the artichokes for 35-40 minutes.",
          "description":"Place the baking sheet into the oven, and set a timer for at least 35 minutes. Turn on the oven light and check on the artichoke halves periodically. If you haven’t quite reached the 35-minute mark and the pieces are slightly browned and sizzling, feel free to take them out early. The longer the artichokes stay in the oven, the more roasted they’ll be. Make sure the pieces are flat-side down. If you have leftovers, feel free to keep them refrigerated for up to 5 days in an airtight container. You can also cover them in foil if you don’t have any storage containers on hand."
        }
      ]
    }
  ],
  "text":" Lemon Roasted Artichokes Set the oven temperature to 425 °F (218 °C). Heat up your oven ahead of time so you can roast your artichokes as soon as possible. Use the preheating time to get a head start on the preparation process. While you’re getting your ingredients together, set aside a baking sheet to use for the artichokes. Slice off the stem and top of the artichoke. Take the proper preparations by cutting off the stem along with the top, pointy end of the plant. While the stem is edible, it’s not the focus of this recipe. Instead, work on cutting off the sharp edges of the plant so it will be easier to garnish later on. Feel free to rinse the artichokes beforehand. Cut the artichokes in half and remove the thistly center piece. Slice the artichokes into halves by cutting them lengthwise. Once you have 2 separate pieces, the prickly choke of the plant will be visible. It’s equal in size to a peach pit, and just as inedible. Make sure any remnants of the choke are gone before you add any toppings to the artichoke pieces. Cut off the sharp portions of the leaves before you continue. While the leaves are edible, the sharp edges can be difficult and uncomfortable to eat. Drizzle some lemon juice over the artichokes. Ladle around 1 teaspoon (4.9 mL) of lemon juice over the 8 artichoke halves. You can add a little more, if you’d like—just make sure that there’s an even amount of each piece. If you add too much lemon juice, it might overpower the other flavors. Widen the artichoke center with a kitchen knife. Take a wide kitchen knife and spear the core of the artichoke. Place the knife where the choke previously was, and use the diameter of the knife to stretch out the inside of the artichoke. This makes it easier to fit more ingredients into the halves later on. Make sure that a garlic clove can comfortably fit in the center of each artichoke. Pour a little olive oil on top of the artichokes. Drizzle at least 1 teaspoon (4.9 mL) of oil over the artichokes. Like the lemon juice, you’re welcome to add more olive oil to each piece. However, keep in mind that the oil is supposed to help cook the artichoke, not overwhelm the flavor and texture. If you don’t have any olive oil on hand, feel free to use canola oil instead. Place a garlic clove into the middle of each artichoke. Take a peeled garlic clove and press it into the center of the artichoke. The clove will fit snugly into the core of the plant since you widened the center area with a knife. Only put one clove into each artichoke half. While garlic is delicious, it’s also pungent, and you don’t want to overpower the plant’s natural flavor. Take this time to season your artichoke slices with a pinch of salt, if you wish. Wrap the artichokes with foil and put them in an oven-safe pan. Cover each artichoke half with a square of aluminum foil. Ideally, the squares should be identically sized, since you’re aiming to make the artichoke pieces as uniform as possible. Use additional sheets of foil as needed to make sure the halves are completely covered. Get the foil squares ready before you start the cooking process to save time later. Bake the artichokes for 1 hour and 20 minutes. Transfer the wrapped artichokes to a baking sheet, which can be placed in the preheated oven. Since roasting is a slow-going process, you’ll be waiting a little while—an hour and 20 minutes, to be exact. Keep the oven light on so you can watch the artichokes while they roast. Although you won’t be able to see anything through the foil, you can hear and see them sizzle when the roasting process is finished. If you have any leftovers, cover them in foil or place them in a storage container. They can stay fresh in the refrigerator for a maximum of 5 days. Roasted Baby Artichokes Preheat the oven temperature to 425 °F (218 °C). Get the roasting process started and let your oven heat up as you work. Although baby artichokes are smaller than their larger relatives, they still need a high oven temperature to be roasted properly. Use this time to get your ingredients together so the artichokes are ready to go by the time the oven is preheated. Combine water and lemon juice together in a bowl. Pour 6 cups (1,400 mL) of water and 4 tablespoons (59 mL) of lemon juice into a bowl, and stir them together. Make sure that the 2 elements are mixed before adding in the artichokes, or else the lemon flavor might not be consistent throughout all of the pieces. If you don’t have a bowl that can hold enough water and lemon juice, use 2 smaller bowls and divide the mixture in half. Feel free to rinse the artichokes at this time. If you don’t have fresh lemons on hand, store bought lemon juice works just as well. Trim the artichokes and cut them in half. Use a sharp knife to prepare the artichokes for roasting. Remove the narrow stem hanging from the base of the artichoke, and slice off the hardened, sharp leaves on the outside of the plant. Once you’ve gotten rid of the sharp parts, cut each baby artichoke in half lengthwise. Since baby artichokes are smaller, they won’t have a choke. If there is a choke visible, it will be small and edible. Submerge the artichoke pieces in the lemon solution. Place the 24 baby artichoke halves into the bowl of lemon juice and water, and let them soak for 1-2 minutes. Make sure that each piece is completely covered in the lemon water. If needed, submerge the baby artichoke pieces in batches of 12 to save space in the bowl. Remove the pieces from the bowl and place them on a baking sheet. Take the halves out of the lemon juice bowl and place them on a baking sheet. Gently pat away any excess drippings from each piece with a paper towel. However, don’t remove all of the juice, or else you might compromise the artichoke’s flavor after it’s roasted. Place all of the pieces at even distances away from each other. If the size of your baking sheet allows it, leave a 0.5 inches (1.3 cm) of space or more between each baby artichoke piece. If you want less to clean up later on, consider lining the baking sheet with foil beforehand. Sprinkle each artichoke slice with oil, salt, and pepper. Garnish the artichoke pieces with 1 tablespoon (15 mL) of oil, as well as a few pinches of salt and pepper. This adds more flavor to the roasted artichoke, and helps the plant roast more efficiently in the oven. If you’d prefer to cut back on sodium, consider using cayenne pepper or cumin instead of salt. Put the baking sheet in the oven for 10 minutes. Place the line of baby artichokes into the oven, and let them sit for 10 minutes. If you want to keep a closer eye on the halves while they roast, keep the oven light on. Set a timer so you remember to go back to the oven to flip the pieces. Flip the artichoke halves after 10 minutes. Use a spatula or similar utensil to flip the artichoke pieces over. Once you’ve done this, place the halves back in the oven for another 5 minutes. This ensures that all sides of the baby artichokes are completely cooked, and that each piece will be identical in taste and texture. Consider making a lemon aioli to go with the baby artichokes. Save your extra artichokes by refrigerating them for 3-5 days. Make sure that they’re wrapped in foil or placed in a secure storage container. Roasted Spicy Artichokes Set the oven temperature to 375 °F (191 °C). Get your oven ready ahead of time by preheating it. While the oven gets ready, feel free to assemble the ingredients in the meantime. Since the preparation for these roasted artichokes doesn’t take long, you’ll be ready to put them in the oven by the time the oven has reached the correct temperature! Cut and trim each artichoke before roasting them. Remove the stem and top from the artichoke before cutting them in half lengthwise. Use a normal cutting knife for this—if needed, you can always use a sharper knife. Be sure to slice off the harder and sharper leaves surrounding the plant. If the artichokes look especially dirty or dusty, consider rinsing them before you cut them. Remove the thistly choke from the core of the plant. Use a spoon to scoop the prickled choke out of the center of the artichoke. While many parts of the artichoke can be eaten, the choke is completely inedible. Discard this after removing it, and make sure that no spiky remnants are leftover inside of the artichoke halves. To make the disposal process easier, consider having a plastic bag on hand that can hold all of the artichoke scraps. Place the artichoke slices 0.5 inches (1.3 cm) apart on a lined baking sheet. Take the artichoke halves and space them evenly apart on a cooking sheet. Aim to have them be 0.5 inches (1.3 cm) apart or more, if your baking sheet allows. At this point, the sliced side of the artichoke should still be facing up while you’re in the process of seasoning. Use parchment paper to line the baking sheet. Squeeze ¼ of a lime over each artichoke slice. Cut 2 limes into quarters, and drizzle a quarter’s worth of juice onto all 8 artichoke halves. While similar to lemon juice, lime has a flavor that goes especially well with chili powder. Try to use ¼ of a lime on each artichoke piece, if possible. To save time, buy a bottle of lime juice from the store instead. Keep in mind that 1 lime equals about 2 tablespoons (30 mL) of lime juice, so pour about 1.3 teaspoons (6.4 mL) of juice onto each artichoke half. Add even amounts of chili powder to each artichoke piece. Sprinkle 1⅓ tsp (3.6 g) of chili powder onto each half. The lime juice helps the chili powder to adhere to the artichoke pieces. If you want an extra kick in your artichokes, feel free to add more chili powder as you see fit. If you want to add a different variety spice, consider adding ground peppercorn or cayenne pepper to the artichokes instead of chili powder! Bake the artichokes for 35-40 minutes. Place the baking sheet into the oven, and set a timer for at least 35 minutes. Turn on the oven light and check on the artichoke halves periodically. If you haven’t quite reached the 35-minute mark and the pieces are slightly browned and sizzling, feel free to take them out early. The longer the artichokes stay in the oven, the more roasted they’ll be. Make sure the pieces are flat-side down. If you have leftovers, feel free to keep them refrigerated for up to 5 days in an airtight container. You can also cover them in foil if you don’t have any storage containers on hand.",
  "sentences":[
    " Lemon Roasted Artichokes Set the oven temperature to 425 °F (218 °C).",
    "Heat up your oven ahead of time so you can roast your artichokes as soon as possible.",
    "Use the preheating time to get a head start on the preparation process.",
    "While you’re getting your ingredients together, set aside a baking sheet to use for the artichokes.",
    "Slice off the stem and top of the artichoke.",
    "Take the proper preparations by cutting off the stem along with the top, pointy end of the plant.",
    "While the stem is edible, it’s not the focus of this recipe.",
    "Instead, work on cutting off the sharp edges of the plant so it will be easier to garnish later on.",
    "Feel free to rinse the artichokes beforehand.",
    "Cut the artichokes in half and remove the thistly center piece.",
    "Slice the artichokes into halves by cutting them lengthwise.",
    "Once you have 2 separate pieces, the prickly choke of the plant will be visible.",
    "It’s equal in size to a peach pit, and just as inedible.",
    "Make sure any remnants of the choke are gone before you add any toppings to the artichoke pieces.",
    "Cut off the sharp portions of the leaves before you continue.",
    "While the leaves are edible, the sharp edges can be difficult and uncomfortable to eat.",
    "Drizzle some lemon juice over the artichokes.",
    "Ladle around 1 teaspoon (4.9 mL) of lemon juice over the 8 artichoke halves.",
    "You can add a little more, if you’d like—just make sure that there’s an even amount of each piece.",
    "If you add too much lemon juice, it might overpower the other flavors.",
    "Widen the artichoke center with a kitchen knife.",
    "Take a wide kitchen knife and spear the core of the artichoke.",
    "Place the knife where the choke previously was, and use the diameter of the knife to stretch out the inside of the artichoke.",
    "This makes it easier to fit more ingredients into the halves later on.",
    "Make sure that a garlic clove can comfortably fit in the center of each artichoke.",
    "Pour a little olive oil on top of the artichokes.",
    "Drizzle at least 1 teaspoon (4.9 mL) of oil over the artichokes.",
    "Like the lemon juice, you’re welcome to add more olive oil to each piece.",
    "However, keep in mind that the oil is supposed to help cook the artichoke, not overwhelm the flavor and texture.",
    "If you don’t have any olive oil on hand, feel free to use canola oil instead.",
    "Place a garlic clove into the middle of each artichoke.",
    "Take a peeled garlic clove and press it into the center of the artichoke.",
    "The clove will fit snugly into the core of the plant since you widened the center area with a knife.",
    "Only put one clove into each artichoke half.",
    "While garlic is delicious, it’s also pungent, and you don’t want to overpower the plant’s natural flavor.",
    "Take this time to season your artichoke slices with a pinch of salt, if you wish.",
    "Wrap the artichokes with foil and put them in an oven-safe pan.",
    "Cover each artichoke half with a square of aluminum foil.",
    "Ideally, the squares should be identically sized, since you’re aiming to make the artichoke pieces as uniform as possible.",
    "Use additional sheets of foil as needed to make sure the halves are completely covered.",
    "Get the foil squares ready before you start the cooking process to save time later.",
    "Bake the artichokes for 1 hour and 20 minutes.",
    "Transfer the wrapped artichokes to a baking sheet, which can be placed in the preheated oven.",
    "Since roasting is a slow-going process, you’ll be waiting a little while—an hour and 20 minutes, to be exact.",
    "Keep the oven light on so you can watch the artichokes while they roast.",
    "Although you won’t be able to see anything through the foil, you can hear and see them sizzle when the roasting process is finished.",
    "If you have any leftovers, cover them in foil or place them in a storage container.",
    "They can stay fresh in the refrigerator for a maximum of 5 days.",
    "Roasted Baby Artichokes Preheat the oven temperature to 425 °F (218 °C).",
    "Get the roasting process started and let your oven heat up as you work.",
    "Although baby artichokes are smaller than their larger relatives, they still need a high oven temperature to be roasted properly.",
    "Use this time to get your ingredients together so the artichokes are ready to go by the time the oven is preheated.",
    "Combine water and lemon juice together in a bowl.",
    "Pour 6 cups (1,400 mL) of water and 4 tablespoons (59 mL) of lemon juice into a bowl, and stir them together.",
    "Make sure that the 2 elements are mixed before adding in the artichokes, or else the lemon flavor might not be consistent throughout all of the pieces.",
    "If you don’t have a bowl that can hold enough water and lemon juice, use 2 smaller bowls and divide the mixture in half.",
    "Feel free to rinse the artichokes at this time.",
    "If you don’t have fresh lemons on hand, store bought lemon juice works just as well.",
    "Trim the artichokes and cut them in half.",
    "Use a sharp knife to prepare the artichokes for roasting.",
    "Remove the narrow stem hanging from the base of the artichoke, and slice off the hardened, sharp leaves on the outside of the plant.",
    "Once you’ve gotten rid of the sharp parts, cut each baby artichoke in half lengthwise.",
    "Since baby artichokes are smaller, they won’t have a choke.",
    "If there is a choke visible, it will be small and edible.",
    "Submerge the artichoke pieces in the lemon solution.",
    "Place the 24 baby artichoke halves into the bowl of lemon juice and water, and let them soak for 1-2 minutes.",
    "Make sure that each piece is completely covered in the lemon water.",
    "If needed, submerge the baby artichoke pieces in batches of 12 to save space in the bowl.",
    "Remove the pieces from the bowl and place them on a baking sheet.",
    "Take the halves out of the lemon juice bowl and place them on a baking sheet.",
    "Gently pat away any excess drippings from each piece with a paper towel.",
    "However, don’t remove all of the juice, or else you might compromise the artichoke’s flavor after it’s roasted.",
    "Place all of the pieces at even distances away from each other.",
    "If the size of your baking sheet allows it, leave a 0.5 inches (1.3 cm) of space or more between each baby artichoke piece.",
    "If you want less to clean up later on, consider lining the baking sheet with foil beforehand.",
    "Sprinkle each artichoke slice with oil, salt, and pepper.",
    "Garnish the artichoke pieces with 1 tablespoon (15 mL) of oil, as well as a few pinches of salt and pepper.",
    "This adds more flavor to the roasted artichoke, and helps the plant roast more efficiently in the oven.",
    "If you’d prefer to cut back on sodium, consider using cayenne pepper or cumin instead of salt.",
    "Put the baking sheet in the oven for 10 minutes.",
    "Place the line of baby artichokes into the oven, and let them sit for 10 minutes.",
    "If you want to keep a closer eye on the halves while they roast, keep the oven light on.",
    "Set a timer so you remember to go back to the oven to flip the pieces.",
    "Flip the artichoke halves after 10 minutes.",
    "Use a spatula or similar utensil to flip the artichoke pieces over.",
    "Once you’ve done this, place the halves back in the oven for another 5 minutes.",
    "This ensures that all sides of the baby artichokes are completely cooked, and that each piece will be identical in taste and texture.",
    "Consider making a lemon aioli to go with the baby artichokes.",
    "Save your extra artichokes by refrigerating them for 3-5 days.",
    "Make sure that they’re wrapped in foil or placed in a secure storage container.",
    "Roasted Spicy Artichokes Set the oven temperature to 375 °F (191 °C).",
    "Get your oven ready ahead of time by preheating it.",
    "While the oven gets ready, feel free to assemble the ingredients in the meantime.",
    "Since the preparation for these roasted artichokes doesn’t take long, you’ll be ready to put them in the oven by the time the oven has reached the correct temperature!",
    "Cut and trim each artichoke before roasting them.",
    "Remove the stem and top from the artichoke before cutting them in half lengthwise.",
    "Use a normal cutting knife for this—if needed, you can always use a sharper knife.",
    "Be sure to slice off the harder and sharper leaves surrounding the plant.",
    "If the artichokes look especially dirty or dusty, consider rinsing them before you cut them.",
    "Remove the thistly choke from the core of the plant.",
    "Use a spoon to scoop the prickled choke out of the center of the artichoke.",
    "While many parts of the artichoke can be eaten, the choke is completely inedible.",
    "Discard this after removing it, and make sure that no spiky remnants are leftover inside of the artichoke halves.",
    "To make the disposal process easier, consider having a plastic bag on hand that can hold all of the artichoke scraps.",
    "Place the artichoke slices 0.5 inches (1.3 cm) apart on a lined baking sheet.",
    "Take the artichoke halves and space them evenly apart on a cooking sheet.",
    "Aim to have them be 0.5 inches (1.3 cm) apart or more, if your baking sheet allows.",
    "At this point, the sliced side of the artichoke should still be facing up while you’re in the process of seasoning.",
    "Use parchment paper to line the baking sheet.",
    "Squeeze ¼ of a lime over each artichoke slice.",
    "Cut 2 limes into quarters, and drizzle a quarter’s worth of juice onto all 8 artichoke halves.",
    "While similar to lemon juice, lime has a flavor that goes especially well with chili powder.",
    "Try to use ¼ of a lime on each artichoke piece, if possible.",
    "To save time, buy a bottle of lime juice from the store instead.",
    "Keep in mind that 1 lime equals about 2 tablespoons (30 mL) of lime juice, so pour about 1.3 teaspoons (6.4 mL) of juice onto each artichoke half.",
    "Add even amounts of chili powder to each artichoke piece.",
    "Sprinkle 1⅓ tsp (3.6 g) of chili powder onto each half.",
    "The lime juice helps the chili powder to adhere to the artichoke pieces.",
    "If you want an extra kick in your artichokes, feel free to add more chili powder as you see fit.",
    "If you want to add a different variety spice, consider adding ground peppercorn or cayenne pepper to the artichokes instead of chili powder!",
    "Bake the artichokes for 35-40 minutes.",
    "Place the baking sheet into the oven, and set a timer for at least 35 minutes.",
    "Turn on the oven light and check on the artichoke halves periodically.",
    "If you haven’t quite reached the 35-minute mark and the pieces are slightly browned and sizzling, feel free to take them out early.",
    "The longer the artichokes stay in the oven, the more roasted they’ll be.",
    "Make sure the pieces are flat-side down.",
    "If you have leftovers, feel free to keep them refrigerated for up to 5 days in an airtight container.",
    "You can also cover them in foil if you don’t have any storage containers on hand."
  ],
  "tyn_section":[
    "Baking with Lemon Juice",
    "Cutting knife",
    "Baking dish",
    "Foil",
    "Roasting Baby Artichokes",
    "Bowl",
    "Baking sheet",
    "Paper towels (optional)",
    "Making Spicy Artichokes",
    "Parchment paper (optional)"
  ],
  "tyn_model":[
    "oven",
    "artichokes",
    "artichoke",
    "baking sheet",
    "foil",
    "lemon",
    "bowl",
    "chili powder",
    "knife",
    "lemon juice",
    "garlic",
    "oil",
    "water",
    "lime",
    "olive oil",
    "salt",
    "lime juice",
    "kitchen knife",
    "—just",
    "canola oil",
    "oven-safe pan",
    "aluminum foil",
    "—an",
    "refrigerator",
    "bowls",
    "lemons",
    "lemon water",
    "lemon juice bowl",
    "paper towel",
    "pepper",
    "salt and pepper",
    "cayenne pepper",
    "spatula",
    "cutting knife",
    "—if",
    "spoon",
    "cooking sheet",
    "parchment paper",
    "limes",
    "airtight container"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1,
    "f1":0.16,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.2,
    "f1":0.3
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9,
    "p":0.3,
    "f1":0.45
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.125,
    "f1":0.2
  }
}