{
  "title":"How to Wash Spinach",
  "url":"https://www.wikihow.com/Wash-Spinach",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "parts":[
    {
      "name":"Removing the Stems",
      "steps":[
        {
          "headline":"Wash your hands for 20 seconds.",
          "description":"Following CDC guidelines for preventing the spread of disease and other bacteria means that you should spend 20 seconds with your hands under the water. If you don’t wash your hands before washing the lettuce, you might get them even more dirty than they were before. Dry your hands thoroughly, particularly if you plan to handle a knife or other cutting tool to remove blemishes."
        },
        {
          "headline":"Cut off any damage you can see on the leaf.",
          "description":"Damage includes holes where aphids or other bugs might have chewed through and black spots. You can use a knife to cut off damaged parts of leaves, or you can simply put the damaged leaves in a food waste bin. Any leaves that appear rotten or moldy should be immediately discarded."
        },
        {
          "headline":"Grasp the top of the stem where it meets the leaf.",
          "description":"Many food safety experts suggest removing the stem from spinach leaves by grabbing leaf just below its base, right at the top of the stem. The stem does not cook particularly well, and it can be covered in dirt and grime that you do not need in your food."
        },
        {
          "headline":"Fold each side of the leaf down along the stem.",
          "description":"Push down on each side of the spinach leaf until you can pinch them together under the stem. As you fold the two sides down, it will begin to look as though the spinach is only a single half of one leaf."
        },
        {
          "headline":"Tear the leaf-halves away from the stem.",
          "description":"Pulling down on the leaves quickly will rip the two sides of the leaf from the stem, leaving each half intact. The leaves will look a little different than you may be used to without the stem, but the stem tends to harbor lots of bacteria that washing cannot remove. You can discard the stem in a food waste bin afterwards."
        }
      ]
    },
    {
      "name":"Washing the Leaves",
      "steps":[
        {
          "headline":"Wash your spinach leaves right before you plan to use them.",
          "description":"Storing spinach after you have washed it can promote the spread of bacteria, rotting, and the growth of mold. Always try to avoid getting spinach wet before keeping it in the fridge. If you decide to wash your spinach before storing it, dry it completely with a paper towel to help prevent mold and bacteria."
        },
        {
          "headline":"Use cold water to rinse the spinach.",
          "description":"Warm and hot water can actually help the bacteria flourish on the leaves. In order to avoid this, use cool or cold tap water as you wash the spinach leaves, regardless of how you rinse them. For an added cleanse, you can use a mixture of 3 cups (710 mL) of water and 1 cup (240 mL) of white vinegar to wash spinach, though it will only remove slightly more bacteria than water alone. Stay away from produce washes and soap when washing spinach, which leave a slight residue that is difficult to rinse off and can be harmful to your health."
        },
        {
          "headline":"Immerse the leaves in a bowl full of water for a deeper, slower clean.",
          "description":"You can simply place the leaves in a bowl full of cold water and stir the water around a bit. Once you’ve stirred the water, let the leaves soak for a full minute before testing for dirt. If you see or taste any dirt or grit, drain the bowl and rinse the leaves again."
        },
        {
          "headline":"Rinse water over the spinach in a colander for a quick wash.",
          "description":"If you have a lot of spinach that you need to get through quickly, or you will be cooking the spinach at a high enough heat that washing is mainly to get rid of dirt and grime, you can simply run cold water over the spinach leaves in a colander. If you’ve already washed the leaves in a bowl and you found dirt on them, you can pour the water through a colander and then rinse the leaves in it after the water has drained. The dirt and bacteria will slide off the leaves and out the colander holes."
        },
        {
          "headline":"Move the leaves around with your hands as you rinse them.",
          "description":"No matter how you are washing them, it is a good idea for you to use your hands to separate the spinach and make sure that the water is cleaning all of the leaves off."
        }
      ]
    },
    {
      "name":"Drying Freshly Washed Spinach",
      "steps":[
        {
          "headline":"Dry the leaves with a paper towel.",
          "description":"A disposable towel is the easiest way to dry off a batch of washed spinach without accidentally getting even more bacteria on it. Most kitchen towels are teeming with germs that will get right back on the leaf if they are used. You can also use a cloth kitchen towel so long as it has just been washed."
        },
        {
          "headline":"Use a salad spinner to dry the spinach.",
          "description":"One quick, clean, and effective way to dry off spinach is to run it through a few cycles in a salad spinner. This will separate the moisture from the leaves and allow any remaining dirt and debris to fall off. You can even use a salad spinner to wash the leaves in the first place, as it will remove dirt and bacteria easily and thoroughly. If you wash spinach in a spinner you will have to clean and dry it thoroughly if you plan to dry the leaves in the same one as well."
        },
        {
          "headline":"Avoid letting spinach air dry.",
          "description":"The moisture will allow any microorganisms that are on the leaves to grow and spread. Damp leaves are also prone to rotting or growing moldy. You should always dry the leaves well before using them in your cooking."
        }
      ]
    }
  ],
  "text":" Removing the Stems Wash your hands for 20 seconds. Following CDC guidelines for preventing the spread of disease and other bacteria means that you should spend 20 seconds with your hands under the water. If you don’t wash your hands before washing the lettuce, you might get them even more dirty than they were before. Dry your hands thoroughly, particularly if you plan to handle a knife or other cutting tool to remove blemishes. Cut off any damage you can see on the leaf. Damage includes holes where aphids or other bugs might have chewed through and black spots. You can use a knife to cut off damaged parts of leaves, or you can simply put the damaged leaves in a food waste bin. Any leaves that appear rotten or moldy should be immediately discarded. Grasp the top of the stem where it meets the leaf. Many food safety experts suggest removing the stem from spinach leaves by grabbing leaf just below its base, right at the top of the stem. The stem does not cook particularly well, and it can be covered in dirt and grime that you do not need in your food. Fold each side of the leaf down along the stem. Push down on each side of the spinach leaf until you can pinch them together under the stem. As you fold the two sides down, it will begin to look as though the spinach is only a single half of one leaf. Tear the leaf-halves away from the stem. Pulling down on the leaves quickly will rip the two sides of the leaf from the stem, leaving each half intact. The leaves will look a little different than you may be used to without the stem, but the stem tends to harbor lots of bacteria that washing cannot remove. You can discard the stem in a food waste bin afterwards. Washing the Leaves Wash your spinach leaves right before you plan to use them. Storing spinach after you have washed it can promote the spread of bacteria, rotting, and the growth of mold. Always try to avoid getting spinach wet before keeping it in the fridge. If you decide to wash your spinach before storing it, dry it completely with a paper towel to help prevent mold and bacteria. Use cold water to rinse the spinach. Warm and hot water can actually help the bacteria flourish on the leaves. In order to avoid this, use cool or cold tap water as you wash the spinach leaves, regardless of how you rinse them. For an added cleanse, you can use a mixture of 3 cups (710 mL) of water and 1 cup (240 mL) of white vinegar to wash spinach, though it will only remove slightly more bacteria than water alone. Stay away from produce washes and soap when washing spinach, which leave a slight residue that is difficult to rinse off and can be harmful to your health. Immerse the leaves in a bowl full of water for a deeper, slower clean. You can simply place the leaves in a bowl full of cold water and stir the water around a bit. Once you’ve stirred the water, let the leaves soak for a full minute before testing for dirt. If you see or taste any dirt or grit, drain the bowl and rinse the leaves again. Rinse water over the spinach in a colander for a quick wash. If you have a lot of spinach that you need to get through quickly, or you will be cooking the spinach at a high enough heat that washing is mainly to get rid of dirt and grime, you can simply run cold water over the spinach leaves in a colander. If you’ve already washed the leaves in a bowl and you found dirt on them, you can pour the water through a colander and then rinse the leaves in it after the water has drained. The dirt and bacteria will slide off the leaves and out the colander holes. Move the leaves around with your hands as you rinse them. No matter how you are washing them, it is a good idea for you to use your hands to separate the spinach and make sure that the water is cleaning all of the leaves off. Drying Freshly Washed Spinach Dry the leaves with a paper towel. A disposable towel is the easiest way to dry off a batch of washed spinach without accidentally getting even more bacteria on it. Most kitchen towels are teeming with germs that will get right back on the leaf if they are used. You can also use a cloth kitchen towel so long as it has just been washed. Use a salad spinner to dry the spinach. One quick, clean, and effective way to dry off spinach is to run it through a few cycles in a salad spinner. This will separate the moisture from the leaves and allow any remaining dirt and debris to fall off. You can even use a salad spinner to wash the leaves in the first place, as it will remove dirt and bacteria easily and thoroughly. If you wash spinach in a spinner you will have to clean and dry it thoroughly if you plan to dry the leaves in the same one as well. Avoid letting spinach air dry. The moisture will allow any microorganisms that are on the leaves to grow and spread. Damp leaves are also prone to rotting or growing moldy. You should always dry the leaves well before using them in your cooking.",
  "sentences":[
    " Removing the Stems Wash your hands for 20 seconds.",
    "Following CDC guidelines for preventing the spread of disease and other bacteria means that you should spend 20 seconds with your hands under the water.",
    "If you don’t wash your hands before washing the lettuce, you might get them even more dirty than they were before.",
    "Dry your hands thoroughly, particularly if you plan to handle a knife or other cutting tool to remove blemishes.",
    "Cut off any damage you can see on the leaf.",
    "Damage includes holes where aphids or other bugs might have chewed through and black spots.",
    "You can use a knife to cut off damaged parts of leaves, or you can simply put the damaged leaves in a food waste bin.",
    "Any leaves that appear rotten or moldy should be immediately discarded.",
    "Grasp the top of the stem where it meets the leaf.",
    "Many food safety experts suggest removing the stem from spinach leaves by grabbing leaf just below its base, right at the top of the stem.",
    "The stem does not cook particularly well, and it can be covered in dirt and grime that you do not need in your food.",
    "Fold each side of the leaf down along the stem.",
    "Push down on each side of the spinach leaf until you can pinch them together under the stem.",
    "As you fold the two sides down, it will begin to look as though the spinach is only a single half of one leaf.",
    "Tear the leaf-halves away from the stem.",
    "Pulling down on the leaves quickly will rip the two sides of the leaf from the stem, leaving each half intact.",
    "The leaves will look a little different than you may be used to without the stem, but the stem tends to harbor lots of bacteria that washing cannot remove.",
    "You can discard the stem in a food waste bin afterwards.",
    "Washing the Leaves Wash your spinach leaves right before you plan to use them.",
    "Storing spinach after you have washed it can promote the spread of bacteria, rotting, and the growth of mold.",
    "Always try to avoid getting spinach wet before keeping it in the fridge.",
    "If you decide to wash your spinach before storing it, dry it completely with a paper towel to help prevent mold and bacteria.",
    "Use cold water to rinse the spinach.",
    "Warm and hot water can actually help the bacteria flourish on the leaves.",
    "In order to avoid this, use cool or cold tap water as you wash the spinach leaves, regardless of how you rinse them.",
    "For an added cleanse, you can use a mixture of 3 cups (710 mL) of water and 1 cup (240 mL) of white vinegar to wash spinach, though it will only remove slightly more bacteria than water alone.",
    "Stay away from produce washes and soap when washing spinach, which leave a slight residue that is difficult to rinse off and can be harmful to your health.",
    "Immerse the leaves in a bowl full of water for a deeper, slower clean.",
    "You can simply place the leaves in a bowl full of cold water and stir the water around a bit.",
    "Once you’ve stirred the water, let the leaves soak for a full minute before testing for dirt.",
    "If you see or taste any dirt or grit, drain the bowl and rinse the leaves again.",
    "Rinse water over the spinach in a colander for a quick wash.",
    "If you have a lot of spinach that you need to get through quickly, or you will be cooking the spinach at a high enough heat that washing is mainly to get rid of dirt and grime, you can simply run cold water over the spinach leaves in a colander.",
    "If you’ve already washed the leaves in a bowl and you found dirt on them, you can pour the water through a colander and then rinse the leaves in it after the water has drained.",
    "The dirt and bacteria will slide off the leaves and out the colander holes.",
    "Move the leaves around with your hands as you rinse them.",
    "No matter how you are washing them, it is a good idea for you to use your hands to separate the spinach and make sure that the water is cleaning all of the leaves off.",
    "Drying Freshly Washed Spinach Dry the leaves with a paper towel.",
    "A disposable towel is the easiest way to dry off a batch of washed spinach without accidentally getting even more bacteria on it.",
    "Most kitchen towels are teeming with germs that will get right back on the leaf if they are used.",
    "You can also use a cloth kitchen towel so long as it has just been washed.",
    "Use a salad spinner to dry the spinach.",
    "One quick, clean, and effective way to dry off spinach is to run it through a few cycles in a salad spinner.",
    "This will separate the moisture from the leaves and allow any remaining dirt and debris to fall off.",
    "You can even use a salad spinner to wash the leaves in the first place, as it will remove dirt and bacteria easily and thoroughly.",
    "If you wash spinach in a spinner you will have to clean and dry it thoroughly if you plan to dry the leaves in the same one as well.",
    "Avoid letting spinach air dry.",
    "The moisture will allow any microorganisms that are on the leaves to grow and spread.",
    "Damp leaves are also prone to rotting or growing moldy.",
    "You should always dry the leaves well before using them in your cooking."
  ],
  "tyn_section":[
    "Soap",
    "Water",
    "Knife",
    "Bowl or colander",
    "Paper towels or a clean cloth towel",
    "Salad spinner (optional)"
  ],
  "tyn_model":[
    "water",
    "spinach",
    "colander",
    "salad spinner",
    "knife",
    "bowl",
    "lettuce",
    "spinach leaves",
    "food waste bin",
    "white vinegar",
    "produce washes",
    "paper towel",
    "kitchen towels",
    "spinner"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1428571429,
    "f1":0.2,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2142857143,
    "f1":0.3
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.4285714286,
    "f1":0.5217391304
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2142857143,
    "f1":0.3
  }
}