{
  "title":"How to Prune a Poinsettia",
  "url":"https://www.wikihow.com/Prune-a-Poinsettia",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "parts":[
    {
      "name":"Trimming the Plant after Blooming",
      "steps":[
        {
          "headline":"Wear gloves to keep from coming in contact with skin-irritating sap.",
          "description":"When cut, poinsettias leak a milky white sap that, though not poisonous, can cause some irritation, especially for people with latex allergies. If you get sap on you, quickly rinsing it off with water and soap should be enough to prevent irritation. The sap can also damage the plant itself if left on the stems or leaves for too long. If some sap leaks onto the poinsettia plant, wipe it off with a damp rag."
        },
        {
          "headline":"Cut off the dead foliage using clean gardening shears in February or March.",
          "description":"Trim discolored, dry, or limp leaves by making 45-degree cuts on the stem just below the leaf. Do not cut off foliage that appears green and vibrant. Some petals and leaves may fall off naturally, and you can discard them however you choose to. Using clean shears keeps bacteria from getting into the plant, so you may have to disinfect your shears before making any cuts"
        },
        {
          "headline":"Trim the stems so that they are approximately 6 inches (15 cm) long.",
          "description":"Poinsettias naturally grow to be a large shrub. To keep them at a compact size during the year, you will have to cut the stems to a shorter length. Once you have cut off the dead leaves that block them, you can cut off the stems more easily to this length. If you want larger poinsettias during the holiday season, you can leave the stems a bit longer so that they end approximately 8 inches (20 cm) from the rim of the container they are in. The cut stems can be used to propagate new plants. Do this by dipping the stem in a rooting hormone and then planting this into a pot with soil."
        },
        {
          "headline":"Prune often throughout the year to keep the poinsettias at this size.",
          "description":"Check on your poinsettia once a month. If it has grown since the last check, trim the stems back down to 6 inches (15 cm) or to your desired size, leaving 3 or 4 new leaves on the stems. Your poinsettia plant should have a rounded shape, with dense and compact growth. Pinch small shoots off in order to encourage bushiness. Pinched shoots can be used for propagation."
        },
        {
          "headline":"Stop trimming at the beginning of November.",
          "description":"Shorter days during the end of fall and the beginning of winter cause poinsettias to begin flowering and changing color. For big red foliage, you should stop trimming the plants to allow for maximum growth during this time."
        }
      ]
    },
    {
      "name":"Maintaining a Good Environment for Reblooming",
      "steps":[
        {
          "headline":"Water the plant regularly and ensure proper drainage.",
          "description":"Poinsettias, like all plants, need water to grow, but they can be very sensitive to overwatering. Water the plant when the surface of the soil feels dry to the touch. If you bought your plant in winter, it is likely to be in a pot wrapped in foil. Take the pot out of the foil in order to allow for drainage."
        },
        {
          "headline":"Keep the plant in a sunny place with a temperature of at least 55 °F (13 °C).",
          "description":"The plant should receive a good amount of light, but should not be placed directly in the sun. Avoid drafty locations where temperatures may fluctuate during the day and night."
        },
        {
          "headline":"Place the plants in complete darkness for 13 hours a day beginning in mid-September.",
          "description":"For those characteristic bright red leaves, poinsettias need approximately 13 hours of absolute darkness per day for 8-10 weeks. Place them in a closet, under a box, or inside a cover, making sure that absolutely no light can get through. Setting a daily alarm is the best way to remind yourself when to do this and keep you on track for beautiful plants during the holiday season. During the other hours of the day, the plant should receive normal lighting conditions."
        }
      ]
    }
  ],
  "text":" Trimming the Plant after Blooming Wear gloves to keep from coming in contact with skin-irritating sap. When cut, poinsettias leak a milky white sap that, though not poisonous, can cause some irritation, especially for people with latex allergies. If you get sap on you, quickly rinsing it off with water and soap should be enough to prevent irritation. The sap can also damage the plant itself if left on the stems or leaves for too long. If some sap leaks onto the poinsettia plant, wipe it off with a damp rag. Cut off the dead foliage using clean gardening shears in February or March. Trim discolored, dry, or limp leaves by making 45-degree cuts on the stem just below the leaf. Do not cut off foliage that appears green and vibrant. Some petals and leaves may fall off naturally, and you can discard them however you choose to. Using clean shears keeps bacteria from getting into the plant, so you may have to disinfect your shears before making any cuts Trim the stems so that they are approximately 6 inches (15 cm) long. Poinsettias naturally grow to be a large shrub. To keep them at a compact size during the year, you will have to cut the stems to a shorter length. Once you have cut off the dead leaves that block them, you can cut off the stems more easily to this length. If you want larger poinsettias during the holiday season, you can leave the stems a bit longer so that they end approximately 8 inches (20 cm) from the rim of the container they are in. The cut stems can be used to propagate new plants. Do this by dipping the stem in a rooting hormone and then planting this into a pot with soil. Prune often throughout the year to keep the poinsettias at this size. Check on your poinsettia once a month. If it has grown since the last check, trim the stems back down to 6 inches (15 cm) or to your desired size, leaving 3 or 4 new leaves on the stems. Your poinsettia plant should have a rounded shape, with dense and compact growth. Pinch small shoots off in order to encourage bushiness. Pinched shoots can be used for propagation. Stop trimming at the beginning of November. Shorter days during the end of fall and the beginning of winter cause poinsettias to begin flowering and changing color. For big red foliage, you should stop trimming the plants to allow for maximum growth during this time. Maintaining a Good Environment for Reblooming Water the plant regularly and ensure proper drainage. Poinsettias, like all plants, need water to grow, but they can be very sensitive to overwatering. Water the plant when the surface of the soil feels dry to the touch. If you bought your plant in winter, it is likely to be in a pot wrapped in foil. Take the pot out of the foil in order to allow for drainage. Keep the plant in a sunny place with a temperature of at least 55 °F (13 °C). The plant should receive a good amount of light, but should not be placed directly in the sun. Avoid drafty locations where temperatures may fluctuate during the day and night. Place the plants in complete darkness for 13 hours a day beginning in mid-September. For those characteristic bright red leaves, poinsettias need approximately 13 hours of absolute darkness per day for 8-10 weeks. Place them in a closet, under a box, or inside a cover, making sure that absolutely no light can get through. Setting a daily alarm is the best way to remind yourself when to do this and keep you on track for beautiful plants during the holiday season. During the other hours of the day, the plant should receive normal lighting conditions.",
  "sentences":[
    " Trimming the Plant after Blooming Wear gloves to keep from coming in contact with skin-irritating sap.",
    "When cut, poinsettias leak a milky white sap that, though not poisonous, can cause some irritation, especially for people with latex allergies.",
    "If you get sap on you, quickly rinsing it off with water and soap should be enough to prevent irritation.",
    "The sap can also damage the plant itself if left on the stems or leaves for too long.",
    "If some sap leaks onto the poinsettia plant, wipe it off with a damp rag.",
    "Cut off the dead foliage using clean gardening shears in February or March.",
    "Trim discolored, dry, or limp leaves by making 45-degree cuts on the stem just below the leaf.",
    "Do not cut off foliage that appears green and vibrant.",
    "Some petals and leaves may fall off naturally, and you can discard them however you choose to.",
    "Using clean shears keeps bacteria from getting into the plant, so you may have to disinfect your shears before making any cuts Trim the stems so that they are approximately 6 inches (15 cm) long.",
    "Poinsettias naturally grow to be a large shrub.",
    "To keep them at a compact size during the year, you will have to cut the stems to a shorter length.",
    "Once you have cut off the dead leaves that block them, you can cut off the stems more easily to this length.",
    "If you want larger poinsettias during the holiday season, you can leave the stems a bit longer so that they end approximately 8 inches (20 cm) from the rim of the container they are in.",
    "The cut stems can be used to propagate new plants.",
    "Do this by dipping the stem in a rooting hormone and then planting this into a pot with soil.",
    "Prune often throughout the year to keep the poinsettias at this size.",
    "Check on your poinsettia once a month.",
    "If it has grown since the last check, trim the stems back down to 6 inches (15 cm) or to your desired size, leaving 3 or 4 new leaves on the stems.",
    "Your poinsettia plant should have a rounded shape, with dense and compact growth.",
    "Pinch small shoots off in order to encourage bushiness.",
    "Pinched shoots can be used for propagation.",
    "Stop trimming at the beginning of November.",
    "Shorter days during the end of fall and the beginning of winter cause poinsettias to begin flowering and changing color.",
    "For big red foliage, you should stop trimming the plants to allow for maximum growth during this time.",
    "Maintaining a Good Environment for Reblooming Water the plant regularly and ensure proper drainage.",
    "Poinsettias, like all plants, need water to grow, but they can be very sensitive to overwatering.",
    "Water the plant when the surface of the soil feels dry to the touch.",
    "If you bought your plant in winter, it is likely to be in a pot wrapped in foil.",
    "Take the pot out of the foil in order to allow for drainage.",
    "Keep the plant in a sunny place with a temperature of at least 55 °F (13 °C).",
    "The plant should receive a good amount of light, but should not be placed directly in the sun.",
    "Avoid drafty locations where temperatures may fluctuate during the day and night.",
    "Place the plants in complete darkness for 13 hours a day beginning in mid-September.",
    "For those characteristic bright red leaves, poinsettias need approximately 13 hours of absolute darkness per day for 8-10 weeks.",
    "Place them in a closet, under a box, or inside a cover, making sure that absolutely no light can get through.",
    "Setting a daily alarm is the best way to remind yourself when to do this and keep you on track for beautiful plants during the holiday season.",
    "During the other hours of the day, the plant should receive normal lighting conditions."
  ],
  "tyn_section":[
    "Gardening shears",
    "Gloves",
    "Pot",
    "Gardening soil"
  ],
  "tyn_model":[
    "poinsettias",
    "water",
    "pot",
    "shears",
    "gloves",
    "soap",
    "damp rag",
    "gardening shears",
    "rooting hormone",
    "prune",
    "foil"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.2727272727,
    "f1":0.4,
    "avg_pos":0.6363636364
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.3636363636,
    "f1":0.4897959184
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3636363636,
    "f1":0.5333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.2727272727,
    "f1":0.4
  }
}