{
  "title":"How to Open a Champagne Bottle with a Sword",
  "url":"https://www.wikihow.com/Open-a-Champagne-Bottle-with-a-Sword",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "parts":[
    {
      "name":"Setting Up Your Equipment and Space",
      "steps":[
        {
          "headline":"Understand the nature of glass champagne bottle.",
          "description":"The key to opening a champagne bottle with a sword is the pressure in the bottle. Because of the way champagne is packaged, the carbon dioxide creates roughly 35 pounds of force pushing against the cork at all times. Glass is brittle. That means that it breaks instead of bending when it is damaged. Scoring the surface of the glass bottle will cause it to crack, and the force inside will cause the collar of the bottle and the cork to fly off."
        },
        {
          "headline":"Buy several bottles of champagne.",
          "description":"You will likely not get this right on the first try, so you will need backup bottles. This trick even works on cheap champagne though, so there’s no need to splurge on your practice bottles. Sparkling wine also works well. In general, French and Spanish champagne tends to come in thicker bottles than American champagne. It may also be more expensive. Thicker glass works better than thin, but if you’re operating on a budget, American champagne will also work. This trick typically takes half to a full a case to master. Plan on making at least a $30 investment to learn (6 x $5 bottles). Practice with inexpensive, corked sparkling wine. Note that some inexpensive bottles are cheaply made from inferior glass, which can lead to a higher rate of breakage and are therefore riskier to work with."
        },
        {
          "headline":"Get a sword.",
          "description":"It doesn’t have to be terribly sharp. Really, any sturdy knife will work. Of course, a sword is the most dramatic and flashy! The best knives and swords for sabrage are thick and sturdy. The sides should be as flat (parallel to each other) as possible. You may want to practice with a sturdy kitchen knife before investing in a fancy sword. Keep your eye out in thrift stores, yard sales, and estate sales, and you could find a sword for a reasonable price. You can find champagne swords made specifically for this purpose online."
        },
        {
          "headline":"Chill the champagne.",
          "description":"The colder the neck of the bottle is, the better. You may want to chill the neck in a bucket of ice water right before sabering. Be very careful not to shake the champagne. Don’t chill it in the freezer. You’ll ruin the flavor, and it could explode."
        },
        {
          "headline":"Find an open space.",
          "description":"Outside is best. This trick is going to create flying objects and spill champagne, so unless you are in an open indoor area like a gymnasium, outside is your best option. Some saberers have reported that the cork flies as far as twenty feet, so give yourself plenty of room. Be sure that the guests you are trying to impress with this trick have a safe haven away from flying corks."
        },
        {
          "headline":"Prepare the bottle.",
          "description":"Wipe away any moisture on the bottle. Remove the foil and wire basket from the top of the bottle. Keep your thumb over the cork as you do this. There is a chance that simply removing the wire will cause the cork to fly out."
        }
      ]
    },
    {
      "name":"Holding the Bottle",
      "steps":[
        {
          "headline":"Locate one of the seams on the bottle.",
          "description":"This is where the two halves of the bottle join together. It’s the weakest part of the bottle, so it’s where you’re going to focus your attention."
        },
        {
          "headline":"Hold the bottle at a 30 degree angle with the seam facing upward.",
          "description":"The cork should be higher than the bottom of the bottle. Be sure to point the cork in a direction where it will not hit anyone or anything. The angle doesn’t have to be very precise."
        },
        {
          "headline":"Hold the bottle with your non-dominant hand.",
          "description":"Grip the bottle firmly at the base. Put all of your fingers except your thumb beneath the bottle (on the opposite side from the seam) out of the way of the sword. The bottle should rest on your fingers while your thumb stabilizes it. Your sword will not come anywhere near the base, so your fingers will be safe down here."
        },
        {
          "headline":"Put your thumb in the indentation at the bottom of the bottle.",
          "description":"This will help you stabilize the bottle without putting your thumb in danger. Once your thumb is in place, practice holding your fingers closer together or farther apart. Choose the method of holding the bottle that feels both secure and safe."
        }
      ]
    },
    {
      "name":"Sabering the Bottle",
      "steps":[
        {
          "headline":"Rest the blade of the sword on the neck of the bottle.",
          "description":"The dull edge of the blade should face the cork. Hold the blade flat against the bottle. This trick also works if you use the sharp or cutting edge of the sword, but it can damage your sword. Using the cutting edge of a sword can also increase the chances that you don’t get a clean cut."
        },
        {
          "headline":"Locate the annulus of the bottle.",
          "description":"This is the ring around the top, which you will be aiming for with the back of the sword. Notice the point of the annulus where it connects with the seam of the bottle. This is the weakest point on the bottle."
        },
        {
          "headline":"Practice sliding from the base of the bottle to the annulus.",
          "description":"Before attempting this grand gesture, it will help for you to get a feel for the motion. You could also try putting the sword down and practicing the motion with just your hand."
        },
        {
          "headline":"Slide the knife down the vertical seam and hit the annulus.",
          "description":"Do this using a single firm, confident stroke. The bottle should break cleanly and the cork should go flying. If done correctly, the bottle will break cleanly. Make sure you follow through with the motion — that is, don't halt your arm when you hit the annulus. Continue moving your arm forward, following the trajectory of the cork. You will get the best, cleanest results by following the seam. If you don't use enough force or you pause, the trick won't work. If you find that your first attempt doesn’t work, you should go back to practicing. Be sure that you can move your hand (without the sword) quickly and assuredly."
        },
        {
          "headline":"Inspect the neck of the glass for shards.",
          "description":"Wipe it off carefully with a cloth if necessary. Be careful not to push shards of glass into the bottle. The pressure inside that sent the cork and top of the bottle flying will likely have prevented any shards from falling into the bottle, but you can never be too careful."
        },
        {
          "headline":"Pour and enjoy!",
          "description":"Be sure to double check the glass of champagne for shards of glass. It’s also a good idea to locate the annulus and cork at this point. Be careful not to step on it, and only pick it up by the edge that isn’t broken."
        }
      ]
    }
  ],
  "text":" Setting Up Your Equipment and Space Understand the nature of glass champagne bottle. The key to opening a champagne bottle with a sword is the pressure in the bottle. Because of the way champagne is packaged, the carbon dioxide creates roughly 35 pounds of force pushing against the cork at all times. Glass is brittle. That means that it breaks instead of bending when it is damaged. Scoring the surface of the glass bottle will cause it to crack, and the force inside will cause the collar of the bottle and the cork to fly off. Buy several bottles of champagne. You will likely not get this right on the first try, so you will need backup bottles. This trick even works on cheap champagne though, so there’s no need to splurge on your practice bottles. Sparkling wine also works well. In general, French and Spanish champagne tends to come in thicker bottles than American champagne. It may also be more expensive. Thicker glass works better than thin, but if you’re operating on a budget, American champagne will also work. This trick typically takes half to a full a case to master. Plan on making at least a $30 investment to learn (6 x $5 bottles). Practice with inexpensive, corked sparkling wine. Note that some inexpensive bottles are cheaply made from inferior glass, which can lead to a higher rate of breakage and are therefore riskier to work with. Get a sword. It doesn’t have to be terribly sharp. Really, any sturdy knife will work. Of course, a sword is the most dramatic and flashy! The best knives and swords for sabrage are thick and sturdy. The sides should be as flat (parallel to each other) as possible. You may want to practice with a sturdy kitchen knife before investing in a fancy sword. Keep your eye out in thrift stores, yard sales, and estate sales, and you could find a sword for a reasonable price. You can find champagne swords made specifically for this purpose online. Chill the champagne. The colder the neck of the bottle is, the better. You may want to chill the neck in a bucket of ice water right before sabering. Be very careful not to shake the champagne. Don’t chill it in the freezer. You’ll ruin the flavor, and it could explode. Find an open space. Outside is best. This trick is going to create flying objects and spill champagne, so unless you are in an open indoor area like a gymnasium, outside is your best option. Some saberers have reported that the cork flies as far as twenty feet, so give yourself plenty of room. Be sure that the guests you are trying to impress with this trick have a safe haven away from flying corks. Prepare the bottle. Wipe away any moisture on the bottle. Remove the foil and wire basket from the top of the bottle. Keep your thumb over the cork as you do this. There is a chance that simply removing the wire will cause the cork to fly out. Holding the Bottle Locate one of the seams on the bottle. This is where the two halves of the bottle join together. It’s the weakest part of the bottle, so it’s where you’re going to focus your attention. Hold the bottle at a 30 degree angle with the seam facing upward. The cork should be higher than the bottom of the bottle. Be sure to point the cork in a direction where it will not hit anyone or anything. The angle doesn’t have to be very precise. Hold the bottle with your non-dominant hand. Grip the bottle firmly at the base. Put all of your fingers except your thumb beneath the bottle (on the opposite side from the seam) out of the way of the sword. The bottle should rest on your fingers while your thumb stabilizes it. Your sword will not come anywhere near the base, so your fingers will be safe down here. Put your thumb in the indentation at the bottom of the bottle. This will help you stabilize the bottle without putting your thumb in danger. Once your thumb is in place, practice holding your fingers closer together or farther apart. Choose the method of holding the bottle that feels both secure and safe. Sabering the Bottle Rest the blade of the sword on the neck of the bottle. The dull edge of the blade should face the cork. Hold the blade flat against the bottle. This trick also works if you use the sharp or cutting edge of the sword, but it can damage your sword. Using the cutting edge of a sword can also increase the chances that you don’t get a clean cut. Locate the annulus of the bottle. This is the ring around the top, which you will be aiming for with the back of the sword. Notice the point of the annulus where it connects with the seam of the bottle. This is the weakest point on the bottle. Practice sliding from the base of the bottle to the annulus. Before attempting this grand gesture, it will help for you to get a feel for the motion. You could also try putting the sword down and practicing the motion with just your hand. Slide the knife down the vertical seam and hit the annulus. Do this using a single firm, confident stroke. The bottle should break cleanly and the cork should go flying. If done correctly, the bottle will break cleanly. Make sure you follow through with the motion — that is, don't halt your arm when you hit the annulus. Continue moving your arm forward, following the trajectory of the cork. You will get the best, cleanest results by following the seam. If you don't use enough force or you pause, the trick won't work. If you find that your first attempt doesn’t work, you should go back to practicing. Be sure that you can move your hand (without the sword) quickly and assuredly. Inspect the neck of the glass for shards. Wipe it off carefully with a cloth if necessary. Be careful not to push shards of glass into the bottle. The pressure inside that sent the cork and top of the bottle flying will likely have prevented any shards from falling into the bottle, but you can never be too careful. Pour and enjoy! Be sure to double check the glass of champagne for shards of glass. It’s also a good idea to locate the annulus and cork at this point. Be careful not to step on it, and only pick it up by the edge that isn’t broken.",
  "sentences":[
    " Setting Up Your Equipment and Space Understand the nature of glass champagne bottle.",
    "The key to opening a champagne bottle with a sword is the pressure in the bottle.",
    "Because of the way champagne is packaged, the carbon dioxide creates roughly 35 pounds of force pushing against the cork at all times.",
    "Glass is brittle.",
    "That means that it breaks instead of bending when it is damaged.",
    "Scoring the surface of the glass bottle will cause it to crack, and the force inside will cause the collar of the bottle and the cork to fly off.",
    "Buy several bottles of champagne.",
    "You will likely not get this right on the first try, so you will need backup bottles.",
    "This trick even works on cheap champagne though, so there’s no need to splurge on your practice bottles.",
    "Sparkling wine also works well.",
    "In general, French and Spanish champagne tends to come in thicker bottles than American champagne.",
    "It may also be more expensive.",
    "Thicker glass works better than thin, but if you’re operating on a budget, American champagne will also work.",
    "This trick typically takes half to a full a case to master.",
    "Plan on making at least a $30 investment to learn (6 x $5 bottles).",
    "Practice with inexpensive, corked sparkling wine.",
    "Note that some inexpensive bottles are cheaply made from inferior glass, which can lead to a higher rate of breakage and are therefore riskier to work with.",
    "Get a sword.",
    "It doesn’t have to be terribly sharp.",
    "Really, any sturdy knife will work.",
    "Of course, a sword is the most dramatic and flashy!",
    "The best knives and swords for sabrage are thick and sturdy.",
    "The sides should be as flat (parallel to each other) as possible.",
    "You may want to practice with a sturdy kitchen knife before investing in a fancy sword.",
    "Keep your eye out in thrift stores, yard sales, and estate sales, and you could find a sword for a reasonable price.",
    "You can find champagne swords made specifically for this purpose online.",
    "Chill the champagne.",
    "The colder the neck of the bottle is, the better.",
    "You may want to chill the neck in a bucket of ice water right before sabering.",
    "Be very careful not to shake the champagne.",
    "Don’t chill it in the freezer.",
    "You’ll ruin the flavor, and it could explode.",
    "Find an open space.",
    "Outside is best.",
    "This trick is going to create flying objects and spill champagne, so unless you are in an open indoor area like a gymnasium, outside is your best option.",
    "Some saberers have reported that the cork flies as far as twenty feet, so give yourself plenty of room.",
    "Be sure that the guests you are trying to impress with this trick have a safe haven away from flying corks.",
    "Prepare the bottle.",
    "Wipe away any moisture on the bottle.",
    "Remove the foil and wire basket from the top of the bottle.",
    "Keep your thumb over the cork as you do this.",
    "There is a chance that simply removing the wire will cause the cork to fly out.",
    "Holding the Bottle Locate one of the seams on the bottle.",
    "This is where the two halves of the bottle join together.",
    "It’s the weakest part of the bottle, so it’s where you’re going to focus your attention.",
    "Hold the bottle at a 30 degree angle with the seam facing upward.",
    "The cork should be higher than the bottom of the bottle.",
    "Be sure to point the cork in a direction where it will not hit anyone or anything.",
    "The angle doesn’t have to be very precise.",
    "Hold the bottle with your non-dominant hand.",
    "Grip the bottle firmly at the base.",
    "Put all of your fingers except your thumb beneath the bottle (on the opposite side from the seam) out of the way of the sword.",
    "The bottle should rest on your fingers while your thumb stabilizes it.",
    "Your sword will not come anywhere near the base, so your fingers will be safe down here.",
    "Put your thumb in the indentation at the bottom of the bottle.",
    "This will help you stabilize the bottle without putting your thumb in danger.",
    "Once your thumb is in place, practice holding your fingers closer together or farther apart.",
    "Choose the method of holding the bottle that feels both secure and safe.",
    "Sabering the Bottle Rest the blade of the sword on the neck of the bottle.",
    "The dull edge of the blade should face the cork.",
    "Hold the blade flat against the bottle.",
    "This trick also works if you use the sharp or cutting edge of the sword, but it can damage your sword.",
    "Using the cutting edge of a sword can also increase the chances that you don’t get a clean cut.",
    "Locate the annulus of the bottle.",
    "This is the ring around the top, which you will be aiming for with the back of the sword.",
    "Notice the point of the annulus where it connects with the seam of the bottle.",
    "This is the weakest point on the bottle.",
    "Practice sliding from the base of the bottle to the annulus.",
    "Before attempting this grand gesture, it will help for you to get a feel for the motion.",
    "You could also try putting the sword down and practicing the motion with just your hand.",
    "Slide the knife down the vertical seam and hit the annulus.",
    "Do this using a single firm, confident stroke.",
    "The bottle should break cleanly and the cork should go flying.",
    "If done correctly, the bottle will break cleanly.",
    "Make sure you follow through with the motion — that is, don't halt your arm when you hit the annulus.",
    "Continue moving your arm forward, following the trajectory of the cork.",
    "You will get the best, cleanest results by following the seam.",
    "If you don't use enough force or you pause, the trick won't work.",
    "If you find that your first attempt doesn’t work, you should go back to practicing.",
    "Be sure that you can move your hand (without the sword) quickly and assuredly.",
    "Inspect the neck of the glass for shards.",
    "Wipe it off carefully with a cloth if necessary.",
    "Be careful not to push shards of glass into the bottle.",
    "The pressure inside that sent the cork and top of the bottle flying will likely have prevented any shards from falling into the bottle, but you can never be too careful.",
    "Pour and enjoy!",
    "Be sure to double check the glass of champagne for shards of glass.",
    "It’s also a good idea to locate the annulus and cork at this point.",
    "Be careful not to step on it, and only pick it up by the edge that isn’t broken."
  ],
  "tyn_section":[
    "A well-chilled bottle of champagne or sparkling wine sealed with a cork",
    "A large knife or sword that has a squared back edge",
    "Ample space to send the cork and bottleneck flying (about 20 feet)"
  ],
  "tyn_model":[
    "bottle",
    "sword",
    "champagne",
    "glass",
    "sparkling wine",
    "knife",
    "champagne bottle",
    "carbon dioxide",
    "glass bottle",
    "knives",
    "swords",
    "kitchen knife",
    "ice water",
    "freezer",
    "foil",
    "wire basket",
    "wire",
    "— that",
    "cloth"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}