{
  "title":"How to Install a Drainage System Around the Foundation of a House",
  "url":"https://www.wikihow.com/Install-a-Drainage-System-Around-the-Foundation-of-a-House",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Dig a trench around the perimeter of the foundation.",
      "description":"The trench will need to be dug down to the footers of the foundation and be about 4' wide. You will also need to dig a trench away from the foundation to either a percolation trench, dry well or to daylight if the slope of the land allows. (Percolation trench is also called an infiltration trench similar to the trench you have around the foundation. You will then add perforated pipe at the percolation trench. This is the best way to manage the run off. A dry well is either a pit filled with crushed stone or a structural camber. The easiest  way is running it to daylight if the building site has a steep enough slope)."
    },
    {
      "headline":"Lay the filter fabric.",
      "description":"Along the bottom of the trench, you will unroll the filter fabric, lapping the filter fabric up the sidewalls of the foundation. Smooth the remaining fabric away from the foundation."
    },
    {
      "headline":"Layer crushed stone and pipe.",
      "description":"Cover the filter fabric with a 3-4” layer of crushed stone. Now, install the 4” perforated pipe around the whole perimeter of the foundation. Perforated pipe can be installed on level ground. Use a solid 4” PVC tee to connect the ends of the perforated pipe. You will now connect the solid 4”PVC pipe to the tee, which will leads to a percolation trench, dry well or to daylight. Cover the pipe with crushed stone, 8-10” above the footing of the foundation. Then, pull the excess filter fabric over the crushed stone, making sure it laps against the foundation. It is important that the fabric completely cover the crushed stone, this will prevent the soil clogging the pipe."
    },
    {
      "headline":"Cover with gravel.",
      "description":"Fill with a minimum of 6” of gravel or coarse sand is recommended to prevent soil getting under the fabric and clogging the drainage system. Now back fill the trenches. The soil should  slop away from the foundation."
    },
    {
      "headline":"Landscape.",
      "description":"You have your drainage system almost completed. Lay a layer of filter fabric over the soil. Plant your favorite shrubs and cover filter fabric with bark mulch or pea stone. Not only will you have a dry basement, you will have lovely landscaping."
    }
  ],
  "text":" Dig a trench around the perimeter of the foundation. The trench will need to be dug down to the footers of the foundation and be about 4' wide. You will also need to dig a trench away from the foundation to either a percolation trench, dry well or to daylight if the slope of the land allows. (Percolation trench is also called an infiltration trench similar to the trench you have around the foundation. You will then add perforated pipe at the percolation trench. This is the best way to manage the run off. A dry well is either a pit filled with crushed stone or a structural camber. The easiest  way is running it to daylight if the building site has a steep enough slope). Lay the filter fabric. Along the bottom of the trench, you will unroll the filter fabric, lapping the filter fabric up the sidewalls of the foundation. Smooth the remaining fabric away from the foundation. Layer crushed stone and pipe. Cover the filter fabric with a 3-4” layer of crushed stone. Now, install the 4” perforated pipe around the whole perimeter of the foundation. Perforated pipe can be installed on level ground. Use a solid 4” PVC tee to connect the ends of the perforated pipe. You will now connect the solid 4”PVC pipe to the tee, which will leads to a percolation trench, dry well or to daylight. Cover the pipe with crushed stone, 8-10” above the footing of the foundation. Then, pull the excess filter fabric over the crushed stone, making sure it laps against the foundation. It is important that the fabric completely cover the crushed stone, this will prevent the soil clogging the pipe. Cover with gravel. Fill with a minimum of 6” of gravel or coarse sand is recommended to prevent soil getting under the fabric and clogging the drainage system. Now back fill the trenches. The soil should  slop away from the foundation. Landscape. You have your drainage system almost completed. Lay a layer of filter fabric over the soil. Plant your favorite shrubs and cover filter fabric with bark mulch or pea stone. Not only will you have a dry basement, you will have lovely landscaping.",
  "sentences":[
    " Dig a trench around the perimeter of the foundation.",
    "The trench will need to be dug down to the footers of the foundation and be about 4' wide.",
    "You will also need to dig a trench away from the foundation to either a percolation trench, dry well or to daylight if the slope of the land allows.",
    "(Percolation trench is also called an infiltration trench similar to the trench you have around the foundation.",
    "You will then add perforated pipe at the percolation trench.",
    "This is the best way to manage the run off.",
    "A dry well is either a pit filled with crushed stone or a structural camber.",
    "The easiest  way is running it to daylight if the building site has a steep enough slope).",
    "Lay the filter fabric.",
    "Along the bottom of the trench, you will unroll the filter fabric, lapping the filter fabric up the sidewalls of the foundation.",
    "Smooth the remaining fabric away from the foundation.",
    "Layer crushed stone and pipe.",
    "Cover the filter fabric with a 3-4” layer of crushed stone.",
    "Now, install the 4” perforated pipe around the whole perimeter of the foundation.",
    "Perforated pipe can be installed on level ground.",
    "Use a solid 4” PVC tee to connect the ends of the perforated pipe.",
    "You will now connect the solid 4”PVC pipe to the tee, which will leads to a percolation trench, dry well or to daylight.",
    "Cover the pipe with crushed stone, 8-10” above the footing of the foundation.",
    "Then, pull the excess filter fabric over the crushed stone, making sure it laps against the foundation.",
    "It is important that the fabric completely cover the crushed stone, this will prevent the soil clogging the pipe.",
    "Cover with gravel.",
    "Fill with a minimum of 6” of gravel or coarse sand is recommended to prevent soil getting under the fabric and clogging the drainage system.",
    "Now back fill the trenches.",
    "The soil should  slop away from the foundation.",
    "Landscape.",
    "You have your drainage system almost completed.",
    "Lay a layer of filter fabric over the soil.",
    "Plant your favorite shrubs and cover filter fabric with bark mulch or pea stone.",
    "Not only will you have a dry basement, you will have lovely landscaping."
  ],
  "tyn_section":[
    "6' filter fabric",
    "4” perforated pipe",
    "solid 4” PVC pipe",
    "sold 4” PVC tee",
    "gravel",
    "crushed stone",
    "Optional",
    "shrubs",
    "pea stone or bark mulch"
  ],
  "tyn_model":[
    "filter fabric",
    "crushed stone",
    "gravel",
    "perforated pipe",
    "pipe",
    "” layer",
    "” perforated",
    "” pvc",
    "” above",
    "fabric",
    "” of",
    "coarse sand",
    "soil",
    "bark mulch",
    "pea stone"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.1333333333,
    "f1":0.1666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4444444444,
    "p":0.2666666667,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.5333333333,
    "f1":0.5442176871
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4444444444,
    "p":0.2666666667,
    "f1":0.3333333333
  }
}