{
  "title":"How to Wash Bamboo Pillows",
  "url":"https://www.wikihow.com/Wash-Bamboo-Pillows",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms",
    "Bed Linen",
    "Pillows"
  ],
  "parts":[
    {
      "name":"Machine Washing the Cover",
      "steps":[
        {
          "headline":"Remove the cover from the pillow.",
          "description":"Pull the cover off of the bamboo pillow by grabbing the closed end of the cover and lifting it off. If the pillow cover or case has clips, buttons, or a zipper, be sure to undo them first so that the pillow can come out without tearing the cover. Check the cover and pillow for a care tag that may provide special instructions about cleaning and washing."
        },
        {
          "headline":"Add the cover to a load of laundry.",
          "description":"Put the cover in a washing machine with a load of lights or darks, depending on the color. If possible, wash the cover with a load of delicates, preferably other soft, bedding-like material. Make sure not to overfill the machine, or else it could tear the cover’s fabric."
        },
        {
          "headline":"Fill the machine with gentle detergent.",
          "description":"Add detergent wherever the machine’s instructions suggest. Use a delicate or gentle detergent to wash the cover, if possible, as harsh cleaners could damage the fabric. Check the detergent’s label to make sure you are using the right amount for the load size you are washing. If the care tag specified a certain kind of detergent, follow that guideline as best as you can."
        },
        {
          "headline":"Run the wash cycle on delicate or gentle, with cool or cold water.",
          "description":"Set the machine to cool or cold water and choose a cycle labelled as either “delicate” or “gentle” to make sure that the machine doesn’t wash to rapidly or vigorously, either of which could rip your pillowcase. Some cases are delicate enough that cold water will be too harsh, and hot is almost always too harsh. If you want to stay safe, use a cool, medium, or warm wash temperature, depending on the choices available to you. If the care tag specified a temperature, choose the one listed there."
        },
        {
          "headline":"Dry the cover in a machine dryer on a low heat, delicate cycle.",
          "description":"Toss the cover in the dryer with the load you washed it in and select the lowest heat possible. If your machine has an option for a delicate cycle, select that as well. If you want to stay extra safe, or if your pillowcase is starting to look worn, you can air dry the cover alongside the pillow."
        }
      ]
    },
    {
      "name":"Hand Washing the Bamboo Pillow",
      "steps":[
        {
          "headline":"Fill a tub or sink with warm water.",
          "description":"Choose your tub for washing the pillow if you don’t have a basin sink large enough to fit your pillow. A sink will be a better choice if you have one, since you will be able to stand up to wash. Stop the drain when the water heats up to a lukewarm temperature and fill the sink or tub around 1/2 to 3/4 full. If you have two taps, rather than just one that mixes hot and cold water, set both the cold and hot taps halfway."
        },
        {
          "headline":"Submerge your pillow in the water until it’s soaking wet.",
          "description":"Push the pillow under the water and move it around until the entire pillow is thoroughly wet, holding it under for no more than 30 to 45 seconds. The pillow should be soaked but not water logged, or else the soap won’t be able to soak in as easily."
        },
        {
          "headline":"Pour around 2 teaspoons (9.9 mL) to 3 teaspoons (15 mL) of detergent on the pillow.",
          "description":"Use a gentle or delicate detergent if possible. You can use either a machine detergent or a specially formulated hand-washing detergent on the pillows. Pour the detergent directly onto the surface of the pillow as you hold the pillow above the water so that the soap can sink directly into the inside material."
        },
        {
          "headline":"Rub the detergent all over the surface of the pillow.",
          "description":"Spread the detergent all around with your fingers, making sure to get every side. Then, use your fingers to gently massage the detergent into all sides of the pillow. Be sure to wear gloves if the detergent labels warns against letting the solution touch your skin. If you need more detergent to get the whole surface clean, only add a few drops as needed."
        },
        {
          "headline":"Squeeze the detergent into the pillow to clean the inside.",
          "description":"Dip the pillow back in the water to help the soap sink into the pillow. Then, squeeze the pillow like a sponge to work the detergent through the whole pillow. Try to squeeze every area you can at least once or twice. Don’t wring out the water, just try to work the detergent through the pillow."
        }
      ]
    },
    {
      "name":"Rinsing and Drying the Bamboo Pillow",
      "steps":[
        {
          "headline":"Wring the soap out of the pillow before beginning to rinse the pillow.",
          "description":"Before rinsing and air drying the pillow, it’s important to wring out most of the remaining liquid and soap. The pillow doesn’t have to feel dry, but it should no longer feel heavy after you have finished wringing. You can twist the pillow like a towel to help remove the water, but do it gently so you don’t damage the foam inside."
        },
        {
          "headline":"Rinse the pillow under the tap for 10 to 20 seconds.",
          "description":"The moving water will help rinse off the surface of the pillow to avoid any soap residue. You can just move the pillow around under the tap, spinning it to make sure you rinse off every side. If the pillow still feels soapy, rinse it off until the pillow no longer has a soapy texture by stopping to check every 10 to 20 seconds."
        },
        {
          "headline":"Hang the pillow on a clothesline in the sun.",
          "description":"There are special pillow hangers that wrap around the body of the pillow that you can use to hang them from a clothesline. You simply place the pillow between the two sides of the hanger and clasp them together with one hook around the other. Only hang the pillow up to dry if it is not raining outdoors and the humidity is relatively low, or else the pillow may grow mildew. You can also just clip the pillow with clothespins, although the weight of the pillow may pull it down if the clips are weak."
        },
        {
          "headline":"Set the pillow on a white towel indoors or outdoors.",
          "description":"If you don’t have access to a special pillow hanger or a clothesline, you can just place the wet pillow on a towel that has no colored dyes or fabric. The towel can be inside or outside, so long as it is dry and not particularly humid. You will need to turn the pillow over a few times as it dries to make sure both sides dry evenly."
        },
        {
          "headline":"Let the pillow air dry until it is completely dry.",
          "description":"Whichever drying method you chose, let the pillow air dry for 3 to 4 hours, or until it is dry all the way through. Check that you don’t feel any wet or damp spots before putting the cover back on and using it to sleep on. Even a tiny bit of moisture can lead to mildew the next time you sleep on it."
        }
      ]
    }
  ],
  "text":" Machine Washing the Cover Remove the cover from the pillow. Pull the cover off of the bamboo pillow by grabbing the closed end of the cover and lifting it off. If the pillow cover or case has clips, buttons, or a zipper, be sure to undo them first so that the pillow can come out without tearing the cover. Check the cover and pillow for a care tag that may provide special instructions about cleaning and washing. Add the cover to a load of laundry. Put the cover in a washing machine with a load of lights or darks, depending on the color. If possible, wash the cover with a load of delicates, preferably other soft, bedding-like material. Make sure not to overfill the machine, or else it could tear the cover’s fabric. Fill the machine with gentle detergent. Add detergent wherever the machine’s instructions suggest. Use a delicate or gentle detergent to wash the cover, if possible, as harsh cleaners could damage the fabric. Check the detergent’s label to make sure you are using the right amount for the load size you are washing. If the care tag specified a certain kind of detergent, follow that guideline as best as you can. Run the wash cycle on delicate or gentle, with cool or cold water. Set the machine to cool or cold water and choose a cycle labelled as either “delicate” or “gentle” to make sure that the machine doesn’t wash to rapidly or vigorously, either of which could rip your pillowcase. Some cases are delicate enough that cold water will be too harsh, and hot is almost always too harsh. If you want to stay safe, use a cool, medium, or warm wash temperature, depending on the choices available to you. If the care tag specified a temperature, choose the one listed there. Dry the cover in a machine dryer on a low heat, delicate cycle. Toss the cover in the dryer with the load you washed it in and select the lowest heat possible. If your machine has an option for a delicate cycle, select that as well. If you want to stay extra safe, or if your pillowcase is starting to look worn, you can air dry the cover alongside the pillow. Hand Washing the Bamboo Pillow Fill a tub or sink with warm water. Choose your tub for washing the pillow if you don’t have a basin sink large enough to fit your pillow. A sink will be a better choice if you have one, since you will be able to stand up to wash. Stop the drain when the water heats up to a lukewarm temperature and fill the sink or tub around 1/2 to 3/4 full. If you have two taps, rather than just one that mixes hot and cold water, set both the cold and hot taps halfway. Submerge your pillow in the water until it’s soaking wet. Push the pillow under the water and move it around until the entire pillow is thoroughly wet, holding it under for no more than 30 to 45 seconds. The pillow should be soaked but not water logged, or else the soap won’t be able to soak in as easily. Pour around 2 teaspoons (9.9 mL) to 3 teaspoons (15 mL) of detergent on the pillow. Use a gentle or delicate detergent if possible. You can use either a machine detergent or a specially formulated hand-washing detergent on the pillows. Pour the detergent directly onto the surface of the pillow as you hold the pillow above the water so that the soap can sink directly into the inside material. Rub the detergent all over the surface of the pillow. Spread the detergent all around with your fingers, making sure to get every side. Then, use your fingers to gently massage the detergent into all sides of the pillow. Be sure to wear gloves if the detergent labels warns against letting the solution touch your skin. If you need more detergent to get the whole surface clean, only add a few drops as needed. Squeeze the detergent into the pillow to clean the inside. Dip the pillow back in the water to help the soap sink into the pillow. Then, squeeze the pillow like a sponge to work the detergent through the whole pillow. Try to squeeze every area you can at least once or twice. Don’t wring out the water, just try to work the detergent through the pillow. Rinsing and Drying the Bamboo Pillow Wring the soap out of the pillow before beginning to rinse the pillow. Before rinsing and air drying the pillow, it’s important to wring out most of the remaining liquid and soap. The pillow doesn’t have to feel dry, but it should no longer feel heavy after you have finished wringing. You can twist the pillow like a towel to help remove the water, but do it gently so you don’t damage the foam inside. Rinse the pillow under the tap for 10 to 20 seconds. The moving water will help rinse off the surface of the pillow to avoid any soap residue. You can just move the pillow around under the tap, spinning it to make sure you rinse off every side. If the pillow still feels soapy, rinse it off until the pillow no longer has a soapy texture by stopping to check every 10 to 20 seconds. Hang the pillow on a clothesline in the sun. There are special pillow hangers that wrap around the body of the pillow that you can use to hang them from a clothesline. You simply place the pillow between the two sides of the hanger and clasp them together with one hook around the other. Only hang the pillow up to dry if it is not raining outdoors and the humidity is relatively low, or else the pillow may grow mildew. You can also just clip the pillow with clothespins, although the weight of the pillow may pull it down if the clips are weak. Set the pillow on a white towel indoors or outdoors. If you don’t have access to a special pillow hanger or a clothesline, you can just place the wet pillow on a towel that has no colored dyes or fabric. The towel can be inside or outside, so long as it is dry and not particularly humid. You will need to turn the pillow over a few times as it dries to make sure both sides dry evenly. Let the pillow air dry until it is completely dry. Whichever drying method you chose, let the pillow air dry for 3 to 4 hours, or until it is dry all the way through. Check that you don’t feel any wet or damp spots before putting the cover back on and using it to sleep on. Even a tiny bit of moisture can lead to mildew the next time you sleep on it.",
  "sentences":[
    " Machine Washing the Cover Remove the cover from the pillow.",
    "Pull the cover off of the bamboo pillow by grabbing the closed end of the cover and lifting it off.",
    "If the pillow cover or case has clips, buttons, or a zipper, be sure to undo them first so that the pillow can come out without tearing the cover.",
    "Check the cover and pillow for a care tag that may provide special instructions about cleaning and washing.",
    "Add the cover to a load of laundry.",
    "Put the cover in a washing machine with a load of lights or darks, depending on the color.",
    "If possible, wash the cover with a load of delicates, preferably other soft, bedding-like material.",
    "Make sure not to overfill the machine, or else it could tear the cover’s fabric.",
    "Fill the machine with gentle detergent.",
    "Add detergent wherever the machine’s instructions suggest.",
    "Use a delicate or gentle detergent to wash the cover, if possible, as harsh cleaners could damage the fabric.",
    "Check the detergent’s label to make sure you are using the right amount for the load size you are washing.",
    "If the care tag specified a certain kind of detergent, follow that guideline as best as you can.",
    "Run the wash cycle on delicate or gentle, with cool or cold water.",
    "Set the machine to cool or cold water and choose a cycle labelled as either “delicate” or “gentle” to make sure that the machine doesn’t wash to rapidly or vigorously, either of which could rip your pillowcase.",
    "Some cases are delicate enough that cold water will be too harsh, and hot is almost always too harsh.",
    "If you want to stay safe, use a cool, medium, or warm wash temperature, depending on the choices available to you.",
    "If the care tag specified a temperature, choose the one listed there.",
    "Dry the cover in a machine dryer on a low heat, delicate cycle.",
    "Toss the cover in the dryer with the load you washed it in and select the lowest heat possible.",
    "If your machine has an option for a delicate cycle, select that as well.",
    "If you want to stay extra safe, or if your pillowcase is starting to look worn, you can air dry the cover alongside the pillow.",
    "Hand Washing the Bamboo Pillow Fill a tub or sink with warm water.",
    "Choose your tub for washing the pillow if you don’t have a basin sink large enough to fit your pillow.",
    "A sink will be a better choice if you have one, since you will be able to stand up to wash. Stop the drain when the water heats up to a lukewarm temperature and fill the sink or tub around 1/2 to 3/4 full.",
    "If you have two taps, rather than just one that mixes hot and cold water, set both the cold and hot taps halfway.",
    "Submerge your pillow in the water until it’s soaking wet.",
    "Push the pillow under the water and move it around until the entire pillow is thoroughly wet, holding it under for no more than 30 to 45 seconds.",
    "The pillow should be soaked but not water logged, or else the soap won’t be able to soak in as easily.",
    "Pour around 2 teaspoons (9.9 mL) to 3 teaspoons (15 mL) of detergent on the pillow.",
    "Use a gentle or delicate detergent if possible.",
    "You can use either a machine detergent or a specially formulated hand-washing detergent on the pillows.",
    "Pour the detergent directly onto the surface of the pillow as you hold the pillow above the water so that the soap can sink directly into the inside material.",
    "Rub the detergent all over the surface of the pillow.",
    "Spread the detergent all around with your fingers, making sure to get every side.",
    "Then, use your fingers to gently massage the detergent into all sides of the pillow.",
    "Be sure to wear gloves if the detergent labels warns against letting the solution touch your skin.",
    "If you need more detergent to get the whole surface clean, only add a few drops as needed.",
    "Squeeze the detergent into the pillow to clean the inside.",
    "Dip the pillow back in the water to help the soap sink into the pillow.",
    "Then, squeeze the pillow like a sponge to work the detergent through the whole pillow.",
    "Try to squeeze every area you can at least once or twice.",
    "Don’t wring out the water, just try to work the detergent through the pillow.",
    "Rinsing and Drying the Bamboo Pillow Wring the soap out of the pillow before beginning to rinse the pillow.",
    "Before rinsing and air drying the pillow, it’s important to wring out most of the remaining liquid and soap.",
    "The pillow doesn’t have to feel dry, but it should no longer feel heavy after you have finished wringing.",
    "You can twist the pillow like a towel to help remove the water, but do it gently so you don’t damage the foam inside.",
    "Rinse the pillow under the tap for 10 to 20 seconds.",
    "The moving water will help rinse off the surface of the pillow to avoid any soap residue.",
    "You can just move the pillow around under the tap, spinning it to make sure you rinse off every side.",
    "If the pillow still feels soapy, rinse it off until the pillow no longer has a soapy texture by stopping to check every 10 to 20 seconds.",
    "Hang the pillow on a clothesline in the sun.",
    "There are special pillow hangers that wrap around the body of the pillow that you can use to hang them from a clothesline.",
    "You simply place the pillow between the two sides of the hanger and clasp them together with one hook around the other.",
    "Only hang the pillow up to dry if it is not raining outdoors and the humidity is relatively low, or else the pillow may grow mildew.",
    "You can also just clip the pillow with clothespins, although the weight of the pillow may pull it down if the clips are weak.",
    "Set the pillow on a white towel indoors or outdoors.",
    "If you don’t have access to a special pillow hanger or a clothesline, you can just place the wet pillow on a towel that has no colored dyes or fabric.",
    "The towel can be inside or outside, so long as it is dry and not particularly humid.",
    "You will need to turn the pillow over a few times as it dries to make sure both sides dry evenly.",
    "Let the pillow air dry until it is completely dry.",
    "Whichever drying method you chose, let the pillow air dry for 3 to 4 hours, or until it is dry all the way through.",
    "Check that you don’t feel any wet or damp spots before putting the cover back on and using it to sleep on.",
    "Even a tiny bit of moisture can lead to mildew the next time you sleep on it."
  ],
  "tyn_section":[
    "Washing machine",
    "Machine dryer",
    "Gentle detergent",
    "Basin sink or tub",
    "Clothesline or white towel"
  ],
  "tyn_model":[
    "pillow",
    "water",
    "detergent",
    "soap",
    "tub",
    "towel",
    "bamboo pillow",
    "pillow cover",
    "washing machine",
    "gentle detergent",
    "“delicate",
    "” or",
    "“gentle",
    "” to",
    "machine dryer",
    "dryer",
    "sink",
    "tap",
    "pillow hangers",
    "clothespins",
    "pillow hanger",
    "cover"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.1363636364,
    "f1":0.2222222222,
    "avg_pos":0.3636363636
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.2272727273,
    "f1":0.3296703297
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.2272727273,
    "f1":0.3296703297
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.1363636364,
    "f1":0.2222222222
  }
}