{
  "title":"How to Cook Halibut",
  "url":"https://www.wikihow.com/Cook-Halibut",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Choose halibut steaks that are fresh in appearance.",
          "description":"The flesh should be a translucent, white and shiny. It should spring back when you press it. Avoid steaks that look mottled, discolored, or dull."
        },
        {
          "headline":"Keep the fish moist.",
          "description":"Halibut is naturally low in fat, so it can dry out quickly during the cooking process. To prevent this, brush both sides with oil or melted butter before cooking halibut. You can also marinate the fish in oil or a flavored prepared marinade for a few hours before you cook it."
        },
        {
          "headline":"Limit how much you handle the fish.",
          "description":"Only turn the fish when it is halfway done. This will help keep it from breaking apart and will help ensure even cooking throughout the fillet. Turn the halibut over using a wide spatula or turner to make sure you flip the whole fillet."
        },
        {
          "headline":"Season in moderation.",
          "description":"The flavor of halibut is delicate and light, so it's important to avoid over-seasoning the fish and losing its natural flavor. Avoid heavy spices or thick sauces. Instead, choose a light sauce or marinade to complement the flavor of the fish."
        }
      ]
    },
    {
      "name":"Broiled or Grilled Halibut",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"You only need a few simple ingredients to make a healthy and delicious broiled or grilled halibut. Here's what you need:\nHalibut steaks\nOlive oil or melted butter\nMinced garlic\nSalt and pepper\nLemon wedges"
        },
        {
          "headline":"Marinade overnight if desired.",
          "description":""
        },
        {
          "headline":"Turn on the broiler to heat your oven.",
          "description":"If you're grilling your halibut, light your grill. Make sure it is heated evenly before proceeding."
        },
        {
          "headline":"Place the halibut steaks skin side down in a glass or metal baking pan.",
          "description":"If you're using a grill, place them directly on the grill."
        },
        {
          "headline":"Brush the steaks with olive oil or melted butter.",
          "description":"If you wish, top the butter with a teaspoon or two of minced garlic."
        },
        {
          "headline":"Sprinkle the halibut with salt and pepper.",
          "description":""
        },
        {
          "headline":"Broil halibut for about 10 minutes.",
          "description":"Test it with a fork for doneness. Serve garnished with a lemon wedge. Cooked halibut will flake away from the fork easily, while undercooked halibut will still feel solid and fleshy. Cook halibut without drying it out by watching the cooking time carefully. Grilled halibut should be cooked for no more than 10 minutes per inch thick."
        },
        {
          "headline":"Finished!",
          "description":""
        }
      ]
    },
    {
      "name":"Halibut Ceviche",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"You only need a few ingredients to make halibut ceviche. The best part is that you don't have to cook it in the traditional sense. Here's what you'll need:\nOne pound halibut, chopped into 1/2-inch cubes\n1 teaspoon salt\n3 Tablespoons lime juice\n2 ripe avocados, peeled, pitted and diced\n1/2 cup diced tomatillos\n1/4 cup diced onion\n1 jalapeño, stemmed, seeded, and finely chopped\n2 Tablespoons olive oil"
        },
        {
          "headline":"Place halibut cubes in a medium bowl.",
          "description":""
        },
        {
          "headline":"Coat with salt.",
          "description":"Toss the pieces to be sure they are evenly coated."
        },
        {
          "headline":"Pour the lime juice over the fish.",
          "description":"Toss to make sure they are evenly coated."
        },
        {
          "headline":"Allow the fish to marinate.",
          "description":"After about 30 minutes, the flesh should be opaque. If the flesh is still translucent, allow to marinate for another 15 minutes."
        },
        {
          "headline":"Add avocados, tomatillo, onion, jalapeño and olive oil.",
          "description":"Toss the mixture so the ingredients are evenly distributed."
        },
        {
          "headline":"Serve with tortilla chips.",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Choose halibut steaks that are fresh in appearance. The flesh should be a translucent, white and shiny. It should spring back when you press it. Avoid steaks that look mottled, discolored, or dull. Keep the fish moist. Halibut is naturally low in fat, so it can dry out quickly during the cooking process. To prevent this, brush both sides with oil or melted butter before cooking halibut. You can also marinate the fish in oil or a flavored prepared marinade for a few hours before you cook it. Limit how much you handle the fish. Only turn the fish when it is halfway done. This will help keep it from breaking apart and will help ensure even cooking throughout the fillet. Turn the halibut over using a wide spatula or turner to make sure you flip the whole fillet. Season in moderation. The flavor of halibut is delicate and light, so it's important to avoid over-seasoning the fish and losing its natural flavor. Avoid heavy spices or thick sauces. Instead, choose a light sauce or marinade to complement the flavor of the fish. Broiled or Grilled Halibut Gather your ingredients. You only need a few simple ingredients to make a healthy and delicious broiled or grilled halibut. Here's what you need:\nHalibut steaks\nOlive oil or melted butter\nMinced garlic\nSalt and pepper\nLemon wedges Marinade overnight if desired.  Turn on the broiler to heat your oven. If you're grilling your halibut, light your grill. Make sure it is heated evenly before proceeding. Place the halibut steaks skin side down in a glass or metal baking pan. If you're using a grill, place them directly on the grill. Brush the steaks with olive oil or melted butter. If you wish, top the butter with a teaspoon or two of minced garlic. Sprinkle the halibut with salt and pepper.  Broil halibut for about 10 minutes. Test it with a fork for doneness. Serve garnished with a lemon wedge. Cooked halibut will flake away from the fork easily, while undercooked halibut will still feel solid and fleshy. Cook halibut without drying it out by watching the cooking time carefully. Grilled halibut should be cooked for no more than 10 minutes per inch thick. Finished!  Halibut Ceviche Gather your ingredients. You only need a few ingredients to make halibut ceviche. The best part is that you don't have to cook it in the traditional sense. Here's what you'll need:\nOne pound halibut, chopped into 1/2-inch cubes\n1 teaspoon salt\n3 Tablespoons lime juice\n2 ripe avocados, peeled, pitted and diced\n1/2 cup diced tomatillos\n1/4 cup diced onion\n1 jalapeño, stemmed, seeded, and finely chopped\n2 Tablespoons olive oil Place halibut cubes in a medium bowl.  Coat with salt. Toss the pieces to be sure they are evenly coated. Pour the lime juice over the fish. Toss to make sure they are evenly coated. Allow the fish to marinate. After about 30 minutes, the flesh should be opaque. If the flesh is still translucent, allow to marinate for another 15 minutes. Add avocados, tomatillo, onion, jalapeño and olive oil. Toss the mixture so the ingredients are evenly distributed. Serve with tortilla chips. ",
  "sentences":[
    " Steps Choose halibut steaks that are fresh in appearance.",
    "The flesh should be a translucent, white and shiny.",
    "It should spring back when you press it.",
    "Avoid steaks that look mottled, discolored, or dull.",
    "Keep the fish moist.",
    "Halibut is naturally low in fat, so it can dry out quickly during the cooking process.",
    "To prevent this, brush both sides with oil or melted butter before cooking halibut.",
    "You can also marinate the fish in oil or a flavored prepared marinade for a few hours before you cook it.",
    "Limit how much you handle the fish.",
    "Only turn the fish when it is halfway done.",
    "This will help keep it from breaking apart and will help ensure even cooking throughout the fillet.",
    "Turn the halibut over using a wide spatula or turner to make sure you flip the whole fillet.",
    "Season in moderation.",
    "The flavor of halibut is delicate and light, so it's important to avoid over-seasoning the fish and losing its natural flavor.",
    "Avoid heavy spices or thick sauces.",
    "Instead, choose a light sauce or marinade to complement the flavor of the fish.",
    "Broiled or Grilled Halibut Gather your ingredients.",
    "You only need a few simple ingredients to make a healthy and delicious broiled or grilled halibut.",
    "Here's what you need:\nHalibut steaks\nOlive oil or melted butter\nMinced garlic\nSalt and pepper\nLemon wedges Marinade overnight if desired.",
    "Turn on the broiler to heat your oven.",
    "If you're grilling your halibut, light your grill.",
    "Make sure it is heated evenly before proceeding.",
    "Place the halibut steaks skin side down in a glass or metal baking pan.",
    "If you're using a grill, place them directly on the grill.",
    "Brush the steaks with olive oil or melted butter.",
    "If you wish, top the butter with a teaspoon or two of minced garlic.",
    "Sprinkle the halibut with salt and pepper.",
    "Broil halibut for about 10 minutes.",
    "Test it with a fork for doneness.",
    "Serve garnished with a lemon wedge.",
    "Cooked halibut will flake away from the fork easily, while undercooked halibut will still feel solid and fleshy.",
    "Cook halibut without drying it out by watching the cooking time carefully.",
    "Grilled halibut should be cooked for no more than 10 minutes per inch thick.",
    "Finished!",
    "Halibut Ceviche Gather your ingredients.",
    "You only need a few ingredients to make halibut ceviche.",
    "The best part is that you don't have to cook it in the traditional sense.",
    "Here's what you'll need:\nOne pound halibut, chopped into 1/2-inch cubes\n1 teaspoon salt\n3 Tablespoons lime juice\n2 ripe avocados, peeled, pitted and diced\n1/2 cup diced tomatillos\n1/4 cup diced onion\n1 jalapeño, stemmed, seeded, and finely chopped\n2 Tablespoons olive oil Place halibut cubes in a medium bowl.",
    "Coat with salt.",
    "Toss the pieces to be sure they are evenly coated.",
    "Pour the lime juice over the fish.",
    "Toss to make sure they are evenly coated.",
    "Allow the fish to marinate.",
    "After about 30 minutes, the flesh should be opaque.",
    "If the flesh is still translucent, allow to marinate for another 15 minutes.",
    "Add avocados, tomatillo, onion, jalapeño and olive oil.",
    "Toss the mixture so the ingredients are evenly distributed.",
    "Serve with tortilla chips."
  ],
  "tyn_section":[
    "Ingredients listed above",
    "Glass or metal baking pan",
    "Wide spatula or turner",
    "Grill or broiler"
  ],
  "tyn_model":[
    "halibut",
    "butter",
    "olive oil",
    "salt",
    "grill",
    "oil",
    "garlic",
    "fork",
    "halibut ceviche",
    "avocados",
    "onion",
    "jalapeño",
    "halibut steaks",
    "spatula",
    "spices",
    "broiler",
    "oven",
    "salt and pepper",
    "lemon",
    "lime juice",
    "tomatillos",
    "medium bowl",
    "lime",
    "tomatillo",
    "tortilla chips"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.08,
    "f1":0.1212121212
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}