{
  "title":"How to Paint a Watercolor of a Halloween Cat",
  "url":"https://www.wikihow.com/Paint-a-Watercolor-of-a-Halloween-Cat",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "parts":[
    {
      "name":"Preparing",
      "steps":[
        {
          "headline":"Draw a happy-go-lucky kitty.",
          "description":"Look at a common, everyday cat. Most of the time they are sweet, docile and charming. Draw one or enlarge the one above, and trace and color it. This will give you an opportunity to contrast an ordinary cat with a scary Halloween cat."
        },
        {
          "headline":"Discuss the colors of Halloween.",
          "description":"Night is the scariest time at Halloween, in actuality as well as on paper. In art, in order to make sense of a dark scene, other colors must be included as contrast; purple, dark green, violet, rust and brown. Ideally, a Halloween scene at night will be dimly lit, perhaps only by a lantern, bonfire, flashlight, street light or a full moon. The overall effect should be frightening."
        },
        {
          "headline":"Think about and discuss the cats of Halloween.",
          "description":"Talk about how a sleek, purring, complacent creature can morph into a frightening demon if only for a day."
        },
        {
          "headline":"Draw a Halloween cat.",
          "description":"The back is arched, the tail stands straight up, the ears are back or flat and the fur stands on end. Focus your thoughts on the Halloween cat. If you prefer, enlarge and trace one or more of these Halloween cats."
        },
        {
          "headline":"Draw your cat on watercolor paper.",
          "description":"Use a pencil. Draw it large enough to fill the entire center of your paper. Include the eyes."
        },
        {
          "headline":"Prepare your watercolors and assemble your brushes.",
          "description":"Put drops of water on each of the pads of color in your set to active them. If using tube watercolors, squeeze out a tiny amount of each color on a palette or white plastic or china plate. You will need a round, pointed brush, and a ½ inch flat brush."
        },
        {
          "headline":"Get a container of water and cover your workspace with old newspapers or a plastic table cloth.",
          "description":""
        }
      ]
    },
    {
      "name":"Painting",
      "steps":[
        {
          "headline":"Prepare the eyes of the cat first.",
          "description":"The idea is to save the white of your paper where the eyes will be. This will enable you to get a bright, intense eye color. Wet the entire cat shape with clean water leaving the two spots for the eyes dry. Even better, if desired, save the white of the paper by masking out the eyes with spots of masking or painter’s tape. Draw eye shapes on a piece of tape, cut or tear them out and apply them to the paper, rubbing to make sure they stick."
        },
        {
          "headline":"Paint the cat with clear water first.",
          "description":"Use a small brush to get in all the areas, keeping the water just inside the outline of the cat. Give it a minute or two to soak into the paper."
        },
        {
          "headline":"Fully load your brush with any of the colors in your paint set.",
          "description":"Drop in the color by touching the end of the full brush into the wet area of the cat. The water will pull the paint from your brush. Follow quickly by repeating with another color. Do not stir or mix, let the water carry the paint and it will do the mixing for you. Help it along, if necessary, by gently tilting your paper to move the water and  mix the colors. Repeat as many times as you wish with any color you wish."
        },
        {
          "headline":"Help the paint along if necessary.",
          "description":"If you fail to get the desired darkness of the cat by using a mixture of colors, give it time to work. You might be surprised, if you have dropped in many colors that you have created an interesting dark shade or even black by the various colors cancelling each other out and producing a new color. Or, if you wish to go darker, use the black in your paint box. Use a small pointed brush to coax the paint from the main shape into tiny spaces and crevices. Once completed, let it dry without mixing or stirring. You can always choose an easier method. Just paint the cat using the black in your paintbox. No need to wet it first. Just let it dry before moving ahead with your painting."
        },
        {
          "headline":"Create the cat’s eyes.",
          "description":"Unmask the eyes and use green, yellow, or a combination to paint them. Add a layer of sparkly glitter glue over the eyes after they have dried."
        },
        {
          "headline":"Scratch out the whiskers and mouth.",
          "description":"Alternatively, you could use white-out to draw them. Scrub out a circle for the mouth with a small brush, dab with tissue and allow to dry."
        },
        {
          "headline":"Paint the background.",
          "description":"Any number of things can be put in to finish this picture. Use your imagination. Put the cat on a fence, in the doorway of a spooky house, standing in the grass, or on a hay bale, for example. Use dark, rich colors."
        },
        {
          "headline":"Finish it up.",
          "description":"Paint the moon or other light source. Allow the entire painting to dry again. With a fine line marker or Sharpie outline everything and add spiky standing up hair all around the cat."
        }
      ]
    }
  ],
  "text":" Preparing Draw a happy-go-lucky kitty. Look at a common, everyday cat. Most of the time they are sweet, docile and charming. Draw one or enlarge the one above, and trace and color it. This will give you an opportunity to contrast an ordinary cat with a scary Halloween cat. Discuss the colors of Halloween. Night is the scariest time at Halloween, in actuality as well as on paper. In art, in order to make sense of a dark scene, other colors must be included as contrast; purple, dark green, violet, rust and brown. Ideally, a Halloween scene at night will be dimly lit, perhaps only by a lantern, bonfire, flashlight, street light or a full moon. The overall effect should be frightening. Think about and discuss the cats of Halloween. Talk about how a sleek, purring, complacent creature can morph into a frightening demon if only for a day. Draw a Halloween cat. The back is arched, the tail stands straight up, the ears are back or flat and the fur stands on end. Focus your thoughts on the Halloween cat. If you prefer, enlarge and trace one or more of these Halloween cats. Draw your cat on watercolor paper. Use a pencil. Draw it large enough to fill the entire center of your paper. Include the eyes. Prepare your watercolors and assemble your brushes. Put drops of water on each of the pads of color in your set to active them. If using tube watercolors, squeeze out a tiny amount of each color on a palette or white plastic or china plate. You will need a round, pointed brush, and a ½ inch flat brush. Get a container of water and cover your workspace with old newspapers or a plastic table cloth.  Painting Prepare the eyes of the cat first. The idea is to save the white of your paper where the eyes will be. This will enable you to get a bright, intense eye color. Wet the entire cat shape with clean water leaving the two spots for the eyes dry. Even better, if desired, save the white of the paper by masking out the eyes with spots of masking or painter’s tape. Draw eye shapes on a piece of tape, cut or tear them out and apply them to the paper, rubbing to make sure they stick. Paint the cat with clear water first. Use a small brush to get in all the areas, keeping the water just inside the outline of the cat. Give it a minute or two to soak into the paper. Fully load your brush with any of the colors in your paint set. Drop in the color by touching the end of the full brush into the wet area of the cat. The water will pull the paint from your brush. Follow quickly by repeating with another color. Do not stir or mix, let the water carry the paint and it will do the mixing for you. Help it along, if necessary, by gently tilting your paper to move the water and  mix the colors. Repeat as many times as you wish with any color you wish. Help the paint along if necessary. If you fail to get the desired darkness of the cat by using a mixture of colors, give it time to work. You might be surprised, if you have dropped in many colors that you have created an interesting dark shade or even black by the various colors cancelling each other out and producing a new color. Or, if you wish to go darker, use the black in your paint box. Use a small pointed brush to coax the paint from the main shape into tiny spaces and crevices. Once completed, let it dry without mixing or stirring. You can always choose an easier method. Just paint the cat using the black in your paintbox. No need to wet it first. Just let it dry before moving ahead with your painting. Create the cat’s eyes. Unmask the eyes and use green, yellow, or a combination to paint them. Add a layer of sparkly glitter glue over the eyes after they have dried. Scratch out the whiskers and mouth. Alternatively, you could use white-out to draw them. Scrub out a circle for the mouth with a small brush, dab with tissue and allow to dry. Paint the background. Any number of things can be put in to finish this picture. Use your imagination. Put the cat on a fence, in the doorway of a spooky house, standing in the grass, or on a hay bale, for example. Use dark, rich colors. Finish it up. Paint the moon or other light source. Allow the entire painting to dry again. With a fine line marker or Sharpie outline everything and add spiky standing up hair all around the cat.",
  "sentences":[
    " Preparing Draw a happy-go-lucky kitty.",
    "Look at a common, everyday cat.",
    "Most of the time they are sweet, docile and charming.",
    "Draw one or enlarge the one above, and trace and color it.",
    "This will give you an opportunity to contrast an ordinary cat with a scary Halloween cat.",
    "Discuss the colors of Halloween.",
    "Night is the scariest time at Halloween, in actuality as well as on paper.",
    "In art, in order to make sense of a dark scene, other colors must be included as contrast; purple, dark green, violet, rust and brown.",
    "Ideally, a Halloween scene at night will be dimly lit, perhaps only by a lantern, bonfire, flashlight, street light or a full moon.",
    "The overall effect should be frightening.",
    "Think about and discuss the cats of Halloween.",
    "Talk about how a sleek, purring, complacent creature can morph into a frightening demon if only for a day.",
    "Draw a Halloween cat.",
    "The back is arched, the tail stands straight up, the ears are back or flat and the fur stands on end.",
    "Focus your thoughts on the Halloween cat.",
    "If you prefer, enlarge and trace one or more of these Halloween cats.",
    "Draw your cat on watercolor paper.",
    "Use a pencil.",
    "Draw it large enough to fill the entire center of your paper.",
    "Include the eyes.",
    "Prepare your watercolors and assemble your brushes.",
    "Put drops of water on each of the pads of color in your set to active them.",
    "If using tube watercolors, squeeze out a tiny amount of each color on a palette or white plastic or china plate.",
    "You will need a round, pointed brush, and a ½ inch flat brush.",
    "Get a container of water and cover your workspace with old newspapers or a plastic table cloth.",
    "Painting Prepare the eyes of the cat first.",
    "The idea is to save the white of your paper where the eyes will be.",
    "This will enable you to get a bright, intense eye color.",
    "Wet the entire cat shape with clean water leaving the two spots for the eyes dry.",
    "Even better, if desired, save the white of the paper by masking out the eyes with spots of masking or painter’s tape.",
    "Draw eye shapes on a piece of tape, cut or tear them out and apply them to the paper, rubbing to make sure they stick.",
    "Paint the cat with clear water first.",
    "Use a small brush to get in all the areas, keeping the water just inside the outline of the cat.",
    "Give it a minute or two to soak into the paper.",
    "Fully load your brush with any of the colors in your paint set.",
    "Drop in the color by touching the end of the full brush into the wet area of the cat.",
    "The water will pull the paint from your brush.",
    "Follow quickly by repeating with another color.",
    "Do not stir or mix, let the water carry the paint and it will do the mixing for you.",
    "Help it along, if necessary, by gently tilting your paper to move the water and  mix the colors.",
    "Repeat as many times as you wish with any color you wish.",
    "Help the paint along if necessary.",
    "If you fail to get the desired darkness of the cat by using a mixture of colors, give it time to work.",
    "You might be surprised, if you have dropped in many colors that you have created an interesting dark shade or even black by the various colors cancelling each other out and producing a new color.",
    "Or, if you wish to go darker, use the black in your paint box.",
    "Use a small pointed brush to coax the paint from the main shape into tiny spaces and crevices.",
    "Once completed, let it dry without mixing or stirring.",
    "You can always choose an easier method.",
    "Just paint the cat using the black in your paintbox.",
    "No need to wet it first.",
    "Just let it dry before moving ahead with your painting.",
    "Create the cat’s eyes.",
    "Unmask the eyes and use green, yellow, or a combination to paint them.",
    "Add a layer of sparkly glitter glue over the eyes after they have dried.",
    "Scratch out the whiskers and mouth.",
    "Alternatively, you could use white-out to draw them.",
    "Scrub out a circle for the mouth with a small brush, dab with tissue and allow to dry.",
    "Paint the background.",
    "Any number of things can be put in to finish this picture.",
    "Use your imagination.",
    "Put the cat on a fence, in the doorway of a spooky house, standing in the grass, or on a hay bale, for example.",
    "Use dark, rich colors.",
    "Finish it up.",
    "Paint the moon or other light source.",
    "Allow the entire painting to dry again.",
    "With a fine line marker or Sharpie outline everything and add spiky standing up hair all around the cat."
  ],
  "tyn_section":[
    "Heavy watercolor paper",
    "Watercolor paints",
    "Brushes",
    "Pencil and eraser",
    "Fine line black marker",
    "Glitter glue, optional"
  ],
  "tyn_model":[
    "water",
    "paint",
    "paper",
    "cat",
    "watercolors",
    "lantern",
    "watercolor paper",
    "pencil",
    "masking or painter’s tape",
    "clear water",
    "sparkly glitter glue",
    "white-out",
    "tissue",
    "fine line marker",
    "sharpie"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1333333333,
    "f1":0.1904761905
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.2666666667,
    "f1":0.380952381
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.1333333333,
    "f1":0.1904761905
  }
}