{
  "title":"How to Use Schisandra Berries",
  "url":"https://www.wikihow.com/Use-Schisandra-Berries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "methods":[
    {
      "name":"Making Schisandra Berry Tea",
      "steps":[
        {
          "headline":"Heat a small pot of water to 190 °F (88 °C).",
          "description":"Pour 2 cups (470 ml) of water into a pot or kettle and turn the burner to high. To heat the water to 190 °F (88 °C), keep it on the heat until it begins to simmer and make a few pearl-sized bubbles. If you're using the kettle, pay attention to the sound. The kettle will make a very quiet hissing sound and you'll notice wisps of steam coming out."
        },
        {
          "headline":"Put dried Schisandra berries into a tea infuser.",
          "description":"Get out a tea infuser ball or large tea filter. Measure 1 to 2 tablespoons (7 to 14 g) of dried Schisandra berries into the infuser or filter. If you don't have a tea infuser or filter, you can put the dried berries directly into the teapot, but you'll need to strain them out before pouring the tea into your cup."
        },
        {
          "headline":"Add the Schisandra berries to the water and simmer the tea for 15 to 20 minutes.",
          "description":"Once the water begins to simmer, add the infuser or filter to the water and put the lid on the pot. To prevent the water from boiling over, you'll need to turn the burner down to medium. The berries will turn the water a rosy pink color as they steep."
        },
        {
          "headline":"Remove the infuser and pour the tea into a cup.",
          "description":"Turn off the burner and carefully take the tea infuser or filter out of the pot or kettle. Slowly pour some of the Schisandra berry tea into a cup.Tip: If you find that Schisandra berry tea is too bitter for your taste, stir in honey or sugar until it's sweet enough. If the tea tastes too sweet for you, try squirting a little fresh lemon into your tea. Although you can save the berries to brew again, the second steeping won't be as strong."
        },
        {
          "headline":"Drink Schisandra berry tea 3 or 4 times a day to focus or improve liver health.",
          "description":"Since Schisandra berry is technically a tisane or infusion, it doesn't contain caffeine and you can enjoy it several times a day without worrying that it will keep you awake later. If you want to look for more Schisandra berry recipes, search for tea instead of tisanes or infusions in order to find more results."
        }
      ]
    },
    {
      "name":"Using Schisandra Berries and Products",
      "steps":[
        {
          "headline":"Take a Schisandra berry supplement 2 times a day to help protect your liver.",
          "description":"Purchase a high-quality capsule supplement that contains about 580 mg per capsule. The berries contain lignans and flavonoids that may be able to improve liver function and heal damage to the liver. Follow the manufacturer's specific dosing instructions and take the capsule with water or juice. For example, you may need to take 1 capsule 2 times a day, preferably with meals or water. If you're pregnant or nursing, avoid using Schisandra berries since more research is needed to determine if it's safe. Tip: Be aware that Schisandra berries can interact with certain medications, such as Coumadin. It's always a good idea to talk with your doctor before using Schisandra berries. If you experience a negative reaction, stop taking the berry and discuss the reaction with your doctor."
        },
        {
          "headline":"Drink diluted Schisandra berry tincture to try to improve your ability to focus.",
          "description":"If you're struggling to pay attention, Schisandra berries might increase your alertness and make it easier to concentrate. Buy a bottle of tincture and read the manufacturer's dosing recommendation. Most will direct you to add 1 to 2 full droppers to ⁄4 cup (59 ml) of water or juice. You can drink the diluted tincture 2 to 3 times a day. You can purchase the tincture from a supplement store or natural grocery store. Some companies recommend that you take the tincture in between meals."
        },
        {
          "headline":"Eat a few of the dried Schisandra berries to possibly help manage hepatitis.",
          "description":"If you've been diagnosed with chronic hepatitis, ask your doctor if it's safe to add Schisandra berries to your treatment plan. You can start by eating 1 to 2 dried berries on their own. Then, gradually build up to eating 2 teaspoons (4.5 g) of dried berries every day. Since the berry extract can interfere with some liver medications, it's very important to speak with your doctor before adding Schisandra berries to your diet."
        },
        {
          "headline":"Stop using Schisandra berries if you experience stomach pain or other side effects.",
          "description":"Although most people don't have problems taking Schisandra berries, mild side effects may include:\nHeartburn\nUpset stomach\nReduced appetite\nStomach pain\nSkin rash or itching"
        },
        {
          "headline":"Use skincare products with Schisandra berry extract if you're looking for anti-aging effects.",
          "description":"Schisandra berries contain antioxidants, so you'll find the extract in many anti-aging products, such as moisturizers and toners. Read product labels for the ingredient Schisandra chinensis, which is the berry's scientific name."
        }
      ]
    }
  ],
  "text":" Making Schisandra Berry Tea Heat a small pot of water to 190 °F (88 °C). Pour 2 cups (470 ml) of water into a pot or kettle and turn the burner to high. To heat the water to 190 °F (88 °C), keep it on the heat until it begins to simmer and make a few pearl-sized bubbles. If you're using the kettle, pay attention to the sound. The kettle will make a very quiet hissing sound and you'll notice wisps of steam coming out. Put dried Schisandra berries into a tea infuser. Get out a tea infuser ball or large tea filter. Measure 1 to 2 tablespoons (7 to 14 g) of dried Schisandra berries into the infuser or filter. If you don't have a tea infuser or filter, you can put the dried berries directly into the teapot, but you'll need to strain them out before pouring the tea into your cup. Add the Schisandra berries to the water and simmer the tea for 15 to 20 minutes. Once the water begins to simmer, add the infuser or filter to the water and put the lid on the pot. To prevent the water from boiling over, you'll need to turn the burner down to medium. The berries will turn the water a rosy pink color as they steep. Remove the infuser and pour the tea into a cup. Turn off the burner and carefully take the tea infuser or filter out of the pot or kettle. Slowly pour some of the Schisandra berry tea into a cup.Tip: If you find that Schisandra berry tea is too bitter for your taste, stir in honey or sugar until it's sweet enough. If the tea tastes too sweet for you, try squirting a little fresh lemon into your tea. Although you can save the berries to brew again, the second steeping won't be as strong. Drink Schisandra berry tea 3 or 4 times a day to focus or improve liver health. Since Schisandra berry is technically a tisane or infusion, it doesn't contain caffeine and you can enjoy it several times a day without worrying that it will keep you awake later. If you want to look for more Schisandra berry recipes, search for tea instead of tisanes or infusions in order to find more results. Using Schisandra Berries and Products Take a Schisandra berry supplement 2 times a day to help protect your liver. Purchase a high-quality capsule supplement that contains about 580 mg per capsule. The berries contain lignans and flavonoids that may be able to improve liver function and heal damage to the liver. Follow the manufacturer's specific dosing instructions and take the capsule with water or juice. For example, you may need to take 1 capsule 2 times a day, preferably with meals or water. If you're pregnant or nursing, avoid using Schisandra berries since more research is needed to determine if it's safe. Tip: Be aware that Schisandra berries can interact with certain medications, such as Coumadin. It's always a good idea to talk with your doctor before using Schisandra berries. If you experience a negative reaction, stop taking the berry and discuss the reaction with your doctor. Drink diluted Schisandra berry tincture to try to improve your ability to focus. If you're struggling to pay attention, Schisandra berries might increase your alertness and make it easier to concentrate. Buy a bottle of tincture and read the manufacturer's dosing recommendation. Most will direct you to add 1 to 2 full droppers to ⁄4 cup (59 ml) of water or juice. You can drink the diluted tincture 2 to 3 times a day. You can purchase the tincture from a supplement store or natural grocery store. Some companies recommend that you take the tincture in between meals. Eat a few of the dried Schisandra berries to possibly help manage hepatitis. If you've been diagnosed with chronic hepatitis, ask your doctor if it's safe to add Schisandra berries to your treatment plan. You can start by eating 1 to 2 dried berries on their own. Then, gradually build up to eating 2 teaspoons (4.5 g) of dried berries every day. Since the berry extract can interfere with some liver medications, it's very important to speak with your doctor before adding Schisandra berries to your diet. Stop using Schisandra berries if you experience stomach pain or other side effects. Although most people don't have problems taking Schisandra berries, mild side effects may include:\nHeartburn\nUpset stomach\nReduced appetite\nStomach pain\nSkin rash or itching Use skincare products with Schisandra berry extract if you're looking for anti-aging effects. Schisandra berries contain antioxidants, so you'll find the extract in many anti-aging products, such as moisturizers and toners. Read product labels for the ingredient Schisandra chinensis, which is the berry's scientific name.",
  "sentences":[
    " Making Schisandra Berry Tea Heat a small pot of water to 190 °F (88 °C).",
    "Pour 2 cups (470 ml) of water into a pot or kettle and turn the burner to high.",
    "To heat the water to 190 °F (88 °C), keep it on the heat until it begins to simmer and make a few pearl-sized bubbles.",
    "If you're using the kettle, pay attention to the sound.",
    "The kettle will make a very quiet hissing sound and you'll notice wisps of steam coming out.",
    "Put dried Schisandra berries into a tea infuser.",
    "Get out a tea infuser ball or large tea filter.",
    "Measure 1 to 2 tablespoons (7 to 14 g) of dried Schisandra berries into the infuser or filter.",
    "If you don't have a tea infuser or filter, you can put the dried berries directly into the teapot, but you'll need to strain them out before pouring the tea into your cup.",
    "Add the Schisandra berries to the water and simmer the tea for 15 to 20 minutes.",
    "Once the water begins to simmer, add the infuser or filter to the water and put the lid on the pot.",
    "To prevent the water from boiling over, you'll need to turn the burner down to medium.",
    "The berries will turn the water a rosy pink color as they steep.",
    "Remove the infuser and pour the tea into a cup.",
    "Turn off the burner and carefully take the tea infuser or filter out of the pot or kettle.",
    "Slowly pour some of the Schisandra berry tea into a cup.Tip: If you find that Schisandra berry tea is too bitter for your taste, stir in honey or sugar until it's sweet enough.",
    "If the tea tastes too sweet for you, try squirting a little fresh lemon into your tea.",
    "Although you can save the berries to brew again, the second steeping won't be as strong.",
    "Drink Schisandra berry tea 3 or 4 times a day to focus or improve liver health.",
    "Since Schisandra berry is technically a tisane or infusion, it doesn't contain caffeine and you can enjoy it several times a day without worrying that it will keep you awake later.",
    "If you want to look for more Schisandra berry recipes, search for tea instead of tisanes or infusions in order to find more results.",
    "Using Schisandra Berries and Products Take a Schisandra berry supplement 2 times a day to help protect your liver.",
    "Purchase a high-quality capsule supplement that contains about 580 mg per capsule.",
    "The berries contain lignans and flavonoids that may be able to improve liver function and heal damage to the liver.",
    "Follow the manufacturer's specific dosing instructions and take the capsule with water or juice.",
    "For example, you may need to take 1 capsule 2 times a day, preferably with meals or water.",
    "If you're pregnant or nursing, avoid using Schisandra berries since more research is needed to determine if it's safe.",
    "Tip: Be aware that Schisandra berries can interact with certain medications, such as Coumadin.",
    "It's always a good idea to talk with your doctor before using Schisandra berries.",
    "If you experience a negative reaction, stop taking the berry and discuss the reaction with your doctor.",
    "Drink diluted Schisandra berry tincture to try to improve your ability to focus.",
    "If you're struggling to pay attention, Schisandra berries might increase your alertness and make it easier to concentrate.",
    "Buy a bottle of tincture and read the manufacturer's dosing recommendation.",
    "Most will direct you to add 1 to 2 full droppers to ⁄4 cup (59 ml) of water or juice.",
    "You can drink the diluted tincture 2 to 3 times a day.",
    "You can purchase the tincture from a supplement store or natural grocery store.",
    "Some companies recommend that you take the tincture in between meals.",
    "Eat a few of the dried Schisandra berries to possibly help manage hepatitis.",
    "If you've been diagnosed with chronic hepatitis, ask your doctor if it's safe to add Schisandra berries to your treatment plan.",
    "You can start by eating 1 to 2 dried berries on their own.",
    "Then, gradually build up to eating 2 teaspoons (4.5 g) of dried berries every day.",
    "Since the berry extract can interfere with some liver medications, it's very important to speak with your doctor before adding Schisandra berries to your diet.",
    "Stop using Schisandra berries if you experience stomach pain or other side effects.",
    "Although most people don't have problems taking Schisandra berries, mild side effects may include:\nHeartburn\nUpset stomach\nReduced appetite\nStomach pain\nSkin rash or itching Use skincare products with Schisandra berry extract if you're looking for anti-aging effects.",
    "Schisandra berries contain antioxidants, so you'll find the extract in many anti-aging products, such as moisturizers and toners.",
    "Read product labels for the ingredient Schisandra chinensis, which is the berry's scientific name."
  ],
  "tyn_section":[
    "Small pot",
    "Measuring spoon",
    "Strainer",
    "Tea infuser",
    "Cup"
  ],
  "tyn_model":[
    "water",
    "schisandra berries",
    "berries",
    "schisandra berry tea",
    "tea",
    "burner",
    "kettle",
    "tea infuser",
    "schisandra berry",
    "pot or kettle",
    "tea infuser ball",
    "large tea filter",
    "infuser or filter",
    "teapot",
    "filter",
    "pot",
    "honey",
    "sugar",
    "lemon",
    "flavonoids",
    "coumadin",
    "skincare products"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0454545455,
    "f1":0.0740740741,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.0909090909,
    "f1":0.125
  }
}