{
  "title":"How to Pressure Wash Vinyl Siding",
  "url":"https://www.wikihow.com/Pressure-Wash-Vinyl-Siding",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Preparing Your Work Area",
      "steps":[
        {
          "headline":"Wear the necessary safety gear.",
          "description":"If you want to play it safe, don a ventilated breathing mask or respirator, and make sure you’ve got a pair of rugged work gloves on anytime you’re handling the pressure washer. At the very least, pull on some rubber gloves and a facemask.Since you’ll potentially be encountering mold, mildew, algae and other icky substances, it’s important to make sure there’s a barrier in place over your nose and mouth. A pair of goggles or other form of eye protection can also come in handy for preventing water from splashing back into your eyes."
        },
        {
          "headline":"Remove or cover nearby objects.",
          "description":"Any furniture in the immediate vicinity should be put into temporary storage to protect it from all the water and dirt particles that will soon be flying around. Likewise, it’s a good idea to drape a tarp over plants and other outdoor fixtures that might be damaged by the stream. Assuming off-site storage isn’t an option, move furniture and appliances a safe distance away from where you’ll be operating the pressure washer."
        },
        {
          "headline":"Cover all exposed electrical components.",
          "description":"To avoid shorts and other mishaps, you’ll want to make sure that no moisture enters any of your home’s outdoor electrical outlets or ports. The same goes for external wiring, light fixtures, and any other equipment.Go ahead and unplug anything that’s currently connected as an added safety precaution. If you’re unable to find covers to fit your home’s outlets, you can conceal them with small squares of plastic anchored with waterproof tape."
        },
        {
          "headline":"Scrub away mold and mildew by hand.",
          "description":"Combine one part normal household bleach with ten parts water in a spray bottle. Liberally mist areas with the heaviest buildup and discoloration, then wipe them down by hand using a soft cloth or sponge. When you’re finished, rinse the entire surface with fresh, clean water from a hose.Bleach is mildly caustic and can irritate your skin if it gets on you, so be sure to wear gloves. A preliminary bleach treatment will help eliminate the worst of the mold, making it easy for the pressure washer to take care of the rest."
        }
      ]
    },
    {
      "name":"Spraying on the Cleaning Solution",
      "steps":[
        {
          "headline":"Use an appropriate cleaning solution.",
          "description":"It’s recommended that you use some type of solution when pressure washing your home’s exterior, even if you’ve already treated it with bleach. Some pressure washer models feature a separate compartment for adding soaps and detergents. After filling this compartment, an internal injector will mix the soap and water together into a single stream that annihilates stains and disinfects at the same time.Look for products that have been approved specifically for use in pressure washers. Cleaning with water alone won’t kill mold and bacteria, which means it’s possible for them to make a quick comeback."
        },
        {
          "headline":"Start with a low pressure setting.",
          "description":"Initially, it's a good idea to keep the pressure washer set to a PSI of around 1,300-1,600 until you see what effect it will have on the delicate vinyl. For a less concentrated stream, fit the nozzle with a 25 degree spray tip. It's also a good idea to stay further away from the work surface so it's not being hit with the most forceful part of the stream. A standard gasoline or electric washer with a pressure rating around 3,000 PSI should provide more than enough force to effectively clean even hard-to-reach places. Perform a few test sprays on one of the lower corners of the siding to help you get used to the power."
        },
        {
          "headline":"Increase the pressure incrementally.",
          "description":"If the stream isn’t forceful enough to get the siding sufficiently clean, crank it up little by little. This can be done by adjusting the nozzle in either direction (right for more power, left for less) or simply moving closer to the work surface. Even the most persistent stains shouldn't require you to use more than 3,000 PSI."
        },
        {
          "headline":"Begin with a small section of the siding.",
          "description":"Start at one corner and keep the nozzle fixed in one place, holding it steady while it chips away at the accumulated dirt and discoloration. Then, slowly and deliberately move on to the surrounding area. Continue spraying until the targeted area is completely free of residue. If needed, you can go over the same spot a few times to loosen stubborn dried buildup. Take your time. Long-standing messes may not come off right away."
        },
        {
          "headline":"Blast the surface clean using smooth, sweeping motions.",
          "description":"Work your way up and down first, then left to right. Keep the nozzle moving and let the water peel away the caked-on grime gradually. Avoid spraying in circles, swirls, or other indiscriminate patterns. Not only is this inefficient, it can also leave behind noticeable streaks due to the way it pushes the dirt around."
        },
        {
          "headline":"Work in sections.",
          "description":"After you've completed a 2–3 foot (0.61–0.91 m) wide strip of siding, move over and clean the next strip. Going over one part of the surface at a time is much quicker and more systematic than spraying aimlessly. It will also result in fewer missed spots, guaranteeing a more thorough cleaning.Look closely for any small patches dirt or grime that you may have overlooked before moving on to rinsing."
        },
        {
          "headline":"Hold the nozzle straight or at a slight downward angle at all times.",
          "description":"This will minimize the amount of water that finds its way behind the siding. Never spray in an upward direction, as this just pushes the water directly up into the spaces between the overlapping segments.You may have to stand on a ladder to hit the upper areas of the exterior without pointing the nozzle upwards. If too much water become trapped, it can cause bulging, mold buildup, and electrical issues, or even weaken your home’s framework or foundation."
        },
        {
          "headline":"Let the cleaning solution sit for several minutes.",
          "description":"As they sit, the water and cleaner will work together to soften stubborn stains from the surface of the vinyl. The siding can then simply be rinsed clean with a stream of fresh water.Do not allow the solution to dry completely. It could leave behind unsightly streaks or scummy residue. Rewet the sections you’ve gone over previously as needed to prevent them from drying while you work on the rest of the siding."
        }
      ]
    },
    {
      "name":"Rinsing and Drying the Siding",
      "steps":[
        {
          "headline":"Empty out the cleaning solution.",
          "description":"Before you begin rinsing, first get rid of all traces of detergent so that you’re running clean water through the pressure washer. Hold down the trigger of the wand for a few seconds to make sure the line is clear."
        },
        {
          "headline":"Switch to a lower pressure.",
          "description":"To avoid putting anymore unnecessary stress on the vinyl, adjust the pressure setting to somewhere between 1,000 and 1,200. Since you've already removed all visible dirt and stains, you'll only need enough pressure to wash away the remaining cleaning solution.Alternatively, you can also use a garden hose for a gentler touch. Fitting the nozzle with a 40 or 60 degree spray tip will allow you to cover a much broader surface area at once."
        },
        {
          "headline":"Rinse the siding from top to bottom.",
          "description":"This time, you'll want to work in the opposite direction so the soap washes down the exterior. Otherwise, it's possible to leave streaks. As you did when cleaning, proceed one section at a time, rinsing until the water runs clear and no traces of soap remain. If necessary, take an occasional break to give the excess runoff time to drain."
        },
        {
          "headline":"Allow the siding to air dry.",
          "description":"Depending on the weather, this could take anywhere from a few hours to overnight. Get started early so there will be plenty of sunlight left by the time you finish. If desired, you can use a chamois to pat down narrow nooks and other parts of the exterior that don’t get as much exposure. Plan your project for a day with warm, dry conditions to help speed up the drying time."
        }
      ]
    },
    {
      "name":"Maintaining Vinyl Siding",
      "steps":[
        {
          "headline":"Clean your vinyl siding regularly.",
          "description":"Aim to give your home’s exterior some attention every other year. Generally, this type of project is best suited for summer—warm, sunny weather will help slow the growth of new mold and make wet jobs more tolerable. When properly cared for, your vinyl siding has the potential to last for decades.If you live in a cool, moist climate or your home is situated in a shady location where it doesn’t receive much direct sunlight, you may need to increase the frequency to once a year. Following an initial pressure washing, you'll most likely be able to get by with some old fashioned elbow grease until time and inclement weather make another deep cleaning necessary."
        },
        {
          "headline":"Touch up the siding manually between cleanings.",
          "description":"Scrub exposed surfaces periodically with a mild bleach solution to prevent day-to-day buildup from getting out of control. By staying on top of things, you may even be able to reduce the frequency of more intensive cleanings to every three or four years.For a little extra scrubbing power, opt for a Brillo pad or use a stiff-bristled scouring brush. One of these tools will be able to dig into the soft surface of the vinyl better than an ordinary cloth or sponge. Add touching up your exterior to your list of bi-monthly chores to complete around the house."
        },
        {
          "headline":"Inspect for signs of damage and deterioration.",
          "description":"Each cleaning should begin and end with a thorough visual assessment. Should you happen to discover potential problem areas, get in touch with the contractor who originally installed your siding. These will need to be dealt with sooner rather than later by patching or replacing the damaged section.Over time, exposure to the elements or the impact from falling tree branches and other debris can cause considerable wear and tear. If not addressed right away, damaged siding can become an eyesore or even fail, putting your home at risk for more serious issues like leaks, drafts, and water damage."
        }
      ]
    }
  ],
  "text":" Preparing Your Work Area Wear the necessary safety gear. If you want to play it safe, don a ventilated breathing mask or respirator, and make sure you’ve got a pair of rugged work gloves on anytime you’re handling the pressure washer. At the very least, pull on some rubber gloves and a facemask.Since you’ll potentially be encountering mold, mildew, algae and other icky substances, it’s important to make sure there’s a barrier in place over your nose and mouth. A pair of goggles or other form of eye protection can also come in handy for preventing water from splashing back into your eyes. Remove or cover nearby objects. Any furniture in the immediate vicinity should be put into temporary storage to protect it from all the water and dirt particles that will soon be flying around. Likewise, it’s a good idea to drape a tarp over plants and other outdoor fixtures that might be damaged by the stream. Assuming off-site storage isn’t an option, move furniture and appliances a safe distance away from where you’ll be operating the pressure washer. Cover all exposed electrical components. To avoid shorts and other mishaps, you’ll want to make sure that no moisture enters any of your home’s outdoor electrical outlets or ports. The same goes for external wiring, light fixtures, and any other equipment.Go ahead and unplug anything that’s currently connected as an added safety precaution. If you’re unable to find covers to fit your home’s outlets, you can conceal them with small squares of plastic anchored with waterproof tape. Scrub away mold and mildew by hand. Combine one part normal household bleach with ten parts water in a spray bottle. Liberally mist areas with the heaviest buildup and discoloration, then wipe them down by hand using a soft cloth or sponge. When you’re finished, rinse the entire surface with fresh, clean water from a hose.Bleach is mildly caustic and can irritate your skin if it gets on you, so be sure to wear gloves. A preliminary bleach treatment will help eliminate the worst of the mold, making it easy for the pressure washer to take care of the rest. Spraying on the Cleaning Solution Use an appropriate cleaning solution. It’s recommended that you use some type of solution when pressure washing your home’s exterior, even if you’ve already treated it with bleach. Some pressure washer models feature a separate compartment for adding soaps and detergents. After filling this compartment, an internal injector will mix the soap and water together into a single stream that annihilates stains and disinfects at the same time.Look for products that have been approved specifically for use in pressure washers. Cleaning with water alone won’t kill mold and bacteria, which means it’s possible for them to make a quick comeback. Start with a low pressure setting. Initially, it's a good idea to keep the pressure washer set to a PSI of around 1,300-1,600 until you see what effect it will have on the delicate vinyl. For a less concentrated stream, fit the nozzle with a 25 degree spray tip. It's also a good idea to stay further away from the work surface so it's not being hit with the most forceful part of the stream. A standard gasoline or electric washer with a pressure rating around 3,000 PSI should provide more than enough force to effectively clean even hard-to-reach places. Perform a few test sprays on one of the lower corners of the siding to help you get used to the power. Increase the pressure incrementally. If the stream isn’t forceful enough to get the siding sufficiently clean, crank it up little by little. This can be done by adjusting the nozzle in either direction (right for more power, left for less) or simply moving closer to the work surface. Even the most persistent stains shouldn't require you to use more than 3,000 PSI. Begin with a small section of the siding. Start at one corner and keep the nozzle fixed in one place, holding it steady while it chips away at the accumulated dirt and discoloration. Then, slowly and deliberately move on to the surrounding area. Continue spraying until the targeted area is completely free of residue. If needed, you can go over the same spot a few times to loosen stubborn dried buildup. Take your time. Long-standing messes may not come off right away. Blast the surface clean using smooth, sweeping motions. Work your way up and down first, then left to right. Keep the nozzle moving and let the water peel away the caked-on grime gradually. Avoid spraying in circles, swirls, or other indiscriminate patterns. Not only is this inefficient, it can also leave behind noticeable streaks due to the way it pushes the dirt around. Work in sections. After you've completed a 2–3 foot (0.61–0.91 m) wide strip of siding, move over and clean the next strip. Going over one part of the surface at a time is much quicker and more systematic than spraying aimlessly. It will also result in fewer missed spots, guaranteeing a more thorough cleaning.Look closely for any small patches dirt or grime that you may have overlooked before moving on to rinsing. Hold the nozzle straight or at a slight downward angle at all times. This will minimize the amount of water that finds its way behind the siding. Never spray in an upward direction, as this just pushes the water directly up into the spaces between the overlapping segments.You may have to stand on a ladder to hit the upper areas of the exterior without pointing the nozzle upwards. If too much water become trapped, it can cause bulging, mold buildup, and electrical issues, or even weaken your home’s framework or foundation. Let the cleaning solution sit for several minutes. As they sit, the water and cleaner will work together to soften stubborn stains from the surface of the vinyl. The siding can then simply be rinsed clean with a stream of fresh water.Do not allow the solution to dry completely. It could leave behind unsightly streaks or scummy residue. Rewet the sections you’ve gone over previously as needed to prevent them from drying while you work on the rest of the siding. Rinsing and Drying the Siding Empty out the cleaning solution. Before you begin rinsing, first get rid of all traces of detergent so that you’re running clean water through the pressure washer. Hold down the trigger of the wand for a few seconds to make sure the line is clear. Switch to a lower pressure. To avoid putting anymore unnecessary stress on the vinyl, adjust the pressure setting to somewhere between 1,000 and 1,200. Since you've already removed all visible dirt and stains, you'll only need enough pressure to wash away the remaining cleaning solution.Alternatively, you can also use a garden hose for a gentler touch. Fitting the nozzle with a 40 or 60 degree spray tip will allow you to cover a much broader surface area at once. Rinse the siding from top to bottom. This time, you'll want to work in the opposite direction so the soap washes down the exterior. Otherwise, it's possible to leave streaks. As you did when cleaning, proceed one section at a time, rinsing until the water runs clear and no traces of soap remain. If necessary, take an occasional break to give the excess runoff time to drain. Allow the siding to air dry. Depending on the weather, this could take anywhere from a few hours to overnight. Get started early so there will be plenty of sunlight left by the time you finish. If desired, you can use a chamois to pat down narrow nooks and other parts of the exterior that don’t get as much exposure. Plan your project for a day with warm, dry conditions to help speed up the drying time. Maintaining Vinyl Siding Clean your vinyl siding regularly. Aim to give your home’s exterior some attention every other year. Generally, this type of project is best suited for summer—warm, sunny weather will help slow the growth of new mold and make wet jobs more tolerable. When properly cared for, your vinyl siding has the potential to last for decades.If you live in a cool, moist climate or your home is situated in a shady location where it doesn’t receive much direct sunlight, you may need to increase the frequency to once a year. Following an initial pressure washing, you'll most likely be able to get by with some old fashioned elbow grease until time and inclement weather make another deep cleaning necessary. Touch up the siding manually between cleanings. Scrub exposed surfaces periodically with a mild bleach solution to prevent day-to-day buildup from getting out of control. By staying on top of things, you may even be able to reduce the frequency of more intensive cleanings to every three or four years.For a little extra scrubbing power, opt for a Brillo pad or use a stiff-bristled scouring brush. One of these tools will be able to dig into the soft surface of the vinyl better than an ordinary cloth or sponge. Add touching up your exterior to your list of bi-monthly chores to complete around the house. Inspect for signs of damage and deterioration. Each cleaning should begin and end with a thorough visual assessment. Should you happen to discover potential problem areas, get in touch with the contractor who originally installed your siding. These will need to be dealt with sooner rather than later by patching or replacing the damaged section.Over time, exposure to the elements or the impact from falling tree branches and other debris can cause considerable wear and tear. If not addressed right away, damaged siding can become an eyesore or even fail, putting your home at risk for more serious issues like leaks, drafts, and water damage.",
  "sentences":[
    " Preparing Your Work Area Wear the necessary safety gear.",
    "If you want to play it safe, don a ventilated breathing mask or respirator, and make sure you’ve got a pair of rugged work gloves on anytime you’re handling the pressure washer.",
    "At the very least, pull on some rubber gloves and a facemask.Since you’ll potentially be encountering mold, mildew, algae and other icky substances, it’s important to make sure there’s a barrier in place over your nose and mouth.",
    "A pair of goggles or other form of eye protection can also come in handy for preventing water from splashing back into your eyes.",
    "Remove or cover nearby objects.",
    "Any furniture in the immediate vicinity should be put into temporary storage to protect it from all the water and dirt particles that will soon be flying around.",
    "Likewise, it’s a good idea to drape a tarp over plants and other outdoor fixtures that might be damaged by the stream.",
    "Assuming off-site storage isn’t an option, move furniture and appliances a safe distance away from where you’ll be operating the pressure washer.",
    "Cover all exposed electrical components.",
    "To avoid shorts and other mishaps, you’ll want to make sure that no moisture enters any of your home’s outdoor electrical outlets or ports.",
    "The same goes for external wiring, light fixtures, and any other equipment.Go ahead and unplug anything that’s currently connected as an added safety precaution.",
    "If you’re unable to find covers to fit your home’s outlets, you can conceal them with small squares of plastic anchored with waterproof tape.",
    "Scrub away mold and mildew by hand.",
    "Combine one part normal household bleach with ten parts water in a spray bottle.",
    "Liberally mist areas with the heaviest buildup and discoloration, then wipe them down by hand using a soft cloth or sponge.",
    "When you’re finished, rinse the entire surface with fresh, clean water from a hose.Bleach is mildly caustic and can irritate your skin if it gets on you, so be sure to wear gloves.",
    "A preliminary bleach treatment will help eliminate the worst of the mold, making it easy for the pressure washer to take care of the rest.",
    "Spraying on the Cleaning Solution Use an appropriate cleaning solution.",
    "It’s recommended that you use some type of solution when pressure washing your home’s exterior, even if you’ve already treated it with bleach.",
    "Some pressure washer models feature a separate compartment for adding soaps and detergents.",
    "After filling this compartment, an internal injector will mix the soap and water together into a single stream that annihilates stains and disinfects at the same time.Look for products that have been approved specifically for use in pressure washers.",
    "Cleaning with water alone won’t kill mold and bacteria, which means it’s possible for them to make a quick comeback.",
    "Start with a low pressure setting.",
    "Initially, it's a good idea to keep the pressure washer set to a PSI of around 1,300-1,600 until you see what effect it will have on the delicate vinyl.",
    "For a less concentrated stream, fit the nozzle with a 25 degree spray tip.",
    "It's also a good idea to stay further away from the work surface so it's not being hit with the most forceful part of the stream.",
    "A standard gasoline or electric washer with a pressure rating around 3,000 PSI should provide more than enough force to effectively clean even hard-to-reach places.",
    "Perform a few test sprays on one of the lower corners of the siding to help you get used to the power.",
    "Increase the pressure incrementally.",
    "If the stream isn’t forceful enough to get the siding sufficiently clean, crank it up little by little.",
    "This can be done by adjusting the nozzle in either direction (right for more power, left for less) or simply moving closer to the work surface.",
    "Even the most persistent stains shouldn't require you to use more than 3,000 PSI.",
    "Begin with a small section of the siding.",
    "Start at one corner and keep the nozzle fixed in one place, holding it steady while it chips away at the accumulated dirt and discoloration.",
    "Then, slowly and deliberately move on to the surrounding area.",
    "Continue spraying until the targeted area is completely free of residue.",
    "If needed, you can go over the same spot a few times to loosen stubborn dried buildup.",
    "Take your time.",
    "Long-standing messes may not come off right away.",
    "Blast the surface clean using smooth, sweeping motions.",
    "Work your way up and down first, then left to right.",
    "Keep the nozzle moving and let the water peel away the caked-on grime gradually.",
    "Avoid spraying in circles, swirls, or other indiscriminate patterns.",
    "Not only is this inefficient, it can also leave behind noticeable streaks due to the way it pushes the dirt around.",
    "Work in sections.",
    "After you've completed a 2–3 foot (0.61–0.91 m) wide strip of siding, move over and clean the next strip.",
    "Going over one part of the surface at a time is much quicker and more systematic than spraying aimlessly.",
    "It will also result in fewer missed spots, guaranteeing a more thorough cleaning.Look closely for any small patches dirt or grime that you may have overlooked before moving on to rinsing.",
    "Hold the nozzle straight or at a slight downward angle at all times.",
    "This will minimize the amount of water that finds its way behind the siding.",
    "Never spray in an upward direction, as this just pushes the water directly up into the spaces between the overlapping segments.You may have to stand on a ladder to hit the upper areas of the exterior without pointing the nozzle upwards.",
    "If too much water become trapped, it can cause bulging, mold buildup, and electrical issues, or even weaken your home’s framework or foundation.",
    "Let the cleaning solution sit for several minutes.",
    "As they sit, the water and cleaner will work together to soften stubborn stains from the surface of the vinyl.",
    "The siding can then simply be rinsed clean with a stream of fresh water.Do not allow the solution to dry completely.",
    "It could leave behind unsightly streaks or scummy residue.",
    "Rewet the sections you’ve gone over previously as needed to prevent them from drying while you work on the rest of the siding.",
    "Rinsing and Drying the Siding Empty out the cleaning solution.",
    "Before you begin rinsing, first get rid of all traces of detergent so that you’re running clean water through the pressure washer.",
    "Hold down the trigger of the wand for a few seconds to make sure the line is clear.",
    "Switch to a lower pressure.",
    "To avoid putting anymore unnecessary stress on the vinyl, adjust the pressure setting to somewhere between 1,000 and 1,200.",
    "Since you've already removed all visible dirt and stains, you'll only need enough pressure to wash away the remaining cleaning solution.Alternatively, you can also use a garden hose for a gentler touch.",
    "Fitting the nozzle with a 40 or 60 degree spray tip will allow you to cover a much broader surface area at once.",
    "Rinse the siding from top to bottom.",
    "This time, you'll want to work in the opposite direction so the soap washes down the exterior.",
    "Otherwise, it's possible to leave streaks.",
    "As you did when cleaning, proceed one section at a time, rinsing until the water runs clear and no traces of soap remain.",
    "If necessary, take an occasional break to give the excess runoff time to drain.",
    "Allow the siding to air dry.",
    "Depending on the weather, this could take anywhere from a few hours to overnight.",
    "Get started early so there will be plenty of sunlight left by the time you finish.",
    "If desired, you can use a chamois to pat down narrow nooks and other parts of the exterior that don’t get as much exposure.",
    "Plan your project for a day with warm, dry conditions to help speed up the drying time.",
    "Maintaining Vinyl Siding Clean your vinyl siding regularly.",
    "Aim to give your home’s exterior some attention every other year.",
    "Generally, this type of project is best suited for summer—warm, sunny weather will help slow the growth of new mold and make wet jobs more tolerable.",
    "When properly cared for, your vinyl siding has the potential to last for decades.If you live in a cool, moist climate or your home is situated in a shady location where it doesn’t receive much direct sunlight, you may need to increase the frequency to once a year.",
    "Following an initial pressure washing, you'll most likely be able to get by with some old fashioned elbow grease until time and inclement weather make another deep cleaning necessary.",
    "Touch up the siding manually between cleanings.",
    "Scrub exposed surfaces periodically with a mild bleach solution to prevent day-to-day buildup from getting out of control.",
    "By staying on top of things, you may even be able to reduce the frequency of more intensive cleanings to every three or four years.For a little extra scrubbing power, opt for a Brillo pad or use a stiff-bristled scouring brush.",
    "One of these tools will be able to dig into the soft surface of the vinyl better than an ordinary cloth or sponge.",
    "Add touching up your exterior to your list of bi-monthly chores to complete around the house.",
    "Inspect for signs of damage and deterioration.",
    "Each cleaning should begin and end with a thorough visual assessment.",
    "Should you happen to discover potential problem areas, get in touch with the contractor who originally installed your siding.",
    "These will need to be dealt with sooner rather than later by patching or replacing the damaged section.Over time, exposure to the elements or the impact from falling tree branches and other debris can cause considerable wear and tear.",
    "If not addressed right away, damaged siding can become an eyesore or even fail, putting your home at risk for more serious issues like leaks, drafts, and water damage."
  ],
  "tyn_section":[
    "Electric or gas-powered pressure washer",
    "Pressure washer-specific cleaning solution",
    "Chlorine bleach",
    "Soft cloth or sponge",
    "Stiff-bristled brush (optional)",
    "Chamois or absorbent towel (optional)",
    "Drop cloth or tarp",
    "Work gloves",
    "Ventilated mask or respirator",
    "Eye protection",
    "Spray bottle"
  ],
  "tyn_model":[
    "water",
    "pressure washer",
    "soap",
    "siding",
    "sponge",
    "bleach",
    "cleaning solution",
    "vinyl siding",
    "ventilated breathing mask",
    "respirator",
    "rubber gloves",
    "facemask",
    "goggles",
    "tarp",
    "waterproof tape",
    "household bleach",
    "spray bottle",
    "soaps",
    "pressure washers",
    "washer",
    "nozzle",
    "cleaner",
    "garden hose",
    "chamois",
    "—warm",
    "mild bleach",
    "brillo pad",
    "scouring brush"
  ],
  "simple_metrics":{
    "r":0.0909090909,
    "p":0.0357142857,
    "f1":0.0512820513,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2727272727,
    "p":0.1071428571,
    "f1":0.1538461538
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5454545455,
    "p":0.2857142857,
    "f1":0.375
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0909090909,
    "p":0.0357142857,
    "f1":0.0512820513
  }
}