{
  "title":"How to Store Scones",
  "url":"https://www.wikihow.com/Store-Scones",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Scones"
  ],
  "methods":[
    {
      "name":"Storing Scones for a Few Days",
      "steps":[
        {
          "headline":"Wait for your scones to cool to room temperature.",
          "description":"Use an oven mitt to take your scones out of the oven. Wait 30-40 minutes to give the scones time to cool. If you put your scones in a container when they’re still warm, the moisture in the scones won’t be able to escape and they’ll get mushy and gross."
        },
        {
          "headline":"Get an airtight food-storage container.",
          "description":"Any food storage container will work. Ceramic and plastic should both be fine as long as they can be properly sealed to keep air from escaping. If you store your scones in a container without a lid, they’ll dry out and get stale.Alternative: If you don’t have a container with a lid, you can wrap plastic wrap over a lidless container. Press your hands around the side of the container to seal it. Then, put a rubber band around the plastic wrap where it overlaps on the container to keep it from coming loose."
        },
        {
          "headline":"Fold a paper towel over to fit the bottom of the container.",
          "description":"Take a standard paper towel and fold it over so that it fits in the base of the container. Ideally, you should have 2-3 layers of paper towel at the bottom of the container. Use 2 paper towels if you’re storing the scones in a larger container. You can use a thick napkin instead of a paper towel if you have to."
        },
        {
          "headline":"Place your scones on top of the paper towel.",
          "description":"Once your scones have cooled off and reached room temperature, transfer them to your airtight container. Pick each scone up and put it into the container, stacking scones as necessary without pressing down to compress or smash them. Unless you’re storing tons of scones, they should be fine laying on top of one another."
        },
        {
          "headline":"Put a second paper towel on top of the scones.",
          "description":"Once all of your scones are inside of the container, take a single paper towel and lay it lightly on top of your scones. The paper towels will absorb the moisture in the scones and keep them from getting mushy while they’re drying out in the container. You can use a napkin if you don’t have any paper towels."
        },
        {
          "headline":"Close the lid and store your scones at room temperature for 3-4 days.",
          "description":"Put the lid on top of your container and close it. Run your hands around the rim of the container to ensure that it’s closed. Store your scones on the countertop or in the pantry for 3-4 days. You may be able store them a little longer, but they’ll start to get stale after more than a few days. If you’re going to reheat the scones, flick a little bit of water on top of them with your fingers before you heat them to put some moisture back into the scones."
        }
      ]
    },
    {
      "name":"Freezing Scones for Long-Term Storage",
      "steps":[
        {
          "headline":"Put your scones on a baking sheet and let them cool.",
          "description":"Once your scones finish baking, use an oven mitt to pull the scones out of the oven. Transfer the scones to a clean baking sheet and wait 30-40 minutes for the scones to reach room temperature.Alternative: You can also opt to not bake the scones after you’ve cut the dough. Freeze the uncooked scones and when you want to make them, add 3-4 minutes to the cooking time called for in your recipe. If the baking sheet won’t fit in your freezer, you can use a large bowl or plate."
        },
        {
          "headline":"Freeze the uncovered scones for 1 hour.",
          "description":"Once your scones have reached room temperature, place the baking sheet in the freezer, uncovered. Wait at least 1 hour for the baked scones to initially freeze. This gives the excess moisture time to dissipate so that it doesn’t get trapped in the storage container."
        },
        {
          "headline":"Transfer the scones to an airtight container.",
          "description":"Any freezer-safe container that can store food will work. Plastic, glass, or unpainted ceramic should all work well with scones. Place your frozen scones in the container, layering them on top of one another as needed and close the lid."
        },
        {
          "headline":"Freeze your scones for up to 3 months.",
          "description":"Place your scones in the freezer. You can store them for up to 3 months. When you want to reheat the scones, take them out and reheat them in the oven or microwave. If you’re storing unbaked scones, add at least 3 minutes to cooking time when you go to bake them."
        }
      ]
    }
  ],
  "text":" Storing Scones for a Few Days Wait for your scones to cool to room temperature. Use an oven mitt to take your scones out of the oven. Wait 30-40 minutes to give the scones time to cool. If you put your scones in a container when they’re still warm, the moisture in the scones won’t be able to escape and they’ll get mushy and gross. Get an airtight food-storage container. Any food storage container will work. Ceramic and plastic should both be fine as long as they can be properly sealed to keep air from escaping. If you store your scones in a container without a lid, they’ll dry out and get stale.Alternative: If you don’t have a container with a lid, you can wrap plastic wrap over a lidless container. Press your hands around the side of the container to seal it. Then, put a rubber band around the plastic wrap where it overlaps on the container to keep it from coming loose. Fold a paper towel over to fit the bottom of the container. Take a standard paper towel and fold it over so that it fits in the base of the container. Ideally, you should have 2-3 layers of paper towel at the bottom of the container. Use 2 paper towels if you’re storing the scones in a larger container. You can use a thick napkin instead of a paper towel if you have to. Place your scones on top of the paper towel. Once your scones have cooled off and reached room temperature, transfer them to your airtight container. Pick each scone up and put it into the container, stacking scones as necessary without pressing down to compress or smash them. Unless you’re storing tons of scones, they should be fine laying on top of one another. Put a second paper towel on top of the scones. Once all of your scones are inside of the container, take a single paper towel and lay it lightly on top of your scones. The paper towels will absorb the moisture in the scones and keep them from getting mushy while they’re drying out in the container. You can use a napkin if you don’t have any paper towels. Close the lid and store your scones at room temperature for 3-4 days. Put the lid on top of your container and close it. Run your hands around the rim of the container to ensure that it’s closed. Store your scones on the countertop or in the pantry for 3-4 days. You may be able store them a little longer, but they’ll start to get stale after more than a few days. If you’re going to reheat the scones, flick a little bit of water on top of them with your fingers before you heat them to put some moisture back into the scones. Freezing Scones for Long-Term Storage Put your scones on a baking sheet and let them cool. Once your scones finish baking, use an oven mitt to pull the scones out of the oven. Transfer the scones to a clean baking sheet and wait 30-40 minutes for the scones to reach room temperature.Alternative: You can also opt to not bake the scones after you’ve cut the dough. Freeze the uncooked scones and when you want to make them, add 3-4 minutes to the cooking time called for in your recipe. If the baking sheet won’t fit in your freezer, you can use a large bowl or plate. Freeze the uncovered scones for 1 hour. Once your scones have reached room temperature, place the baking sheet in the freezer, uncovered. Wait at least 1 hour for the baked scones to initially freeze. This gives the excess moisture time to dissipate so that it doesn’t get trapped in the storage container. Transfer the scones to an airtight container. Any freezer-safe container that can store food will work. Plastic, glass, or unpainted ceramic should all work well with scones. Place your frozen scones in the container, layering them on top of one another as needed and close the lid. Freeze your scones for up to 3 months. Place your scones in the freezer. You can store them for up to 3 months. When you want to reheat the scones, take them out and reheat them in the oven or microwave. If you’re storing unbaked scones, add at least 3 minutes to cooking time when you go to bake them.",
  "sentences":[
    " Storing Scones for a Few Days Wait for your scones to cool to room temperature.",
    "Use an oven mitt to take your scones out of the oven.",
    "Wait 30-40 minutes to give the scones time to cool.",
    "If you put your scones in a container when they’re still warm, the moisture in the scones won’t be able to escape and they’ll get mushy and gross.",
    "Get an airtight food-storage container.",
    "Any food storage container will work.",
    "Ceramic and plastic should both be fine as long as they can be properly sealed to keep air from escaping.",
    "If you store your scones in a container without a lid, they’ll dry out and get stale.Alternative: If you don’t have a container with a lid, you can wrap plastic wrap over a lidless container.",
    "Press your hands around the side of the container to seal it.",
    "Then, put a rubber band around the plastic wrap where it overlaps on the container to keep it from coming loose.",
    "Fold a paper towel over to fit the bottom of the container.",
    "Take a standard paper towel and fold it over so that it fits in the base of the container.",
    "Ideally, you should have 2-3 layers of paper towel at the bottom of the container.",
    "Use 2 paper towels if you’re storing the scones in a larger container.",
    "You can use a thick napkin instead of a paper towel if you have to.",
    "Place your scones on top of the paper towel.",
    "Once your scones have cooled off and reached room temperature, transfer them to your airtight container.",
    "Pick each scone up and put it into the container, stacking scones as necessary without pressing down to compress or smash them.",
    "Unless you’re storing tons of scones, they should be fine laying on top of one another.",
    "Put a second paper towel on top of the scones.",
    "Once all of your scones are inside of the container, take a single paper towel and lay it lightly on top of your scones.",
    "The paper towels will absorb the moisture in the scones and keep them from getting mushy while they’re drying out in the container.",
    "You can use a napkin if you don’t have any paper towels.",
    "Close the lid and store your scones at room temperature for 3-4 days.",
    "Put the lid on top of your container and close it.",
    "Run your hands around the rim of the container to ensure that it’s closed.",
    "Store your scones on the countertop or in the pantry for 3-4 days.",
    "You may be able store them a little longer, but they’ll start to get stale after more than a few days.",
    "If you’re going to reheat the scones, flick a little bit of water on top of them with your fingers before you heat them to put some moisture back into the scones.",
    "Freezing Scones for Long-Term Storage Put your scones on a baking sheet and let them cool.",
    "Once your scones finish baking, use an oven mitt to pull the scones out of the oven.",
    "Transfer the scones to a clean baking sheet and wait 30-40 minutes for the scones to reach room temperature.Alternative: You can also opt to not bake the scones after you’ve cut the dough.",
    "Freeze the uncooked scones and when you want to make them, add 3-4 minutes to the cooking time called for in your recipe.",
    "If the baking sheet won’t fit in your freezer, you can use a large bowl or plate.",
    "Freeze the uncovered scones for 1 hour.",
    "Once your scones have reached room temperature, place the baking sheet in the freezer, uncovered.",
    "Wait at least 1 hour for the baked scones to initially freeze.",
    "This gives the excess moisture time to dissipate so that it doesn’t get trapped in the storage container.",
    "Transfer the scones to an airtight container.",
    "Any freezer-safe container that can store food will work.",
    "Plastic, glass, or unpainted ceramic should all work well with scones.",
    "Place your frozen scones in the container, layering them on top of one another as needed and close the lid.",
    "Freeze your scones for up to 3 months.",
    "Place your scones in the freezer.",
    "You can store them for up to 3 months.",
    "When you want to reheat the scones, take them out and reheat them in the oven or microwave.",
    "If you’re storing unbaked scones, add at least 3 minutes to cooking time when you go to bake them."
  ],
  "tyn_section":[
    "Airtight container",
    "Paper towels",
    "Plastic wrap (optional)",
    "Rubber band (optional)",
    "Baking sheet"
  ],
  "tyn_model":[
    "paper towel",
    "container",
    "baking sheet",
    "paper towels",
    "freezer",
    "oven mitt",
    "oven",
    "plastic wrap",
    "napkin",
    "airtight container",
    "food-storage container",
    "food storage container",
    "plastic",
    "rubber band",
    "water",
    "bowl",
    "plate",
    "storage container",
    "freezer-safe container",
    "microwave"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.15,
    "f1":0.24,
    "avg_pos":0.45
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3,
    "f1":0.4615384615
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.55,
    "f1":0.7096774194
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.25,
    "f1":0.4
  }
}