{
  "title":"How to Cook Gluten Free Pasta",
  "url":"https://www.wikihow.com/Cook-Gluten-Free-Pasta",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "parts":[
    {
      "name":"Boiling the Noodles",
      "steps":[
        {
          "headline":"Fill a large pot about ⅔ full with cold water.",
          "description":"Use the water from your tap to fill your pot. The more pasta you are cooking, the more water you will need. If you are cooking a lot of pasta, like a whole box or bag, use a large pot so that your water will cover all of the noodles. Gluten-free pasta tends to expand as it cooks. If you fill up your pot too much with water, your pasta won’t have enough room. If your pot is too small, it could make the noodles clump together and stick."
        },
        {
          "headline":"Bring your water to a boil over high heat.",
          "description":"It will take your water a few minutes to start boiling, especially if you have a lot of it in your pot. You will know your water is boiling when large bubbles appear."
        },
        {
          "headline":"Salt your water, then bring it back to a boil.",
          "description":"Add 1 to 2 tbsp (5.69 to 11.38 g) of salt to your boiling water. Salt increases the boiling point of water, so you may have to wait a few minutes for it to boil again. Salting your pasta water helps make the pasta less sticky and also adds flavor. Gluten-free pasta in particular lacks flavor, and adding salt can help give it some."
        },
        {
          "headline":"Pour your desired amount of pasta in and stir it immediately.",
          "description":"Your pasta will be extremely sticky when it first hits the water. Use a wooden spoon to stir your pasta immediately after you pour it in the water so that it doesn’t stick to the bottom or the sides of your pot. Your pasta is most likely to stick to the pot in the first 30 seconds after you pour it in."
        },
        {
          "headline":"Set a timer for 8 to 10 minutes.",
          "description":"The bag or box that your pasta came in will tell you how long to cook your noodles for. Usually, this number is between 8 and 10 minutes. Use your phone or your oven timer to set an alarm."
        },
        {
          "headline":"Stir your noodles every 1 to 2 minutes.",
          "description":"Gluten-free pasta needs to be stirred often so that it doesn’t stick together. Use a wooden or metal spoon to stir your pasta every couple of minutes to make sure they stay separated.Tip: If your pot starts to boil over as you stir, reduce the heat slightly."
        },
        {
          "headline":"Check the pasta when your timer goes off to make sure it is cooked.",
          "description":"The cooking time that your pasta recommends can be wrong. Use your spoon to grab a noodle out of the pot and taste it to see if it is cooked enough. The noodle should be firm but not crunchy. Be sure not to overcook your pasta. Gluten-free pasta can get mushy very easily."
        }
      ]
    },
    {
      "name":"Draining Your Pasta",
      "steps":[
        {
          "headline":"Set aside 1 cup (240 mL) of the boiling water if you are using a sauce.",
          "description":"Gluten-free pasta absorbs a lot of liquid once it is cooked. Scoop out some of the boiling pasta water and set it aside to mix with whatever sauce you use to thin it out and make it more spreadable.Tip: Use a metal ladle to make scooping easier."
        },
        {
          "headline":"Set a metal or plastic colander in the sink.",
          "description":"Clear your sink of any dishes and set your colander in a place that it will not tip over. Make sure the holes in your colander are smaller than your pasta pieces."
        },
        {
          "headline":"Pour the pasta into your colander and shake it to remove all the water.",
          "description":"Get as much water as you can out of your pasta by shaking your colander up and down carefully. Make sure your pasta drains fully. Do not rinse your pasta in the colander. This will cool it down and remove the starch, which will make the pasta taste worse."
        },
        {
          "headline":"Put the pasta in the pot or a serving bowl.",
          "description":"Return the pasta back to the pot that you cooked it in, or set it in a serving bowl that you’ll be using to dish it out. Do not set it back on the stove with the heat on, or you could burn your pasta."
        }
      ]
    }
  ],
  "text":" Boiling the Noodles Fill a large pot about ⅔ full with cold water. Use the water from your tap to fill your pot. The more pasta you are cooking, the more water you will need. If you are cooking a lot of pasta, like a whole box or bag, use a large pot so that your water will cover all of the noodles. Gluten-free pasta tends to expand as it cooks. If you fill up your pot too much with water, your pasta won’t have enough room. If your pot is too small, it could make the noodles clump together and stick. Bring your water to a boil over high heat. It will take your water a few minutes to start boiling, especially if you have a lot of it in your pot. You will know your water is boiling when large bubbles appear. Salt your water, then bring it back to a boil. Add 1 to 2 tbsp (5.69 to 11.38 g) of salt to your boiling water. Salt increases the boiling point of water, so you may have to wait a few minutes for it to boil again. Salting your pasta water helps make the pasta less sticky and also adds flavor. Gluten-free pasta in particular lacks flavor, and adding salt can help give it some. Pour your desired amount of pasta in and stir it immediately. Your pasta will be extremely sticky when it first hits the water. Use a wooden spoon to stir your pasta immediately after you pour it in the water so that it doesn’t stick to the bottom or the sides of your pot. Your pasta is most likely to stick to the pot in the first 30 seconds after you pour it in. Set a timer for 8 to 10 minutes. The bag or box that your pasta came in will tell you how long to cook your noodles for. Usually, this number is between 8 and 10 minutes. Use your phone or your oven timer to set an alarm. Stir your noodles every 1 to 2 minutes. Gluten-free pasta needs to be stirred often so that it doesn’t stick together. Use a wooden or metal spoon to stir your pasta every couple of minutes to make sure they stay separated.Tip: If your pot starts to boil over as you stir, reduce the heat slightly. Check the pasta when your timer goes off to make sure it is cooked. The cooking time that your pasta recommends can be wrong. Use your spoon to grab a noodle out of the pot and taste it to see if it is cooked enough. The noodle should be firm but not crunchy. Be sure not to overcook your pasta. Gluten-free pasta can get mushy very easily. Draining Your Pasta Set aside 1 cup (240 mL) of the boiling water if you are using a sauce. Gluten-free pasta absorbs a lot of liquid once it is cooked. Scoop out some of the boiling pasta water and set it aside to mix with whatever sauce you use to thin it out and make it more spreadable.Tip: Use a metal ladle to make scooping easier. Set a metal or plastic colander in the sink. Clear your sink of any dishes and set your colander in a place that it will not tip over. Make sure the holes in your colander are smaller than your pasta pieces. Pour the pasta into your colander and shake it to remove all the water. Get as much water as you can out of your pasta by shaking your colander up and down carefully. Make sure your pasta drains fully. Do not rinse your pasta in the colander. This will cool it down and remove the starch, which will make the pasta taste worse. Put the pasta in the pot or a serving bowl. Return the pasta back to the pot that you cooked it in, or set it in a serving bowl that you’ll be using to dish it out. Do not set it back on the stove with the heat on, or you could burn your pasta.",
  "sentences":[
    " Boiling the Noodles Fill a large pot about ⅔ full with cold water.",
    "Use the water from your tap to fill your pot.",
    "The more pasta you are cooking, the more water you will need.",
    "If you are cooking a lot of pasta, like a whole box or bag, use a large pot so that your water will cover all of the noodles.",
    "Gluten-free pasta tends to expand as it cooks.",
    "If you fill up your pot too much with water, your pasta won’t have enough room.",
    "If your pot is too small, it could make the noodles clump together and stick.",
    "Bring your water to a boil over high heat.",
    "It will take your water a few minutes to start boiling, especially if you have a lot of it in your pot.",
    "You will know your water is boiling when large bubbles appear.",
    "Salt your water, then bring it back to a boil.",
    "Add 1 to 2 tbsp (5.69 to 11.38 g) of salt to your boiling water.",
    "Salt increases the boiling point of water, so you may have to wait a few minutes for it to boil again.",
    "Salting your pasta water helps make the pasta less sticky and also adds flavor.",
    "Gluten-free pasta in particular lacks flavor, and adding salt can help give it some.",
    "Pour your desired amount of pasta in and stir it immediately.",
    "Your pasta will be extremely sticky when it first hits the water.",
    "Use a wooden spoon to stir your pasta immediately after you pour it in the water so that it doesn’t stick to the bottom or the sides of your pot.",
    "Your pasta is most likely to stick to the pot in the first 30 seconds after you pour it in.",
    "Set a timer for 8 to 10 minutes.",
    "The bag or box that your pasta came in will tell you how long to cook your noodles for.",
    "Usually, this number is between 8 and 10 minutes.",
    "Use your phone or your oven timer to set an alarm.",
    "Stir your noodles every 1 to 2 minutes.",
    "Gluten-free pasta needs to be stirred often so that it doesn’t stick together.",
    "Use a wooden or metal spoon to stir your pasta every couple of minutes to make sure they stay separated.Tip: If your pot starts to boil over as you stir, reduce the heat slightly.",
    "Check the pasta when your timer goes off to make sure it is cooked.",
    "The cooking time that your pasta recommends can be wrong.",
    "Use your spoon to grab a noodle out of the pot and taste it to see if it is cooked enough.",
    "The noodle should be firm but not crunchy.",
    "Be sure not to overcook your pasta.",
    "Gluten-free pasta can get mushy very easily.",
    "Draining Your Pasta Set aside 1 cup (240 mL) of the boiling water if you are using a sauce.",
    "Gluten-free pasta absorbs a lot of liquid once it is cooked.",
    "Scoop out some of the boiling pasta water and set it aside to mix with whatever sauce you use to thin it out and make it more spreadable.Tip: Use a metal ladle to make scooping easier.",
    "Set a metal or plastic colander in the sink.",
    "Clear your sink of any dishes and set your colander in a place that it will not tip over.",
    "Make sure the holes in your colander are smaller than your pasta pieces.",
    "Pour the pasta into your colander and shake it to remove all the water.",
    "Get as much water as you can out of your pasta by shaking your colander up and down carefully.",
    "Make sure your pasta drains fully.",
    "Do not rinse your pasta in the colander.",
    "This will cool it down and remove the starch, which will make the pasta taste worse.",
    "Put the pasta in the pot or a serving bowl.",
    "Return the pasta back to the pot that you cooked it in, or set it in a serving bowl that you’ll be using to dish it out.",
    "Do not set it back on the stove with the heat on, or you could burn your pasta."
  ],
  "tyn_section":[
    "Large pot",
    "Wooden or metal spoon",
    "Metal or plastic colander",
    "Metal ladle",
    "Serving bowl (optional)"
  ],
  "tyn_model":[
    "water",
    "pot",
    "colander",
    "salt",
    "large pot",
    "spoon",
    "⅔ full",
    "pasta water",
    "wooden spoon",
    "oven timer",
    "gluten-free pasta",
    "ladle",
    "stove"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0769230769,
    "f1":0.1111111111,
    "avg_pos":0.3076923077
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.3076923077,
    "f1":0.406779661
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.3076923077,
    "f1":0.406779661
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.0769230769,
    "f1":0.1111111111
  }
}