{
  "title":"How to Freeze Stuffed Peppers",
  "url":"https://www.wikihow.com/Freeze-Stuffed-Peppers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Freezing Food"
  ],
  "methods":[
    {
      "name":"Storing on a Tray",
      "steps":[
        {
          "headline":"Arrange the stuffed peppers in a baking dish.",
          "description":"Finish preparing and topping your stuffed peppers, then place the bottoms of the peppers on a 9 by 13 inches (23 by 33 cm) baking pan. Try and space the peppers out evenly, so they can all get equally frozen in storage. If you’re preparing a large number of stuffed peppers at once, you may have to use more than 1 baking dish. Any kind of pepper can be stuffed and frozen."
        },
        {
          "headline":"Cover the dish with 2 layers of plastic wrap to keep it fresh.",
          "description":"Take a long sheet of plastic wrap and secure it across the surface of the baking dish. Tuck the plastic around the edges to ensure that the surface is taut. Once you’ve secured the first sheet, rip off another slightly larger sheet of plastic wrap. Fold this plastic around the edges of the dish again, providing an extra seal of protection for the peppers. Check that both sheets of plastic wrap are secured as tightly as possible."
        },
        {
          "headline":"Wrap the entire tray with aluminum foil.",
          "description":"Insulate the baking dish by ripping away a long, large sheet of foil. As you did with the plastic wrap, tuck the foil around the edges and corners of the dish. Do your best to cover all of the plastic wrap. Write on the current date and the date the food was cooked on top of the foil in permanent marker. The foil serves as an extra layer of protection for the stuffed peppers, preventing them from getting immediate freezer burn."
        },
        {
          "headline":"Keep the dish in the freezer for 1 month for optimal flavor.",
          "description":"Store the wrapped baking tray in an empty corner of your freezer for a little while. Before you place the dish in the freezer, take a moment to label it with the current date. Before you go to defrost and reheat the peppers, check the date to make sure that the peppers are still fresh. If you’ve kept your tray in the freezer for significantly longer than 1 month, your peppers will likely be too freezer burned to enjoy properly."
        },
        {
          "headline":"Defrost the peppers by leaving the dish in the refrigerator for 24 hours.",
          "description":"Decide when you’d like to eat your stuffed peppers, and set the baking dish in an empty section of your fridge. Give the peppers at least 1 night to defrost, so they don’t immediately become watery when reheated. Don’t place the tray into the refrigerator until you’re ready to eat the peppers. Ideally, aim to remove your dish from the refrigerator after 24 hours."
        },
        {
          "headline":"Reheat the food in the oven for 30-40 minutes at 350 °F (177 °C).",
          "description":"Preheat your oven while you pull your peppers out of the refrigerator. Remove the plastic wrap and aluminum foil before setting the baking dish into the oven. Let the stuffed peppers reheat for at least 30 minutes before removing them. Check to see if the peppers are heated all the way through before serving them. If you’d like, feel free to take the peppers out of the oven after 20 minutes to sprinkle some cheese over the surface. Place the peppers back in the oven for another 25-30 minutes to let the cheese melt completely."
        }
      ]
    },
    {
      "name":"Wrapping Individually",
      "steps":[
        {
          "headline":"Cover each pepper in plastic wrap.",
          "description":"Rip off a large sheet of plastic and secure it over the surface of the filling. Hold each pepper upright as you pull and tuck the plastic wrap around the pepper. Try and make the plastic wrap as taut as possible. Feel free to wrap the peppers in a second sheet of plastic wrap. You don’t need to wrap them in aluminum foil. You can also wrap the peppers in wax paper. Place a rubber band around the wax paper to keep the outer skin of the pepper as firm as possible."
        },
        {
          "headline":"Place 4 peppers into a large, freezer-safe bag.",
          "description":"Stack the peppers carefully in a 1 gallon (3,800 mL) freezer-safe plastic bag. Try to push the peppers toward the bottom, so you’re left with enough headspace to close the bag. Once you’ve fully packed the bag, squeeze out any excess air as you seal the bag shut. After the bag is closed, use a permanent marker to label it with the current date and the date the food was cooked. If you don’t have a lot of space in the freezer, try storing 1-2 peppers in smaller, freezer-safe bags. Feel free to use more than 1 bag if you’re storing a large batch of peppers."
        },
        {
          "headline":"Store the bag in the freezer for 6 months.",
          "description":"Find an empty space in your freezer to place the peppers. Try not to lose track of this bag; instead, be sure to use the peppers within a half-year for ultimate freshness. As you arrange the peppers in your freezer, check to make sure that there are no heavy objects that could tip over and crush the stuffed vegetables. If you wait too long to eat your peppers, they might taste freezer burned."
        },
        {
          "headline":"Defrost and reheat the peppers in the microwave for 5 minutes.",
          "description":"Use the defrost button or a lower power setting to begin warming up the unwrapped frozen peppers. Heat the food at a low temperature for 1-2 minutes, or the outer edges look defrosted. Next, microwave the stuffed peppers in the microwave for around 5 minutes before serving them. If you have a stronger microwave, try heating your peppers for less than 5 minutes."
        }
      ]
    }
  ],
  "text":" Storing on a Tray Arrange the stuffed peppers in a baking dish. Finish preparing and topping your stuffed peppers, then place the bottoms of the peppers on a 9 by 13 inches (23 by 33 cm) baking pan. Try and space the peppers out evenly, so they can all get equally frozen in storage. If you’re preparing a large number of stuffed peppers at once, you may have to use more than 1 baking dish. Any kind of pepper can be stuffed and frozen. Cover the dish with 2 layers of plastic wrap to keep it fresh. Take a long sheet of plastic wrap and secure it across the surface of the baking dish. Tuck the plastic around the edges to ensure that the surface is taut. Once you’ve secured the first sheet, rip off another slightly larger sheet of plastic wrap. Fold this plastic around the edges of the dish again, providing an extra seal of protection for the peppers. Check that both sheets of plastic wrap are secured as tightly as possible. Wrap the entire tray with aluminum foil. Insulate the baking dish by ripping away a long, large sheet of foil. As you did with the plastic wrap, tuck the foil around the edges and corners of the dish. Do your best to cover all of the plastic wrap. Write on the current date and the date the food was cooked on top of the foil in permanent marker. The foil serves as an extra layer of protection for the stuffed peppers, preventing them from getting immediate freezer burn. Keep the dish in the freezer for 1 month for optimal flavor. Store the wrapped baking tray in an empty corner of your freezer for a little while. Before you place the dish in the freezer, take a moment to label it with the current date. Before you go to defrost and reheat the peppers, check the date to make sure that the peppers are still fresh. If you’ve kept your tray in the freezer for significantly longer than 1 month, your peppers will likely be too freezer burned to enjoy properly. Defrost the peppers by leaving the dish in the refrigerator for 24 hours. Decide when you’d like to eat your stuffed peppers, and set the baking dish in an empty section of your fridge. Give the peppers at least 1 night to defrost, so they don’t immediately become watery when reheated. Don’t place the tray into the refrigerator until you’re ready to eat the peppers. Ideally, aim to remove your dish from the refrigerator after 24 hours. Reheat the food in the oven for 30-40 minutes at 350 °F (177 °C). Preheat your oven while you pull your peppers out of the refrigerator. Remove the plastic wrap and aluminum foil before setting the baking dish into the oven. Let the stuffed peppers reheat for at least 30 minutes before removing them. Check to see if the peppers are heated all the way through before serving them. If you’d like, feel free to take the peppers out of the oven after 20 minutes to sprinkle some cheese over the surface. Place the peppers back in the oven for another 25-30 minutes to let the cheese melt completely. Wrapping Individually Cover each pepper in plastic wrap. Rip off a large sheet of plastic and secure it over the surface of the filling. Hold each pepper upright as you pull and tuck the plastic wrap around the pepper. Try and make the plastic wrap as taut as possible. Feel free to wrap the peppers in a second sheet of plastic wrap. You don’t need to wrap them in aluminum foil. You can also wrap the peppers in wax paper. Place a rubber band around the wax paper to keep the outer skin of the pepper as firm as possible. Place 4 peppers into a large, freezer-safe bag. Stack the peppers carefully in a 1 gallon (3,800 mL) freezer-safe plastic bag. Try to push the peppers toward the bottom, so you’re left with enough headspace to close the bag. Once you’ve fully packed the bag, squeeze out any excess air as you seal the bag shut. After the bag is closed, use a permanent marker to label it with the current date and the date the food was cooked. If you don’t have a lot of space in the freezer, try storing 1-2 peppers in smaller, freezer-safe bags. Feel free to use more than 1 bag if you’re storing a large batch of peppers. Store the bag in the freezer for 6 months. Find an empty space in your freezer to place the peppers. Try not to lose track of this bag; instead, be sure to use the peppers within a half-year for ultimate freshness. As you arrange the peppers in your freezer, check to make sure that there are no heavy objects that could tip over and crush the stuffed vegetables. If you wait too long to eat your peppers, they might taste freezer burned. Defrost and reheat the peppers in the microwave for 5 minutes. Use the defrost button or a lower power setting to begin warming up the unwrapped frozen peppers. Heat the food at a low temperature for 1-2 minutes, or the outer edges look defrosted. Next, microwave the stuffed peppers in the microwave for around 5 minutes before serving them. If you have a stronger microwave, try heating your peppers for less than 5 minutes.",
  "sentences":[
    " Storing on a Tray Arrange the stuffed peppers in a baking dish.",
    "Finish preparing and topping your stuffed peppers, then place the bottoms of the peppers on a 9 by 13 inches (23 by 33 cm) baking pan.",
    "Try and space the peppers out evenly, so they can all get equally frozen in storage.",
    "If you’re preparing a large number of stuffed peppers at once, you may have to use more than 1 baking dish.",
    "Any kind of pepper can be stuffed and frozen.",
    "Cover the dish with 2 layers of plastic wrap to keep it fresh.",
    "Take a long sheet of plastic wrap and secure it across the surface of the baking dish.",
    "Tuck the plastic around the edges to ensure that the surface is taut.",
    "Once you’ve secured the first sheet, rip off another slightly larger sheet of plastic wrap.",
    "Fold this plastic around the edges of the dish again, providing an extra seal of protection for the peppers.",
    "Check that both sheets of plastic wrap are secured as tightly as possible.",
    "Wrap the entire tray with aluminum foil.",
    "Insulate the baking dish by ripping away a long, large sheet of foil.",
    "As you did with the plastic wrap, tuck the foil around the edges and corners of the dish.",
    "Do your best to cover all of the plastic wrap.",
    "Write on the current date and the date the food was cooked on top of the foil in permanent marker.",
    "The foil serves as an extra layer of protection for the stuffed peppers, preventing them from getting immediate freezer burn.",
    "Keep the dish in the freezer for 1 month for optimal flavor.",
    "Store the wrapped baking tray in an empty corner of your freezer for a little while.",
    "Before you place the dish in the freezer, take a moment to label it with the current date.",
    "Before you go to defrost and reheat the peppers, check the date to make sure that the peppers are still fresh.",
    "If you’ve kept your tray in the freezer for significantly longer than 1 month, your peppers will likely be too freezer burned to enjoy properly.",
    "Defrost the peppers by leaving the dish in the refrigerator for 24 hours.",
    "Decide when you’d like to eat your stuffed peppers, and set the baking dish in an empty section of your fridge.",
    "Give the peppers at least 1 night to defrost, so they don’t immediately become watery when reheated.",
    "Don’t place the tray into the refrigerator until you’re ready to eat the peppers.",
    "Ideally, aim to remove your dish from the refrigerator after 24 hours.",
    "Reheat the food in the oven for 30-40 minutes at 350 °F (177 °C).",
    "Preheat your oven while you pull your peppers out of the refrigerator.",
    "Remove the plastic wrap and aluminum foil before setting the baking dish into the oven.",
    "Let the stuffed peppers reheat for at least 30 minutes before removing them.",
    "Check to see if the peppers are heated all the way through before serving them.",
    "If you’d like, feel free to take the peppers out of the oven after 20 minutes to sprinkle some cheese over the surface.",
    "Place the peppers back in the oven for another 25-30 minutes to let the cheese melt completely.",
    "Wrapping Individually Cover each pepper in plastic wrap.",
    "Rip off a large sheet of plastic and secure it over the surface of the filling.",
    "Hold each pepper upright as you pull and tuck the plastic wrap around the pepper.",
    "Try and make the plastic wrap as taut as possible.",
    "Feel free to wrap the peppers in a second sheet of plastic wrap.",
    "You don’t need to wrap them in aluminum foil.",
    "You can also wrap the peppers in wax paper.",
    "Place a rubber band around the wax paper to keep the outer skin of the pepper as firm as possible.",
    "Place 4 peppers into a large, freezer-safe bag.",
    "Stack the peppers carefully in a 1 gallon (3,800 mL) freezer-safe plastic bag.",
    "Try to push the peppers toward the bottom, so you’re left with enough headspace to close the bag.",
    "Once you’ve fully packed the bag, squeeze out any excess air as you seal the bag shut.",
    "After the bag is closed, use a permanent marker to label it with the current date and the date the food was cooked.",
    "If you don’t have a lot of space in the freezer, try storing 1-2 peppers in smaller, freezer-safe bags.",
    "Feel free to use more than 1 bag if you’re storing a large batch of peppers.",
    "Store the bag in the freezer for 6 months.",
    "Find an empty space in your freezer to place the peppers.",
    "Try not to lose track of this bag; instead, be sure to use the peppers within a half-year for ultimate freshness.",
    "As you arrange the peppers in your freezer, check to make sure that there are no heavy objects that could tip over and crush the stuffed vegetables.",
    "If you wait too long to eat your peppers, they might taste freezer burned.",
    "Defrost and reheat the peppers in the microwave for 5 minutes.",
    "Use the defrost button or a lower power setting to begin warming up the unwrapped frozen peppers.",
    "Heat the food at a low temperature for 1-2 minutes, or the outer edges look defrosted.",
    "Next, microwave the stuffed peppers in the microwave for around 5 minutes before serving them.",
    "If you have a stronger microwave, try heating your peppers for less than 5 minutes."
  ],
  "tyn_section":[
    "9 by 13 inches (23 by 33 cm) baking dish",
    "Plastic wrap",
    "Aluminum foil",
    "Freezer-safe storage bags"
  ],
  "tyn_model":[
    "peppers",
    "plastic wrap",
    "baking dish",
    "freezer",
    "foil",
    "refrigerator",
    "oven",
    "microwave",
    "plastic",
    "aluminum foil",
    "permanent marker",
    "tray",
    "wax paper",
    "baking pan",
    "baking tray",
    "rubber band",
    "freezer-safe plastic bag",
    "vegetables"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1111111111,
    "f1":0.1818181818,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2222222222,
    "f1":0.3076923077
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2222222222,
    "f1":0.3076923077
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1111111111,
    "f1":0.1818181818
  }
}