{
  "title":"How to Make Color Run Powder",
  "url":"https://www.wikihow.com/Make-Color-Run-Powder",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Dyeing Cornstarch",
      "steps":[
        {
          "headline":"Mix cornstarch and water in a large mixing bowl.",
          "description":"Measure 1 cup (125 g) of cornstarch and pour it into a bowl, then slowly add ⁄3–⁄2 cup (79–118 mL) of water and stir the mixture together with a spoon. Once it's all combined, you should have a thick paste that drips slowly when you lift the spoon out of the bowl. Cornstarch may be labeled as cornflour in some places, including the UK. If you don't have cornstarch or cornflour, you can substitute rice flour, which you can find at many Asian markets if your local grocery store doesn't carry it."
        },
        {
          "headline":"Mix in 1  fl oz (30 mL) of icing dye.",
          "description":"Since you want the colorful powder to have a vibrant shade, plan to use a whole bottle of icing dye for each batch you make. Squeeze in the entire bottle, then stir everything until it's fully combined. You may want to put on gloves to protect your hands from the rich dye. Icing dye is a liquid gel that's thicker and more concentrated than traditional food coloring. If you want to create your own custom-colored powder, try mixing different dyes together, as long as they add up to 1  fl oz (30 mL). For instance, you could mix 1/3 of a bottle of green dye and 2/3 of a bottle of blue dye to make a pretty teal shade."
        },
        {
          "headline":"Let the colored cornstarch dry in the mixing bowl for 2 days.",
          "description":"Place the mixing bowl somewhere out-of-the-way where it won't be disturbed, such as a windowsill in your kitchen or on top of your fridge. Then, leave it there for 2 days, or until the surface is cracked and dry. If you live somewhere with very low humidity, it might only take 1 day for it to dry, but plan on leaving it out for 2 days to be sure. In very humid conditions, you might even need 3 days.In a Hurry? Spread the mixture onto a baking sheet, then bake it at 170 °F (77 °C) for 1 hour, stirring every 20 minutes. However, your finished powder might be a little clumpier than if you air-dried it."
        },
        {
          "headline":"Preheat your oven to the hottest temperature once the powder is dry.",
          "description":"When your powdered cornstarch has deep cracks running all across the surface, you can place it in the oven to finish drying it. Start by turning your oven to the highest temperature it will go for about 15 minutes. The oven can preheat while you're transferring the powder to the baking sheet."
        },
        {
          "headline":"Spread the colored chalk powder on a baking sheet.",
          "description":"The dried powder will likely be hard to the touch, so use a fork break it into chunks, then pour the chunks of powder onto a baking sheet. Try to spread it in a thin, even layer, breaking up the chunks as needed. It may help to use a rubber spatula to spread the powder. A 9 in × 13 in (23 cm × 33 cm) or larger pan will be perfect for this."
        },
        {
          "headline":"Turn off the oven and put the powder in for 5 minutes.",
          "description":"You don't want the powder to scorch, so turn off the oven once it's been heating for about 15 minutes. Then, place the baking sheet into the oven and leave it in there for about 5 minutes. This will remove any moisture that might be left in the powder. Keep a close eye on the powder and pull it out if it starts to smell toasty."
        },
        {
          "headline":"Transfer the powder to a blender and pulse it for 30 seconds.",
          "description":"Use an oven mitt to remove the powder from the oven, then carefully shake it into the bowl on your blender. Pulse the powder for about 15-30 seconds, or until you have a fine, chalky powder. You can use a food processor instead, if you prefer."
        },
        {
          "headline":"Store the powder in resealable plastic bags.",
          "description":"The fine, highly-pigmented color run powder is likely to make a mess if you leave it out, so transfer each color to its own bag and seal it tightly until you need it. Keep it in a cool, dry place like a kitchen cabinet, since humidity could cause the powder to become clumpy.Tip: For added convenience, you can use the powder directly from the plastic bags! During the celebration, just grab a handful of powder from the bag, then toss or blow it into the air to create a colorful cloud."
        }
      ]
    },
    {
      "name":"Using Your Color Run Powder",
      "steps":[
        {
          "headline":"Invite friends to your colorful celebration.",
          "description":"You can use color run powder for any kind of celebration, but it will be the most fun if you have a group of friends to enjoy it with! Try making color run powder the next time you're celebrating a gender reveal, field day, or theme party. You can even match the powder to your favorite team's colors for a unique game-day party! For a traditional use of color run powder, celebrate the Indian festival of Holi, which marks the end of winter and beginning of spring. In India, these festivities usually take place city-wide, but you can have your own celebration if your town doesn't participate. Parents: Host a color war for your next kids' party! Make up 3-4 colors of your own color run powder at home. The day of the party, set up bowls of the color war powder outside and give each party guest a white T-shirt to change into. When the party's over, have them change back into their clothes, and collect the T-shirts. Treat the shirts with vinegar to lock in the color, then give each guest their shirt the next time you see them."
        },
        {
          "headline":"Wear old clothes or matching T-shirts.",
          "description":"Even if you do laundry right after you play with your color run powder, there's a chance the rich dye could stain your clothes and shoes. It's best to change into something that you don't mind if it gets stained, like the clothes and shoes you normally wear to work around the house or yard. If you want to preserve the color on your shirts, you might give everyone a plain white T-shirt or a shirt with a logo marking your special occasion. Bring an old towel or blanket if you'll need to get in the car after the color fun."
        },
        {
          "headline":"Wear safety glasses to protect your eyes.",
          "description":"Color run powder is non-toxic and won't hurt you if it gets in your eyes. However, it can be a little uncomfortable to get anything in your eyes, so to prevent that, it's a good idea to put everyone in safety glasses. You might also want to loosely tie a bandana over your face to keep from breathing in any of the powder. Consider putting your phone or camera in a waterproof bag to protect it from the powder."
        },
        {
          "headline":"Toss handfuls of the powder at each other, but aim low.",
          "description":"The real fun of color powder comes from coating your friends in a variety of different colors, so don't be afraid to get messy! However, be considerate and don't throw the powder directly at people's faces. It's non-toxic, but it could still be uncomfortable if someone breathes in the powder or gets it in their eyes. You can also hold the powder in your hand and blow it for a more gentle puff of color. However, be careful not to inhale or you'll breathe in the cornstarch!"
        },
        {
          "headline":"Wash your clothes immediately in cold water if you don't want to keep the color.",
          "description":"There's no guarantee that all of the color will come out of the clothes, but the best chance of restoring their original appearance is to wash them as soon as possible after you finish playing with the powder. It can help to have clothes ready ahead of time for each person to change into so you can start a load of laundry right away. Blot shoes with a rag dampened with cold or cool water."
        },
        {
          "headline":"Preserve the color by spraying the clothes with vinegar.",
          "description":"If you want to keep your color run shirts as a memento, fill a spray bottle with white vinegar and soak the clothes. The colors will bleed somewhat, but the vinegar will also cause them to set into the fabric. Lay the shirt flat to dry. Once it's dry, turn it inside-out, iron it, then put it in the dryer on high heat for about 10 minutes. When you're finished, wash and dry the shirt again according to the care tag. After you do this, the shirt should be safe to include with your regular laundry, as long as you wash it in cold water. The color may fade with repeated washings, but should still be visible."
        }
      ]
    }
  ],
  "text":" Dyeing Cornstarch Mix cornstarch and water in a large mixing bowl. Measure 1 cup (125 g) of cornstarch and pour it into a bowl, then slowly add ⁄3–⁄2 cup (79–118 mL) of water and stir the mixture together with a spoon. Once it's all combined, you should have a thick paste that drips slowly when you lift the spoon out of the bowl. Cornstarch may be labeled as cornflour in some places, including the UK. If you don't have cornstarch or cornflour, you can substitute rice flour, which you can find at many Asian markets if your local grocery store doesn't carry it. Mix in 1  fl oz (30 mL) of icing dye. Since you want the colorful powder to have a vibrant shade, plan to use a whole bottle of icing dye for each batch you make. Squeeze in the entire bottle, then stir everything until it's fully combined. You may want to put on gloves to protect your hands from the rich dye. Icing dye is a liquid gel that's thicker and more concentrated than traditional food coloring. If you want to create your own custom-colored powder, try mixing different dyes together, as long as they add up to 1  fl oz (30 mL). For instance, you could mix 1/3 of a bottle of green dye and 2/3 of a bottle of blue dye to make a pretty teal shade. Let the colored cornstarch dry in the mixing bowl for 2 days. Place the mixing bowl somewhere out-of-the-way where it won't be disturbed, such as a windowsill in your kitchen or on top of your fridge. Then, leave it there for 2 days, or until the surface is cracked and dry. If you live somewhere with very low humidity, it might only take 1 day for it to dry, but plan on leaving it out for 2 days to be sure. In very humid conditions, you might even need 3 days.In a Hurry? Spread the mixture onto a baking sheet, then bake it at 170 °F (77 °C) for 1 hour, stirring every 20 minutes. However, your finished powder might be a little clumpier than if you air-dried it. Preheat your oven to the hottest temperature once the powder is dry. When your powdered cornstarch has deep cracks running all across the surface, you can place it in the oven to finish drying it. Start by turning your oven to the highest temperature it will go for about 15 minutes. The oven can preheat while you're transferring the powder to the baking sheet. Spread the colored chalk powder on a baking sheet. The dried powder will likely be hard to the touch, so use a fork break it into chunks, then pour the chunks of powder onto a baking sheet. Try to spread it in a thin, even layer, breaking up the chunks as needed. It may help to use a rubber spatula to spread the powder. A 9 in × 13 in (23 cm × 33 cm) or larger pan will be perfect for this. Turn off the oven and put the powder in for 5 minutes. You don't want the powder to scorch, so turn off the oven once it's been heating for about 15 minutes. Then, place the baking sheet into the oven and leave it in there for about 5 minutes. This will remove any moisture that might be left in the powder. Keep a close eye on the powder and pull it out if it starts to smell toasty. Transfer the powder to a blender and pulse it for 30 seconds. Use an oven mitt to remove the powder from the oven, then carefully shake it into the bowl on your blender. Pulse the powder for about 15-30 seconds, or until you have a fine, chalky powder. You can use a food processor instead, if you prefer. Store the powder in resealable plastic bags. The fine, highly-pigmented color run powder is likely to make a mess if you leave it out, so transfer each color to its own bag and seal it tightly until you need it. Keep it in a cool, dry place like a kitchen cabinet, since humidity could cause the powder to become clumpy.Tip: For added convenience, you can use the powder directly from the plastic bags! During the celebration, just grab a handful of powder from the bag, then toss or blow it into the air to create a colorful cloud. Using Your Color Run Powder Invite friends to your colorful celebration. You can use color run powder for any kind of celebration, but it will be the most fun if you have a group of friends to enjoy it with! Try making color run powder the next time you're celebrating a gender reveal, field day, or theme party. You can even match the powder to your favorite team's colors for a unique game-day party! For a traditional use of color run powder, celebrate the Indian festival of Holi, which marks the end of winter and beginning of spring. In India, these festivities usually take place city-wide, but you can have your own celebration if your town doesn't participate. Parents: Host a color war for your next kids' party! Make up 3-4 colors of your own color run powder at home. The day of the party, set up bowls of the color war powder outside and give each party guest a white T-shirt to change into. When the party's over, have them change back into their clothes, and collect the T-shirts. Treat the shirts with vinegar to lock in the color, then give each guest their shirt the next time you see them. Wear old clothes or matching T-shirts. Even if you do laundry right after you play with your color run powder, there's a chance the rich dye could stain your clothes and shoes. It's best to change into something that you don't mind if it gets stained, like the clothes and shoes you normally wear to work around the house or yard. If you want to preserve the color on your shirts, you might give everyone a plain white T-shirt or a shirt with a logo marking your special occasion. Bring an old towel or blanket if you'll need to get in the car after the color fun. Wear safety glasses to protect your eyes. Color run powder is non-toxic and won't hurt you if it gets in your eyes. However, it can be a little uncomfortable to get anything in your eyes, so to prevent that, it's a good idea to put everyone in safety glasses. You might also want to loosely tie a bandana over your face to keep from breathing in any of the powder. Consider putting your phone or camera in a waterproof bag to protect it from the powder. Toss handfuls of the powder at each other, but aim low. The real fun of color powder comes from coating your friends in a variety of different colors, so don't be afraid to get messy! However, be considerate and don't throw the powder directly at people's faces. It's non-toxic, but it could still be uncomfortable if someone breathes in the powder or gets it in their eyes. You can also hold the powder in your hand and blow it for a more gentle puff of color. However, be careful not to inhale or you'll breathe in the cornstarch! Wash your clothes immediately in cold water if you don't want to keep the color. There's no guarantee that all of the color will come out of the clothes, but the best chance of restoring their original appearance is to wash them as soon as possible after you finish playing with the powder. It can help to have clothes ready ahead of time for each person to change into so you can start a load of laundry right away. Blot shoes with a rag dampened with cold or cool water. Preserve the color by spraying the clothes with vinegar. If you want to keep your color run shirts as a memento, fill a spray bottle with white vinegar and soak the clothes. The colors will bleed somewhat, but the vinegar will also cause them to set into the fabric. Lay the shirt flat to dry. Once it's dry, turn it inside-out, iron it, then put it in the dryer on high heat for about 10 minutes. When you're finished, wash and dry the shirt again according to the care tag. After you do this, the shirt should be safe to include with your regular laundry, as long as you wash it in cold water. The color may fade with repeated washings, but should still be visible.",
  "sentences":[
    " Dyeing Cornstarch Mix cornstarch and water in a large mixing bowl.",
    "Measure 1 cup (125 g) of cornstarch and pour it into a bowl, then slowly add ⁄3–⁄2 cup (79–118 mL) of water and stir the mixture together with a spoon.",
    "Once it's all combined, you should have a thick paste that drips slowly when you lift the spoon out of the bowl.",
    "Cornstarch may be labeled as cornflour in some places, including the UK.",
    "If you don't have cornstarch or cornflour, you can substitute rice flour, which you can find at many Asian markets if your local grocery store doesn't carry it.",
    "Mix in 1  fl oz (30 mL) of icing dye.",
    "Since you want the colorful powder to have a vibrant shade, plan to use a whole bottle of icing dye for each batch you make.",
    "Squeeze in the entire bottle, then stir everything until it's fully combined.",
    "You may want to put on gloves to protect your hands from the rich dye.",
    "Icing dye is a liquid gel that's thicker and more concentrated than traditional food coloring.",
    "If you want to create your own custom-colored powder, try mixing different dyes together, as long as they add up to 1  fl oz (30 mL).",
    "For instance, you could mix 1/3 of a bottle of green dye and 2/3 of a bottle of blue dye to make a pretty teal shade.",
    "Let the colored cornstarch dry in the mixing bowl for 2 days.",
    "Place the mixing bowl somewhere out-of-the-way where it won't be disturbed, such as a windowsill in your kitchen or on top of your fridge.",
    "Then, leave it there for 2 days, or until the surface is cracked and dry.",
    "If you live somewhere with very low humidity, it might only take 1 day for it to dry, but plan on leaving it out for 2 days to be sure.",
    "In very humid conditions, you might even need 3 days.In a Hurry?",
    "Spread the mixture onto a baking sheet, then bake it at 170 °F (77 °C) for 1 hour, stirring every 20 minutes.",
    "However, your finished powder might be a little clumpier than if you air-dried it.",
    "Preheat your oven to the hottest temperature once the powder is dry.",
    "When your powdered cornstarch has deep cracks running all across the surface, you can place it in the oven to finish drying it.",
    "Start by turning your oven to the highest temperature it will go for about 15 minutes.",
    "The oven can preheat while you're transferring the powder to the baking sheet.",
    "Spread the colored chalk powder on a baking sheet.",
    "The dried powder will likely be hard to the touch, so use a fork break it into chunks, then pour the chunks of powder onto a baking sheet.",
    "Try to spread it in a thin, even layer, breaking up the chunks as needed.",
    "It may help to use a rubber spatula to spread the powder.",
    "A 9 in × 13 in (23 cm × 33 cm) or larger pan will be perfect for this.",
    "Turn off the oven and put the powder in for 5 minutes.",
    "You don't want the powder to scorch, so turn off the oven once it's been heating for about 15 minutes.",
    "Then, place the baking sheet into the oven and leave it in there for about 5 minutes.",
    "This will remove any moisture that might be left in the powder.",
    "Keep a close eye on the powder and pull it out if it starts to smell toasty.",
    "Transfer the powder to a blender and pulse it for 30 seconds.",
    "Use an oven mitt to remove the powder from the oven, then carefully shake it into the bowl on your blender.",
    "Pulse the powder for about 15-30 seconds, or until you have a fine, chalky powder.",
    "You can use a food processor instead, if you prefer.",
    "Store the powder in resealable plastic bags.",
    "The fine, highly-pigmented color run powder is likely to make a mess if you leave it out, so transfer each color to its own bag and seal it tightly until you need it.",
    "Keep it in a cool, dry place like a kitchen cabinet, since humidity could cause the powder to become clumpy.Tip: For added convenience, you can use the powder directly from the plastic bags!",
    "During the celebration, just grab a handful of powder from the bag, then toss or blow it into the air to create a colorful cloud.",
    "Using Your Color Run Powder Invite friends to your colorful celebration.",
    "You can use color run powder for any kind of celebration, but it will be the most fun if you have a group of friends to enjoy it with!",
    "Try making color run powder the next time you're celebrating a gender reveal, field day, or theme party.",
    "You can even match the powder to your favorite team's colors for a unique game-day party!",
    "For a traditional use of color run powder, celebrate the Indian festival of Holi, which marks the end of winter and beginning of spring.",
    "In India, these festivities usually take place city-wide, but you can have your own celebration if your town doesn't participate.",
    "Parents: Host a color war for your next kids' party!",
    "Make up 3-4 colors of your own color run powder at home.",
    "The day of the party, set up bowls of the color war powder outside and give each party guest a white T-shirt to change into.",
    "When the party's over, have them change back into their clothes, and collect the T-shirts.",
    "Treat the shirts with vinegar to lock in the color, then give each guest their shirt the next time you see them.",
    "Wear old clothes or matching T-shirts.",
    "Even if you do laundry right after you play with your color run powder, there's a chance the rich dye could stain your clothes and shoes.",
    "It's best to change into something that you don't mind if it gets stained, like the clothes and shoes you normally wear to work around the house or yard.",
    "If you want to preserve the color on your shirts, you might give everyone a plain white T-shirt or a shirt with a logo marking your special occasion.",
    "Bring an old towel or blanket if you'll need to get in the car after the color fun.",
    "Wear safety glasses to protect your eyes.",
    "Color run powder is non-toxic and won't hurt you if it gets in your eyes.",
    "However, it can be a little uncomfortable to get anything in your eyes, so to prevent that, it's a good idea to put everyone in safety glasses.",
    "You might also want to loosely tie a bandana over your face to keep from breathing in any of the powder.",
    "Consider putting your phone or camera in a waterproof bag to protect it from the powder.",
    "Toss handfuls of the powder at each other, but aim low.",
    "The real fun of color powder comes from coating your friends in a variety of different colors, so don't be afraid to get messy!",
    "However, be considerate and don't throw the powder directly at people's faces.",
    "It's non-toxic, but it could still be uncomfortable if someone breathes in the powder or gets it in their eyes.",
    "You can also hold the powder in your hand and blow it for a more gentle puff of color.",
    "However, be careful not to inhale or you'll breathe in the cornstarch!",
    "Wash your clothes immediately in cold water if you don't want to keep the color.",
    "There's no guarantee that all of the color will come out of the clothes, but the best chance of restoring their original appearance is to wash them as soon as possible after you finish playing with the powder.",
    "It can help to have clothes ready ahead of time for each person to change into so you can start a load of laundry right away.",
    "Blot shoes with a rag dampened with cold or cool water.",
    "Preserve the color by spraying the clothes with vinegar.",
    "If you want to keep your color run shirts as a memento, fill a spray bottle with white vinegar and soak the clothes.",
    "The colors will bleed somewhat, but the vinegar will also cause them to set into the fabric.",
    "Lay the shirt flat to dry.",
    "Once it's dry, turn it inside-out, iron it, then put it in the dryer on high heat for about 10 minutes.",
    "When you're finished, wash and dry the shirt again according to the care tag.",
    "After you do this, the shirt should be safe to include with your regular laundry, as long as you wash it in cold water.",
    "The color may fade with repeated washings, but should still be visible."
  ],
  "tyn_section":[
    "1 cup (125 g) cornstarch",
    "1⁄3",
    "1",
    "⁄",
    "3",
    "–",
    "1⁄2",
    "2",
    " cup (79–118 mL) water",
    "1 oz icing color",
    "Large mixing bowl",
    "Spoon",
    "Latex gloves",
    "Food processor or blender",
    "Baking sheet",
    "Fork",
    "Spatula",
    "Oven mitt",
    "Resealable plastic bags."
  ],
  "tyn_model":[
    "oven",
    "color run powder",
    "cornstarch",
    "water",
    "baking sheet",
    "vinegar",
    "bowl",
    "icing dye",
    "spoon",
    "mixing bowl",
    "blender",
    "powder",
    "dyeing cornstarch",
    "large mixing bowl",
    "cornflour",
    "rice flour",
    "food coloring",
    "green dye",
    "blue dye",
    "colored chalk powder",
    "fork",
    "rubber spatula",
    "× 13",
    "× 33",
    "oven mitt",
    "food processor",
    "resealable plastic bags",
    "color war",
    "bowls",
    "color war powder",
    "towel",
    "bandana",
    "color powder",
    "spray bottle",
    "iron",
    "dryer"
  ],
  "simple_metrics":{
    "r":0.2631578947,
    "p":0.1388888889,
    "f1":0.1818181818,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4210526316,
    "p":0.2777777778,
    "f1":0.3347280335
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4210526316,
    "p":0.3055555556,
    "f1":0.3541247485
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2631578947,
    "p":0.1666666667,
    "f1":0.2040816327
  }
}