{
  "title":"How to Store Old Photos",
  "url":"https://www.wikihow.com/Store-Old-Photos",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographs",
    "Care of Photographs",
    "Storing Photos"
  ],
  "methods":[
    {
      "name":"Preserving Physical Prints",
      "steps":[
        {
          "headline":"Organize your prints into chronological order to make them easier to find.",
          "description":"Lay out your photos and sort them into groups based on how old they are. You don’t need to get the order perfect as long as you’re able to remember where you put your photos. If you want to, remove any photos that are poor-quality or that you don’t want to save. If you don’t know the chronological order, you can also sort by the location in the photo or who’s in each picture. If you have a large photo collection, break the job into smaller chunks so you don’t get overwhelmed. Be sure to wash your hands before handling old photographs so you don’t leave any damaging oil on them."
        },
        {
          "headline":"Use a photo album if you still want to look through your photos regularly.",
          "description":"Get a photo album that uses sleeved pages rather than adhesives or picture corners. Slide 1 picture into each slot on the album pages so they’re displayed in the order you organized them. If there are lines on the sides of the page, you can use them to write a description of the picture. You can buy photo albums with various cover designs from big box stores or photography shops. You can also write descriptions on the backs of the photos using a felt-tip pen or marker. Some photo albums have a set amount of bound pages while others allow you to add more pages later on. Choose a style that works best for you. Photo albums work best for photos that are 5 by 7 inches (13 cm × 18 cm) or smaller."
        },
        {
          "headline":"Place individual prints in acid-free sleeves to keep them safe.",
          "description":"Acid-free sleeves keep your photos flat and prevent them from fading. Get sleeves that match the sizes of your prints so your photos don’t slide around or get damaged. Only use 1 photo per sleeve, and use a felt-tip marker to label the sleeve or the back of the photo with a description. You can buy acid-free sleeves online or from photography stores. Avoid using a ballpoint pen to write descriptions on the sleeves or photos since you could leave dents. If you have larger prints, such as an 8 in × 10 in (20 cm × 25 cm), and aren’t able to find acid-free sleeves, you can also use manilla envelopes."
        },
        {
          "headline":"Store the photos in acid-free boxes for more condensed storage.",
          "description":"Get a photo storage box that’s tall enough for your pictures to stand up straight and is labeled “acid-free.” Put your sleeved photos into the box in the order you laid them out. Fill the box so the photos don’t move around or shift out of place before sealing it closed. You can buy acid-free photo storage boxes online or from photography shops. If you aren’t able to stand the photos up straight, lay them flat on the bottom of the box and carefully stack them so they don’t get damaged. If you aren’t able to get an acid-free storage box, you can also use a shoebox."
        },
        {
          "headline":"Keep photos in an area that’s below 75 °F (24 °C) and has low humidity.",
          "description":"Choose a place that doesn’t receive a lot of light and is away from moisture, such as under your bed, in a closet, or inside of a cabinet drawer. Make sure the temperature doesn’t regularly go over 75 °F (24 °C) since it could damage your photos. Check the humidity using a hygrometer to see if it’s between 15–65%, or else your photos will age more quickly. Avoid storing photos in a garage, attic, or basement since moisture can build up and cause the photos to warp. If you’re putting photos in a storage unit, make sure you can control the climate so your photos don’t age.Tip: Label the outside of your storage boxes or albums so you can find certain photos faster when you need them."
        },
        {
          "headline":"Display old photos with archival frames in areas that don’t get constant light.",
          "description":"If you want to show off older photos, choose frames that have archival glass to help slow down their aging process. Put the photos on walls that are out of direct sunlight so they don’t fade as quickly. When you aren’t in the room with the photos, turn off the lights and close any curtains to preserve them for longer. Choose multiple photos to display so you can cycle through them so they don’t age as quickly."
        }
      ]
    },
    {
      "name":"Digitizing Your Photos",
      "steps":[
        {
          "headline":"Clean the glass on a scanner with a lens cleaner and lint-free cloth.",
          "description":"Open the scanner to reveal the glass scanning surface. Spray the lens cleaner onto the cloth and wipe the glass in a circular motion to remove any dust that’s left on the surface. Make sure there aren’t any streaks on the glass, or else they’ll be visible on your photos when you scan them. Close the scanner so dust doesn’t land on the glass. If you don’t have a scanner at home, you may be able to find one at your local library or a print shop."
        },
        {
          "headline":"Set the scanner so it uploads as a TIFF at 600 DPI.",
          "description":"Access the scanner properties on your computer and check the output file format. Look through the list of file types and choose TIFF so the scan runs at the highest quality. Then look for the DPI (dots per inch) setting and change it to 600 so the photo doesn’t pixelate when you scan it. If you can’t use TIFF as a file format, you can also try using JPG for similar results. If you don’t plan on enlarging the photos, you can also try a 300 DPI setting."
        },
        {
          "headline":"Lay your photos face down on the scanner.",
          "description":"You can usually scan 3–4 pictures at the same time to make the process move faster. Put the pictures against the scanner’s glass so the sides with the images face down. Ensure that the photos lay flat and don’t hang off of the glass. Close the cover so the photos don’t move around. Some scanning software auto-detects photographs while others may make you crop your photos later on."
        },
        {
          "headline":"Name and scan the images onto your computer.",
          "description":"Press the Preview button on your scanner or computer to do a pre-scan so you can see if the photos look okay. If you like how the photos look after the preview, type in a short file name into the box on your screen before clicking “Scan.” The scanner may take a few seconds or minutes to digitize your photographs. For example, you could name a file “family_vacation98” so you can go back and find the images later.Variation: If you don’t have a scanner, lay the photo flat on a table and make sure it’s well lit. Use a camera or your phone to take a picture of the photo from above."
        }
      ]
    },
    {
      "name":"Backing up Digital Photos",
      "steps":[
        {
          "headline":"Upload your photos to a cloud storage site so you can access them anywhere.",
          "description":"Cloud storage sites give you a set amount of space that you access as long as you’re connected to the Internet. Look for a cloud service that meets your needs and choose a plan that matches how much storage you need. Upload the scanned photos to the cloud so they can save. Keep copies of your scanned photos on your computer in case there’s a problem with your cloud services. Many cloud services will give you a free amount of storage, but you can pay to buy more if you want it.Popular Cloud Storage SitesGoogle Photos allows you to upload an unlimited number of photos for free, but they cannot be larger than 16 megapixels.Amazon Prime Photos allows you to upload unlimited pictures in high-quality RAW format as long as you have an Amazon Prime account.Dropbox gives you 2 GB of storage for free, or you can pay annually for additional storage.Try Apple iCloud to upload from your computer or Apple device. You can get 5 GB for free if you have an Apple device, or pay for additional storage."
        },
        {
          "headline":"Get a storage app on your phone if you have pictures there.",
          "description":"Storage apps automatically upload pictures you take on your phone to the Internet so you don’t lose them if you misplace your device. Look for a storage app that fits your needs and create an account. Allow the app to access the photos on your device so it can upload them to cloud so you can access them anywhere. Many large cloud storage services, such as Amazon Prime Photos, Apple iCloud, and Google Photos, have apps so you can access photos you uploaded from your computer as well."
        },
        {
          "headline":"Copy your files onto external hard drives or CDs so you have physical backups.",
          "description":"Get an external drive that’s large enough to hold all of your photos and plug it into your computer. Locate the scanned photos on your computer and place them in a folder so you can copy them easily. Make a copy of that folder to upload to a hard drive or CD so you don’t lose the scans if your computer crashes. You can buy external hard drives from electronics stores. Many photo departments have services where you can transfer files to a CD if you aren’t able to burn them at home."
        }
      ]
    }
  ],
  "text":" Preserving Physical Prints Organize your prints into chronological order to make them easier to find. Lay out your photos and sort them into groups based on how old they are. You don’t need to get the order perfect as long as you’re able to remember where you put your photos. If you want to, remove any photos that are poor-quality or that you don’t want to save. If you don’t know the chronological order, you can also sort by the location in the photo or who’s in each picture. If you have a large photo collection, break the job into smaller chunks so you don’t get overwhelmed. Be sure to wash your hands before handling old photographs so you don’t leave any damaging oil on them. Use a photo album if you still want to look through your photos regularly. Get a photo album that uses sleeved pages rather than adhesives or picture corners. Slide 1 picture into each slot on the album pages so they’re displayed in the order you organized them. If there are lines on the sides of the page, you can use them to write a description of the picture. You can buy photo albums with various cover designs from big box stores or photography shops. You can also write descriptions on the backs of the photos using a felt-tip pen or marker. Some photo albums have a set amount of bound pages while others allow you to add more pages later on. Choose a style that works best for you. Photo albums work best for photos that are 5 by 7 inches (13 cm × 18 cm) or smaller. Place individual prints in acid-free sleeves to keep them safe. Acid-free sleeves keep your photos flat and prevent them from fading. Get sleeves that match the sizes of your prints so your photos don’t slide around or get damaged. Only use 1 photo per sleeve, and use a felt-tip marker to label the sleeve or the back of the photo with a description. You can buy acid-free sleeves online or from photography stores. Avoid using a ballpoint pen to write descriptions on the sleeves or photos since you could leave dents. If you have larger prints, such as an 8 in × 10 in (20 cm × 25 cm), and aren’t able to find acid-free sleeves, you can also use manilla envelopes. Store the photos in acid-free boxes for more condensed storage. Get a photo storage box that’s tall enough for your pictures to stand up straight and is labeled “acid-free.” Put your sleeved photos into the box in the order you laid them out. Fill the box so the photos don’t move around or shift out of place before sealing it closed. You can buy acid-free photo storage boxes online or from photography shops. If you aren’t able to stand the photos up straight, lay them flat on the bottom of the box and carefully stack them so they don’t get damaged. If you aren’t able to get an acid-free storage box, you can also use a shoebox. Keep photos in an area that’s below 75 °F (24 °C) and has low humidity. Choose a place that doesn’t receive a lot of light and is away from moisture, such as under your bed, in a closet, or inside of a cabinet drawer. Make sure the temperature doesn’t regularly go over 75 °F (24 °C) since it could damage your photos. Check the humidity using a hygrometer to see if it’s between 15–65%, or else your photos will age more quickly. Avoid storing photos in a garage, attic, or basement since moisture can build up and cause the photos to warp. If you’re putting photos in a storage unit, make sure you can control the climate so your photos don’t age.Tip: Label the outside of your storage boxes or albums so you can find certain photos faster when you need them. Display old photos with archival frames in areas that don’t get constant light. If you want to show off older photos, choose frames that have archival glass to help slow down their aging process. Put the photos on walls that are out of direct sunlight so they don’t fade as quickly. When you aren’t in the room with the photos, turn off the lights and close any curtains to preserve them for longer. Choose multiple photos to display so you can cycle through them so they don’t age as quickly. Digitizing Your Photos Clean the glass on a scanner with a lens cleaner and lint-free cloth. Open the scanner to reveal the glass scanning surface. Spray the lens cleaner onto the cloth and wipe the glass in a circular motion to remove any dust that’s left on the surface. Make sure there aren’t any streaks on the glass, or else they’ll be visible on your photos when you scan them. Close the scanner so dust doesn’t land on the glass. If you don’t have a scanner at home, you may be able to find one at your local library or a print shop. Set the scanner so it uploads as a TIFF at 600 DPI. Access the scanner properties on your computer and check the output file format. Look through the list of file types and choose TIFF so the scan runs at the highest quality. Then look for the DPI (dots per inch) setting and change it to 600 so the photo doesn’t pixelate when you scan it. If you can’t use TIFF as a file format, you can also try using JPG for similar results. If you don’t plan on enlarging the photos, you can also try a 300 DPI setting. Lay your photos face down on the scanner. You can usually scan 3–4 pictures at the same time to make the process move faster. Put the pictures against the scanner’s glass so the sides with the images face down. Ensure that the photos lay flat and don’t hang off of the glass. Close the cover so the photos don’t move around. Some scanning software auto-detects photographs while others may make you crop your photos later on. Name and scan the images onto your computer. Press the Preview button on your scanner or computer to do a pre-scan so you can see if the photos look okay. If you like how the photos look after the preview, type in a short file name into the box on your screen before clicking “Scan.” The scanner may take a few seconds or minutes to digitize your photographs. For example, you could name a file “family_vacation98” so you can go back and find the images later.Variation: If you don’t have a scanner, lay the photo flat on a table and make sure it’s well lit. Use a camera or your phone to take a picture of the photo from above. Backing up Digital Photos Upload your photos to a cloud storage site so you can access them anywhere. Cloud storage sites give you a set amount of space that you access as long as you’re connected to the Internet. Look for a cloud service that meets your needs and choose a plan that matches how much storage you need. Upload the scanned photos to the cloud so they can save. Keep copies of your scanned photos on your computer in case there’s a problem with your cloud services. Many cloud services will give you a free amount of storage, but you can pay to buy more if you want it.Popular Cloud Storage SitesGoogle Photos allows you to upload an unlimited number of photos for free, but they cannot be larger than 16 megapixels.Amazon Prime Photos allows you to upload unlimited pictures in high-quality RAW format as long as you have an Amazon Prime account.Dropbox gives you 2 GB of storage for free, or you can pay annually for additional storage.Try Apple iCloud to upload from your computer or Apple device. You can get 5 GB for free if you have an Apple device, or pay for additional storage. Get a storage app on your phone if you have pictures there. Storage apps automatically upload pictures you take on your phone to the Internet so you don’t lose them if you misplace your device. Look for a storage app that fits your needs and create an account. Allow the app to access the photos on your device so it can upload them to cloud so you can access them anywhere. Many large cloud storage services, such as Amazon Prime Photos, Apple iCloud, and Google Photos, have apps so you can access photos you uploaded from your computer as well. Copy your files onto external hard drives or CDs so you have physical backups. Get an external drive that’s large enough to hold all of your photos and plug it into your computer. Locate the scanned photos on your computer and place them in a folder so you can copy them easily. Make a copy of that folder to upload to a hard drive or CD so you don’t lose the scans if your computer crashes. You can buy external hard drives from electronics stores. Many photo departments have services where you can transfer files to a CD if you aren’t able to burn them at home.",
  "sentences":[
    " Preserving Physical Prints Organize your prints into chronological order to make them easier to find.",
    "Lay out your photos and sort them into groups based on how old they are.",
    "You don’t need to get the order perfect as long as you’re able to remember where you put your photos.",
    "If you want to, remove any photos that are poor-quality or that you don’t want to save.",
    "If you don’t know the chronological order, you can also sort by the location in the photo or who’s in each picture.",
    "If you have a large photo collection, break the job into smaller chunks so you don’t get overwhelmed.",
    "Be sure to wash your hands before handling old photographs so you don’t leave any damaging oil on them.",
    "Use a photo album if you still want to look through your photos regularly.",
    "Get a photo album that uses sleeved pages rather than adhesives or picture corners.",
    "Slide 1 picture into each slot on the album pages so they’re displayed in the order you organized them.",
    "If there are lines on the sides of the page, you can use them to write a description of the picture.",
    "You can buy photo albums with various cover designs from big box stores or photography shops.",
    "You can also write descriptions on the backs of the photos using a felt-tip pen or marker.",
    "Some photo albums have a set amount of bound pages while others allow you to add more pages later on.",
    "Choose a style that works best for you.",
    "Photo albums work best for photos that are 5 by 7 inches (13 cm × 18 cm) or smaller.",
    "Place individual prints in acid-free sleeves to keep them safe.",
    "Acid-free sleeves keep your photos flat and prevent them from fading.",
    "Get sleeves that match the sizes of your prints so your photos don’t slide around or get damaged.",
    "Only use 1 photo per sleeve, and use a felt-tip marker to label the sleeve or the back of the photo with a description.",
    "You can buy acid-free sleeves online or from photography stores.",
    "Avoid using a ballpoint pen to write descriptions on the sleeves or photos since you could leave dents.",
    "If you have larger prints, such as an 8 in × 10 in (20 cm × 25 cm), and aren’t able to find acid-free sleeves, you can also use manilla envelopes.",
    "Store the photos in acid-free boxes for more condensed storage.",
    "Get a photo storage box that’s tall enough for your pictures to stand up straight and is labeled “acid-free.” Put your sleeved photos into the box in the order you laid them out.",
    "Fill the box so the photos don’t move around or shift out of place before sealing it closed.",
    "You can buy acid-free photo storage boxes online or from photography shops.",
    "If you aren’t able to stand the photos up straight, lay them flat on the bottom of the box and carefully stack them so they don’t get damaged.",
    "If you aren’t able to get an acid-free storage box, you can also use a shoebox.",
    "Keep photos in an area that’s below 75 °F (24 °C) and has low humidity.",
    "Choose a place that doesn’t receive a lot of light and is away from moisture, such as under your bed, in a closet, or inside of a cabinet drawer.",
    "Make sure the temperature doesn’t regularly go over 75 °F (24 °C) since it could damage your photos.",
    "Check the humidity using a hygrometer to see if it’s between 15–65%, or else your photos will age more quickly.",
    "Avoid storing photos in a garage, attic, or basement since moisture can build up and cause the photos to warp.",
    "If you’re putting photos in a storage unit, make sure you can control the climate so your photos don’t age.Tip: Label the outside of your storage boxes or albums so you can find certain photos faster when you need them.",
    "Display old photos with archival frames in areas that don’t get constant light.",
    "If you want to show off older photos, choose frames that have archival glass to help slow down their aging process.",
    "Put the photos on walls that are out of direct sunlight so they don’t fade as quickly.",
    "When you aren’t in the room with the photos, turn off the lights and close any curtains to preserve them for longer.",
    "Choose multiple photos to display so you can cycle through them so they don’t age as quickly.",
    "Digitizing Your Photos Clean the glass on a scanner with a lens cleaner and lint-free cloth.",
    "Open the scanner to reveal the glass scanning surface.",
    "Spray the lens cleaner onto the cloth and wipe the glass in a circular motion to remove any dust that’s left on the surface.",
    "Make sure there aren’t any streaks on the glass, or else they’ll be visible on your photos when you scan them.",
    "Close the scanner so dust doesn’t land on the glass.",
    "If you don’t have a scanner at home, you may be able to find one at your local library or a print shop.",
    "Set the scanner so it uploads as a TIFF at 600 DPI.",
    "Access the scanner properties on your computer and check the output file format.",
    "Look through the list of file types and choose TIFF so the scan runs at the highest quality.",
    "Then look for the DPI (dots per inch) setting and change it to 600 so the photo doesn’t pixelate when you scan it.",
    "If you can’t use TIFF as a file format, you can also try using JPG for similar results.",
    "If you don’t plan on enlarging the photos, you can also try a 300 DPI setting.",
    "Lay your photos face down on the scanner.",
    "You can usually scan 3–4 pictures at the same time to make the process move faster.",
    "Put the pictures against the scanner’s glass so the sides with the images face down.",
    "Ensure that the photos lay flat and don’t hang off of the glass.",
    "Close the cover so the photos don’t move around.",
    "Some scanning software auto-detects photographs while others may make you crop your photos later on.",
    "Name and scan the images onto your computer.",
    "Press the Preview button on your scanner or computer to do a pre-scan so you can see if the photos look okay.",
    "If you like how the photos look after the preview, type in a short file name into the box on your screen before clicking “Scan.” The scanner may take a few seconds or minutes to digitize your photographs.",
    "For example, you could name a file “family_vacation98” so you can go back and find the images later.Variation: If you don’t have a scanner, lay the photo flat on a table and make sure it’s well lit.",
    "Use a camera or your phone to take a picture of the photo from above.",
    "Backing up Digital Photos Upload your photos to a cloud storage site so you can access them anywhere.",
    "Cloud storage sites give you a set amount of space that you access as long as you’re connected to the Internet.",
    "Look for a cloud service that meets your needs and choose a plan that matches how much storage you need.",
    "Upload the scanned photos to the cloud so they can save.",
    "Keep copies of your scanned photos on your computer in case there’s a problem with your cloud services.",
    "Many cloud services will give you a free amount of storage, but you can pay to buy more if you want it.Popular Cloud Storage SitesGoogle Photos allows you to upload an unlimited number of photos for free, but they cannot be larger than 16 megapixels.Amazon Prime Photos allows you to upload unlimited pictures in high-quality RAW format as long as you have an Amazon Prime account.Dropbox gives you 2 GB of storage for free, or you can pay annually for additional storage.Try Apple iCloud to upload from your computer or Apple device.",
    "You can get 5 GB for free if you have an Apple device, or pay for additional storage.",
    "Get a storage app on your phone if you have pictures there.",
    "Storage apps automatically upload pictures you take on your phone to the Internet so you don’t lose them if you misplace your device.",
    "Look for a storage app that fits your needs and create an account.",
    "Allow the app to access the photos on your device so it can upload them to cloud so you can access them anywhere.",
    "Many large cloud storage services, such as Amazon Prime Photos, Apple iCloud, and Google Photos, have apps so you can access photos you uploaded from your computer as well.",
    "Copy your files onto external hard drives or CDs so you have physical backups.",
    "Get an external drive that’s large enough to hold all of your photos and plug it into your computer.",
    "Locate the scanned photos on your computer and place them in a folder so you can copy them easily.",
    "Make a copy of that folder to upload to a hard drive or CD so you don’t lose the scans if your computer crashes.",
    "You can buy external hard drives from electronics stores.",
    "Many photo departments have services where you can transfer files to a CD if you aren’t able to burn them at home."
  ],
  "tyn_section":[
    "Acid-free sleeves or pages",
    "Photo albums",
    "Acid-free storage boxes",
    "Archival frames",
    "Computer",
    "Scanner",
    "Lens cleaner",
    "Lint-free cloth",
    "External hard drives or CDs"
  ],
  "tyn_model":[
    "scanner",
    "photo albums",
    "acid-free sleeves",
    "photo album",
    "photography shops",
    "lens cleaner",
    "oil",
    "adhesives",
    "felt-tip pen",
    "× 18",
    "felt-tip marker",
    "photography stores",
    "ballpoint pen",
    "× 10",
    "× 25",
    "acid-",
    "manilla envelopes",
    "acid-free boxes",
    "photo storage box",
    "“acid",
    "” put",
    "acid-free photo storage boxes",
    "shoebox",
    "albums",
    "lint-free cloth",
    "cloth",
    "tiff",
    "scanning software",
    "computer",
    "“scan",
    "” the",
    "“family_vacation98",
    "” so",
    "camera",
    "cloud storage sites",
    "photos",
    "dropbox gives",
    "icloud",
    "external drive",
    "external hard drives",
    "cd"
  ],
  "simple_metrics":{
    "r":0.5555555556,
    "p":0.1219512195,
    "f1":0.2,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8888888889,
    "p":0.2682926829,
    "f1":0.4121779859
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.2926829268,
    "f1":0.4403669725
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1707317073,
    "f1":0.2718446602
  }
}