{
  "title":"How to Move Heavy Furniture Upstairs",
  "url":"https://www.wikihow.com/Move-Heavy-Furniture-Upstairs",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "methods":[
    {
      "name":"Taking Precautions",
      "steps":[
        {
          "headline":"Disassemble furniture as much as possible before moving it up stairs.",
          "description":"Take apart any heavy furniture that you want to move up stairs if you can do so without damaging it. This will help lighten the load and make things less awkward to carry. For example, you can often remove the backs from chairs or feet from sofas. Even taking the cushions off a couch helps make it a little bit lighter and easier to carry. Always take the drawers out of furniture like dressers and desks before moving them up stairs."
        },
        {
          "headline":"Wrap large pieces of furniture in blankets, shrink wrap, or bubble wrap.",
          "description":"Surround large, heavy furniture with a layer of old blankets, shrink wrap, bubble wrap, or some combination of the 3 things and secure it in place with tape. This will protect the furniture from scratches as well as keep the stairs, walls, and doorways from getting nicked. You don’t necessarily need to wrap small pieces of furniture. However, when you are moving large pieces of heavy furniture up a set of stairs, it’s very likely you will bump it into a wall, stair, or doorframe at some point."
        },
        {
          "headline":"Wear comfortable old clothes, closed-toe shoes, and gloves.",
          "description":"Wear clothes that aren’t too tight or too baggy and that you aren’t worried about tearing or getting dirty. Wear closed-toe shoes to protect your feet and gloves to protect your hands. Gloves are especially important when you’re carrying heavy wooden furniture that could give you splinters."
        },
        {
          "headline":"Get someone else to help you carry furniture or spot you.",
          "description":"Never attempt to carry heavy furniture up a set of stairs on your own. Always get at least 1 helper to assist you so you don’t get hurt or damage your furniture trying to do it yourself.Tip: If you aren’t able to find a helping hand or aren’t confident in your ability to move certain heavy items, it’s best to hire professional movers to get the job done safely for you. Even if you plan on using a dolly to carry furniture up the stairs, you will need a helper to spot you while you walk backwards up the stairs to make sure you don’t trip and end up dropping the dolly back down the stairs."
        },
        {
          "headline":"Decide what angle to carry furniture up the stairs before moving it.",
          "description":"Consider the best way to get the furniture up the stairs and where you need it to go. Look at things like doorways or turns in the stairwell to decide what angle you need to carry the furniture at in order to get it up the stairs. For example, if there is a doorway at the top of the stairs and you need to get a sofa up the stairs and through the door, you will likely need to turn it on its side before carrying it up so you can fit it through the doorway. Consider the shapes of pieces of furniture and the layout of the stairs. For instance, if you have an L-shaped couch and you want to carry it up a set of stairs with a railing, the best way to move it up the stairs would be with the “L” part of the couch hanging over the railing."
        },
        {
          "headline":"Measure first if you aren't sure the furniture will fit.",
          "description":"If something seems like it’s going to be a really tight fit, it’s a good idea to measure the furniture and the route first. For instance, you could measure the length and width of a dresser and the width of the stairs to decide whether you need to carry the dresser straight or sideways."
        }
      ]
    },
    {
      "name":"Carrying Furniture with a Partner",
      "steps":[
        {
          "headline":"Put the strongest person at the bottom of the stairs.",
          "description":"The person who is walking up the stairs last will carry more of the weight. Choose the strongest person for this position.Tip: If you’re moving multiple heavy pieces of furniture up stairs, start with the heaviest piece first and work your way down in weight. That way, as you get more tired you’ll be carrying the lighter items. Always make sure that everyone is comfortable with the amount of weight and the grip they have on the furniture before trying to carry it up the stairs. You can test out carrying it a little ways on flat ground first to see how it feels."
        },
        {
          "headline":"Grab furniture at a high point if you’re carrying it at the top end.",
          "description":"Have the person who will walk backwards up the stairs grab the furniture underneath the highest place they can get a grip on it. This technique helps keep the furniture closest to upright as you carry it and gives it clearance of the stairs. For example, if you are carrying a desk up the stairs, the person who will start walking up the stairs first would grab the desk somewhere just under the top of the desk at 1 end."
        },
        {
          "headline":"Hold the furniture at a low point if you’re on the bottom end.",
          "description":"Have the person who will walk forwards on the other side of the furniture hold the furniture by the lowest point they can get a grip on. This will balance out the weight most efficiently and give it plenty of clearance over the stairs. For instance, if you are carrying a desk up the stairs, the person at the bottom would grab it at a low point close to where the desk sits on the floor."
        },
        {
          "headline":"Bend at your knees and lift with your legs when you pick up furniture.",
          "description":"Don’t bend at your waist or lift with your back when you are picking up heavy furniture. This will help lessen the chances of injury. For instance, if you are going to pick up a heavy sofa, squat down until you can grab the sofa, then thrust up with your legs to lift the sofa off the ground. Don’t bend forward at your waist and attempt to lift the sofa up with your back. Pick up the furniture simultaneously with your partner. Count to 3 and then lift it up together if that makes it easier."
        },
        {
          "headline":"Go at a comfortable pace for both lifters as you carry an item up the stairs.",
          "description":"Make sure that 1 person isn’t going too fast for the other by communicating as you go. Have the person at the top take the lead and set the pace, since they are they one going backwards and need to be more careful to not trip. Try to carry pieces all the way up the stairs without taking breaks if you can. If you need to rest, make sure you can safely set the piece of furniture down and hold it in place so it won’t slide down the stairs or be too hard to pick up again."
        }
      ]
    },
    {
      "name":"Using a Dolly",
      "steps":[
        {
          "headline":"Position a small or medium-sized heavy piece of furniture to a dolly.",
          "description":"Have someone help you lift the piece of furniture onto the dolly. Position it so the longest part of it lines up with the back of the dolly.Tip: A dolly is also known as a hand truck or hand cart. It makes moving heavy loads alone much easier. You still need another person to spot you if you plan to use a dolly to move things up a flight of stairs. For example, if you are moving a narrow dresser, position it on the dolly as it would normally sit on the floor. If you are moving something wide, like a small sofa, turn it on its end so 1 of the sides is sitting on the flat part of the dolly. The dolly method works best for heavy items that are small enough to fit comfortably and securely on the dolly. Don’t use it for tall items that are higher than chest-height when you put them on the dolly. For items bigger than this, it’s safer to carry them up with another person."
        },
        {
          "headline":"Secure the furniture tightly in place with flat hook straps.",
          "description":"Wrap 2-3 straps around the furniture and the back of the dolly. Ratchet them tight so the furniture does not move at all. Flat hook straps are also known as ratchet straps, ratchet tie downs, or ratchet straps."
        },
        {
          "headline":"Roll the dolly backwards towards the stairs.",
          "description":"Stand behind the dolly, grab the handles, and tilt it back towards you. Carefully walk backwards towards the stairs, pulling the dolly along with you, until you reach the bottom stair."
        },
        {
          "headline":"Step backwards up onto the first stair.",
          "description":"Look over your shoulder and carefully step backwards and up onto the first stair with 1 foot. Repeat this for the other foot so you are standing with both feet flat on the bottom stair."
        },
        {
          "headline":"Lean the dolly towards the stairs and pull it up as you step up and back.",
          "description":"Grab the handles of the dolly and tilt it carefully back towards you and the stairs. Slowly and carefully step up and back to the next stair and pull the dolly with you so the wheels are on the first stair. Make sure you feel comfortable with the weight and the movement before you continue the rest of the way up the stairs. Take into account the number of stairs and assess whether you will be able to repeat this the necessary number of times."
        },
        {
          "headline":"Pull the dolly up the stairs 1 stair at a time with someone watching to spot you.",
          "description":"Have a helper stand on the other side of the dolly at the bottom of the stairs and watch as you pull it up 1 stair at a time. Talk to each other as you move up the stairs with them following below and have them warn you if it looks like you are about to make a misstep. Don’t have the person stand too close to the dolly where they wouldn’t be able to get out of the way if you were to drop it. If you are having trouble getting it up a step, the spotter can give it a push from the other side, but make sure you have a good grip on it before they do so."
        }
      ]
    },
    {
      "name":"Using Other Equipment and Techniques",
      "steps":[
        {
          "headline":"Use a 2-person shoulder dolly to lift furniture that is too heavy on its own.",
          "description":"Secure the shoulder harness around each lifter’s shoulders, place the lifting strap under the heavy piece of furniture, and attach the lifting strap to the shoulder harnesses. Squat down, place your palms flat against the item you want to lift, then stand up and straighten out your arms simultaneously to lift it. A shoulder dolly is really a strap system that allows 2 people to lift and carry heavy items more easily. They are also known as moving straps or furniture lifting straps. Keep in mind that it can be quite awkward to carry heavy furniture up stairs with these types of straps. It’s especially important that the strongest person is at the bottom of the stairs."
        },
        {
          "headline":"Carry mattresses with mattress slings to make it more comfortable.",
          "description":"Stand a mattress on its side horizontally and slide the mattress sling under it so it cradles the mattress. Lift up the mattress with a helper and carry it up the stairs to where it needs to go. Mattress slings are a type of strap system that fits tightly around a mattress to help you balance and carry it more easily, especially if the mattress is large and heavy. You might have to tilt the mattress to get it through any doorways or around corners."
        },
        {
          "headline":"Slide furniture into its final position after you get it up the stairs.",
          "description":"Put down a blanket or some flat sheets of cardboard in the hallway or room at the top of the stairs. Set the furniture down on it carefully, then push it to move it along towards the location that you want it in.Tip: A moving blanket, a blanket specifically made for covering and protecting items during moving, is ideal for this because they create minimal friction and will also keep the furniture and floor safe from scratches. This works best on hardwood or uncarpeted floors, but can work on some carpeted floors as well. Cardboard works better than a blanket on a carpeted floor."
        }
      ]
    }
  ],
  "text":" Taking Precautions Disassemble furniture as much as possible before moving it up stairs. Take apart any heavy furniture that you want to move up stairs if you can do so without damaging it. This will help lighten the load and make things less awkward to carry. For example, you can often remove the backs from chairs or feet from sofas. Even taking the cushions off a couch helps make it a little bit lighter and easier to carry. Always take the drawers out of furniture like dressers and desks before moving them up stairs. Wrap large pieces of furniture in blankets, shrink wrap, or bubble wrap. Surround large, heavy furniture with a layer of old blankets, shrink wrap, bubble wrap, or some combination of the 3 things and secure it in place with tape. This will protect the furniture from scratches as well as keep the stairs, walls, and doorways from getting nicked. You don’t necessarily need to wrap small pieces of furniture. However, when you are moving large pieces of heavy furniture up a set of stairs, it’s very likely you will bump it into a wall, stair, or doorframe at some point. Wear comfortable old clothes, closed-toe shoes, and gloves. Wear clothes that aren’t too tight or too baggy and that you aren’t worried about tearing or getting dirty. Wear closed-toe shoes to protect your feet and gloves to protect your hands. Gloves are especially important when you’re carrying heavy wooden furniture that could give you splinters. Get someone else to help you carry furniture or spot you. Never attempt to carry heavy furniture up a set of stairs on your own. Always get at least 1 helper to assist you so you don’t get hurt or damage your furniture trying to do it yourself.Tip: If you aren’t able to find a helping hand or aren’t confident in your ability to move certain heavy items, it’s best to hire professional movers to get the job done safely for you. Even if you plan on using a dolly to carry furniture up the stairs, you will need a helper to spot you while you walk backwards up the stairs to make sure you don’t trip and end up dropping the dolly back down the stairs. Decide what angle to carry furniture up the stairs before moving it. Consider the best way to get the furniture up the stairs and where you need it to go. Look at things like doorways or turns in the stairwell to decide what angle you need to carry the furniture at in order to get it up the stairs. For example, if there is a doorway at the top of the stairs and you need to get a sofa up the stairs and through the door, you will likely need to turn it on its side before carrying it up so you can fit it through the doorway. Consider the shapes of pieces of furniture and the layout of the stairs. For instance, if you have an L-shaped couch and you want to carry it up a set of stairs with a railing, the best way to move it up the stairs would be with the “L” part of the couch hanging over the railing. Measure first if you aren't sure the furniture will fit. If something seems like it’s going to be a really tight fit, it’s a good idea to measure the furniture and the route first. For instance, you could measure the length and width of a dresser and the width of the stairs to decide whether you need to carry the dresser straight or sideways. Carrying Furniture with a Partner Put the strongest person at the bottom of the stairs. The person who is walking up the stairs last will carry more of the weight. Choose the strongest person for this position.Tip: If you’re moving multiple heavy pieces of furniture up stairs, start with the heaviest piece first and work your way down in weight. That way, as you get more tired you’ll be carrying the lighter items. Always make sure that everyone is comfortable with the amount of weight and the grip they have on the furniture before trying to carry it up the stairs. You can test out carrying it a little ways on flat ground first to see how it feels. Grab furniture at a high point if you’re carrying it at the top end. Have the person who will walk backwards up the stairs grab the furniture underneath the highest place they can get a grip on it. This technique helps keep the furniture closest to upright as you carry it and gives it clearance of the stairs. For example, if you are carrying a desk up the stairs, the person who will start walking up the stairs first would grab the desk somewhere just under the top of the desk at 1 end. Hold the furniture at a low point if you’re on the bottom end. Have the person who will walk forwards on the other side of the furniture hold the furniture by the lowest point they can get a grip on. This will balance out the weight most efficiently and give it plenty of clearance over the stairs. For instance, if you are carrying a desk up the stairs, the person at the bottom would grab it at a low point close to where the desk sits on the floor. Bend at your knees and lift with your legs when you pick up furniture. Don’t bend at your waist or lift with your back when you are picking up heavy furniture. This will help lessen the chances of injury. For instance, if you are going to pick up a heavy sofa, squat down until you can grab the sofa, then thrust up with your legs to lift the sofa off the ground. Don’t bend forward at your waist and attempt to lift the sofa up with your back. Pick up the furniture simultaneously with your partner. Count to 3 and then lift it up together if that makes it easier. Go at a comfortable pace for both lifters as you carry an item up the stairs. Make sure that 1 person isn’t going too fast for the other by communicating as you go. Have the person at the top take the lead and set the pace, since they are they one going backwards and need to be more careful to not trip. Try to carry pieces all the way up the stairs without taking breaks if you can. If you need to rest, make sure you can safely set the piece of furniture down and hold it in place so it won’t slide down the stairs or be too hard to pick up again. Using a Dolly Position a small or medium-sized heavy piece of furniture to a dolly. Have someone help you lift the piece of furniture onto the dolly. Position it so the longest part of it lines up with the back of the dolly.Tip: A dolly is also known as a hand truck or hand cart. It makes moving heavy loads alone much easier. You still need another person to spot you if you plan to use a dolly to move things up a flight of stairs. For example, if you are moving a narrow dresser, position it on the dolly as it would normally sit on the floor. If you are moving something wide, like a small sofa, turn it on its end so 1 of the sides is sitting on the flat part of the dolly. The dolly method works best for heavy items that are small enough to fit comfortably and securely on the dolly. Don’t use it for tall items that are higher than chest-height when you put them on the dolly. For items bigger than this, it’s safer to carry them up with another person. Secure the furniture tightly in place with flat hook straps. Wrap 2-3 straps around the furniture and the back of the dolly. Ratchet them tight so the furniture does not move at all. Flat hook straps are also known as ratchet straps, ratchet tie downs, or ratchet straps. Roll the dolly backwards towards the stairs. Stand behind the dolly, grab the handles, and tilt it back towards you. Carefully walk backwards towards the stairs, pulling the dolly along with you, until you reach the bottom stair. Step backwards up onto the first stair. Look over your shoulder and carefully step backwards and up onto the first stair with 1 foot. Repeat this for the other foot so you are standing with both feet flat on the bottom stair. Lean the dolly towards the stairs and pull it up as you step up and back. Grab the handles of the dolly and tilt it carefully back towards you and the stairs. Slowly and carefully step up and back to the next stair and pull the dolly with you so the wheels are on the first stair. Make sure you feel comfortable with the weight and the movement before you continue the rest of the way up the stairs. Take into account the number of stairs and assess whether you will be able to repeat this the necessary number of times. Pull the dolly up the stairs 1 stair at a time with someone watching to spot you. Have a helper stand on the other side of the dolly at the bottom of the stairs and watch as you pull it up 1 stair at a time. Talk to each other as you move up the stairs with them following below and have them warn you if it looks like you are about to make a misstep. Don’t have the person stand too close to the dolly where they wouldn’t be able to get out of the way if you were to drop it. If you are having trouble getting it up a step, the spotter can give it a push from the other side, but make sure you have a good grip on it before they do so. Using Other Equipment and Techniques Use a 2-person shoulder dolly to lift furniture that is too heavy on its own. Secure the shoulder harness around each lifter’s shoulders, place the lifting strap under the heavy piece of furniture, and attach the lifting strap to the shoulder harnesses. Squat down, place your palms flat against the item you want to lift, then stand up and straighten out your arms simultaneously to lift it. A shoulder dolly is really a strap system that allows 2 people to lift and carry heavy items more easily. They are also known as moving straps or furniture lifting straps. Keep in mind that it can be quite awkward to carry heavy furniture up stairs with these types of straps. It’s especially important that the strongest person is at the bottom of the stairs. Carry mattresses with mattress slings to make it more comfortable. Stand a mattress on its side horizontally and slide the mattress sling under it so it cradles the mattress. Lift up the mattress with a helper and carry it up the stairs to where it needs to go. Mattress slings are a type of strap system that fits tightly around a mattress to help you balance and carry it more easily, especially if the mattress is large and heavy. You might have to tilt the mattress to get it through any doorways or around corners. Slide furniture into its final position after you get it up the stairs. Put down a blanket or some flat sheets of cardboard in the hallway or room at the top of the stairs. Set the furniture down on it carefully, then push it to move it along towards the location that you want it in.Tip: A moving blanket, a blanket specifically made for covering and protecting items during moving, is ideal for this because they create minimal friction and will also keep the furniture and floor safe from scratches. This works best on hardwood or uncarpeted floors, but can work on some carpeted floors as well. Cardboard works better than a blanket on a carpeted floor.",
  "sentences":[
    " Taking Precautions Disassemble furniture as much as possible before moving it up stairs.",
    "Take apart any heavy furniture that you want to move up stairs if you can do so without damaging it.",
    "This will help lighten the load and make things less awkward to carry.",
    "For example, you can often remove the backs from chairs or feet from sofas.",
    "Even taking the cushions off a couch helps make it a little bit lighter and easier to carry.",
    "Always take the drawers out of furniture like dressers and desks before moving them up stairs.",
    "Wrap large pieces of furniture in blankets, shrink wrap, or bubble wrap.",
    "Surround large, heavy furniture with a layer of old blankets, shrink wrap, bubble wrap, or some combination of the 3 things and secure it in place with tape.",
    "This will protect the furniture from scratches as well as keep the stairs, walls, and doorways from getting nicked.",
    "You don’t necessarily need to wrap small pieces of furniture.",
    "However, when you are moving large pieces of heavy furniture up a set of stairs, it’s very likely you will bump it into a wall, stair, or doorframe at some point.",
    "Wear comfortable old clothes, closed-toe shoes, and gloves.",
    "Wear clothes that aren’t too tight or too baggy and that you aren’t worried about tearing or getting dirty.",
    "Wear closed-toe shoes to protect your feet and gloves to protect your hands.",
    "Gloves are especially important when you’re carrying heavy wooden furniture that could give you splinters.",
    "Get someone else to help you carry furniture or spot you.",
    "Never attempt to carry heavy furniture up a set of stairs on your own.",
    "Always get at least 1 helper to assist you so you don’t get hurt or damage your furniture trying to do it yourself.Tip: If you aren’t able to find a helping hand or aren’t confident in your ability to move certain heavy items, it’s best to hire professional movers to get the job done safely for you.",
    "Even if you plan on using a dolly to carry furniture up the stairs, you will need a helper to spot you while you walk backwards up the stairs to make sure you don’t trip and end up dropping the dolly back down the stairs.",
    "Decide what angle to carry furniture up the stairs before moving it.",
    "Consider the best way to get the furniture up the stairs and where you need it to go.",
    "Look at things like doorways or turns in the stairwell to decide what angle you need to carry the furniture at in order to get it up the stairs.",
    "For example, if there is a doorway at the top of the stairs and you need to get a sofa up the stairs and through the door, you will likely need to turn it on its side before carrying it up so you can fit it through the doorway.",
    "Consider the shapes of pieces of furniture and the layout of the stairs.",
    "For instance, if you have an L-shaped couch and you want to carry it up a set of stairs with a railing, the best way to move it up the stairs would be with the “L” part of the couch hanging over the railing.",
    "Measure first if you aren't sure the furniture will fit.",
    "If something seems like it’s going to be a really tight fit, it’s a good idea to measure the furniture and the route first.",
    "For instance, you could measure the length and width of a dresser and the width of the stairs to decide whether you need to carry the dresser straight or sideways.",
    "Carrying Furniture with a Partner Put the strongest person at the bottom of the stairs.",
    "The person who is walking up the stairs last will carry more of the weight.",
    "Choose the strongest person for this position.Tip: If you’re moving multiple heavy pieces of furniture up stairs, start with the heaviest piece first and work your way down in weight.",
    "That way, as you get more tired you’ll be carrying the lighter items.",
    "Always make sure that everyone is comfortable with the amount of weight and the grip they have on the furniture before trying to carry it up the stairs.",
    "You can test out carrying it a little ways on flat ground first to see how it feels.",
    "Grab furniture at a high point if you’re carrying it at the top end.",
    "Have the person who will walk backwards up the stairs grab the furniture underneath the highest place they can get a grip on it.",
    "This technique helps keep the furniture closest to upright as you carry it and gives it clearance of the stairs.",
    "For example, if you are carrying a desk up the stairs, the person who will start walking up the stairs first would grab the desk somewhere just under the top of the desk at 1 end.",
    "Hold the furniture at a low point if you’re on the bottom end.",
    "Have the person who will walk forwards on the other side of the furniture hold the furniture by the lowest point they can get a grip on.",
    "This will balance out the weight most efficiently and give it plenty of clearance over the stairs.",
    "For instance, if you are carrying a desk up the stairs, the person at the bottom would grab it at a low point close to where the desk sits on the floor.",
    "Bend at your knees and lift with your legs when you pick up furniture.",
    "Don’t bend at your waist or lift with your back when you are picking up heavy furniture.",
    "This will help lessen the chances of injury.",
    "For instance, if you are going to pick up a heavy sofa, squat down until you can grab the sofa, then thrust up with your legs to lift the sofa off the ground.",
    "Don’t bend forward at your waist and attempt to lift the sofa up with your back.",
    "Pick up the furniture simultaneously with your partner.",
    "Count to 3 and then lift it up together if that makes it easier.",
    "Go at a comfortable pace for both lifters as you carry an item up the stairs.",
    "Make sure that 1 person isn’t going too fast for the other by communicating as you go.",
    "Have the person at the top take the lead and set the pace, since they are they one going backwards and need to be more careful to not trip.",
    "Try to carry pieces all the way up the stairs without taking breaks if you can.",
    "If you need to rest, make sure you can safely set the piece of furniture down and hold it in place so it won’t slide down the stairs or be too hard to pick up again.",
    "Using a Dolly Position a small or medium-sized heavy piece of furniture to a dolly.",
    "Have someone help you lift the piece of furniture onto the dolly.",
    "Position it so the longest part of it lines up with the back of the dolly.Tip: A dolly is also known as a hand truck or hand cart.",
    "It makes moving heavy loads alone much easier.",
    "You still need another person to spot you if you plan to use a dolly to move things up a flight of stairs.",
    "For example, if you are moving a narrow dresser, position it on the dolly as it would normally sit on the floor.",
    "If you are moving something wide, like a small sofa, turn it on its end so 1 of the sides is sitting on the flat part of the dolly.",
    "The dolly method works best for heavy items that are small enough to fit comfortably and securely on the dolly.",
    "Don’t use it for tall items that are higher than chest-height when you put them on the dolly.",
    "For items bigger than this, it’s safer to carry them up with another person.",
    "Secure the furniture tightly in place with flat hook straps.",
    "Wrap 2-3 straps around the furniture and the back of the dolly.",
    "Ratchet them tight so the furniture does not move at all.",
    "Flat hook straps are also known as ratchet straps, ratchet tie downs, or ratchet straps.",
    "Roll the dolly backwards towards the stairs.",
    "Stand behind the dolly, grab the handles, and tilt it back towards you.",
    "Carefully walk backwards towards the stairs, pulling the dolly along with you, until you reach the bottom stair.",
    "Step backwards up onto the first stair.",
    "Look over your shoulder and carefully step backwards and up onto the first stair with 1 foot.",
    "Repeat this for the other foot so you are standing with both feet flat on the bottom stair.",
    "Lean the dolly towards the stairs and pull it up as you step up and back.",
    "Grab the handles of the dolly and tilt it carefully back towards you and the stairs.",
    "Slowly and carefully step up and back to the next stair and pull the dolly with you so the wheels are on the first stair.",
    "Make sure you feel comfortable with the weight and the movement before you continue the rest of the way up the stairs.",
    "Take into account the number of stairs and assess whether you will be able to repeat this the necessary number of times.",
    "Pull the dolly up the stairs 1 stair at a time with someone watching to spot you.",
    "Have a helper stand on the other side of the dolly at the bottom of the stairs and watch as you pull it up 1 stair at a time.",
    "Talk to each other as you move up the stairs with them following below and have them warn you if it looks like you are about to make a misstep.",
    "Don’t have the person stand too close to the dolly where they wouldn’t be able to get out of the way if you were to drop it.",
    "If you are having trouble getting it up a step, the spotter can give it a push from the other side, but make sure you have a good grip on it before they do so.",
    "Using Other Equipment and Techniques Use a 2-person shoulder dolly to lift furniture that is too heavy on its own.",
    "Secure the shoulder harness around each lifter’s shoulders, place the lifting strap under the heavy piece of furniture, and attach the lifting strap to the shoulder harnesses.",
    "Squat down, place your palms flat against the item you want to lift, then stand up and straighten out your arms simultaneously to lift it.",
    "A shoulder dolly is really a strap system that allows 2 people to lift and carry heavy items more easily.",
    "They are also known as moving straps or furniture lifting straps.",
    "Keep in mind that it can be quite awkward to carry heavy furniture up stairs with these types of straps.",
    "It’s especially important that the strongest person is at the bottom of the stairs.",
    "Carry mattresses with mattress slings to make it more comfortable.",
    "Stand a mattress on its side horizontally and slide the mattress sling under it so it cradles the mattress.",
    "Lift up the mattress with a helper and carry it up the stairs to where it needs to go.",
    "Mattress slings are a type of strap system that fits tightly around a mattress to help you balance and carry it more easily, especially if the mattress is large and heavy.",
    "You might have to tilt the mattress to get it through any doorways or around corners.",
    "Slide furniture into its final position after you get it up the stairs.",
    "Put down a blanket or some flat sheets of cardboard in the hallway or room at the top of the stairs.",
    "Set the furniture down on it carefully, then push it to move it along towards the location that you want it in.Tip: A moving blanket, a blanket specifically made for covering and protecting items during moving, is ideal for this because they create minimal friction and will also keep the furniture and floor safe from scratches.",
    "This works best on hardwood or uncarpeted floors, but can work on some carpeted floors as well.",
    "Cardboard works better than a blanket on a carpeted floor."
  ],
  "tyn_section":[
    "Tools to disassemble furniture",
    "Blankets, shrink wrap, or bubble wrap",
    "Tape",
    "Comfortable old clothes",
    "Closed-toe shoes",
    "Gloves",
    "Dolly",
    "Flat hook straps",
    "Shoulder dolly straps",
    "Mattress sling",
    "Blanket or cardboard sheets"
  ],
  "tyn_model":[
    "furniture",
    "dolly",
    "sofa",
    "blanket",
    "gloves",
    "desk",
    "mattress",
    "blankets",
    "shrink wrap",
    "bubble wrap",
    "closed-toe shoes",
    "couch",
    "dresser",
    "flat hook straps",
    "shoulder dolly",
    "mattress slings",
    "cardboard",
    "tape",
    "movers",
    "“l",
    "” part",
    "shoulder harness",
    "mattress sling"
  ],
  "simple_metrics":{
    "r":0.5454545455,
    "p":0.2608695652,
    "f1":0.3529411765,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6363636364,
    "p":0.347826087,
    "f1":0.4497991968
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7272727273,
    "p":0.4782608696,
    "f1":0.5770491803
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6363636364,
    "p":0.3043478261,
    "f1":0.4117647059
  }
}