{
  "title":"How to Paint Vinyl Windows",
  "url":"https://www.wikihow.com/Paint-Vinyl-Windows",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows"
  ],
  "parts":[
    {
      "name":"Cleaning and Sanding the Surface",
      "steps":[
        {
          "headline":"Check the warranty for your vinyl windows.",
          "description":"If your windows are still covered, it's important to find out if painting them will void the warranty. The window manufacturer might ask you to mail them a paint chip with the type of paint and shade you want to paint the windows. Then, they can determine if the paint is safe to use with their windows. If you recently bought the windows, check with the company you bought them from to determine if they're under warranty. If your windows aren't under warranty, there's no need to check your paint choice with the manufacturer."
        },
        {
          "headline":"Unscrew window hardware so it doesn't get covered with paint or primer.",
          "description":"To make it easier to paint the windows, take a screwdriver and unscrew any hardware that you don't want to paint. Place the hardware pieces in a small bag and set it aside. Although you don't have to put the pieces in a bag, this prevents them from getting lost. Consider separating the hardware into labeled baggies if you have a lot of different pieces or styles to keep track of."
        },
        {
          "headline":"Scrub the vinyl frames with soapy water to remove dirt.",
          "description":"Primer and paint won't stick to the vinyl if the material is dirty, which is why it's important to clean them first. Fill a bucket with soapy water and dip a soft cloth into the solution. Rub the cloth over the frames and scrub areas with built-up dirt.Tip: If you also want to clean the glass windows, dip a soft cloth into soapy water and rub it over the glass. Then, spray the windows with water to rinse away dirt and soapy residue. Dry the glass with a soft lint-free cloth. Use a mild dishwashing liquid and avoid working with harsh detergents that also contain solvents or bleach. These could damage the surface and appearance of the vinyl. If the frames have cobwebs or debris, use a soft vacuum attachment to suck them up before you wash the frames."
        },
        {
          "headline":"Rinse the window frames with clean water and dry them with a cloth.",
          "description":"Fill another bucket with clean water and dip a clean cloth into it. Wipe the wet cloth over the frames to rinse off the soapy residue. Then, dry the frames with a soft cloth. If you prefer, turn on a garden hose and spray the window frames with water until they're clean. Avoid using a high-pressure washer to clean the windows because the pressure may loosen or destroy caulking."
        },
        {
          "headline":"Sand the vinyl with 220-grit sandpaper.",
          "description":"Vinyl is too smooth to simply begin painting, because it repels paint. To make the paint adhere, rub 220-grit sandpaper over the entire surface of each window frame. Keep sanding until the surface of the vinyl feels rough. You can damage the vinyl if you use a very coarse sandpaper or rub really hard."
        },
        {
          "headline":"Wipe the frames with a tack cloth to remove the sanding dust.",
          "description":"Tack cloth is a lint-free cloth that contains a slightly sticky substance. This allows you to pick up the sanding dust from the window frame instead of spread it around. You can buy tack cloth at most home improvement stores or online."
        }
      ]
    },
    {
      "name":"Priming the Window Frames",
      "steps":[
        {
          "headline":"Mask off the glass and sides of the frames to protect them from the paint.",
          "description":"Tear off a strip of blue painter's tape that's as long as the glass in the window. Press it along the bottom edge of the glass so the glass is protected but the frame is still visible. Repeat this for each side of the glass. Then, tear strips of blue painter's tape and press them on the opposite side of the frame to protect the wall. If you have a steady hand and aren't worried about getting paint on the glass or wall, you could skip this step."
        },
        {
          "headline":"Apply vinyl-safe primer with a 2 in (5.1 cm) brush.",
          "description":"Use a flat or angled brush depending on which style you're most comfortable with. Dip the brush into the primer and apply an even coat over the entire surface of the frames. It's important to use a primer designed for use on vinyl or the primer may peel off."
        },
        {
          "headline":"Let the primer dry for at least 3 hours.",
          "description":"Read the manufacturer's instructions on your container of primer to see how long you need to wait before applying the paint. Most primers dry to the touch within 30 minutes, but you should wait until they're completely dry. This takes around 2 or 3 hours.Tip: To break the project up, consider prepping the windows 1 day, priming them the next day, and painting them on the third day."
        }
      ]
    },
    {
      "name":"Applying Vinyl-Safe Paint",
      "steps":[
        {
          "headline":"Select a paint that's labeled \"vinyl-safe.\"",
          "description":"Although you can paint the frames in any color, darker colors absorb more heat which can cause the window to warp or crack. Purchase an indoor vinyl-safe paint for interior windows or an exterior vinyl-safe paint for your outdoor windows. Even using a dark color on an interior window can cause the window to warp or crack."
        },
        {
          "headline":"Spread a thin coat of the vinyl-safe paint on the window frame.",
          "description":"Use the clean 2 in (5.1 cm) brush with a flat or angled edge and dip it into the paint. Carefully brush it onto every side of the vinyl window using long, smooth strokes. Work quickly to brush over any drips or globs so the paint dries smoothly.Tip: You could also use a small foam roller to apply the paint to the window frame, especially if the frame is wider than 2 inches (5.1 cm). Some hardware stores rent paint-spraying equipment. Spraying the paint can speed up the process although you'll probably need to mask off more of the windows and the walls."
        },
        {
          "headline":"Let the paint dry for at least 3 hours.",
          "description":"Read the paint manufacturer's instructions about how long to wait before applying more paint. Some manufacturers recommend waiting at least 3 hours so the paint doesn't peel off as you're applying additional coats. The paint may take longer to dry if the weather is really humid."
        },
        {
          "headline":"Apply another 1 to 2 coats of paint.",
          "description":"Unless you're using a dark color, you'll probably want to put on another coat or 2 of paint. Remember to let the paint dry for at least a few hours before brushing on another coat. You may want extra coats of paint if the windows will be exposed to a lot of direct sunlight since this could cause the paint to fade."
        },
        {
          "headline":"Peel away the painter's tape while the last coat is still wet.",
          "description":"Once you've applied the final coat of vinyl-safe paint, take 1 end of the painter's tape and slowly pull it away from the window. Peeling it while the paint is still wet will prevent it from pulling up dried paint. Gather up the tape as you pull so it doesn't fall into the wet frame. You should have a straight line from where the tape was positioned. If you have a slightly scraggly line, go back with a small, fine paintbrush and adjust the line."
        }
      ]
    }
  ],
  "text":" Cleaning and Sanding the Surface Check the warranty for your vinyl windows. If your windows are still covered, it's important to find out if painting them will void the warranty. The window manufacturer might ask you to mail them a paint chip with the type of paint and shade you want to paint the windows. Then, they can determine if the paint is safe to use with their windows. If you recently bought the windows, check with the company you bought them from to determine if they're under warranty. If your windows aren't under warranty, there's no need to check your paint choice with the manufacturer. Unscrew window hardware so it doesn't get covered with paint or primer. To make it easier to paint the windows, take a screwdriver and unscrew any hardware that you don't want to paint. Place the hardware pieces in a small bag and set it aside. Although you don't have to put the pieces in a bag, this prevents them from getting lost. Consider separating the hardware into labeled baggies if you have a lot of different pieces or styles to keep track of. Scrub the vinyl frames with soapy water to remove dirt. Primer and paint won't stick to the vinyl if the material is dirty, which is why it's important to clean them first. Fill a bucket with soapy water and dip a soft cloth into the solution. Rub the cloth over the frames and scrub areas with built-up dirt.Tip: If you also want to clean the glass windows, dip a soft cloth into soapy water and rub it over the glass. Then, spray the windows with water to rinse away dirt and soapy residue. Dry the glass with a soft lint-free cloth. Use a mild dishwashing liquid and avoid working with harsh detergents that also contain solvents or bleach. These could damage the surface and appearance of the vinyl. If the frames have cobwebs or debris, use a soft vacuum attachment to suck them up before you wash the frames. Rinse the window frames with clean water and dry them with a cloth. Fill another bucket with clean water and dip a clean cloth into it. Wipe the wet cloth over the frames to rinse off the soapy residue. Then, dry the frames with a soft cloth. If you prefer, turn on a garden hose and spray the window frames with water until they're clean. Avoid using a high-pressure washer to clean the windows because the pressure may loosen or destroy caulking. Sand the vinyl with 220-grit sandpaper. Vinyl is too smooth to simply begin painting, because it repels paint. To make the paint adhere, rub 220-grit sandpaper over the entire surface of each window frame. Keep sanding until the surface of the vinyl feels rough. You can damage the vinyl if you use a very coarse sandpaper or rub really hard. Wipe the frames with a tack cloth to remove the sanding dust. Tack cloth is a lint-free cloth that contains a slightly sticky substance. This allows you to pick up the sanding dust from the window frame instead of spread it around. You can buy tack cloth at most home improvement stores or online. Priming the Window Frames Mask off the glass and sides of the frames to protect them from the paint. Tear off a strip of blue painter's tape that's as long as the glass in the window. Press it along the bottom edge of the glass so the glass is protected but the frame is still visible. Repeat this for each side of the glass. Then, tear strips of blue painter's tape and press them on the opposite side of the frame to protect the wall. If you have a steady hand and aren't worried about getting paint on the glass or wall, you could skip this step. Apply vinyl-safe primer with a 2 in (5.1 cm) brush. Use a flat or angled brush depending on which style you're most comfortable with. Dip the brush into the primer and apply an even coat over the entire surface of the frames. It's important to use a primer designed for use on vinyl or the primer may peel off. Let the primer dry for at least 3 hours. Read the manufacturer's instructions on your container of primer to see how long you need to wait before applying the paint. Most primers dry to the touch within 30 minutes, but you should wait until they're completely dry. This takes around 2 or 3 hours.Tip: To break the project up, consider prepping the windows 1 day, priming them the next day, and painting them on the third day. Applying Vinyl-Safe Paint Select a paint that's labeled \"vinyl-safe.\" Although you can paint the frames in any color, darker colors absorb more heat which can cause the window to warp or crack. Purchase an indoor vinyl-safe paint for interior windows or an exterior vinyl-safe paint for your outdoor windows. Even using a dark color on an interior window can cause the window to warp or crack. Spread a thin coat of the vinyl-safe paint on the window frame. Use the clean 2 in (5.1 cm) brush with a flat or angled edge and dip it into the paint. Carefully brush it onto every side of the vinyl window using long, smooth strokes. Work quickly to brush over any drips or globs so the paint dries smoothly.Tip: You could also use a small foam roller to apply the paint to the window frame, especially if the frame is wider than 2 inches (5.1 cm). Some hardware stores rent paint-spraying equipment. Spraying the paint can speed up the process although you'll probably need to mask off more of the windows and the walls. Let the paint dry for at least 3 hours. Read the paint manufacturer's instructions about how long to wait before applying more paint. Some manufacturers recommend waiting at least 3 hours so the paint doesn't peel off as you're applying additional coats. The paint may take longer to dry if the weather is really humid. Apply another 1 to 2 coats of paint. Unless you're using a dark color, you'll probably want to put on another coat or 2 of paint. Remember to let the paint dry for at least a few hours before brushing on another coat. You may want extra coats of paint if the windows will be exposed to a lot of direct sunlight since this could cause the paint to fade. Peel away the painter's tape while the last coat is still wet. Once you've applied the final coat of vinyl-safe paint, take 1 end of the painter's tape and slowly pull it away from the window. Peeling it while the paint is still wet will prevent it from pulling up dried paint. Gather up the tape as you pull so it doesn't fall into the wet frame. You should have a straight line from where the tape was positioned. If you have a slightly scraggly line, go back with a small, fine paintbrush and adjust the line.",
  "sentences":[
    " Cleaning and Sanding the Surface Check the warranty for your vinyl windows.",
    "If your windows are still covered, it's important to find out if painting them will void the warranty.",
    "The window manufacturer might ask you to mail them a paint chip with the type of paint and shade you want to paint the windows.",
    "Then, they can determine if the paint is safe to use with their windows.",
    "If you recently bought the windows, check with the company you bought them from to determine if they're under warranty.",
    "If your windows aren't under warranty, there's no need to check your paint choice with the manufacturer.",
    "Unscrew window hardware so it doesn't get covered with paint or primer.",
    "To make it easier to paint the windows, take a screwdriver and unscrew any hardware that you don't want to paint.",
    "Place the hardware pieces in a small bag and set it aside.",
    "Although you don't have to put the pieces in a bag, this prevents them from getting lost.",
    "Consider separating the hardware into labeled baggies if you have a lot of different pieces or styles to keep track of.",
    "Scrub the vinyl frames with soapy water to remove dirt.",
    "Primer and paint won't stick to the vinyl if the material is dirty, which is why it's important to clean them first.",
    "Fill a bucket with soapy water and dip a soft cloth into the solution.",
    "Rub the cloth over the frames and scrub areas with built-up dirt.Tip: If you also want to clean the glass windows, dip a soft cloth into soapy water and rub it over the glass.",
    "Then, spray the windows with water to rinse away dirt and soapy residue.",
    "Dry the glass with a soft lint-free cloth.",
    "Use a mild dishwashing liquid and avoid working with harsh detergents that also contain solvents or bleach.",
    "These could damage the surface and appearance of the vinyl.",
    "If the frames have cobwebs or debris, use a soft vacuum attachment to suck them up before you wash the frames.",
    "Rinse the window frames with clean water and dry them with a cloth.",
    "Fill another bucket with clean water and dip a clean cloth into it.",
    "Wipe the wet cloth over the frames to rinse off the soapy residue.",
    "Then, dry the frames with a soft cloth.",
    "If you prefer, turn on a garden hose and spray the window frames with water until they're clean.",
    "Avoid using a high-pressure washer to clean the windows because the pressure may loosen or destroy caulking.",
    "Sand the vinyl with 220-grit sandpaper.",
    "Vinyl is too smooth to simply begin painting, because it repels paint.",
    "To make the paint adhere, rub 220-grit sandpaper over the entire surface of each window frame.",
    "Keep sanding until the surface of the vinyl feels rough.",
    "You can damage the vinyl if you use a very coarse sandpaper or rub really hard.",
    "Wipe the frames with a tack cloth to remove the sanding dust.",
    "Tack cloth is a lint-free cloth that contains a slightly sticky substance.",
    "This allows you to pick up the sanding dust from the window frame instead of spread it around.",
    "You can buy tack cloth at most home improvement stores or online.",
    "Priming the Window Frames Mask off the glass and sides of the frames to protect them from the paint.",
    "Tear off a strip of blue painter's tape that's as long as the glass in the window.",
    "Press it along the bottom edge of the glass so the glass is protected but the frame is still visible.",
    "Repeat this for each side of the glass.",
    "Then, tear strips of blue painter's tape and press them on the opposite side of the frame to protect the wall.",
    "If you have a steady hand and aren't worried about getting paint on the glass or wall, you could skip this step.",
    "Apply vinyl-safe primer with a 2 in (5.1 cm) brush.",
    "Use a flat or angled brush depending on which style you're most comfortable with.",
    "Dip the brush into the primer and apply an even coat over the entire surface of the frames.",
    "It's important to use a primer designed for use on vinyl or the primer may peel off.",
    "Let the primer dry for at least 3 hours.",
    "Read the manufacturer's instructions on your container of primer to see how long you need to wait before applying the paint.",
    "Most primers dry to the touch within 30 minutes, but you should wait until they're completely dry.",
    "This takes around 2 or 3 hours.Tip: To break the project up, consider prepping the windows 1 day, priming them the next day, and painting them on the third day.",
    "Applying Vinyl-Safe Paint Select a paint that's labeled \"vinyl-safe.\"",
    "Although you can paint the frames in any color, darker colors absorb more heat which can cause the window to warp or crack.",
    "Purchase an indoor vinyl-safe paint for interior windows or an exterior vinyl-safe paint for your outdoor windows.",
    "Even using a dark color on an interior window can cause the window to warp or crack.",
    "Spread a thin coat of the vinyl-safe paint on the window frame.",
    "Use the clean 2 in (5.1 cm) brush with a flat or angled edge and dip it into the paint.",
    "Carefully brush it onto every side of the vinyl window using long, smooth strokes.",
    "Work quickly to brush over any drips or globs so the paint dries smoothly.Tip: You could also use a small foam roller to apply the paint to the window frame, especially if the frame is wider than 2 inches (5.1 cm).",
    "Some hardware stores rent paint-spraying equipment.",
    "Spraying the paint can speed up the process although you'll probably need to mask off more of the windows and the walls.",
    "Let the paint dry for at least 3 hours.",
    "Read the paint manufacturer's instructions about how long to wait before applying more paint.",
    "Some manufacturers recommend waiting at least 3 hours so the paint doesn't peel off as you're applying additional coats.",
    "The paint may take longer to dry if the weather is really humid.",
    "Apply another 1 to 2 coats of paint.",
    "Unless you're using a dark color, you'll probably want to put on another coat or 2 of paint.",
    "Remember to let the paint dry for at least a few hours before brushing on another coat.",
    "You may want extra coats of paint if the windows will be exposed to a lot of direct sunlight since this could cause the paint to fade.",
    "Peel away the painter's tape while the last coat is still wet.",
    "Once you've applied the final coat of vinyl-safe paint, take 1 end of the painter's tape and slowly pull it away from the window.",
    "Peeling it while the paint is still wet will prevent it from pulling up dried paint.",
    "Gather up the tape as you pull so it doesn't fall into the wet frame.",
    "You should have a straight line from where the tape was positioned.",
    "If you have a slightly scraggly line, go back with a small, fine paintbrush and adjust the line."
  ],
  "tyn_section":[
    "Screwdriver",
    "220-grit sandpaper",
    "Mild soap",
    "Soft cloths",
    "Bucket",
    "Tack cloth",
    "Garden hose, optional",
    "Painter's tape",
    "2 in (5.1 cm) flat or angled paintbrush",
    "Applying a Vinyl-Safe Paint",
    "Vinyl-safe primer",
    "Vinyl-safe paint"
  ],
  "tyn_model":[
    "paint",
    "primer",
    "water",
    "vinyl-safe paint",
    "soapy water",
    "tack cloth",
    "bucket",
    "220-grit sandpaper",
    "blue painter's tape",
    "painter's tape",
    "tape",
    "window manufacturer",
    "screwdriver",
    "cloth",
    "garden hose",
    "vinyl",
    "sandpaper",
    "vinyl-safe primer",
    "primers",
    "vinyl-safe",
    "foam roller",
    "paint-spraying"
  ],
  "simple_metrics":{
    "r":0.5833333333,
    "p":0.3181818182,
    "f1":0.4117647059,
    "avg_pos":0.5454545455
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.6363636364,
    "f1":0.6511627907
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.6363636364,
    "f1":0.6511627907
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5833333333,
    "p":0.3636363636,
    "f1":0.448
  }
}