{
  "title":"How to Recover a Chair Cushion",
  "url":"https://www.wikihow.com/Recover-a-Chair-Cushion",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Chairs and Seating"
  ],
  "methods":[
    {
      "name":"Removing the Old Fabric and Measuring",
      "steps":[
        {
          "headline":"Disassemble the chair to remove the seat and make things easier.",
          "description":"Flip the chair over to see how the cushion is attached to the seat. If the cushion is stapled into the frame, use a flathead screwdriver to pry the staples out of the wood. If the seat is screwed into place, grab a Philips or flathead screwdriver and remove the screws by turning them counterclockwise. Then, lift the seat off of the frame."
        },
        {
          "headline":"Remove the old cover by removing the staples if you’d like.",
          "description":"You can remove the old fabric or simply cover it with your new fabric. Remove all of the staples with a flathead screwdriver or staple remover. Slide your screwdriver under the staple and move the handle up to pop each staple off. If you’re using a staple remover, wrap the jaws around each staple and pull it off. Pry every staple out and pull the fabric cover up to remove it. If you notice that the interior cushion is made out of loose stuffing, consider simply covering over the old fabric to make things easier. If you do want to replace the stuffing, buy a foam pad for a cushion online or at a local craft store. You can also buy loose cotton stuffing and pat it down while you wrap the fabric around it. You can use a staple removing tool if you prefer, but the staples that go into cushions tend to be a little too strong for a standard staple remover. You don’t need to remove the old cover if you don’t want to. You can always add a new layer of fabric on top of your old cushion."
        },
        {
          "headline":"Pry the old fabric off of the old cover if it won’t come off.",
          "description":"If the fabric won’t come up after you remove the staples, put on a thick pair of gloves to avoid cutting yourself on any screws or nails you may have missed. Carefully pull the upholstery off by ripping it off of the glue or internal staples. If it is stapled into the frame under the foam padding, use a screwdriver, utility knife, or angled scraper to remove the staples. This step can be kind of messy since it’s hard to know what’s keeping your cushion in place. There may be internal staples or glue that you simply can’t see. If you think you’re going to destroy the cushion by removing the old upholstery, recover your cushion by adding fabric on top of the old cover. If you’re only adding a new cover over your old upholstery, skip this step."
        },
        {
          "headline":"Measure the seat of your chair to get your fabric dimensions.",
          "description":"If your old upholstery is ripped up, measure the old cushion using a measuring tape. Note the length and width and write the numbers down on a piece of paper so that you don’t forget them. Add 4–8 in (10–20 cm) to each side to ensure that you have enough room to fold the cushion over the padding. If the old cover wasn’t destroyed when you removed it, you measure it on a flat surface to determine how much fabric you need.Tip: It’s better to have too much fabric than too little. You can always trim excess fabric after you’ve installed it, but it’s impossible to stretch fabric father than it can go."
        },
        {
          "headline":"Purchase your new fabric at a store or online.",
          "description":"Either visit your local crafts store or pick a new fabric out online and get it delivered. Get enough fabric to cover the surface of your cushion and don’t forget to add 4–8 in (10–20 cm) of extra fabric on each side. This should provide more than enough space to work with when you recover your cushion. Cotton, polyester, and velvet are all excellent choices when it comes to cushion fabrics."
        }
      ]
    },
    {
      "name":"Cutting Your New Fabric",
      "steps":[
        {
          "headline":"Trace your new cover out on your new fabric.",
          "description":"Take the dimensions for your cushion and transfer them on to the new fabric. Sketch your cushion out as a single square or rectangle to minimize the number of cuts you need to make. Use a fabric marker or fabric chalk to sketch the dimensions where you’re going to cut the cushion out. You can use a permanent marker if you don’t have a fabric marker. You’re going to tuck the edges under the seat so nobody should see any excess marks you make. If your new fabric has a pattern, make sure that the pattern lines up with the edges so that it looks even and direction that you want. For circular cushions, place the cushion in the center of your fabric, then, trace around the outside of the seat, leaving an extra 4–8 in (10–20 cm) on each side."
        },
        {
          "headline":"Use a rotary cutter or scissors to cut your new fabric out.",
          "description":"If your fabric is thicker, put a cutting board underneath the fabric after sketching it out. Then, use a rotary cutter to cut the outline of your cushion out, moving the cutting board as needed protect your work surface. If your fabric is thinner, feel free to use sewing scissors to cut around the outline you’ve drawn.Tip: Your cuts don’t really need to be perfect, so don’t worry if you mess up at all. The area around the outline is going to be pulled underneath the cushion, so nobody is going to see your mistakes. If you’re using a rotary cutter, feel free to use a straight edge to keep your cuts clean. They don’t need to be immaculate, though. You can always trim the fabric once you’ve attached it to the cushion. Trim any loose threads hanging off of your fabric. This will keep your upholstery from unravelling over time."
        },
        {
          "headline":"Test your fabric by holding it over the cushion to ensure that it fits.",
          "description":"To make sure that your cuts are accurate, hold the cushion over the foam pad and seat. Fold the fabric temporarily underneath the chair to ensure that your new upholstery will fit. So long as you have some excess fabric to work with underneath the seat on each side, you’re ready to install the fabric. If your fabric doesn’t fit, cut a new outline out. Add length to each side as needed to completely cover the cushion."
        }
      ]
    },
    {
      "name":"Installing Your New Cushion",
      "steps":[
        {
          "headline":"Place your fabric upside down a flat surface.",
          "description":"Lay your cushion upside down on top of the fabric. Place your foam pad on top of the fabric with the cushion on top of the foam pad. Place each piece in the center of the material. Adjust the fabric as needed so that it’s flat and centered on top of your seat. If you left the foam pad attached to your cushion, place it upside down so that the bottom of the chair is facing up."
        },
        {
          "headline":"Fold one side of the fabric over the bottom of the seat and staple it.",
          "description":"Press down on your cushion a little to brace it with your nondominant hand. This will keep it still while you make your first fold. Use your dominant hand to lift the center of the edge up over the cushion. Hold it in place and move your nondominant hand over to the fold to press it into the cushion. Grab a staple gun and staple the center before applying more staples to the left and right of the center. Leave the last 3–4 in (7.6–10.2 cm) near the edge unstapled. This way you’ll be able to fold the corners over when you’re done. For a round cushion, pinch the fabric together while pulling it over the edge of the cushion so that it stays tight. Start by completing roughly 1/4 of your fabric on any side. Place 1 staple every 1–2 inches (2.5–5.1 cm) along the rim of the cushion."
        },
        {
          "headline":"Staple the opposite side of the seat into the cushion after pulling it tight.",
          "description":"Use the same process to staple the other sides of your fabric. Start with the end on the opposite side from where you started. Pull the fabric in the center so that it is tight on top. Add 1 staple every 1–2 inches (2.5–5.1 cm) based on your preferences and leave the last 3–4 in (7.6–10.2 cm) unstapled near the corners. You don’t need to pull the fabric very hard to keep it tight. It’s okay if there isn’t a ton of tension in the fabric. Once you’ve stapled 1/4 of a round cushion, go to the opposite side and staple that section. Pinch the fabric as you’re folding it over the seat the same way you did on the opposite side."
        },
        {
          "headline":"Fold your last 2 sides over, tucking your corners as you staple.",
          "description":"With your 2 remaining sides, tuck each corner as you’re stapling it into the cushion or chair. As you pull a side tight, staple the center. Then, work your way towards the edge, stapling as you go. At the corner, fold the excess fabric near the edge underneath itself like you’re wrapping a birthday present. Lift the corner up and slide one side of the fabric underneath the corner as you lay it down over itself. Then, staple it into the frame on the adjacent side to conceal it under the seat. Repeat this process on the other side to finish stapling all 4 sides. Tuck each corner in towards the center of the seat so that it doesn’t stick out on the sides. You can really fold your corners however you’d like. So long as your excess fabric is concealed, it doesn’t really matter how it is folded. With a round cushion, you may notice larger lengths of fabric remaining where your remaining sections meet the first 2 sides that you stapled. For these corners, pull the fabric a little tighter and layer the cloth on top of itself like an accordion. Place 2-3 extra staples along these sections where the fabric meets."
        },
        {
          "headline":"Trim any excess fabric before reinstalling the seat.",
          "description":"Use sewing scissors or a utility knife to trim any unnecessary fabric hanging out past your staples. Cut any loose threads and add staples as needed to secure the fabric to the seat. Then, reattach the cushion to the chair. Either screw the seat back into the chair or place wood glue along the top of the chair’s frame before reattaching it. If the seat was stapled into the frame, use staples to reattach it.Tip: You can remove staples that you misplace with pliers or a flathead screwdriver."
        }
      ]
    }
  ],
  "text":" Removing the Old Fabric and Measuring Disassemble the chair to remove the seat and make things easier. Flip the chair over to see how the cushion is attached to the seat. If the cushion is stapled into the frame, use a flathead screwdriver to pry the staples out of the wood. If the seat is screwed into place, grab a Philips or flathead screwdriver and remove the screws by turning them counterclockwise. Then, lift the seat off of the frame. Remove the old cover by removing the staples if you’d like. You can remove the old fabric or simply cover it with your new fabric. Remove all of the staples with a flathead screwdriver or staple remover. Slide your screwdriver under the staple and move the handle up to pop each staple off. If you’re using a staple remover, wrap the jaws around each staple and pull it off. Pry every staple out and pull the fabric cover up to remove it. If you notice that the interior cushion is made out of loose stuffing, consider simply covering over the old fabric to make things easier. If you do want to replace the stuffing, buy a foam pad for a cushion online or at a local craft store. You can also buy loose cotton stuffing and pat it down while you wrap the fabric around it. You can use a staple removing tool if you prefer, but the staples that go into cushions tend to be a little too strong for a standard staple remover. You don’t need to remove the old cover if you don’t want to. You can always add a new layer of fabric on top of your old cushion. Pry the old fabric off of the old cover if it won’t come off. If the fabric won’t come up after you remove the staples, put on a thick pair of gloves to avoid cutting yourself on any screws or nails you may have missed. Carefully pull the upholstery off by ripping it off of the glue or internal staples. If it is stapled into the frame under the foam padding, use a screwdriver, utility knife, or angled scraper to remove the staples. This step can be kind of messy since it’s hard to know what’s keeping your cushion in place. There may be internal staples or glue that you simply can’t see. If you think you’re going to destroy the cushion by removing the old upholstery, recover your cushion by adding fabric on top of the old cover. If you’re only adding a new cover over your old upholstery, skip this step. Measure the seat of your chair to get your fabric dimensions. If your old upholstery is ripped up, measure the old cushion using a measuring tape. Note the length and width and write the numbers down on a piece of paper so that you don’t forget them. Add 4–8 in (10–20 cm) to each side to ensure that you have enough room to fold the cushion over the padding. If the old cover wasn’t destroyed when you removed it, you measure it on a flat surface to determine how much fabric you need.Tip: It’s better to have too much fabric than too little. You can always trim excess fabric after you’ve installed it, but it’s impossible to stretch fabric father than it can go. Purchase your new fabric at a store or online. Either visit your local crafts store or pick a new fabric out online and get it delivered. Get enough fabric to cover the surface of your cushion and don’t forget to add 4–8 in (10–20 cm) of extra fabric on each side. This should provide more than enough space to work with when you recover your cushion. Cotton, polyester, and velvet are all excellent choices when it comes to cushion fabrics. Cutting Your New Fabric Trace your new cover out on your new fabric. Take the dimensions for your cushion and transfer them on to the new fabric. Sketch your cushion out as a single square or rectangle to minimize the number of cuts you need to make. Use a fabric marker or fabric chalk to sketch the dimensions where you’re going to cut the cushion out. You can use a permanent marker if you don’t have a fabric marker. You’re going to tuck the edges under the seat so nobody should see any excess marks you make. If your new fabric has a pattern, make sure that the pattern lines up with the edges so that it looks even and direction that you want. For circular cushions, place the cushion in the center of your fabric, then, trace around the outside of the seat, leaving an extra 4–8 in (10–20 cm) on each side. Use a rotary cutter or scissors to cut your new fabric out. If your fabric is thicker, put a cutting board underneath the fabric after sketching it out. Then, use a rotary cutter to cut the outline of your cushion out, moving the cutting board as needed protect your work surface. If your fabric is thinner, feel free to use sewing scissors to cut around the outline you’ve drawn.Tip: Your cuts don’t really need to be perfect, so don’t worry if you mess up at all. The area around the outline is going to be pulled underneath the cushion, so nobody is going to see your mistakes. If you’re using a rotary cutter, feel free to use a straight edge to keep your cuts clean. They don’t need to be immaculate, though. You can always trim the fabric once you’ve attached it to the cushion. Trim any loose threads hanging off of your fabric. This will keep your upholstery from unravelling over time. Test your fabric by holding it over the cushion to ensure that it fits. To make sure that your cuts are accurate, hold the cushion over the foam pad and seat. Fold the fabric temporarily underneath the chair to ensure that your new upholstery will fit. So long as you have some excess fabric to work with underneath the seat on each side, you’re ready to install the fabric. If your fabric doesn’t fit, cut a new outline out. Add length to each side as needed to completely cover the cushion. Installing Your New Cushion Place your fabric upside down a flat surface. Lay your cushion upside down on top of the fabric. Place your foam pad on top of the fabric with the cushion on top of the foam pad. Place each piece in the center of the material. Adjust the fabric as needed so that it’s flat and centered on top of your seat. If you left the foam pad attached to your cushion, place it upside down so that the bottom of the chair is facing up. Fold one side of the fabric over the bottom of the seat and staple it. Press down on your cushion a little to brace it with your nondominant hand. This will keep it still while you make your first fold. Use your dominant hand to lift the center of the edge up over the cushion. Hold it in place and move your nondominant hand over to the fold to press it into the cushion. Grab a staple gun and staple the center before applying more staples to the left and right of the center. Leave the last 3–4 in (7.6–10.2 cm) near the edge unstapled. This way you’ll be able to fold the corners over when you’re done. For a round cushion, pinch the fabric together while pulling it over the edge of the cushion so that it stays tight. Start by completing roughly 1/4 of your fabric on any side. Place 1 staple every 1–2 inches (2.5–5.1 cm) along the rim of the cushion. Staple the opposite side of the seat into the cushion after pulling it tight. Use the same process to staple the other sides of your fabric. Start with the end on the opposite side from where you started. Pull the fabric in the center so that it is tight on top. Add 1 staple every 1–2 inches (2.5–5.1 cm) based on your preferences and leave the last 3–4 in (7.6–10.2 cm) unstapled near the corners. You don’t need to pull the fabric very hard to keep it tight. It’s okay if there isn’t a ton of tension in the fabric. Once you’ve stapled 1/4 of a round cushion, go to the opposite side and staple that section. Pinch the fabric as you’re folding it over the seat the same way you did on the opposite side. Fold your last 2 sides over, tucking your corners as you staple. With your 2 remaining sides, tuck each corner as you’re stapling it into the cushion or chair. As you pull a side tight, staple the center. Then, work your way towards the edge, stapling as you go. At the corner, fold the excess fabric near the edge underneath itself like you’re wrapping a birthday present. Lift the corner up and slide one side of the fabric underneath the corner as you lay it down over itself. Then, staple it into the frame on the adjacent side to conceal it under the seat. Repeat this process on the other side to finish stapling all 4 sides. Tuck each corner in towards the center of the seat so that it doesn’t stick out on the sides. You can really fold your corners however you’d like. So long as your excess fabric is concealed, it doesn’t really matter how it is folded. With a round cushion, you may notice larger lengths of fabric remaining where your remaining sections meet the first 2 sides that you stapled. For these corners, pull the fabric a little tighter and layer the cloth on top of itself like an accordion. Place 2-3 extra staples along these sections where the fabric meets. Trim any excess fabric before reinstalling the seat. Use sewing scissors or a utility knife to trim any unnecessary fabric hanging out past your staples. Cut any loose threads and add staples as needed to secure the fabric to the seat. Then, reattach the cushion to the chair. Either screw the seat back into the chair or place wood glue along the top of the chair’s frame before reattaching it. If the seat was stapled into the frame, use staples to reattach it.Tip: You can remove staples that you misplace with pliers or a flathead screwdriver.",
  "sentences":[
    " Removing the Old Fabric and Measuring Disassemble the chair to remove the seat and make things easier.",
    "Flip the chair over to see how the cushion is attached to the seat.",
    "If the cushion is stapled into the frame, use a flathead screwdriver to pry the staples out of the wood.",
    "If the seat is screwed into place, grab a Philips or flathead screwdriver and remove the screws by turning them counterclockwise.",
    "Then, lift the seat off of the frame.",
    "Remove the old cover by removing the staples if you’d like.",
    "You can remove the old fabric or simply cover it with your new fabric.",
    "Remove all of the staples with a flathead screwdriver or staple remover.",
    "Slide your screwdriver under the staple and move the handle up to pop each staple off.",
    "If you’re using a staple remover, wrap the jaws around each staple and pull it off.",
    "Pry every staple out and pull the fabric cover up to remove it.",
    "If you notice that the interior cushion is made out of loose stuffing, consider simply covering over the old fabric to make things easier.",
    "If you do want to replace the stuffing, buy a foam pad for a cushion online or at a local craft store.",
    "You can also buy loose cotton stuffing and pat it down while you wrap the fabric around it.",
    "You can use a staple removing tool if you prefer, but the staples that go into cushions tend to be a little too strong for a standard staple remover.",
    "You don’t need to remove the old cover if you don’t want to.",
    "You can always add a new layer of fabric on top of your old cushion.",
    "Pry the old fabric off of the old cover if it won’t come off.",
    "If the fabric won’t come up after you remove the staples, put on a thick pair of gloves to avoid cutting yourself on any screws or nails you may have missed.",
    "Carefully pull the upholstery off by ripping it off of the glue or internal staples.",
    "If it is stapled into the frame under the foam padding, use a screwdriver, utility knife, or angled scraper to remove the staples.",
    "This step can be kind of messy since it’s hard to know what’s keeping your cushion in place.",
    "There may be internal staples or glue that you simply can’t see.",
    "If you think you’re going to destroy the cushion by removing the old upholstery, recover your cushion by adding fabric on top of the old cover.",
    "If you’re only adding a new cover over your old upholstery, skip this step.",
    "Measure the seat of your chair to get your fabric dimensions.",
    "If your old upholstery is ripped up, measure the old cushion using a measuring tape.",
    "Note the length and width and write the numbers down on a piece of paper so that you don’t forget them.",
    "Add 4–8 in (10–20 cm) to each side to ensure that you have enough room to fold the cushion over the padding.",
    "If the old cover wasn’t destroyed when you removed it, you measure it on a flat surface to determine how much fabric you need.Tip: It’s better to have too much fabric than too little.",
    "You can always trim excess fabric after you’ve installed it, but it’s impossible to stretch fabric father than it can go.",
    "Purchase your new fabric at a store or online.",
    "Either visit your local crafts store or pick a new fabric out online and get it delivered.",
    "Get enough fabric to cover the surface of your cushion and don’t forget to add 4–8 in (10–20 cm) of extra fabric on each side.",
    "This should provide more than enough space to work with when you recover your cushion.",
    "Cotton, polyester, and velvet are all excellent choices when it comes to cushion fabrics.",
    "Cutting Your New Fabric Trace your new cover out on your new fabric.",
    "Take the dimensions for your cushion and transfer them on to the new fabric.",
    "Sketch your cushion out as a single square or rectangle to minimize the number of cuts you need to make.",
    "Use a fabric marker or fabric chalk to sketch the dimensions where you’re going to cut the cushion out.",
    "You can use a permanent marker if you don’t have a fabric marker.",
    "You’re going to tuck the edges under the seat so nobody should see any excess marks you make.",
    "If your new fabric has a pattern, make sure that the pattern lines up with the edges so that it looks even and direction that you want.",
    "For circular cushions, place the cushion in the center of your fabric, then, trace around the outside of the seat, leaving an extra 4–8 in (10–20 cm) on each side.",
    "Use a rotary cutter or scissors to cut your new fabric out.",
    "If your fabric is thicker, put a cutting board underneath the fabric after sketching it out.",
    "Then, use a rotary cutter to cut the outline of your cushion out, moving the cutting board as needed protect your work surface.",
    "If your fabric is thinner, feel free to use sewing scissors to cut around the outline you’ve drawn.Tip: Your cuts don’t really need to be perfect, so don’t worry if you mess up at all.",
    "The area around the outline is going to be pulled underneath the cushion, so nobody is going to see your mistakes.",
    "If you’re using a rotary cutter, feel free to use a straight edge to keep your cuts clean.",
    "They don’t need to be immaculate, though.",
    "You can always trim the fabric once you’ve attached it to the cushion.",
    "Trim any loose threads hanging off of your fabric.",
    "This will keep your upholstery from unravelling over time.",
    "Test your fabric by holding it over the cushion to ensure that it fits.",
    "To make sure that your cuts are accurate, hold the cushion over the foam pad and seat.",
    "Fold the fabric temporarily underneath the chair to ensure that your new upholstery will fit.",
    "So long as you have some excess fabric to work with underneath the seat on each side, you’re ready to install the fabric.",
    "If your fabric doesn’t fit, cut a new outline out.",
    "Add length to each side as needed to completely cover the cushion.",
    "Installing Your New Cushion Place your fabric upside down a flat surface.",
    "Lay your cushion upside down on top of the fabric.",
    "Place your foam pad on top of the fabric with the cushion on top of the foam pad.",
    "Place each piece in the center of the material.",
    "Adjust the fabric as needed so that it’s flat and centered on top of your seat.",
    "If you left the foam pad attached to your cushion, place it upside down so that the bottom of the chair is facing up.",
    "Fold one side of the fabric over the bottom of the seat and staple it.",
    "Press down on your cushion a little to brace it with your nondominant hand.",
    "This will keep it still while you make your first fold.",
    "Use your dominant hand to lift the center of the edge up over the cushion.",
    "Hold it in place and move your nondominant hand over to the fold to press it into the cushion.",
    "Grab a staple gun and staple the center before applying more staples to the left and right of the center.",
    "Leave the last 3–4 in (7.6–10.2 cm) near the edge unstapled.",
    "This way you’ll be able to fold the corners over when you’re done.",
    "For a round cushion, pinch the fabric together while pulling it over the edge of the cushion so that it stays tight.",
    "Start by completing roughly 1/4 of your fabric on any side.",
    "Place 1 staple every 1–2 inches (2.5–5.1 cm) along the rim of the cushion.",
    "Staple the opposite side of the seat into the cushion after pulling it tight.",
    "Use the same process to staple the other sides of your fabric.",
    "Start with the end on the opposite side from where you started.",
    "Pull the fabric in the center so that it is tight on top.",
    "Add 1 staple every 1–2 inches (2.5–5.1 cm) based on your preferences and leave the last 3–4 in (7.6–10.2 cm) unstapled near the corners.",
    "You don’t need to pull the fabric very hard to keep it tight.",
    "It’s okay if there isn’t a ton of tension in the fabric.",
    "Once you’ve stapled 1/4 of a round cushion, go to the opposite side and staple that section.",
    "Pinch the fabric as you’re folding it over the seat the same way you did on the opposite side.",
    "Fold your last 2 sides over, tucking your corners as you staple.",
    "With your 2 remaining sides, tuck each corner as you’re stapling it into the cushion or chair.",
    "As you pull a side tight, staple the center.",
    "Then, work your way towards the edge, stapling as you go.",
    "At the corner, fold the excess fabric near the edge underneath itself like you’re wrapping a birthday present.",
    "Lift the corner up and slide one side of the fabric underneath the corner as you lay it down over itself.",
    "Then, staple it into the frame on the adjacent side to conceal it under the seat.",
    "Repeat this process on the other side to finish stapling all 4 sides.",
    "Tuck each corner in towards the center of the seat so that it doesn’t stick out on the sides.",
    "You can really fold your corners however you’d like.",
    "So long as your excess fabric is concealed, it doesn’t really matter how it is folded.",
    "With a round cushion, you may notice larger lengths of fabric remaining where your remaining sections meet the first 2 sides that you stapled.",
    "For these corners, pull the fabric a little tighter and layer the cloth on top of itself like an accordion.",
    "Place 2-3 extra staples along these sections where the fabric meets.",
    "Trim any excess fabric before reinstalling the seat.",
    "Use sewing scissors or a utility knife to trim any unnecessary fabric hanging out past your staples.",
    "Cut any loose threads and add staples as needed to secure the fabric to the seat.",
    "Then, reattach the cushion to the chair.",
    "Either screw the seat back into the chair or place wood glue along the top of the chair’s frame before reattaching it.",
    "If the seat was stapled into the frame, use staples to reattach it.Tip: You can remove staples that you misplace with pliers or a flathead screwdriver."
  ],
  "tyn_section":[
    "Flathead screwdriver",
    "Pliers",
    "Utility knife",
    "Sewing scissors",
    "Measuring tape",
    "Paper",
    "Pencil or pen",
    "Fabric",
    "Fabric marker",
    "Rotary cutter",
    "Sewing Scissors",
    "Cutting board",
    "Staples",
    "Staple gun",
    "Screwdriver",
    "Screws",
    "Wood glue"
  ],
  "tyn_model":[
    "fabric",
    "chair",
    "foam pad",
    "staples",
    "flathead screwdriver",
    "rotary cutter",
    "screwdriver",
    "staple remover",
    "stuffing",
    "glue",
    "utility knife",
    "fabric marker",
    "cutting board",
    "sewing scissors",
    "cushion",
    "staple",
    "philips or flathead screwdriver",
    "fabric cover",
    "staple removing tool",
    "gloves",
    "upholstery",
    "angled scraper",
    "measuring tape",
    "fabric chalk",
    "permanent marker",
    "scissors",
    "staple gun",
    "cloth",
    "wood glue",
    "pliers"
  ],
  "simple_metrics":{
    "r":0.8235294118,
    "p":0.4333333333,
    "f1":0.5678627145,
    "avg_pos":0.1333333333
  },
  "jacc_metrics_0.5":{
    "r":0.8235294118,
    "p":0.6333333333,
    "f1":0.7160161507
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8235294118,
    "p":0.7,
    "f1":0.7567567568
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8235294118,
    "p":0.4333333333,
    "f1":0.5678627145
  }
}