{
  "title":"How to Drink from a Coconut",
  "url":"https://www.wikihow.com/Drink-from-a-Coconut",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Puncturing the Coconut with a Poker Tool",
      "steps":[
        {
          "headline":"Wash the coconut poker tool before using it.",
          "description":"Search for products specifically designed to poke into coconuts. If you’re having trouble finding the exact tool, try using a pointed screwdriver instead. Before piercing the fruit, always clean your tool with a drop of dish soap and some warm water, or with a disinfectant wipe. You can usually find the product you’re looking for in a store that sells kitchen gadgets and other useful tools."
        },
        {
          "headline":"Feel around the top of the coconut to find the eye.",
          "description":"Take your poker or other tool and begin poking around the top surface of the young coconut. Jab and remove the tool several times, or until it pierces the fruit completely. Don’t be discouraged if you can’t find the softest part of the fruit right away—it could take a few tries before you’re successful! The “eye” is another term for the softest area of coconut flesh. Try doing this near a sink, or another space that you don’t mind potentially getting messy."
        },
        {
          "headline":"Push the poker into the coconut and twist it.",
          "description":"Force your tool into the heart of the coconut to create a firm, definitive hole in the fruit. Press the poker into the coconut until you feel hollow space. Next, apply a spinning or twisting motion with the poker to make the puncture larger."
        },
        {
          "headline":"Remove the tool from the fruit.",
          "description":"After you twist the tool in the coconut, check that there’s a wide puncture as you remove the tool. If the puncture isn’t wide enough, you might not be able to fit a drinking straw into the fruit. Once you’ve pulled the object out of your coconut, feel free to set it aside. Don’t remove the poker until you’re certain that you’ve completely pierced the fruit."
        },
        {
          "headline":"Stick a drinking straw into the hole you just created.",
          "description":"Take a straw and push it into the fruit. Depending on the size of your coconut-opening tool, you might have to use a thinner straw. Continue pushing the straw into the fruit until you feel it hit the water. If you want to make sure that your straw will fit in the fruit, measure across the hole you poked in your coconut, then measure the diameter of your straw. Most generic straws will fit into your fruit."
        }
      ]
    },
    {
      "name":"Removing the Top with a Knife",
      "steps":[
        {
          "headline":"Cut the top of the coconut to expose the hard shell underneath.",
          "description":"Use a cleaver or thick knife to saw away the outer layer of fruit on top of the shell. Continue sawing off the white or tan portion of fruit until you reach the rounded surface of the shell. You will need to cut away multiple slices of the outer coconut before you reach this surface. Young coconuts don’t look like the traditional fruit. Instead of having a fuzzy outer layer, they have a thick, white or light tan outer portion."
        },
        {
          "headline":"Puncture the exposed shell with the sharp corner of the cleaver.",
          "description":"Hack into the top of the shell several times as though you’re trying to cut down a tree. Use the corner of the blade for the best results. Stop hacking with the corner of the blade when you puncture the shell. You'll hear a cracking sound when you puncture the shell."
        },
        {
          "headline":"Wedge the entire blade into the cut and pry up the top part of the shell.",
          "description":"Continue wedging and pulling up as you break through more of the shell. When the top of the shell is loose enough, use the blade to pry it off the coconut. You should be able to clearly see the coconut water in the fruit! You can discard the removed shell. Don’t be discouraged if you can’t remove this top slice at first. It can be a tricky process!"
        },
        {
          "headline":"Place a drinking straw into the coconut.",
          "description":"Take a clean drinking straw and arrange it in the large opening of your fruit. Feel free to use a thin or thick drinking straw—since you’ve removed the entire top from the coconut, you can use whatever kind of straw that you’d like! You can also strain and pour the coconut water into a glass, if you’d prefer."
        }
      ]
    }
  ],
  "text":" Puncturing the Coconut with a Poker Tool Wash the coconut poker tool before using it. Search for products specifically designed to poke into coconuts. If you’re having trouble finding the exact tool, try using a pointed screwdriver instead. Before piercing the fruit, always clean your tool with a drop of dish soap and some warm water, or with a disinfectant wipe. You can usually find the product you’re looking for in a store that sells kitchen gadgets and other useful tools. Feel around the top of the coconut to find the eye. Take your poker or other tool and begin poking around the top surface of the young coconut. Jab and remove the tool several times, or until it pierces the fruit completely. Don’t be discouraged if you can’t find the softest part of the fruit right away—it could take a few tries before you’re successful! The “eye” is another term for the softest area of coconut flesh. Try doing this near a sink, or another space that you don’t mind potentially getting messy. Push the poker into the coconut and twist it. Force your tool into the heart of the coconut to create a firm, definitive hole in the fruit. Press the poker into the coconut until you feel hollow space. Next, apply a spinning or twisting motion with the poker to make the puncture larger. Remove the tool from the fruit. After you twist the tool in the coconut, check that there’s a wide puncture as you remove the tool. If the puncture isn’t wide enough, you might not be able to fit a drinking straw into the fruit. Once you’ve pulled the object out of your coconut, feel free to set it aside. Don’t remove the poker until you’re certain that you’ve completely pierced the fruit. Stick a drinking straw into the hole you just created. Take a straw and push it into the fruit. Depending on the size of your coconut-opening tool, you might have to use a thinner straw. Continue pushing the straw into the fruit until you feel it hit the water. If you want to make sure that your straw will fit in the fruit, measure across the hole you poked in your coconut, then measure the diameter of your straw. Most generic straws will fit into your fruit. Removing the Top with a Knife Cut the top of the coconut to expose the hard shell underneath. Use a cleaver or thick knife to saw away the outer layer of fruit on top of the shell. Continue sawing off the white or tan portion of fruit until you reach the rounded surface of the shell. You will need to cut away multiple slices of the outer coconut before you reach this surface. Young coconuts don’t look like the traditional fruit. Instead of having a fuzzy outer layer, they have a thick, white or light tan outer portion. Puncture the exposed shell with the sharp corner of the cleaver. Hack into the top of the shell several times as though you’re trying to cut down a tree. Use the corner of the blade for the best results. Stop hacking with the corner of the blade when you puncture the shell. You'll hear a cracking sound when you puncture the shell. Wedge the entire blade into the cut and pry up the top part of the shell. Continue wedging and pulling up as you break through more of the shell. When the top of the shell is loose enough, use the blade to pry it off the coconut. You should be able to clearly see the coconut water in the fruit! You can discard the removed shell. Don’t be discouraged if you can’t remove this top slice at first. It can be a tricky process! Place a drinking straw into the coconut. Take a clean drinking straw and arrange it in the large opening of your fruit. Feel free to use a thin or thick drinking straw—since you’ve removed the entire top from the coconut, you can use whatever kind of straw that you’d like! You can also strain and pour the coconut water into a glass, if you’d prefer.",
  "sentences":[
    " Puncturing the Coconut with a Poker Tool Wash the coconut poker tool before using it.",
    "Search for products specifically designed to poke into coconuts.",
    "If you’re having trouble finding the exact tool, try using a pointed screwdriver instead.",
    "Before piercing the fruit, always clean your tool with a drop of dish soap and some warm water, or with a disinfectant wipe.",
    "You can usually find the product you’re looking for in a store that sells kitchen gadgets and other useful tools.",
    "Feel around the top of the coconut to find the eye.",
    "Take your poker or other tool and begin poking around the top surface of the young coconut.",
    "Jab and remove the tool several times, or until it pierces the fruit completely.",
    "Don’t be discouraged if you can’t find the softest part of the fruit right away—it could take a few tries before you’re successful!",
    "The “eye” is another term for the softest area of coconut flesh.",
    "Try doing this near a sink, or another space that you don’t mind potentially getting messy.",
    "Push the poker into the coconut and twist it.",
    "Force your tool into the heart of the coconut to create a firm, definitive hole in the fruit.",
    "Press the poker into the coconut until you feel hollow space.",
    "Next, apply a spinning or twisting motion with the poker to make the puncture larger.",
    "Remove the tool from the fruit.",
    "After you twist the tool in the coconut, check that there’s a wide puncture as you remove the tool.",
    "If the puncture isn’t wide enough, you might not be able to fit a drinking straw into the fruit.",
    "Once you’ve pulled the object out of your coconut, feel free to set it aside.",
    "Don’t remove the poker until you’re certain that you’ve completely pierced the fruit.",
    "Stick a drinking straw into the hole you just created.",
    "Take a straw and push it into the fruit.",
    "Depending on the size of your coconut-opening tool, you might have to use a thinner straw.",
    "Continue pushing the straw into the fruit until you feel it hit the water.",
    "If you want to make sure that your straw will fit in the fruit, measure across the hole you poked in your coconut, then measure the diameter of your straw.",
    "Most generic straws will fit into your fruit.",
    "Removing the Top with a Knife Cut the top of the coconut to expose the hard shell underneath.",
    "Use a cleaver or thick knife to saw away the outer layer of fruit on top of the shell.",
    "Continue sawing off the white or tan portion of fruit until you reach the rounded surface of the shell.",
    "You will need to cut away multiple slices of the outer coconut before you reach this surface.",
    "Young coconuts don’t look like the traditional fruit.",
    "Instead of having a fuzzy outer layer, they have a thick, white or light tan outer portion.",
    "Puncture the exposed shell with the sharp corner of the cleaver.",
    "Hack into the top of the shell several times as though you’re trying to cut down a tree.",
    "Use the corner of the blade for the best results.",
    "Stop hacking with the corner of the blade when you puncture the shell.",
    "You'll hear a cracking sound when you puncture the shell.",
    "Wedge the entire blade into the cut and pry up the top part of the shell.",
    "Continue wedging and pulling up as you break through more of the shell.",
    "When the top of the shell is loose enough, use the blade to pry it off the coconut.",
    "You should be able to clearly see the coconut water in the fruit!",
    "You can discard the removed shell.",
    "Don’t be discouraged if you can’t remove this top slice at first.",
    "It can be a tricky process!",
    "Place a drinking straw into the coconut.",
    "Take a clean drinking straw and arrange it in the large opening of your fruit.",
    "Feel free to use a thin or thick drinking straw—since you’ve removed the entire top from the coconut, you can use whatever kind of straw that you’d like!",
    "You can also strain and pour the coconut water into a glass, if you’d prefer."
  ],
  "tyn_section":[
    "Puncturing the Shell with a Poker Tool",
    "Young coconut",
    "Dish soap",
    "Disinfectant wipe (optional)",
    "Poker or coconut opener",
    "Drinking straw",
    "Cleaver or kitchen knife"
  ],
  "tyn_model":[
    "coconut",
    "straw",
    "poker",
    "drinking straw",
    "cleaver",
    "coconut water",
    "poker tool",
    "coconut poker tool",
    "screwdriver",
    "dish soap",
    "—it",
    "“eye",
    "” is",
    "water",
    "knife",
    "saw",
    "coconuts",
    "—since",
    "glass"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.1052631579,
    "f1":0.1538461538,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.2105263158,
    "f1":0.2823529412
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5714285714,
    "p":0.3157894737,
    "f1":0.406779661
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.1052631579,
    "f1":0.1538461538
  }
}