{
  "title":"How to Strip Wood Finishes",
  "url":"https://www.wikihow.com/Strip-Wood-Finishes",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Strip Wood Finishes With Sandpaper",
      "steps":[
        {
          "headline":"Wear a dust mask and protective goggles.",
          "description":"Sanding old paint or varnish releases minute dust particles into the air that can irritate your eyes and lungs."
        },
        {
          "headline":"Use coarse sandpaper to sand with the grain.",
          "description":"Use a sanding sponge or wrap the sandpaper around a sanding block when stripping flat surfaces to ensure a smooth finish."
        },
        {
          "headline":"Switch the sandpaper to a medium grit once you begin to see the wood grain showing through the paint or the varnish starts to dull.",
          "description":""
        },
        {
          "headline":"Finish the job by sanding with fine-grit sandpaper.",
          "description":"This will smooth out the wood and get rid of any remaining finish."
        }
      ]
    },
    {
      "name":"Strip Wood Finishes With Chemical Stripper",
      "steps":[
        {
          "headline":"Add chemical-resistant gloves to your protective clothing.",
          "description":""
        },
        {
          "headline":"Place cardboard underneath the wood.",
          "description":"This will catch all the drips from the stripper and protect the surface under the wood from unintentional damage."
        },
        {
          "headline":"Decide which stripper you want to use.",
          "description":"There are liquid and semi-paste strippers. Strippers with methylene chloride (MC) work faster and will remove almost all types of finishes."
        },
        {
          "headline":"Pour the stripper into an empty paint can or metal bucket.",
          "description":""
        },
        {
          "headline":"Use a brush to apply a very thick coat of the stripper onto the finish you want to strip.",
          "description":"You can also spray the stripper onto the wood surface if you have the right tools to do so."
        },
        {
          "headline":"Try scraping the surface with a metal or plastic scraper to see whether the old paint or varnish is soft enough to scrape.",
          "description":"This usually takes about 20 minutes; however, this can vary from 1 type of stripper to another. If it is ready, the finish should come off without much effort. If it does not, allow the stripper to sit a little longer or add more stripper."
        },
        {
          "headline":"Scrape the entire surface with your scraper.",
          "description":"You can use a stiff cleaning brush with natural bristles or a heavy cleaning sponge to strip wood finishes in grooved areas."
        },
        {
          "headline":"Wipe down the wood with lacquer thinner using the brush or sponge.",
          "description":"Once clean, wipe the wood with cotton rags. You may have to repeat this process a couple of times."
        },
        {
          "headline":"Allow the wood to dry for 24 hours before re-coating it.",
          "description":""
        }
      ]
    }
  ],
  "text":" Strip Wood Finishes With Sandpaper Wear a dust mask and protective goggles. Sanding old paint or varnish releases minute dust particles into the air that can irritate your eyes and lungs. Use coarse sandpaper to sand with the grain. Use a sanding sponge or wrap the sandpaper around a sanding block when stripping flat surfaces to ensure a smooth finish. Switch the sandpaper to a medium grit once you begin to see the wood grain showing through the paint or the varnish starts to dull.  Finish the job by sanding with fine-grit sandpaper. This will smooth out the wood and get rid of any remaining finish. Strip Wood Finishes With Chemical Stripper Add chemical-resistant gloves to your protective clothing.  Place cardboard underneath the wood. This will catch all the drips from the stripper and protect the surface under the wood from unintentional damage. Decide which stripper you want to use. There are liquid and semi-paste strippers. Strippers with methylene chloride (MC) work faster and will remove almost all types of finishes. Pour the stripper into an empty paint can or metal bucket.  Use a brush to apply a very thick coat of the stripper onto the finish you want to strip. You can also spray the stripper onto the wood surface if you have the right tools to do so. Try scraping the surface with a metal or plastic scraper to see whether the old paint or varnish is soft enough to scrape. This usually takes about 20 minutes; however, this can vary from 1 type of stripper to another. If it is ready, the finish should come off without much effort. If it does not, allow the stripper to sit a little longer or add more stripper. Scrape the entire surface with your scraper. You can use a stiff cleaning brush with natural bristles or a heavy cleaning sponge to strip wood finishes in grooved areas. Wipe down the wood with lacquer thinner using the brush or sponge. Once clean, wipe the wood with cotton rags. You may have to repeat this process a couple of times. Allow the wood to dry for 24 hours before re-coating it. ",
  "sentences":[
    " Strip Wood Finishes With Sandpaper Wear a dust mask and protective goggles.",
    "Sanding old paint or varnish releases minute dust particles into the air that can irritate your eyes and lungs.",
    "Use coarse sandpaper to sand with the grain.",
    "Use a sanding sponge or wrap the sandpaper around a sanding block when stripping flat surfaces to ensure a smooth finish.",
    "Switch the sandpaper to a medium grit once you begin to see the wood grain showing through the paint or the varnish starts to dull.",
    "Finish the job by sanding with fine-grit sandpaper.",
    "This will smooth out the wood and get rid of any remaining finish.",
    "Strip Wood Finishes With Chemical Stripper Add chemical-resistant gloves to your protective clothing.",
    "Place cardboard underneath the wood.",
    "This will catch all the drips from the stripper and protect the surface under the wood from unintentional damage.",
    "Decide which stripper you want to use.",
    "There are liquid and semi-paste strippers.",
    "Strippers with methylene chloride (MC) work faster and will remove almost all types of finishes.",
    "Pour the stripper into an empty paint can or metal bucket.",
    "Use a brush to apply a very thick coat of the stripper onto the finish you want to strip.",
    "You can also spray the stripper onto the wood surface if you have the right tools to do so.",
    "Try scraping the surface with a metal or plastic scraper to see whether the old paint or varnish is soft enough to scrape.",
    "This usually takes about 20 minutes; however, this can vary from 1 type of stripper to another.",
    "If it is ready, the finish should come off without much effort.",
    "If it does not, allow the stripper to sit a little longer or add more stripper.",
    "Scrape the entire surface with your scraper.",
    "You can use a stiff cleaning brush with natural bristles or a heavy cleaning sponge to strip wood finishes in grooved areas.",
    "Wipe down the wood with lacquer thinner using the brush or sponge.",
    "Once clean, wipe the wood with cotton rags.",
    "You may have to repeat this process a couple of times.",
    "Allow the wood to dry for 24 hours before re-coating it."
  ],
  "tyn_section":[
    "Dust mask",
    "Goggles",
    "Coarse-grit sandpaper",
    "Sanding sponge or sanding block",
    "Medium-grit sandpaper",
    "Fine-grit sandpaper",
    "Chemical-resistant gloves",
    "Cardboard pieces",
    "Chemical stripper",
    "Paint can or metal bucket",
    "Paint brush or spray tools",
    "Scraper",
    "Stiff cleaning brush or heavy cleaning sponge",
    "Lacquer thinner",
    "Cotton rags"
  ],
  "tyn_model":[
    "stripper",
    "sandpaper",
    "dust mask",
    "protective goggles",
    "sanding sponge",
    "fine-grit sandpaper",
    "chemical stripper",
    "cardboard",
    "methylene chloride",
    "paint can",
    "paint",
    "varnish",
    "scraper",
    "stiff cleaning brush",
    "heavy cleaning sponge",
    "lacquer thinner",
    "sponge",
    "cotton rags"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.3333333333,
    "f1":0.3636363636,
    "avg_pos":0.1111111111
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.7222222222,
    "f1":0.7591240876
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8666666667,
    "p":0.7777777778,
    "f1":0.8198198198
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.3333333333,
    "f1":0.3636363636
  }
}