{
  "title":"How to Preserve Sweet Potatoes",
  "url":"https://www.wikihow.com/Preserve-Sweet-Potatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques"
  ],
  "methods":[
    {
      "name":"Storing Sweet Potatoes in the Freezer",
      "steps":[
        {
          "headline":"Rinse as many sweet potatoes as you'd like to freeze.",
          "description":"Run the sweet potatoes under cold running water to remove dirt. If you're preserving sweet potatoes that you harvested, let them cure for at least 1 week before freezing them. If you're buying sweet potatoes, they've already been cured and are ready to preserve."
        },
        {
          "headline":"Steam, bake, or boil the sweet potatoes until they're almost tender.",
          "description":"Before you freeze the sweet potatoes, decide how you want to cook them. You can steam whole sweet potatoes, bake them in the oven, or boil them in water until they're still pretty firm but are beginning to soften. If you cook the sweet potatoes until they're completely tender, they may soften too much as they're frozen and defrosted."
        },
        {
          "headline":"Peel the sweet potatoes and cut them into ⁄2 inch (1.3 cm) slices or chunks.",
          "description":"Transfer the slightly cooked potatoes to a cutting board and pull the peels off once they're cool enough to handle. Decide if you'd like to leave them whole or cut them into ⁄2 inch (1.3 cm) thick slices or chunks. Discard the peels. If some of the peel sticks to the sweet potatoes, trim it away using a small knife."
        },
        {
          "headline":"Dip the sweet potatoes in a lemon juice solution.",
          "description":"The sweet potatoes will naturally become darker as they're stored. If you want them to remain light in color, mix together a solution of ⁄2 cup (120 ml) of lemon juice with 4 cups (950 ml) of water. Dip the whole or sliced sweet potatoes in the solution for 5 seconds. This will keep the sweet potatoes from darkening in the freezer."
        },
        {
          "headline":"Arrange the potatoes on a baking sheet and freeze them for 2 hours.",
          "description":"Lay a piece of waxed paper on a rimmed baking sheet and spread the sweet potatoes on it. Ensure that the pieces or slices are in a single layer and they aren't touching. Then, put the sheet in the freezer to flash freeze the sweet potatoes. Although you could skip this step and begin filling your containers, freezing them in a single layer prevents them from freezing into a large clump when you store them."
        },
        {
          "headline":"Transfer the sweet potatoes to a freezer-safe container or bag.",
          "description":"Fill a freezer-safe jar or container with the sweet potatoes, leaving at least ⁄2 inch (1.3 cm) of space at the top. If you'd like to use a freezer bag, squeeze out as much air as possible before sealing the bag shut.Tip: If you like to use small amounts of sweet potatoes at a time, you may want to put them in small freezer bags. This way you can defrost just as much as you need at one time."
        },
        {
          "headline":"Label the sweet potatoes and freeze them for up to 1 year.",
          "description":"Write on the bag or container so you know that it's filled with slices or chunks of sweet potatoes. Then, write the date. Plan to defrost and eat the sweet potatoes within 1 year of putting them in the freezer. To defrost the sweet potatoes, put the container or bag into the refrigerator the night before you want to use them."
        }
      ]
    },
    {
      "name":"Canning Sweet Potatoes",
      "steps":[
        {
          "headline":"Rinse the sweet potatoes and set up a steamer or pot of boiling water.",
          "description":"Once you've rinsed off any dirt from as many sweet potatoes as you'd like to preserve, decide if you'll boil them or steam them. If you choose to boil them, place a large pot of water on the stove. If you'd rather steam them, put a pot on the stove and fill it with 2 inches (5.1 cm) of water. If you're preserving a lot of sweet potatoes, you may need to work in batches. Keep the peels on the sweet potatoes so they keep their color."
        },
        {
          "headline":"Boil or steam the sweet potatoes for 15 to 20 minutes.",
          "description":"Place the sweet potatoes into the pot of water or in a steamer basket that you lower into the pot. Bring the water to a boil and cook the sweet potatoes until they become a little soft. Then, use a slotted spoon to transfer the sweet potatoes to a cutting board. Don't cook the sweet potatoes until they're completely tender or they'll become mushy as they're stored."
        },
        {
          "headline":"Peel the sweet potatoes and chop them into 1 inch (2.5 cm) chunks.",
          "description":"Once the sweet potatoes are cool enough to handle, pull off the peels and discard them. Take a sharp knife and carefully cut each sweet potato into 1 inch (2.5 cm) chunks. Avoid mashing the sweet potato since you won't be able to process it safely."
        },
        {
          "headline":"Sterilize pint (half-liter) or quart (liter) jars.",
          "description":"Place clean jars in a large pot on the stove and pour in enough water to cover the jars by at least 1 inch (2.5 cm). Bring the water to a boil and heat the jars for 10 minutes. Use a jar lifter to carefully remove the empty jars and set them on your work surface. Follow the manufacturer's directions for using the lids. Some brands require you to warm the lids before using them while others may not."
        },
        {
          "headline":"Fill the jars with the sweet potatoes and leave 1 inch (2.5 cm) of headspace.",
          "description":"Use a slotted spoon to put the sweet potatoes into the sterilized jars. Pack as many sweet potato pieces into each jar as you can, but leave 1 inch (2.5 cm) of space at the top of each jar."
        },
        {
          "headline":"Pour boiling water into each jar leaving 1 inch (2.5 cm) of headspace.",
          "description":"Bring a kettle of water to boil and carefully pour the boiling water into each filled jar. Pour in enough water to come within 1 inch (2.5 cm) of the top of each jar.Tip: If you want sweetened sweet potatoes, pack them in syrup. Make the sugar syrup as thin or heavy as you like, depending on how sweet you want the sweet potatoes to be."
        },
        {
          "headline":"Put the lids and bands on the jars and process them for 65 to 90 minutes.",
          "description":"Lower the filled jars into the bottom of a pressure canner and put the lid with the weight on it. Seal the lid shut and process the jars for 65 minutes if you're using pint (half-liter) jars or 90 minutes if you're using quart (liter) jars. Use a 10 lb (4.5 kg) weighted gauge or an 11 lb (5.0 kg) dial gauge pressure canner. Store the canned sweet potatoes at room temperature out of direct sunlight for up to 1 year."
        }
      ]
    },
    {
      "name":"Dehydrating Sweet Potato Slices",
      "steps":[
        {
          "headline":"Rinse sweet potatoes and peel them.",
          "description":"Run as many sweet potatoes as you like under cold water to remove dirt. Then, use a vegetable peeler to peel each sweet potato. Discard the peels. If you prefer a more rustic texture, leave the peels on the potatoes."
        },
        {
          "headline":"Slice each potato into ⁄4 inch (0.64 cm) thick slices.",
          "description":"Use a knife or a mandoline to carefully cut each sweet potato into ⁄4 inch (0.64 cm) thick slices. Try to slice them into even pieces so they dry at the same rate.Tip: If you're dehydrating the sweet potatoes with the goal of cooking them later, boil the slices for 5 minutes and plunge them in ice water. Then, drain the blanched sweet potatoes before dehydrating them. This can help them retain their color and texture when you reheat them."
        },
        {
          "headline":"Toss the sweet potato slices with olive oil and seasonings of your choice.",
          "description":"To make a crispy snack that stores well, put the slices into a bowl and drizzle about 1 tablespoon (15 ml) of extra-virgin olive oil over them. Then, sprinkle salt, pepper, onion powder, or your favorite seasonings over them. Toss the slices so they're coated in the mixture. You can skip this step if you want simple dehydrated sweet potatoes."
        },
        {
          "headline":"Arrange the slices in a single layer on a dehydrator tray or baking sheet.",
          "description":"If you're using a dehydrator, find the trays that came with your machine. To use an oven, get out a rimmed baking sheet. Lay the slices so they're in a single layer and there's at least ⁄2 inch (1.3 cm) between each slice. You may need to use multiple trays or sheets if you're dehydrating a lot of sweet potatoes."
        },
        {
          "headline":"Dry the slices at 125 °F (52 °C) for 10 to 12 hours.",
          "description":"Put the trays into your dehydrator or place the baking sheet in a preheated oven. Dry the slices until they're brittle and crisp when you snap them. The amount of time this takes can vary based on how much moisture is in your sweet potatoes."
        },
        {
          "headline":"Dry and shake the dehydrated sweet potatoes for 4 to 7 days.",
          "description":"If you're planning on storing the sweet potatoes for several months, put the dehydrated sweet potatoes into a large container and seal it shut. Shake the container 1 to 2 times a day for 4 to 7 days. If you see moisture condense in the jar, you'll need to dehydrate the sweet potatoes more."
        },
        {
          "headline":"Store the sweet potatoes in an airtight container for up to 1 year.",
          "description":"Pack the slices into glass jars or airtight boxes or bags. Keep the containers in a cool, dry space at room temperature so they're out of direct sunlight. Check the sweet potatoes for signs of mold after you've stored them for a long time. Discard sweet potatoes if they have a bad odor or look moldy."
        }
      ]
    }
  ],
  "text":" Storing Sweet Potatoes in the Freezer Rinse as many sweet potatoes as you'd like to freeze. Run the sweet potatoes under cold running water to remove dirt. If you're preserving sweet potatoes that you harvested, let them cure for at least 1 week before freezing them. If you're buying sweet potatoes, they've already been cured and are ready to preserve. Steam, bake, or boil the sweet potatoes until they're almost tender. Before you freeze the sweet potatoes, decide how you want to cook them. You can steam whole sweet potatoes, bake them in the oven, or boil them in water until they're still pretty firm but are beginning to soften. If you cook the sweet potatoes until they're completely tender, they may soften too much as they're frozen and defrosted. Peel the sweet potatoes and cut them into ⁄2 inch (1.3 cm) slices or chunks. Transfer the slightly cooked potatoes to a cutting board and pull the peels off once they're cool enough to handle. Decide if you'd like to leave them whole or cut them into ⁄2 inch (1.3 cm) thick slices or chunks. Discard the peels. If some of the peel sticks to the sweet potatoes, trim it away using a small knife. Dip the sweet potatoes in a lemon juice solution. The sweet potatoes will naturally become darker as they're stored. If you want them to remain light in color, mix together a solution of ⁄2 cup (120 ml) of lemon juice with 4 cups (950 ml) of water. Dip the whole or sliced sweet potatoes in the solution for 5 seconds. This will keep the sweet potatoes from darkening in the freezer. Arrange the potatoes on a baking sheet and freeze them for 2 hours. Lay a piece of waxed paper on a rimmed baking sheet and spread the sweet potatoes on it. Ensure that the pieces or slices are in a single layer and they aren't touching. Then, put the sheet in the freezer to flash freeze the sweet potatoes. Although you could skip this step and begin filling your containers, freezing them in a single layer prevents them from freezing into a large clump when you store them. Transfer the sweet potatoes to a freezer-safe container or bag. Fill a freezer-safe jar or container with the sweet potatoes, leaving at least ⁄2 inch (1.3 cm) of space at the top. If you'd like to use a freezer bag, squeeze out as much air as possible before sealing the bag shut.Tip: If you like to use small amounts of sweet potatoes at a time, you may want to put them in small freezer bags. This way you can defrost just as much as you need at one time. Label the sweet potatoes and freeze them for up to 1 year. Write on the bag or container so you know that it's filled with slices or chunks of sweet potatoes. Then, write the date. Plan to defrost and eat the sweet potatoes within 1 year of putting them in the freezer. To defrost the sweet potatoes, put the container or bag into the refrigerator the night before you want to use them. Canning Sweet Potatoes Rinse the sweet potatoes and set up a steamer or pot of boiling water. Once you've rinsed off any dirt from as many sweet potatoes as you'd like to preserve, decide if you'll boil them or steam them. If you choose to boil them, place a large pot of water on the stove. If you'd rather steam them, put a pot on the stove and fill it with 2 inches (5.1 cm) of water. If you're preserving a lot of sweet potatoes, you may need to work in batches. Keep the peels on the sweet potatoes so they keep their color. Boil or steam the sweet potatoes for 15 to 20 minutes. Place the sweet potatoes into the pot of water or in a steamer basket that you lower into the pot. Bring the water to a boil and cook the sweet potatoes until they become a little soft. Then, use a slotted spoon to transfer the sweet potatoes to a cutting board. Don't cook the sweet potatoes until they're completely tender or they'll become mushy as they're stored. Peel the sweet potatoes and chop them into 1 inch (2.5 cm) chunks. Once the sweet potatoes are cool enough to handle, pull off the peels and discard them. Take a sharp knife and carefully cut each sweet potato into 1 inch (2.5 cm) chunks. Avoid mashing the sweet potato since you won't be able to process it safely. Sterilize pint (half-liter) or quart (liter) jars. Place clean jars in a large pot on the stove and pour in enough water to cover the jars by at least 1 inch (2.5 cm). Bring the water to a boil and heat the jars for 10 minutes. Use a jar lifter to carefully remove the empty jars and set them on your work surface. Follow the manufacturer's directions for using the lids. Some brands require you to warm the lids before using them while others may not. Fill the jars with the sweet potatoes and leave 1 inch (2.5 cm) of headspace. Use a slotted spoon to put the sweet potatoes into the sterilized jars. Pack as many sweet potato pieces into each jar as you can, but leave 1 inch (2.5 cm) of space at the top of each jar. Pour boiling water into each jar leaving 1 inch (2.5 cm) of headspace. Bring a kettle of water to boil and carefully pour the boiling water into each filled jar. Pour in enough water to come within 1 inch (2.5 cm) of the top of each jar.Tip: If you want sweetened sweet potatoes, pack them in syrup. Make the sugar syrup as thin or heavy as you like, depending on how sweet you want the sweet potatoes to be. Put the lids and bands on the jars and process them for 65 to 90 minutes. Lower the filled jars into the bottom of a pressure canner and put the lid with the weight on it. Seal the lid shut and process the jars for 65 minutes if you're using pint (half-liter) jars or 90 minutes if you're using quart (liter) jars. Use a 10 lb (4.5 kg) weighted gauge or an 11 lb (5.0 kg) dial gauge pressure canner. Store the canned sweet potatoes at room temperature out of direct sunlight for up to 1 year. Dehydrating Sweet Potato Slices Rinse sweet potatoes and peel them. Run as many sweet potatoes as you like under cold water to remove dirt. Then, use a vegetable peeler to peel each sweet potato. Discard the peels. If you prefer a more rustic texture, leave the peels on the potatoes. Slice each potato into ⁄4 inch (0.64 cm) thick slices. Use a knife or a mandoline to carefully cut each sweet potato into ⁄4 inch (0.64 cm) thick slices. Try to slice them into even pieces so they dry at the same rate.Tip: If you're dehydrating the sweet potatoes with the goal of cooking them later, boil the slices for 5 minutes and plunge them in ice water. Then, drain the blanched sweet potatoes before dehydrating them. This can help them retain their color and texture when you reheat them. Toss the sweet potato slices with olive oil and seasonings of your choice. To make a crispy snack that stores well, put the slices into a bowl and drizzle about 1 tablespoon (15 ml) of extra-virgin olive oil over them. Then, sprinkle salt, pepper, onion powder, or your favorite seasonings over them. Toss the slices so they're coated in the mixture. You can skip this step if you want simple dehydrated sweet potatoes. Arrange the slices in a single layer on a dehydrator tray or baking sheet. If you're using a dehydrator, find the trays that came with your machine. To use an oven, get out a rimmed baking sheet. Lay the slices so they're in a single layer and there's at least ⁄2 inch (1.3 cm) between each slice. You may need to use multiple trays or sheets if you're dehydrating a lot of sweet potatoes. Dry the slices at 125 °F (52 °C) for 10 to 12 hours. Put the trays into your dehydrator or place the baking sheet in a preheated oven. Dry the slices until they're brittle and crisp when you snap them. The amount of time this takes can vary based on how much moisture is in your sweet potatoes. Dry and shake the dehydrated sweet potatoes for 4 to 7 days. If you're planning on storing the sweet potatoes for several months, put the dehydrated sweet potatoes into a large container and seal it shut. Shake the container 1 to 2 times a day for 4 to 7 days. If you see moisture condense in the jar, you'll need to dehydrate the sweet potatoes more. Store the sweet potatoes in an airtight container for up to 1 year. Pack the slices into glass jars or airtight boxes or bags. Keep the containers in a cool, dry space at room temperature so they're out of direct sunlight. Check the sweet potatoes for signs of mold after you've stored them for a long time. Discard sweet potatoes if they have a bad odor or look moldy.",
  "sentences":[
    " Storing Sweet Potatoes in the Freezer Rinse as many sweet potatoes as you'd like to freeze.",
    "Run the sweet potatoes under cold running water to remove dirt.",
    "If you're preserving sweet potatoes that you harvested, let them cure for at least 1 week before freezing them.",
    "If you're buying sweet potatoes, they've already been cured and are ready to preserve.",
    "Steam, bake, or boil the sweet potatoes until they're almost tender.",
    "Before you freeze the sweet potatoes, decide how you want to cook them.",
    "You can steam whole sweet potatoes, bake them in the oven, or boil them in water until they're still pretty firm but are beginning to soften.",
    "If you cook the sweet potatoes until they're completely tender, they may soften too much as they're frozen and defrosted.",
    "Peel the sweet potatoes and cut them into ⁄2 inch (1.3 cm) slices or chunks.",
    "Transfer the slightly cooked potatoes to a cutting board and pull the peels off once they're cool enough to handle.",
    "Decide if you'd like to leave them whole or cut them into ⁄2 inch (1.3 cm) thick slices or chunks.",
    "Discard the peels.",
    "If some of the peel sticks to the sweet potatoes, trim it away using a small knife.",
    "Dip the sweet potatoes in a lemon juice solution.",
    "The sweet potatoes will naturally become darker as they're stored.",
    "If you want them to remain light in color, mix together a solution of ⁄2 cup (120 ml) of lemon juice with 4 cups (950 ml) of water.",
    "Dip the whole or sliced sweet potatoes in the solution for 5 seconds.",
    "This will keep the sweet potatoes from darkening in the freezer.",
    "Arrange the potatoes on a baking sheet and freeze them for 2 hours.",
    "Lay a piece of waxed paper on a rimmed baking sheet and spread the sweet potatoes on it.",
    "Ensure that the pieces or slices are in a single layer and they aren't touching.",
    "Then, put the sheet in the freezer to flash freeze the sweet potatoes.",
    "Although you could skip this step and begin filling your containers, freezing them in a single layer prevents them from freezing into a large clump when you store them.",
    "Transfer the sweet potatoes to a freezer-safe container or bag.",
    "Fill a freezer-safe jar or container with the sweet potatoes, leaving at least ⁄2 inch (1.3 cm) of space at the top.",
    "If you'd like to use a freezer bag, squeeze out as much air as possible before sealing the bag shut.Tip: If you like to use small amounts of sweet potatoes at a time, you may want to put them in small freezer bags.",
    "This way you can defrost just as much as you need at one time.",
    "Label the sweet potatoes and freeze them for up to 1 year.",
    "Write on the bag or container so you know that it's filled with slices or chunks of sweet potatoes.",
    "Then, write the date.",
    "Plan to defrost and eat the sweet potatoes within 1 year of putting them in the freezer.",
    "To defrost the sweet potatoes, put the container or bag into the refrigerator the night before you want to use them.",
    "Canning Sweet Potatoes Rinse the sweet potatoes and set up a steamer or pot of boiling water.",
    "Once you've rinsed off any dirt from as many sweet potatoes as you'd like to preserve, decide if you'll boil them or steam them.",
    "If you choose to boil them, place a large pot of water on the stove.",
    "If you'd rather steam them, put a pot on the stove and fill it with 2 inches (5.1 cm) of water.",
    "If you're preserving a lot of sweet potatoes, you may need to work in batches.",
    "Keep the peels on the sweet potatoes so they keep their color.",
    "Boil or steam the sweet potatoes for 15 to 20 minutes.",
    "Place the sweet potatoes into the pot of water or in a steamer basket that you lower into the pot.",
    "Bring the water to a boil and cook the sweet potatoes until they become a little soft.",
    "Then, use a slotted spoon to transfer the sweet potatoes to a cutting board.",
    "Don't cook the sweet potatoes until they're completely tender or they'll become mushy as they're stored.",
    "Peel the sweet potatoes and chop them into 1 inch (2.5 cm) chunks.",
    "Once the sweet potatoes are cool enough to handle, pull off the peels and discard them.",
    "Take a sharp knife and carefully cut each sweet potato into 1 inch (2.5 cm) chunks.",
    "Avoid mashing the sweet potato since you won't be able to process it safely.",
    "Sterilize pint (half-liter) or quart (liter) jars.",
    "Place clean jars in a large pot on the stove and pour in enough water to cover the jars by at least 1 inch (2.5 cm).",
    "Bring the water to a boil and heat the jars for 10 minutes.",
    "Use a jar lifter to carefully remove the empty jars and set them on your work surface.",
    "Follow the manufacturer's directions for using the lids.",
    "Some brands require you to warm the lids before using them while others may not.",
    "Fill the jars with the sweet potatoes and leave 1 inch (2.5 cm) of headspace.",
    "Use a slotted spoon to put the sweet potatoes into the sterilized jars.",
    "Pack as many sweet potato pieces into each jar as you can, but leave 1 inch (2.5 cm) of space at the top of each jar.",
    "Pour boiling water into each jar leaving 1 inch (2.5 cm) of headspace.",
    "Bring a kettle of water to boil and carefully pour the boiling water into each filled jar.",
    "Pour in enough water to come within 1 inch (2.5 cm) of the top of each jar.Tip: If you want sweetened sweet potatoes, pack them in syrup.",
    "Make the sugar syrup as thin or heavy as you like, depending on how sweet you want the sweet potatoes to be.",
    "Put the lids and bands on the jars and process them for 65 to 90 minutes.",
    "Lower the filled jars into the bottom of a pressure canner and put the lid with the weight on it.",
    "Seal the lid shut and process the jars for 65 minutes if you're using pint (half-liter) jars or 90 minutes if you're using quart (liter) jars.",
    "Use a 10 lb (4.5 kg) weighted gauge or an 11 lb (5.0 kg) dial gauge pressure canner.",
    "Store the canned sweet potatoes at room temperature out of direct sunlight for up to 1 year.",
    "Dehydrating Sweet Potato Slices Rinse sweet potatoes and peel them.",
    "Run as many sweet potatoes as you like under cold water to remove dirt.",
    "Then, use a vegetable peeler to peel each sweet potato.",
    "Discard the peels.",
    "If you prefer a more rustic texture, leave the peels on the potatoes.",
    "Slice each potato into ⁄4 inch (0.64 cm) thick slices.",
    "Use a knife or a mandoline to carefully cut each sweet potato into ⁄4 inch (0.64 cm) thick slices.",
    "Try to slice them into even pieces so they dry at the same rate.Tip: If you're dehydrating the sweet potatoes with the goal of cooking them later, boil the slices for 5 minutes and plunge them in ice water.",
    "Then, drain the blanched sweet potatoes before dehydrating them.",
    "This can help them retain their color and texture when you reheat them.",
    "Toss the sweet potato slices with olive oil and seasonings of your choice.",
    "To make a crispy snack that stores well, put the slices into a bowl and drizzle about 1 tablespoon (15 ml) of extra-virgin olive oil over them.",
    "Then, sprinkle salt, pepper, onion powder, or your favorite seasonings over them.",
    "Toss the slices so they're coated in the mixture.",
    "You can skip this step if you want simple dehydrated sweet potatoes.",
    "Arrange the slices in a single layer on a dehydrator tray or baking sheet.",
    "If you're using a dehydrator, find the trays that came with your machine.",
    "To use an oven, get out a rimmed baking sheet.",
    "Lay the slices so they're in a single layer and there's at least ⁄2 inch (1.3 cm) between each slice.",
    "You may need to use multiple trays or sheets if you're dehydrating a lot of sweet potatoes.",
    "Dry the slices at 125 °F (52 °C) for 10 to 12 hours.",
    "Put the trays into your dehydrator or place the baking sheet in a preheated oven.",
    "Dry the slices until they're brittle and crisp when you snap them.",
    "The amount of time this takes can vary based on how much moisture is in your sweet potatoes.",
    "Dry and shake the dehydrated sweet potatoes for 4 to 7 days.",
    "If you're planning on storing the sweet potatoes for several months, put the dehydrated sweet potatoes into a large container and seal it shut.",
    "Shake the container 1 to 2 times a day for 4 to 7 days.",
    "If you see moisture condense in the jar, you'll need to dehydrate the sweet potatoes more.",
    "Store the sweet potatoes in an airtight container for up to 1 year.",
    "Pack the slices into glass jars or airtight boxes or bags.",
    "Keep the containers in a cool, dry space at room temperature so they're out of direct sunlight.",
    "Check the sweet potatoes for signs of mold after you've stored them for a long time.",
    "Discard sweet potatoes if they have a bad odor or look moldy."
  ],
  "tyn_section":[
    "Knife and cutting board",
    "Freezer-safe containers or sealable freezer bags",
    "Baking sheet",
    "Waxed paper",
    "Pot with a steamer basket, optional",
    "Slotted spoon",
    "Large pot",
    "Canning jars, bands, lids",
    "Jar lifter",
    "Pressure canner",
    "Steamer basket, optional",
    "Vegetable peeler",
    "Airtight storage containers",
    "Dehydrator",
    "Rimmed baking sheet, optional",
    "Mandoline, optional"
  ],
  "tyn_model":[
    "sweet potatoes",
    "water",
    "sweet potato",
    "baking sheet",
    "freezer",
    "potatoes",
    "pot",
    "cutting board",
    "lemon juice",
    "slotted spoon",
    "dehydrator",
    "oven",
    "small knife",
    "waxed paper",
    "freezer-safe container",
    "freezer-safe jar",
    "freezer bag",
    "freezer bags",
    "container",
    "refrigerator",
    "steamer or",
    "steamer basket",
    "sharp knife",
    "stove",
    "jar lifter",
    "sweetened sweet potatoes",
    "sugar syrup",
    "pressure canner",
    "weighted gauge",
    "dial gauge pressure canner",
    "vegetable peeler",
    "potato",
    "knife",
    "mandoline",
    "ice water",
    "olive oil",
    "seasonings",
    "bowl",
    "extra-virgin olive oil",
    "salt, pepper",
    "onion powder",
    "dehydrator tray",
    "airtight container",
    "glass jars",
    "airtight boxes"
  ],
  "simple_metrics":{
    "r":0.4375,
    "p":0.1555555556,
    "f1":0.2295081967,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5625,
    "p":0.2444444444,
    "f1":0.3407917384
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.2888888889,
    "f1":0.3951367781
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4375,
    "p":0.1555555556,
    "f1":0.2295081967
  }
}