{
  "title":"How to Paint a Nursery",
  "url":"https://www.wikihow.com/Paint-a-Nursery",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Choosing Baby-Safe Paint",
      "steps":[
        {
          "headline":"Shop for low or no-VOC paint.",
          "description":"Most paint contains volatile organic compounds (VOCs) that can off-gas and cause respiratory problems. Since babies and pregnant women are more sensitive to these compounds, look for paint that has low-VOC levels or none at all. Ask the paint desk if they also have low or no-VOC paint colorant that they'll use to mix the paint."
        },
        {
          "headline":"Use an eggshell sheen to make it easy to clean the walls later on.",
          "description":"Little kids can be rough on walls and you might need to wash away marks or dirt at some point. If you paint the room with matte paint, you'll see where you cleaned. Instead, work with an eggshell sheen to give a little depth and shine to the walls. Eggshell sheen paint is also easy to wipe down. If you prefer an even shinier look, you could try satin sheen paint."
        },
        {
          "headline":"Look for paint with a light reflectance value (LRV) of 60 or less.",
          "description":"You'll probably notice an LRV number listed next to most paints. The number shows what percentage of light is reflected from the paint. Percentages over 60 might create too much glare in the nursery, which is why you want a lower number.Did You Know? The more white there is in a paint, the higher the light reflectance value will be."
        },
        {
          "headline":"Brush a test spot on the wall to decide if you like the paint.",
          "description":"Most paint stores will sell you a sample size container of paint. Brush enough paint on a nursery wall to cover at least a 1 by 1 ft (30 by 30 cm) square. Let the paint dry completely before you determine whether or not you like the paint. If you can't paint test spots on the wall, tape the color chip on the wall so you can get an idea of how the paint will look. Keep in mind that painting on the wall is preferable since the spot will more accurately reflect the light in the nursery."
        },
        {
          "headline":"Test the paint that's already on the walls for lead.",
          "description":"If your home was built before 1978, it's a good idea to test the paint for lead. You can buy a simple lead testing kit from a hardware store or online. Use a utility knife to carefully scrape down to the first layer of paint on the wall and rub the end of the tester on the paint. Then, read the results according to the kit manufacturer.Tip: If the paint on the wall tests positive for lead, hire a professional to remove it or paint the room. If you're pregnant, it's not safe for you to handle anything that tests positive for lead. Most lead testing kits will include a testing sheet. You'll rub the tester onto the sheet after testing the wall to ensure that your kit worked."
        }
      ]
    },
    {
      "name":"Painting the Room",
      "steps":[
        {
          "headline":"Move or cover the nursery furniture.",
          "description":"If the nursery already has furniture, such as a crib, rocker, or dresser, in it, get help moving it out of the room. If you can't remove the furniture, carefully move it away from the walls towards the center of the room. Then, cover the pieces with large drop cloths or old sheets so you don't drip paint on the furniture. If you're pregnant, ask someone else to do the heavy lifting so you don't strain your muscles."
        },
        {
          "headline":"Lay drop cloths to protect the floor.",
          "description":"Place heavy canvas drop cloths over the floor near the walls. The cloths will prevent paint splatters from staining the carpet or hard floor. If you don't have canvas cloths, use plastic sheeting that you can get from most hardware stores. Although you can use old sheets instead of drop cloths, you'll need to lay down several layers so the paint doesn't seep through the thin fabric."
        },
        {
          "headline":"Wipe down the walls with a soapy sponge to remove dirt or grease.",
          "description":"To help the paint go on easier, ensure that the walls are clean before you begin. Dip a sponge into soapy water and wring it out. Gently wipe it over the walls to remove dust or dirt. Then, let the walls dry completely before you begin to paint. It's important to wring out the sponge well so you don't get the walls too wet. This could extend the drying time."
        },
        {
          "headline":"Apply painters tape to the trim, baseboards, and woodwork.",
          "description":"Buy the blue painters tape from a hardware store or online. Then, peel off a long strip and apply it in a straight line to the trim, woodwork, or baseboard that you want to protect from paint. Painters tape is designed to be easy to remove. Simply peel it off once you've finished painting the nursery."
        },
        {
          "headline":"Paint around the windows and baseboards with a small brush.",
          "description":"Open your can of paint and stir it with a paint stick so it's emulsified. Then, dip a 2 in (5.1 cm) angled paintbrush into the paint. Slowly brush the paint along the bottom of the wall near the baseboards. If the room has windows, carefully paint along the edges of them.Tip: If you're pregnant, you can paint the room as long as you're working with low or no-VOC paint. It's important to open windows, so there's good ventilation. The small paintbrush gives you more control over painting hard-to-reach parts of the room."
        },
        {
          "headline":"Dip a roller into the paint and coat the walls with it.",
          "description":"Set a paint tray on the floor and pour paint into it. Dip a foam roller brush into the paint and roll it a few times on the tray to remove the excess paint. Then, roll it onto the walls using a V-shape or M-shape motion. If you'd like to paint extra coats, wait at least 4 hours before applying another coat."
        }
      ]
    },
    {
      "name":"Selecting a Color",
      "steps":[
        {
          "headline":"Choose pale, warm colors for a comforting nursery atmosphere.",
          "description":"Light orange, yellow, and red can make the room feel soothing and inviting. They're also good color choices if the room doesn't get much natural light. Warm colors can make a large room feel brighter and cozier.Tip: Although you can paint the nursery in bright primary colors, a room with bright red, yellow, or blue walls can be overwhelming. If you like these colors, try a softer, paler shade. For example, paint with a pale orange color and use white furniture to make a small, dark nursery feel brighter."
        },
        {
          "headline":"Pick a light, cool shade for a relaxing nursery space.",
          "description":"If your nursery is small and you'd like to make it feel larger, choose a light, blue, green, or purple. These cool colors can make the room feel peaceful and spacious. Add brown or creamy white furniture to the room to make the cool room more inviting."
        },
        {
          "headline":"Use white for a contemporary look in the nursery.",
          "description":"If you'll be decorating the nursery with lots of colorful prints or fabrics, don't overwhelm the look with colorful walls. Instead, paint the room a soft white so the accents really stand out. To create even more of a contemporary look, choose a single color to use in the room. For example, paint the walls white or soft ivory and decorate it with black furniture. Then, add a yellow rug, blanket, or pillows."
        },
        {
          "headline":"Choose a gray if you'd like a neutral color that's easy to customize.",
          "description":"As your baby grows into an older child, they might want to redecorate the room. If you don't feel like painting the room multiple times, stick with a neutral gray that has silver or blue undertones. This way, it's easy to swap out furniture, soft furnishings, and decor that will probably work with the gray. Gray also looks great with metallic colors, so it's a good choice if you're going to decorate with stars, for instance."
        }
      ]
    }
  ],
  "text":" Choosing Baby-Safe Paint Shop for low or no-VOC paint. Most paint contains volatile organic compounds (VOCs) that can off-gas and cause respiratory problems. Since babies and pregnant women are more sensitive to these compounds, look for paint that has low-VOC levels or none at all. Ask the paint desk if they also have low or no-VOC paint colorant that they'll use to mix the paint. Use an eggshell sheen to make it easy to clean the walls later on. Little kids can be rough on walls and you might need to wash away marks or dirt at some point. If you paint the room with matte paint, you'll see where you cleaned. Instead, work with an eggshell sheen to give a little depth and shine to the walls. Eggshell sheen paint is also easy to wipe down. If you prefer an even shinier look, you could try satin sheen paint. Look for paint with a light reflectance value (LRV) of 60 or less. You'll probably notice an LRV number listed next to most paints. The number shows what percentage of light is reflected from the paint. Percentages over 60 might create too much glare in the nursery, which is why you want a lower number.Did You Know? The more white there is in a paint, the higher the light reflectance value will be. Brush a test spot on the wall to decide if you like the paint. Most paint stores will sell you a sample size container of paint. Brush enough paint on a nursery wall to cover at least a 1 by 1 ft (30 by 30 cm) square. Let the paint dry completely before you determine whether or not you like the paint. If you can't paint test spots on the wall, tape the color chip on the wall so you can get an idea of how the paint will look. Keep in mind that painting on the wall is preferable since the spot will more accurately reflect the light in the nursery. Test the paint that's already on the walls for lead. If your home was built before 1978, it's a good idea to test the paint for lead. You can buy a simple lead testing kit from a hardware store or online. Use a utility knife to carefully scrape down to the first layer of paint on the wall and rub the end of the tester on the paint. Then, read the results according to the kit manufacturer.Tip: If the paint on the wall tests positive for lead, hire a professional to remove it or paint the room. If you're pregnant, it's not safe for you to handle anything that tests positive for lead. Most lead testing kits will include a testing sheet. You'll rub the tester onto the sheet after testing the wall to ensure that your kit worked. Painting the Room Move or cover the nursery furniture. If the nursery already has furniture, such as a crib, rocker, or dresser, in it, get help moving it out of the room. If you can't remove the furniture, carefully move it away from the walls towards the center of the room. Then, cover the pieces with large drop cloths or old sheets so you don't drip paint on the furniture. If you're pregnant, ask someone else to do the heavy lifting so you don't strain your muscles. Lay drop cloths to protect the floor. Place heavy canvas drop cloths over the floor near the walls. The cloths will prevent paint splatters from staining the carpet or hard floor. If you don't have canvas cloths, use plastic sheeting that you can get from most hardware stores. Although you can use old sheets instead of drop cloths, you'll need to lay down several layers so the paint doesn't seep through the thin fabric. Wipe down the walls with a soapy sponge to remove dirt or grease. To help the paint go on easier, ensure that the walls are clean before you begin. Dip a sponge into soapy water and wring it out. Gently wipe it over the walls to remove dust or dirt. Then, let the walls dry completely before you begin to paint. It's important to wring out the sponge well so you don't get the walls too wet. This could extend the drying time. Apply painters tape to the trim, baseboards, and woodwork. Buy the blue painters tape from a hardware store or online. Then, peel off a long strip and apply it in a straight line to the trim, woodwork, or baseboard that you want to protect from paint. Painters tape is designed to be easy to remove. Simply peel it off once you've finished painting the nursery. Paint around the windows and baseboards with a small brush. Open your can of paint and stir it with a paint stick so it's emulsified. Then, dip a 2 in (5.1 cm) angled paintbrush into the paint. Slowly brush the paint along the bottom of the wall near the baseboards. If the room has windows, carefully paint along the edges of them.Tip: If you're pregnant, you can paint the room as long as you're working with low or no-VOC paint. It's important to open windows, so there's good ventilation. The small paintbrush gives you more control over painting hard-to-reach parts of the room. Dip a roller into the paint and coat the walls with it. Set a paint tray on the floor and pour paint into it. Dip a foam roller brush into the paint and roll it a few times on the tray to remove the excess paint. Then, roll it onto the walls using a V-shape or M-shape motion. If you'd like to paint extra coats, wait at least 4 hours before applying another coat. Selecting a Color Choose pale, warm colors for a comforting nursery atmosphere. Light orange, yellow, and red can make the room feel soothing and inviting. They're also good color choices if the room doesn't get much natural light. Warm colors can make a large room feel brighter and cozier.Tip: Although you can paint the nursery in bright primary colors, a room with bright red, yellow, or blue walls can be overwhelming. If you like these colors, try a softer, paler shade. For example, paint with a pale orange color and use white furniture to make a small, dark nursery feel brighter. Pick a light, cool shade for a relaxing nursery space. If your nursery is small and you'd like to make it feel larger, choose a light, blue, green, or purple. These cool colors can make the room feel peaceful and spacious. Add brown or creamy white furniture to the room to make the cool room more inviting. Use white for a contemporary look in the nursery. If you'll be decorating the nursery with lots of colorful prints or fabrics, don't overwhelm the look with colorful walls. Instead, paint the room a soft white so the accents really stand out. To create even more of a contemporary look, choose a single color to use in the room. For example, paint the walls white or soft ivory and decorate it with black furniture. Then, add a yellow rug, blanket, or pillows. Choose a gray if you'd like a neutral color that's easy to customize. As your baby grows into an older child, they might want to redecorate the room. If you don't feel like painting the room multiple times, stick with a neutral gray that has silver or blue undertones. This way, it's easy to swap out furniture, soft furnishings, and decor that will probably work with the gray. Gray also looks great with metallic colors, so it's a good choice if you're going to decorate with stars, for instance.",
  "sentences":[
    " Choosing Baby-Safe Paint Shop for low or no-VOC paint.",
    "Most paint contains volatile organic compounds (VOCs) that can off-gas and cause respiratory problems.",
    "Since babies and pregnant women are more sensitive to these compounds, look for paint that has low-VOC levels or none at all.",
    "Ask the paint desk if they also have low or no-VOC paint colorant that they'll use to mix the paint.",
    "Use an eggshell sheen to make it easy to clean the walls later on.",
    "Little kids can be rough on walls and you might need to wash away marks or dirt at some point.",
    "If you paint the room with matte paint, you'll see where you cleaned.",
    "Instead, work with an eggshell sheen to give a little depth and shine to the walls.",
    "Eggshell sheen paint is also easy to wipe down.",
    "If you prefer an even shinier look, you could try satin sheen paint.",
    "Look for paint with a light reflectance value (LRV) of 60 or less.",
    "You'll probably notice an LRV number listed next to most paints.",
    "The number shows what percentage of light is reflected from the paint.",
    "Percentages over 60 might create too much glare in the nursery, which is why you want a lower number.Did You Know?",
    "The more white there is in a paint, the higher the light reflectance value will be.",
    "Brush a test spot on the wall to decide if you like the paint.",
    "Most paint stores will sell you a sample size container of paint.",
    "Brush enough paint on a nursery wall to cover at least a 1 by 1 ft (30 by 30 cm) square.",
    "Let the paint dry completely before you determine whether or not you like the paint.",
    "If you can't paint test spots on the wall, tape the color chip on the wall so you can get an idea of how the paint will look.",
    "Keep in mind that painting on the wall is preferable since the spot will more accurately reflect the light in the nursery.",
    "Test the paint that's already on the walls for lead.",
    "If your home was built before 1978, it's a good idea to test the paint for lead.",
    "You can buy a simple lead testing kit from a hardware store or online.",
    "Use a utility knife to carefully scrape down to the first layer of paint on the wall and rub the end of the tester on the paint.",
    "Then, read the results according to the kit manufacturer.Tip: If the paint on the wall tests positive for lead, hire a professional to remove it or paint the room.",
    "If you're pregnant, it's not safe for you to handle anything that tests positive for lead.",
    "Most lead testing kits will include a testing sheet.",
    "You'll rub the tester onto the sheet after testing the wall to ensure that your kit worked.",
    "Painting the Room Move or cover the nursery furniture.",
    "If the nursery already has furniture, such as a crib, rocker, or dresser, in it, get help moving it out of the room.",
    "If you can't remove the furniture, carefully move it away from the walls towards the center of the room.",
    "Then, cover the pieces with large drop cloths or old sheets so you don't drip paint on the furniture.",
    "If you're pregnant, ask someone else to do the heavy lifting so you don't strain your muscles.",
    "Lay drop cloths to protect the floor.",
    "Place heavy canvas drop cloths over the floor near the walls.",
    "The cloths will prevent paint splatters from staining the carpet or hard floor.",
    "If you don't have canvas cloths, use plastic sheeting that you can get from most hardware stores.",
    "Although you can use old sheets instead of drop cloths, you'll need to lay down several layers so the paint doesn't seep through the thin fabric.",
    "Wipe down the walls with a soapy sponge to remove dirt or grease.",
    "To help the paint go on easier, ensure that the walls are clean before you begin.",
    "Dip a sponge into soapy water and wring it out.",
    "Gently wipe it over the walls to remove dust or dirt.",
    "Then, let the walls dry completely before you begin to paint.",
    "It's important to wring out the sponge well so you don't get the walls too wet.",
    "This could extend the drying time.",
    "Apply painters tape to the trim, baseboards, and woodwork.",
    "Buy the blue painters tape from a hardware store or online.",
    "Then, peel off a long strip and apply it in a straight line to the trim, woodwork, or baseboard that you want to protect from paint.",
    "Painters tape is designed to be easy to remove.",
    "Simply peel it off once you've finished painting the nursery.",
    "Paint around the windows and baseboards with a small brush.",
    "Open your can of paint and stir it with a paint stick so it's emulsified.",
    "Then, dip a 2 in (5.1 cm) angled paintbrush into the paint.",
    "Slowly brush the paint along the bottom of the wall near the baseboards.",
    "If the room has windows, carefully paint along the edges of them.Tip: If you're pregnant, you can paint the room as long as you're working with low or no-VOC paint.",
    "It's important to open windows, so there's good ventilation.",
    "The small paintbrush gives you more control over painting hard-to-reach parts of the room.",
    "Dip a roller into the paint and coat the walls with it.",
    "Set a paint tray on the floor and pour paint into it.",
    "Dip a foam roller brush into the paint and roll it a few times on the tray to remove the excess paint.",
    "Then, roll it onto the walls using a V-shape or M-shape motion.",
    "If you'd like to paint extra coats, wait at least 4 hours before applying another coat.",
    "Selecting a Color Choose pale, warm colors for a comforting nursery atmosphere.",
    "Light orange, yellow, and red can make the room feel soothing and inviting.",
    "They're also good color choices if the room doesn't get much natural light.",
    "Warm colors can make a large room feel brighter and cozier.Tip: Although you can paint the nursery in bright primary colors, a room with bright red, yellow, or blue walls can be overwhelming.",
    "If you like these colors, try a softer, paler shade.",
    "For example, paint with a pale orange color and use white furniture to make a small, dark nursery feel brighter.",
    "Pick a light, cool shade for a relaxing nursery space.",
    "If your nursery is small and you'd like to make it feel larger, choose a light, blue, green, or purple.",
    "These cool colors can make the room feel peaceful and spacious.",
    "Add brown or creamy white furniture to the room to make the cool room more inviting.",
    "Use white for a contemporary look in the nursery.",
    "If you'll be decorating the nursery with lots of colorful prints or fabrics, don't overwhelm the look with colorful walls.",
    "Instead, paint the room a soft white so the accents really stand out.",
    "To create even more of a contemporary look, choose a single color to use in the room.",
    "For example, paint the walls white or soft ivory and decorate it with black furniture.",
    "Then, add a yellow rug, blanket, or pillows.",
    "Choose a gray if you'd like a neutral color that's easy to customize.",
    "As your baby grows into an older child, they might want to redecorate the room.",
    "If you don't feel like painting the room multiple times, stick with a neutral gray that has silver or blue undertones.",
    "This way, it's easy to swap out furniture, soft furnishings, and decor that will probably work with the gray.",
    "Gray also looks great with metallic colors, so it's a good choice if you're going to decorate with stars, for instance."
  ],
  "tyn_section":[
    "Paint",
    "2 in (5.1 cm) angled brush",
    "Paint tray",
    "Foam paint roller",
    "Drop cloths",
    "Painters tape"
  ],
  "tyn_model":[
    "paint",
    "drop cloths",
    "sponge",
    "painters tape",
    "volatile organic compounds",
    "paint desk",
    "eggshell sheen",
    "eggshell sheen paint",
    "satin sheen paint",
    "paints",
    "lead testing kit",
    "utility knife",
    "lead",
    "lead testing kits",
    "crib",
    "soapy sponge",
    "soapy water",
    "blue painters tape",
    "paint stick",
    "roller",
    "paint tray",
    "foam roller",
    "blanket"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1739130435,
    "f1":0.275862069,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.347826087,
    "f1":0.490797546
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.4782608696,
    "f1":0.6077348066
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8333333333,
    "p":0.2608695652,
    "f1":0.3973509934
  }
}