{
  "title":"How to Make a Crown Knot",
  "url":"https://www.wikihow.com/Make-a-Crown-Knot",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "steps":[
    {
      "headline":"Place the working end of the rope to be crowned in your left hand, unwinding about 4\" (10cm) of it.",
      "description":"Before you form the knot and begin backsplicing it, the end of each strand should be finished to prevent unraveling during this splicing technique. With polypropylene, nylon, or dacron ropes, you can heat treat the ends over a flame or some other source of heat hot enough to melt the rope fibres to fuse the ends together. With cotton, manila or sisal rope, wrap the ends with masking tape."
    },
    {
      "headline":"Place your thumb on the front of the rope and your fingers on the rear.",
      "description":"Your thumb and forefinger should be pinching the rope strands and preventing further unraveling."
    },
    {
      "headline":"Arrange the strands so that the two of them come across the top of the rope in a diagonal direction (lower left to upper right).",
      "description":"The third strand appears to come from behind the front two, in a lower right to upper left direction. This arrangement is important if the crown is to be properly constructed."
    },
    {
      "headline":"With your right hand, take the uppermost of the front strands (which will be strand 1) and bend it over to the right forming a bight.",
      "description":"Be certain that the bight goes behind strand 2, the second of the rope strands. Secure the end of strand 1 between the fore and middle fingers of your left hand."
    },
    {
      "headline":"With your right hand, take strand 2, the remaining strand of the two that originally came across the \"top\" of the rope, and bend it around the bight in strand 1 that you are holding in your left.",
      "description":"The wrap must be taken around the working end of the bight."
    },
    {
      "headline":"After making this wrap, place the end of strand 2 between the standing end of the bight in strand 1 and 3.",
      "description":"Strand 3 is the only strand left untouched at this point."
    },
    {
      "headline":"Secure the end of strand 2 between the forefinger and thumb of your left hand and the rope.",
      "description":""
    },
    {
      "headline":"With your right hand, take the end of strand 3 and place it under the bight in strand 1 and over all parts of strand 2.",
      "description":"Study this arrangement for a moment and you'll notice that each strand locks and is in turn locked by another."
    },
    {
      "headline":"Release your grasp on the strand ends.",
      "description":"Start with any of the three strands and tug on it to begin tightening the crown knot. Don't attempt to pull one strand totally tight before starting to pull on another. Take each up alternately, a little at a time, until the crown is tight. At this point the crown is complete, and the backsplicing must begin to finish the process of \"crowning\" to prevent unraveling of the rope."
    },
    {
      "headline":"Hold the end of the rope with the crown knot in your left hand.",
      "description":"Select any of the strands sticking out from the crown and grasp it with your right hand. Notice that it passes under a strand of the crown and then lies on or passes over a strand of the end of the rope that is being crowned. Take a look at the whole crown as well as each strand so you are aware that this \"under-over\" arrangement is correct for each strand."
    },
    {
      "headline":"Select a strand, call it strand 1 (even if it's strand 2, 3 or 1), sticking out from under the crown knot and begin the backsplicing at that point by placing your right thumb partially under it and at the same time upon the strand it is passing over or lying upon.",
      "description":"Grasp the rest of the crown knot with the tips of your fore and middle fingers."
    },
    {
      "headline":"With your left forefinger and thumb, grasp the strand immediately below the one your right thumb is holding.",
      "description":"This is the strand directly below the one that the working part of strand 1 passes over."
    },
    {
      "headline":"With your right hand, twist the crown clockwise while twisting the standing end of the rope counterclockwise with your left.",
      "description":"This will open the rope and enable you to isolate the second strand below the point where strand 1 exits from under the crown."
    },
    {
      "headline":"Keep this strand isolated, and with your right hand, place the end of strand 1 under it and pull it through until it's pulling against the crown itself.",
      "description":""
    },
    {
      "headline":"Retighten the crown by holding it on your left hand and pulling each crowned strand downward with a clockwise twist.",
      "description":""
    },
    {
      "headline":"Move to the next strand to be spliced back into the parent rope by twisting the rope around 1/3 turn in either direction until the next strand coming out from under the crown knot is reached.",
      "description":"This is strand 2."
    },
    {
      "headline":"As with the first over and under, place your right thumb under strand 2 and upon the strand it's passing over.",
      "description":"Grip the rest of the crown knot with the tips of your index and middle fingers."
    },
    {
      "headline":"Study the crowning at this point.",
      "description":"Keep in mind the over-under principle. The crowned strand you are now working with, which is strand 2, is lying upon the strand it will pass over. You must take the strand of the main rope next in line below this and isolate it between your left thumb and forefinger. This is done by twisting the crown to the right and the standing end of the rope to the left."
    },
    {
      "headline":"Keep this strand isolated, and with your right hand place the end of strand 2 under it and pull it through until it is pulling against the crown knot.",
      "description":""
    },
    {
      "headline":"Retighten the crown as before by pulling each crowned strand in a clockwise downward twist.",
      "description":""
    },
    {
      "headline":"There is only one strand, being strand 3, remaining, and it too must go through the over-and-under process.",
      "description":"As mentioned above, there should be no difficulty in identifying the strand to be passed over, because strand 3 is lying upon it."
    },
    {
      "headline":"Grasp the knot in your right hand exactly as you did before for the first and second strands.",
      "description":"Now, before you begin twisting, identify the strand of the standing end of the rope to pass the crowned strand under. Once again, it's the strand immediately below the strand being passed over. Since this is your last strand, the crowning is getting \"crowded\" and it is easier now to make a mistake. Keep in mind that only one strand is passed over at a time, that only one strand can pass below another, and that only the strands of the standing end itself can be the ones passed over and gone under. With this in mind, grip the standing end of the rope in your left hand, twist the strands open as before, and insert the last crowned stand."
    },
    {
      "headline":"Retighten the crowning as before by pulling each strand in a clockwise downward twist.",
      "description":""
    },
    {
      "headline":"To continue the crowning or backsplicing, repeat the preceding steps for as many rounds of splice as desired.",
      "description":"There is no need to repeat the process for more than three total rounds or over-under sequences."
    },
    {
      "headline":"Finish the crowning or backsplicing with a final retighten and rolling of the entire crown between the palms of your hands.",
      "description":"Cut off the ends of the crowned strands around a quarter inch from the last strand they went under. Taper the ends when cutting so that the crown is less rough on your hands. The crown will not unravel and is now a permanent feature of the rope."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Place the working end of the rope to be crowned in your left hand, unwinding about 4\" (10cm) of it. Before you form the knot and begin backsplicing it, the end of each strand should be finished to prevent unraveling during this splicing technique. With polypropylene, nylon, or dacron ropes, you can heat treat the ends over a flame or some other source of heat hot enough to melt the rope fibres to fuse the ends together. With cotton, manila or sisal rope, wrap the ends with masking tape. Place your thumb on the front of the rope and your fingers on the rear. Your thumb and forefinger should be pinching the rope strands and preventing further unraveling. Arrange the strands so that the two of them come across the top of the rope in a diagonal direction (lower left to upper right). The third strand appears to come from behind the front two, in a lower right to upper left direction. This arrangement is important if the crown is to be properly constructed. With your right hand, take the uppermost of the front strands (which will be strand 1) and bend it over to the right forming a bight. Be certain that the bight goes behind strand 2, the second of the rope strands. Secure the end of strand 1 between the fore and middle fingers of your left hand. With your right hand, take strand 2, the remaining strand of the two that originally came across the \"top\" of the rope, and bend it around the bight in strand 1 that you are holding in your left. The wrap must be taken around the working end of the bight. After making this wrap, place the end of strand 2 between the standing end of the bight in strand 1 and 3. Strand 3 is the only strand left untouched at this point. Secure the end of strand 2 between the forefinger and thumb of your left hand and the rope.  With your right hand, take the end of strand 3 and place it under the bight in strand 1 and over all parts of strand 2. Study this arrangement for a moment and you'll notice that each strand locks and is in turn locked by another. Release your grasp on the strand ends. Start with any of the three strands and tug on it to begin tightening the crown knot. Don't attempt to pull one strand totally tight before starting to pull on another. Take each up alternately, a little at a time, until the crown is tight. At this point the crown is complete, and the backsplicing must begin to finish the process of \"crowning\" to prevent unraveling of the rope. Hold the end of the rope with the crown knot in your left hand. Select any of the strands sticking out from the crown and grasp it with your right hand. Notice that it passes under a strand of the crown and then lies on or passes over a strand of the end of the rope that is being crowned. Take a look at the whole crown as well as each strand so you are aware that this \"under-over\" arrangement is correct for each strand. Select a strand, call it strand 1 (even if it's strand 2, 3 or 1), sticking out from under the crown knot and begin the backsplicing at that point by placing your right thumb partially under it and at the same time upon the strand it is passing over or lying upon. Grasp the rest of the crown knot with the tips of your fore and middle fingers. With your left forefinger and thumb, grasp the strand immediately below the one your right thumb is holding. This is the strand directly below the one that the working part of strand 1 passes over. With your right hand, twist the crown clockwise while twisting the standing end of the rope counterclockwise with your left. This will open the rope and enable you to isolate the second strand below the point where strand 1 exits from under the crown. Keep this strand isolated, and with your right hand, place the end of strand 1 under it and pull it through until it's pulling against the crown itself.  Retighten the crown by holding it on your left hand and pulling each crowned strand downward with a clockwise twist.  Move to the next strand to be spliced back into the parent rope by twisting the rope around 1/3 turn in either direction until the next strand coming out from under the crown knot is reached. This is strand 2. As with the first over and under, place your right thumb under strand 2 and upon the strand it's passing over. Grip the rest of the crown knot with the tips of your index and middle fingers. Study the crowning at this point. Keep in mind the over-under principle. The crowned strand you are now working with, which is strand 2, is lying upon the strand it will pass over. You must take the strand of the main rope next in line below this and isolate it between your left thumb and forefinger. This is done by twisting the crown to the right and the standing end of the rope to the left. Keep this strand isolated, and with your right hand place the end of strand 2 under it and pull it through until it is pulling against the crown knot.  Retighten the crown as before by pulling each crowned strand in a clockwise downward twist.  There is only one strand, being strand 3, remaining, and it too must go through the over-and-under process. As mentioned above, there should be no difficulty in identifying the strand to be passed over, because strand 3 is lying upon it. Grasp the knot in your right hand exactly as you did before for the first and second strands. Now, before you begin twisting, identify the strand of the standing end of the rope to pass the crowned strand under. Once again, it's the strand immediately below the strand being passed over. Since this is your last strand, the crowning is getting \"crowded\" and it is easier now to make a mistake. Keep in mind that only one strand is passed over at a time, that only one strand can pass below another, and that only the strands of the standing end itself can be the ones passed over and gone under. With this in mind, grip the standing end of the rope in your left hand, twist the strands open as before, and insert the last crowned stand. Retighten the crowning as before by pulling each strand in a clockwise downward twist.  To continue the crowning or backsplicing, repeat the preceding steps for as many rounds of splice as desired. There is no need to repeat the process for more than three total rounds or over-under sequences. Finish the crowning or backsplicing with a final retighten and rolling of the entire crown between the palms of your hands. Cut off the ends of the crowned strands around a quarter inch from the last strand they went under. Taper the ends when cutting so that the crown is less rough on your hands. The crown will not unravel and is now a permanent feature of the rope. Finished. ",
  "sentences":[
    " Place the working end of the rope to be crowned in your left hand, unwinding about 4\" (10cm) of it.",
    "Before you form the knot and begin backsplicing it, the end of each strand should be finished to prevent unraveling during this splicing technique.",
    "With polypropylene, nylon, or dacron ropes, you can heat treat the ends over a flame or some other source of heat hot enough to melt the rope fibres to fuse the ends together.",
    "With cotton, manila or sisal rope, wrap the ends with masking tape.",
    "Place your thumb on the front of the rope and your fingers on the rear.",
    "Your thumb and forefinger should be pinching the rope strands and preventing further unraveling.",
    "Arrange the strands so that the two of them come across the top of the rope in a diagonal direction (lower left to upper right).",
    "The third strand appears to come from behind the front two, in a lower right to upper left direction.",
    "This arrangement is important if the crown is to be properly constructed.",
    "With your right hand, take the uppermost of the front strands (which will be strand 1) and bend it over to the right forming a bight.",
    "Be certain that the bight goes behind strand 2, the second of the rope strands.",
    "Secure the end of strand 1 between the fore and middle fingers of your left hand.",
    "With your right hand, take strand 2, the remaining strand of the two that originally came across the \"top\" of the rope, and bend it around the bight in strand 1 that you are holding in your left.",
    "The wrap must be taken around the working end of the bight.",
    "After making this wrap, place the end of strand 2 between the standing end of the bight in strand 1 and 3.",
    "Strand 3 is the only strand left untouched at this point.",
    "Secure the end of strand 2 between the forefinger and thumb of your left hand and the rope.",
    "With your right hand, take the end of strand 3 and place it under the bight in strand 1 and over all parts of strand 2.",
    "Study this arrangement for a moment and you'll notice that each strand locks and is in turn locked by another.",
    "Release your grasp on the strand ends.",
    "Start with any of the three strands and tug on it to begin tightening the crown knot.",
    "Don't attempt to pull one strand totally tight before starting to pull on another.",
    "Take each up alternately, a little at a time, until the crown is tight.",
    "At this point the crown is complete, and the backsplicing must begin to finish the process of \"crowning\" to prevent unraveling of the rope.",
    "Hold the end of the rope with the crown knot in your left hand.",
    "Select any of the strands sticking out from the crown and grasp it with your right hand.",
    "Notice that it passes under a strand of the crown and then lies on or passes over a strand of the end of the rope that is being crowned.",
    "Take a look at the whole crown as well as each strand so you are aware that this \"under-over\" arrangement is correct for each strand.",
    "Select a strand, call it strand 1 (even if it's strand 2, 3 or 1), sticking out from under the crown knot and begin the backsplicing at that point by placing your right thumb partially under it and at the same time upon the strand it is passing over or lying upon.",
    "Grasp the rest of the crown knot with the tips of your fore and middle fingers.",
    "With your left forefinger and thumb, grasp the strand immediately below the one your right thumb is holding.",
    "This is the strand directly below the one that the working part of strand 1 passes over.",
    "With your right hand, twist the crown clockwise while twisting the standing end of the rope counterclockwise with your left.",
    "This will open the rope and enable you to isolate the second strand below the point where strand 1 exits from under the crown.",
    "Keep this strand isolated, and with your right hand, place the end of strand 1 under it and pull it through until it's pulling against the crown itself.",
    "Retighten the crown by holding it on your left hand and pulling each crowned strand downward with a clockwise twist.",
    "Move to the next strand to be spliced back into the parent rope by twisting the rope around 1/3 turn in either direction until the next strand coming out from under the crown knot is reached.",
    "This is strand 2.",
    "As with the first over and under, place your right thumb under strand 2 and upon the strand it's passing over.",
    "Grip the rest of the crown knot with the tips of your index and middle fingers.",
    "Study the crowning at this point.",
    "Keep in mind the over-under principle.",
    "The crowned strand you are now working with, which is strand 2, is lying upon the strand it will pass over.",
    "You must take the strand of the main rope next in line below this and isolate it between your left thumb and forefinger.",
    "This is done by twisting the crown to the right and the standing end of the rope to the left.",
    "Keep this strand isolated, and with your right hand place the end of strand 2 under it and pull it through until it is pulling against the crown knot.",
    "Retighten the crown as before by pulling each crowned strand in a clockwise downward twist.",
    "There is only one strand, being strand 3, remaining, and it too must go through the over-and-under process.",
    "As mentioned above, there should be no difficulty in identifying the strand to be passed over, because strand 3 is lying upon it.",
    "Grasp the knot in your right hand exactly as you did before for the first and second strands.",
    "Now, before you begin twisting, identify the strand of the standing end of the rope to pass the crowned strand under.",
    "Once again, it's the strand immediately below the strand being passed over.",
    "Since this is your last strand, the crowning is getting \"crowded\" and it is easier now to make a mistake.",
    "Keep in mind that only one strand is passed over at a time, that only one strand can pass below another, and that only the strands of the standing end itself can be the ones passed over and gone under.",
    "With this in mind, grip the standing end of the rope in your left hand, twist the strands open as before, and insert the last crowned stand.",
    "Retighten the crowning as before by pulling each strand in a clockwise downward twist.",
    "To continue the crowning or backsplicing, repeat the preceding steps for as many rounds of splice as desired.",
    "There is no need to repeat the process for more than three total rounds or over-under sequences.",
    "Finish the crowning or backsplicing with a final retighten and rolling of the entire crown between the palms of your hands.",
    "Cut off the ends of the crowned strands around a quarter inch from the last strand they went under.",
    "Taper the ends when cutting so that the crown is less rough on your hands.",
    "The crown will not unravel and is now a permanent feature of the rope.",
    "Finished."
  ],
  "tyn_section":[
    "Rope"
  ],
  "tyn_model":[
    "rope",
    "masking tape",
    "backsplicing"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  }
}