{
  "title":"How to Brown Potatoes",
  "url":"https://www.wikihow.com/Brown-Potatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Cooking the Potatoes on the Stove",
      "steps":[
        {
          "headline":"Peel 3 pounds (1.4 kg) of potatoes and cut them into 1 inch (2.5 cm) pieces.",
          "description":"Rinse the potatoes and peel them. Then, place them on a cutting board and carefully chop each potato in 1/2. Lay the halves flat and cut them into quarters or chunks that are around 1 inch (2.5 cm) in size. You can use Russet potatoes, which become light brown on the outside and fluffy on the inside, yellow potatoes, which brown more and are more flavorful, or a combination of them. If you'd like larger potatoes, add a few minutes to the cooking time. To cut the potatoes smaller, decrease the cooking time by a few minutes."
        },
        {
          "headline":"Melt the butter or warm the olive oil in a large skillet over medium-low heat.",
          "description":"Set a large skillet on the stove and turn the burner to medium-low. Add 3 tablespoons (44.4 ml) (42 g) of unsalted butter or 3 tablespoons (44 ml) of olive oil. Leave the butter to melt or the oil to heat. All butter gives a richer flavor, but you could substitute your favorite cooking fat, such as coconut oil or beef fat."
        },
        {
          "headline":"Add the potatoes to the skillet and season them with salt and pepper.",
          "description":"Put the chopped potatoes into the hot skillet and add 1/2 teaspoon (2.5 g) of salt and 1/2 teaspoon (1 g) of black pepper. Stir until they're coated and arrange the potatoes so they're in a single layer.Tip: For extra flavorful seasoning, add 1/2 teaspoon (1 g) of paprika, 1/2 teaspoon (1 g) of garlic powder, and 1/2 teaspoon (1 g) of onion powder. If you'd like to include onions or peppers with the potatoes, chop 1 onion or bell pepper into ⁄2 to 1 inch (1.3 to 2.5 cm) pieces. Add them to the skillet with the potatoes so they soften and flavor the potatoes."
        },
        {
          "headline":"Cook the potatoes for 25 to 30 minutes and stir them frequently.",
          "description":"Leave the potatoes to brown for 5 minutes before stirring or turning them. This allows them to develop a brown crust. Continue to cook the potatoes over medium-low heat and stir them about every 5 minutes until they're tender in the center. If the potatoes stick to the skillet, pour in another 1 tablespoon (15 ml) of olive oil and swirl the pan to coat the bottom."
        },
        {
          "headline":"Toss the browned potatoes with herbs if you want to add a fresh flavor.",
          "description":"Turn off the burner and stir in 4 tablespoons (59.1 ml) (15 g) of freshly minced parsley. To add a little crunch, you could also mix in 4 tablespoons (59.1 ml) (24 g) of minced scallions. If you don't want to include the parsley and scallions, skip this step. Instead, season the browned potatoes with salt and pepper according to your taste."
        }
      ]
    },
    {
      "name":"Roasting the Potatoes",
      "steps":[
        {
          "headline":"Peel 4 pounds (1.8 kg) of potatoes and cut them into large chunks.",
          "description":"Rinse the potatoes to remove dirt and then peel them. Place them on a cutting board and use a large knife to carefully cut each potato in 1/2. Lay the halves flat on the cutting board and cut each into quarters or chunks that are 2 to 3 inches (5.1 to 7.6 cm) in size. Russet potatoes brown easier in the oven while yellow potatoes have more flavor. Try a mix of these if you can't decide on a single type of potato."
        },
        {
          "headline":"Preheat the oven to 450 °F (232 °C) and bring a pot of water to boil on the stove.",
          "description":"While you're waiting for the oven to heat, set a large pot on the stove and pour in 8 cups (1.9 L) of water. Put the lid on the pot and turn the burner to high so the water comes to a boil faster. If you plan on halving the recipe, you can use a medium-sized pot and half of the water."
        },
        {
          "headline":"Add salt, baking soda, and the potatoes to the boiling water.",
          "description":"Stir 2 tablespoons (25 g) of kosher salt into the water along with 1/2 teaspoon (4 g) of baking soda and the potato chunks. The salt flavors the potatoes and the baking soda helps the surface of the potato break down a little so it browns more in the oven. The baking soda and salt also prevent the potatoes from falling apart as they boil."
        },
        {
          "headline":"Simmer the uncovered potatoes for 10 minutes.",
          "description":"Once the potatoes begin boiling, turn the burner down to medium so the water bubbles gently. Keep the lid off of the pot and simmer the potatoes until they're soft when you insert a knife into one of them. Boiling the potatoes before you roast them allows moisture to escape faster. This gives the potatoes a richer brown crust as they bake in the oven."
        },
        {
          "headline":"Drain the potatoes and return them to the pot.",
          "description":"Turn off the burner and carefully pour the potatoes into a colander or fine-mesh strainer. Then, put the drained potatoes back into the hot pot. The heat from the pot removes excess moisture from the boiled potatoes."
        },
        {
          "headline":"Toss the potatoes with 5 tablespoons (74 ml) of melted butter or olive oil.",
          "description":"Drizzle the butter or extra-virgin olive oil over the potatoes in the pot and shake the pan well to coat the potatoes. Keep tossing the potatoes to rough up the outsides so they look a little smashed.Tip: To give your potatoes a savory garlic flavor, mince 6 cloves of garlic. Add them to the potatoes with the oil and toss the mixture well. Roughing up the potatoes creates a pasty coating on the outsides that becomes brown and crisp in the oven. Feel free to substitute any cooking fat for the butter or olive oil. Use duck fat, goose fat, or beef fat, for example."
        },
        {
          "headline":"Spread the potatoes on the sheet and bake them for 20 minutes.",
          "description":"Scoop the potato chunks onto a rimmed baking sheet and arrange them so the potatoes are in a single layer. Then, put the sheet in the preheated oven and roast the potatoes for 20 minutes. Don't turn or stir the potatoes while they're cooking since you want them to develop a brown crust where they're touching the baking sheet."
        },
        {
          "headline":"Flip over the potatoes and roast them for 30 to 40 more minutes.",
          "description":"Wear oven mitts to pull the baking sheet out of the oven. Use a metal spatula to carefully flip the potatoes over and put the sheet back in the oven. Bake the potatoes until they're completely browned and crispy. Then, season them with salt and pepper according to your taste.Tip: If you'd like to add an herbal flavor to the browned potatoes, finely mince a handful of rosemary or parsley. Toss the herbs with the browned potatoes just before serving them. Remember that the insides of the potatoes are already cooked since you boiled them. Roasting them thoroughly is what browns them."
        }
      ]
    }
  ],
  "text":" Cooking the Potatoes on the Stove Peel 3 pounds (1.4 kg) of potatoes and cut them into 1 inch (2.5 cm) pieces. Rinse the potatoes and peel them. Then, place them on a cutting board and carefully chop each potato in 1/2. Lay the halves flat and cut them into quarters or chunks that are around 1 inch (2.5 cm) in size. You can use Russet potatoes, which become light brown on the outside and fluffy on the inside, yellow potatoes, which brown more and are more flavorful, or a combination of them. If you'd like larger potatoes, add a few minutes to the cooking time. To cut the potatoes smaller, decrease the cooking time by a few minutes. Melt the butter or warm the olive oil in a large skillet over medium-low heat. Set a large skillet on the stove and turn the burner to medium-low. Add 3 tablespoons (44.4 ml) (42 g) of unsalted butter or 3 tablespoons (44 ml) of olive oil. Leave the butter to melt or the oil to heat. All butter gives a richer flavor, but you could substitute your favorite cooking fat, such as coconut oil or beef fat. Add the potatoes to the skillet and season them with salt and pepper. Put the chopped potatoes into the hot skillet and add 1/2 teaspoon (2.5 g) of salt and 1/2 teaspoon (1 g) of black pepper. Stir until they're coated and arrange the potatoes so they're in a single layer.Tip: For extra flavorful seasoning, add 1/2 teaspoon (1 g) of paprika, 1/2 teaspoon (1 g) of garlic powder, and 1/2 teaspoon (1 g) of onion powder. If you'd like to include onions or peppers with the potatoes, chop 1 onion or bell pepper into ⁄2 to 1 inch (1.3 to 2.5 cm) pieces. Add them to the skillet with the potatoes so they soften and flavor the potatoes. Cook the potatoes for 25 to 30 minutes and stir them frequently. Leave the potatoes to brown for 5 minutes before stirring or turning them. This allows them to develop a brown crust. Continue to cook the potatoes over medium-low heat and stir them about every 5 minutes until they're tender in the center. If the potatoes stick to the skillet, pour in another 1 tablespoon (15 ml) of olive oil and swirl the pan to coat the bottom. Toss the browned potatoes with herbs if you want to add a fresh flavor. Turn off the burner and stir in 4 tablespoons (59.1 ml) (15 g) of freshly minced parsley. To add a little crunch, you could also mix in 4 tablespoons (59.1 ml) (24 g) of minced scallions. If you don't want to include the parsley and scallions, skip this step. Instead, season the browned potatoes with salt and pepper according to your taste. Roasting the Potatoes Peel 4 pounds (1.8 kg) of potatoes and cut them into large chunks. Rinse the potatoes to remove dirt and then peel them. Place them on a cutting board and use a large knife to carefully cut each potato in 1/2. Lay the halves flat on the cutting board and cut each into quarters or chunks that are 2 to 3 inches (5.1 to 7.6 cm) in size. Russet potatoes brown easier in the oven while yellow potatoes have more flavor. Try a mix of these if you can't decide on a single type of potato. Preheat the oven to 450 °F (232 °C) and bring a pot of water to boil on the stove. While you're waiting for the oven to heat, set a large pot on the stove and pour in 8 cups (1.9 L) of water. Put the lid on the pot and turn the burner to high so the water comes to a boil faster. If you plan on halving the recipe, you can use a medium-sized pot and half of the water. Add salt, baking soda, and the potatoes to the boiling water. Stir 2 tablespoons (25 g) of kosher salt into the water along with 1/2 teaspoon (4 g) of baking soda and the potato chunks. The salt flavors the potatoes and the baking soda helps the surface of the potato break down a little so it browns more in the oven. The baking soda and salt also prevent the potatoes from falling apart as they boil. Simmer the uncovered potatoes for 10 minutes. Once the potatoes begin boiling, turn the burner down to medium so the water bubbles gently. Keep the lid off of the pot and simmer the potatoes until they're soft when you insert a knife into one of them. Boiling the potatoes before you roast them allows moisture to escape faster. This gives the potatoes a richer brown crust as they bake in the oven. Drain the potatoes and return them to the pot. Turn off the burner and carefully pour the potatoes into a colander or fine-mesh strainer. Then, put the drained potatoes back into the hot pot. The heat from the pot removes excess moisture from the boiled potatoes. Toss the potatoes with 5 tablespoons (74 ml) of melted butter or olive oil. Drizzle the butter or extra-virgin olive oil over the potatoes in the pot and shake the pan well to coat the potatoes. Keep tossing the potatoes to rough up the outsides so they look a little smashed.Tip: To give your potatoes a savory garlic flavor, mince 6 cloves of garlic. Add them to the potatoes with the oil and toss the mixture well. Roughing up the potatoes creates a pasty coating on the outsides that becomes brown and crisp in the oven. Feel free to substitute any cooking fat for the butter or olive oil. Use duck fat, goose fat, or beef fat, for example. Spread the potatoes on the sheet and bake them for 20 minutes. Scoop the potato chunks onto a rimmed baking sheet and arrange them so the potatoes are in a single layer. Then, put the sheet in the preheated oven and roast the potatoes for 20 minutes. Don't turn or stir the potatoes while they're cooking since you want them to develop a brown crust where they're touching the baking sheet. Flip over the potatoes and roast them for 30 to 40 more minutes. Wear oven mitts to pull the baking sheet out of the oven. Use a metal spatula to carefully flip the potatoes over and put the sheet back in the oven. Bake the potatoes until they're completely browned and crispy. Then, season them with salt and pepper according to your taste.Tip: If you'd like to add an herbal flavor to the browned potatoes, finely mince a handful of rosemary or parsley. Toss the herbs with the browned potatoes just before serving them. Remember that the insides of the potatoes are already cooked since you boiled them. Roasting them thoroughly is what browns them.",
  "sentences":[
    " Cooking the Potatoes on the Stove Peel 3 pounds (1.4 kg) of potatoes and cut them into 1 inch (2.5 cm) pieces.",
    "Rinse the potatoes and peel them.",
    "Then, place them on a cutting board and carefully chop each potato in 1/2.",
    "Lay the halves flat and cut them into quarters or chunks that are around 1 inch (2.5 cm) in size.",
    "You can use Russet potatoes, which become light brown on the outside and fluffy on the inside, yellow potatoes, which brown more and are more flavorful, or a combination of them.",
    "If you'd like larger potatoes, add a few minutes to the cooking time.",
    "To cut the potatoes smaller, decrease the cooking time by a few minutes.",
    "Melt the butter or warm the olive oil in a large skillet over medium-low heat.",
    "Set a large skillet on the stove and turn the burner to medium-low.",
    "Add 3 tablespoons (44.4 ml) (42 g) of unsalted butter or 3 tablespoons (44 ml) of olive oil.",
    "Leave the butter to melt or the oil to heat.",
    "All butter gives a richer flavor, but you could substitute your favorite cooking fat, such as coconut oil or beef fat.",
    "Add the potatoes to the skillet and season them with salt and pepper.",
    "Put the chopped potatoes into the hot skillet and add 1/2 teaspoon (2.5 g) of salt and 1/2 teaspoon (1 g) of black pepper.",
    "Stir until they're coated and arrange the potatoes so they're in a single layer.Tip: For extra flavorful seasoning, add 1/2 teaspoon (1 g) of paprika, 1/2 teaspoon (1 g) of garlic powder, and 1/2 teaspoon (1 g) of onion powder.",
    "If you'd like to include onions or peppers with the potatoes, chop 1 onion or bell pepper into ⁄2 to 1 inch (1.3 to 2.5 cm) pieces.",
    "Add them to the skillet with the potatoes so they soften and flavor the potatoes.",
    "Cook the potatoes for 25 to 30 minutes and stir them frequently.",
    "Leave the potatoes to brown for 5 minutes before stirring or turning them.",
    "This allows them to develop a brown crust.",
    "Continue to cook the potatoes over medium-low heat and stir them about every 5 minutes until they're tender in the center.",
    "If the potatoes stick to the skillet, pour in another 1 tablespoon (15 ml) of olive oil and swirl the pan to coat the bottom.",
    "Toss the browned potatoes with herbs if you want to add a fresh flavor.",
    "Turn off the burner and stir in 4 tablespoons (59.1 ml) (15 g) of freshly minced parsley.",
    "To add a little crunch, you could also mix in 4 tablespoons (59.1 ml) (24 g) of minced scallions.",
    "If you don't want to include the parsley and scallions, skip this step.",
    "Instead, season the browned potatoes with salt and pepper according to your taste.",
    "Roasting the Potatoes Peel 4 pounds (1.8 kg) of potatoes and cut them into large chunks.",
    "Rinse the potatoes to remove dirt and then peel them.",
    "Place them on a cutting board and use a large knife to carefully cut each potato in 1/2.",
    "Lay the halves flat on the cutting board and cut each into quarters or chunks that are 2 to 3 inches (5.1 to 7.6 cm) in size.",
    "Russet potatoes brown easier in the oven while yellow potatoes have more flavor.",
    "Try a mix of these if you can't decide on a single type of potato.",
    "Preheat the oven to 450 °F (232 °C) and bring a pot of water to boil on the stove.",
    "While you're waiting for the oven to heat, set a large pot on the stove and pour in 8 cups (1.9 L) of water.",
    "Put the lid on the pot and turn the burner to high so the water comes to a boil faster.",
    "If you plan on halving the recipe, you can use a medium-sized pot and half of the water.",
    "Add salt, baking soda, and the potatoes to the boiling water.",
    "Stir 2 tablespoons (25 g) of kosher salt into the water along with 1/2 teaspoon (4 g) of baking soda and the potato chunks.",
    "The salt flavors the potatoes and the baking soda helps the surface of the potato break down a little so it browns more in the oven.",
    "The baking soda and salt also prevent the potatoes from falling apart as they boil.",
    "Simmer the uncovered potatoes for 10 minutes.",
    "Once the potatoes begin boiling, turn the burner down to medium so the water bubbles gently.",
    "Keep the lid off of the pot and simmer the potatoes until they're soft when you insert a knife into one of them.",
    "Boiling the potatoes before you roast them allows moisture to escape faster.",
    "This gives the potatoes a richer brown crust as they bake in the oven.",
    "Drain the potatoes and return them to the pot.",
    "Turn off the burner and carefully pour the potatoes into a colander or fine-mesh strainer.",
    "Then, put the drained potatoes back into the hot pot.",
    "The heat from the pot removes excess moisture from the boiled potatoes.",
    "Toss the potatoes with 5 tablespoons (74 ml) of melted butter or olive oil.",
    "Drizzle the butter or extra-virgin olive oil over the potatoes in the pot and shake the pan well to coat the potatoes.",
    "Keep tossing the potatoes to rough up the outsides so they look a little smashed.Tip: To give your potatoes a savory garlic flavor, mince 6 cloves of garlic.",
    "Add them to the potatoes with the oil and toss the mixture well.",
    "Roughing up the potatoes creates a pasty coating on the outsides that becomes brown and crisp in the oven.",
    "Feel free to substitute any cooking fat for the butter or olive oil.",
    "Use duck fat, goose fat, or beef fat, for example.",
    "Spread the potatoes on the sheet and bake them for 20 minutes.",
    "Scoop the potato chunks onto a rimmed baking sheet and arrange them so the potatoes are in a single layer.",
    "Then, put the sheet in the preheated oven and roast the potatoes for 20 minutes.",
    "Don't turn or stir the potatoes while they're cooking since you want them to develop a brown crust where they're touching the baking sheet.",
    "Flip over the potatoes and roast them for 30 to 40 more minutes.",
    "Wear oven mitts to pull the baking sheet out of the oven.",
    "Use a metal spatula to carefully flip the potatoes over and put the sheet back in the oven.",
    "Bake the potatoes until they're completely browned and crispy.",
    "Then, season them with salt and pepper according to your taste.Tip: If you'd like to add an herbal flavor to the browned potatoes, finely mince a handful of rosemary or parsley.",
    "Toss the herbs with the browned potatoes just before serving them.",
    "Remember that the insides of the potatoes are already cooked since you boiled them.",
    "Roasting them thoroughly is what browns them."
  ],
  "tyn_section":[
    "Golden Brown Skillet Potatoes",
    "Vegetable peeler",
    "Knife and cutting board",
    "Large skillet",
    "Metal spatula",
    "Oven-Browned Potatoes",
    "Pot",
    "Colander or fine-mesh strainer",
    "Rimmed baking sheet"
  ],
  "tyn_model":[
    "potatoes",
    "oven",
    "water",
    "butter",
    "potato",
    "olive oil",
    "skillet",
    "salt",
    "baking soda",
    "pot",
    "salt and pepper",
    "parsley",
    "burner",
    "baking sheet",
    "cutting board",
    "russet potatoes",
    "large skillet",
    "oil",
    "cooking fat",
    "beef fat",
    "garlic",
    "herbs",
    "scallions",
    "stove",
    "unsalted butter",
    "coconut oil",
    "black pepper",
    "paprika",
    "onion powder",
    "onion",
    "bell pepper",
    "large knife",
    "kosher salt",
    "knife",
    "colander",
    "fine-mesh strainer",
    "hot pot",
    "extra-virgin olive oil",
    "pan",
    "duck fat",
    "goose fat",
    "oven mitts",
    "spatula",
    "rosemary"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.0454545455,
    "f1":0.0754716981,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7777777778,
    "p":0.2045454545,
    "f1":0.323907455
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7777777778,
    "p":0.25,
    "f1":0.3783783784
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0681818182,
    "f1":0.1132075472
  }
}