{
  "title":"How to Make Coffee Filter Butterflies",
  "url":"https://www.wikihow.com/Make-Coffee-Filter-Butterflies",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Adding Custom Designs with Markers",
      "steps":[
        {
          "headline":"Use water-soluble markers to color a coffee filter.",
          "description":"Flatten the coffee filter on a hard surface so it’s easy to color it. Use your markers to draw large blocks of color or to sketch out a design.For instance, you might draw big triangles or circles across the coffee filters. Alternatively, keep it simple by drawing stripes over the surface of the coffee filter. It’s okay to leave gaps between the colors because they will spread and blend when you wet the coffee filter. Don’t use a permanent marker because the color won’t spread.Variation: Use a paint brush to apply watercolors to the coffee filters. Brush water across the coffee filter using your paint brush. Then, use your brush to dab watercolors into the water. Watch as the paint spreads across the coffee filter and the colors merge together."
        },
        {
          "headline":"Pinch the edge of the coffee filter and hold it up.",
          "description":"It’s best to dangle the coffee filter in the air while you spray it so it doesn’t get too wet. Use the tips of your fingertips or your fingernails to hold the coffee filter. This way you can spritz the filter without the water pooling on the surface."
        },
        {
          "headline":"Spray the coffee filter with water to make the colors spread.",
          "description":"Position your spray bottle on the side of the coffee filter that you colored. Hold the spray bottle about 6 in (15 cm) away from the coffee filter, then spritz the coffee filter 2-3 times. Watch as the marker colors spread across the coffee filter and merge.The colors will create new colors as they combine. For instance, red and blue will merge to make purple."
        },
        {
          "headline":"Lay the coffee filter out to dry completely.",
          "description":"Place the wet coffee filter on a flat surface so it dries mostly flat. Leave it to set until it’s totally dry.Press the pad of your finger against the coffee filter to see if it’s dry. How long it’ll take for the coffee filters to dry depends on how wet it is. For a slightly damp coffee filter, it’ll likely take 30 minutes to an hour to dry. However, it could take a couple of hours for a wet filter to dry."
        }
      ]
    },
    {
      "name":"Trying Color Spectrum Experiments",
      "steps":[
        {
          "headline":"Use a marker to draw a circle 1 in (2.5 cm) from the center of the filter.",
          "description":"Spread out a coffee filter on a flat surface. Then, use a water-soluble marker to draw a thick circle that’s about 1 in (2.5 cm) from the center of the coffee filter on all sides. Stick to 1 color per coffee filter.Draw circles on multiple coffee filters using different colored markers. This allows you to experiment with several colors. For instance, you might use purple, green, and orange markers to see what colors separate out of the original shade. Make sure you’re using water-soluble markers. Water-soluble colors will separate and spread when they get wet. However, permanent markers will not be affected by water.Did You Know? When the water separates out the color, it will create a chromatic spectrum. This helps you understand how colors combine to create other colors."
        },
        {
          "headline":"Fold the coffee filter into a cone.",
          "description":"Line up the edges of the coffee filter to fold it in half. Then, fold it in half again. Fold it in half 1 more time to make the shape of the cone. Pull the folded coffee filter apart at the 3rd and 4th layer to create a funnel.You can create the funnel anyway you like, as long as the center of the coffee filter is the tip."
        },
        {
          "headline":"Stick the tip of the cone into a glass of water and remove it immediately.",
          "description":"Fill a cup with water, then dip the end of the coffee filter cone into the water. Quickly remove the cone from the water so that just the tip gets wet.Don’t let the colored part of the coffee filter dip below the water. If it does, the filter will get too wet and the color may leach out of the filter."
        },
        {
          "headline":"Watch the colors separate and spread across the coffee filter.",
          "description":"Even though just the tip is wet, the water will spread across the coffee filter out to the edge. When the marker color gets wet, the color will separate out into a spectrum of color. Watch as the colors spread from the circle out across the filter.For example, purple marker might create a spectrum of purple, pink, red, and blue."
        },
        {
          "headline":"Lay out the coffee filter until it dries completely.",
          "description":"Place the wet coffee filter on a flat surface while it dries. Leave it to set until it feels totally dry to the touch. Use the pad of your finger to make sure the coffee filter is dry.The coffee filter will likely be dry in 1-2 hours."
        }
      ]
    },
    {
      "name":"Making Butterfly Wings",
      "steps":[
        {
          "headline":"Scrunch the middle of the dry coffee filter to create 2 wings.",
          "description":"Find the center of the coffee filter, then press the edges of the filter toward each other. Use your fingers to squish down on the center to create the wings of the butterfly.The center of the coffee filter will become the butterfly’s body, while the sides will be the wings."
        },
        {
          "headline":"Wrap a pipe cleaner around the filter to create a body.",
          "description":"Place the center of the pipe cleaner at the base of the center of the coffee filter. Fold the pipe cleaner up around the center of the coffee filter, then twist the ends of the pipe cleaner to secure it in place.You can use a whole pipe cleaner or half of a pipe cleaner. If you prefer, use scissors to cut the pipe cleaner into 2 pieces.Variation: You can also use a clothespin to create the body. Simply pinch the clothes pin over the scrunched up center of your coffee filter. If you want antennae, pinch the clothespin in the center of a pipe cleaner, then shape the pipe cleaner into antenna."
        },
        {
          "headline":"Bend the ends of the pipe cleaner to look like antennae.",
          "description":"Pull the 2 ends of the pipe cleaner apart. Then, curve each end of the pipe cleaner toward the wing on its side. Use your fingers to adjust the ends of the pipe cleaners until you're happy with the look of the antennae.If you like, put beads on the ends of the antennae to add a little pizzazz to your butterfly. Plastic crafting beads work great!"
        },
        {
          "headline":"Spread out the wings to make them look like a butterfly.",
          "description":"Gently pull the sides apart to fan them out like butterfly wings. Adjust the wings until you’re happy with how they look. Don’t pull too hard on the coffee filter because it may tear.If you like, fold the sides of the filter to change the look of the look of the wings."
        }
      ]
    }
  ],
  "text":" Adding Custom Designs with Markers Use water-soluble markers to color a coffee filter. Flatten the coffee filter on a hard surface so it’s easy to color it. Use your markers to draw large blocks of color or to sketch out a design.For instance, you might draw big triangles or circles across the coffee filters. Alternatively, keep it simple by drawing stripes over the surface of the coffee filter. It’s okay to leave gaps between the colors because they will spread and blend when you wet the coffee filter. Don’t use a permanent marker because the color won’t spread.Variation: Use a paint brush to apply watercolors to the coffee filters. Brush water across the coffee filter using your paint brush. Then, use your brush to dab watercolors into the water. Watch as the paint spreads across the coffee filter and the colors merge together. Pinch the edge of the coffee filter and hold it up. It’s best to dangle the coffee filter in the air while you spray it so it doesn’t get too wet. Use the tips of your fingertips or your fingernails to hold the coffee filter. This way you can spritz the filter without the water pooling on the surface. Spray the coffee filter with water to make the colors spread. Position your spray bottle on the side of the coffee filter that you colored. Hold the spray bottle about 6 in (15 cm) away from the coffee filter, then spritz the coffee filter 2-3 times. Watch as the marker colors spread across the coffee filter and merge.The colors will create new colors as they combine. For instance, red and blue will merge to make purple. Lay the coffee filter out to dry completely. Place the wet coffee filter on a flat surface so it dries mostly flat. Leave it to set until it’s totally dry.Press the pad of your finger against the coffee filter to see if it’s dry. How long it’ll take for the coffee filters to dry depends on how wet it is. For a slightly damp coffee filter, it’ll likely take 30 minutes to an hour to dry. However, it could take a couple of hours for a wet filter to dry. Trying Color Spectrum Experiments Use a marker to draw a circle 1 in (2.5 cm) from the center of the filter. Spread out a coffee filter on a flat surface. Then, use a water-soluble marker to draw a thick circle that’s about 1 in (2.5 cm) from the center of the coffee filter on all sides. Stick to 1 color per coffee filter.Draw circles on multiple coffee filters using different colored markers. This allows you to experiment with several colors. For instance, you might use purple, green, and orange markers to see what colors separate out of the original shade. Make sure you’re using water-soluble markers. Water-soluble colors will separate and spread when they get wet. However, permanent markers will not be affected by water.Did You Know? When the water separates out the color, it will create a chromatic spectrum. This helps you understand how colors combine to create other colors. Fold the coffee filter into a cone. Line up the edges of the coffee filter to fold it in half. Then, fold it in half again. Fold it in half 1 more time to make the shape of the cone. Pull the folded coffee filter apart at the 3rd and 4th layer to create a funnel.You can create the funnel anyway you like, as long as the center of the coffee filter is the tip. Stick the tip of the cone into a glass of water and remove it immediately. Fill a cup with water, then dip the end of the coffee filter cone into the water. Quickly remove the cone from the water so that just the tip gets wet.Don’t let the colored part of the coffee filter dip below the water. If it does, the filter will get too wet and the color may leach out of the filter. Watch the colors separate and spread across the coffee filter. Even though just the tip is wet, the water will spread across the coffee filter out to the edge. When the marker color gets wet, the color will separate out into a spectrum of color. Watch as the colors spread from the circle out across the filter.For example, purple marker might create a spectrum of purple, pink, red, and blue. Lay out the coffee filter until it dries completely. Place the wet coffee filter on a flat surface while it dries. Leave it to set until it feels totally dry to the touch. Use the pad of your finger to make sure the coffee filter is dry.The coffee filter will likely be dry in 1-2 hours. Making Butterfly Wings Scrunch the middle of the dry coffee filter to create 2 wings. Find the center of the coffee filter, then press the edges of the filter toward each other. Use your fingers to squish down on the center to create the wings of the butterfly.The center of the coffee filter will become the butterfly’s body, while the sides will be the wings. Wrap a pipe cleaner around the filter to create a body. Place the center of the pipe cleaner at the base of the center of the coffee filter. Fold the pipe cleaner up around the center of the coffee filter, then twist the ends of the pipe cleaner to secure it in place.You can use a whole pipe cleaner or half of a pipe cleaner. If you prefer, use scissors to cut the pipe cleaner into 2 pieces.Variation: You can also use a clothespin to create the body. Simply pinch the clothes pin over the scrunched up center of your coffee filter. If you want antennae, pinch the clothespin in the center of a pipe cleaner, then shape the pipe cleaner into antenna. Bend the ends of the pipe cleaner to look like antennae. Pull the 2 ends of the pipe cleaner apart. Then, curve each end of the pipe cleaner toward the wing on its side. Use your fingers to adjust the ends of the pipe cleaners until you're happy with the look of the antennae.If you like, put beads on the ends of the antennae to add a little pizzazz to your butterfly. Plastic crafting beads work great! Spread out the wings to make them look like a butterfly. Gently pull the sides apart to fan them out like butterfly wings. Adjust the wings until you’re happy with how they look. Don’t pull too hard on the coffee filter because it may tear.If you like, fold the sides of the filter to change the look of the look of the wings.",
  "sentences":[
    " Adding Custom Designs with Markers Use water-soluble markers to color a coffee filter.",
    "Flatten the coffee filter on a hard surface so it’s easy to color it.",
    "Use your markers to draw large blocks of color or to sketch out a design.For instance, you might draw big triangles or circles across the coffee filters.",
    "Alternatively, keep it simple by drawing stripes over the surface of the coffee filter.",
    "It’s okay to leave gaps between the colors because they will spread and blend when you wet the coffee filter.",
    "Don’t use a permanent marker because the color won’t spread.Variation: Use a paint brush to apply watercolors to the coffee filters.",
    "Brush water across the coffee filter using your paint brush.",
    "Then, use your brush to dab watercolors into the water.",
    "Watch as the paint spreads across the coffee filter and the colors merge together.",
    "Pinch the edge of the coffee filter and hold it up.",
    "It’s best to dangle the coffee filter in the air while you spray it so it doesn’t get too wet.",
    "Use the tips of your fingertips or your fingernails to hold the coffee filter.",
    "This way you can spritz the filter without the water pooling on the surface.",
    "Spray the coffee filter with water to make the colors spread.",
    "Position your spray bottle on the side of the coffee filter that you colored.",
    "Hold the spray bottle about 6 in (15 cm) away from the coffee filter, then spritz the coffee filter 2-3 times.",
    "Watch as the marker colors spread across the coffee filter and merge.The colors will create new colors as they combine.",
    "For instance, red and blue will merge to make purple.",
    "Lay the coffee filter out to dry completely.",
    "Place the wet coffee filter on a flat surface so it dries mostly flat.",
    "Leave it to set until it’s totally dry.Press the pad of your finger against the coffee filter to see if it’s dry.",
    "How long it’ll take for the coffee filters to dry depends on how wet it is.",
    "For a slightly damp coffee filter, it’ll likely take 30 minutes to an hour to dry.",
    "However, it could take a couple of hours for a wet filter to dry.",
    "Trying Color Spectrum Experiments Use a marker to draw a circle 1 in (2.5 cm) from the center of the filter.",
    "Spread out a coffee filter on a flat surface.",
    "Then, use a water-soluble marker to draw a thick circle that’s about 1 in (2.5 cm) from the center of the coffee filter on all sides.",
    "Stick to 1 color per coffee filter.Draw circles on multiple coffee filters using different colored markers.",
    "This allows you to experiment with several colors.",
    "For instance, you might use purple, green, and orange markers to see what colors separate out of the original shade.",
    "Make sure you’re using water-soluble markers.",
    "Water-soluble colors will separate and spread when they get wet.",
    "However, permanent markers will not be affected by water.Did You Know?",
    "When the water separates out the color, it will create a chromatic spectrum.",
    "This helps you understand how colors combine to create other colors.",
    "Fold the coffee filter into a cone.",
    "Line up the edges of the coffee filter to fold it in half.",
    "Then, fold it in half again.",
    "Fold it in half 1 more time to make the shape of the cone.",
    "Pull the folded coffee filter apart at the 3rd and 4th layer to create a funnel.You can create the funnel anyway you like, as long as the center of the coffee filter is the tip.",
    "Stick the tip of the cone into a glass of water and remove it immediately.",
    "Fill a cup with water, then dip the end of the coffee filter cone into the water.",
    "Quickly remove the cone from the water so that just the tip gets wet.Don’t let the colored part of the coffee filter dip below the water.",
    "If it does, the filter will get too wet and the color may leach out of the filter.",
    "Watch the colors separate and spread across the coffee filter.",
    "Even though just the tip is wet, the water will spread across the coffee filter out to the edge.",
    "When the marker color gets wet, the color will separate out into a spectrum of color.",
    "Watch as the colors spread from the circle out across the filter.For example, purple marker might create a spectrum of purple, pink, red, and blue.",
    "Lay out the coffee filter until it dries completely.",
    "Place the wet coffee filter on a flat surface while it dries.",
    "Leave it to set until it feels totally dry to the touch.",
    "Use the pad of your finger to make sure the coffee filter is dry.The coffee filter will likely be dry in 1-2 hours.",
    "Making Butterfly Wings Scrunch the middle of the dry coffee filter to create 2 wings.",
    "Find the center of the coffee filter, then press the edges of the filter toward each other.",
    "Use your fingers to squish down on the center to create the wings of the butterfly.The center of the coffee filter will become the butterfly’s body, while the sides will be the wings.",
    "Wrap a pipe cleaner around the filter to create a body.",
    "Place the center of the pipe cleaner at the base of the center of the coffee filter.",
    "Fold the pipe cleaner up around the center of the coffee filter, then twist the ends of the pipe cleaner to secure it in place.You can use a whole pipe cleaner or half of a pipe cleaner.",
    "If you prefer, use scissors to cut the pipe cleaner into 2 pieces.Variation: You can also use a clothespin to create the body.",
    "Simply pinch the clothes pin over the scrunched up center of your coffee filter.",
    "If you want antennae, pinch the clothespin in the center of a pipe cleaner, then shape the pipe cleaner into antenna.",
    "Bend the ends of the pipe cleaner to look like antennae.",
    "Pull the 2 ends of the pipe cleaner apart.",
    "Then, curve each end of the pipe cleaner toward the wing on its side.",
    "Use your fingers to adjust the ends of the pipe cleaners until you're happy with the look of the antennae.If you like, put beads on the ends of the antennae to add a little pizzazz to your butterfly.",
    "Plastic crafting beads work great!",
    "Spread out the wings to make them look like a butterfly.",
    "Gently pull the sides apart to fan them out like butterfly wings.",
    "Adjust the wings until you’re happy with how they look.",
    "Don’t pull too hard on the coffee filter because it may tear.If you like, fold the sides of the filter to change the look of the look of the wings."
  ],
  "tyn_section":[
    "White coffee filters",
    "Pipe cleaners",
    "Water-soluble markers",
    "Spray bottle",
    "Water",
    "Watercolors (optional)",
    "Paint brushes (optional)",
    "Cup of water",
    "Pipe cleaner",
    "Clothes pin (optional)"
  ],
  "tyn_model":[
    "coffee filter",
    "pipe cleaner",
    "water",
    "markers",
    "water-soluble markers",
    "paint brush",
    "watercolors",
    "spray bottle",
    "marker",
    "permanent marker",
    "coffee filters",
    "water-soluble marker",
    "glass",
    "purple marker",
    "scissors",
    "clothes pin",
    "clothespin",
    "pipe cleaners",
    "beads",
    "plastic crafting beads"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.45,
    "f1":0.576
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9,
    "p":0.5,
    "f1":0.6428571429
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7,
    "p":0.35,
    "f1":0.4666666667
  }
}