{
  "title":"How to Use Up Tart Cherries",
  "url":"https://www.wikihow.com/Use-Up-Tart-Cherries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Stone Fruit"
  ],
  "methods":[
    {
      "name":"Baking Desserts with Cherries",
      "steps":[
        {
          "headline":"Make a tart cherry pie using 4 cups (560 g) of cherries.",
          "description":"Pour your cherries into a medium saucepan and allow them to simmer over medium heat for 5 minutes. Mix 1 cup (200 g) of granulated sugar and 4 tablespoon (59.1 ml) (30 g) of cornstarch in a small bowl and add that to the cherries. Cook your mixture over low heat for about 10 minutes until it is thick. Pour your cherry mixture into a pie crust and cover the top with pie dough. Cook your pie in the oven at 350 °F (177 °C) for 50 minutes.Sprinkle granulated sugar on top of the pie crust before you bake it for an added touch of sweetness."
        },
        {
          "headline":"Use 2 cups of cherries for a cherry cobbler.",
          "description":"Preheat your oven to 350 °F (177 °C). Combine 1 cup (145 g) of flour, 1 cup (200 g) of sugar, and 1 tsp (4.79 g) of baking powder in a bowl. Stir in 1 cup (240 mL) of milk until your ingredients are well blended. Grease a 9 by 13 in (23 by 33 cm) pan and pour your mixture into it. Toss your cherries in ¾ cup (150 g) of sugar and 1 tablespoon (14.8 ml) (9 g) of flour. Pour your cherries into the mixture, but don’t stir them in. Bake for 50 to 60 minutes or until your cobbler is golden brown.Insert a toothpick into the center of the cobbler to check if it is done. If the toothpick comes out clean, your cobbler is ready to come out of the oven."
        },
        {
          "headline":"Put cherries into your muffins for a sweet treat.",
          "description":"Preheat your oven to 400 °F (204 °C) and line a muffin tin with paper liners. Mix together 1.5 cups (217 g) of flour, ¾ cup (150 g) of granulated sugar, 2 tsp (9.5 g) of baking powder, and ½ tsp (3 g) of salt in a large bowl. In a small bowl, whisk together ⁄3 cup (79 mL) of vegetable oil, ⁄3 cup (79 mL) of milk, 1 egg, and ⁄2 teaspoon (2.5 mL) of almond extract and then add it to the flour mixture. Fold in 1 cup (140 g) of tart cherries with a spatula. Fill each muffin tin with batter about ⅔ of the way full and bake for 20 minutes.Tip: You can leave the cherries whole for larger bites of cherries, or quarter them to spread them out."
        },
        {
          "headline":"Make cherry cookies for a bite sized treat.",
          "description":"Preheat your oven to 375 °F (191 °C) and grease a cookie sheet. Mix together 1 cup (227 g) of butter, ½ cup (100 g) of granulated sugar, 1 teaspoon (4.9 mL) of vanilla extract, 2.5 cups (362 g) of flour, and a pinch of salt in a large bowl. Quarter 2 cups (280 g) of cherries and fold them into your batter. Form your batter into 1 in (2.5 cm) balls and place them on your cookie sheets. Let them bake for 15 minutes.Do not let your cookies get too brown, or you could burn your cherries."
        }
      ]
    },
    {
      "name":"Making Maraschino Cherries",
      "steps":[
        {
          "headline":"Wash and remove the pits from your cherries.",
          "description":"Run all of your cherries under cool water and pat them dry with a clean towel. Slice each cherry down the middle and use the tip of your knife to pop the pit out.Tip: You can either leave the stems on or take them off depending on your preference. Leaving the stems on makes the cherries easier to pick up, and taking them off leaves only the edible parts of the cherries."
        },
        {
          "headline":"Heat up 1 cup (240 mL) of maraschino liqueur in a saucepan.",
          "description":"Pour your liqueur into a saucepan and put it on medium heat. Allow it to simmer, but don’t let it boil. Look for small bubbles as it gets ready to boil.You can find maraschino liqueur at most grocery stores in the baking aisle."
        },
        {
          "headline":"Take the pan off of the heat and add the cherries.",
          "description":"Move the saucepan so that it is not directly over the heat and carefully pour your cherries into it. Use caution so that the liqueur does not splash your hands. Make sure the cherries are fully submerged in the liqueur.If you have a lot of cherries, you may need to separate them into a few batches."
        },
        {
          "headline":"Let everything in the pan cool for 10 minutes.",
          "description":"The liqueur will still be very hot. Allow your pan to sit for at least 10 minutes until it cools down to room temperature. Make sure the pan isn’t over heat."
        },
        {
          "headline":"Pour the liquid and the cherries into a glass jar with a lid.",
          "description":"Make sure all of the cherries are submerged. Close the lid of the glass jar tightly.If the liqueur doesn’t quite cover all of your cherries, turn your jar upside down every 2 days to make sure the top cherries get dunked."
        },
        {
          "headline":"Store your maraschino cherries in the fridge for up to 2 months.",
          "description":"Keep the cherries in the glass jar and open it when you want to get some out. The liqueur will continue to soak into the cherries and make the flavor better over time. You can use your cherries for cocktails or eat them on their own.Homemade maraschino cherries are made with much less sugar and corn syrup than store-bought ones."
        }
      ]
    },
    {
      "name":"Creating Tart Cherry Vinaigrette",
      "steps":[
        {
          "headline":"Put water, cherries, lemon juice, and sugar into a medium saucepan.",
          "description":"Combine ⁄4 cup (59 mL) of water, 2 cups (280 g) of tart cherries, 1 tablespoon (15 mL) of lemon juice, and 2 tsp (8.33 g) of granulated sugar in a saucepan. Make sure the saucepan is wide enough to hold all of your ingredients.Tip: Add in a pinch of salt and black pepper for some extra flavor in your vinaigrette."
        },
        {
          "headline":"Place the saucepan over medium heat for 10 minutes.",
          "description":"Stir your mixture occasionally with a wooden spoon. Make sure your cherries are softened at the end of 10 minutes. Don’t let your mixture get to a boiling temperature.If your mixture starts simmering, turn your heat down."
        },
        {
          "headline":"Strain your mixture to remove the solid chunks.",
          "description":"Place a strainer over a large bowl. Carefully pour your mixture into the strainer to remove the cherries. Throw away the cherries and keep the liquid mixture."
        },
        {
          "headline":"Put your liquid into a saucepan over medium heat for 20 minutes.",
          "description":"The liquid must be reduced down further in order to be thick enough for a salad. Cook your liquid on medium heat for about 20 minutes or until it has reduced down to ⁄3  c (79 mL). Stir your mixture occasionally.Do not let your mixture boil. If you start seeing small bubbles, turn your heat down."
        },
        {
          "headline":"Let your vinaigrette cool to room temperature.",
          "description":"Take your saucepan off of the heat and let it cool down until it is room temperature, or about 30 minutes. Make sure your vinaigrette is not warm anymore before you serve it.Warm vinaigrette can heat up the greens in your salad and make them less appetizing."
        },
        {
          "headline":"Drizzle the vinaigrette over salads, roasted vegetables, or fish.",
          "description":"Cherry vinaigrette goes well with tart cheese and bacon bits in a salad. Or, drizzle it over some roasted broccoli and cauliflower for an added taste. Add it to salmon or cod to up the flavor of your dish.If you have extra vinaigrette, store it in an airtight container in the fridge for up to 1 week."
        }
      ]
    },
    {
      "name":"Pickling Cherries",
      "steps":[
        {
          "headline":"Boil water, vinegar, sugar, salt, mustard seeds, and peppercorns in a saucepan.",
          "description":"Combine 1 cup (240 mL) of water, ⁄4 cup (180 mL) of red wine vinegar, ½ cup (100 g) of granulated sugar, 2 tablespoon (29.6 ml) (36 g) of salt, 2 tsp (5 g) of mustard seeds, and 2 tsp (5 g) of peppercorns. Make sure your saucepan is large enough so that your mixture doesn’t spill out."
        },
        {
          "headline":"Cook the mixture for 3 minutes.",
          "description":"Use a wooden spoon to stir your mixture the entire time. Make sure all of the sugar is dissolved before you take your pan off of the heat.Keep the mixture at a boil the entire time it cooks."
        },
        {
          "headline":"Place 2 cups (280 g) of cherries into a glass jar with a lid.",
          "description":"Use an airtight container with a lid. Put your cherries into the container, making sure there is enough room so the lid won’t squish them. If your container is not big enough, split your cherries into 2 containers.Tip: If you don’t have an airtight container, choose something you can cover with plastic wrap."
        },
        {
          "headline":"Pour your pickling liquid over the cherries.",
          "description":"Carefully transfer your mixture to the airtight container. Make sure all of your cherries are fully submerged. If you have extra liquid, put it into a separate jar with more cherries.Add 1 sprig of rosemary for a floral, herbaceous flavor."
        },
        {
          "headline":"Place your container in the fridge for 1 day.",
          "description":"Allow the pickling liquid to soak into the cherries before you use them. Store your cherries in the fridge for up to 1 month. Use them on charcuterie boards, in cocktails, or eat them on their own.Pickled cherries have a sharp, vinegar taste that pairs well with cheese and bitter cocktails."
        }
      ]
    }
  ],
  "text":" Baking Desserts with Cherries Make a tart cherry pie using 4 cups (560 g) of cherries. Pour your cherries into a medium saucepan and allow them to simmer over medium heat for 5 minutes. Mix 1 cup (200 g) of granulated sugar and 4 tablespoon (59.1 ml) (30 g) of cornstarch in a small bowl and add that to the cherries. Cook your mixture over low heat for about 10 minutes until it is thick. Pour your cherry mixture into a pie crust and cover the top with pie dough. Cook your pie in the oven at 350 °F (177 °C) for 50 minutes.Sprinkle granulated sugar on top of the pie crust before you bake it for an added touch of sweetness. Use 2 cups of cherries for a cherry cobbler. Preheat your oven to 350 °F (177 °C). Combine 1 cup (145 g) of flour, 1 cup (200 g) of sugar, and 1 tsp (4.79 g) of baking powder in a bowl. Stir in 1 cup (240 mL) of milk until your ingredients are well blended. Grease a 9 by 13 in (23 by 33 cm) pan and pour your mixture into it. Toss your cherries in ¾ cup (150 g) of sugar and 1 tablespoon (14.8 ml) (9 g) of flour. Pour your cherries into the mixture, but don’t stir them in. Bake for 50 to 60 minutes or until your cobbler is golden brown.Insert a toothpick into the center of the cobbler to check if it is done. If the toothpick comes out clean, your cobbler is ready to come out of the oven. Put cherries into your muffins for a sweet treat. Preheat your oven to 400 °F (204 °C) and line a muffin tin with paper liners. Mix together 1.5 cups (217 g) of flour, ¾ cup (150 g) of granulated sugar, 2 tsp (9.5 g) of baking powder, and ½ tsp (3 g) of salt in a large bowl. In a small bowl, whisk together ⁄3 cup (79 mL) of vegetable oil, ⁄3 cup (79 mL) of milk, 1 egg, and ⁄2 teaspoon (2.5 mL) of almond extract and then add it to the flour mixture. Fold in 1 cup (140 g) of tart cherries with a spatula. Fill each muffin tin with batter about ⅔ of the way full and bake for 20 minutes.Tip: You can leave the cherries whole for larger bites of cherries, or quarter them to spread them out. Make cherry cookies for a bite sized treat. Preheat your oven to 375 °F (191 °C) and grease a cookie sheet. Mix together 1 cup (227 g) of butter, ½ cup (100 g) of granulated sugar, 1 teaspoon (4.9 mL) of vanilla extract, 2.5 cups (362 g) of flour, and a pinch of salt in a large bowl. Quarter 2 cups (280 g) of cherries and fold them into your batter. Form your batter into 1 in (2.5 cm) balls and place them on your cookie sheets. Let them bake for 15 minutes.Do not let your cookies get too brown, or you could burn your cherries. Making Maraschino Cherries Wash and remove the pits from your cherries. Run all of your cherries under cool water and pat them dry with a clean towel. Slice each cherry down the middle and use the tip of your knife to pop the pit out.Tip: You can either leave the stems on or take them off depending on your preference. Leaving the stems on makes the cherries easier to pick up, and taking them off leaves only the edible parts of the cherries. Heat up 1 cup (240 mL) of maraschino liqueur in a saucepan. Pour your liqueur into a saucepan and put it on medium heat. Allow it to simmer, but don’t let it boil. Look for small bubbles as it gets ready to boil.You can find maraschino liqueur at most grocery stores in the baking aisle. Take the pan off of the heat and add the cherries. Move the saucepan so that it is not directly over the heat and carefully pour your cherries into it. Use caution so that the liqueur does not splash your hands. Make sure the cherries are fully submerged in the liqueur.If you have a lot of cherries, you may need to separate them into a few batches. Let everything in the pan cool for 10 minutes. The liqueur will still be very hot. Allow your pan to sit for at least 10 minutes until it cools down to room temperature. Make sure the pan isn’t over heat. Pour the liquid and the cherries into a glass jar with a lid. Make sure all of the cherries are submerged. Close the lid of the glass jar tightly.If the liqueur doesn’t quite cover all of your cherries, turn your jar upside down every 2 days to make sure the top cherries get dunked. Store your maraschino cherries in the fridge for up to 2 months. Keep the cherries in the glass jar and open it when you want to get some out. The liqueur will continue to soak into the cherries and make the flavor better over time. You can use your cherries for cocktails or eat them on their own.Homemade maraschino cherries are made with much less sugar and corn syrup than store-bought ones. Creating Tart Cherry Vinaigrette Put water, cherries, lemon juice, and sugar into a medium saucepan. Combine ⁄4 cup (59 mL) of water, 2 cups (280 g) of tart cherries, 1 tablespoon (15 mL) of lemon juice, and 2 tsp (8.33 g) of granulated sugar in a saucepan. Make sure the saucepan is wide enough to hold all of your ingredients.Tip: Add in a pinch of salt and black pepper for some extra flavor in your vinaigrette. Place the saucepan over medium heat for 10 minutes. Stir your mixture occasionally with a wooden spoon. Make sure your cherries are softened at the end of 10 minutes. Don’t let your mixture get to a boiling temperature.If your mixture starts simmering, turn your heat down. Strain your mixture to remove the solid chunks. Place a strainer over a large bowl. Carefully pour your mixture into the strainer to remove the cherries. Throw away the cherries and keep the liquid mixture. Put your liquid into a saucepan over medium heat for 20 minutes. The liquid must be reduced down further in order to be thick enough for a salad. Cook your liquid on medium heat for about 20 minutes or until it has reduced down to ⁄3  c (79 mL). Stir your mixture occasionally.Do not let your mixture boil. If you start seeing small bubbles, turn your heat down. Let your vinaigrette cool to room temperature. Take your saucepan off of the heat and let it cool down until it is room temperature, or about 30 minutes. Make sure your vinaigrette is not warm anymore before you serve it.Warm vinaigrette can heat up the greens in your salad and make them less appetizing. Drizzle the vinaigrette over salads, roasted vegetables, or fish. Cherry vinaigrette goes well with tart cheese and bacon bits in a salad. Or, drizzle it over some roasted broccoli and cauliflower for an added taste. Add it to salmon or cod to up the flavor of your dish.If you have extra vinaigrette, store it in an airtight container in the fridge for up to 1 week. Pickling Cherries Boil water, vinegar, sugar, salt, mustard seeds, and peppercorns in a saucepan. Combine 1 cup (240 mL) of water, ⁄4 cup (180 mL) of red wine vinegar, ½ cup (100 g) of granulated sugar, 2 tablespoon (29.6 ml) (36 g) of salt, 2 tsp (5 g) of mustard seeds, and 2 tsp (5 g) of peppercorns. Make sure your saucepan is large enough so that your mixture doesn’t spill out. Cook the mixture for 3 minutes. Use a wooden spoon to stir your mixture the entire time. Make sure all of the sugar is dissolved before you take your pan off of the heat.Keep the mixture at a boil the entire time it cooks. Place 2 cups (280 g) of cherries into a glass jar with a lid. Use an airtight container with a lid. Put your cherries into the container, making sure there is enough room so the lid won’t squish them. If your container is not big enough, split your cherries into 2 containers.Tip: If you don’t have an airtight container, choose something you can cover with plastic wrap. Pour your pickling liquid over the cherries. Carefully transfer your mixture to the airtight container. Make sure all of your cherries are fully submerged. If you have extra liquid, put it into a separate jar with more cherries.Add 1 sprig of rosemary for a floral, herbaceous flavor. Place your container in the fridge for 1 day. Allow the pickling liquid to soak into the cherries before you use them. Store your cherries in the fridge for up to 1 month. Use them on charcuterie boards, in cocktails, or eat them on their own.Pickled cherries have a sharp, vinegar taste that pairs well with cheese and bitter cocktails.",
  "sentences":[
    " Baking Desserts with Cherries Make a tart cherry pie using 4 cups (560 g) of cherries.",
    "Pour your cherries into a medium saucepan and allow them to simmer over medium heat for 5 minutes.",
    "Mix 1 cup (200 g) of granulated sugar and 4 tablespoon (59.1 ml) (30 g) of cornstarch in a small bowl and add that to the cherries.",
    "Cook your mixture over low heat for about 10 minutes until it is thick.",
    "Pour your cherry mixture into a pie crust and cover the top with pie dough.",
    "Cook your pie in the oven at 350 °F (177 °C) for 50 minutes.Sprinkle granulated sugar on top of the pie crust before you bake it for an added touch of sweetness.",
    "Use 2 cups of cherries for a cherry cobbler.",
    "Preheat your oven to 350 °F (177 °C).",
    "Combine 1 cup (145 g) of flour, 1 cup (200 g) of sugar, and 1 tsp (4.79 g) of baking powder in a bowl.",
    "Stir in 1 cup (240 mL) of milk until your ingredients are well blended.",
    "Grease a 9 by 13 in (23 by 33 cm) pan and pour your mixture into it.",
    "Toss your cherries in ¾ cup (150 g) of sugar and 1 tablespoon (14.8 ml) (9 g) of flour.",
    "Pour your cherries into the mixture, but don’t stir them in.",
    "Bake for 50 to 60 minutes or until your cobbler is golden brown.Insert a toothpick into the center of the cobbler to check if it is done.",
    "If the toothpick comes out clean, your cobbler is ready to come out of the oven.",
    "Put cherries into your muffins for a sweet treat.",
    "Preheat your oven to 400 °F (204 °C) and line a muffin tin with paper liners.",
    "Mix together 1.5 cups (217 g) of flour, ¾ cup (150 g) of granulated sugar, 2 tsp (9.5 g) of baking powder, and ½ tsp (3 g) of salt in a large bowl.",
    "In a small bowl, whisk together ⁄3 cup (79 mL) of vegetable oil, ⁄3 cup (79 mL) of milk, 1 egg, and ⁄2 teaspoon (2.5 mL) of almond extract and then add it to the flour mixture.",
    "Fold in 1 cup (140 g) of tart cherries with a spatula.",
    "Fill each muffin tin with batter about ⅔ of the way full and bake for 20 minutes.Tip: You can leave the cherries whole for larger bites of cherries, or quarter them to spread them out.",
    "Make cherry cookies for a bite sized treat.",
    "Preheat your oven to 375 °F (191 °C) and grease a cookie sheet.",
    "Mix together 1 cup (227 g) of butter, ½ cup (100 g) of granulated sugar, 1 teaspoon (4.9 mL) of vanilla extract, 2.5 cups (362 g) of flour, and a pinch of salt in a large bowl.",
    "Quarter 2 cups (280 g) of cherries and fold them into your batter.",
    "Form your batter into 1 in (2.5 cm) balls and place them on your cookie sheets.",
    "Let them bake for 15 minutes.Do not let your cookies get too brown, or you could burn your cherries.",
    "Making Maraschino Cherries Wash and remove the pits from your cherries.",
    "Run all of your cherries under cool water and pat them dry with a clean towel.",
    "Slice each cherry down the middle and use the tip of your knife to pop the pit out.Tip: You can either leave the stems on or take them off depending on your preference.",
    "Leaving the stems on makes the cherries easier to pick up, and taking them off leaves only the edible parts of the cherries.",
    "Heat up 1 cup (240 mL) of maraschino liqueur in a saucepan.",
    "Pour your liqueur into a saucepan and put it on medium heat.",
    "Allow it to simmer, but don’t let it boil.",
    "Look for small bubbles as it gets ready to boil.You can find maraschino liqueur at most grocery stores in the baking aisle.",
    "Take the pan off of the heat and add the cherries.",
    "Move the saucepan so that it is not directly over the heat and carefully pour your cherries into it.",
    "Use caution so that the liqueur does not splash your hands.",
    "Make sure the cherries are fully submerged in the liqueur.If you have a lot of cherries, you may need to separate them into a few batches.",
    "Let everything in the pan cool for 10 minutes.",
    "The liqueur will still be very hot.",
    "Allow your pan to sit for at least 10 minutes until it cools down to room temperature.",
    "Make sure the pan isn’t over heat.",
    "Pour the liquid and the cherries into a glass jar with a lid.",
    "Make sure all of the cherries are submerged.",
    "Close the lid of the glass jar tightly.If the liqueur doesn’t quite cover all of your cherries, turn your jar upside down every 2 days to make sure the top cherries get dunked.",
    "Store your maraschino cherries in the fridge for up to 2 months.",
    "Keep the cherries in the glass jar and open it when you want to get some out.",
    "The liqueur will continue to soak into the cherries and make the flavor better over time.",
    "You can use your cherries for cocktails or eat them on their own.Homemade maraschino cherries are made with much less sugar and corn syrup than store-bought ones.",
    "Creating Tart Cherry Vinaigrette Put water, cherries, lemon juice, and sugar into a medium saucepan.",
    "Combine ⁄4 cup (59 mL) of water, 2 cups (280 g) of tart cherries, 1 tablespoon (15 mL) of lemon juice, and 2 tsp (8.33 g) of granulated sugar in a saucepan.",
    "Make sure the saucepan is wide enough to hold all of your ingredients.Tip: Add in a pinch of salt and black pepper for some extra flavor in your vinaigrette.",
    "Place the saucepan over medium heat for 10 minutes.",
    "Stir your mixture occasionally with a wooden spoon.",
    "Make sure your cherries are softened at the end of 10 minutes.",
    "Don’t let your mixture get to a boiling temperature.If your mixture starts simmering, turn your heat down.",
    "Strain your mixture to remove the solid chunks.",
    "Place a strainer over a large bowl.",
    "Carefully pour your mixture into the strainer to remove the cherries.",
    "Throw away the cherries and keep the liquid mixture.",
    "Put your liquid into a saucepan over medium heat for 20 minutes.",
    "The liquid must be reduced down further in order to be thick enough for a salad.",
    "Cook your liquid on medium heat for about 20 minutes or until it has reduced down to ⁄3  c (79 mL).",
    "Stir your mixture occasionally.Do not let your mixture boil.",
    "If you start seeing small bubbles, turn your heat down.",
    "Let your vinaigrette cool to room temperature.",
    "Take your saucepan off of the heat and let it cool down until it is room temperature, or about 30 minutes.",
    "Make sure your vinaigrette is not warm anymore before you serve it.Warm vinaigrette can heat up the greens in your salad and make them less appetizing.",
    "Drizzle the vinaigrette over salads, roasted vegetables, or fish.",
    "Cherry vinaigrette goes well with tart cheese and bacon bits in a salad.",
    "Or, drizzle it over some roasted broccoli and cauliflower for an added taste.",
    "Add it to salmon or cod to up the flavor of your dish.If you have extra vinaigrette, store it in an airtight container in the fridge for up to 1 week.",
    "Pickling Cherries Boil water, vinegar, sugar, salt, mustard seeds, and peppercorns in a saucepan.",
    "Combine 1 cup (240 mL) of water, ⁄4 cup (180 mL) of red wine vinegar, ½ cup (100 g) of granulated sugar, 2 tablespoon (29.6 ml) (36 g) of salt, 2 tsp (5 g) of mustard seeds, and 2 tsp (5 g) of peppercorns.",
    "Make sure your saucepan is large enough so that your mixture doesn’t spill out.",
    "Cook the mixture for 3 minutes.",
    "Use a wooden spoon to stir your mixture the entire time.",
    "Make sure all of the sugar is dissolved before you take your pan off of the heat.Keep the mixture at a boil the entire time it cooks.",
    "Place 2 cups (280 g) of cherries into a glass jar with a lid.",
    "Use an airtight container with a lid.",
    "Put your cherries into the container, making sure there is enough room so the lid won’t squish them.",
    "If your container is not big enough, split your cherries into 2 containers.Tip: If you don’t have an airtight container, choose something you can cover with plastic wrap.",
    "Pour your pickling liquid over the cherries.",
    "Carefully transfer your mixture to the airtight container.",
    "Make sure all of your cherries are fully submerged.",
    "If you have extra liquid, put it into a separate jar with more cherries.Add 1 sprig of rosemary for a floral, herbaceous flavor.",
    "Place your container in the fridge for 1 day.",
    "Allow the pickling liquid to soak into the cherries before you use them.",
    "Store your cherries in the fridge for up to 1 month.",
    "Use them on charcuterie boards, in cocktails, or eat them on their own.Pickled cherries have a sharp, vinegar taste that pairs well with cheese and bitter cocktails."
  ],
  "tyn_section":[
    "Large bowl",
    "Whisk",
    "Cookie sheet",
    "Pie tin",
    "Muffin tin",
    "Saucepan",
    "Glass jar with a lid",
    "Wooden spoon",
    "Strainer"
  ],
  "tyn_model":[
    "cherries",
    "saucepan",
    "granulated sugar",
    "sugar",
    "flour",
    "salt",
    "water",
    "liqueur",
    "glass jar",
    "oven",
    "airtight container",
    "medium saucepan",
    "pie crust",
    "baking powder",
    "milk",
    "muffin tin",
    "tart cherries",
    "large bowl",
    "maraschino liqueur",
    "pan",
    "lemon juice",
    "wooden spoon",
    "strainer",
    "mustard seeds",
    "tart cherry pie",
    "cornstarch",
    "small bowl",
    "cherry",
    "pie dough",
    "cherry cobbler",
    "bowl",
    "vegetable oil",
    "egg",
    "almond extract",
    "spatula",
    "⅔ of",
    "cherry cookies",
    "cookie sheet",
    "butter",
    "vanilla extract",
    "cookie sheets",
    "knife",
    "maraschino cherries",
    "corn syrup",
    "black pepper",
    "fish",
    "bacon",
    "cauliflower",
    "salmon",
    "cod",
    "pickling cherries",
    "vinegar",
    "red wine vinegar",
    "peppercorns",
    "plastic wrap",
    "pickling",
    "jar",
    "rosemary",
    "charcuterie boards",
    "pickled cherries"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1,
    "f1":0.1739130435,
    "avg_pos":0.2833333333
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.2166666667,
    "f1":0.3484087102
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1,
    "f1":0.1739130435
  }
}