{
  "title":"How to Pack Soft Fruits for School",
  "url":"https://www.wikihow.com/Pack-Soft-Fruits-for-School",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Packing Whole Fruits Safely",
      "steps":[
        {
          "headline":"Roll whole fruit in cloth napkins to prevent bruising.",
          "description":"Rinse off fruits with edible peels, like peaches and plums, and dry them thoroughly before wrapping and stowing them in your lunch box or bag. Roll up fruits with removable peels, like bananas and citrus fruits, without any preparation at all. The layers of fabric around the fruit create a cushioned pouch to prevent bruising and keep the fruit clean. If you don’t dry off rinsed fruit before rolling it up, the extra moisture can make the fruit mushy and unpleasant. Wrap multiple pieces of fruit separately for the most protection. For example, don’t roll a banana and a peach together in the same cloth napkin. If you aren't using a lunch box or bag, pack the rolled fruit in your backpack last so that it sits on top of everything else and won't get smashed."
        },
        {
          "headline":"Wash grapes and berries before packing them in plastic containers.",
          "description":"Rinse off grapes and berries and dry them thoroughly with a paper towel. Place the clean fruit in plastic containers to protect it in your bag or lunch box. Without a hard casing for protection, berries and grapes can get mushy and create a big, juicy mess inside your lunch box or backpack. You can chop the green stems off strawberries or leave them on. Grapes can be packed individually or in clusters. Bite-sized grapes and berries are great soft fruit options for kids' lunches because they're easy to eat."
        },
        {
          "headline":"Place small fruits into sectioned lunch boxes or bento boxes.",
          "description":"Rigid lunch boxes with separate compartments and bento boxes work great for smaller fruits because the rigid compartments keep the fruit separate and protected. This works best for small fruits like grapes, strawberries, and blueberries. Bigger soft fruits, like peaches and plums, won’t fit nicely into compartments unless you cut them up first."
        },
        {
          "headline":"Use an insulated lunch box to keep whole fruits cool.",
          "description":"Many fruits, like whole bananas, don’t need to be kept cool. However, grapes, berries, peaches, and plums are often tastier when they're cold! Use an insulated lunch box or put an ice pack into your lunch box to keep everything chilled. For example, nestle a peach or plum wrapped in a cloth napkin inside your insulated lunch box. Keep whole grapes or berries stored in plastic containers chilled by using an insulated lunch box or bag."
        }
      ]
    },
    {
      "name":"Slicing or Mashing Soft Fruits",
      "steps":[
        {
          "headline":"Peel and section citrus fruits before packing them in plastic containers.",
          "description":"Peeling oranges at school can be annoying, time-consuming, and messy! Skip the mess and save some time by peeling and sectioning the fruit before you pack it. Place the slices in a small plastic container with a lid to prevent spillage since oranges can be pretty juicy. You can leave the citrus fruit intact, but it’s easier to fit into your lunch if you section it into individual slices."
        },
        {
          "headline":"Chop fruit into bite-sized pieces and pack them in plastic containers.",
          "description":"Biting into a whole peach or plum can definitely be messy. It can help to slice bigger fruits into smaller, more manageable pieces for your lunch. To prevent sogginess and protect cut fruit, place it in a small plastic container before packing it in an insulated lunch box. Try cutting mangoes, pineapples, kiwi, and pears into bite-sized pieces."
        },
        {
          "headline":"Pack fruit purees in rigid plastic containers with lids.",
          "description":"Consider mashing up soft fruits, like bananas, with a fork. Then, store the puree in a small plastic container in your lunch box. You can also try other fruit purees, like store-bought or homemade applesauce. Try mixing low-fat cream cheese or bite-sized pieces of soft fruits into fruit puree to change up the flavor and texture. Don’t forget to pack a spoon so you can eat the puree!"
        },
        {
          "headline":"Pack store-bought single serving portions for an easy option.",
          "description":"You can buy pre-packed portions of applesauce, as well as small containers of sliced peaches, pineapples, and pears, at any grocery store. Simply toss the single serving container into your lunch and go! The containers are rigid and will protect the fruit inside. Be sure to pack a plastic spoon or fork so you can eat the fruit. For the healthiest option, choose sliced peaches, pineapples, and pears that are packed in water or their own juices with no sugar added. Avoid fruit packed in syrup."
        },
        {
          "headline":"Pack sliced and pureed fruit in an insulated lunch box to keep it fresh.",
          "description":"An insulated lunch box or bento box is the best choice for cut or mashed fruit since it keeps it cool and fresh. If you don’t have an insulated lunch box, you can try nestling an ice pack in your lunch box instead."
        }
      ]
    }
  ],
  "text":" Packing Whole Fruits Safely Roll whole fruit in cloth napkins to prevent bruising. Rinse off fruits with edible peels, like peaches and plums, and dry them thoroughly before wrapping and stowing them in your lunch box or bag. Roll up fruits with removable peels, like bananas and citrus fruits, without any preparation at all. The layers of fabric around the fruit create a cushioned pouch to prevent bruising and keep the fruit clean. If you don’t dry off rinsed fruit before rolling it up, the extra moisture can make the fruit mushy and unpleasant. Wrap multiple pieces of fruit separately for the most protection. For example, don’t roll a banana and a peach together in the same cloth napkin. If you aren't using a lunch box or bag, pack the rolled fruit in your backpack last so that it sits on top of everything else and won't get smashed. Wash grapes and berries before packing them in plastic containers. Rinse off grapes and berries and dry them thoroughly with a paper towel. Place the clean fruit in plastic containers to protect it in your bag or lunch box. Without a hard casing for protection, berries and grapes can get mushy and create a big, juicy mess inside your lunch box or backpack. You can chop the green stems off strawberries or leave them on. Grapes can be packed individually or in clusters. Bite-sized grapes and berries are great soft fruit options for kids' lunches because they're easy to eat. Place small fruits into sectioned lunch boxes or bento boxes. Rigid lunch boxes with separate compartments and bento boxes work great for smaller fruits because the rigid compartments keep the fruit separate and protected. This works best for small fruits like grapes, strawberries, and blueberries. Bigger soft fruits, like peaches and plums, won’t fit nicely into compartments unless you cut them up first. Use an insulated lunch box to keep whole fruits cool. Many fruits, like whole bananas, don’t need to be kept cool. However, grapes, berries, peaches, and plums are often tastier when they're cold! Use an insulated lunch box or put an ice pack into your lunch box to keep everything chilled. For example, nestle a peach or plum wrapped in a cloth napkin inside your insulated lunch box. Keep whole grapes or berries stored in plastic containers chilled by using an insulated lunch box or bag. Slicing or Mashing Soft Fruits Peel and section citrus fruits before packing them in plastic containers. Peeling oranges at school can be annoying, time-consuming, and messy! Skip the mess and save some time by peeling and sectioning the fruit before you pack it. Place the slices in a small plastic container with a lid to prevent spillage since oranges can be pretty juicy. You can leave the citrus fruit intact, but it’s easier to fit into your lunch if you section it into individual slices. Chop fruit into bite-sized pieces and pack them in plastic containers. Biting into a whole peach or plum can definitely be messy. It can help to slice bigger fruits into smaller, more manageable pieces for your lunch. To prevent sogginess and protect cut fruit, place it in a small plastic container before packing it in an insulated lunch box. Try cutting mangoes, pineapples, kiwi, and pears into bite-sized pieces. Pack fruit purees in rigid plastic containers with lids. Consider mashing up soft fruits, like bananas, with a fork. Then, store the puree in a small plastic container in your lunch box. You can also try other fruit purees, like store-bought or homemade applesauce. Try mixing low-fat cream cheese or bite-sized pieces of soft fruits into fruit puree to change up the flavor and texture. Don’t forget to pack a spoon so you can eat the puree! Pack store-bought single serving portions for an easy option. You can buy pre-packed portions of applesauce, as well as small containers of sliced peaches, pineapples, and pears, at any grocery store. Simply toss the single serving container into your lunch and go! The containers are rigid and will protect the fruit inside. Be sure to pack a plastic spoon or fork so you can eat the fruit. For the healthiest option, choose sliced peaches, pineapples, and pears that are packed in water or their own juices with no sugar added. Avoid fruit packed in syrup. Pack sliced and pureed fruit in an insulated lunch box to keep it fresh. An insulated lunch box or bento box is the best choice for cut or mashed fruit since it keeps it cool and fresh. If you don’t have an insulated lunch box, you can try nestling an ice pack in your lunch box instead.",
  "sentences":[
    " Packing Whole Fruits Safely Roll whole fruit in cloth napkins to prevent bruising.",
    "Rinse off fruits with edible peels, like peaches and plums, and dry them thoroughly before wrapping and stowing them in your lunch box or bag.",
    "Roll up fruits with removable peels, like bananas and citrus fruits, without any preparation at all.",
    "The layers of fabric around the fruit create a cushioned pouch to prevent bruising and keep the fruit clean.",
    "If you don’t dry off rinsed fruit before rolling it up, the extra moisture can make the fruit mushy and unpleasant.",
    "Wrap multiple pieces of fruit separately for the most protection.",
    "For example, don’t roll a banana and a peach together in the same cloth napkin.",
    "If you aren't using a lunch box or bag, pack the rolled fruit in your backpack last so that it sits on top of everything else and won't get smashed.",
    "Wash grapes and berries before packing them in plastic containers.",
    "Rinse off grapes and berries and dry them thoroughly with a paper towel.",
    "Place the clean fruit in plastic containers to protect it in your bag or lunch box.",
    "Without a hard casing for protection, berries and grapes can get mushy and create a big, juicy mess inside your lunch box or backpack.",
    "You can chop the green stems off strawberries or leave them on.",
    "Grapes can be packed individually or in clusters.",
    "Bite-sized grapes and berries are great soft fruit options for kids' lunches because they're easy to eat.",
    "Place small fruits into sectioned lunch boxes or bento boxes.",
    "Rigid lunch boxes with separate compartments and bento boxes work great for smaller fruits because the rigid compartments keep the fruit separate and protected.",
    "This works best for small fruits like grapes, strawberries, and blueberries.",
    "Bigger soft fruits, like peaches and plums, won’t fit nicely into compartments unless you cut them up first.",
    "Use an insulated lunch box to keep whole fruits cool.",
    "Many fruits, like whole bananas, don’t need to be kept cool.",
    "However, grapes, berries, peaches, and plums are often tastier when they're cold!",
    "Use an insulated lunch box or put an ice pack into your lunch box to keep everything chilled.",
    "For example, nestle a peach or plum wrapped in a cloth napkin inside your insulated lunch box.",
    "Keep whole grapes or berries stored in plastic containers chilled by using an insulated lunch box or bag.",
    "Slicing or Mashing Soft Fruits Peel and section citrus fruits before packing them in plastic containers.",
    "Peeling oranges at school can be annoying, time-consuming, and messy!",
    "Skip the mess and save some time by peeling and sectioning the fruit before you pack it.",
    "Place the slices in a small plastic container with a lid to prevent spillage since oranges can be pretty juicy.",
    "You can leave the citrus fruit intact, but it’s easier to fit into your lunch if you section it into individual slices.",
    "Chop fruit into bite-sized pieces and pack them in plastic containers.",
    "Biting into a whole peach or plum can definitely be messy.",
    "It can help to slice bigger fruits into smaller, more manageable pieces for your lunch.",
    "To prevent sogginess and protect cut fruit, place it in a small plastic container before packing it in an insulated lunch box.",
    "Try cutting mangoes, pineapples, kiwi, and pears into bite-sized pieces.",
    "Pack fruit purees in rigid plastic containers with lids.",
    "Consider mashing up soft fruits, like bananas, with a fork.",
    "Then, store the puree in a small plastic container in your lunch box.",
    "You can also try other fruit purees, like store-bought or homemade applesauce.",
    "Try mixing low-fat cream cheese or bite-sized pieces of soft fruits into fruit puree to change up the flavor and texture.",
    "Don’t forget to pack a spoon so you can eat the puree!",
    "Pack store-bought single serving portions for an easy option.",
    "You can buy pre-packed portions of applesauce, as well as small containers of sliced peaches, pineapples, and pears, at any grocery store.",
    "Simply toss the single serving container into your lunch and go!",
    "The containers are rigid and will protect the fruit inside.",
    "Be sure to pack a plastic spoon or fork so you can eat the fruit.",
    "For the healthiest option, choose sliced peaches, pineapples, and pears that are packed in water or their own juices with no sugar added.",
    "Avoid fruit packed in syrup.",
    "Pack sliced and pureed fruit in an insulated lunch box to keep it fresh.",
    "An insulated lunch box or bento box is the best choice for cut or mashed fruit since it keeps it cool and fresh.",
    "If you don’t have an insulated lunch box, you can try nestling an ice pack in your lunch box instead."
  ],
  "tyn_section":[
    "Cloth napkins",
    "Insulated lunch box or bento box",
    "Plastic containers with lids",
    "Knife",
    "Plastic spoons and forks"
  ],
  "tyn_model":[
    "grapes",
    "berries",
    "bananas",
    "peach",
    "lunch box",
    "insulated lunch box",
    "pineapples",
    "pears",
    "citrus fruits",
    "cloth napkin",
    "strawberries",
    "lunch boxes",
    "bento boxes",
    "ice pack",
    "oranges",
    "fork",
    "applesauce",
    "peaches",
    "cloth napkins",
    "fabric",
    "banana",
    "paper towel",
    "plum",
    "plastic containers",
    "citrus fruit",
    "fruit purees",
    "cream cheese",
    "fruit puree",
    "spoon",
    "plastic spoon",
    "water",
    "bento box"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.03125,
    "f1":0.0540540541,
    "avg_pos":0.5625
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.09375,
    "f1":0.1621621622
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.1875,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.03125,
    "f1":0.0540540541
  }
}