{
  "title":"How to Dry Clean a Carpet at Home",
  "url":"https://www.wikihow.com/Dry-Clean-a-Carpet-at-Home",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Carpets and Rugs",
    "Cleaning Carpets"
  ],
  "methods":[
    {
      "name":"Using a Dry Cleaning Compound",
      "steps":[
        {
          "headline":"Apply a stain pretreatment spray to stains on the carpet.",
          "description":"Stain pretreatment products often come in spray bottles, making them a breeze to apply. Just point the bottle at the carpet and press the trigger. Lightly mist any areas that may require a little extra work to clean. The spray will begin softening dirt and other grime while you prepare the dry cleaning powder. Use a spray on stains and areas that receive heavy traffic. If your carpet doesn’t have any tough stains, you can skip the pretreatment. Pretreatment sprays are available online and at general stores. They are sometimes sold with cleaning compound powders as well."
        },
        {
          "headline":"Sprinkle a dry cleaning compound powder over the carpet.",
          "description":"To apply the powder, scoop up some of it with a sifter. Hold the sifter above the carpet, then shake it to force some of the powder to fall. Keep sprinkling the powder to lightly dust the area you wish to clean. If you’re doing the whole room at once, spread the powder from one side of the room to the other. It will be safe to step on, but make sure heavily soiled spots stay covered. You can’t really use too much of the powder, so spread it around. As long as some of it gets on a spot, it will be effective, but remember that deep stains require more powder to clear. If you don’t have a kitchen sifter, you could use a cup or a measuring spoon instead. When you’re done, wash out your tools in case you use them for anything other than cleaning. Purchase carpet cleaning powders online or check your local general store for them. You could also buy a dry cleaning kit, which contains a pretreatment stray, sifter, and brush as well."
        },
        {
          "headline":"Use a soft-bristled scrub brush to work the powder into the carpet.",
          "description":"Move the brush back and forth along the carpet several times. Be gentle with it. Instead of trying to scrub the powder into the carpet, push the brush along the surface. Scrubbing the carpet could wear out its threads over time, and you don’t have to use that much pressure to work the powder in. If you are able to, use a nylon carpet brush that can be fitted with a threaded handle. That way, you don’t have to bend down while scrubbing. Kitchen scrubbers and other types of brushes are also safe. Some vacuum cleaners come with an upholstery brush you can repurpose for dry cleaning."
        },
        {
          "headline":"Let the powder sit on the carpet for 30 minutes.",
          "description":"The powder activates while you wait. By giving it some time to settle, you allow it to draw more grime out from the carpet threads. It isn’t as effective if you remove it too early. Wait for it to completely dry before sweeping it up. During this time, you can walk on the carpet. Most of the powder will stick to the carpet. For safety, avoid getting any powder on your skin. Keep children and pets out of the room so they don’t inadvertently swallow any of it. Cleaning powders are considered to be nontoxic, but be cautious just in case. You could leave the powder on the carpet for a longer period of time. It won’t harm anything and may even pick up extra grime. Just remember to vacuum it up afterward!"
        },
        {
          "headline":"Vacuum up the powder after it has dried.",
          "description":"Vacuum the carpet as you normally would when cleaning it. Remove as much of the powder as possible. Go back over the treated areas a few times, since you might not get all the powder in one go. Afterward, check your carpet to see if it looks bright and clean again. Sometimes multiple treatments help, especially if your carpet has some heavy stains. If your carpet still needs work, try using more powder or another cleaner."
        }
      ]
    },
    {
      "name":"Applying an Encapsulant",
      "steps":[
        {
          "headline":"Vacuum the entire carpet to remove dirt and other debris.",
          "description":"Get rid of as much loose debris on the carpet as you can. It will only get in the way of the encapsulant later. Be thorough, especially around spots that experience a lot of foot traffic or have noticeable stains. Any debris left over could soak further into the carpet. If you think you missed a spot, be sure to treat it before applying the encapsulant."
        },
        {
          "headline":"Dilute the encapsulant with hot water in a pump sprayer.",
          "description":"Encapsulants are liquid cleaners that have to be carefully diluted to avoid damaging carpeting. Check the manufacturer’s instructions first for the recommended mixing ratio. It is usually something like 4 fluid ounces (120 mL) of encapsulant for every 128 fluid ounces (3,800 mL) of hot water you’re using. Pour both into the pump sprayer’s tank. Encapsulants are available online, and you may also be able to find them at some general stores. You could also rent a handheld pump sprayer from your local hardware store. Even though you’re using a liquid, encapsulation is considered to be a dry cleaning method. Many professionals use it because it’s low-moisture and effective at treating tough stains."
        },
        {
          "headline":"Spray the encapsulant to lightly moisten the carpeting.",
          "description":"To activate the pump sprayer, pull the pump up and down until it becomes difficult to move. Hold the spray nozzle about 6 in (15 cm) from the carpet. Then, sweep the nozzle across the carpet at a slow but steady rate, working from one side of the room to the other. The encapsulant is safe to step on, but try to avoid it so you don’t spread it elsewhere. There is no exact amount of encapsulant to use, but try to apply it sparingly. Moisten the carpet, but don’t waterlog it. Coat dirty areas with generous amounts of fluid. If you’re spot-treating stains, you can pour some of the encapsulant on them and blot up the excess afterward."
        },
        {
          "headline":"Wait about 15 minutes for the cleaner to soak into the carpet.",
          "description":"It’s more effective if you leave it undisturbed for a little bit. Avoid stepping onto the carpet during this time. As it soaks in, it will loosen dried grime and stubborn stains you couldn’t vacuum up before. If you try removing the encapsulant too early, it may not work as intended. You could use fans or a dry cloth to speed up the drying process and remove excess moisture left on the carpet."
        },
        {
          "headline":"Rub the cleaner into the carpet with a soft-bristled broom.",
          "description":"If you’re able to, get a carpet grooming brush with a long handle. That way, you can stay standing as you push the broom forward. Go over the entire carpet from one end of the room to the other. Make sure you cover any spots sprayed with the encapsulant to agitate hidden dirt, bringing it up to the surface so it can be vacuumed up with ease. If you don’t have a broom, you could use a soft-bristled scrub brush instead. However, most brushes are smaller and better for treating specific spots rather than the entire carpet. Electrical brushes work very well with encapsulates. See if you can rent a brush machine or bonnet machine from your local hardware store."
        },
        {
          "headline":"Vacuum the carpet to remove the remaining debris.",
          "description":"Use a strong commercial vacuum to pick up as much debris as possible. Cover the entire carpet, or at least any areas treated with the encapsulant. Check the carpet afterward. Since the encapsulant lifts grime, your carpet should look noticeably lighter and cleaner right away. If the carpet doesn’t look any different, you might need to apply more encapsulant or use a stronger vacuum."
        }
      ]
    },
    {
      "name":"Spot-Cleaning with Vinegar and Baking Soda",
      "steps":[
        {
          "headline":"Sprinkle baking soda onto the carpet to cover stains.",
          "description":"It’s harmless, so apply it generously. Tackle stains one at a time so you don’t miss any when using and mixing the baking soda into a cleaning paste later. Make sure each stain is so well-coated that you can no longer see it. You could wait to add the baking soda after applying vinegar, but using baking soda first is easier. Baking soda is also good for neutralizing odors, especially if you use vinegar for spot-treating stains."
        },
        {
          "headline":"Add 1 teaspoon (4.9 mL) of white vinegar to the baking soda.",
          "description":"Add the vinegar gradually to avoid soaking the carpeting. It will begin fizzling into a solid paste almost immediately. Give it a few seconds to soak in before adding more vinegar. Keep adding more as needed until all of the baking soda is gone. If you don’t mind getting the carpeting slightly wet, you could spray vinegar onto it without using baking soda. It can be good for pulling out stubborn stains."
        },
        {
          "headline":"Work the paste into the carpeting with your fingers.",
          "description":"You could also use a soft-bristled brush, such as a carpet scrub brush. Scrub gently to avoid wearing out the carpet threads. Make sure the paste spreads between the threads so it is able to reach the part of the stain below the surface. Make sure the stain is well-covered with the cleaner, or else it may not be effective."
        },
        {
          "headline":"Let the paste air dry overnight on the carpeting.",
          "description":"The paste will dry out at a relatively rapid rate. Leave it exposed to open air, but make sure no one disturbs it until it has finished drying. When it becomes solid, like sand or dust, it is ready to be cleaned up. The mixture dries out at a relatively quick rate, so you could vacuum it up even earlier. However, make sure it has finished drying out."
        },
        {
          "headline":"Vacuum up the dried paste to finish cleaning the carpet.",
          "description":"Use a strong, carpet-safe vacuum to pull up all of the remaining paste. It is also safe to scoop up by hand, such as with a paper towel, but you won’t be able to get all of it. Finish cleaning up by vacuuming treated stains several times to pull up any remaining debris you may have missed. Sometimes stains require multiple treatments. If that still isn’t enough, try using a commercial dry cleaning product or encapsulant."
        }
      ]
    }
  ],
  "text":" Using a Dry Cleaning Compound Apply a stain pretreatment spray to stains on the carpet. Stain pretreatment products often come in spray bottles, making them a breeze to apply. Just point the bottle at the carpet and press the trigger. Lightly mist any areas that may require a little extra work to clean. The spray will begin softening dirt and other grime while you prepare the dry cleaning powder. Use a spray on stains and areas that receive heavy traffic. If your carpet doesn’t have any tough stains, you can skip the pretreatment. Pretreatment sprays are available online and at general stores. They are sometimes sold with cleaning compound powders as well. Sprinkle a dry cleaning compound powder over the carpet. To apply the powder, scoop up some of it with a sifter. Hold the sifter above the carpet, then shake it to force some of the powder to fall. Keep sprinkling the powder to lightly dust the area you wish to clean. If you’re doing the whole room at once, spread the powder from one side of the room to the other. It will be safe to step on, but make sure heavily soiled spots stay covered. You can’t really use too much of the powder, so spread it around. As long as some of it gets on a spot, it will be effective, but remember that deep stains require more powder to clear. If you don’t have a kitchen sifter, you could use a cup or a measuring spoon instead. When you’re done, wash out your tools in case you use them for anything other than cleaning. Purchase carpet cleaning powders online or check your local general store for them. You could also buy a dry cleaning kit, which contains a pretreatment stray, sifter, and brush as well. Use a soft-bristled scrub brush to work the powder into the carpet. Move the brush back and forth along the carpet several times. Be gentle with it. Instead of trying to scrub the powder into the carpet, push the brush along the surface. Scrubbing the carpet could wear out its threads over time, and you don’t have to use that much pressure to work the powder in. If you are able to, use a nylon carpet brush that can be fitted with a threaded handle. That way, you don’t have to bend down while scrubbing. Kitchen scrubbers and other types of brushes are also safe. Some vacuum cleaners come with an upholstery brush you can repurpose for dry cleaning. Let the powder sit on the carpet for 30 minutes. The powder activates while you wait. By giving it some time to settle, you allow it to draw more grime out from the carpet threads. It isn’t as effective if you remove it too early. Wait for it to completely dry before sweeping it up. During this time, you can walk on the carpet. Most of the powder will stick to the carpet. For safety, avoid getting any powder on your skin. Keep children and pets out of the room so they don’t inadvertently swallow any of it. Cleaning powders are considered to be nontoxic, but be cautious just in case. You could leave the powder on the carpet for a longer period of time. It won’t harm anything and may even pick up extra grime. Just remember to vacuum it up afterward! Vacuum up the powder after it has dried. Vacuum the carpet as you normally would when cleaning it. Remove as much of the powder as possible. Go back over the treated areas a few times, since you might not get all the powder in one go. Afterward, check your carpet to see if it looks bright and clean again. Sometimes multiple treatments help, especially if your carpet has some heavy stains. If your carpet still needs work, try using more powder or another cleaner. Applying an Encapsulant Vacuum the entire carpet to remove dirt and other debris. Get rid of as much loose debris on the carpet as you can. It will only get in the way of the encapsulant later. Be thorough, especially around spots that experience a lot of foot traffic or have noticeable stains. Any debris left over could soak further into the carpet. If you think you missed a spot, be sure to treat it before applying the encapsulant. Dilute the encapsulant with hot water in a pump sprayer. Encapsulants are liquid cleaners that have to be carefully diluted to avoid damaging carpeting. Check the manufacturer’s instructions first for the recommended mixing ratio. It is usually something like 4 fluid ounces (120 mL) of encapsulant for every 128 fluid ounces (3,800 mL) of hot water you’re using. Pour both into the pump sprayer’s tank. Encapsulants are available online, and you may also be able to find them at some general stores. You could also rent a handheld pump sprayer from your local hardware store. Even though you’re using a liquid, encapsulation is considered to be a dry cleaning method. Many professionals use it because it’s low-moisture and effective at treating tough stains. Spray the encapsulant to lightly moisten the carpeting. To activate the pump sprayer, pull the pump up and down until it becomes difficult to move. Hold the spray nozzle about 6 in (15 cm) from the carpet. Then, sweep the nozzle across the carpet at a slow but steady rate, working from one side of the room to the other. The encapsulant is safe to step on, but try to avoid it so you don’t spread it elsewhere. There is no exact amount of encapsulant to use, but try to apply it sparingly. Moisten the carpet, but don’t waterlog it. Coat dirty areas with generous amounts of fluid. If you’re spot-treating stains, you can pour some of the encapsulant on them and blot up the excess afterward. Wait about 15 minutes for the cleaner to soak into the carpet. It’s more effective if you leave it undisturbed for a little bit. Avoid stepping onto the carpet during this time. As it soaks in, it will loosen dried grime and stubborn stains you couldn’t vacuum up before. If you try removing the encapsulant too early, it may not work as intended. You could use fans or a dry cloth to speed up the drying process and remove excess moisture left on the carpet. Rub the cleaner into the carpet with a soft-bristled broom. If you’re able to, get a carpet grooming brush with a long handle. That way, you can stay standing as you push the broom forward. Go over the entire carpet from one end of the room to the other. Make sure you cover any spots sprayed with the encapsulant to agitate hidden dirt, bringing it up to the surface so it can be vacuumed up with ease. If you don’t have a broom, you could use a soft-bristled scrub brush instead. However, most brushes are smaller and better for treating specific spots rather than the entire carpet. Electrical brushes work very well with encapsulates. See if you can rent a brush machine or bonnet machine from your local hardware store. Vacuum the carpet to remove the remaining debris. Use a strong commercial vacuum to pick up as much debris as possible. Cover the entire carpet, or at least any areas treated with the encapsulant. Check the carpet afterward. Since the encapsulant lifts grime, your carpet should look noticeably lighter and cleaner right away. If the carpet doesn’t look any different, you might need to apply more encapsulant or use a stronger vacuum. Spot-Cleaning with Vinegar and Baking Soda Sprinkle baking soda onto the carpet to cover stains. It’s harmless, so apply it generously. Tackle stains one at a time so you don’t miss any when using and mixing the baking soda into a cleaning paste later. Make sure each stain is so well-coated that you can no longer see it. You could wait to add the baking soda after applying vinegar, but using baking soda first is easier. Baking soda is also good for neutralizing odors, especially if you use vinegar for spot-treating stains. Add 1 teaspoon (4.9 mL) of white vinegar to the baking soda. Add the vinegar gradually to avoid soaking the carpeting. It will begin fizzling into a solid paste almost immediately. Give it a few seconds to soak in before adding more vinegar. Keep adding more as needed until all of the baking soda is gone. If you don’t mind getting the carpeting slightly wet, you could spray vinegar onto it without using baking soda. It can be good for pulling out stubborn stains. Work the paste into the carpeting with your fingers. You could also use a soft-bristled brush, such as a carpet scrub brush. Scrub gently to avoid wearing out the carpet threads. Make sure the paste spreads between the threads so it is able to reach the part of the stain below the surface. Make sure the stain is well-covered with the cleaner, or else it may not be effective. Let the paste air dry overnight on the carpeting. The paste will dry out at a relatively rapid rate. Leave it exposed to open air, but make sure no one disturbs it until it has finished drying. When it becomes solid, like sand or dust, it is ready to be cleaned up. The mixture dries out at a relatively quick rate, so you could vacuum it up even earlier. However, make sure it has finished drying out. Vacuum up the dried paste to finish cleaning the carpet. Use a strong, carpet-safe vacuum to pull up all of the remaining paste. It is also safe to scoop up by hand, such as with a paper towel, but you won’t be able to get all of it. Finish cleaning up by vacuuming treated stains several times to pull up any remaining debris you may have missed. Sometimes stains require multiple treatments. If that still isn’t enough, try using a commercial dry cleaning product or encapsulant.",
  "sentences":[
    " Using a Dry Cleaning Compound Apply a stain pretreatment spray to stains on the carpet.",
    "Stain pretreatment products often come in spray bottles, making them a breeze to apply.",
    "Just point the bottle at the carpet and press the trigger.",
    "Lightly mist any areas that may require a little extra work to clean.",
    "The spray will begin softening dirt and other grime while you prepare the dry cleaning powder.",
    "Use a spray on stains and areas that receive heavy traffic.",
    "If your carpet doesn’t have any tough stains, you can skip the pretreatment.",
    "Pretreatment sprays are available online and at general stores.",
    "They are sometimes sold with cleaning compound powders as well.",
    "Sprinkle a dry cleaning compound powder over the carpet.",
    "To apply the powder, scoop up some of it with a sifter.",
    "Hold the sifter above the carpet, then shake it to force some of the powder to fall.",
    "Keep sprinkling the powder to lightly dust the area you wish to clean.",
    "If you’re doing the whole room at once, spread the powder from one side of the room to the other.",
    "It will be safe to step on, but make sure heavily soiled spots stay covered.",
    "You can’t really use too much of the powder, so spread it around.",
    "As long as some of it gets on a spot, it will be effective, but remember that deep stains require more powder to clear.",
    "If you don’t have a kitchen sifter, you could use a cup or a measuring spoon instead.",
    "When you’re done, wash out your tools in case you use them for anything other than cleaning.",
    "Purchase carpet cleaning powders online or check your local general store for them.",
    "You could also buy a dry cleaning kit, which contains a pretreatment stray, sifter, and brush as well.",
    "Use a soft-bristled scrub brush to work the powder into the carpet.",
    "Move the brush back and forth along the carpet several times.",
    "Be gentle with it.",
    "Instead of trying to scrub the powder into the carpet, push the brush along the surface.",
    "Scrubbing the carpet could wear out its threads over time, and you don’t have to use that much pressure to work the powder in.",
    "If you are able to, use a nylon carpet brush that can be fitted with a threaded handle.",
    "That way, you don’t have to bend down while scrubbing.",
    "Kitchen scrubbers and other types of brushes are also safe.",
    "Some vacuum cleaners come with an upholstery brush you can repurpose for dry cleaning.",
    "Let the powder sit on the carpet for 30 minutes.",
    "The powder activates while you wait.",
    "By giving it some time to settle, you allow it to draw more grime out from the carpet threads.",
    "It isn’t as effective if you remove it too early.",
    "Wait for it to completely dry before sweeping it up.",
    "During this time, you can walk on the carpet.",
    "Most of the powder will stick to the carpet.",
    "For safety, avoid getting any powder on your skin.",
    "Keep children and pets out of the room so they don’t inadvertently swallow any of it.",
    "Cleaning powders are considered to be nontoxic, but be cautious just in case.",
    "You could leave the powder on the carpet for a longer period of time.",
    "It won’t harm anything and may even pick up extra grime.",
    "Just remember to vacuum it up afterward!",
    "Vacuum up the powder after it has dried.",
    "Vacuum the carpet as you normally would when cleaning it.",
    "Remove as much of the powder as possible.",
    "Go back over the treated areas a few times, since you might not get all the powder in one go.",
    "Afterward, check your carpet to see if it looks bright and clean again.",
    "Sometimes multiple treatments help, especially if your carpet has some heavy stains.",
    "If your carpet still needs work, try using more powder or another cleaner.",
    "Applying an Encapsulant Vacuum the entire carpet to remove dirt and other debris.",
    "Get rid of as much loose debris on the carpet as you can.",
    "It will only get in the way of the encapsulant later.",
    "Be thorough, especially around spots that experience a lot of foot traffic or have noticeable stains.",
    "Any debris left over could soak further into the carpet.",
    "If you think you missed a spot, be sure to treat it before applying the encapsulant.",
    "Dilute the encapsulant with hot water in a pump sprayer.",
    "Encapsulants are liquid cleaners that have to be carefully diluted to avoid damaging carpeting.",
    "Check the manufacturer’s instructions first for the recommended mixing ratio.",
    "It is usually something like 4 fluid ounces (120 mL) of encapsulant for every 128 fluid ounces (3,800 mL) of hot water you’re using.",
    "Pour both into the pump sprayer’s tank.",
    "Encapsulants are available online, and you may also be able to find them at some general stores.",
    "You could also rent a handheld pump sprayer from your local hardware store.",
    "Even though you’re using a liquid, encapsulation is considered to be a dry cleaning method.",
    "Many professionals use it because it’s low-moisture and effective at treating tough stains.",
    "Spray the encapsulant to lightly moisten the carpeting.",
    "To activate the pump sprayer, pull the pump up and down until it becomes difficult to move.",
    "Hold the spray nozzle about 6 in (15 cm) from the carpet.",
    "Then, sweep the nozzle across the carpet at a slow but steady rate, working from one side of the room to the other.",
    "The encapsulant is safe to step on, but try to avoid it so you don’t spread it elsewhere.",
    "There is no exact amount of encapsulant to use, but try to apply it sparingly.",
    "Moisten the carpet, but don’t waterlog it.",
    "Coat dirty areas with generous amounts of fluid.",
    "If you’re spot-treating stains, you can pour some of the encapsulant on them and blot up the excess afterward.",
    "Wait about 15 minutes for the cleaner to soak into the carpet.",
    "It’s more effective if you leave it undisturbed for a little bit.",
    "Avoid stepping onto the carpet during this time.",
    "As it soaks in, it will loosen dried grime and stubborn stains you couldn’t vacuum up before.",
    "If you try removing the encapsulant too early, it may not work as intended.",
    "You could use fans or a dry cloth to speed up the drying process and remove excess moisture left on the carpet.",
    "Rub the cleaner into the carpet with a soft-bristled broom.",
    "If you’re able to, get a carpet grooming brush with a long handle.",
    "That way, you can stay standing as you push the broom forward.",
    "Go over the entire carpet from one end of the room to the other.",
    "Make sure you cover any spots sprayed with the encapsulant to agitate hidden dirt, bringing it up to the surface so it can be vacuumed up with ease.",
    "If you don’t have a broom, you could use a soft-bristled scrub brush instead.",
    "However, most brushes are smaller and better for treating specific spots rather than the entire carpet.",
    "Electrical brushes work very well with encapsulates.",
    "See if you can rent a brush machine or bonnet machine from your local hardware store.",
    "Vacuum the carpet to remove the remaining debris.",
    "Use a strong commercial vacuum to pick up as much debris as possible.",
    "Cover the entire carpet, or at least any areas treated with the encapsulant.",
    "Check the carpet afterward.",
    "Since the encapsulant lifts grime, your carpet should look noticeably lighter and cleaner right away.",
    "If the carpet doesn’t look any different, you might need to apply more encapsulant or use a stronger vacuum.",
    "Spot-Cleaning with Vinegar and Baking Soda Sprinkle baking soda onto the carpet to cover stains.",
    "It’s harmless, so apply it generously.",
    "Tackle stains one at a time so you don’t miss any when using and mixing the baking soda into a cleaning paste later.",
    "Make sure each stain is so well-coated that you can no longer see it.",
    "You could wait to add the baking soda after applying vinegar, but using baking soda first is easier.",
    "Baking soda is also good for neutralizing odors, especially if you use vinegar for spot-treating stains.",
    "Add 1 teaspoon (4.9 mL) of white vinegar to the baking soda.",
    "Add the vinegar gradually to avoid soaking the carpeting.",
    "It will begin fizzling into a solid paste almost immediately.",
    "Give it a few seconds to soak in before adding more vinegar.",
    "Keep adding more as needed until all of the baking soda is gone.",
    "If you don’t mind getting the carpeting slightly wet, you could spray vinegar onto it without using baking soda.",
    "It can be good for pulling out stubborn stains.",
    "Work the paste into the carpeting with your fingers.",
    "You could also use a soft-bristled brush, such as a carpet scrub brush.",
    "Scrub gently to avoid wearing out the carpet threads.",
    "Make sure the paste spreads between the threads so it is able to reach the part of the stain below the surface.",
    "Make sure the stain is well-covered with the cleaner, or else it may not be effective.",
    "Let the paste air dry overnight on the carpeting.",
    "The paste will dry out at a relatively rapid rate.",
    "Leave it exposed to open air, but make sure no one disturbs it until it has finished drying.",
    "When it becomes solid, like sand or dust, it is ready to be cleaned up.",
    "The mixture dries out at a relatively quick rate, so you could vacuum it up even earlier.",
    "However, make sure it has finished drying out.",
    "Vacuum up the dried paste to finish cleaning the carpet.",
    "Use a strong, carpet-safe vacuum to pull up all of the remaining paste.",
    "It is also safe to scoop up by hand, such as with a paper towel, but you won’t be able to get all of it.",
    "Finish cleaning up by vacuuming treated stains several times to pull up any remaining debris you may have missed.",
    "Sometimes stains require multiple treatments.",
    "If that still isn’t enough, try using a commercial dry cleaning product or encapsulant."
  ],
  "tyn_section":[
    "Stain pretreatment spray",
    "Carpet dry cleaning compound",
    "Soft-bristled scrub brush",
    "Vacuum",
    "Encapsulant",
    "Soft-bristled brush",
    "Pump sprayer",
    "White vinegar",
    "Baking soda",
    "Vacuum cleaner",
    "Soft-bristled brush (optional)",
    "Spray bottle (optional)"
  ],
  "tyn_model":[
    "baking soda",
    "vinegar",
    "cleaner",
    "pump sprayer",
    "vacuum",
    "sifter",
    "broom",
    "dry cleaning",
    "powder",
    "scrub brush",
    "hot water",
    "dry cleaning compound",
    "stain pretreatment spray",
    "cleaning compound powders",
    "cleaning compound powder",
    "kitchen sifter",
    "measuring spoon",
    "carpet cleaning powders",
    "dry cleaning kit",
    "brush",
    "carpet brush",
    "kitchen scrubbers",
    "vacuum cleaners",
    "upholstery brush",
    "cleaning powders",
    "encapsulant vacuum",
    "liquid cleaners",
    "fluid",
    "carpet grooming brush",
    "electrical brushes",
    "brush machine",
    "encapsulant",
    "white vinegar",
    "carpet scrub brush",
    "vacuuming"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1714285714,
    "f1":0.2553191489,
    "avg_pos":0.3428571429
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.4285714286,
    "f1":0.5660377358
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9166666667,
    "p":0.6285714286,
    "f1":0.7457627119
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.2285714286,
    "f1":0.3404255319
  }
}