{
  "title":"How to Make a Tether Ball Court",
  "url":"https://www.wikihow.com/Make-a-Tether-Ball-Court",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Backyard Ball Games",
    "Tetherball"
  ],
  "parts":[
    {
      "name":"Building a Tetherball Pole",
      "steps":[
        {
          "headline":"Create a base for the tetherball pole.",
          "description":"Weld two 10-inch (25 cm) pieces of steel rebar together in a cross formation. This will serve as the base for the tetherball pole and will be cemented into a tire. Be sure to measure the rebar carefully; the crossbar won’t fit inside the tire otherwise."
        },
        {
          "headline":"Secure the pole to the base.",
          "description":"Weld a 10-foot (3 meter) long piece of 2-inch (5 cm) pipe vertically to the center of the welded cross bars. Alternatively, you can drill holes in the pipe and use 16.5 gauge rebar tie wire to secure the steel rebar to the pole."
        },
        {
          "headline":"Install a hook for the cord.",
          "description":"Weld an eye bolt about 2 in (5 cm) from the top of the vertical pole. This bolt will hold the cord that is attached to the ball. Alternatively, drill a hole at the top of the pole using a ⅜ in (9.5 mm) drill bit. Attach a washer and ¼ in (6.4 mm) by 2 in (5 cm) eye bolt. Secure the bolt on the inside of the pole with one washer and a ⅜ in (9.5 mm) nut."
        },
        {
          "headline":"Put the base inside a tire.",
          "description":"Place the bottom crossbar stand of the tether ball pole inside a used tire. Place a heavy-duty garbage bag under the tire to prevent the concrete from seeping out."
        },
        {
          "headline":"Secure the pole with concrete.",
          "description":"Mix concrete well, per its label instructions, and fill the tire with wet concrete, cementing the tether ball pole firmly in place. Use a level to make sure your pole is completely vertical. Use wire to attach your pole to a ladder or other tall structure to ensure it stays in place while the concrete is drying."
        },
        {
          "headline":"Allow the concrete to dry fully.",
          "description":"You will typically need to dry the cement overnight, but check the manufacturer's label for specific instructions. Remove the garbage bag from the bottom of the tire once the concrete is dry."
        },
        {
          "headline":"Attach a tether ball to a 6-foot (1.82-meter) length of cord or rope.",
          "description":"Then, attach the other end of the cord or rope to the eye bolt. Make sure your knots are secure so neither the cord nor the ball comes loose. Some tetherballs come with a cord attached; if this is the case, use that instead of the rope."
        }
      ]
    },
    {
      "name":"Creating a Tetherball Court",
      "steps":[
        {
          "headline":"Choose a tetherball location.",
          "description":"Select an appropriate play area, free of obstruction and on level ground. You can choose a grassy location, or somewhere that is paved, such as a driveway."
        },
        {
          "headline":"Draw a circle on the ground to make your court.",
          "description":"The circle should be approximately 10 feet (3 meters) in diameter. Use spray paint to draw the circle on grass or dirt. Use chalk to draw the circle on cement."
        },
        {
          "headline":"Relocate the completed tether ball pole to the center of the circle.",
          "description":"Carefully maneuver the tire so that it lays on its side. Then roll the tire to the area you wish to play and stand it up so the pole is vertical."
        },
        {
          "headline":"Draw a line through the center of the circle, separating it into two halves.",
          "description":"The line should intersect the tetherball pole's midpoint. This line determines the area of play for each player."
        },
        {
          "headline":"Play tetherball.",
          "description":"Now you are ready to play the game. Choose two players and alternate hitting the ball to each other. One person hits the ball clockwise, while the other person hits it counterclockwise. The object of the game is to wrap the rope or cord entirely around the pole."
        }
      ]
    }
  ],
  "text":" Building a Tetherball Pole Create a base for the tetherball pole. Weld two 10-inch (25 cm) pieces of steel rebar together in a cross formation. This will serve as the base for the tetherball pole and will be cemented into a tire. Be sure to measure the rebar carefully; the crossbar won’t fit inside the tire otherwise. Secure the pole to the base. Weld a 10-foot (3 meter) long piece of 2-inch (5 cm) pipe vertically to the center of the welded cross bars. Alternatively, you can drill holes in the pipe and use 16.5 gauge rebar tie wire to secure the steel rebar to the pole. Install a hook for the cord. Weld an eye bolt about 2 in (5 cm) from the top of the vertical pole. This bolt will hold the cord that is attached to the ball. Alternatively, drill a hole at the top of the pole using a ⅜ in (9.5 mm) drill bit. Attach a washer and ¼ in (6.4 mm) by 2 in (5 cm) eye bolt. Secure the bolt on the inside of the pole with one washer and a ⅜ in (9.5 mm) nut. Put the base inside a tire. Place the bottom crossbar stand of the tether ball pole inside a used tire. Place a heavy-duty garbage bag under the tire to prevent the concrete from seeping out. Secure the pole with concrete. Mix concrete well, per its label instructions, and fill the tire with wet concrete, cementing the tether ball pole firmly in place. Use a level to make sure your pole is completely vertical. Use wire to attach your pole to a ladder or other tall structure to ensure it stays in place while the concrete is drying. Allow the concrete to dry fully. You will typically need to dry the cement overnight, but check the manufacturer's label for specific instructions. Remove the garbage bag from the bottom of the tire once the concrete is dry. Attach a tether ball to a 6-foot (1.82-meter) length of cord or rope. Then, attach the other end of the cord or rope to the eye bolt. Make sure your knots are secure so neither the cord nor the ball comes loose. Some tetherballs come with a cord attached; if this is the case, use that instead of the rope. Creating a Tetherball Court Choose a tetherball location. Select an appropriate play area, free of obstruction and on level ground. You can choose a grassy location, or somewhere that is paved, such as a driveway. Draw a circle on the ground to make your court. The circle should be approximately 10 feet (3 meters) in diameter. Use spray paint to draw the circle on grass or dirt. Use chalk to draw the circle on cement. Relocate the completed tether ball pole to the center of the circle. Carefully maneuver the tire so that it lays on its side. Then roll the tire to the area you wish to play and stand it up so the pole is vertical. Draw a line through the center of the circle, separating it into two halves. The line should intersect the tetherball pole's midpoint. This line determines the area of play for each player. Play tetherball. Now you are ready to play the game. Choose two players and alternate hitting the ball to each other. One person hits the ball clockwise, while the other person hits it counterclockwise. The object of the game is to wrap the rope or cord entirely around the pole.",
  "sentences":[
    " Building a Tetherball Pole Create a base for the tetherball pole.",
    "Weld two 10-inch (25 cm) pieces of steel rebar together in a cross formation.",
    "This will serve as the base for the tetherball pole and will be cemented into a tire.",
    "Be sure to measure the rebar carefully; the crossbar won’t fit inside the tire otherwise.",
    "Secure the pole to the base.",
    "Weld a 10-foot (3 meter) long piece of 2-inch (5 cm) pipe vertically to the center of the welded cross bars.",
    "Alternatively, you can drill holes in the pipe and use 16.5 gauge rebar tie wire to secure the steel rebar to the pole.",
    "Install a hook for the cord.",
    "Weld an eye bolt about 2 in (5 cm) from the top of the vertical pole.",
    "This bolt will hold the cord that is attached to the ball.",
    "Alternatively, drill a hole at the top of the pole using a ⅜ in (9.5 mm) drill bit.",
    "Attach a washer and ¼ in (6.4 mm) by 2 in (5 cm) eye bolt.",
    "Secure the bolt on the inside of the pole with one washer and a ⅜ in (9.5 mm) nut.",
    "Put the base inside a tire.",
    "Place the bottom crossbar stand of the tether ball pole inside a used tire.",
    "Place a heavy-duty garbage bag under the tire to prevent the concrete from seeping out.",
    "Secure the pole with concrete.",
    "Mix concrete well, per its label instructions, and fill the tire with wet concrete, cementing the tether ball pole firmly in place.",
    "Use a level to make sure your pole is completely vertical.",
    "Use wire to attach your pole to a ladder or other tall structure to ensure it stays in place while the concrete is drying.",
    "Allow the concrete to dry fully.",
    "You will typically need to dry the cement overnight, but check the manufacturer's label for specific instructions.",
    "Remove the garbage bag from the bottom of the tire once the concrete is dry.",
    "Attach a tether ball to a 6-foot (1.82-meter) length of cord or rope.",
    "Then, attach the other end of the cord or rope to the eye bolt.",
    "Make sure your knots are secure so neither the cord nor the ball comes loose.",
    "Some tetherballs come with a cord attached; if this is the case, use that instead of the rope.",
    "Creating a Tetherball Court Choose a tetherball location.",
    "Select an appropriate play area, free of obstruction and on level ground.",
    "You can choose a grassy location, or somewhere that is paved, such as a driveway.",
    "Draw a circle on the ground to make your court.",
    "The circle should be approximately 10 feet (3 meters) in diameter.",
    "Use spray paint to draw the circle on grass or dirt.",
    "Use chalk to draw the circle on cement.",
    "Relocate the completed tether ball pole to the center of the circle.",
    "Carefully maneuver the tire so that it lays on its side.",
    "Then roll the tire to the area you wish to play and stand it up so the pole is vertical.",
    "Draw a line through the center of the circle, separating it into two halves.",
    "The line should intersect the tetherball pole's midpoint.",
    "This line determines the area of play for each player.",
    "Play tetherball.",
    "Now you are ready to play the game.",
    "Choose two players and alternate hitting the ball to each other.",
    "One person hits the ball clockwise, while the other person hits it counterclockwise.",
    "The object of the game is to wrap the rope or cord entirely around the pole."
  ],
  "tyn_section":[
    "Welding equipment",
    "16.5 gauge rebar tie wire",
    "2 10-inch pieces of steel rebar",
    "1 10-ft long (3-m long), 2-in (5 cm) wide pipe",
    "¼ in (6.4 mm) by 2 in (5 cm) eye bolt",
    "2 washers",
    "⅜ in (9.5 mm) nut",
    "Rope or cord",
    "Tetherball",
    "Garbage bag",
    "Cement mix",
    "Used car tire",
    "Chalk",
    "Spray paint"
  ],
  "tyn_model":[
    "concrete",
    "tetherball pole",
    "tether ball pole",
    "steel rebar",
    "⅜ in",
    "washer",
    "cement",
    "rope",
    "rebar",
    "rebar tie wire",
    "drill bit",
    "heavy-duty garbage bag",
    "level",
    "wire",
    "garbage bag",
    "tether ball",
    "tetherball court",
    "spray paint",
    "chalk",
    "tetherball.",
    "cord"
  ],
  "simple_metrics":{
    "r":0.2142857143,
    "p":0.1428571429,
    "f1":0.1714285714,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.380952381,
    "f1":0.4033613445
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6428571429,
    "p":0.5714285714,
    "f1":0.6050420168
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2142857143,
    "p":0.1904761905,
    "f1":0.2016806723
  }
}