{
  "title":"How to Create Humidity for Indoor Plants",
  "url":"https://www.wikihow.com/Create-Humidity-for-Indoor-Plants",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "methods":[
    {
      "name":"Misting Your Plants",
      "steps":[
        {
          "headline":"Fill a plant mister or spray bottle with lukewarm water.",
          "description":"Pour some water into a clean spray bottle or plant mister. The water should be tepid, or just slightly warm. If the water is cold, let the mister sit in a warm area (such as near a heater vent or in a sunny window) so it has a chance to warm up a little before you use it. In general, it’s okay to use tap water for your plants. However, if you have a water softener, it’s best to use filtered water or collect rainwater so that the salts don’t damage your plants."
        },
        {
          "headline":"Move the plants to a sink before misting them to prevent a mess.",
          "description":"If you don’t want to get water all over your furniture, walls, or windowsills, it’s a good idea to relocate your plants to a more water-safe area before misting them. Put them in your sink, shower, or bathtub, then return them to their usual place once you’re done. If you don’t want to bother with moving your plants every time you mist them, try draping a towel or drop cloth over anything in the area that you want to protect from the mist. Some climbing plants may attach themselves to plaster walls in your home if you get water on the walls during the misting process!"
        },
        {
          "headline":"Mist the tops and bottoms of your plants’ leaves.",
          "description":"Take the mister or spray bottle and spray the plants down until their leaves are dripping or dewy-looking. Make sure to get the undersides of the leaves as well as the tops. Avoid misting plants with fuzzy leaves, such as African violets, since moisture on the leaves can cause spotting."
        },
        {
          "headline":"Apply mist at least once every other day.",
          "description":"Misting is a quick and easy way to humidify your plants, but the effects don’t last long. To keep your plants happy, mist them at least every 2 days or as often as once a day. For plants that need less water, such as succulents, you may only need to mist once or twice a week. Plants that live in bathrooms or other humid parts of your home might also do okay with less frequent misting."
        },
        {
          "headline":"Do your misting first thing in the morning to prevent disease.",
          "description":"Mist your plants in the morning so that the leaves can dry out over the course of the day. If you mist them at night, the water is more likely to sit on the leaves for hours without evaporating, which could lead to fungal infections or other diseases.Did you know? Misting your plants during the day not only helps provide extra humidity, but it can also deter pests like insects and spider mites. It’s a great way to keep dust and dirt from building up on the leaves, too."
        }
      ]
    },
    {
      "name":"Using a Pebble Tray",
      "steps":[
        {
          "headline":"Fill a tray or shallow bowl with pebbles or pea gravel.",
          "description":"Purchase some aquarium gravel or pea gravel and pour it into a tray, saucer, or shallow bowl about 1 inch (2.5 cm) deep. Choose a tray that’s wider than the plant put you plan to set on top of it. The gravel will elevate the bottom of the pot above the water so that the water doesn’t end up soaking directly into the soil. You can get aquarium gravel at a pet supply store. Pea gravel is available at home or garden supply stores."
        },
        {
          "headline":"Pour in enough water to moisten the gravel.",
          "description":"Add water until the pebbles are damp, but not completely submerged. The pebbles need to be above the surface of the water so that the plant pot isn’t in direct contact with the water.Tip: Alternatively, you can set your plant pot on a dish or inside another pot filled with damp sphagnum moss. As the water evaporates from the moss, it will create humidity around the plant."
        },
        {
          "headline":"Set the plant pot on top of the gravel tray.",
          "description":"Position the plant pot in the middle of the tray, resting on top of the gravel. Don’t push it down into the wet gravel, or the water will soak up through the drainage holes in the bottom of the pot. If the tray is big enough, you can put several small plant pots together on the gravel. Position the tray with the plants on it wherever you like (such as on a windowsill or side table in a sunny part of your home)."
        },
        {
          "headline":"Add more water whenever the gravel gets dry.",
          "description":"Check the gravel daily, or whenever you water your plant, to make sure it’s still wet. If you notice that it’s dried out, add some more water. If you can’t tell by looking whether the gravel is dry, try sticking your finger in it to see if you can feel any standing water under the surface. The water may evaporate more quickly if your home is exceptionally dry, the plant is in a very sunny spot, or the room has a heater or air conditioner running."
        }
      ]
    },
    {
      "name":"Making a Humid Spot in Your Home",
      "steps":[
        {
          "headline":"Put your plants in the bathroom or kitchen for extra moisture.",
          "description":"One simple way to get more humidity to your plants is to place them in a naturally humid part of your home. Put your plants in the bathroom where they’ll get steam from your shower or bath, or keep them above the kitchen sink so they can soak up the humidity when you wash the dishes or put the kettle on. The bathroom is an ideal location for delicate, moisture-loving plants such as ferns and orchids, especially in the winter. Just make sure your plants can still get enough light wherever you choose to place them. For example, if your bathroom doesn’t have a window, you might provide an artificial grow-light."
        },
        {
          "headline":"Place a humidifier in the room with your plants.",
          "description":"If you’d rather not keep your plants in the bathroom or kitchen, you can boost the moisture in any room by adding a humidifier. Try setting up a simple cool-mist vaporizer near your plants, or get a larger humidifier if you’d like to humidify the whole room or home.Tip: You can make a DIY humidifier for your room and plants in the winter by setting a heat-proof dish or pan of water on top of a floor vent or radiator. The heat will cause the water to evaporate. A humidifier has the added bonus of being good for you and even your wood furniture and flooring!"
        },
        {
          "headline":"Keep groups of plants together so they can create moisture for each other.",
          "description":"Plants create their own moisture, so putting a bunch of them together can help them keep each other humidified. Group your plants together, but leave enough space between them so that their leaves don’t touch. They need plenty of “breathing room” to prevent disease. Keep plants with similar humidity needs together. For example, you might put a moisture-loving spider plant, fern, and orchid together in your bathroom, but keep a cactus, hens-and-chicks, and aloe in a drier part of your house."
        },
        {
          "headline":"Avoid placing your plants in drafty areas or near heat sources.",
          "description":"Drafts and heat sources can dry out the air and dehydrate your plants. Don’t put your plants near heater vents, radiators, or air conditioners. Keep them away from drafty spots, such as near doorways or corridors. If you have heating under your floors, keep your plants off the floor by setting them on a table or plant stand."
        }
      ]
    },
    {
      "name":"Creating a Glass Terrarium",
      "steps":[
        {
          "headline":"Put your plants in an open glass bowl to keep moisture around them.",
          "description":"Even without a lid, a glass container with tall sides will help trap humidity around your plant. Use a container such as a large glass jar, bowl, or fish tank. You can either set the plant pot inside the container or add soil and put the plants directly in the container itself. The sides of the container don’t necessarily have to be as tall as the plant, but steeper sides will hold in more humidity. If you decide to plant directly in the glass container, add a little gravel to the bottom beneath the soil to improve drainage. Using a glass container for planting also makes it easier to tell by looking when your plants need to be watered. Make sure there’s enough room around the plants so that their leaves don’t touch the sides of the container, since this can cause decay."
        },
        {
          "headline":"Cover your plant with a glass cloche or bell jar to make a mini greenhouse.",
          "description":"If you have a delicate, moisture-loving plant, you can create a gorgeous, humidity-trapping greenhouse for it by placing a glass cover over the plant. Use a large glass cloche or upend a large jar with a wide mouth and set that over the plant and pot. Take the cover off once or twice a week to let in fresh air and prevent mold from growing. You can buy glass bell jars or cloches online, from home décor stores, or from home and garden supply centers."
        },
        {
          "headline":"Make a garden in a bottle if you want a closed ecosystem.",
          "description":"A garden in a glass bottle is a beautiful and low-maintenance option for growing small, moisture-loving plants. Fill a large bottle or jar with a layer of horticultural grit and a layer of slightly damp potting soil until it’s about 1/3 full, then carefully insert your plants using tongs (or your hands, if the opening is wide enough). Pour in some water so it runs down the sides of the bottle and moistens the soil, then cover the opening of the container with cork stopper or glass lid. If you keep your bottle garden covered, you should only need to water it once every 4-6 months! Check the plants regularly for signs of mold or disease. If you see any problems, you’ll need to remove the diseased foliage immediately and leave the container open for 3-4 weeks to let in fresh air."
        }
      ]
    }
  ],
  "text":" Misting Your Plants Fill a plant mister or spray bottle with lukewarm water. Pour some water into a clean spray bottle or plant mister. The water should be tepid, or just slightly warm. If the water is cold, let the mister sit in a warm area (such as near a heater vent or in a sunny window) so it has a chance to warm up a little before you use it. In general, it’s okay to use tap water for your plants. However, if you have a water softener, it’s best to use filtered water or collect rainwater so that the salts don’t damage your plants. Move the plants to a sink before misting them to prevent a mess. If you don’t want to get water all over your furniture, walls, or windowsills, it’s a good idea to relocate your plants to a more water-safe area before misting them. Put them in your sink, shower, or bathtub, then return them to their usual place once you’re done. If you don’t want to bother with moving your plants every time you mist them, try draping a towel or drop cloth over anything in the area that you want to protect from the mist. Some climbing plants may attach themselves to plaster walls in your home if you get water on the walls during the misting process! Mist the tops and bottoms of your plants’ leaves. Take the mister or spray bottle and spray the plants down until their leaves are dripping or dewy-looking. Make sure to get the undersides of the leaves as well as the tops. Avoid misting plants with fuzzy leaves, such as African violets, since moisture on the leaves can cause spotting. Apply mist at least once every other day. Misting is a quick and easy way to humidify your plants, but the effects don’t last long. To keep your plants happy, mist them at least every 2 days or as often as once a day. For plants that need less water, such as succulents, you may only need to mist once or twice a week. Plants that live in bathrooms or other humid parts of your home might also do okay with less frequent misting. Do your misting first thing in the morning to prevent disease. Mist your plants in the morning so that the leaves can dry out over the course of the day. If you mist them at night, the water is more likely to sit on the leaves for hours without evaporating, which could lead to fungal infections or other diseases.Did you know? Misting your plants during the day not only helps provide extra humidity, but it can also deter pests like insects and spider mites. It’s a great way to keep dust and dirt from building up on the leaves, too. Using a Pebble Tray Fill a tray or shallow bowl with pebbles or pea gravel. Purchase some aquarium gravel or pea gravel and pour it into a tray, saucer, or shallow bowl about 1 inch (2.5 cm) deep. Choose a tray that’s wider than the plant put you plan to set on top of it. The gravel will elevate the bottom of the pot above the water so that the water doesn’t end up soaking directly into the soil. You can get aquarium gravel at a pet supply store. Pea gravel is available at home or garden supply stores. Pour in enough water to moisten the gravel. Add water until the pebbles are damp, but not completely submerged. The pebbles need to be above the surface of the water so that the plant pot isn’t in direct contact with the water.Tip: Alternatively, you can set your plant pot on a dish or inside another pot filled with damp sphagnum moss. As the water evaporates from the moss, it will create humidity around the plant. Set the plant pot on top of the gravel tray. Position the plant pot in the middle of the tray, resting on top of the gravel. Don’t push it down into the wet gravel, or the water will soak up through the drainage holes in the bottom of the pot. If the tray is big enough, you can put several small plant pots together on the gravel. Position the tray with the plants on it wherever you like (such as on a windowsill or side table in a sunny part of your home). Add more water whenever the gravel gets dry. Check the gravel daily, or whenever you water your plant, to make sure it’s still wet. If you notice that it’s dried out, add some more water. If you can’t tell by looking whether the gravel is dry, try sticking your finger in it to see if you can feel any standing water under the surface. The water may evaporate more quickly if your home is exceptionally dry, the plant is in a very sunny spot, or the room has a heater or air conditioner running. Making a Humid Spot in Your Home Put your plants in the bathroom or kitchen for extra moisture. One simple way to get more humidity to your plants is to place them in a naturally humid part of your home. Put your plants in the bathroom where they’ll get steam from your shower or bath, or keep them above the kitchen sink so they can soak up the humidity when you wash the dishes or put the kettle on. The bathroom is an ideal location for delicate, moisture-loving plants such as ferns and orchids, especially in the winter. Just make sure your plants can still get enough light wherever you choose to place them. For example, if your bathroom doesn’t have a window, you might provide an artificial grow-light. Place a humidifier in the room with your plants. If you’d rather not keep your plants in the bathroom or kitchen, you can boost the moisture in any room by adding a humidifier. Try setting up a simple cool-mist vaporizer near your plants, or get a larger humidifier if you’d like to humidify the whole room or home.Tip: You can make a DIY humidifier for your room and plants in the winter by setting a heat-proof dish or pan of water on top of a floor vent or radiator. The heat will cause the water to evaporate. A humidifier has the added bonus of being good for you and even your wood furniture and flooring! Keep groups of plants together so they can create moisture for each other. Plants create their own moisture, so putting a bunch of them together can help them keep each other humidified. Group your plants together, but leave enough space between them so that their leaves don’t touch. They need plenty of “breathing room” to prevent disease. Keep plants with similar humidity needs together. For example, you might put a moisture-loving spider plant, fern, and orchid together in your bathroom, but keep a cactus, hens-and-chicks, and aloe in a drier part of your house. Avoid placing your plants in drafty areas or near heat sources. Drafts and heat sources can dry out the air and dehydrate your plants. Don’t put your plants near heater vents, radiators, or air conditioners. Keep them away from drafty spots, such as near doorways or corridors. If you have heating under your floors, keep your plants off the floor by setting them on a table or plant stand. Creating a Glass Terrarium Put your plants in an open glass bowl to keep moisture around them. Even without a lid, a glass container with tall sides will help trap humidity around your plant. Use a container such as a large glass jar, bowl, or fish tank. You can either set the plant pot inside the container or add soil and put the plants directly in the container itself. The sides of the container don’t necessarily have to be as tall as the plant, but steeper sides will hold in more humidity. If you decide to plant directly in the glass container, add a little gravel to the bottom beneath the soil to improve drainage. Using a glass container for planting also makes it easier to tell by looking when your plants need to be watered. Make sure there’s enough room around the plants so that their leaves don’t touch the sides of the container, since this can cause decay. Cover your plant with a glass cloche or bell jar to make a mini greenhouse. If you have a delicate, moisture-loving plant, you can create a gorgeous, humidity-trapping greenhouse for it by placing a glass cover over the plant. Use a large glass cloche or upend a large jar with a wide mouth and set that over the plant and pot. Take the cover off once or twice a week to let in fresh air and prevent mold from growing. You can buy glass bell jars or cloches online, from home décor stores, or from home and garden supply centers. Make a garden in a bottle if you want a closed ecosystem. A garden in a glass bottle is a beautiful and low-maintenance option for growing small, moisture-loving plants. Fill a large bottle or jar with a layer of horticultural grit and a layer of slightly damp potting soil until it’s about 1/3 full, then carefully insert your plants using tongs (or your hands, if the opening is wide enough). Pour in some water so it runs down the sides of the bottle and moistens the soil, then cover the opening of the container with cork stopper or glass lid. If you keep your bottle garden covered, you should only need to water it once every 4-6 months! Check the plants regularly for signs of mold or disease. If you see any problems, you’ll need to remove the diseased foliage immediately and leave the container open for 3-4 weeks to let in fresh air.",
  "sentences":[
    " Misting Your Plants Fill a plant mister or spray bottle with lukewarm water.",
    "Pour some water into a clean spray bottle or plant mister.",
    "The water should be tepid, or just slightly warm.",
    "If the water is cold, let the mister sit in a warm area (such as near a heater vent or in a sunny window) so it has a chance to warm up a little before you use it.",
    "In general, it’s okay to use tap water for your plants.",
    "However, if you have a water softener, it’s best to use filtered water or collect rainwater so that the salts don’t damage your plants.",
    "Move the plants to a sink before misting them to prevent a mess.",
    "If you don’t want to get water all over your furniture, walls, or windowsills, it’s a good idea to relocate your plants to a more water-safe area before misting them.",
    "Put them in your sink, shower, or bathtub, then return them to their usual place once you’re done.",
    "If you don’t want to bother with moving your plants every time you mist them, try draping a towel or drop cloth over anything in the area that you want to protect from the mist.",
    "Some climbing plants may attach themselves to plaster walls in your home if you get water on the walls during the misting process!",
    "Mist the tops and bottoms of your plants’ leaves.",
    "Take the mister or spray bottle and spray the plants down until their leaves are dripping or dewy-looking.",
    "Make sure to get the undersides of the leaves as well as the tops.",
    "Avoid misting plants with fuzzy leaves, such as African violets, since moisture on the leaves can cause spotting.",
    "Apply mist at least once every other day.",
    "Misting is a quick and easy way to humidify your plants, but the effects don’t last long.",
    "To keep your plants happy, mist them at least every 2 days or as often as once a day.",
    "For plants that need less water, such as succulents, you may only need to mist once or twice a week.",
    "Plants that live in bathrooms or other humid parts of your home might also do okay with less frequent misting.",
    "Do your misting first thing in the morning to prevent disease.",
    "Mist your plants in the morning so that the leaves can dry out over the course of the day.",
    "If you mist them at night, the water is more likely to sit on the leaves for hours without evaporating, which could lead to fungal infections or other diseases.Did you know?",
    "Misting your plants during the day not only helps provide extra humidity, but it can also deter pests like insects and spider mites.",
    "It’s a great way to keep dust and dirt from building up on the leaves, too.",
    "Using a Pebble Tray Fill a tray or shallow bowl with pebbles or pea gravel.",
    "Purchase some aquarium gravel or pea gravel and pour it into a tray, saucer, or shallow bowl about 1 inch (2.5 cm) deep.",
    "Choose a tray that’s wider than the plant put you plan to set on top of it.",
    "The gravel will elevate the bottom of the pot above the water so that the water doesn’t end up soaking directly into the soil.",
    "You can get aquarium gravel at a pet supply store.",
    "Pea gravel is available at home or garden supply stores.",
    "Pour in enough water to moisten the gravel.",
    "Add water until the pebbles are damp, but not completely submerged.",
    "The pebbles need to be above the surface of the water so that the plant pot isn’t in direct contact with the water.Tip: Alternatively, you can set your plant pot on a dish or inside another pot filled with damp sphagnum moss.",
    "As the water evaporates from the moss, it will create humidity around the plant.",
    "Set the plant pot on top of the gravel tray.",
    "Position the plant pot in the middle of the tray, resting on top of the gravel.",
    "Don’t push it down into the wet gravel, or the water will soak up through the drainage holes in the bottom of the pot.",
    "If the tray is big enough, you can put several small plant pots together on the gravel.",
    "Position the tray with the plants on it wherever you like (such as on a windowsill or side table in a sunny part of your home).",
    "Add more water whenever the gravel gets dry.",
    "Check the gravel daily, or whenever you water your plant, to make sure it’s still wet.",
    "If you notice that it’s dried out, add some more water.",
    "If you can’t tell by looking whether the gravel is dry, try sticking your finger in it to see if you can feel any standing water under the surface.",
    "The water may evaporate more quickly if your home is exceptionally dry, the plant is in a very sunny spot, or the room has a heater or air conditioner running.",
    "Making a Humid Spot in Your Home Put your plants in the bathroom or kitchen for extra moisture.",
    "One simple way to get more humidity to your plants is to place them in a naturally humid part of your home.",
    "Put your plants in the bathroom where they’ll get steam from your shower or bath, or keep them above the kitchen sink so they can soak up the humidity when you wash the dishes or put the kettle on.",
    "The bathroom is an ideal location for delicate, moisture-loving plants such as ferns and orchids, especially in the winter.",
    "Just make sure your plants can still get enough light wherever you choose to place them.",
    "For example, if your bathroom doesn’t have a window, you might provide an artificial grow-light.",
    "Place a humidifier in the room with your plants.",
    "If you’d rather not keep your plants in the bathroom or kitchen, you can boost the moisture in any room by adding a humidifier.",
    "Try setting up a simple cool-mist vaporizer near your plants, or get a larger humidifier if you’d like to humidify the whole room or home.Tip: You can make a DIY humidifier for your room and plants in the winter by setting a heat-proof dish or pan of water on top of a floor vent or radiator.",
    "The heat will cause the water to evaporate.",
    "A humidifier has the added bonus of being good for you and even your wood furniture and flooring!",
    "Keep groups of plants together so they can create moisture for each other.",
    "Plants create their own moisture, so putting a bunch of them together can help them keep each other humidified.",
    "Group your plants together, but leave enough space between them so that their leaves don’t touch.",
    "They need plenty of “breathing room” to prevent disease.",
    "Keep plants with similar humidity needs together.",
    "For example, you might put a moisture-loving spider plant, fern, and orchid together in your bathroom, but keep a cactus, hens-and-chicks, and aloe in a drier part of your house.",
    "Avoid placing your plants in drafty areas or near heat sources.",
    "Drafts and heat sources can dry out the air and dehydrate your plants.",
    "Don’t put your plants near heater vents, radiators, or air conditioners.",
    "Keep them away from drafty spots, such as near doorways or corridors.",
    "If you have heating under your floors, keep your plants off the floor by setting them on a table or plant stand.",
    "Creating a Glass Terrarium Put your plants in an open glass bowl to keep moisture around them.",
    "Even without a lid, a glass container with tall sides will help trap humidity around your plant.",
    "Use a container such as a large glass jar, bowl, or fish tank.",
    "You can either set the plant pot inside the container or add soil and put the plants directly in the container itself.",
    "The sides of the container don’t necessarily have to be as tall as the plant, but steeper sides will hold in more humidity.",
    "If you decide to plant directly in the glass container, add a little gravel to the bottom beneath the soil to improve drainage.",
    "Using a glass container for planting also makes it easier to tell by looking when your plants need to be watered.",
    "Make sure there’s enough room around the plants so that their leaves don’t touch the sides of the container, since this can cause decay.",
    "Cover your plant with a glass cloche or bell jar to make a mini greenhouse.",
    "If you have a delicate, moisture-loving plant, you can create a gorgeous, humidity-trapping greenhouse for it by placing a glass cover over the plant.",
    "Use a large glass cloche or upend a large jar with a wide mouth and set that over the plant and pot.",
    "Take the cover off once or twice a week to let in fresh air and prevent mold from growing.",
    "You can buy glass bell jars or cloches online, from home décor stores, or from home and garden supply centers.",
    "Make a garden in a bottle if you want a closed ecosystem.",
    "A garden in a glass bottle is a beautiful and low-maintenance option for growing small, moisture-loving plants.",
    "Fill a large bottle or jar with a layer of horticultural grit and a layer of slightly damp potting soil until it’s about 1/3 full, then carefully insert your plants using tongs (or your hands, if the opening is wide enough).",
    "Pour in some water so it runs down the sides of the bottle and moistens the soil, then cover the opening of the container with cork stopper or glass lid.",
    "If you keep your bottle garden covered, you should only need to water it once every 4-6 months!",
    "Check the plants regularly for signs of mold or disease.",
    "If you see any problems, you’ll need to remove the diseased foliage immediately and leave the container open for 3-4 weeks to let in fresh air."
  ],
  "tyn_section":[
    "Plant mister or spray bottle",
    "Lukewarm tap water or filtered water",
    "Shallow bowl, tray, or saucer",
    "Aquarium pebbles or pea gravel",
    "Water",
    "Humidifier or cool mist vaporizer",
    "Grow light (optional)",
    "Glass bowl or fish tank (for making an open terrarium)",
    "Glass cloche or bell jar (for making a mini covered greenhouse)",
    "Large glass bottle or jar (for making a bottle garden)",
    "Gravel or horticultural grit",
    "Potting soil"
  ],
  "tyn_model":[
    "water",
    "plants",
    "tray",
    "gravel",
    "mist",
    "humidifier",
    "container",
    "spray bottle",
    "pea gravel",
    "plant mister",
    "aquarium gravel",
    "plant pot",
    "glass container",
    "water softener",
    "drop cloth",
    "’ leaves",
    "misting",
    "pebbles or",
    "dish",
    "orchids",
    "cool-mist vaporizer",
    "“breathing",
    "” to",
    "fern",
    "orchid",
    "cactus",
    "aloe",
    "bowl",
    "glass cloche",
    "glass cover",
    "jar",
    "glass bell jars",
    "horticultural grit",
    "potting soil",
    "bottle garden"
  ],
  "simple_metrics":{
    "r":0.1666666667,
    "p":0.0571428571,
    "f1":0.085106383,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.1142857143,
    "f1":0.1568627451
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4166666667,
    "p":0.2571428571,
    "f1":0.3180212014
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1666666667,
    "p":0.0571428571,
    "f1":0.085106383
  }
}