{
  "title":"How to Roll a Memory Foam Mattress",
  "url":"https://www.wikihow.com/Roll-a-Memory-Foam-Mattress",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "parts":[
    {
      "name":"Sealing Your Mattress in a Mattress Bag",
      "steps":[
        {
          "headline":"Remove all the bedding from your memory foam mattress.",
          "description":"Before you compress and roll your mattress, take off all the blankets, sheets, and mattress pads that are on it. If you also have a mattress topper on your bed, remove that as well. Pack and move your bedding separately from your mattress. You can use the same process outlined here to compress and roll a foam mattress topper if you have one. This is a great chance to wash everything that was on your bed, including your pillows, so you have completely fresh bedding when you set your bed back up."
        },
        {
          "headline":"Buy a heavy plastic mattress bag in the correct size.",
          "description":"You can buy a heavy plastic mattress bag from moving supply stores, hardware stores, and online. Make sure you get one that’s the proper size for your mattress. For example, if you have a queen-sized mattress, make sure you get a queen-sized bag. If you’re unable to find a bag that’s the same size as your mattress, buy a bag that’s a larger size."
        },
        {
          "headline":"Slide your memory foam mattress into the mattress bag.",
          "description":"Line the open end of the plastic mattress bag up to the top or bottom of your mattress. Slip the end of the mattress inside the bag and pull the bag along the length of the mattress until the mattress is completely inside the bag. You may need help with this step if you have a really big mattress. If you’re able to stand the mattress up on its end, you can also slide the mattress bag down onto the mattress from above."
        },
        {
          "headline":"Seal the mattress bag with tape so it’s airtight.",
          "description":"Start by sealing the open end of the mattress bag with tape so no air can escape. Also, use tape to cover up any other holes that may be in the mattress bag. If the mattress bag is larger than the mattress, fold the excess plastic so it’s flush with the mattress and tape the plastic so it’s secure. Leave one hole somewhere in the mattress bag large enough for your vacuum hose to fit into. You can use packing tape or duct tape to seal the mattress bag closed. Some plastic mattress bags are designed to be resealable so you don’t have to use tape."
        }
      ]
    },
    {
      "name":"Rolling and Securing Your Mattress",
      "steps":[
        {
          "headline":"Put the hose of your vacuum into the open hole of the mattress bag.",
          "description":"Adjust your vacuum so you can use its open-ended hose. Use a damp cloth to remove any dust or dirt from the end of the hose. Slide the end of the hose into the hole you left in the mattress bag and use tape to seal the bag around the hose to create an airtight seal. Another option, other than leaving a hole in the mattress bag, is to use a one-way vacuum value. If you’d prefer to use a valve, purchase a vacuum storage bag from a department store or online and cut off the valve. Secure that valve with tape to the mattress bag. You can attach the valve to a hole you leave in the bag or cut a new hole specifically for the valve."
        },
        {
          "headline":"Use your vacuum to compress your mattress as much as possible.",
          "description":"Turn on the vacuum and leave it on. This step may take several minutes, depending on the size of your mattress and the strength of your vacuum. Help speed up the process by using your hands to press down on top of the mattress. If you happen to notice any additional holes in the bag at this point, use tape to cover them to keep the bag as airtight as possible."
        },
        {
          "headline":"Hold down the mattress at one end to start the roll.",
          "description":"You’re likely going to need the help of a friend to roll your mattress, especially if it’s a queen or king-sized mattress. Position yourselves at the end of the mattress that’s opposite the vacuum. Use your hands to press down and compress the end of the mattress as much as possible and start to roll the mattress. Rolling the mattress will be similar to rolling a sleeping bag or down blanket. You’ll have to keep the mattress compressed downwards while also rolling it forwards."
        },
        {
          "headline":"Roll the mattress until you get to the hole where the vacuum is.",
          "description":"Continue to roll the mattress from one end to the other. Go slowly and continue to push down on the mattress as you roll it; you want to try to get it as compressed as possible. Stop rolling once you reach the opposite end of the mattress, where the vacuum is attached. Leave the vacuum on the whole time you’re rolling the mattress. The vacuum will continue to suck out any excess air from inside the bag."
        },
        {
          "headline":"Use plenty of tape to secure the mattress in it’s rolled position.",
          "description":"Unfortunately, the mattress is naturally going to want to unroll and flatten. In order to prevent this, you’re going to need to use a lot of tape to secure the mattress in a roll. Have your friend hold the mattress in its roll while you start taping from one end. Go around and around the roll of the mattress with the tape until you’ve covered the whole width of the mattress roll. Alternatively, you can use ratchet straps to secure your rolled mattress. Slip the middle of the strap under the bottom of the roll and pull the strap tight from the top using the metal ratchet device attached to the strap. Repeat on the other end of the mattress roll."
        }
      ]
    }
  ],
  "text":" Sealing Your Mattress in a Mattress Bag Remove all the bedding from your memory foam mattress. Before you compress and roll your mattress, take off all the blankets, sheets, and mattress pads that are on it. If you also have a mattress topper on your bed, remove that as well. Pack and move your bedding separately from your mattress. You can use the same process outlined here to compress and roll a foam mattress topper if you have one. This is a great chance to wash everything that was on your bed, including your pillows, so you have completely fresh bedding when you set your bed back up. Buy a heavy plastic mattress bag in the correct size. You can buy a heavy plastic mattress bag from moving supply stores, hardware stores, and online. Make sure you get one that’s the proper size for your mattress. For example, if you have a queen-sized mattress, make sure you get a queen-sized bag. If you’re unable to find a bag that’s the same size as your mattress, buy a bag that’s a larger size. Slide your memory foam mattress into the mattress bag. Line the open end of the plastic mattress bag up to the top or bottom of your mattress. Slip the end of the mattress inside the bag and pull the bag along the length of the mattress until the mattress is completely inside the bag. You may need help with this step if you have a really big mattress. If you’re able to stand the mattress up on its end, you can also slide the mattress bag down onto the mattress from above. Seal the mattress bag with tape so it’s airtight. Start by sealing the open end of the mattress bag with tape so no air can escape. Also, use tape to cover up any other holes that may be in the mattress bag. If the mattress bag is larger than the mattress, fold the excess plastic so it’s flush with the mattress and tape the plastic so it’s secure. Leave one hole somewhere in the mattress bag large enough for your vacuum hose to fit into. You can use packing tape or duct tape to seal the mattress bag closed. Some plastic mattress bags are designed to be resealable so you don’t have to use tape. Rolling and Securing Your Mattress Put the hose of your vacuum into the open hole of the mattress bag. Adjust your vacuum so you can use its open-ended hose. Use a damp cloth to remove any dust or dirt from the end of the hose. Slide the end of the hose into the hole you left in the mattress bag and use tape to seal the bag around the hose to create an airtight seal. Another option, other than leaving a hole in the mattress bag, is to use a one-way vacuum value. If you’d prefer to use a valve, purchase a vacuum storage bag from a department store or online and cut off the valve. Secure that valve with tape to the mattress bag. You can attach the valve to a hole you leave in the bag or cut a new hole specifically for the valve. Use your vacuum to compress your mattress as much as possible. Turn on the vacuum and leave it on. This step may take several minutes, depending on the size of your mattress and the strength of your vacuum. Help speed up the process by using your hands to press down on top of the mattress. If you happen to notice any additional holes in the bag at this point, use tape to cover them to keep the bag as airtight as possible. Hold down the mattress at one end to start the roll. You’re likely going to need the help of a friend to roll your mattress, especially if it’s a queen or king-sized mattress. Position yourselves at the end of the mattress that’s opposite the vacuum. Use your hands to press down and compress the end of the mattress as much as possible and start to roll the mattress. Rolling the mattress will be similar to rolling a sleeping bag or down blanket. You’ll have to keep the mattress compressed downwards while also rolling it forwards. Roll the mattress until you get to the hole where the vacuum is. Continue to roll the mattress from one end to the other. Go slowly and continue to push down on the mattress as you roll it; you want to try to get it as compressed as possible. Stop rolling once you reach the opposite end of the mattress, where the vacuum is attached. Leave the vacuum on the whole time you’re rolling the mattress. The vacuum will continue to suck out any excess air from inside the bag. Use plenty of tape to secure the mattress in it’s rolled position. Unfortunately, the mattress is naturally going to want to unroll and flatten. In order to prevent this, you’re going to need to use a lot of tape to secure the mattress in a roll. Have your friend hold the mattress in its roll while you start taping from one end. Go around and around the roll of the mattress with the tape until you’ve covered the whole width of the mattress roll. Alternatively, you can use ratchet straps to secure your rolled mattress. Slip the middle of the strap under the bottom of the roll and pull the strap tight from the top using the metal ratchet device attached to the strap. Repeat on the other end of the mattress roll.",
  "sentences":[
    " Sealing Your Mattress in a Mattress Bag Remove all the bedding from your memory foam mattress.",
    "Before you compress and roll your mattress, take off all the blankets, sheets, and mattress pads that are on it.",
    "If you also have a mattress topper on your bed, remove that as well.",
    "Pack and move your bedding separately from your mattress.",
    "You can use the same process outlined here to compress and roll a foam mattress topper if you have one.",
    "This is a great chance to wash everything that was on your bed, including your pillows, so you have completely fresh bedding when you set your bed back up.",
    "Buy a heavy plastic mattress bag in the correct size.",
    "You can buy a heavy plastic mattress bag from moving supply stores, hardware stores, and online.",
    "Make sure you get one that’s the proper size for your mattress.",
    "For example, if you have a queen-sized mattress, make sure you get a queen-sized bag.",
    "If you’re unable to find a bag that’s the same size as your mattress, buy a bag that’s a larger size.",
    "Slide your memory foam mattress into the mattress bag.",
    "Line the open end of the plastic mattress bag up to the top or bottom of your mattress.",
    "Slip the end of the mattress inside the bag and pull the bag along the length of the mattress until the mattress is completely inside the bag.",
    "You may need help with this step if you have a really big mattress.",
    "If you’re able to stand the mattress up on its end, you can also slide the mattress bag down onto the mattress from above.",
    "Seal the mattress bag with tape so it’s airtight.",
    "Start by sealing the open end of the mattress bag with tape so no air can escape.",
    "Also, use tape to cover up any other holes that may be in the mattress bag.",
    "If the mattress bag is larger than the mattress, fold the excess plastic so it’s flush with the mattress and tape the plastic so it’s secure.",
    "Leave one hole somewhere in the mattress bag large enough for your vacuum hose to fit into.",
    "You can use packing tape or duct tape to seal the mattress bag closed.",
    "Some plastic mattress bags are designed to be resealable so you don’t have to use tape.",
    "Rolling and Securing Your Mattress Put the hose of your vacuum into the open hole of the mattress bag.",
    "Adjust your vacuum so you can use its open-ended hose.",
    "Use a damp cloth to remove any dust or dirt from the end of the hose.",
    "Slide the end of the hose into the hole you left in the mattress bag and use tape to seal the bag around the hose to create an airtight seal.",
    "Another option, other than leaving a hole in the mattress bag, is to use a one-way vacuum value.",
    "If you’d prefer to use a valve, purchase a vacuum storage bag from a department store or online and cut off the valve.",
    "Secure that valve with tape to the mattress bag.",
    "You can attach the valve to a hole you leave in the bag or cut a new hole specifically for the valve.",
    "Use your vacuum to compress your mattress as much as possible.",
    "Turn on the vacuum and leave it on.",
    "This step may take several minutes, depending on the size of your mattress and the strength of your vacuum.",
    "Help speed up the process by using your hands to press down on top of the mattress.",
    "If you happen to notice any additional holes in the bag at this point, use tape to cover them to keep the bag as airtight as possible.",
    "Hold down the mattress at one end to start the roll.",
    "You’re likely going to need the help of a friend to roll your mattress, especially if it’s a queen or king-sized mattress.",
    "Position yourselves at the end of the mattress that’s opposite the vacuum.",
    "Use your hands to press down and compress the end of the mattress as much as possible and start to roll the mattress.",
    "Rolling the mattress will be similar to rolling a sleeping bag or down blanket.",
    "You’ll have to keep the mattress compressed downwards while also rolling it forwards.",
    "Roll the mattress until you get to the hole where the vacuum is.",
    "Continue to roll the mattress from one end to the other.",
    "Go slowly and continue to push down on the mattress as you roll it; you want to try to get it as compressed as possible.",
    "Stop rolling once you reach the opposite end of the mattress, where the vacuum is attached.",
    "Leave the vacuum on the whole time you’re rolling the mattress.",
    "The vacuum will continue to suck out any excess air from inside the bag.",
    "Use plenty of tape to secure the mattress in it’s rolled position.",
    "Unfortunately, the mattress is naturally going to want to unroll and flatten.",
    "In order to prevent this, you’re going to need to use a lot of tape to secure the mattress in a roll.",
    "Have your friend hold the mattress in its roll while you start taping from one end.",
    "Go around and around the roll of the mattress with the tape until you’ve covered the whole width of the mattress roll.",
    "Alternatively, you can use ratchet straps to secure your rolled mattress.",
    "Slip the middle of the strap under the bottom of the roll and pull the strap tight from the top using the metal ratchet device attached to the strap.",
    "Repeat on the other end of the mattress roll."
  ],
  "tyn_section":[
    "Heavy plastic mattress bag",
    "Packing or duct tape",
    "Scissors or tape gun",
    "Vacuum",
    "Ratchet straps or rope"
  ],
  "tyn_model":[
    "tape",
    "vacuum",
    "mattress",
    "mattress bag",
    "memory foam mattress",
    "mattress topper",
    "heavy plastic mattress bag",
    "mattress pads",
    "plastic mattress bag",
    "plastic",
    "vacuum hose",
    "packing tape",
    "duct tape",
    "vacuum storage bag",
    "sleeping bag"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1333333333,
    "f1":0.2,
    "avg_pos":0.4
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.4666666667,
    "f1":0.525
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.5333333333,
    "f1":0.5647058824
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.2,
    "f1":0.2666666667
  }
}