{
  "title":"How to Send Plants",
  "url":"https://www.wikihow.com/Send-Plants",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "methods":[
    {
      "name":"Packing Plants Bare-Root",
      "steps":[
        {
          "headline":"Dig the plant carefully out of its soil.",
          "description":"Use a small trowel to dig around the roots of the plant and separate them from the bulk of the soil. Grab the plant as close to the surface of the soil as you can, being careful not to damage its foliage, and gently pull it up out of the soil.If you aren’t sure where to dig around the roots, start at least 3 in (7.6 cm) away from the base of the stem for small plants and at least 6 in (15 cm) away from the base of the stem for larger plants. If you hit roots when you start digging, move out further away from the stem. Try to keep the root ball as intact and undamaged as possible."
        },
        {
          "headline":"Shake the plant to remove excess dirt from the roots.",
          "description":"Hold the stem firmly by its stem and shake it hard enough that any dirt clinging to the roots starts to fall off. Keep shaking it until most of the loose dirt is gone.Shipping plants bare-root is preferable to shipping potted plants because you don’t have to pay for the weight of the pots and soil. It’s also safer for the plants because there are no heavy pots or chunks of dirt that can move around and damage the plants."
        },
        {
          "headline":"Wrap the roots in moist paper towels.",
          "description":"Take 1-2 paper towels off a roll and soak them in water, then gently squeeze out the excess water so they aren’t dripping. Wrap the moist paper towels tightly around the roots of the plant so that the roots are completely covered.Warning: Make sure you only wrap the roots when shipping plants and not the stems or foliage. Prolonged contact with moisture can cause other parts of the plant to die. This will give the plant enough water to survive during shipping. You can use this same technique to send cuttings of plants by wrapping the base of the cutting in damp paper towels."
        },
        {
          "headline":"Cover the wrapped roots securely in plastic.",
          "description":"Wrap plastic wrap tightly around the damp paper towels surrounding the roots or stick the wrapped root bundle in a plastic bag and tie it off to seal it. Try to seal whatever plastic you use as tightly as possible to contain the moisture and keep it from drying up or spreading to other parts of the plant.Make sure you completely cover the moist paper towels, but avoid wrapping any of the stem or foliage. If you wrap any of the leaves by accident, they can accumulate condensation and rot or steam to death in hot climates."
        },
        {
          "headline":"Wrap the top of the plant loosely in newspaper.",
          "description":"Lay the plant flat on a piece of newspaper and gather up the stems and foliage into a loose bundle so that the leaves are pointing upwards. Carefully roll up the newspaper into a tight cone around the plant and secure it with a piece of tape. Fold the top of the cone down and tape it shut.Think about how florists wrap bouquets of flowers in cones of plastic and tissue paper. Wrap the newspaper around the stem and foliage of the plant in a similar manner to protect it."
        },
        {
          "headline":"Pack the plant into a box filled with soft, supportive packing material.",
          "description":"Pick a box that is big enough for the plant you want to send with room for packing material around it. Fill the space in the box around the plant with packing material like Styrofoam peanuts, crumpled newspaper, bubblewrap, or any other material that will provide cushioning and insulation during shipping.Don’t be shy about stuffing the box with packing material. It’s better to slightly overfill the box, so that the plants don’t move around at all, than to underfill it and have the plants slide around in transit."
        }
      ]
    },
    {
      "name":"Wrapping Potted Plants",
      "steps":[
        {
          "headline":"Water the plant 1-2 days before packing.",
          "description":"Water the soil of the potted plant 1 day ahead of time if it is in a hot climate or 2 days ahead of time if it isn’t. This will ensure the soil contains moisture for the plant to consume and is not overly wet or dry.If the soil is too wet, it can get the box and packing materials wet. If it is too dry, it can shift around a lot and the plant may not have the water it needs to survive shipping."
        },
        {
          "headline":"Secure a plastic bag around the pot and soil to contain it.",
          "description":"Place the potted plant in a plastic bag. Tie or tape the plastic bag tightly around the base of the stem to prevent the soil from falling out during transit.If this is difficult to do because the plant doesn’t have a single main stem, you can cover the soil with newspaper or cardboard and tape it to the pot to contain the soil."
        },
        {
          "headline":"Roll corrugated cardboard into a tube that fits around the plant.",
          "description":"Bend a piece of thin corrugated cardboard into a cylinder that fits around the pot and the foliage. Tape the cardboard in place around the whole plant to provide added protection during shipping.Tip: If you want to send multiple plants, you could put them all vertically in a box and separate them with a grid-shaped corrugated cardboard divider rather than using individual cardboard tubes. You can buy corrugated cardboard partitions and dividers that you can use for this at a packing supply store or you could cut up a spare box."
        },
        {
          "headline":"Wrap the cardboard rolls with bubble wrap or packing foam.",
          "description":"Make 1-2 full wraps around the cardboard tube containing the plant. Tape the bubble wrap or packing foam in place to secure the final layer of protection around the plant.This will provide the plant with both cushioning and insulation against extreme temperatures during shipping."
        },
        {
          "headline":"Put the plant in an appropriately-sized shipping box.",
          "description":"Select a box that is large enough to hold the wrapped potted plant, standing up, without allowing room for it to move around much. Place the plant inside by sliding it down carefully from the top so it stands up inside the box.If the plant has foliage that is wider than the pot, gently gather the foliage so all the leaves are pointing upwards before you set it down in the box. This way, the leaves and stems are less likely to get bent and damaged."
        }
      ]
    },
    {
      "name":"Shipping Packed Plants",
      "steps":[
        {
          "headline":"Apply a shipping label to the top of the box.",
          "description":"Tape or stick the shipping label so it is clearly visible on the lid of the box. This will increase the chances that the box gets shipped upright.You can also put additional warning labels that say something like “live plants” or “this way up” to increase the odds that the plants will be handled with care and shipped in the correct orientation."
        },
        {
          "headline":"Send the plant by a method that takes no more than 2 days.",
          "description":"Pay for a 2-day shipping method, or faster, via a postal service or private shipping company. This will ensure that the plants don’t use up all the water in the paper towels or soil and arrive at their destination alive and healthy.In some countries, such as the USA, the regular postal service offers fast shipping methods. Otherwise, you can use a private shipping company like FedEx or DHL."
        },
        {
          "headline":"Avoid shipping flowers over the weekend or a holiday period.",
          "description":"Weekends and holidays will delay the shipping time and increase the chances of the plants perishing in transit. Plan to ship plants towards the beginning of a regular business week.If you’re using 2-day shipping, try to ship plants Monday-Wednesday. If you’re paying for an overnight shipping method, Monday-Thursday is fine."
        }
      ]
    }
  ],
  "text":" Packing Plants Bare-Root Dig the plant carefully out of its soil. Use a small trowel to dig around the roots of the plant and separate them from the bulk of the soil. Grab the plant as close to the surface of the soil as you can, being careful not to damage its foliage, and gently pull it up out of the soil.If you aren’t sure where to dig around the roots, start at least 3 in (7.6 cm) away from the base of the stem for small plants and at least 6 in (15 cm) away from the base of the stem for larger plants. If you hit roots when you start digging, move out further away from the stem. Try to keep the root ball as intact and undamaged as possible. Shake the plant to remove excess dirt from the roots. Hold the stem firmly by its stem and shake it hard enough that any dirt clinging to the roots starts to fall off. Keep shaking it until most of the loose dirt is gone.Shipping plants bare-root is preferable to shipping potted plants because you don’t have to pay for the weight of the pots and soil. It’s also safer for the plants because there are no heavy pots or chunks of dirt that can move around and damage the plants. Wrap the roots in moist paper towels. Take 1-2 paper towels off a roll and soak them in water, then gently squeeze out the excess water so they aren’t dripping. Wrap the moist paper towels tightly around the roots of the plant so that the roots are completely covered.Warning: Make sure you only wrap the roots when shipping plants and not the stems or foliage. Prolonged contact with moisture can cause other parts of the plant to die. This will give the plant enough water to survive during shipping. You can use this same technique to send cuttings of plants by wrapping the base of the cutting in damp paper towels. Cover the wrapped roots securely in plastic. Wrap plastic wrap tightly around the damp paper towels surrounding the roots or stick the wrapped root bundle in a plastic bag and tie it off to seal it. Try to seal whatever plastic you use as tightly as possible to contain the moisture and keep it from drying up or spreading to other parts of the plant.Make sure you completely cover the moist paper towels, but avoid wrapping any of the stem or foliage. If you wrap any of the leaves by accident, they can accumulate condensation and rot or steam to death in hot climates. Wrap the top of the plant loosely in newspaper. Lay the plant flat on a piece of newspaper and gather up the stems and foliage into a loose bundle so that the leaves are pointing upwards. Carefully roll up the newspaper into a tight cone around the plant and secure it with a piece of tape. Fold the top of the cone down and tape it shut.Think about how florists wrap bouquets of flowers in cones of plastic and tissue paper. Wrap the newspaper around the stem and foliage of the plant in a similar manner to protect it. Pack the plant into a box filled with soft, supportive packing material. Pick a box that is big enough for the plant you want to send with room for packing material around it. Fill the space in the box around the plant with packing material like Styrofoam peanuts, crumpled newspaper, bubblewrap, or any other material that will provide cushioning and insulation during shipping.Don’t be shy about stuffing the box with packing material. It’s better to slightly overfill the box, so that the plants don’t move around at all, than to underfill it and have the plants slide around in transit. Wrapping Potted Plants Water the plant 1-2 days before packing. Water the soil of the potted plant 1 day ahead of time if it is in a hot climate or 2 days ahead of time if it isn’t. This will ensure the soil contains moisture for the plant to consume and is not overly wet or dry.If the soil is too wet, it can get the box and packing materials wet. If it is too dry, it can shift around a lot and the plant may not have the water it needs to survive shipping. Secure a plastic bag around the pot and soil to contain it. Place the potted plant in a plastic bag. Tie or tape the plastic bag tightly around the base of the stem to prevent the soil from falling out during transit.If this is difficult to do because the plant doesn’t have a single main stem, you can cover the soil with newspaper or cardboard and tape it to the pot to contain the soil. Roll corrugated cardboard into a tube that fits around the plant. Bend a piece of thin corrugated cardboard into a cylinder that fits around the pot and the foliage. Tape the cardboard in place around the whole plant to provide added protection during shipping.Tip: If you want to send multiple plants, you could put them all vertically in a box and separate them with a grid-shaped corrugated cardboard divider rather than using individual cardboard tubes. You can buy corrugated cardboard partitions and dividers that you can use for this at a packing supply store or you could cut up a spare box. Wrap the cardboard rolls with bubble wrap or packing foam. Make 1-2 full wraps around the cardboard tube containing the plant. Tape the bubble wrap or packing foam in place to secure the final layer of protection around the plant.This will provide the plant with both cushioning and insulation against extreme temperatures during shipping. Put the plant in an appropriately-sized shipping box. Select a box that is large enough to hold the wrapped potted plant, standing up, without allowing room for it to move around much. Place the plant inside by sliding it down carefully from the top so it stands up inside the box.If the plant has foliage that is wider than the pot, gently gather the foliage so all the leaves are pointing upwards before you set it down in the box. This way, the leaves and stems are less likely to get bent and damaged. Shipping Packed Plants Apply a shipping label to the top of the box. Tape or stick the shipping label so it is clearly visible on the lid of the box. This will increase the chances that the box gets shipped upright.You can also put additional warning labels that say something like “live plants” or “this way up” to increase the odds that the plants will be handled with care and shipped in the correct orientation. Send the plant by a method that takes no more than 2 days. Pay for a 2-day shipping method, or faster, via a postal service or private shipping company. This will ensure that the plants don’t use up all the water in the paper towels or soil and arrive at their destination alive and healthy.In some countries, such as the USA, the regular postal service offers fast shipping methods. Otherwise, you can use a private shipping company like FedEx or DHL. Avoid shipping flowers over the weekend or a holiday period. Weekends and holidays will delay the shipping time and increase the chances of the plants perishing in transit. Plan to ship plants towards the beginning of a regular business week.If you’re using 2-day shipping, try to ship plants Monday-Wednesday. If you’re paying for an overnight shipping method, Monday-Thursday is fine.",
  "sentences":[
    " Packing Plants Bare-Root Dig the plant carefully out of its soil.",
    "Use a small trowel to dig around the roots of the plant and separate them from the bulk of the soil.",
    "Grab the plant as close to the surface of the soil as you can, being careful not to damage its foliage, and gently pull it up out of the soil.If you aren’t sure where to dig around the roots, start at least 3 in (7.6 cm) away from the base of the stem for small plants and at least 6 in (15 cm) away from the base of the stem for larger plants.",
    "If you hit roots when you start digging, move out further away from the stem.",
    "Try to keep the root ball as intact and undamaged as possible.",
    "Shake the plant to remove excess dirt from the roots.",
    "Hold the stem firmly by its stem and shake it hard enough that any dirt clinging to the roots starts to fall off.",
    "Keep shaking it until most of the loose dirt is gone.Shipping plants bare-root is preferable to shipping potted plants because you don’t have to pay for the weight of the pots and soil.",
    "It’s also safer for the plants because there are no heavy pots or chunks of dirt that can move around and damage the plants.",
    "Wrap the roots in moist paper towels.",
    "Take 1-2 paper towels off a roll and soak them in water, then gently squeeze out the excess water so they aren’t dripping.",
    "Wrap the moist paper towels tightly around the roots of the plant so that the roots are completely covered.Warning: Make sure you only wrap the roots when shipping plants and not the stems or foliage.",
    "Prolonged contact with moisture can cause other parts of the plant to die.",
    "This will give the plant enough water to survive during shipping.",
    "You can use this same technique to send cuttings of plants by wrapping the base of the cutting in damp paper towels.",
    "Cover the wrapped roots securely in plastic.",
    "Wrap plastic wrap tightly around the damp paper towels surrounding the roots or stick the wrapped root bundle in a plastic bag and tie it off to seal it.",
    "Try to seal whatever plastic you use as tightly as possible to contain the moisture and keep it from drying up or spreading to other parts of the plant.Make sure you completely cover the moist paper towels, but avoid wrapping any of the stem or foliage.",
    "If you wrap any of the leaves by accident, they can accumulate condensation and rot or steam to death in hot climates.",
    "Wrap the top of the plant loosely in newspaper.",
    "Lay the plant flat on a piece of newspaper and gather up the stems and foliage into a loose bundle so that the leaves are pointing upwards.",
    "Carefully roll up the newspaper into a tight cone around the plant and secure it with a piece of tape.",
    "Fold the top of the cone down and tape it shut.Think about how florists wrap bouquets of flowers in cones of plastic and tissue paper.",
    "Wrap the newspaper around the stem and foliage of the plant in a similar manner to protect it.",
    "Pack the plant into a box filled with soft, supportive packing material.",
    "Pick a box that is big enough for the plant you want to send with room for packing material around it.",
    "Fill the space in the box around the plant with packing material like Styrofoam peanuts, crumpled newspaper, bubblewrap, or any other material that will provide cushioning and insulation during shipping.Don’t be shy about stuffing the box with packing material.",
    "It’s better to slightly overfill the box, so that the plants don’t move around at all, than to underfill it and have the plants slide around in transit.",
    "Wrapping Potted Plants Water the plant 1-2 days before packing.",
    "Water the soil of the potted plant 1 day ahead of time if it is in a hot climate or 2 days ahead of time if it isn’t.",
    "This will ensure the soil contains moisture for the plant to consume and is not overly wet or dry.If the soil is too wet, it can get the box and packing materials wet.",
    "If it is too dry, it can shift around a lot and the plant may not have the water it needs to survive shipping.",
    "Secure a plastic bag around the pot and soil to contain it.",
    "Place the potted plant in a plastic bag.",
    "Tie or tape the plastic bag tightly around the base of the stem to prevent the soil from falling out during transit.If this is difficult to do because the plant doesn’t have a single main stem, you can cover the soil with newspaper or cardboard and tape it to the pot to contain the soil.",
    "Roll corrugated cardboard into a tube that fits around the plant.",
    "Bend a piece of thin corrugated cardboard into a cylinder that fits around the pot and the foliage.",
    "Tape the cardboard in place around the whole plant to provide added protection during shipping.Tip: If you want to send multiple plants, you could put them all vertically in a box and separate them with a grid-shaped corrugated cardboard divider rather than using individual cardboard tubes.",
    "You can buy corrugated cardboard partitions and dividers that you can use for this at a packing supply store or you could cut up a spare box.",
    "Wrap the cardboard rolls with bubble wrap or packing foam.",
    "Make 1-2 full wraps around the cardboard tube containing the plant.",
    "Tape the bubble wrap or packing foam in place to secure the final layer of protection around the plant.This will provide the plant with both cushioning and insulation against extreme temperatures during shipping.",
    "Put the plant in an appropriately-sized shipping box.",
    "Select a box that is large enough to hold the wrapped potted plant, standing up, without allowing room for it to move around much.",
    "Place the plant inside by sliding it down carefully from the top so it stands up inside the box.If the plant has foliage that is wider than the pot, gently gather the foliage so all the leaves are pointing upwards before you set it down in the box.",
    "This way, the leaves and stems are less likely to get bent and damaged.",
    "Shipping Packed Plants Apply a shipping label to the top of the box.",
    "Tape or stick the shipping label so it is clearly visible on the lid of the box.",
    "This will increase the chances that the box gets shipped upright.You can also put additional warning labels that say something like “live plants” or “this way up” to increase the odds that the plants will be handled with care and shipped in the correct orientation.",
    "Send the plant by a method that takes no more than 2 days.",
    "Pay for a 2-day shipping method, or faster, via a postal service or private shipping company.",
    "This will ensure that the plants don’t use up all the water in the paper towels or soil and arrive at their destination alive and healthy.In some countries, such as the USA, the regular postal service offers fast shipping methods.",
    "Otherwise, you can use a private shipping company like FedEx or DHL.",
    "Avoid shipping flowers over the weekend or a holiday period.",
    "Weekends and holidays will delay the shipping time and increase the chances of the plants perishing in transit.",
    "Plan to ship plants towards the beginning of a regular business week.If you’re using 2-day shipping, try to ship plants Monday-Wednesday.",
    "If you’re paying for an overnight shipping method, Monday-Thursday is fine."
  ],
  "tyn_section":[
    "Trowel",
    "Paper towels",
    "Water",
    "Plastic wrap or bags and ties",
    "Newspaper",
    "Tape",
    "Packing material",
    "Shipping box",
    "Plastic bag",
    "String or twist ties",
    "Corrugated cardboard",
    "Bubble wrap or packing foam",
    "Shipping label"
  ],
  "tyn_model":[
    "paper towels",
    "water",
    "newspaper",
    "cardboard",
    "plastic bag",
    "corrugated cardboard",
    "plants",
    "plastic",
    "packing material",
    "bubble wrap",
    "trowel",
    "plastic wrap",
    "tape",
    "tissue paper",
    "styrofoam peanuts",
    "packing supply store",
    "packing foam",
    "pot",
    "“live",
    "” or",
    "“this",
    "” to",
    "flowers"
  ],
  "simple_metrics":{
    "r":0.6153846154,
    "p":0.347826087,
    "f1":0.4444444444,
    "avg_pos":0.4347826087
  },
  "jacc_metrics_0.5":{
    "r":0.6153846154,
    "p":0.4347826087,
    "f1":0.5095541401
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7692307692,
    "p":0.6086956522,
    "f1":0.6796116505
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6153846154,
    "p":0.347826087,
    "f1":0.4444444444
  }
}