{
  "title":"How to Make a Time Out Stool",
  "url":"https://www.wikihow.com/Make-a-Time-Out-Stool",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Cutting the Stool’s Base",
      "steps":[
        {
          "headline":"Sketch 2 identical 11 in (28 cm) circles on a 1 in (2.5 cm) thick plank.",
          "description":"Arrange a large, 1 in (2.5 cm) thick slab of wood on a flat work surface. Attach a pencil to a compass, then arrange the device in the center of the wood. Rotate the compass in a complete circle so a circular sketch is visible on the wood’s surface. Before you continue, use the compass to draw a second, separate circle.These circles will serve as the top and bottom of your hourglass. Plywood is a great option for this part of the project. Ideally, use a plank that’s at least 1 ft (0.30 m) long and 2 ft (0.61 m) wide."
        },
        {
          "headline":"Cut out both circles using a jigsaw to form the bases of the stool.",
          "description":"Position about ⅓ of the plank off of your flat workspace, so you can cut out the circles. Place the edge of this plank in between a vise, then tighten the clamp into place. Next, use a jigsaw to cut around the circular sketch in the wood. Once you’ve successfully cut out 1 circle, reposition the plank so you can cut out the second shape. Clamp the wood into place again, then cut out the second circle with the jigsaw.Don’t worry if your cutting job isn’t exact. You can always make adjustments later! If you don’t have hardware tools on hand, try purchasing 2 pre-cut, 11 to 12 in (28 to 30 cm) wide wooden circles from a hardware or home improvement store."
        },
        {
          "headline":"Smooth away any splinters or imperfections with coarse sandpaper.",
          "description":"Take a coarse, 40- or 60-grit piece of sandpaper and work around the curved edges of each base piece. If you notice any rough or uneven edges, focus on those areas first. Continue sanding around both wooden circles until they’re both free of splinters and rough spots.If you don’t need to do any extensive sanding to your wooden pieces, try using a smoother, higher-grit sandpaper instead."
        }
      ]
    },
    {
      "name":"Building the Hourglass",
      "steps":[
        {
          "headline":"Cut 2 soda bottles in half lengthwise to serve as the hourglass.",
          "description":"Draw circular lines around the middle of two 2 L (68  fl oz) bottles. Next, use a pair of scissors to cut around this line, dividing both bottles in half. Once you’re finished cutting, set aside the 2 spout pieces, as these are what you’ll use to make your stool.Consider rinsing out and air-drying the bottles before using them to make a stool."
        },
        {
          "headline":"Hot glue the tops of 2 bottle caps together to connect the soda bottles.",
          "description":"Locate both of the caps that were used for the old soda bottles. To connect the 2 caps together, apply a small ring of hot glue on the outer surface of 1 cap. Next, press the other cap onto the hot glue for several seconds. Once you stop pressing both items together, hold the caps in 1 hand to ensure that the glue is dry.These caps will help connect and support the center of the “hourglass.”\nHot glue dries within a few seconds, so be sure to apply and use it quickly."
        },
        {
          "headline":"Drill a ¼ in (0.6 cm) wide hole through the bottle caps.",
          "description":"Attach a thin drill bit into your electric tool to create a smaller hole, which allows the sand or salt to travel smoothly between both halves of the hourglass. Next, drill in the center of these glued caps, applying enough pressure so the drill bit creates a hole through the center of the plastic.You don’t want the hole to be too big, or else the sand will pour too quickly. Wear safety glasses and a face mask as a precaution whenever you work with power tools."
        },
        {
          "headline":"Screw the bottle-nosed halves of the cut bottles onto the glued caps.",
          "description":"First, arrange the narrow end of each bottle onto the connector by rotating each bottle-nose clockwise. Once the soda bottles are connected, double-check the spouts to ensure that they’re tightly attached.If the soda bottles are too loose, then the sand might not flow through them correctly. Make sure that the hot glue is dry before you drill into the caps."
        },
        {
          "headline":"Sketch 2 wooden circles that fit snugly into the soda bottle base.",
          "description":"Take a thinner, ½ in (1.2 cm) plank of wood and clamp it to your work area with a table vise. Arrange the wider end of your soda bottle spout on the plank, then sketch around it in pencil. After drawing 2 circles onto the wood surface, use a jigsaw to cut out the shapes.Plywood is a good option for this. Be sure to trace the wider end of the bottle instead of the spout."
        },
        {
          "headline":"Sand the edges of the smaller circles with medium-grit sandpaper.",
          "description":"Use a piece, block, or circle of sandpaper to work away any splinters or uneven edges from the outer rims of each circle. As you sand, arrange the wide end of your bottle spout over the circle to ensure that it fits snugly. Continue sanding both circles with short, even motions until the edges are completely smooth.The wood needs to fit inside the wider end of the bottle. This part of the process ensures that the hourglass will be sturdy once it’s attached to the larger bases."
        },
        {
          "headline":"Attach 1 circle to the center of each wooden base with wood glue.",
          "description":"Before glueing anything into place, arrange each circle in the middle of a larger wooden base. Once you’ve centered the circle, extend a tape measure from the outer rim of the base circle to the edge of the small, central circle. Perform this measurement from all edges of the base to make sure that the wooden circle is centered. Next, apply a circle of wood glue around this central area, then press the smaller wooden circle into place for several seconds.Both wooden pieces need to be centered for the stool to function correctly. Read the glue’s label to see how much time it needs to fully dry."
        }
      ]
    },
    {
      "name":"Decorating and Assembling the Finished Product",
      "steps":[
        {
          "headline":"Saw 3 dowels to provide structure for your stool.",
          "description":"Use a tape measure to calculate the approximate height of your plastic hourglass. Keeping this measurement in mind, trim the height of your 3 dowels to match your bottle hourglass. Since the dowels aren’t especially thick, you can use a handsaw for this part of the process.Use 1 hand or a table clamp to hold the dowels in place while using your opposite hand to maneuver the handsaw."
        },
        {
          "headline":"Spray paint 1 side of the circles and dowels in the color of your choice.",
          "description":"Arrange a piece of newspaper or drop cloths in an outdoor or well-ventilated area. Place your 2 wooden circles and 3 wooden, 1⅛ in (2.9 cm) thick dowels on this surface. Spray an even coat of paint over all 5 wooden pieces until they’re all completely covered.Before you start painting, slide on a face mask or respirator to prevent you from inhaling any paint particles."
        },
        {
          "headline":"Wait for the wooden pieces to dry completely.",
          "description":"Read the instructions on the spray can to see how much time your paint needs to dry completely. Wait several hours, or whatever amount of time is specified in the directions. During this time, don’t touch or move the wooden dowels or circles.You won’t be able to paint all sides of the wooden pieces. Instead, you’ll have to wait for them to dry fully."
        },
        {
          "headline":"Paint the opposite, unpainted sides of the wooden items.",
          "description":"Flip or rotate the wooden pieces so you can spray paint the opposite sides of the circles and dowels. As you work, apply a thick, even coat of paint over the dowels and circles. Let these wooden pieces dry completely before moving them to your workspace.Make sure there’s no rain in the forecast if you plan on spray painting your items outside."
        },
        {
          "headline":"Glue the hourglass to the base wooden piece.",
          "description":"Apply a thin stream of wood glue around the border of the small, central circle. Next, arrange 1 end of the spout over the ring of wood glue. To secure this half of the hourglass, hold it in place for several seconds.Don’t glue the other half of the hourglass into place yet. The wide, cut end of the plastic bottle needs to fit snugly around the small wooden circle."
        },
        {
          "headline":"Pre-drill 3 holes into the circular wooden base.",
          "description":"Measure around the large, wooden base to find suitable placements for your wooden dowels. Lightly mark where each dowel will go, checking that all 3 points are equidistant from one another. Next, drill into these marked areas, so you can keep track of where the dowels are supposed to go.You’ll be using both screws and glue to secure the dowels in place on the stool."
        },
        {
          "headline":"Use wood glue to attach the dowels to the base.",
          "description":"Squeeze out a bead of glue on the bottom of your dowel. Next, arrange the dowel over 1 of the drill holes, then press it into place for several seconds. Repeat this glueing and pressing process with the other 2 dowels.About half of your stool should be constructed at this point."
        },
        {
          "headline":"Funnel in ½ cup (150 g) of salt into the spout.",
          "description":"Pour at least ½ cup (150 g) of white salt or sand (191 g) through a funnel into the bottom section of your hourglass. Note that every ½ cup of sand or salt is equal to 1 minute of time in the physical hourglass.If you don’t have sand or salt on hand, you can purchase it at a craft or grocery store, respectively. Salt can provide a lighter contrast to the bright paint color of your stool. When interacting with young children, try to keep the minutes of timeout equal to their age. For instance, if you’re dealing with in a 2-year-old, consider adding 1 cup (300 g) of salt into the stool, which will take 2 minutes to funnel through the hourglass."
        },
        {
          "headline":"Secure the top wooden base to the dowels and hourglass with wood glue.",
          "description":"Squeeze another dot of glue onto the center of each dowel. Additionally, add a thin ring of glue around the small wooden circle attached to the base. After applying the glue, position the base over the dowels and open hourglass spout, then press it into place for several seconds.The glue provides an extra layer of stability to your stool. This only applies to the top portion of the stool."
        },
        {
          "headline":"Screw 6 screws into the base of each dowel after the glue dries.",
          "description":"Read the instructions on the wood glue to see how long the product takes to air-dry. Once the adhesive has hardened, drill 1 screw into the base of each dowel. After the screws are in place, you can use your timeout stool whenever you’d like!"
        }
      ]
    }
  ],
  "text":" Cutting the Stool’s Base Sketch 2 identical 11 in (28 cm) circles on a 1 in (2.5 cm) thick plank. Arrange a large, 1 in (2.5 cm) thick slab of wood on a flat work surface. Attach a pencil to a compass, then arrange the device in the center of the wood. Rotate the compass in a complete circle so a circular sketch is visible on the wood’s surface. Before you continue, use the compass to draw a second, separate circle.These circles will serve as the top and bottom of your hourglass. Plywood is a great option for this part of the project. Ideally, use a plank that’s at least 1 ft (0.30 m) long and 2 ft (0.61 m) wide. Cut out both circles using a jigsaw to form the bases of the stool. Position about ⅓ of the plank off of your flat workspace, so you can cut out the circles. Place the edge of this plank in between a vise, then tighten the clamp into place. Next, use a jigsaw to cut around the circular sketch in the wood. Once you’ve successfully cut out 1 circle, reposition the plank so you can cut out the second shape. Clamp the wood into place again, then cut out the second circle with the jigsaw.Don’t worry if your cutting job isn’t exact. You can always make adjustments later! If you don’t have hardware tools on hand, try purchasing 2 pre-cut, 11 to 12 in (28 to 30 cm) wide wooden circles from a hardware or home improvement store. Smooth away any splinters or imperfections with coarse sandpaper. Take a coarse, 40- or 60-grit piece of sandpaper and work around the curved edges of each base piece. If you notice any rough or uneven edges, focus on those areas first. Continue sanding around both wooden circles until they’re both free of splinters and rough spots.If you don’t need to do any extensive sanding to your wooden pieces, try using a smoother, higher-grit sandpaper instead. Building the Hourglass Cut 2 soda bottles in half lengthwise to serve as the hourglass. Draw circular lines around the middle of two 2 L (68  fl oz) bottles. Next, use a pair of scissors to cut around this line, dividing both bottles in half. Once you’re finished cutting, set aside the 2 spout pieces, as these are what you’ll use to make your stool.Consider rinsing out and air-drying the bottles before using them to make a stool. Hot glue the tops of 2 bottle caps together to connect the soda bottles. Locate both of the caps that were used for the old soda bottles. To connect the 2 caps together, apply a small ring of hot glue on the outer surface of 1 cap. Next, press the other cap onto the hot glue for several seconds. Once you stop pressing both items together, hold the caps in 1 hand to ensure that the glue is dry.These caps will help connect and support the center of the “hourglass.”\nHot glue dries within a few seconds, so be sure to apply and use it quickly. Drill a ¼ in (0.6 cm) wide hole through the bottle caps. Attach a thin drill bit into your electric tool to create a smaller hole, which allows the sand or salt to travel smoothly between both halves of the hourglass. Next, drill in the center of these glued caps, applying enough pressure so the drill bit creates a hole through the center of the plastic.You don’t want the hole to be too big, or else the sand will pour too quickly. Wear safety glasses and a face mask as a precaution whenever you work with power tools. Screw the bottle-nosed halves of the cut bottles onto the glued caps. First, arrange the narrow end of each bottle onto the connector by rotating each bottle-nose clockwise. Once the soda bottles are connected, double-check the spouts to ensure that they’re tightly attached.If the soda bottles are too loose, then the sand might not flow through them correctly. Make sure that the hot glue is dry before you drill into the caps. Sketch 2 wooden circles that fit snugly into the soda bottle base. Take a thinner, ½ in (1.2 cm) plank of wood and clamp it to your work area with a table vise. Arrange the wider end of your soda bottle spout on the plank, then sketch around it in pencil. After drawing 2 circles onto the wood surface, use a jigsaw to cut out the shapes.Plywood is a good option for this. Be sure to trace the wider end of the bottle instead of the spout. Sand the edges of the smaller circles with medium-grit sandpaper. Use a piece, block, or circle of sandpaper to work away any splinters or uneven edges from the outer rims of each circle. As you sand, arrange the wide end of your bottle spout over the circle to ensure that it fits snugly. Continue sanding both circles with short, even motions until the edges are completely smooth.The wood needs to fit inside the wider end of the bottle. This part of the process ensures that the hourglass will be sturdy once it’s attached to the larger bases. Attach 1 circle to the center of each wooden base with wood glue. Before glueing anything into place, arrange each circle in the middle of a larger wooden base. Once you’ve centered the circle, extend a tape measure from the outer rim of the base circle to the edge of the small, central circle. Perform this measurement from all edges of the base to make sure that the wooden circle is centered. Next, apply a circle of wood glue around this central area, then press the smaller wooden circle into place for several seconds.Both wooden pieces need to be centered for the stool to function correctly. Read the glue’s label to see how much time it needs to fully dry. Decorating and Assembling the Finished Product Saw 3 dowels to provide structure for your stool. Use a tape measure to calculate the approximate height of your plastic hourglass. Keeping this measurement in mind, trim the height of your 3 dowels to match your bottle hourglass. Since the dowels aren’t especially thick, you can use a handsaw for this part of the process.Use 1 hand or a table clamp to hold the dowels in place while using your opposite hand to maneuver the handsaw. Spray paint 1 side of the circles and dowels in the color of your choice. Arrange a piece of newspaper or drop cloths in an outdoor or well-ventilated area. Place your 2 wooden circles and 3 wooden, 1⅛ in (2.9 cm) thick dowels on this surface. Spray an even coat of paint over all 5 wooden pieces until they’re all completely covered.Before you start painting, slide on a face mask or respirator to prevent you from inhaling any paint particles. Wait for the wooden pieces to dry completely. Read the instructions on the spray can to see how much time your paint needs to dry completely. Wait several hours, or whatever amount of time is specified in the directions. During this time, don’t touch or move the wooden dowels or circles.You won’t be able to paint all sides of the wooden pieces. Instead, you’ll have to wait for them to dry fully. Paint the opposite, unpainted sides of the wooden items. Flip or rotate the wooden pieces so you can spray paint the opposite sides of the circles and dowels. As you work, apply a thick, even coat of paint over the dowels and circles. Let these wooden pieces dry completely before moving them to your workspace.Make sure there’s no rain in the forecast if you plan on spray painting your items outside. Glue the hourglass to the base wooden piece. Apply a thin stream of wood glue around the border of the small, central circle. Next, arrange 1 end of the spout over the ring of wood glue. To secure this half of the hourglass, hold it in place for several seconds.Don’t glue the other half of the hourglass into place yet. The wide, cut end of the plastic bottle needs to fit snugly around the small wooden circle. Pre-drill 3 holes into the circular wooden base. Measure around the large, wooden base to find suitable placements for your wooden dowels. Lightly mark where each dowel will go, checking that all 3 points are equidistant from one another. Next, drill into these marked areas, so you can keep track of where the dowels are supposed to go.You’ll be using both screws and glue to secure the dowels in place on the stool. Use wood glue to attach the dowels to the base. Squeeze out a bead of glue on the bottom of your dowel. Next, arrange the dowel over 1 of the drill holes, then press it into place for several seconds. Repeat this glueing and pressing process with the other 2 dowels.About half of your stool should be constructed at this point. Funnel in ½ cup (150 g) of salt into the spout. Pour at least ½ cup (150 g) of white salt or sand (191 g) through a funnel into the bottom section of your hourglass. Note that every ½ cup of sand or salt is equal to 1 minute of time in the physical hourglass.If you don’t have sand or salt on hand, you can purchase it at a craft or grocery store, respectively. Salt can provide a lighter contrast to the bright paint color of your stool. When interacting with young children, try to keep the minutes of timeout equal to their age. For instance, if you’re dealing with in a 2-year-old, consider adding 1 cup (300 g) of salt into the stool, which will take 2 minutes to funnel through the hourglass. Secure the top wooden base to the dowels and hourglass with wood glue. Squeeze another dot of glue onto the center of each dowel. Additionally, add a thin ring of glue around the small wooden circle attached to the base. After applying the glue, position the base over the dowels and open hourglass spout, then press it into place for several seconds.The glue provides an extra layer of stability to your stool. This only applies to the top portion of the stool. Screw 6 screws into the base of each dowel after the glue dries. Read the instructions on the wood glue to see how long the product takes to air-dry. Once the adhesive has hardened, drill 1 screw into the base of each dowel. After the screws are in place, you can use your timeout stool whenever you’d like!",
  "sentences":[
    " Cutting the Stool’s Base Sketch 2 identical 11 in (28 cm) circles on a 1 in (2.5 cm) thick plank.",
    "Arrange a large, 1 in (2.5 cm) thick slab of wood on a flat work surface.",
    "Attach a pencil to a compass, then arrange the device in the center of the wood.",
    "Rotate the compass in a complete circle so a circular sketch is visible on the wood’s surface.",
    "Before you continue, use the compass to draw a second, separate circle.These circles will serve as the top and bottom of your hourglass.",
    "Plywood is a great option for this part of the project.",
    "Ideally, use a plank that’s at least 1 ft (0.30 m) long and 2 ft (0.61 m) wide.",
    "Cut out both circles using a jigsaw to form the bases of the stool.",
    "Position about ⅓ of the plank off of your flat workspace, so you can cut out the circles.",
    "Place the edge of this plank in between a vise, then tighten the clamp into place.",
    "Next, use a jigsaw to cut around the circular sketch in the wood.",
    "Once you’ve successfully cut out 1 circle, reposition the plank so you can cut out the second shape.",
    "Clamp the wood into place again, then cut out the second circle with the jigsaw.Don’t worry if your cutting job isn’t exact.",
    "You can always make adjustments later!",
    "If you don’t have hardware tools on hand, try purchasing 2 pre-cut, 11 to 12 in (28 to 30 cm) wide wooden circles from a hardware or home improvement store.",
    "Smooth away any splinters or imperfections with coarse sandpaper.",
    "Take a coarse, 40- or 60-grit piece of sandpaper and work around the curved edges of each base piece.",
    "If you notice any rough or uneven edges, focus on those areas first.",
    "Continue sanding around both wooden circles until they’re both free of splinters and rough spots.If you don’t need to do any extensive sanding to your wooden pieces, try using a smoother, higher-grit sandpaper instead.",
    "Building the Hourglass Cut 2 soda bottles in half lengthwise to serve as the hourglass.",
    "Draw circular lines around the middle of two 2 L (68  fl oz) bottles.",
    "Next, use a pair of scissors to cut around this line, dividing both bottles in half.",
    "Once you’re finished cutting, set aside the 2 spout pieces, as these are what you’ll use to make your stool.Consider rinsing out and air-drying the bottles before using them to make a stool.",
    "Hot glue the tops of 2 bottle caps together to connect the soda bottles.",
    "Locate both of the caps that were used for the old soda bottles.",
    "To connect the 2 caps together, apply a small ring of hot glue on the outer surface of 1 cap.",
    "Next, press the other cap onto the hot glue for several seconds.",
    "Once you stop pressing both items together, hold the caps in 1 hand to ensure that the glue is dry.These caps will help connect and support the center of the “hourglass.”\nHot glue dries within a few seconds, so be sure to apply and use it quickly.",
    "Drill a ¼ in (0.6 cm) wide hole through the bottle caps.",
    "Attach a thin drill bit into your electric tool to create a smaller hole, which allows the sand or salt to travel smoothly between both halves of the hourglass.",
    "Next, drill in the center of these glued caps, applying enough pressure so the drill bit creates a hole through the center of the plastic.You don’t want the hole to be too big, or else the sand will pour too quickly.",
    "Wear safety glasses and a face mask as a precaution whenever you work with power tools.",
    "Screw the bottle-nosed halves of the cut bottles onto the glued caps.",
    "First, arrange the narrow end of each bottle onto the connector by rotating each bottle-nose clockwise.",
    "Once the soda bottles are connected, double-check the spouts to ensure that they’re tightly attached.If the soda bottles are too loose, then the sand might not flow through them correctly.",
    "Make sure that the hot glue is dry before you drill into the caps.",
    "Sketch 2 wooden circles that fit snugly into the soda bottle base.",
    "Take a thinner, ½ in (1.2 cm) plank of wood and clamp it to your work area with a table vise.",
    "Arrange the wider end of your soda bottle spout on the plank, then sketch around it in pencil.",
    "After drawing 2 circles onto the wood surface, use a jigsaw to cut out the shapes.Plywood is a good option for this.",
    "Be sure to trace the wider end of the bottle instead of the spout.",
    "Sand the edges of the smaller circles with medium-grit sandpaper.",
    "Use a piece, block, or circle of sandpaper to work away any splinters or uneven edges from the outer rims of each circle.",
    "As you sand, arrange the wide end of your bottle spout over the circle to ensure that it fits snugly.",
    "Continue sanding both circles with short, even motions until the edges are completely smooth.The wood needs to fit inside the wider end of the bottle.",
    "This part of the process ensures that the hourglass will be sturdy once it’s attached to the larger bases.",
    "Attach 1 circle to the center of each wooden base with wood glue.",
    "Before glueing anything into place, arrange each circle in the middle of a larger wooden base.",
    "Once you’ve centered the circle, extend a tape measure from the outer rim of the base circle to the edge of the small, central circle.",
    "Perform this measurement from all edges of the base to make sure that the wooden circle is centered.",
    "Next, apply a circle of wood glue around this central area, then press the smaller wooden circle into place for several seconds.Both wooden pieces need to be centered for the stool to function correctly.",
    "Read the glue’s label to see how much time it needs to fully dry.",
    "Decorating and Assembling the Finished Product Saw 3 dowels to provide structure for your stool.",
    "Use a tape measure to calculate the approximate height of your plastic hourglass.",
    "Keeping this measurement in mind, trim the height of your 3 dowels to match your bottle hourglass.",
    "Since the dowels aren’t especially thick, you can use a handsaw for this part of the process.Use 1 hand or a table clamp to hold the dowels in place while using your opposite hand to maneuver the handsaw.",
    "Spray paint 1 side of the circles and dowels in the color of your choice.",
    "Arrange a piece of newspaper or drop cloths in an outdoor or well-ventilated area.",
    "Place your 2 wooden circles and 3 wooden, 1⅛ in (2.9 cm) thick dowels on this surface.",
    "Spray an even coat of paint over all 5 wooden pieces until they’re all completely covered.Before you start painting, slide on a face mask or respirator to prevent you from inhaling any paint particles.",
    "Wait for the wooden pieces to dry completely.",
    "Read the instructions on the spray can to see how much time your paint needs to dry completely.",
    "Wait several hours, or whatever amount of time is specified in the directions.",
    "During this time, don’t touch or move the wooden dowels or circles.You won’t be able to paint all sides of the wooden pieces.",
    "Instead, you’ll have to wait for them to dry fully.",
    "Paint the opposite, unpainted sides of the wooden items.",
    "Flip or rotate the wooden pieces so you can spray paint the opposite sides of the circles and dowels.",
    "As you work, apply a thick, even coat of paint over the dowels and circles.",
    "Let these wooden pieces dry completely before moving them to your workspace.Make sure there’s no rain in the forecast if you plan on spray painting your items outside.",
    "Glue the hourglass to the base wooden piece.",
    "Apply a thin stream of wood glue around the border of the small, central circle.",
    "Next, arrange 1 end of the spout over the ring of wood glue.",
    "To secure this half of the hourglass, hold it in place for several seconds.Don’t glue the other half of the hourglass into place yet.",
    "The wide, cut end of the plastic bottle needs to fit snugly around the small wooden circle.",
    "Pre-drill 3 holes into the circular wooden base.",
    "Measure around the large, wooden base to find suitable placements for your wooden dowels.",
    "Lightly mark where each dowel will go, checking that all 3 points are equidistant from one another.",
    "Next, drill into these marked areas, so you can keep track of where the dowels are supposed to go.You’ll be using both screws and glue to secure the dowels in place on the stool.",
    "Use wood glue to attach the dowels to the base.",
    "Squeeze out a bead of glue on the bottom of your dowel.",
    "Next, arrange the dowel over 1 of the drill holes, then press it into place for several seconds.",
    "Repeat this glueing and pressing process with the other 2 dowels.About half of your stool should be constructed at this point.",
    "Funnel in ½ cup (150 g) of salt into the spout.",
    "Pour at least ½ cup (150 g) of white salt or sand (191 g) through a funnel into the bottom section of your hourglass.",
    "Note that every ½ cup of sand or salt is equal to 1 minute of time in the physical hourglass.If you don’t have sand or salt on hand, you can purchase it at a craft or grocery store, respectively.",
    "Salt can provide a lighter contrast to the bright paint color of your stool.",
    "When interacting with young children, try to keep the minutes of timeout equal to their age.",
    "For instance, if you’re dealing with in a 2-year-old, consider adding 1 cup (300 g) of salt into the stool, which will take 2 minutes to funnel through the hourglass.",
    "Secure the top wooden base to the dowels and hourglass with wood glue.",
    "Squeeze another dot of glue onto the center of each dowel.",
    "Additionally, add a thin ring of glue around the small wooden circle attached to the base.",
    "After applying the glue, position the base over the dowels and open hourglass spout, then press it into place for several seconds.The glue provides an extra layer of stability to your stool.",
    "This only applies to the top portion of the stool.",
    "Screw 6 screws into the base of each dowel after the glue dries.",
    "Read the instructions on the wood glue to see how long the product takes to air-dry.",
    "Once the adhesive has hardened, drill 1 screw into the base of each dowel.",
    "After the screws are in place, you can use your timeout stool whenever you’d like!"
  ],
  "tyn_section":[
    "1 in (2.5 cm) thick wood panel",
    "½ in (1.2 cm) thick wood panel",
    "3 wood dowels, 1⅛ in (2.9 cm) thick",
    "Table with vise or clamp",
    "Compass",
    "Wood glue",
    "Pencil",
    "2 large soda bottles, 2 litres (68  fl oz)",
    "Sand",
    "Jigsaw",
    "Medium-grit sandpaper",
    "Salt",
    "Spray paint",
    "Face mask"
  ],
  "tyn_model":[
    "glue",
    "hourglass",
    "wood glue",
    "sand",
    "salt",
    "soda bottles",
    "hot glue",
    "paint",
    "plank",
    "jigsaw",
    "sandpaper",
    "compass",
    "pencil",
    "drill bit",
    "drill",
    "soda bottle",
    "tape measure",
    "plywood",
    "stool",
    "⅓ of",
    "scissors",
    "“hourglass",
    "”\n",
    "bottle caps",
    "electric tool",
    "power tools",
    "table vise",
    "medium-grit sandpaper",
    "bottle spout",
    "plastic hourglass",
    "bottle hourglass",
    "drop cloths",
    "face mask",
    "spray can",
    "spray paint",
    "spray painting",
    "plastic bottle",
    "screws",
    "drill holes",
    "white salt",
    "funnel",
    "hourglass spout",
    "timeout stool"
  ],
  "simple_metrics":{
    "r":0.6428571429,
    "p":0.2093023256,
    "f1":0.3157894737,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6428571429,
    "p":0.3023255814,
    "f1":0.4112478032
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.3953488372,
    "f1":0.5089820359
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6428571429,
    "p":0.2093023256,
    "f1":0.3157894737
  }
}