{
  "title":"How to Fix a Gap Between the Floor and the Wall",
  "url":"https://www.wikihow.com/Fix-a-Gap-Between-the-Floor-and-the-Wall",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs"
  ],
  "parts":[
    {
      "name":"Cleaning the Gap",
      "steps":[
        {
          "headline":"Scrape off any old caulk from the gap, if necessary.",
          "description":"If there’s any old or cracked caulk along the gap, take a utility knife or a putty knife and run the edge along it to scrape it off. Be careful not to strip or chip the paint on the walls. Continue scraping until all of the old caulk is removed.Tip: Use 180-grit sandpaper to scrub off any stubborn bits of caulk."
        },
        {
          "headline":"Vacuum any dust and dirt from inside of the gap.",
          "description":"Use the hose extension on a vacuum cleaner and insert the tip into the gap. Vacuum all along the gap to suck up any dust, dirt, debris, and pieces of caulk that may be there. Dirt and other contaminants will affect how well you can seal the gap, so work the hose attachment around it to remove as much as you can. If you don’t have a vacuum or a hose attachment, use a damp cloth to scrub dirt and debris out of the gap."
        },
        {
          "headline":"Scrub the gap with rubbing alcohol to sanitize it.",
          "description":"Fill a bowl with rubbing alcohol and dip a clean sponge, dip a clean sponge or cloth into it, and wring out the excess. Scrub the top and bottom of the gap to remove any loose debris, dirt, and stains, as well as to sanitize the area so mold doesn’t form when you seal it. Rubbing alcohol can irritate your eyes and sinuses if you breathe in the fumes directly, so be sure to work in a well-ventilated area. If you don’t have rubbing alcohol, you can mix equal parts water and bleach as an alternative cleaning solution."
        },
        {
          "headline":"Let the area around the gap dry completely.",
          "description":"Run a clean, dry cloth over the area and wait a few hours for it to air dry. To speed up the drying process, aim a blow dryer set on low heat to dry the wall and floor near the gap. Touch the area with your finger to make sure it’s completely dry so moisture doesn’t get trapped when you seal the gap. Moisture can cause bacteria and mold to develop in the wall."
        }
      ]
    },
    {
      "name":"Loading the Caulk",
      "steps":[
        {
          "headline":"Use silicone caulk to create a waterproof seal.",
          "description":"If you’re fixing a gap between a tile floor and wall, such as in a shower or a bathroom, go with a silicone caulk so you can create an airtight, waterproof seal. Look for silicone caulk at home improvement stores, hardware stores, and online. Silicone caulk is generally clear in color. The waterproof seal will help prevent moisture from getting into your walls, which can lead to rot and mold."
        },
        {
          "headline":"Choose latex caulk if you want it to match the color of the wall.",
          "description":"If you’re fixing a gap between a floor and a painted wall, such as a bedroom or living room wall, use a latex caulk. Choose a color that closely resembles the paint of your wall so the gap isn’t noticeable. Look for latex caulk at department stores, home improvement stores, hardware stores, and online. You could also choose a latex caulk that matches the color of your floor if you prefer. Latex caulk will create a tight seal but isn’t as waterproof as silicone."
        },
        {
          "headline":"Press the release trigger and pull back the rod on the caulk gun.",
          "description":"Find the small metal trigger on the back of the handle of the caulk gun. Press the trigger and hold it down to release the steel rod. Then, pull the steel rod all the way back and release the trigger. You may need to twist the steel rod in order to lock it into place. Look for caulking guns at home improvement stores, hardware stores, and online."
        },
        {
          "headline":"Insert the caulk tube into the caulk gun with the nozzle facing away.",
          "description":"Place the base of the caulk tube in the caulk gun so it’s flush against the back. Then, rest the nozzle end into position at the front of the gun. Push the metal rod back into place so it’s pressing against the back of the caulk tube to hold it securely. Shake the caulk gun gently to make sure the caulk tube is secure."
        },
        {
          "headline":"Cut the caulk tube to make an opening the size of your gap.",
          "description":"Insert the sealed nozzle into the gap until it can’t go any further to find the width that the nozzle opening needs to be to fill it. Take a pair of scissors or a utility knife and cut the nozzle at a 45-degree angle where it made contact with both the wall and floor so it’s the size of the gap. Cutting the nozzle at an angle helps you guide the caulk into the gap is it flows out of the tube."
        },
        {
          "headline":"Push a long nail into the nozzle to pierce the seal.",
          "description":"Stick a long nail or metal rod into the nozzle end of the caulk gun and push it through the internal seal. Keep the nozzle held upright and remove the nail or rod from the nozzle. You could also use a long pin or piece of wire to penetrate the internal seal. Some caulk guns have a metal rod you can use to pierce the internal seal of the caulk tube."
        }
      ]
    },
    {
      "name":"Sealing the Gap",
      "steps":[
        {
          "headline":"Insert the tip of the caulk tube into the gap at a 45-degree angle.",
          "description":"Hold the caulk gun near the gap and tilt it so it’s angled to keep the caulk from falling straight out of the nozzle when you squeeze the trigger. Stick the tip of the nozzle into the gap so it’s flush and even with it. If you’re able to insert the tip of the nozzle more than about ⁄4 inch (0.64 cm) deep, then cut the nozzle again so the opening is wider."
        },
        {
          "headline":"Pull the trigger on the caulk gun to push the caulk out of the nozzle.",
          "description":"Once the nozzle is in position, gently pull the trigger on the caulk gun to force the caulk out of the tube and into the nozzle. Continue tapping on the trigger until the caulk starts to flow out of the tip of the nozzle. Don’t hold the trigger or too much caulk may flow out of the nozzle."
        },
        {
          "headline":"Move the tube down the gap to fill it with caulk.",
          "description":"As the caulk starts to flow out of the nozzle, keep lightly tapping on the trigger to keep the flow steady and consistent. Move the nozzle down the entire length of the gap to fill it with the caulk. Keep the flow of caulk steady and even to form a smooth and consistent seal.Tip: If too much caulk does flow out of the nozzle, immediately wipe it up with a clean cloth so it doesn’t have a chance to set."
        },
        {
          "headline":"Use a caulking tool to smooth the caulk in the gap.",
          "description":"A caulking tool is a small plastic piece with straight corners and edges and is used to smooth the caulk to form an even layer. Once you’ve filled the gap with the caulk, run the caulking tool over it to remove any excess and form the caulk into a smooth and even layer. A smooth layer of caulk will create a tighter and better seal. You can find caulking tools at home improvement stores, hardware stores, and online."
        },
        {
          "headline":"Allow the caulk to dry for 24 hours.",
          "description":"Leave the gap undisturbed for a full day so the caulk can dry and set to form a tight seal. If you fixed a gap in a bathroom or shower, don’t use the shower for a full day so the moisture won’t damage the caulk. Lightly touch the caulk with your fingers after 24 hours to make sure it’s dry. If the caulk still isn’t dry, wait another 12 hours."
        }
      ]
    },
    {
      "name":"Identifying the Underlying Problem",
      "steps":[
        {
          "headline":"Look for sloped or uneven floors for signs of foundation settlement.",
          "description":"Check your the floor near the gap and look to see if it’s sloped or uneven. Sloped floors are a sign that the building’s foundation is settling and the structure is uneven. If your floors are uneven, contact a licensed building inspector to check the foundation and offer potential solutions. The inspector may tell you that you need to hire a contractor to repair your foundation. Problems with the foundation could lead to serious structural damage if it’s not repaired. Look online for building inspectors in your area."
        },
        {
          "headline":"Check the floor joists in your crawl space for moisture damage or rot.",
          "description":"Locate the building’s crawlspace and look to see if there are wooden floor joists beneath the walls of the structure. If there are, look for cracks, splinters, and signs that the wood is damaged or rotting. Contact a building inspector to view the joists if you believe that they are damaged. Damaged floor joists can cause the floor to move, which can create a gap between the floor and the wall above it. Look online for a building inspector you can hire to check your floor joists if you find signs of damage."
        },
        {
          "headline":"Examine your walls for tiny pin holes caused by termites.",
          "description":"Termites can eat through the walls and support structures of your home, causing it to settle and create gaps between the floors and walls. Look for small holes in your walls, a sure sign that you have a termite infestation. Contact a licensed exterminator as soon as possible to take care of the problem. Other signs of termites include discolored or drooping drywall, buckling floor boards, and crumbling or damaged wood. Call a local exterminator to investigate your home if you believe you have a termite infestation."
        }
      ]
    }
  ],
  "text":" Cleaning the Gap Scrape off any old caulk from the gap, if necessary. If there’s any old or cracked caulk along the gap, take a utility knife or a putty knife and run the edge along it to scrape it off. Be careful not to strip or chip the paint on the walls. Continue scraping until all of the old caulk is removed.Tip: Use 180-grit sandpaper to scrub off any stubborn bits of caulk. Vacuum any dust and dirt from inside of the gap. Use the hose extension on a vacuum cleaner and insert the tip into the gap. Vacuum all along the gap to suck up any dust, dirt, debris, and pieces of caulk that may be there. Dirt and other contaminants will affect how well you can seal the gap, so work the hose attachment around it to remove as much as you can. If you don’t have a vacuum or a hose attachment, use a damp cloth to scrub dirt and debris out of the gap. Scrub the gap with rubbing alcohol to sanitize it. Fill a bowl with rubbing alcohol and dip a clean sponge, dip a clean sponge or cloth into it, and wring out the excess. Scrub the top and bottom of the gap to remove any loose debris, dirt, and stains, as well as to sanitize the area so mold doesn’t form when you seal it. Rubbing alcohol can irritate your eyes and sinuses if you breathe in the fumes directly, so be sure to work in a well-ventilated area. If you don’t have rubbing alcohol, you can mix equal parts water and bleach as an alternative cleaning solution. Let the area around the gap dry completely. Run a clean, dry cloth over the area and wait a few hours for it to air dry. To speed up the drying process, aim a blow dryer set on low heat to dry the wall and floor near the gap. Touch the area with your finger to make sure it’s completely dry so moisture doesn’t get trapped when you seal the gap. Moisture can cause bacteria and mold to develop in the wall. Loading the Caulk Use silicone caulk to create a waterproof seal. If you’re fixing a gap between a tile floor and wall, such as in a shower or a bathroom, go with a silicone caulk so you can create an airtight, waterproof seal. Look for silicone caulk at home improvement stores, hardware stores, and online. Silicone caulk is generally clear in color. The waterproof seal will help prevent moisture from getting into your walls, which can lead to rot and mold. Choose latex caulk if you want it to match the color of the wall. If you’re fixing a gap between a floor and a painted wall, such as a bedroom or living room wall, use a latex caulk. Choose a color that closely resembles the paint of your wall so the gap isn’t noticeable. Look for latex caulk at department stores, home improvement stores, hardware stores, and online. You could also choose a latex caulk that matches the color of your floor if you prefer. Latex caulk will create a tight seal but isn’t as waterproof as silicone. Press the release trigger and pull back the rod on the caulk gun. Find the small metal trigger on the back of the handle of the caulk gun. Press the trigger and hold it down to release the steel rod. Then, pull the steel rod all the way back and release the trigger. You may need to twist the steel rod in order to lock it into place. Look for caulking guns at home improvement stores, hardware stores, and online. Insert the caulk tube into the caulk gun with the nozzle facing away. Place the base of the caulk tube in the caulk gun so it’s flush against the back. Then, rest the nozzle end into position at the front of the gun. Push the metal rod back into place so it’s pressing against the back of the caulk tube to hold it securely. Shake the caulk gun gently to make sure the caulk tube is secure. Cut the caulk tube to make an opening the size of your gap. Insert the sealed nozzle into the gap until it can’t go any further to find the width that the nozzle opening needs to be to fill it. Take a pair of scissors or a utility knife and cut the nozzle at a 45-degree angle where it made contact with both the wall and floor so it’s the size of the gap. Cutting the nozzle at an angle helps you guide the caulk into the gap is it flows out of the tube. Push a long nail into the nozzle to pierce the seal. Stick a long nail or metal rod into the nozzle end of the caulk gun and push it through the internal seal. Keep the nozzle held upright and remove the nail or rod from the nozzle. You could also use a long pin or piece of wire to penetrate the internal seal. Some caulk guns have a metal rod you can use to pierce the internal seal of the caulk tube. Sealing the Gap Insert the tip of the caulk tube into the gap at a 45-degree angle. Hold the caulk gun near the gap and tilt it so it’s angled to keep the caulk from falling straight out of the nozzle when you squeeze the trigger. Stick the tip of the nozzle into the gap so it’s flush and even with it. If you’re able to insert the tip of the nozzle more than about ⁄4 inch (0.64 cm) deep, then cut the nozzle again so the opening is wider. Pull the trigger on the caulk gun to push the caulk out of the nozzle. Once the nozzle is in position, gently pull the trigger on the caulk gun to force the caulk out of the tube and into the nozzle. Continue tapping on the trigger until the caulk starts to flow out of the tip of the nozzle. Don’t hold the trigger or too much caulk may flow out of the nozzle. Move the tube down the gap to fill it with caulk. As the caulk starts to flow out of the nozzle, keep lightly tapping on the trigger to keep the flow steady and consistent. Move the nozzle down the entire length of the gap to fill it with the caulk. Keep the flow of caulk steady and even to form a smooth and consistent seal.Tip: If too much caulk does flow out of the nozzle, immediately wipe it up with a clean cloth so it doesn’t have a chance to set. Use a caulking tool to smooth the caulk in the gap. A caulking tool is a small plastic piece with straight corners and edges and is used to smooth the caulk to form an even layer. Once you’ve filled the gap with the caulk, run the caulking tool over it to remove any excess and form the caulk into a smooth and even layer. A smooth layer of caulk will create a tighter and better seal. You can find caulking tools at home improvement stores, hardware stores, and online. Allow the caulk to dry for 24 hours. Leave the gap undisturbed for a full day so the caulk can dry and set to form a tight seal. If you fixed a gap in a bathroom or shower, don’t use the shower for a full day so the moisture won’t damage the caulk. Lightly touch the caulk with your fingers after 24 hours to make sure it’s dry. If the caulk still isn’t dry, wait another 12 hours. Identifying the Underlying Problem Look for sloped or uneven floors for signs of foundation settlement. Check your the floor near the gap and look to see if it’s sloped or uneven. Sloped floors are a sign that the building’s foundation is settling and the structure is uneven. If your floors are uneven, contact a licensed building inspector to check the foundation and offer potential solutions. The inspector may tell you that you need to hire a contractor to repair your foundation. Problems with the foundation could lead to serious structural damage if it’s not repaired. Look online for building inspectors in your area. Check the floor joists in your crawl space for moisture damage or rot. Locate the building’s crawlspace and look to see if there are wooden floor joists beneath the walls of the structure. If there are, look for cracks, splinters, and signs that the wood is damaged or rotting. Contact a building inspector to view the joists if you believe that they are damaged. Damaged floor joists can cause the floor to move, which can create a gap between the floor and the wall above it. Look online for a building inspector you can hire to check your floor joists if you find signs of damage. Examine your walls for tiny pin holes caused by termites. Termites can eat through the walls and support structures of your home, causing it to settle and create gaps between the floors and walls. Look for small holes in your walls, a sure sign that you have a termite infestation. Contact a licensed exterminator as soon as possible to take care of the problem. Other signs of termites include discolored or drooping drywall, buckling floor boards, and crumbling or damaged wood. Call a local exterminator to investigate your home if you believe you have a termite infestation.",
  "sentences":[
    " Cleaning the Gap Scrape off any old caulk from the gap, if necessary.",
    "If there’s any old or cracked caulk along the gap, take a utility knife or a putty knife and run the edge along it to scrape it off.",
    "Be careful not to strip or chip the paint on the walls.",
    "Continue scraping until all of the old caulk is removed.Tip: Use 180-grit sandpaper to scrub off any stubborn bits of caulk.",
    "Vacuum any dust and dirt from inside of the gap.",
    "Use the hose extension on a vacuum cleaner and insert the tip into the gap.",
    "Vacuum all along the gap to suck up any dust, dirt, debris, and pieces of caulk that may be there.",
    "Dirt and other contaminants will affect how well you can seal the gap, so work the hose attachment around it to remove as much as you can.",
    "If you don’t have a vacuum or a hose attachment, use a damp cloth to scrub dirt and debris out of the gap.",
    "Scrub the gap with rubbing alcohol to sanitize it.",
    "Fill a bowl with rubbing alcohol and dip a clean sponge, dip a clean sponge or cloth into it, and wring out the excess.",
    "Scrub the top and bottom of the gap to remove any loose debris, dirt, and stains, as well as to sanitize the area so mold doesn’t form when you seal it.",
    "Rubbing alcohol can irritate your eyes and sinuses if you breathe in the fumes directly, so be sure to work in a well-ventilated area.",
    "If you don’t have rubbing alcohol, you can mix equal parts water and bleach as an alternative cleaning solution.",
    "Let the area around the gap dry completely.",
    "Run a clean, dry cloth over the area and wait a few hours for it to air dry.",
    "To speed up the drying process, aim a blow dryer set on low heat to dry the wall and floor near the gap.",
    "Touch the area with your finger to make sure it’s completely dry so moisture doesn’t get trapped when you seal the gap.",
    "Moisture can cause bacteria and mold to develop in the wall.",
    "Loading the Caulk Use silicone caulk to create a waterproof seal.",
    "If you’re fixing a gap between a tile floor and wall, such as in a shower or a bathroom, go with a silicone caulk so you can create an airtight, waterproof seal.",
    "Look for silicone caulk at home improvement stores, hardware stores, and online.",
    "Silicone caulk is generally clear in color.",
    "The waterproof seal will help prevent moisture from getting into your walls, which can lead to rot and mold.",
    "Choose latex caulk if you want it to match the color of the wall.",
    "If you’re fixing a gap between a floor and a painted wall, such as a bedroom or living room wall, use a latex caulk.",
    "Choose a color that closely resembles the paint of your wall so the gap isn’t noticeable.",
    "Look for latex caulk at department stores, home improvement stores, hardware stores, and online.",
    "You could also choose a latex caulk that matches the color of your floor if you prefer.",
    "Latex caulk will create a tight seal but isn’t as waterproof as silicone.",
    "Press the release trigger and pull back the rod on the caulk gun.",
    "Find the small metal trigger on the back of the handle of the caulk gun.",
    "Press the trigger and hold it down to release the steel rod.",
    "Then, pull the steel rod all the way back and release the trigger.",
    "You may need to twist the steel rod in order to lock it into place.",
    "Look for caulking guns at home improvement stores, hardware stores, and online.",
    "Insert the caulk tube into the caulk gun with the nozzle facing away.",
    "Place the base of the caulk tube in the caulk gun so it’s flush against the back.",
    "Then, rest the nozzle end into position at the front of the gun.",
    "Push the metal rod back into place so it’s pressing against the back of the caulk tube to hold it securely.",
    "Shake the caulk gun gently to make sure the caulk tube is secure.",
    "Cut the caulk tube to make an opening the size of your gap.",
    "Insert the sealed nozzle into the gap until it can’t go any further to find the width that the nozzle opening needs to be to fill it.",
    "Take a pair of scissors or a utility knife and cut the nozzle at a 45-degree angle where it made contact with both the wall and floor so it’s the size of the gap.",
    "Cutting the nozzle at an angle helps you guide the caulk into the gap is it flows out of the tube.",
    "Push a long nail into the nozzle to pierce the seal.",
    "Stick a long nail or metal rod into the nozzle end of the caulk gun and push it through the internal seal.",
    "Keep the nozzle held upright and remove the nail or rod from the nozzle.",
    "You could also use a long pin or piece of wire to penetrate the internal seal.",
    "Some caulk guns have a metal rod you can use to pierce the internal seal of the caulk tube.",
    "Sealing the Gap Insert the tip of the caulk tube into the gap at a 45-degree angle.",
    "Hold the caulk gun near the gap and tilt it so it’s angled to keep the caulk from falling straight out of the nozzle when you squeeze the trigger.",
    "Stick the tip of the nozzle into the gap so it’s flush and even with it.",
    "If you’re able to insert the tip of the nozzle more than about ⁄4 inch (0.64 cm) deep, then cut the nozzle again so the opening is wider.",
    "Pull the trigger on the caulk gun to push the caulk out of the nozzle.",
    "Once the nozzle is in position, gently pull the trigger on the caulk gun to force the caulk out of the tube and into the nozzle.",
    "Continue tapping on the trigger until the caulk starts to flow out of the tip of the nozzle.",
    "Don’t hold the trigger or too much caulk may flow out of the nozzle.",
    "Move the tube down the gap to fill it with caulk.",
    "As the caulk starts to flow out of the nozzle, keep lightly tapping on the trigger to keep the flow steady and consistent.",
    "Move the nozzle down the entire length of the gap to fill it with the caulk.",
    "Keep the flow of caulk steady and even to form a smooth and consistent seal.Tip: If too much caulk does flow out of the nozzle, immediately wipe it up with a clean cloth so it doesn’t have a chance to set.",
    "Use a caulking tool to smooth the caulk in the gap.",
    "A caulking tool is a small plastic piece with straight corners and edges and is used to smooth the caulk to form an even layer.",
    "Once you’ve filled the gap with the caulk, run the caulking tool over it to remove any excess and form the caulk into a smooth and even layer.",
    "A smooth layer of caulk will create a tighter and better seal.",
    "You can find caulking tools at home improvement stores, hardware stores, and online.",
    "Allow the caulk to dry for 24 hours.",
    "Leave the gap undisturbed for a full day so the caulk can dry and set to form a tight seal.",
    "If you fixed a gap in a bathroom or shower, don’t use the shower for a full day so the moisture won’t damage the caulk.",
    "Lightly touch the caulk with your fingers after 24 hours to make sure it’s dry.",
    "If the caulk still isn’t dry, wait another 12 hours.",
    "Identifying the Underlying Problem Look for sloped or uneven floors for signs of foundation settlement.",
    "Check your the floor near the gap and look to see if it’s sloped or uneven.",
    "Sloped floors are a sign that the building’s foundation is settling and the structure is uneven.",
    "If your floors are uneven, contact a licensed building inspector to check the foundation and offer potential solutions.",
    "The inspector may tell you that you need to hire a contractor to repair your foundation.",
    "Problems with the foundation could lead to serious structural damage if it’s not repaired.",
    "Look online for building inspectors in your area.",
    "Check the floor joists in your crawl space for moisture damage or rot.",
    "Locate the building’s crawlspace and look to see if there are wooden floor joists beneath the walls of the structure.",
    "If there are, look for cracks, splinters, and signs that the wood is damaged or rotting.",
    "Contact a building inspector to view the joists if you believe that they are damaged.",
    "Damaged floor joists can cause the floor to move, which can create a gap between the floor and the wall above it.",
    "Look online for a building inspector you can hire to check your floor joists if you find signs of damage.",
    "Examine your walls for tiny pin holes caused by termites.",
    "Termites can eat through the walls and support structures of your home, causing it to settle and create gaps between the floors and walls.",
    "Look for small holes in your walls, a sure sign that you have a termite infestation.",
    "Contact a licensed exterminator as soon as possible to take care of the problem.",
    "Other signs of termites include discolored or drooping drywall, buckling floor boards, and crumbling or damaged wood.",
    "Call a local exterminator to investigate your home if you believe you have a termite infestation."
  ],
  "tyn_section":[
    "Caulk",
    "Caulk gun",
    "Caulking tool",
    "Vacuum",
    "Rubbing alcohol",
    "Utility knife or putty knife"
  ],
  "tyn_model":[
    "caulk gun",
    "latex caulk",
    "rubbing alcohol",
    "silicone caulk",
    "caulking tool",
    "termites",
    "utility knife",
    "hose",
    "sponge",
    "nozzle",
    "building inspector",
    "putty knife",
    "180-grit sandpaper",
    "vacuum cleaner",
    "vacuum",
    "bowl",
    "bleach",
    "blow dryer",
    "caulking guns",
    "metal rod",
    "scissors",
    "caulk guns",
    "caulk",
    "cloth",
    "caulking tools",
    "building inspectors",
    "floor joists",
    "exterminator",
    "termite"
  ],
  "simple_metrics":{
    "r":0.8333333333,
    "p":0.1724137931,
    "f1":0.2857142857,
    "avg_pos":0.7586206897
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3793103448,
    "f1":0.55
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4482758621,
    "f1":0.619047619
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8333333333,
    "p":0.1724137931,
    "f1":0.2857142857
  }
}