{
  "title":"How to Care for Air Plants Indoors",
  "url":"https://www.wikihow.com/Care-for-Air-Plants-Indoors",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "methods":[
    {
      "name":"Creating the Ideal Environment",
      "steps":[
        {
          "headline":"Provide 4-6 hours of bright, indirect sunlight every day.",
          "description":"Air plants love bright light but they cannot withstand direct sunlight, which quickly burns their foliage. Place your air plant within 3–5 feet (0.91–1.52 m) of a south, east, or west-facing window to ensure it gets plenty of bright, filtered sunlight.In the Northern Hemisphere, a south-facing window will receive the most light during the day. If you live in the Southern Hemisphere, it's the opposite—a north-facing window gets more light."
        },
        {
          "headline":"Place or mount your air plant on a dry, stable surface.",
          "description":"Air plants do not grow in soil, which allows you to display them in all sorts of interesting and attractive ways. They do require a dry, stable surface that doesn't hold water, but other than that, your imagination is the limit.For example, you can place air plants on a sunny windowsill or on a bookshelf near a light source. Positioning them inside glass terrariums or globes is a popular and attractive solution. You can also mount an air plant to a surface permanently with hot glue or super glue. If you don’t want to use glue, tie the plants in place with fishing wire. Try mounting your air plant on a piece of driftwood or coral using hot glue to create a pretty display. Decide where you want to position the air plant on the chosen material, apply a small amount of hot glue to the area, and press the underside of the air plant clump into the glue. Hold the plant in place for 10-15 seconds so the glue can set."
        },
        {
          "headline":"Maintain a temperature between 50–90 °F (10–32 °C) for healthy growth.",
          "description":"Most indoor temperatures easily fall within this range, but sunny windows can get quite hot in the summertime. Similarly, temperatures near windows can drop quickly in winter. If you live in a particularly hot or cold climate, you might want to mount a thermostat near the window so you can monitor the temperature.You could also download a free app to your smartphone to monitor temperature or use a digital temperature gun to take periodic readings. Air plants are tropical and they will die if they’re exposed to temperatures lower than 45 °F (7 °C)."
        },
        {
          "headline":"Soak air plants in a basin or tub of water for 30 minutes once a week.",
          "description":"Give your air plants a thorough watering every week by placing them directly in a tub or sink filled with water. Submerge the plants and leave them for half an hour. Then, shake them gently to get rid of excess moisture and spread them upside-down on a clean towel so they can air-dry.If your mounted air plant can’t be moved, mist it heavily with water until the leaves are dripping. Letting an air plant dry upside-down allows the water to drip away from the crown of the plant. Otherwise, water might settle into the crown and cause rot. Return the plants to their designated window after they dry completely.Tip: It's best to water air plants with bottled water or filtered tap water. Avoid using distilled water, since the distillation process removes all of the nutrients."
        },
        {
          "headline":"Mist air plants between waterings to add moisture and humidity.",
          "description":"Air plants are tropical, so they enjoy plenty of heat and humidity. Put fresh water into a spray bottle and mist your air plants a little bit each day. Pay attention to your air plant’s leaves, which will curl or roll up if the plant gets dehydrated.Dehydrated leaves may also look pale green in color and feel soft to the touch. If you see curled or rolled leaves, give the plant a thorough soak and remember to keep up with daily misting. If you live in a humid climate, you can probably mist your plants every other day."
        },
        {
          "headline":"Feed air plants with Bromeliad fertilizer once a month to encourage growth.",
          "description":"Bromelaid fertilizer is a 17-8-22 fertilizer that you can buy from nurseries or online. If you don’t have access to Bromelaid fertilizer, you can use any water-soluble  houseplant fertilizer diluted to ¼ strength. Pour the fertilizer into the basin of water before a weekly watering session and submerge the plants in the water for half an hour like you normally would.Use the amount of fertilizer recommended on the packaging, but make sure you dilute it to 1/4 strength if it's a general houseplant fertilizer."
        }
      ]
    },
    {
      "name":"Pruning and Dividing Air Plants",
      "steps":[
        {
          "headline":"Pull off dry, brown leaves at the base of the plant when they appear.",
          "description":"It's completely normal for leaves at the base of an air plant to dry out and turn brown over time, especially if the plant is acclimating to a new environment. Gently grasp the brown leaves with your fingers and pry them away from the base whenever you see them."
        },
        {
          "headline":"Trim away dry, brown leaf tips with a sharp pair of scissors.",
          "description":"The tips of air plant leaves get brown and dry occasionally. Use pruning shears or scissors to cut the dried tips off at an angle so the leaves continue to have pointed ends. That way, the pruned foliage will blend naturally into the rest of the plant.Dry tips could mean that you're underwatering the air plant. Consider misting your plant more often to see if the issue resolves."
        },
        {
          "headline":"Divide air plants once they begin to reproduce to control growth.",
          "description":"Young air plants grow rather slowly. However, after 2-4 years of proper care, growth tends to accelerate rapidly. Baby shoots, also known as pups, will start appearing at the base of the plant. To control size, you can remove the pups from the mother plant and create new plants.Make sure pups are at least a third of the mother's size before removing them."
        },
        {
          "headline":"Spread the leaves gently with your fingers to isolate the pups.",
          "description":"Hold a single clump in both hands and gently work your fingers into the base of the clump, which is where the pups grow. You will be able to clearly see where the individual pups attach to the mother plant.It’s easiest to divide plants immediately after soaking them in water."
        },
        {
          "headline":"Pull the pups away from the mother carefully with your fingers.",
          "description":"Apply a little bit of pressure and separate the pups from the mother. The pups will separate easily and eventually become mother plants themselves. Once the clump is divided, let the pups air-dry completely before returning them to their designated spot!Since they multiply quite a bit, you might want to give away some of your pups to friends and family."
        }
      ]
    }
  ],
  "text":" Creating the Ideal Environment Provide 4-6 hours of bright, indirect sunlight every day. Air plants love bright light but they cannot withstand direct sunlight, which quickly burns their foliage. Place your air plant within 3–5 feet (0.91–1.52 m) of a south, east, or west-facing window to ensure it gets plenty of bright, filtered sunlight.In the Northern Hemisphere, a south-facing window will receive the most light during the day. If you live in the Southern Hemisphere, it's the opposite—a north-facing window gets more light. Place or mount your air plant on a dry, stable surface. Air plants do not grow in soil, which allows you to display them in all sorts of interesting and attractive ways. They do require a dry, stable surface that doesn't hold water, but other than that, your imagination is the limit.For example, you can place air plants on a sunny windowsill or on a bookshelf near a light source. Positioning them inside glass terrariums or globes is a popular and attractive solution. You can also mount an air plant to a surface permanently with hot glue or super glue. If you don’t want to use glue, tie the plants in place with fishing wire. Try mounting your air plant on a piece of driftwood or coral using hot glue to create a pretty display. Decide where you want to position the air plant on the chosen material, apply a small amount of hot glue to the area, and press the underside of the air plant clump into the glue. Hold the plant in place for 10-15 seconds so the glue can set. Maintain a temperature between 50–90 °F (10–32 °C) for healthy growth. Most indoor temperatures easily fall within this range, but sunny windows can get quite hot in the summertime. Similarly, temperatures near windows can drop quickly in winter. If you live in a particularly hot or cold climate, you might want to mount a thermostat near the window so you can monitor the temperature.You could also download a free app to your smartphone to monitor temperature or use a digital temperature gun to take periodic readings. Air plants are tropical and they will die if they’re exposed to temperatures lower than 45 °F (7 °C). Soak air plants in a basin or tub of water for 30 minutes once a week. Give your air plants a thorough watering every week by placing them directly in a tub or sink filled with water. Submerge the plants and leave them for half an hour. Then, shake them gently to get rid of excess moisture and spread them upside-down on a clean towel so they can air-dry.If your mounted air plant can’t be moved, mist it heavily with water until the leaves are dripping. Letting an air plant dry upside-down allows the water to drip away from the crown of the plant. Otherwise, water might settle into the crown and cause rot. Return the plants to their designated window after they dry completely.Tip: It's best to water air plants with bottled water or filtered tap water. Avoid using distilled water, since the distillation process removes all of the nutrients. Mist air plants between waterings to add moisture and humidity. Air plants are tropical, so they enjoy plenty of heat and humidity. Put fresh water into a spray bottle and mist your air plants a little bit each day. Pay attention to your air plant’s leaves, which will curl or roll up if the plant gets dehydrated.Dehydrated leaves may also look pale green in color and feel soft to the touch. If you see curled or rolled leaves, give the plant a thorough soak and remember to keep up with daily misting. If you live in a humid climate, you can probably mist your plants every other day. Feed air plants with Bromeliad fertilizer once a month to encourage growth. Bromelaid fertilizer is a 17-8-22 fertilizer that you can buy from nurseries or online. If you don’t have access to Bromelaid fertilizer, you can use any water-soluble  houseplant fertilizer diluted to ¼ strength. Pour the fertilizer into the basin of water before a weekly watering session and submerge the plants in the water for half an hour like you normally would.Use the amount of fertilizer recommended on the packaging, but make sure you dilute it to 1/4 strength if it's a general houseplant fertilizer. Pruning and Dividing Air Plants Pull off dry, brown leaves at the base of the plant when they appear. It's completely normal for leaves at the base of an air plant to dry out and turn brown over time, especially if the plant is acclimating to a new environment. Gently grasp the brown leaves with your fingers and pry them away from the base whenever you see them. Trim away dry, brown leaf tips with a sharp pair of scissors. The tips of air plant leaves get brown and dry occasionally. Use pruning shears or scissors to cut the dried tips off at an angle so the leaves continue to have pointed ends. That way, the pruned foliage will blend naturally into the rest of the plant.Dry tips could mean that you're underwatering the air plant. Consider misting your plant more often to see if the issue resolves. Divide air plants once they begin to reproduce to control growth. Young air plants grow rather slowly. However, after 2-4 years of proper care, growth tends to accelerate rapidly. Baby shoots, also known as pups, will start appearing at the base of the plant. To control size, you can remove the pups from the mother plant and create new plants.Make sure pups are at least a third of the mother's size before removing them. Spread the leaves gently with your fingers to isolate the pups. Hold a single clump in both hands and gently work your fingers into the base of the clump, which is where the pups grow. You will be able to clearly see where the individual pups attach to the mother plant.It’s easiest to divide plants immediately after soaking them in water. Pull the pups away from the mother carefully with your fingers. Apply a little bit of pressure and separate the pups from the mother. The pups will separate easily and eventually become mother plants themselves. Once the clump is divided, let the pups air-dry completely before returning them to their designated spot!Since they multiply quite a bit, you might want to give away some of your pups to friends and family.",
  "sentences":[
    " Creating the Ideal Environment Provide 4-6 hours of bright, indirect sunlight every day.",
    "Air plants love bright light but they cannot withstand direct sunlight, which quickly burns their foliage.",
    "Place your air plant within 3–5 feet (0.91–1.52 m) of a south, east, or west-facing window to ensure it gets plenty of bright, filtered sunlight.In the Northern Hemisphere, a south-facing window will receive the most light during the day.",
    "If you live in the Southern Hemisphere, it's the opposite—a north-facing window gets more light.",
    "Place or mount your air plant on a dry, stable surface.",
    "Air plants do not grow in soil, which allows you to display them in all sorts of interesting and attractive ways.",
    "They do require a dry, stable surface that doesn't hold water, but other than that, your imagination is the limit.For example, you can place air plants on a sunny windowsill or on a bookshelf near a light source.",
    "Positioning them inside glass terrariums or globes is a popular and attractive solution.",
    "You can also mount an air plant to a surface permanently with hot glue or super glue.",
    "If you don’t want to use glue, tie the plants in place with fishing wire.",
    "Try mounting your air plant on a piece of driftwood or coral using hot glue to create a pretty display.",
    "Decide where you want to position the air plant on the chosen material, apply a small amount of hot glue to the area, and press the underside of the air plant clump into the glue.",
    "Hold the plant in place for 10-15 seconds so the glue can set.",
    "Maintain a temperature between 50–90 °F (10–32 °C) for healthy growth.",
    "Most indoor temperatures easily fall within this range, but sunny windows can get quite hot in the summertime.",
    "Similarly, temperatures near windows can drop quickly in winter.",
    "If you live in a particularly hot or cold climate, you might want to mount a thermostat near the window so you can monitor the temperature.You could also download a free app to your smartphone to monitor temperature or use a digital temperature gun to take periodic readings.",
    "Air plants are tropical and they will die if they’re exposed to temperatures lower than 45 °F (7 °C).",
    "Soak air plants in a basin or tub of water for 30 minutes once a week.",
    "Give your air plants a thorough watering every week by placing them directly in a tub or sink filled with water.",
    "Submerge the plants and leave them for half an hour.",
    "Then, shake them gently to get rid of excess moisture and spread them upside-down on a clean towel so they can air-dry.If your mounted air plant can’t be moved, mist it heavily with water until the leaves are dripping.",
    "Letting an air plant dry upside-down allows the water to drip away from the crown of the plant.",
    "Otherwise, water might settle into the crown and cause rot.",
    "Return the plants to their designated window after they dry completely.Tip: It's best to water air plants with bottled water or filtered tap water.",
    "Avoid using distilled water, since the distillation process removes all of the nutrients.",
    "Mist air plants between waterings to add moisture and humidity.",
    "Air plants are tropical, so they enjoy plenty of heat and humidity.",
    "Put fresh water into a spray bottle and mist your air plants a little bit each day.",
    "Pay attention to your air plant’s leaves, which will curl or roll up if the plant gets dehydrated.Dehydrated leaves may also look pale green in color and feel soft to the touch.",
    "If you see curled or rolled leaves, give the plant a thorough soak and remember to keep up with daily misting.",
    "If you live in a humid climate, you can probably mist your plants every other day.",
    "Feed air plants with Bromeliad fertilizer once a month to encourage growth.",
    "Bromelaid fertilizer is a 17-8-22 fertilizer that you can buy from nurseries or online.",
    "If you don’t have access to Bromelaid fertilizer, you can use any water-soluble  houseplant fertilizer diluted to ¼ strength.",
    "Pour the fertilizer into the basin of water before a weekly watering session and submerge the plants in the water for half an hour like you normally would.Use the amount of fertilizer recommended on the packaging, but make sure you dilute it to 1/4 strength if it's a general houseplant fertilizer.",
    "Pruning and Dividing Air Plants Pull off dry, brown leaves at the base of the plant when they appear.",
    "It's completely normal for leaves at the base of an air plant to dry out and turn brown over time, especially if the plant is acclimating to a new environment.",
    "Gently grasp the brown leaves with your fingers and pry them away from the base whenever you see them.",
    "Trim away dry, brown leaf tips with a sharp pair of scissors.",
    "The tips of air plant leaves get brown and dry occasionally.",
    "Use pruning shears or scissors to cut the dried tips off at an angle so the leaves continue to have pointed ends.",
    "That way, the pruned foliage will blend naturally into the rest of the plant.Dry tips could mean that you're underwatering the air plant.",
    "Consider misting your plant more often to see if the issue resolves.",
    "Divide air plants once they begin to reproduce to control growth.",
    "Young air plants grow rather slowly.",
    "However, after 2-4 years of proper care, growth tends to accelerate rapidly.",
    "Baby shoots, also known as pups, will start appearing at the base of the plant.",
    "To control size, you can remove the pups from the mother plant and create new plants.Make sure pups are at least a third of the mother's size before removing them.",
    "Spread the leaves gently with your fingers to isolate the pups.",
    "Hold a single clump in both hands and gently work your fingers into the base of the clump, which is where the pups grow.",
    "You will be able to clearly see where the individual pups attach to the mother plant.It’s easiest to divide plants immediately after soaking them in water.",
    "Pull the pups away from the mother carefully with your fingers.",
    "Apply a little bit of pressure and separate the pups from the mother.",
    "The pups will separate easily and eventually become mother plants themselves.",
    "Once the clump is divided, let the pups air-dry completely before returning them to their designated spot!Since they multiply quite a bit, you might want to give away some of your pups to friends and family."
  ],
  "tyn_section":[
    "Stable surface",
    "Spray bottle",
    "Dry towels",
    "Hot glue or super glue (optional)",
    "Mounted thermostat (optional)",
    "Water-soluble fertilizer"
  ],
  "tyn_model":[
    "water",
    "air plants",
    "air plant",
    "fertilizer",
    "hot glue",
    "glue",
    "bromelaid fertilizer",
    "scissors",
    "—a",
    "super glue",
    "thermostat",
    "basin",
    "spray bottle",
    "bromeliad fertilizer",
    "pruning shears"
  ],
  "simple_metrics":{
    "r":0.1666666667,
    "p":0.0666666667,
    "f1":0.0952380952,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1333333333,
    "f1":0.1904761905
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.4666666667,
    "f1":0.5490196078
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1666666667,
    "p":0.0666666667,
    "f1":0.0952380952
  }
}