{
  "title":"How to Plant a Woolworths Discovery Garden",
  "url":"https://www.wikihow.com/Plant-a-Woolworths-Discovery-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Theme and Feature Gardens"
  ],
  "parts":[
    {
      "name":"Planting Your Seeds",
      "steps":[
        {
          "headline":"Figure out which seeds you have based on their packets.",
          "description":"Every Discovery Garden kit comes with soil and pots, but they all have a different mixture of seeds. Look through your seed packets to see which vegetables, herbs, and flowers you got in your kit.The Discovery Garden comes with 24 different seed varieties. If your kit has less than that or is missing any pieces, visit your local Woolworths and talk to customer service."
        },
        {
          "headline":"Set the soil pellet on a plate.",
          "description":"Take 1 soil pellet out from the starter kit and place it on a ceramic plate with a raised rim around the sides. Make sure the plate is waterproof and that it can hold at least 50 millilitres (1.7  fl oz) of water.Keep all of the pellets separate to avoid putting too much soil in one pot."
        },
        {
          "headline":"Pour 50 millilitres (1.7  fl oz) over the soil pellet.",
          "description":"Carefully pour water directly over the soil pellet. Watch as the dehydrated soil soaks up the water and becomes much taller! Try not to add too much water, or your soil could become mud.Tip: If you do add too much water to your soil, hold the soil pellet with one hand and gently tip your plate to let the excess water run off."
        },
        {
          "headline":"Break up the soil with your hand.",
          "description":"Put on some gardening gloves to protect your hands. Gently press your fingers into the soil to break it up and make it loose and easy to work with.The soil should feel like real potting soil now and shouldn’t be dry or hard anymore."
        },
        {
          "headline":"Fill 1 pot ¾ of the way with soil.",
          "description":"Grab a single pot from the starter kit and place it in front of you. Use a gardening spade to shovel dirt into your pot until it is about ¾ of the way full.Don’t use too much soil here, or you won’t have enough to cover up your seeds."
        },
        {
          "headline":"Place the seed paper on top of the soil.",
          "description":"Grab 1 sheet of seed paper from the starter kit. Leave the seeds in the paper and press it down on top of the soil in your pot. Try not to handle the seed paper too much so that the seeds stay intact.If you want to, you can make a paper label to keep track of which seeds are in each pot. On a scrap of paper, write down the name of the vegetable, herb, or flower that you are planting and keep it near the pot as it grows."
        },
        {
          "headline":"Add the rest of the soil on top of the seed paper.",
          "description":"Use your gardening spade to scoop the rest of your dirt on top of the seed paper and press down on it gently with your fingers. Make sure the dirt is pretty compact to keep the seeds in place as they grow."
        },
        {
          "headline":"Repeat the planting process for each seed paper you have.",
          "description":"You have enough supplies in your Discovery Garden kit to plant all 24 of your seed papers in their own pots. Plant all of your seeds at the same time to watch them grow side by side.You can store your seed papers for up to 2 years as long as you don’t get them wet."
        }
      ]
    },
    {
      "name":"Growing Your Plants",
      "steps":[
        {
          "headline":"Place the pots in an area that gets 8 hours of sunlight per day.",
          "description":"Move the plants to a windowsill or countertop that gets plenty of sunlight. Choose an east or west facing window for a good balance of sun and shade.It is best to keep your seeds inside for the first few weeks so that they stay out of the elements. Check the seed guides for more specific instructions on how to take care of each plant type that you have."
        },
        {
          "headline":"Keep the soil moist at all times.",
          "description":"Check on your pots once a day and feel the soil to see if it is wet. If the soil looks light brown and dry, add some water to the pots. If it still feels moist, leave the pots to dry out for another day.Tip: Keep a watering can near your pots for easy access every day."
        },
        {
          "headline":"Pick off any bugs or pests by hand.",
          "description":"If you spot any caterpillars or small bugs eating your plants, put on your gardening gloves and remove them by hand. Keep your plants indoors to lessen the threat of pests.If your plants have a lot of pests, consider making a peppermint spray out of 1 drop of peppermint essential oil and 1 cup (240 mL) of water. Spray the leaves of your plants once a day to keep pests away."
        },
        {
          "headline":"Fertilize your plants once every 2 weeks.",
          "description":"Add a thin layer of organic fertilizer on top of the soil surrounding your plant as it grows. Make sure the fertilizer doesn’t cover any new seedlings or leaves.You can buy fertilizer at most garden supply stores."
        }
      ]
    },
    {
      "name":"Repotting Your Seedlings",
      "steps":[
        {
          "headline":"Wait for the plant to get too big for its pot.",
          "description":"Depending on the type of seeds you planted, it could take anywhere from 2 weeks to 2 months for a plant to outgrow its pot. Look out for roots that are climbing out of the bottom of the pot or a plant that has stopped growing altogether to know when it is time to repot your seedlings.Check the seed guide for a better time estimate based on each plant."
        },
        {
          "headline":"Fill a large pot with drainage holes ½ full of soil.",
          "description":"Whether your new pot is plastic, clay, or ceramic, it must have drainage holes for the water to run out of the soil. Use a gardening spade to fill your new pot about ½ way full of potting soil.Tip: If you have a garden already, you can transfer your plant straight into the garden instead of a new pot. You can buy potting soil from your local garden supply store. The size of the pot you need depends on what kind of plant you are repotting. Check your seed guide to find out what size you need to use."
        },
        {
          "headline":"Place the seedling and its pot into the large pot.",
          "description":"The small pots that came with the starter kit of your Discovery Garden are biodegradable, so your seedling will be able to grow its roots straight out of the pot. Set your small pot into the larger pot on the pile of dirt.Leaving the plant in its smaller pot helps to preserve the roots and prevents it from going into shock."
        },
        {
          "headline":"Fill the rest of the pot up with soil.",
          "description":"Use your gardening spade to fill up the other ½ of the pot with potting soil. Make sure the roots of your seedling are fully covered and leave the green leaves and shoots sticking up and out of the dirt."
        },
        {
          "headline":"Wet down the soil to keep it compact and water your seedling every day.",
          "description":"Add some water to your plant to help it establish new roots and to encourage it to grow. Keep watering your plants each day to keep the soil moist at all times.Make sure there is a drainage tray underneath your plant to catch any excess water."
        }
      ]
    },
    {
      "name":"Harvesting Your Plants",
      "steps":[
        {
          "headline":"Pick root vegetables gently out of the ground.",
          "description":"Potatoes, carrots, beets, and radishes all grow underground in the dirt. Once the foliage on top of the ground turns green and starts to flop over, gently pull these vegetables out of the ground with your hands. Wash them off before you eat them to get rid of the dirt.Tip: Most vegetables and herbs take several months to produce edible crops."
        },
        {
          "headline":"Pluck off large leaves of leafy greens.",
          "description":"Basil, parsley, spinach, thyme, oregano, lettuce, and kale all reach maturity at around the same time. Wait for these plants to grow large, edible leaves and then gently pull them off. Leave the roots and vines intact to promote new growth.Your plants will continue to produce leaves for the entire harvest season."
        },
        {
          "headline":"Replant flowers in the ground to keep them growing.",
          "description":"Dig a 1 gallon (3.8 L) hole with a gardening spade and carefully remove your flower from its pot with the roots intact. Place the flower in the hole and cover the roots with dirt. Pack down the dirt to keep the flower in place.You can either keep them growing in their pots or replant them in your yard."
        }
      ]
    }
  ],
  "text":" Planting Your Seeds Figure out which seeds you have based on their packets. Every Discovery Garden kit comes with soil and pots, but they all have a different mixture of seeds. Look through your seed packets to see which vegetables, herbs, and flowers you got in your kit.The Discovery Garden comes with 24 different seed varieties. If your kit has less than that or is missing any pieces, visit your local Woolworths and talk to customer service. Set the soil pellet on a plate. Take 1 soil pellet out from the starter kit and place it on a ceramic plate with a raised rim around the sides. Make sure the plate is waterproof and that it can hold at least 50 millilitres (1.7  fl oz) of water.Keep all of the pellets separate to avoid putting too much soil in one pot. Pour 50 millilitres (1.7  fl oz) over the soil pellet. Carefully pour water directly over the soil pellet. Watch as the dehydrated soil soaks up the water and becomes much taller! Try not to add too much water, or your soil could become mud.Tip: If you do add too much water to your soil, hold the soil pellet with one hand and gently tip your plate to let the excess water run off. Break up the soil with your hand. Put on some gardening gloves to protect your hands. Gently press your fingers into the soil to break it up and make it loose and easy to work with.The soil should feel like real potting soil now and shouldn’t be dry or hard anymore. Fill 1 pot ¾ of the way with soil. Grab a single pot from the starter kit and place it in front of you. Use a gardening spade to shovel dirt into your pot until it is about ¾ of the way full.Don’t use too much soil here, or you won’t have enough to cover up your seeds. Place the seed paper on top of the soil. Grab 1 sheet of seed paper from the starter kit. Leave the seeds in the paper and press it down on top of the soil in your pot. Try not to handle the seed paper too much so that the seeds stay intact.If you want to, you can make a paper label to keep track of which seeds are in each pot. On a scrap of paper, write down the name of the vegetable, herb, or flower that you are planting and keep it near the pot as it grows. Add the rest of the soil on top of the seed paper. Use your gardening spade to scoop the rest of your dirt on top of the seed paper and press down on it gently with your fingers. Make sure the dirt is pretty compact to keep the seeds in place as they grow. Repeat the planting process for each seed paper you have. You have enough supplies in your Discovery Garden kit to plant all 24 of your seed papers in their own pots. Plant all of your seeds at the same time to watch them grow side by side.You can store your seed papers for up to 2 years as long as you don’t get them wet. Growing Your Plants Place the pots in an area that gets 8 hours of sunlight per day. Move the plants to a windowsill or countertop that gets plenty of sunlight. Choose an east or west facing window for a good balance of sun and shade.It is best to keep your seeds inside for the first few weeks so that they stay out of the elements. Check the seed guides for more specific instructions on how to take care of each plant type that you have. Keep the soil moist at all times. Check on your pots once a day and feel the soil to see if it is wet. If the soil looks light brown and dry, add some water to the pots. If it still feels moist, leave the pots to dry out for another day.Tip: Keep a watering can near your pots for easy access every day. Pick off any bugs or pests by hand. If you spot any caterpillars or small bugs eating your plants, put on your gardening gloves and remove them by hand. Keep your plants indoors to lessen the threat of pests.If your plants have a lot of pests, consider making a peppermint spray out of 1 drop of peppermint essential oil and 1 cup (240 mL) of water. Spray the leaves of your plants once a day to keep pests away. Fertilize your plants once every 2 weeks. Add a thin layer of organic fertilizer on top of the soil surrounding your plant as it grows. Make sure the fertilizer doesn’t cover any new seedlings or leaves.You can buy fertilizer at most garden supply stores. Repotting Your Seedlings Wait for the plant to get too big for its pot. Depending on the type of seeds you planted, it could take anywhere from 2 weeks to 2 months for a plant to outgrow its pot. Look out for roots that are climbing out of the bottom of the pot or a plant that has stopped growing altogether to know when it is time to repot your seedlings.Check the seed guide for a better time estimate based on each plant. Fill a large pot with drainage holes ½ full of soil. Whether your new pot is plastic, clay, or ceramic, it must have drainage holes for the water to run out of the soil. Use a gardening spade to fill your new pot about ½ way full of potting soil.Tip: If you have a garden already, you can transfer your plant straight into the garden instead of a new pot. You can buy potting soil from your local garden supply store. The size of the pot you need depends on what kind of plant you are repotting. Check your seed guide to find out what size you need to use. Place the seedling and its pot into the large pot. The small pots that came with the starter kit of your Discovery Garden are biodegradable, so your seedling will be able to grow its roots straight out of the pot. Set your small pot into the larger pot on the pile of dirt.Leaving the plant in its smaller pot helps to preserve the roots and prevents it from going into shock. Fill the rest of the pot up with soil. Use your gardening spade to fill up the other ½ of the pot with potting soil. Make sure the roots of your seedling are fully covered and leave the green leaves and shoots sticking up and out of the dirt. Wet down the soil to keep it compact and water your seedling every day. Add some water to your plant to help it establish new roots and to encourage it to grow. Keep watering your plants each day to keep the soil moist at all times.Make sure there is a drainage tray underneath your plant to catch any excess water. Harvesting Your Plants Pick root vegetables gently out of the ground. Potatoes, carrots, beets, and radishes all grow underground in the dirt. Once the foliage on top of the ground turns green and starts to flop over, gently pull these vegetables out of the ground with your hands. Wash them off before you eat them to get rid of the dirt.Tip: Most vegetables and herbs take several months to produce edible crops. Pluck off large leaves of leafy greens. Basil, parsley, spinach, thyme, oregano, lettuce, and kale all reach maturity at around the same time. Wait for these plants to grow large, edible leaves and then gently pull them off. Leave the roots and vines intact to promote new growth.Your plants will continue to produce leaves for the entire harvest season. Replant flowers in the ground to keep them growing. Dig a 1 gallon (3.8 L) hole with a gardening spade and carefully remove your flower from its pot with the roots intact. Place the flower in the hole and cover the roots with dirt. Pack down the dirt to keep the flower in place.You can either keep them growing in their pots or replant them in your yard.",
  "sentences":[
    " Planting Your Seeds Figure out which seeds you have based on their packets.",
    "Every Discovery Garden kit comes with soil and pots, but they all have a different mixture of seeds.",
    "Look through your seed packets to see which vegetables, herbs, and flowers you got in your kit.The Discovery Garden comes with 24 different seed varieties.",
    "If your kit has less than that or is missing any pieces, visit your local Woolworths and talk to customer service.",
    "Set the soil pellet on a plate.",
    "Take 1 soil pellet out from the starter kit and place it on a ceramic plate with a raised rim around the sides.",
    "Make sure the plate is waterproof and that it can hold at least 50 millilitres (1.7  fl oz) of water.Keep all of the pellets separate to avoid putting too much soil in one pot.",
    "Pour 50 millilitres (1.7  fl oz) over the soil pellet.",
    "Carefully pour water directly over the soil pellet.",
    "Watch as the dehydrated soil soaks up the water and becomes much taller!",
    "Try not to add too much water, or your soil could become mud.Tip: If you do add too much water to your soil, hold the soil pellet with one hand and gently tip your plate to let the excess water run off.",
    "Break up the soil with your hand.",
    "Put on some gardening gloves to protect your hands.",
    "Gently press your fingers into the soil to break it up and make it loose and easy to work with.The soil should feel like real potting soil now and shouldn’t be dry or hard anymore.",
    "Fill 1 pot ¾ of the way with soil.",
    "Grab a single pot from the starter kit and place it in front of you.",
    "Use a gardening spade to shovel dirt into your pot until it is about ¾ of the way full.Don’t use too much soil here, or you won’t have enough to cover up your seeds.",
    "Place the seed paper on top of the soil.",
    "Grab 1 sheet of seed paper from the starter kit.",
    "Leave the seeds in the paper and press it down on top of the soil in your pot.",
    "Try not to handle the seed paper too much so that the seeds stay intact.If you want to, you can make a paper label to keep track of which seeds are in each pot.",
    "On a scrap of paper, write down the name of the vegetable, herb, or flower that you are planting and keep it near the pot as it grows.",
    "Add the rest of the soil on top of the seed paper.",
    "Use your gardening spade to scoop the rest of your dirt on top of the seed paper and press down on it gently with your fingers.",
    "Make sure the dirt is pretty compact to keep the seeds in place as they grow.",
    "Repeat the planting process for each seed paper you have.",
    "You have enough supplies in your Discovery Garden kit to plant all 24 of your seed papers in their own pots.",
    "Plant all of your seeds at the same time to watch them grow side by side.You can store your seed papers for up to 2 years as long as you don’t get them wet.",
    "Growing Your Plants Place the pots in an area that gets 8 hours of sunlight per day.",
    "Move the plants to a windowsill or countertop that gets plenty of sunlight.",
    "Choose an east or west facing window for a good balance of sun and shade.It is best to keep your seeds inside for the first few weeks so that they stay out of the elements.",
    "Check the seed guides for more specific instructions on how to take care of each plant type that you have.",
    "Keep the soil moist at all times.",
    "Check on your pots once a day and feel the soil to see if it is wet.",
    "If the soil looks light brown and dry, add some water to the pots.",
    "If it still feels moist, leave the pots to dry out for another day.Tip: Keep a watering can near your pots for easy access every day.",
    "Pick off any bugs or pests by hand.",
    "If you spot any caterpillars or small bugs eating your plants, put on your gardening gloves and remove them by hand.",
    "Keep your plants indoors to lessen the threat of pests.If your plants have a lot of pests, consider making a peppermint spray out of 1 drop of peppermint essential oil and 1 cup (240 mL) of water.",
    "Spray the leaves of your plants once a day to keep pests away.",
    "Fertilize your plants once every 2 weeks.",
    "Add a thin layer of organic fertilizer on top of the soil surrounding your plant as it grows.",
    "Make sure the fertilizer doesn’t cover any new seedlings or leaves.You can buy fertilizer at most garden supply stores.",
    "Repotting Your Seedlings Wait for the plant to get too big for its pot.",
    "Depending on the type of seeds you planted, it could take anywhere from 2 weeks to 2 months for a plant to outgrow its pot.",
    "Look out for roots that are climbing out of the bottom of the pot or a plant that has stopped growing altogether to know when it is time to repot your seedlings.Check the seed guide for a better time estimate based on each plant.",
    "Fill a large pot with drainage holes ½ full of soil.",
    "Whether your new pot is plastic, clay, or ceramic, it must have drainage holes for the water to run out of the soil.",
    "Use a gardening spade to fill your new pot about ½ way full of potting soil.Tip: If you have a garden already, you can transfer your plant straight into the garden instead of a new pot.",
    "You can buy potting soil from your local garden supply store.",
    "The size of the pot you need depends on what kind of plant you are repotting.",
    "Check your seed guide to find out what size you need to use.",
    "Place the seedling and its pot into the large pot.",
    "The small pots that came with the starter kit of your Discovery Garden are biodegradable, so your seedling will be able to grow its roots straight out of the pot.",
    "Set your small pot into the larger pot on the pile of dirt.Leaving the plant in its smaller pot helps to preserve the roots and prevents it from going into shock.",
    "Fill the rest of the pot up with soil.",
    "Use your gardening spade to fill up the other ½ of the pot with potting soil.",
    "Make sure the roots of your seedling are fully covered and leave the green leaves and shoots sticking up and out of the dirt.",
    "Wet down the soil to keep it compact and water your seedling every day.",
    "Add some water to your plant to help it establish new roots and to encourage it to grow.",
    "Keep watering your plants each day to keep the soil moist at all times.Make sure there is a drainage tray underneath your plant to catch any excess water.",
    "Harvesting Your Plants Pick root vegetables gently out of the ground.",
    "Potatoes, carrots, beets, and radishes all grow underground in the dirt.",
    "Once the foliage on top of the ground turns green and starts to flop over, gently pull these vegetables out of the ground with your hands.",
    "Wash them off before you eat them to get rid of the dirt.Tip: Most vegetables and herbs take several months to produce edible crops.",
    "Pluck off large leaves of leafy greens.",
    "Basil, parsley, spinach, thyme, oregano, lettuce, and kale all reach maturity at around the same time.",
    "Wait for these plants to grow large, edible leaves and then gently pull them off.",
    "Leave the roots and vines intact to promote new growth.Your plants will continue to produce leaves for the entire harvest season.",
    "Replant flowers in the ground to keep them growing.",
    "Dig a 1 gallon (3.8 L) hole with a gardening spade and carefully remove your flower from its pot with the roots intact.",
    "Place the flower in the hole and cover the roots with dirt.",
    "Pack down the dirt to keep the flower in place.You can either keep them growing in their pots or replant them in your yard."
  ],
  "tyn_section":[
    "Gardening spade",
    "Gardening gloves",
    "Large pots",
    "Watering can (optional)"
  ],
  "tyn_model":[
    "water",
    "gardening spade",
    "seed paper",
    "soil",
    "potting soil",
    "pots",
    "plate",
    "discovery garden",
    "herbs",
    "fertilizer",
    "vegetables",
    "dirt",
    "ceramic plate",
    "soil pellet",
    "discovery garden kit",
    "seed papers",
    "watering can",
    "gardening gloves",
    "peppermint essential oil",
    "organic fertilizer",
    "garden supply stores",
    "pot",
    "root vegetables",
    "potatoes",
    "carrots",
    "beets",
    "radishes",
    "basil",
    "parsley",
    "spinach",
    "thyme",
    "oregano",
    "lettuce",
    "kale"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0588235294,
    "f1":0.1052631579,
    "avg_pos":0.0294117647
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.1176470588,
    "f1":0.2105263158
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.1176470588,
    "f1":0.2105263158
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.0882352941,
    "f1":0.1578947368
  }
}