{
  "title":"How to Paint Bamboo Furniture",
  "url":"https://www.wikihow.com/Paint-Bamboo-Furniture",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Sanding and Cleaning the Surface",
      "steps":[
        {
          "headline":"Remove cushions, upholstery, and hardware from the furniture if it has them.",
          "description":"Check for any screws or fasteners holding the cushions or upholstery in place. Use a screwdriver or pair of pliers to pull the fasteners out from the furniture and set them aside while you’re working so you don’t lose them. Put the cushions and upholstery in an area where they won’t get dirty. If you’re working on a desk or dresser, remove the drawers and take off any handles or hardware on the exterior surface.Tip: Reupholster the cushions with a different fabric or pattern if you want them to match the furniture’s new color."
        },
        {
          "headline":"Sand the bamboo with 150-grit sandpaper to rough up the surface.",
          "description":"Apply slight pressure as you rub the entire surface with the sandpaper. Be careful not to press too hard since you could crack the bamboo if it’s old or weak. Work in circular motions to strip the outer protection from the bamboo so the primer and paint adhere to it. Try to evenly sand the bamboo as best as you can so the color looks consistent. If the furniture was previously painted, be sure to sand the paint off completely. Avoid using an electric sander since you could break the bamboo. Bamboo has a slippery surface, so your paint won’t stick to it unless you sand the furniture."
        },
        {
          "headline":"Brush as much of the sawdust off the furniture as possible.",
          "description":"Use a soft-bristle hand brush to wipe the surface of the furniture clean. Focus on small crannies or areas that have intricate details where sawdust is most likely to get stuck. Shake the brush off into a trash can every few minutes so you don’t reapply the sawdust to the surface. You can buy hand brushes from hardware stores, or you can use the one that came with your dustpan if you have one. Avoid using a stiff-bristled or abrasive brush since you could scratch the bamboo and leave marks on the furniture."
        },
        {
          "headline":"Use the brush attachment on a vacuum to remove hard-to-reach dust.",
          "description":"Put the brush attachment on your vacuum’s hose and run it over your furniture. Pay close attention to areas where sawdust could get caught, such as carved detail or seams between pieces. Rub the brush attachment back and forth over the furniture so the bristles lift up any dust that’s still stuck on the surface. The brush attachment will wipe off the sawdust without damaging or scratching the bamboo. If your vacuum doesn't have a brush attachment, you can buy one online or try using a crevice attachment."
        },
        {
          "headline":"Wipe the furniture with a damp microfiber cloth and let it air-dry.",
          "description":"Wet a microfiber cloth with warm water and wring it out so it isn’t dripping wet. Go over the entire piece with the rag to get rid of residual sawdust so your furniture is clean. Rewet the cloth as it dries out and continue working. After wiping the furniture down, leave it to air-dry completely so it doesn’t feel damp to the touch. Avoid getting the bamboo dripping wet since it could cause lasting damage."
        }
      ]
    },
    {
      "name":"Priming the Bamboo",
      "steps":[
        {
          "headline":"Lay a drop cloth down in an outdoor work area.",
          "description":"Find a work area that’s outdoors or in a well-ventilated space, such as a garage, for priming and painting. Fold a drop cloth in half and lay it down on the ground to protect the area underneath from overspray. Set your piece of furniture in the middle of the drop cloth. You can buy drop cloths from your local hardware store. If you don’t have a drop cloth, you can set the piece of furniture on a large sheet of cardboard instead.Warning: Avoid working in a poorly-ventilated area since spray paint produces harmful fumes."
        },
        {
          "headline":"Put on safety glasses and a face mask whenever you’re painting.",
          "description":"Wear wraparound safety glasses that cover your eyes completely. Then put on a face mask that goes over your nose and mouth so you don’t breathe in any fumes or overspray. Wear your safety equipment any time you start priming or painting. You can buy safety glasses and face masks from your local hardware store. If you’re working in an indoor area, opt for a full respirator instead of a face mask since it will protect you from fumes better."
        },
        {
          "headline":"Shake a can of oil-based spray primer and hold it 6 in (15 cm) from the piece.",
          "description":"Shake the can of primer thoroughly to ensure it’s properly mixed before you use it. Hold the can upright so it’s about 6–8 inches (15–20 cm) away from the piece of furniture so it doesn’t apply too thick or overspray. Oil-based spray primer is similar to spray paint, but it creates a base coat so the paint adheres better and has a solid color. You can buy it from your local paint supply or hardware store."
        },
        {
          "headline":"Apply the primer in a thin, even coat.",
          "description":"Press the button down on the can to start spraying your piece of furniture. Keep moving the can back and forth across the piece of furniture so you don’t apply too much primer to a single area. Continue working across the entire piece until there’s a thin, even coat of primer. Test spraying the primer on your drop cloth or a piece of cardboard first to ensure it sprays evenly. Sometimes, the primer may clog and spray unevenly the first time you use it. If you don’t apply primer before you start painting, the color won’t stick on your furniture as well and the surface will look uneven."
        },
        {
          "headline":"Allow the primer to dry for 30–60 minutes.",
          "description":"Leave the piece of furniture in an area where it won’t get disturbed so the primer has time to set. After about 30 minutes, lightly tap the surface with a finger to see if any of the primer lifts up. If the primer feels dry, then you can move on. Otherwise, allow it to sit for another 30 minutes before checking it again. Primer drying time may vary, so check the can you’re using to see how long you should wait."
        },
        {
          "headline":"Sand the primed surface with 220-grit sandpaper using light pressure.",
          "description":"Work in circular motions to smooth out any raised areas of primer so you have a smooth painting surface to work with. Replace the piece of sandpaper as it gets dirty with dust from the primer. You can also use a sanding sponge instead if you have trouble getting a good grip on the sandpaper."
        },
        {
          "headline":"Wipe the furniture with a damp microfiber cloth to clean off the primer dust.",
          "description":"Dip a microfiber cloth in warm water and wring it out. Lightly rub the primed surface with the cloth to pick up any dust left on the surface from sanding the primer. Work your way over the entire piece of furniture until you don’t lift up any more dust. You may also brush or vacuum the dust if you want."
        }
      ]
    },
    {
      "name":"Painting the Furniture",
      "steps":[
        {
          "headline":"Choose an enamel spray paint for your furniture.",
          "description":"Pick a color that matches or complements the other pieces of furniture in your home so it doesn’t clash. Get 1–2 cans of the color to ensure you have enough to coat the entire piece. You can buy enamel spray paint from a hardware or paint supply store. Enamel spray paint works for both indoor and outdoor bamboo furniture.Tip: Avoid using acrylic spray paint if you plan on keeping the furniture outdoors since it could get damaged from water."
        },
        {
          "headline":"Shake the can of paint and keep it 6 in (15 cm) from your furniture.",
          "description":"Leave the cap on the can and shake it for about 15 seconds to properly mix the paint. Position the can upright and hold it about 6 inches (15 cm) from the piece of furniture to help prevent overspray."
        },
        {
          "headline":"Apply a thin coat of the paint to the bamboo furniture.",
          "description":"Press the button down that’s on top of the can to start spraying the paint. Keep moving the can back and forth over the surface so you don’t apply paint too thickly to one area. Work your way around the entire piece until you have an even coat of color. It’s okay if you can still see some of the primer through the first coat of paint. Always work in thin layers since they’ll dry faster and make the color look consistent across the entire piece of furniture."
        },
        {
          "headline":"Let the spray paint dry for 30 minutes.",
          "description":"Leave the furniture alone so it doesn’t get disturbed while it’s drying. After about 30 minutes, check if the paint feels dry to the touch. If it does, then continue working. Otherwise, wait another 15 minutes before checking the paint again. Drying time between coats may vary depending on the kind of spray paint you have, so always check the can you’re using to find out how long they recommend you wait."
        },
        {
          "headline":"Spray on additional coats until the furniture has an even finish.",
          "description":"Start your next coat of paint and work over the entire surface of your furniture. Move the can around while you’re spraying to keep the layer thin or even. Allow the coat to dry completely before checking if you need another one. Continue adding coats of paint and allowing them to dry until the furniture has a consistent color. Usually, it will take 2–3 coats of spray paint to finish your piece."
        },
        {
          "headline":"Reattach the upholstery, cushions, and hardware if needed.",
          "description":"Once the paint dries, set the cushions or upholstery back on the furniture. Use a screwdriver or a hammer to reattach the fasteners so the upholstery doesn’t move around or shift."
        }
      ]
    }
  ],
  "text":" Sanding and Cleaning the Surface Remove cushions, upholstery, and hardware from the furniture if it has them. Check for any screws or fasteners holding the cushions or upholstery in place. Use a screwdriver or pair of pliers to pull the fasteners out from the furniture and set them aside while you’re working so you don’t lose them. Put the cushions and upholstery in an area where they won’t get dirty. If you’re working on a desk or dresser, remove the drawers and take off any handles or hardware on the exterior surface.Tip: Reupholster the cushions with a different fabric or pattern if you want them to match the furniture’s new color. Sand the bamboo with 150-grit sandpaper to rough up the surface. Apply slight pressure as you rub the entire surface with the sandpaper. Be careful not to press too hard since you could crack the bamboo if it’s old or weak. Work in circular motions to strip the outer protection from the bamboo so the primer and paint adhere to it. Try to evenly sand the bamboo as best as you can so the color looks consistent. If the furniture was previously painted, be sure to sand the paint off completely. Avoid using an electric sander since you could break the bamboo. Bamboo has a slippery surface, so your paint won’t stick to it unless you sand the furniture. Brush as much of the sawdust off the furniture as possible. Use a soft-bristle hand brush to wipe the surface of the furniture clean. Focus on small crannies or areas that have intricate details where sawdust is most likely to get stuck. Shake the brush off into a trash can every few minutes so you don’t reapply the sawdust to the surface. You can buy hand brushes from hardware stores, or you can use the one that came with your dustpan if you have one. Avoid using a stiff-bristled or abrasive brush since you could scratch the bamboo and leave marks on the furniture. Use the brush attachment on a vacuum to remove hard-to-reach dust. Put the brush attachment on your vacuum’s hose and run it over your furniture. Pay close attention to areas where sawdust could get caught, such as carved detail or seams between pieces. Rub the brush attachment back and forth over the furniture so the bristles lift up any dust that’s still stuck on the surface. The brush attachment will wipe off the sawdust without damaging or scratching the bamboo. If your vacuum doesn't have a brush attachment, you can buy one online or try using a crevice attachment. Wipe the furniture with a damp microfiber cloth and let it air-dry. Wet a microfiber cloth with warm water and wring it out so it isn’t dripping wet. Go over the entire piece with the rag to get rid of residual sawdust so your furniture is clean. Rewet the cloth as it dries out and continue working. After wiping the furniture down, leave it to air-dry completely so it doesn’t feel damp to the touch. Avoid getting the bamboo dripping wet since it could cause lasting damage. Priming the Bamboo Lay a drop cloth down in an outdoor work area. Find a work area that’s outdoors or in a well-ventilated space, such as a garage, for priming and painting. Fold a drop cloth in half and lay it down on the ground to protect the area underneath from overspray. Set your piece of furniture in the middle of the drop cloth. You can buy drop cloths from your local hardware store. If you don’t have a drop cloth, you can set the piece of furniture on a large sheet of cardboard instead.Warning: Avoid working in a poorly-ventilated area since spray paint produces harmful fumes. Put on safety glasses and a face mask whenever you’re painting. Wear wraparound safety glasses that cover your eyes completely. Then put on a face mask that goes over your nose and mouth so you don’t breathe in any fumes or overspray. Wear your safety equipment any time you start priming or painting. You can buy safety glasses and face masks from your local hardware store. If you’re working in an indoor area, opt for a full respirator instead of a face mask since it will protect you from fumes better. Shake a can of oil-based spray primer and hold it 6 in (15 cm) from the piece. Shake the can of primer thoroughly to ensure it’s properly mixed before you use it. Hold the can upright so it’s about 6–8 inches (15–20 cm) away from the piece of furniture so it doesn’t apply too thick or overspray. Oil-based spray primer is similar to spray paint, but it creates a base coat so the paint adheres better and has a solid color. You can buy it from your local paint supply or hardware store. Apply the primer in a thin, even coat. Press the button down on the can to start spraying your piece of furniture. Keep moving the can back and forth across the piece of furniture so you don’t apply too much primer to a single area. Continue working across the entire piece until there’s a thin, even coat of primer. Test spraying the primer on your drop cloth or a piece of cardboard first to ensure it sprays evenly. Sometimes, the primer may clog and spray unevenly the first time you use it. If you don’t apply primer before you start painting, the color won’t stick on your furniture as well and the surface will look uneven. Allow the primer to dry for 30–60 minutes. Leave the piece of furniture in an area where it won’t get disturbed so the primer has time to set. After about 30 minutes, lightly tap the surface with a finger to see if any of the primer lifts up. If the primer feels dry, then you can move on. Otherwise, allow it to sit for another 30 minutes before checking it again. Primer drying time may vary, so check the can you’re using to see how long you should wait. Sand the primed surface with 220-grit sandpaper using light pressure. Work in circular motions to smooth out any raised areas of primer so you have a smooth painting surface to work with. Replace the piece of sandpaper as it gets dirty with dust from the primer. You can also use a sanding sponge instead if you have trouble getting a good grip on the sandpaper. Wipe the furniture with a damp microfiber cloth to clean off the primer dust. Dip a microfiber cloth in warm water and wring it out. Lightly rub the primed surface with the cloth to pick up any dust left on the surface from sanding the primer. Work your way over the entire piece of furniture until you don’t lift up any more dust. You may also brush or vacuum the dust if you want. Painting the Furniture Choose an enamel spray paint for your furniture. Pick a color that matches or complements the other pieces of furniture in your home so it doesn’t clash. Get 1–2 cans of the color to ensure you have enough to coat the entire piece. You can buy enamel spray paint from a hardware or paint supply store. Enamel spray paint works for both indoor and outdoor bamboo furniture.Tip: Avoid using acrylic spray paint if you plan on keeping the furniture outdoors since it could get damaged from water. Shake the can of paint and keep it 6 in (15 cm) from your furniture. Leave the cap on the can and shake it for about 15 seconds to properly mix the paint. Position the can upright and hold it about 6 inches (15 cm) from the piece of furniture to help prevent overspray. Apply a thin coat of the paint to the bamboo furniture. Press the button down that’s on top of the can to start spraying the paint. Keep moving the can back and forth over the surface so you don’t apply paint too thickly to one area. Work your way around the entire piece until you have an even coat of color. It’s okay if you can still see some of the primer through the first coat of paint. Always work in thin layers since they’ll dry faster and make the color look consistent across the entire piece of furniture. Let the spray paint dry for 30 minutes. Leave the furniture alone so it doesn’t get disturbed while it’s drying. After about 30 minutes, check if the paint feels dry to the touch. If it does, then continue working. Otherwise, wait another 15 minutes before checking the paint again. Drying time between coats may vary depending on the kind of spray paint you have, so always check the can you’re using to find out how long they recommend you wait. Spray on additional coats until the furniture has an even finish. Start your next coat of paint and work over the entire surface of your furniture. Move the can around while you’re spraying to keep the layer thin or even. Allow the coat to dry completely before checking if you need another one. Continue adding coats of paint and allowing them to dry until the furniture has a consistent color. Usually, it will take 2–3 coats of spray paint to finish your piece. Reattach the upholstery, cushions, and hardware if needed. Once the paint dries, set the cushions or upholstery back on the furniture. Use a screwdriver or a hammer to reattach the fasteners so the upholstery doesn’t move around or shift.",
  "sentences":[
    " Sanding and Cleaning the Surface Remove cushions, upholstery, and hardware from the furniture if it has them.",
    "Check for any screws or fasteners holding the cushions or upholstery in place.",
    "Use a screwdriver or pair of pliers to pull the fasteners out from the furniture and set them aside while you’re working so you don’t lose them.",
    "Put the cushions and upholstery in an area where they won’t get dirty.",
    "If you’re working on a desk or dresser, remove the drawers and take off any handles or hardware on the exterior surface.Tip: Reupholster the cushions with a different fabric or pattern if you want them to match the furniture’s new color.",
    "Sand the bamboo with 150-grit sandpaper to rough up the surface.",
    "Apply slight pressure as you rub the entire surface with the sandpaper.",
    "Be careful not to press too hard since you could crack the bamboo if it’s old or weak.",
    "Work in circular motions to strip the outer protection from the bamboo so the primer and paint adhere to it.",
    "Try to evenly sand the bamboo as best as you can so the color looks consistent.",
    "If the furniture was previously painted, be sure to sand the paint off completely.",
    "Avoid using an electric sander since you could break the bamboo.",
    "Bamboo has a slippery surface, so your paint won’t stick to it unless you sand the furniture.",
    "Brush as much of the sawdust off the furniture as possible.",
    "Use a soft-bristle hand brush to wipe the surface of the furniture clean.",
    "Focus on small crannies or areas that have intricate details where sawdust is most likely to get stuck.",
    "Shake the brush off into a trash can every few minutes so you don’t reapply the sawdust to the surface.",
    "You can buy hand brushes from hardware stores, or you can use the one that came with your dustpan if you have one.",
    "Avoid using a stiff-bristled or abrasive brush since you could scratch the bamboo and leave marks on the furniture.",
    "Use the brush attachment on a vacuum to remove hard-to-reach dust.",
    "Put the brush attachment on your vacuum’s hose and run it over your furniture.",
    "Pay close attention to areas where sawdust could get caught, such as carved detail or seams between pieces.",
    "Rub the brush attachment back and forth over the furniture so the bristles lift up any dust that’s still stuck on the surface.",
    "The brush attachment will wipe off the sawdust without damaging or scratching the bamboo.",
    "If your vacuum doesn't have a brush attachment, you can buy one online or try using a crevice attachment.",
    "Wipe the furniture with a damp microfiber cloth and let it air-dry.",
    "Wet a microfiber cloth with warm water and wring it out so it isn’t dripping wet.",
    "Go over the entire piece with the rag to get rid of residual sawdust so your furniture is clean.",
    "Rewet the cloth as it dries out and continue working.",
    "After wiping the furniture down, leave it to air-dry completely so it doesn’t feel damp to the touch.",
    "Avoid getting the bamboo dripping wet since it could cause lasting damage.",
    "Priming the Bamboo Lay a drop cloth down in an outdoor work area.",
    "Find a work area that’s outdoors or in a well-ventilated space, such as a garage, for priming and painting.",
    "Fold a drop cloth in half and lay it down on the ground to protect the area underneath from overspray.",
    "Set your piece of furniture in the middle of the drop cloth.",
    "You can buy drop cloths from your local hardware store.",
    "If you don’t have a drop cloth, you can set the piece of furniture on a large sheet of cardboard instead.Warning: Avoid working in a poorly-ventilated area since spray paint produces harmful fumes.",
    "Put on safety glasses and a face mask whenever you’re painting.",
    "Wear wraparound safety glasses that cover your eyes completely.",
    "Then put on a face mask that goes over your nose and mouth so you don’t breathe in any fumes or overspray.",
    "Wear your safety equipment any time you start priming or painting.",
    "You can buy safety glasses and face masks from your local hardware store.",
    "If you’re working in an indoor area, opt for a full respirator instead of a face mask since it will protect you from fumes better.",
    "Shake a can of oil-based spray primer and hold it 6 in (15 cm) from the piece.",
    "Shake the can of primer thoroughly to ensure it’s properly mixed before you use it.",
    "Hold the can upright so it’s about 6–8 inches (15–20 cm) away from the piece of furniture so it doesn’t apply too thick or overspray.",
    "Oil-based spray primer is similar to spray paint, but it creates a base coat so the paint adheres better and has a solid color.",
    "You can buy it from your local paint supply or hardware store.",
    "Apply the primer in a thin, even coat.",
    "Press the button down on the can to start spraying your piece of furniture.",
    "Keep moving the can back and forth across the piece of furniture so you don’t apply too much primer to a single area.",
    "Continue working across the entire piece until there’s a thin, even coat of primer.",
    "Test spraying the primer on your drop cloth or a piece of cardboard first to ensure it sprays evenly.",
    "Sometimes, the primer may clog and spray unevenly the first time you use it.",
    "If you don’t apply primer before you start painting, the color won’t stick on your furniture as well and the surface will look uneven.",
    "Allow the primer to dry for 30–60 minutes.",
    "Leave the piece of furniture in an area where it won’t get disturbed so the primer has time to set.",
    "After about 30 minutes, lightly tap the surface with a finger to see if any of the primer lifts up.",
    "If the primer feels dry, then you can move on.",
    "Otherwise, allow it to sit for another 30 minutes before checking it again.",
    "Primer drying time may vary, so check the can you’re using to see how long you should wait.",
    "Sand the primed surface with 220-grit sandpaper using light pressure.",
    "Work in circular motions to smooth out any raised areas of primer so you have a smooth painting surface to work with.",
    "Replace the piece of sandpaper as it gets dirty with dust from the primer.",
    "You can also use a sanding sponge instead if you have trouble getting a good grip on the sandpaper.",
    "Wipe the furniture with a damp microfiber cloth to clean off the primer dust.",
    "Dip a microfiber cloth in warm water and wring it out.",
    "Lightly rub the primed surface with the cloth to pick up any dust left on the surface from sanding the primer.",
    "Work your way over the entire piece of furniture until you don’t lift up any more dust.",
    "You may also brush or vacuum the dust if you want.",
    "Painting the Furniture Choose an enamel spray paint for your furniture.",
    "Pick a color that matches or complements the other pieces of furniture in your home so it doesn’t clash.",
    "Get 1–2 cans of the color to ensure you have enough to coat the entire piece.",
    "You can buy enamel spray paint from a hardware or paint supply store.",
    "Enamel spray paint works for both indoor and outdoor bamboo furniture.Tip: Avoid using acrylic spray paint if you plan on keeping the furniture outdoors since it could get damaged from water.",
    "Shake the can of paint and keep it 6 in (15 cm) from your furniture.",
    "Leave the cap on the can and shake it for about 15 seconds to properly mix the paint.",
    "Position the can upright and hold it about 6 inches (15 cm) from the piece of furniture to help prevent overspray.",
    "Apply a thin coat of the paint to the bamboo furniture.",
    "Press the button down that’s on top of the can to start spraying the paint.",
    "Keep moving the can back and forth over the surface so you don’t apply paint too thickly to one area.",
    "Work your way around the entire piece until you have an even coat of color.",
    "It’s okay if you can still see some of the primer through the first coat of paint.",
    "Always work in thin layers since they’ll dry faster and make the color look consistent across the entire piece of furniture.",
    "Let the spray paint dry for 30 minutes.",
    "Leave the furniture alone so it doesn’t get disturbed while it’s drying.",
    "After about 30 minutes, check if the paint feels dry to the touch.",
    "If it does, then continue working.",
    "Otherwise, wait another 15 minutes before checking the paint again.",
    "Drying time between coats may vary depending on the kind of spray paint you have, so always check the can you’re using to find out how long they recommend you wait.",
    "Spray on additional coats until the furniture has an even finish.",
    "Start your next coat of paint and work over the entire surface of your furniture.",
    "Move the can around while you’re spraying to keep the layer thin or even.",
    "Allow the coat to dry completely before checking if you need another one.",
    "Continue adding coats of paint and allowing them to dry until the furniture has a consistent color.",
    "Usually, it will take 2–3 coats of spray paint to finish your piece.",
    "Reattach the upholstery, cushions, and hardware if needed.",
    "Once the paint dries, set the cushions or upholstery back on the furniture.",
    "Use a screwdriver or a hammer to reattach the fasteners so the upholstery doesn’t move around or shift."
  ],
  "tyn_section":[
    "Screwdriver",
    "150-grit sandpaper",
    "Brush",
    "Vacuum with brush attachment",
    "Microfiber cloth",
    "Drop cloth",
    "Safety glasses",
    "Face mask",
    "Oil spray primer",
    "220-grit sandpaper",
    "Enamel spray paint"
  ],
  "tyn_model":[
    "primer",
    "paint",
    "bamboo",
    "drop cloth",
    "spray paint",
    "microfiber cloth",
    "sandpaper",
    "vacuum",
    "water",
    "safety glasses",
    "face mask",
    "enamel spray paint",
    "screwdriver",
    "oil-based spray primer",
    "pliers",
    "upholstery",
    "150-grit sandpaper",
    "electric sander",
    "brushes",
    "dustpan",
    "brush",
    "drop cloths",
    "cardboard",
    "face masks",
    "220-grit sandpaper",
    "sanding sponge",
    "acrylic spray paint",
    "hammer",
    "fasteners"
  ],
  "simple_metrics":{
    "r":0.8181818182,
    "p":0.3103448276,
    "f1":0.45,
    "avg_pos":0.4137931034
  },
  "jacc_metrics_0.5":{
    "r":0.9090909091,
    "p":0.4482758621,
    "f1":0.6004618938
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9090909091,
    "p":0.5862068966,
    "f1":0.71278826
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8181818182,
    "p":0.3448275862,
    "f1":0.4851752022
  }
}