{
  "title":"How to Make a Cactus Terrarium",
  "url":"https://www.wikihow.com/Make-a-Cactus-Terrarium",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Succulents and Cacti"
  ],
  "parts":[
    {
      "name":"Assembling the Terrarium",
      "steps":[
        {
          "headline":"Choose an appropriately-sized clear glass container with a wide opening.",
          "description":"Pick a glass container for your terrarium that is large enough to hold all the cacti you want to put in it. Make sure the opening at the top is not narrower than the container itself. You can use things like glass bowls, dishes, jars, and vases. A wide opening is important so that the cacti can grow upwards and receive airflow. Don’t use a container like a fish bowl that has a narrow opening at the top."
        },
        {
          "headline":"Wash out and dry the container.",
          "description":"Wash the container with a mild dish detergent and water to clean out any contaminants. Rinse it out thoroughly, then dry it out completely with a clean towel so there is no moisture left in the container."
        },
        {
          "headline":"Fill the bottom of the container with 1.5 in (3.8 cm) of gravel or small rocks.",
          "description":"Carefully pour the gravel or rocks into the bottom of the container. Use your hands to spread them out in an even layer. This base layer will collect excess water so the cacti can drain properly. Cacti don’t like to have wet roots."
        },
        {
          "headline":"Cover the gravel or rocks with a layer of fine mesh.",
          "description":"Use sharp scissors to cut a piece of fine mesh material, such as window screen, to approximately the size of the container’s opening. Place the mesh on top of the base layer of gravel or rocks.Tip: You can sprinkle a few pieces of gravel or a few rocks around on top of the mesh to help keep it in place. If the mesh curls up onto the sides of the glass container, trim off additional material until you get a better fit."
        },
        {
          "headline":"Add about 2.5 in (6.4 cm) of cacti potting soil on top of the mesh.",
          "description":"Pour in some substrate potting soil meant for cacti and succulents on top of the mesh layer. Spread it out with your hands to even it out and add or remove soil if you need to until the layer of substrate is about 2.5 in (6.4 cm) thick. Don’t use any other type of potting soil that is not meant for cacti and succulents. Other substrates will not drain well enough for your cacti."
        }
      ]
    },
    {
      "name":"Adding Cacti and Decorations",
      "steps":[
        {
          "headline":"Plant your largest cactus at the back of the container.",
          "description":"Carefully remove the largest cacti from its pot and shake off the excess soil from its roots. Use your fingers or a spoon to make a hole in the soil at the back of your terrarium container big enough for its root system. Place the cactus gently in the hole and pack the soil around it. Placing the largest cactus at the back of the container creates a backdrop for the rest of the cacti so none of them will be blocked from view."
        },
        {
          "headline":"Add the rest of the cacti from the back forward, working your way down in size.",
          "description":"Plant the next largest cacti in front of the largest one, towards the middle of the container. Put the smallest cacti in the soil at the very front of the terrarium. If you have multiple cacti of the same size, you can play around with different arrangements in the terrarium. Dig holes for the cacti and set them in the holes without packing the soil around them. Switch the layout around until you find an arrangement that you like best, then pack the soil around the cacti. If there is any soil stuck in the prickles of your cacti, you can use a straw to blow it out."
        },
        {
          "headline":"Cover the soil with about 0.25 in (0.64 cm) of sand.",
          "description":"Use any kind of sand that you think will look nice, such as white sand or a desert blend of sand. Carefully sprinkle it around the planted cacti on top of the soil until you cover up all the substrate. You can use a straw to blow the sand around to even it out and get it right up against the bases of the cacti."
        },
        {
          "headline":"Place some rocks on top of the sand for decoration.",
          "description":"Put some gravel, small rocks, or pebbles around the sides of the terrarium and in between the cacti to add some landscape features. Use a mix of different shapes, sizes, and colors for variety. You can use as many or as few rocks as you want for this step. It’s totally up to you to get creative and make your terrarium look how you want it to! Note that the size and placement of these rocks is not important as they are just for decoration, unlike the layer of rocks or gravel underneath the soil, which is for drainage."
        },
        {
          "headline":"Add any other decorations you want to the terrarium.",
          "description":"Place some sticks, twigs, or bark around the terrarium for additional natural-looking landscape features. Put other things like small statues, figurines, or toys in if you want to add more of a personal touch.Tip: Don’t overdo it and crowd the cacti with the decorations. Just add a few natural elements to make the cacti look at home or add some unique items to create more visual interest. For example, you could place a small lizard toy in the terrarium if you want to add to the desert vibes. Or, you could put aquarium-style sculptures of Roman columns or Greek statues if you want to make the terrarium look like an ancient ruined city. Other ideas for decorations include colored sand, crystals, sea shells, or decorative doll house items."
        }
      ]
    },
    {
      "name":"Caring for Your Terrarium",
      "steps":[
        {
          "headline":"Place the terrarium where it will receive 4 hours of direct sunlight every day.",
          "description":"Cacti need to receive lots of sunlight to survive and thrive. Put your terrarium on a table, shelf, or another type of stand near a window in a spot that gets regular daily sun. Remember to open any curtains or blinds during the day to let as much sun in as you can."
        },
        {
          "headline":"Water your terrarium lightly every 2 weeks or when the soil dries out.",
          "description":"Use a spray bottle to spray water around the base of each cactus once every 2 weeks, or whenever the soil starts looking dry. Don’t totally saturate the soil in your terrarium because the water won’t drain out and your cacti might die. Too much water trapped in your terrarium can also cause excessive humidity or mold, both of which aren’t good for your cacti."
        },
        {
          "headline":"Scrape away mold if you ever see any on the sand.",
          "description":"Watch out for white fluff or anything else that looks like mold in your terrarium. Gently scrape it away with a spoon and throw it away.Tip: If mold becomes a persistent problem, try watering your cacti less and use distilled water if you can. You can sprinkle some cinnamon around the terrarium after you remove mold to keep it from coming back. Cinnamon is a natural fungi fighting agent."
        }
      ]
    }
  ],
  "text":" Assembling the Terrarium Choose an appropriately-sized clear glass container with a wide opening. Pick a glass container for your terrarium that is large enough to hold all the cacti you want to put in it. Make sure the opening at the top is not narrower than the container itself. You can use things like glass bowls, dishes, jars, and vases. A wide opening is important so that the cacti can grow upwards and receive airflow. Don’t use a container like a fish bowl that has a narrow opening at the top. Wash out and dry the container. Wash the container with a mild dish detergent and water to clean out any contaminants. Rinse it out thoroughly, then dry it out completely with a clean towel so there is no moisture left in the container. Fill the bottom of the container with 1.5 in (3.8 cm) of gravel or small rocks. Carefully pour the gravel or rocks into the bottom of the container. Use your hands to spread them out in an even layer. This base layer will collect excess water so the cacti can drain properly. Cacti don’t like to have wet roots. Cover the gravel or rocks with a layer of fine mesh. Use sharp scissors to cut a piece of fine mesh material, such as window screen, to approximately the size of the container’s opening. Place the mesh on top of the base layer of gravel or rocks.Tip: You can sprinkle a few pieces of gravel or a few rocks around on top of the mesh to help keep it in place. If the mesh curls up onto the sides of the glass container, trim off additional material until you get a better fit. Add about 2.5 in (6.4 cm) of cacti potting soil on top of the mesh. Pour in some substrate potting soil meant for cacti and succulents on top of the mesh layer. Spread it out with your hands to even it out and add or remove soil if you need to until the layer of substrate is about 2.5 in (6.4 cm) thick. Don’t use any other type of potting soil that is not meant for cacti and succulents. Other substrates will not drain well enough for your cacti. Adding Cacti and Decorations Plant your largest cactus at the back of the container. Carefully remove the largest cacti from its pot and shake off the excess soil from its roots. Use your fingers or a spoon to make a hole in the soil at the back of your terrarium container big enough for its root system. Place the cactus gently in the hole and pack the soil around it. Placing the largest cactus at the back of the container creates a backdrop for the rest of the cacti so none of them will be blocked from view. Add the rest of the cacti from the back forward, working your way down in size. Plant the next largest cacti in front of the largest one, towards the middle of the container. Put the smallest cacti in the soil at the very front of the terrarium. If you have multiple cacti of the same size, you can play around with different arrangements in the terrarium. Dig holes for the cacti and set them in the holes without packing the soil around them. Switch the layout around until you find an arrangement that you like best, then pack the soil around the cacti. If there is any soil stuck in the prickles of your cacti, you can use a straw to blow it out. Cover the soil with about 0.25 in (0.64 cm) of sand. Use any kind of sand that you think will look nice, such as white sand or a desert blend of sand. Carefully sprinkle it around the planted cacti on top of the soil until you cover up all the substrate. You can use a straw to blow the sand around to even it out and get it right up against the bases of the cacti. Place some rocks on top of the sand for decoration. Put some gravel, small rocks, or pebbles around the sides of the terrarium and in between the cacti to add some landscape features. Use a mix of different shapes, sizes, and colors for variety. You can use as many or as few rocks as you want for this step. It’s totally up to you to get creative and make your terrarium look how you want it to! Note that the size and placement of these rocks is not important as they are just for decoration, unlike the layer of rocks or gravel underneath the soil, which is for drainage. Add any other decorations you want to the terrarium. Place some sticks, twigs, or bark around the terrarium for additional natural-looking landscape features. Put other things like small statues, figurines, or toys in if you want to add more of a personal touch.Tip: Don’t overdo it and crowd the cacti with the decorations. Just add a few natural elements to make the cacti look at home or add some unique items to create more visual interest. For example, you could place a small lizard toy in the terrarium if you want to add to the desert vibes. Or, you could put aquarium-style sculptures of Roman columns or Greek statues if you want to make the terrarium look like an ancient ruined city. Other ideas for decorations include colored sand, crystals, sea shells, or decorative doll house items. Caring for Your Terrarium Place the terrarium where it will receive 4 hours of direct sunlight every day. Cacti need to receive lots of sunlight to survive and thrive. Put your terrarium on a table, shelf, or another type of stand near a window in a spot that gets regular daily sun. Remember to open any curtains or blinds during the day to let as much sun in as you can. Water your terrarium lightly every 2 weeks or when the soil dries out. Use a spray bottle to spray water around the base of each cactus once every 2 weeks, or whenever the soil starts looking dry. Don’t totally saturate the soil in your terrarium because the water won’t drain out and your cacti might die. Too much water trapped in your terrarium can also cause excessive humidity or mold, both of which aren’t good for your cacti. Scrape away mold if you ever see any on the sand. Watch out for white fluff or anything else that looks like mold in your terrarium. Gently scrape it away with a spoon and throw it away.Tip: If mold becomes a persistent problem, try watering your cacti less and use distilled water if you can. You can sprinkle some cinnamon around the terrarium after you remove mold to keep it from coming back. Cinnamon is a natural fungi fighting agent.",
  "sentences":[
    " Assembling the Terrarium Choose an appropriately-sized clear glass container with a wide opening.",
    "Pick a glass container for your terrarium that is large enough to hold all the cacti you want to put in it.",
    "Make sure the opening at the top is not narrower than the container itself.",
    "You can use things like glass bowls, dishes, jars, and vases.",
    "A wide opening is important so that the cacti can grow upwards and receive airflow.",
    "Don’t use a container like a fish bowl that has a narrow opening at the top.",
    "Wash out and dry the container.",
    "Wash the container with a mild dish detergent and water to clean out any contaminants.",
    "Rinse it out thoroughly, then dry it out completely with a clean towel so there is no moisture left in the container.",
    "Fill the bottom of the container with 1.5 in (3.8 cm) of gravel or small rocks.",
    "Carefully pour the gravel or rocks into the bottom of the container.",
    "Use your hands to spread them out in an even layer.",
    "This base layer will collect excess water so the cacti can drain properly.",
    "Cacti don’t like to have wet roots.",
    "Cover the gravel or rocks with a layer of fine mesh.",
    "Use sharp scissors to cut a piece of fine mesh material, such as window screen, to approximately the size of the container’s opening.",
    "Place the mesh on top of the base layer of gravel or rocks.Tip: You can sprinkle a few pieces of gravel or a few rocks around on top of the mesh to help keep it in place.",
    "If the mesh curls up onto the sides of the glass container, trim off additional material until you get a better fit.",
    "Add about 2.5 in (6.4 cm) of cacti potting soil on top of the mesh.",
    "Pour in some substrate potting soil meant for cacti and succulents on top of the mesh layer.",
    "Spread it out with your hands to even it out and add or remove soil if you need to until the layer of substrate is about 2.5 in (6.4 cm) thick.",
    "Don’t use any other type of potting soil that is not meant for cacti and succulents.",
    "Other substrates will not drain well enough for your cacti.",
    "Adding Cacti and Decorations Plant your largest cactus at the back of the container.",
    "Carefully remove the largest cacti from its pot and shake off the excess soil from its roots.",
    "Use your fingers or a spoon to make a hole in the soil at the back of your terrarium container big enough for its root system.",
    "Place the cactus gently in the hole and pack the soil around it.",
    "Placing the largest cactus at the back of the container creates a backdrop for the rest of the cacti so none of them will be blocked from view.",
    "Add the rest of the cacti from the back forward, working your way down in size.",
    "Plant the next largest cacti in front of the largest one, towards the middle of the container.",
    "Put the smallest cacti in the soil at the very front of the terrarium.",
    "If you have multiple cacti of the same size, you can play around with different arrangements in the terrarium.",
    "Dig holes for the cacti and set them in the holes without packing the soil around them.",
    "Switch the layout around until you find an arrangement that you like best, then pack the soil around the cacti.",
    "If there is any soil stuck in the prickles of your cacti, you can use a straw to blow it out.",
    "Cover the soil with about 0.25 in (0.64 cm) of sand.",
    "Use any kind of sand that you think will look nice, such as white sand or a desert blend of sand.",
    "Carefully sprinkle it around the planted cacti on top of the soil until you cover up all the substrate.",
    "You can use a straw to blow the sand around to even it out and get it right up against the bases of the cacti.",
    "Place some rocks on top of the sand for decoration.",
    "Put some gravel, small rocks, or pebbles around the sides of the terrarium and in between the cacti to add some landscape features.",
    "Use a mix of different shapes, sizes, and colors for variety.",
    "You can use as many or as few rocks as you want for this step.",
    "It’s totally up to you to get creative and make your terrarium look how you want it to!",
    "Note that the size and placement of these rocks is not important as they are just for decoration, unlike the layer of rocks or gravel underneath the soil, which is for drainage.",
    "Add any other decorations you want to the terrarium.",
    "Place some sticks, twigs, or bark around the terrarium for additional natural-looking landscape features.",
    "Put other things like small statues, figurines, or toys in if you want to add more of a personal touch.Tip: Don’t overdo it and crowd the cacti with the decorations.",
    "Just add a few natural elements to make the cacti look at home or add some unique items to create more visual interest.",
    "For example, you could place a small lizard toy in the terrarium if you want to add to the desert vibes.",
    "Or, you could put aquarium-style sculptures of Roman columns or Greek statues if you want to make the terrarium look like an ancient ruined city.",
    "Other ideas for decorations include colored sand, crystals, sea shells, or decorative doll house items.",
    "Caring for Your Terrarium Place the terrarium where it will receive 4 hours of direct sunlight every day.",
    "Cacti need to receive lots of sunlight to survive and thrive.",
    "Put your terrarium on a table, shelf, or another type of stand near a window in a spot that gets regular daily sun.",
    "Remember to open any curtains or blinds during the day to let as much sun in as you can.",
    "Water your terrarium lightly every 2 weeks or when the soil dries out.",
    "Use a spray bottle to spray water around the base of each cactus once every 2 weeks, or whenever the soil starts looking dry.",
    "Don’t totally saturate the soil in your terrarium because the water won’t drain out and your cacti might die.",
    "Too much water trapped in your terrarium can also cause excessive humidity or mold, both of which aren’t good for your cacti.",
    "Scrape away mold if you ever see any on the sand.",
    "Watch out for white fluff or anything else that looks like mold in your terrarium.",
    "Gently scrape it away with a spoon and throw it away.Tip: If mold becomes a persistent problem, try watering your cacti less and use distilled water if you can.",
    "You can sprinkle some cinnamon around the terrarium after you remove mold to keep it from coming back.",
    "Cinnamon is a natural fungi fighting agent."
  ],
  "tyn_section":[
    "Cacti",
    "Glass container",
    "Gravel or rocks",
    "Fine mesh",
    "Cacti potting soil",
    "Sand",
    "Decorations",
    "Spoon (optional)",
    "Straw (optional)",
    "Cinnamon (optional)",
    "Spray bottle",
    "Distilled water (optional)"
  ],
  "tyn_model":[
    "rocks",
    "gravel",
    "soil",
    "container",
    "water",
    "sand",
    "spoon",
    "straw",
    "cinnamon",
    "clear glass container",
    "glass container",
    "glass bowls",
    "dishes",
    "jars",
    "vases",
    "dish detergent",
    "fine mesh",
    "scissors",
    "fine mesh material",
    "cacti potting soil",
    "substrate potting soil",
    "substrate",
    "potting soil",
    "pot",
    "terrarium container",
    "terrarium",
    "twigs",
    "bark",
    "decorations",
    "colored sand",
    "crystals",
    "sea shells",
    "spray bottle",
    "distilled water"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1764705882,
    "f1":0.2608695652,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.4705882353,
    "f1":0.6015037594
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.6470588235,
    "f1":0.7857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5833333333,
    "p":0.2941176471,
    "f1":0.3910614525
  }
}