{
  "title":"How to Adjust Self‐Closing Door Hinges",
  "url":"https://www.wikihow.com/Adjust-Self%E2%80%90Closing-Door-Hinges",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows"
  ],
  "methods":[
    {
      "name":"Changing Tension with a Hex Wrench",
      "steps":[
        {
          "headline":"Close the door completely.",
          "description":"Stand on the side of the door with the hinges and shut the door until it latches. If possible, lock the door to ensure that no one opens it while you’re working, or else they could break the hinges. If you can’t lock the door, then tell other people in your home not to use the door while you’re making your adjustments. Avoid working on your hinges while the door is open since they will have tension and could get damaged."
        },
        {
          "headline":"Unscrew the locking screws from the top hinge.",
          "description":"Check the top of the hinge to see if it has a screw, which protects the spring from being tampered with. If it does, insert a screwdriver and rotate it counterclockwise to loosen it. Set the screw aside in a place where you won’t lose it. If your hinge doesn’t have a locking screw, then you can skip this step."
        },
        {
          "headline":"Insert a hex wrench into the hole where you removed the screw.",
          "description":"Push the short end of a hex wrench into the top of the hinge. If the wrench feels loose inside the hole, rotate it until it fits into the hex-shaped hole and clicks into place. Keep the long end of the wrench pointed at a 45-degree angle to the door so you have a full range of motion to make your adjustments. You can buy hex wrench sets from your local hardware store. If you bought the hinges, they may have come with a hex wrench."
        },
        {
          "headline":"Turn the wrench clockwise if you want the door to close faster.",
          "description":"Press the wrench down firmly to engage the locking mechanism inside the hinge. Rotate the wrench a quarter turn clockwise until you hear it click into the new position. Only adjust the hinge by 1 position at a time so you don’t overtighten or break the hinge. If the hinge doesn’t rotate any further clockwise, then you already have the hinge as tight as possible."
        },
        {
          "headline":"Rotate the wrench counterclockwise if the door slams closed.",
          "description":"Push down on the wrench so the locking mechanism in the hinge rotates freely. Move the long arm of the wrench counterclockwise until you hear it click into the next position, which is usually a quarter turn. Lift the wrench up to secure the locking mechanism. If the long arm of the wrench bumps into the door or jamb when you turn it, pull the wrench out of the hole and reposition it.Tip: If you want to completely disengage the hinge so it doesn’t automatically close, turn the locking mechanism counterclockwise as far as possible."
        },
        {
          "headline":"Adjust the bottom hinge to the same tension as the one on top.",
          "description":"Remove the locking screw from the bottom hinge and insert the hex wrench in the hole. If you tightened the top hinge, turn the bottom hinge clockwise by the same amount. Otherwise, turn the wrench counterclockwise to relieve tension from the hinge. If the door has 3 hinges, usually the ones on top and bottom are the only ones you need to adjust."
        },
        {
          "headline":"Open the door to test if it closes without slamming.",
          "description":"Pull the door open as far as possible and let go of it. Pay attention to how fast the door closes and if it latches shut. If it closes quickly and slams shut, loosen the tension in the hinges until it closes quietly. If the door doesn’t close far enough to latch, then tighten the hinge by 1 more position. Only test the door after adjusting both hinges since you could damage or break them otherwise."
        },
        {
          "headline":"Reinstall the locking screws on the hinges.",
          "description":"Place the screws back inside the holes on top of the hinges. Turn them clockwise with a screwdriver until the heads are flush with the hinges. If you don’t replace the locking screws, dust or debris can get into the hinges and make them work less efficiently."
        }
      ]
    },
    {
      "name":"Repositioning the Locking Pins",
      "steps":[
        {
          "headline":"Shut the door so you don’t damage the hinges.",
          "description":"Close the door completely so it’s latched closed. If you can, lock the door so no one’s able to open it while you’re working. Otherwise, let other people know that you’re adjusting the hinges so they shouldn’t use the door. Don’t make any adjustments to the hinges if you haven’t already attached them to the door and frame. Leaving the door open while you’re making adjustments could damage the hinges."
        },
        {
          "headline":"Insert a tension rod in the rightmost hole in the top hinge’s adjustment slot.",
          "description":"Use the small metal tension rod that came with your hinges when you purchased them. Look on the side of the hinge near the top for a horizontal adjustment slot that has a line of holes inside. Find the hole that’s furthest to the right in the adjustment slot. Push the rod into the hole far enough so it stays in place. If you don’t have a tension rod, you may be able to use a hex wrench with a diameter smaller than the hole instead."
        },
        {
          "headline":"Move the rod clockwise to loosen the tension pin.",
          "description":"Push the rod clockwise around the hinge until it touches the left side of the adjustment slot. As you turn the rod, locate the metal tension pin inside of a hole on the right side of the adjustment slot. Keep holding the rod against the left side so it doesn’t move or shift around. Don’t let go of the tension rod, or else it will snap back to the right side of the adjustment slot and may damage the hinge."
        },
        {
          "headline":"Remove the tension pin next to the door with needlenose pliers.",
          "description":"Hold the tension rod against the left side of the slot with your nondominant hand. Grip the end of the tension pin with needlenose pliers and pull it straight out from the hinge. Maintain your grip on the pin since you’ll be putting it back in a different hole right away. Taking the tension pins out of the hinges will completely disengage them if you don’t want the door to close automatically."
        },
        {
          "headline":"Insert the pin in the next hole on the right to make the door close faster.",
          "description":"While still holding the tension rod against the left side, locate the new hole that’s furthest to the right. Guide the pin into the hole and push it in as far as it can go. Slowly turn the tension rod counterclockwise until the pin presses against the right side of the slot. Only adjust the hinge by 1 hole at a time so you don’t overtighten the hinge."
        },
        {
          "headline":"Place the pin in the hole left of the original position so the door shuts slower.",
          "description":"Keep holding the tension rod against the left side of the slot. Find the hole that’s just left of where the pin was originally located. Slide the pin into the hole as far as possible before turning the tension rod counterclockwise to secure it in place. You may need to reposition the tension rod 1 hole to the left in order to install the pin."
        },
        {
          "headline":"Change the position of the bottom hinge's pin so it’s the same as the top.",
          "description":"Put the tension rod in the rightmost hole on the bottom hinge and turn it clockwise so it presses against the left side. Remove the pin with your pliers before sliding it in the hole to the left or right depending on if you loosened or tightened the tension respectively. The middle hinge is usually a standard one, so you don’t have to adjust it."
        },
        {
          "headline":"Open the door to test if it closes completely without slamming.",
          "description":"Pull the door open as far as possible and let go of it so it starts to close. If the door doesn’t latch shut on its own, then move the pins 1 more hole to the right to add more tension. If the door closes too quickly or slams shut, then move the pins 1 hole to the left to loosen the hinges.Warning: Don’t place the pin any further than the 4th pin to the right since it can create too much tension that will cause the door to slam and damage the spring in the hinge."
        }
      ]
    }
  ],
  "text":" Changing Tension with a Hex Wrench Close the door completely. Stand on the side of the door with the hinges and shut the door until it latches. If possible, lock the door to ensure that no one opens it while you’re working, or else they could break the hinges. If you can’t lock the door, then tell other people in your home not to use the door while you’re making your adjustments. Avoid working on your hinges while the door is open since they will have tension and could get damaged. Unscrew the locking screws from the top hinge. Check the top of the hinge to see if it has a screw, which protects the spring from being tampered with. If it does, insert a screwdriver and rotate it counterclockwise to loosen it. Set the screw aside in a place where you won’t lose it. If your hinge doesn’t have a locking screw, then you can skip this step. Insert a hex wrench into the hole where you removed the screw. Push the short end of a hex wrench into the top of the hinge. If the wrench feels loose inside the hole, rotate it until it fits into the hex-shaped hole and clicks into place. Keep the long end of the wrench pointed at a 45-degree angle to the door so you have a full range of motion to make your adjustments. You can buy hex wrench sets from your local hardware store. If you bought the hinges, they may have come with a hex wrench. Turn the wrench clockwise if you want the door to close faster. Press the wrench down firmly to engage the locking mechanism inside the hinge. Rotate the wrench a quarter turn clockwise until you hear it click into the new position. Only adjust the hinge by 1 position at a time so you don’t overtighten or break the hinge. If the hinge doesn’t rotate any further clockwise, then you already have the hinge as tight as possible. Rotate the wrench counterclockwise if the door slams closed. Push down on the wrench so the locking mechanism in the hinge rotates freely. Move the long arm of the wrench counterclockwise until you hear it click into the next position, which is usually a quarter turn. Lift the wrench up to secure the locking mechanism. If the long arm of the wrench bumps into the door or jamb when you turn it, pull the wrench out of the hole and reposition it.Tip: If you want to completely disengage the hinge so it doesn’t automatically close, turn the locking mechanism counterclockwise as far as possible. Adjust the bottom hinge to the same tension as the one on top. Remove the locking screw from the bottom hinge and insert the hex wrench in the hole. If you tightened the top hinge, turn the bottom hinge clockwise by the same amount. Otherwise, turn the wrench counterclockwise to relieve tension from the hinge. If the door has 3 hinges, usually the ones on top and bottom are the only ones you need to adjust. Open the door to test if it closes without slamming. Pull the door open as far as possible and let go of it. Pay attention to how fast the door closes and if it latches shut. If it closes quickly and slams shut, loosen the tension in the hinges until it closes quietly. If the door doesn’t close far enough to latch, then tighten the hinge by 1 more position. Only test the door after adjusting both hinges since you could damage or break them otherwise. Reinstall the locking screws on the hinges. Place the screws back inside the holes on top of the hinges. Turn them clockwise with a screwdriver until the heads are flush with the hinges. If you don’t replace the locking screws, dust or debris can get into the hinges and make them work less efficiently. Repositioning the Locking Pins Shut the door so you don’t damage the hinges. Close the door completely so it’s latched closed. If you can, lock the door so no one’s able to open it while you’re working. Otherwise, let other people know that you’re adjusting the hinges so they shouldn’t use the door. Don’t make any adjustments to the hinges if you haven’t already attached them to the door and frame. Leaving the door open while you’re making adjustments could damage the hinges. Insert a tension rod in the rightmost hole in the top hinge’s adjustment slot. Use the small metal tension rod that came with your hinges when you purchased them. Look on the side of the hinge near the top for a horizontal adjustment slot that has a line of holes inside. Find the hole that’s furthest to the right in the adjustment slot. Push the rod into the hole far enough so it stays in place. If you don’t have a tension rod, you may be able to use a hex wrench with a diameter smaller than the hole instead. Move the rod clockwise to loosen the tension pin. Push the rod clockwise around the hinge until it touches the left side of the adjustment slot. As you turn the rod, locate the metal tension pin inside of a hole on the right side of the adjustment slot. Keep holding the rod against the left side so it doesn’t move or shift around. Don’t let go of the tension rod, or else it will snap back to the right side of the adjustment slot and may damage the hinge. Remove the tension pin next to the door with needlenose pliers. Hold the tension rod against the left side of the slot with your nondominant hand. Grip the end of the tension pin with needlenose pliers and pull it straight out from the hinge. Maintain your grip on the pin since you’ll be putting it back in a different hole right away. Taking the tension pins out of the hinges will completely disengage them if you don’t want the door to close automatically. Insert the pin in the next hole on the right to make the door close faster. While still holding the tension rod against the left side, locate the new hole that’s furthest to the right. Guide the pin into the hole and push it in as far as it can go. Slowly turn the tension rod counterclockwise until the pin presses against the right side of the slot. Only adjust the hinge by 1 hole at a time so you don’t overtighten the hinge. Place the pin in the hole left of the original position so the door shuts slower. Keep holding the tension rod against the left side of the slot. Find the hole that’s just left of where the pin was originally located. Slide the pin into the hole as far as possible before turning the tension rod counterclockwise to secure it in place. You may need to reposition the tension rod 1 hole to the left in order to install the pin. Change the position of the bottom hinge's pin so it’s the same as the top. Put the tension rod in the rightmost hole on the bottom hinge and turn it clockwise so it presses against the left side. Remove the pin with your pliers before sliding it in the hole to the left or right depending on if you loosened or tightened the tension respectively. The middle hinge is usually a standard one, so you don’t have to adjust it. Open the door to test if it closes completely without slamming. Pull the door open as far as possible and let go of it so it starts to close. If the door doesn’t latch shut on its own, then move the pins 1 more hole to the right to add more tension. If the door closes too quickly or slams shut, then move the pins 1 hole to the left to loosen the hinges.Warning: Don’t place the pin any further than the 4th pin to the right since it can create too much tension that will cause the door to slam and damage the spring in the hinge.",
  "sentences":[
    " Changing Tension with a Hex Wrench Close the door completely.",
    "Stand on the side of the door with the hinges and shut the door until it latches.",
    "If possible, lock the door to ensure that no one opens it while you’re working, or else they could break the hinges.",
    "If you can’t lock the door, then tell other people in your home not to use the door while you’re making your adjustments.",
    "Avoid working on your hinges while the door is open since they will have tension and could get damaged.",
    "Unscrew the locking screws from the top hinge.",
    "Check the top of the hinge to see if it has a screw, which protects the spring from being tampered with.",
    "If it does, insert a screwdriver and rotate it counterclockwise to loosen it.",
    "Set the screw aside in a place where you won’t lose it.",
    "If your hinge doesn’t have a locking screw, then you can skip this step.",
    "Insert a hex wrench into the hole where you removed the screw.",
    "Push the short end of a hex wrench into the top of the hinge.",
    "If the wrench feels loose inside the hole, rotate it until it fits into the hex-shaped hole and clicks into place.",
    "Keep the long end of the wrench pointed at a 45-degree angle to the door so you have a full range of motion to make your adjustments.",
    "You can buy hex wrench sets from your local hardware store.",
    "If you bought the hinges, they may have come with a hex wrench.",
    "Turn the wrench clockwise if you want the door to close faster.",
    "Press the wrench down firmly to engage the locking mechanism inside the hinge.",
    "Rotate the wrench a quarter turn clockwise until you hear it click into the new position.",
    "Only adjust the hinge by 1 position at a time so you don’t overtighten or break the hinge.",
    "If the hinge doesn’t rotate any further clockwise, then you already have the hinge as tight as possible.",
    "Rotate the wrench counterclockwise if the door slams closed.",
    "Push down on the wrench so the locking mechanism in the hinge rotates freely.",
    "Move the long arm of the wrench counterclockwise until you hear it click into the next position, which is usually a quarter turn.",
    "Lift the wrench up to secure the locking mechanism.",
    "If the long arm of the wrench bumps into the door or jamb when you turn it, pull the wrench out of the hole and reposition it.Tip: If you want to completely disengage the hinge so it doesn’t automatically close, turn the locking mechanism counterclockwise as far as possible.",
    "Adjust the bottom hinge to the same tension as the one on top.",
    "Remove the locking screw from the bottom hinge and insert the hex wrench in the hole.",
    "If you tightened the top hinge, turn the bottom hinge clockwise by the same amount.",
    "Otherwise, turn the wrench counterclockwise to relieve tension from the hinge.",
    "If the door has 3 hinges, usually the ones on top and bottom are the only ones you need to adjust.",
    "Open the door to test if it closes without slamming.",
    "Pull the door open as far as possible and let go of it.",
    "Pay attention to how fast the door closes and if it latches shut.",
    "If it closes quickly and slams shut, loosen the tension in the hinges until it closes quietly.",
    "If the door doesn’t close far enough to latch, then tighten the hinge by 1 more position.",
    "Only test the door after adjusting both hinges since you could damage or break them otherwise.",
    "Reinstall the locking screws on the hinges.",
    "Place the screws back inside the holes on top of the hinges.",
    "Turn them clockwise with a screwdriver until the heads are flush with the hinges.",
    "If you don’t replace the locking screws, dust or debris can get into the hinges and make them work less efficiently.",
    "Repositioning the Locking Pins Shut the door so you don’t damage the hinges.",
    "Close the door completely so it’s latched closed.",
    "If you can, lock the door so no one’s able to open it while you’re working.",
    "Otherwise, let other people know that you’re adjusting the hinges so they shouldn’t use the door.",
    "Don’t make any adjustments to the hinges if you haven’t already attached them to the door and frame.",
    "Leaving the door open while you’re making adjustments could damage the hinges.",
    "Insert a tension rod in the rightmost hole in the top hinge’s adjustment slot.",
    "Use the small metal tension rod that came with your hinges when you purchased them.",
    "Look on the side of the hinge near the top for a horizontal adjustment slot that has a line of holes inside.",
    "Find the hole that’s furthest to the right in the adjustment slot.",
    "Push the rod into the hole far enough so it stays in place.",
    "If you don’t have a tension rod, you may be able to use a hex wrench with a diameter smaller than the hole instead.",
    "Move the rod clockwise to loosen the tension pin.",
    "Push the rod clockwise around the hinge until it touches the left side of the adjustment slot.",
    "As you turn the rod, locate the metal tension pin inside of a hole on the right side of the adjustment slot.",
    "Keep holding the rod against the left side so it doesn’t move or shift around.",
    "Don’t let go of the tension rod, or else it will snap back to the right side of the adjustment slot and may damage the hinge.",
    "Remove the tension pin next to the door with needlenose pliers.",
    "Hold the tension rod against the left side of the slot with your nondominant hand.",
    "Grip the end of the tension pin with needlenose pliers and pull it straight out from the hinge.",
    "Maintain your grip on the pin since you’ll be putting it back in a different hole right away.",
    "Taking the tension pins out of the hinges will completely disengage them if you don’t want the door to close automatically.",
    "Insert the pin in the next hole on the right to make the door close faster.",
    "While still holding the tension rod against the left side, locate the new hole that’s furthest to the right.",
    "Guide the pin into the hole and push it in as far as it can go.",
    "Slowly turn the tension rod counterclockwise until the pin presses against the right side of the slot.",
    "Only adjust the hinge by 1 hole at a time so you don’t overtighten the hinge.",
    "Place the pin in the hole left of the original position so the door shuts slower.",
    "Keep holding the tension rod against the left side of the slot.",
    "Find the hole that’s just left of where the pin was originally located.",
    "Slide the pin into the hole as far as possible before turning the tension rod counterclockwise to secure it in place.",
    "You may need to reposition the tension rod 1 hole to the left in order to install the pin.",
    "Change the position of the bottom hinge's pin so it’s the same as the top.",
    "Put the tension rod in the rightmost hole on the bottom hinge and turn it clockwise so it presses against the left side.",
    "Remove the pin with your pliers before sliding it in the hole to the left or right depending on if you loosened or tightened the tension respectively.",
    "The middle hinge is usually a standard one, so you don’t have to adjust it.",
    "Open the door to test if it closes completely without slamming.",
    "Pull the door open as far as possible and let go of it so it starts to close.",
    "If the door doesn’t latch shut on its own, then move the pins 1 more hole to the right to add more tension.",
    "If the door closes too quickly or slams shut, then move the pins 1 hole to the left to loosen the hinges.Warning: Don’t place the pin any further than the 4th pin to the right since it can create too much tension that will cause the door to slam and damage the spring in the hinge."
  ],
  "tyn_section":[
    "Screwdriver",
    "Hex wrench",
    "Tension rod",
    "Needlenose pliers"
  ],
  "tyn_model":[
    "wrench",
    "tension rod",
    "hex wrench",
    "rod",
    "tension pin",
    "pin",
    "screwdriver",
    "needlenose pliers",
    "locking screws",
    "tension pins",
    "tension",
    "pliers",
    "pins"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.3076923077,
    "f1":0.4705882353,
    "avg_pos":0.4615384615
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.6153846154,
    "f1":0.7619047619
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.7692307692,
    "f1":0.8695652174
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.3076923077,
    "f1":0.4705882353
  }
}