{
  "title":"How to Grow Variegated Monstera",
  "url":"https://www.wikihow.com/Grow-Variegated-Monstera",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "methods":[
    {
      "name":"Potting a Variegated Monstera Cutting",
      "steps":[
        {
          "headline":"Get a healthy plant cutting.",
          "description":"Contact local gardening nurseries and ask if they sell variegated monstera cuttings. If they don't, search online for auction or plant sites that sell cuttings. Ensure that the cutting you buy includes a piece of the plant's stem and at least 1 leaf so it can develop roots. Pick a green cutting that doesn't feel dry or shriveled.Since variegated monstera is a mutation, it can't grow from seed. If you see variegated monstera seeds for sale, these are likely scams. You may be able to purchase a very small variegated monstera from well-stocked nurseries. If they don't have the plants, they might place you on a waiting list for when they get more in stock."
        },
        {
          "headline":"Put the cutting into water until a root system develops.",
          "description":"To propagate your cutting, place it into a tall glass or vase of cool tap water so the bottom 2 inches (5.1 cm) of the cutting is submerged. Set it in an area with indirect light and let the cutting grow for several weeks until you see roots growing from the bottom. Remember to change the water every few days or the water might begin to smell.The amount of time it takes to propagate will depend on the size and health of your cutting."
        },
        {
          "headline":"Select a pot that's at least 6 inches (15 cm) across.",
          "description":"You could use terra cotta, plastic, or glazed ceramic, depending on your climate. If you live in a hot climate, a terra cotta pot may dry out quickly so you may want to choose glazed ceramic or plastic to hold in moisture. Whichever type of pot you choose, get one that has drainage holes.Proper drainage can prevent the plant's roots from rotting."
        },
        {
          "headline":"Make a well-draining soil mix to give the plant nutrients.",
          "description":"To encourage water to drain from the soil, mix 3 parts potting soil with 2 parts perlite, pumice, or sand. This soil mix keeps nutrients around the developing root system and allows excess water to drain so the roots don't rot.Tip: If you frequently water your plants too much, add an extra 1/2 part perlite, pumice, or sand to the mix to encourage good drainage."
        },
        {
          "headline":"Plant the cutting and water the soil.",
          "description":"Fill your pot about 1/3 with the soil mix and place the cutting in the pot so the roots touch the soil. Hold the cutting in place and add enough soil mix to surround the cutting. Keep adding the soil mix until the pot is almost full. Then, water your new variegated monstera plant until water runs out of the drainage holes.Ensure that the bottom 3 inches (7.6 cm) of the cutting is submerged in the soil mix."
        }
      ]
    },
    {
      "name":"Maintaining the Variegated Monstera",
      "steps":[
        {
          "headline":"Keep the plant in a warm location between 65 and 85 °F (18 and 29 °C).",
          "description":"You can put the pot outdoors as long as your area doesn't get freezing temperatures or let the plant stay inside. It will tolerate most temperatures but the plant will put on the most growth if it's kept between 65 and 85 °F (18 and 29 °C).Tip: Don't place the pot near heaters, air conditioners, or open windows if the weather is very hot or cold. Try to maintain an even, warm temperature for the plant."
        },
        {
          "headline":"Place the plant in a bright spot where it gets indirect light.",
          "description":"Since the white part of the plant's leaves can't photosynthesize, it needs more light than standard monstera varieties. To prevent the leaves from burning, set it away from windows or filter the light through a curtain or shade.If you keep your plant outside, avoid placing it directly in the sun since the leaves can burn easily."
        },
        {
          "headline":"Water the soil whenever it begins to feel dry.",
          "description":"Check your plant every few days and use your fingers to feel the top 2 inches (5.1 cm) of soil. If they feel dry, water the soil until it feels moist and stop when water begins to come out of the pot's drainage holes.It's better to let your plant dry out just a little between waterings than to overwater it. If your home has low-humidity and the plant's leaf begins to curl, run a humidifier or spritz the leaf with water once a day."
        },
        {
          "headline":"Fertilize the plant every 2 or 3 months to add nutrients to the soil.",
          "description":"Choose a liquid fertilizer designed for indoor plants and pour it onto the plant's soil about every 2 months during the spring and summer. To prevent overfertilizing during the winter, only fertilize the plant every 3 months.Variegated fertilizer needs to be fertilized about half as often as standard monstera plants. Overfertilizing can trap salt around the roots, which prevents it from absorbing water."
        },
        {
          "headline":"Turn the pot every few weeks so your plant grows evenly.",
          "description":"You might notice that the side of the monstera that receives more light puts on more growth. To help your plant grow evenly on all sides, rotate the pot a quarter turn every week or two."
        },
        {
          "headline":"Re-pot the plant if its roots begin to grow out of the drainage holes.",
          "description":"Look at the drainage holes of the pot to ensure that the roots aren't growing out of them. If they are, get a larger pot and fill it with 3 parts potting soil and 2 parts perlite, pumice, or sand. Remove the plant from its current pot and place it in the larger one. Then, fill it in with the soil mix and water the plant.Since variegated monstera plants grow so slowly, your plant can probably grow for a few years before you need to re-pot it."
        }
      ]
    }
  ],
  "text":" Potting a Variegated Monstera Cutting Get a healthy plant cutting. Contact local gardening nurseries and ask if they sell variegated monstera cuttings. If they don't, search online for auction or plant sites that sell cuttings. Ensure that the cutting you buy includes a piece of the plant's stem and at least 1 leaf so it can develop roots. Pick a green cutting that doesn't feel dry or shriveled.Since variegated monstera is a mutation, it can't grow from seed. If you see variegated monstera seeds for sale, these are likely scams. You may be able to purchase a very small variegated monstera from well-stocked nurseries. If they don't have the plants, they might place you on a waiting list for when they get more in stock. Put the cutting into water until a root system develops. To propagate your cutting, place it into a tall glass or vase of cool tap water so the bottom 2 inches (5.1 cm) of the cutting is submerged. Set it in an area with indirect light and let the cutting grow for several weeks until you see roots growing from the bottom. Remember to change the water every few days or the water might begin to smell.The amount of time it takes to propagate will depend on the size and health of your cutting. Select a pot that's at least 6 inches (15 cm) across. You could use terra cotta, plastic, or glazed ceramic, depending on your climate. If you live in a hot climate, a terra cotta pot may dry out quickly so you may want to choose glazed ceramic or plastic to hold in moisture. Whichever type of pot you choose, get one that has drainage holes.Proper drainage can prevent the plant's roots from rotting. Make a well-draining soil mix to give the plant nutrients. To encourage water to drain from the soil, mix 3 parts potting soil with 2 parts perlite, pumice, or sand. This soil mix keeps nutrients around the developing root system and allows excess water to drain so the roots don't rot.Tip: If you frequently water your plants too much, add an extra 1/2 part perlite, pumice, or sand to the mix to encourage good drainage. Plant the cutting and water the soil. Fill your pot about 1/3 with the soil mix and place the cutting in the pot so the roots touch the soil. Hold the cutting in place and add enough soil mix to surround the cutting. Keep adding the soil mix until the pot is almost full. Then, water your new variegated monstera plant until water runs out of the drainage holes.Ensure that the bottom 3 inches (7.6 cm) of the cutting is submerged in the soil mix. Maintaining the Variegated Monstera Keep the plant in a warm location between 65 and 85 °F (18 and 29 °C). You can put the pot outdoors as long as your area doesn't get freezing temperatures or let the plant stay inside. It will tolerate most temperatures but the plant will put on the most growth if it's kept between 65 and 85 °F (18 and 29 °C).Tip: Don't place the pot near heaters, air conditioners, or open windows if the weather is very hot or cold. Try to maintain an even, warm temperature for the plant. Place the plant in a bright spot where it gets indirect light. Since the white part of the plant's leaves can't photosynthesize, it needs more light than standard monstera varieties. To prevent the leaves from burning, set it away from windows or filter the light through a curtain or shade.If you keep your plant outside, avoid placing it directly in the sun since the leaves can burn easily. Water the soil whenever it begins to feel dry. Check your plant every few days and use your fingers to feel the top 2 inches (5.1 cm) of soil. If they feel dry, water the soil until it feels moist and stop when water begins to come out of the pot's drainage holes.It's better to let your plant dry out just a little between waterings than to overwater it. If your home has low-humidity and the plant's leaf begins to curl, run a humidifier or spritz the leaf with water once a day. Fertilize the plant every 2 or 3 months to add nutrients to the soil. Choose a liquid fertilizer designed for indoor plants and pour it onto the plant's soil about every 2 months during the spring and summer. To prevent overfertilizing during the winter, only fertilize the plant every 3 months.Variegated fertilizer needs to be fertilized about half as often as standard monstera plants. Overfertilizing can trap salt around the roots, which prevents it from absorbing water. Turn the pot every few weeks so your plant grows evenly. You might notice that the side of the monstera that receives more light puts on more growth. To help your plant grow evenly on all sides, rotate the pot a quarter turn every week or two. Re-pot the plant if its roots begin to grow out of the drainage holes. Look at the drainage holes of the pot to ensure that the roots aren't growing out of them. If they are, get a larger pot and fill it with 3 parts potting soil and 2 parts perlite, pumice, or sand. Remove the plant from its current pot and place it in the larger one. Then, fill it in with the soil mix and water the plant.Since variegated monstera plants grow so slowly, your plant can probably grow for a few years before you need to re-pot it.",
  "sentences":[
    " Potting a Variegated Monstera Cutting Get a healthy plant cutting.",
    "Contact local gardening nurseries and ask if they sell variegated monstera cuttings.",
    "If they don't, search online for auction or plant sites that sell cuttings.",
    "Ensure that the cutting you buy includes a piece of the plant's stem and at least 1 leaf so it can develop roots.",
    "Pick a green cutting that doesn't feel dry or shriveled.Since variegated monstera is a mutation, it can't grow from seed.",
    "If you see variegated monstera seeds for sale, these are likely scams.",
    "You may be able to purchase a very small variegated monstera from well-stocked nurseries.",
    "If they don't have the plants, they might place you on a waiting list for when they get more in stock.",
    "Put the cutting into water until a root system develops.",
    "To propagate your cutting, place it into a tall glass or vase of cool tap water so the bottom 2 inches (5.1 cm) of the cutting is submerged.",
    "Set it in an area with indirect light and let the cutting grow for several weeks until you see roots growing from the bottom.",
    "Remember to change the water every few days or the water might begin to smell.The amount of time it takes to propagate will depend on the size and health of your cutting.",
    "Select a pot that's at least 6 inches (15 cm) across.",
    "You could use terra cotta, plastic, or glazed ceramic, depending on your climate.",
    "If you live in a hot climate, a terra cotta pot may dry out quickly so you may want to choose glazed ceramic or plastic to hold in moisture.",
    "Whichever type of pot you choose, get one that has drainage holes.Proper drainage can prevent the plant's roots from rotting.",
    "Make a well-draining soil mix to give the plant nutrients.",
    "To encourage water to drain from the soil, mix 3 parts potting soil with 2 parts perlite, pumice, or sand.",
    "This soil mix keeps nutrients around the developing root system and allows excess water to drain so the roots don't rot.Tip: If you frequently water your plants too much, add an extra 1/2 part perlite, pumice, or sand to the mix to encourage good drainage.",
    "Plant the cutting and water the soil.",
    "Fill your pot about 1/3 with the soil mix and place the cutting in the pot so the roots touch the soil.",
    "Hold the cutting in place and add enough soil mix to surround the cutting.",
    "Keep adding the soil mix until the pot is almost full.",
    "Then, water your new variegated monstera plant until water runs out of the drainage holes.Ensure that the bottom 3 inches (7.6 cm) of the cutting is submerged in the soil mix.",
    "Maintaining the Variegated Monstera Keep the plant in a warm location between 65 and 85 °F (18 and 29 °C).",
    "You can put the pot outdoors as long as your area doesn't get freezing temperatures or let the plant stay inside.",
    "It will tolerate most temperatures but the plant will put on the most growth if it's kept between 65 and 85 °F (18 and 29 °C).Tip: Don't place the pot near heaters, air conditioners, or open windows if the weather is very hot or cold.",
    "Try to maintain an even, warm temperature for the plant.",
    "Place the plant in a bright spot where it gets indirect light.",
    "Since the white part of the plant's leaves can't photosynthesize, it needs more light than standard monstera varieties.",
    "To prevent the leaves from burning, set it away from windows or filter the light through a curtain or shade.If you keep your plant outside, avoid placing it directly in the sun since the leaves can burn easily.",
    "Water the soil whenever it begins to feel dry.",
    "Check your plant every few days and use your fingers to feel the top 2 inches (5.1 cm) of soil.",
    "If they feel dry, water the soil until it feels moist and stop when water begins to come out of the pot's drainage holes.It's better to let your plant dry out just a little between waterings than to overwater it.",
    "If your home has low-humidity and the plant's leaf begins to curl, run a humidifier or spritz the leaf with water once a day.",
    "Fertilize the plant every 2 or 3 months to add nutrients to the soil.",
    "Choose a liquid fertilizer designed for indoor plants and pour it onto the plant's soil about every 2 months during the spring and summer.",
    "To prevent overfertilizing during the winter, only fertilize the plant every 3 months.Variegated fertilizer needs to be fertilized about half as often as standard monstera plants.",
    "Overfertilizing can trap salt around the roots, which prevents it from absorbing water.",
    "Turn the pot every few weeks so your plant grows evenly.",
    "You might notice that the side of the monstera that receives more light puts on more growth.",
    "To help your plant grow evenly on all sides, rotate the pot a quarter turn every week or two.",
    "Re-pot the plant if its roots begin to grow out of the drainage holes.",
    "Look at the drainage holes of the pot to ensure that the roots aren't growing out of them.",
    "If they are, get a larger pot and fill it with 3 parts potting soil and 2 parts perlite, pumice, or sand.",
    "Remove the plant from its current pot and place it in the larger one.",
    "Then, fill it in with the soil mix and water the plant.Since variegated monstera plants grow so slowly, your plant can probably grow for a few years before you need to re-pot it."
  ],
  "tyn_section":[
    "Variegated monstera cutting",
    "Potting soil",
    "Perlite, pumice, or sand",
    "Pot with drainage holes",
    "Indoor plant fertilizer"
  ],
  "tyn_model":[
    "water",
    "pot",
    "soil mix",
    "potting soil",
    "perlite",
    "fertilizer",
    "tall glass",
    "terra cotta,",
    "terra cotta pot",
    "sand",
    "air conditioners",
    "humidifier",
    "salt",
    "perlite, pumice"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0714285714,
    "f1":0.1052631579,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2,
    "p":0.0714285714,
    "f1":0.1052631579
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.2142857143,
    "f1":0.2790697674
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.0714285714,
    "f1":0.1052631579
  }
}