{
  "title":"How to Draw Christmas Trees",
  "url":"https://www.wikihow.com/Draw-Christmas-Trees",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Geography and Nature"
  ],
  "methods":[
    {
      "name":"Christmas Tree ( Decorated with lights and ornaments)",
      "steps":[
        {
          "headline":"Draw an isosceles triangle.",
          "description":""
        },
        {
          "headline":"Add a small cylinder-like pillar under the triangle attached to its base.",
          "description":""
        },
        {
          "headline":"Draw five curves on the body of the triangle at regular intervals from top to the bottom.",
          "description":""
        },
        {
          "headline":"Create leaves of the tree based on the above guides.",
          "description":""
        },
        {
          "headline":"Make garland-like outlines (like little waves) on the leaves for decorating the Christmas Tree with balls of light.",
          "description":""
        },
        {
          "headline":"Draw different kinds of circles on the above made guides as well as on the leaves randomly.",
          "description":""
        },
        {
          "headline":"Add a modest star on the apex of the triangle and enrich the decoration with stars and ribbons.",
          "description":""
        },
        {
          "headline":"Erase all guides.",
          "description":""
        },
        {
          "headline":"Color the Christmas Tree with shades of green.",
          "description":""
        }
      ]
    },
    {
      "name":"Christmas Tree (Simple)",
      "steps":[
        {
          "headline":"Make a flat shaped triangle with a curved base.",
          "description":""
        },
        {
          "headline":"Repeat the same shape overlapping the upper part but only of a smaller size.",
          "description":""
        },
        {
          "headline":"Once again overlap the apex with a smaller triangle with concave sides and a convex base thus forming the structure of the leaves of the tree.",
          "description":""
        },
        {
          "headline":"Create a small cylindrical pillar at the bottom of the triangles as the trunk of the tree originating from the centre of a disc-like structure at its bottom.",
          "description":""
        },
        {
          "headline":"Decorate the tree with a star on the apex of the tree and dangling balls hanging one each from the six tips of the tree.",
          "description":""
        },
        {
          "headline":"Erase all the above guides of the drawing of the tree.",
          "description":""
        },
        {
          "headline":"Color the tree and its decorations.",
          "description":""
        },
        {
          "headline":"Add further colorful balls on the tree and shadows.",
          "description":""
        }
      ]
    }
  ],
  "text":" Christmas Tree ( Decorated with lights and ornaments) Draw an isosceles triangle.  Add a small cylinder-like pillar under the triangle attached to its base.  Draw five curves on the body of the triangle at regular intervals from top to the bottom.  Create leaves of the tree based on the above guides.  Make garland-like outlines (like little waves) on the leaves for decorating the Christmas Tree with balls of light.  Draw different kinds of circles on the above made guides as well as on the leaves randomly.  Add a modest star on the apex of the triangle and enrich the decoration with stars and ribbons.  Erase all guides.  Color the Christmas Tree with shades of green.  Christmas Tree (Simple) Make a flat shaped triangle with a curved base.  Repeat the same shape overlapping the upper part but only of a smaller size.  Once again overlap the apex with a smaller triangle with concave sides and a convex base thus forming the structure of the leaves of the tree.  Create a small cylindrical pillar at the bottom of the triangles as the trunk of the tree originating from the centre of a disc-like structure at its bottom.  Decorate the tree with a star on the apex of the tree and dangling balls hanging one each from the six tips of the tree.  Erase all the above guides of the drawing of the tree.  Color the tree and its decorations.  Add further colorful balls on the tree and shadows. ",
  "sentences":[
    " Christmas Tree ( Decorated with lights and ornaments) Draw an isosceles triangle.",
    "Add a small cylinder-like pillar under the triangle attached to its base.",
    "Draw five curves on the body of the triangle at regular intervals from top to the bottom.",
    "Create leaves of the tree based on the above guides.",
    "Make garland-like outlines (like little waves) on the leaves for decorating the Christmas Tree with balls of light.",
    "Draw different kinds of circles on the above made guides as well as on the leaves randomly.",
    "Add a modest star on the apex of the triangle and enrich the decoration with stars and ribbons.",
    "Erase all guides.",
    "Color the Christmas Tree with shades of green.",
    "Christmas Tree (Simple) Make a flat shaped triangle with a curved base.",
    "Repeat the same shape overlapping the upper part but only of a smaller size.",
    "Once again overlap the apex with a smaller triangle with concave sides and a convex base thus forming the structure of the leaves of the tree.",
    "Create a small cylindrical pillar at the bottom of the triangles as the trunk of the tree originating from the centre of a disc-like structure at its bottom.",
    "Decorate the tree with a star on the apex of the tree and dangling balls hanging one each from the six tips of the tree.",
    "Erase all the above guides of the drawing of the tree.",
    "Color the tree and its decorations.",
    "Add further colorful balls on the tree and shadows."
  ],
  "tyn_section":[
    "Paper",
    "Pencil",
    "Pencil sharpener",
    "Eraser gum",
    "Colored pencils, crayons, markers or watercolors"
  ],
  "tyn_model":[
    "christmas tree",
    "isosceles triangle",
    "tree",
    "stars",
    "ribbons",
    "guides",
    "balls",
    "decorations"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}