{
  "title":"How to Cook Blueberries",
  "url":"https://www.wikihow.com/Cook-Blueberries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "methods":[
    {
      "name":"Making Blueberry Compote",
      "steps":[
        {
          "headline":"Rinse off your blueberries and pat them dry.",
          "description":"Put 2 cups (200 g) of blueberries into a bowl or strainer. Run cool water over them to rinse them off. Then, lay your blueberries out on a paper towel and gently pat them dry. If your blueberries are frozen, allow them to thaw completely."
        },
        {
          "headline":"Pour 1 cup (100 g) of blueberries into a saucepan.",
          "description":"Pour half of your blueberries into a large saucepan with high sides. Make sure there is no excess water on the blueberries so that they don’t burn in the pan.Only use half of your blueberries at first so that your saucepan doesn’t boil over."
        },
        {
          "headline":"Add water, granulated sugar, and lemon juice to the pan.",
          "description":"Pour in 3 tablespoons (44 mL) of water, 1/4 cup (52 g) of granulated sugar, and 2 teaspoons (9.9 mL) of lemon juice with the blueberries. Use a wooden spoon to spread your ingredients around evenly.The lemon juice and sugar give a nice balance of sweetness and sourness to your compote."
        },
        {
          "headline":"Cook your mixture over medium heat for 10 minutes.",
          "description":"Allow your mixture to simmer as it cooks. If you start to see large bubbles or your mixture boils, turn down the heat.You may see small bubbles as the mixture simmers."
        },
        {
          "headline":"Add 1 more cup (100 g) of blueberries to the pan.",
          "description":"Carefully pour in the rest of your blueberries to the saucepan. Try not to splash the mixture as they go in by pouring slowly and close to the pan."
        },
        {
          "headline":"Cook the blueberries for 8 more minutes.",
          "description":"Use your wooden spoon to stir your mixture often so that the bottom doesn’t burn. Allow the mixture to simmer, but turn down the heat if it starts to boil.Make sure your compote looks thick and still has some whole blueberries in it."
        },
        {
          "headline":"Serve the compote over cake, ice cream, or pancakes.",
          "description":"Blueberry compote is best when it is eaten warm. Drizzle it over any type of sweet dessert or use it to flavor pancakes or waffles for breakfast.Tip: To store your blueberry compote, wait for it to cool to room temperature and put it in an airtight container. Keep it in the fridge and eat it within 3 days."
        }
      ]
    },
    {
      "name":"Creating a Blueberry Sauce",
      "steps":[
        {
          "headline":"Combine your blueberries, water, orange juice, and sugar in a saucepan.",
          "description":"Choose a large saucepan with high sides. Pour in 2 cups (200 g) of blueberries, ⁄4 cup (59 mL) of water, 1 cup (240 mL) of orange juice, and 3/4 cup (156 g) of granulated sugar into the pan. The citrus of the orange juice combines with the sweetness of the sugar and blueberries to create a balanced sauce."
        },
        {
          "headline":"Bring your mixture to a boil over medium heat.",
          "description":"Stir your mixture with a wooden spoon to prevent the bottom from burning. Allow your mixture to cook over a medium heat until you see large bubbles form at the top.If your mixture starts to boil over, turn down the heat slightly."
        },
        {
          "headline":"Mix cornstarch and water together in a separate bowl.",
          "description":"Pour ⁄4 cup (59 mL) of cold water and 3 tbsp (22 g) of cornstarch into a small bowl. Mix them together with a spoon until they form a thick paste.It’s important to combine these ingredients on their own before you put them in your sauce to make sure the cornstarch will dissolve into your other ingredients."
        },
        {
          "headline":"Stir the cornstarch mixture into the saucepan.",
          "description":"Use your wooden spoon to gently fold in the cornstarch and water paste. Make sure it gets evenly distributed throughout your mixture in the saucepan.Cornstarch helps to thicken up your mixture and make it less runny."
        },
        {
          "headline":"Simmer the mixture on low for 3 to 4 minutes.",
          "description":"Turn down the heat on your burner and let your mixture simmer. If you see large bubbles, turn down the heat even more. Stir your mixture with a wooden spoon to prevent it from burning.You may see small bubbles as you mixture simmers."
        },
        {
          "headline":"Stir in the almond extract and cinnamon for added flavor.",
          "description":"Sprinkle ⁄2 teaspoon (2.5 mL) of almond extract and 1/8 tsp (0.33 g) of cinnamon to your mixture. Stir it in with your wooden spoon to distribute them evenly.Tip: These ingredients are optional, but they will add a hint of sweetness to your blueberry sauce."
        },
        {
          "headline":"Serve your blueberry sauce over waffles, scones, or cake.",
          "description":"Blueberry sauce is slightly runnier than blueberry compote, so it works great on bread-like desserts or breakfasts that will soak up the extra moisture. Wait for the sauce to cool to room temperature or enjoy it while it is warm.Store your blueberry sauce in an airtight container in the fridge and eat it within 3 days."
        }
      ]
    },
    {
      "name":"Cooking a Blueberry Chutney",
      "steps":[
        {
          "headline":"Combine onions, garlic, and orange juice in a saucepan and bring them to a boil.",
          "description":"Choose a large saucepan to hold all of your ingredients. Put 1/2 cup (75 g) of diced yellow onions, 2 cloves of minced garlic, and ⁄3 cup (79 mL) of orange juice into your saucepan. Stir your mixture as you bring it up to a boil.Tip: You can also use white onions if you prefer a more savory chutney."
        },
        {
          "headline":"Stir in the blueberries, vinegar, sugar, ginger, and sage.",
          "description":"Pour 2 1/4 cups (225 g) of blueberries, 3 tablespoons (44 mL) of balsamic vinegar, 1/4 cup (50 g) of granulated sugar, 1 tsp (2.5 g) of grated ginger, and 5 diced sage leaves into the saucepan. Stir the ingredients together with a wooden spoon.If you’d like a sweeter chutney, add 1 tsp (2.5 g) of ground cinnamon instead of the sage leaves."
        },
        {
          "headline":"Bring the mixture back up to a boil.",
          "description":"Stir your mixture often with your wooden spoon so that it doesn’t burn. Wait until you see large bubbles rise to the top of your mixture.This should only take 2 to 3 minutes at most."
        },
        {
          "headline":"Reduce the heat and allow the mixture to simmer for 30 to 40 minutes.",
          "description":"Turn the heat down until you see small bubbles rising to the top of your mixture. Leave your saucepan uncovered and let it sit until the chutney looks thick.The consistency should not be runny and there should still be chunks of onion and blueberry in your chutney."
        },
        {
          "headline":"Cool the chutney and refrigerate it.",
          "description":"Turn off the heat and set the pan aside to get it to room temperature. Pour your chutney into an airtight container and put it in the fridge until you are ready to serve it."
        },
        {
          "headline":"Serve your chutney over turkey or potatoes.",
          "description":"Blueberry chutney has a balanced mixture of savory and sweet ingredients. You can add it to a holiday meal for a touch of color on your plate to make your dish more exciting. Keep your chutney in the fridge to store it and eat it within 3 days."
        }
      ]
    }
  ],
  "text":" Making Blueberry Compote Rinse off your blueberries and pat them dry. Put 2 cups (200 g) of blueberries into a bowl or strainer. Run cool water over them to rinse them off. Then, lay your blueberries out on a paper towel and gently pat them dry. If your blueberries are frozen, allow them to thaw completely. Pour 1 cup (100 g) of blueberries into a saucepan. Pour half of your blueberries into a large saucepan with high sides. Make sure there is no excess water on the blueberries so that they don’t burn in the pan.Only use half of your blueberries at first so that your saucepan doesn’t boil over. Add water, granulated sugar, and lemon juice to the pan. Pour in 3 tablespoons (44 mL) of water, 1/4 cup (52 g) of granulated sugar, and 2 teaspoons (9.9 mL) of lemon juice with the blueberries. Use a wooden spoon to spread your ingredients around evenly.The lemon juice and sugar give a nice balance of sweetness and sourness to your compote. Cook your mixture over medium heat for 10 minutes. Allow your mixture to simmer as it cooks. If you start to see large bubbles or your mixture boils, turn down the heat.You may see small bubbles as the mixture simmers. Add 1 more cup (100 g) of blueberries to the pan. Carefully pour in the rest of your blueberries to the saucepan. Try not to splash the mixture as they go in by pouring slowly and close to the pan. Cook the blueberries for 8 more minutes. Use your wooden spoon to stir your mixture often so that the bottom doesn’t burn. Allow the mixture to simmer, but turn down the heat if it starts to boil.Make sure your compote looks thick and still has some whole blueberries in it. Serve the compote over cake, ice cream, or pancakes. Blueberry compote is best when it is eaten warm. Drizzle it over any type of sweet dessert or use it to flavor pancakes or waffles for breakfast.Tip: To store your blueberry compote, wait for it to cool to room temperature and put it in an airtight container. Keep it in the fridge and eat it within 3 days. Creating a Blueberry Sauce Combine your blueberries, water, orange juice, and sugar in a saucepan. Choose a large saucepan with high sides. Pour in 2 cups (200 g) of blueberries, ⁄4 cup (59 mL) of water, 1 cup (240 mL) of orange juice, and 3/4 cup (156 g) of granulated sugar into the pan. The citrus of the orange juice combines with the sweetness of the sugar and blueberries to create a balanced sauce. Bring your mixture to a boil over medium heat. Stir your mixture with a wooden spoon to prevent the bottom from burning. Allow your mixture to cook over a medium heat until you see large bubbles form at the top.If your mixture starts to boil over, turn down the heat slightly. Mix cornstarch and water together in a separate bowl. Pour ⁄4 cup (59 mL) of cold water and 3 tbsp (22 g) of cornstarch into a small bowl. Mix them together with a spoon until they form a thick paste.It’s important to combine these ingredients on their own before you put them in your sauce to make sure the cornstarch will dissolve into your other ingredients. Stir the cornstarch mixture into the saucepan. Use your wooden spoon to gently fold in the cornstarch and water paste. Make sure it gets evenly distributed throughout your mixture in the saucepan.Cornstarch helps to thicken up your mixture and make it less runny. Simmer the mixture on low for 3 to 4 minutes. Turn down the heat on your burner and let your mixture simmer. If you see large bubbles, turn down the heat even more. Stir your mixture with a wooden spoon to prevent it from burning.You may see small bubbles as you mixture simmers. Stir in the almond extract and cinnamon for added flavor. Sprinkle ⁄2 teaspoon (2.5 mL) of almond extract and 1/8 tsp (0.33 g) of cinnamon to your mixture. Stir it in with your wooden spoon to distribute them evenly.Tip: These ingredients are optional, but they will add a hint of sweetness to your blueberry sauce. Serve your blueberry sauce over waffles, scones, or cake. Blueberry sauce is slightly runnier than blueberry compote, so it works great on bread-like desserts or breakfasts that will soak up the extra moisture. Wait for the sauce to cool to room temperature or enjoy it while it is warm.Store your blueberry sauce in an airtight container in the fridge and eat it within 3 days. Cooking a Blueberry Chutney Combine onions, garlic, and orange juice in a saucepan and bring them to a boil. Choose a large saucepan to hold all of your ingredients. Put 1/2 cup (75 g) of diced yellow onions, 2 cloves of minced garlic, and ⁄3 cup (79 mL) of orange juice into your saucepan. Stir your mixture as you bring it up to a boil.Tip: You can also use white onions if you prefer a more savory chutney. Stir in the blueberries, vinegar, sugar, ginger, and sage. Pour 2 1/4 cups (225 g) of blueberries, 3 tablespoons (44 mL) of balsamic vinegar, 1/4 cup (50 g) of granulated sugar, 1 tsp (2.5 g) of grated ginger, and 5 diced sage leaves into the saucepan. Stir the ingredients together with a wooden spoon.If you’d like a sweeter chutney, add 1 tsp (2.5 g) of ground cinnamon instead of the sage leaves. Bring the mixture back up to a boil. Stir your mixture often with your wooden spoon so that it doesn’t burn. Wait until you see large bubbles rise to the top of your mixture.This should only take 2 to 3 minutes at most. Reduce the heat and allow the mixture to simmer for 30 to 40 minutes. Turn the heat down until you see small bubbles rising to the top of your mixture. Leave your saucepan uncovered and let it sit until the chutney looks thick.The consistency should not be runny and there should still be chunks of onion and blueberry in your chutney. Cool the chutney and refrigerate it. Turn off the heat and set the pan aside to get it to room temperature. Pour your chutney into an airtight container and put it in the fridge until you are ready to serve it. Serve your chutney over turkey or potatoes. Blueberry chutney has a balanced mixture of savory and sweet ingredients. You can add it to a holiday meal for a touch of color on your plate to make your dish more exciting. Keep your chutney in the fridge to store it and eat it within 3 days.",
  "sentences":[
    " Making Blueberry Compote Rinse off your blueberries and pat them dry.",
    "Put 2 cups (200 g) of blueberries into a bowl or strainer.",
    "Run cool water over them to rinse them off.",
    "Then, lay your blueberries out on a paper towel and gently pat them dry.",
    "If your blueberries are frozen, allow them to thaw completely.",
    "Pour 1 cup (100 g) of blueberries into a saucepan.",
    "Pour half of your blueberries into a large saucepan with high sides.",
    "Make sure there is no excess water on the blueberries so that they don’t burn in the pan.Only use half of your blueberries at first so that your saucepan doesn’t boil over.",
    "Add water, granulated sugar, and lemon juice to the pan.",
    "Pour in 3 tablespoons (44 mL) of water, 1/4 cup (52 g) of granulated sugar, and 2 teaspoons (9.9 mL) of lemon juice with the blueberries.",
    "Use a wooden spoon to spread your ingredients around evenly.The lemon juice and sugar give a nice balance of sweetness and sourness to your compote.",
    "Cook your mixture over medium heat for 10 minutes.",
    "Allow your mixture to simmer as it cooks.",
    "If you start to see large bubbles or your mixture boils, turn down the heat.You may see small bubbles as the mixture simmers.",
    "Add 1 more cup (100 g) of blueberries to the pan.",
    "Carefully pour in the rest of your blueberries to the saucepan.",
    "Try not to splash the mixture as they go in by pouring slowly and close to the pan.",
    "Cook the blueberries for 8 more minutes.",
    "Use your wooden spoon to stir your mixture often so that the bottom doesn’t burn.",
    "Allow the mixture to simmer, but turn down the heat if it starts to boil.Make sure your compote looks thick and still has some whole blueberries in it.",
    "Serve the compote over cake, ice cream, or pancakes.",
    "Blueberry compote is best when it is eaten warm.",
    "Drizzle it over any type of sweet dessert or use it to flavor pancakes or waffles for breakfast.Tip: To store your blueberry compote, wait for it to cool to room temperature and put it in an airtight container.",
    "Keep it in the fridge and eat it within 3 days.",
    "Creating a Blueberry Sauce Combine your blueberries, water, orange juice, and sugar in a saucepan.",
    "Choose a large saucepan with high sides.",
    "Pour in 2 cups (200 g) of blueberries, ⁄4 cup (59 mL) of water, 1 cup (240 mL) of orange juice, and 3/4 cup (156 g) of granulated sugar into the pan.",
    "The citrus of the orange juice combines with the sweetness of the sugar and blueberries to create a balanced sauce.",
    "Bring your mixture to a boil over medium heat.",
    "Stir your mixture with a wooden spoon to prevent the bottom from burning.",
    "Allow your mixture to cook over a medium heat until you see large bubbles form at the top.If your mixture starts to boil over, turn down the heat slightly.",
    "Mix cornstarch and water together in a separate bowl.",
    "Pour ⁄4 cup (59 mL) of cold water and 3 tbsp (22 g) of cornstarch into a small bowl.",
    "Mix them together with a spoon until they form a thick paste.It’s important to combine these ingredients on their own before you put them in your sauce to make sure the cornstarch will dissolve into your other ingredients.",
    "Stir the cornstarch mixture into the saucepan.",
    "Use your wooden spoon to gently fold in the cornstarch and water paste.",
    "Make sure it gets evenly distributed throughout your mixture in the saucepan.Cornstarch helps to thicken up your mixture and make it less runny.",
    "Simmer the mixture on low for 3 to 4 minutes.",
    "Turn down the heat on your burner and let your mixture simmer.",
    "If you see large bubbles, turn down the heat even more.",
    "Stir your mixture with a wooden spoon to prevent it from burning.You may see small bubbles as you mixture simmers.",
    "Stir in the almond extract and cinnamon for added flavor.",
    "Sprinkle ⁄2 teaspoon (2.5 mL) of almond extract and 1/8 tsp (0.33 g) of cinnamon to your mixture.",
    "Stir it in with your wooden spoon to distribute them evenly.Tip: These ingredients are optional, but they will add a hint of sweetness to your blueberry sauce.",
    "Serve your blueberry sauce over waffles, scones, or cake.",
    "Blueberry sauce is slightly runnier than blueberry compote, so it works great on bread-like desserts or breakfasts that will soak up the extra moisture.",
    "Wait for the sauce to cool to room temperature or enjoy it while it is warm.Store your blueberry sauce in an airtight container in the fridge and eat it within 3 days.",
    "Cooking a Blueberry Chutney Combine onions, garlic, and orange juice in a saucepan and bring them to a boil.",
    "Choose a large saucepan to hold all of your ingredients.",
    "Put 1/2 cup (75 g) of diced yellow onions, 2 cloves of minced garlic, and ⁄3 cup (79 mL) of orange juice into your saucepan.",
    "Stir your mixture as you bring it up to a boil.Tip: You can also use white onions if you prefer a more savory chutney.",
    "Stir in the blueberries, vinegar, sugar, ginger, and sage.",
    "Pour 2 1/4 cups (225 g) of blueberries, 3 tablespoons (44 mL) of balsamic vinegar, 1/4 cup (50 g) of granulated sugar, 1 tsp (2.5 g) of grated ginger, and 5 diced sage leaves into the saucepan.",
    "Stir the ingredients together with a wooden spoon.If you’d like a sweeter chutney, add 1 tsp (2.5 g) of ground cinnamon instead of the sage leaves.",
    "Bring the mixture back up to a boil.",
    "Stir your mixture often with your wooden spoon so that it doesn’t burn.",
    "Wait until you see large bubbles rise to the top of your mixture.This should only take 2 to 3 minutes at most.",
    "Reduce the heat and allow the mixture to simmer for 30 to 40 minutes.",
    "Turn the heat down until you see small bubbles rising to the top of your mixture.",
    "Leave your saucepan uncovered and let it sit until the chutney looks thick.The consistency should not be runny and there should still be chunks of onion and blueberry in your chutney.",
    "Cool the chutney and refrigerate it.",
    "Turn off the heat and set the pan aside to get it to room temperature.",
    "Pour your chutney into an airtight container and put it in the fridge until you are ready to serve it.",
    "Serve your chutney over turkey or potatoes.",
    "Blueberry chutney has a balanced mixture of savory and sweet ingredients.",
    "You can add it to a holiday meal for a touch of color on your plate to make your dish more exciting.",
    "Keep your chutney in the fridge to store it and eat it within 3 days."
  ],
  "tyn_section":[
    "Large saucepan",
    "Wooden spoon",
    "Small bowl"
  ],
  "tyn_model":[
    "blueberries",
    "saucepan",
    "water",
    "wooden spoon",
    "cornstarch",
    "blueberry sauce",
    "orange juice",
    "granulated sugar",
    "sugar",
    "lemon juice",
    "blueberry compote",
    "airtight container",
    "bowl",
    "pan",
    "almond extract",
    "cinnamon",
    "blueberry chutney",
    "garlic",
    "sage",
    "strainer",
    "ice cream",
    "pancakes",
    "cold water",
    "spoon",
    "onions",
    "yellow onions",
    "white onions",
    "vinegar",
    "ginger",
    "balsamic vinegar",
    "grated ginger",
    "ground cinnamon",
    "sage leaves",
    "onion",
    "fridge",
    "potatoes",
    "chutney"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.027027027,
    "f1":0.05,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.1081081081,
    "f1":0.1951219512
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.1081081081,
    "f1":0.1951219512
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.027027027,
    "f1":0.05
  }
}