{
  "title":"How to Cut Pita Bread",
  "url":"https://www.wikihow.com/Cut-Pita-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Flat Breads"
  ],
  "methods":[
    {
      "name":"Making Pita Chips",
      "steps":[
        {
          "headline":"Cut the pita in half with a chef’s knife.",
          "description":"Lay the pita bread flat on your cutting board and hold it in place with your nondominant hand. Use a sharp chef’s knife to make a straight cut through the middle of the pita bread. Press the knife down firmly so it cuts completely through the other side of the bread.Since pita is a type of flatbread, you don’t need to use a serrated knife to cut it since it won’t lose its shape.Warning: Keep your fingers away from the knife blade while you’re working so you don’t accidentally cut yourself."
        },
        {
          "headline":"Slice the halves into 2–3 in (5.1–7.6 cm) strips for rectangular pieces.",
          "description":"Stack the halves on top of one another and turn them so the cut edge faces you. Start your first cut 2 inches (5.1 cm) from the left side and push your knife through the bread. Continue making cuts along the length of the bread so each piece is 2–3 inches (5.1–7.6 cm) wide.The strips in the middle of the pita bread will be longer than the end pieces. You can either leave them or cut them into pieces that are 2 inches (5.1 cm) long if you want more chips."
        },
        {
          "headline":"Divide each half into triangles if you want larger chips.",
          "description":"Set one half of the pita on top of the other piece so the cut edges line up and face you. Start by cutting the pieces down the middle so you have 4 quarters. Then cut each of the quarters in half again so you have 8 total triangular pieces."
        },
        {
          "headline":"Bake the chips in a 400 °F (204 °C) oven for 10 minutes if you want them crispy.",
          "description":"Preheat your oven to 400 °F (204 °C) and let it heat up completely. Lay the pieces flat on a baking sheet so there’s about 1 inch (2.5 cm) of space between them. Place the baking tray on the center rack of the oven and allow them to cook for 5 minutes. Flip the pieces over before putting them back in the oven for another 5 minutes until they’re golden brown.You don’t have to bake the pita chips if you don’t want to, but they may be easier to dip since they won’t bend or fold."
        },
        {
          "headline":"Try dipping the chips in hummus or dipping oil for additional flavor.",
          "description":"You can either buy hummus from the grocery store or make your own. Look for different varieties, such as roasted red pepper or sundried tomato, so you can try new flavors. You may also try mixing olive oil with aromatic herbs, such as basil, garlic, and oregano, to create a lighter dip.If you want to enjoy the chips without dip, season them lightly with salt and pepper. For a sweeter flavor, try sprinkling a cinnamon and sugar mixture on them."
        }
      ]
    },
    {
      "name":"Creating Pita Pockets",
      "steps":[
        {
          "headline":"Lay the pita bread on your cutting board with the longest side facing you.",
          "description":"Since most pieces of pita bread have a slightly oblong shape, look for the side that’s wider than the others. Position the bread flat on the cutting board so that side is closest to you.If the pita bread is perfectly round, you can make your cut from any side. Cutting through the long side of the pita makes the pocket deeper so you’re able to put more ingredients inside.Variation: If you see a small tear or crack along the edge of the pita bread, you can also gently rip apart the top and bottom section by hand. Only rip halfway around the pita, or else ingredients could spill out."
        },
        {
          "headline":"Cut off 2–3 in (5.1–7.6 cm) of the pita’s length with a chef’s knife.",
          "description":"Position your knife so it’s about 2 inches (5.1 cm) from the left or right side. Make a straight cut through the bread, pressing the knife down firmly to ensure you go through the other side of the bread. Keep the smaller piece of pita so you’re able to use it later on.If there are cracks or rips in the pita bread, try to cut the section off so your ingredients don’t fall out later on. Keep your fingers away from the blade so you don’t accidentally cut yourself."
        },
        {
          "headline":"Peel apart the opening in the pita by hand to form a pocket.",
          "description":"Slide your finger into the cut side of the larger pita piece and move it back and forth to separate the top from the bottom. Be gentle as you work so you don’t tear through the pita. Keep pushing your finger deeper into the pocket until you reach the bottom of the pita.If you have trouble reaching the bottom of the pita with your fingers, try sliding a butter knife into the opening.Tip: If you have a hard time peeling apart the pita bread, try microwaving it for 10 seconds to help make the bread more pliable."
        },
        {
          "headline":"Put the cut piece of pita in the bottom of the pocket so it’s less likely to rip.",
          "description":"Slide the smaller pita piece into the opening so the rounded end is at the bottom of the pocket. Push the piece as far into the pita as you can. Be careful not to tear the pita pocket, or else you won’t be able to use it.The extra piece of pita will add additional support to the pocket so any ingredients you add don’t tear through the bottom."
        },
        {
          "headline":"Stuff the pocket with your favorite sandwich toppings.",
          "description":"Hold the pita pocket open with your nondominant hand so you can put ingredients inside. Start by putting in a layer of vegetables, such as tomato, lettuce, or spinach, as a base. Then put in your favorite meats or proteins to complete your meal. Hold the pita pocket so the opening is face up to keep the contents from spilling out.You can stuff your pita with any ingredients you like. Avoid using ingredients that are wet or soggy since they may cause the pita to rip."
        }
      ]
    }
  ],
  "text":" Making Pita Chips Cut the pita in half with a chef’s knife. Lay the pita bread flat on your cutting board and hold it in place with your nondominant hand. Use a sharp chef’s knife to make a straight cut through the middle of the pita bread. Press the knife down firmly so it cuts completely through the other side of the bread.Since pita is a type of flatbread, you don’t need to use a serrated knife to cut it since it won’t lose its shape.Warning: Keep your fingers away from the knife blade while you’re working so you don’t accidentally cut yourself. Slice the halves into 2–3 in (5.1–7.6 cm) strips for rectangular pieces. Stack the halves on top of one another and turn them so the cut edge faces you. Start your first cut 2 inches (5.1 cm) from the left side and push your knife through the bread. Continue making cuts along the length of the bread so each piece is 2–3 inches (5.1–7.6 cm) wide.The strips in the middle of the pita bread will be longer than the end pieces. You can either leave them or cut them into pieces that are 2 inches (5.1 cm) long if you want more chips. Divide each half into triangles if you want larger chips. Set one half of the pita on top of the other piece so the cut edges line up and face you. Start by cutting the pieces down the middle so you have 4 quarters. Then cut each of the quarters in half again so you have 8 total triangular pieces. Bake the chips in a 400 °F (204 °C) oven for 10 minutes if you want them crispy. Preheat your oven to 400 °F (204 °C) and let it heat up completely. Lay the pieces flat on a baking sheet so there’s about 1 inch (2.5 cm) of space between them. Place the baking tray on the center rack of the oven and allow them to cook for 5 minutes. Flip the pieces over before putting them back in the oven for another 5 minutes until they’re golden brown.You don’t have to bake the pita chips if you don’t want to, but they may be easier to dip since they won’t bend or fold. Try dipping the chips in hummus or dipping oil for additional flavor. You can either buy hummus from the grocery store or make your own. Look for different varieties, such as roasted red pepper or sundried tomato, so you can try new flavors. You may also try mixing olive oil with aromatic herbs, such as basil, garlic, and oregano, to create a lighter dip.If you want to enjoy the chips without dip, season them lightly with salt and pepper. For a sweeter flavor, try sprinkling a cinnamon and sugar mixture on them. Creating Pita Pockets Lay the pita bread on your cutting board with the longest side facing you. Since most pieces of pita bread have a slightly oblong shape, look for the side that’s wider than the others. Position the bread flat on the cutting board so that side is closest to you.If the pita bread is perfectly round, you can make your cut from any side. Cutting through the long side of the pita makes the pocket deeper so you’re able to put more ingredients inside.Variation: If you see a small tear or crack along the edge of the pita bread, you can also gently rip apart the top and bottom section by hand. Only rip halfway around the pita, or else ingredients could spill out. Cut off 2–3 in (5.1–7.6 cm) of the pita’s length with a chef’s knife. Position your knife so it’s about 2 inches (5.1 cm) from the left or right side. Make a straight cut through the bread, pressing the knife down firmly to ensure you go through the other side of the bread. Keep the smaller piece of pita so you’re able to use it later on.If there are cracks or rips in the pita bread, try to cut the section off so your ingredients don’t fall out later on. Keep your fingers away from the blade so you don’t accidentally cut yourself. Peel apart the opening in the pita by hand to form a pocket. Slide your finger into the cut side of the larger pita piece and move it back and forth to separate the top from the bottom. Be gentle as you work so you don’t tear through the pita. Keep pushing your finger deeper into the pocket until you reach the bottom of the pita.If you have trouble reaching the bottom of the pita with your fingers, try sliding a butter knife into the opening.Tip: If you have a hard time peeling apart the pita bread, try microwaving it for 10 seconds to help make the bread more pliable. Put the cut piece of pita in the bottom of the pocket so it’s less likely to rip. Slide the smaller pita piece into the opening so the rounded end is at the bottom of the pocket. Push the piece as far into the pita as you can. Be careful not to tear the pita pocket, or else you won’t be able to use it.The extra piece of pita will add additional support to the pocket so any ingredients you add don’t tear through the bottom. Stuff the pocket with your favorite sandwich toppings. Hold the pita pocket open with your nondominant hand so you can put ingredients inside. Start by putting in a layer of vegetables, such as tomato, lettuce, or spinach, as a base. Then put in your favorite meats or proteins to complete your meal. Hold the pita pocket so the opening is face up to keep the contents from spilling out.You can stuff your pita with any ingredients you like. Avoid using ingredients that are wet or soggy since they may cause the pita to rip.",
  "sentences":[
    " Making Pita Chips Cut the pita in half with a chef’s knife.",
    "Lay the pita bread flat on your cutting board and hold it in place with your nondominant hand.",
    "Use a sharp chef’s knife to make a straight cut through the middle of the pita bread.",
    "Press the knife down firmly so it cuts completely through the other side of the bread.Since pita is a type of flatbread, you don’t need to use a serrated knife to cut it since it won’t lose its shape.Warning: Keep your fingers away from the knife blade while you’re working so you don’t accidentally cut yourself.",
    "Slice the halves into 2–3 in (5.1–7.6 cm) strips for rectangular pieces.",
    "Stack the halves on top of one another and turn them so the cut edge faces you.",
    "Start your first cut 2 inches (5.1 cm) from the left side and push your knife through the bread.",
    "Continue making cuts along the length of the bread so each piece is 2–3 inches (5.1–7.6 cm) wide.The strips in the middle of the pita bread will be longer than the end pieces.",
    "You can either leave them or cut them into pieces that are 2 inches (5.1 cm) long if you want more chips.",
    "Divide each half into triangles if you want larger chips.",
    "Set one half of the pita on top of the other piece so the cut edges line up and face you.",
    "Start by cutting the pieces down the middle so you have 4 quarters.",
    "Then cut each of the quarters in half again so you have 8 total triangular pieces.",
    "Bake the chips in a 400 °F (204 °C) oven for 10 minutes if you want them crispy.",
    "Preheat your oven to 400 °F (204 °C) and let it heat up completely.",
    "Lay the pieces flat on a baking sheet so there’s about 1 inch (2.5 cm) of space between them.",
    "Place the baking tray on the center rack of the oven and allow them to cook for 5 minutes.",
    "Flip the pieces over before putting them back in the oven for another 5 minutes until they’re golden brown.You don’t have to bake the pita chips if you don’t want to, but they may be easier to dip since they won’t bend or fold.",
    "Try dipping the chips in hummus or dipping oil for additional flavor.",
    "You can either buy hummus from the grocery store or make your own.",
    "Look for different varieties, such as roasted red pepper or sundried tomato, so you can try new flavors.",
    "You may also try mixing olive oil with aromatic herbs, such as basil, garlic, and oregano, to create a lighter dip.If you want to enjoy the chips without dip, season them lightly with salt and pepper.",
    "For a sweeter flavor, try sprinkling a cinnamon and sugar mixture on them.",
    "Creating Pita Pockets Lay the pita bread on your cutting board with the longest side facing you.",
    "Since most pieces of pita bread have a slightly oblong shape, look for the side that’s wider than the others.",
    "Position the bread flat on the cutting board so that side is closest to you.If the pita bread is perfectly round, you can make your cut from any side.",
    "Cutting through the long side of the pita makes the pocket deeper so you’re able to put more ingredients inside.Variation: If you see a small tear or crack along the edge of the pita bread, you can also gently rip apart the top and bottom section by hand.",
    "Only rip halfway around the pita, or else ingredients could spill out.",
    "Cut off 2–3 in (5.1–7.6 cm) of the pita’s length with a chef’s knife.",
    "Position your knife so it’s about 2 inches (5.1 cm) from the left or right side.",
    "Make a straight cut through the bread, pressing the knife down firmly to ensure you go through the other side of the bread.",
    "Keep the smaller piece of pita so you’re able to use it later on.If there are cracks or rips in the pita bread, try to cut the section off so your ingredients don’t fall out later on.",
    "Keep your fingers away from the blade so you don’t accidentally cut yourself.",
    "Peel apart the opening in the pita by hand to form a pocket.",
    "Slide your finger into the cut side of the larger pita piece and move it back and forth to separate the top from the bottom.",
    "Be gentle as you work so you don’t tear through the pita.",
    "Keep pushing your finger deeper into the pocket until you reach the bottom of the pita.If you have trouble reaching the bottom of the pita with your fingers, try sliding a butter knife into the opening.Tip: If you have a hard time peeling apart the pita bread, try microwaving it for 10 seconds to help make the bread more pliable.",
    "Put the cut piece of pita in the bottom of the pocket so it’s less likely to rip.",
    "Slide the smaller pita piece into the opening so the rounded end is at the bottom of the pocket.",
    "Push the piece as far into the pita as you can.",
    "Be careful not to tear the pita pocket, or else you won’t be able to use it.The extra piece of pita will add additional support to the pocket so any ingredients you add don’t tear through the bottom.",
    "Stuff the pocket with your favorite sandwich toppings.",
    "Hold the pita pocket open with your nondominant hand so you can put ingredients inside.",
    "Start by putting in a layer of vegetables, such as tomato, lettuce, or spinach, as a base.",
    "Then put in your favorite meats or proteins to complete your meal.",
    "Hold the pita pocket so the opening is face up to keep the contents from spilling out.You can stuff your pita with any ingredients you like.",
    "Avoid using ingredients that are wet or soggy since they may cause the pita to rip."
  ],
  "tyn_section":[
    "Chef’s knife",
    "Cutting board",
    "Baking tray",
    "Oven"
  ],
  "tyn_model":[
    "pita bread",
    "pita",
    "knife",
    "oven",
    "chef’s knife",
    "bread",
    "hummus",
    "knife blade",
    "baking sheet",
    "baking tray",
    "oil",
    "sundried tomato",
    "olive oil",
    "garlic",
    "oregano",
    "salt and pepper",
    "sugar",
    "cutting board",
    "butter knife",
    "vegetables",
    "spinach"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.1904761905,
    "f1":0.32,
    "avg_pos":0.1904761905
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.2380952381,
    "f1":0.3846153846
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.380952381,
    "f1":0.5517241379
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.1904761905,
    "f1":0.32
  }
}