{
  "title":"How to Plant a Christmas Cactus",
  "url":"https://www.wikihow.com/Plant-a-Christmas-Cactus",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "methods":[
    {
      "name":"Taking and Rooting Cuttings",
      "steps":[
        {
          "headline":"Wait until late spring to take cuttings.",
          "description":"Christmas cacti flower in the winter, so it’s best to wait until late in the spring months when the plant has transitioned from the dormant stage to the growth stage. If you take cuttings when the plant is currently blooming, it may cause unnecessary stress to the plant and the cuttings may take longer to root. It's best to take the cuttings right after you water the main plant so the stems are well fed."
        },
        {
          "headline":"Twist off 3 to 4 offshoots containing 2 to 5 leaves each.",
          "description":"Each stem of Christmas cactus is made up of a series of oblong leaves separated by a narrow joint. For a clean break, use your fingers to gently twist off a few sections containing 2 to 5 leaves each.Pick healthy-looking offshoots (with no brown spots or wilting) to give each one the best chance of taking root."
        },
        {
          "headline":"Remove extra leaf segments branching off the main cutting if necessary.",
          "description":"Make sure the cutting doesn't more than 1 leaf segment branching off to the side of it because it could stunt the growth of the new plant. If there are 2 leaves on the offshoot, twist both of them off at the joint where they attach to the main cutting.No offshoots are ideal and just 1 is okay."
        },
        {
          "headline":"Place the cuttings in a cool, dry place for 1 to 2 days.",
          "description":"Giving the cuttings time to dry out will allow them to form calluses or nubs at the root ends. This is essential for the plant to heal and have the energy to take root and grow into a new plant.Make sure to place the cuttings in a place that isn't exposed to direct sunlight because it may scorch or overdry the leaves."
        },
        {
          "headline":"Fill a small pot with potting soil made for succulents.",
          "description":"Succulent soil will drain water faster than regular potting soil made for flowers or other plants. Look for a mix that's made primarily from sand, perlite, and peat.Avoid using regular potting soil for flowers or herbs because it won’t drain enough and may lead to root rot. Make sure the pot has large drainage holes on the bottom. A pot 3 in (7.6 cm) in diameter is large enough to hold 3 cuttings."
        },
        {
          "headline":"Insert the root end of each cutting 1 in (2.5 cm) into the soil.",
          "description":"Poke your finger 1 in (2.5 cm) into the soil in a triangular formation so each cutting has adequate and equal room. Place the root end of each cutting into the small indentions and rearrange the soil to hold them in place.You may need to push the cuttings deeper into the soil so they’re held upright."
        },
        {
          "headline":"Place the pot somewhere that gets 8-12 hours of indirect sunlight daily.",
          "description":"Christmas cactus can dry out too quickly or get sun-scorched from direct light. Place the pot on a center table or windowsill facing the north or east if possible. Take note of where the sun strikes the indoor area so you’re not accidentally placing it in a spot that is directly exposed to the bright afternoon sun.Christmas cacti need 12-14 hours of darkness each day, so only give your plant a maximum of 12 hours of light. Make sure to not put it in a spot near sources of heat like vents, fireplaces, and drafts."
        },
        {
          "headline":"Water the cuttings when the top 1 in (2.5 cm) of soil is dry.",
          "description":"Every 3-5 days, feel the top of the soil with your fingers to check for moisture. If it’s dry, water it sparingly—stop well before you anticipate water draining from the bottom of the planter. Too much water can cause the roots to rot.The cuttings should take root in about 6-8 weeks so be patient while your new Christmas cactus grows up."
        },
        {
          "headline":"Transplant the cuttings into larger pots when they’re 1 in (2.5 cm) tall.",
          "description":"Fill each pot with a well-draining soil mix made from sand, perlite, and peat. Carefully uproot the cuttings and place them 1 in (2.5 cm) into the soil so the roots are covered.You can place 2 of the cuttings in 1 pot if you like, just make sure they’re at 4 in (10 cm) apart."
        }
      ]
    },
    {
      "name":"Germinating and Growing Seedlings",
      "steps":[
        {
          "headline":"Purchase Christmas cactus seeds or harvest them from a pollinated plant.",
          "description":"The easiest way to get your hands on seeds is to buy them from a nursery or garden store. However, you can also grow seeds on your current plant by rubbing its pistil and stamen (coming out of the flowers) against the opposite reproductive parts of another Christmas cactus. It’s best to plant Christmas cactus seeds in the late spring. Other plants in this schlumbergera family include Thanksgiving cactus, crab cactus, and holiday cactus. Breeding plants that have different colored flowers will result in more seeds and, as a plus, the baby plant will have a beautiful mix of colors. After pollination, the bulbous seed pods will appear on the stem just under the flower in about 3 weeks."
        },
        {
          "headline":"Fill seed-starting trays with soil made for succulents.",
          "description":"Choose a tray small enough to fit into a plastic zipper bag or use extra-large bags. Look for a soil blend containing sand, perlite, and peat because these ingredients will allow the soil to properly drain without drowning the roots.Check the bottom of each tray to make sure there are drainage holes. If you don’t have seed-starting trays, a plastic container 4 inches (10 cm) long is the perfect size to create 3 rows of seeds. Just be sure to poke holes in the bottom of the container."
        },
        {
          "headline":"Wet the soil and plant the seeds ⁄2 in (1.3 cm) apart in even rows.",
          "description":"Planting several seeds at a time will increase the odds that more of them will germinate and grow into a healthy plant. If the cells of the seed-starting tray are 2 in (5.1 cm) by 2 in (5.1 cm) in size, place a maximum of 2 seeds in each cell.Note that if you’re harvesting seeds from an existing plant, you’ll need to squeeze the bulbous pod until the inner seeds come out. Let them dry on a paper towel for 1-2 weeks before planting them."
        },
        {
          "headline":"Place the container in an airtight plastic zipper bag and seal it.",
          "description":"Putting the container in a bag will keep fungi from affecting the seeds and help them retain moisture. Squeeze out all of the air before sealing the bag.The plastic bag will act as a mini-greenhouse, keeping the seeds warm and moist so they can sprout."
        },
        {
          "headline":"Put the bag in a place that receives indirect sunlight for 3 months.",
          "description":"The seeds need time to germinate, so don’t open the bag for 3 months to keep the soil and seedlings sterile. After 3 months, feel free to unzip the bag by 1 in (2.5 cm) to allow the budding plants to acclimate to the environment.You’ll notice some condensation forming on the bags—this is normal and will keep the soil moist. If you notice the soil looks dry, open the bag and water the soil until it’s moist. Reseal it when you’re done. Just like the plant, the seeds need to be in a room that’s 65°F to 75°F (18 to 20°C). After 3 months, you’ll notice small green tips sprouting from the soil. These will eventually grow into larger Christmas cacti."
        },
        {
          "headline":"Transfer the sprouts into a larger pot once they’re 2 in (5.1 cm) tall.",
          "description":"Cacti don’t mind tight spaces, but if you want your sprouts to grow into larger, healthy plants, transfer them when they’re about 2 inches (5.1 cm) tall. Carefully remove the sprout from the soil and place the root end into a pot filled with soil made for cacti.Ideally, give each sprout its own pot. However, if you want to plant more than 1 in the same pot, make sure they’re 4 in (10 cm) apart. If you notice some of the sprouts growing limp, it’s a sign their roots are cramped and you should transfer them into a larger pot right away."
        }
      ]
    },
    {
      "name":"Caring for Mature Christmas Cacti",
      "steps":[
        {
          "headline":"Keep the pot in an area that receives up to 12 hours of indirect sunlight daily.",
          "description":"Anywhere near a north or east-facing window is a good spot to place the pot. Too much sunlight can dry out the soil and stunt the growth of the plant, so be wary of how light comes into the room during sunrise and sunset. Christmas cacti need dark hours to rest, so make sure the plant is able to get 12-14 hours of darkness each night."
        },
        {
          "headline":"Set your thermostat to a temperature between 65°F and 75°F (18 and 20°C).",
          "description":"Comfortable indoor temperatures are perfect for your plant. If it’s too hot, the plant may dry out and burn. If it’s too cold, water inside the leaves can freeze and expand, damaging the plant’s cells.Make sure the pot is away from other heat sources like vents, heaters, fireplaces, and appliances. To encourage blooming, move the plant to a place that’s 60°F-65°F (15°C-18°C) in the fall (October is best)."
        },
        {
          "headline":"Water the plant when the top 1 in (2.5 cm) of soil feels dry.",
          "description":"Use your finger to feel the top of the soil. If it’s dry, pour water over the base of the plant and the entire surface of the soil. If you detect some moisture, wait 1 or 2 days and check again. How often you water the plant will also depend on your environment and season.If you live in a cool, humid environment, water the plant once a week in the spring and summer. If you live in a warm, dry climate, water it every 2 or 3 days (always check the soil first!) during spring and summer months. Water the plant less frequently during fall and winter months to encourage flowering. If you notice leaves dropping off or developing white spots, water the plant less frequently from the bottom. Place the planter in a tray filled with ⁄2 inch (1.3 cm) of water for 30 minutes."
        },
        {
          "headline":"Stop watering the plant for 6 weeks after it has bloomed.",
          "description":"Blooming takes a lot of energy and the plant won’t need as much water since it’s not focused on growing. After the plant has bloomed, wait 6 weeks to resume your regular watering schedule so it has time to rejuvenate.If you notice any buds dropping off the plant, stop watering it immediately and try relocating the plant to a place that gets a little more light."
        },
        {
          "headline":"Fertilize the plant every 2 weeks in the spring and summer as needed.",
          "description":"You don't need to fertilize your Christmas cactus on a regular basis, but you can if it looks limp and like it could use extra support. Use a fertilizer made for blooming houseplants. Formulas that read \"20-20-20\" or \"20-10-20\" on the package are good options.Only fertilize the plant once per month during the fall and winter. Make sure the blend says \"water-soluble\" on the label."
        },
        {
          "headline":"Prune your plant in the late winter to spring months.",
          "description":"Use your hands to twist off limp or discolored segments at the small joint between the leaves. Only prune the plant in the late winter or spring after it has flowered and is approaching the growing stage. Prune up to 1/3 of the entire plant to encourage it to grow.Your Christmas cactus may \"self-prune\" by dropping leaves. However, losing leaves can also be a sign of stress from overwatering or under-watering. You may want to prune your plant if it becomes so large that it’s unmanageable. This is also a good time to remove cuttings if you want to propagate your plant."
        },
        {
          "headline":"Apply a fungicide to treat diseases that cause gray, yellow, or brown spots.",
          "description":"Various pests and diseases can affect entire leaves or side segments, discoloring them even causing grayish fungal spots. Some diseases like root rot can also cause the leaves to wilt or curl. Mix ⁄2 fluid ounce (15 mL) of fungicide with 16 cups (3,800 mL) of water and pour it over the soil until it's moist.Etridiazole is a fungicide that's especially helpful for root rot. Some diseases can even take chunks out of the side segments of leaves. If your plant shows any of these signs of disease, make sure it's not placed near another plant that can be infected."
        },
        {
          "headline":"Re-pot your plant in late winter or early spring every 3-4 years or as needed.",
          "description":"Repotting the plant too frequently can stress it out, so only do it if the plant is diseased, the soil isn't draining properly, or if you'd like it to be in a larger pot. Fill a new, clean pot 3/4 full with succulent soil. Loosen the roots from the soil and replant the pot so the top of the central root system is 1 in (2.5 cm) below the rim of the pot. Add soil until it reaches 1 in (2.5 cm) below the rim of the pot. Pat the soil down to remove air pockets and water the plant. Place the plant in a shaded area for 2-3 days so it can acclimate to its new home. Don't repot the plant when it's blooming because this can stress the plant."
        }
      ]
    }
  ],
  "text":" Taking and Rooting Cuttings Wait until late spring to take cuttings. Christmas cacti flower in the winter, so it’s best to wait until late in the spring months when the plant has transitioned from the dormant stage to the growth stage. If you take cuttings when the plant is currently blooming, it may cause unnecessary stress to the plant and the cuttings may take longer to root. It's best to take the cuttings right after you water the main plant so the stems are well fed. Twist off 3 to 4 offshoots containing 2 to 5 leaves each. Each stem of Christmas cactus is made up of a series of oblong leaves separated by a narrow joint. For a clean break, use your fingers to gently twist off a few sections containing 2 to 5 leaves each.Pick healthy-looking offshoots (with no brown spots or wilting) to give each one the best chance of taking root. Remove extra leaf segments branching off the main cutting if necessary. Make sure the cutting doesn't more than 1 leaf segment branching off to the side of it because it could stunt the growth of the new plant. If there are 2 leaves on the offshoot, twist both of them off at the joint where they attach to the main cutting.No offshoots are ideal and just 1 is okay. Place the cuttings in a cool, dry place for 1 to 2 days. Giving the cuttings time to dry out will allow them to form calluses or nubs at the root ends. This is essential for the plant to heal and have the energy to take root and grow into a new plant.Make sure to place the cuttings in a place that isn't exposed to direct sunlight because it may scorch or overdry the leaves. Fill a small pot with potting soil made for succulents. Succulent soil will drain water faster than regular potting soil made for flowers or other plants. Look for a mix that's made primarily from sand, perlite, and peat.Avoid using regular potting soil for flowers or herbs because it won’t drain enough and may lead to root rot. Make sure the pot has large drainage holes on the bottom. A pot 3 in (7.6 cm) in diameter is large enough to hold 3 cuttings. Insert the root end of each cutting 1 in (2.5 cm) into the soil. Poke your finger 1 in (2.5 cm) into the soil in a triangular formation so each cutting has adequate and equal room. Place the root end of each cutting into the small indentions and rearrange the soil to hold them in place.You may need to push the cuttings deeper into the soil so they’re held upright. Place the pot somewhere that gets 8-12 hours of indirect sunlight daily. Christmas cactus can dry out too quickly or get sun-scorched from direct light. Place the pot on a center table or windowsill facing the north or east if possible. Take note of where the sun strikes the indoor area so you’re not accidentally placing it in a spot that is directly exposed to the bright afternoon sun.Christmas cacti need 12-14 hours of darkness each day, so only give your plant a maximum of 12 hours of light. Make sure to not put it in a spot near sources of heat like vents, fireplaces, and drafts. Water the cuttings when the top 1 in (2.5 cm) of soil is dry. Every 3-5 days, feel the top of the soil with your fingers to check for moisture. If it’s dry, water it sparingly—stop well before you anticipate water draining from the bottom of the planter. Too much water can cause the roots to rot.The cuttings should take root in about 6-8 weeks so be patient while your new Christmas cactus grows up. Transplant the cuttings into larger pots when they’re 1 in (2.5 cm) tall. Fill each pot with a well-draining soil mix made from sand, perlite, and peat. Carefully uproot the cuttings and place them 1 in (2.5 cm) into the soil so the roots are covered.You can place 2 of the cuttings in 1 pot if you like, just make sure they’re at 4 in (10 cm) apart. Germinating and Growing Seedlings Purchase Christmas cactus seeds or harvest them from a pollinated plant. The easiest way to get your hands on seeds is to buy them from a nursery or garden store. However, you can also grow seeds on your current plant by rubbing its pistil and stamen (coming out of the flowers) against the opposite reproductive parts of another Christmas cactus. It’s best to plant Christmas cactus seeds in the late spring. Other plants in this schlumbergera family include Thanksgiving cactus, crab cactus, and holiday cactus. Breeding plants that have different colored flowers will result in more seeds and, as a plus, the baby plant will have a beautiful mix of colors. After pollination, the bulbous seed pods will appear on the stem just under the flower in about 3 weeks. Fill seed-starting trays with soil made for succulents. Choose a tray small enough to fit into a plastic zipper bag or use extra-large bags. Look for a soil blend containing sand, perlite, and peat because these ingredients will allow the soil to properly drain without drowning the roots.Check the bottom of each tray to make sure there are drainage holes. If you don’t have seed-starting trays, a plastic container 4 inches (10 cm) long is the perfect size to create 3 rows of seeds. Just be sure to poke holes in the bottom of the container. Wet the soil and plant the seeds ⁄2 in (1.3 cm) apart in even rows. Planting several seeds at a time will increase the odds that more of them will germinate and grow into a healthy plant. If the cells of the seed-starting tray are 2 in (5.1 cm) by 2 in (5.1 cm) in size, place a maximum of 2 seeds in each cell.Note that if you’re harvesting seeds from an existing plant, you’ll need to squeeze the bulbous pod until the inner seeds come out. Let them dry on a paper towel for 1-2 weeks before planting them. Place the container in an airtight plastic zipper bag and seal it. Putting the container in a bag will keep fungi from affecting the seeds and help them retain moisture. Squeeze out all of the air before sealing the bag.The plastic bag will act as a mini-greenhouse, keeping the seeds warm and moist so they can sprout. Put the bag in a place that receives indirect sunlight for 3 months. The seeds need time to germinate, so don’t open the bag for 3 months to keep the soil and seedlings sterile. After 3 months, feel free to unzip the bag by 1 in (2.5 cm) to allow the budding plants to acclimate to the environment.You’ll notice some condensation forming on the bags—this is normal and will keep the soil moist. If you notice the soil looks dry, open the bag and water the soil until it’s moist. Reseal it when you’re done. Just like the plant, the seeds need to be in a room that’s 65°F to 75°F (18 to 20°C). After 3 months, you’ll notice small green tips sprouting from the soil. These will eventually grow into larger Christmas cacti. Transfer the sprouts into a larger pot once they’re 2 in (5.1 cm) tall. Cacti don’t mind tight spaces, but if you want your sprouts to grow into larger, healthy plants, transfer them when they’re about 2 inches (5.1 cm) tall. Carefully remove the sprout from the soil and place the root end into a pot filled with soil made for cacti.Ideally, give each sprout its own pot. However, if you want to plant more than 1 in the same pot, make sure they’re 4 in (10 cm) apart. If you notice some of the sprouts growing limp, it’s a sign their roots are cramped and you should transfer them into a larger pot right away. Caring for Mature Christmas Cacti Keep the pot in an area that receives up to 12 hours of indirect sunlight daily. Anywhere near a north or east-facing window is a good spot to place the pot. Too much sunlight can dry out the soil and stunt the growth of the plant, so be wary of how light comes into the room during sunrise and sunset. Christmas cacti need dark hours to rest, so make sure the plant is able to get 12-14 hours of darkness each night. Set your thermostat to a temperature between 65°F and 75°F (18 and 20°C). Comfortable indoor temperatures are perfect for your plant. If it’s too hot, the plant may dry out and burn. If it’s too cold, water inside the leaves can freeze and expand, damaging the plant’s cells.Make sure the pot is away from other heat sources like vents, heaters, fireplaces, and appliances. To encourage blooming, move the plant to a place that’s 60°F-65°F (15°C-18°C) in the fall (October is best). Water the plant when the top 1 in (2.5 cm) of soil feels dry. Use your finger to feel the top of the soil. If it’s dry, pour water over the base of the plant and the entire surface of the soil. If you detect some moisture, wait 1 or 2 days and check again. How often you water the plant will also depend on your environment and season.If you live in a cool, humid environment, water the plant once a week in the spring and summer. If you live in a warm, dry climate, water it every 2 or 3 days (always check the soil first!) during spring and summer months. Water the plant less frequently during fall and winter months to encourage flowering. If you notice leaves dropping off or developing white spots, water the plant less frequently from the bottom. Place the planter in a tray filled with ⁄2 inch (1.3 cm) of water for 30 minutes. Stop watering the plant for 6 weeks after it has bloomed. Blooming takes a lot of energy and the plant won’t need as much water since it’s not focused on growing. After the plant has bloomed, wait 6 weeks to resume your regular watering schedule so it has time to rejuvenate.If you notice any buds dropping off the plant, stop watering it immediately and try relocating the plant to a place that gets a little more light. Fertilize the plant every 2 weeks in the spring and summer as needed. You don't need to fertilize your Christmas cactus on a regular basis, but you can if it looks limp and like it could use extra support. Use a fertilizer made for blooming houseplants. Formulas that read \"20-20-20\" or \"20-10-20\" on the package are good options.Only fertilize the plant once per month during the fall and winter. Make sure the blend says \"water-soluble\" on the label. Prune your plant in the late winter to spring months. Use your hands to twist off limp or discolored segments at the small joint between the leaves. Only prune the plant in the late winter or spring after it has flowered and is approaching the growing stage. Prune up to 1/3 of the entire plant to encourage it to grow.Your Christmas cactus may \"self-prune\" by dropping leaves. However, losing leaves can also be a sign of stress from overwatering or under-watering. You may want to prune your plant if it becomes so large that it’s unmanageable. This is also a good time to remove cuttings if you want to propagate your plant. Apply a fungicide to treat diseases that cause gray, yellow, or brown spots. Various pests and diseases can affect entire leaves or side segments, discoloring them even causing grayish fungal spots. Some diseases like root rot can also cause the leaves to wilt or curl. Mix ⁄2 fluid ounce (15 mL) of fungicide with 16 cups (3,800 mL) of water and pour it over the soil until it's moist.Etridiazole is a fungicide that's especially helpful for root rot. Some diseases can even take chunks out of the side segments of leaves. If your plant shows any of these signs of disease, make sure it's not placed near another plant that can be infected. Re-pot your plant in late winter or early spring every 3-4 years or as needed. Repotting the plant too frequently can stress it out, so only do it if the plant is diseased, the soil isn't draining properly, or if you'd like it to be in a larger pot. Fill a new, clean pot 3/4 full with succulent soil. Loosen the roots from the soil and replant the pot so the top of the central root system is 1 in (2.5 cm) below the rim of the pot. Add soil until it reaches 1 in (2.5 cm) below the rim of the pot. Pat the soil down to remove air pockets and water the plant. Place the plant in a shaded area for 2-3 days so it can acclimate to its new home. Don't repot the plant when it's blooming because this can stress the plant.",
  "sentences":[
    " Taking and Rooting Cuttings Wait until late spring to take cuttings.",
    "Christmas cacti flower in the winter, so it’s best to wait until late in the spring months when the plant has transitioned from the dormant stage to the growth stage.",
    "If you take cuttings when the plant is currently blooming, it may cause unnecessary stress to the plant and the cuttings may take longer to root.",
    "It's best to take the cuttings right after you water the main plant so the stems are well fed.",
    "Twist off 3 to 4 offshoots containing 2 to 5 leaves each.",
    "Each stem of Christmas cactus is made up of a series of oblong leaves separated by a narrow joint.",
    "For a clean break, use your fingers to gently twist off a few sections containing 2 to 5 leaves each.Pick healthy-looking offshoots (with no brown spots or wilting) to give each one the best chance of taking root.",
    "Remove extra leaf segments branching off the main cutting if necessary.",
    "Make sure the cutting doesn't more than 1 leaf segment branching off to the side of it because it could stunt the growth of the new plant.",
    "If there are 2 leaves on the offshoot, twist both of them off at the joint where they attach to the main cutting.No offshoots are ideal and just 1 is okay.",
    "Place the cuttings in a cool, dry place for 1 to 2 days.",
    "Giving the cuttings time to dry out will allow them to form calluses or nubs at the root ends.",
    "This is essential for the plant to heal and have the energy to take root and grow into a new plant.Make sure to place the cuttings in a place that isn't exposed to direct sunlight because it may scorch or overdry the leaves.",
    "Fill a small pot with potting soil made for succulents.",
    "Succulent soil will drain water faster than regular potting soil made for flowers or other plants.",
    "Look for a mix that's made primarily from sand, perlite, and peat.Avoid using regular potting soil for flowers or herbs because it won’t drain enough and may lead to root rot.",
    "Make sure the pot has large drainage holes on the bottom.",
    "A pot 3 in (7.6 cm) in diameter is large enough to hold 3 cuttings.",
    "Insert the root end of each cutting 1 in (2.5 cm) into the soil.",
    "Poke your finger 1 in (2.5 cm) into the soil in a triangular formation so each cutting has adequate and equal room.",
    "Place the root end of each cutting into the small indentions and rearrange the soil to hold them in place.You may need to push the cuttings deeper into the soil so they’re held upright.",
    "Place the pot somewhere that gets 8-12 hours of indirect sunlight daily.",
    "Christmas cactus can dry out too quickly or get sun-scorched from direct light.",
    "Place the pot on a center table or windowsill facing the north or east if possible.",
    "Take note of where the sun strikes the indoor area so you’re not accidentally placing it in a spot that is directly exposed to the bright afternoon sun.Christmas cacti need 12-14 hours of darkness each day, so only give your plant a maximum of 12 hours of light.",
    "Make sure to not put it in a spot near sources of heat like vents, fireplaces, and drafts.",
    "Water the cuttings when the top 1 in (2.5 cm) of soil is dry.",
    "Every 3-5 days, feel the top of the soil with your fingers to check for moisture.",
    "If it’s dry, water it sparingly—stop well before you anticipate water draining from the bottom of the planter.",
    "Too much water can cause the roots to rot.The cuttings should take root in about 6-8 weeks so be patient while your new Christmas cactus grows up.",
    "Transplant the cuttings into larger pots when they’re 1 in (2.5 cm) tall.",
    "Fill each pot with a well-draining soil mix made from sand, perlite, and peat.",
    "Carefully uproot the cuttings and place them 1 in (2.5 cm) into the soil so the roots are covered.You can place 2 of the cuttings in 1 pot if you like, just make sure they’re at 4 in (10 cm) apart.",
    "Germinating and Growing Seedlings Purchase Christmas cactus seeds or harvest them from a pollinated plant.",
    "The easiest way to get your hands on seeds is to buy them from a nursery or garden store.",
    "However, you can also grow seeds on your current plant by rubbing its pistil and stamen (coming out of the flowers) against the opposite reproductive parts of another Christmas cactus.",
    "It’s best to plant Christmas cactus seeds in the late spring.",
    "Other plants in this schlumbergera family include Thanksgiving cactus, crab cactus, and holiday cactus.",
    "Breeding plants that have different colored flowers will result in more seeds and, as a plus, the baby plant will have a beautiful mix of colors.",
    "After pollination, the bulbous seed pods will appear on the stem just under the flower in about 3 weeks.",
    "Fill seed-starting trays with soil made for succulents.",
    "Choose a tray small enough to fit into a plastic zipper bag or use extra-large bags.",
    "Look for a soil blend containing sand, perlite, and peat because these ingredients will allow the soil to properly drain without drowning the roots.Check the bottom of each tray to make sure there are drainage holes.",
    "If you don’t have seed-starting trays, a plastic container 4 inches (10 cm) long is the perfect size to create 3 rows of seeds.",
    "Just be sure to poke holes in the bottom of the container.",
    "Wet the soil and plant the seeds ⁄2 in (1.3 cm) apart in even rows.",
    "Planting several seeds at a time will increase the odds that more of them will germinate and grow into a healthy plant.",
    "If the cells of the seed-starting tray are 2 in (5.1 cm) by 2 in (5.1 cm) in size, place a maximum of 2 seeds in each cell.Note that if you’re harvesting seeds from an existing plant, you’ll need to squeeze the bulbous pod until the inner seeds come out.",
    "Let them dry on a paper towel for 1-2 weeks before planting them.",
    "Place the container in an airtight plastic zipper bag and seal it.",
    "Putting the container in a bag will keep fungi from affecting the seeds and help them retain moisture.",
    "Squeeze out all of the air before sealing the bag.The plastic bag will act as a mini-greenhouse, keeping the seeds warm and moist so they can sprout.",
    "Put the bag in a place that receives indirect sunlight for 3 months.",
    "The seeds need time to germinate, so don’t open the bag for 3 months to keep the soil and seedlings sterile.",
    "After 3 months, feel free to unzip the bag by 1 in (2.5 cm) to allow the budding plants to acclimate to the environment.You’ll notice some condensation forming on the bags—this is normal and will keep the soil moist.",
    "If you notice the soil looks dry, open the bag and water the soil until it’s moist.",
    "Reseal it when you’re done.",
    "Just like the plant, the seeds need to be in a room that’s 65°F to 75°F (18 to 20°C).",
    "After 3 months, you’ll notice small green tips sprouting from the soil.",
    "These will eventually grow into larger Christmas cacti.",
    "Transfer the sprouts into a larger pot once they’re 2 in (5.1 cm) tall.",
    "Cacti don’t mind tight spaces, but if you want your sprouts to grow into larger, healthy plants, transfer them when they’re about 2 inches (5.1 cm) tall.",
    "Carefully remove the sprout from the soil and place the root end into a pot filled with soil made for cacti.Ideally, give each sprout its own pot.",
    "However, if you want to plant more than 1 in the same pot, make sure they’re 4 in (10 cm) apart.",
    "If you notice some of the sprouts growing limp, it’s a sign their roots are cramped and you should transfer them into a larger pot right away.",
    "Caring for Mature Christmas Cacti Keep the pot in an area that receives up to 12 hours of indirect sunlight daily.",
    "Anywhere near a north or east-facing window is a good spot to place the pot.",
    "Too much sunlight can dry out the soil and stunt the growth of the plant, so be wary of how light comes into the room during sunrise and sunset.",
    "Christmas cacti need dark hours to rest, so make sure the plant is able to get 12-14 hours of darkness each night.",
    "Set your thermostat to a temperature between 65°F and 75°F (18 and 20°C).",
    "Comfortable indoor temperatures are perfect for your plant.",
    "If it’s too hot, the plant may dry out and burn.",
    "If it’s too cold, water inside the leaves can freeze and expand, damaging the plant’s cells.Make sure the pot is away from other heat sources like vents, heaters, fireplaces, and appliances.",
    "To encourage blooming, move the plant to a place that’s 60°F-65°F (15°C-18°C) in the fall (October is best).",
    "Water the plant when the top 1 in (2.5 cm) of soil feels dry.",
    "Use your finger to feel the top of the soil.",
    "If it’s dry, pour water over the base of the plant and the entire surface of the soil.",
    "If you detect some moisture, wait 1 or 2 days and check again.",
    "How often you water the plant will also depend on your environment and season.If you live in a cool, humid environment, water the plant once a week in the spring and summer.",
    "If you live in a warm, dry climate, water it every 2 or 3 days (always check the soil first!)",
    "during spring and summer months.",
    "Water the plant less frequently during fall and winter months to encourage flowering.",
    "If you notice leaves dropping off or developing white spots, water the plant less frequently from the bottom.",
    "Place the planter in a tray filled with ⁄2 inch (1.3 cm) of water for 30 minutes.",
    "Stop watering the plant for 6 weeks after it has bloomed.",
    "Blooming takes a lot of energy and the plant won’t need as much water since it’s not focused on growing.",
    "After the plant has bloomed, wait 6 weeks to resume your regular watering schedule so it has time to rejuvenate.If you notice any buds dropping off the plant, stop watering it immediately and try relocating the plant to a place that gets a little more light.",
    "Fertilize the plant every 2 weeks in the spring and summer as needed.",
    "You don't need to fertilize your Christmas cactus on a regular basis, but you can if it looks limp and like it could use extra support.",
    "Use a fertilizer made for blooming houseplants.",
    "Formulas that read \"20-20-20\" or \"20-10-20\" on the package are good options.Only fertilize the plant once per month during the fall and winter.",
    "Make sure the blend says \"water-soluble\" on the label.",
    "Prune your plant in the late winter to spring months.",
    "Use your hands to twist off limp or discolored segments at the small joint between the leaves.",
    "Only prune the plant in the late winter or spring after it has flowered and is approaching the growing stage.",
    "Prune up to 1/3 of the entire plant to encourage it to grow.Your Christmas cactus may \"self-prune\" by dropping leaves.",
    "However, losing leaves can also be a sign of stress from overwatering or under-watering.",
    "You may want to prune your plant if it becomes so large that it’s unmanageable.",
    "This is also a good time to remove cuttings if you want to propagate your plant.",
    "Apply a fungicide to treat diseases that cause gray, yellow, or brown spots.",
    "Various pests and diseases can affect entire leaves or side segments, discoloring them even causing grayish fungal spots.",
    "Some diseases like root rot can also cause the leaves to wilt or curl.",
    "Mix ⁄2 fluid ounce (15 mL) of fungicide with 16 cups (3,800 mL) of water and pour it over the soil until it's moist.Etridiazole is a fungicide that's especially helpful for root rot.",
    "Some diseases can even take chunks out of the side segments of leaves.",
    "If your plant shows any of these signs of disease, make sure it's not placed near another plant that can be infected.",
    "Re-pot your plant in late winter or early spring every 3-4 years or as needed.",
    "Repotting the plant too frequently can stress it out, so only do it if the plant is diseased, the soil isn't draining properly, or if you'd like it to be in a larger pot.",
    "Fill a new, clean pot 3/4 full with succulent soil.",
    "Loosen the roots from the soil and replant the pot so the top of the central root system is 1 in (2.5 cm) below the rim of the pot.",
    "Add soil until it reaches 1 in (2.5 cm) below the rim of the pot.",
    "Pat the soil down to remove air pockets and water the plant.",
    "Place the plant in a shaded area for 2-3 days so it can acclimate to its new home.",
    "Don't repot the plant when it's blooming because this can stress the plant."
  ],
  "tyn_section":[
    "Christmas cactus plant (the blooming period)",
    "Small pot with drainage holes",
    "Succulent potting soil (made from sand, perlite, and peat)",
    "Water",
    "Large pots (for replanting cuttings)",
    "Christmas cactus seeds (or 2 Christmas cacti of different colors)",
    "Seed-starting trays or a rectangular plastic container",
    "Large plastic zipper bag",
    "Large pots (for planting sprouted seedlings)",
    "Caring for Christmas Cactus",
    "Indoor room that's between 65°F and 75°F (18 and 20°C)",
    "Fertilizer (20-20-20 or 20-10-20)",
    "Fungicide (like etridiazole)",
    "Alternate pot (for repotting)"
  ],
  "tyn_model":[
    "water",
    "pot",
    "soil",
    "potting soil",
    "perlite",
    "container",
    "planter",
    "peat",
    "tray",
    "prune",
    "—stop",
    "seeds",
    "crab cactus",
    "plastic container",
    "airtight plastic zipper bag",
    "—this",
    "heaters",
    "fertilizer",
    "fungicide",
    "etridiazole"
  ],
  "simple_metrics":{
    "r":0.0714285714,
    "p":0.05,
    "f1":0.0588235294,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1428571429,
    "p":0.1,
    "f1":0.1176470588
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2142857143,
    "p":0.15,
    "f1":0.1764705882
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0714285714,
    "p":0.05,
    "f1":0.0588235294
  }
}