{
  "title":"How to Eat Tofu Raw",
  "url":"https://www.wikihow.com/Eat-Tofu-Raw",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Tofu and Tempeh"
  ],
  "methods":[
    {
      "name":"Draining and Slicing Raw Tofu",
      "steps":[
        {
          "headline":"Choose softer varieties of tofu to eat raw.",
          "description":"Search in your local market or grocery store for packages of silken or soft tofu. Since medium and firmer types of tofu have a more solid consistency, select softer varieties that are easier and more pleasant to eat out of the package. Traditionally, harder tofu is cut into cubes or slices and then eaten or added to recipes."
        },
        {
          "headline":"Open the package to drain out any extra water.",
          "description":"Use a knife or pair of scissors to create multiple slits along 1 corner of the tofu package. Lift up the plastic and pour the excess water into a separate bowl or container. After this, remove the block of tofu from the package and discard the initial plastic. You need to drain the water out of any variety of tofu."
        },
        {
          "headline":"Blot the tofu on a clean towel for at least 5 minutes.",
          "description":"Place a folded towel or paper towel on top of a table or countertop, then set the tofu on top of it. Set a timer for at least 5 minutes to let some of the excess water drip onto the towels. Silken tofu is especially soft and doesn’t need to be blotted on a separate surface."
        },
        {
          "headline":"Put firm tofu under a plate and weigh it down to flatten it.",
          "description":"Set another dish on top of the tofu block, then set a heavy tin of canned food on top. Wait 15 minutes for water to drain and pool onto the plate, which can be discarded or dumped into a separate bowl. You can also use a tofu press for this, which can be purchased online."
        },
        {
          "headline":"Cut harder tofu blocks into cubes or slices.",
          "description":"Set your drained tofu on a flat surface like a cutting board. Use a sharp knife to make horizontal cuts across the block, forming thick slices. If you’d prefer for the tofu to be in bite-sized pieces, consider cutting it into cubes instead. You can press and drain your tofu after cutting it, if you prefer."
        },
        {
          "headline":"Store leftover tofu in water for up to 10 days.",
          "description":"Fill a small plastic container with cool tap water, leaving 1 in (2.5 cm) or so of space beneath the rim. Submerge your soft or firm tofu under the water, then secure the lid into place. As an extra precaution, use a piece of masking tape to label the date of the tofu so you know when to toss it out. You don’t need to refrigerate your leftover tofu."
        }
      ]
    },
    {
      "name":"Using Tofu in Different Dishes",
      "steps":[
        {
          "headline":"Add a handful of tofu to the blender to make a refreshing smoothie.",
          "description":"Choose 1 or multiple flavors to use as the base for your beverage, like frozen or fresh fruits. Add in juice or soy milk to thin out your recipes, or add in vanilla extract to give your drink a flavorful kick! You typically need at least ½ of a tofu package to make 4 servings of a smoothie. You can make a mixed berry smoothie by adding 0.25 cups (59 mL) of cranberry juice cocktail into a blender, then pouring in ⅔ cup (165 g) of silken tofu, ½ cup (155 g) of frozen blueberries, ½ cup (250 g) of frozen raspberries, and 1 teaspoon (4.9 mL) of vanilla extract. Prepare a strawberry-banana shake with ½ a package of silken tofu, 2 bananas, 1 cup (166 g) of sliced strawberries, 1 cup (240 mL) of soy milk, ½ cup (75 g) of ice cubes, and 1 teaspoon (4.9 mL) of maple syrup.Tip: If you’re going to use uncooked silken tofu in your recipes, be sure to refrigerate them if you don’t plan on eating or drinking the dish right away!"
        },
        {
          "headline":"Sprinkle tofu chunks on top of soups before you serve them.",
          "description":"Take a regular spoon and scoop out a small amount of soft, custard tofu. Place this scoop in the center of a bowl, then pour in a broth-heavy soup, like dashi or miso. If you prefer sweeter tofu dishes, try drizzling agave syrup over the scoop of tofu instead!"
        },
        {
          "headline":"Cook up a creamy sauce with blended raw tofu as the base.",
          "description":"Drain a package of soft, silken tofu, and blend it with some of your favorite sauce ingredients, like garlic, paprika, or different kinds of herbs. If needed, thin out the sauce with milk to give it a creamier consistency. Blended tofu works great in garlic pasta sauces."
        },
        {
          "headline":"Choose silken tofu as the key ingredient in your vegan mayo.",
          "description":"Drain and rinse a package of silken tofu, then blend it into an even, creamy consistency. Pour in some vegetable oil, salt, and vinegar to make the tofu taste more like traditional mayonnaise. Mix all of the ingredients together, then sample the mayo to make sure it tastes good. Homemade vegan mayo usually lasts for around 1 week."
        },
        {
          "headline":"Use raw, extra firm tofu in a simple vegan ice cream.",
          "description":"Add 12 oz (340 g) of extra firm tofu into a blender, along with 1 cup (240 mL) of plant-based milk and 3 tablespoons (44 mL) of maple syrup. Blend these ingredients together until they form a smooth consistency, then pour the mixture into an ice cream machine. Run the machine for 30 minutes, or until you see ice cream in the device. This ice cream tastes great when served right away."
        }
      ]
    }
  ],
  "text":" Draining and Slicing Raw Tofu Choose softer varieties of tofu to eat raw. Search in your local market or grocery store for packages of silken or soft tofu. Since medium and firmer types of tofu have a more solid consistency, select softer varieties that are easier and more pleasant to eat out of the package. Traditionally, harder tofu is cut into cubes or slices and then eaten or added to recipes. Open the package to drain out any extra water. Use a knife or pair of scissors to create multiple slits along 1 corner of the tofu package. Lift up the plastic and pour the excess water into a separate bowl or container. After this, remove the block of tofu from the package and discard the initial plastic. You need to drain the water out of any variety of tofu. Blot the tofu on a clean towel for at least 5 minutes. Place a folded towel or paper towel on top of a table or countertop, then set the tofu on top of it. Set a timer for at least 5 minutes to let some of the excess water drip onto the towels. Silken tofu is especially soft and doesn’t need to be blotted on a separate surface. Put firm tofu under a plate and weigh it down to flatten it. Set another dish on top of the tofu block, then set a heavy tin of canned food on top. Wait 15 minutes for water to drain and pool onto the plate, which can be discarded or dumped into a separate bowl. You can also use a tofu press for this, which can be purchased online. Cut harder tofu blocks into cubes or slices. Set your drained tofu on a flat surface like a cutting board. Use a sharp knife to make horizontal cuts across the block, forming thick slices. If you’d prefer for the tofu to be in bite-sized pieces, consider cutting it into cubes instead. You can press and drain your tofu after cutting it, if you prefer. Store leftover tofu in water for up to 10 days. Fill a small plastic container with cool tap water, leaving 1 in (2.5 cm) or so of space beneath the rim. Submerge your soft or firm tofu under the water, then secure the lid into place. As an extra precaution, use a piece of masking tape to label the date of the tofu so you know when to toss it out. You don’t need to refrigerate your leftover tofu. Using Tofu in Different Dishes Add a handful of tofu to the blender to make a refreshing smoothie. Choose 1 or multiple flavors to use as the base for your beverage, like frozen or fresh fruits. Add in juice or soy milk to thin out your recipes, or add in vanilla extract to give your drink a flavorful kick! You typically need at least ½ of a tofu package to make 4 servings of a smoothie. You can make a mixed berry smoothie by adding 0.25 cups (59 mL) of cranberry juice cocktail into a blender, then pouring in ⅔ cup (165 g) of silken tofu, ½ cup (155 g) of frozen blueberries, ½ cup (250 g) of frozen raspberries, and 1 teaspoon (4.9 mL) of vanilla extract. Prepare a strawberry-banana shake with ½ a package of silken tofu, 2 bananas, 1 cup (166 g) of sliced strawberries, 1 cup (240 mL) of soy milk, ½ cup (75 g) of ice cubes, and 1 teaspoon (4.9 mL) of maple syrup.Tip: If you’re going to use uncooked silken tofu in your recipes, be sure to refrigerate them if you don’t plan on eating or drinking the dish right away! Sprinkle tofu chunks on top of soups before you serve them. Take a regular spoon and scoop out a small amount of soft, custard tofu. Place this scoop in the center of a bowl, then pour in a broth-heavy soup, like dashi or miso. If you prefer sweeter tofu dishes, try drizzling agave syrup over the scoop of tofu instead! Cook up a creamy sauce with blended raw tofu as the base. Drain a package of soft, silken tofu, and blend it with some of your favorite sauce ingredients, like garlic, paprika, or different kinds of herbs. If needed, thin out the sauce with milk to give it a creamier consistency. Blended tofu works great in garlic pasta sauces. Choose silken tofu as the key ingredient in your vegan mayo. Drain and rinse a package of silken tofu, then blend it into an even, creamy consistency. Pour in some vegetable oil, salt, and vinegar to make the tofu taste more like traditional mayonnaise. Mix all of the ingredients together, then sample the mayo to make sure it tastes good. Homemade vegan mayo usually lasts for around 1 week. Use raw, extra firm tofu in a simple vegan ice cream. Add 12 oz (340 g) of extra firm tofu into a blender, along with 1 cup (240 mL) of plant-based milk and 3 tablespoons (44 mL) of maple syrup. Blend these ingredients together until they form a smooth consistency, then pour the mixture into an ice cream machine. Run the machine for 30 minutes, or until you see ice cream in the device. This ice cream tastes great when served right away.",
  "sentences":[
    " Draining and Slicing Raw Tofu Choose softer varieties of tofu to eat raw.",
    "Search in your local market or grocery store for packages of silken or soft tofu.",
    "Since medium and firmer types of tofu have a more solid consistency, select softer varieties that are easier and more pleasant to eat out of the package.",
    "Traditionally, harder tofu is cut into cubes or slices and then eaten or added to recipes.",
    "Open the package to drain out any extra water.",
    "Use a knife or pair of scissors to create multiple slits along 1 corner of the tofu package.",
    "Lift up the plastic and pour the excess water into a separate bowl or container.",
    "After this, remove the block of tofu from the package and discard the initial plastic.",
    "You need to drain the water out of any variety of tofu.",
    "Blot the tofu on a clean towel for at least 5 minutes.",
    "Place a folded towel or paper towel on top of a table or countertop, then set the tofu on top of it.",
    "Set a timer for at least 5 minutes to let some of the excess water drip onto the towels.",
    "Silken tofu is especially soft and doesn’t need to be blotted on a separate surface.",
    "Put firm tofu under a plate and weigh it down to flatten it.",
    "Set another dish on top of the tofu block, then set a heavy tin of canned food on top.",
    "Wait 15 minutes for water to drain and pool onto the plate, which can be discarded or dumped into a separate bowl.",
    "You can also use a tofu press for this, which can be purchased online.",
    "Cut harder tofu blocks into cubes or slices.",
    "Set your drained tofu on a flat surface like a cutting board.",
    "Use a sharp knife to make horizontal cuts across the block, forming thick slices.",
    "If you’d prefer for the tofu to be in bite-sized pieces, consider cutting it into cubes instead.",
    "You can press and drain your tofu after cutting it, if you prefer.",
    "Store leftover tofu in water for up to 10 days.",
    "Fill a small plastic container with cool tap water, leaving 1 in (2.5 cm) or so of space beneath the rim.",
    "Submerge your soft or firm tofu under the water, then secure the lid into place.",
    "As an extra precaution, use a piece of masking tape to label the date of the tofu so you know when to toss it out.",
    "You don’t need to refrigerate your leftover tofu.",
    "Using Tofu in Different Dishes Add a handful of tofu to the blender to make a refreshing smoothie.",
    "Choose 1 or multiple flavors to use as the base for your beverage, like frozen or fresh fruits.",
    "Add in juice or soy milk to thin out your recipes, or add in vanilla extract to give your drink a flavorful kick!",
    "You typically need at least ½ of a tofu package to make 4 servings of a smoothie.",
    "You can make a mixed berry smoothie by adding 0.25 cups (59 mL) of cranberry juice cocktail into a blender, then pouring in ⅔ cup (165 g) of silken tofu, ½ cup (155 g) of frozen blueberries, ½ cup (250 g) of frozen raspberries, and 1 teaspoon (4.9 mL) of vanilla extract.",
    "Prepare a strawberry-banana shake with ½ a package of silken tofu, 2 bananas, 1 cup (166 g) of sliced strawberries, 1 cup (240 mL) of soy milk, ½ cup (75 g) of ice cubes, and 1 teaspoon (4.9 mL) of maple syrup.Tip: If you’re going to use uncooked silken tofu in your recipes, be sure to refrigerate them if you don’t plan on eating or drinking the dish right away!",
    "Sprinkle tofu chunks on top of soups before you serve them.",
    "Take a regular spoon and scoop out a small amount of soft, custard tofu.",
    "Place this scoop in the center of a bowl, then pour in a broth-heavy soup, like dashi or miso.",
    "If you prefer sweeter tofu dishes, try drizzling agave syrup over the scoop of tofu instead!",
    "Cook up a creamy sauce with blended raw tofu as the base.",
    "Drain a package of soft, silken tofu, and blend it with some of your favorite sauce ingredients, like garlic, paprika, or different kinds of herbs.",
    "If needed, thin out the sauce with milk to give it a creamier consistency.",
    "Blended tofu works great in garlic pasta sauces.",
    "Choose silken tofu as the key ingredient in your vegan mayo.",
    "Drain and rinse a package of silken tofu, then blend it into an even, creamy consistency.",
    "Pour in some vegetable oil, salt, and vinegar to make the tofu taste more like traditional mayonnaise.",
    "Mix all of the ingredients together, then sample the mayo to make sure it tastes good.",
    "Homemade vegan mayo usually lasts for around 1 week.",
    "Use raw, extra firm tofu in a simple vegan ice cream.",
    "Add 12 oz (340 g) of extra firm tofu into a blender, along with 1 cup (240 mL) of plant-based milk and 3 tablespoons (44 mL) of maple syrup.",
    "Blend these ingredients together until they form a smooth consistency, then pour the mixture into an ice cream machine.",
    "Run the machine for 30 minutes, or until you see ice cream in the device.",
    "This ice cream tastes great when served right away."
  ],
  "tyn_section":[
    "Draining and Slicing Tofu",
    "Knife or scissors",
    "Paper towels or regular towels",
    "Baking tray",
    "Heavy cans",
    "Salt",
    "Water",
    "Bowl",
    "Blender",
    "Glasses",
    "Ice cream machine",
    "Spoon"
  ],
  "tyn_model":[
    "tofu",
    "water",
    "bowl",
    "blender",
    "silken tofu",
    "ice cream",
    "plate",
    "soy milk",
    "vanilla extract",
    "maple syrup",
    "knife",
    "plastic",
    "dish",
    "canned food",
    "tofu press",
    "sharp knife",
    "tap water",
    "masking tape",
    "cranberry juice cocktail",
    "⅔ cup",
    "blueberries",
    "raspberries",
    "strawberry-banana",
    "bananas",
    "strawberries",
    "ice cubes",
    "regular spoon",
    "agave syrup",
    "garlic",
    "paprika",
    "milk",
    "vegetable oil",
    "salt",
    "vinegar",
    "mayo",
    "plant-based milk",
    "ice cream machine"
  ],
  "simple_metrics":{
    "r":0.4166666667,
    "p":0.1351351351,
    "f1":0.2040816327,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2162162162,
    "f1":0.3018867925
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5833333333,
    "p":0.2432432432,
    "f1":0.3433242507
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4166666667,
    "p":0.1621621622,
    "f1":0.233463035
  }
}