{
  "title":"How to Polish a Guitar",
  "url":"https://www.wikihow.com/Polish-a-Guitar",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Removing the Strings",
      "steps":[
        {
          "headline":"Wash your hands and lay the guitar flat with the strings facing up.",
          "description":"Wash your hands well with soap and water to remove oils that can affect the quality of your guitar’s finish when you clean and polish it. Hold the guitar in your lap or lay it flat on a clean surface. Make sure the strings are facing up so you can access all of them easily. Make sure your hands are dry as well so you don’t get extra moisture on the finish."
        },
        {
          "headline":"Rotate the tuning head of the first string counterclockwise to loosen it.",
          "description":"The tuning heads are the metal gears at the top of the guitar, also known as the headstock, that hold tension in the strings to produce sound. Start with the “E” string, which is the thickest string at the top. Play the string as you turn the tuning head to make sure you’re loosening it. The sound will get deeper as the tension is released. Continue rotating until the string no longer makes a sound when you play it.Don’t loosen the string so much that it hangs over the next string. If the note that the string makes when you play it gets higher, then you’re rotating the tuning head in the wrong direction."
        },
        {
          "headline":"Loosen each of the strings one by one to ease the tension on the neck.",
          "description":"Once you loosen the first string, move to the tuning head of the second string next to it, which is the “A” string. Thumb the string as you rotate the tuning head counterclockwise to make sure the tension is being released. Turn the tuning head until the string no longer makes a sound when it’s played, then move to the next string and repeat the process.Gently releasing the tension from all of the strings will put less strain on the neck of the guitar."
        },
        {
          "headline":"Take the strings out of the tuning heads.",
          "description":"Once all of the strings are loose, unwind the first string from its tuning head. Continue unwinding it until you can pull the end of it out of the slot on the head that’s holding it in place. Remove the rest of the strings from the tuning heads individually.Tip: If removing a string is from the tuning head is too difficult, use a pair of wire cutters to snip the string around the halfway point to make it easier to take off."
        },
        {
          "headline":"Remove the bridge pins if the guitar has them.",
          "description":"The bridge is the piece on the body of the guitar that holds the strings in place. If you have an acoustic guitar or if your guitar has small pins in the bridge to hold the strings, use a screwdriver or another flat object to gently pry the pin straight up to remove it.Set the pins aside so you can replace them later. Most electric guitars do not have bridge pins."
        },
        {
          "headline":"Slide the strings out of the bridge to remove them.",
          "description":"Pull the end of the first string that’s attached to the bridge to start sliding it out of the slot. Continue pulling the string until it’s completely removed from the guitar. Then, pull out the rest of the strings, one by one.Don’t yank or jerk the strings or you could damage the bridge or scratch the surface of the body."
        }
      ]
    },
    {
      "name":"Cleaning and Polishing the Neck",
      "steps":[
        {
          "headline":"Wipe down the entire guitar with a clean cloth to remove any dust.",
          "description":"Take a clean dry cloth and run it over the surface of the whole guitar to dust it. Work the cloth around and between the tuning heads as well as on the backside of the body. Use gentle, circular motions to remove as much dust as possible."
        },
        {
          "headline":"Scrape any dirt out from the cracks between the frets with a metal pin.",
          "description":"The frets are the small metal wires that cross over the neck of the guitar and are what allow you to change the sound of the strings. Use a small metal pin or another flat object to gently scrape any dust, dirt, or grime that is lodged in the small crevices where the frets are connected to the neck.Be careful not to scratch the wooden fretboard. If your guitar is well-maintained or new, there may not be much dirt to clean out from the frets."
        },
        {
          "headline":"Use 0000 steel wool to wipe down the fretboard along the grain.",
          "description":"Take some fine steel wool and gently rub the spaces between the frets, following the grain of the wood. Start at the top of the fretboard and work your way down to the bottom to remove any grimy buildup that may be present on the wood.Do not use a different steel wool grade or you could scratch or damage the wooden fretboard. You can find 0000 steel wool at hardware stores, department stores, and online."
        },
        {
          "headline":"Apply a few drops of lemon oil to a cloth and wipe down the neck of the guitar.",
          "description":"Take a clean dry cloth and wrap it around your finger. Drip a few drops of lemon oil onto the cloth and run it down the entire length of the guitar neck. Be sure to get the headstock and the spaces between the tuning heads. Wipe the back of the neck as well.Do not apply lemon oil to the body of the guitar.Tip: If you’re polishing an acoustic guitar, apply some lemon oil to the wooden bridge as well."
        },
        {
          "headline":"Wipe up the excess lemon oil with a clean cloth.",
          "description":"Use another clean cloth or use a dry section of the one you’re using to apply the oil and wipe over the neck to pick up any extra oil from the surface. Gently pass the cloth over the surface once or twice to soak up any large droplets so most of the oil soaks into the wood.You don’t want to scrub or remove the oil from the wood."
        }
      ]
    },
    {
      "name":"Applying Polish to the Body of the Guitar",
      "steps":[
        {
          "headline":"Choose a guitar polish that is designed for your guitar.",
          "description":"There are many different varieties of guitar polishes, and each or designed for specific guitars and finishes. Look up your guitar’s make and model online and find out what type of polish the manufacturer recommends for the best results. You could also ask your local music supply store what type of polish they recommend for your guitar. You can find guitar polish at music supply stores and online."
        },
        {
          "headline":"Spray the polish over the guitar from about 6 inches (15 cm) from the surface.",
          "description":"Hold the spray bottle over the guitar and apply a fine mist all over the body of the guitar. Be sure to get the back and sides of the guitar and avoid getting the polish on the fretboard and neck.You don’t need to saturate the body with the polish. Just apply enough to thinly cover the surface.Tip: If you do get some polish on the fretboard, wipe it away with a clean cloth as soon as possible so it doesn’t soak into the wood."
        },
        {
          "headline":"Use a microfiber cloth to buff the body of the guitar.",
          "description":"Use gentle, circular motions to spread the polish all over the body of the guitar and to buff it so it shines. Be sure to buff the sides and back of the guitar as well. Continue buffing until all of the polish has been absorbed.A microfiber cloth will prevent small threads from getting lodged in the polish."
        },
        {
          "headline":"Restring the guitar with a new set of strings when you’re finished.",
          "description":"Once the body of the guitar has been buffed, it’s ready to be restrung. Use a new set of strings and replace them in the same order that you removed them so that they’re ordered from the top-down as E, A, D, G, B, E. Tighten the tuning heads and tune the guitar so you can start playing your newly polished instrument! Use the same type of strings that were originally on the guitar for the best sound quality. Look for guitar strings at music supply stores and online."
        }
      ]
    }
  ],
  "text":" Removing the Strings Wash your hands and lay the guitar flat with the strings facing up. Wash your hands well with soap and water to remove oils that can affect the quality of your guitar’s finish when you clean and polish it. Hold the guitar in your lap or lay it flat on a clean surface. Make sure the strings are facing up so you can access all of them easily. Make sure your hands are dry as well so you don’t get extra moisture on the finish. Rotate the tuning head of the first string counterclockwise to loosen it. The tuning heads are the metal gears at the top of the guitar, also known as the headstock, that hold tension in the strings to produce sound. Start with the “E” string, which is the thickest string at the top. Play the string as you turn the tuning head to make sure you’re loosening it. The sound will get deeper as the tension is released. Continue rotating until the string no longer makes a sound when you play it.Don’t loosen the string so much that it hangs over the next string. If the note that the string makes when you play it gets higher, then you’re rotating the tuning head in the wrong direction. Loosen each of the strings one by one to ease the tension on the neck. Once you loosen the first string, move to the tuning head of the second string next to it, which is the “A” string. Thumb the string as you rotate the tuning head counterclockwise to make sure the tension is being released. Turn the tuning head until the string no longer makes a sound when it’s played, then move to the next string and repeat the process.Gently releasing the tension from all of the strings will put less strain on the neck of the guitar. Take the strings out of the tuning heads. Once all of the strings are loose, unwind the first string from its tuning head. Continue unwinding it until you can pull the end of it out of the slot on the head that’s holding it in place. Remove the rest of the strings from the tuning heads individually.Tip: If removing a string is from the tuning head is too difficult, use a pair of wire cutters to snip the string around the halfway point to make it easier to take off. Remove the bridge pins if the guitar has them. The bridge is the piece on the body of the guitar that holds the strings in place. If you have an acoustic guitar or if your guitar has small pins in the bridge to hold the strings, use a screwdriver or another flat object to gently pry the pin straight up to remove it.Set the pins aside so you can replace them later. Most electric guitars do not have bridge pins. Slide the strings out of the bridge to remove them. Pull the end of the first string that’s attached to the bridge to start sliding it out of the slot. Continue pulling the string until it’s completely removed from the guitar. Then, pull out the rest of the strings, one by one.Don’t yank or jerk the strings or you could damage the bridge or scratch the surface of the body. Cleaning and Polishing the Neck Wipe down the entire guitar with a clean cloth to remove any dust. Take a clean dry cloth and run it over the surface of the whole guitar to dust it. Work the cloth around and between the tuning heads as well as on the backside of the body. Use gentle, circular motions to remove as much dust as possible. Scrape any dirt out from the cracks between the frets with a metal pin. The frets are the small metal wires that cross over the neck of the guitar and are what allow you to change the sound of the strings. Use a small metal pin or another flat object to gently scrape any dust, dirt, or grime that is lodged in the small crevices where the frets are connected to the neck.Be careful not to scratch the wooden fretboard. If your guitar is well-maintained or new, there may not be much dirt to clean out from the frets. Use 0000 steel wool to wipe down the fretboard along the grain. Take some fine steel wool and gently rub the spaces between the frets, following the grain of the wood. Start at the top of the fretboard and work your way down to the bottom to remove any grimy buildup that may be present on the wood.Do not use a different steel wool grade or you could scratch or damage the wooden fretboard. You can find 0000 steel wool at hardware stores, department stores, and online. Apply a few drops of lemon oil to a cloth and wipe down the neck of the guitar. Take a clean dry cloth and wrap it around your finger. Drip a few drops of lemon oil onto the cloth and run it down the entire length of the guitar neck. Be sure to get the headstock and the spaces between the tuning heads. Wipe the back of the neck as well.Do not apply lemon oil to the body of the guitar.Tip: If you’re polishing an acoustic guitar, apply some lemon oil to the wooden bridge as well. Wipe up the excess lemon oil with a clean cloth. Use another clean cloth or use a dry section of the one you’re using to apply the oil and wipe over the neck to pick up any extra oil from the surface. Gently pass the cloth over the surface once or twice to soak up any large droplets so most of the oil soaks into the wood.You don’t want to scrub or remove the oil from the wood. Applying Polish to the Body of the Guitar Choose a guitar polish that is designed for your guitar. There are many different varieties of guitar polishes, and each or designed for specific guitars and finishes. Look up your guitar’s make and model online and find out what type of polish the manufacturer recommends for the best results. You could also ask your local music supply store what type of polish they recommend for your guitar. You can find guitar polish at music supply stores and online. Spray the polish over the guitar from about 6 inches (15 cm) from the surface. Hold the spray bottle over the guitar and apply a fine mist all over the body of the guitar. Be sure to get the back and sides of the guitar and avoid getting the polish on the fretboard and neck.You don’t need to saturate the body with the polish. Just apply enough to thinly cover the surface.Tip: If you do get some polish on the fretboard, wipe it away with a clean cloth as soon as possible so it doesn’t soak into the wood. Use a microfiber cloth to buff the body of the guitar. Use gentle, circular motions to spread the polish all over the body of the guitar and to buff it so it shines. Be sure to buff the sides and back of the guitar as well. Continue buffing until all of the polish has been absorbed.A microfiber cloth will prevent small threads from getting lodged in the polish. Restring the guitar with a new set of strings when you’re finished. Once the body of the guitar has been buffed, it’s ready to be restrung. Use a new set of strings and replace them in the same order that you removed them so that they’re ordered from the top-down as E, A, D, G, B, E. Tighten the tuning heads and tune the guitar so you can start playing your newly polished instrument! Use the same type of strings that were originally on the guitar for the best sound quality. Look for guitar strings at music supply stores and online.",
  "sentences":[
    " Removing the Strings Wash your hands and lay the guitar flat with the strings facing up.",
    "Wash your hands well with soap and water to remove oils that can affect the quality of your guitar’s finish when you clean and polish it.",
    "Hold the guitar in your lap or lay it flat on a clean surface.",
    "Make sure the strings are facing up so you can access all of them easily.",
    "Make sure your hands are dry as well so you don’t get extra moisture on the finish.",
    "Rotate the tuning head of the first string counterclockwise to loosen it.",
    "The tuning heads are the metal gears at the top of the guitar, also known as the headstock, that hold tension in the strings to produce sound.",
    "Start with the “E” string, which is the thickest string at the top.",
    "Play the string as you turn the tuning head to make sure you’re loosening it.",
    "The sound will get deeper as the tension is released.",
    "Continue rotating until the string no longer makes a sound when you play it.Don’t loosen the string so much that it hangs over the next string.",
    "If the note that the string makes when you play it gets higher, then you’re rotating the tuning head in the wrong direction.",
    "Loosen each of the strings one by one to ease the tension on the neck.",
    "Once you loosen the first string, move to the tuning head of the second string next to it, which is the “A” string.",
    "Thumb the string as you rotate the tuning head counterclockwise to make sure the tension is being released.",
    "Turn the tuning head until the string no longer makes a sound when it’s played, then move to the next string and repeat the process.Gently releasing the tension from all of the strings will put less strain on the neck of the guitar.",
    "Take the strings out of the tuning heads.",
    "Once all of the strings are loose, unwind the first string from its tuning head.",
    "Continue unwinding it until you can pull the end of it out of the slot on the head that’s holding it in place.",
    "Remove the rest of the strings from the tuning heads individually.Tip: If removing a string is from the tuning head is too difficult, use a pair of wire cutters to snip the string around the halfway point to make it easier to take off.",
    "Remove the bridge pins if the guitar has them.",
    "The bridge is the piece on the body of the guitar that holds the strings in place.",
    "If you have an acoustic guitar or if your guitar has small pins in the bridge to hold the strings, use a screwdriver or another flat object to gently pry the pin straight up to remove it.Set the pins aside so you can replace them later.",
    "Most electric guitars do not have bridge pins.",
    "Slide the strings out of the bridge to remove them.",
    "Pull the end of the first string that’s attached to the bridge to start sliding it out of the slot.",
    "Continue pulling the string until it’s completely removed from the guitar.",
    "Then, pull out the rest of the strings, one by one.Don’t yank or jerk the strings or you could damage the bridge or scratch the surface of the body.",
    "Cleaning and Polishing the Neck Wipe down the entire guitar with a clean cloth to remove any dust.",
    "Take a clean dry cloth and run it over the surface of the whole guitar to dust it.",
    "Work the cloth around and between the tuning heads as well as on the backside of the body.",
    "Use gentle, circular motions to remove as much dust as possible.",
    "Scrape any dirt out from the cracks between the frets with a metal pin.",
    "The frets are the small metal wires that cross over the neck of the guitar and are what allow you to change the sound of the strings.",
    "Use a small metal pin or another flat object to gently scrape any dust, dirt, or grime that is lodged in the small crevices where the frets are connected to the neck.Be careful not to scratch the wooden fretboard.",
    "If your guitar is well-maintained or new, there may not be much dirt to clean out from the frets.",
    "Use 0000 steel wool to wipe down the fretboard along the grain.",
    "Take some fine steel wool and gently rub the spaces between the frets, following the grain of the wood.",
    "Start at the top of the fretboard and work your way down to the bottom to remove any grimy buildup that may be present on the wood.Do not use a different steel wool grade or you could scratch or damage the wooden fretboard.",
    "You can find 0000 steel wool at hardware stores, department stores, and online.",
    "Apply a few drops of lemon oil to a cloth and wipe down the neck of the guitar.",
    "Take a clean dry cloth and wrap it around your finger.",
    "Drip a few drops of lemon oil onto the cloth and run it down the entire length of the guitar neck.",
    "Be sure to get the headstock and the spaces between the tuning heads.",
    "Wipe the back of the neck as well.Do not apply lemon oil to the body of the guitar.Tip: If you’re polishing an acoustic guitar, apply some lemon oil to the wooden bridge as well.",
    "Wipe up the excess lemon oil with a clean cloth.",
    "Use another clean cloth or use a dry section of the one you’re using to apply the oil and wipe over the neck to pick up any extra oil from the surface.",
    "Gently pass the cloth over the surface once or twice to soak up any large droplets so most of the oil soaks into the wood.You don’t want to scrub or remove the oil from the wood.",
    "Applying Polish to the Body of the Guitar Choose a guitar polish that is designed for your guitar.",
    "There are many different varieties of guitar polishes, and each or designed for specific guitars and finishes.",
    "Look up your guitar’s make and model online and find out what type of polish the manufacturer recommends for the best results.",
    "You could also ask your local music supply store what type of polish they recommend for your guitar.",
    "You can find guitar polish at music supply stores and online.",
    "Spray the polish over the guitar from about 6 inches (15 cm) from the surface.",
    "Hold the spray bottle over the guitar and apply a fine mist all over the body of the guitar.",
    "Be sure to get the back and sides of the guitar and avoid getting the polish on the fretboard and neck.You don’t need to saturate the body with the polish.",
    "Just apply enough to thinly cover the surface.Tip: If you do get some polish on the fretboard, wipe it away with a clean cloth as soon as possible so it doesn’t soak into the wood.",
    "Use a microfiber cloth to buff the body of the guitar.",
    "Use gentle, circular motions to spread the polish all over the body of the guitar and to buff it so it shines.",
    "Be sure to buff the sides and back of the guitar as well.",
    "Continue buffing until all of the polish has been absorbed.A microfiber cloth will prevent small threads from getting lodged in the polish.",
    "Restring the guitar with a new set of strings when you’re finished.",
    "Once the body of the guitar has been buffed, it’s ready to be restrung.",
    "Use a new set of strings and replace them in the same order that you removed them so that they’re ordered from the top-down as E, A, D, G, B, E. Tighten the tuning heads and tune the guitar so you can start playing your newly polished instrument!",
    "Use the same type of strings that were originally on the guitar for the best sound quality.",
    "Look for guitar strings at music supply stores and online."
  ],
  "tyn_section":[
    "Clean cloths",
    "Small metal pin (or a similar thin object)",
    "0000 steel wool",
    "Lemon oil",
    "Microfiber cloth",
    "Guitar polish"
  ],
  "tyn_model":[
    "guitar",
    "cloth",
    "polish",
    "lemon oil",
    "” string",
    "guitar polish",
    "music supply stores",
    "microfiber cloth",
    "soap",
    "water",
    "“e",
    "tuning head",
    "“a",
    "wire cutters",
    "screwdriver",
    "electric guitars",
    "metal pin",
    "0000 steel",
    "fine steel wool",
    "0000 steel wool",
    "oil",
    "guitar polishes",
    "spray bottle",
    "guitar strings"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1666666667,
    "f1":0.2666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.4166666667,
    "f1":0.5128205128
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.5,
    "f1":0.5714285714
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.2083333333,
    "f1":0.3174603175
  }
}