{
  "title":"How to Dry Fimo Clay",
  "url":"https://www.wikihow.com/Dry-Fimo-Clay",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Clay Projects"
  ],
  "methods":[
    {
      "name":"Baking Standard FIMO Clay",
      "steps":[
        {
          "headline":"Preheat the oven to 110 °C (230 °F).",
          "description":"Set the oven to the correct temperature and proceed with the next steps while you wait for it to heat up. It should take about 10 minutes to reach that temperature, though the time varies depending on your oven type. Exposing the clay to temperatures higher than 110 °C (230 °F) can crack or burn your model. Use an oven thermometer to confirm that your oven is at the correct temperature."
        },
        {
          "headline":"Place the clay in an oven tray lined with foil or baking paper.",
          "description":"This prevents the clay from sticking to the tray. Take a plastic or metal oven tray and pull out a sheet of paper. Then place the clay in the center of the tray. The clay doesn’t expand when it heats, so you can place multiple models close to each other. To save paper or foil, you could also use a small section for each model instead of lining the whole tray."
        },
        {
          "headline":"Place the tray on the middle oven rack for even heating.",
          "description":"Keeping the clay away from the broiler and heating units helps prevent burning. For the best results, place the tray in the center of the middle rack."
        },
        {
          "headline":"Bake the clay for 30 minutes.",
          "description":"This is enough time for all the oils to burn off, hardening the model into the shape that you formed it. Take the model out as soon as 30 minutes pass. The model will burn if you heat it for too long. Set an alarm so you remember to take it out in time. Check on the model periodically to see if it's getting dark or discolored. This means it's starting to burn, so remove it right away if you see these signs."
        },
        {
          "headline":"Let the clay cool to room temperature to complete the process.",
          "description":"The model is not completely hard until it cools down. When you remove the clay, leave it on a countertop or table for about an hour to cool completely. Room temperature is about 68–77 °F (20–25 °C). Make sure the temperature in your home is in that range for ideal hardening. Do not place the model in a cold area. This will cool it too quickly and cause cracking."
        }
      ]
    },
    {
      "name":"Air-drying FIMOair",
      "steps":[
        {
          "headline":"Leave the model on a plate at room temperature.",
          "description":"FIMOair is a product designed to air-dry instead of drying in the oven. Take your model and place it on a plate out of direct sunlight. Leave that plate out at room temperature to start the drying process. Room temperature is about 68–77 °F (20–25 °C). If your home is hotter or colder than that, try adjusting the temperature for better results. If you want to store clay without it hardening, spray it with some water and seal it in an airtight bag."
        },
        {
          "headline":"Turn or rotate the model every 2-3 hours so it dries evenly.",
          "description":"Make sure each part of the model gets air exposure so it dries on all sides. Leave the clay out and come back to rotate it every 2-3 hours to it hardens evenly. Remember to expose the bottom part to air as well. Don’t just rotate it from side to side. It’s okay to leave the clay overnight. Just make sure you rotate it as soon as you get up."
        },
        {
          "headline":"Leave the clay out for several days so it’s completely dry.",
          "description":"The air-drying process can be slow. Be patient and continue rotating the model regularly. The model could take 2-4 days to harden, depending on how thick it is. Press down slightly to feel if the clay still has any give to it. If not, then it's completely dry. Don’t try to accelerate the drying process with a hair dryer or leaving the clay in direct sunlight. These, and other methods, will crack the clay."
        },
        {
          "headline":"Fill any cracks with fresh clay.",
          "description":"Sometimes small cracks form during the drying process. If this happens, just take some fresh clay of the same color and press it into the cracks. This helps the model resist further cracking. Leave the model out for another day for the filling to dry. Painting the model can cover up any cracks or imperfections that form."
        }
      ]
    },
    {
      "name":"Using a Microwave for FIMOair Light",
      "steps":[
        {
          "headline":"Confirm that the clay can be heated in the microwave.",
          "description":"FIMOair Light is a product designed for microwave drying. Check the packaging to confirm that you have FIMOair Light and that it’s safe for microwave drying. FIMOair Light can also air-dry with the same process as FIMOair."
        },
        {
          "headline":"Put the clay into the microwave within an hour of shaping it.",
          "description":"If you wait too long, the air-drying process could start and the clay could crack in the microwave. As soon as you shape the model, put it in the microwave on a sheet of paper."
        },
        {
          "headline":"Place a plastic cup of cold water in the microwave.",
          "description":"A bit of moisture helps the clay dry evenly. Fill a microwave-safe cup with 125 ml (4.4 imp fl oz; 4.2  fl oz) of cold water and place it in the microwave as well."
        },
        {
          "headline":"Heat the clay for 10 minutes at 600 watts.",
          "description":"Press the “Power Level” or “Adjust Power” button on your microwave. Set it to 600 watts so you don’t overheat the clay. Then press “Start” and set the timer for 10 minutes to dry the clay. Common household microwaves have a total power of around 1,000 watts, meaning you’d adjust it to 60% power for the clay. Cheaper microwaves are weaker, but should have at least 600 watts of power."
        },
        {
          "headline":"Remove the clay and let it cool down.",
          "description":"Grab the paper or plate that you had the clay on and remove it from the microwave. Set the model down and let it cool off to room temperature before handling it. Allow about 10 minutes of cooling time before you touch the model. Don’t touch the clay directly when you take it out of the microwave because it may burn you."
        }
      ]
    }
  ],
  "text":" Baking Standard FIMO Clay Preheat the oven to 110 °C (230 °F). Set the oven to the correct temperature and proceed with the next steps while you wait for it to heat up. It should take about 10 minutes to reach that temperature, though the time varies depending on your oven type. Exposing the clay to temperatures higher than 110 °C (230 °F) can crack or burn your model. Use an oven thermometer to confirm that your oven is at the correct temperature. Place the clay in an oven tray lined with foil or baking paper. This prevents the clay from sticking to the tray. Take a plastic or metal oven tray and pull out a sheet of paper. Then place the clay in the center of the tray. The clay doesn’t expand when it heats, so you can place multiple models close to each other. To save paper or foil, you could also use a small section for each model instead of lining the whole tray. Place the tray on the middle oven rack for even heating. Keeping the clay away from the broiler and heating units helps prevent burning. For the best results, place the tray in the center of the middle rack. Bake the clay for 30 minutes. This is enough time for all the oils to burn off, hardening the model into the shape that you formed it. Take the model out as soon as 30 minutes pass. The model will burn if you heat it for too long. Set an alarm so you remember to take it out in time. Check on the model periodically to see if it's getting dark or discolored. This means it's starting to burn, so remove it right away if you see these signs. Let the clay cool to room temperature to complete the process. The model is not completely hard until it cools down. When you remove the clay, leave it on a countertop or table for about an hour to cool completely. Room temperature is about 68–77 °F (20–25 °C). Make sure the temperature in your home is in that range for ideal hardening. Do not place the model in a cold area. This will cool it too quickly and cause cracking. Air-drying FIMOair Leave the model on a plate at room temperature. FIMOair is a product designed to air-dry instead of drying in the oven. Take your model and place it on a plate out of direct sunlight. Leave that plate out at room temperature to start the drying process. Room temperature is about 68–77 °F (20–25 °C). If your home is hotter or colder than that, try adjusting the temperature for better results. If you want to store clay without it hardening, spray it with some water and seal it in an airtight bag. Turn or rotate the model every 2-3 hours so it dries evenly. Make sure each part of the model gets air exposure so it dries on all sides. Leave the clay out and come back to rotate it every 2-3 hours to it hardens evenly. Remember to expose the bottom part to air as well. Don’t just rotate it from side to side. It’s okay to leave the clay overnight. Just make sure you rotate it as soon as you get up. Leave the clay out for several days so it’s completely dry. The air-drying process can be slow. Be patient and continue rotating the model regularly. The model could take 2-4 days to harden, depending on how thick it is. Press down slightly to feel if the clay still has any give to it. If not, then it's completely dry. Don’t try to accelerate the drying process with a hair dryer or leaving the clay in direct sunlight. These, and other methods, will crack the clay. Fill any cracks with fresh clay. Sometimes small cracks form during the drying process. If this happens, just take some fresh clay of the same color and press it into the cracks. This helps the model resist further cracking. Leave the model out for another day for the filling to dry. Painting the model can cover up any cracks or imperfections that form. Using a Microwave for FIMOair Light Confirm that the clay can be heated in the microwave. FIMOair Light is a product designed for microwave drying. Check the packaging to confirm that you have FIMOair Light and that it’s safe for microwave drying. FIMOair Light can also air-dry with the same process as FIMOair. Put the clay into the microwave within an hour of shaping it. If you wait too long, the air-drying process could start and the clay could crack in the microwave. As soon as you shape the model, put it in the microwave on a sheet of paper. Place a plastic cup of cold water in the microwave. A bit of moisture helps the clay dry evenly. Fill a microwave-safe cup with 125 ml (4.4 imp fl oz; 4.2  fl oz) of cold water and place it in the microwave as well. Heat the clay for 10 minutes at 600 watts. Press the “Power Level” or “Adjust Power” button on your microwave. Set it to 600 watts so you don’t overheat the clay. Then press “Start” and set the timer for 10 minutes to dry the clay. Common household microwaves have a total power of around 1,000 watts, meaning you’d adjust it to 60% power for the clay. Cheaper microwaves are weaker, but should have at least 600 watts of power. Remove the clay and let it cool down. Grab the paper or plate that you had the clay on and remove it from the microwave. Set the model down and let it cool off to room temperature before handling it. Allow about 10 minutes of cooling time before you touch the model. Don’t touch the clay directly when you take it out of the microwave because it may burn you.",
  "sentences":[
    " Baking Standard FIMO Clay Preheat the oven to 110 °C (230 °F).",
    "Set the oven to the correct temperature and proceed with the next steps while you wait for it to heat up.",
    "It should take about 10 minutes to reach that temperature, though the time varies depending on your oven type.",
    "Exposing the clay to temperatures higher than 110 °C (230 °F) can crack or burn your model.",
    "Use an oven thermometer to confirm that your oven is at the correct temperature.",
    "Place the clay in an oven tray lined with foil or baking paper.",
    "This prevents the clay from sticking to the tray.",
    "Take a plastic or metal oven tray and pull out a sheet of paper.",
    "Then place the clay in the center of the tray.",
    "The clay doesn’t expand when it heats, so you can place multiple models close to each other.",
    "To save paper or foil, you could also use a small section for each model instead of lining the whole tray.",
    "Place the tray on the middle oven rack for even heating.",
    "Keeping the clay away from the broiler and heating units helps prevent burning.",
    "For the best results, place the tray in the center of the middle rack.",
    "Bake the clay for 30 minutes.",
    "This is enough time for all the oils to burn off, hardening the model into the shape that you formed it.",
    "Take the model out as soon as 30 minutes pass.",
    "The model will burn if you heat it for too long.",
    "Set an alarm so you remember to take it out in time.",
    "Check on the model periodically to see if it's getting dark or discolored.",
    "This means it's starting to burn, so remove it right away if you see these signs.",
    "Let the clay cool to room temperature to complete the process.",
    "The model is not completely hard until it cools down.",
    "When you remove the clay, leave it on a countertop or table for about an hour to cool completely.",
    "Room temperature is about 68–77 °F (20–25 °C).",
    "Make sure the temperature in your home is in that range for ideal hardening.",
    "Do not place the model in a cold area.",
    "This will cool it too quickly and cause cracking.",
    "Air-drying FIMOair Leave the model on a plate at room temperature.",
    "FIMOair is a product designed to air-dry instead of drying in the oven.",
    "Take your model and place it on a plate out of direct sunlight.",
    "Leave that plate out at room temperature to start the drying process.",
    "Room temperature is about 68–77 °F (20–25 °C).",
    "If your home is hotter or colder than that, try adjusting the temperature for better results.",
    "If you want to store clay without it hardening, spray it with some water and seal it in an airtight bag.",
    "Turn or rotate the model every 2-3 hours so it dries evenly.",
    "Make sure each part of the model gets air exposure so it dries on all sides.",
    "Leave the clay out and come back to rotate it every 2-3 hours to it hardens evenly.",
    "Remember to expose the bottom part to air as well.",
    "Don’t just rotate it from side to side.",
    "It’s okay to leave the clay overnight.",
    "Just make sure you rotate it as soon as you get up.",
    "Leave the clay out for several days so it’s completely dry.",
    "The air-drying process can be slow.",
    "Be patient and continue rotating the model regularly.",
    "The model could take 2-4 days to harden, depending on how thick it is.",
    "Press down slightly to feel if the clay still has any give to it.",
    "If not, then it's completely dry.",
    "Don’t try to accelerate the drying process with a hair dryer or leaving the clay in direct sunlight.",
    "These, and other methods, will crack the clay.",
    "Fill any cracks with fresh clay.",
    "Sometimes small cracks form during the drying process.",
    "If this happens, just take some fresh clay of the same color and press it into the cracks.",
    "This helps the model resist further cracking.",
    "Leave the model out for another day for the filling to dry.",
    "Painting the model can cover up any cracks or imperfections that form.",
    "Using a Microwave for FIMOair Light Confirm that the clay can be heated in the microwave.",
    "FIMOair Light is a product designed for microwave drying.",
    "Check the packaging to confirm that you have FIMOair Light and that it’s safe for microwave drying.",
    "FIMOair Light can also air-dry with the same process as FIMOair.",
    "Put the clay into the microwave within an hour of shaping it.",
    "If you wait too long, the air-drying process could start and the clay could crack in the microwave.",
    "As soon as you shape the model, put it in the microwave on a sheet of paper.",
    "Place a plastic cup of cold water in the microwave.",
    "A bit of moisture helps the clay dry evenly.",
    "Fill a microwave-safe cup with 125 ml (4.4 imp fl oz; 4.2  fl oz) of cold water and place it in the microwave as well.",
    "Heat the clay for 10 minutes at 600 watts.",
    "Press the “Power Level” or “Adjust Power” button on your microwave.",
    "Set it to 600 watts so you don’t overheat the clay.",
    "Then press “Start” and set the timer for 10 minutes to dry the clay.",
    "Common household microwaves have a total power of around 1,000 watts, meaning you’d adjust it to 60% power for the clay.",
    "Cheaper microwaves are weaker, but should have at least 600 watts of power.",
    "Remove the clay and let it cool down.",
    "Grab the paper or plate that you had the clay on and remove it from the microwave.",
    "Set the model down and let it cool off to room temperature before handling it.",
    "Allow about 10 minutes of cooling time before you touch the model.",
    "Don’t touch the clay directly when you take it out of the microwave because it may burn you."
  ],
  "tyn_section":[
    "Baking paper or aluminum foil",
    "Oven",
    "Baking sheet",
    "Plate or paper",
    "Microwave",
    "Microwave-safe plate or paper",
    "Microwave-safe cup",
    "Cold water"
  ],
  "tyn_model":[
    "clay",
    "microwave",
    "oven",
    "plate",
    "paper",
    "tray",
    "cold water",
    "microwaves",
    "oven thermometer",
    "oven tray",
    "foil",
    "broiler",
    "air-drying fimoair",
    "water",
    "airtight bag",
    "air",
    "air-drying",
    "hair dryer",
    "plastic cup",
    "microwave-safe cup",
    "“power",
    "” or",
    "“adjust",
    "” button",
    "“start",
    "” and"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1538461538,
    "f1":0.2352941176,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2692307692,
    "f1":0.35
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.3846153846,
    "f1":0.4761904762
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1538461538,
    "f1":0.2352941176
  }
}