{
  "title":"How to Dry Elderberries in the Oven",
  "url":"https://www.wikihow.com/Dry-Elderberries-in-the-Oven",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "parts":[
    {
      "name":"Cleaning the Elderberries",
      "steps":[
        {
          "headline":"Cut off the leaves and flowers with scissors.",
          "description":"If you’ve picked your elderberries yourself, they may have stems, leaves, or even flowers still attached. Use a pair of sharp scissors to cut off any excess bits that you don’t want to eat.Tip: If your berries are still on the stem, take them off so that they are all separate. Sort through your berries and throw away any that look overripe or mushy. Make sure all of your elderberries are ripe by looking for a rich purple hue on the skin. Unripe elderberries look pale and watery and can make you sick if you eat them."
        },
        {
          "headline":"Wash the elderberries in clean water.",
          "description":"Place your berries in a bowl and rinse them with cold water. Drain them through a strainer to get rid of any dirt or plant matter that is left."
        },
        {
          "headline":"Pat the elderberries dry with a paper towel.",
          "description":"Lay a paper towel out on a flat surface, like a table or counter top. Spread your elderberries on top of the towel and use another paper towel to pat them dry.Make sure your berries don’t have a lot of excess moisture on them, or it could take a lot longer for them to dry out."
        }
      ]
    },
    {
      "name":"Putting the Elderberries in the Oven",
      "steps":[
        {
          "headline":"Preheat your oven to 115 °F (46 °C).",
          "description":"Preheat your oven before you put your berries in. Keep it at a low temperature to dry out the berries slowly so that they don’t burn. Turning up your oven won’t make the berries dry out faster, but it will probably burn them."
        },
        {
          "headline":"Line a baking tray with parchment paper.",
          "description":"Cut out a piece of parchment paper a little bit smaller than your baking tray. Lay it out on a flat baking tray and make sure it stays down flat.Using parchment paper ensures that the berries won’t get stuck to the tray as they dry out."
        },
        {
          "headline":"Spread the elderberries out on the baking tray in a single layer.",
          "description":"Make sure your berries aren’t overlapping on the baking tray. If they are spread out, they will dry out faster."
        },
        {
          "headline":"Bake them for 15 to 30 minutes on the middle rack of your oven.",
          "description":"Check the berries’ progress after 15 minutes. If they haven’t reduced in size by half or look any darker in color, they probably need more time. Keep checking on the berries every 5 minutes until they look small and hard.Tip: If your berries were still damp from washing them, they may need more time in the oven."
        },
        {
          "headline":"Take the tray out and let your berries cool to room temperature.",
          "description":"Set your baking tray on a flat surface, like your stove top. Allow them to cool down to room temperature before transferring them to an airtight container."
        },
        {
          "headline":"Transfer your elderberries to an airtight container.",
          "description":"Store your dried elderberries in a container with a lid. Make sure your berries are kept airtight so that they don’t go bad, and keep the container in a cool, dry place, like a kitchen cabinet. You can store dried elderberries in an airtight container for 2 to 3 years, as long as they don’t get wet."
        }
      ]
    }
  ],
  "text":" Cleaning the Elderberries Cut off the leaves and flowers with scissors. If you’ve picked your elderberries yourself, they may have stems, leaves, or even flowers still attached. Use a pair of sharp scissors to cut off any excess bits that you don’t want to eat.Tip: If your berries are still on the stem, take them off so that they are all separate. Sort through your berries and throw away any that look overripe or mushy. Make sure all of your elderberries are ripe by looking for a rich purple hue on the skin. Unripe elderberries look pale and watery and can make you sick if you eat them. Wash the elderberries in clean water. Place your berries in a bowl and rinse them with cold water. Drain them through a strainer to get rid of any dirt or plant matter that is left. Pat the elderberries dry with a paper towel. Lay a paper towel out on a flat surface, like a table or counter top. Spread your elderberries on top of the towel and use another paper towel to pat them dry.Make sure your berries don’t have a lot of excess moisture on them, or it could take a lot longer for them to dry out. Putting the Elderberries in the Oven Preheat your oven to 115 °F (46 °C). Preheat your oven before you put your berries in. Keep it at a low temperature to dry out the berries slowly so that they don’t burn. Turning up your oven won’t make the berries dry out faster, but it will probably burn them. Line a baking tray with parchment paper. Cut out a piece of parchment paper a little bit smaller than your baking tray. Lay it out on a flat baking tray and make sure it stays down flat.Using parchment paper ensures that the berries won’t get stuck to the tray as they dry out. Spread the elderberries out on the baking tray in a single layer. Make sure your berries aren’t overlapping on the baking tray. If they are spread out, they will dry out faster. Bake them for 15 to 30 minutes on the middle rack of your oven. Check the berries’ progress after 15 minutes. If they haven’t reduced in size by half or look any darker in color, they probably need more time. Keep checking on the berries every 5 minutes until they look small and hard.Tip: If your berries were still damp from washing them, they may need more time in the oven. Take the tray out and let your berries cool to room temperature. Set your baking tray on a flat surface, like your stove top. Allow them to cool down to room temperature before transferring them to an airtight container. Transfer your elderberries to an airtight container. Store your dried elderberries in a container with a lid. Make sure your berries are kept airtight so that they don’t go bad, and keep the container in a cool, dry place, like a kitchen cabinet. You can store dried elderberries in an airtight container for 2 to 3 years, as long as they don’t get wet.",
  "sentences":[
    " Cleaning the Elderberries Cut off the leaves and flowers with scissors.",
    "If you’ve picked your elderberries yourself, they may have stems, leaves, or even flowers still attached.",
    "Use a pair of sharp scissors to cut off any excess bits that you don’t want to eat.Tip: If your berries are still on the stem, take them off so that they are all separate.",
    "Sort through your berries and throw away any that look overripe or mushy.",
    "Make sure all of your elderberries are ripe by looking for a rich purple hue on the skin.",
    "Unripe elderberries look pale and watery and can make you sick if you eat them.",
    "Wash the elderberries in clean water.",
    "Place your berries in a bowl and rinse them with cold water.",
    "Drain them through a strainer to get rid of any dirt or plant matter that is left.",
    "Pat the elderberries dry with a paper towel.",
    "Lay a paper towel out on a flat surface, like a table or counter top.",
    "Spread your elderberries on top of the towel and use another paper towel to pat them dry.Make sure your berries don’t have a lot of excess moisture on them, or it could take a lot longer for them to dry out.",
    "Putting the Elderberries in the Oven Preheat your oven to 115 °F (46 °C).",
    "Preheat your oven before you put your berries in.",
    "Keep it at a low temperature to dry out the berries slowly so that they don’t burn.",
    "Turning up your oven won’t make the berries dry out faster, but it will probably burn them.",
    "Line a baking tray with parchment paper.",
    "Cut out a piece of parchment paper a little bit smaller than your baking tray.",
    "Lay it out on a flat baking tray and make sure it stays down flat.Using parchment paper ensures that the berries won’t get stuck to the tray as they dry out.",
    "Spread the elderberries out on the baking tray in a single layer.",
    "Make sure your berries aren’t overlapping on the baking tray.",
    "If they are spread out, they will dry out faster.",
    "Bake them for 15 to 30 minutes on the middle rack of your oven.",
    "Check the berries’ progress after 15 minutes.",
    "If they haven’t reduced in size by half or look any darker in color, they probably need more time.",
    "Keep checking on the berries every 5 minutes until they look small and hard.Tip: If your berries were still damp from washing them, they may need more time in the oven.",
    "Take the tray out and let your berries cool to room temperature.",
    "Set your baking tray on a flat surface, like your stove top.",
    "Allow them to cool down to room temperature before transferring them to an airtight container.",
    "Transfer your elderberries to an airtight container.",
    "Store your dried elderberries in a container with a lid.",
    "Make sure your berries are kept airtight so that they don’t go bad, and keep the container in a cool, dry place, like a kitchen cabinet.",
    "You can store dried elderberries in an airtight container for 2 to 3 years, as long as they don’t get wet."
  ],
  "tyn_section":[
    "Scissors",
    "Bowl",
    "Strainer",
    "Paper towels",
    "Baking tray",
    "Parchment paper",
    "Airtight container"
  ],
  "tyn_model":[
    "oven",
    "baking tray",
    "elderberries",
    "berries",
    "paper towel",
    "parchment paper",
    "airtight container",
    "scissors",
    "water",
    "bowl",
    "strainer",
    "’ progress",
    "tray",
    "stove top",
    "container"
  ],
  "simple_metrics":{
    "r":0.8571428571,
    "p":0.4,
    "f1":0.5454545455,
    "avg_pos":0.4666666667
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.5333333333,
    "f1":0.6575342466
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.6,
    "f1":0.75
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8571428571,
    "p":0.4,
    "f1":0.5454545455
  }
}