{
  "title":"How to Tie Dye Pants",
  "url":"https://www.wikihow.com/Tie-Dye-Pants",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Scrunching or Folding Your Pants",
      "steps":[
        {
          "headline":"Choose white pants made of cotton.",
          "description":"You can tie dye leggings, yoga pants, or even jeggings, as long as they are made of 100% cotton. Check the label on your pants to find out what material they are, and make sure they are mostly white. Tie dye colors show up the best on white clothing. If you are dyeing yoga pants or leggings, they may have some elastic blended in with the cotton. As long as it's under 10%, your tie dye will still work just fine."
        },
        {
          "headline":"Lay your pants out flat.",
          "description":"Smooth out your pants on a flat surface, like a table or countertop. Make sure the surface is clean so you don't get your white pants dirty, and smooth out any wrinkles or creases in your pants with your hands.You don’t need to iron your pants; just use your hands to smooth them out as best you can."
        },
        {
          "headline":"Scrunch your pants up towards the waistband for a splatter effect.",
          "description":"Grab the bottom of the legs of your pants and push them up towards the waistband. Bring the waistband in towards the legs of your pants and try to make a large ball of fabric.This scrunched method makes a random splatter effect on your pants."
        },
        {
          "headline":"Fold your pants accordion style for a spiral design.",
          "description":"Start at the bottom of 1 leg of your pants and fold it up in a 0.5 in (1.3 cm) horizontal section. Turn that fold over on itself to make a second fold. Continue this all the way up both legs of your pants, and then fold the waistband the same way.This folding method creates more of a classic spiral tie dye pattern."
        },
        {
          "headline":"Put rubber bands around the middle of your pants for a bullseye.",
          "description":"Pinch the middle of your pants upwards and wrap a rubber band around them so that they stick up in place. Keep pinching and attaching rubber bands about 2 inches (5.1 cm) apart until you can’t grab any more fabric.This creates a bullseye design that will stem out from the center of your rubber bands."
        },
        {
          "headline":"Attach rubber bands in random places to hold your design in place.",
          "description":"Grab 5 to 6 large rubber bands and place them around your pants to hold your folds together. Make sure your pants stay tight in their design and won’t come loose as you apply your dye.Tip: You can also put the rubber bands on as you scrunch or fold your pants if it’s easier."
        }
      ]
    },
    {
      "name":"Applying the Dye",
      "steps":[
        {
          "headline":"Put on rubber gloves and lay down plastic to protect your surface.",
          "description":"Grab some rubber kitchen gloves or latex gloves to keep your hands protected as you use your dye. Then, place a large plastic tarp or some large plastic bags down to keep the dye contained, even if you are working outside. You can buy gloves at most home goods stores."
        },
        {
          "headline":"Mix up your dye in individual squirt bottles.",
          "description":"Open up your tie dye and follow the instructions on the package. Mix each color in individual plastic bottles with squirt bottle tops so that you can pour them out easily.You can use as many or as little colors of dye that you would like to! Classic tie dye usually involves red, green, yellow, purple, or blue, but you can also find pastel tie dye colors. You can purchase tie dye at most craft stores."
        },
        {
          "headline":"Squirt dye over your pants in a random pattern for an irregular design.",
          "description":"Take your bottles of dye one at a time and squirt each color onto your pants. Overlap your colors for a design that makes a random pattern.Tip: Make sure you turn your pants over to get dye on both sides. Try using red, purple, and blue for a cute color combination. Add yellow and orange dye for bright, vibrant pants."
        },
        {
          "headline":"Add dye in blocks or lines for a sequential pattern.",
          "description":"Use each dye color in blocks or lines that are about 2 inches (5.1 cm) wide. You can do your colors in an alternating pattern for a cohesive look overall.Try using red, green, and yellow for a classic looking tie dye."
        }
      ]
    },
    {
      "name":"Rinsing Your Pants and Letting Them Dry",
      "steps":[
        {
          "headline":"Place your pants in a plastic bag and let them sit for 6 hours.",
          "description":"Don’t disturb your pants so that they have time to soak in all the dye. The longer you leave your pants, the more vibrant the colors will be. Leave them on a porch or back patio so they won’t be moved around. You can let your pants sit for as long as 24 hours if you’d like to."
        },
        {
          "headline":"Rinse out your pants with cold water.",
          "description":"Take your pants out of the plastic bag and run cold water over them in the sink. Keep rinsing your pants until the water runs clear so that the dye doesn’t get on any of your other clothes.Cold water will leave your dye intact and won’t make the colors run together."
        },
        {
          "headline":"Let your pants air dry before you wear them.",
          "description":"Hang your pants out to dry in the sun until they aren’t damp anymore, or put them in the dryer to dry them faster. Enjoy showing off your DIY tie dyed pants!Tip: If your pants get dirty, wash them on their own in cold water to make sure the dye doesn’t get on any of your other clothes."
        }
      ]
    }
  ],
  "text":" Scrunching or Folding Your Pants Choose white pants made of cotton. You can tie dye leggings, yoga pants, or even jeggings, as long as they are made of 100% cotton. Check the label on your pants to find out what material they are, and make sure they are mostly white. Tie dye colors show up the best on white clothing. If you are dyeing yoga pants or leggings, they may have some elastic blended in with the cotton. As long as it's under 10%, your tie dye will still work just fine. Lay your pants out flat. Smooth out your pants on a flat surface, like a table or countertop. Make sure the surface is clean so you don't get your white pants dirty, and smooth out any wrinkles or creases in your pants with your hands.You don’t need to iron your pants; just use your hands to smooth them out as best you can. Scrunch your pants up towards the waistband for a splatter effect. Grab the bottom of the legs of your pants and push them up towards the waistband. Bring the waistband in towards the legs of your pants and try to make a large ball of fabric.This scrunched method makes a random splatter effect on your pants. Fold your pants accordion style for a spiral design. Start at the bottom of 1 leg of your pants and fold it up in a 0.5 in (1.3 cm) horizontal section. Turn that fold over on itself to make a second fold. Continue this all the way up both legs of your pants, and then fold the waistband the same way.This folding method creates more of a classic spiral tie dye pattern. Put rubber bands around the middle of your pants for a bullseye. Pinch the middle of your pants upwards and wrap a rubber band around them so that they stick up in place. Keep pinching and attaching rubber bands about 2 inches (5.1 cm) apart until you can’t grab any more fabric.This creates a bullseye design that will stem out from the center of your rubber bands. Attach rubber bands in random places to hold your design in place. Grab 5 to 6 large rubber bands and place them around your pants to hold your folds together. Make sure your pants stay tight in their design and won’t come loose as you apply your dye.Tip: You can also put the rubber bands on as you scrunch or fold your pants if it’s easier. Applying the Dye Put on rubber gloves and lay down plastic to protect your surface. Grab some rubber kitchen gloves or latex gloves to keep your hands protected as you use your dye. Then, place a large plastic tarp or some large plastic bags down to keep the dye contained, even if you are working outside. You can buy gloves at most home goods stores. Mix up your dye in individual squirt bottles. Open up your tie dye and follow the instructions on the package. Mix each color in individual plastic bottles with squirt bottle tops so that you can pour them out easily.You can use as many or as little colors of dye that you would like to! Classic tie dye usually involves red, green, yellow, purple, or blue, but you can also find pastel tie dye colors. You can purchase tie dye at most craft stores. Squirt dye over your pants in a random pattern for an irregular design. Take your bottles of dye one at a time and squirt each color onto your pants. Overlap your colors for a design that makes a random pattern.Tip: Make sure you turn your pants over to get dye on both sides. Try using red, purple, and blue for a cute color combination. Add yellow and orange dye for bright, vibrant pants. Add dye in blocks or lines for a sequential pattern. Use each dye color in blocks or lines that are about 2 inches (5.1 cm) wide. You can do your colors in an alternating pattern for a cohesive look overall.Try using red, green, and yellow for a classic looking tie dye. Rinsing Your Pants and Letting Them Dry Place your pants in a plastic bag and let them sit for 6 hours. Don’t disturb your pants so that they have time to soak in all the dye. The longer you leave your pants, the more vibrant the colors will be. Leave them on a porch or back patio so they won’t be moved around. You can let your pants sit for as long as 24 hours if you’d like to. Rinse out your pants with cold water. Take your pants out of the plastic bag and run cold water over them in the sink. Keep rinsing your pants until the water runs clear so that the dye doesn’t get on any of your other clothes.Cold water will leave your dye intact and won’t make the colors run together. Let your pants air dry before you wear them. Hang your pants out to dry in the sun until they aren’t damp anymore, or put them in the dryer to dry them faster. Enjoy showing off your DIY tie dyed pants!Tip: If your pants get dirty, wash them on their own in cold water to make sure the dye doesn’t get on any of your other clothes.",
  "sentences":[
    " Scrunching or Folding Your Pants Choose white pants made of cotton.",
    "You can tie dye leggings, yoga pants, or even jeggings, as long as they are made of 100% cotton.",
    "Check the label on your pants to find out what material they are, and make sure they are mostly white.",
    "Tie dye colors show up the best on white clothing.",
    "If you are dyeing yoga pants or leggings, they may have some elastic blended in with the cotton.",
    "As long as it's under 10%, your tie dye will still work just fine.",
    "Lay your pants out flat.",
    "Smooth out your pants on a flat surface, like a table or countertop.",
    "Make sure the surface is clean so you don't get your white pants dirty, and smooth out any wrinkles or creases in your pants with your hands.You don’t need to iron your pants; just use your hands to smooth them out as best you can.",
    "Scrunch your pants up towards the waistband for a splatter effect.",
    "Grab the bottom of the legs of your pants and push them up towards the waistband.",
    "Bring the waistband in towards the legs of your pants and try to make a large ball of fabric.This scrunched method makes a random splatter effect on your pants.",
    "Fold your pants accordion style for a spiral design.",
    "Start at the bottom of 1 leg of your pants and fold it up in a 0.5 in (1.3 cm) horizontal section.",
    "Turn that fold over on itself to make a second fold.",
    "Continue this all the way up both legs of your pants, and then fold the waistband the same way.This folding method creates more of a classic spiral tie dye pattern.",
    "Put rubber bands around the middle of your pants for a bullseye.",
    "Pinch the middle of your pants upwards and wrap a rubber band around them so that they stick up in place.",
    "Keep pinching and attaching rubber bands about 2 inches (5.1 cm) apart until you can’t grab any more fabric.This creates a bullseye design that will stem out from the center of your rubber bands.",
    "Attach rubber bands in random places to hold your design in place.",
    "Grab 5 to 6 large rubber bands and place them around your pants to hold your folds together.",
    "Make sure your pants stay tight in their design and won’t come loose as you apply your dye.Tip: You can also put the rubber bands on as you scrunch or fold your pants if it’s easier.",
    "Applying the Dye Put on rubber gloves and lay down plastic to protect your surface.",
    "Grab some rubber kitchen gloves or latex gloves to keep your hands protected as you use your dye.",
    "Then, place a large plastic tarp or some large plastic bags down to keep the dye contained, even if you are working outside.",
    "You can buy gloves at most home goods stores.",
    "Mix up your dye in individual squirt bottles.",
    "Open up your tie dye and follow the instructions on the package.",
    "Mix each color in individual plastic bottles with squirt bottle tops so that you can pour them out easily.You can use as many or as little colors of dye that you would like to!",
    "Classic tie dye usually involves red, green, yellow, purple, or blue, but you can also find pastel tie dye colors.",
    "You can purchase tie dye at most craft stores.",
    "Squirt dye over your pants in a random pattern for an irregular design.",
    "Take your bottles of dye one at a time and squirt each color onto your pants.",
    "Overlap your colors for a design that makes a random pattern.Tip: Make sure you turn your pants over to get dye on both sides.",
    "Try using red, purple, and blue for a cute color combination.",
    "Add yellow and orange dye for bright, vibrant pants.",
    "Add dye in blocks or lines for a sequential pattern.",
    "Use each dye color in blocks or lines that are about 2 inches (5.1 cm) wide.",
    "You can do your colors in an alternating pattern for a cohesive look overall.Try using red, green, and yellow for a classic looking tie dye.",
    "Rinsing Your Pants and Letting Them Dry Place your pants in a plastic bag and let them sit for 6 hours.",
    "Don’t disturb your pants so that they have time to soak in all the dye.",
    "The longer you leave your pants, the more vibrant the colors will be.",
    "Leave them on a porch or back patio so they won’t be moved around.",
    "You can let your pants sit for as long as 24 hours if you’d like to.",
    "Rinse out your pants with cold water.",
    "Take your pants out of the plastic bag and run cold water over them in the sink.",
    "Keep rinsing your pants until the water runs clear so that the dye doesn’t get on any of your other clothes.Cold water will leave your dye intact and won’t make the colors run together.",
    "Let your pants air dry before you wear them.",
    "Hang your pants out to dry in the sun until they aren’t damp anymore, or put them in the dryer to dry them faster.",
    "Enjoy showing off your DIY tie dyed pants!Tip: If your pants get dirty, wash them on their own in cold water to make sure the dye doesn’t get on any of your other clothes."
  ],
  "tyn_section":[
    "White cotton pants",
    "Rubber bands",
    "Tie dye",
    "Plastic squirt bottles",
    "Plastic bags or a plastic tarp",
    "Gloves",
    "Plastic bag"
  ],
  "tyn_model":[
    "tie dye",
    "dye",
    "rubber bands",
    "water",
    "yoga pants",
    "fabric",
    "rubber band",
    "rubber gloves",
    "latex gloves",
    "bottles",
    "plastic bag"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.2727272727,
    "f1":0.3333333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.5454545455,
    "f1":0.5581395349
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.7272727273,
    "f1":0.7207207207
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.2727272727,
    "f1":0.3333333333
  }
}