{
  "title":"How to Sew Elastic Straps",
  "url":"https://www.wikihow.com/Sew-Elastic-Straps",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing"
  ],
  "parts":[
    {
      "name":"Cutting the Fabric and Elastic",
      "steps":[
        {
          "headline":"Use a measuring tape to find how long to make the straps.",
          "description":"Put on the garment and ask a friend to measure across your shoulder from the front hemline to the back. This gives you the measurement for 1 strap. Then, add about 1 inch (2.5 cm) to your measurement so you can add a ⁄2 inch (1.3 cm) seam allowance to each end of the strap. If you're following a sewing pattern, follow it's measurement recommendations for the strap sizes. If you have a garment that has straps, you could measure these instead."
        },
        {
          "headline":"Cut a ⁄4 in (1.9 cm) wide strip of rubber elastic so it's twice as long as the length of 1 strap.",
          "description":"Multiply the strap measurement since you'll be making 1 long elastic strap before cutting it in half. Take a piece of ⁄4 inch (1.9 cm) wide rubber elastic and cut it so it's as long as your new measurement.Tip: Rubber elastic won't wear out if you expose it to saltwater or chlorine, which is why it's perfect for swimsuit straps. If you're not sewing the straps to swimwear, use rubber, knitted, or woven elastic. For example, if you're making a strap that's 15 inches (38 cm) long, multiply this by 2 and cut a strip of rubber elastic so it's 30 inches (76 cm) long."
        },
        {
          "headline":"Cut a piece of fabric that's as long as your measurement and 3 times as wide as the elastic.",
          "description":"Choose a stretchy fabric that matches your swimsuit or garment and use scissors or a rotary cutter to cut out a piece of fabric that's as long as your elastic. Then, cut the piece so it's 3 times as wide as the elastic.This creates a long rectangular piece of fabric that you'll sew the elastic to. Keep in mind that you'll cut the elastic strap piece in half to make 2 straps for your swimsuit or garment."
        },
        {
          "headline":"Lay the elastic along 1 side of the fabric.",
          "description":"Place the fabric with the wrong side facing up so the patterned side is down. Then, put the elastic strip on the long side of the fabric so the ends are lined up and the elastic runs down 1 side of the fabric.Ensure that the elastic strip doesn't stick over the side of the fabric. There's no right or wrong side to the elastic strip."
        }
      ]
    },
    {
      "name":"Stitching the Straps",
      "steps":[
        {
          "headline":"Zigzag stitch the strip of elastic to the fabric.",
          "description":"Take the fabric with the elastic to your sewing machine and set the machine to the zigzag stitch. Do 1 or 2 zigzag stitches before making a few backstitches. This prevents the thread from unraveling. Then, zigzag stitch down the center of the elastic to secure it to the fabric.Tip: If you have a serger, use that instead of a standard sewing machine to create sturdier stitches that look more professional. Use polyester thread if you'll be attaching the straps to a swimsuit since polyester holds up better than cotton thread. Avoid stretching the fabric as you stitch or it will be longer than the elastic strip."
        },
        {
          "headline":"Fold the elastic edge over twice to encase it in the fabric.",
          "description":"Lift your sewing machine foot up and remove your fabric piece. Hold the elastic edge and tightly fold it over towards the center of the fabric. Then, fold it over 1 more time so the elastic is surrounded by fabric.Feel the elastic strip and smooth it out if it's twisted at any point."
        },
        {
          "headline":"Straight stitch along the edge of the strap to create a top stitch.",
          "description":"Adjust your sewing machine to make straight stitches and sew straight down the folded edge of the strap. Keep your stitches ⁄8 inch (0.32 cm) from the edge.For extra-secure straps, use a double-needle to give an extra row of stitches. This reinforces the seam and looks decorative."
        },
        {
          "headline":"Trim the excess fabric from the edges of the strap.",
          "description":"Flip the strap over so you can see your stitches. Take a sharp pair of scissors and carefully cut the excess fabric off of the edge of the strap.Avoid cutting into the stitches or your strap will unravel."
        }
      ]
    },
    {
      "name":"Attaching the Straps to a Garment",
      "steps":[
        {
          "headline":"Cut the strip into 2 straps that are equal lengths.",
          "description":"Now that you have a long elastic strap, lay a measuring tape or yardstick along the strap. Find the center of the strap and cut it in half. This makes 2 equal-sized straps that you can sew onto a swimsuit, leotard, or garment.There's no need to finish the raw edges since the stretchy fabric doesn't fray and you'll be sewing the straps to the inside of your garment."
        },
        {
          "headline":"Pin 1 strap end to the back of the garment along the top hemline.",
          "description":"Insert a sewing pin through the end of a strap and secure it to the back hemline of your garment where you want the strap to fall. Repeat this for the other shoulder strap, but don't pin the front of the straps in place yet.Position the strap so the right side of the fabric with the pattern is facing out."
        },
        {
          "headline":"Put on the garment and pin the front of the straps to the hemline.",
          "description":"To get an accurate fit, put on the swimsuit or top so it's inside out. Bring each of the straps that you pinned to the back over your shoulders. Then, pull the front end down until the strap is snug and pin it in place.Tip: If you're struggling to pin the straps in place, ask a friend to help you. Stand straight and have your friend adjust the straps until they feel comfortable. Repeat this for the other strap."
        },
        {
          "headline":"Remove the garment and zigzag stitch the straps to the hemline.",
          "description":"Take the inside-out garment to your sewing machine and remove the pin from 1 strap end. Make a zigzag stitch on the hemline and do a few backstitches about ⁄2 inch (1.3 cm) in front of the strap. Then, keep sewing across the strap and ⁄2 inch (1.3 cm) beyond the strap. Remember to take out the pins so you don't damage your machine by sewing over them."
        },
        {
          "headline":"Backstitch to hold the strap in place and sew the other ends to your garment.",
          "description":"Once you've made zigzag stitches across the strap, do 2 or 3 backstitches. This prevents the thread from unraveling. Then, trim the thread and sew the other end of the strap to the opposite side of your garment.If you have excess fabric at the end of the straps, trim it off without cutting into the stitches."
        }
      ]
    }
  ],
  "text":" Cutting the Fabric and Elastic Use a measuring tape to find how long to make the straps. Put on the garment and ask a friend to measure across your shoulder from the front hemline to the back. This gives you the measurement for 1 strap. Then, add about 1 inch (2.5 cm) to your measurement so you can add a ⁄2 inch (1.3 cm) seam allowance to each end of the strap. If you're following a sewing pattern, follow it's measurement recommendations for the strap sizes. If you have a garment that has straps, you could measure these instead. Cut a ⁄4 in (1.9 cm) wide strip of rubber elastic so it's twice as long as the length of 1 strap. Multiply the strap measurement since you'll be making 1 long elastic strap before cutting it in half. Take a piece of ⁄4 inch (1.9 cm) wide rubber elastic and cut it so it's as long as your new measurement.Tip: Rubber elastic won't wear out if you expose it to saltwater or chlorine, which is why it's perfect for swimsuit straps. If you're not sewing the straps to swimwear, use rubber, knitted, or woven elastic. For example, if you're making a strap that's 15 inches (38 cm) long, multiply this by 2 and cut a strip of rubber elastic so it's 30 inches (76 cm) long. Cut a piece of fabric that's as long as your measurement and 3 times as wide as the elastic. Choose a stretchy fabric that matches your swimsuit or garment and use scissors or a rotary cutter to cut out a piece of fabric that's as long as your elastic. Then, cut the piece so it's 3 times as wide as the elastic.This creates a long rectangular piece of fabric that you'll sew the elastic to. Keep in mind that you'll cut the elastic strap piece in half to make 2 straps for your swimsuit or garment. Lay the elastic along 1 side of the fabric. Place the fabric with the wrong side facing up so the patterned side is down. Then, put the elastic strip on the long side of the fabric so the ends are lined up and the elastic runs down 1 side of the fabric.Ensure that the elastic strip doesn't stick over the side of the fabric. There's no right or wrong side to the elastic strip. Stitching the Straps Zigzag stitch the strip of elastic to the fabric. Take the fabric with the elastic to your sewing machine and set the machine to the zigzag stitch. Do 1 or 2 zigzag stitches before making a few backstitches. This prevents the thread from unraveling. Then, zigzag stitch down the center of the elastic to secure it to the fabric.Tip: If you have a serger, use that instead of a standard sewing machine to create sturdier stitches that look more professional. Use polyester thread if you'll be attaching the straps to a swimsuit since polyester holds up better than cotton thread. Avoid stretching the fabric as you stitch or it will be longer than the elastic strip. Fold the elastic edge over twice to encase it in the fabric. Lift your sewing machine foot up and remove your fabric piece. Hold the elastic edge and tightly fold it over towards the center of the fabric. Then, fold it over 1 more time so the elastic is surrounded by fabric.Feel the elastic strip and smooth it out if it's twisted at any point. Straight stitch along the edge of the strap to create a top stitch. Adjust your sewing machine to make straight stitches and sew straight down the folded edge of the strap. Keep your stitches ⁄8 inch (0.32 cm) from the edge.For extra-secure straps, use a double-needle to give an extra row of stitches. This reinforces the seam and looks decorative. Trim the excess fabric from the edges of the strap. Flip the strap over so you can see your stitches. Take a sharp pair of scissors and carefully cut the excess fabric off of the edge of the strap.Avoid cutting into the stitches or your strap will unravel. Attaching the Straps to a Garment Cut the strip into 2 straps that are equal lengths. Now that you have a long elastic strap, lay a measuring tape or yardstick along the strap. Find the center of the strap and cut it in half. This makes 2 equal-sized straps that you can sew onto a swimsuit, leotard, or garment.There's no need to finish the raw edges since the stretchy fabric doesn't fray and you'll be sewing the straps to the inside of your garment. Pin 1 strap end to the back of the garment along the top hemline. Insert a sewing pin through the end of a strap and secure it to the back hemline of your garment where you want the strap to fall. Repeat this for the other shoulder strap, but don't pin the front of the straps in place yet.Position the strap so the right side of the fabric with the pattern is facing out. Put on the garment and pin the front of the straps to the hemline. To get an accurate fit, put on the swimsuit or top so it's inside out. Bring each of the straps that you pinned to the back over your shoulders. Then, pull the front end down until the strap is snug and pin it in place.Tip: If you're struggling to pin the straps in place, ask a friend to help you. Stand straight and have your friend adjust the straps until they feel comfortable. Repeat this for the other strap. Remove the garment and zigzag stitch the straps to the hemline. Take the inside-out garment to your sewing machine and remove the pin from 1 strap end. Make a zigzag stitch on the hemline and do a few backstitches about ⁄2 inch (1.3 cm) in front of the strap. Then, keep sewing across the strap and ⁄2 inch (1.3 cm) beyond the strap. Remember to take out the pins so you don't damage your machine by sewing over them. Backstitch to hold the strap in place and sew the other ends to your garment. Once you've made zigzag stitches across the strap, do 2 or 3 backstitches. This prevents the thread from unraveling. Then, trim the thread and sew the other end of the strap to the opposite side of your garment.If you have excess fabric at the end of the straps, trim it off without cutting into the stitches.",
  "sentences":[
    " Cutting the Fabric and Elastic Use a measuring tape to find how long to make the straps.",
    "Put on the garment and ask a friend to measure across your shoulder from the front hemline to the back.",
    "This gives you the measurement for 1 strap.",
    "Then, add about 1 inch (2.5 cm) to your measurement so you can add a ⁄2 inch (1.3 cm) seam allowance to each end of the strap.",
    "If you're following a sewing pattern, follow it's measurement recommendations for the strap sizes.",
    "If you have a garment that has straps, you could measure these instead.",
    "Cut a ⁄4 in (1.9 cm) wide strip of rubber elastic so it's twice as long as the length of 1 strap.",
    "Multiply the strap measurement since you'll be making 1 long elastic strap before cutting it in half.",
    "Take a piece of ⁄4 inch (1.9 cm) wide rubber elastic and cut it so it's as long as your new measurement.Tip: Rubber elastic won't wear out if you expose it to saltwater or chlorine, which is why it's perfect for swimsuit straps.",
    "If you're not sewing the straps to swimwear, use rubber, knitted, or woven elastic.",
    "For example, if you're making a strap that's 15 inches (38 cm) long, multiply this by 2 and cut a strip of rubber elastic so it's 30 inches (76 cm) long.",
    "Cut a piece of fabric that's as long as your measurement and 3 times as wide as the elastic.",
    "Choose a stretchy fabric that matches your swimsuit or garment and use scissors or a rotary cutter to cut out a piece of fabric that's as long as your elastic.",
    "Then, cut the piece so it's 3 times as wide as the elastic.This creates a long rectangular piece of fabric that you'll sew the elastic to.",
    "Keep in mind that you'll cut the elastic strap piece in half to make 2 straps for your swimsuit or garment.",
    "Lay the elastic along 1 side of the fabric.",
    "Place the fabric with the wrong side facing up so the patterned side is down.",
    "Then, put the elastic strip on the long side of the fabric so the ends are lined up and the elastic runs down 1 side of the fabric.Ensure that the elastic strip doesn't stick over the side of the fabric.",
    "There's no right or wrong side to the elastic strip.",
    "Stitching the Straps Zigzag stitch the strip of elastic to the fabric.",
    "Take the fabric with the elastic to your sewing machine and set the machine to the zigzag stitch.",
    "Do 1 or 2 zigzag stitches before making a few backstitches.",
    "This prevents the thread from unraveling.",
    "Then, zigzag stitch down the center of the elastic to secure it to the fabric.Tip: If you have a serger, use that instead of a standard sewing machine to create sturdier stitches that look more professional.",
    "Use polyester thread if you'll be attaching the straps to a swimsuit since polyester holds up better than cotton thread.",
    "Avoid stretching the fabric as you stitch or it will be longer than the elastic strip.",
    "Fold the elastic edge over twice to encase it in the fabric.",
    "Lift your sewing machine foot up and remove your fabric piece.",
    "Hold the elastic edge and tightly fold it over towards the center of the fabric.",
    "Then, fold it over 1 more time so the elastic is surrounded by fabric.Feel the elastic strip and smooth it out if it's twisted at any point.",
    "Straight stitch along the edge of the strap to create a top stitch.",
    "Adjust your sewing machine to make straight stitches and sew straight down the folded edge of the strap.",
    "Keep your stitches ⁄8 inch (0.32 cm) from the edge.For extra-secure straps, use a double-needle to give an extra row of stitches.",
    "This reinforces the seam and looks decorative.",
    "Trim the excess fabric from the edges of the strap.",
    "Flip the strap over so you can see your stitches.",
    "Take a sharp pair of scissors and carefully cut the excess fabric off of the edge of the strap.Avoid cutting into the stitches or your strap will unravel.",
    "Attaching the Straps to a Garment Cut the strip into 2 straps that are equal lengths.",
    "Now that you have a long elastic strap, lay a measuring tape or yardstick along the strap.",
    "Find the center of the strap and cut it in half.",
    "This makes 2 equal-sized straps that you can sew onto a swimsuit, leotard, or garment.There's no need to finish the raw edges since the stretchy fabric doesn't fray and you'll be sewing the straps to the inside of your garment.",
    "Pin 1 strap end to the back of the garment along the top hemline.",
    "Insert a sewing pin through the end of a strap and secure it to the back hemline of your garment where you want the strap to fall.",
    "Repeat this for the other shoulder strap, but don't pin the front of the straps in place yet.Position the strap so the right side of the fabric with the pattern is facing out.",
    "Put on the garment and pin the front of the straps to the hemline.",
    "To get an accurate fit, put on the swimsuit or top so it's inside out.",
    "Bring each of the straps that you pinned to the back over your shoulders.",
    "Then, pull the front end down until the strap is snug and pin it in place.Tip: If you're struggling to pin the straps in place, ask a friend to help you.",
    "Stand straight and have your friend adjust the straps until they feel comfortable.",
    "Repeat this for the other strap.",
    "Remove the garment and zigzag stitch the straps to the hemline.",
    "Take the inside-out garment to your sewing machine and remove the pin from 1 strap end.",
    "Make a zigzag stitch on the hemline and do a few backstitches about ⁄2 inch (1.3 cm) in front of the strap.",
    "Then, keep sewing across the strap and ⁄2 inch (1.3 cm) beyond the strap.",
    "Remember to take out the pins so you don't damage your machine by sewing over them.",
    "Backstitch to hold the strap in place and sew the other ends to your garment.",
    "Once you've made zigzag stitches across the strap, do 2 or 3 backstitches.",
    "This prevents the thread from unraveling.",
    "Then, trim the thread and sew the other end of the strap to the opposite side of your garment.If you have excess fabric at the end of the straps, trim it off without cutting into the stitches."
  ],
  "tyn_section":[
    "Rubber elastic",
    "Sewing machine",
    "Thread",
    "Scissors",
    "Garment",
    "Sewing pins",
    "Rotary cutter and mat, optional"
  ],
  "tyn_model":[
    "fabric",
    "elastic",
    "rubber elastic",
    "sewing machine",
    "elastic strip",
    "garment",
    "measuring tape",
    "scissors",
    "thread",
    "elastic strap",
    "chlorine",
    "rotary cutter",
    "serger",
    "polyester thread",
    "cotton thread",
    "sewing pin",
    "swimsuit",
    "pin",
    "pins",
    "machine"
  ],
  "simple_metrics":{
    "r":0.7142857143,
    "p":0.25,
    "f1":0.3703703704,
    "avg_pos":0.1
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.5,
    "f1":0.6315789474
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.7,
    "f1":0.8235294118
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.25,
    "f1":0.3703703704
  }
}