{
  "title":"How to Reuse Baby Food Pouches",
  "url":"https://www.wikihow.com/Reuse-Baby-Food-Pouches",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Cleaning the Baby Food Pouches",
      "steps":[
        {
          "headline":"Remove the cap or open the top of your reusable food pouch.",
          "description":"Twist the cap counter-clockwise to pull it off the pouch spout, then set it aside. If the pouch is designed like a Zip-loc bag, open the seal along the top edge of the pouch.Depending on the type of baby food pouch you have, this spout may be on the top of side.Warning: Some disposable pouches aren’t designed to be used more than once. To be safe, use reusable pouches when preparing food for your little one."
        },
        {
          "headline":"Pour hot water into the open pouch.",
          "description":"Turn on your tap so it’s hot, but not scalding. Fill up the pouch completely so you begin to loosen any leftover food.It’s easiest to clean your pouch over the sink."
        },
        {
          "headline":"Shake the pouch and dump out the dirty water.",
          "description":"Close the seal on the top of the bag and secure the cap back onto the pouch. Once it’s closed, hold the pouch in 1 hand and give it a good shake, which helps to loosen any food particles that are stuck inside.Be sure to do this over the sink so no water spills out."
        },
        {
          "headline":"Clean your pouch with sudsy water and a bottle brush.",
          "description":"Fill your sink with warm water, then pour in a pea-sized amount of dish soap. Wait for suds to form, and wet your pouch in the water. Use 2 bottle brushes, 1 large and 1 skinny, to work away any leftover food residue from inside the bag and spout.You can purchase bottle brushes online, or in any store that sells cleaning supplies. Use a clean toothbrush if you don’t have any bottle brushes on hand. The large bottle brush needs to be able to fit in the top of your reusable pouch."
        },
        {
          "headline":"Rinse out the pouch with warm water.",
          "description":"Turn on your tap to a warm setting and clean out any leftover suds. If your pouch has a thin opening or spout at the top, use a funnel to pour in some clean water."
        },
        {
          "headline":"Leave the pouch on a drying rack so it can air-dry.",
          "description":"Once the pouch has no more suds, flip it upside-down and move it to the dish rack. Make sure the pouch stays upright so it can dry completely.You can also balance the pouch along the thin end of a spoon or knife to help it dry out.Did you know? Some reusable food pouches are dishwasher-safe! Arrange them on the top rock of the washer, then set it to a normal cycle."
        }
      ]
    },
    {
      "name":"Refilling and Storing the Pouches Properly",
      "steps":[
        {
          "headline":"Pour puréed food into the top opening of the pouch.",
          "description":"Prepare the baby food of your choice, making sure that it has a mushy, blended consistency. Open the top section of the pouch and pour the food inside.If your pouch has a spout or thin opening, try using a funnel instead."
        },
        {
          "headline":"Reuse the cap from disposable food pouches to be economical.",
          "description":"Twist off the cap from a disposable pouch and see if it will fit on your reusable pouch. If it fits correctly, continue using the cap with your reusable container in the future! This can come in handy if you’ve lost the original cap, or if the original cap is really small.Some caps on disposable pouches are larger and more colorful, which makes them easier to keep track of."
        },
        {
          "headline":"Keep your pouch in the refrigerator for up to 2 days.",
          "description":"Use a label or piece of tape to write the current date on your pouch. Give the pouch to your child within 48 hours so the food can be as fresh as possible."
        },
        {
          "headline":"Store the reusable pouch in the freezer for up to 1 month.",
          "description":"Check the label on your disposable or reusable food pouch to see if the pouch can be frozen. If it’s freezer-safe, use a label or piece of tape to mark down the current date. Do your best to use the baby food within that time frame."
        },
        {
          "headline":"Thaw the pouches in a bowl of warm water.",
          "description":"Fill a large bowl with water that’s warm to the touch but not boiling. Soak your frozen pouch in the water, then wait 5-10 minutes for the food to warm up. Before feeding anything to your child, squeeze a small amount of the food on your finger to ensure that it isn’t too hot."
        }
      ]
    }
  ],
  "text":" Cleaning the Baby Food Pouches Remove the cap or open the top of your reusable food pouch. Twist the cap counter-clockwise to pull it off the pouch spout, then set it aside. If the pouch is designed like a Zip-loc bag, open the seal along the top edge of the pouch.Depending on the type of baby food pouch you have, this spout may be on the top of side.Warning: Some disposable pouches aren’t designed to be used more than once. To be safe, use reusable pouches when preparing food for your little one. Pour hot water into the open pouch. Turn on your tap so it’s hot, but not scalding. Fill up the pouch completely so you begin to loosen any leftover food.It’s easiest to clean your pouch over the sink. Shake the pouch and dump out the dirty water. Close the seal on the top of the bag and secure the cap back onto the pouch. Once it’s closed, hold the pouch in 1 hand and give it a good shake, which helps to loosen any food particles that are stuck inside.Be sure to do this over the sink so no water spills out. Clean your pouch with sudsy water and a bottle brush. Fill your sink with warm water, then pour in a pea-sized amount of dish soap. Wait for suds to form, and wet your pouch in the water. Use 2 bottle brushes, 1 large and 1 skinny, to work away any leftover food residue from inside the bag and spout.You can purchase bottle brushes online, or in any store that sells cleaning supplies. Use a clean toothbrush if you don’t have any bottle brushes on hand. The large bottle brush needs to be able to fit in the top of your reusable pouch. Rinse out the pouch with warm water. Turn on your tap to a warm setting and clean out any leftover suds. If your pouch has a thin opening or spout at the top, use a funnel to pour in some clean water. Leave the pouch on a drying rack so it can air-dry. Once the pouch has no more suds, flip it upside-down and move it to the dish rack. Make sure the pouch stays upright so it can dry completely.You can also balance the pouch along the thin end of a spoon or knife to help it dry out.Did you know? Some reusable food pouches are dishwasher-safe! Arrange them on the top rock of the washer, then set it to a normal cycle. Refilling and Storing the Pouches Properly Pour puréed food into the top opening of the pouch. Prepare the baby food of your choice, making sure that it has a mushy, blended consistency. Open the top section of the pouch and pour the food inside.If your pouch has a spout or thin opening, try using a funnel instead. Reuse the cap from disposable food pouches to be economical. Twist off the cap from a disposable pouch and see if it will fit on your reusable pouch. If it fits correctly, continue using the cap with your reusable container in the future! This can come in handy if you’ve lost the original cap, or if the original cap is really small.Some caps on disposable pouches are larger and more colorful, which makes them easier to keep track of. Keep your pouch in the refrigerator for up to 2 days. Use a label or piece of tape to write the current date on your pouch. Give the pouch to your child within 48 hours so the food can be as fresh as possible. Store the reusable pouch in the freezer for up to 1 month. Check the label on your disposable or reusable food pouch to see if the pouch can be frozen. If it’s freezer-safe, use a label or piece of tape to mark down the current date. Do your best to use the baby food within that time frame. Thaw the pouches in a bowl of warm water. Fill a large bowl with water that’s warm to the touch but not boiling. Soak your frozen pouch in the water, then wait 5-10 minutes for the food to warm up. Before feeding anything to your child, squeeze a small amount of the food on your finger to ensure that it isn’t too hot.",
  "sentences":[
    " Cleaning the Baby Food Pouches Remove the cap or open the top of your reusable food pouch.",
    "Twist the cap counter-clockwise to pull it off the pouch spout, then set it aside.",
    "If the pouch is designed like a Zip-loc bag, open the seal along the top edge of the pouch.Depending on the type of baby food pouch you have, this spout may be on the top of side.Warning: Some disposable pouches aren’t designed to be used more than once.",
    "To be safe, use reusable pouches when preparing food for your little one.",
    "Pour hot water into the open pouch.",
    "Turn on your tap so it’s hot, but not scalding.",
    "Fill up the pouch completely so you begin to loosen any leftover food.It’s easiest to clean your pouch over the sink.",
    "Shake the pouch and dump out the dirty water.",
    "Close the seal on the top of the bag and secure the cap back onto the pouch.",
    "Once it’s closed, hold the pouch in 1 hand and give it a good shake, which helps to loosen any food particles that are stuck inside.Be sure to do this over the sink so no water spills out.",
    "Clean your pouch with sudsy water and a bottle brush.",
    "Fill your sink with warm water, then pour in a pea-sized amount of dish soap.",
    "Wait for suds to form, and wet your pouch in the water.",
    "Use 2 bottle brushes, 1 large and 1 skinny, to work away any leftover food residue from inside the bag and spout.You can purchase bottle brushes online, or in any store that sells cleaning supplies.",
    "Use a clean toothbrush if you don’t have any bottle brushes on hand.",
    "The large bottle brush needs to be able to fit in the top of your reusable pouch.",
    "Rinse out the pouch with warm water.",
    "Turn on your tap to a warm setting and clean out any leftover suds.",
    "If your pouch has a thin opening or spout at the top, use a funnel to pour in some clean water.",
    "Leave the pouch on a drying rack so it can air-dry.",
    "Once the pouch has no more suds, flip it upside-down and move it to the dish rack.",
    "Make sure the pouch stays upright so it can dry completely.You can also balance the pouch along the thin end of a spoon or knife to help it dry out.Did you know?",
    "Some reusable food pouches are dishwasher-safe!",
    "Arrange them on the top rock of the washer, then set it to a normal cycle.",
    "Refilling and Storing the Pouches Properly Pour puréed food into the top opening of the pouch.",
    "Prepare the baby food of your choice, making sure that it has a mushy, blended consistency.",
    "Open the top section of the pouch and pour the food inside.If your pouch has a spout or thin opening, try using a funnel instead.",
    "Reuse the cap from disposable food pouches to be economical.",
    "Twist off the cap from a disposable pouch and see if it will fit on your reusable pouch.",
    "If it fits correctly, continue using the cap with your reusable container in the future!",
    "This can come in handy if you’ve lost the original cap, or if the original cap is really small.Some caps on disposable pouches are larger and more colorful, which makes them easier to keep track of.",
    "Keep your pouch in the refrigerator for up to 2 days.",
    "Use a label or piece of tape to write the current date on your pouch.",
    "Give the pouch to your child within 48 hours so the food can be as fresh as possible.",
    "Store the reusable pouch in the freezer for up to 1 month.",
    "Check the label on your disposable or reusable food pouch to see if the pouch can be frozen.",
    "If it’s freezer-safe, use a label or piece of tape to mark down the current date.",
    "Do your best to use the baby food within that time frame.",
    "Thaw the pouches in a bowl of warm water.",
    "Fill a large bowl with water that’s warm to the touch but not boiling.",
    "Soak your frozen pouch in the water, then wait 5-10 minutes for the food to warm up.",
    "Before feeding anything to your child, squeeze a small amount of the food on your finger to ensure that it isn’t too hot."
  ],
  "tyn_section":[
    "Water",
    "Dish soap",
    "Bottle brush",
    "Drying rack",
    "Disposable pouch cap"
  ],
  "tyn_model":[
    "water",
    "bottle brushes",
    "tap",
    "bottle brush",
    "funnel",
    "reusable pouch",
    "baby food pouches",
    "reusable food",
    "zip-loc bag",
    "baby food pouch",
    "dish soap",
    "dish rack",
    "spoon",
    "knife",
    "reusable food pouches",
    "washer",
    "baby food",
    "reusable container",
    "refrigerator",
    "freezer",
    "disposable or reusable food pouch",
    "bowl"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.1363636364,
    "f1":0.2222222222,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.1363636364,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2727272727,
    "f1":0.4285714286
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.1363636364,
    "f1":0.2222222222
  }
}