{
  "title":"How to Charge a Home Air Conditioner",
  "url":"https://www.wikihow.com/Charge-a-Home-Air-Conditioner",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Cooling Systems"
  ],
  "methods":[
    {
      "name":"Understand the Laws Regarding Working on an Air Conditioner",
      "steps":[
        {
          "headline":"Know what it is legal for an unlicensed homeowner to do to their own equipment.",
          "description":"There is no national or federal law regulating what a private citizen can do with their own air conditioner. There are, however, laws requiring professional certification by the U.S. Environmental Protection Administration and state and local regulations regarding licenses and professional standards for persons doing this work."
        },
        {
          "headline":"Understand that a refrigeration supply company will not sell refrigerants or other regulated supplies to unlicensed individuals.",
          "description":"You may find a source online, at sites like Craigslist and eBay, but the actual purchase may still be illegal."
        },
        {
          "headline":"Do not work on other individuals' air conditioning units for pay if you are unlicensed, you may be fined or face other legal actions for doing so.",
          "description":""
        }
      ]
    },
    {
      "name":"Check the System",
      "steps":[
        {
          "headline":"Perform routine maintenance first.",
          "description":"Before you recharge your AC, it is very important that you perform standard maintenance on it. Replace the air filter\nClean the evaporator and condenser coils—if any of the above are dirty, it can cause symptoms similar to a unit that is low on refrigerant. If refrigerant is added under these conditions, the unit may be damaged."
        },
        {
          "headline":"Check for any obstructions, including buildup of debris on the air handler blower fan and make sure the condenser fan is operating correctly.",
          "description":"These must move sufficient air through their respective coils to effectively handle the heat produced (removed from your home's interior) by the air conditioner's operation."
        },
        {
          "headline":"Conduct a thorough inspection of the rest of the components of your system.",
          "description":"Missing insulation, leaking duct-work joints, poor electrical connections, and other minor problems won't change the refrigerant requirements of your air conditioning system, but they can reduce the efficiency of the system."
        }
      ]
    },
    {
      "name":"Determine What You Need",
      "steps":[
        {
          "headline":"Determine the type of refrigerant you need for the AC system.",
          "description":"This can be done by consulting the equipment's operating guide, often found inside the electrical control box or the air handler unit. Many systems also have a label on the unit's cabinet that will have the manufacturer's specifications. Refrigerants commonly used in fairly modern systems are R-22 (HCFC-22)and R410A, sold under names like SUVA410A and Puron. This is important in order to make sure you get the right type of refrigerant and the correct charging manifold set for charging."
        },
        {
          "headline":"Determine what type of charging connections your system is equipped with.",
          "description":"Normal inverted flare schrader valve connections can be equipped with quick connect adaptors to lessen the loss of refrigerant during the connecting process, and they will decrease the chance of injury from liquid refrigerant contacting your skin in the process. Which ever connection you use, understand that even with a system switched off, the refrigerant is under high pressure, and it is dangerous."
        },
        {
          "headline":"Turn your air conditioner off at the thermostat.",
          "description":"The thermostat and its related circuitry are the on/off switch for your system. You will be turning off the power to the unit itself in the next step, but you want to start and stop the unit using the thermostat, not the disconnect, as this is not what the disconnect is designed for."
        },
        {
          "headline":"Turn the power off on your air conditioning system.",
          "description":"The outside unit should be equipped with a fused disconnect or circuit breaker located near the unit. Remove the fuses or turn the breaker off before continuing. With the AC unit off, hook up the gauges according to instructions. This will be with the low pressure side (the small hose/blue hose) on the gauges and the high pressure side of the system (the red hose). Older manifold gauges may not have color coded hoses, usually, the low pressure gauge and connector is on the left facing the gauge, the high pressure is on the right, and the supply hose, which is connected to your refrigerant tank, evacuation pump, or other attachment, is in the middle. With the gauges hooked up, turn on the AC and wait 15 minutes for the system to stabilize."
        },
        {
          "headline":"Take a reading on the gauges.",
          "description":"The blue gauge should have dropped if the system needs to be recharged. To verify this, use a temperature gauge with a probe attached to the low pressure side - or return line—which is the larger of the two lines. Recharge if the temperatures on the blue gauge do not correspond to the number recommended in the equipment manufacturer's specifications. Use the site glass. Another way to determine if your system needs recharging is using the site glass on the unit. Many residential units are not equipped with site glasses, but if your unit has one, it will be on the outside of the unit on the return line between the inline dryer and the compressor. Once you have located the sight glass and cleaned the view port, look into it while the unit is running. See if there are bubbles mixed with the liquid refrigerant. A properly charged AC unit will be free of bubbles. You need to recharge the unit if there are bubbles mixed with the liquid coolant. Note that on a unit that has been improperly charged, bubbles may result from air or moisture trapped in the hermetically sealed refrigerant system."
        }
      ]
    },
    {
      "name":"Recharge Your AC",
      "steps":[
        {
          "headline":"Take the following steps.",
          "description":"To recharge the refrigerant in your air conditioner, first shut down your AC unit, then follow the steps below:"
        },
        {
          "headline":"Attach the hoses from the gauge manifold to your system's pressure ports.",
          "description":"The low pressure hose is normally blue and is connected to the suction line—the larger of the two pipes. The high pressure hose is generally red and is connected to the liquid line, which is the smaller of the two pipes."
        },
        {
          "headline":"Turn on the AC.",
          "description":"Let it to run for at least 15 minutes so that the system can reach steady state operation."
        },
        {
          "headline":"Check the temperatures.",
          "description":"This will give you a comparative analysis of how the system is performing, with the following measurements:\nThe outdoor air temperature\nThe return air temperature at the furnace/air handler\nThe suction line temperature\nThe liquid line temperature\nNewer units will usually have a label inside the electrical cover with specific instructions for your unit. It will typically tell you to measure superheat or sub-cooling. It will also give you a chart that has values for superheat or sub-cooling for a given outdoor temperature."
        },
        {
          "headline":"Determine your metering device.",
          "description":"Check the charging procedure chart in your unit to determine what type of metering device your system uses. It will either be a thermostatic expansion valve or a restrictor orifice. If your system uses a thermostatic expansion valve (TXV), use the following values:\nSystem superheat: 18°F (-7°C)\nSystem sub-cooling: 25°F (-4°C)\n\nIf your system uses a restrictor, you can use the table below as a guide. It contains recommended superheat values for given indoor and outdoor air temps:\nTo find the required superheat value, draw a line from the outside air temperature down to the return air temperature. The value in that row/column is the required superheat temperature."
        },
        {
          "headline":"Check for leaks.",
          "description":"If the tests show that refrigerant is required, check for evidence of leaks and repair them. Leaks can typically be found around any joints or connections:\nWelded or brazed joints\nPressure ports\nThreaded tubing connectors\nAny place where refrigerant lines may vibrate or rub against the unit chassis or other components."
        },
        {
          "headline":"Connect the charging or supply hose from your manifold to the refrigerant container with the container in an upright position.",
          "description":"Do not tip the refrigerant container, as this will introduce liquid refrigerant into the suction side of the compressor, and can result in damage to the unit."
        },
        {
          "headline":"Add refrigerant.",
          "description":"Slowly, and in small amounts, introduce refrigerant into the suction line of the system, and allow 5 to 10 minutes for the system to stabilize between addition of refrigerant. When charging a new system, or recharging an evacuated system, the refrigerant is added by weight, according to the system specifications, but trimming a unit, or adding to an existing refrigerant charge, is less precise. Check pressure and temperature readings, and determine if more refrigerant is needed. Repeat until everything looks normal."
        },
        {
          "headline":"Observe a complete cooling cycle.",
          "description":"When the AC has completed a cycle, turn off power to the unit, and remove the gauges.fh"
        }
      ]
    }
  ],
  "text":" Understand the Laws Regarding Working on an Air Conditioner Know what it is legal for an unlicensed homeowner to do to their own equipment. There is no national or federal law regulating what a private citizen can do with their own air conditioner. There are, however, laws requiring professional certification by the U.S. Environmental Protection Administration and state and local regulations regarding licenses and professional standards for persons doing this work. Understand that a refrigeration supply company will not sell refrigerants or other regulated supplies to unlicensed individuals. You may find a source online, at sites like Craigslist and eBay, but the actual purchase may still be illegal. Do not work on other individuals' air conditioning units for pay if you are unlicensed, you may be fined or face other legal actions for doing so.  Check the System Perform routine maintenance first. Before you recharge your AC, it is very important that you perform standard maintenance on it. Replace the air filter\nClean the evaporator and condenser coils—if any of the above are dirty, it can cause symptoms similar to a unit that is low on refrigerant. If refrigerant is added under these conditions, the unit may be damaged. Check for any obstructions, including buildup of debris on the air handler blower fan and make sure the condenser fan is operating correctly. These must move sufficient air through their respective coils to effectively handle the heat produced (removed from your home's interior) by the air conditioner's operation. Conduct a thorough inspection of the rest of the components of your system. Missing insulation, leaking duct-work joints, poor electrical connections, and other minor problems won't change the refrigerant requirements of your air conditioning system, but they can reduce the efficiency of the system. Determine What You Need Determine the type of refrigerant you need for the AC system. This can be done by consulting the equipment's operating guide, often found inside the electrical control box or the air handler unit. Many systems also have a label on the unit's cabinet that will have the manufacturer's specifications. Refrigerants commonly used in fairly modern systems are R-22 (HCFC-22)and R410A, sold under names like SUVA410A and Puron. This is important in order to make sure you get the right type of refrigerant and the correct charging manifold set for charging. Determine what type of charging connections your system is equipped with. Normal inverted flare schrader valve connections can be equipped with quick connect adaptors to lessen the loss of refrigerant during the connecting process, and they will decrease the chance of injury from liquid refrigerant contacting your skin in the process. Which ever connection you use, understand that even with a system switched off, the refrigerant is under high pressure, and it is dangerous. Turn your air conditioner off at the thermostat. The thermostat and its related circuitry are the on/off switch for your system. You will be turning off the power to the unit itself in the next step, but you want to start and stop the unit using the thermostat, not the disconnect, as this is not what the disconnect is designed for. Turn the power off on your air conditioning system. The outside unit should be equipped with a fused disconnect or circuit breaker located near the unit. Remove the fuses or turn the breaker off before continuing. With the AC unit off, hook up the gauges according to instructions. This will be with the low pressure side (the small hose/blue hose) on the gauges and the high pressure side of the system (the red hose). Older manifold gauges may not have color coded hoses, usually, the low pressure gauge and connector is on the left facing the gauge, the high pressure is on the right, and the supply hose, which is connected to your refrigerant tank, evacuation pump, or other attachment, is in the middle. With the gauges hooked up, turn on the AC and wait 15 minutes for the system to stabilize. Take a reading on the gauges. The blue gauge should have dropped if the system needs to be recharged. To verify this, use a temperature gauge with a probe attached to the low pressure side - or return line—which is the larger of the two lines. Recharge if the temperatures on the blue gauge do not correspond to the number recommended in the equipment manufacturer's specifications. Use the site glass. Another way to determine if your system needs recharging is using the site glass on the unit. Many residential units are not equipped with site glasses, but if your unit has one, it will be on the outside of the unit on the return line between the inline dryer and the compressor. Once you have located the sight glass and cleaned the view port, look into it while the unit is running. See if there are bubbles mixed with the liquid refrigerant. A properly charged AC unit will be free of bubbles. You need to recharge the unit if there are bubbles mixed with the liquid coolant. Note that on a unit that has been improperly charged, bubbles may result from air or moisture trapped in the hermetically sealed refrigerant system. Recharge Your AC Take the following steps. To recharge the refrigerant in your air conditioner, first shut down your AC unit, then follow the steps below: Attach the hoses from the gauge manifold to your system's pressure ports. The low pressure hose is normally blue and is connected to the suction line—the larger of the two pipes. The high pressure hose is generally red and is connected to the liquid line, which is the smaller of the two pipes. Turn on the AC. Let it to run for at least 15 minutes so that the system can reach steady state operation. Check the temperatures. This will give you a comparative analysis of how the system is performing, with the following measurements:\nThe outdoor air temperature\nThe return air temperature at the furnace/air handler\nThe suction line temperature\nThe liquid line temperature\nNewer units will usually have a label inside the electrical cover with specific instructions for your unit. It will typically tell you to measure superheat or sub-cooling. It will also give you a chart that has values for superheat or sub-cooling for a given outdoor temperature. Determine your metering device. Check the charging procedure chart in your unit to determine what type of metering device your system uses. It will either be a thermostatic expansion valve or a restrictor orifice. If your system uses a thermostatic expansion valve (TXV), use the following values:\nSystem superheat: 18°F (-7°C)\nSystem sub-cooling: 25°F (-4°C)\n\nIf your system uses a restrictor, you can use the table below as a guide. It contains recommended superheat values for given indoor and outdoor air temps:\nTo find the required superheat value, draw a line from the outside air temperature down to the return air temperature. The value in that row/column is the required superheat temperature. Check for leaks. If the tests show that refrigerant is required, check for evidence of leaks and repair them. Leaks can typically be found around any joints or connections:\nWelded or brazed joints\nPressure ports\nThreaded tubing connectors\nAny place where refrigerant lines may vibrate or rub against the unit chassis or other components. Connect the charging or supply hose from your manifold to the refrigerant container with the container in an upright position. Do not tip the refrigerant container, as this will introduce liquid refrigerant into the suction side of the compressor, and can result in damage to the unit. Add refrigerant. Slowly, and in small amounts, introduce refrigerant into the suction line of the system, and allow 5 to 10 minutes for the system to stabilize between addition of refrigerant. When charging a new system, or recharging an evacuated system, the refrigerant is added by weight, according to the system specifications, but trimming a unit, or adding to an existing refrigerant charge, is less precise. Check pressure and temperature readings, and determine if more refrigerant is needed. Repeat until everything looks normal. Observe a complete cooling cycle. When the AC has completed a cycle, turn off power to the unit, and remove the gauges.fh",
  "sentences":[
    " Understand the Laws Regarding Working on an Air Conditioner Know what it is legal for an unlicensed homeowner to do to their own equipment.",
    "There is no national or federal law regulating what a private citizen can do with their own air conditioner.",
    "There are, however, laws requiring professional certification by the U.S. Environmental Protection Administration and state and local regulations regarding licenses and professional standards for persons doing this work.",
    "Understand that a refrigeration supply company will not sell refrigerants or other regulated supplies to unlicensed individuals.",
    "You may find a source online, at sites like Craigslist and eBay, but the actual purchase may still be illegal.",
    "Do not work on other individuals' air conditioning units for pay if you are unlicensed, you may be fined or face other legal actions for doing so.",
    "Check the System Perform routine maintenance first.",
    "Before you recharge your AC, it is very important that you perform standard maintenance on it.",
    "Replace the air filter\nClean the evaporator and condenser coils—if any of the above are dirty, it can cause symptoms similar to a unit that is low on refrigerant.",
    "If refrigerant is added under these conditions, the unit may be damaged.",
    "Check for any obstructions, including buildup of debris on the air handler blower fan and make sure the condenser fan is operating correctly.",
    "These must move sufficient air through their respective coils to effectively handle the heat produced (removed from your home's interior) by the air conditioner's operation.",
    "Conduct a thorough inspection of the rest of the components of your system.",
    "Missing insulation, leaking duct-work joints, poor electrical connections, and other minor problems won't change the refrigerant requirements of your air conditioning system, but they can reduce the efficiency of the system.",
    "Determine What You Need Determine the type of refrigerant you need for the AC system.",
    "This can be done by consulting the equipment's operating guide, often found inside the electrical control box or the air handler unit.",
    "Many systems also have a label on the unit's cabinet that will have the manufacturer's specifications.",
    "Refrigerants commonly used in fairly modern systems are R-22 (HCFC-22)and R410A, sold under names like SUVA410A and Puron.",
    "This is important in order to make sure you get the right type of refrigerant and the correct charging manifold set for charging.",
    "Determine what type of charging connections your system is equipped with.",
    "Normal inverted flare schrader valve connections can be equipped with quick connect adaptors to lessen the loss of refrigerant during the connecting process, and they will decrease the chance of injury from liquid refrigerant contacting your skin in the process.",
    "Which ever connection you use, understand that even with a system switched off, the refrigerant is under high pressure, and it is dangerous.",
    "Turn your air conditioner off at the thermostat.",
    "The thermostat and its related circuitry are the on/off switch for your system.",
    "You will be turning off the power to the unit itself in the next step, but you want to start and stop the unit using the thermostat, not the disconnect, as this is not what the disconnect is designed for.",
    "Turn the power off on your air conditioning system.",
    "The outside unit should be equipped with a fused disconnect or circuit breaker located near the unit.",
    "Remove the fuses or turn the breaker off before continuing.",
    "With the AC unit off, hook up the gauges according to instructions.",
    "This will be with the low pressure side (the small hose/blue hose) on the gauges and the high pressure side of the system (the red hose).",
    "Older manifold gauges may not have color coded hoses, usually, the low pressure gauge and connector is on the left facing the gauge, the high pressure is on the right, and the supply hose, which is connected to your refrigerant tank, evacuation pump, or other attachment, is in the middle.",
    "With the gauges hooked up, turn on the AC and wait 15 minutes for the system to stabilize.",
    "Take a reading on the gauges.",
    "The blue gauge should have dropped if the system needs to be recharged.",
    "To verify this, use a temperature gauge with a probe attached to the low pressure side - or return line—which is the larger of the two lines.",
    "Recharge if the temperatures on the blue gauge do not correspond to the number recommended in the equipment manufacturer's specifications.",
    "Use the site glass.",
    "Another way to determine if your system needs recharging is using the site glass on the unit.",
    "Many residential units are not equipped with site glasses, but if your unit has one, it will be on the outside of the unit on the return line between the inline dryer and the compressor.",
    "Once you have located the sight glass and cleaned the view port, look into it while the unit is running.",
    "See if there are bubbles mixed with the liquid refrigerant.",
    "A properly charged AC unit will be free of bubbles.",
    "You need to recharge the unit if there are bubbles mixed with the liquid coolant.",
    "Note that on a unit that has been improperly charged, bubbles may result from air or moisture trapped in the hermetically sealed refrigerant system.",
    "Recharge Your AC Take the following steps.",
    "To recharge the refrigerant in your air conditioner, first shut down your AC unit, then follow the steps below: Attach the hoses from the gauge manifold to your system's pressure ports.",
    "The low pressure hose is normally blue and is connected to the suction line—the larger of the two pipes.",
    "The high pressure hose is generally red and is connected to the liquid line, which is the smaller of the two pipes.",
    "Turn on the AC.",
    "Let it to run for at least 15 minutes so that the system can reach steady state operation.",
    "Check the temperatures.",
    "This will give you a comparative analysis of how the system is performing, with the following measurements:\nThe outdoor air temperature\nThe return air temperature at the furnace/air handler\nThe suction line temperature\nThe liquid line temperature\nNewer units will usually have a label inside the electrical cover with specific instructions for your unit.",
    "It will typically tell you to measure superheat or sub-cooling.",
    "It will also give you a chart that has values for superheat or sub-cooling for a given outdoor temperature.",
    "Determine your metering device.",
    "Check the charging procedure chart in your unit to determine what type of metering device your system uses.",
    "It will either be a thermostatic expansion valve or a restrictor orifice.",
    "If your system uses a thermostatic expansion valve (TXV), use the following values:\nSystem superheat: 18°F (-7°C)\nSystem sub-cooling: 25°F (-4°C)\n\nIf your system uses a restrictor, you can use the table below as a guide.",
    "It contains recommended superheat values for given indoor and outdoor air temps:\nTo find the required superheat value, draw a line from the outside air temperature down to the return air temperature.",
    "The value in that row/column is the required superheat temperature.",
    "Check for leaks.",
    "If the tests show that refrigerant is required, check for evidence of leaks and repair them.",
    "Leaks can typically be found around any joints or connections:\nWelded or brazed joints\nPressure ports\nThreaded tubing connectors\nAny place where refrigerant lines may vibrate or rub against the unit chassis or other components.",
    "Connect the charging or supply hose from your manifold to the refrigerant container with the container in an upright position.",
    "Do not tip the refrigerant container, as this will introduce liquid refrigerant into the suction side of the compressor, and can result in damage to the unit.",
    "Add refrigerant.",
    "Slowly, and in small amounts, introduce refrigerant into the suction line of the system, and allow 5 to 10 minutes for the system to stabilize between addition of refrigerant.",
    "When charging a new system, or recharging an evacuated system, the refrigerant is added by weight, according to the system specifications, but trimming a unit, or adding to an existing refrigerant charge, is less precise.",
    "Check pressure and temperature readings, and determine if more refrigerant is needed.",
    "Repeat until everything looks normal.",
    "Observe a complete cooling cycle.",
    "When the AC has completed a cycle, turn off power to the unit, and remove the gauges.fh"
  ],
  "tyn_section":[
    "Pliers",
    "Manifold pressure gauge for the refrigerant needed",
    "Correct refrigerant",
    "Temperature gauge with probe",
    "Safety equipment to protect eyes and hands in case refrigerant is vented during the process"
  ],
  "tyn_model":[
    "refrigerant",
    "air conditioner",
    "ac",
    "air conditioning",
    "refrigerants",
    "air handler",
    "compressor",
    "hose",
    "thermostatic expansion valve",
    "refrigerant container",
    "environmental protection administration",
    "refrigeration supply",
    "air filter",
    "evaporator",
    "—if",
    "air handler blower",
    "condenser fan",
    "electrical control box",
    "puron",
    "inverted flare schrader valve",
    "refrigerant tank",
    "—which",
    "inline dryer",
    "liquid refrigerant",
    "ac unit",
    "liquid coolant",
    "hoses",
    "—the",
    "furnace",
    "suction line",
    "electrical cover",
    "metering device",
    "restrictor"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2,
    "p":0.0303030303,
    "f1":0.0526315789
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2,
    "p":0.1212121212,
    "f1":0.1509433962
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}