{
  "title":"How to Select and Store Kohlrabi",
  "url":"https://www.wikihow.com/Select-and-Store-Kohlrabi",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Selecting Kohlrabi",
      "steps":[
        {
          "headline":"Look for kohlrabi when it is in season.",
          "description":"Kohlrabi is at its peak from mid spring until mid fall."
        },
        {
          "headline":"Select a small size.",
          "description":"Look for kohlrabi bulbs that are approximately 3” in diameter, about the size of a tennis ball. The smaller bulbs are sweeter and more tender. Their taste is similar to peeled broccoli stems. Avoid larger bulbs as their taste will be sharper and more woody. They also have a thicker peel."
        },
        {
          "headline":"Choose smooth skin.",
          "description":"Look for a kohlrabi bulb that has even skin without cracks or bruises."
        },
        {
          "headline":"Pick firm green leaves.",
          "description":"If buying a whole kohlrabi, with the leaves attached, opt for leaves that are dark green in color and firm to the touch. Kohlrabi plants with the leaves attached are often more fresh than the bulbs that have had their leaves removed. Avoid yellow or wilting leaves."
        },
        {
          "headline":"Ignore the color of the bulb.",
          "description":"While it is important to pay attention to the color of the leaves, the color of the bulb is less important. Kohlrabi bulbs can be white, green, crimson or purple. Once peeled, the inside of kohlrabi is always a pale yellow."
        },
        {
          "headline":"Choose a heavy bulb.",
          "description":"The perfect kohlrabi bulb should be heavy and firm."
        }
      ]
    },
    {
      "name":"Storing Kohlrabi in the Fridge",
      "steps":[
        {
          "headline":"Remove the leaves.",
          "description":"If you’ve purchased a whole kohlrabi with the leaves and stems, remove the leaves from the bulb. The leaves are edible. The leaves are similar in flavor and can be used like kale or spinach. The leaves must be used a few days after they are removed from the bulb or else they will go bad."
        },
        {
          "headline":"Discard the stems.",
          "description":"The stems of the kohlrabi, while edible, are not typically eaten and should be removed before storage. Only the bulb and leaves should be saved and used in cooking or enjoyed raw."
        },
        {
          "headline":"Scrub the bulb.",
          "description":"Using warm water, scrub the kohlrabi bulb and remove any dirt or other residue."
        },
        {
          "headline":"Wrap the kohlrabi bulb in a plastic bag.",
          "description":"Once wrapped, you can put the kohlrabi into your fridge for later use. Bulbs that have been removed from their stems, scrubbed and wrapped in plastic can stay fresh in the fridge for up to two weeks."
        }
      ]
    },
    {
      "name":"Storing Kohlrabi in the Freezer",
      "steps":[
        {
          "headline":"Remove leaves and roots.",
          "description":"Only the bulbs of the kohlrabi should be stored in the freezer."
        },
        {
          "headline":"Wash and peel the kohlrabi bulb.",
          "description":"Like storing kohlrabi in the fridge, it is important to wash the bulb before storing it for later use. The peel of the kohlrabi bulb must be removed before the bulb can be eaten. If storing in the freezer, you must remove the peel before you freeze the bulb."
        },
        {
          "headline":"Cut the kohlrabi bulb or leave it whole.",
          "description":"Depending on your preference and intended use, you may leave your kohlrabi bulb whole or cut it into ½” cubes."
        },
        {
          "headline":"Plunge the bulb into boiling water.",
          "description":"By doing this, you stop the growth of enzymes in the kohlrabi bulb which would cause the bulb to lose color, flavor and nutrients. For whole kohlrabi bulbs, leave in the boiling water for 3 ½ minutes. For ½” cubes, leave in the boiling water for 1 ½ minutes."
        },
        {
          "headline":"Chill the bulb in ice water.",
          "description":"Remove the bulb from the boiling water and immediately place it in ice water."
        },
        {
          "headline":"Drain and package the kohlrabi for storage.",
          "description":"Remove excess liquid from your bulb or cubes. Place them into an airtight, freezer-safe bag. Freeze immediately. Kohlrabi bulbs stored in this fashion in the freezer can keep for 10-12 months."
        }
      ]
    }
  ],
  "text":" Selecting Kohlrabi Look for kohlrabi when it is in season. Kohlrabi is at its peak from mid spring until mid fall. Select a small size. Look for kohlrabi bulbs that are approximately 3” in diameter, about the size of a tennis ball. The smaller bulbs are sweeter and more tender. Their taste is similar to peeled broccoli stems. Avoid larger bulbs as their taste will be sharper and more woody. They also have a thicker peel. Choose smooth skin. Look for a kohlrabi bulb that has even skin without cracks or bruises. Pick firm green leaves. If buying a whole kohlrabi, with the leaves attached, opt for leaves that are dark green in color and firm to the touch. Kohlrabi plants with the leaves attached are often more fresh than the bulbs that have had their leaves removed. Avoid yellow or wilting leaves. Ignore the color of the bulb. While it is important to pay attention to the color of the leaves, the color of the bulb is less important. Kohlrabi bulbs can be white, green, crimson or purple. Once peeled, the inside of kohlrabi is always a pale yellow. Choose a heavy bulb. The perfect kohlrabi bulb should be heavy and firm. Storing Kohlrabi in the Fridge Remove the leaves. If you’ve purchased a whole kohlrabi with the leaves and stems, remove the leaves from the bulb. The leaves are edible. The leaves are similar in flavor and can be used like kale or spinach. The leaves must be used a few days after they are removed from the bulb or else they will go bad. Discard the stems. The stems of the kohlrabi, while edible, are not typically eaten and should be removed before storage. Only the bulb and leaves should be saved and used in cooking or enjoyed raw. Scrub the bulb. Using warm water, scrub the kohlrabi bulb and remove any dirt or other residue. Wrap the kohlrabi bulb in a plastic bag. Once wrapped, you can put the kohlrabi into your fridge for later use. Bulbs that have been removed from their stems, scrubbed and wrapped in plastic can stay fresh in the fridge for up to two weeks. Storing Kohlrabi in the Freezer Remove leaves and roots. Only the bulbs of the kohlrabi should be stored in the freezer. Wash and peel the kohlrabi bulb. Like storing kohlrabi in the fridge, it is important to wash the bulb before storing it for later use. The peel of the kohlrabi bulb must be removed before the bulb can be eaten. If storing in the freezer, you must remove the peel before you freeze the bulb. Cut the kohlrabi bulb or leave it whole. Depending on your preference and intended use, you may leave your kohlrabi bulb whole or cut it into ½” cubes. Plunge the bulb into boiling water. By doing this, you stop the growth of enzymes in the kohlrabi bulb which would cause the bulb to lose color, flavor and nutrients. For whole kohlrabi bulbs, leave in the boiling water for 3 ½ minutes. For ½” cubes, leave in the boiling water for 1 ½ minutes. Chill the bulb in ice water. Remove the bulb from the boiling water and immediately place it in ice water. Drain and package the kohlrabi for storage. Remove excess liquid from your bulb or cubes. Place them into an airtight, freezer-safe bag. Freeze immediately. Kohlrabi bulbs stored in this fashion in the freezer can keep for 10-12 months.",
  "sentences":[
    " Selecting Kohlrabi Look for kohlrabi when it is in season.",
    "Kohlrabi is at its peak from mid spring until mid fall.",
    "Select a small size.",
    "Look for kohlrabi bulbs that are approximately 3” in diameter, about the size of a tennis ball.",
    "The smaller bulbs are sweeter and more tender.",
    "Their taste is similar to peeled broccoli stems.",
    "Avoid larger bulbs as their taste will be sharper and more woody.",
    "They also have a thicker peel.",
    "Choose smooth skin.",
    "Look for a kohlrabi bulb that has even skin without cracks or bruises.",
    "Pick firm green leaves.",
    "If buying a whole kohlrabi, with the leaves attached, opt for leaves that are dark green in color and firm to the touch.",
    "Kohlrabi plants with the leaves attached are often more fresh than the bulbs that have had their leaves removed.",
    "Avoid yellow or wilting leaves.",
    "Ignore the color of the bulb.",
    "While it is important to pay attention to the color of the leaves, the color of the bulb is less important.",
    "Kohlrabi bulbs can be white, green, crimson or purple.",
    "Once peeled, the inside of kohlrabi is always a pale yellow.",
    "Choose a heavy bulb.",
    "The perfect kohlrabi bulb should be heavy and firm.",
    "Storing Kohlrabi in the Fridge Remove the leaves.",
    "If you’ve purchased a whole kohlrabi with the leaves and stems, remove the leaves from the bulb.",
    "The leaves are edible.",
    "The leaves are similar in flavor and can be used like kale or spinach.",
    "The leaves must be used a few days after they are removed from the bulb or else they will go bad.",
    "Discard the stems.",
    "The stems of the kohlrabi, while edible, are not typically eaten and should be removed before storage.",
    "Only the bulb and leaves should be saved and used in cooking or enjoyed raw.",
    "Scrub the bulb.",
    "Using warm water, scrub the kohlrabi bulb and remove any dirt or other residue.",
    "Wrap the kohlrabi bulb in a plastic bag.",
    "Once wrapped, you can put the kohlrabi into your fridge for later use.",
    "Bulbs that have been removed from their stems, scrubbed and wrapped in plastic can stay fresh in the fridge for up to two weeks.",
    "Storing Kohlrabi in the Freezer Remove leaves and roots.",
    "Only the bulbs of the kohlrabi should be stored in the freezer.",
    "Wash and peel the kohlrabi bulb.",
    "Like storing kohlrabi in the fridge, it is important to wash the bulb before storing it for later use.",
    "The peel of the kohlrabi bulb must be removed before the bulb can be eaten.",
    "If storing in the freezer, you must remove the peel before you freeze the bulb.",
    "Cut the kohlrabi bulb or leave it whole.",
    "Depending on your preference and intended use, you may leave your kohlrabi bulb whole or cut it into ½” cubes.",
    "Plunge the bulb into boiling water.",
    "By doing this, you stop the growth of enzymes in the kohlrabi bulb which would cause the bulb to lose color, flavor and nutrients.",
    "For whole kohlrabi bulbs, leave in the boiling water for 3 ½ minutes.",
    "For ½” cubes, leave in the boiling water for 1 ½ minutes.",
    "Chill the bulb in ice water.",
    "Remove the bulb from the boiling water and immediately place it in ice water.",
    "Drain and package the kohlrabi for storage.",
    "Remove excess liquid from your bulb or cubes.",
    "Place them into an airtight, freezer-safe bag.",
    "Freeze immediately.",
    "Kohlrabi bulbs stored in this fashion in the freezer can keep for 10-12 months."
  ],
  "tyn_section":[
    "Refrigerator",
    "Freezer",
    "Sink",
    "Knife",
    "Vegetable peeler",
    "Plastic bag"
  ],
  "tyn_model":[
    "kohlrabi",
    "kohlrabi bulb",
    "water",
    "kohlrabi bulbs",
    "freezer",
    "” cubes",
    "ice water",
    "” in",
    "kohlrabi plants",
    "spinach"
  ],
  "simple_metrics":{
    "r":0.1666666667,
    "p":0.1,
    "f1":0.125,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1666666667,
    "p":0.1,
    "f1":0.125
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.1666666667,
    "p":0.1,
    "f1":0.125
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1666666667,
    "p":0.1,
    "f1":0.125
  }
}