{
  "title":"How to Clean a Coil",
  "url":"https://www.wikihow.com/Clean-a-Coil",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Cooling Systems"
  ],
  "methods":[
    {
      "name":"Cleaning an HVAC Air Conditioner Coil",
      "steps":[
        {
          "headline":"Read the manufacturer’s safety guidelines before beginning work.",
          "description":"Even though most instructions for cleaning air conditioning coils are similar, different units and manufacturers may have different safety guidelines. Read over the paperwork that came with your unit carefully and take note of any special precautions you need to follow. If you no longer have the guidelines, search the name of your unit online. You should be able to find the safety guidelines on the internet."
        },
        {
          "headline":"Turn off the thermostat and the power to the air conditioning unit.",
          "description":"Inside the house, turn off the temperature control panel so the unit doesn’t come on while you’re working. Then walk outside to your physical air conditioner and look at the side of your house to find the power box. Pull out the safety plug from the box and leave it out until you’re done cleaning the coils. Taking these precautions is essential to keeping you safe from electrical shocks! For extra safety, turn off the breaker that powers the air conditioning unit, too. The breaker will either be on the side of your house, in the basement, or in a utility closet."
        },
        {
          "headline":"Spray the unit down with cold water and clear away any debris.",
          "description":"Use your hose to spray the coils of the AC unit to cool them down, especially if the unit has been running recently. If you’re working in the fall and haven’t been using your air conditioning unit recently, you can skip this step. Take a few minutes to clear away any branches, leaves, or weeds that are growing around the unit. Avoid using high pressure on the unit, as that could damage the coils. A gentle spray for 1 to 2 minutes should be sufficient to cool them down."
        },
        {
          "headline":"Spray down the exterior coils with a specialty cleaning foam.",
          "description":"Buy a coil cleaning foam from your local hardware store for about $10 per canister. Place the nozzle about 4 inches (10 cm) away from the coils, and spray the foam onto the unit. Start at the top and work your way to the bottom until the entire coil is covered. Repeat this on every side of the HVAC unit. The coils usually have a filter or grate covering them, which is what you’ll be spraying and cleaning. The coils themselves are usually bronze or silver and they snake back and forth from the top of the unit to its bottom. You’ll need 2 to 3 cans to clean your entire HVAC unit. Avoid getting foam on nearby grass or plants, as it can be harmful to them."
        },
        {
          "headline":"Let the foam saturate the coils for 10 minutes.",
          "description":"Set a timer and leave the unit alone to allow the foam to do its work. While it’s sitting, start spraying foam on the other sides of the unit if you haven’t already. The coils of your HVAC unit are constantly drawing in air, so they’re covered with dirt and dust. Cleaning them once a year helps keep your unit running efficiently. If you run your unit year-long, you may want to clean it twice per year."
        },
        {
          "headline":"Rinse off the foam with the hose until no bubbles remain.",
          "description":"Some sprays are “self-rinsing,” so check the instructions to make sure you need to rinse the unit with the hose. If so, use a gentle to medium spray and rinse from top to bottom. Repeat the rinsing process 2 to 3 times, or until the water running off the unit is clear. Try to direct the foam and water away from grass and plants, if you can. You’ll notice lots of dirt and grime rinsing away from your unit. If there are any pieces of dirt lodged into the coils, you may need to pry them loose with your fingers, though most should be softened and dislodged by the foam."
        },
        {
          "headline":"Remember to turn the breakers, power units, and air unit back to “on.” Once you’re done rinsing off the HVAC unit, flip the breaker back on (if you turned it off).",
          "description":"Replace the safety plug on the power unit near the air conditioner. Turn your air conditioner back on inside the house. If for some reason you can’t get the unit to turn back on, double-check that you reinstalled the safety plug properly. It might not be snapped tightly into place."
        }
      ]
    },
    {
      "name":"Maintaining Refrigerator Coils",
      "steps":[
        {
          "headline":"Clean your refrigerator coils twice per year.",
          "description":"Cleaning the coils in your fridge will take you 10 to 15 minutes at the most, making it an easy task to complete. Set a reminder on your calendar for every 6 months so you don’t forget to do it. Cleaning the coils regularly will keep your electricity costs down and will save you money on potential future repair costs. If you have a pet that sheds a lot, you may want to clean the coils every 3 months."
        },
        {
          "headline":"Unplug your fridge and pull it away from the wall.",
          "description":"Always make sure to unplug the fridge before you do any kind of work to it to prevent any accidental electrical shocks while you’re working. Carefully bring it out from the wall so that you can access the base grille that covers the coils. If your fridge doesn’t have a base grille or coils crossing over the back of the unit, the grille is probably on top of the fridge. Use a step stool to access it safely. If you need to, have a friend help you pull out the fridge so that you’re safe."
        },
        {
          "headline":"Take the grille off of the coils and soak it in soapy water.",
          "description":"Most grilles simply lift off, but if yours is screwed in, use a screwdriver to remove it from the fridge. Wipe away any visible dust and then submerge the grille in a bath of warm, soapy water. Simply plug your kitchen sink, fill it with warm water and about 1 tablespoon (15 mL) of dish soap, and let the grille soak while you clean the coils. If your fridge is older, the coils may run across the back of the unit instead of at the bottom. If this is the case, you won’t have a grille to remove and clean. The grille is also often called the “kickplate.”"
        },
        {
          "headline":"Use a coil cleaning brush to clean away dust, dirt, and grime.",
          "description":"Take your coil cleaning brush and gently run it between the coils to dislodge the dust. As the brush fills with dust, wipe it off on a paper towel. Continue using the brush until you’ve removed as much of the dirt as possible. Buy a coil cleaning brush from your local hardware store. They cost about $20. If the grille is on top of the fridge, loosen the dust with the coil cleaning brush, using an upwards-and-out motion, to keep the dust from falling further down into the condenser."
        },
        {
          "headline":"Vacuum up all the dislodged dust.",
          "description":"After you’ve cleaned the coils, use the attachments on your vacuum to suck up all the dust. Gently run the attachments over the coils, as well as over the floor around the fridge where you’ve been working. If you’re particularly sensitive to dust, you might want to wear a face mask while performing this task. For unit with top grilles, vacuum away as much of the excess dust as you can, and also wipe down the top of the fridge with a damp towel."
        },
        {
          "headline":"Replace the grille, push the fridge back in place, and plug it in.",
          "description":"Rinse off the grille that has been soaking in the sink and dry it with a clean washcloth. Put it back in place over the coils, and then push the fridge back against the wall or into place. Once that is done, you can plug the fridge back in. Don’t forget to put away the vacuum cleaner when you’re done using it, too."
        }
      ]
    }
  ],
  "text":" Cleaning an HVAC Air Conditioner Coil Read the manufacturer’s safety guidelines before beginning work. Even though most instructions for cleaning air conditioning coils are similar, different units and manufacturers may have different safety guidelines. Read over the paperwork that came with your unit carefully and take note of any special precautions you need to follow. If you no longer have the guidelines, search the name of your unit online. You should be able to find the safety guidelines on the internet. Turn off the thermostat and the power to the air conditioning unit. Inside the house, turn off the temperature control panel so the unit doesn’t come on while you’re working. Then walk outside to your physical air conditioner and look at the side of your house to find the power box. Pull out the safety plug from the box and leave it out until you’re done cleaning the coils. Taking these precautions is essential to keeping you safe from electrical shocks! For extra safety, turn off the breaker that powers the air conditioning unit, too. The breaker will either be on the side of your house, in the basement, or in a utility closet. Spray the unit down with cold water and clear away any debris. Use your hose to spray the coils of the AC unit to cool them down, especially if the unit has been running recently. If you’re working in the fall and haven’t been using your air conditioning unit recently, you can skip this step. Take a few minutes to clear away any branches, leaves, or weeds that are growing around the unit. Avoid using high pressure on the unit, as that could damage the coils. A gentle spray for 1 to 2 minutes should be sufficient to cool them down. Spray down the exterior coils with a specialty cleaning foam. Buy a coil cleaning foam from your local hardware store for about $10 per canister. Place the nozzle about 4 inches (10 cm) away from the coils, and spray the foam onto the unit. Start at the top and work your way to the bottom until the entire coil is covered. Repeat this on every side of the HVAC unit. The coils usually have a filter or grate covering them, which is what you’ll be spraying and cleaning. The coils themselves are usually bronze or silver and they snake back and forth from the top of the unit to its bottom. You’ll need 2 to 3 cans to clean your entire HVAC unit. Avoid getting foam on nearby grass or plants, as it can be harmful to them. Let the foam saturate the coils for 10 minutes. Set a timer and leave the unit alone to allow the foam to do its work. While it’s sitting, start spraying foam on the other sides of the unit if you haven’t already. The coils of your HVAC unit are constantly drawing in air, so they’re covered with dirt and dust. Cleaning them once a year helps keep your unit running efficiently. If you run your unit year-long, you may want to clean it twice per year. Rinse off the foam with the hose until no bubbles remain. Some sprays are “self-rinsing,” so check the instructions to make sure you need to rinse the unit with the hose. If so, use a gentle to medium spray and rinse from top to bottom. Repeat the rinsing process 2 to 3 times, or until the water running off the unit is clear. Try to direct the foam and water away from grass and plants, if you can. You’ll notice lots of dirt and grime rinsing away from your unit. If there are any pieces of dirt lodged into the coils, you may need to pry them loose with your fingers, though most should be softened and dislodged by the foam. Remember to turn the breakers, power units, and air unit back to “on.” Once you’re done rinsing off the HVAC unit, flip the breaker back on (if you turned it off). Replace the safety plug on the power unit near the air conditioner. Turn your air conditioner back on inside the house. If for some reason you can’t get the unit to turn back on, double-check that you reinstalled the safety plug properly. It might not be snapped tightly into place. Maintaining Refrigerator Coils Clean your refrigerator coils twice per year. Cleaning the coils in your fridge will take you 10 to 15 minutes at the most, making it an easy task to complete. Set a reminder on your calendar for every 6 months so you don’t forget to do it. Cleaning the coils regularly will keep your electricity costs down and will save you money on potential future repair costs. If you have a pet that sheds a lot, you may want to clean the coils every 3 months. Unplug your fridge and pull it away from the wall. Always make sure to unplug the fridge before you do any kind of work to it to prevent any accidental electrical shocks while you’re working. Carefully bring it out from the wall so that you can access the base grille that covers the coils. If your fridge doesn’t have a base grille or coils crossing over the back of the unit, the grille is probably on top of the fridge. Use a step stool to access it safely. If you need to, have a friend help you pull out the fridge so that you’re safe. Take the grille off of the coils and soak it in soapy water. Most grilles simply lift off, but if yours is screwed in, use a screwdriver to remove it from the fridge. Wipe away any visible dust and then submerge the grille in a bath of warm, soapy water. Simply plug your kitchen sink, fill it with warm water and about 1 tablespoon (15 mL) of dish soap, and let the grille soak while you clean the coils. If your fridge is older, the coils may run across the back of the unit instead of at the bottom. If this is the case, you won’t have a grille to remove and clean. The grille is also often called the “kickplate.” Use a coil cleaning brush to clean away dust, dirt, and grime. Take your coil cleaning brush and gently run it between the coils to dislodge the dust. As the brush fills with dust, wipe it off on a paper towel. Continue using the brush until you’ve removed as much of the dirt as possible. Buy a coil cleaning brush from your local hardware store. They cost about $20. If the grille is on top of the fridge, loosen the dust with the coil cleaning brush, using an upwards-and-out motion, to keep the dust from falling further down into the condenser. Vacuum up all the dislodged dust. After you’ve cleaned the coils, use the attachments on your vacuum to suck up all the dust. Gently run the attachments over the coils, as well as over the floor around the fridge where you’ve been working. If you’re particularly sensitive to dust, you might want to wear a face mask while performing this task. For unit with top grilles, vacuum away as much of the excess dust as you can, and also wipe down the top of the fridge with a damp towel. Replace the grille, push the fridge back in place, and plug it in. Rinse off the grille that has been soaking in the sink and dry it with a clean washcloth. Put it back in place over the coils, and then push the fridge back against the wall or into place. Once that is done, you can plug the fridge back in. Don’t forget to put away the vacuum cleaner when you’re done using it, too.",
  "sentences":[
    " Cleaning an HVAC Air Conditioner Coil Read the manufacturer’s safety guidelines before beginning work.",
    "Even though most instructions for cleaning air conditioning coils are similar, different units and manufacturers may have different safety guidelines.",
    "Read over the paperwork that came with your unit carefully and take note of any special precautions you need to follow.",
    "If you no longer have the guidelines, search the name of your unit online.",
    "You should be able to find the safety guidelines on the internet.",
    "Turn off the thermostat and the power to the air conditioning unit.",
    "Inside the house, turn off the temperature control panel so the unit doesn’t come on while you’re working.",
    "Then walk outside to your physical air conditioner and look at the side of your house to find the power box.",
    "Pull out the safety plug from the box and leave it out until you’re done cleaning the coils.",
    "Taking these precautions is essential to keeping you safe from electrical shocks!",
    "For extra safety, turn off the breaker that powers the air conditioning unit, too.",
    "The breaker will either be on the side of your house, in the basement, or in a utility closet.",
    "Spray the unit down with cold water and clear away any debris.",
    "Use your hose to spray the coils of the AC unit to cool them down, especially if the unit has been running recently.",
    "If you’re working in the fall and haven’t been using your air conditioning unit recently, you can skip this step.",
    "Take a few minutes to clear away any branches, leaves, or weeds that are growing around the unit.",
    "Avoid using high pressure on the unit, as that could damage the coils.",
    "A gentle spray for 1 to 2 minutes should be sufficient to cool them down.",
    "Spray down the exterior coils with a specialty cleaning foam.",
    "Buy a coil cleaning foam from your local hardware store for about $10 per canister.",
    "Place the nozzle about 4 inches (10 cm) away from the coils, and spray the foam onto the unit.",
    "Start at the top and work your way to the bottom until the entire coil is covered.",
    "Repeat this on every side of the HVAC unit.",
    "The coils usually have a filter or grate covering them, which is what you’ll be spraying and cleaning.",
    "The coils themselves are usually bronze or silver and they snake back and forth from the top of the unit to its bottom.",
    "You’ll need 2 to 3 cans to clean your entire HVAC unit.",
    "Avoid getting foam on nearby grass or plants, as it can be harmful to them.",
    "Let the foam saturate the coils for 10 minutes.",
    "Set a timer and leave the unit alone to allow the foam to do its work.",
    "While it’s sitting, start spraying foam on the other sides of the unit if you haven’t already.",
    "The coils of your HVAC unit are constantly drawing in air, so they’re covered with dirt and dust.",
    "Cleaning them once a year helps keep your unit running efficiently.",
    "If you run your unit year-long, you may want to clean it twice per year.",
    "Rinse off the foam with the hose until no bubbles remain.",
    "Some sprays are “self-rinsing,” so check the instructions to make sure you need to rinse the unit with the hose.",
    "If so, use a gentle to medium spray and rinse from top to bottom.",
    "Repeat the rinsing process 2 to 3 times, or until the water running off the unit is clear.",
    "Try to direct the foam and water away from grass and plants, if you can.",
    "You’ll notice lots of dirt and grime rinsing away from your unit.",
    "If there are any pieces of dirt lodged into the coils, you may need to pry them loose with your fingers, though most should be softened and dislodged by the foam.",
    "Remember to turn the breakers, power units, and air unit back to “on.” Once you’re done rinsing off the HVAC unit, flip the breaker back on (if you turned it off).",
    "Replace the safety plug on the power unit near the air conditioner.",
    "Turn your air conditioner back on inside the house.",
    "If for some reason you can’t get the unit to turn back on, double-check that you reinstalled the safety plug properly.",
    "It might not be snapped tightly into place.",
    "Maintaining Refrigerator Coils Clean your refrigerator coils twice per year.",
    "Cleaning the coils in your fridge will take you 10 to 15 minutes at the most, making it an easy task to complete.",
    "Set a reminder on your calendar for every 6 months so you don’t forget to do it.",
    "Cleaning the coils regularly will keep your electricity costs down and will save you money on potential future repair costs.",
    "If you have a pet that sheds a lot, you may want to clean the coils every 3 months.",
    "Unplug your fridge and pull it away from the wall.",
    "Always make sure to unplug the fridge before you do any kind of work to it to prevent any accidental electrical shocks while you’re working.",
    "Carefully bring it out from the wall so that you can access the base grille that covers the coils.",
    "If your fridge doesn’t have a base grille or coils crossing over the back of the unit, the grille is probably on top of the fridge.",
    "Use a step stool to access it safely.",
    "If you need to, have a friend help you pull out the fridge so that you’re safe.",
    "Take the grille off of the coils and soak it in soapy water.",
    "Most grilles simply lift off, but if yours is screwed in, use a screwdriver to remove it from the fridge.",
    "Wipe away any visible dust and then submerge the grille in a bath of warm, soapy water.",
    "Simply plug your kitchen sink, fill it with warm water and about 1 tablespoon (15 mL) of dish soap, and let the grille soak while you clean the coils.",
    "If your fridge is older, the coils may run across the back of the unit instead of at the bottom.",
    "If this is the case, you won’t have a grille to remove and clean.",
    "The grille is also often called the “kickplate.” Use a coil cleaning brush to clean away dust, dirt, and grime.",
    "Take your coil cleaning brush and gently run it between the coils to dislodge the dust.",
    "As the brush fills with dust, wipe it off on a paper towel.",
    "Continue using the brush until you’ve removed as much of the dirt as possible.",
    "Buy a coil cleaning brush from your local hardware store.",
    "They cost about $20.",
    "If the grille is on top of the fridge, loosen the dust with the coil cleaning brush, using an upwards-and-out motion, to keep the dust from falling further down into the condenser.",
    "Vacuum up all the dislodged dust.",
    "After you’ve cleaned the coils, use the attachments on your vacuum to suck up all the dust.",
    "Gently run the attachments over the coils, as well as over the floor around the fridge where you’ve been working.",
    "If you’re particularly sensitive to dust, you might want to wear a face mask while performing this task.",
    "For unit with top grilles, vacuum away as much of the excess dust as you can, and also wipe down the top of the fridge with a damp towel.",
    "Replace the grille, push the fridge back in place, and plug it in.",
    "Rinse off the grille that has been soaking in the sink and dry it with a clean washcloth.",
    "Put it back in place over the coils, and then push the fridge back against the wall or into place.",
    "Once that is done, you can plug the fridge back in.",
    "Don’t forget to put away the vacuum cleaner when you’re done using it, too."
  ],
  "tyn_section":[
    "Hose",
    "HVAC coil spray",
    "Vacuum with attachments",
    "Coil cleaning brush",
    "Dish soap",
    "Paper towels",
    "Face mask (optional)",
    "Washcloth"
  ],
  "tyn_model":[
    "fridge",
    "foam",
    "water",
    "air conditioning",
    "coil cleaning brush",
    "air conditioner",
    "hose",
    "hvac unit",
    "hvac air conditioner coil",
    "specialty cleaning foam",
    "coil cleaning foam",
    "cans",
    "“self",
    "” so",
    "“on",
    "” once",
    "breaker",
    "refrigerator",
    "step stool",
    "screwdriver",
    "dish soap",
    "“kickplate",
    "” use",
    "paper towel",
    "vacuum",
    "face mask",
    "damp towel",
    "washcloth",
    "vacuum cleaner"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1379310345,
    "f1":0.2162162162,
    "avg_pos":0.2068965517
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.2068965517,
    "f1":0.310880829
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3103448276,
    "f1":0.4736842105
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.1724137931,
    "f1":0.2702702703
  }
}