{
  "title":"How to Make Nutella Hot Chocolate",
  "url":"https://www.wikihow.com/Make-Nutella-Hot-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Chocolate and Cocoa Drinks"
  ],
  "methods":[
    {
      "name":"Making Nutella Hot Chocolate on the Stovetop",
      "steps":[
        {
          "headline":"Place a saucepan over medium heat.",
          "description":"Place a small saucepan on the stove over medium heat. Try to use a stainless steel pan if you can, as opposed to an aluminum or unlined copper pan, which both can react badly with milk."
        },
        {
          "headline":"Add Nutella and milk.",
          "description":"Scoop in the 3 tablespoons (44.3 ml) of Nutella and add in ⅓ cup (78.8 ml) of milk. You can use any kind of milk you like, though whole milk will give you the creamiest flavor. You can also use a non-dairy milk like almond or soy milk if you prefer the taste or are allergic to dairy milk."
        },
        {
          "headline":"Stir continuously until blended.",
          "description":"Stir the milk and Nutella together using a spoon or whisk until the two ingredients are fully blended, about 5 minutes. The heat of the stove will help the Nutella to melt and blend with the milk."
        },
        {
          "headline":"Add the remaining milk and turn the heat to medium-high.",
          "description":"Once the Nutella and milk blend together, pour in the last cup of milk and turn the heat up to medium-high. If you want a less milky version, reduce the amount of milk you add to ¾ cup (177.4 ml). Only turn the milk up to medium-high. Putting the milk on a higher heat will cause it to scald and form an annoying protein skin."
        },
        {
          "headline":"Mix until blended.",
          "description":"After you pour in the extra milk, use your whisk or spoon to stir your ingredients continuously. It should only take a minute or so for the ingredients to mix. If you want your hot chocolate to be extra-frothy, whisk vigorously to produce bubbles."
        },
        {
          "headline":"Pour into a mug and serve.",
          "description":"Once the hot chocolate has heated and mixed, pour or ladle the drink carefully into a mug. Garnish the hot chocolate if you wish with marshmallows and serve it while it's still hot!"
        }
      ]
    },
    {
      "name":"Making Nutella Hot Chocolate in the Microwave",
      "steps":[
        {
          "headline":"Pour milk into a microwave-safe mug.",
          "description":"You can also use the microwave to make Nutella hot chocolate, though as milk easily scalds in the microwave, you must be sure not to over-microwave it! To begin, pour the 1 ⅓ cup (315.4 ml) of milk into a microwave-safe mug."
        },
        {
          "headline":"Microwave on high for 2 minutes.",
          "description":"Place the mug of milk in the microwave and microwave on high for 2 minutes. Don't microwave for any longer than 2 minutes, as this can cause the milk to scald."
        },
        {
          "headline":"Add the Nutella.",
          "description":"After the milk has microwaved for 2 minutes, take the mug out of the microwave and scoop in the Nutella. Begin to stir together the Nutella into the milk with a spoon."
        },
        {
          "headline":"Stir until the Nutella is incorporated.",
          "description":"As you are stirring, you should see the Nutella beginning to melt from the heat of the milk. Keep stirring until the Nutella has fully melted and is mixed with the milk."
        },
        {
          "headline":"Reheat if necessary.",
          "description":"If your hot chocolate isn't hot enough, put it back in the microwave and microwave for fifteen-second intervals, checking after every session to make sure the milk doesn't scald. Then serve and enjoy!"
        }
      ]
    },
    {
      "name":"Adding Toppings and Extra Ingredients",
      "steps":[
        {
          "headline":"Sprinkle in marshmallows.",
          "description":"Marshmallows are a classic addition to any kind of hot chocolate, including Nutella hot chocolate! Sprinkle in mini marshmallows right after heating your hot chocolate. The marshmallows will melt slightly but still keep their delightful, fluffy texture!"
        },
        {
          "headline":"Serve with whipped cream and chocolate sauce.",
          "description":"Another classic way to garnish your hot chocolate is to top it with whipped cream and drizzle on chocolate or butterscotch sauce. You can even make your own whipped cream and infuse it with flavors like coffee or hazelnut! To make your drink even more Nutella-y, you can put Nutella into a piping bag used for frosting cakes, then pipe Nutella on top of the whipped cream as a substitute for chocolate sauce."
        },
        {
          "headline":"Add texture to your Nutella hot chocolate.",
          "description":"To give your hot chocolate extra crunch, top your Nutella hot chocolate with whipped cream, then add crushed hazelnuts, shaved chocolate, or chocolate chips to your drink. These topping will add texture and crunch to your drink for an even more enjoyable experience!"
        },
        {
          "headline":"Spike your Nutella hot chocolate with bourbon.",
          "description":"Spiked Nutella hot chocolate is a rich and indulgent treat for those above drinking age. To spike your Nutella hot chocolate, simply pour in your desired amount of bourbon after you have finished preparing the hot chocolate, then mix with a spoon. Bourbon is an alcohol that tastes excellent paired with chocolate. Other good options are rum and chocolate liqueur."
        }
      ]
    }
  ],
  "text":" Making Nutella Hot Chocolate on the Stovetop Place a saucepan over medium heat. Place a small saucepan on the stove over medium heat. Try to use a stainless steel pan if you can, as opposed to an aluminum or unlined copper pan, which both can react badly with milk. Add Nutella and milk. Scoop in the 3 tablespoons (44.3 ml) of Nutella and add in ⅓ cup (78.8 ml) of milk. You can use any kind of milk you like, though whole milk will give you the creamiest flavor. You can also use a non-dairy milk like almond or soy milk if you prefer the taste or are allergic to dairy milk. Stir continuously until blended. Stir the milk and Nutella together using a spoon or whisk until the two ingredients are fully blended, about 5 minutes. The heat of the stove will help the Nutella to melt and blend with the milk. Add the remaining milk and turn the heat to medium-high. Once the Nutella and milk blend together, pour in the last cup of milk and turn the heat up to medium-high. If you want a less milky version, reduce the amount of milk you add to ¾ cup (177.4 ml). Only turn the milk up to medium-high. Putting the milk on a higher heat will cause it to scald and form an annoying protein skin. Mix until blended. After you pour in the extra milk, use your whisk or spoon to stir your ingredients continuously. It should only take a minute or so for the ingredients to mix. If you want your hot chocolate to be extra-frothy, whisk vigorously to produce bubbles. Pour into a mug and serve. Once the hot chocolate has heated and mixed, pour or ladle the drink carefully into a mug. Garnish the hot chocolate if you wish with marshmallows and serve it while it's still hot! Making Nutella Hot Chocolate in the Microwave Pour milk into a microwave-safe mug. You can also use the microwave to make Nutella hot chocolate, though as milk easily scalds in the microwave, you must be sure not to over-microwave it! To begin, pour the 1 ⅓ cup (315.4 ml) of milk into a microwave-safe mug. Microwave on high for 2 minutes. Place the mug of milk in the microwave and microwave on high for 2 minutes. Don't microwave for any longer than 2 minutes, as this can cause the milk to scald. Add the Nutella. After the milk has microwaved for 2 minutes, take the mug out of the microwave and scoop in the Nutella. Begin to stir together the Nutella into the milk with a spoon. Stir until the Nutella is incorporated. As you are stirring, you should see the Nutella beginning to melt from the heat of the milk. Keep stirring until the Nutella has fully melted and is mixed with the milk. Reheat if necessary. If your hot chocolate isn't hot enough, put it back in the microwave and microwave for fifteen-second intervals, checking after every session to make sure the milk doesn't scald. Then serve and enjoy! Adding Toppings and Extra Ingredients Sprinkle in marshmallows. Marshmallows are a classic addition to any kind of hot chocolate, including Nutella hot chocolate! Sprinkle in mini marshmallows right after heating your hot chocolate. The marshmallows will melt slightly but still keep their delightful, fluffy texture! Serve with whipped cream and chocolate sauce. Another classic way to garnish your hot chocolate is to top it with whipped cream and drizzle on chocolate or butterscotch sauce. You can even make your own whipped cream and infuse it with flavors like coffee or hazelnut! To make your drink even more Nutella-y, you can put Nutella into a piping bag used for frosting cakes, then pipe Nutella on top of the whipped cream as a substitute for chocolate sauce. Add texture to your Nutella hot chocolate. To give your hot chocolate extra crunch, top your Nutella hot chocolate with whipped cream, then add crushed hazelnuts, shaved chocolate, or chocolate chips to your drink. These topping will add texture and crunch to your drink for an even more enjoyable experience! Spike your Nutella hot chocolate with bourbon. Spiked Nutella hot chocolate is a rich and indulgent treat for those above drinking age. To spike your Nutella hot chocolate, simply pour in your desired amount of bourbon after you have finished preparing the hot chocolate, then mix with a spoon. Bourbon is an alcohol that tastes excellent paired with chocolate. Other good options are rum and chocolate liqueur.",
  "sentences":[
    " Making Nutella Hot Chocolate on the Stovetop Place a saucepan over medium heat.",
    "Place a small saucepan on the stove over medium heat.",
    "Try to use a stainless steel pan if you can, as opposed to an aluminum or unlined copper pan, which both can react badly with milk.",
    "Add Nutella and milk.",
    "Scoop in the 3 tablespoons (44.3 ml) of Nutella and add in ⅓ cup (78.8 ml) of milk.",
    "You can use any kind of milk you like, though whole milk will give you the creamiest flavor.",
    "You can also use a non-dairy milk like almond or soy milk if you prefer the taste or are allergic to dairy milk.",
    "Stir continuously until blended.",
    "Stir the milk and Nutella together using a spoon or whisk until the two ingredients are fully blended, about 5 minutes.",
    "The heat of the stove will help the Nutella to melt and blend with the milk.",
    "Add the remaining milk and turn the heat to medium-high.",
    "Once the Nutella and milk blend together, pour in the last cup of milk and turn the heat up to medium-high.",
    "If you want a less milky version, reduce the amount of milk you add to ¾ cup (177.4 ml).",
    "Only turn the milk up to medium-high.",
    "Putting the milk on a higher heat will cause it to scald and form an annoying protein skin.",
    "Mix until blended.",
    "After you pour in the extra milk, use your whisk or spoon to stir your ingredients continuously.",
    "It should only take a minute or so for the ingredients to mix.",
    "If you want your hot chocolate to be extra-frothy, whisk vigorously to produce bubbles.",
    "Pour into a mug and serve.",
    "Once the hot chocolate has heated and mixed, pour or ladle the drink carefully into a mug.",
    "Garnish the hot chocolate if you wish with marshmallows and serve it while it's still hot!",
    "Making Nutella Hot Chocolate in the Microwave Pour milk into a microwave-safe mug.",
    "You can also use the microwave to make Nutella hot chocolate, though as milk easily scalds in the microwave, you must be sure not to over-microwave it!",
    "To begin, pour the 1 ⅓ cup (315.4 ml) of milk into a microwave-safe mug.",
    "Microwave on high for 2 minutes.",
    "Place the mug of milk in the microwave and microwave on high for 2 minutes.",
    "Don't microwave for any longer than 2 minutes, as this can cause the milk to scald.",
    "Add the Nutella.",
    "After the milk has microwaved for 2 minutes, take the mug out of the microwave and scoop in the Nutella.",
    "Begin to stir together the Nutella into the milk with a spoon.",
    "Stir until the Nutella is incorporated.",
    "As you are stirring, you should see the Nutella beginning to melt from the heat of the milk.",
    "Keep stirring until the Nutella has fully melted and is mixed with the milk.",
    "Reheat if necessary.",
    "If your hot chocolate isn't hot enough, put it back in the microwave and microwave for fifteen-second intervals, checking after every session to make sure the milk doesn't scald.",
    "Then serve and enjoy!",
    "Adding Toppings and Extra Ingredients Sprinkle in marshmallows.",
    "Marshmallows are a classic addition to any kind of hot chocolate, including Nutella hot chocolate!",
    "Sprinkle in mini marshmallows right after heating your hot chocolate.",
    "The marshmallows will melt slightly but still keep their delightful, fluffy texture!",
    "Serve with whipped cream and chocolate sauce.",
    "Another classic way to garnish your hot chocolate is to top it with whipped cream and drizzle on chocolate or butterscotch sauce.",
    "You can even make your own whipped cream and infuse it with flavors like coffee or hazelnut!",
    "To make your drink even more Nutella-y, you can put Nutella into a piping bag used for frosting cakes, then pipe Nutella on top of the whipped cream as a substitute for chocolate sauce.",
    "Add texture to your Nutella hot chocolate.",
    "To give your hot chocolate extra crunch, top your Nutella hot chocolate with whipped cream, then add crushed hazelnuts, shaved chocolate, or chocolate chips to your drink.",
    "These topping will add texture and crunch to your drink for an even more enjoyable experience!",
    "Spike your Nutella hot chocolate with bourbon.",
    "Spiked Nutella hot chocolate is a rich and indulgent treat for those above drinking age.",
    "To spike your Nutella hot chocolate, simply pour in your desired amount of bourbon after you have finished preparing the hot chocolate, then mix with a spoon.",
    "Bourbon is an alcohol that tastes excellent paired with chocolate.",
    "Other good options are rum and chocolate liqueur."
  ],
  "tyn_section":[
    "Small saucepan",
    "Whisk or spoon",
    "Double broiler",
    "Microwaveable mug"
  ],
  "tyn_model":[
    "milk",
    "nutella",
    "microwave",
    "mug",
    "marshmallows",
    "whipped cream",
    "spoon",
    "hot chocolate",
    "chocolate",
    "nutella hot chocolate",
    "whisk",
    "bourbon",
    "saucepan",
    "stove",
    "chocolate sauce",
    "stainless steel pan",
    "⅓ cup",
    "dairy milk",
    "1 ⅓",
    "microwave-safe mug",
    "chocolate or butterscotch sauce",
    "piping bag",
    "chocolate chips",
    "rum",
    "chocolate liqueur"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.08,
    "f1":0.1379310345
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2,
    "f1":0.3157894737
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}