{
  "title":"How to Make Homemade Candles",
  "url":"https://www.wikihow.com/Make-Homemade-Candles",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "parts":[
    {
      "name":"Preparing the Wax for Melting",
      "steps":[
        {
          "headline":"Decide what kind of wax you want to use to make your candle.",
          "description":"There are several different kinds of wax to choose from. One pound of paraffin wax by weight will equal approximately 20 oz of liquid melted wax. One pound of soy wax will equal approximately 18 oz of liquid when melted. One pound of beeswax by weight will equal approximately 16 oz of liquid when melted. Paraffin wax is the traditional wax for candle making and is still by far the most popular wax. It is good for beginners because it melts quickly, is cheap and is easily colored or scented. However, it should be noted that the chemicals that are emitted when this wax is melted could be irritating to some people. Soy wax is becoming increasingly popular as it is easy to use, made from soybeans and cleans up pretty easily. It is eco-friendly and renewable. Soy wax is also known to burn more slowly than most other waxes. Beeswax is all natural and has air purifying qualities to it; however, it doesn’t retain scent or coloring that well. Essential oils will generally work with beeswax but keep in mind that beeswax has its own lovely scent. You can also use old candles that have been burned down or are half-used and warped. Using old candles is a great way to recycle wax. Simply melt them just as you would melt other wax (see Part Two)."
        },
        {
          "headline":"Protect your work area before you begin.",
          "description":"Unless you have a dedicated area that you can get wax on without worrying about it, you should put newspaper, wax paper, or towels and rags down on the surface you will be working on. Have some warm soapy water at the ready as well in case of spills."
        },
        {
          "headline":"Cut or shred your wax into chunks or shavings.",
          "description":"Smaller chunks of wax melt better than larger chunks. By using smaller pieces, you will also ensure that the wax melts at an even rate."
        },
        {
          "headline":"Fill a medium or large pot halfway through with water.",
          "description":"Make sure there's enough room in the pot for a smaller container; you'll be using the smaller vessel to melt the wax in a makeshift double boiler."
        }
      ]
    },
    {
      "name":"Melting the Wax",
      "steps":[
        {
          "headline":"Place the wax chunks or shavings in a smaller, heat-resistant container.",
          "description":"Place this smaller container inside the larger pot, creating a makeshift double boiler. Note: You cannot put candle wax directly on heat or it will catch fire or evaporate. Turn the heat to high so that the water boils. The boiling water will slowly melt the wax. Keep in mind that wax can be difficult to clean--you may want to purchase a cheap, heat-safe pot that you designate specifically for making candles."
        },
        {
          "headline":"Use a thermometer to keep an eye on the temperature of the wax.",
          "description":"You can purchase candy or candle thermometers at a cooking or craft store. If you do not have a candy thermometer, you can also use a meat thermometer. Just remember that wax can be hard to remove. Paraffin wax should be melted until it reaches between 122 and 140°F (50 and 60°C). Soy wax should be melted until it reaches between 170 and 180 degrees (76.6 and 82.2°C). Beeswax should be melted until it reaches roughly 145 degrees (62.7°C). You can go a little bit higher but try not to exceed 175 degrees (79.4°C). Old candles should be melted at around 185 degrees (85°C). Remove the old wicks with tongs."
        },
        {
          "headline":"Add scent to your melted wax.",
          "description":"The scent you choose is up to you. Scents such as essential oils can be purchased at your local craft store. It is best to read the bottle’s directions rather than base the amount you put in on how strongly it smells after the scent has already been added. Stir well."
        },
        {
          "headline":"Add coloring.",
          "description":"Normal food coloring will not work in candles because they are water-based. Purchase oil-based dyes at your local craft store. You can generally find specific candle dyes. Read the bottle for the proper amount of dye to put in to achieve a certain color. Add drops of coloring until you have reached your desired color. Stir well."
        }
      ]
    },
    {
      "name":"Molding the Wax",
      "steps":[
        {
          "headline":"Place a wick in the center of the candle mold.",
          "description":"You can use tins, mason jars, old teacups, really any sort of container that you know can withstand heat. Metal tins are generally the safest way to go but as long as you know your container can stand up to heat, you can really use whatever you like. Place them on a flat surface in your protected workspace (such as on a cookie sheet or a cutting board.) The wick should be in the center of the candle mold with about two inches sticking out of the candle. Loop the end that will be out of the wax around the center of a pen or pencil. Rest the pen across the top of the mold you will be pouring your wax into. Make sure the wick hangs down straight into the center of the mold."
        },
        {
          "headline":"Pour the melted wax into the mold.",
          "description":"Pour slowly so that it does not spill over. Make sure not to knock the wick out of the mold accidentally. You are the judge of how full you want your molds to be. Beeswax will shrink a little once it has cooled so keep that in mind when pouring it into your molds."
        },
        {
          "headline":"Cool the wax.",
          "description":"It is best to cool them for a full 24 hours if possible. The longer you let them cool, the better they will be. Paraffin candles generally take 24 hours to cool. Soy candles generally take 4 to 5 hours to cool. Beeswax candles generally take 6 hours to cool, but if you can wait, cooling them overnight is best. If you made your candle with old candles, you should only need to let it stand for a couple of hours."
        },
        {
          "headline":"Remove the wax from the mold and trim the wick down to ¼ inch (0.64 centimeters).",
          "description":"This will help contain the flame, as a longer wick will cause the flame to be too large."
        },
        {
          "headline":"Light the wick, burn your candle and enjoy your masterpiece.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Wax for Melting Decide what kind of wax you want to use to make your candle. There are several different kinds of wax to choose from. One pound of paraffin wax by weight will equal approximately 20 oz of liquid melted wax. One pound of soy wax will equal approximately 18 oz of liquid when melted. One pound of beeswax by weight will equal approximately 16 oz of liquid when melted. Paraffin wax is the traditional wax for candle making and is still by far the most popular wax. It is good for beginners because it melts quickly, is cheap and is easily colored or scented. However, it should be noted that the chemicals that are emitted when this wax is melted could be irritating to some people. Soy wax is becoming increasingly popular as it is easy to use, made from soybeans and cleans up pretty easily. It is eco-friendly and renewable. Soy wax is also known to burn more slowly than most other waxes. Beeswax is all natural and has air purifying qualities to it; however, it doesn’t retain scent or coloring that well. Essential oils will generally work with beeswax but keep in mind that beeswax has its own lovely scent. You can also use old candles that have been burned down or are half-used and warped. Using old candles is a great way to recycle wax. Simply melt them just as you would melt other wax (see Part Two). Protect your work area before you begin. Unless you have a dedicated area that you can get wax on without worrying about it, you should put newspaper, wax paper, or towels and rags down on the surface you will be working on. Have some warm soapy water at the ready as well in case of spills. Cut or shred your wax into chunks or shavings. Smaller chunks of wax melt better than larger chunks. By using smaller pieces, you will also ensure that the wax melts at an even rate. Fill a medium or large pot halfway through with water. Make sure there's enough room in the pot for a smaller container; you'll be using the smaller vessel to melt the wax in a makeshift double boiler. Melting the Wax Place the wax chunks or shavings in a smaller, heat-resistant container. Place this smaller container inside the larger pot, creating a makeshift double boiler. Note: You cannot put candle wax directly on heat or it will catch fire or evaporate. Turn the heat to high so that the water boils. The boiling water will slowly melt the wax. Keep in mind that wax can be difficult to clean--you may want to purchase a cheap, heat-safe pot that you designate specifically for making candles. Use a thermometer to keep an eye on the temperature of the wax. You can purchase candy or candle thermometers at a cooking or craft store. If you do not have a candy thermometer, you can also use a meat thermometer. Just remember that wax can be hard to remove. Paraffin wax should be melted until it reaches between 122 and 140°F (50 and 60°C). Soy wax should be melted until it reaches between 170 and 180 degrees (76.6 and 82.2°C). Beeswax should be melted until it reaches roughly 145 degrees (62.7°C). You can go a little bit higher but try not to exceed 175 degrees (79.4°C). Old candles should be melted at around 185 degrees (85°C). Remove the old wicks with tongs. Add scent to your melted wax. The scent you choose is up to you. Scents such as essential oils can be purchased at your local craft store. It is best to read the bottle’s directions rather than base the amount you put in on how strongly it smells after the scent has already been added. Stir well. Add coloring. Normal food coloring will not work in candles because they are water-based. Purchase oil-based dyes at your local craft store. You can generally find specific candle dyes. Read the bottle for the proper amount of dye to put in to achieve a certain color. Add drops of coloring until you have reached your desired color. Stir well. Molding the Wax Place a wick in the center of the candle mold. You can use tins, mason jars, old teacups, really any sort of container that you know can withstand heat. Metal tins are generally the safest way to go but as long as you know your container can stand up to heat, you can really use whatever you like. Place them on a flat surface in your protected workspace (such as on a cookie sheet or a cutting board.) The wick should be in the center of the candle mold with about two inches sticking out of the candle. Loop the end that will be out of the wax around the center of a pen or pencil. Rest the pen across the top of the mold you will be pouring your wax into. Make sure the wick hangs down straight into the center of the mold. Pour the melted wax into the mold. Pour slowly so that it does not spill over. Make sure not to knock the wick out of the mold accidentally. You are the judge of how full you want your molds to be. Beeswax will shrink a little once it has cooled so keep that in mind when pouring it into your molds. Cool the wax. It is best to cool them for a full 24 hours if possible. The longer you let them cool, the better they will be. Paraffin candles generally take 24 hours to cool. Soy candles generally take 4 to 5 hours to cool. Beeswax candles generally take 6 hours to cool, but if you can wait, cooling them overnight is best. If you made your candle with old candles, you should only need to let it stand for a couple of hours. Remove the wax from the mold and trim the wick down to ¼ inch (0.64 centimeters). This will help contain the flame, as a longer wick will cause the flame to be too large. Light the wick, burn your candle and enjoy your masterpiece.  Finished. ",
  "sentences":[
    " Preparing the Wax for Melting Decide what kind of wax you want to use to make your candle.",
    "There are several different kinds of wax to choose from.",
    "One pound of paraffin wax by weight will equal approximately 20 oz of liquid melted wax.",
    "One pound of soy wax will equal approximately 18 oz of liquid when melted.",
    "One pound of beeswax by weight will equal approximately 16 oz of liquid when melted.",
    "Paraffin wax is the traditional wax for candle making and is still by far the most popular wax.",
    "It is good for beginners because it melts quickly, is cheap and is easily colored or scented.",
    "However, it should be noted that the chemicals that are emitted when this wax is melted could be irritating to some people.",
    "Soy wax is becoming increasingly popular as it is easy to use, made from soybeans and cleans up pretty easily.",
    "It is eco-friendly and renewable.",
    "Soy wax is also known to burn more slowly than most other waxes.",
    "Beeswax is all natural and has air purifying qualities to it; however, it doesn’t retain scent or coloring that well.",
    "Essential oils will generally work with beeswax but keep in mind that beeswax has its own lovely scent.",
    "You can also use old candles that have been burned down or are half-used and warped.",
    "Using old candles is a great way to recycle wax.",
    "Simply melt them just as you would melt other wax (see Part Two).",
    "Protect your work area before you begin.",
    "Unless you have a dedicated area that you can get wax on without worrying about it, you should put newspaper, wax paper, or towels and rags down on the surface you will be working on.",
    "Have some warm soapy water at the ready as well in case of spills.",
    "Cut or shred your wax into chunks or shavings.",
    "Smaller chunks of wax melt better than larger chunks.",
    "By using smaller pieces, you will also ensure that the wax melts at an even rate.",
    "Fill a medium or large pot halfway through with water.",
    "Make sure there's enough room in the pot for a smaller container; you'll be using the smaller vessel to melt the wax in a makeshift double boiler.",
    "Melting the Wax Place the wax chunks or shavings in a smaller, heat-resistant container.",
    "Place this smaller container inside the larger pot, creating a makeshift double boiler.",
    "Note: You cannot put candle wax directly on heat or it will catch fire or evaporate.",
    "Turn the heat to high so that the water boils.",
    "The boiling water will slowly melt the wax.",
    "Keep in mind that wax can be difficult to clean--you may want to purchase a cheap, heat-safe pot that you designate specifically for making candles.",
    "Use a thermometer to keep an eye on the temperature of the wax.",
    "You can purchase candy or candle thermometers at a cooking or craft store.",
    "If you do not have a candy thermometer, you can also use a meat thermometer.",
    "Just remember that wax can be hard to remove.",
    "Paraffin wax should be melted until it reaches between 122 and 140°F (50 and 60°C).",
    "Soy wax should be melted until it reaches between 170 and 180 degrees (76.6 and 82.2°C).",
    "Beeswax should be melted until it reaches roughly 145 degrees (62.7°C).",
    "You can go a little bit higher but try not to exceed 175 degrees (79.4°C).",
    "Old candles should be melted at around 185 degrees (85°C).",
    "Remove the old wicks with tongs.",
    "Add scent to your melted wax.",
    "The scent you choose is up to you.",
    "Scents such as essential oils can be purchased at your local craft store.",
    "It is best to read the bottle’s directions rather than base the amount you put in on how strongly it smells after the scent has already been added.",
    "Stir well.",
    "Add coloring.",
    "Normal food coloring will not work in candles because they are water-based.",
    "Purchase oil-based dyes at your local craft store.",
    "You can generally find specific candle dyes.",
    "Read the bottle for the proper amount of dye to put in to achieve a certain color.",
    "Add drops of coloring until you have reached your desired color.",
    "Stir well.",
    "Molding the Wax Place a wick in the center of the candle mold.",
    "You can use tins, mason jars, old teacups, really any sort of container that you know can withstand heat.",
    "Metal tins are generally the safest way to go but as long as you know your container can stand up to heat, you can really use whatever you like.",
    "Place them on a flat surface in your protected workspace (such as on a cookie sheet or a cutting board.)",
    "The wick should be in the center of the candle mold with about two inches sticking out of the candle.",
    "Loop the end that will be out of the wax around the center of a pen or pencil.",
    "Rest the pen across the top of the mold you will be pouring your wax into.",
    "Make sure the wick hangs down straight into the center of the mold.",
    "Pour the melted wax into the mold.",
    "Pour slowly so that it does not spill over.",
    "Make sure not to knock the wick out of the mold accidentally.",
    "You are the judge of how full you want your molds to be.",
    "Beeswax will shrink a little once it has cooled so keep that in mind when pouring it into your molds.",
    "Cool the wax.",
    "It is best to cool them for a full 24 hours if possible.",
    "The longer you let them cool, the better they will be.",
    "Paraffin candles generally take 24 hours to cool.",
    "Soy candles generally take 4 to 5 hours to cool.",
    "Beeswax candles generally take 6 hours to cool, but if you can wait, cooling them overnight is best.",
    "If you made your candle with old candles, you should only need to let it stand for a couple of hours.",
    "Remove the wax from the mold and trim the wick down to ¼ inch (0.64 centimeters).",
    "This will help contain the flame, as a longer wick will cause the flame to be too large.",
    "Light the wick, burn your candle and enjoy your masterpiece.",
    "Finished."
  ],
  "tyn_section":[
    "Melting wax for candle making",
    "Wick",
    "Pen, pencil, or large clip",
    "Molds such as jars or tins",
    "A double boiler (1 large pot and 1 small pot)",
    "Water",
    "Scents (optional)",
    "Coloring agents (optional)",
    "Candy or candle thermometer",
    "Newspaper, cardboard or old cloth to protect your work space",
    "Warm, soapy water in case of spill"
  ],
  "tyn_model":[
    "wax",
    "candles",
    "pot",
    "paraffin wax",
    "soy wax",
    "water",
    "beeswax",
    "tins",
    "pen",
    "newspaper",
    "wax paper",
    "soapy water",
    "double boiler",
    "boiler",
    "candle wax",
    "thermometer",
    "essential oils",
    "coloring",
    "food coloring",
    "mason jars",
    "teacups",
    "pencil",
    "beeswax candles",
    "wick",
    "candle"
  ],
  "simple_metrics":{
    "r":0.1818181818,
    "p":0.08,
    "f1":0.1111111111,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1818181818,
    "p":0.12,
    "f1":0.1445783133
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3636363636,
    "p":0.2,
    "f1":0.2580645161
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1818181818,
    "p":0.08,
    "f1":0.1111111111
  }
}