{
  "title":"How to Make Gum Paste",
  "url":"https://www.wikihow.com/Make-Gum-Paste",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Mixing a Basic Gum Paste",
      "steps":[
        {
          "headline":"Beat 4 pasteurized egg whites for 10 seconds on high speed.",
          "description":"Separate 4 eggs, then pour the egg whites into the bowl of your stand mixer. Fit the mixer with a paddle attachment, then beat the eggs on high speed for about 10 seconds, just long enough to break them apart. The paddle mixer will break up the eggs evenly, without whipping them too much. Since egg yolks are high in fat, if any of the yolks get into your egg whites, it could keep the mixture from reaching soft-peak stage later on."
        },
        {
          "headline":"Turn the mixer to low and slowly add 7 cups (875 g) of powdered sugar.",
          "description":"If you add the sugar all at once, the egg whites could deflate, and the mixture won’t reach soft-peak stage, which is necessary for the gum paste to become elastic. Instead, add the powdered sugar slowly, about 1 cup (125 g) at a time. Wait until each addition is fully mixed in before you add in more. Sift your sugar and make sure the measuring cup is level when you measure it out. This will ensure you get a consistent result every time. You’ll incorporate the remaining 1 cup (125 g) of powdered sugar later on."
        },
        {
          "headline":"Mix the eggs and sugar on medium speed for about 5 minutes.",
          "description":"Once all the sugar is incorporated, turn up the speed and continue mixing the egg whites and sugar until the mixture leaves a soft, curled point for a moment after you lift the paddle. It will also appear shiny and white. This is called the soft peak stage, and it should take about 5 minutes. The egg and sugar mixture should have the consistency of royal icing or soft-serve ice cream.Tip: Try adding 2-3 drops of food coloring to the eggs and sugar if you want it all to be the same color!"
        },
        {
          "headline":"Sprinkle in 4 tbsp (27 g) of tylose stirring until the mixture clumps.",
          "description":"It should only take about 2 minutes for the tylose to start hardening the egg white mixture. If your mixer starts to bog down before the tylose is fully integrated, turn the speed to high. When it’s ready, you should have a mixture that’s gummy and stiff, but still creamy. The texture will be similar to a stiff buttercream. Tylose may also be called gum tragacanth or gum -tex."
        },
        {
          "headline":"Add shortening to your hands.",
          "description":"The gum paste dough will be sticky, so before you try to knead it, coat your hands with a thin layer of vegetable shortening. In addition to keeping the dough from sticking to your hands, the shortening will help keep the gum paste from cracking as it dries. How much you use is up to you, but about 1/2 tbsp (6 g) of shortening should be plenty."
        },
        {
          "headline":"Place the remaining powdered sugar and the dough on a flat surface.",
          "description":"Take the last 1 cup (125 g) of sugar you reserved and spread it out onto your countertop or table. Then, take the dough out of the bowl and put it on top of the powdered sugar. This will make it easy to get the sugar evenly incorporated into the gum paste dough. To make cleanup easy, knead the dough on a silicone mat!"
        },
        {
          "headline":"Knead the gum paste until the consistency is spongy.",
          "description":"Once all of the sugar is incorporated, the gum paste should feel slightly springy under your fingertips. It will also have a pocked appearance, rather than being smooth. Add in more sugar if the dough is too soft or too wet."
        },
        {
          "headline":"Place the gum paste in a sealable plastic bag and refrigerate it overnight.",
          "description":"In order for the gum paste to set up and have the right consistency for making decorations, you have to let it rest. Put the dough in a plastic bag and squeeze out all of the air, then place the bag in the refrigerator for 8 hours or overnight. Let the gum paste sit on your counter for about 30 minutes to bring it up to room temperature before you use it. If you have any leftover gum paste, keep it in the fridge in an airtight container. It will last for 6 months or more. You can also freeze gum paste if you need to keep it longer than 6 months."
        }
      ]
    },
    {
      "name":"Making a Gumpaste with Gelatin",
      "steps":[
        {
          "headline":"Pour cold water and 2 packages of gelatin into a microwave-safe bowl.",
          "description":"Gelatin is made up of granules that must soften before they can dissolve. To give the gelatin time to soften, allow the bowl to sit undisturbed for about 5 minutes. Each gelatin packet should contain 1 tbsp (2.5 g) of gelatin. If you use warm water, the gelatin may expand too quickly. This could prevent some of the gelatin from dissolving, which will affect the final texture of the gum paste."
        },
        {
          "headline":"Add the shortening and white corn syrup to the gelatin.",
          "description":"You'll need 2 tbsp (12 g) of shortening and ⁄3 cup (79 mL) of white corn syrup. Both the gelatin and the shortening need to be heated. The easiest way to do this is to combine them in the same bowl, then to microwave them for a few seconds. In addition, the heat will help the white corn syrup integrate into the mix more easily."
        },
        {
          "headline":"Microwave the gelatin mixture for 20-30 seconds.",
          "description":"After 20-30 seconds, take the bowl out of the microwave and stir everything together. If the shortening isn’t completely melted, microwave the mixture for another 5 seconds at a time until it is. Since you’re just heating this for a short time, regular heat is fine. If you microwave the gelatin for too long, though, you could scorch it and affect the texture."
        },
        {
          "headline":"Pour 6 cups (750 g) of powdered sugar into a bowl and make a well.",
          "description":"Measure out 6 cups (750 g) of powdered sugar, making sure your measuring cup is level each time. Once all of the sugar is in a large bowl, use your hands to dig out a small hole in the center, called a well."
        },
        {
          "headline":"Add the gelatin mixture to the well gradually, stirring after each addition.",
          "description":"Take the gelatin, shortening, and corn syrup mixture that you prepared earlier, and slowly pour it into the well you just made in the sugar. After you pour in about 1/3 of the liquid, stop and stir it in as well as you can. Then, add another third and stir again before finally adding the rest of the gelatin."
        },
        {
          "headline":"Mix the remaining sugar with 3 tbsp (20 g) of tylose on your counter.",
          "description":"To integrate the tylose into this recipe, you’ll knead it in with the remaining 2 cups (250 g) of sugar. Since you’ll be pouring the sugar onto your work surface, the easiest way to mix them together is to measure both directly onto the counter, then mix them together with your hands. If you prefer, you can mix the ingredients in a bowl, then pour them onto the counter."
        },
        {
          "headline":"Put shortening on your hands, then take the dough out of the bowl.",
          "description":"At this point, you’ll have a very wet dough. To keep it from sticking to your hands when you take it out of the bowl, put a little of the extra shortening on your hands. Then, take the dough out of the bowl and put it on top of the powdered sugar and tylose mixture on the counter."
        },
        {
          "headline":"Knead the remaining sugar into the dough.",
          "description":"Use your hands to push and roll the dough and sugar together until all of the sugar and tylose combination has been worked into the gum paste dough. As you work, you should feel the dough start to become tough and less sticky. If the dough still feels sticky once all of the sugar is incorporated, add more powdered sugar, about 1/8 cup (15 g) at a time.Tip: If your mixer has a dough hook attachment, you can use that instead of kneading the mixture by hand."
        },
        {
          "headline":"Wrap the gum paste in plastic wrap and put it in a container overnight.",
          "description":"Unlike gum paste made with egg whites, this recipe does not need to be refrigerated in order to set up. However, it does need to rest for at least 8 hours or overnight. Wrap the gum paste tightly with plastic wrap, then place it in an air-tight container somewhere that it won’t be disturbed."
        }
      ]
    }
  ],
  "text":" Mixing a Basic Gum Paste Beat 4 pasteurized egg whites for 10 seconds on high speed. Separate 4 eggs, then pour the egg whites into the bowl of your stand mixer. Fit the mixer with a paddle attachment, then beat the eggs on high speed for about 10 seconds, just long enough to break them apart. The paddle mixer will break up the eggs evenly, without whipping them too much. Since egg yolks are high in fat, if any of the yolks get into your egg whites, it could keep the mixture from reaching soft-peak stage later on. Turn the mixer to low and slowly add 7 cups (875 g) of powdered sugar. If you add the sugar all at once, the egg whites could deflate, and the mixture won’t reach soft-peak stage, which is necessary for the gum paste to become elastic. Instead, add the powdered sugar slowly, about 1 cup (125 g) at a time. Wait until each addition is fully mixed in before you add in more. Sift your sugar and make sure the measuring cup is level when you measure it out. This will ensure you get a consistent result every time. You’ll incorporate the remaining 1 cup (125 g) of powdered sugar later on. Mix the eggs and sugar on medium speed for about 5 minutes. Once all the sugar is incorporated, turn up the speed and continue mixing the egg whites and sugar until the mixture leaves a soft, curled point for a moment after you lift the paddle. It will also appear shiny and white. This is called the soft peak stage, and it should take about 5 minutes. The egg and sugar mixture should have the consistency of royal icing or soft-serve ice cream.Tip: Try adding 2-3 drops of food coloring to the eggs and sugar if you want it all to be the same color! Sprinkle in 4 tbsp (27 g) of tylose stirring until the mixture clumps. It should only take about 2 minutes for the tylose to start hardening the egg white mixture. If your mixer starts to bog down before the tylose is fully integrated, turn the speed to high. When it’s ready, you should have a mixture that’s gummy and stiff, but still creamy. The texture will be similar to a stiff buttercream. Tylose may also be called gum tragacanth or gum -tex. Add shortening to your hands. The gum paste dough will be sticky, so before you try to knead it, coat your hands with a thin layer of vegetable shortening. In addition to keeping the dough from sticking to your hands, the shortening will help keep the gum paste from cracking as it dries. How much you use is up to you, but about 1/2 tbsp (6 g) of shortening should be plenty. Place the remaining powdered sugar and the dough on a flat surface. Take the last 1 cup (125 g) of sugar you reserved and spread it out onto your countertop or table. Then, take the dough out of the bowl and put it on top of the powdered sugar. This will make it easy to get the sugar evenly incorporated into the gum paste dough. To make cleanup easy, knead the dough on a silicone mat! Knead the gum paste until the consistency is spongy. Once all of the sugar is incorporated, the gum paste should feel slightly springy under your fingertips. It will also have a pocked appearance, rather than being smooth. Add in more sugar if the dough is too soft or too wet. Place the gum paste in a sealable plastic bag and refrigerate it overnight. In order for the gum paste to set up and have the right consistency for making decorations, you have to let it rest. Put the dough in a plastic bag and squeeze out all of the air, then place the bag in the refrigerator for 8 hours or overnight. Let the gum paste sit on your counter for about 30 minutes to bring it up to room temperature before you use it. If you have any leftover gum paste, keep it in the fridge in an airtight container. It will last for 6 months or more. You can also freeze gum paste if you need to keep it longer than 6 months. Making a Gumpaste with Gelatin Pour cold water and 2 packages of gelatin into a microwave-safe bowl. Gelatin is made up of granules that must soften before they can dissolve. To give the gelatin time to soften, allow the bowl to sit undisturbed for about 5 minutes. Each gelatin packet should contain 1 tbsp (2.5 g) of gelatin. If you use warm water, the gelatin may expand too quickly. This could prevent some of the gelatin from dissolving, which will affect the final texture of the gum paste. Add the shortening and white corn syrup to the gelatin. You'll need 2 tbsp (12 g) of shortening and ⁄3 cup (79 mL) of white corn syrup. Both the gelatin and the shortening need to be heated. The easiest way to do this is to combine them in the same bowl, then to microwave them for a few seconds. In addition, the heat will help the white corn syrup integrate into the mix more easily. Microwave the gelatin mixture for 20-30 seconds. After 20-30 seconds, take the bowl out of the microwave and stir everything together. If the shortening isn’t completely melted, microwave the mixture for another 5 seconds at a time until it is. Since you’re just heating this for a short time, regular heat is fine. If you microwave the gelatin for too long, though, you could scorch it and affect the texture. Pour 6 cups (750 g) of powdered sugar into a bowl and make a well. Measure out 6 cups (750 g) of powdered sugar, making sure your measuring cup is level each time. Once all of the sugar is in a large bowl, use your hands to dig out a small hole in the center, called a well. Add the gelatin mixture to the well gradually, stirring after each addition. Take the gelatin, shortening, and corn syrup mixture that you prepared earlier, and slowly pour it into the well you just made in the sugar. After you pour in about 1/3 of the liquid, stop and stir it in as well as you can. Then, add another third and stir again before finally adding the rest of the gelatin. Mix the remaining sugar with 3 tbsp (20 g) of tylose on your counter. To integrate the tylose into this recipe, you’ll knead it in with the remaining 2 cups (250 g) of sugar. Since you’ll be pouring the sugar onto your work surface, the easiest way to mix them together is to measure both directly onto the counter, then mix them together with your hands. If you prefer, you can mix the ingredients in a bowl, then pour them onto the counter. Put shortening on your hands, then take the dough out of the bowl. At this point, you’ll have a very wet dough. To keep it from sticking to your hands when you take it out of the bowl, put a little of the extra shortening on your hands. Then, take the dough out of the bowl and put it on top of the powdered sugar and tylose mixture on the counter. Knead the remaining sugar into the dough. Use your hands to push and roll the dough and sugar together until all of the sugar and tylose combination has been worked into the gum paste dough. As you work, you should feel the dough start to become tough and less sticky. If the dough still feels sticky once all of the sugar is incorporated, add more powdered sugar, about 1/8 cup (15 g) at a time.Tip: If your mixer has a dough hook attachment, you can use that instead of kneading the mixture by hand. Wrap the gum paste in plastic wrap and put it in a container overnight. Unlike gum paste made with egg whites, this recipe does not need to be refrigerated in order to set up. However, it does need to rest for at least 8 hours or overnight. Wrap the gum paste tightly with plastic wrap, then place it in an air-tight container somewhere that it won’t be disturbed.",
  "sentences":[
    " Mixing a Basic Gum Paste Beat 4 pasteurized egg whites for 10 seconds on high speed.",
    "Separate 4 eggs, then pour the egg whites into the bowl of your stand mixer.",
    "Fit the mixer with a paddle attachment, then beat the eggs on high speed for about 10 seconds, just long enough to break them apart.",
    "The paddle mixer will break up the eggs evenly, without whipping them too much.",
    "Since egg yolks are high in fat, if any of the yolks get into your egg whites, it could keep the mixture from reaching soft-peak stage later on.",
    "Turn the mixer to low and slowly add 7 cups (875 g) of powdered sugar.",
    "If you add the sugar all at once, the egg whites could deflate, and the mixture won’t reach soft-peak stage, which is necessary for the gum paste to become elastic.",
    "Instead, add the powdered sugar slowly, about 1 cup (125 g) at a time.",
    "Wait until each addition is fully mixed in before you add in more.",
    "Sift your sugar and make sure the measuring cup is level when you measure it out.",
    "This will ensure you get a consistent result every time.",
    "You’ll incorporate the remaining 1 cup (125 g) of powdered sugar later on.",
    "Mix the eggs and sugar on medium speed for about 5 minutes.",
    "Once all the sugar is incorporated, turn up the speed and continue mixing the egg whites and sugar until the mixture leaves a soft, curled point for a moment after you lift the paddle.",
    "It will also appear shiny and white.",
    "This is called the soft peak stage, and it should take about 5 minutes.",
    "The egg and sugar mixture should have the consistency of royal icing or soft-serve ice cream.Tip: Try adding 2-3 drops of food coloring to the eggs and sugar if you want it all to be the same color!",
    "Sprinkle in 4 tbsp (27 g) of tylose stirring until the mixture clumps.",
    "It should only take about 2 minutes for the tylose to start hardening the egg white mixture.",
    "If your mixer starts to bog down before the tylose is fully integrated, turn the speed to high.",
    "When it’s ready, you should have a mixture that’s gummy and stiff, but still creamy.",
    "The texture will be similar to a stiff buttercream.",
    "Tylose may also be called gum tragacanth or gum -tex.",
    "Add shortening to your hands.",
    "The gum paste dough will be sticky, so before you try to knead it, coat your hands with a thin layer of vegetable shortening.",
    "In addition to keeping the dough from sticking to your hands, the shortening will help keep the gum paste from cracking as it dries.",
    "How much you use is up to you, but about 1/2 tbsp (6 g) of shortening should be plenty.",
    "Place the remaining powdered sugar and the dough on a flat surface.",
    "Take the last 1 cup (125 g) of sugar you reserved and spread it out onto your countertop or table.",
    "Then, take the dough out of the bowl and put it on top of the powdered sugar.",
    "This will make it easy to get the sugar evenly incorporated into the gum paste dough.",
    "To make cleanup easy, knead the dough on a silicone mat!",
    "Knead the gum paste until the consistency is spongy.",
    "Once all of the sugar is incorporated, the gum paste should feel slightly springy under your fingertips.",
    "It will also have a pocked appearance, rather than being smooth.",
    "Add in more sugar if the dough is too soft or too wet.",
    "Place the gum paste in a sealable plastic bag and refrigerate it overnight.",
    "In order for the gum paste to set up and have the right consistency for making decorations, you have to let it rest.",
    "Put the dough in a plastic bag and squeeze out all of the air, then place the bag in the refrigerator for 8 hours or overnight.",
    "Let the gum paste sit on your counter for about 30 minutes to bring it up to room temperature before you use it.",
    "If you have any leftover gum paste, keep it in the fridge in an airtight container.",
    "It will last for 6 months or more.",
    "You can also freeze gum paste if you need to keep it longer than 6 months.",
    "Making a Gumpaste with Gelatin Pour cold water and 2 packages of gelatin into a microwave-safe bowl.",
    "Gelatin is made up of granules that must soften before they can dissolve.",
    "To give the gelatin time to soften, allow the bowl to sit undisturbed for about 5 minutes.",
    "Each gelatin packet should contain 1 tbsp (2.5 g) of gelatin.",
    "If you use warm water, the gelatin may expand too quickly.",
    "This could prevent some of the gelatin from dissolving, which will affect the final texture of the gum paste.",
    "Add the shortening and white corn syrup to the gelatin.",
    "You'll need 2 tbsp (12 g) of shortening and ⁄3 cup (79 mL) of white corn syrup.",
    "Both the gelatin and the shortening need to be heated.",
    "The easiest way to do this is to combine them in the same bowl, then to microwave them for a few seconds.",
    "In addition, the heat will help the white corn syrup integrate into the mix more easily.",
    "Microwave the gelatin mixture for 20-30 seconds.",
    "After 20-30 seconds, take the bowl out of the microwave and stir everything together.",
    "If the shortening isn’t completely melted, microwave the mixture for another 5 seconds at a time until it is.",
    "Since you’re just heating this for a short time, regular heat is fine.",
    "If you microwave the gelatin for too long, though, you could scorch it and affect the texture.",
    "Pour 6 cups (750 g) of powdered sugar into a bowl and make a well.",
    "Measure out 6 cups (750 g) of powdered sugar, making sure your measuring cup is level each time.",
    "Once all of the sugar is in a large bowl, use your hands to dig out a small hole in the center, called a well.",
    "Add the gelatin mixture to the well gradually, stirring after each addition.",
    "Take the gelatin, shortening, and corn syrup mixture that you prepared earlier, and slowly pour it into the well you just made in the sugar.",
    "After you pour in about 1/3 of the liquid, stop and stir it in as well as you can.",
    "Then, add another third and stir again before finally adding the rest of the gelatin.",
    "Mix the remaining sugar with 3 tbsp (20 g) of tylose on your counter.",
    "To integrate the tylose into this recipe, you’ll knead it in with the remaining 2 cups (250 g) of sugar.",
    "Since you’ll be pouring the sugar onto your work surface, the easiest way to mix them together is to measure both directly onto the counter, then mix them together with your hands.",
    "If you prefer, you can mix the ingredients in a bowl, then pour them onto the counter.",
    "Put shortening on your hands, then take the dough out of the bowl.",
    "At this point, you’ll have a very wet dough.",
    "To keep it from sticking to your hands when you take it out of the bowl, put a little of the extra shortening on your hands.",
    "Then, take the dough out of the bowl and put it on top of the powdered sugar and tylose mixture on the counter.",
    "Knead the remaining sugar into the dough.",
    "Use your hands to push and roll the dough and sugar together until all of the sugar and tylose combination has been worked into the gum paste dough.",
    "As you work, you should feel the dough start to become tough and less sticky.",
    "If the dough still feels sticky once all of the sugar is incorporated, add more powdered sugar, about 1/8 cup (15 g) at a time.Tip: If your mixer has a dough hook attachment, you can use that instead of kneading the mixture by hand.",
    "Wrap the gum paste in plastic wrap and put it in a container overnight.",
    "Unlike gum paste made with egg whites, this recipe does not need to be refrigerated in order to set up.",
    "However, it does need to rest for at least 8 hours or overnight.",
    "Wrap the gum paste tightly with plastic wrap, then place it in an air-tight container somewhere that it won’t be disturbed."
  ],
  "tyn_section":[
    "Mixing a Basic Gumpaste",
    "Measuring cup and spoon",
    "Stand mixer and bowl with paddle attachment",
    "Resealable plastic bag",
    "Refrigerator",
    "Large, microwave-safe bowl",
    "Spoon",
    "Microwave",
    "Stand mixer with bowl and dough hook",
    "Plastic wrap",
    "Airtight container"
  ],
  "tyn_model":[
    "sugar",
    "gelatin",
    "bowl",
    "powdered sugar",
    "eggs",
    "gum paste",
    "shortening",
    "mixer",
    "microwave",
    "white corn syrup",
    "egg",
    "tylose",
    "water",
    "plastic wrap",
    "egg whites",
    "stand mixer",
    "paddle mixer",
    "egg yolks",
    "royal icing",
    "soft-serve ice cream",
    "food coloring",
    "vegetable shortening",
    "silicone mat",
    "plastic bag",
    "refrigerator",
    "airtight container",
    "microwave-safe bowl",
    "corn syrup",
    "air-tight container"
  ],
  "simple_metrics":{
    "r":0.3636363636,
    "p":0.1379310345,
    "f1":0.2,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5454545455,
    "p":0.2068965517,
    "f1":0.3
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5454545455,
    "p":0.275862069,
    "f1":0.3664122137
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5454545455,
    "p":0.2068965517,
    "f1":0.3
  }
}