{
  "title":"How to Make a Word Search",
  "url":"https://www.wikihow.com/Make-a-Word-Search",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Puzzles and Memory Games",
    "Word Games"
  ],
  "methods":[
    {
      "name":"Selecting Your Search Words",
      "steps":[
        {
          "headline":"Decide on the theme of your word search.",
          "description":"Picking a theme for the words you want to put in your word search will make the word search seem more professional. If you are making this word search for a child, picking a theme will make the puzzle more understandable. Some example themes include: country names, animals, states, flowers, types of food, etc. If you do not want to a have a theme for your word search, you don’t have to. It is up to you what you decide to put into your word search. If you are making the word search as a gift, you could personalize the word search for the person you are making it for by using themes like, ‘names of relatives’ or ‘favorite things.’"
        },
        {
          "headline":"Select the words you want to use.",
          "description":"If you decided to go with a theme, pick words that match that theme. The number of words you choose depends on the size of your grid. Using shorter words will allow you to include more words in your puzzle. Word searches generally have 10-20 words. If you are making a very large puzzle, you could have more than that. Examples of words for the theme ‘animals’: dog, cat, monkey, elephant, fox, sloth, horse, jellyfish, donkey, lion, tiger, bear (oh my! ), giraffe, panda, cow, chinchilla, meerkat, dolphin, pig, coyote, etc."
        },
        {
          "headline":"Look up the spelling of words.",
          "description":"Do this particularly if you are using more obscure words or the names of foreign countries. Misspelling words will lead to confusion (and someone potentially giving up on your puzzle.)"
        }
      ]
    },
    {
      "name":"Making the Grid",
      "steps":[
        {
          "headline":"Leave space at the top of your page.",
          "description":"You will want to add a title to your word search once you have drawn your grid. If you have a theme, you can title your word search accordingly. If you don’t have a theme, simply write ‘Word Search’ across the top of your page. You can also make your grid on the computer. To make a grid in versions of word prior to Word 2007: Select ‘View’ at the top of the page. Select ‘Toolbars’ and make sure the ‘Drawing’ toolbar is selected. Click on ‘Draw’ (it looks like an ‘A’ with a cube and a cylinder). Click ‘Draw’ and then click ‘Grid’. A grid option box will pop up--make sure you select ‘Snap to Grid’ and then select any other options you would like for your grid. Click ‘OK’ and make your grid. To make a grid in Word 2007: Click ‘Page Layout’ at the top of the page and click the ‘Align’ list within the ‘Arrange’ grouping. Click ‘Grid settings’ and make sure ‘Snap to Grid’ is selected. Select any other options you want for your grid. Click ‘ok’ and draw your grid."
        },
        {
          "headline":"Draw a grid by hand.",
          "description":"It is easiest to make word searches when using graph paper, although you do not have to use graph paper. The standard word search box is 10 squares by 10 squares. Draw a square that is 10 centimeter (3.9 in) by 10 centimeter (3.9 in) and then make a line at each centimeter across the box. Mark each centimeter going down the box as well. You do not need to use a 10x10 grid. You can make your grid as big or as small as you like, just remember that you need to be able to draw small squares within your grid. You can make your grid into the shape of a letter (perhaps the letter of the person’s name who you are making it for?) or into an interesting shape."
        },
        {
          "headline":"Use a ruler to draw lines.",
          "description":"Use a pencil to draw the lines evenly and straightly. You need to create small, evenly-sized squares within your grid. The squares can be as big or as small as you like. If you are giving the word search to a child, you might consider making the squares larger. Making larger squares will make the puzzle a bit easier because each individual square and letter will be easier to see. To make your puzzle harder, make smaller, closer together squares."
        }
      ]
    },
    {
      "name":"Putting Your Word Search Together",
      "steps":[
        {
          "headline":"Make a list of your words.",
          "description":"Place the list next to your grid. You can label your words #1, #2 etc. if you want to. Write your words out clearly so that the person doing the word search knows exactly which word he or she is looking for."
        },
        {
          "headline":"Write all of your words into your grid.",
          "description":"Put one letter in each box. You can write them backward, forward, diagonally, and vertically. Try to evenly distribute the words throughout the grid. Get creative with your placements. Make sure to write all of the words that you have listed next to the grid so that they are actually in the puzzle. It would be very confusing to be looking for a word in the word search that isn’t actually there. Depending on who you are giving the puzzle to, you may wish to make your letters larger or smaller. If you want your puzzle to be a little less challenging, like if you are giving it to a child, you might consider writing your letters larger. If you want your puzzle to be more challenging, make your letters smaller."
        },
        {
          "headline":"Create an answer key.",
          "description":"Once you have finished writing in all the words, make a photocopy of it and highlight all of the hidden words. This will serve as your answer key so whoever does your puzzle will be able to see if they got everything right (or can get help if they are stuck on one word) without the confusion of the extra, random letters."
        },
        {
          "headline":"Fill in the rest of the blank squares.",
          "description":"Once you have written all of your chosen words into the puzzle, fill the still empty squares with random letters. Doing this distracts the person from finding the words in the search. Make sure that you do not accidentally make other words out of your extra letters, especially other words that fit into your theme. This will be very confusing for the person doing the puzzle."
        },
        {
          "headline":"Make copies.",
          "description":"Only do this if you are planning on giving your word search to more than one person."
        }
      ]
    }
  ],
  "text":" Selecting Your Search Words Decide on the theme of your word search. Picking a theme for the words you want to put in your word search will make the word search seem more professional. If you are making this word search for a child, picking a theme will make the puzzle more understandable. Some example themes include: country names, animals, states, flowers, types of food, etc. If you do not want to a have a theme for your word search, you don’t have to. It is up to you what you decide to put into your word search. If you are making the word search as a gift, you could personalize the word search for the person you are making it for by using themes like, ‘names of relatives’ or ‘favorite things.’ Select the words you want to use. If you decided to go with a theme, pick words that match that theme. The number of words you choose depends on the size of your grid. Using shorter words will allow you to include more words in your puzzle. Word searches generally have 10-20 words. If you are making a very large puzzle, you could have more than that. Examples of words for the theme ‘animals’: dog, cat, monkey, elephant, fox, sloth, horse, jellyfish, donkey, lion, tiger, bear (oh my! ), giraffe, panda, cow, chinchilla, meerkat, dolphin, pig, coyote, etc. Look up the spelling of words. Do this particularly if you are using more obscure words or the names of foreign countries. Misspelling words will lead to confusion (and someone potentially giving up on your puzzle.) Making the Grid Leave space at the top of your page. You will want to add a title to your word search once you have drawn your grid. If you have a theme, you can title your word search accordingly. If you don’t have a theme, simply write ‘Word Search’ across the top of your page. You can also make your grid on the computer. To make a grid in versions of word prior to Word 2007: Select ‘View’ at the top of the page. Select ‘Toolbars’ and make sure the ‘Drawing’ toolbar is selected. Click on ‘Draw’ (it looks like an ‘A’ with a cube and a cylinder). Click ‘Draw’ and then click ‘Grid’. A grid option box will pop up--make sure you select ‘Snap to Grid’ and then select any other options you would like for your grid. Click ‘OK’ and make your grid. To make a grid in Word 2007: Click ‘Page Layout’ at the top of the page and click the ‘Align’ list within the ‘Arrange’ grouping. Click ‘Grid settings’ and make sure ‘Snap to Grid’ is selected. Select any other options you want for your grid. Click ‘ok’ and draw your grid. Draw a grid by hand. It is easiest to make word searches when using graph paper, although you do not have to use graph paper. The standard word search box is 10 squares by 10 squares. Draw a square that is 10 centimeter (3.9 in) by 10 centimeter (3.9 in) and then make a line at each centimeter across the box. Mark each centimeter going down the box as well. You do not need to use a 10x10 grid. You can make your grid as big or as small as you like, just remember that you need to be able to draw small squares within your grid. You can make your grid into the shape of a letter (perhaps the letter of the person’s name who you are making it for?) or into an interesting shape. Use a ruler to draw lines. Use a pencil to draw the lines evenly and straightly. You need to create small, evenly-sized squares within your grid. The squares can be as big or as small as you like. If you are giving the word search to a child, you might consider making the squares larger. Making larger squares will make the puzzle a bit easier because each individual square and letter will be easier to see. To make your puzzle harder, make smaller, closer together squares. Putting Your Word Search Together Make a list of your words. Place the list next to your grid. You can label your words #1, #2 etc. if you want to. Write your words out clearly so that the person doing the word search knows exactly which word he or she is looking for. Write all of your words into your grid. Put one letter in each box. You can write them backward, forward, diagonally, and vertically. Try to evenly distribute the words throughout the grid. Get creative with your placements. Make sure to write all of the words that you have listed next to the grid so that they are actually in the puzzle. It would be very confusing to be looking for a word in the word search that isn’t actually there. Depending on who you are giving the puzzle to, you may wish to make your letters larger or smaller. If you want your puzzle to be a little less challenging, like if you are giving it to a child, you might consider writing your letters larger. If you want your puzzle to be more challenging, make your letters smaller. Create an answer key. Once you have finished writing in all the words, make a photocopy of it and highlight all of the hidden words. This will serve as your answer key so whoever does your puzzle will be able to see if they got everything right (or can get help if they are stuck on one word) without the confusion of the extra, random letters. Fill in the rest of the blank squares. Once you have written all of your chosen words into the puzzle, fill the still empty squares with random letters. Doing this distracts the person from finding the words in the search. Make sure that you do not accidentally make other words out of your extra letters, especially other words that fit into your theme. This will be very confusing for the person doing the puzzle. Make copies. Only do this if you are planning on giving your word search to more than one person.",
  "sentences":[
    " Selecting Your Search Words Decide on the theme of your word search.",
    "Picking a theme for the words you want to put in your word search will make the word search seem more professional.",
    "If you are making this word search for a child, picking a theme will make the puzzle more understandable.",
    "Some example themes include: country names, animals, states, flowers, types of food, etc.",
    "If you do not want to a have a theme for your word search, you don’t have to.",
    "It is up to you what you decide to put into your word search.",
    "If you are making the word search as a gift, you could personalize the word search for the person you are making it for by using themes like, ‘names of relatives’ or ‘favorite things.’ Select the words you want to use.",
    "If you decided to go with a theme, pick words that match that theme.",
    "The number of words you choose depends on the size of your grid.",
    "Using shorter words will allow you to include more words in your puzzle.",
    "Word searches generally have 10-20 words.",
    "If you are making a very large puzzle, you could have more than that.",
    "Examples of words for the theme ‘animals’: dog, cat, monkey, elephant, fox, sloth, horse, jellyfish, donkey, lion, tiger, bear (oh my!",
    "), giraffe, panda, cow, chinchilla, meerkat, dolphin, pig, coyote, etc.",
    "Look up the spelling of words.",
    "Do this particularly if you are using more obscure words or the names of foreign countries.",
    "Misspelling words will lead to confusion (and someone potentially giving up on your puzzle.)",
    "Making the Grid Leave space at the top of your page.",
    "You will want to add a title to your word search once you have drawn your grid.",
    "If you have a theme, you can title your word search accordingly.",
    "If you don’t have a theme, simply write ‘Word Search’ across the top of your page.",
    "You can also make your grid on the computer.",
    "To make a grid in versions of word prior to Word 2007: Select ‘View’ at the top of the page.",
    "Select ‘Toolbars’ and make sure the ‘Drawing’ toolbar is selected.",
    "Click on ‘Draw’ (it looks like an ‘A’ with a cube and a cylinder).",
    "Click ‘Draw’ and then click ‘Grid’.",
    "A grid option box will pop up--make sure you select ‘Snap to Grid’ and then select any other options you would like for your grid.",
    "Click ‘OK’ and make your grid.",
    "To make a grid in Word 2007: Click ‘Page Layout’ at the top of the page and click the ‘Align’ list within the ‘Arrange’ grouping.",
    "Click ‘Grid settings’ and make sure ‘Snap to Grid’ is selected.",
    "Select any other options you want for your grid.",
    "Click ‘ok’ and draw your grid.",
    "Draw a grid by hand.",
    "It is easiest to make word searches when using graph paper, although you do not have to use graph paper.",
    "The standard word search box is 10 squares by 10 squares.",
    "Draw a square that is 10 centimeter (3.9 in) by 10 centimeter (3.9 in) and then make a line at each centimeter across the box.",
    "Mark each centimeter going down the box as well.",
    "You do not need to use a 10x10 grid.",
    "You can make your grid as big or as small as you like, just remember that you need to be able to draw small squares within your grid.",
    "You can make your grid into the shape of a letter (perhaps the letter of the person’s name who you are making it for?)",
    "or into an interesting shape.",
    "Use a ruler to draw lines.",
    "Use a pencil to draw the lines evenly and straightly.",
    "You need to create small, evenly-sized squares within your grid.",
    "The squares can be as big or as small as you like.",
    "If you are giving the word search to a child, you might consider making the squares larger.",
    "Making larger squares will make the puzzle a bit easier because each individual square and letter will be easier to see.",
    "To make your puzzle harder, make smaller, closer together squares.",
    "Putting Your Word Search Together Make a list of your words.",
    "Place the list next to your grid.",
    "You can label your words #1, #2 etc.",
    "if you want to.",
    "Write your words out clearly so that the person doing the word search knows exactly which word he or she is looking for.",
    "Write all of your words into your grid.",
    "Put one letter in each box.",
    "You can write them backward, forward, diagonally, and vertically.",
    "Try to evenly distribute the words throughout the grid.",
    "Get creative with your placements.",
    "Make sure to write all of the words that you have listed next to the grid so that they are actually in the puzzle.",
    "It would be very confusing to be looking for a word in the word search that isn’t actually there.",
    "Depending on who you are giving the puzzle to, you may wish to make your letters larger or smaller.",
    "If you want your puzzle to be a little less challenging, like if you are giving it to a child, you might consider writing your letters larger.",
    "If you want your puzzle to be more challenging, make your letters smaller.",
    "Create an answer key.",
    "Once you have finished writing in all the words, make a photocopy of it and highlight all of the hidden words.",
    "This will serve as your answer key so whoever does your puzzle will be able to see if they got everything right (or can get help if they are stuck on one word) without the confusion of the extra, random letters.",
    "Fill in the rest of the blank squares.",
    "Once you have written all of your chosen words into the puzzle, fill the still empty squares with random letters.",
    "Doing this distracts the person from finding the words in the search.",
    "Make sure that you do not accidentally make other words out of your extra letters, especially other words that fit into your theme.",
    "This will be very confusing for the person doing the puzzle.",
    "Make copies.",
    "Only do this if you are planning on giving your word search to more than one person."
  ],
  "tyn_section":[
    "Pen or Pencil",
    "Paper",
    "Eraser",
    "Ruler"
  ],
  "tyn_model":[
    "’ and",
    "’ at",
    "‘draw",
    "‘grid",
    "‘snap",
    "‘ok",
    "graph paper",
    "‘names",
    "’ or",
    "‘favorite",
    "’ select",
    "‘animals",
    "’:",
    "horse",
    "lion",
    "tiger",
    "bear",
    "cow",
    "dolphin",
    "pig",
    "‘word",
    "’ across",
    "‘view",
    "‘toolbars",
    "‘drawing",
    "’ toolbar",
    "’ (",
    "‘a",
    "’ with",
    "’.",
    "word 2007",
    "‘page",
    "‘align",
    "’ list",
    "‘arrange",
    "’ grouping",
    "’ is",
    "ruler",
    "pencil"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0256410256,
    "f1":0.0465116279,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0512820513,
    "f1":0.0930232558
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.0769230769,
    "f1":0.1395348837
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0256410256,
    "f1":0.0465116279
  }
}