{
  "title":"How to Make Korean Sweet Potato Cake",
  "url":"https://www.wikihow.com/Make-Korean-Sweet-Potato-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Vegetable Cakes"
  ],
  "steps":[
    {
      "headline":"Fill a medium sized stock, soup or multi-cooking pot with 1.5 lbs of Korean sweet potatoes (unpeeled).",
      "description":""
    },
    {
      "headline":"Cover with already hot water (to speed up the boiling process) so that the Korean sweet potatoes are resting about one inch below the surface.",
      "description":""
    },
    {
      "headline":"Bring Korean sweet potatoes to a boil and let cook for 25 minutes.",
      "description":""
    },
    {
      "headline":"While the Korean sweet potatoes are cooking, cut the sponge cake lengthwise in three parts.",
      "description":"Two of these parts will be used to layer the cake and the other will be ground in the mixer."
    },
    {
      "headline":"Take two layer ready pieces of sponge cake and cut them to fit your mousse ring.",
      "description":""
    },
    {
      "headline":"For the left over layer, cut off the outer brown edges and separate by hand or in a mixer into small, soft chunks.",
      "description":""
    },
    {
      "headline":"To make the custard cream, take your microwaveable bowl and mix in eggs and sugar",
      "description":""
    },
    {
      "headline":"Put milk into the mixture and stir with a wooden spoon",
      "description":""
    },
    {
      "headline":"Then, put flour in and blend well with a wire whisk",
      "description":""
    },
    {
      "headline":"Microwave for 2 1/2 minutes, then stir and repeat microwaving for 2 1/2 minutes.",
      "description":""
    },
    {
      "headline":"The cream may be clustered together, if so, stir with the whisk to make sure texture becomes smooth.",
      "description":""
    },
    {
      "headline":"While your cream is still warm, mix in softened butter.",
      "description":"Put the cream aside to be used in potato mousse."
    },
    {
      "headline":"By this time, your Korean sweet potatoes should be ready.",
      "description":"Take them out of the stock, soup, or multi-cook pot and dump contents into a colander. Immediately put potatoes back into the stock pot and mash while the potatoes are still hot."
    },
    {
      "headline":"Let the sweet potato mash cool and mix with custard cream and heavy cream.",
      "description":""
    },
    {
      "headline":"While the sweet potato mixture is settling, take out a small sauce pot and boil 3 cups of water, sugar, and coffee together and stir until well blended.",
      "description":"Cool and put aside for later. This will be the syrup for layering."
    },
    {
      "headline":"To assemble the cake, take one of the two sponge cakes and position it into the mousse ring.",
      "description":"(Note, you should have already cut it to fit the mousse ring earlier)."
    },
    {
      "headline":"Evenly layer a portion of the syrup just made onto the surface of the sponge cake.",
      "description":""
    },
    {
      "headline":"Take sweet potato mash and use one half to make a even layer on top of the syrup.",
      "description":""
    },
    {
      "headline":"Repeat the previous two steps.",
      "description":""
    },
    {
      "headline":"Put cake in plastic and cool for 3 hours.",
      "description":"Once cool, take cake and separate from the mousse ring."
    },
    {
      "headline":"Transfer cake to platter and layer whipped cream over all sides of the cake, lightly.",
      "description":""
    },
    {
      "headline":"To taste, sprinkle the ground sponge cake on top of the whipped cream layer.",
      "description":""
    },
    {
      "headline":"Serve and enjoy!",
      "description":""
    }
  ],
  "text":" Fill a medium sized stock, soup or multi-cooking pot with 1.5 lbs of Korean sweet potatoes (unpeeled).  Cover with already hot water (to speed up the boiling process) so that the Korean sweet potatoes are resting about one inch below the surface.  Bring Korean sweet potatoes to a boil and let cook for 25 minutes.  While the Korean sweet potatoes are cooking, cut the sponge cake lengthwise in three parts. Two of these parts will be used to layer the cake and the other will be ground in the mixer. Take two layer ready pieces of sponge cake and cut them to fit your mousse ring.  For the left over layer, cut off the outer brown edges and separate by hand or in a mixer into small, soft chunks.  To make the custard cream, take your microwaveable bowl and mix in eggs and sugar  Put milk into the mixture and stir with a wooden spoon  Then, put flour in and blend well with a wire whisk  Microwave for 2 1/2 minutes, then stir and repeat microwaving for 2 1/2 minutes.  The cream may be clustered together, if so, stir with the whisk to make sure texture becomes smooth.  While your cream is still warm, mix in softened butter. Put the cream aside to be used in potato mousse. By this time, your Korean sweet potatoes should be ready. Take them out of the stock, soup, or multi-cook pot and dump contents into a colander. Immediately put potatoes back into the stock pot and mash while the potatoes are still hot. Let the sweet potato mash cool and mix with custard cream and heavy cream.  While the sweet potato mixture is settling, take out a small sauce pot and boil 3 cups of water, sugar, and coffee together and stir until well blended. Cool and put aside for later. This will be the syrup for layering. To assemble the cake, take one of the two sponge cakes and position it into the mousse ring. (Note, you should have already cut it to fit the mousse ring earlier). Evenly layer a portion of the syrup just made onto the surface of the sponge cake.  Take sweet potato mash and use one half to make a even layer on top of the syrup.  Repeat the previous two steps.  Put cake in plastic and cool for 3 hours. Once cool, take cake and separate from the mousse ring. Transfer cake to platter and layer whipped cream over all sides of the cake, lightly.  To taste, sprinkle the ground sponge cake on top of the whipped cream layer.  Serve and enjoy! ",
  "sentences":[
    " Fill a medium sized stock, soup or multi-cooking pot with 1.5 lbs of Korean sweet potatoes (unpeeled).",
    "Cover with already hot water (to speed up the boiling process) so that the Korean sweet potatoes are resting about one inch below the surface.",
    "Bring Korean sweet potatoes to a boil and let cook for 25 minutes.",
    "While the Korean sweet potatoes are cooking, cut the sponge cake lengthwise in three parts.",
    "Two of these parts will be used to layer the cake and the other will be ground in the mixer.",
    "Take two layer ready pieces of sponge cake and cut them to fit your mousse ring.",
    "For the left over layer, cut off the outer brown edges and separate by hand or in a mixer into small, soft chunks.",
    "To make the custard cream, take your microwaveable bowl and mix in eggs and sugar  Put milk into the mixture and stir with a wooden spoon  Then, put flour in and blend well with a wire whisk  Microwave for 2 1/2 minutes, then stir and repeat microwaving for 2 1/2 minutes.",
    "The cream may be clustered together, if so, stir with the whisk to make sure texture becomes smooth.",
    "While your cream is still warm, mix in softened butter.",
    "Put the cream aside to be used in potato mousse.",
    "By this time, your Korean sweet potatoes should be ready.",
    "Take them out of the stock, soup, or multi-cook pot and dump contents into a colander.",
    "Immediately put potatoes back into the stock pot and mash while the potatoes are still hot.",
    "Let the sweet potato mash cool and mix with custard cream and heavy cream.",
    "While the sweet potato mixture is settling, take out a small sauce pot and boil 3 cups of water, sugar, and coffee together and stir until well blended.",
    "Cool and put aside for later.",
    "This will be the syrup for layering.",
    "To assemble the cake, take one of the two sponge cakes and position it into the mousse ring.",
    "(Note, you should have already cut it to fit the mousse ring earlier).",
    "Evenly layer a portion of the syrup just made onto the surface of the sponge cake.",
    "Take sweet potato mash and use one half to make a even layer on top of the syrup.",
    "Repeat the previous two steps.",
    "Put cake in plastic and cool for 3 hours.",
    "Once cool, take cake and separate from the mousse ring.",
    "Transfer cake to platter and layer whipped cream over all sides of the cake, lightly.",
    "To taste, sprinkle the ground sponge cake on top of the whipped cream layer.",
    "Serve and enjoy!"
  ],
  "tyn_section":[
    "Wire whisk",
    "Microwavable safe mixing bowl",
    "Wooden spoon",
    "Plastic wrap",
    "Platter to transfer cake when finished",
    "Gas or electric stove",
    "Stock, soup, or multi-pot",
    "Strainer or colander",
    "Small sauce pot",
    "Toothpick or fork",
    "Searing knife",
    "Kitchen-aid mixer (optional)"
  ],
  "tyn_model":[
    "sponge cake",
    "sweet potatoes",
    "cream",
    "sweet potato",
    "korean sweet potatoes",
    "water",
    "mixer",
    "custard cream",
    "sugar",
    "potatoes",
    "whipped cream",
    "medium sized stock, soup or multi-cooking pot",
    "microwaveable bowl",
    "eggs",
    "milk",
    "wooden spoon",
    "flour",
    "wire whisk",
    "whisk",
    "butter",
    "stock",
    "multi-cook pot",
    "colander",
    "stock pot",
    "heavy cream",
    "small sauce pot",
    "coffee",
    "plastic"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.1071428571,
    "f1":0.15,
    "avg_pos":0.6071428571
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1785714286,
    "f1":0.2325581395
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.1071428571,
    "f1":0.15
  }
}