{
  "title":"How to Make an Art Kit",
  "url":"https://www.wikihow.com/Make-an-Art-Kit",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Making an Adult Kit",
      "steps":[
        {
          "headline":"Decide what you will put everything in.",
          "description":"Choose something easy to carry around with you, especially if you want to do art on location or you are taking classes. You could use anything from a shoe box to an old briefcase. Choose an ample container. You are likely to acquire more art supplies as you continue. Plan to protect the supplies that are sensitive. A hard sided pencil case or simply a tin or shoe box can keep pencils and other delicate items from breaking. Give some thought to how you will carry paints, brushes, and whatever you will use to clean them, especially if you're painting away from home."
        },
        {
          "headline":"Find or buy some basic equipment.",
          "description":"Here's a list of what you might need with a rough estimated price. You will not need all of these items; just select what you would like to use and then build up your kit as you go along. You can always add to it later. Pencil Set/£3-5\nPens/£1\nSketchbook/£3-4\nOil Pastels/£2-4\nDry Pastels/£2-4\nAcrylic paint set/£4-7\nPaint Brushes/£1\nWater Soluble Pencils/£3-4\nColouring Pencils/£3-4\nGlue/£1-2\nScalpel/£3-5\nMetal Ruler\nPencil sharpener. A small, handheld one will travel well. Clay"
        }
      ]
    },
    {
      "name":"Making a Child's Kit",
      "steps":[
        {
          "headline":"A child's kit is extremely easy to make, since children are naturally creative and they will use just about anything.",
          "description":"Here's a child's list to get started. Colouring Book/£1\nSafety Scissors/£1\nColouring Pencils/£3\nPipe cleaners and other items like that/£1\nNon-toxic glue\nSketchbook/£1\nPlay-doh\nMarkers"
        },
        {
          "headline":"Include a cheap plastic tablecloth or oilcloth in a child's kit and explain to Mom and Dad that it's to go underneath anything messy: paint, clay, glue, etc.",
          "description":"Plastic tablecloths easily cover the whole table and they come large enough for several friends or even the whole scout troop to gather around."
        },
        {
          "headline":"With this child's kit it's really up to you.",
          "description":"Use anything age-appropriate that they can't hurt themselves with."
        }
      ]
    }
  ],
  "text":" Making an Adult Kit Decide what you will put everything in. Choose something easy to carry around with you, especially if you want to do art on location or you are taking classes. You could use anything from a shoe box to an old briefcase. Choose an ample container. You are likely to acquire more art supplies as you continue. Plan to protect the supplies that are sensitive. A hard sided pencil case or simply a tin or shoe box can keep pencils and other delicate items from breaking. Give some thought to how you will carry paints, brushes, and whatever you will use to clean them, especially if you're painting away from home. Find or buy some basic equipment. Here's a list of what you might need with a rough estimated price. You will not need all of these items; just select what you would like to use and then build up your kit as you go along. You can always add to it later. Pencil Set/£3-5\nPens/£1\nSketchbook/£3-4\nOil Pastels/£2-4\nDry Pastels/£2-4\nAcrylic paint set/£4-7\nPaint Brushes/£1\nWater Soluble Pencils/£3-4\nColouring Pencils/£3-4\nGlue/£1-2\nScalpel/£3-5\nMetal Ruler\nPencil sharpener. A small, handheld one will travel well. Clay Making a Child's Kit A child's kit is extremely easy to make, since children are naturally creative and they will use just about anything. Here's a child's list to get started. Colouring Book/£1\nSafety Scissors/£1\nColouring Pencils/£3\nPipe cleaners and other items like that/£1\nNon-toxic glue\nSketchbook/£1\nPlay-doh\nMarkers Include a cheap plastic tablecloth or oilcloth in a child's kit and explain to Mom and Dad that it's to go underneath anything messy: paint, clay, glue, etc. Plastic tablecloths easily cover the whole table and they come large enough for several friends or even the whole scout troop to gather around. With this child's kit it's really up to you. Use anything age-appropriate that they can't hurt themselves with.",
  "sentences":[
    " Making an Adult Kit Decide what you will put everything in.",
    "Choose something easy to carry around with you, especially if you want to do art on location or you are taking classes.",
    "You could use anything from a shoe box to an old briefcase.",
    "Choose an ample container.",
    "You are likely to acquire more art supplies as you continue.",
    "Plan to protect the supplies that are sensitive.",
    "A hard sided pencil case or simply a tin or shoe box can keep pencils and other delicate items from breaking.",
    "Give some thought to how you will carry paints, brushes, and whatever you will use to clean them, especially if you're painting away from home.",
    "Find or buy some basic equipment.",
    "Here's a list of what you might need with a rough estimated price.",
    "You will not need all of these items; just select what you would like to use and then build up your kit as you go along.",
    "You can always add to it later.",
    "Pencil Set/£3-5\nPens/£1\nSketchbook/£3-4\nOil Pastels/£2-4\nDry Pastels/£2-4\nAcrylic paint set/£4-7\nPaint Brushes/£1\nWater Soluble Pencils/£3-4\nColouring Pencils/£3-4\nGlue/£1-2\nScalpel/£3-5\nMetal Ruler\nPencil sharpener.",
    "A small, handheld one will travel well.",
    "Clay Making a Child's Kit A child's kit is extremely easy to make, since children are naturally creative and they will use just about anything.",
    "Here's a child's list to get started.",
    "Colouring Book/£1\nSafety Scissors/£1\nColouring Pencils/£3\nPipe cleaners and other items like that/£1\nNon-toxic glue\nSketchbook/£1\nPlay-doh\nMarkers Include a cheap plastic tablecloth or oilcloth in a child's kit and explain to Mom and Dad that it's to go underneath anything messy: paint, clay, glue, etc.",
    "Plastic tablecloths easily cover the whole table and they come large enough for several friends or even the whole scout troop to gather around.",
    "With this child's kit it's really up to you.",
    "Use anything age-appropriate that they can't hurt themselves with."
  ],
  "tyn_section":[
    "Art supplies",
    "Box or bag",
    "Money"
  ],
  "tyn_model":[
    "colouring pencils/£3",
    "glue",
    "shoe box",
    "art supplies",
    "pencil case",
    "paints",
    "brushes",
    "pencil",
    "oil pastels/£2",
    "acrylic paint",
    "paint brushes/£1",
    "water soluble pencils/£3",
    "metal ruler",
    "pencil sharpener",
    "clay",
    "colouring book/£1",
    "safety scissors/£1",
    "pipe cleaners",
    "play-doh\nmarkers",
    "paint"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.05,
    "f1":0.0869565217,
    "avg_pos":0.15
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.05,
    "f1":0.0869565217
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.05,
    "f1":0.0869565217
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.05,
    "f1":0.0869565217
  }
}