{
  "title":"How to Make a Decorative Slate",
  "url":"https://www.wikihow.com/Make-a-Decorative-Slate",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Obtain a roofing slate.",
      "description":"You can purchase it at a local roofing supply house, or check listings for used slate from old houses, barns, etc., or you can go to a chain craft store if you are only looking to make one. Any more than one can be costly at a craft store. All full size roofing slates have the two holes in them. You can either cut around them or fill them in with epoxy and paint over them."
    },
    {
      "headline":"Decide what size you want your slate to be and if you want it to hang vertical or horizontal.",
      "description":"Once you know, turn the slate over to the back side and begin to measure it out to your desired size with your t square and marker. Couple of things here. You MUST do this on the back side of the slate (that's the flattest side), since this is the side you will be cutting from(never cut from the front), and also when using a t square you need to make sure the edges of the slate are straight to line the t square up properly or the whole thing will be off. Usually this is not an issue unless the slate has been used already."
    },
    {
      "headline":"After you have measured your slate to the desired size place the slate(back of slate facing up toward you) on the slate cutter, and line the edge of the blade up with you line to be cut.",
      "description":"This is very tricky and please make sure you watch your figures, so that they don't get caught under the cutter blade.Hold the slate firmly in place with one hand and with the other begin to depress the cutter bar in a slow but steady fashion. Continue cutting until slate is the desired size. NOTE: If slate is hard to cut, or if it keeps breaking, your blade may need to be sharpened. (Safety goggles and mask should be worn.)"
    },
    {
      "headline":"If your slate is going to be a hanging slate now is when you want to drill the holes.",
      "description":"Take your t square and measure out the holes. Mark with a marker."
    },
    {
      "headline":"Begin to drill the holes.",
      "description":"Hang slate over the edge of a table or counter, and then hold slate with one hand while drilling with the other. This picture is not the best example. It was just one person who needed to take the picture too. Not enough hands."
    },
    {
      "headline":"At this point the slate is pretty dusty, so you will want to wipe it down with a damp cloth.",
      "description":""
    },
    {
      "headline":"The next step is to put a base coat on the slate.",
      "description":"It can be a background color that you will be using or any old color you are going to paint over. If you don't want to use a base coat that's okay, but just know that it will be harder to paint straight lines because of the natural surface of the slate."
    },
    {
      "headline":"Draw your design on the slate with a pencil.",
      "description":"Make sure to use your t square and ruler to mark out any border you may have, words, or any other object that may need to be straight or centered."
    },
    {
      "headline":"Your colors should have been chosen, because now it's time to paint!",
      "description":"Keep a few things in mind before you begin:\nMake sure that your idea is a well thought out idea, and that you have the skill to paint it. However, if you're not the next Picasso no worries, do something that is simpler and within your means, or use a stencil. Slates are the perfect format to stencil on. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/43\\/Make-a-Decorative-Slate-Step-9Bullet1.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/43\\/Make-a-Decorative-Slate-Step-9Bullet1.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse a good paint brushes to ensure clean edges. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/00\\/Make-a-Decorative-Slate-Step-9Bullet2.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/00\\/Make-a-Decorative-Slate-Step-9Bullet2.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse a better quality acrylic paint. You want to avoid paints that are clumpy or are too thin, because they don't cover that well and are hard to control. Paint brushes and paint can be purchased at your local craft store or on line. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Make-a-Decorative-Slate-Step-9Bullet3.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Make-a-Decorative-Slate-Step-9Bullet3.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"You can leave it the way it is or add words in the grass area.",
      "description":"EX. God Bless America or  personalize it \"The (Last Names)\"."
    },
    {
      "headline":"Once you are finished painting and you are satisfied with your work of art make sure any remaining pencil marks are erased.",
      "description":"Take the slate to a well ventilated area (preferably outside) lay it on a protected surface and get your mask back on. This is the part where you are going to seal it with a clear acrylic spray paint for protection, especially if it is going to be outside. Put several coats on just to be extra sure. NOTE: There are three types of finish with clear acrylic spray paint. Glossy, Satin, and Matte. Glossy really makes all the colors pop."
    },
    {
      "headline":"Spray slate with clear acrylic spray paint for protection.",
      "description":""
    },
    {
      "headline":"Wait for it to dry.",
      "description":"If this is a lawn and garden slate, at this point you are ready to put it in your wrought iron slate holder."
    },
    {
      "headline":"If this is a hanging slate then now is when you want to thread it with the leather cord.",
      "description":"Measure you leather cord out to be cut. For a slate this size,  you would want to measure the cord about 15 inches (38.1 cm). Once you have done that thread one end of the cord through the back of the slate and tie in a Knot in the front."
    },
    {
      "headline":"Repeat on the other side and then your slate is ready to hang.",
      "description":""
    },
    {
      "headline":"Stand back and admire your hard work.",
      "description":"These make wonderful gifts for friends and family. Plus, the possibilities of what you can paint are endless."
    }
  ],
  "text":" Obtain a roofing slate. You can purchase it at a local roofing supply house, or check listings for used slate from old houses, barns, etc., or you can go to a chain craft store if you are only looking to make one. Any more than one can be costly at a craft store. All full size roofing slates have the two holes in them. You can either cut around them or fill them in with epoxy and paint over them. Decide what size you want your slate to be and if you want it to hang vertical or horizontal. Once you know, turn the slate over to the back side and begin to measure it out to your desired size with your t square and marker. Couple of things here. You MUST do this on the back side of the slate (that's the flattest side), since this is the side you will be cutting from(never cut from the front), and also when using a t square you need to make sure the edges of the slate are straight to line the t square up properly or the whole thing will be off. Usually this is not an issue unless the slate has been used already. After you have measured your slate to the desired size place the slate(back of slate facing up toward you) on the slate cutter, and line the edge of the blade up with you line to be cut. This is very tricky and please make sure you watch your figures, so that they don't get caught under the cutter blade.Hold the slate firmly in place with one hand and with the other begin to depress the cutter bar in a slow but steady fashion. Continue cutting until slate is the desired size. NOTE: If slate is hard to cut, or if it keeps breaking, your blade may need to be sharpened. (Safety goggles and mask should be worn.) If your slate is going to be a hanging slate now is when you want to drill the holes. Take your t square and measure out the holes. Mark with a marker. Begin to drill the holes. Hang slate over the edge of a table or counter, and then hold slate with one hand while drilling with the other. This picture is not the best example. It was just one person who needed to take the picture too. Not enough hands. At this point the slate is pretty dusty, so you will want to wipe it down with a damp cloth.  The next step is to put a base coat on the slate. It can be a background color that you will be using or any old color you are going to paint over. If you don't want to use a base coat that's okay, but just know that it will be harder to paint straight lines because of the natural surface of the slate. Draw your design on the slate with a pencil. Make sure to use your t square and ruler to mark out any border you may have, words, or any other object that may need to be straight or centered. Your colors should have been chosen, because now it's time to paint! Keep a few things in mind before you begin:\nMake sure that your idea is a well thought out idea, and that you have the skill to paint it. However, if you're not the next Picasso no worries, do something that is simpler and within your means, or use a stencil. Slates are the perfect format to stencil on. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/43\\/Make-a-Decorative-Slate-Step-9Bullet1.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/43\\/Make-a-Decorative-Slate-Step-9Bullet1.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse a good paint brushes to ensure clean edges. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/00\\/Make-a-Decorative-Slate-Step-9Bullet2.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/00\\/Make-a-Decorative-Slate-Step-9Bullet2.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse a better quality acrylic paint. You want to avoid paints that are clumpy or are too thin, because they don't cover that well and are hard to control. Paint brushes and paint can be purchased at your local craft store or on line. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Make-a-Decorative-Slate-Step-9Bullet3.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Make-a-Decorative-Slate-Step-9Bullet3.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} You can leave it the way it is or add words in the grass area. EX. God Bless America or  personalize it \"The (Last Names)\". Once you are finished painting and you are satisfied with your work of art make sure any remaining pencil marks are erased. Take the slate to a well ventilated area (preferably outside) lay it on a protected surface and get your mask back on. This is the part where you are going to seal it with a clear acrylic spray paint for protection, especially if it is going to be outside. Put several coats on just to be extra sure. NOTE: There are three types of finish with clear acrylic spray paint. Glossy, Satin, and Matte. Glossy really makes all the colors pop. Spray slate with clear acrylic spray paint for protection.  Wait for it to dry. If this is a lawn and garden slate, at this point you are ready to put it in your wrought iron slate holder. If this is a hanging slate then now is when you want to thread it with the leather cord. Measure you leather cord out to be cut. For a slate this size,  you would want to measure the cord about 15 inches (38.1 cm). Once you have done that thread one end of the cord through the back of the slate and tie in a Knot in the front. Repeat on the other side and then your slate is ready to hang.  Stand back and admire your hard work. These make wonderful gifts for friends and family. Plus, the possibilities of what you can paint are endless.",
  "sentences":[
    " Obtain a roofing slate.",
    "You can purchase it at a local roofing supply house, or check listings for used slate from old houses, barns, etc., or you can go to a chain craft store if you are only looking to make one.",
    "Any more than one can be costly at a craft store.",
    "All full size roofing slates have the two holes in them.",
    "You can either cut around them or fill them in with epoxy and paint over them.",
    "Decide what size you want your slate to be and if you want it to hang vertical or horizontal.",
    "Once you know, turn the slate over to the back side and begin to measure it out to your desired size with your t square and marker.",
    "Couple of things here.",
    "You MUST do this on the back side of the slate (that's the flattest side), since this is the side you will be cutting from(never cut from the front), and also when using a t square you need to make sure the edges of the slate are straight to line the t square up properly or the whole thing will be off.",
    "Usually this is not an issue unless the slate has been used already.",
    "After you have measured your slate to the desired size place the slate(back of slate facing up toward you) on the slate cutter, and line the edge of the blade up with you line to be cut.",
    "This is very tricky and please make sure you watch your figures, so that they don't get caught under the cutter blade.Hold the slate firmly in place with one hand and with the other begin to depress the cutter bar in a slow but steady fashion.",
    "Continue cutting until slate is the desired size.",
    "NOTE: If slate is hard to cut, or if it keeps breaking, your blade may need to be sharpened.",
    "(Safety goggles and mask should be worn.)",
    "If your slate is going to be a hanging slate now is when you want to drill the holes.",
    "Take your t square and measure out the holes.",
    "Mark with a marker.",
    "Begin to drill the holes.",
    "Hang slate over the edge of a table or counter, and then hold slate with one hand while drilling with the other.",
    "This picture is not the best example.",
    "It was just one person who needed to take the picture too.",
    "Not enough hands.",
    "At this point the slate is pretty dusty, so you will want to wipe it down with a damp cloth.",
    "The next step is to put a base coat on the slate.",
    "It can be a background color that you will be using or any old color you are going to paint over.",
    "If you don't want to use a base coat that's okay, but just know that it will be harder to paint straight lines because of the natural surface of the slate.",
    "Draw your design on the slate with a pencil.",
    "Make sure to use your t square and ruler to mark out any border you may have, words, or any other object that may need to be straight or centered.",
    "Your colors should have been chosen, because now it's time to paint!",
    "Keep a few things in mind before you begin:\nMake sure that your idea is a well thought out idea, and that you have the skill to paint it.",
    "However, if you're not the next Picasso no worries, do something that is simpler and within your means, or use a stencil.",
    "Slates are the perfect format to stencil on.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/43\\/Make-a-Decorative-Slate-Step-9Bullet1.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/43\\/Make-a-Decorative-Slate-Step-9Bullet1.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse a good paint brushes to ensure clean edges.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/00\\/Make-a-Decorative-Slate-Step-9Bullet2.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/00\\/Make-a-Decorative-Slate-Step-9Bullet2.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse a better quality acrylic paint.",
    "You want to avoid paints that are clumpy or are too thin, because they don't cover that well and are hard to control.",
    "Paint brushes and paint can be purchased at your local craft store or on line.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Make-a-Decorative-Slate-Step-9Bullet3.jpg\\/v4-460px-Make-a-Decorative-Slate-Step-9Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Make-a-Decorative-Slate-Step-9Bullet3.jpg\\/v4-760px-Make-a-Decorative-Slate-Step-9Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} You can leave it the way it is or add words in the grass area.",
    "EX.",
    "God Bless America or  personalize it \"The (Last Names)\".",
    "Once you are finished painting and you are satisfied with your work of art make sure any remaining pencil marks are erased.",
    "Take the slate to a well ventilated area (preferably outside) lay it on a protected surface and get your mask back on.",
    "This is the part where you are going to seal it with a clear acrylic spray paint for protection, especially if it is going to be outside.",
    "Put several coats on just to be extra sure.",
    "NOTE: There are three types of finish with clear acrylic spray paint.",
    "Glossy, Satin, and Matte.",
    "Glossy really makes all the colors pop.",
    "Spray slate with clear acrylic spray paint for protection.",
    "Wait for it to dry.",
    "If this is a lawn and garden slate, at this point you are ready to put it in your wrought iron slate holder.",
    "If this is a hanging slate then now is when you want to thread it with the leather cord.",
    "Measure you leather cord out to be cut.",
    "For a slate this size,  you would want to measure the cord about 15 inches (38.1 cm).",
    "Once you have done that thread one end of the cord through the back of the slate and tie in a Knot in the front.",
    "Repeat on the other side and then your slate is ready to hang.",
    "Stand back and admire your hard work.",
    "These make wonderful gifts for friends and family.",
    "Plus, the possibilities of what you can paint are endless."
  ],
  "tyn_section":[
    "roofing slate",
    "slate cutter (can be purchased at a roofing supply house)",
    "t square",
    "marker",
    "drill",
    "5/32\" drill bit",
    "ruler",
    "leather cord (for hanging slate)",
    "acrylic paint",
    "clear acrylic spray paint (sealer)",
    "paint brushes",
    "pencil",
    "safety goggles",
    "face mask (important because slate dust is bad for your lungs)"
  ],
  "tyn_model":[
    "slate",
    "paint",
    "clear acrylic spray paint",
    "t square",
    "marker",
    "paint brushes",
    "roofing slate",
    "epoxy",
    "slate cutter",
    "base coat",
    "pencil",
    "ruler",
    "stencil",
    "slates",
    "acrylic paint",
    "paints",
    "wrought iron slate holder"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.4117647059,
    "f1":0.4516129032,
    "avg_pos":0.3529411765
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.5882352941,
    "f1":0.5797101449
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5714285714,
    "p":0.6470588235,
    "f1":0.6068965517
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.4705882353,
    "f1":0.5161290323
  }
}