{
  "title":"How to Make a Hot Whiskey",
  "url":"https://www.wikihow.com/Make-a-Hot-Whiskey",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Whiskey Based Cocktails"
  ],
  "methods":[
    {
      "name":"Making Classic Hot Whiskey",
      "steps":[
        {
          "headline":"Slice a lemon and stick cloves in it.",
          "description":"Take a small lemon and slice it into several thin slices. Take one slice and cut it in half so you have 2 semi-circles. Stick 3 to 4 whole cloves into each lemon half slice. Save the other slices to make more drinks or use them in another recipe."
        },
        {
          "headline":"Bring a kettle of water to boil.",
          "description":"Fill a kettle halfway with water and place it on the stove. Turn the heat to high and bring the water to a full boil. If you're using an electric kettle, turn it on until it boils."
        },
        {
          "headline":"Preheat an Irish whiskey glass or mug.",
          "description":"Carefully pour a little of the boiling water into a glass with a handle (such as an Irish whiskey glass or mug). Let the water warm the glass for a few seconds and then pour the water out. Avoid using wine glasses or any thin glass that could shatter with the heat of the water."
        },
        {
          "headline":"Stir the whiskey and brown sugar in the glass.",
          "description":"Pour 1.5 ounces of whiskey and 2 teaspoons (8 g) of brown sugar into the warmed glass. Stir the mixture to dissolve the sugar. You can use any type of whiskey in this recipe. If you don't have brown sugar, you can use granulated sugar, but it won't have as rich of a flavor."
        },
        {
          "headline":"Place the lemon in the glass and pour in the boiling water.",
          "description":"Place the studded lemon slices in the glass and pour in 2/3 to 3/4 cup (5 to 6 ounces) of boiling hot water. If you'd like a stronger drink, pour in less water. You can always taste the drink and adjust the water according to your taste."
        },
        {
          "headline":"Stir the hot whiskey and serve it.",
          "description":"Slowly stir the hot whiskey so the lemon releases some of its oils and the brown sugar whiskey mixture is combined with the water. Serve the hot whiskey right away. Sip the hot whiskey slowly since the drink is incredibly hot."
        }
      ]
    },
    {
      "name":"Making Hot Whiskey Tea",
      "steps":[
        {
          "headline":"Stir honey and spices in an Irish whiskey glass or mug.",
          "description":"Measure 1 teaspoon (7 g) of honey into the bottom of a heat-proof glass with a handle (such as an Irish whiskey glass or mug). Stir in:\n5 whole cloves\n1 cinnamon stick\n1 whole anise star"
        },
        {
          "headline":"Boil a kettle of water and brew the tea.",
          "description":"Fill a kettle halfway with water and place it on the stove. Turn the heat to high and bring the water to a full boil. Place a tea bag into a separate mug and pour 1/2 cup (120 ml) of water over the bag. Steep the tea for 3 to 4 minutes. Remove the tea bag. If you're using an electric kettle, turn it on until it boils. For a classic flavor, use English or Irish breakfast tea. Or use your favorite type of tea (such as chai, jasmine, or green tea)."
        },
        {
          "headline":"Pour the whiskey and tea into the spiced honey mixture.",
          "description":"Pour 1 1/2 ounces of whiskey into the spiced honey in the mug. Pour in the brewed tea while it's still hot."
        },
        {
          "headline":"Add a lemon slice and stir the drink.",
          "description":"Gently squeeze a thin lemon slice over the drink and put it in the glass. Stir the hot whiskey tea until the honey dissolves and the drink is spiced. Serve it while it's still hot."
        }
      ]
    },
    {
      "name":"Making Hot Whiskey Apple Toddy",
      "steps":[
        {
          "headline":"Place the aromatics in a medium saucepan.",
          "description":"Wash an orange and use a vegetable peeler or paring knife to peel off one 2-inch (5 cm) piece of orange zest. Place the zest in a medium saucepan along with a few fresh gratings or a pinch of nutmeg. Slice 1 vanilla bean in half so you can see the seeds. Take a sharp knife and scrape the seeds out of the bean. Scrape the bean paste into the saucepan. If you don't have vanilla bean, you can add vanilla extract right before you serve the drink."
        },
        {
          "headline":"Add the cider and brown sugar.",
          "description":"Pour 6 cups (1.4 liters) of apple cider into the saucepan along with 2 tablespoons (25 g) of packed light brown sugar. Stir the cider to combine it with the seasonings and sugar."
        },
        {
          "headline":"Heat the toddy for 10 minutes.",
          "description":"Turn the heat to medium and let the liquid bubble gently. The sugar will dissolve and the spices will flavor the cider. Simmer the toddy for 10 minutes."
        },
        {
          "headline":"Stir in the whiskey and pour the toddy into glasses.",
          "description":"Turn off the heat and stir in 3/4 cup (180 ml) of whiskey. If you're using vanilla extract instead of vanilla bean, stir in 1 teaspoon of vanilla now. Divide the toddy among 4 heat-proof glasses with handles and serve the drinks immediately. For an extra treat, you can top the drinks with freshly whipped cream and a sprinkle of cinnamon."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Classic Hot Whiskey Slice a lemon and stick cloves in it. Take a small lemon and slice it into several thin slices. Take one slice and cut it in half so you have 2 semi-circles. Stick 3 to 4 whole cloves into each lemon half slice. Save the other slices to make more drinks or use them in another recipe. Bring a kettle of water to boil. Fill a kettle halfway with water and place it on the stove. Turn the heat to high and bring the water to a full boil. If you're using an electric kettle, turn it on until it boils. Preheat an Irish whiskey glass or mug. Carefully pour a little of the boiling water into a glass with a handle (such as an Irish whiskey glass or mug). Let the water warm the glass for a few seconds and then pour the water out. Avoid using wine glasses or any thin glass that could shatter with the heat of the water. Stir the whiskey and brown sugar in the glass. Pour 1.5 ounces of whiskey and 2 teaspoons (8 g) of brown sugar into the warmed glass. Stir the mixture to dissolve the sugar. You can use any type of whiskey in this recipe. If you don't have brown sugar, you can use granulated sugar, but it won't have as rich of a flavor. Place the lemon in the glass and pour in the boiling water. Place the studded lemon slices in the glass and pour in 2/3 to 3/4 cup (5 to 6 ounces) of boiling hot water. If you'd like a stronger drink, pour in less water. You can always taste the drink and adjust the water according to your taste. Stir the hot whiskey and serve it. Slowly stir the hot whiskey so the lemon releases some of its oils and the brown sugar whiskey mixture is combined with the water. Serve the hot whiskey right away. Sip the hot whiskey slowly since the drink is incredibly hot. Making Hot Whiskey Tea Stir honey and spices in an Irish whiskey glass or mug. Measure 1 teaspoon (7 g) of honey into the bottom of a heat-proof glass with a handle (such as an Irish whiskey glass or mug). Stir in:\n5 whole cloves\n1 cinnamon stick\n1 whole anise star Boil a kettle of water and brew the tea. Fill a kettle halfway with water and place it on the stove. Turn the heat to high and bring the water to a full boil. Place a tea bag into a separate mug and pour 1/2 cup (120 ml) of water over the bag. Steep the tea for 3 to 4 minutes. Remove the tea bag. If you're using an electric kettle, turn it on until it boils. For a classic flavor, use English or Irish breakfast tea. Or use your favorite type of tea (such as chai, jasmine, or green tea). Pour the whiskey and tea into the spiced honey mixture. Pour 1 1/2 ounces of whiskey into the spiced honey in the mug. Pour in the brewed tea while it's still hot. Add a lemon slice and stir the drink. Gently squeeze a thin lemon slice over the drink and put it in the glass. Stir the hot whiskey tea until the honey dissolves and the drink is spiced. Serve it while it's still hot. Making Hot Whiskey Apple Toddy Place the aromatics in a medium saucepan. Wash an orange and use a vegetable peeler or paring knife to peel off one 2-inch (5 cm) piece of orange zest. Place the zest in a medium saucepan along with a few fresh gratings or a pinch of nutmeg. Slice 1 vanilla bean in half so you can see the seeds. Take a sharp knife and scrape the seeds out of the bean. Scrape the bean paste into the saucepan. If you don't have vanilla bean, you can add vanilla extract right before you serve the drink. Add the cider and brown sugar. Pour 6 cups (1.4 liters) of apple cider into the saucepan along with 2 tablespoons (25 g) of packed light brown sugar. Stir the cider to combine it with the seasonings and sugar. Heat the toddy for 10 minutes. Turn the heat to medium and let the liquid bubble gently. The sugar will dissolve and the spices will flavor the cider. Simmer the toddy for 10 minutes. Stir in the whiskey and pour the toddy into glasses. Turn off the heat and stir in 3/4 cup (180 ml) of whiskey. If you're using vanilla extract instead of vanilla bean, stir in 1 teaspoon of vanilla now. Divide the toddy among 4 heat-proof glasses with handles and serve the drinks immediately. For an extra treat, you can top the drinks with freshly whipped cream and a sprinkle of cinnamon. Finished. ",
  "sentences":[
    " Making Classic Hot Whiskey Slice a lemon and stick cloves in it.",
    "Take a small lemon and slice it into several thin slices.",
    "Take one slice and cut it in half so you have 2 semi-circles.",
    "Stick 3 to 4 whole cloves into each lemon half slice.",
    "Save the other slices to make more drinks or use them in another recipe.",
    "Bring a kettle of water to boil.",
    "Fill a kettle halfway with water and place it on the stove.",
    "Turn the heat to high and bring the water to a full boil.",
    "If you're using an electric kettle, turn it on until it boils.",
    "Preheat an Irish whiskey glass or mug.",
    "Carefully pour a little of the boiling water into a glass with a handle (such as an Irish whiskey glass or mug).",
    "Let the water warm the glass for a few seconds and then pour the water out.",
    "Avoid using wine glasses or any thin glass that could shatter with the heat of the water.",
    "Stir the whiskey and brown sugar in the glass.",
    "Pour 1.5 ounces of whiskey and 2 teaspoons (8 g) of brown sugar into the warmed glass.",
    "Stir the mixture to dissolve the sugar.",
    "You can use any type of whiskey in this recipe.",
    "If you don't have brown sugar, you can use granulated sugar, but it won't have as rich of a flavor.",
    "Place the lemon in the glass and pour in the boiling water.",
    "Place the studded lemon slices in the glass and pour in 2/3 to 3/4 cup (5 to 6 ounces) of boiling hot water.",
    "If you'd like a stronger drink, pour in less water.",
    "You can always taste the drink and adjust the water according to your taste.",
    "Stir the hot whiskey and serve it.",
    "Slowly stir the hot whiskey so the lemon releases some of its oils and the brown sugar whiskey mixture is combined with the water.",
    "Serve the hot whiskey right away.",
    "Sip the hot whiskey slowly since the drink is incredibly hot.",
    "Making Hot Whiskey Tea Stir honey and spices in an Irish whiskey glass or mug.",
    "Measure 1 teaspoon (7 g) of honey into the bottom of a heat-proof glass with a handle (such as an Irish whiskey glass or mug).",
    "Stir in:\n5 whole cloves\n1 cinnamon stick\n1 whole anise star Boil a kettle of water and brew the tea.",
    "Fill a kettle halfway with water and place it on the stove.",
    "Turn the heat to high and bring the water to a full boil.",
    "Place a tea bag into a separate mug and pour 1/2 cup (120 ml) of water over the bag.",
    "Steep the tea for 3 to 4 minutes.",
    "Remove the tea bag.",
    "If you're using an electric kettle, turn it on until it boils.",
    "For a classic flavor, use English or Irish breakfast tea.",
    "Or use your favorite type of tea (such as chai, jasmine, or green tea).",
    "Pour the whiskey and tea into the spiced honey mixture.",
    "Pour 1 1/2 ounces of whiskey into the spiced honey in the mug.",
    "Pour in the brewed tea while it's still hot.",
    "Add a lemon slice and stir the drink.",
    "Gently squeeze a thin lemon slice over the drink and put it in the glass.",
    "Stir the hot whiskey tea until the honey dissolves and the drink is spiced.",
    "Serve it while it's still hot.",
    "Making Hot Whiskey Apple Toddy Place the aromatics in a medium saucepan.",
    "Wash an orange and use a vegetable peeler or paring knife to peel off one 2-inch (5 cm) piece of orange zest.",
    "Place the zest in a medium saucepan along with a few fresh gratings or a pinch of nutmeg.",
    "Slice 1 vanilla bean in half so you can see the seeds.",
    "Take a sharp knife and scrape the seeds out of the bean.",
    "Scrape the bean paste into the saucepan.",
    "If you don't have vanilla bean, you can add vanilla extract right before you serve the drink.",
    "Add the cider and brown sugar.",
    "Pour 6 cups (1.4 liters) of apple cider into the saucepan along with 2 tablespoons (25 g) of packed light brown sugar.",
    "Stir the cider to combine it with the seasonings and sugar.",
    "Heat the toddy for 10 minutes.",
    "Turn the heat to medium and let the liquid bubble gently.",
    "The sugar will dissolve and the spices will flavor the cider.",
    "Simmer the toddy for 10 minutes.",
    "Stir in the whiskey and pour the toddy into glasses.",
    "Turn off the heat and stir in 3/4 cup (180 ml) of whiskey.",
    "If you're using vanilla extract instead of vanilla bean, stir in 1 teaspoon of vanilla now.",
    "Divide the toddy among 4 heat-proof glasses with handles and serve the drinks immediately.",
    "For an extra treat, you can top the drinks with freshly whipped cream and a sprinkle of cinnamon.",
    "Finished."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Knife and cutting board",
    "Irish whiskey glass",
    "Mug",
    "Water kettle",
    "Spoon",
    "Medium saucepan",
    "Vegetable peeler or paring knife",
    "4 Irish whiskey glasses or mugs",
    "Ladle"
  ],
  "tyn_model":[
    "water",
    "lemon",
    "whiskey",
    "brown sugar",
    "kettle",
    "irish whiskey glass",
    "mug",
    "sugar",
    "honey",
    "vanilla bean",
    "cider",
    "stove",
    "electric kettle",
    "glass",
    "spices",
    "tea bag",
    "tea",
    "spiced honey",
    "medium saucepan",
    "orange",
    "saucepan",
    "vanilla extract",
    "wine glasses",
    "granulated sugar",
    "boiling hot water",
    "heat-proof glass",
    "cinnamon stick",
    "green tea",
    "brewed tea",
    "hot whiskey tea",
    "vegetable peeler",
    "paring knife",
    "nutmeg",
    "sharp knife",
    "apple cider",
    "light brown sugar",
    "seasonings",
    "vanilla",
    "freshly whipped cream",
    "cinnamon"
  ],
  "simple_metrics":{
    "r":0.3,
    "p":0.075,
    "f1":0.12,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.15,
    "f1":0.2181818182
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.275,
    "f1":0.3548387097
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3,
    "p":0.075,
    "f1":0.12
  }
}