{
  "title":"How to Cook Mackerel",
  "url":"https://www.wikihow.com/Cook-Mackerel",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Fry mackerel",
      "description":"Pan frying is a quick method of cooking mackerel that requires little preparation. Add a small amount of oil or melted butter to a heated pan. Place the mackerel fillet in the pan skin side down. Season the side facing you with salt and pepper. Turn the fish after 5 minutes and cook for an additional five minutes."
    },
    {
      "headline":"Bake mackerel",
      "description":"Make mackerel in the oven by baking it. Spray a roasting pan or baking dish with cooking spray. Arrange mackerel fillets skin side down and season with salt, pepper or other seafood seasonings. Drizzle the mackerel with melted butter to help it stay moist, then bake for ten minutes or until the fish flakes easily with a fork."
    },
    {
      "headline":"Grill mackerel",
      "description":"The firm texture of this fish allows you to cook with mackerel in ways that aren't options with more delicate seafood, like grilling. Place mackerel skin side down on a hot grill and grill on each side for about 5 minutes or until the fish flakes easily when touched with a fork. Wrap mackerel fillets in foil before placing on the grill if a lighter grilled taste is preferred."
    },
    {
      "headline":"Make mackerel packets",
      "description":"Place one mackerel fillet on a piece of heavy duty aluminum foil that has been sprayed with cooking spray. Add sliced vegetables like asparagus, carrots and leeks. Season all the food with salt and pepper. Drizzle a small amount of oil or melted butter on all the food, then wrap the foil up into a packet. Cook in a preheated oven for fifteen minutes or until the fish is cooked through and the vegetables are tender."
    },
    {
      "headline":"Use mackerel in salads",
      "description":"Fry a mackerel fillet in a pan or bake it in the oven, then flake it apart with a fork. Add the pieces of mackerel to a bed of mixed greens and vegetables and top with your favorite citrus vinaigrette or salad dressing."
    },
    {
      "headline":"Poach mackerel",
      "description":"Add seasoned mackerel to a pan with enough white wine or vegetable broth to cover the fillet. Arrange the fish skin side down so the fleshy side can absorb the flavors of the liquid. Bring the liquid to a simmer, but do not let it boil. Poach the mackerel in the simmering liquid for about 5 minutes or until it is cooked through."
    },
    {
      "headline":"Vary cooking methods.",
      "description":"Try cooking mackerel in several different ways to find the way you like it best. The firm, versatile fish holds up well on the grill, but is also delicious baked or pan fried, so you can experiment with cooking it in different ways that might be difficult with a more delicate fish."
    }
  ],
  "text":" Fry mackerel Pan frying is a quick method of cooking mackerel that requires little preparation. Add a small amount of oil or melted butter to a heated pan. Place the mackerel fillet in the pan skin side down. Season the side facing you with salt and pepper. Turn the fish after 5 minutes and cook for an additional five minutes. Bake mackerel Make mackerel in the oven by baking it. Spray a roasting pan or baking dish with cooking spray. Arrange mackerel fillets skin side down and season with salt, pepper or other seafood seasonings. Drizzle the mackerel with melted butter to help it stay moist, then bake for ten minutes or until the fish flakes easily with a fork. Grill mackerel The firm texture of this fish allows you to cook with mackerel in ways that aren't options with more delicate seafood, like grilling. Place mackerel skin side down on a hot grill and grill on each side for about 5 minutes or until the fish flakes easily when touched with a fork. Wrap mackerel fillets in foil before placing on the grill if a lighter grilled taste is preferred. Make mackerel packets Place one mackerel fillet on a piece of heavy duty aluminum foil that has been sprayed with cooking spray. Add sliced vegetables like asparagus, carrots and leeks. Season all the food with salt and pepper. Drizzle a small amount of oil or melted butter on all the food, then wrap the foil up into a packet. Cook in a preheated oven for fifteen minutes or until the fish is cooked through and the vegetables are tender. Use mackerel in salads Fry a mackerel fillet in a pan or bake it in the oven, then flake it apart with a fork. Add the pieces of mackerel to a bed of mixed greens and vegetables and top with your favorite citrus vinaigrette or salad dressing. Poach mackerel Add seasoned mackerel to a pan with enough white wine or vegetable broth to cover the fillet. Arrange the fish skin side down so the fleshy side can absorb the flavors of the liquid. Bring the liquid to a simmer, but do not let it boil. Poach the mackerel in the simmering liquid for about 5 minutes or until it is cooked through. Vary cooking methods. Try cooking mackerel in several different ways to find the way you like it best. The firm, versatile fish holds up well on the grill, but is also delicious baked or pan fried, so you can experiment with cooking it in different ways that might be difficult with a more delicate fish.",
  "sentences":[
    " Fry mackerel Pan frying is a quick method of cooking mackerel that requires little preparation.",
    "Add a small amount of oil or melted butter to a heated pan.",
    "Place the mackerel fillet in the pan skin side down.",
    "Season the side facing you with salt and pepper.",
    "Turn the fish after 5 minutes and cook for an additional five minutes.",
    "Bake mackerel Make mackerel in the oven by baking it.",
    "Spray a roasting pan or baking dish with cooking spray.",
    "Arrange mackerel fillets skin side down and season with salt, pepper or other seafood seasonings.",
    "Drizzle the mackerel with melted butter to help it stay moist, then bake for ten minutes or until the fish flakes easily with a fork.",
    "Grill mackerel The firm texture of this fish allows you to cook with mackerel in ways that aren't options with more delicate seafood, like grilling.",
    "Place mackerel skin side down on a hot grill and grill on each side for about 5 minutes or until the fish flakes easily when touched with a fork.",
    "Wrap mackerel fillets in foil before placing on the grill if a lighter grilled taste is preferred.",
    "Make mackerel packets Place one mackerel fillet on a piece of heavy duty aluminum foil that has been sprayed with cooking spray.",
    "Add sliced vegetables like asparagus, carrots and leeks.",
    "Season all the food with salt and pepper.",
    "Drizzle a small amount of oil or melted butter on all the food, then wrap the foil up into a packet.",
    "Cook in a preheated oven for fifteen minutes or until the fish is cooked through and the vegetables are tender.",
    "Use mackerel in salads Fry a mackerel fillet in a pan or bake it in the oven, then flake it apart with a fork.",
    "Add the pieces of mackerel to a bed of mixed greens and vegetables and top with your favorite citrus vinaigrette or salad dressing.",
    "Poach mackerel Add seasoned mackerel to a pan with enough white wine or vegetable broth to cover the fillet.",
    "Arrange the fish skin side down so the fleshy side can absorb the flavors of the liquid.",
    "Bring the liquid to a simmer, but do not let it boil.",
    "Poach the mackerel in the simmering liquid for about 5 minutes or until it is cooked through.",
    "Vary cooking methods.",
    "Try cooking mackerel in several different ways to find the way you like it best.",
    "The firm, versatile fish holds up well on the grill, but is also delicious baked or pan fried, so you can experiment with cooking it in different ways that might be difficult with a more delicate fish."
  ],
  "tyn_section":[
    "Mackerel fillets or steaks",
    "Salt and pepper",
    "Cooking spray",
    "Melted butter",
    "Cooking oil",
    "Sliced lemon or other garnishes",
    "Seafood seasoning"
  ],
  "tyn_model":[
    "mackerel",
    "grill",
    "butter",
    "oven",
    "fork",
    "fish",
    "salt and pepper",
    "cooking spray",
    "foil",
    "roasting pan",
    "baking dish",
    "salt, pepper",
    "seafood seasonings",
    "heavy duty aluminum foil",
    "carrots",
    "leeks",
    "mixed greens",
    "citrus vinaigrette or",
    "salad dressing",
    "pan",
    "white wine",
    "vegetable broth"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0909090909,
    "f1":0.1379310345,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.1363636364,
    "f1":0.2068965517
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.1818181818,
    "f1":0.2898550725
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.0909090909,
    "f1":0.1379310345
  }
}