{
  "title":"How to Fry Chicken Wings",
  "url":"https://www.wikihow.com/Fry-Chicken-Wings",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken",
    "Fried Chicken"
  ],
  "parts":[
    {
      "name":"Prepare the Chicken",
      "steps":[
        {
          "headline":"Decide whether or not you want the skin.",
          "description":"Long considered an enemy of good health, chicken skin just got a retrial and experts agree that, now and again, chicken skin is a-okay to enjoy. If you keep the chicken skin, it will give your wings a crispy, buttery outside. Removing the skin will allow the meat to soak up more of your marinade."
        },
        {
          "headline":"Flavor your chicken.",
          "description":"You can soak it in a marinade, coat it with a batter or create a crust."
        },
        {
          "headline":"Make a marinade.",
          "description":"Teriyaki, ginger-garlic, tandoori and honey-orange are great marinade choices. Soak your chicken for two hours at least, so that the meat absorbs the flavors."
        },
        {
          "headline":"Batter your chicken.",
          "description":"Options for batter recipes include milk and flour batter, egg batter, and buttermilk batter. Roll the chicken in the batter. Some recipes suggest soaking the chicken in the batter for two hours. This is a good suggestion for flavorful buttermilk batters."
        },
        {
          "headline":"Breaded or crusted chicken.",
          "description":"You can create a crust with flour, bread crumbs or crushed crackers. Roll the chicken in your crust mix. For an extra crispy crust, coat the chicken with milk or beaten eggs before you roll it in your crust mix."
        }
      ]
    },
    {
      "name":"Frying the Chicken Wings",
      "steps":[
        {
          "headline":"Fill a wok or deep frying pan halfway with vegetable oil.",
          "description":""
        },
        {
          "headline":"Get a large plate, cover it with a paper or cloth towel, and place it by your stove.",
          "description":""
        },
        {
          "headline":"Heat the oil until it starts popping.",
          "description":"If you have a thermometer, it should be about 350˚–375˚ Fahrenheit, or 175˚–190˚ Centigrade (Celsius). This is about equivalent to the  “Medium” to “Medium High” settings on your stovetop."
        },
        {
          "headline":"Gently place your chicken wings in the oil.",
          "description":"Do not drop the wings into the oil as this may cause it to spatter. You can fry about five wings at a time."
        },
        {
          "headline":"Stir occasionally with a large spoon or spatula.",
          "description":"Gently turn the chicken so that all sides are fried. You can also ladle oil over the sides of chicken that are exposed to the surface."
        },
        {
          "headline":"Cook the chicken for about five minutes or until it is golden brown and crispy.",
          "description":""
        },
        {
          "headline":"Using a deep-frying ladle or tongs, remove the chicken from the oil.",
          "description":"Gently shake the chicken over your pan to remove excess oil."
        },
        {
          "headline":"Deposit the chicken wings onto your plate with the napkin.",
          "description":"The napkin will absorb any excess oil so that your wings aren’t too greasy."
        },
        {
          "headline":"Repeat until your wings are all cooked!",
          "description":""
        }
      ]
    }
  ],
  "text":" Prepare the Chicken Decide whether or not you want the skin. Long considered an enemy of good health, chicken skin just got a retrial and experts agree that, now and again, chicken skin is a-okay to enjoy. If you keep the chicken skin, it will give your wings a crispy, buttery outside. Removing the skin will allow the meat to soak up more of your marinade. Flavor your chicken. You can soak it in a marinade, coat it with a batter or create a crust. Make a marinade. Teriyaki, ginger-garlic, tandoori and honey-orange are great marinade choices. Soak your chicken for two hours at least, so that the meat absorbs the flavors. Batter your chicken. Options for batter recipes include milk and flour batter, egg batter, and buttermilk batter. Roll the chicken in the batter. Some recipes suggest soaking the chicken in the batter for two hours. This is a good suggestion for flavorful buttermilk batters. Breaded or crusted chicken. You can create a crust with flour, bread crumbs or crushed crackers. Roll the chicken in your crust mix. For an extra crispy crust, coat the chicken with milk or beaten eggs before you roll it in your crust mix. Frying the Chicken Wings Fill a wok or deep frying pan halfway with vegetable oil.  Get a large plate, cover it with a paper or cloth towel, and place it by your stove.  Heat the oil until it starts popping. If you have a thermometer, it should be about 350˚–375˚ Fahrenheit, or 175˚–190˚ Centigrade (Celsius). This is about equivalent to the  “Medium” to “Medium High” settings on your stovetop. Gently place your chicken wings in the oil. Do not drop the wings into the oil as this may cause it to spatter. You can fry about five wings at a time. Stir occasionally with a large spoon or spatula. Gently turn the chicken so that all sides are fried. You can also ladle oil over the sides of chicken that are exposed to the surface. Cook the chicken for about five minutes or until it is golden brown and crispy.  Using a deep-frying ladle or tongs, remove the chicken from the oil. Gently shake the chicken over your pan to remove excess oil. Deposit the chicken wings onto your plate with the napkin. The napkin will absorb any excess oil so that your wings aren’t too greasy. Repeat until your wings are all cooked! ",
  "sentences":[
    " Prepare the Chicken Decide whether or not you want the skin.",
    "Long considered an enemy of good health, chicken skin just got a retrial and experts agree that, now and again, chicken skin is a-okay to enjoy.",
    "If you keep the chicken skin, it will give your wings a crispy, buttery outside.",
    "Removing the skin will allow the meat to soak up more of your marinade.",
    "Flavor your chicken.",
    "You can soak it in a marinade, coat it with a batter or create a crust.",
    "Make a marinade.",
    "Teriyaki, ginger-garlic, tandoori and honey-orange are great marinade choices.",
    "Soak your chicken for two hours at least, so that the meat absorbs the flavors.",
    "Batter your chicken.",
    "Options for batter recipes include milk and flour batter, egg batter, and buttermilk batter.",
    "Roll the chicken in the batter.",
    "Some recipes suggest soaking the chicken in the batter for two hours.",
    "This is a good suggestion for flavorful buttermilk batters.",
    "Breaded or crusted chicken.",
    "You can create a crust with flour, bread crumbs or crushed crackers.",
    "Roll the chicken in your crust mix.",
    "For an extra crispy crust, coat the chicken with milk or beaten eggs before you roll it in your crust mix.",
    "Frying the Chicken Wings Fill a wok or deep frying pan halfway with vegetable oil.",
    "Get a large plate, cover it with a paper or cloth towel, and place it by your stove.",
    "Heat the oil until it starts popping.",
    "If you have a thermometer, it should be about 350˚–375˚ Fahrenheit, or 175˚–190˚ Centigrade (Celsius).",
    "This is about equivalent to the  “Medium” to “Medium High” settings on your stovetop.",
    "Gently place your chicken wings in the oil.",
    "Do not drop the wings into the oil as this may cause it to spatter.",
    "You can fry about five wings at a time.",
    "Stir occasionally with a large spoon or spatula.",
    "Gently turn the chicken so that all sides are fried.",
    "You can also ladle oil over the sides of chicken that are exposed to the surface.",
    "Cook the chicken for about five minutes or until it is golden brown and crispy.",
    "Using a deep-frying ladle or tongs, remove the chicken from the oil.",
    "Gently shake the chicken over your pan to remove excess oil.",
    "Deposit the chicken wings onto your plate with the napkin.",
    "The napkin will absorb any excess oil so that your wings aren’t too greasy.",
    "Repeat until your wings are all cooked!"
  ],
  "tyn_section":[
    "A wok or deep frying pan.",
    "A plate or bowl.",
    "Paper or cloth towels.",
    "A frying ladle or tongs."
  ],
  "tyn_model":[
    "chicken",
    "oil",
    "chicken skin",
    "plate",
    "“medium",
    "napkin",
    "ginger-garlic",
    "honey-orange",
    "milk and flour",
    "buttermilk batter",
    "buttermilk batters",
    "flour",
    "bread crumbs",
    "milk",
    "eggs",
    "wok",
    "deep frying",
    "vegetable oil",
    "stove",
    "thermometer",
    "” to",
    "” settings",
    "stovetop",
    "chicken wings",
    "large spoon",
    "spatula",
    "deep-frying ladle"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.037037037,
    "f1":0.064516129
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}