{
  "title":"How to Make Glow Sticks Glow Again",
  "url":"https://www.wikihow.com/Make-Glow-Sticks-Glow-Again",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Glow Sticks"
  ],
  "methods":[
    {
      "name":"Extending the Glow",
      "steps":[
        {
          "headline":"Find a little extra light.",
          "description":"Crack the glow stick down every bit of its length. If no light at all appears, your glow stick is completely used up and there's no hope for it. If you can get a tiny bit of light, even just a couple spots, you've got something to work with. The light in a glow stick is caused by a reaction between two chemicals. One is kept inside a glass tube. Cracking the tube breaks the glass and lets the chemicals mix and react. Be gentle. Cracking too hard will break the glow stick and spill glass and goo that can irritate the skin."
        },
        {
          "headline":"Seal the glow stick in a plastic bag.",
          "description":"Put the stick in a zip-locked bag. Press out the air from the bag, then seal it. It's unlikely that the glow stick will break during this method, but just in case, this will make it easy to throw away."
        },
        {
          "headline":"Stick the glow stick in a freezer.",
          "description":"For best results, stick it underneath a lightweight frozen object. This will freeze the liquids inside, preventing them from reacting. Setting your freezer to a colder setting may help as well. Before you do this, be aware that this can cause excessive ice buildup or freeze liquids in an attached refrigerator"
        },
        {
          "headline":"Take it out and shake it.",
          "description":"Check on the glow stick after an hour and try shaking it and cracking it. If this doesn't work, return it to the freezer overnight and try again the next day. Most brands of glow sticks will get a little extra glowing time when the liquids inside melt and recombine. Some brands will be quite bright, while others will just stay at the same dim level, but last longer. There's no way to tell what will happen without experimenting. Keep it in the plastic bag while you shake it, just in case it breaks. It can take a little while for the glow stick to warm up and glow again."
        }
      ]
    },
    {
      "name":"Adding a Short Burst of Bright Glow",
      "steps":[
        {
          "headline":"Heat a pot of warm water.",
          "description":"Heat until the water begins to steam or simmer. Heat speeds up the chemical reaction that causes the glow. By warming the glow stick, you can make it glow brightly for a short time, sometimes up to half an hour. If a glow stick \"died\" more than a day ago, this will have little to no effect. Once it's used up, it's used up."
        },
        {
          "headline":"Pour the water into a glass jar.",
          "description":"A sturdy jar will withstand the heat better than a glass. Find one tall enough to hold most of the glow stick. You can use a mug instead. There's a risk of melting the glow stick, so don't use a nice mug."
        },
        {
          "headline":"Let cool (recommended).",
          "description":"If your water came to a full boil, definitely wait five minutes for the water to cool. If your water was only steaming, you can go ahead right away, or wait about a minute. The glow stick plastic will melt if the water is too hot. Some brands can withstand boiling water (100ºC / 212ºF), while others may melt in water above 70ºC (158ºC). If using a mug, wait ten minutes for boiling water."
        },
        {
          "headline":"Drop the glow stick in the water.",
          "description":"Leave it in for thirty seconds, then pull it out with tongs or rubber gloves. If there's any \"oomph\" left in the glow stick, it should glow brightly for a short time. Do not put your face over the jar. The glow stick is unlikely to explode, but it's best to be safe and sound. If the glow stick melts, seal the jar in a plastic bag and throw it away. These materials cannot be recycled, and the jar should not be used again.You should throw away the jar to be safe."
        }
      ]
    }
  ],
  "text":" Extending the Glow Find a little extra light. Crack the glow stick down every bit of its length. If no light at all appears, your glow stick is completely used up and there's no hope for it. If you can get a tiny bit of light, even just a couple spots, you've got something to work with. The light in a glow stick is caused by a reaction between two chemicals. One is kept inside a glass tube. Cracking the tube breaks the glass and lets the chemicals mix and react. Be gentle. Cracking too hard will break the glow stick and spill glass and goo that can irritate the skin. Seal the glow stick in a plastic bag. Put the stick in a zip-locked bag. Press out the air from the bag, then seal it. It's unlikely that the glow stick will break during this method, but just in case, this will make it easy to throw away. Stick the glow stick in a freezer. For best results, stick it underneath a lightweight frozen object. This will freeze the liquids inside, preventing them from reacting. Setting your freezer to a colder setting may help as well. Before you do this, be aware that this can cause excessive ice buildup or freeze liquids in an attached refrigerator Take it out and shake it. Check on the glow stick after an hour and try shaking it and cracking it. If this doesn't work, return it to the freezer overnight and try again the next day. Most brands of glow sticks will get a little extra glowing time when the liquids inside melt and recombine. Some brands will be quite bright, while others will just stay at the same dim level, but last longer. There's no way to tell what will happen without experimenting. Keep it in the plastic bag while you shake it, just in case it breaks. It can take a little while for the glow stick to warm up and glow again. Adding a Short Burst of Bright Glow Heat a pot of warm water. Heat until the water begins to steam or simmer. Heat speeds up the chemical reaction that causes the glow. By warming the glow stick, you can make it glow brightly for a short time, sometimes up to half an hour. If a glow stick \"died\" more than a day ago, this will have little to no effect. Once it's used up, it's used up. Pour the water into a glass jar. A sturdy jar will withstand the heat better than a glass. Find one tall enough to hold most of the glow stick. You can use a mug instead. There's a risk of melting the glow stick, so don't use a nice mug. Let cool (recommended). If your water came to a full boil, definitely wait five minutes for the water to cool. If your water was only steaming, you can go ahead right away, or wait about a minute. The glow stick plastic will melt if the water is too hot. Some brands can withstand boiling water (100ºC / 212ºF), while others may melt in water above 70ºC (158ºC). If using a mug, wait ten minutes for boiling water. Drop the glow stick in the water. Leave it in for thirty seconds, then pull it out with tongs or rubber gloves. If there's any \"oomph\" left in the glow stick, it should glow brightly for a short time. Do not put your face over the jar. The glow stick is unlikely to explode, but it's best to be safe and sound. If the glow stick melts, seal the jar in a plastic bag and throw it away. These materials cannot be recycled, and the jar should not be used again.You should throw away the jar to be safe.",
  "sentences":[
    " Extending the Glow Find a little extra light.",
    "Crack the glow stick down every bit of its length.",
    "If no light at all appears, your glow stick is completely used up and there's no hope for it.",
    "If you can get a tiny bit of light, even just a couple spots, you've got something to work with.",
    "The light in a glow stick is caused by a reaction between two chemicals.",
    "One is kept inside a glass tube.",
    "Cracking the tube breaks the glass and lets the chemicals mix and react.",
    "Be gentle.",
    "Cracking too hard will break the glow stick and spill glass and goo that can irritate the skin.",
    "Seal the glow stick in a plastic bag.",
    "Put the stick in a zip-locked bag.",
    "Press out the air from the bag, then seal it.",
    "It's unlikely that the glow stick will break during this method, but just in case, this will make it easy to throw away.",
    "Stick the glow stick in a freezer.",
    "For best results, stick it underneath a lightweight frozen object.",
    "This will freeze the liquids inside, preventing them from reacting.",
    "Setting your freezer to a colder setting may help as well.",
    "Before you do this, be aware that this can cause excessive ice buildup or freeze liquids in an attached refrigerator Take it out and shake it.",
    "Check on the glow stick after an hour and try shaking it and cracking it.",
    "If this doesn't work, return it to the freezer overnight and try again the next day.",
    "Most brands of glow sticks will get a little extra glowing time when the liquids inside melt and recombine.",
    "Some brands will be quite bright, while others will just stay at the same dim level, but last longer.",
    "There's no way to tell what will happen without experimenting.",
    "Keep it in the plastic bag while you shake it, just in case it breaks.",
    "It can take a little while for the glow stick to warm up and glow again.",
    "Adding a Short Burst of Bright Glow Heat a pot of warm water.",
    "Heat until the water begins to steam or simmer.",
    "Heat speeds up the chemical reaction that causes the glow.",
    "By warming the glow stick, you can make it glow brightly for a short time, sometimes up to half an hour.",
    "If a glow stick \"died\" more than a day ago, this will have little to no effect.",
    "Once it's used up, it's used up.",
    "Pour the water into a glass jar.",
    "A sturdy jar will withstand the heat better than a glass.",
    "Find one tall enough to hold most of the glow stick.",
    "You can use a mug instead.",
    "There's a risk of melting the glow stick, so don't use a nice mug.",
    "Let cool (recommended).",
    "If your water came to a full boil, definitely wait five minutes for the water to cool.",
    "If your water was only steaming, you can go ahead right away, or wait about a minute.",
    "The glow stick plastic will melt if the water is too hot.",
    "Some brands can withstand boiling water (100ºC / 212ºF), while others may melt in water above 70ºC (158ºC).",
    "If using a mug, wait ten minutes for boiling water.",
    "Drop the glow stick in the water.",
    "Leave it in for thirty seconds, then pull it out with tongs or rubber gloves.",
    "If there's any \"oomph\" left in the glow stick, it should glow brightly for a short time.",
    "Do not put your face over the jar.",
    "The glow stick is unlikely to explode, but it's best to be safe and sound.",
    "If the glow stick melts, seal the jar in a plastic bag and throw it away.",
    "These materials cannot be recycled, and the jar should not be used again.You should throw away the jar to be safe."
  ],
  "tyn_section":[
    "Glow stick",
    "Freezer"
  ],
  "tyn_model":[
    "water",
    "glow stick",
    "freezer",
    "jar",
    "plastic bag",
    "mug",
    "refrigerator",
    "glow sticks",
    "glass jar",
    "glass",
    "glow stick plastic",
    "rubber gloves"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.1666666667,
    "f1":0.2857142857,
    "avg_pos":0.0833333333
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.25,
    "f1":0.4
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.25,
    "f1":0.4
  }
}