{
  "title":"How to Conserve Water in Your Garden",
  "url":"https://www.wikihow.com/Conserve-Water-in-Your-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Compost Mulch and Soil Preparation"
  ],
  "methods":[
    {
      "name":"Watering Efficiently",
      "steps":[
        {
          "headline":"Look at the weather forecast before watering your garden.",
          "description":"You’ll save a lot of water by making sure you absolutely need to water your garden. If enough rain is forecast in the coming days, you can avoid the task altogether and conserve water at the same time."
        },
        {
          "headline":"Water your garden if the moisture meter reads 10-30% soil moisture.",
          "description":"By putting a moisture meter in your garden, you can take some of the guesswork out of watering efficiently. Available at most hardware stores, a moisture meter is one of the most cost effective tools for conserving water in your garden. Take a look at the reading to determine whether you should water the garden:\nIf the meter reads 10-30% moisture, you’ll need to water your garden. If the meter reads 40-70% moisture, you don’t need to water. If the meter reads 80-100% moisture, you should avoid watering, since your soil is likely too moist for most plants."
        },
        {
          "headline":"Reduce evaporation by watering your garden in the morning.",
          "description":"Grab your watering can or turn on your drip irrigation system before it gets too hot and windy, which will give your plants the necessary supply of water to make it through the rest of the day. Avoid watering your garden in the evening because it is more likely for water to stay on leaves, which could lead to fungal growth."
        },
        {
          "headline":"Monitor garden irrigation with a smart irrigation controller.",
          "description":"A smart irrigation controller is a tool that uses local and national weather data to automatically adjust the irrigation of your garden. You can save a lot of water by using these systems, which allow you to monitor irrigation from an app on your smart phone. Some of the systems, such as the Rachio Iro Smart Sprinkler Controller, can be programmed to adjust to local weather changes, such as skipping a scheduled watering if rain pops up in the forecast. Systems cost in the range of $200 and $1,250. In some regions, you can get a rebate for using a smart irrigation controller. You may be able to save 9% of your water use per year by using a smart irrigation controller."
        }
      ]
    },
    {
      "name":"Reusing Water",
      "steps":[
        {
          "headline":"Install a rain barrel.",
          "description":"Instead of letting rain fall from your roof onto the street and into the storm drains, you could catch it in a barrel! You can purchase rain barrel collection systems from larger hardware stores. If you don’t have the time to set one up yourself, you may be able to find a local gardening company that will install it for you. Rain barrels cost between $80 and $100."
        },
        {
          "headline":"Water your garden with cooking water.",
          "description":"The next time you boil some potatoes, you could pour the leftover cooking water into a plastic bucket. When you go out to water your garden, use the bucket of potato water to nourish a few of the plants. If you have a fish tank, you could save the old water the next time you clean the tank. Use it to water part of your garden. Only do this if you have a freshwater tank, as saltwater is not good for plants."
        },
        {
          "headline":"Reuse your shower water.",
          "description":"Put a bucket in the shower before turning it on. As you wait for the water temperature to warm up, you’ll be catching the water that would normally go down the drain. Put the bucket on your porch and use it to water a few plants the next time you have to water the garden."
        }
      ]
    },
    {
      "name":"Retaining Water in Your Soil",
      "steps":[
        {
          "headline":"Mulch your garden with bark chip mulch.",
          "description":"Because mulch prevents water from evaporating and holds moisture in the soil, it is an excellent way to conserve water. Choose a coarser mulch such as bark chip mulch, which will allow water to move down into the soil. Apply 3 or 4 inches (8-10 centimeters) of mulch to your garden bed. If you are container gardening, you can use 3-5 centimeters in your pot."
        },
        {
          "headline":"Add organic matter to your soil to improve moisture retention.",
          "description":"Add worm castings and compost to your garden soil to improve its structure and ability to retain moisture. Your garden soil will stay moist and retain nutrients for longer with the regular addition of compost."
        },
        {
          "headline":"Ring trees and bushes with stones.",
          "description":"Place large stones in a circle around trees, bushes, and other plants that require a lot of water. Stack the stones in several layers to trap moisture and create condensation, which produces a cooling effect that will allows the soil to retain water better."
        }
      ]
    },
    {
      "name":"Designing a Water Efficient Garden",
      "steps":[
        {
          "headline":"Design your garden with different watering zones.",
          "description":"Put plants with similar watering needs together, so that you avoid overwatering plants that have low water requirements simply because they are beside plants that need a lot of water. You should also be familiar with the type of plants and shrubs you have in your yard and garden so that you know what their exact watering needs are. If you have plants in containers, you can place the big ones so that they give shadow to the small plants. With more shade, the small plants will lose less water to evaporation."
        },
        {
          "headline":"Improve watering efficiency with a drip irrigation system.",
          "description":"Because drip irrigation systems deliver the water directly to the root systems in your garden, they are much more efficient. The water goes right to your plants without running off or evaporating. Connect a soaker hose to your tap and run it through your garden bed. Whenever you want to water the bed, just turn on the hose. Spray irrigation, such as a sprinkler, is only 50-75% efficient. Drip irrigation is 95-99% efficient. You can also use a smart irrigation controller to run your drip irrigation system. You can also install drip irrigation for a lawn but it needs to be subsurface by four to six feet."
        },
        {
          "headline":"Choose native plants that are adapted to local rainfall patterns.",
          "description":"Since native plants are adapted to your local climate, they won’t need much water beyond the regular rainfall for your region. You can find native plants for your region by contacting your local native plant society. You can search for your local native plant society by visiting the North American Native Plant Society website. If you live in Alberta, you can visit the website of the Alberta Native Plants Council. If you live in California, you can contact the California Native Plant Society."
        },
        {
          "headline":"Plant drought-resistant plants that need less water.",
          "description":"One of the best ways to garden with less water is to choose varieties that are drought-resistant, which often have silver and grey-green leaves that reflect sun rays. Another way to spot a drought-resistant variety is the fine hairs that grow on their stems and leaves, which trap moisture. Some drought-resistant plants include:\nMimosa (Acacia dealbata)\nHop tree (Ptelea trifoliata ‘Aurea’)\nLawson cypress (Chamaecyparis lawsoniana)\nSacred bamboo (Nandina domestica)\nSilver jubilee (Ozothamnus rosmarinifolius)\nVerbena\nEchinops\nBidens\nFelicia"
        },
        {
          "headline":"Choose small, slow-growing plants.",
          "description":"When you are planting, you should choose small, slow-growing plants, which require less water. Similarly, you should avoid large-leafed plants, which tend to use a lot of water."
        },
        {
          "headline":"Make a berm around water-intensive trees and shrubs.",
          "description":"If you have some young trees that need a lot of water, you could make a little berm around them. Pile up the earth in a donut shape around the tree. When it rains, the berm will catch the water and direct it towards the tree that needs it."
        },
        {
          "headline":"Install porous garden paths that reduce runoff.",
          "description":"When you make your garden paths, use bricks, gravel, or pebbles, which will allow the water to seep into the ground and nourish the plants. Otherwise, the water could flow down into your driveway and into the street."
        }
      ]
    }
  ],
  "text":" Watering Efficiently Look at the weather forecast before watering your garden. You’ll save a lot of water by making sure you absolutely need to water your garden. If enough rain is forecast in the coming days, you can avoid the task altogether and conserve water at the same time. Water your garden if the moisture meter reads 10-30% soil moisture. By putting a moisture meter in your garden, you can take some of the guesswork out of watering efficiently. Available at most hardware stores, a moisture meter is one of the most cost effective tools for conserving water in your garden. Take a look at the reading to determine whether you should water the garden:\nIf the meter reads 10-30% moisture, you’ll need to water your garden. If the meter reads 40-70% moisture, you don’t need to water. If the meter reads 80-100% moisture, you should avoid watering, since your soil is likely too moist for most plants. Reduce evaporation by watering your garden in the morning. Grab your watering can or turn on your drip irrigation system before it gets too hot and windy, which will give your plants the necessary supply of water to make it through the rest of the day. Avoid watering your garden in the evening because it is more likely for water to stay on leaves, which could lead to fungal growth. Monitor garden irrigation with a smart irrigation controller. A smart irrigation controller is a tool that uses local and national weather data to automatically adjust the irrigation of your garden. You can save a lot of water by using these systems, which allow you to monitor irrigation from an app on your smart phone. Some of the systems, such as the Rachio Iro Smart Sprinkler Controller, can be programmed to adjust to local weather changes, such as skipping a scheduled watering if rain pops up in the forecast. Systems cost in the range of $200 and $1,250. In some regions, you can get a rebate for using a smart irrigation controller. You may be able to save 9% of your water use per year by using a smart irrigation controller. Reusing Water Install a rain barrel. Instead of letting rain fall from your roof onto the street and into the storm drains, you could catch it in a barrel! You can purchase rain barrel collection systems from larger hardware stores. If you don’t have the time to set one up yourself, you may be able to find a local gardening company that will install it for you. Rain barrels cost between $80 and $100. Water your garden with cooking water. The next time you boil some potatoes, you could pour the leftover cooking water into a plastic bucket. When you go out to water your garden, use the bucket of potato water to nourish a few of the plants. If you have a fish tank, you could save the old water the next time you clean the tank. Use it to water part of your garden. Only do this if you have a freshwater tank, as saltwater is not good for plants. Reuse your shower water. Put a bucket in the shower before turning it on. As you wait for the water temperature to warm up, you’ll be catching the water that would normally go down the drain. Put the bucket on your porch and use it to water a few plants the next time you have to water the garden. Retaining Water in Your Soil Mulch your garden with bark chip mulch. Because mulch prevents water from evaporating and holds moisture in the soil, it is an excellent way to conserve water. Choose a coarser mulch such as bark chip mulch, which will allow water to move down into the soil. Apply 3 or 4 inches (8-10 centimeters) of mulch to your garden bed. If you are container gardening, you can use 3-5 centimeters in your pot. Add organic matter to your soil to improve moisture retention. Add worm castings and compost to your garden soil to improve its structure and ability to retain moisture. Your garden soil will stay moist and retain nutrients for longer with the regular addition of compost. Ring trees and bushes with stones. Place large stones in a circle around trees, bushes, and other plants that require a lot of water. Stack the stones in several layers to trap moisture and create condensation, which produces a cooling effect that will allows the soil to retain water better. Designing a Water Efficient Garden Design your garden with different watering zones. Put plants with similar watering needs together, so that you avoid overwatering plants that have low water requirements simply because they are beside plants that need a lot of water. You should also be familiar with the type of plants and shrubs you have in your yard and garden so that you know what their exact watering needs are. If you have plants in containers, you can place the big ones so that they give shadow to the small plants. With more shade, the small plants will lose less water to evaporation. Improve watering efficiency with a drip irrigation system. Because drip irrigation systems deliver the water directly to the root systems in your garden, they are much more efficient. The water goes right to your plants without running off or evaporating. Connect a soaker hose to your tap and run it through your garden bed. Whenever you want to water the bed, just turn on the hose. Spray irrigation, such as a sprinkler, is only 50-75% efficient. Drip irrigation is 95-99% efficient. You can also use a smart irrigation controller to run your drip irrigation system. You can also install drip irrigation for a lawn but it needs to be subsurface by four to six feet. Choose native plants that are adapted to local rainfall patterns. Since native plants are adapted to your local climate, they won’t need much water beyond the regular rainfall for your region. You can find native plants for your region by contacting your local native plant society. You can search for your local native plant society by visiting the North American Native Plant Society website. If you live in Alberta, you can visit the website of the Alberta Native Plants Council. If you live in California, you can contact the California Native Plant Society. Plant drought-resistant plants that need less water. One of the best ways to garden with less water is to choose varieties that are drought-resistant, which often have silver and grey-green leaves that reflect sun rays. Another way to spot a drought-resistant variety is the fine hairs that grow on their stems and leaves, which trap moisture. Some drought-resistant plants include:\nMimosa (Acacia dealbata)\nHop tree (Ptelea trifoliata ‘Aurea’)\nLawson cypress (Chamaecyparis lawsoniana)\nSacred bamboo (Nandina domestica)\nSilver jubilee (Ozothamnus rosmarinifolius)\nVerbena\nEchinops\nBidens\nFelicia Choose small, slow-growing plants. When you are planting, you should choose small, slow-growing plants, which require less water. Similarly, you should avoid large-leafed plants, which tend to use a lot of water. Make a berm around water-intensive trees and shrubs. If you have some young trees that need a lot of water, you could make a little berm around them. Pile up the earth in a donut shape around the tree. When it rains, the berm will catch the water and direct it towards the tree that needs it. Install porous garden paths that reduce runoff. When you make your garden paths, use bricks, gravel, or pebbles, which will allow the water to seep into the ground and nourish the plants. Otherwise, the water could flow down into your driveway and into the street.",
  "sentences":[
    " Watering Efficiently Look at the weather forecast before watering your garden.",
    "You’ll save a lot of water by making sure you absolutely need to water your garden.",
    "If enough rain is forecast in the coming days, you can avoid the task altogether and conserve water at the same time.",
    "Water your garden if the moisture meter reads 10-30% soil moisture.",
    "By putting a moisture meter in your garden, you can take some of the guesswork out of watering efficiently.",
    "Available at most hardware stores, a moisture meter is one of the most cost effective tools for conserving water in your garden.",
    "Take a look at the reading to determine whether you should water the garden:\nIf the meter reads 10-30% moisture, you’ll need to water your garden.",
    "If the meter reads 40-70% moisture, you don’t need to water.",
    "If the meter reads 80-100% moisture, you should avoid watering, since your soil is likely too moist for most plants.",
    "Reduce evaporation by watering your garden in the morning.",
    "Grab your watering can or turn on your drip irrigation system before it gets too hot and windy, which will give your plants the necessary supply of water to make it through the rest of the day.",
    "Avoid watering your garden in the evening because it is more likely for water to stay on leaves, which could lead to fungal growth.",
    "Monitor garden irrigation with a smart irrigation controller.",
    "A smart irrigation controller is a tool that uses local and national weather data to automatically adjust the irrigation of your garden.",
    "You can save a lot of water by using these systems, which allow you to monitor irrigation from an app on your smart phone.",
    "Some of the systems, such as the Rachio Iro Smart Sprinkler Controller, can be programmed to adjust to local weather changes, such as skipping a scheduled watering if rain pops up in the forecast.",
    "Systems cost in the range of $200 and $1,250.",
    "In some regions, you can get a rebate for using a smart irrigation controller.",
    "You may be able to save 9% of your water use per year by using a smart irrigation controller.",
    "Reusing Water Install a rain barrel.",
    "Instead of letting rain fall from your roof onto the street and into the storm drains, you could catch it in a barrel!",
    "You can purchase rain barrel collection systems from larger hardware stores.",
    "If you don’t have the time to set one up yourself, you may be able to find a local gardening company that will install it for you.",
    "Rain barrels cost between $80 and $100.",
    "Water your garden with cooking water.",
    "The next time you boil some potatoes, you could pour the leftover cooking water into a plastic bucket.",
    "When you go out to water your garden, use the bucket of potato water to nourish a few of the plants.",
    "If you have a fish tank, you could save the old water the next time you clean the tank.",
    "Use it to water part of your garden.",
    "Only do this if you have a freshwater tank, as saltwater is not good for plants.",
    "Reuse your shower water.",
    "Put a bucket in the shower before turning it on.",
    "As you wait for the water temperature to warm up, you’ll be catching the water that would normally go down the drain.",
    "Put the bucket on your porch and use it to water a few plants the next time you have to water the garden.",
    "Retaining Water in Your Soil Mulch your garden with bark chip mulch.",
    "Because mulch prevents water from evaporating and holds moisture in the soil, it is an excellent way to conserve water.",
    "Choose a coarser mulch such as bark chip mulch, which will allow water to move down into the soil.",
    "Apply 3 or 4 inches (8-10 centimeters) of mulch to your garden bed.",
    "If you are container gardening, you can use 3-5 centimeters in your pot.",
    "Add organic matter to your soil to improve moisture retention.",
    "Add worm castings and compost to your garden soil to improve its structure and ability to retain moisture.",
    "Your garden soil will stay moist and retain nutrients for longer with the regular addition of compost.",
    "Ring trees and bushes with stones.",
    "Place large stones in a circle around trees, bushes, and other plants that require a lot of water.",
    "Stack the stones in several layers to trap moisture and create condensation, which produces a cooling effect that will allows the soil to retain water better.",
    "Designing a Water Efficient Garden Design your garden with different watering zones.",
    "Put plants with similar watering needs together, so that you avoid overwatering plants that have low water requirements simply because they are beside plants that need a lot of water.",
    "You should also be familiar with the type of plants and shrubs you have in your yard and garden so that you know what their exact watering needs are.",
    "If you have plants in containers, you can place the big ones so that they give shadow to the small plants.",
    "With more shade, the small plants will lose less water to evaporation.",
    "Improve watering efficiency with a drip irrigation system.",
    "Because drip irrigation systems deliver the water directly to the root systems in your garden, they are much more efficient.",
    "The water goes right to your plants without running off or evaporating.",
    "Connect a soaker hose to your tap and run it through your garden bed.",
    "Whenever you want to water the bed, just turn on the hose.",
    "Spray irrigation, such as a sprinkler, is only 50-75% efficient.",
    "Drip irrigation is 95-99% efficient.",
    "You can also use a smart irrigation controller to run your drip irrigation system.",
    "You can also install drip irrigation for a lawn but it needs to be subsurface by four to six feet.",
    "Choose native plants that are adapted to local rainfall patterns.",
    "Since native plants are adapted to your local climate, they won’t need much water beyond the regular rainfall for your region.",
    "You can find native plants for your region by contacting your local native plant society.",
    "You can search for your local native plant society by visiting the North American Native Plant Society website.",
    "If you live in Alberta, you can visit the website of the Alberta Native Plants Council.",
    "If you live in California, you can contact the California Native Plant Society.",
    "Plant drought-resistant plants that need less water.",
    "One of the best ways to garden with less water is to choose varieties that are drought-resistant, which often have silver and grey-green leaves that reflect sun rays.",
    "Another way to spot a drought-resistant variety is the fine hairs that grow on their stems and leaves, which trap moisture.",
    "Some drought-resistant plants include:\nMimosa (Acacia dealbata)\nHop tree (Ptelea trifoliata ‘Aurea’)\nLawson cypress (Chamaecyparis lawsoniana)\nSacred bamboo (Nandina domestica)\nSilver jubilee (Ozothamnus rosmarinifolius)\nVerbena\nEchinops\nBidens\nFelicia Choose small, slow-growing plants.",
    "When you are planting, you should choose small, slow-growing plants, which require less water.",
    "Similarly, you should avoid large-leafed plants, which tend to use a lot of water.",
    "Make a berm around water-intensive trees and shrubs.",
    "If you have some young trees that need a lot of water, you could make a little berm around them.",
    "Pile up the earth in a donut shape around the tree.",
    "When it rains, the berm will catch the water and direct it towards the tree that needs it.",
    "Install porous garden paths that reduce runoff.",
    "When you make your garden paths, use bricks, gravel, or pebbles, which will allow the water to seep into the ground and nourish the plants.",
    "Otherwise, the water could flow down into your driveway and into the street."
  ],
  "tyn_section":[
    "Drip irrigation system",
    "Native plants",
    "Drought-resistant plants",
    "Large stones",
    "Coarse mulch"
  ],
  "tyn_model":[
    "water",
    "smart irrigation controller",
    "moisture meter",
    "drip irrigation",
    "bucket",
    "mulch",
    "stones",
    "rain barrel",
    "cooking water",
    "bark chip mulch",
    "compost",
    "rachio iro smart sprinkler controller",
    "rain barrels",
    "plastic bucket",
    "potato water",
    "organic matter",
    "containers",
    "drip irrigation system",
    "drip irrigation systems",
    "soaker hose",
    "hose",
    "‘aurea",
    "’)",
    "sacred bamboo",
    "verbena",
    "echinops",
    "earth",
    "gravel",
    "pebbles"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0344827586,
    "f1":0.0588235294,
    "avg_pos":0.5862068966
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.1724137931,
    "f1":0.2678571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.1724137931,
    "f1":0.2678571429
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.0689655172,
    "f1":0.1025641026
  }
}