{
  "title":"How to Make Homemade Vanilla Frosting",
  "url":"https://www.wikihow.com/Make-Homemade-Vanilla-Frosting",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Preparing a Simple Buttercream Frosting",
      "steps":[
        {
          "headline":"Soften your butter at room temperature.",
          "description":"Leave 1/3 of a cup (80 g) of butter to sit out on the countertop until it’s soft enough to squish between your thumb and forefinger. This will usually take around 30 minutes to an hour. If you want to speed things along, try cutting your butter into small cubes, flattening it with a rolling pin, or setting it over a shallow bowl filled warm water. Softened butter is much easier to mix and beat than butter that’s fresh out of the ‘fridge."
        },
        {
          "headline":"Combine your softened butter and sugar in a large mixing bowl.",
          "description":"Transfer your butter to the bowl, then shake in 2-3 cups (200-300 g) of confectioners sugar. Fold the butter and sugar together using a spatula until they form a loose mixture. If you want your frosting to be nice and sweet, use a full 3 cups (300 g) of sugar. If you’d prefer a more subtle flavor, use closer to 2 cups (200 g). There’s no need to spend too much time working your butter and sugar at this stage, since you’ll be mixing all of your ingredients thoroughly later on."
        },
        {
          "headline":"Add your milk or cream and vanilla extract.",
          "description":"Pour in 2 tablespoons (30 mL) of milk or cream and ⁄2–1 teaspoon (2.5–4.9 mL) of vanilla and fold your ingredients together once again. You can adjust the amount of vanilla you use to suit your tastes, if you like. Heavy cream will produce a richer, more dense frosting than milk. Be careful not to add more than about 1.5 teaspoons (7.4 mL) of vanilla extract, as too much can easily become overpowering."
        },
        {
          "headline":"Beat your ingredients with a hand mixer until they become smooth.",
          "description":"Move the mixer in all directions to ensure that your ingredients get whipped properly. Continue beating your frosting for 1-2 minutes, or until it takes on a light, fluffy consistency. Set your mixer to low or medium speed to avoid sending bits of frosting flying everywhere.Alternative: If you’re worried about your frosting coming out too thin, you can also add 1 tablespoon (15 mL) of milk or cream to start, then incorporate your other 1 tablespoon (15 mL) gradually as you begin mixing."
        },
        {
          "headline":"Cover and store your frosting until you’re ready to use it.",
          "description":"Just stretch a sheet of plastic wrap over the mixing bowl and find some room for it on your countertop. You could also transfer your frosting to a lidded container to make sure no air gets inside. It will keep for about 2-3 days when stored at room temperature. Alternatively, you can put your frosting in the refrigerator, where it will stay fresh for up to 2 weeks. The large quantity of sugar in your homemade frosting will serve to stabilize the milk or cream, which means it can be left out of the refrigerator safely."
        }
      ]
    },
    {
      "name":"Making a Light, Airy Cooked Frosting",
      "steps":[
        {
          "headline":"Whisk your flour and milk together in a small saucepan.",
          "description":"Add 1/4 of a cup (30 g) of all-purpose flour and 2 cups (470 mL) of whole milk to the saucepan. Stir the two ingredients together until they form a uniform mixture. For best results, do your stirring with an actual whisk rather than a spatula or spoon. The open wire head will do a better job of breaking up clumps."
        },
        {
          "headline":"Heat the milk mixture over medium heat until it thickens.",
          "description":"This will most likely take 10-15 minutes. Stir the liquid periodically as it thickens to keep it from clumping or scorching. In order for it to give your frosting the desired texture, it needs to remain as smooth as possible. By the time your milk mixture is done thickening, it will have a consistency similar to pudding."
        },
        {
          "headline":"Allow your milk mixture to cool completely.",
          "description":"Remove the saucepan from the cooktop and set it aside to let its contents cool. After the first 15 minutes, transfer the mixture to the refrigerator to finish cooling for 30 minutes to an hour. Cover the milk mixture with a sheet of wax paper or plastic wrap as it cools. This will prevent a skin from developing on the outer surface. By cooling the milk and flour at room temperature before moving it into the refrigerator, you’ll avoid “shocking” it, which can cause it to turn pasty or gummy."
        },
        {
          "headline":"Beat your butter, sugar, and vanilla together gradually in a stand mixer.",
          "description":"Measure out 2 cups (480 g) of softened butter in the mixing bowl and process it on high speed for about 3 minutes. While the mixer is still running, shake in 2 cups (400 g) of sugar. Finally, add 2 teaspoons (9.9 mL) of vanilla extract and beat all three ingredients thoroughly for 2-3 minutes. For this recipe, you have the option of using either granulated white sugar or confectioners sugar. Both types of sugar will produce similar results. To save time, start mixing your other main ingredients while your milk mixture finishes cooling.Tip: The key to getting a perfectly velvety frosting is to add each of your ingredients a little at a time."
        },
        {
          "headline":"Add your cooled milk mixture and continue beating for about 1 minute.",
          "description":"Remove the milk mixture from the refrigerator and scrape it into the bowl, then reduce the mixer speed to medium. After 30 seconds to a minute, your frosting will be smooth, creamy, and ready to spread onto all your favorite confections! Make sure you scrape every last bit of frosting out of your mixer when you’re done—it would be a shame to waste even a little!"
        },
        {
          "headline":"Use your frosting as soon as possible.",
          "description":"Cooked frostings are easiest to spread while they’re fresh. For this reason, it’s best to smooth your homemade vanilla frosting onto a cake, cookie, or other treat as soon as you’re done preparing it. The longer you let your frosting sit, the more it will solidify. If for some reason you’re not able to use your frosting right away, cover the bowl with a sheet of plastic wrap and store it in the refrigerator. It should keep for up to a week. When you’re ready to put the finishing touches on your favorite dessert, allow your frosting to warm to room temperature and beat it on a slow speed for 1-2 minutes before working with it."
        }
      ]
    }
  ],
  "text":" Preparing a Simple Buttercream Frosting Soften your butter at room temperature. Leave 1/3 of a cup (80 g) of butter to sit out on the countertop until it’s soft enough to squish between your thumb and forefinger. This will usually take around 30 minutes to an hour. If you want to speed things along, try cutting your butter into small cubes, flattening it with a rolling pin, or setting it over a shallow bowl filled warm water. Softened butter is much easier to mix and beat than butter that’s fresh out of the ‘fridge. Combine your softened butter and sugar in a large mixing bowl. Transfer your butter to the bowl, then shake in 2-3 cups (200-300 g) of confectioners sugar. Fold the butter and sugar together using a spatula until they form a loose mixture. If you want your frosting to be nice and sweet, use a full 3 cups (300 g) of sugar. If you’d prefer a more subtle flavor, use closer to 2 cups (200 g). There’s no need to spend too much time working your butter and sugar at this stage, since you’ll be mixing all of your ingredients thoroughly later on. Add your milk or cream and vanilla extract. Pour in 2 tablespoons (30 mL) of milk or cream and ⁄2–1 teaspoon (2.5–4.9 mL) of vanilla and fold your ingredients together once again. You can adjust the amount of vanilla you use to suit your tastes, if you like. Heavy cream will produce a richer, more dense frosting than milk. Be careful not to add more than about 1.5 teaspoons (7.4 mL) of vanilla extract, as too much can easily become overpowering. Beat your ingredients with a hand mixer until they become smooth. Move the mixer in all directions to ensure that your ingredients get whipped properly. Continue beating your frosting for 1-2 minutes, or until it takes on a light, fluffy consistency. Set your mixer to low or medium speed to avoid sending bits of frosting flying everywhere.Alternative: If you’re worried about your frosting coming out too thin, you can also add 1 tablespoon (15 mL) of milk or cream to start, then incorporate your other 1 tablespoon (15 mL) gradually as you begin mixing. Cover and store your frosting until you’re ready to use it. Just stretch a sheet of plastic wrap over the mixing bowl and find some room for it on your countertop. You could also transfer your frosting to a lidded container to make sure no air gets inside. It will keep for about 2-3 days when stored at room temperature. Alternatively, you can put your frosting in the refrigerator, where it will stay fresh for up to 2 weeks. The large quantity of sugar in your homemade frosting will serve to stabilize the milk or cream, which means it can be left out of the refrigerator safely. Making a Light, Airy Cooked Frosting Whisk your flour and milk together in a small saucepan. Add 1/4 of a cup (30 g) of all-purpose flour and 2 cups (470 mL) of whole milk to the saucepan. Stir the two ingredients together until they form a uniform mixture. For best results, do your stirring with an actual whisk rather than a spatula or spoon. The open wire head will do a better job of breaking up clumps. Heat the milk mixture over medium heat until it thickens. This will most likely take 10-15 minutes. Stir the liquid periodically as it thickens to keep it from clumping or scorching. In order for it to give your frosting the desired texture, it needs to remain as smooth as possible. By the time your milk mixture is done thickening, it will have a consistency similar to pudding. Allow your milk mixture to cool completely. Remove the saucepan from the cooktop and set it aside to let its contents cool. After the first 15 minutes, transfer the mixture to the refrigerator to finish cooling for 30 minutes to an hour. Cover the milk mixture with a sheet of wax paper or plastic wrap as it cools. This will prevent a skin from developing on the outer surface. By cooling the milk and flour at room temperature before moving it into the refrigerator, you’ll avoid “shocking” it, which can cause it to turn pasty or gummy. Beat your butter, sugar, and vanilla together gradually in a stand mixer. Measure out 2 cups (480 g) of softened butter in the mixing bowl and process it on high speed for about 3 minutes. While the mixer is still running, shake in 2 cups (400 g) of sugar. Finally, add 2 teaspoons (9.9 mL) of vanilla extract and beat all three ingredients thoroughly for 2-3 minutes. For this recipe, you have the option of using either granulated white sugar or confectioners sugar. Both types of sugar will produce similar results. To save time, start mixing your other main ingredients while your milk mixture finishes cooling.Tip: The key to getting a perfectly velvety frosting is to add each of your ingredients a little at a time. Add your cooled milk mixture and continue beating for about 1 minute. Remove the milk mixture from the refrigerator and scrape it into the bowl, then reduce the mixer speed to medium. After 30 seconds to a minute, your frosting will be smooth, creamy, and ready to spread onto all your favorite confections! Make sure you scrape every last bit of frosting out of your mixer when you’re done—it would be a shame to waste even a little! Use your frosting as soon as possible. Cooked frostings are easiest to spread while they’re fresh. For this reason, it’s best to smooth your homemade vanilla frosting onto a cake, cookie, or other treat as soon as you’re done preparing it. The longer you let your frosting sit, the more it will solidify. If for some reason you’re not able to use your frosting right away, cover the bowl with a sheet of plastic wrap and store it in the refrigerator. It should keep for up to a week. When you’re ready to put the finishing touches on your favorite dessert, allow your frosting to warm to room temperature and beat it on a slow speed for 1-2 minutes before working with it.",
  "sentences":[
    " Preparing a Simple Buttercream Frosting Soften your butter at room temperature.",
    "Leave 1/3 of a cup (80 g) of butter to sit out on the countertop until it’s soft enough to squish between your thumb and forefinger.",
    "This will usually take around 30 minutes to an hour.",
    "If you want to speed things along, try cutting your butter into small cubes, flattening it with a rolling pin, or setting it over a shallow bowl filled warm water.",
    "Softened butter is much easier to mix and beat than butter that’s fresh out of the ‘fridge.",
    "Combine your softened butter and sugar in a large mixing bowl.",
    "Transfer your butter to the bowl, then shake in 2-3 cups (200-300 g) of confectioners sugar.",
    "Fold the butter and sugar together using a spatula until they form a loose mixture.",
    "If you want your frosting to be nice and sweet, use a full 3 cups (300 g) of sugar.",
    "If you’d prefer a more subtle flavor, use closer to 2 cups (200 g).",
    "There’s no need to spend too much time working your butter and sugar at this stage, since you’ll be mixing all of your ingredients thoroughly later on.",
    "Add your milk or cream and vanilla extract.",
    "Pour in 2 tablespoons (30 mL) of milk or cream and ⁄2–1 teaspoon (2.5–4.9 mL) of vanilla and fold your ingredients together once again.",
    "You can adjust the amount of vanilla you use to suit your tastes, if you like.",
    "Heavy cream will produce a richer, more dense frosting than milk.",
    "Be careful not to add more than about 1.5 teaspoons (7.4 mL) of vanilla extract, as too much can easily become overpowering.",
    "Beat your ingredients with a hand mixer until they become smooth.",
    "Move the mixer in all directions to ensure that your ingredients get whipped properly.",
    "Continue beating your frosting for 1-2 minutes, or until it takes on a light, fluffy consistency.",
    "Set your mixer to low or medium speed to avoid sending bits of frosting flying everywhere.Alternative: If you’re worried about your frosting coming out too thin, you can also add 1 tablespoon (15 mL) of milk or cream to start, then incorporate your other 1 tablespoon (15 mL) gradually as you begin mixing.",
    "Cover and store your frosting until you’re ready to use it.",
    "Just stretch a sheet of plastic wrap over the mixing bowl and find some room for it on your countertop.",
    "You could also transfer your frosting to a lidded container to make sure no air gets inside.",
    "It will keep for about 2-3 days when stored at room temperature.",
    "Alternatively, you can put your frosting in the refrigerator, where it will stay fresh for up to 2 weeks.",
    "The large quantity of sugar in your homemade frosting will serve to stabilize the milk or cream, which means it can be left out of the refrigerator safely.",
    "Making a Light, Airy Cooked Frosting Whisk your flour and milk together in a small saucepan.",
    "Add 1/4 of a cup (30 g) of all-purpose flour and 2 cups (470 mL) of whole milk to the saucepan.",
    "Stir the two ingredients together until they form a uniform mixture.",
    "For best results, do your stirring with an actual whisk rather than a spatula or spoon.",
    "The open wire head will do a better job of breaking up clumps.",
    "Heat the milk mixture over medium heat until it thickens.",
    "This will most likely take 10-15 minutes.",
    "Stir the liquid periodically as it thickens to keep it from clumping or scorching.",
    "In order for it to give your frosting the desired texture, it needs to remain as smooth as possible.",
    "By the time your milk mixture is done thickening, it will have a consistency similar to pudding.",
    "Allow your milk mixture to cool completely.",
    "Remove the saucepan from the cooktop and set it aside to let its contents cool.",
    "After the first 15 minutes, transfer the mixture to the refrigerator to finish cooling for 30 minutes to an hour.",
    "Cover the milk mixture with a sheet of wax paper or plastic wrap as it cools.",
    "This will prevent a skin from developing on the outer surface.",
    "By cooling the milk and flour at room temperature before moving it into the refrigerator, you’ll avoid “shocking” it, which can cause it to turn pasty or gummy.",
    "Beat your butter, sugar, and vanilla together gradually in a stand mixer.",
    "Measure out 2 cups (480 g) of softened butter in the mixing bowl and process it on high speed for about 3 minutes.",
    "While the mixer is still running, shake in 2 cups (400 g) of sugar.",
    "Finally, add 2 teaspoons (9.9 mL) of vanilla extract and beat all three ingredients thoroughly for 2-3 minutes.",
    "For this recipe, you have the option of using either granulated white sugar or confectioners sugar.",
    "Both types of sugar will produce similar results.",
    "To save time, start mixing your other main ingredients while your milk mixture finishes cooling.Tip: The key to getting a perfectly velvety frosting is to add each of your ingredients a little at a time.",
    "Add your cooled milk mixture and continue beating for about 1 minute.",
    "Remove the milk mixture from the refrigerator and scrape it into the bowl, then reduce the mixer speed to medium.",
    "After 30 seconds to a minute, your frosting will be smooth, creamy, and ready to spread onto all your favorite confections!",
    "Make sure you scrape every last bit of frosting out of your mixer when you’re done—it would be a shame to waste even a little!",
    "Use your frosting as soon as possible.",
    "Cooked frostings are easiest to spread while they’re fresh.",
    "For this reason, it’s best to smooth your homemade vanilla frosting onto a cake, cookie, or other treat as soon as you’re done preparing it.",
    "The longer you let your frosting sit, the more it will solidify.",
    "If for some reason you’re not able to use your frosting right away, cover the bowl with a sheet of plastic wrap and store it in the refrigerator.",
    "It should keep for up to a week.",
    "When you’re ready to put the finishing touches on your favorite dessert, allow your frosting to warm to room temperature and beat it on a slow speed for 1-2 minutes before working with it."
  ],
  "tyn_section":[
    "Buttercream Frosting",
    "Large mixing bowl",
    "Hand mixer",
    "Spatula",
    "Measuring cups and spoons",
    "Cooked Vanilla Frosting",
    "Small saucepan",
    "Electric mixer",
    "Wire whisk",
    "Wooden spoon or spatula",
    "Wax paper or plastic cling wrap"
  ],
  "tyn_model":[
    "milk",
    "butter",
    "sugar",
    "cream",
    "mixer",
    "refrigerator",
    "vanilla extract",
    "vanilla",
    "frosting",
    "plastic wrap",
    "confectioners sugar",
    "spatula",
    "mixing bowl",
    "flour",
    "saucepan",
    "buttercream frosting",
    "‘fridge",
    "large mixing bowl",
    "hand mixer",
    "small saucepan",
    "all-purpose flour",
    "whole milk",
    "whisk",
    "spoon",
    "cooktop",
    "wax paper",
    "“shocking",
    "” it",
    "stand mixer",
    "granulated white sugar",
    "bowl",
    "—it",
    "vanilla frosting"
  ],
  "simple_metrics":{
    "r":0.4545454545,
    "p":0.1515151515,
    "f1":0.2272727273,
    "avg_pos":0.4545454545
  },
  "jacc_metrics_0.5":{
    "r":0.7272727273,
    "p":0.3333333333,
    "f1":0.4571428571
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8181818182,
    "p":0.4848484848,
    "f1":0.6088794926
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5454545455,
    "p":0.2121212121,
    "f1":0.3054545455
  }
}