{
  "title":"How to Control Black Spot on Roses",
  "url":"https://www.wikihow.com/Control-Black-Spot-on-Roses",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers",
    "Roses"
  ],
  "methods":[
    {
      "name":"Stopping Black Spot Outbreaks",
      "steps":[
        {
          "headline":"Cut off infected leaves and branches in dry weather.",
          "description":"When you notice back spots on your roses, work quickly. Wait for a day when it isn’t raining. Then use a sharp pair of garden shears and prune all the leaves and branches that have black spot on them. Working in dry weather is important for preventing black spot from spreading because the fungus grows better in damp weather."
        },
        {
          "headline":"Disinfect your pruning shears after every cut to avoid spreading fungus.",
          "description":"Black spot is very contagious and can spread easily between plants. Always disinfect your tools to avoid spreading it while you prune away infected areas. Make a 1:1 mixture of bleach and isopropyl alcohol in a cup. Then dip your shears into the mixture before and after every cut to kill any fungal spores. Dry your pruning tools before storing them so they don't rust."
        },
        {
          "headline":"Throw infected foliage away without letting it touch other plants.",
          "description":"Don’t use the infected leaves in your compost pile or leave them lying around. Pick them up right away and throw them in the garbage. Otherwise, you risk spreading the black spot to other plants."
        },
        {
          "headline":"Treat the plants with a fungicidal spray.",
          "description":"Fungicidal spray won’t treat the black spot already on the leaves, but it can prevent it from spreading further. Use a fungicide designed to fight black spot. Spray the whole plant as well as any nearby plants that may not show symptoms yet. Repeat spraying every 7-14 days for 3 sprayings to prevent the fungus from spreading. There are many fungicides available that fight black spot. Speak with an employee at a local garden store about the breed of rose you have to find the best product for your needs. Look for fungicides with active ingredients including  captan, chlorothalonil (Daconil), copper, ferbam, mancozeb, maneb, triforine (Funginex), sulfur, thiophanate methyl (Cleary 3336), and ziram. These are most effective in fighting black spot. Check if there are any restrictions on chemical application in your community before using the spray."
        },
        {
          "headline":"Use an organic solution if you want to avoid strong chemicals.",
          "description":"There are also a few homemade and store-bought organic alternatives to fungicide. Consider one of the following solutions if you have pets or children and don't want them touching chemicals in your garden. Mix 1.5 tbsp (9 g) of baking soda, 2 tbsp (30 ml) of vegetable oil, 1.5 tbsp (22.5 ml) of liquid hand soap, and 1 gallon (3.7 L) of water. Load the mixture into a spray bottle. Shake it and then spray all the affected plants every 7 days until the fungus recedes. Commercial sulfur spray is also effective against black spot. This is an organic alternative to other fungicides. Look at your local nursery or garden center for a bottle."
        },
        {
          "headline":"Move the roses to a sunny location if possible.",
          "description":"Fungus grows well in damp, cool areas. If your roses are in pots, relocate the plants to a sunnier spot. This keeps them drier and warmer, discouraging further plant growth. If your roses are not in pots, consider digging them up and replanting them in a sunnier location."
        },
        {
          "headline":"Dig out roses if you can't get the infection under control.",
          "description":"If you've tried all these prevention methods but the black spot won't recede, then remove the infected plant before it infects others. Although you may not want to do this, it's necessary to save the rest of your garden. Dig the entire plant out, roots and all. Don't leave anything behind. Remember to clean up any remnants the plant leaves behind, like twigs and leaves. These can spread the fungus to other plants."
        }
      ]
    },
    {
      "name":"Preventing Fungal Growth",
      "steps":[
        {
          "headline":"Plant black spot-resistant breeds of roses.",
          "description":"Some rose breeds are much more resistant to black spot than others. Particularly resistant breeds are Fortyniner, Coronado, Carefree Beauty, Simplicity, Bonica, and Grand Opera. Ask at your local nursery or garden center if any of these breeds are available. Remember that just because a breed is resistant to black spot doesn’t mean that breed will grow well in your area. Find a breed that’s suited to your local climate. Most yellow and copper-colored roses are particularly susceptible to black spot. Avoid these breeds to prevent outbreaks."
        },
        {
          "headline":"Grow your roses in a sunny spot so they stay warm and dry.",
          "description":"Fungus grows best in cool, damp environments. Discourage fungal growth by planting the roses in the sunniest parts of your property. This burns off excess moisture on the roses and foliage around them. Consider planting your roses in pots so you can move them around to sunnier spots if you have to."
        },
        {
          "headline":"Space your roses 24–36 in (61–91 cm) apart to allow good air flow.",
          "description":"If the roses are too close together, air won't circulate well and moisture will build up. The exact spacing depends on the type of rose you plant, but generally allow 24–36 in (61–91 cm) between each bush when you're planting. Ask an employee at the nursery what the ideal spacing for your rose breed is. Also prune your roses if they're growing close to each other."
        },
        {
          "headline":"Rake up all leaves and foliage around the roses.",
          "description":"Dead leaves and other foliage can support fungal spores and spread them to other plants. Rake your yard whenever leaves or other debris start accumulating. Make sure to remove all the foliage within a few feet of the roses. Clean up your yard especially after it rains. Wet foliage encourages fungal growth. If you have a compost pile, locate it far away from the roses."
        },
        {
          "headline":"Prune damaged parts of the plant.",
          "description":"Damaged parts of the plant are especially susceptible to fungal growth. Monitor your roses and look for breaks, cuts, or other damage. Trim these parts away to discourage fungal growth. Use a sharp pair of garden scissors to get a clean cut through the plant. Prune in dry weather so excess moisture doesn’t enter the plant."
        },
        {
          "headline":"Prevent the leaves and flowers from getting wet when you water.",
          "description":"Letting moist debris and soil sit around creates a good environment for fungus. When you water, aim at the soil and not the plant itself. Don't use an overhead watering system. This keeps the leaves as dry as possible. Water early in the morning so the water evaporates throughout the day. If you located your roses in a sunny spot, this should be no problem. The leaves will still get wet in the rain. This is why planting your roses in a sunny spot is important."
        },
        {
          "headline":"Treat the roses with a fungicide if they’re susceptible to black spot.",
          "description":"If you don’t have a black spot-resistant breed, spray them regularly with fungicide to prevent infections. Most sprays suggest a 7-14-day schedule. Follow the directions on any product you use to get the best results. Remember that fungicides don’t kill black spot if it’s already growing. They only prevent it from spreading."
        },
        {
          "headline":"Spread mulch to neutralize fungus spores in the soil.",
          "description":"The mulch covers up spores in the soil and prevents them from getting kicked up onto the plants. Spread 2–3 inches (5.1–7.6 cm) on mulch on all the soil in your garden to cover up any spores that may be hiding at ground level. If there was mulch on the ground when the black spot started, rake that all away and place a new layer down. The old mulch could be infected with spores."
        },
        {
          "headline":"Inspect your roses regularly and treat black spot as soon as possible.",
          "description":"Even with all these precautions, it’s possible that black spot will still break out on one of your rose plants. Monitor your plants and inspect them once a week for any discolorations or other signs of black spot. If you do find black spot, work fast to stop it from spreading further. The most common early symptom of black spot is yellowing leaves. Then the characteristic black spots appear and spread throughout the leaf. Eventually, the leaves start falling off and the plant dies."
        }
      ]
    }
  ],
  "text":" Stopping Black Spot Outbreaks Cut off infected leaves and branches in dry weather. When you notice back spots on your roses, work quickly. Wait for a day when it isn’t raining. Then use a sharp pair of garden shears and prune all the leaves and branches that have black spot on them. Working in dry weather is important for preventing black spot from spreading because the fungus grows better in damp weather. Disinfect your pruning shears after every cut to avoid spreading fungus. Black spot is very contagious and can spread easily between plants. Always disinfect your tools to avoid spreading it while you prune away infected areas. Make a 1:1 mixture of bleach and isopropyl alcohol in a cup. Then dip your shears into the mixture before and after every cut to kill any fungal spores. Dry your pruning tools before storing them so they don't rust. Throw infected foliage away without letting it touch other plants. Don’t use the infected leaves in your compost pile or leave them lying around. Pick them up right away and throw them in the garbage. Otherwise, you risk spreading the black spot to other plants. Treat the plants with a fungicidal spray. Fungicidal spray won’t treat the black spot already on the leaves, but it can prevent it from spreading further. Use a fungicide designed to fight black spot. Spray the whole plant as well as any nearby plants that may not show symptoms yet. Repeat spraying every 7-14 days for 3 sprayings to prevent the fungus from spreading. There are many fungicides available that fight black spot. Speak with an employee at a local garden store about the breed of rose you have to find the best product for your needs. Look for fungicides with active ingredients including  captan, chlorothalonil (Daconil), copper, ferbam, mancozeb, maneb, triforine (Funginex), sulfur, thiophanate methyl (Cleary 3336), and ziram. These are most effective in fighting black spot. Check if there are any restrictions on chemical application in your community before using the spray. Use an organic solution if you want to avoid strong chemicals. There are also a few homemade and store-bought organic alternatives to fungicide. Consider one of the following solutions if you have pets or children and don't want them touching chemicals in your garden. Mix 1.5 tbsp (9 g) of baking soda, 2 tbsp (30 ml) of vegetable oil, 1.5 tbsp (22.5 ml) of liquid hand soap, and 1 gallon (3.7 L) of water. Load the mixture into a spray bottle. Shake it and then spray all the affected plants every 7 days until the fungus recedes. Commercial sulfur spray is also effective against black spot. This is an organic alternative to other fungicides. Look at your local nursery or garden center for a bottle. Move the roses to a sunny location if possible. Fungus grows well in damp, cool areas. If your roses are in pots, relocate the plants to a sunnier spot. This keeps them drier and warmer, discouraging further plant growth. If your roses are not in pots, consider digging them up and replanting them in a sunnier location. Dig out roses if you can't get the infection under control. If you've tried all these prevention methods but the black spot won't recede, then remove the infected plant before it infects others. Although you may not want to do this, it's necessary to save the rest of your garden. Dig the entire plant out, roots and all. Don't leave anything behind. Remember to clean up any remnants the plant leaves behind, like twigs and leaves. These can spread the fungus to other plants. Preventing Fungal Growth Plant black spot-resistant breeds of roses. Some rose breeds are much more resistant to black spot than others. Particularly resistant breeds are Fortyniner, Coronado, Carefree Beauty, Simplicity, Bonica, and Grand Opera. Ask at your local nursery or garden center if any of these breeds are available. Remember that just because a breed is resistant to black spot doesn’t mean that breed will grow well in your area. Find a breed that’s suited to your local climate. Most yellow and copper-colored roses are particularly susceptible to black spot. Avoid these breeds to prevent outbreaks. Grow your roses in a sunny spot so they stay warm and dry. Fungus grows best in cool, damp environments. Discourage fungal growth by planting the roses in the sunniest parts of your property. This burns off excess moisture on the roses and foliage around them. Consider planting your roses in pots so you can move them around to sunnier spots if you have to. Space your roses 24–36 in (61–91 cm) apart to allow good air flow. If the roses are too close together, air won't circulate well and moisture will build up. The exact spacing depends on the type of rose you plant, but generally allow 24–36 in (61–91 cm) between each bush when you're planting. Ask an employee at the nursery what the ideal spacing for your rose breed is. Also prune your roses if they're growing close to each other. Rake up all leaves and foliage around the roses. Dead leaves and other foliage can support fungal spores and spread them to other plants. Rake your yard whenever leaves or other debris start accumulating. Make sure to remove all the foliage within a few feet of the roses. Clean up your yard especially after it rains. Wet foliage encourages fungal growth. If you have a compost pile, locate it far away from the roses. Prune damaged parts of the plant. Damaged parts of the plant are especially susceptible to fungal growth. Monitor your roses and look for breaks, cuts, or other damage. Trim these parts away to discourage fungal growth. Use a sharp pair of garden scissors to get a clean cut through the plant. Prune in dry weather so excess moisture doesn’t enter the plant. Prevent the leaves and flowers from getting wet when you water. Letting moist debris and soil sit around creates a good environment for fungus. When you water, aim at the soil and not the plant itself. Don't use an overhead watering system. This keeps the leaves as dry as possible. Water early in the morning so the water evaporates throughout the day. If you located your roses in a sunny spot, this should be no problem. The leaves will still get wet in the rain. This is why planting your roses in a sunny spot is important. Treat the roses with a fungicide if they’re susceptible to black spot. If you don’t have a black spot-resistant breed, spray them regularly with fungicide to prevent infections. Most sprays suggest a 7-14-day schedule. Follow the directions on any product you use to get the best results. Remember that fungicides don’t kill black spot if it’s already growing. They only prevent it from spreading. Spread mulch to neutralize fungus spores in the soil. The mulch covers up spores in the soil and prevents them from getting kicked up onto the plants. Spread 2–3 inches (5.1–7.6 cm) on mulch on all the soil in your garden to cover up any spores that may be hiding at ground level. If there was mulch on the ground when the black spot started, rake that all away and place a new layer down. The old mulch could be infected with spores. Inspect your roses regularly and treat black spot as soon as possible. Even with all these precautions, it’s possible that black spot will still break out on one of your rose plants. Monitor your plants and inspect them once a week for any discolorations or other signs of black spot. If you do find black spot, work fast to stop it from spreading further. The most common early symptom of black spot is yellowing leaves. Then the characteristic black spots appear and spread throughout the leaf. Eventually, the leaves start falling off and the plant dies.",
  "sentences":[
    " Stopping Black Spot Outbreaks Cut off infected leaves and branches in dry weather.",
    "When you notice back spots on your roses, work quickly.",
    "Wait for a day when it isn’t raining.",
    "Then use a sharp pair of garden shears and prune all the leaves and branches that have black spot on them.",
    "Working in dry weather is important for preventing black spot from spreading because the fungus grows better in damp weather.",
    "Disinfect your pruning shears after every cut to avoid spreading fungus.",
    "Black spot is very contagious and can spread easily between plants.",
    "Always disinfect your tools to avoid spreading it while you prune away infected areas.",
    "Make a 1:1 mixture of bleach and isopropyl alcohol in a cup.",
    "Then dip your shears into the mixture before and after every cut to kill any fungal spores.",
    "Dry your pruning tools before storing them so they don't rust.",
    "Throw infected foliage away without letting it touch other plants.",
    "Don’t use the infected leaves in your compost pile or leave them lying around.",
    "Pick them up right away and throw them in the garbage.",
    "Otherwise, you risk spreading the black spot to other plants.",
    "Treat the plants with a fungicidal spray.",
    "Fungicidal spray won’t treat the black spot already on the leaves, but it can prevent it from spreading further.",
    "Use a fungicide designed to fight black spot.",
    "Spray the whole plant as well as any nearby plants that may not show symptoms yet.",
    "Repeat spraying every 7-14 days for 3 sprayings to prevent the fungus from spreading.",
    "There are many fungicides available that fight black spot.",
    "Speak with an employee at a local garden store about the breed of rose you have to find the best product for your needs.",
    "Look for fungicides with active ingredients including  captan, chlorothalonil (Daconil), copper, ferbam, mancozeb, maneb, triforine (Funginex), sulfur, thiophanate methyl (Cleary 3336), and ziram.",
    "These are most effective in fighting black spot.",
    "Check if there are any restrictions on chemical application in your community before using the spray.",
    "Use an organic solution if you want to avoid strong chemicals.",
    "There are also a few homemade and store-bought organic alternatives to fungicide.",
    "Consider one of the following solutions if you have pets or children and don't want them touching chemicals in your garden.",
    "Mix 1.5 tbsp (9 g) of baking soda, 2 tbsp (30 ml) of vegetable oil, 1.5 tbsp (22.5 ml) of liquid hand soap, and 1 gallon (3.7 L) of water.",
    "Load the mixture into a spray bottle.",
    "Shake it and then spray all the affected plants every 7 days until the fungus recedes.",
    "Commercial sulfur spray is also effective against black spot.",
    "This is an organic alternative to other fungicides.",
    "Look at your local nursery or garden center for a bottle.",
    "Move the roses to a sunny location if possible.",
    "Fungus grows well in damp, cool areas.",
    "If your roses are in pots, relocate the plants to a sunnier spot.",
    "This keeps them drier and warmer, discouraging further plant growth.",
    "If your roses are not in pots, consider digging them up and replanting them in a sunnier location.",
    "Dig out roses if you can't get the infection under control.",
    "If you've tried all these prevention methods but the black spot won't recede, then remove the infected plant before it infects others.",
    "Although you may not want to do this, it's necessary to save the rest of your garden.",
    "Dig the entire plant out, roots and all.",
    "Don't leave anything behind.",
    "Remember to clean up any remnants the plant leaves behind, like twigs and leaves.",
    "These can spread the fungus to other plants.",
    "Preventing Fungal Growth Plant black spot-resistant breeds of roses.",
    "Some rose breeds are much more resistant to black spot than others.",
    "Particularly resistant breeds are Fortyniner, Coronado, Carefree Beauty, Simplicity, Bonica, and Grand Opera.",
    "Ask at your local nursery or garden center if any of these breeds are available.",
    "Remember that just because a breed is resistant to black spot doesn’t mean that breed will grow well in your area.",
    "Find a breed that’s suited to your local climate.",
    "Most yellow and copper-colored roses are particularly susceptible to black spot.",
    "Avoid these breeds to prevent outbreaks.",
    "Grow your roses in a sunny spot so they stay warm and dry.",
    "Fungus grows best in cool, damp environments.",
    "Discourage fungal growth by planting the roses in the sunniest parts of your property.",
    "This burns off excess moisture on the roses and foliage around them.",
    "Consider planting your roses in pots so you can move them around to sunnier spots if you have to.",
    "Space your roses 24–36 in (61–91 cm) apart to allow good air flow.",
    "If the roses are too close together, air won't circulate well and moisture will build up.",
    "The exact spacing depends on the type of rose you plant, but generally allow 24–36 in (61–91 cm) between each bush when you're planting.",
    "Ask an employee at the nursery what the ideal spacing for your rose breed is.",
    "Also prune your roses if they're growing close to each other.",
    "Rake up all leaves and foliage around the roses.",
    "Dead leaves and other foliage can support fungal spores and spread them to other plants.",
    "Rake your yard whenever leaves or other debris start accumulating.",
    "Make sure to remove all the foliage within a few feet of the roses.",
    "Clean up your yard especially after it rains.",
    "Wet foliage encourages fungal growth.",
    "If you have a compost pile, locate it far away from the roses.",
    "Prune damaged parts of the plant.",
    "Damaged parts of the plant are especially susceptible to fungal growth.",
    "Monitor your roses and look for breaks, cuts, or other damage.",
    "Trim these parts away to discourage fungal growth.",
    "Use a sharp pair of garden scissors to get a clean cut through the plant.",
    "Prune in dry weather so excess moisture doesn’t enter the plant.",
    "Prevent the leaves and flowers from getting wet when you water.",
    "Letting moist debris and soil sit around creates a good environment for fungus.",
    "When you water, aim at the soil and not the plant itself.",
    "Don't use an overhead watering system.",
    "This keeps the leaves as dry as possible.",
    "Water early in the morning so the water evaporates throughout the day.",
    "If you located your roses in a sunny spot, this should be no problem.",
    "The leaves will still get wet in the rain.",
    "This is why planting your roses in a sunny spot is important.",
    "Treat the roses with a fungicide if they’re susceptible to black spot.",
    "If you don’t have a black spot-resistant breed, spray them regularly with fungicide to prevent infections.",
    "Most sprays suggest a 7-14-day schedule.",
    "Follow the directions on any product you use to get the best results.",
    "Remember that fungicides don’t kill black spot if it’s already growing.",
    "They only prevent it from spreading.",
    "Spread mulch to neutralize fungus spores in the soil.",
    "The mulch covers up spores in the soil and prevents them from getting kicked up onto the plants.",
    "Spread 2–3 inches (5.1–7.6 cm) on mulch on all the soil in your garden to cover up any spores that may be hiding at ground level.",
    "If there was mulch on the ground when the black spot started, rake that all away and place a new layer down.",
    "The old mulch could be infected with spores.",
    "Inspect your roses regularly and treat black spot as soon as possible.",
    "Even with all these precautions, it’s possible that black spot will still break out on one of your rose plants.",
    "Monitor your plants and inspect them once a week for any discolorations or other signs of black spot.",
    "If you do find black spot, work fast to stop it from spreading further.",
    "The most common early symptom of black spot is yellowing leaves.",
    "Then the characteristic black spots appear and spread throughout the leaf.",
    "Eventually, the leaves start falling off and the plant dies."
  ],
  "tyn_section":[
    "Garden shears",
    "Hose",
    "Mulch",
    "Rake",
    "Garbage bag or can",
    "Bleach",
    "Alcohol",
    "Fungicidal spray"
  ],
  "tyn_model":[
    "roses",
    "water",
    "mulch",
    "fungicide",
    "fungicides",
    "fungicidal spray",
    "fungus",
    "garden shears",
    "pruning shears",
    "bleach",
    "isopropyl alcohol",
    "shears",
    "pruning tools",
    "copper",
    "maneb",
    "sulfur",
    "ziram",
    "baking soda",
    "vegetable oil",
    "liquid hand soap",
    "spray bottle",
    "sulfur spray",
    "compost",
    "garden scissors",
    "prune"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.16,
    "f1":0.2424242424,
    "avg_pos":0.28
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.24,
    "f1":0.3468208092
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.4,
    "f1":0.487804878
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.16,
    "f1":0.2424242424
  }
}