{
  "title":"How to Make Chewing Gum",
  "url":"https://www.wikihow.com/Make-Chewing-Gum",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy"
  ],
  "methods":[
    {
      "name":"Classic Bubble Gum",
      "steps":[
        {
          "headline":"Heat the ingredients.",
          "description":"Place the gum base, corn syrup, glycerine, citric acid and bubble gum flavoring in the top part of a double boiler. Place the double boiler on the stove and turn the burner to medium high. Stirring occasionally with a spoon, heat the mixture until it becomes warm and gooey. You can find gum base, glycerine and citric acid at candy supply stores or online retailers. Choose a classic bubble gum flavor or go for something unique, like lemon lime. You can also add a few drops of food coloring to the mixture to color your gum. Make a double boiler if you don't already have one by finding two pots, one small and one large. Fill the larger pot with a few inches of water and place it on the stove. Put the smaller pot inside the larger pot so that it's floating on the water. Place all of the ingredients except the powdered sugar in the smaller pot and turn on the burner. Bring the mixture up to temperature, stirring well."
        },
        {
          "headline":"Create a powdered sugar well.",
          "description":"Set aside about a tablespoon of powdered sugar and pour the rest into a pile on a cutting board or another clean work surface. Use your fingers to create an indention in the powdered sugar pile."
        },
        {
          "headline":"Pour the gum base into the well.",
          "description":"Carefully pour the melted gum base directly from the double boiler into the powdered sugar well. Be careful not to get any water in the mixture."
        },
        {
          "headline":"Make bubble gum dough.",
          "description":"Dust your fingers with some powdered sugar and start kneading the gum base mixture and the powdered sugar together. Work the powdered sugar into the gum base until the base gets sticky, then add more powdered sugar and keep kneading. Knead for at least 15 minutes, until the dough is soft and pliable and no longer sticky. If you don't knead the dough enough, the gum will tend to fall apart, so don't skip this step. The dough should be smooth and stiff when you're finished."
        },
        {
          "headline":"Roll out the dough.",
          "description":"Place the dough in front of you, and place your hands palm-down on top of it. Roll the dough using your hands so that it becomes a long, thin rope. Try to roll it so that it's the same width down the length of the rope. Use a knife to cut the rope into bite-sized pieces. You can roll the dough flat using a rolling pin and cut it into neat squares if you'd like. Roll the pieces of dough into balls as an alternative."
        },
        {
          "headline":"Finish the gum.",
          "description":"Dust the gum pieces with powdered sugar to keep them from sticking to each other. Make small gum wrappers by cutting out squares of parchment paper, then wrap the gum pieces."
        }
      ]
    },
    {
      "name":"Natural Beeswax Gum",
      "steps":[
        {
          "headline":"Melt the wax.",
          "description":"Place the wax in a double boiler. Put the double boiler on the stove and turn the burner to medium high. Melt the wax until it is soft and gooey."
        },
        {
          "headline":"Add the honey.",
          "description":"Place the honey in the pot and stir it into the melted wax. You can substitute corn syrup for honey if you prefer."
        },
        {
          "headline":"Add flavorings.",
          "description":"Beeswax gum goes well with peppermint flavoring. You could also try cinnamon, lemon or licorice. Squeeze about five drops of flavoring into the pot with the melted wax and honey, and stir well. You can add finely chopped herbs, such as rosemary or mint leaves, to the mixture. For a medicinal gum, add extra peppermint oil and a few drops of lemon juice."
        },
        {
          "headline":"Add the sugar.",
          "description":"Stir powdered sugar into the melted gum base. The mixture should begin to thicken a bit. Taste the gum mixture and add more flavorings or powdered sugar if you'd like to increase the flavor or sweetness."
        },
        {
          "headline":"Pour the gum base into molds.",
          "description":"Use candy molds, an ice cube tray, or other small molds for the gum. Pour an equal amount of the gum base into each mold. Place the molds in the refrigerator to give the gum time to harden, then pop out the pieces when you're ready to chew them."
        }
      ]
    },
    {
      "name":"Sweetgum Sap Gum",
      "steps":[
        {
          "headline":"Locate a sweet gum tree.",
          "description":"The sap from sweet gum trees has been used for medicinal purposes and to make chewing gum since ancient times. The sweetgum is a deciduous tree commonly found in North America."
        },
        {
          "headline":"Find a place where sap exits the tree.",
          "description":"Sweetgum sap flows under the bark. You may be able to find a spot where the bark has been torn off and the sap is accessible. If not, use a pocketknife to remove the bark from a small area. You'll see runny sap underneath. Don't remove too much bark, or you'll damage the tree. Choose a spot high off the ground so that the area isn't accessible to animals."
        },
        {
          "headline":"Wait for the sap to harden.",
          "description":"Over the course of a few days, the exposed sap will begin to harden into a gum. Come back to the spot after about 3 days to check it. If the sap is still runny, wait a few more days. If it's hard, it's ready to be made into gum."
        },
        {
          "headline":"Scrape the hardened resin from the tree.",
          "description":"A pocketknife is a good tool for this. Catch the pieces of resin in your hand or a small container."
        },
        {
          "headline":"Chew the resin.",
          "description":"Place the pieces in your mouth and enjoy your minimalist gum."
        }
      ]
    }
  ],
  "text":" Classic Bubble Gum Heat the ingredients. Place the gum base, corn syrup, glycerine, citric acid and bubble gum flavoring in the top part of a double boiler. Place the double boiler on the stove and turn the burner to medium high. Stirring occasionally with a spoon, heat the mixture until it becomes warm and gooey. You can find gum base, glycerine and citric acid at candy supply stores or online retailers. Choose a classic bubble gum flavor or go for something unique, like lemon lime. You can also add a few drops of food coloring to the mixture to color your gum. Make a double boiler if you don't already have one by finding two pots, one small and one large. Fill the larger pot with a few inches of water and place it on the stove. Put the smaller pot inside the larger pot so that it's floating on the water. Place all of the ingredients except the powdered sugar in the smaller pot and turn on the burner. Bring the mixture up to temperature, stirring well. Create a powdered sugar well. Set aside about a tablespoon of powdered sugar and pour the rest into a pile on a cutting board or another clean work surface. Use your fingers to create an indention in the powdered sugar pile. Pour the gum base into the well. Carefully pour the melted gum base directly from the double boiler into the powdered sugar well. Be careful not to get any water in the mixture. Make bubble gum dough. Dust your fingers with some powdered sugar and start kneading the gum base mixture and the powdered sugar together. Work the powdered sugar into the gum base until the base gets sticky, then add more powdered sugar and keep kneading. Knead for at least 15 minutes, until the dough is soft and pliable and no longer sticky. If you don't knead the dough enough, the gum will tend to fall apart, so don't skip this step. The dough should be smooth and stiff when you're finished. Roll out the dough. Place the dough in front of you, and place your hands palm-down on top of it. Roll the dough using your hands so that it becomes a long, thin rope. Try to roll it so that it's the same width down the length of the rope. Use a knife to cut the rope into bite-sized pieces. You can roll the dough flat using a rolling pin and cut it into neat squares if you'd like. Roll the pieces of dough into balls as an alternative. Finish the gum. Dust the gum pieces with powdered sugar to keep them from sticking to each other. Make small gum wrappers by cutting out squares of parchment paper, then wrap the gum pieces. Natural Beeswax Gum Melt the wax. Place the wax in a double boiler. Put the double boiler on the stove and turn the burner to medium high. Melt the wax until it is soft and gooey. Add the honey. Place the honey in the pot and stir it into the melted wax. You can substitute corn syrup for honey if you prefer. Add flavorings. Beeswax gum goes well with peppermint flavoring. You could also try cinnamon, lemon or licorice. Squeeze about five drops of flavoring into the pot with the melted wax and honey, and stir well. You can add finely chopped herbs, such as rosemary or mint leaves, to the mixture. For a medicinal gum, add extra peppermint oil and a few drops of lemon juice. Add the sugar. Stir powdered sugar into the melted gum base. The mixture should begin to thicken a bit. Taste the gum mixture and add more flavorings or powdered sugar if you'd like to increase the flavor or sweetness. Pour the gum base into molds. Use candy molds, an ice cube tray, or other small molds for the gum. Pour an equal amount of the gum base into each mold. Place the molds in the refrigerator to give the gum time to harden, then pop out the pieces when you're ready to chew them. Sweetgum Sap Gum Locate a sweet gum tree. The sap from sweet gum trees has been used for medicinal purposes and to make chewing gum since ancient times. The sweetgum is a deciduous tree commonly found in North America. Find a place where sap exits the tree. Sweetgum sap flows under the bark. You may be able to find a spot where the bark has been torn off and the sap is accessible. If not, use a pocketknife to remove the bark from a small area. You'll see runny sap underneath. Don't remove too much bark, or you'll damage the tree. Choose a spot high off the ground so that the area isn't accessible to animals. Wait for the sap to harden. Over the course of a few days, the exposed sap will begin to harden into a gum. Come back to the spot after about 3 days to check it. If the sap is still runny, wait a few more days. If it's hard, it's ready to be made into gum. Scrape the hardened resin from the tree. A pocketknife is a good tool for this. Catch the pieces of resin in your hand or a small container. Chew the resin. Place the pieces in your mouth and enjoy your minimalist gum.",
  "sentences":[
    " Classic Bubble Gum Heat the ingredients.",
    "Place the gum base, corn syrup, glycerine, citric acid and bubble gum flavoring in the top part of a double boiler.",
    "Place the double boiler on the stove and turn the burner to medium high.",
    "Stirring occasionally with a spoon, heat the mixture until it becomes warm and gooey.",
    "You can find gum base, glycerine and citric acid at candy supply stores or online retailers.",
    "Choose a classic bubble gum flavor or go for something unique, like lemon lime.",
    "You can also add a few drops of food coloring to the mixture to color your gum.",
    "Make a double boiler if you don't already have one by finding two pots, one small and one large.",
    "Fill the larger pot with a few inches of water and place it on the stove.",
    "Put the smaller pot inside the larger pot so that it's floating on the water.",
    "Place all of the ingredients except the powdered sugar in the smaller pot and turn on the burner.",
    "Bring the mixture up to temperature, stirring well.",
    "Create a powdered sugar well.",
    "Set aside about a tablespoon of powdered sugar and pour the rest into a pile on a cutting board or another clean work surface.",
    "Use your fingers to create an indention in the powdered sugar pile.",
    "Pour the gum base into the well.",
    "Carefully pour the melted gum base directly from the double boiler into the powdered sugar well.",
    "Be careful not to get any water in the mixture.",
    "Make bubble gum dough.",
    "Dust your fingers with some powdered sugar and start kneading the gum base mixture and the powdered sugar together.",
    "Work the powdered sugar into the gum base until the base gets sticky, then add more powdered sugar and keep kneading.",
    "Knead for at least 15 minutes, until the dough is soft and pliable and no longer sticky.",
    "If you don't knead the dough enough, the gum will tend to fall apart, so don't skip this step.",
    "The dough should be smooth and stiff when you're finished.",
    "Roll out the dough.",
    "Place the dough in front of you, and place your hands palm-down on top of it.",
    "Roll the dough using your hands so that it becomes a long, thin rope.",
    "Try to roll it so that it's the same width down the length of the rope.",
    "Use a knife to cut the rope into bite-sized pieces.",
    "You can roll the dough flat using a rolling pin and cut it into neat squares if you'd like.",
    "Roll the pieces of dough into balls as an alternative.",
    "Finish the gum.",
    "Dust the gum pieces with powdered sugar to keep them from sticking to each other.",
    "Make small gum wrappers by cutting out squares of parchment paper, then wrap the gum pieces.",
    "Natural Beeswax Gum Melt the wax.",
    "Place the wax in a double boiler.",
    "Put the double boiler on the stove and turn the burner to medium high.",
    "Melt the wax until it is soft and gooey.",
    "Add the honey.",
    "Place the honey in the pot and stir it into the melted wax.",
    "You can substitute corn syrup for honey if you prefer.",
    "Add flavorings.",
    "Beeswax gum goes well with peppermint flavoring.",
    "You could also try cinnamon, lemon or licorice.",
    "Squeeze about five drops of flavoring into the pot with the melted wax and honey, and stir well.",
    "You can add finely chopped herbs, such as rosemary or mint leaves, to the mixture.",
    "For a medicinal gum, add extra peppermint oil and a few drops of lemon juice.",
    "Add the sugar.",
    "Stir powdered sugar into the melted gum base.",
    "The mixture should begin to thicken a bit.",
    "Taste the gum mixture and add more flavorings or powdered sugar if you'd like to increase the flavor or sweetness.",
    "Pour the gum base into molds.",
    "Use candy molds, an ice cube tray, or other small molds for the gum.",
    "Pour an equal amount of the gum base into each mold.",
    "Place the molds in the refrigerator to give the gum time to harden, then pop out the pieces when you're ready to chew them.",
    "Sweetgum Sap Gum Locate a sweet gum tree.",
    "The sap from sweet gum trees has been used for medicinal purposes and to make chewing gum since ancient times.",
    "The sweetgum is a deciduous tree commonly found in North America.",
    "Find a place where sap exits the tree.",
    "Sweetgum sap flows under the bark.",
    "You may be able to find a spot where the bark has been torn off and the sap is accessible.",
    "If not, use a pocketknife to remove the bark from a small area.",
    "You'll see runny sap underneath.",
    "Don't remove too much bark, or you'll damage the tree.",
    "Choose a spot high off the ground so that the area isn't accessible to animals.",
    "Wait for the sap to harden.",
    "Over the course of a few days, the exposed sap will begin to harden into a gum.",
    "Come back to the spot after about 3 days to check it.",
    "If the sap is still runny, wait a few more days.",
    "If it's hard, it's ready to be made into gum.",
    "Scrape the hardened resin from the tree.",
    "A pocketknife is a good tool for this.",
    "Catch the pieces of resin in your hand or a small container.",
    "Chew the resin.",
    "Place the pieces in your mouth and enjoy your minimalist gum."
  ],
  "tyn_section":[
    "Double boiler",
    "Spoon",
    "Cutting board",
    "Knife",
    "Parchment paper"
  ],
  "tyn_model":[
    "powdered sugar",
    "double boiler",
    "bubble gum",
    "wax",
    "honey",
    "stove",
    "burner",
    "water",
    "sap",
    "resin",
    "corn syrup",
    "glycerine",
    "citric acid",
    "beeswax gum",
    "pot",
    "sweet gum",
    "spoon",
    "gum base",
    "lemon lime",
    "food coloring",
    "knife",
    "rolling pin",
    "parchment paper",
    "peppermint oil",
    "lemon",
    "sugar",
    "candy molds",
    "ice cube tray",
    "refrigerator",
    "sweetgum sap",
    "pocketknife to",
    "pocketknife is"
  ],
  "simple_metrics":{
    "r":0.8,
    "p":0.125,
    "f1":0.2162162162,
    "avg_pos":0.03125
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.125,
    "f1":0.2162162162
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.125,
    "f1":0.2162162162
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8,
    "p":0.125,
    "f1":0.2162162162
  }
}