{
  "title":"How to Plant a Cut Flower Garden",
  "url":"https://www.wikihow.com/Plant-a-Cut-Flower-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "steps":[
    {
      "headline":"Research to see what flowers grow well in your area.",
      "description":"You can check flower seed catalogs or check the back on a package of flower seeds to see if the flowers are zoned for the area in which you live."
    },
    {
      "headline":"Decide what kinds of flowers you wish to plant in your cut-flower garden.",
      "description":"Pay close attention to the time of year the flowers will bloom, and plan for colors and sizes of flowers that will arrange well together. Purchase the flower seeds or plants of your choice at a local store or from a catalog company."
    },
    {
      "headline":"Plan the types of flowers you will plant, so that you will have flowers blooming at all times during the spring, summer and fall growing seasons.",
      "description":""
    },
    {
      "headline":"Choose a location for your cut-flower garden.",
      "description":"Most cut-flowers grow best in full sun. You will want to choose a location that receives direct sunlight, has good soil and is located close to a water source. Because you will be cutting flowers from this garden, you may want to choose a location that is hidden from public view."
    },
    {
      "headline":"Till the soil with a garden tiller to loosen the dirt.",
      "description":"Add compost and manure and mix in with a garden hoe to prepare the soil for planting."
    },
    {
      "headline":"Plant flowers or sow seeds when all dangers of frost have passed.",
      "description":"Check the seed package or plant package to determine how close to space the flowers apart in your garden."
    },
    {
      "headline":"Use a garden hoe to dig a hole that is big enough for your plant.",
      "description":"Place the plant in the hole and pull the dirt up around the plant. If you are sowing flower seeds, use the garden hoe to make a row. Sow the seeds according to the package directions."
    },
    {
      "headline":"Water plants and seeds after planting.",
      "description":"Follow plant directions for fertilizing."
    }
  ],
  "text":" Research to see what flowers grow well in your area. You can check flower seed catalogs or check the back on a package of flower seeds to see if the flowers are zoned for the area in which you live. Decide what kinds of flowers you wish to plant in your cut-flower garden. Pay close attention to the time of year the flowers will bloom, and plan for colors and sizes of flowers that will arrange well together. Purchase the flower seeds or plants of your choice at a local store or from a catalog company. Plan the types of flowers you will plant, so that you will have flowers blooming at all times during the spring, summer and fall growing seasons.  Choose a location for your cut-flower garden. Most cut-flowers grow best in full sun. You will want to choose a location that receives direct sunlight, has good soil and is located close to a water source. Because you will be cutting flowers from this garden, you may want to choose a location that is hidden from public view. Till the soil with a garden tiller to loosen the dirt. Add compost and manure and mix in with a garden hoe to prepare the soil for planting. Plant flowers or sow seeds when all dangers of frost have passed. Check the seed package or plant package to determine how close to space the flowers apart in your garden. Use a garden hoe to dig a hole that is big enough for your plant. Place the plant in the hole and pull the dirt up around the plant. If you are sowing flower seeds, use the garden hoe to make a row. Sow the seeds according to the package directions. Water plants and seeds after planting. Follow plant directions for fertilizing.",
  "sentences":[
    " Research to see what flowers grow well in your area.",
    "You can check flower seed catalogs or check the back on a package of flower seeds to see if the flowers are zoned for the area in which you live.",
    "Decide what kinds of flowers you wish to plant in your cut-flower garden.",
    "Pay close attention to the time of year the flowers will bloom, and plan for colors and sizes of flowers that will arrange well together.",
    "Purchase the flower seeds or plants of your choice at a local store or from a catalog company.",
    "Plan the types of flowers you will plant, so that you will have flowers blooming at all times during the spring, summer and fall growing seasons.",
    "Choose a location for your cut-flower garden.",
    "Most cut-flowers grow best in full sun.",
    "You will want to choose a location that receives direct sunlight, has good soil and is located close to a water source.",
    "Because you will be cutting flowers from this garden, you may want to choose a location that is hidden from public view.",
    "Till the soil with a garden tiller to loosen the dirt.",
    "Add compost and manure and mix in with a garden hoe to prepare the soil for planting.",
    "Plant flowers or sow seeds when all dangers of frost have passed.",
    "Check the seed package or plant package to determine how close to space the flowers apart in your garden.",
    "Use a garden hoe to dig a hole that is big enough for your plant.",
    "Place the plant in the hole and pull the dirt up around the plant.",
    "If you are sowing flower seeds, use the garden hoe to make a row.",
    "Sow the seeds according to the package directions.",
    "Water plants and seeds after planting.",
    "Follow plant directions for fertilizing."
  ],
  "tyn_section":[
    "Garden tiller",
    "Flower seeds",
    "Flowering plants",
    "Garden hoe",
    "Flower catalogs",
    "Water"
  ],
  "tyn_model":[
    "garden hoe",
    "flower seeds",
    "flower seed catalogs",
    "cut-flower garden",
    "plants",
    "garden tiller",
    "compost",
    "manure",
    "dirt",
    "water"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.4,
    "f1":0.5,
    "avg_pos":0.5
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.6,
    "f1":0.75
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.7,
    "f1":0.8235294118
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8333333333,
    "p":0.5,
    "f1":0.625
  }
}