{
  "title":"How to Sharpen a Kitchen Knife",
  "url":"https://www.wikihow.com/Sharpen-a-Kitchen-Knife",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Cooking Knives and Blades",
    "Sharpening Knives"
  ],
  "methods":[
    {
      "name":"Sharpening with a Whetstone",
      "steps":[
        {
          "headline":"Gather the necessary materials.",
          "description":"You will need a double-sided (coarse and fine grit) synthetic sharpening stone. You will also need a honing steel, which is typically sold in the form of a lightly-grooved, magnetized iron rod. Both of these materials can be found at your local hardware store. Sharpening stones have two sides with different grits. The grit measures how rough the stone is, and thus how severely it sharpens. Higher numbers stand for finer grits meaning the lowest number is the roughest surface."
        },
        {
          "headline":"Soak your whetstones in water until no air bubbles pop up anymore.",
          "description":"The stone is porous, and it needs to fill with water so that the blade doesn't catch. This decreased friction and helps prevent scratches and nicks. You'll want to keep getting the stone wet as you work, so keep some water nearby."
        },
        {
          "headline":"Place the stone on a non-slip service to prevent any dangerous issues.",
          "description":"You can use a damp towel or a silicon baking sheet or hot pad. You do not want the stone moving as you sharpen, as this is the number one way to accidentally end up in the ER."
        },
        {
          "headline":"Begin with the coarse grit side of the stone, the one with the lower number.",
          "description":"Splash some water on top before beginning. You always start with the rougher side of the stone, with the lower grit rating. Many stones start at F 400 (European measurement) or J 1000 (Japanese measurement). Professional chefs may have multiple stones with many different grits to smoothly craft a point. More variety means you can get a better edge by slowly increasing the resistance. If you have a broken tip on the knife, fix this before sharpening."
        },
        {
          "headline":"Tilt the knife so that the blade makes a roughly 22-degree angle with the stone.",
          "description":"This can be hard to find, but just do it in pieces. Perpendicular to the stone (blade touching the stone, as if you were cutting), is 90-degrees. Now, angle the blade so that it is halfway between perpendicular and laying on the stone. This is 45-degrees. Now angle the stone to be roughly halfway between this angle and the stone -- you've got it! A steeper angle always leads to a more durable knife, but too steep and you will risk cracking the edge."
        },
        {
          "headline":"Hold the knife with the handle in your dominant hand so that your index finger is on the edge of the blade, almost where it meets the stone.",
          "description":"This hand provides the control and keeps the edge down on the stone as you work."
        },
        {
          "headline":"Spread your non-dominant hand fingers on the back of the blade itself, applying even pressure across the whole blade down into the stone.",
          "description":"These fingers are your guides, keeping the knife down and moving it smoothly as you work. These fingers will naturally slide to help the area you're working on since most stones are not big enough to fit the whole knife."
        },
        {
          "headline":"Keeping the angle of the knife consistent throughout, push the blade evenly across the whetstone.",
          "description":"This motion should be smooth and fluid, almost like you were lightly slicing off an impossibly thin piece of the stone."
        },
        {
          "headline":"Splash the whetstone with water every few minutes to keep it wet.",
          "description":"Friction, when not controlled, is not your friend. Keep the stone wet to prevent accidental damage. It is often a good idea to wipe any grit off the blade each time your wet the stone again"
        },
        {
          "headline":"Repeat as many times as necessary, moving your fingers across the blade to sharpen the whole thing.",
          "description":"With your non-dominant hand, move up to the tip of the blade and focus on that. Then slide down and sharpen the meet of the blade before moving down to the hilt. Try to use the same number of movements for each section. Don't try and push the blade down into the stone. You want it to stay flush to the stone with every pass, but you don't want to be digging it in."
        },
        {
          "headline":"Flip the blade over and repeat with the other side, making the same number of passes.",
          "description":"You want both sides to be evenly sharpened, otherwise, the knife will be misaligned. The exact same strategy should be used as the first side. Feel the opposite side of the knife from the one you've been sharpening. If you feel a little burr or catch on the unsharpened side, it means it's time to flip."
        },
        {
          "headline":"Switch to the finer grit stone and alternate sharpening each side.",
          "description":"Make one pass on the right side, flip the knife, and make another on the left. Both the angle and motion are still consistent, as is the need to keep the stone wet. However, since the finer grit is making smaller, finer changes, you want to ensure that you evenly balance them by alternating sides. You only need very light pressure down on the knife with the fine grit stone. Keep the stone extra wet, and wipe the grit from the knife frequently with a damp towel."
        },
        {
          "headline":"\"Cut\" a wooden cutting board with the knife to even out the cutting surface.",
          "description":"Take your sharpened knife and \"slice\" down the edge of a wooden cutting board, as if you were trying to cut into it. You only need to do it one -- but simply dragging the blade across the cutting board to clean off the cutting edge."
        },
        {
          "headline":"Hone the blade.",
          "description":"The next step is to use your steel honing rod (sometimes known as a steeling rod), to make sure the blade is properly aligned. Make sure you use a few passes on each side and keep honing the blade every time you use it."
        }
      ]
    },
    {
      "name":"Honing the Blade",
      "steps":[
        {
          "headline":"Understand the difference between honing and sharpening your knives.",
          "description":"The long steel rod that most people consider a \"sharpening rod\" is actually used for honing the blade, which centers the edge for even cutting. Because it makes the blade cut more efficiently, it seems sharper. But real sharpening uses specialty stones to actually fix the edge and doesn't need to be done regularly. Honing needs to be done regularly. Some chefs hone every single time they use their knives. You should hone the blade immediately after any sharpening. Sharpening can be done at home or professionally, and only needs to be done once or twice a year."
        },
        {
          "headline":"Hold the honing rod down, perpendicular to the counter.",
          "description":"Hold the rod from the top of the handle, with the end on the ground. You can put a dishtowel underneath it to help keep it in place."
        },
        {
          "headline":"Hold the blade against the rod at a 45-degree angle to the honing rod.",
          "description":"This is not the angle you want to sharpen at, it is just a step to help you get the right angle. Start with the blade perpendicular to the rod, then pick your hand up to angle the blade down at a 45-degree angle to the rod. Start near the handle of the blade."
        },
        {
          "headline":"Rotate the blade halfway towards the rod to create a roughly 20-23-degree angle.",
          "description":"This doesn't have to be precisely measured, but you should get used to this angle. If you're struggling, just think about being roughly halfway to 45-degrees. Remember that the blade is pointing down to the counter, not up."
        },
        {
          "headline":"Pull the knife quickly towards you to hone it.",
          "description":"Keeping the blade at this 20-degree angle, draw the blade back towards you on a straight line. You should only need 4-5 passes if you hone the blade regularly, but 8-10 if you haven't done it in a while. You want to use gentle, fluid pressure through each draw. Making it a quick, even motion will help."
        },
        {
          "headline":"Switch to the other side of the blade and repeat.",
          "description":"In order to center the blade, you need to hone both sides the same number of times."
        },
        {
          "headline":"Replace your honing rod when it becomes visibly dull.",
          "description":"You'll notice the grooves on the rod becoming smooth, and it won't actually help you much anymore. Luckily, these things are cheap."
        }
      ]
    },
    {
      "name":"Fixing a Broken Tip",
      "steps":[
        {
          "headline":"Keep the whetstone prepared and ready like any other sharpening.",
          "description":"You want to soak the stones, keep them on a damp cloth to prevent slipping, and continually add water to the stone. This strategy is only for a broken knife tip, not cracks or issues further down the knife."
        },
        {
          "headline":"Turn your coarsest stone sideways.",
          "description":"Again, put a damp towel on the table to prevent movement. You'll likely need your opposite hand to hold the stone still as you work."
        },
        {
          "headline":"Run the tip of the knife horizontally across the side of your coarsest whetstone to grind it back to a point.",
          "description":"Hold the knife near the point and grind the flat, broken tip into a diagonal point. Remember to keep the stone wet, moving back and forth to get rid of the knicks and cracks."
        },
        {
          "headline":"Rock the knife back and forth on the stone, as if cutting with it, to round out the edge.",
          "description":"Now, run the knife back and forth vertically, like you would if you are cutting it. Keep the stone wet, and work the knife until you have a decent (but blunt!) curve to the tip of your knife."
        },
        {
          "headline":"Sharpen the entire knife after fixing the tip.",
          "description":"Do not do this in reverse -- you want to fix the tip, then sharpen the knife. This will bring the entire thing back to the right alignment and sharpness."
        }
      ]
    }
  ],
  "text":" Sharpening with a Whetstone Gather the necessary materials. You will need a double-sided (coarse and fine grit) synthetic sharpening stone. You will also need a honing steel, which is typically sold in the form of a lightly-grooved, magnetized iron rod. Both of these materials can be found at your local hardware store. Sharpening stones have two sides with different grits. The grit measures how rough the stone is, and thus how severely it sharpens. Higher numbers stand for finer grits meaning the lowest number is the roughest surface. Soak your whetstones in water until no air bubbles pop up anymore. The stone is porous, and it needs to fill with water so that the blade doesn't catch. This decreased friction and helps prevent scratches and nicks. You'll want to keep getting the stone wet as you work, so keep some water nearby. Place the stone on a non-slip service to prevent any dangerous issues. You can use a damp towel or a silicon baking sheet or hot pad. You do not want the stone moving as you sharpen, as this is the number one way to accidentally end up in the ER. Begin with the coarse grit side of the stone, the one with the lower number. Splash some water on top before beginning. You always start with the rougher side of the stone, with the lower grit rating. Many stones start at F 400 (European measurement) or J 1000 (Japanese measurement). Professional chefs may have multiple stones with many different grits to smoothly craft a point. More variety means you can get a better edge by slowly increasing the resistance. If you have a broken tip on the knife, fix this before sharpening. Tilt the knife so that the blade makes a roughly 22-degree angle with the stone. This can be hard to find, but just do it in pieces. Perpendicular to the stone (blade touching the stone, as if you were cutting), is 90-degrees. Now, angle the blade so that it is halfway between perpendicular and laying on the stone. This is 45-degrees. Now angle the stone to be roughly halfway between this angle and the stone -- you've got it! A steeper angle always leads to a more durable knife, but too steep and you will risk cracking the edge. Hold the knife with the handle in your dominant hand so that your index finger is on the edge of the blade, almost where it meets the stone. This hand provides the control and keeps the edge down on the stone as you work. Spread your non-dominant hand fingers on the back of the blade itself, applying even pressure across the whole blade down into the stone. These fingers are your guides, keeping the knife down and moving it smoothly as you work. These fingers will naturally slide to help the area you're working on since most stones are not big enough to fit the whole knife. Keeping the angle of the knife consistent throughout, push the blade evenly across the whetstone. This motion should be smooth and fluid, almost like you were lightly slicing off an impossibly thin piece of the stone. Splash the whetstone with water every few minutes to keep it wet. Friction, when not controlled, is not your friend. Keep the stone wet to prevent accidental damage. It is often a good idea to wipe any grit off the blade each time your wet the stone again Repeat as many times as necessary, moving your fingers across the blade to sharpen the whole thing. With your non-dominant hand, move up to the tip of the blade and focus on that. Then slide down and sharpen the meet of the blade before moving down to the hilt. Try to use the same number of movements for each section. Don't try and push the blade down into the stone. You want it to stay flush to the stone with every pass, but you don't want to be digging it in. Flip the blade over and repeat with the other side, making the same number of passes. You want both sides to be evenly sharpened, otherwise, the knife will be misaligned. The exact same strategy should be used as the first side. Feel the opposite side of the knife from the one you've been sharpening. If you feel a little burr or catch on the unsharpened side, it means it's time to flip. Switch to the finer grit stone and alternate sharpening each side. Make one pass on the right side, flip the knife, and make another on the left. Both the angle and motion are still consistent, as is the need to keep the stone wet. However, since the finer grit is making smaller, finer changes, you want to ensure that you evenly balance them by alternating sides. You only need very light pressure down on the knife with the fine grit stone. Keep the stone extra wet, and wipe the grit from the knife frequently with a damp towel. \"Cut\" a wooden cutting board with the knife to even out the cutting surface. Take your sharpened knife and \"slice\" down the edge of a wooden cutting board, as if you were trying to cut into it. You only need to do it one -- but simply dragging the blade across the cutting board to clean off the cutting edge. Hone the blade. The next step is to use your steel honing rod (sometimes known as a steeling rod), to make sure the blade is properly aligned. Make sure you use a few passes on each side and keep honing the blade every time you use it. Honing the Blade Understand the difference between honing and sharpening your knives. The long steel rod that most people consider a \"sharpening rod\" is actually used for honing the blade, which centers the edge for even cutting. Because it makes the blade cut more efficiently, it seems sharper. But real sharpening uses specialty stones to actually fix the edge and doesn't need to be done regularly. Honing needs to be done regularly. Some chefs hone every single time they use their knives. You should hone the blade immediately after any sharpening. Sharpening can be done at home or professionally, and only needs to be done once or twice a year. Hold the honing rod down, perpendicular to the counter. Hold the rod from the top of the handle, with the end on the ground. You can put a dishtowel underneath it to help keep it in place. Hold the blade against the rod at a 45-degree angle to the honing rod. This is not the angle you want to sharpen at, it is just a step to help you get the right angle. Start with the blade perpendicular to the rod, then pick your hand up to angle the blade down at a 45-degree angle to the rod. Start near the handle of the blade. Rotate the blade halfway towards the rod to create a roughly 20-23-degree angle. This doesn't have to be precisely measured, but you should get used to this angle. If you're struggling, just think about being roughly halfway to 45-degrees. Remember that the blade is pointing down to the counter, not up. Pull the knife quickly towards you to hone it. Keeping the blade at this 20-degree angle, draw the blade back towards you on a straight line. You should only need 4-5 passes if you hone the blade regularly, but 8-10 if you haven't done it in a while. You want to use gentle, fluid pressure through each draw. Making it a quick, even motion will help. Switch to the other side of the blade and repeat. In order to center the blade, you need to hone both sides the same number of times. Replace your honing rod when it becomes visibly dull. You'll notice the grooves on the rod becoming smooth, and it won't actually help you much anymore. Luckily, these things are cheap. Fixing a Broken Tip Keep the whetstone prepared and ready like any other sharpening. You want to soak the stones, keep them on a damp cloth to prevent slipping, and continually add water to the stone. This strategy is only for a broken knife tip, not cracks or issues further down the knife. Turn your coarsest stone sideways. Again, put a damp towel on the table to prevent movement. You'll likely need your opposite hand to hold the stone still as you work. Run the tip of the knife horizontally across the side of your coarsest whetstone to grind it back to a point. Hold the knife near the point and grind the flat, broken tip into a diagonal point. Remember to keep the stone wet, moving back and forth to get rid of the knicks and cracks. Rock the knife back and forth on the stone, as if cutting with it, to round out the edge. Now, run the knife back and forth vertically, like you would if you are cutting it. Keep the stone wet, and work the knife until you have a decent (but blunt!) curve to the tip of your knife. Sharpen the entire knife after fixing the tip. Do not do this in reverse -- you want to fix the tip, then sharpen the knife. This will bring the entire thing back to the right alignment and sharpness.",
  "sentences":[
    " Sharpening with a Whetstone Gather the necessary materials.",
    "You will need a double-sided (coarse and fine grit) synthetic sharpening stone.",
    "You will also need a honing steel, which is typically sold in the form of a lightly-grooved, magnetized iron rod.",
    "Both of these materials can be found at your local hardware store.",
    "Sharpening stones have two sides with different grits.",
    "The grit measures how rough the stone is, and thus how severely it sharpens.",
    "Higher numbers stand for finer grits meaning the lowest number is the roughest surface.",
    "Soak your whetstones in water until no air bubbles pop up anymore.",
    "The stone is porous, and it needs to fill with water so that the blade doesn't catch.",
    "This decreased friction and helps prevent scratches and nicks.",
    "You'll want to keep getting the stone wet as you work, so keep some water nearby.",
    "Place the stone on a non-slip service to prevent any dangerous issues.",
    "You can use a damp towel or a silicon baking sheet or hot pad.",
    "You do not want the stone moving as you sharpen, as this is the number one way to accidentally end up in the ER.",
    "Begin with the coarse grit side of the stone, the one with the lower number.",
    "Splash some water on top before beginning.",
    "You always start with the rougher side of the stone, with the lower grit rating.",
    "Many stones start at F 400 (European measurement) or J 1000 (Japanese measurement).",
    "Professional chefs may have multiple stones with many different grits to smoothly craft a point.",
    "More variety means you can get a better edge by slowly increasing the resistance.",
    "If you have a broken tip on the knife, fix this before sharpening.",
    "Tilt the knife so that the blade makes a roughly 22-degree angle with the stone.",
    "This can be hard to find, but just do it in pieces.",
    "Perpendicular to the stone (blade touching the stone, as if you were cutting), is 90-degrees.",
    "Now, angle the blade so that it is halfway between perpendicular and laying on the stone.",
    "This is 45-degrees.",
    "Now angle the stone to be roughly halfway between this angle and the stone -- you've got it!",
    "A steeper angle always leads to a more durable knife, but too steep and you will risk cracking the edge.",
    "Hold the knife with the handle in your dominant hand so that your index finger is on the edge of the blade, almost where it meets the stone.",
    "This hand provides the control and keeps the edge down on the stone as you work.",
    "Spread your non-dominant hand fingers on the back of the blade itself, applying even pressure across the whole blade down into the stone.",
    "These fingers are your guides, keeping the knife down and moving it smoothly as you work.",
    "These fingers will naturally slide to help the area you're working on since most stones are not big enough to fit the whole knife.",
    "Keeping the angle of the knife consistent throughout, push the blade evenly across the whetstone.",
    "This motion should be smooth and fluid, almost like you were lightly slicing off an impossibly thin piece of the stone.",
    "Splash the whetstone with water every few minutes to keep it wet.",
    "Friction, when not controlled, is not your friend.",
    "Keep the stone wet to prevent accidental damage.",
    "It is often a good idea to wipe any grit off the blade each time your wet the stone again Repeat as many times as necessary, moving your fingers across the blade to sharpen the whole thing.",
    "With your non-dominant hand, move up to the tip of the blade and focus on that.",
    "Then slide down and sharpen the meet of the blade before moving down to the hilt.",
    "Try to use the same number of movements for each section.",
    "Don't try and push the blade down into the stone.",
    "You want it to stay flush to the stone with every pass, but you don't want to be digging it in.",
    "Flip the blade over and repeat with the other side, making the same number of passes.",
    "You want both sides to be evenly sharpened, otherwise, the knife will be misaligned.",
    "The exact same strategy should be used as the first side.",
    "Feel the opposite side of the knife from the one you've been sharpening.",
    "If you feel a little burr or catch on the unsharpened side, it means it's time to flip.",
    "Switch to the finer grit stone and alternate sharpening each side.",
    "Make one pass on the right side, flip the knife, and make another on the left.",
    "Both the angle and motion are still consistent, as is the need to keep the stone wet.",
    "However, since the finer grit is making smaller, finer changes, you want to ensure that you evenly balance them by alternating sides.",
    "You only need very light pressure down on the knife with the fine grit stone.",
    "Keep the stone extra wet, and wipe the grit from the knife frequently with a damp towel.",
    "\"Cut\" a wooden cutting board with the knife to even out the cutting surface.",
    "Take your sharpened knife and \"slice\" down the edge of a wooden cutting board, as if you were trying to cut into it.",
    "You only need to do it one -- but simply dragging the blade across the cutting board to clean off the cutting edge.",
    "Hone the blade.",
    "The next step is to use your steel honing rod (sometimes known as a steeling rod), to make sure the blade is properly aligned.",
    "Make sure you use a few passes on each side and keep honing the blade every time you use it.",
    "Honing the Blade Understand the difference between honing and sharpening your knives.",
    "The long steel rod that most people consider a \"sharpening rod\" is actually used for honing the blade, which centers the edge for even cutting.",
    "Because it makes the blade cut more efficiently, it seems sharper.",
    "But real sharpening uses specialty stones to actually fix the edge and doesn't need to be done regularly.",
    "Honing needs to be done regularly.",
    "Some chefs hone every single time they use their knives.",
    "You should hone the blade immediately after any sharpening.",
    "Sharpening can be done at home or professionally, and only needs to be done once or twice a year.",
    "Hold the honing rod down, perpendicular to the counter.",
    "Hold the rod from the top of the handle, with the end on the ground.",
    "You can put a dishtowel underneath it to help keep it in place.",
    "Hold the blade against the rod at a 45-degree angle to the honing rod.",
    "This is not the angle you want to sharpen at, it is just a step to help you get the right angle.",
    "Start with the blade perpendicular to the rod, then pick your hand up to angle the blade down at a 45-degree angle to the rod.",
    "Start near the handle of the blade.",
    "Rotate the blade halfway towards the rod to create a roughly 20-23-degree angle.",
    "This doesn't have to be precisely measured, but you should get used to this angle.",
    "If you're struggling, just think about being roughly halfway to 45-degrees.",
    "Remember that the blade is pointing down to the counter, not up.",
    "Pull the knife quickly towards you to hone it.",
    "Keeping the blade at this 20-degree angle, draw the blade back towards you on a straight line.",
    "You should only need 4-5 passes if you hone the blade regularly, but 8-10 if you haven't done it in a while.",
    "You want to use gentle, fluid pressure through each draw.",
    "Making it a quick, even motion will help.",
    "Switch to the other side of the blade and repeat.",
    "In order to center the blade, you need to hone both sides the same number of times.",
    "Replace your honing rod when it becomes visibly dull.",
    "You'll notice the grooves on the rod becoming smooth, and it won't actually help you much anymore.",
    "Luckily, these things are cheap.",
    "Fixing a Broken Tip Keep the whetstone prepared and ready like any other sharpening.",
    "You want to soak the stones, keep them on a damp cloth to prevent slipping, and continually add water to the stone.",
    "This strategy is only for a broken knife tip, not cracks or issues further down the knife.",
    "Turn your coarsest stone sideways.",
    "Again, put a damp towel on the table to prevent movement.",
    "You'll likely need your opposite hand to hold the stone still as you work.",
    "Run the tip of the knife horizontally across the side of your coarsest whetstone to grind it back to a point.",
    "Hold the knife near the point and grind the flat, broken tip into a diagonal point.",
    "Remember to keep the stone wet, moving back and forth to get rid of the knicks and cracks.",
    "Rock the knife back and forth on the stone, as if cutting with it, to round out the edge.",
    "Now, run the knife back and forth vertically, like you would if you are cutting it.",
    "Keep the stone wet, and work the knife until you have a decent (but blunt!)",
    "curve to the tip of your knife.",
    "Sharpen the entire knife after fixing the tip.",
    "Do not do this in reverse -- you want to fix the tip, then sharpen the knife.",
    "This will bring the entire thing back to the right alignment and sharpness."
  ],
  "tyn_section":[
    "Knives",
    "Synthetic sharpening stone",
    "Sharpening steel",
    "Cutting board"
  ],
  "tyn_model":[
    "knife",
    "water",
    "whetstone",
    "honing rod",
    "stones",
    "knives",
    "sharpening",
    "sharpening stone",
    "honing steel",
    "iron rod",
    "sharpening stones",
    "whetstones",
    "baking sheet",
    "hot pad",
    "finer grit stone",
    "fine grit stone",
    "steel honing rod",
    "steeling rod",
    "dishtowel",
    "blade",
    "stone"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0476190476,
    "f1":0.08,
    "avg_pos":0.2380952381
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.1428571429,
    "f1":0.24
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2857142857,
    "f1":0.4137931034
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0952380952,
    "f1":0.16
  }
}