{
  "title":"How to Dip Oreos in Chocolate",
  "url":"https://www.wikihow.com/Dip-Oreos-in-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Chocophilia"
  ],
  "parts":[
    {
      "name":"Melting the Chocolate",
      "steps":[
        {
          "headline":"Chop the chocolate.",
          "description":"Chocolate melts more easily if it’s cut into pieces rather than in a solid block. Use a sharp knife to roughly chop the chocolate of your choice into pieces. Place the chopped chocolate in a microwave-safe bowl. You can use good quality milk, dark, semisweet, bittersweet, or even white chocolate to dip your Oreos in. You may find it easier to use candy melts to coat your Oreos. They are chocolate discs that are made to melt easily, and come in a wide array of flavors and colors so you can create dipped Oreos for holidays and special occasions. Chocolate chips also work well for dipped Oreos because you don’t have worry about chopping them beforehand."
        },
        {
          "headline":"Melt the chocolate in the microwave in intervals.",
          "description":"The easiest way to melt the chocolate is in the microwave. Heat the bowl of chocolate on high in 30 second intervals, making sure to stir the chocolate well after each interval. Continue heating the chocolate until it’s fully melted and smooth. Stirring the chocolate after each 30-second period in the microwave is important. The chocolate can sometimes still look lumpy until you give it a good stir and it smoothes out. You don’t want to burn the chocolate by heating it too long."
        },
        {
          "headline":"Add the melted butter to the chocolate.",
          "description":"Once the chocolate is completely melted, add 2 teaspoons (10 g) of unsalted butter that’s been melted to it. Stir the mixture well until the butter is fully incorporated and the chocolate has a smooth, even consistency. Adding the butter is optional. It helps thin out the chocolate so it coats the cookies more evenly. If your chocolate mixture appears thin enough to cover the Oreos on its own, you can omit the butter if you like. You can flavor the melted chocolate. For example, mix in ½ teaspoon (2.5 ml) of peppermint extract into the chocolate for minty dipped Oreos."
        }
      ]
    },
    {
      "name":"Dipping the Oreos with Forks",
      "steps":[
        {
          "headline":"Line a cookie sheet with parchment paper.",
          "description":"When you dip the cookies in the chocolate, you’ll need some place to put them where they won’t make too much of a mess. Take a large cookie or baking sheet, and line it with a piece of parchment paper to keep the Oreos from sticking to it. You can substitute a silicone baking sheet for the parchment paper if you prefer."
        },
        {
          "headline":"Dip the cookies into the chocolate with two forks.",
          "description":"Place the bowl of melted chocolate on your work surface beside approximately 24 Oreos. The easiest way to dip the cookies into the chocolate without getting your hands dirty is to sandwich one between two forks and carefully lower it into the melted chocolate until it is fully coated. Set the dipped cookies on the lined baking sheet. The melted chocolate shouldn’t be too hot or too cold when you dip the cookies. If it’s too hot, it will slide right off the Oreos. If it’s too cold, it will create a lumpy, uneven coat around the cookies. If the chocolate starts to thicken up as you’re dipping the cookies, reheat it in the microwave in 10-second intervals until it’s the right consistency once more. Be sure to tap the forks against the side of the bowl before placing it on the baking sheet. That will knock off any excess chocolate that might create bumps on the Oreos as they cool. When the chocolate is still soft on the Oreos, you can add toppings if you’d like. For example, you might sprinkle chopped nuts, sprinkles, sea salt, or crushed peppermint candies on the dipped cookies."
        },
        {
          "headline":"Refrigerate the cookies.",
          "description":"Once you’ve dipped all of the Oreos, place the baking sheet in the refrigerator. Allow the cookies to chill for approximately an hour so the chocolate can set up. Serve the cookies or package them to hand out as gifts. The cookies will keep in an airtight container for up to a week. When the dipped Oreos are chilled, you can drizzle additional melted chocolate over them if you’d like. For example, if you’ve dipped your cookies in dark chocolate, you might want to drizzle melted white chocolate over them."
        }
      ]
    },
    {
      "name":"Using a Mold to Cover the Oreos",
      "steps":[
        {
          "headline":"Fill the wells in an Oreo mold with some melted chocolate.",
          "description":"To get more even, smooth dipped Oreos, it helps to use a plastic mold meant for candy-making. Fill the wells in your mold with approximately 1 tablespoon (15 ml) of the melted chocolate. Use a spoon to smooth the chocolate into place. You can find molds that are designed for Oreos and other sandwich cookies at a variety of stores and websites that carry candy-making supplies."
        },
        {
          "headline":"Place an Oreo in each well.",
          "description":"With a layer of melted chocolate in the mold, set one cookie in each well. Press down on the cookie gently so the chocolate comes up around its sides. While the chocolate should come up around the sides of the Oreos, it shouldn’t cover the tops of them completely."
        },
        {
          "headline":"Add a little more chocolate on top of the cookies and smoothies.",
          "description":"Once the Oreos are pressed into the melted chocolate, use a spoon to carefully add a little more chocolate to the top of the cookies. Spread the chocolate with the spoon to fill in any gaps. You just want to add enough chocolate to the cover the tops of the cookies. Don’t pile too much chocolate on the tops of cookies or they can wind up lopsided. If the melted chocolate starts to thicken up as you’ve covering the Oreo, reheat it in the microwave in 10 second intervals until it’s the right consistency to spread."
        },
        {
          "headline":"Refrigerate the Oreos.",
          "description":"After you’ve covered all of the cookies with more melted chocolate, place the mold in the refrigerator to chill them so they set up. It can take as little as 5 minutes for the chocolate to harden, but you may want to leave them in the refrigerator for up to an hour."
        },
        {
          "headline":"Pop the cookies out of the mold.",
          "description":"When the chocolate has set up, remove the mold from the refrigerator. Turn the mold over over a cooling rack and carefully pop the cookies out of the wells. Set the Oreos on a serving plate or place in bags to give as gifts. If you want to give your molded, dipped Oreos an even fancier look, use chocolate transfer sheets to add patterns to the smooth top of the dipped cookies. The transfer sheets, available where candy-making supplies are sold, come in a variety of patterns and colors that suit virtually any holiday or special occasion. To use the transfer sheets, add a dollop of melted chocolate to the top of the set cookies. Press a piece of the transfer sheet to the Oreo over the melted chocolate, and pull away the sheet. The pattern will be imprinted on the top of the cookie."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Melting the Chocolate Chop the chocolate. Chocolate melts more easily if it’s cut into pieces rather than in a solid block. Use a sharp knife to roughly chop the chocolate of your choice into pieces. Place the chopped chocolate in a microwave-safe bowl. You can use good quality milk, dark, semisweet, bittersweet, or even white chocolate to dip your Oreos in. You may find it easier to use candy melts to coat your Oreos. They are chocolate discs that are made to melt easily, and come in a wide array of flavors and colors so you can create dipped Oreos for holidays and special occasions. Chocolate chips also work well for dipped Oreos because you don’t have worry about chopping them beforehand. Melt the chocolate in the microwave in intervals. The easiest way to melt the chocolate is in the microwave. Heat the bowl of chocolate on high in 30 second intervals, making sure to stir the chocolate well after each interval. Continue heating the chocolate until it’s fully melted and smooth. Stirring the chocolate after each 30-second period in the microwave is important. The chocolate can sometimes still look lumpy until you give it a good stir and it smoothes out. You don’t want to burn the chocolate by heating it too long. Add the melted butter to the chocolate. Once the chocolate is completely melted, add 2 teaspoons (10 g) of unsalted butter that’s been melted to it. Stir the mixture well until the butter is fully incorporated and the chocolate has a smooth, even consistency. Adding the butter is optional. It helps thin out the chocolate so it coats the cookies more evenly. If your chocolate mixture appears thin enough to cover the Oreos on its own, you can omit the butter if you like. You can flavor the melted chocolate. For example, mix in ½ teaspoon (2.5 ml) of peppermint extract into the chocolate for minty dipped Oreos. Dipping the Oreos with Forks Line a cookie sheet with parchment paper. When you dip the cookies in the chocolate, you’ll need some place to put them where they won’t make too much of a mess. Take a large cookie or baking sheet, and line it with a piece of parchment paper to keep the Oreos from sticking to it. You can substitute a silicone baking sheet for the parchment paper if you prefer. Dip the cookies into the chocolate with two forks. Place the bowl of melted chocolate on your work surface beside approximately 24 Oreos. The easiest way to dip the cookies into the chocolate without getting your hands dirty is to sandwich one between two forks and carefully lower it into the melted chocolate until it is fully coated. Set the dipped cookies on the lined baking sheet. The melted chocolate shouldn’t be too hot or too cold when you dip the cookies. If it’s too hot, it will slide right off the Oreos. If it’s too cold, it will create a lumpy, uneven coat around the cookies. If the chocolate starts to thicken up as you’re dipping the cookies, reheat it in the microwave in 10-second intervals until it’s the right consistency once more. Be sure to tap the forks against the side of the bowl before placing it on the baking sheet. That will knock off any excess chocolate that might create bumps on the Oreos as they cool. When the chocolate is still soft on the Oreos, you can add toppings if you’d like. For example, you might sprinkle chopped nuts, sprinkles, sea salt, or crushed peppermint candies on the dipped cookies. Refrigerate the cookies. Once you’ve dipped all of the Oreos, place the baking sheet in the refrigerator. Allow the cookies to chill for approximately an hour so the chocolate can set up. Serve the cookies or package them to hand out as gifts. The cookies will keep in an airtight container for up to a week. When the dipped Oreos are chilled, you can drizzle additional melted chocolate over them if you’d like. For example, if you’ve dipped your cookies in dark chocolate, you might want to drizzle melted white chocolate over them. Using a Mold to Cover the Oreos Fill the wells in an Oreo mold with some melted chocolate. To get more even, smooth dipped Oreos, it helps to use a plastic mold meant for candy-making. Fill the wells in your mold with approximately 1 tablespoon (15 ml) of the melted chocolate. Use a spoon to smooth the chocolate into place. You can find molds that are designed for Oreos and other sandwich cookies at a variety of stores and websites that carry candy-making supplies. Place an Oreo in each well. With a layer of melted chocolate in the mold, set one cookie in each well. Press down on the cookie gently so the chocolate comes up around its sides. While the chocolate should come up around the sides of the Oreos, it shouldn’t cover the tops of them completely. Add a little more chocolate on top of the cookies and smoothies. Once the Oreos are pressed into the melted chocolate, use a spoon to carefully add a little more chocolate to the top of the cookies. Spread the chocolate with the spoon to fill in any gaps. You just want to add enough chocolate to the cover the tops of the cookies. Don’t pile too much chocolate on the tops of cookies or they can wind up lopsided. If the melted chocolate starts to thicken up as you’ve covering the Oreo, reheat it in the microwave in 10 second intervals until it’s the right consistency to spread. Refrigerate the Oreos. After you’ve covered all of the cookies with more melted chocolate, place the mold in the refrigerator to chill them so they set up. It can take as little as 5 minutes for the chocolate to harden, but you may want to leave them in the refrigerator for up to an hour. Pop the cookies out of the mold. When the chocolate has set up, remove the mold from the refrigerator. Turn the mold over over a cooling rack and carefully pop the cookies out of the wells. Set the Oreos on a serving plate or place in bags to give as gifts. If you want to give your molded, dipped Oreos an even fancier look, use chocolate transfer sheets to add patterns to the smooth top of the dipped cookies. The transfer sheets, available where candy-making supplies are sold, come in a variety of patterns and colors that suit virtually any holiday or special occasion. To use the transfer sheets, add a dollop of melted chocolate to the top of the set cookies. Press a piece of the transfer sheet to the Oreo over the melted chocolate, and pull away the sheet. The pattern will be imprinted on the top of the cookie. Finished. ",
  "sentences":[
    " Melting the Chocolate Chop the chocolate.",
    "Chocolate melts more easily if it’s cut into pieces rather than in a solid block.",
    "Use a sharp knife to roughly chop the chocolate of your choice into pieces.",
    "Place the chopped chocolate in a microwave-safe bowl.",
    "You can use good quality milk, dark, semisweet, bittersweet, or even white chocolate to dip your Oreos in.",
    "You may find it easier to use candy melts to coat your Oreos.",
    "They are chocolate discs that are made to melt easily, and come in a wide array of flavors and colors so you can create dipped Oreos for holidays and special occasions.",
    "Chocolate chips also work well for dipped Oreos because you don’t have worry about chopping them beforehand.",
    "Melt the chocolate in the microwave in intervals.",
    "The easiest way to melt the chocolate is in the microwave.",
    "Heat the bowl of chocolate on high in 30 second intervals, making sure to stir the chocolate well after each interval.",
    "Continue heating the chocolate until it’s fully melted and smooth.",
    "Stirring the chocolate after each 30-second period in the microwave is important.",
    "The chocolate can sometimes still look lumpy until you give it a good stir and it smoothes out.",
    "You don’t want to burn the chocolate by heating it too long.",
    "Add the melted butter to the chocolate.",
    "Once the chocolate is completely melted, add 2 teaspoons (10 g) of unsalted butter that’s been melted to it.",
    "Stir the mixture well until the butter is fully incorporated and the chocolate has a smooth, even consistency.",
    "Adding the butter is optional.",
    "It helps thin out the chocolate so it coats the cookies more evenly.",
    "If your chocolate mixture appears thin enough to cover the Oreos on its own, you can omit the butter if you like.",
    "You can flavor the melted chocolate.",
    "For example, mix in ½ teaspoon (2.5 ml) of peppermint extract into the chocolate for minty dipped Oreos.",
    "Dipping the Oreos with Forks Line a cookie sheet with parchment paper.",
    "When you dip the cookies in the chocolate, you’ll need some place to put them where they won’t make too much of a mess.",
    "Take a large cookie or baking sheet, and line it with a piece of parchment paper to keep the Oreos from sticking to it.",
    "You can substitute a silicone baking sheet for the parchment paper if you prefer.",
    "Dip the cookies into the chocolate with two forks.",
    "Place the bowl of melted chocolate on your work surface beside approximately 24 Oreos.",
    "The easiest way to dip the cookies into the chocolate without getting your hands dirty is to sandwich one between two forks and carefully lower it into the melted chocolate until it is fully coated.",
    "Set the dipped cookies on the lined baking sheet.",
    "The melted chocolate shouldn’t be too hot or too cold when you dip the cookies.",
    "If it’s too hot, it will slide right off the Oreos.",
    "If it’s too cold, it will create a lumpy, uneven coat around the cookies.",
    "If the chocolate starts to thicken up as you’re dipping the cookies, reheat it in the microwave in 10-second intervals until it’s the right consistency once more.",
    "Be sure to tap the forks against the side of the bowl before placing it on the baking sheet.",
    "That will knock off any excess chocolate that might create bumps on the Oreos as they cool.",
    "When the chocolate is still soft on the Oreos, you can add toppings if you’d like.",
    "For example, you might sprinkle chopped nuts, sprinkles, sea salt, or crushed peppermint candies on the dipped cookies.",
    "Refrigerate the cookies.",
    "Once you’ve dipped all of the Oreos, place the baking sheet in the refrigerator.",
    "Allow the cookies to chill for approximately an hour so the chocolate can set up.",
    "Serve the cookies or package them to hand out as gifts.",
    "The cookies will keep in an airtight container for up to a week.",
    "When the dipped Oreos are chilled, you can drizzle additional melted chocolate over them if you’d like.",
    "For example, if you’ve dipped your cookies in dark chocolate, you might want to drizzle melted white chocolate over them.",
    "Using a Mold to Cover the Oreos Fill the wells in an Oreo mold with some melted chocolate.",
    "To get more even, smooth dipped Oreos, it helps to use a plastic mold meant for candy-making.",
    "Fill the wells in your mold with approximately 1 tablespoon (15 ml) of the melted chocolate.",
    "Use a spoon to smooth the chocolate into place.",
    "You can find molds that are designed for Oreos and other sandwich cookies at a variety of stores and websites that carry candy-making supplies.",
    "Place an Oreo in each well.",
    "With a layer of melted chocolate in the mold, set one cookie in each well.",
    "Press down on the cookie gently so the chocolate comes up around its sides.",
    "While the chocolate should come up around the sides of the Oreos, it shouldn’t cover the tops of them completely.",
    "Add a little more chocolate on top of the cookies and smoothies.",
    "Once the Oreos are pressed into the melted chocolate, use a spoon to carefully add a little more chocolate to the top of the cookies.",
    "Spread the chocolate with the spoon to fill in any gaps.",
    "You just want to add enough chocolate to the cover the tops of the cookies.",
    "Don’t pile too much chocolate on the tops of cookies or they can wind up lopsided.",
    "If the melted chocolate starts to thicken up as you’ve covering the Oreo, reheat it in the microwave in 10 second intervals until it’s the right consistency to spread.",
    "Refrigerate the Oreos.",
    "After you’ve covered all of the cookies with more melted chocolate, place the mold in the refrigerator to chill them so they set up.",
    "It can take as little as 5 minutes for the chocolate to harden, but you may want to leave them in the refrigerator for up to an hour.",
    "Pop the cookies out of the mold.",
    "When the chocolate has set up, remove the mold from the refrigerator.",
    "Turn the mold over over a cooling rack and carefully pop the cookies out of the wells.",
    "Set the Oreos on a serving plate or place in bags to give as gifts.",
    "If you want to give your molded, dipped Oreos an even fancier look, use chocolate transfer sheets to add patterns to the smooth top of the dipped cookies.",
    "The transfer sheets, available where candy-making supplies are sold, come in a variety of patterns and colors that suit virtually any holiday or special occasion.",
    "To use the transfer sheets, add a dollop of melted chocolate to the top of the set cookies.",
    "Press a piece of the transfer sheet to the Oreo over the melted chocolate, and pull away the sheet.",
    "The pattern will be imprinted on the top of the cookie.",
    "Finished."
  ],
  "tyn_section":[
    "A knife",
    "A microwave-safe bowl",
    "A spoon",
    "A cookie sheet",
    "Parchment paper",
    "Two forks",
    "A plastic Oreo candy mold",
    "A wire cooling rack"
  ],
  "tyn_model":[
    "chocolate",
    "microwave",
    "baking sheet",
    "butter",
    "refrigerator",
    "bowl",
    "parchment paper",
    "forks",
    "spoon",
    "oreos",
    "transfer sheets",
    "sharp knife",
    "microwave-safe bowl",
    "candy melts",
    "chocolate chips",
    "unsalted butter",
    "peppermint extract",
    "cookie sheet",
    "sea salt",
    "airtight container",
    "oreo mold",
    "plastic mold",
    "chocolate transfer sheets",
    "candy-making supplies",
    "transfer sheet",
    "oreo"
  ],
  "simple_metrics":{
    "r":0.125,
    "p":0.0384615385,
    "f1":0.0588235294,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.1923076923,
    "f1":0.2941176471
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.3461538462,
    "f1":0.4960629921
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.1153846154,
    "f1":0.1764705882
  }
}