{
  "title":"How to Install a Faucet",
  "url":"https://www.wikihow.com/Install-a-Faucet",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Gather the right materials.",
      "description":"Special plumber's tools aren't required, just a few basic tools you may already own. Have a small bucket to catch residue water and a plastic drop sheet to keep the bottom of the cabinet dry in case of a leak or spill. Choose a faucet from the hardware store, and follow the manufacturer's instructions. A basin wrench is useful for this, but standard wrenches or pliers will work just fine. You will also need clear silicon caulk or plumber's putty and some plumber's tape."
    },
    {
      "headline":"Turn off the water.",
      "description":"The shut off valves are located below the sink. They are usually oval-shaped and found somewhere below the supply line for the tap. Turn them (very gently) clockwise to shut off the water. If a valve seems excessively tight, it may need to be replaced. Check the condition of the supply lines for leaks or obvious wear. You may want to replace these at the same time you replace the faucet. Most new faucets come fully assembled, some even with inlet hoses attached. Check with the clerk at the hardware store to be sure."
    },
    {
      "headline":"Disconnect the lines.",
      "description":"Disconnect the supply lines using a standard wrench. There should be two: one for the hot water and one for the cold."
    },
    {
      "headline":"Remove the nuts.",
      "description":"Next, remove the mounting nuts from the bottom of the old faucet. These are usually under the sink and directly below where the faucet meets the counter. There should be between 1-3 nuts and they will usually look less like a traditional nut and more like a target or clock. A basin wrench will make this job much easier."
    },
    {
      "headline":"Clean the area.",
      "description":"Remove any old caulk or putty around the holes in the sink. This is most easily done with a putty knife. Clean the area thoroughly and wipe dry."
    },
    {
      "headline":"Prepare for the new faucet.",
      "description":"Wrap thread seal tape around the threads of the faucet where they connect to the lines. Apply silicone sealant around the sink holes and where the new deck plate will be."
    },
    {
      "headline":"Insert the faucet.",
      "description":"Press the faucet down through the sink holes. Align the faucet, using the wall or the back of the sink to keep the faucet straight. Once this is done, wipe away any excess residue silicone. Ensure the inside of basin cabinet is dry."
    },
    {
      "headline":"Lock it in place.",
      "description":"Hand-tighten the mounting nuts with the thicker side up. Use pliers if necessary to stop leaks, but do not over-tighten. It may be handy to follow the specific instructions from the manufacturer for your new faucet, as where and how many of these nuts need to be placed will vary between faucet styles."
    },
    {
      "headline":"Reattach the supply lines with the adjustable wrench.",
      "description":"Plumber's tape can also be handy here. Look for a label on the lines attached to the faucet, since you want to connect the correct temperatures (hot handle to hot water, etc)."
    },
    {
      "headline":"Test your connections.",
      "description":"Turn the water on slowly and check for leaks. If you see any water dripping, turn off the valves and tighten slightly. Repeat if necessary. When everything works the way it should, you're done!"
    }
  ],
  "text":" Gather the right materials. Special plumber's tools aren't required, just a few basic tools you may already own. Have a small bucket to catch residue water and a plastic drop sheet to keep the bottom of the cabinet dry in case of a leak or spill. Choose a faucet from the hardware store, and follow the manufacturer's instructions. A basin wrench is useful for this, but standard wrenches or pliers will work just fine. You will also need clear silicon caulk or plumber's putty and some plumber's tape. Turn off the water. The shut off valves are located below the sink. They are usually oval-shaped and found somewhere below the supply line for the tap. Turn them (very gently) clockwise to shut off the water. If a valve seems excessively tight, it may need to be replaced. Check the condition of the supply lines for leaks or obvious wear. You may want to replace these at the same time you replace the faucet. Most new faucets come fully assembled, some even with inlet hoses attached. Check with the clerk at the hardware store to be sure. Disconnect the lines. Disconnect the supply lines using a standard wrench. There should be two: one for the hot water and one for the cold. Remove the nuts. Next, remove the mounting nuts from the bottom of the old faucet. These are usually under the sink and directly below where the faucet meets the counter. There should be between 1-3 nuts and they will usually look less like a traditional nut and more like a target or clock. A basin wrench will make this job much easier. Clean the area. Remove any old caulk or putty around the holes in the sink. This is most easily done with a putty knife. Clean the area thoroughly and wipe dry. Prepare for the new faucet. Wrap thread seal tape around the threads of the faucet where they connect to the lines. Apply silicone sealant around the sink holes and where the new deck plate will be. Insert the faucet. Press the faucet down through the sink holes. Align the faucet, using the wall or the back of the sink to keep the faucet straight. Once this is done, wipe away any excess residue silicone. Ensure the inside of basin cabinet is dry. Lock it in place. Hand-tighten the mounting nuts with the thicker side up. Use pliers if necessary to stop leaks, but do not over-tighten. It may be handy to follow the specific instructions from the manufacturer for your new faucet, as where and how many of these nuts need to be placed will vary between faucet styles. Reattach the supply lines with the adjustable wrench. Plumber's tape can also be handy here. Look for a label on the lines attached to the faucet, since you want to connect the correct temperatures (hot handle to hot water, etc). Test your connections. Turn the water on slowly and check for leaks. If you see any water dripping, turn off the valves and tighten slightly. Repeat if necessary. When everything works the way it should, you're done!",
  "sentences":[
    " Gather the right materials.",
    "Special plumber's tools aren't required, just a few basic tools you may already own.",
    "Have a small bucket to catch residue water and a plastic drop sheet to keep the bottom of the cabinet dry in case of a leak or spill.",
    "Choose a faucet from the hardware store, and follow the manufacturer's instructions.",
    "A basin wrench is useful for this, but standard wrenches or pliers will work just fine.",
    "You will also need clear silicon caulk or plumber's putty and some plumber's tape.",
    "Turn off the water.",
    "The shut off valves are located below the sink.",
    "They are usually oval-shaped and found somewhere below the supply line for the tap.",
    "Turn them (very gently) clockwise to shut off the water.",
    "If a valve seems excessively tight, it may need to be replaced.",
    "Check the condition of the supply lines for leaks or obvious wear.",
    "You may want to replace these at the same time you replace the faucet.",
    "Most new faucets come fully assembled, some even with inlet hoses attached.",
    "Check with the clerk at the hardware store to be sure.",
    "Disconnect the lines.",
    "Disconnect the supply lines using a standard wrench.",
    "There should be two: one for the hot water and one for the cold.",
    "Remove the nuts.",
    "Next, remove the mounting nuts from the bottom of the old faucet.",
    "These are usually under the sink and directly below where the faucet meets the counter.",
    "There should be between 1-3 nuts and they will usually look less like a traditional nut and more like a target or clock.",
    "A basin wrench will make this job much easier.",
    "Clean the area.",
    "Remove any old caulk or putty around the holes in the sink.",
    "This is most easily done with a putty knife.",
    "Clean the area thoroughly and wipe dry.",
    "Prepare for the new faucet.",
    "Wrap thread seal tape around the threads of the faucet where they connect to the lines.",
    "Apply silicone sealant around the sink holes and where the new deck plate will be.",
    "Insert the faucet.",
    "Press the faucet down through the sink holes.",
    "Align the faucet, using the wall or the back of the sink to keep the faucet straight.",
    "Once this is done, wipe away any excess residue silicone.",
    "Ensure the inside of basin cabinet is dry.",
    "Lock it in place.",
    "Hand-tighten the mounting nuts with the thicker side up.",
    "Use pliers if necessary to stop leaks, but do not over-tighten.",
    "It may be handy to follow the specific instructions from the manufacturer for your new faucet, as where and how many of these nuts need to be placed will vary between faucet styles.",
    "Reattach the supply lines with the adjustable wrench.",
    "Plumber's tape can also be handy here.",
    "Look for a label on the lines attached to the faucet, since you want to connect the correct temperatures (hot handle to hot water, etc).",
    "Test your connections.",
    "Turn the water on slowly and check for leaks.",
    "If you see any water dripping, turn off the valves and tighten slightly.",
    "Repeat if necessary.",
    "When everything works the way it should, you're done!"
  ],
  "tyn_section":[
    "New faucet",
    "Small bucket",
    "Plastic drop sheet",
    "Silicone sealant",
    "Thread seal tape",
    "Pliers",
    "Adjustable wrench"
  ],
  "tyn_model":[
    "water",
    "faucet",
    "basin wrench",
    "pliers",
    "plumber's tape",
    "plumber's tools",
    "plumber's putty",
    "wrench",
    "putty",
    "putty knife",
    "thread seal tape",
    "silicone sealant",
    "adjustable wrench"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.3076923077,
    "f1":0.4,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.4615384615,
    "f1":0.5607476636
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.5384615385,
    "f1":0.6140350877
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.3076923077,
    "f1":0.4
  }
}