{
  "title":"How to Oil Woodwork",
  "url":"https://www.wikihow.com/Oil-Woodwork",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Sand the wood to a smooth finish with extra fine 220 grit sandpaper.",
      "description":""
    },
    {
      "headline":"Apply a liberal amount (unless you're using Danish oil, which needs to be applied conservatively so the wood can soak it all up)of oil directly to a small section of your wood.",
      "description":"Tung, Linseed, Danish, Teak or Mineral oil can be used with this wood oiling technique. Mineral oil is perfect for wood projects that need to be food-safe, like cutting boards."
    },
    {
      "headline":"Rub the oil into the wood with a clean, dry soft cloth.",
      "description":"Make sure to rub the oil in the direction of the natural grain of the wood. Rub hard to work the oil well into the wood."
    },
    {
      "headline":"Continue this process until all the wood is covered.",
      "description":""
    },
    {
      "headline":"Let the oil stay on the wood for approximately 30 minutes.",
      "description":""
    },
    {
      "headline":"Remove any excess oil from the wood with a dry cloth.",
      "description":""
    },
    {
      "headline":"Allow the wood to stand for at least 24 hours.",
      "description":""
    },
    {
      "headline":"Pour a liberal amount of oil onto a piece of 600 to 800 grit wet-and-dry sandpaper.",
      "description":""
    },
    {
      "headline":"Work the oil into the wood again using the sandpaper.",
      "description":"This helps to push the oil deep into the pores and really starts to enhance the appearance of the wood's natural grain."
    },
    {
      "headline":"Repeat this process until you've covered the entire surface of the wood with the oiled sandpaper.",
      "description":""
    },
    {
      "headline":"Wipe off any excess oil from the wood with dry cloth.",
      "description":""
    },
    {
      "headline":"Allow to stand for another 24 hours.",
      "description":""
    },
    {
      "headline":"Repeat the sandpaper finish as many times as you like, until the desired luster is achieved.",
      "description":"Just make sure to remove any excess oil and allowing the wood to dry for 24 hours between each coat. It may take several days for the oil to cure completely."
    }
  ],
  "text":" Sand the wood to a smooth finish with extra fine 220 grit sandpaper.  Apply a liberal amount (unless you're using Danish oil, which needs to be applied conservatively so the wood can soak it all up)of oil directly to a small section of your wood. Tung, Linseed, Danish, Teak or Mineral oil can be used with this wood oiling technique. Mineral oil is perfect for wood projects that need to be food-safe, like cutting boards. Rub the oil into the wood with a clean, dry soft cloth. Make sure to rub the oil in the direction of the natural grain of the wood. Rub hard to work the oil well into the wood. Continue this process until all the wood is covered.  Let the oil stay on the wood for approximately 30 minutes.  Remove any excess oil from the wood with a dry cloth.  Allow the wood to stand for at least 24 hours.  Pour a liberal amount of oil onto a piece of 600 to 800 grit wet-and-dry sandpaper.  Work the oil into the wood again using the sandpaper. This helps to push the oil deep into the pores and really starts to enhance the appearance of the wood's natural grain. Repeat this process until you've covered the entire surface of the wood with the oiled sandpaper.  Wipe off any excess oil from the wood with dry cloth.  Allow to stand for another 24 hours.  Repeat the sandpaper finish as many times as you like, until the desired luster is achieved. Just make sure to remove any excess oil and allowing the wood to dry for 24 hours between each coat. It may take several days for the oil to cure completely.",
  "sentences":[
    " Sand the wood to a smooth finish with extra fine 220 grit sandpaper.",
    "Apply a liberal amount (unless you're using Danish oil, which needs to be applied conservatively so the wood can soak it all up)of oil directly to a small section of your wood.",
    "Tung, Linseed, Danish, Teak or Mineral oil can be used with this wood oiling technique.",
    "Mineral oil is perfect for wood projects that need to be food-safe, like cutting boards.",
    "Rub the oil into the wood with a clean, dry soft cloth.",
    "Make sure to rub the oil in the direction of the natural grain of the wood.",
    "Rub hard to work the oil well into the wood.",
    "Continue this process until all the wood is covered.",
    "Let the oil stay on the wood for approximately 30 minutes.",
    "Remove any excess oil from the wood with a dry cloth.",
    "Allow the wood to stand for at least 24 hours.",
    "Pour a liberal amount of oil onto a piece of 600 to 800 grit wet-and-dry sandpaper.",
    "Work the oil into the wood again using the sandpaper.",
    "This helps to push the oil deep into the pores and really starts to enhance the appearance of the wood's natural grain.",
    "Repeat this process until you've covered the entire surface of the wood with the oiled sandpaper.",
    "Wipe off any excess oil from the wood with dry cloth.",
    "Allow to stand for another 24 hours.",
    "Repeat the sandpaper finish as many times as you like, until the desired luster is achieved.",
    "Just make sure to remove any excess oil and allowing the wood to dry for 24 hours between each coat.",
    "It may take several days for the oil to cure completely."
  ],
  "tyn_section":[
    "220 grit sandpaper",
    "Linseed, Tung, Danish, Teak or Mineral oil",
    "4 or 5 clean, dry, soft cotton cloths",
    "600 to 800 grit wet-and-dry sandpaper"
  ],
  "tyn_model":[
    "oil",
    "sandpaper",
    "mineral oil",
    "220 grit sandpaper",
    "wood oiling technique",
    "cloth",
    "oiled sandpaper",
    "dry cloth"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667,
    "avg_pos":0.375
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.25,
    "f1":0.25
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667
  }
}