{
  "title":"How to Remove Acrylic Paint",
  "url":"https://www.wikihow.com/Remove-Acrylic-Paint",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Removing Paint from Clothing",
      "steps":[
        {
          "headline":"Flush any wet paint with cold, running water.",
          "description":"Hold each acrylic paint stain under cool, running water. Flush the stains until the water runs clear. Alternatively, you can soak the whole piece of clothing in cold water until the stains fade. Check the label of the clothing before you begin washing it to make sure that you can clean it at home. If it is made out of a fabric such as acetate or triacetate, take it straight to a dry cleaner."
        },
        {
          "headline":"Spray any dry stains with hairspray.",
          "description":"Use a regular hairspray to treat the stained area. Spray enough hairspray to make the fabric feel wet. Alternatively, you can also use nail polish remover. Use either an old cloth or cotton balls for the nail polish remover. If you are concerned that the hairspray or nail polish remover may damage the fabric, test it in an inconspicuous place on the clothing first. Do not use hairspray or nail polish remover on acetate or triacetate fabrics, as this will damage them. Contact a professional cleaner instead."
        },
        {
          "headline":"Use a sponge to rub at the dried acrylic paint stain.",
          "description":"Vigorously rub at the stain with a sponge until you begin to see the color of the acrylic paint transferring from the fabric to the sponge. If the paint doesn’t come out at first, spray it with more hairspray and try rubbing at it again. You can also use a clean cloth instead of a sponge if you prefer."
        },
        {
          "headline":"Scrape any stubborn dried paint away with a knife.",
          "description":"If any solid dried paint remains on the fabric, use the edge of a blunt knife to push away. Be careful not to cut into the fabric. The hairspray or nail polish remover will have helped to break down the dried acrylic paint. A butter knife is ideal."
        },
        {
          "headline":"Apply a commercial stain remover to pre-treat the stain.",
          "description":"Follow the instructions on the packet of the commercial stain remover. Either apply the stain remover directly onto the acrylic paint stains, or soak the whole piece depending on the instructions. Use a commercial stain remover for both wet and dry acrylic paint stains."
        },
        {
          "headline":"Wash the clothing in the washing machine on a low temperature setting.",
          "description":"Place the clothing in the washing machine. Choose a setting that is 86 °F (30 °C) or below. Use your regular laundry detergent. The temperature needs to be cool enough to not set the stain into the clothing. Check the label on the clothing first to make sure that it can go into the washing machine. If it can't, hand wash the clothing by washing the piece in a bucket of water and detergent, before rinsing it with clean water."
        },
        {
          "headline":"Air dry the clothing when the washing cycle is complete.",
          "description":"Hang the clothing out on a clothesline or clotheshorse using clothespins. Don’t use a dryer as the high temperatures may set any remaining stains in."
        }
      ]
    },
    {
      "name":"Cleaning Paint from Carpet or Upholstery",
      "steps":[
        {
          "headline":"Scrape any excess wet paint away with a blunt knife.",
          "description":"Use a knife to lightly scrape away all of the paint that is on the surface. Wipe the knife on a paper towel or cloth to clean it after each time that you scrape paint away. Make sure that you scrape at the carpet or upholstery very carefully so that you don’t damage it."
        },
        {
          "headline":"Mix warm water with soap in a bucket.",
          "description":"Fill a bucket halfway with warm water. Add bar soap, dish detergent, or laundry detergent as you fill it. If you don't have a bucket, make sure that you use a container that is wide enough to dip a cloth into. Make sure that the water isn't hot, as this could set the stain in."
        },
        {
          "headline":"Blot the stain with the warm, soapy water.",
          "description":"Make the cloth slightly damp and use quick upward motion to twist the pile of acrylic paint as you lift it away. Dab at the stain lightly rather than pushing into it. Start from the outside and work your way towards the center of the stain. Continue blotting at the stain until the cloth comes up clean of paint. Make sure that the cloth is only damp, as using too much water could spread the stain over a larger area."
        },
        {
          "headline":"Dab the stain with nail polish remover if the damp, soapy cloth didn’t work.",
          "description":"Test the nail polish remover on an inconspicuous area first to make sure it doesn’t damage the carpet or upholstery. Then blot at the stain with the nail polish remover until it lifts away. Do not use nail polish remover if the upholstery is made from acetate or triacetate, as this can cause a color change. If you are unsure of the material, test the nail polish remover in an inconspicuous location first. Use either an old cloth or cotton balls for the nail polish remover."
        }
      ]
    },
    {
      "name":"Removing Paint from Wood or Plastic",
      "steps":[
        {
          "headline":"Wipe away as much wet paint as possible.",
          "description":"Use paper towels or a cloth to remove any wet acrylic paint. If you are using a cloth, make sure to flush it with water and rinse it as soon as you are done to avoid staining the fabric."
        },
        {
          "headline":"Spread a thin layer of vegetable oil over the paint.",
          "description":"Pour a small amount of vegetable oil onto a paper towel. Wipe it over the spots of dry acrylic paint. The vegetable oil will help to soften the paint before you scrape it away."
        },
        {
          "headline":"Scrape away any dried paint with a plastic scraper on plastic surfaces.",
          "description":"Start from the edges of the stain, and work your way towards the center. Apply more vegetable oil if necessary. You can purchase plastic scrapers from hardware stores."
        },
        {
          "headline":"Use denatured alcohol for any stubborn stains on plastic or wood.",
          "description":"Apply denatured alcohol to either a cotton ball or a cloth. Rub at the stain to lift the paint away. Test the denatured alcohol on an inconspicuous area of the plastic or wood first to make sure that the material won’t be damaged. Pick a small area on the underside or back of the plastic or wood. Apply a small amount of denatured alcohol. Let the denatured alcohol dry, before checking that the wood or plastic isn't damaged or stained."
        },
        {
          "headline":"Combine warm water and soap in a bucket.",
          "description":"Fill up a bucket halfway with soap and warm water. Use bar soap or dish detergent. Make sure that the bucket or container that you are using is large enough to dip a cloth into."
        },
        {
          "headline":"Use the soapy water to clean away all traces of denatured alcohol.",
          "description":"Dip a cloth into the warm, soapy water, and wipe it over the area. Once the area is clean, dry it with a paper towel. The cloth only needs to be damp, not saturated."
        }
      ]
    },
    {
      "name":"Cleaning Paint from Glass",
      "steps":[
        {
          "headline":"Dip a sponge into a bucket of warm, soapy water.",
          "description":"Fill a bucket up halfway with warm water. Add dish soap to make the water sudsy, then dip in the sponge and squeeze it to remove the excess water. You can also use a cloth instead of a sponge."
        },
        {
          "headline":"Wet the glass thoroughly with the wet sponge.",
          "description":"Use the sponge to completely saturate the surface of the paint. This should remove any wet acrylic paint, and it will loosen any paint that has dried."
        },
        {
          "headline":"Scrape away any dry acrylic paint with a safety razor blade.",
          "description":"Hold the razor blade against the glass at about a 45 degree angle. Scrape away any paint stains, starting from the outside and working your way towards the center. Make sure that the glass is damp at all times while you are scraping it to avoid scratches forming. Apply more warm, soapy water as necessary. Be very careful when using a safety razor blade. Always keep the case on when it's not in use. Don't use a safety razor blade on tempered glass as it will scratch it. It will say in the bottom right hand corner of each pane of glass if it is tempered."
        },
        {
          "headline":"Dry the glass when you have finished cleaning up the paint.",
          "description":"Use a dry cloth to thoroughly dry the full surface of the glass. This should remove any streaks. Use either a homemade or store-bought window cleaner if any streaks remain."
        }
      ]
    }
  ],
  "text":" Removing Paint from Clothing Flush any wet paint with cold, running water. Hold each acrylic paint stain under cool, running water. Flush the stains until the water runs clear. Alternatively, you can soak the whole piece of clothing in cold water until the stains fade. Check the label of the clothing before you begin washing it to make sure that you can clean it at home. If it is made out of a fabric such as acetate or triacetate, take it straight to a dry cleaner. Spray any dry stains with hairspray. Use a regular hairspray to treat the stained area. Spray enough hairspray to make the fabric feel wet. Alternatively, you can also use nail polish remover. Use either an old cloth or cotton balls for the nail polish remover. If you are concerned that the hairspray or nail polish remover may damage the fabric, test it in an inconspicuous place on the clothing first. Do not use hairspray or nail polish remover on acetate or triacetate fabrics, as this will damage them. Contact a professional cleaner instead. Use a sponge to rub at the dried acrylic paint stain. Vigorously rub at the stain with a sponge until you begin to see the color of the acrylic paint transferring from the fabric to the sponge. If the paint doesn’t come out at first, spray it with more hairspray and try rubbing at it again. You can also use a clean cloth instead of a sponge if you prefer. Scrape any stubborn dried paint away with a knife. If any solid dried paint remains on the fabric, use the edge of a blunt knife to push away. Be careful not to cut into the fabric. The hairspray or nail polish remover will have helped to break down the dried acrylic paint. A butter knife is ideal. Apply a commercial stain remover to pre-treat the stain. Follow the instructions on the packet of the commercial stain remover. Either apply the stain remover directly onto the acrylic paint stains, or soak the whole piece depending on the instructions. Use a commercial stain remover for both wet and dry acrylic paint stains. Wash the clothing in the washing machine on a low temperature setting. Place the clothing in the washing machine. Choose a setting that is 86 °F (30 °C) or below. Use your regular laundry detergent. The temperature needs to be cool enough to not set the stain into the clothing. Check the label on the clothing first to make sure that it can go into the washing machine. If it can't, hand wash the clothing by washing the piece in a bucket of water and detergent, before rinsing it with clean water. Air dry the clothing when the washing cycle is complete. Hang the clothing out on a clothesline or clotheshorse using clothespins. Don’t use a dryer as the high temperatures may set any remaining stains in. Cleaning Paint from Carpet or Upholstery Scrape any excess wet paint away with a blunt knife. Use a knife to lightly scrape away all of the paint that is on the surface. Wipe the knife on a paper towel or cloth to clean it after each time that you scrape paint away. Make sure that you scrape at the carpet or upholstery very carefully so that you don’t damage it. Mix warm water with soap in a bucket. Fill a bucket halfway with warm water. Add bar soap, dish detergent, or laundry detergent as you fill it. If you don't have a bucket, make sure that you use a container that is wide enough to dip a cloth into. Make sure that the water isn't hot, as this could set the stain in. Blot the stain with the warm, soapy water. Make the cloth slightly damp and use quick upward motion to twist the pile of acrylic paint as you lift it away. Dab at the stain lightly rather than pushing into it. Start from the outside and work your way towards the center of the stain. Continue blotting at the stain until the cloth comes up clean of paint. Make sure that the cloth is only damp, as using too much water could spread the stain over a larger area. Dab the stain with nail polish remover if the damp, soapy cloth didn’t work. Test the nail polish remover on an inconspicuous area first to make sure it doesn’t damage the carpet or upholstery. Then blot at the stain with the nail polish remover until it lifts away. Do not use nail polish remover if the upholstery is made from acetate or triacetate, as this can cause a color change. If you are unsure of the material, test the nail polish remover in an inconspicuous location first. Use either an old cloth or cotton balls for the nail polish remover. Removing Paint from Wood or Plastic Wipe away as much wet paint as possible. Use paper towels or a cloth to remove any wet acrylic paint. If you are using a cloth, make sure to flush it with water and rinse it as soon as you are done to avoid staining the fabric. Spread a thin layer of vegetable oil over the paint. Pour a small amount of vegetable oil onto a paper towel. Wipe it over the spots of dry acrylic paint. The vegetable oil will help to soften the paint before you scrape it away. Scrape away any dried paint with a plastic scraper on plastic surfaces. Start from the edges of the stain, and work your way towards the center. Apply more vegetable oil if necessary. You can purchase plastic scrapers from hardware stores. Use denatured alcohol for any stubborn stains on plastic or wood. Apply denatured alcohol to either a cotton ball or a cloth. Rub at the stain to lift the paint away. Test the denatured alcohol on an inconspicuous area of the plastic or wood first to make sure that the material won’t be damaged. Pick a small area on the underside or back of the plastic or wood. Apply a small amount of denatured alcohol. Let the denatured alcohol dry, before checking that the wood or plastic isn't damaged or stained. Combine warm water and soap in a bucket. Fill up a bucket halfway with soap and warm water. Use bar soap or dish detergent. Make sure that the bucket or container that you are using is large enough to dip a cloth into. Use the soapy water to clean away all traces of denatured alcohol. Dip a cloth into the warm, soapy water, and wipe it over the area. Once the area is clean, dry it with a paper towel. The cloth only needs to be damp, not saturated. Cleaning Paint from Glass Dip a sponge into a bucket of warm, soapy water. Fill a bucket up halfway with warm water. Add dish soap to make the water sudsy, then dip in the sponge and squeeze it to remove the excess water. You can also use a cloth instead of a sponge. Wet the glass thoroughly with the wet sponge. Use the sponge to completely saturate the surface of the paint. This should remove any wet acrylic paint, and it will loosen any paint that has dried. Scrape away any dry acrylic paint with a safety razor blade. Hold the razor blade against the glass at about a 45 degree angle. Scrape away any paint stains, starting from the outside and working your way towards the center. Make sure that the glass is damp at all times while you are scraping it to avoid scratches forming. Apply more warm, soapy water as necessary. Be very careful when using a safety razor blade. Always keep the case on when it's not in use. Don't use a safety razor blade on tempered glass as it will scratch it. It will say in the bottom right hand corner of each pane of glass if it is tempered. Dry the glass when you have finished cleaning up the paint. Use a dry cloth to thoroughly dry the full surface of the glass. This should remove any streaks. Use either a homemade or store-bought window cleaner if any streaks remain.",
  "sentences":[
    " Removing Paint from Clothing Flush any wet paint with cold, running water.",
    "Hold each acrylic paint stain under cool, running water.",
    "Flush the stains until the water runs clear.",
    "Alternatively, you can soak the whole piece of clothing in cold water until the stains fade.",
    "Check the label of the clothing before you begin washing it to make sure that you can clean it at home.",
    "If it is made out of a fabric such as acetate or triacetate, take it straight to a dry cleaner.",
    "Spray any dry stains with hairspray.",
    "Use a regular hairspray to treat the stained area.",
    "Spray enough hairspray to make the fabric feel wet.",
    "Alternatively, you can also use nail polish remover.",
    "Use either an old cloth or cotton balls for the nail polish remover.",
    "If you are concerned that the hairspray or nail polish remover may damage the fabric, test it in an inconspicuous place on the clothing first.",
    "Do not use hairspray or nail polish remover on acetate or triacetate fabrics, as this will damage them.",
    "Contact a professional cleaner instead.",
    "Use a sponge to rub at the dried acrylic paint stain.",
    "Vigorously rub at the stain with a sponge until you begin to see the color of the acrylic paint transferring from the fabric to the sponge.",
    "If the paint doesn’t come out at first, spray it with more hairspray and try rubbing at it again.",
    "You can also use a clean cloth instead of a sponge if you prefer.",
    "Scrape any stubborn dried paint away with a knife.",
    "If any solid dried paint remains on the fabric, use the edge of a blunt knife to push away.",
    "Be careful not to cut into the fabric.",
    "The hairspray or nail polish remover will have helped to break down the dried acrylic paint.",
    "A butter knife is ideal.",
    "Apply a commercial stain remover to pre-treat the stain.",
    "Follow the instructions on the packet of the commercial stain remover.",
    "Either apply the stain remover directly onto the acrylic paint stains, or soak the whole piece depending on the instructions.",
    "Use a commercial stain remover for both wet and dry acrylic paint stains.",
    "Wash the clothing in the washing machine on a low temperature setting.",
    "Place the clothing in the washing machine.",
    "Choose a setting that is 86 °F (30 °C) or below.",
    "Use your regular laundry detergent.",
    "The temperature needs to be cool enough to not set the stain into the clothing.",
    "Check the label on the clothing first to make sure that it can go into the washing machine.",
    "If it can't, hand wash the clothing by washing the piece in a bucket of water and detergent, before rinsing it with clean water.",
    "Air dry the clothing when the washing cycle is complete.",
    "Hang the clothing out on a clothesline or clotheshorse using clothespins.",
    "Don’t use a dryer as the high temperatures may set any remaining stains in.",
    "Cleaning Paint from Carpet or Upholstery Scrape any excess wet paint away with a blunt knife.",
    "Use a knife to lightly scrape away all of the paint that is on the surface.",
    "Wipe the knife on a paper towel or cloth to clean it after each time that you scrape paint away.",
    "Make sure that you scrape at the carpet or upholstery very carefully so that you don’t damage it.",
    "Mix warm water with soap in a bucket.",
    "Fill a bucket halfway with warm water.",
    "Add bar soap, dish detergent, or laundry detergent as you fill it.",
    "If you don't have a bucket, make sure that you use a container that is wide enough to dip a cloth into.",
    "Make sure that the water isn't hot, as this could set the stain in.",
    "Blot the stain with the warm, soapy water.",
    "Make the cloth slightly damp and use quick upward motion to twist the pile of acrylic paint as you lift it away.",
    "Dab at the stain lightly rather than pushing into it.",
    "Start from the outside and work your way towards the center of the stain.",
    "Continue blotting at the stain until the cloth comes up clean of paint.",
    "Make sure that the cloth is only damp, as using too much water could spread the stain over a larger area.",
    "Dab the stain with nail polish remover if the damp, soapy cloth didn’t work.",
    "Test the nail polish remover on an inconspicuous area first to make sure it doesn’t damage the carpet or upholstery.",
    "Then blot at the stain with the nail polish remover until it lifts away.",
    "Do not use nail polish remover if the upholstery is made from acetate or triacetate, as this can cause a color change.",
    "If you are unsure of the material, test the nail polish remover in an inconspicuous location first.",
    "Use either an old cloth or cotton balls for the nail polish remover.",
    "Removing Paint from Wood or Plastic Wipe away as much wet paint as possible.",
    "Use paper towels or a cloth to remove any wet acrylic paint.",
    "If you are using a cloth, make sure to flush it with water and rinse it as soon as you are done to avoid staining the fabric.",
    "Spread a thin layer of vegetable oil over the paint.",
    "Pour a small amount of vegetable oil onto a paper towel.",
    "Wipe it over the spots of dry acrylic paint.",
    "The vegetable oil will help to soften the paint before you scrape it away.",
    "Scrape away any dried paint with a plastic scraper on plastic surfaces.",
    "Start from the edges of the stain, and work your way towards the center.",
    "Apply more vegetable oil if necessary.",
    "You can purchase plastic scrapers from hardware stores.",
    "Use denatured alcohol for any stubborn stains on plastic or wood.",
    "Apply denatured alcohol to either a cotton ball or a cloth.",
    "Rub at the stain to lift the paint away.",
    "Test the denatured alcohol on an inconspicuous area of the plastic or wood first to make sure that the material won’t be damaged.",
    "Pick a small area on the underside or back of the plastic or wood.",
    "Apply a small amount of denatured alcohol.",
    "Let the denatured alcohol dry, before checking that the wood or plastic isn't damaged or stained.",
    "Combine warm water and soap in a bucket.",
    "Fill up a bucket halfway with soap and warm water.",
    "Use bar soap or dish detergent.",
    "Make sure that the bucket or container that you are using is large enough to dip a cloth into.",
    "Use the soapy water to clean away all traces of denatured alcohol.",
    "Dip a cloth into the warm, soapy water, and wipe it over the area.",
    "Once the area is clean, dry it with a paper towel.",
    "The cloth only needs to be damp, not saturated.",
    "Cleaning Paint from Glass Dip a sponge into a bucket of warm, soapy water.",
    "Fill a bucket up halfway with warm water.",
    "Add dish soap to make the water sudsy, then dip in the sponge and squeeze it to remove the excess water.",
    "You can also use a cloth instead of a sponge.",
    "Wet the glass thoroughly with the wet sponge.",
    "Use the sponge to completely saturate the surface of the paint.",
    "This should remove any wet acrylic paint, and it will loosen any paint that has dried.",
    "Scrape away any dry acrylic paint with a safety razor blade.",
    "Hold the razor blade against the glass at about a 45 degree angle.",
    "Scrape away any paint stains, starting from the outside and working your way towards the center.",
    "Make sure that the glass is damp at all times while you are scraping it to avoid scratches forming.",
    "Apply more warm, soapy water as necessary.",
    "Be very careful when using a safety razor blade.",
    "Always keep the case on when it's not in use.",
    "Don't use a safety razor blade on tempered glass as it will scratch it.",
    "It will say in the bottom right hand corner of each pane of glass if it is tempered.",
    "Dry the glass when you have finished cleaning up the paint.",
    "Use a dry cloth to thoroughly dry the full surface of the glass.",
    "This should remove any streaks.",
    "Use either a homemade or store-bought window cleaner if any streaks remain."
  ],
  "tyn_section":[
    "Removing Acrylic Paint from Fabric",
    "Hairspray or nail polish remover",
    "Sponge or cloth",
    "Blunt knife",
    "Commercial stain remover",
    "Laundry detergent",
    "Clothesline or clotheshorse",
    "Cleaning Acrylic Paint from Carpet or Upholstery",
    "Cloth",
    "Bucket",
    "Bar soap, dish detergent, or laundry detergent",
    "Nail polish remover",
    "Old cloth or cotton balls",
    "Removing Acrylic Paint from Wood or Plastic",
    "Paper towels",
    "Cloths",
    "Vegetable oil",
    "Plastic scraper",
    "Denatured alcohol",
    "Bar soap or dish detergent",
    "Cleaning Acrylic Paint from Glass",
    "Dish detergent",
    "Sponge",
    "Safety razor blade"
  ],
  "tyn_model":[
    "water",
    "nail polish remover",
    "acrylic paint",
    "sponge",
    "hairspray",
    "bucket",
    "knife",
    "vegetable oil",
    "paint",
    "soap",
    "denatured alcohol",
    "safety razor",
    "cotton balls",
    "stain remover",
    "laundry detergent",
    "bar soap",
    "dish detergent",
    "paper towel",
    "dry cleaner",
    "professional cleaner",
    "blunt knife",
    "hairspray or",
    "butter knife",
    "commercial stain remover",
    "washing machine",
    "detergent",
    "dryer",
    "paper towels",
    "plastic scraper",
    "plastic scrapers",
    "alcohol",
    "cloth",
    "dish soap",
    "razor",
    "dry cloth",
    "window cleaner"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.3333333333,
    "f1":0.4,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5833333333,
    "p":0.5,
    "f1":0.5384615385
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7916666667,
    "p":0.75,
    "f1":0.7702702703
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5416666667,
    "p":0.3888888889,
    "f1":0.4527363184
  }
}