{
  "title":"How to Make Apple Cider Vinegar",
  "url":"https://www.wikihow.com/Make-Apple-Cider-Vinegar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Flavored Vinegars"
  ],
  "parts":[
    {
      "name":"Making a Cider Base",
      "steps":[
        {
          "headline":"Choose quality apples.",
          "description":"Even though they're left to ferment for a long time, the apples you choose can significantly shape the flavor of your finished vinegar. Choose the best quality apples available to you in order to get the best apple cider vinegar at the end. For a more complex and deep vinegar at the end, try using a combination of different apples. Use two sweet apples, such as Golden Delicious or Gala, with one sharp tasting apple, such as McIntosh or Liberty, for a slightly sharper vinegar at the end. Instead of using whole apples, save scraps from apples used in other dishes to make your apple cider vinegar. One whole apple is roughly equivalent to the scraps of two apples. Keep the peel, core and other scraps in your freezer until you’re ready to use them to make vinegar."
        },
        {
          "headline":"Wash your apples in cold water.",
          "description":"It's always a good idea to wash your fruit and vegetables before eating them, and the same is true when cooking or fermenting them. Give your apples a thorough rinse and scrub with cold water to clean away anything you don't want in your vinegar. You can use any number of apples you want to make apple cider vinegar. The more you use, the more vinegar you’ll get! If you’re just starting out making your own apple cider vinegar, try using 3 apples for your first batch. This will give you a good amount of vinegar but won’t put too much at risk if something goes wrong. If you're using apple scraps, make sure to wash the whole apples before separating the scraps from the rest of the apples."
        },
        {
          "headline":"Cut the apples into small cubes.",
          "description":"The more surface area of the apple you expose, the more quickly the vinegar will ferment. Use a clean knife to cut your apples into 1 inch (2.5 cm) cubes, keeping the peel and the core in as well. If you’re using scraps from other apples, there’s no need to cut them up further."
        },
        {
          "headline":"Transfer the apples to a glass jar.",
          "description":"As the apples will be fermenting for up to 3 months, keep them in a sterilized, wide mouth, glass jar. The apples shouldn’t fill the jar more than ¾ of the way, so a quart jar or something bigger should work perfectly. Never use stainless steel to ferment your vinegar. As the apples ferment, the acidity of the vinegar can damage the steel, or impart a metallic taste into your vinegar that might change its flavor.."
        },
        {
          "headline":"Cover the apples with water.",
          "description":"Make sure the apples are completely covered with water, as any exposed apple will begin to rot rather than ferment into vinegar. For the best results, use filtered or mineral water that will be free from any impurities that could ruin your vinegar. For a quart jar with three apples, you’ll need around 800 millilitres (27  fl oz) of water. Use more or less as is needed. It’s always better to add too much water than not enough. If you add too much, your apple cider vinegar might be a little weaker or take longer to ferment. If you don’t add enough water, some apple will be exposed and might begin to rot and ruin your vinegar entirely."
        },
        {
          "headline":"Add 1 teaspoon (4 grams) of raw sugar for each apple.",
          "description":"Stir the mixture thoroughly to make sure everything combines fully. The sugar will ferment and turn into alcohol, making the apple cider that will eventually become apple cider vinegar. Raw sugar works best for this, but you can use honey or any other sugar if you’d prefer."
        },
        {
          "headline":"Cover the jar with a cheesecloth.",
          "description":"As the apples ferment into cider and eventually vinegar, the mixture will still need to be able to breathe. Use a piece of cheesecloth held in place around the mouth of the jar with a rubber band. This will keep everything out of the jar, but still let the gases release during the fermentation process."
        }
      ]
    },
    {
      "name":"Fermenting Your Vinegar",
      "steps":[
        {
          "headline":"Keep the jar in a warm, dark place.",
          "description":"Find somewhere that you can leave the vinegar to ferment for a long time, where it won’t be disturbed unintentionally. Keep it at the bottom or on top of your pantry, in a corner of your kitchen, or anywhere else where it won't be exposed to direct sunlight. Each home will have a different, perfect place. The jar should be kept at room temperature as it ferments, which is around 70 °F (21 °C)."
        },
        {
          "headline":"Stir the mixture once or twice a day.",
          "description":"Stirring the mixture will help the fermentation process, as well as shifting apples around in the jar. Give the cider a stir with a wooden a spoon once or twice a day for the first week or two. Don’t worry too much if you miss a day, as long as you keep moving the mixture around regularly. If you notice the apples are rising out of the water, use a fermentation stone or something else to weigh them down slightly and make sure they're submerged."
        },
        {
          "headline":"Wait for the apples to sink to the bottom of the jar.",
          "description":"As you check on the apples every day or so, keep an eye out for bubbles indicating the fermentation process. After a week or two, the apples will fully sink to the bottom of the jar. This indicates that the apples have fermented and are no longer needed to make the vinegar. If you notice any scum forming on top of the jar, skim it off and discard it."
        },
        {
          "headline":"Strain the apples from the cider and pour the cider back into the jar.",
          "description":"Use a plastic sieve or another cheesecloth to strain the apples out of the cider. As with every other step, avoid using metal as this can ruin the fermentation process. Pour the cider back into the jar, cover with a cheesecloth secured with a rubber band, and put it back in the same warm, dark place. Once you have strained the apples out of the cider, you should discard them. They are not suitable to eat once they’ve been fermented."
        },
        {
          "headline":"Leave the cider to ferment for 3 to 6 weeks, stirring every few days.",
          "description":"This is where the apple cider will begin to turn into apple cider vinegar. Stir the jar every 3 to 4 days, just to move the vinegar around a little as it ferments. Over this time, the sweet cider scent should start developing a slightly more tangy aroma. This is a sign that the fermentation is working, and the cider is becoming vinegar. The longer you give the vinegar to ferment, the stronger the taste and tang will be. After around 3 weeks of fermentation, start tasting the vinegar every few days until you reach the taste and acidity you want. The length of the fermentation process will vary based on the climate you live in. During summer, the cider will take less time to ferment. In winter, it will likely take even longer."
        },
        {
          "headline":"Transfer the fermented vinegar to a lidded glass jar and store.",
          "description":"Use a clean, sterilized glass jar with a tight lid in order to halt the fermentation process and keep the vinegar fresh. Store the vinegar in your refrigerator and it should never go bad. Keeping the vinegar in the fridge should stop the fermentation process, but if left long enough it may continue. If the vinegar gets too strong, add a little bit of water to dilute it back down to the acidity you want. While you can safely store the apple cider vinegar at room temperature, it will continue to ferment if you do so. If a gelatinous blob forms on the surface of your vinegar, this is cause for celebration rather than worry. This is known as the vinegar “mother” and can be used to jumpstart future batches of apple cider vinegar. Add the mother at the same time as the apples to speed up the fermentation process."
        }
      ]
    }
  ],
  "text":" Making a Cider Base Choose quality apples. Even though they're left to ferment for a long time, the apples you choose can significantly shape the flavor of your finished vinegar. Choose the best quality apples available to you in order to get the best apple cider vinegar at the end. For a more complex and deep vinegar at the end, try using a combination of different apples. Use two sweet apples, such as Golden Delicious or Gala, with one sharp tasting apple, such as McIntosh or Liberty, for a slightly sharper vinegar at the end. Instead of using whole apples, save scraps from apples used in other dishes to make your apple cider vinegar. One whole apple is roughly equivalent to the scraps of two apples. Keep the peel, core and other scraps in your freezer until you’re ready to use them to make vinegar. Wash your apples in cold water. It's always a good idea to wash your fruit and vegetables before eating them, and the same is true when cooking or fermenting them. Give your apples a thorough rinse and scrub with cold water to clean away anything you don't want in your vinegar. You can use any number of apples you want to make apple cider vinegar. The more you use, the more vinegar you’ll get! If you’re just starting out making your own apple cider vinegar, try using 3 apples for your first batch. This will give you a good amount of vinegar but won’t put too much at risk if something goes wrong. If you're using apple scraps, make sure to wash the whole apples before separating the scraps from the rest of the apples. Cut the apples into small cubes. The more surface area of the apple you expose, the more quickly the vinegar will ferment. Use a clean knife to cut your apples into 1 inch (2.5 cm) cubes, keeping the peel and the core in as well. If you’re using scraps from other apples, there’s no need to cut them up further. Transfer the apples to a glass jar. As the apples will be fermenting for up to 3 months, keep them in a sterilized, wide mouth, glass jar. The apples shouldn’t fill the jar more than ¾ of the way, so a quart jar or something bigger should work perfectly. Never use stainless steel to ferment your vinegar. As the apples ferment, the acidity of the vinegar can damage the steel, or impart a metallic taste into your vinegar that might change its flavor.. Cover the apples with water. Make sure the apples are completely covered with water, as any exposed apple will begin to rot rather than ferment into vinegar. For the best results, use filtered or mineral water that will be free from any impurities that could ruin your vinegar. For a quart jar with three apples, you’ll need around 800 millilitres (27  fl oz) of water. Use more or less as is needed. It’s always better to add too much water than not enough. If you add too much, your apple cider vinegar might be a little weaker or take longer to ferment. If you don’t add enough water, some apple will be exposed and might begin to rot and ruin your vinegar entirely. Add 1 teaspoon (4 grams) of raw sugar for each apple. Stir the mixture thoroughly to make sure everything combines fully. The sugar will ferment and turn into alcohol, making the apple cider that will eventually become apple cider vinegar. Raw sugar works best for this, but you can use honey or any other sugar if you’d prefer. Cover the jar with a cheesecloth. As the apples ferment into cider and eventually vinegar, the mixture will still need to be able to breathe. Use a piece of cheesecloth held in place around the mouth of the jar with a rubber band. This will keep everything out of the jar, but still let the gases release during the fermentation process. Fermenting Your Vinegar Keep the jar in a warm, dark place. Find somewhere that you can leave the vinegar to ferment for a long time, where it won’t be disturbed unintentionally. Keep it at the bottom or on top of your pantry, in a corner of your kitchen, or anywhere else where it won't be exposed to direct sunlight. Each home will have a different, perfect place. The jar should be kept at room temperature as it ferments, which is around 70 °F (21 °C). Stir the mixture once or twice a day. Stirring the mixture will help the fermentation process, as well as shifting apples around in the jar. Give the cider a stir with a wooden a spoon once or twice a day for the first week or two. Don’t worry too much if you miss a day, as long as you keep moving the mixture around regularly. If you notice the apples are rising out of the water, use a fermentation stone or something else to weigh them down slightly and make sure they're submerged. Wait for the apples to sink to the bottom of the jar. As you check on the apples every day or so, keep an eye out for bubbles indicating the fermentation process. After a week or two, the apples will fully sink to the bottom of the jar. This indicates that the apples have fermented and are no longer needed to make the vinegar. If you notice any scum forming on top of the jar, skim it off and discard it. Strain the apples from the cider and pour the cider back into the jar. Use a plastic sieve or another cheesecloth to strain the apples out of the cider. As with every other step, avoid using metal as this can ruin the fermentation process. Pour the cider back into the jar, cover with a cheesecloth secured with a rubber band, and put it back in the same warm, dark place. Once you have strained the apples out of the cider, you should discard them. They are not suitable to eat once they’ve been fermented. Leave the cider to ferment for 3 to 6 weeks, stirring every few days. This is where the apple cider will begin to turn into apple cider vinegar. Stir the jar every 3 to 4 days, just to move the vinegar around a little as it ferments. Over this time, the sweet cider scent should start developing a slightly more tangy aroma. This is a sign that the fermentation is working, and the cider is becoming vinegar. The longer you give the vinegar to ferment, the stronger the taste and tang will be. After around 3 weeks of fermentation, start tasting the vinegar every few days until you reach the taste and acidity you want. The length of the fermentation process will vary based on the climate you live in. During summer, the cider will take less time to ferment. In winter, it will likely take even longer. Transfer the fermented vinegar to a lidded glass jar and store. Use a clean, sterilized glass jar with a tight lid in order to halt the fermentation process and keep the vinegar fresh. Store the vinegar in your refrigerator and it should never go bad. Keeping the vinegar in the fridge should stop the fermentation process, but if left long enough it may continue. If the vinegar gets too strong, add a little bit of water to dilute it back down to the acidity you want. While you can safely store the apple cider vinegar at room temperature, it will continue to ferment if you do so. If a gelatinous blob forms on the surface of your vinegar, this is cause for celebration rather than worry. This is known as the vinegar “mother” and can be used to jumpstart future batches of apple cider vinegar. Add the mother at the same time as the apples to speed up the fermentation process.",
  "sentences":[
    " Making a Cider Base Choose quality apples.",
    "Even though they're left to ferment for a long time, the apples you choose can significantly shape the flavor of your finished vinegar.",
    "Choose the best quality apples available to you in order to get the best apple cider vinegar at the end.",
    "For a more complex and deep vinegar at the end, try using a combination of different apples.",
    "Use two sweet apples, such as Golden Delicious or Gala, with one sharp tasting apple, such as McIntosh or Liberty, for a slightly sharper vinegar at the end.",
    "Instead of using whole apples, save scraps from apples used in other dishes to make your apple cider vinegar.",
    "One whole apple is roughly equivalent to the scraps of two apples.",
    "Keep the peel, core and other scraps in your freezer until you’re ready to use them to make vinegar.",
    "Wash your apples in cold water.",
    "It's always a good idea to wash your fruit and vegetables before eating them, and the same is true when cooking or fermenting them.",
    "Give your apples a thorough rinse and scrub with cold water to clean away anything you don't want in your vinegar.",
    "You can use any number of apples you want to make apple cider vinegar.",
    "The more you use, the more vinegar you’ll get!",
    "If you’re just starting out making your own apple cider vinegar, try using 3 apples for your first batch.",
    "This will give you a good amount of vinegar but won’t put too much at risk if something goes wrong.",
    "If you're using apple scraps, make sure to wash the whole apples before separating the scraps from the rest of the apples.",
    "Cut the apples into small cubes.",
    "The more surface area of the apple you expose, the more quickly the vinegar will ferment.",
    "Use a clean knife to cut your apples into 1 inch (2.5 cm) cubes, keeping the peel and the core in as well.",
    "If you’re using scraps from other apples, there’s no need to cut them up further.",
    "Transfer the apples to a glass jar.",
    "As the apples will be fermenting for up to 3 months, keep them in a sterilized, wide mouth, glass jar.",
    "The apples shouldn’t fill the jar more than ¾ of the way, so a quart jar or something bigger should work perfectly.",
    "Never use stainless steel to ferment your vinegar.",
    "As the apples ferment, the acidity of the vinegar can damage the steel, or impart a metallic taste into your vinegar that might change its flavor.. Cover the apples with water.",
    "Make sure the apples are completely covered with water, as any exposed apple will begin to rot rather than ferment into vinegar.",
    "For the best results, use filtered or mineral water that will be free from any impurities that could ruin your vinegar.",
    "For a quart jar with three apples, you’ll need around 800 millilitres (27  fl oz) of water.",
    "Use more or less as is needed.",
    "It’s always better to add too much water than not enough.",
    "If you add too much, your apple cider vinegar might be a little weaker or take longer to ferment.",
    "If you don’t add enough water, some apple will be exposed and might begin to rot and ruin your vinegar entirely.",
    "Add 1 teaspoon (4 grams) of raw sugar for each apple.",
    "Stir the mixture thoroughly to make sure everything combines fully.",
    "The sugar will ferment and turn into alcohol, making the apple cider that will eventually become apple cider vinegar.",
    "Raw sugar works best for this, but you can use honey or any other sugar if you’d prefer.",
    "Cover the jar with a cheesecloth.",
    "As the apples ferment into cider and eventually vinegar, the mixture will still need to be able to breathe.",
    "Use a piece of cheesecloth held in place around the mouth of the jar with a rubber band.",
    "This will keep everything out of the jar, but still let the gases release during the fermentation process.",
    "Fermenting Your Vinegar Keep the jar in a warm, dark place.",
    "Find somewhere that you can leave the vinegar to ferment for a long time, where it won’t be disturbed unintentionally.",
    "Keep it at the bottom or on top of your pantry, in a corner of your kitchen, or anywhere else where it won't be exposed to direct sunlight.",
    "Each home will have a different, perfect place.",
    "The jar should be kept at room temperature as it ferments, which is around 70 °F (21 °C).",
    "Stir the mixture once or twice a day.",
    "Stirring the mixture will help the fermentation process, as well as shifting apples around in the jar.",
    "Give the cider a stir with a wooden a spoon once or twice a day for the first week or two.",
    "Don’t worry too much if you miss a day, as long as you keep moving the mixture around regularly.",
    "If you notice the apples are rising out of the water, use a fermentation stone or something else to weigh them down slightly and make sure they're submerged.",
    "Wait for the apples to sink to the bottom of the jar.",
    "As you check on the apples every day or so, keep an eye out for bubbles indicating the fermentation process.",
    "After a week or two, the apples will fully sink to the bottom of the jar.",
    "This indicates that the apples have fermented and are no longer needed to make the vinegar.",
    "If you notice any scum forming on top of the jar, skim it off and discard it.",
    "Strain the apples from the cider and pour the cider back into the jar.",
    "Use a plastic sieve or another cheesecloth to strain the apples out of the cider.",
    "As with every other step, avoid using metal as this can ruin the fermentation process.",
    "Pour the cider back into the jar, cover with a cheesecloth secured with a rubber band, and put it back in the same warm, dark place.",
    "Once you have strained the apples out of the cider, you should discard them.",
    "They are not suitable to eat once they’ve been fermented.",
    "Leave the cider to ferment for 3 to 6 weeks, stirring every few days.",
    "This is where the apple cider will begin to turn into apple cider vinegar.",
    "Stir the jar every 3 to 4 days, just to move the vinegar around a little as it ferments.",
    "Over this time, the sweet cider scent should start developing a slightly more tangy aroma.",
    "This is a sign that the fermentation is working, and the cider is becoming vinegar.",
    "The longer you give the vinegar to ferment, the stronger the taste and tang will be.",
    "After around 3 weeks of fermentation, start tasting the vinegar every few days until you reach the taste and acidity you want.",
    "The length of the fermentation process will vary based on the climate you live in.",
    "During summer, the cider will take less time to ferment.",
    "In winter, it will likely take even longer.",
    "Transfer the fermented vinegar to a lidded glass jar and store.",
    "Use a clean, sterilized glass jar with a tight lid in order to halt the fermentation process and keep the vinegar fresh.",
    "Store the vinegar in your refrigerator and it should never go bad.",
    "Keeping the vinegar in the fridge should stop the fermentation process, but if left long enough it may continue.",
    "If the vinegar gets too strong, add a little bit of water to dilute it back down to the acidity you want.",
    "While you can safely store the apple cider vinegar at room temperature, it will continue to ferment if you do so.",
    "If a gelatinous blob forms on the surface of your vinegar, this is cause for celebration rather than worry.",
    "This is known as the vinegar “mother” and can be used to jumpstart future batches of apple cider vinegar.",
    "Add the mother at the same time as the apples to speed up the fermentation process."
  ],
  "tyn_section":[
    "Apples",
    "Knife",
    "Cutting board",
    "Glass jar",
    "Water",
    "Sugar",
    "Cheesecloth",
    "Rubber band",
    "Wooden or plastic spoon",
    "Lidded glass jars for storage"
  ],
  "tyn_model":[
    "vinegar",
    "apples",
    "cider",
    "apple cider vinegar",
    "water",
    "jar",
    "cheesecloth",
    "glass jar",
    "sugar",
    "apple cider",
    "knife",
    "quart jar",
    "stainless steel",
    "filtered or mineral water",
    "raw sugar",
    "honey",
    "wooden a spoon",
    "fermentation stone",
    "sieve",
    "sweet cider",
    "refrigerator",
    "fridge",
    "“mother",
    "” and"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.25,
    "f1":0.3529411765,
    "avg_pos":0.0416666667
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.3333333333,
    "f1":0.4285714286
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7,
    "p":0.4166666667,
    "f1":0.5223880597
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.25,
    "f1":0.3529411765
  }
}