{
  "title":"How to Clean Decking",
  "url":"https://www.wikihow.com/Clean-Decking",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Decks"
  ],
  "methods":[
    {
      "name":"Preparing the Deck",
      "steps":[
        {
          "headline":"Make any deck repairs beforehand.",
          "description":"A clean, polished deck will look finished if all broken parts are replaced beforehand. Check your deck for insecure bannisters or split boards. Be on especial lookout for safety threats, like rusty screws or bolts, uneven board edges, splintering, and protruding screws, nails, or bolts. If you can, check the underside of your deck, too, to look for problems in your concrete pier blocks, joists, hangers, and deck boards."
        },
        {
          "headline":"Remove all furniture and debris.",
          "description":"Cleaning solutions or pressure washers can damage your deck furniture, and excessive trash littering the deck will make washing ineffective. Bring any patio chairs, grills, flower pots, and any other items indoors or on the grass while you clean. Carry a trash bag with you, and  pick up any garbage or yard waste as you go. Check in-between plank slats for hard-to-reach debris."
        },
        {
          "headline":"Sweep your deck with a stiff-bristled broom.",
          "description":"Start sweeping from one end of the deck and work your way to the other side. Break up the deck into small sections, and periodically sweep your dirt piles into a dustpan. Continue sweeping until you've cleared the entire deck of dirt, dust, and leaves. You can also use a wet/dry shop vacuum with a bristle brush or small place attachment, if you have one available. Wash off your broom with dish soap and water beforehand to avoid adding excess dirt to your deck."
        },
        {
          "headline":"Hose down plants near your deck to protect them from chemicals.",
          "description":"Soap and cleaning solutions can damage your plants, but water can help soap slide off. Hose down your yard plants, especially fruit or vegetable plants. For added protection, drape plastic wrap or drop cloths over delicate plants. Be sure you have adequate drainage away from your deck before you start to hose. Otherwise you could get water pooling under your deck, which may cause additional problems. After you've finished cleaning the deck, remove the plastic wrap immediately."
        },
        {
          "headline":"Pretreat mold before you wash the deck.",
          "description":"Washing your deck can make moldy areas worse. Scrub moldy deck areas with specialized deck cleaner or bleach to remove the mold and kill spores. Spray your deck with water to remove residual bleach. Locate the source of the mold and pay particular attention to that area during treatment to more permanently remove mold."
        }
      ]
    },
    {
      "name":"Scrubbing Your Deck",
      "steps":[
        {
          "headline":"Mix oxygen bleach with warm water in a bucket.",
          "description":"Diluted oxygen bleach makes for an affordable and environmentally-friendly deck cleaner. Add two cups of oxygen bleach powder (16 oz) with two gallons of water (16 pints) and stir gently until the powdered bleach dissolves. Never under any circumstances mix bleach with ammonia, as this results in toxic fumes."
        },
        {
          "headline":"Use a long handled scrub brush to apply the oxygen bleach solution.",
          "description":"Apply the oxygen bleach cleaner in circular motions with a stiff-bristled brush. Cover the deck thoroughly with the mixture and let it sit for about fifteen minutes. Remember to wear proper protective gear including rubber gloves, eye protection, and a mask over your nose and mouth while you work with this solution."
        },
        {
          "headline":"Rinse your deck of the oxygen bleach solution.",
          "description":"Hose down your deck with the water turned on full until you've completely removed the mixture. Although you can use the pressure washer, you should not do so until you have removed grease marks as well."
        },
        {
          "headline":"Remove grease marks with an enzyme cleaner.",
          "description":"Grease marks left behind by patio grills can be removed with most outdoor degreasers or enzyme cleaners. Spray the cleaner within a foot or less of the targeted area and rub your scrub brush over the stain in clockwise motions. Enzyme cleaners must be applied directly to the stain because the cleaning agents activate immediately."
        },
        {
          "headline":"Rinse your deck down a final time.",
          "description":"After you've finished scrubbing your deck and removing stains, rinse your deck using either your hose or a pressure washer. Thoroughly rinse your deck to remove any bleach or degreaser residue. Pressure washers give your deck an extra shine but can be pricey. If cost is an issue, hoses can work just as well. You can use a metal putty knife to scrape and clean the spaces in between boards"
        }
      ]
    },
    {
      "name":"Using a Pressure Washer",
      "steps":[
        {
          "headline":"Purchase or rent a deck scrubber attachment.",
          "description":"You can purchase or rent these attachments from your local tool or home improvement store. Read the directions fully before starting. Then, use the widest nozzle possible when cleaning your deck with a pressure washer to evenly disperse the water load. Deck scrubber attachments are specifically made for wider areas and generally work best. Narrow nozzles can cut into the flooring."
        },
        {
          "headline":"Spray in an inconspicuous area first.",
          "description":"Washing on a high setting or aiming the nozzle too close can damage the floor. Begin using the power washer in an area most people don't see, like where you normally place furniture. You can switch to a wider nozzle or lower setting as needed."
        },
        {
          "headline":"Raise the nozzle about two feet above the deck.",
          "description":"Once you've turned on the nozzle, begin at two feet and move closer as needed. Don't get any closer than about 6–12 inches (15–30 cm), as any nearer can damage the flooring. Hold the nozzle at a slight angle to further lessen the pressure."
        },
        {
          "headline":"Aim the pressure washer away from you or other people at all times.",
          "description":"Since the water coming out of the washer is under extremely high pressure, getting hit with a pressure washer can cause bruising or even serious injuries. If you or another person is hit in the eyes with a pressure washer sprayer, seek medical attention immediately."
        },
        {
          "headline":"Move the nozzle in wide, sweeping motions.",
          "description":"Start at one end of the deck and make your way to the other end while sweeping your nozzle back and forth. Move your nozzle with the grain of the wood. Keep the pressure washer moving continually as you walk to keep from overloading any area with pressure."
        },
        {
          "headline":"When you've sprayed the entire deck, turn the machine off.",
          "description":"Consult the pressure washer's manual (or inspect the machine) before beginning to find the right trigger. Pull the trigger to release pressure and drain any excess water."
        }
      ]
    }
  ],
  "text":" Preparing the Deck Make any deck repairs beforehand. A clean, polished deck will look finished if all broken parts are replaced beforehand. Check your deck for insecure bannisters or split boards. Be on especial lookout for safety threats, like rusty screws or bolts, uneven board edges, splintering, and protruding screws, nails, or bolts. If you can, check the underside of your deck, too, to look for problems in your concrete pier blocks, joists, hangers, and deck boards. Remove all furniture and debris. Cleaning solutions or pressure washers can damage your deck furniture, and excessive trash littering the deck will make washing ineffective. Bring any patio chairs, grills, flower pots, and any other items indoors or on the grass while you clean. Carry a trash bag with you, and  pick up any garbage or yard waste as you go. Check in-between plank slats for hard-to-reach debris. Sweep your deck with a stiff-bristled broom. Start sweeping from one end of the deck and work your way to the other side. Break up the deck into small sections, and periodically sweep your dirt piles into a dustpan. Continue sweeping until you've cleared the entire deck of dirt, dust, and leaves. You can also use a wet/dry shop vacuum with a bristle brush or small place attachment, if you have one available. Wash off your broom with dish soap and water beforehand to avoid adding excess dirt to your deck. Hose down plants near your deck to protect them from chemicals. Soap and cleaning solutions can damage your plants, but water can help soap slide off. Hose down your yard plants, especially fruit or vegetable plants. For added protection, drape plastic wrap or drop cloths over delicate plants. Be sure you have adequate drainage away from your deck before you start to hose. Otherwise you could get water pooling under your deck, which may cause additional problems. After you've finished cleaning the deck, remove the plastic wrap immediately. Pretreat mold before you wash the deck. Washing your deck can make moldy areas worse. Scrub moldy deck areas with specialized deck cleaner or bleach to remove the mold and kill spores. Spray your deck with water to remove residual bleach. Locate the source of the mold and pay particular attention to that area during treatment to more permanently remove mold. Scrubbing Your Deck Mix oxygen bleach with warm water in a bucket. Diluted oxygen bleach makes for an affordable and environmentally-friendly deck cleaner. Add two cups of oxygen bleach powder (16 oz) with two gallons of water (16 pints) and stir gently until the powdered bleach dissolves. Never under any circumstances mix bleach with ammonia, as this results in toxic fumes. Use a long handled scrub brush to apply the oxygen bleach solution. Apply the oxygen bleach cleaner in circular motions with a stiff-bristled brush. Cover the deck thoroughly with the mixture and let it sit for about fifteen minutes. Remember to wear proper protective gear including rubber gloves, eye protection, and a mask over your nose and mouth while you work with this solution. Rinse your deck of the oxygen bleach solution. Hose down your deck with the water turned on full until you've completely removed the mixture. Although you can use the pressure washer, you should not do so until you have removed grease marks as well. Remove grease marks with an enzyme cleaner. Grease marks left behind by patio grills can be removed with most outdoor degreasers or enzyme cleaners. Spray the cleaner within a foot or less of the targeted area and rub your scrub brush over the stain in clockwise motions. Enzyme cleaners must be applied directly to the stain because the cleaning agents activate immediately. Rinse your deck down a final time. After you've finished scrubbing your deck and removing stains, rinse your deck using either your hose or a pressure washer. Thoroughly rinse your deck to remove any bleach or degreaser residue. Pressure washers give your deck an extra shine but can be pricey. If cost is an issue, hoses can work just as well. You can use a metal putty knife to scrape and clean the spaces in between boards Using a Pressure Washer Purchase or rent a deck scrubber attachment. You can purchase or rent these attachments from your local tool or home improvement store. Read the directions fully before starting. Then, use the widest nozzle possible when cleaning your deck with a pressure washer to evenly disperse the water load. Deck scrubber attachments are specifically made for wider areas and generally work best. Narrow nozzles can cut into the flooring. Spray in an inconspicuous area first. Washing on a high setting or aiming the nozzle too close can damage the floor. Begin using the power washer in an area most people don't see, like where you normally place furniture. You can switch to a wider nozzle or lower setting as needed. Raise the nozzle about two feet above the deck. Once you've turned on the nozzle, begin at two feet and move closer as needed. Don't get any closer than about 6–12 inches (15–30 cm), as any nearer can damage the flooring. Hold the nozzle at a slight angle to further lessen the pressure. Aim the pressure washer away from you or other people at all times. Since the water coming out of the washer is under extremely high pressure, getting hit with a pressure washer can cause bruising or even serious injuries. If you or another person is hit in the eyes with a pressure washer sprayer, seek medical attention immediately. Move the nozzle in wide, sweeping motions. Start at one end of the deck and make your way to the other end while sweeping your nozzle back and forth. Move your nozzle with the grain of the wood. Keep the pressure washer moving continually as you walk to keep from overloading any area with pressure. When you've sprayed the entire deck, turn the machine off. Consult the pressure washer's manual (or inspect the machine) before beginning to find the right trigger. Pull the trigger to release pressure and drain any excess water.",
  "sentences":[
    " Preparing the Deck Make any deck repairs beforehand.",
    "A clean, polished deck will look finished if all broken parts are replaced beforehand.",
    "Check your deck for insecure bannisters or split boards.",
    "Be on especial lookout for safety threats, like rusty screws or bolts, uneven board edges, splintering, and protruding screws, nails, or bolts.",
    "If you can, check the underside of your deck, too, to look for problems in your concrete pier blocks, joists, hangers, and deck boards.",
    "Remove all furniture and debris.",
    "Cleaning solutions or pressure washers can damage your deck furniture, and excessive trash littering the deck will make washing ineffective.",
    "Bring any patio chairs, grills, flower pots, and any other items indoors or on the grass while you clean.",
    "Carry a trash bag with you, and  pick up any garbage or yard waste as you go.",
    "Check in-between plank slats for hard-to-reach debris.",
    "Sweep your deck with a stiff-bristled broom.",
    "Start sweeping from one end of the deck and work your way to the other side.",
    "Break up the deck into small sections, and periodically sweep your dirt piles into a dustpan.",
    "Continue sweeping until you've cleared the entire deck of dirt, dust, and leaves.",
    "You can also use a wet/dry shop vacuum with a bristle brush or small place attachment, if you have one available.",
    "Wash off your broom with dish soap and water beforehand to avoid adding excess dirt to your deck.",
    "Hose down plants near your deck to protect them from chemicals.",
    "Soap and cleaning solutions can damage your plants, but water can help soap slide off.",
    "Hose down your yard plants, especially fruit or vegetable plants.",
    "For added protection, drape plastic wrap or drop cloths over delicate plants.",
    "Be sure you have adequate drainage away from your deck before you start to hose.",
    "Otherwise you could get water pooling under your deck, which may cause additional problems.",
    "After you've finished cleaning the deck, remove the plastic wrap immediately.",
    "Pretreat mold before you wash the deck.",
    "Washing your deck can make moldy areas worse.",
    "Scrub moldy deck areas with specialized deck cleaner or bleach to remove the mold and kill spores.",
    "Spray your deck with water to remove residual bleach.",
    "Locate the source of the mold and pay particular attention to that area during treatment to more permanently remove mold.",
    "Scrubbing Your Deck Mix oxygen bleach with warm water in a bucket.",
    "Diluted oxygen bleach makes for an affordable and environmentally-friendly deck cleaner.",
    "Add two cups of oxygen bleach powder (16 oz) with two gallons of water (16 pints) and stir gently until the powdered bleach dissolves.",
    "Never under any circumstances mix bleach with ammonia, as this results in toxic fumes.",
    "Use a long handled scrub brush to apply the oxygen bleach solution.",
    "Apply the oxygen bleach cleaner in circular motions with a stiff-bristled brush.",
    "Cover the deck thoroughly with the mixture and let it sit for about fifteen minutes.",
    "Remember to wear proper protective gear including rubber gloves, eye protection, and a mask over your nose and mouth while you work with this solution.",
    "Rinse your deck of the oxygen bleach solution.",
    "Hose down your deck with the water turned on full until you've completely removed the mixture.",
    "Although you can use the pressure washer, you should not do so until you have removed grease marks as well.",
    "Remove grease marks with an enzyme cleaner.",
    "Grease marks left behind by patio grills can be removed with most outdoor degreasers or enzyme cleaners.",
    "Spray the cleaner within a foot or less of the targeted area and rub your scrub brush over the stain in clockwise motions.",
    "Enzyme cleaners must be applied directly to the stain because the cleaning agents activate immediately.",
    "Rinse your deck down a final time.",
    "After you've finished scrubbing your deck and removing stains, rinse your deck using either your hose or a pressure washer.",
    "Thoroughly rinse your deck to remove any bleach or degreaser residue.",
    "Pressure washers give your deck an extra shine but can be pricey.",
    "If cost is an issue, hoses can work just as well.",
    "You can use a metal putty knife to scrape and clean the spaces in between boards Using a Pressure Washer Purchase or rent a deck scrubber attachment.",
    "You can purchase or rent these attachments from your local tool or home improvement store.",
    "Read the directions fully before starting.",
    "Then, use the widest nozzle possible when cleaning your deck with a pressure washer to evenly disperse the water load.",
    "Deck scrubber attachments are specifically made for wider areas and generally work best.",
    "Narrow nozzles can cut into the flooring.",
    "Spray in an inconspicuous area first.",
    "Washing on a high setting or aiming the nozzle too close can damage the floor.",
    "Begin using the power washer in an area most people don't see, like where you normally place furniture.",
    "You can switch to a wider nozzle or lower setting as needed.",
    "Raise the nozzle about two feet above the deck.",
    "Once you've turned on the nozzle, begin at two feet and move closer as needed.",
    "Don't get any closer than about 6–12 inches (15–30 cm), as any nearer can damage the flooring.",
    "Hold the nozzle at a slight angle to further lessen the pressure.",
    "Aim the pressure washer away from you or other people at all times.",
    "Since the water coming out of the washer is under extremely high pressure, getting hit with a pressure washer can cause bruising or even serious injuries.",
    "If you or another person is hit in the eyes with a pressure washer sprayer, seek medical attention immediately.",
    "Move the nozzle in wide, sweeping motions.",
    "Start at one end of the deck and make your way to the other end while sweeping your nozzle back and forth.",
    "Move your nozzle with the grain of the wood.",
    "Keep the pressure washer moving continually as you walk to keep from overloading any area with pressure.",
    "When you've sprayed the entire deck, turn the machine off.",
    "Consult the pressure washer's manual (or inspect the machine) before beginning to find the right trigger.",
    "Pull the trigger to release pressure and drain any excess water."
  ],
  "tyn_section":[
    "Bucket",
    "Oxygen bleach",
    "Trash bag",
    "Broom",
    "Scrub brush",
    "Water",
    "Pressure washer",
    "Deck scrubber attachment",
    "Rags",
    "Enzyme cleaners",
    "Sturdy shoes",
    "Eye protection",
    "Rubber gloves",
    "Face mask"
  ],
  "tyn_model":[
    "water",
    "pressure washer",
    "oxygen bleach",
    "bleach",
    "pressure washers",
    "broom",
    "plastic wrap",
    "hose",
    "deck cleaner",
    "scrub brush",
    "enzyme cleaners",
    "deck scrubber",
    "concrete pier",
    "deck boards",
    "cleaning solutions",
    "patio chairs",
    "grills",
    "trash bag",
    "vacuum",
    "bristle brush",
    "dish soap",
    "soap",
    "drop cloths",
    "rubber gloves",
    "enzyme cleaner",
    "hoses",
    "power washer",
    "washer",
    "sprayer"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.275862069,
    "f1":0.3720930233,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6428571429,
    "p":0.3793103448,
    "f1":0.4771084337
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6428571429,
    "p":0.5172413793,
    "f1":0.5732484076
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6428571429,
    "p":0.3103448276,
    "f1":0.4186046512
  }
}