{
  "title":"How to Play Pai Gow",
  "url":"https://www.wikihow.com/Play-Pai-Gow",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "parts":[
    {
      "name":"Setting up the Game",
      "steps":[
        {
          "headline":"Play with a set of 32 pai gow tiles.",
          "description":"You’ll need specially-designed tiles to play pai gow with. While pai gow tiles look similar to dominoes, they’re not the same, and a set of regular dominoes won’t work for the game. Fortunately, you can easily find a set of pai gow tiles online or possibly at a local game shop. If you’d rather learn the game without investing in your own set of tiles, download a pai gow app or play online instead. You can also check if your local casino has pai gow tables you can play at."
        },
        {
          "headline":"Find 2-8 people to play with.",
          "description":"You need at least 2 players (including yourself) to play pai gow, and you can’t play with more than 8 people. It may be easier to play with a small group when you're first starting out."
        },
        {
          "headline":"Pass out poker chips to each player if you won’t be betting real money.",
          "description":"Pai gow is a betting game, so you’ll need something to bet with—even if it’s just chips instead of actual money—so you can place bets at the beginning of your turn. If you’re playing with poker chips, give everyone the same number of chips to start so you can easily determine who won the most at the end of the game! The number of chips you should give each player depends on how long you want to play for. Ten chips might only last someone a few rounds, whereas 50 chips could be a good choice if you're up for a long game."
        },
        {
          "headline":"Choose 1 player to be the dealer.",
          "description":"Like in Blackjack, you’re always playing against the dealer in pai gow. You can choose the dealer randomly, or a player can volunteer. You can also alternate being the dealer. For example, you could be the dealer in the first round and then pass the deal to the player to your left for the next round."
        }
      ]
    },
    {
      "name":"Learning How the Tiles Work",
      "steps":[
        {
          "headline":"Notice that every pai gow tile has between 2 and 12 spots on it.",
          "description":"The number of spots on a pai gow tile is important because it determines that tile's name and rank. Only one side of each tile will have spots on it so that other players can’t tell what tiles you have. For example, a tile with 3 spots on it will be played differently than a tile with 10 spots on it."
        },
        {
          "headline":"Pay attention to the patterns of the spots on the tiles.",
          "description":"The spots on pai gow tiles are arranged in different patterns, and these patterns can make a difference in how the tiles are played. Try not to confuse the tiles with each other by paying close attention to the different spot arrangements. For example, if you come across 2 tiles that each have 4 spots on them, but the spots are arranged in a different pattern on each tile, those tiles would not be a pair and they could end up having different values."
        },
        {
          "headline":"Don’t worry about the color or orientation of the tiles.",
          "description":"You’ll notice that some tiles have both red spots and white spots. The difference in color between the spots is just to make it easier for you to tell which tiles you’ve been dealt, and it in no way affects how the tiles are used. Also, it doesn’t make a difference which way you orient your tiles on the table—you can position them however you’d like. For example, if a tile has 1 spot on top and 2 spots on bottom, the value of the tile wouldn’t change if you rotated it so it had 2 spots on top and 1 on bottom."
        },
        {
          "headline":"Know that every tile is part of a pair.",
          "description":"Since there are 32 tiles in pai gow, there are 16 pairs of tiles in total. These pairs are the same in every set of pai gow tiles. All of the pairs except for 1 have the same number of spots on each tile in the pair. Also, not all of the pairs contain tiles that are identical in appearance. Some pairs have tiles with the same number of spots, but the spots are arranged in a different pattern. Eleven of the 16 pairs of tiles are identical in appearance. Five of the 16 pairs of tiles are not identical in appearance. One of the 16 pairs does not have the same number of spots on each tile."
        },
        {
          "headline":"Learn the names of all the tiles.",
          "description":"Every tile in pai gow has a name, and it shares that name with the other tile in its pair. For example, the 2 tiles that have 4 spots (2 spots on top and 2 on the bottom) make a pair and are each called “Bon.” If you had both of these tiles, you would say that you have a “pair of Bon.” Eventually, you’ll want to memorize these names so you can easily refer to different tiles and pairs. The names of all the tiles and their corresponding pairs are:\n\nGee Joon: 1 on top and 2 on bottom/2 on top and 2 on bottom. Teen: Both tiles have 6 on top and 6 on bottom. Day: Both tiles have 1 on top and 1 on bottom. Yun: Both tiles have 4 on top and 4 on bottom. Gor: Both tiles have 1 on top and 3 on bottom. Mooy: Both tiles have 5 on top and 5 on bottom. Chong: Both tiles have 3 on top and 3 on bottom. Bon: Both tiles have 2 on top and 2 on bottom. Foo: Both tiles have 5 on top and 6 on bottom. Ping: Both tiles have 4 on top and 6 on bottom. Tit: Both tiles have 1 on top and 6 on bottom. Look: Both tiles have 1 on top and 5 on bottom. Chop Gow: 3 on top and 6 on bottom/4 on top and 5 on bottom. Chop Bot: 2 on top and 6 on bottom/3 on top and 5 on bottom. Chop Chit: 2 on top and 5 on bottom/3 on top and 4 on bottom. Chop Ng: 1 on top and 4 on bottom/2 on top and 3 on bottom."
        },
        {
          "headline":"Memorize the ranks of the different pairs of tiles.",
          "description":"Every pair of tiles has a rank in pai gow, and the lower the rank number, the more valuable the pair is. The pairs are ranked 1-16, with 1 being the most valuable and 16 being the least valuable. Since the pairs are ranked in order, you can easily remember their ranks by memorizing the names of the pairs in the correct order. The tiles are ranked and ordered as follows:\nGee Joon (1), Teen (2), Day (3), Yun (4), Gor (5), Mooy (6), Chong (7), Bon (8), Foo (9), Ping (10), Tit (11), Look (12), Chop Gow (13), Chop Bot (14), Chop Chit (15), Chop Ng (16). Using the red spots on the tile is a helpful way to memorize the names and ranks of the tiles. For example, a pair of Gee Joon consists of 1 red spot on one tile and 4 red spots on the other tile. If you remember that a pair of Gee Joon has that configuration of red spots, it will be easier to recognize it when you’re dealt it during the game."
        },
        {
          "headline":"Learn how the tiles are valued during the game.",
          "description":"In pai gow, the goal is to have the most valuable tiles. In order to play strategically, you’ll need to understand how the tiles are valued so you can make the best “hands” with your tiles. During the game, you’ll be making hands that consist of 2 tiles. These 2-tile hands are scored as follows:\nPairs: Pairs are valued based on their ranking. The lower the pair’s ranking number, the higher its value. For example, if you have a pair of Teen, it would be more valuable than a pair of Foo since a pair of Teen has a ranking of 2 and a pair of Foo has a ranking of 9. Non-pairs: If 2 tiles in a hand don’t make a pair, add up the number of spots on each tile to determine the hand’s value. For example, if you had one tile with 2 spots and another tile with 5 spots, the value of that hand would be 7. The higher the number, the more valuable the hand is. If a non-pair hand adds up to more than 9, the number in the tens place is dropped. For example, if the 2 tiles in one of your hands add up to 15, you would drop the 1 and the value of that hand would become 5. A pair is always more valuable than a non-pair, regardless of the pair's rank."
        }
      ]
    },
    {
      "name":"Playing the Game",
      "steps":[
        {
          "headline":"Place your bet before you receive your tiles.",
          "description":"Like in Blackjack, you’ll need to make a bet before you know how good your hand (or set of tiles) is. Keep in mind that once you receive your tiles, you won’t be able to change your bet. When you’re first starting out, you may want to bet low until you get the hang of how to play."
        },
        {
          "headline":"Have the dealer hand out 4 face-down tiles to every player.",
          "description":"The dealer should give themselves 4 tiles as well. You can look at your tiles at this point, but be careful you don’t show them to any of the other players."
        },
        {
          "headline":"Decide how you’ll divide your tiles for that round.",
          "description":"Once you’re dealt your tiles, you’ll need to split them up into 2 “hands.” Each hand will have 2 tiles in it. The goal is to create the most valuable hands possible with the tiles you’ve been dealt. Your most valuable hand will be known as your high hand, and your other hand will be called your low hand. If you have 2 tiles that make a pair, it’s a good idea to put them together to make a hand since pairs are the most valuable hands. If you don’t have any pairs, you want to divide up your tiles so that the tiles in each hand add up to the highest value possible."
        },
        {
          "headline":"Have each player flip over their tiles to reveal their 2 hands.",
          "description":"Everyone should turn up their tiles at the same time. Double check that everyone is finished dividing up their tiles before you flip your tiles over. Differentiate between your 2 hands by positioning one vertically and one horizontally."
        },
        {
          "headline":"Compare your high and low hands to the dealer’s hands.",
          "description":"In order to beat the dealer, you want your hands, or tiles, to be more valuable than their hands. First, compare your high hand to the dealer’s high hand. Then, compare your low hand to the dealer’s low hand. If both your high hand and low hand beats their high hand and low hand, you win the bet! If your high hand beats the dealer’s high hand but your low hand doesn’t, or vice versa, you don’t win the bet. You need to beat both of the dealer’s hands. Every player should compare their high and low hands to the dealer’s hands. Players shouldn’t compare their hands with anyone but the dealer. If the value of your hands is tied with the dealer’s hands, the dealer wins. For example, if the dealer has a pair of Gee Joon (their high hand) and a non-pair of Yun and Day (which adds up to 0 and is their low hand) and you have a pair of Teen (your high hand) and a pair of Ping (your low hand), you wouldn't beat the dealer because, even though your low hand beats their low hand, the dealer's high hand beats your high hand. But, if you were to have a pair of Mooy (your high hand) and a pair of Look (your low hand) and the dealer has a non-pair of Bon and Gor (which adds up to 8 and is their high hand) and a non-pair of Bon and Foo (which adds up to 5 and is there low hand), you would win because both your high hand and low hand beat the dealer's high and low hands."
        },
        {
          "headline":"Have each player collect, push, or pay.",
          "description":"At the end of the each round, you’ll need to determine whether you or the dealer owes money. Whether you collect, push, or pay will depend on if you won or lost the bet. Collect: If you won the bet by beating both of the dealer’s hands, collect your payment from the dealer. The dealer should give you twice as much as you bet at the beginning of the round. Push: If you beat one of the dealer’s hands but not the other, you push and don’t collect or pay any money. Instead, you can hold onto your bet for the next round. Pay: If both of the dealer’s hands were more valuable than your hands, or if both were tied, pay the dealer all of the money you bet at the beginning of the round."
        },
        {
          "headline":"Shuffle the tiles and start a new round.",
          "description":"Choose a new dealer if you’d like and then place your bet. Then, have the dealer pass out 4 new tiles to all of the players and start the round. There’s no limit to how many rounds of pai gow you can play, unless you’re playing with real money and you start to run low. Don’t worry if the first few rounds are a little confusing. Keep playing and eventually you’ll get the hang of it!"
        }
      ]
    }
  ],
  "text":" Setting up the Game Play with a set of 32 pai gow tiles. You’ll need specially-designed tiles to play pai gow with. While pai gow tiles look similar to dominoes, they’re not the same, and a set of regular dominoes won’t work for the game. Fortunately, you can easily find a set of pai gow tiles online or possibly at a local game shop. If you’d rather learn the game without investing in your own set of tiles, download a pai gow app or play online instead. You can also check if your local casino has pai gow tables you can play at. Find 2-8 people to play with. You need at least 2 players (including yourself) to play pai gow, and you can’t play with more than 8 people. It may be easier to play with a small group when you're first starting out. Pass out poker chips to each player if you won’t be betting real money. Pai gow is a betting game, so you’ll need something to bet with—even if it’s just chips instead of actual money—so you can place bets at the beginning of your turn. If you’re playing with poker chips, give everyone the same number of chips to start so you can easily determine who won the most at the end of the game! The number of chips you should give each player depends on how long you want to play for. Ten chips might only last someone a few rounds, whereas 50 chips could be a good choice if you're up for a long game. Choose 1 player to be the dealer. Like in Blackjack, you’re always playing against the dealer in pai gow. You can choose the dealer randomly, or a player can volunteer. You can also alternate being the dealer. For example, you could be the dealer in the first round and then pass the deal to the player to your left for the next round. Learning How the Tiles Work Notice that every pai gow tile has between 2 and 12 spots on it. The number of spots on a pai gow tile is important because it determines that tile's name and rank. Only one side of each tile will have spots on it so that other players can’t tell what tiles you have. For example, a tile with 3 spots on it will be played differently than a tile with 10 spots on it. Pay attention to the patterns of the spots on the tiles. The spots on pai gow tiles are arranged in different patterns, and these patterns can make a difference in how the tiles are played. Try not to confuse the tiles with each other by paying close attention to the different spot arrangements. For example, if you come across 2 tiles that each have 4 spots on them, but the spots are arranged in a different pattern on each tile, those tiles would not be a pair and they could end up having different values. Don’t worry about the color or orientation of the tiles. You’ll notice that some tiles have both red spots and white spots. The difference in color between the spots is just to make it easier for you to tell which tiles you’ve been dealt, and it in no way affects how the tiles are used. Also, it doesn’t make a difference which way you orient your tiles on the table—you can position them however you’d like. For example, if a tile has 1 spot on top and 2 spots on bottom, the value of the tile wouldn’t change if you rotated it so it had 2 spots on top and 1 on bottom. Know that every tile is part of a pair. Since there are 32 tiles in pai gow, there are 16 pairs of tiles in total. These pairs are the same in every set of pai gow tiles. All of the pairs except for 1 have the same number of spots on each tile in the pair. Also, not all of the pairs contain tiles that are identical in appearance. Some pairs have tiles with the same number of spots, but the spots are arranged in a different pattern. Eleven of the 16 pairs of tiles are identical in appearance. Five of the 16 pairs of tiles are not identical in appearance. One of the 16 pairs does not have the same number of spots on each tile. Learn the names of all the tiles. Every tile in pai gow has a name, and it shares that name with the other tile in its pair. For example, the 2 tiles that have 4 spots (2 spots on top and 2 on the bottom) make a pair and are each called “Bon.” If you had both of these tiles, you would say that you have a “pair of Bon.” Eventually, you’ll want to memorize these names so you can easily refer to different tiles and pairs. The names of all the tiles and their corresponding pairs are:\n\nGee Joon: 1 on top and 2 on bottom/2 on top and 2 on bottom. Teen: Both tiles have 6 on top and 6 on bottom. Day: Both tiles have 1 on top and 1 on bottom. Yun: Both tiles have 4 on top and 4 on bottom. Gor: Both tiles have 1 on top and 3 on bottom. Mooy: Both tiles have 5 on top and 5 on bottom. Chong: Both tiles have 3 on top and 3 on bottom. Bon: Both tiles have 2 on top and 2 on bottom. Foo: Both tiles have 5 on top and 6 on bottom. Ping: Both tiles have 4 on top and 6 on bottom. Tit: Both tiles have 1 on top and 6 on bottom. Look: Both tiles have 1 on top and 5 on bottom. Chop Gow: 3 on top and 6 on bottom/4 on top and 5 on bottom. Chop Bot: 2 on top and 6 on bottom/3 on top and 5 on bottom. Chop Chit: 2 on top and 5 on bottom/3 on top and 4 on bottom. Chop Ng: 1 on top and 4 on bottom/2 on top and 3 on bottom. Memorize the ranks of the different pairs of tiles. Every pair of tiles has a rank in pai gow, and the lower the rank number, the more valuable the pair is. The pairs are ranked 1-16, with 1 being the most valuable and 16 being the least valuable. Since the pairs are ranked in order, you can easily remember their ranks by memorizing the names of the pairs in the correct order. The tiles are ranked and ordered as follows:\nGee Joon (1), Teen (2), Day (3), Yun (4), Gor (5), Mooy (6), Chong (7), Bon (8), Foo (9), Ping (10), Tit (11), Look (12), Chop Gow (13), Chop Bot (14), Chop Chit (15), Chop Ng (16). Using the red spots on the tile is a helpful way to memorize the names and ranks of the tiles. For example, a pair of Gee Joon consists of 1 red spot on one tile and 4 red spots on the other tile. If you remember that a pair of Gee Joon has that configuration of red spots, it will be easier to recognize it when you’re dealt it during the game. Learn how the tiles are valued during the game. In pai gow, the goal is to have the most valuable tiles. In order to play strategically, you’ll need to understand how the tiles are valued so you can make the best “hands” with your tiles. During the game, you’ll be making hands that consist of 2 tiles. These 2-tile hands are scored as follows:\nPairs: Pairs are valued based on their ranking. The lower the pair’s ranking number, the higher its value. For example, if you have a pair of Teen, it would be more valuable than a pair of Foo since a pair of Teen has a ranking of 2 and a pair of Foo has a ranking of 9. Non-pairs: If 2 tiles in a hand don’t make a pair, add up the number of spots on each tile to determine the hand’s value. For example, if you had one tile with 2 spots and another tile with 5 spots, the value of that hand would be 7. The higher the number, the more valuable the hand is. If a non-pair hand adds up to more than 9, the number in the tens place is dropped. For example, if the 2 tiles in one of your hands add up to 15, you would drop the 1 and the value of that hand would become 5. A pair is always more valuable than a non-pair, regardless of the pair's rank. Playing the Game Place your bet before you receive your tiles. Like in Blackjack, you’ll need to make a bet before you know how good your hand (or set of tiles) is. Keep in mind that once you receive your tiles, you won’t be able to change your bet. When you’re first starting out, you may want to bet low until you get the hang of how to play. Have the dealer hand out 4 face-down tiles to every player. The dealer should give themselves 4 tiles as well. You can look at your tiles at this point, but be careful you don’t show them to any of the other players. Decide how you’ll divide your tiles for that round. Once you’re dealt your tiles, you’ll need to split them up into 2 “hands.” Each hand will have 2 tiles in it. The goal is to create the most valuable hands possible with the tiles you’ve been dealt. Your most valuable hand will be known as your high hand, and your other hand will be called your low hand. If you have 2 tiles that make a pair, it’s a good idea to put them together to make a hand since pairs are the most valuable hands. If you don’t have any pairs, you want to divide up your tiles so that the tiles in each hand add up to the highest value possible. Have each player flip over their tiles to reveal their 2 hands. Everyone should turn up their tiles at the same time. Double check that everyone is finished dividing up their tiles before you flip your tiles over. Differentiate between your 2 hands by positioning one vertically and one horizontally. Compare your high and low hands to the dealer’s hands. In order to beat the dealer, you want your hands, or tiles, to be more valuable than their hands. First, compare your high hand to the dealer’s high hand. Then, compare your low hand to the dealer’s low hand. If both your high hand and low hand beats their high hand and low hand, you win the bet! If your high hand beats the dealer’s high hand but your low hand doesn’t, or vice versa, you don’t win the bet. You need to beat both of the dealer’s hands. Every player should compare their high and low hands to the dealer’s hands. Players shouldn’t compare their hands with anyone but the dealer. If the value of your hands is tied with the dealer’s hands, the dealer wins. For example, if the dealer has a pair of Gee Joon (their high hand) and a non-pair of Yun and Day (which adds up to 0 and is their low hand) and you have a pair of Teen (your high hand) and a pair of Ping (your low hand), you wouldn't beat the dealer because, even though your low hand beats their low hand, the dealer's high hand beats your high hand. But, if you were to have a pair of Mooy (your high hand) and a pair of Look (your low hand) and the dealer has a non-pair of Bon and Gor (which adds up to 8 and is their high hand) and a non-pair of Bon and Foo (which adds up to 5 and is there low hand), you would win because both your high hand and low hand beat the dealer's high and low hands. Have each player collect, push, or pay. At the end of the each round, you’ll need to determine whether you or the dealer owes money. Whether you collect, push, or pay will depend on if you won or lost the bet. Collect: If you won the bet by beating both of the dealer’s hands, collect your payment from the dealer. The dealer should give you twice as much as you bet at the beginning of the round. Push: If you beat one of the dealer’s hands but not the other, you push and don’t collect or pay any money. Instead, you can hold onto your bet for the next round. Pay: If both of the dealer’s hands were more valuable than your hands, or if both were tied, pay the dealer all of the money you bet at the beginning of the round. Shuffle the tiles and start a new round. Choose a new dealer if you’d like and then place your bet. Then, have the dealer pass out 4 new tiles to all of the players and start the round. There’s no limit to how many rounds of pai gow you can play, unless you’re playing with real money and you start to run low. Don’t worry if the first few rounds are a little confusing. Keep playing and eventually you’ll get the hang of it!",
  "sentences":[
    " Setting up the Game Play with a set of 32 pai gow tiles.",
    "You’ll need specially-designed tiles to play pai gow with.",
    "While pai gow tiles look similar to dominoes, they’re not the same, and a set of regular dominoes won’t work for the game.",
    "Fortunately, you can easily find a set of pai gow tiles online or possibly at a local game shop.",
    "If you’d rather learn the game without investing in your own set of tiles, download a pai gow app or play online instead.",
    "You can also check if your local casino has pai gow tables you can play at.",
    "Find 2-8 people to play with.",
    "You need at least 2 players (including yourself) to play pai gow, and you can’t play with more than 8 people.",
    "It may be easier to play with a small group when you're first starting out.",
    "Pass out poker chips to each player if you won’t be betting real money.",
    "Pai gow is a betting game, so you’ll need something to bet with—even if it’s just chips instead of actual money—so you can place bets at the beginning of your turn.",
    "If you’re playing with poker chips, give everyone the same number of chips to start so you can easily determine who won the most at the end of the game!",
    "The number of chips you should give each player depends on how long you want to play for.",
    "Ten chips might only last someone a few rounds, whereas 50 chips could be a good choice if you're up for a long game.",
    "Choose 1 player to be the dealer.",
    "Like in Blackjack, you’re always playing against the dealer in pai gow.",
    "You can choose the dealer randomly, or a player can volunteer.",
    "You can also alternate being the dealer.",
    "For example, you could be the dealer in the first round and then pass the deal to the player to your left for the next round.",
    "Learning How the Tiles Work Notice that every pai gow tile has between 2 and 12 spots on it.",
    "The number of spots on a pai gow tile is important because it determines that tile's name and rank.",
    "Only one side of each tile will have spots on it so that other players can’t tell what tiles you have.",
    "For example, a tile with 3 spots on it will be played differently than a tile with 10 spots on it.",
    "Pay attention to the patterns of the spots on the tiles.",
    "The spots on pai gow tiles are arranged in different patterns, and these patterns can make a difference in how the tiles are played.",
    "Try not to confuse the tiles with each other by paying close attention to the different spot arrangements.",
    "For example, if you come across 2 tiles that each have 4 spots on them, but the spots are arranged in a different pattern on each tile, those tiles would not be a pair and they could end up having different values.",
    "Don’t worry about the color or orientation of the tiles.",
    "You’ll notice that some tiles have both red spots and white spots.",
    "The difference in color between the spots is just to make it easier for you to tell which tiles you’ve been dealt, and it in no way affects how the tiles are used.",
    "Also, it doesn’t make a difference which way you orient your tiles on the table—you can position them however you’d like.",
    "For example, if a tile has 1 spot on top and 2 spots on bottom, the value of the tile wouldn’t change if you rotated it so it had 2 spots on top and 1 on bottom.",
    "Know that every tile is part of a pair.",
    "Since there are 32 tiles in pai gow, there are 16 pairs of tiles in total.",
    "These pairs are the same in every set of pai gow tiles.",
    "All of the pairs except for 1 have the same number of spots on each tile in the pair.",
    "Also, not all of the pairs contain tiles that are identical in appearance.",
    "Some pairs have tiles with the same number of spots, but the spots are arranged in a different pattern.",
    "Eleven of the 16 pairs of tiles are identical in appearance.",
    "Five of the 16 pairs of tiles are not identical in appearance.",
    "One of the 16 pairs does not have the same number of spots on each tile.",
    "Learn the names of all the tiles.",
    "Every tile in pai gow has a name, and it shares that name with the other tile in its pair.",
    "For example, the 2 tiles that have 4 spots (2 spots on top and 2 on the bottom) make a pair and are each called “Bon.” If you had both of these tiles, you would say that you have a “pair of Bon.” Eventually, you’ll want to memorize these names so you can easily refer to different tiles and pairs.",
    "The names of all the tiles and their corresponding pairs are:\n\nGee Joon: 1 on top and 2 on bottom/2 on top and 2 on bottom.",
    "Teen: Both tiles have 6 on top and 6 on bottom.",
    "Day: Both tiles have 1 on top and 1 on bottom.",
    "Yun: Both tiles have 4 on top and 4 on bottom.",
    "Gor: Both tiles have 1 on top and 3 on bottom.",
    "Mooy: Both tiles have 5 on top and 5 on bottom.",
    "Chong: Both tiles have 3 on top and 3 on bottom.",
    "Bon: Both tiles have 2 on top and 2 on bottom.",
    "Foo: Both tiles have 5 on top and 6 on bottom.",
    "Ping: Both tiles have 4 on top and 6 on bottom.",
    "Tit: Both tiles have 1 on top and 6 on bottom.",
    "Look: Both tiles have 1 on top and 5 on bottom.",
    "Chop Gow: 3 on top and 6 on bottom/4 on top and 5 on bottom.",
    "Chop Bot: 2 on top and 6 on bottom/3 on top and 5 on bottom.",
    "Chop Chit: 2 on top and 5 on bottom/3 on top and 4 on bottom.",
    "Chop Ng: 1 on top and 4 on bottom/2 on top and 3 on bottom.",
    "Memorize the ranks of the different pairs of tiles.",
    "Every pair of tiles has a rank in pai gow, and the lower the rank number, the more valuable the pair is.",
    "The pairs are ranked 1-16, with 1 being the most valuable and 16 being the least valuable.",
    "Since the pairs are ranked in order, you can easily remember their ranks by memorizing the names of the pairs in the correct order.",
    "The tiles are ranked and ordered as follows:\nGee Joon (1), Teen (2), Day (3), Yun (4), Gor (5), Mooy (6), Chong (7), Bon (8), Foo (9), Ping (10), Tit (11), Look (12), Chop Gow (13), Chop Bot (14), Chop Chit (15), Chop Ng (16).",
    "Using the red spots on the tile is a helpful way to memorize the names and ranks of the tiles.",
    "For example, a pair of Gee Joon consists of 1 red spot on one tile and 4 red spots on the other tile.",
    "If you remember that a pair of Gee Joon has that configuration of red spots, it will be easier to recognize it when you’re dealt it during the game.",
    "Learn how the tiles are valued during the game.",
    "In pai gow, the goal is to have the most valuable tiles.",
    "In order to play strategically, you’ll need to understand how the tiles are valued so you can make the best “hands” with your tiles.",
    "During the game, you’ll be making hands that consist of 2 tiles.",
    "These 2-tile hands are scored as follows:\nPairs: Pairs are valued based on their ranking.",
    "The lower the pair’s ranking number, the higher its value.",
    "For example, if you have a pair of Teen, it would be more valuable than a pair of Foo since a pair of Teen has a ranking of 2 and a pair of Foo has a ranking of 9.",
    "Non-pairs: If 2 tiles in a hand don’t make a pair, add up the number of spots on each tile to determine the hand’s value.",
    "For example, if you had one tile with 2 spots and another tile with 5 spots, the value of that hand would be 7.",
    "The higher the number, the more valuable the hand is.",
    "If a non-pair hand adds up to more than 9, the number in the tens place is dropped.",
    "For example, if the 2 tiles in one of your hands add up to 15, you would drop the 1 and the value of that hand would become 5.",
    "A pair is always more valuable than a non-pair, regardless of the pair's rank.",
    "Playing the Game Place your bet before you receive your tiles.",
    "Like in Blackjack, you’ll need to make a bet before you know how good your hand (or set of tiles) is.",
    "Keep in mind that once you receive your tiles, you won’t be able to change your bet.",
    "When you’re first starting out, you may want to bet low until you get the hang of how to play.",
    "Have the dealer hand out 4 face-down tiles to every player.",
    "The dealer should give themselves 4 tiles as well.",
    "You can look at your tiles at this point, but be careful you don’t show them to any of the other players.",
    "Decide how you’ll divide your tiles for that round.",
    "Once you’re dealt your tiles, you’ll need to split them up into 2 “hands.” Each hand will have 2 tiles in it.",
    "The goal is to create the most valuable hands possible with the tiles you’ve been dealt.",
    "Your most valuable hand will be known as your high hand, and your other hand will be called your low hand.",
    "If you have 2 tiles that make a pair, it’s a good idea to put them together to make a hand since pairs are the most valuable hands.",
    "If you don’t have any pairs, you want to divide up your tiles so that the tiles in each hand add up to the highest value possible.",
    "Have each player flip over their tiles to reveal their 2 hands.",
    "Everyone should turn up their tiles at the same time.",
    "Double check that everyone is finished dividing up their tiles before you flip your tiles over.",
    "Differentiate between your 2 hands by positioning one vertically and one horizontally.",
    "Compare your high and low hands to the dealer’s hands.",
    "In order to beat the dealer, you want your hands, or tiles, to be more valuable than their hands.",
    "First, compare your high hand to the dealer’s high hand.",
    "Then, compare your low hand to the dealer’s low hand.",
    "If both your high hand and low hand beats their high hand and low hand, you win the bet!",
    "If your high hand beats the dealer’s high hand but your low hand doesn’t, or vice versa, you don’t win the bet.",
    "You need to beat both of the dealer’s hands.",
    "Every player should compare their high and low hands to the dealer’s hands.",
    "Players shouldn’t compare their hands with anyone but the dealer.",
    "If the value of your hands is tied with the dealer’s hands, the dealer wins.",
    "For example, if the dealer has a pair of Gee Joon (their high hand) and a non-pair of Yun and Day (which adds up to 0 and is their low hand) and you have a pair of Teen (your high hand) and a pair of Ping (your low hand), you wouldn't beat the dealer because, even though your low hand beats their low hand, the dealer's high hand beats your high hand.",
    "But, if you were to have a pair of Mooy (your high hand) and a pair of Look (your low hand) and the dealer has a non-pair of Bon and Gor (which adds up to 8 and is their high hand) and a non-pair of Bon and Foo (which adds up to 5 and is there low hand), you would win because both your high hand and low hand beat the dealer's high and low hands.",
    "Have each player collect, push, or pay.",
    "At the end of the each round, you’ll need to determine whether you or the dealer owes money.",
    "Whether you collect, push, or pay will depend on if you won or lost the bet.",
    "Collect: If you won the bet by beating both of the dealer’s hands, collect your payment from the dealer.",
    "The dealer should give you twice as much as you bet at the beginning of the round.",
    "Push: If you beat one of the dealer’s hands but not the other, you push and don’t collect or pay any money.",
    "Instead, you can hold onto your bet for the next round.",
    "Pay: If both of the dealer’s hands were more valuable than your hands, or if both were tied, pay the dealer all of the money you bet at the beginning of the round.",
    "Shuffle the tiles and start a new round.",
    "Choose a new dealer if you’d like and then place your bet.",
    "Then, have the dealer pass out 4 new tiles to all of the players and start the round.",
    "There’s no limit to how many rounds of pai gow you can play, unless you’re playing with real money and you start to run low.",
    "Don’t worry if the first few rounds are a little confusing.",
    "Keep playing and eventually you’ll get the hang of it!"
  ],
  "tyn_section":[
    "Pai gow tiles (set of 32)",
    "Money or poker chips for betting",
    "2-8 players"
  ],
  "tyn_model":[
    "tiles",
    "pai gow",
    "pai gow tiles",
    "poker chips",
    "yun",
    "ping",
    "gee joon",
    "“hands",
    "pai gow app",
    "pai gow tables",
    "—even",
    "—so",
    "—you",
    "“bon",
    "” if",
    "“pair",
    "” eventually",
    "chong",
    "gow",
    "bot",
    "chit",
    "” with",
    "” each",
    "teen",
    "mooy",
    "bon",
    "dealer"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.037037037,
    "f1":0.0666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1111111111,
    "f1":0.1904761905
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}