{
  "title":"How to Shade Drawings",
  "url":"https://www.wikihow.com/Shade-Drawings",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Coloring and Shading"
  ],
  "parts":[
    {
      "name":"Choosing a Shading Method",
      "steps":[
        {
          "headline":"Start with hatching for a basic shading technique.",
          "description":"Hatching is making a series of parallel lines to simulate shadows in your drawing. You can space the lines closer together to make darker shadows or the lines can be spaced further apart to make the area seem brighter. Pull hatching lines in one long stroke to keep them uniform. Hatching lines can be horizontal, vertical, or at an angle. Follow the angles and curves of objects with the shapes of your line to simulate a three-dimensional form. For example, shade a round object with curved lines rather than straight lines."
        },
        {
          "headline":"Use cross-hatching to shade quickly.",
          "description":"Cross-hatching builds onto hatch marks by adding a second layer of lines going at an opposite direction. For example, first, make parallel horizontal lines and then layer vertical lines on top of them. This method of shading allows you to make areas darker quicker than basic hatching. Draw the cross-hatching lines close together to make a densely shaded area on your drawing or spread them apart to make it lighter. Use hatch marks without a second layer to make a lighter shadow."
        },
        {
          "headline":"Work with stippling for a stylized look.",
          "description":"Stippling is a time-intensive process of lifting your pencil up and down from the paper to make a series of dots on your drawing. Make an area of your drawing darker by keeping the dots close to one another. Instead of dots make short lines that overlap to make shading in a more Impressionist style. Stippling works great for shading with a thicker marker."
        },
        {
          "headline":"Use blending for a smooth appearance.",
          "description":"Blending your shading gives your drawing a smooth and realistic finish and requires the most time and technique to do correctly. Shade with the side of a soft graphite pencil and increase the amount of pressure you apply to the paper to make transitions between light and dark values. Art pencils have varying degrees of hardness and are labeled with a number and either the letter B or H. Soft graphite is labeled with the letter B and gets softer with a higher number. Hard graphite is labeled with the letter H and is more difficult to use for smooth transitions the higher the number goes. A standard number 2 pencil has an HB hardness, which is a medium between hard and soft graphite. Practice shading on simple polygon forms, like cubes and spheres before jumping in to shade your drawing."
        }
      ]
    },
    {
      "name":"Adding Value to Your Drawing",
      "steps":[
        {
          "headline":"Determine the direction of your light source.",
          "description":"Your light source will determine where the darkest shadows and the brightest highlights appear on your drawing. Shadows will be on the opposite side of your light source while highlights will appear where your light source is pointing. Work from real life or a photograph to understand how light affects the object you’re drawing. Move lights if you can to play with different shadow angles. People looking at your drawing will be drawn to the lightest areas of the drawing. Determine the area that you want viewers to focus on and make it the brightest."
        },
        {
          "headline":"Make a value scale from light to dark on a separate piece of paper.",
          "description":"Draw a long rectangle and separate it with lines into 10 equal pieces. Shade the square on one side of the rectangle with your darkest value. Start to add value to the adjacent square so it is lighter than the darkest value. Work on each square, making them progressively lighter, until you reach the other end of the rectangle. Leave the last square empty so that it is brightest value. Only use the values in your scale as you shade in your drawing. Use the same type of paper your drawing is on. Different papers have different textures and affect how the shades look. Aim to have smooth transitions between each of the squares rather than having drastic changes in value. The square next to your lightest shade shouldn’t be too dark."
        },
        {
          "headline":"Apply light pressure with your pencil to create a base layer of shading.",
          "description":"Use a soft pencil, like a 4B hardness, to create the middle shade. Move your arm back and forth rather than your wrist to maintain a smooth range of motion. Don’t press too hard with your pencil since it will make your marks more difficult to erase later on."
        },
        {
          "headline":"Darken the areas that are furthest from the light source.",
          "description":"Press slightly harder with your pencil to make darker values on the opposite side of your light source. Build up layers of shading, working towards the darkest part of the drawing. Your darkest shadow is called the core shadow. Rounded shapes will have reflected shadows on the opposite side of the light source. These shadows are lighter than the core shadow but darker than the highlights."
        },
        {
          "headline":"Erase areas that have bright highlights.",
          "description":"The areas closest to your light source will be the brightest parts of your drawings. Work gently with your eraser to lighten the areas in layers to develop a smooth transition from light to dark. Add white pencil or pastel to make solid white areas that pop. Use this sparingly so it isn’t too overwhelming. Certain materials will reflect light in different ways. Objects with metallic finishes will have a brighter highlight while objects with a matte finish will look duller."
        },
        {
          "headline":"Blend your marks with a smudge stick if you want a smooth finish.",
          "description":"Mix your values together, working from the darkest part of your drawing to the lightest. Use the side of the smudge stick to make smooth transitions between different values. Smudge sticks can be purchased at any art supply store or online. Don’t use your finger to blend values. Your finger gives you less control than a  smudge stick and the oils from your skin could affect your drawing over time."
        },
        {
          "headline":"Add drop shadows for a realistic look.",
          "description":"If you want your object to look three-dimensional, a drop shadow will make it look like your drawing exists in deeper space. Your drop shadow will mimic the shape of the object casting it. Determine the surface where the shadow would land, and use the side of your pencil to shade in the drop shadow. Look at a photograph or a still-life to see how your light angle affects the drop shadow. The hardness of the edge of your drop shadow depends on the strength of your light source. Brighter lights will cause a harder edge while dim lights make the edges softer."
        }
      ]
    }
  ],
  "text":" Choosing a Shading Method Start with hatching for a basic shading technique. Hatching is making a series of parallel lines to simulate shadows in your drawing. You can space the lines closer together to make darker shadows or the lines can be spaced further apart to make the area seem brighter. Pull hatching lines in one long stroke to keep them uniform. Hatching lines can be horizontal, vertical, or at an angle. Follow the angles and curves of objects with the shapes of your line to simulate a three-dimensional form. For example, shade a round object with curved lines rather than straight lines. Use cross-hatching to shade quickly. Cross-hatching builds onto hatch marks by adding a second layer of lines going at an opposite direction. For example, first, make parallel horizontal lines and then layer vertical lines on top of them. This method of shading allows you to make areas darker quicker than basic hatching. Draw the cross-hatching lines close together to make a densely shaded area on your drawing or spread them apart to make it lighter. Use hatch marks without a second layer to make a lighter shadow. Work with stippling for a stylized look. Stippling is a time-intensive process of lifting your pencil up and down from the paper to make a series of dots on your drawing. Make an area of your drawing darker by keeping the dots close to one another. Instead of dots make short lines that overlap to make shading in a more Impressionist style. Stippling works great for shading with a thicker marker. Use blending for a smooth appearance. Blending your shading gives your drawing a smooth and realistic finish and requires the most time and technique to do correctly. Shade with the side of a soft graphite pencil and increase the amount of pressure you apply to the paper to make transitions between light and dark values. Art pencils have varying degrees of hardness and are labeled with a number and either the letter B or H. Soft graphite is labeled with the letter B and gets softer with a higher number. Hard graphite is labeled with the letter H and is more difficult to use for smooth transitions the higher the number goes. A standard number 2 pencil has an HB hardness, which is a medium between hard and soft graphite. Practice shading on simple polygon forms, like cubes and spheres before jumping in to shade your drawing. Adding Value to Your Drawing Determine the direction of your light source. Your light source will determine where the darkest shadows and the brightest highlights appear on your drawing. Shadows will be on the opposite side of your light source while highlights will appear where your light source is pointing. Work from real life or a photograph to understand how light affects the object you’re drawing. Move lights if you can to play with different shadow angles. People looking at your drawing will be drawn to the lightest areas of the drawing. Determine the area that you want viewers to focus on and make it the brightest. Make a value scale from light to dark on a separate piece of paper. Draw a long rectangle and separate it with lines into 10 equal pieces. Shade the square on one side of the rectangle with your darkest value. Start to add value to the adjacent square so it is lighter than the darkest value. Work on each square, making them progressively lighter, until you reach the other end of the rectangle. Leave the last square empty so that it is brightest value. Only use the values in your scale as you shade in your drawing. Use the same type of paper your drawing is on. Different papers have different textures and affect how the shades look. Aim to have smooth transitions between each of the squares rather than having drastic changes in value. The square next to your lightest shade shouldn’t be too dark. Apply light pressure with your pencil to create a base layer of shading. Use a soft pencil, like a 4B hardness, to create the middle shade. Move your arm back and forth rather than your wrist to maintain a smooth range of motion. Don’t press too hard with your pencil since it will make your marks more difficult to erase later on. Darken the areas that are furthest from the light source. Press slightly harder with your pencil to make darker values on the opposite side of your light source. Build up layers of shading, working towards the darkest part of the drawing. Your darkest shadow is called the core shadow. Rounded shapes will have reflected shadows on the opposite side of the light source. These shadows are lighter than the core shadow but darker than the highlights. Erase areas that have bright highlights. The areas closest to your light source will be the brightest parts of your drawings. Work gently with your eraser to lighten the areas in layers to develop a smooth transition from light to dark. Add white pencil or pastel to make solid white areas that pop. Use this sparingly so it isn’t too overwhelming. Certain materials will reflect light in different ways. Objects with metallic finishes will have a brighter highlight while objects with a matte finish will look duller. Blend your marks with a smudge stick if you want a smooth finish. Mix your values together, working from the darkest part of your drawing to the lightest. Use the side of the smudge stick to make smooth transitions between different values. Smudge sticks can be purchased at any art supply store or online. Don’t use your finger to blend values. Your finger gives you less control than a  smudge stick and the oils from your skin could affect your drawing over time. Add drop shadows for a realistic look. If you want your object to look three-dimensional, a drop shadow will make it look like your drawing exists in deeper space. Your drop shadow will mimic the shape of the object casting it. Determine the surface where the shadow would land, and use the side of your pencil to shade in the drop shadow. Look at a photograph or a still-life to see how your light angle affects the drop shadow. The hardness of the edge of your drop shadow depends on the strength of your light source. Brighter lights will cause a harder edge while dim lights make the edges softer.",
  "sentences":[
    " Choosing a Shading Method Start with hatching for a basic shading technique.",
    "Hatching is making a series of parallel lines to simulate shadows in your drawing.",
    "You can space the lines closer together to make darker shadows or the lines can be spaced further apart to make the area seem brighter.",
    "Pull hatching lines in one long stroke to keep them uniform.",
    "Hatching lines can be horizontal, vertical, or at an angle.",
    "Follow the angles and curves of objects with the shapes of your line to simulate a three-dimensional form.",
    "For example, shade a round object with curved lines rather than straight lines.",
    "Use cross-hatching to shade quickly.",
    "Cross-hatching builds onto hatch marks by adding a second layer of lines going at an opposite direction.",
    "For example, first, make parallel horizontal lines and then layer vertical lines on top of them.",
    "This method of shading allows you to make areas darker quicker than basic hatching.",
    "Draw the cross-hatching lines close together to make a densely shaded area on your drawing or spread them apart to make it lighter.",
    "Use hatch marks without a second layer to make a lighter shadow.",
    "Work with stippling for a stylized look.",
    "Stippling is a time-intensive process of lifting your pencil up and down from the paper to make a series of dots on your drawing.",
    "Make an area of your drawing darker by keeping the dots close to one another.",
    "Instead of dots make short lines that overlap to make shading in a more Impressionist style.",
    "Stippling works great for shading with a thicker marker.",
    "Use blending for a smooth appearance.",
    "Blending your shading gives your drawing a smooth and realistic finish and requires the most time and technique to do correctly.",
    "Shade with the side of a soft graphite pencil and increase the amount of pressure you apply to the paper to make transitions between light and dark values.",
    "Art pencils have varying degrees of hardness and are labeled with a number and either the letter B or H. Soft graphite is labeled with the letter B and gets softer with a higher number.",
    "Hard graphite is labeled with the letter H and is more difficult to use for smooth transitions the higher the number goes.",
    "A standard number 2 pencil has an HB hardness, which is a medium between hard and soft graphite.",
    "Practice shading on simple polygon forms, like cubes and spheres before jumping in to shade your drawing.",
    "Adding Value to Your Drawing Determine the direction of your light source.",
    "Your light source will determine where the darkest shadows and the brightest highlights appear on your drawing.",
    "Shadows will be on the opposite side of your light source while highlights will appear where your light source is pointing.",
    "Work from real life or a photograph to understand how light affects the object you’re drawing.",
    "Move lights if you can to play with different shadow angles.",
    "People looking at your drawing will be drawn to the lightest areas of the drawing.",
    "Determine the area that you want viewers to focus on and make it the brightest.",
    "Make a value scale from light to dark on a separate piece of paper.",
    "Draw a long rectangle and separate it with lines into 10 equal pieces.",
    "Shade the square on one side of the rectangle with your darkest value.",
    "Start to add value to the adjacent square so it is lighter than the darkest value.",
    "Work on each square, making them progressively lighter, until you reach the other end of the rectangle.",
    "Leave the last square empty so that it is brightest value.",
    "Only use the values in your scale as you shade in your drawing.",
    "Use the same type of paper your drawing is on.",
    "Different papers have different textures and affect how the shades look.",
    "Aim to have smooth transitions between each of the squares rather than having drastic changes in value.",
    "The square next to your lightest shade shouldn’t be too dark.",
    "Apply light pressure with your pencil to create a base layer of shading.",
    "Use a soft pencil, like a 4B hardness, to create the middle shade.",
    "Move your arm back and forth rather than your wrist to maintain a smooth range of motion.",
    "Don’t press too hard with your pencil since it will make your marks more difficult to erase later on.",
    "Darken the areas that are furthest from the light source.",
    "Press slightly harder with your pencil to make darker values on the opposite side of your light source.",
    "Build up layers of shading, working towards the darkest part of the drawing.",
    "Your darkest shadow is called the core shadow.",
    "Rounded shapes will have reflected shadows on the opposite side of the light source.",
    "These shadows are lighter than the core shadow but darker than the highlights.",
    "Erase areas that have bright highlights.",
    "The areas closest to your light source will be the brightest parts of your drawings.",
    "Work gently with your eraser to lighten the areas in layers to develop a smooth transition from light to dark.",
    "Add white pencil or pastel to make solid white areas that pop.",
    "Use this sparingly so it isn’t too overwhelming.",
    "Certain materials will reflect light in different ways.",
    "Objects with metallic finishes will have a brighter highlight while objects with a matte finish will look duller.",
    "Blend your marks with a smudge stick if you want a smooth finish.",
    "Mix your values together, working from the darkest part of your drawing to the lightest.",
    "Use the side of the smudge stick to make smooth transitions between different values.",
    "Smudge sticks can be purchased at any art supply store or online.",
    "Don’t use your finger to blend values.",
    "Your finger gives you less control than a  smudge stick and the oils from your skin could affect your drawing over time.",
    "Add drop shadows for a realistic look.",
    "If you want your object to look three-dimensional, a drop shadow will make it look like your drawing exists in deeper space.",
    "Your drop shadow will mimic the shape of the object casting it.",
    "Determine the surface where the shadow would land, and use the side of your pencil to shade in the drop shadow.",
    "Look at a photograph or a still-life to see how your light angle affects the drop shadow.",
    "The hardness of the edge of your drop shadow depends on the strength of your light source.",
    "Brighter lights will cause a harder edge while dim lights make the edges softer."
  ],
  "tyn_section":[
    "Paper",
    "Pencils with soft graphite (HB or lower)",
    "Eraser",
    "Smudge stick (optional)"
  ],
  "tyn_model":[
    "pencil",
    "paper",
    "graphite",
    "smudge stick",
    "marker",
    "graphite pencil",
    "art pencils",
    "lights",
    "papers",
    "eraser",
    "white pencil",
    "pastel",
    "smudge sticks",
    "art supply store",
    "oils"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1333333333,
    "f1":0.2105263158,
    "avg_pos":0.0666666667
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.2,
    "f1":0.3157894737
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2,
    "f1":0.3157894737
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.2,
    "f1":0.3157894737
  }
}