{
  "title":"How to Smoke Trout",
  "url":"https://www.wikihow.com/Smoke-Trout",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Seasoning and Brining the Fillets",
      "steps":[
        {
          "headline":"Rinse the boneless trout fillets and rest them in a glass baking dish.",
          "description":"As you rinse the boneless fillets under cool water, use your fingers to remove any remnants that are stuck to the fillet from the gutting and bone removal process. Gently shake excess water from the fillets, and place them into a glass baking dish. Place the fillets skin side down into the baking dish to make it easier to marinate."
        },
        {
          "headline":"Marinate the fillets overnight in olive oil, chopped garlic, and dried rosemary.",
          "description":"Coat the fillets with 2 US tbsp (30 mL) of olive oil, 4 cloves of chopped garlic, and 1 1/2 tbsp (2.55 g) of chopped, dried rosemary. Use your fingers to rub the seasonings into the meat. Then, cover the baking dish and set it in the refrigerator so the fillets can marinate overnight. If you do not want to season your fillets before smoking them, then proceed to soak the fillets in brine after rinsing them."
        },
        {
          "headline":"Mix 1 US quart (950 mL) of water with 1/2 cup (150 g) of kosher salt.",
          "description":"Pour the water into a large container that can hold about 4 US quarts (3,800 mL). Add the kosher salt, and use a spoon to stir the water for 1-2 minutes or until the salt is completely dissolved. This will create a basic brine that will moisten and add flavor to the trout. Sweeten the brine by stirring in 1/2 cup (100 g) of brown sugar."
        },
        {
          "headline":"Submerge each of your fillets in the brine and refrigerate them for 3 hours.",
          "description":"Arrange your trout fillets so that all of them are submerged within the brine. Then, place a cover on the container and set it in the refrigerator to marinate for at least 3 hours."
        },
        {
          "headline":"Rinse the fillets under cool water to remove the brine.",
          "description":"Take a fillet out of the container with the brine, and rinse it under cool water until any excess brine has been removed. Then, use a paper towel to gently dry off the fillet. Discard the brine by pouring it down your kitchen sink, and then thoroughly rinse your sink with hot water."
        },
        {
          "headline":"Spread the fillets out on a baking rack, placing the skin against the rack.",
          "description":"Take each fillet and place them on a baking rack. Make sure the skin side of the fillet is against the rack, as this will help expedite the drying process. If you do not have a baking rack large enough to support all of the fillets, use 2 smaller baking racks instead. Smaller baking racks might also be easier to place inside your refrigerator if it is filled with food."
        },
        {
          "headline":"Refrigerate the fillets on the baking rack for 21-24 hours to dry them.",
          "description":"Rest the baking rack in a spot of your refrigerator where the fillets won’t be disturbed. Leave the fillets overnight or for a full 24 hours so they can dry. The skin on the fillets will be shiny or slightly sticky when ready. If the skin does not seem shiny or sticky, then continue to refrigerate the fillets until the skin appears shiny. The tackiness is key to getting the smoke flavor to adhere to the meat. To make the baking rack easier to transport, set it inside of a baking sheet. This will also keep the raw fish from contaminating other items in your refrigerator."
        }
      ]
    },
    {
      "name":"Smoking and Serving the Trout",
      "steps":[
        {
          "headline":"Turn on your smoker and bring the temperature to 150 °F (66 °C).",
          "description":"Use charcoal or whatever means required to heat your particular smoker. Refer to the manufacturing directions on how to heat and use your specific smoker. You can purchase a smoker in the outdoors section of your local department store, or online with major retailers."
        },
        {
          "headline":"Soak approximately 1 lb (0.45 kg) of wood chips in cold water for 30 minutes.",
          "description":"Use a scent of wood chips that appeals to your particular tastes. Then, pour the wood chips into a large bowl filled with cold water and allow them to soak for at least 30 minutes. The water will saturate the wood chips and help produce smoke when heated. For a mild smoky flavor, use alder, pecan, oak, or apple wood chips. For a strong smoky flavor, use mesquite, hickory, or maple wood chips."
        },
        {
          "headline":"Rest the fillets on the smoking rack so the skin is against the rack.",
          "description":"Do not overcrowd the smoker. Otherwise, the trout may not smoke properly. Leave about ⁄4 in (0.64 cm) between each fillet. Season the fillets with freshly, ground black pepper to taste if desired. To help create a natural separation between the fillets, individually rest your fillets into a small well or dish made out of a piece of aluminum foil. Then, place the fillets onto the smoking rack. The aluminum foil will also conduct heat around the meat. This is not necessary, but it can be useful if you have a lot of fillets to fit on the smoking rack."
        },
        {
          "headline":"Add a handful of the soaked wood chips into the smoker to flavor the meat.",
          "description":"Place a handful of the chips into your smoker as directed by the manufacturing instructions. This usually includes dispersing the wood chips over the hot coals or rocks in the smoker, or filling a heat box or pan with the wood chips. You can add more wood chips throughout the smoking process to increase the amount of smoky flavor produced."
        },
        {
          "headline":"Smoke the covered trout for 2.5-3 hours to cook and flavor the meat.",
          "description":"Use a meat thermometer to check the internal temperature of the fillets. When cooked, the internal temperature will be 165 °F (74 °C), and the meat will have darkened in color. Avoid smoking the trout longer than 4 hours. Otherwise, you may dry out the meat."
        },
        {
          "headline":"Remove the fillets from the smoker and let them rest for 20 minutes.",
          "description":"Carefully, use a pair of heat-resistant tongs to transfer the smoked trout from the smoker and onto a serving plate. Then, allow the trout to rest for approximately 20 minutes before serving or eating. Squeeze fresh lemon juice onto the smoked trout before serving. The tart flavor of the lemon will complement the smokiness of the trout."
        },
        {
          "headline":"Store any leftover smoked trout in the refrigerator for about a week.",
          "description":"Place the leftover smoked trout into a sealable container. Then, store the container in the refrigerator and enjoy eating it over the next week. Reheat the trout in a pan over a medium heat or enjoy eating it chilled."
        }
      ]
    }
  ],
  "text":" Seasoning and Brining the Fillets Rinse the boneless trout fillets and rest them in a glass baking dish. As you rinse the boneless fillets under cool water, use your fingers to remove any remnants that are stuck to the fillet from the gutting and bone removal process. Gently shake excess water from the fillets, and place them into a glass baking dish. Place the fillets skin side down into the baking dish to make it easier to marinate. Marinate the fillets overnight in olive oil, chopped garlic, and dried rosemary. Coat the fillets with 2 US tbsp (30 mL) of olive oil, 4 cloves of chopped garlic, and 1 1/2 tbsp (2.55 g) of chopped, dried rosemary. Use your fingers to rub the seasonings into the meat. Then, cover the baking dish and set it in the refrigerator so the fillets can marinate overnight. If you do not want to season your fillets before smoking them, then proceed to soak the fillets in brine after rinsing them. Mix 1 US quart (950 mL) of water with 1/2 cup (150 g) of kosher salt. Pour the water into a large container that can hold about 4 US quarts (3,800 mL). Add the kosher salt, and use a spoon to stir the water for 1-2 minutes or until the salt is completely dissolved. This will create a basic brine that will moisten and add flavor to the trout. Sweeten the brine by stirring in 1/2 cup (100 g) of brown sugar. Submerge each of your fillets in the brine and refrigerate them for 3 hours. Arrange your trout fillets so that all of them are submerged within the brine. Then, place a cover on the container and set it in the refrigerator to marinate for at least 3 hours. Rinse the fillets under cool water to remove the brine. Take a fillet out of the container with the brine, and rinse it under cool water until any excess brine has been removed. Then, use a paper towel to gently dry off the fillet. Discard the brine by pouring it down your kitchen sink, and then thoroughly rinse your sink with hot water. Spread the fillets out on a baking rack, placing the skin against the rack. Take each fillet and place them on a baking rack. Make sure the skin side of the fillet is against the rack, as this will help expedite the drying process. If you do not have a baking rack large enough to support all of the fillets, use 2 smaller baking racks instead. Smaller baking racks might also be easier to place inside your refrigerator if it is filled with food. Refrigerate the fillets on the baking rack for 21-24 hours to dry them. Rest the baking rack in a spot of your refrigerator where the fillets won’t be disturbed. Leave the fillets overnight or for a full 24 hours so they can dry. The skin on the fillets will be shiny or slightly sticky when ready. If the skin does not seem shiny or sticky, then continue to refrigerate the fillets until the skin appears shiny. The tackiness is key to getting the smoke flavor to adhere to the meat. To make the baking rack easier to transport, set it inside of a baking sheet. This will also keep the raw fish from contaminating other items in your refrigerator. Smoking and Serving the Trout Turn on your smoker and bring the temperature to 150 °F (66 °C). Use charcoal or whatever means required to heat your particular smoker. Refer to the manufacturing directions on how to heat and use your specific smoker. You can purchase a smoker in the outdoors section of your local department store, or online with major retailers. Soak approximately 1 lb (0.45 kg) of wood chips in cold water for 30 minutes. Use a scent of wood chips that appeals to your particular tastes. Then, pour the wood chips into a large bowl filled with cold water and allow them to soak for at least 30 minutes. The water will saturate the wood chips and help produce smoke when heated. For a mild smoky flavor, use alder, pecan, oak, or apple wood chips. For a strong smoky flavor, use mesquite, hickory, or maple wood chips. Rest the fillets on the smoking rack so the skin is against the rack. Do not overcrowd the smoker. Otherwise, the trout may not smoke properly. Leave about ⁄4 in (0.64 cm) between each fillet. Season the fillets with freshly, ground black pepper to taste if desired. To help create a natural separation between the fillets, individually rest your fillets into a small well or dish made out of a piece of aluminum foil. Then, place the fillets onto the smoking rack. The aluminum foil will also conduct heat around the meat. This is not necessary, but it can be useful if you have a lot of fillets to fit on the smoking rack. Add a handful of the soaked wood chips into the smoker to flavor the meat. Place a handful of the chips into your smoker as directed by the manufacturing instructions. This usually includes dispersing the wood chips over the hot coals or rocks in the smoker, or filling a heat box or pan with the wood chips. You can add more wood chips throughout the smoking process to increase the amount of smoky flavor produced. Smoke the covered trout for 2.5-3 hours to cook and flavor the meat. Use a meat thermometer to check the internal temperature of the fillets. When cooked, the internal temperature will be 165 °F (74 °C), and the meat will have darkened in color. Avoid smoking the trout longer than 4 hours. Otherwise, you may dry out the meat. Remove the fillets from the smoker and let them rest for 20 minutes. Carefully, use a pair of heat-resistant tongs to transfer the smoked trout from the smoker and onto a serving plate. Then, allow the trout to rest for approximately 20 minutes before serving or eating. Squeeze fresh lemon juice onto the smoked trout before serving. The tart flavor of the lemon will complement the smokiness of the trout. Store any leftover smoked trout in the refrigerator for about a week. Place the leftover smoked trout into a sealable container. Then, store the container in the refrigerator and enjoy eating it over the next week. Reheat the trout in a pan over a medium heat or enjoy eating it chilled.",
  "sentences":[
    " Seasoning and Brining the Fillets Rinse the boneless trout fillets and rest them in a glass baking dish.",
    "As you rinse the boneless fillets under cool water, use your fingers to remove any remnants that are stuck to the fillet from the gutting and bone removal process.",
    "Gently shake excess water from the fillets, and place them into a glass baking dish.",
    "Place the fillets skin side down into the baking dish to make it easier to marinate.",
    "Marinate the fillets overnight in olive oil, chopped garlic, and dried rosemary.",
    "Coat the fillets with 2 US tbsp (30 mL) of olive oil, 4 cloves of chopped garlic, and 1 1/2 tbsp (2.55 g) of chopped, dried rosemary.",
    "Use your fingers to rub the seasonings into the meat.",
    "Then, cover the baking dish and set it in the refrigerator so the fillets can marinate overnight.",
    "If you do not want to season your fillets before smoking them, then proceed to soak the fillets in brine after rinsing them.",
    "Mix 1 US quart (950 mL) of water with 1/2 cup (150 g) of kosher salt.",
    "Pour the water into a large container that can hold about 4 US quarts (3,800 mL).",
    "Add the kosher salt, and use a spoon to stir the water for 1-2 minutes or until the salt is completely dissolved.",
    "This will create a basic brine that will moisten and add flavor to the trout.",
    "Sweeten the brine by stirring in 1/2 cup (100 g) of brown sugar.",
    "Submerge each of your fillets in the brine and refrigerate them for 3 hours.",
    "Arrange your trout fillets so that all of them are submerged within the brine.",
    "Then, place a cover on the container and set it in the refrigerator to marinate for at least 3 hours.",
    "Rinse the fillets under cool water to remove the brine.",
    "Take a fillet out of the container with the brine, and rinse it under cool water until any excess brine has been removed.",
    "Then, use a paper towel to gently dry off the fillet.",
    "Discard the brine by pouring it down your kitchen sink, and then thoroughly rinse your sink with hot water.",
    "Spread the fillets out on a baking rack, placing the skin against the rack.",
    "Take each fillet and place them on a baking rack.",
    "Make sure the skin side of the fillet is against the rack, as this will help expedite the drying process.",
    "If you do not have a baking rack large enough to support all of the fillets, use 2 smaller baking racks instead.",
    "Smaller baking racks might also be easier to place inside your refrigerator if it is filled with food.",
    "Refrigerate the fillets on the baking rack for 21-24 hours to dry them.",
    "Rest the baking rack in a spot of your refrigerator where the fillets won’t be disturbed.",
    "Leave the fillets overnight or for a full 24 hours so they can dry.",
    "The skin on the fillets will be shiny or slightly sticky when ready.",
    "If the skin does not seem shiny or sticky, then continue to refrigerate the fillets until the skin appears shiny.",
    "The tackiness is key to getting the smoke flavor to adhere to the meat.",
    "To make the baking rack easier to transport, set it inside of a baking sheet.",
    "This will also keep the raw fish from contaminating other items in your refrigerator.",
    "Smoking and Serving the Trout Turn on your smoker and bring the temperature to 150 °F (66 °C).",
    "Use charcoal or whatever means required to heat your particular smoker.",
    "Refer to the manufacturing directions on how to heat and use your specific smoker.",
    "You can purchase a smoker in the outdoors section of your local department store, or online with major retailers.",
    "Soak approximately 1 lb (0.45 kg) of wood chips in cold water for 30 minutes.",
    "Use a scent of wood chips that appeals to your particular tastes.",
    "Then, pour the wood chips into a large bowl filled with cold water and allow them to soak for at least 30 minutes.",
    "The water will saturate the wood chips and help produce smoke when heated.",
    "For a mild smoky flavor, use alder, pecan, oak, or apple wood chips.",
    "For a strong smoky flavor, use mesquite, hickory, or maple wood chips.",
    "Rest the fillets on the smoking rack so the skin is against the rack.",
    "Do not overcrowd the smoker.",
    "Otherwise, the trout may not smoke properly.",
    "Leave about ⁄4 in (0.64 cm) between each fillet.",
    "Season the fillets with freshly, ground black pepper to taste if desired.",
    "To help create a natural separation between the fillets, individually rest your fillets into a small well or dish made out of a piece of aluminum foil.",
    "Then, place the fillets onto the smoking rack.",
    "The aluminum foil will also conduct heat around the meat.",
    "This is not necessary, but it can be useful if you have a lot of fillets to fit on the smoking rack.",
    "Add a handful of the soaked wood chips into the smoker to flavor the meat.",
    "Place a handful of the chips into your smoker as directed by the manufacturing instructions.",
    "This usually includes dispersing the wood chips over the hot coals or rocks in the smoker, or filling a heat box or pan with the wood chips.",
    "You can add more wood chips throughout the smoking process to increase the amount of smoky flavor produced.",
    "Smoke the covered trout for 2.5-3 hours to cook and flavor the meat.",
    "Use a meat thermometer to check the internal temperature of the fillets.",
    "When cooked, the internal temperature will be 165 °F (74 °C), and the meat will have darkened in color.",
    "Avoid smoking the trout longer than 4 hours.",
    "Otherwise, you may dry out the meat.",
    "Remove the fillets from the smoker and let them rest for 20 minutes.",
    "Carefully, use a pair of heat-resistant tongs to transfer the smoked trout from the smoker and onto a serving plate.",
    "Then, allow the trout to rest for approximately 20 minutes before serving or eating.",
    "Squeeze fresh lemon juice onto the smoked trout before serving.",
    "The tart flavor of the lemon will complement the smokiness of the trout.",
    "Store any leftover smoked trout in the refrigerator for about a week.",
    "Place the leftover smoked trout into a sealable container.",
    "Then, store the container in the refrigerator and enjoy eating it over the next week.",
    "Reheat the trout in a pan over a medium heat or enjoy eating it chilled."
  ],
  "tyn_section":[
    "Glass baking dish with a lid",
    "4 US quarts (3,800 mL) container with a lid",
    "Measuring cups and spoons",
    "Paper towels",
    "Baking rack",
    "Baking sheet large enough to hold the baking rack (optional)",
    "Smoker unit or smoker grill",
    "Heat-resistant tongs",
    "Aluminum foil (optional)",
    "Serving plate",
    "Wood chips"
  ],
  "tyn_model":[
    "smoker",
    "water",
    "refrigerator",
    "wood chips",
    "trout",
    "baking rack",
    "smoked trout",
    "glass baking dish",
    "baking dish",
    "olive oil",
    "garlic",
    "rosemary",
    "kosher salt",
    "container",
    "cold water",
    "aluminum foil",
    "lemon",
    "spoon",
    "salt",
    "brown sugar",
    "paper towel",
    "baking racks",
    "baking sheet",
    "fish",
    "charcoal",
    "large bowl",
    "smoking rack",
    "black pepper",
    "meat thermometer",
    "heat-resistant tongs",
    "sealable container",
    "pan"
  ],
  "simple_metrics":{
    "r":0.2727272727,
    "p":0.09375,
    "f1":0.1395348837,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4545454545,
    "p":0.15625,
    "f1":0.2325581395
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5454545455,
    "p":0.3125,
    "f1":0.3973509934
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3636363636,
    "p":0.125,
    "f1":0.1860465116
  }
}