{
  "title":"How to Change a Circuit Breaker",
  "url":"https://www.wikihow.com/Change-a-Circuit-Breaker",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Electrical Maintenance",
    "Electrical Wiring and Safety Switches"
  ],
  "parts":[
    {
      "name":"Investigating the Faulty Circuit Breaker",
      "steps":[
        {
          "headline":"Find the circuit breaker box.",
          "description":"Some homes will have multiple breaker boxes in different places. Find both the main circuit breaker box and the one you need to replace a circuit breaker in. If you’re unsure about the circuit breaker boxes in your home, call an electrician."
        },
        {
          "headline":"Inspect the exterior of the breaker panel for damage or discoloration.",
          "description":"Before you begin working on any breaker boxes, you should make sure they are still in a safe condition. Any damage or contamination to the box may make it unsafe to work on. Look for any signs of rust, discoloration, charring or moisture when you first examine the circuit breaker box and throughout the process. If you see anything that seems dangerous or unexpected, call an electrician. Beware of certain types of panels, specifically those bearing one of the following names: Federal Pacific Electric, Federal Pioneer, Zinsco, Kearney, GTE Sylvania, or Stab-lok. The safety of these panels is highly debated. Research the issue and contact an experienced electrician for advice. Decide what to do based on the information you find."
        },
        {
          "headline":"Use rubber-insulated tools, gloves, and shoes.",
          "description":"Electricity can be incredibly dangerous to work around, so take all precautions when trying to reduce the chance of an electrical shock. Use rubber insulated tools, and wear rubber-soled shoes and insulated gloves when working with electricity. If you don’t have rubber-soled shoes or if you want to take further precautions, put down a rubber mat below the circuit breaker box. If the area around the breaker box is damp or otherwise unsafe, call an electrician."
        },
        {
          "headline":"Locate the defective breaker.",
          "description":"You should only replace a circuit breaker that has broken or been damaged in some way. If a circuit breaker is damaged, it will likely have tripped, cutting power to the section of the home it controls. Look through your breaker box for the circuit breaker which stands out from the others. Generally, a tripped circuit breaker switch will be halfway between the on and off positions."
        },
        {
          "headline":"Test the faulty breaker.",
          "description":"Before you replace a circuit breaker, make sure the breaker itself is faulty and not just overloaded. Unplug and switch off all light and electrical devices in the section of your home controlled by the circuit breaker. Then, turn the breaker switch completely off and back on again. Plug one device back in to see if it is powered to indicate if the breaker is allowing any power through or if it is completely broken. If the circuit is overloaded and that is causing the breaker to trip, it is working properly. You’ll likely need to reduce the power usage in that section of your home rather than replacing the breaker. If you think the breaker is tripping without being overloaded, it may be wearing out and have a reduced capacity for amperage. If you think this is the case, you should check the amperage of your circuit breaker."
        },
        {
          "headline":"Test the voltage of the circuit breaker.",
          "description":"If you want to test the circuit breaker more specifically, you can do so with a voltage tester. To do so, unscrew and remove the faceplate, and press one lead to the neutral wire in the breaker box. Press the other lead to the screw on the circuit breaker. The voltage tester should display how much power is being allowed through the breaker. Only touch the components you need to touch, and only with the leads on the voltage tester. The power will need to be on for this to work, so be very careful."
        }
      ]
    },
    {
      "name":"Removing the Faulty Circuit Breaker",
      "steps":[
        {
          "headline":"Turn off all power and all individual breakers.",
          "description":"Before doing any work on a circuit breaker or in the breaker box, make sure you have turned off all the power going to it. If you have a main box and other branch boxes around your home, turn off the power to the branch box at the main box first. Otherwise, just turn off the main power followed by all breakers. Even once you have turned the power off, you should act as if it’s still on. Only touch the parts of the circuit breaker box you need to touch. If you are turning off the main power, or the power to the area around you, the lights will likely turn off as well. Keep an alternative light source nearby so you don’t have to work in the dark."
        },
        {
          "headline":"Unscrew and remove the faceplate.",
          "description":"While the circuit breaker box will allow you to switch breakers on and off, this will not give you access to the entire circuit breaker. Find the screws in each corner of the breaker box and carefully remove them to free the faceplate. Holding the edges, lift the faceplate directly away from the breaker box before lowering it. Always remove the panel by pulling it towards you and then sliding it down. Don’t let it touch or bump anything inside the circuit breaker box as you are removing it. Put the screws and the faceplate somewhere you can easily find them when needed. While the screws can be replaced, it’s much easier to keep them in a safe place while they’re not attached to the breaker box."
        },
        {
          "headline":"Inspect the interior of the panel for damage or discoloration.",
          "description":"Before you touch anything inside the panel of the breaker box, look for signs of damage. If you see anything that seems unsafe or out of the ordinary, stop immediately and call a licensed electrician. Keep an eye out for any rust, moisture, signs of pests, loose wires, melting, discoloration, charring, heat marking, strange wiring, multiple wires connected to one screw, damaged wiring, debris, or multiple colored wires connected to each other. These can all be dangerous."
        },
        {
          "headline":"Pull out the faulty breaker.",
          "description":"When touching items inside the circuit breaker box, always be careful to only touch the components you need to. With a firm grip, grasp the defective circuit breaker. Start lifting the side that faces towards the center of the panel, with the aim of pivoting it up and out from the breaker panel. Once it is free, unhook it from the hinge on the edge of the panel and pull the breaker free."
        },
        {
          "headline":"Disconnect the wire on the circuit breaker.",
          "description":"The wire connected to the circuit breaker will be held in by a flathead screw on one side. Use a flat-head screwdriver to loosen this screw slightly, without unscrewing and removing it completely. Separate the wire from the circuit breaker once the screw is loose enough. Always keep track of loose wires, as they can be incredibly dangerous. Tuck the wire into the circuit breaker box to keep it out of the way. Make sure you know which wire you have disconnected, as you’ll need to reconnect it when you install a new circuit breaker."
        },
        {
          "headline":"Note the exact amperage and type of the circuit breaker.",
          "description":"The circuit breaker replacement will need to be the exact same type as the faulty one you remove. Take note of the amperage of the fault breaker, as well as any codes or numbers written elsewhere on it."
        },
        {
          "headline":"Dispose of the faulty circuit breaker.",
          "description":"While a circuit breaker may feel heavy, there is very little value to any of its components. You can throw circuit breakers away with your regular trash, as they are inert without a power supply."
        }
      ]
    },
    {
      "name":"Installing a New Circuit Breaker",
      "steps":[
        {
          "headline":"Find a new circuit breaker of the same type as the faulty one.",
          "description":"The new circuit breaker will need to be exactly the same type as the one you are replacing. Your local hardware store should have a selection of circuit breakers and may have the exact one you are looking for. If not, feel free to ask the staff if they can get one in for you, or if there is one you may have missed. If the circuit breaker you are replacing is a GFCI (Ground Fault Circuit Interrupter) or AFCI (Arc Fault Circuit Interrupter) breaker, as sometimes used for outdoor, bedroom, garage, kitchen or bathroom circuits, be sure that you replace it with another one of the same type."
        },
        {
          "headline":"Clip the new circuit breaker in place.",
          "description":"Using the opposite motion to removing the faulty breaker, firmly clip your new circuit breaker into place. Position the end without a screw under the hook on the breaker box panel, and pivot the breaker down until it clicks into place securely."
        },
        {
          "headline":"Reattach the loose wire.",
          "description":"Firmly hold your circuit breaker and connect the wire to the loose screw. Keeping it in place, tighten the screw until it securely holds the wire. It may help to use a pair of needle-nose pliers to hold the wire in place as you tighten the screw. While the screw should be tight, you do not need to over-tighten it. Make sure it is secure, but don’t risk squeezing the wires to the point of damage. Make sure the rubber insulation on the wire does not touch the screw or the circuit breaker, as it may be damaged or melt over time."
        },
        {
          "headline":"Reattach the faceplate.",
          "description":"Carefully lift the faceplate in line with the breaker box and install it back in place. Using the same screws that came out of the faceplate, tightly secure the faceplate to the rest of the breaker box. Always use a screw of the same length and type when reattaching the faceplate. If the screws are too long or have a pointed end like wood screws, they may screw in too deep and damage the wiring."
        },
        {
          "headline":"Turn the power back on.",
          "description":"If you have a main breaker box, turn on the power to your branch breaker box first. Turn on the main power in the breaker box, followed by each circuit breaker one by one. You should start getting power back to your home."
        }
      ]
    }
  ],
  "text":" Investigating the Faulty Circuit Breaker Find the circuit breaker box. Some homes will have multiple breaker boxes in different places. Find both the main circuit breaker box and the one you need to replace a circuit breaker in. If you’re unsure about the circuit breaker boxes in your home, call an electrician. Inspect the exterior of the breaker panel for damage or discoloration. Before you begin working on any breaker boxes, you should make sure they are still in a safe condition. Any damage or contamination to the box may make it unsafe to work on. Look for any signs of rust, discoloration, charring or moisture when you first examine the circuit breaker box and throughout the process. If you see anything that seems dangerous or unexpected, call an electrician. Beware of certain types of panels, specifically those bearing one of the following names: Federal Pacific Electric, Federal Pioneer, Zinsco, Kearney, GTE Sylvania, or Stab-lok. The safety of these panels is highly debated. Research the issue and contact an experienced electrician for advice. Decide what to do based on the information you find. Use rubber-insulated tools, gloves, and shoes. Electricity can be incredibly dangerous to work around, so take all precautions when trying to reduce the chance of an electrical shock. Use rubber insulated tools, and wear rubber-soled shoes and insulated gloves when working with electricity. If you don’t have rubber-soled shoes or if you want to take further precautions, put down a rubber mat below the circuit breaker box. If the area around the breaker box is damp or otherwise unsafe, call an electrician. Locate the defective breaker. You should only replace a circuit breaker that has broken or been damaged in some way. If a circuit breaker is damaged, it will likely have tripped, cutting power to the section of the home it controls. Look through your breaker box for the circuit breaker which stands out from the others. Generally, a tripped circuit breaker switch will be halfway between the on and off positions. Test the faulty breaker. Before you replace a circuit breaker, make sure the breaker itself is faulty and not just overloaded. Unplug and switch off all light and electrical devices in the section of your home controlled by the circuit breaker. Then, turn the breaker switch completely off and back on again. Plug one device back in to see if it is powered to indicate if the breaker is allowing any power through or if it is completely broken. If the circuit is overloaded and that is causing the breaker to trip, it is working properly. You’ll likely need to reduce the power usage in that section of your home rather than replacing the breaker. If you think the breaker is tripping without being overloaded, it may be wearing out and have a reduced capacity for amperage. If you think this is the case, you should check the amperage of your circuit breaker. Test the voltage of the circuit breaker. If you want to test the circuit breaker more specifically, you can do so with a voltage tester. To do so, unscrew and remove the faceplate, and press one lead to the neutral wire in the breaker box. Press the other lead to the screw on the circuit breaker. The voltage tester should display how much power is being allowed through the breaker. Only touch the components you need to touch, and only with the leads on the voltage tester. The power will need to be on for this to work, so be very careful. Removing the Faulty Circuit Breaker Turn off all power and all individual breakers. Before doing any work on a circuit breaker or in the breaker box, make sure you have turned off all the power going to it. If you have a main box and other branch boxes around your home, turn off the power to the branch box at the main box first. Otherwise, just turn off the main power followed by all breakers. Even once you have turned the power off, you should act as if it’s still on. Only touch the parts of the circuit breaker box you need to touch. If you are turning off the main power, or the power to the area around you, the lights will likely turn off as well. Keep an alternative light source nearby so you don’t have to work in the dark. Unscrew and remove the faceplate. While the circuit breaker box will allow you to switch breakers on and off, this will not give you access to the entire circuit breaker. Find the screws in each corner of the breaker box and carefully remove them to free the faceplate. Holding the edges, lift the faceplate directly away from the breaker box before lowering it. Always remove the panel by pulling it towards you and then sliding it down. Don’t let it touch or bump anything inside the circuit breaker box as you are removing it. Put the screws and the faceplate somewhere you can easily find them when needed. While the screws can be replaced, it’s much easier to keep them in a safe place while they’re not attached to the breaker box. Inspect the interior of the panel for damage or discoloration. Before you touch anything inside the panel of the breaker box, look for signs of damage. If you see anything that seems unsafe or out of the ordinary, stop immediately and call a licensed electrician. Keep an eye out for any rust, moisture, signs of pests, loose wires, melting, discoloration, charring, heat marking, strange wiring, multiple wires connected to one screw, damaged wiring, debris, or multiple colored wires connected to each other. These can all be dangerous. Pull out the faulty breaker. When touching items inside the circuit breaker box, always be careful to only touch the components you need to. With a firm grip, grasp the defective circuit breaker. Start lifting the side that faces towards the center of the panel, with the aim of pivoting it up and out from the breaker panel. Once it is free, unhook it from the hinge on the edge of the panel and pull the breaker free. Disconnect the wire on the circuit breaker. The wire connected to the circuit breaker will be held in by a flathead screw on one side. Use a flat-head screwdriver to loosen this screw slightly, without unscrewing and removing it completely. Separate the wire from the circuit breaker once the screw is loose enough. Always keep track of loose wires, as they can be incredibly dangerous. Tuck the wire into the circuit breaker box to keep it out of the way. Make sure you know which wire you have disconnected, as you’ll need to reconnect it when you install a new circuit breaker. Note the exact amperage and type of the circuit breaker. The circuit breaker replacement will need to be the exact same type as the faulty one you remove. Take note of the amperage of the fault breaker, as well as any codes or numbers written elsewhere on it. Dispose of the faulty circuit breaker. While a circuit breaker may feel heavy, there is very little value to any of its components. You can throw circuit breakers away with your regular trash, as they are inert without a power supply. Installing a New Circuit Breaker Find a new circuit breaker of the same type as the faulty one. The new circuit breaker will need to be exactly the same type as the one you are replacing. Your local hardware store should have a selection of circuit breakers and may have the exact one you are looking for. If not, feel free to ask the staff if they can get one in for you, or if there is one you may have missed. If the circuit breaker you are replacing is a GFCI (Ground Fault Circuit Interrupter) or AFCI (Arc Fault Circuit Interrupter) breaker, as sometimes used for outdoor, bedroom, garage, kitchen or bathroom circuits, be sure that you replace it with another one of the same type. Clip the new circuit breaker in place. Using the opposite motion to removing the faulty breaker, firmly clip your new circuit breaker into place. Position the end without a screw under the hook on the breaker box panel, and pivot the breaker down until it clicks into place securely. Reattach the loose wire. Firmly hold your circuit breaker and connect the wire to the loose screw. Keeping it in place, tighten the screw until it securely holds the wire. It may help to use a pair of needle-nose pliers to hold the wire in place as you tighten the screw. While the screw should be tight, you do not need to over-tighten it. Make sure it is secure, but don’t risk squeezing the wires to the point of damage. Make sure the rubber insulation on the wire does not touch the screw or the circuit breaker, as it may be damaged or melt over time. Reattach the faceplate. Carefully lift the faceplate in line with the breaker box and install it back in place. Using the same screws that came out of the faceplate, tightly secure the faceplate to the rest of the breaker box. Always use a screw of the same length and type when reattaching the faceplate. If the screws are too long or have a pointed end like wood screws, they may screw in too deep and damage the wiring. Turn the power back on. If you have a main breaker box, turn on the power to your branch breaker box first. Turn on the main power in the breaker box, followed by each circuit breaker one by one. You should start getting power back to your home.",
  "sentences":[
    " Investigating the Faulty Circuit Breaker Find the circuit breaker box.",
    "Some homes will have multiple breaker boxes in different places.",
    "Find both the main circuit breaker box and the one you need to replace a circuit breaker in.",
    "If you’re unsure about the circuit breaker boxes in your home, call an electrician.",
    "Inspect the exterior of the breaker panel for damage or discoloration.",
    "Before you begin working on any breaker boxes, you should make sure they are still in a safe condition.",
    "Any damage or contamination to the box may make it unsafe to work on.",
    "Look for any signs of rust, discoloration, charring or moisture when you first examine the circuit breaker box and throughout the process.",
    "If you see anything that seems dangerous or unexpected, call an electrician.",
    "Beware of certain types of panels, specifically those bearing one of the following names: Federal Pacific Electric, Federal Pioneer, Zinsco, Kearney, GTE Sylvania, or Stab-lok.",
    "The safety of these panels is highly debated.",
    "Research the issue and contact an experienced electrician for advice.",
    "Decide what to do based on the information you find.",
    "Use rubber-insulated tools, gloves, and shoes.",
    "Electricity can be incredibly dangerous to work around, so take all precautions when trying to reduce the chance of an electrical shock.",
    "Use rubber insulated tools, and wear rubber-soled shoes and insulated gloves when working with electricity.",
    "If you don’t have rubber-soled shoes or if you want to take further precautions, put down a rubber mat below the circuit breaker box.",
    "If the area around the breaker box is damp or otherwise unsafe, call an electrician.",
    "Locate the defective breaker.",
    "You should only replace a circuit breaker that has broken or been damaged in some way.",
    "If a circuit breaker is damaged, it will likely have tripped, cutting power to the section of the home it controls.",
    "Look through your breaker box for the circuit breaker which stands out from the others.",
    "Generally, a tripped circuit breaker switch will be halfway between the on and off positions.",
    "Test the faulty breaker.",
    "Before you replace a circuit breaker, make sure the breaker itself is faulty and not just overloaded.",
    "Unplug and switch off all light and electrical devices in the section of your home controlled by the circuit breaker.",
    "Then, turn the breaker switch completely off and back on again.",
    "Plug one device back in to see if it is powered to indicate if the breaker is allowing any power through or if it is completely broken.",
    "If the circuit is overloaded and that is causing the breaker to trip, it is working properly.",
    "You’ll likely need to reduce the power usage in that section of your home rather than replacing the breaker.",
    "If you think the breaker is tripping without being overloaded, it may be wearing out and have a reduced capacity for amperage.",
    "If you think this is the case, you should check the amperage of your circuit breaker.",
    "Test the voltage of the circuit breaker.",
    "If you want to test the circuit breaker more specifically, you can do so with a voltage tester.",
    "To do so, unscrew and remove the faceplate, and press one lead to the neutral wire in the breaker box.",
    "Press the other lead to the screw on the circuit breaker.",
    "The voltage tester should display how much power is being allowed through the breaker.",
    "Only touch the components you need to touch, and only with the leads on the voltage tester.",
    "The power will need to be on for this to work, so be very careful.",
    "Removing the Faulty Circuit Breaker Turn off all power and all individual breakers.",
    "Before doing any work on a circuit breaker or in the breaker box, make sure you have turned off all the power going to it.",
    "If you have a main box and other branch boxes around your home, turn off the power to the branch box at the main box first.",
    "Otherwise, just turn off the main power followed by all breakers.",
    "Even once you have turned the power off, you should act as if it’s still on.",
    "Only touch the parts of the circuit breaker box you need to touch.",
    "If you are turning off the main power, or the power to the area around you, the lights will likely turn off as well.",
    "Keep an alternative light source nearby so you don’t have to work in the dark.",
    "Unscrew and remove the faceplate.",
    "While the circuit breaker box will allow you to switch breakers on and off, this will not give you access to the entire circuit breaker.",
    "Find the screws in each corner of the breaker box and carefully remove them to free the faceplate.",
    "Holding the edges, lift the faceplate directly away from the breaker box before lowering it.",
    "Always remove the panel by pulling it towards you and then sliding it down.",
    "Don’t let it touch or bump anything inside the circuit breaker box as you are removing it.",
    "Put the screws and the faceplate somewhere you can easily find them when needed.",
    "While the screws can be replaced, it’s much easier to keep them in a safe place while they’re not attached to the breaker box.",
    "Inspect the interior of the panel for damage or discoloration.",
    "Before you touch anything inside the panel of the breaker box, look for signs of damage.",
    "If you see anything that seems unsafe or out of the ordinary, stop immediately and call a licensed electrician.",
    "Keep an eye out for any rust, moisture, signs of pests, loose wires, melting, discoloration, charring, heat marking, strange wiring, multiple wires connected to one screw, damaged wiring, debris, or multiple colored wires connected to each other.",
    "These can all be dangerous.",
    "Pull out the faulty breaker.",
    "When touching items inside the circuit breaker box, always be careful to only touch the components you need to.",
    "With a firm grip, grasp the defective circuit breaker.",
    "Start lifting the side that faces towards the center of the panel, with the aim of pivoting it up and out from the breaker panel.",
    "Once it is free, unhook it from the hinge on the edge of the panel and pull the breaker free.",
    "Disconnect the wire on the circuit breaker.",
    "The wire connected to the circuit breaker will be held in by a flathead screw on one side.",
    "Use a flat-head screwdriver to loosen this screw slightly, without unscrewing and removing it completely.",
    "Separate the wire from the circuit breaker once the screw is loose enough.",
    "Always keep track of loose wires, as they can be incredibly dangerous.",
    "Tuck the wire into the circuit breaker box to keep it out of the way.",
    "Make sure you know which wire you have disconnected, as you’ll need to reconnect it when you install a new circuit breaker.",
    "Note the exact amperage and type of the circuit breaker.",
    "The circuit breaker replacement will need to be the exact same type as the faulty one you remove.",
    "Take note of the amperage of the fault breaker, as well as any codes or numbers written elsewhere on it.",
    "Dispose of the faulty circuit breaker.",
    "While a circuit breaker may feel heavy, there is very little value to any of its components.",
    "You can throw circuit breakers away with your regular trash, as they are inert without a power supply.",
    "Installing a New Circuit Breaker Find a new circuit breaker of the same type as the faulty one.",
    "The new circuit breaker will need to be exactly the same type as the one you are replacing.",
    "Your local hardware store should have a selection of circuit breakers and may have the exact one you are looking for.",
    "If not, feel free to ask the staff if they can get one in for you, or if there is one you may have missed.",
    "If the circuit breaker you are replacing is a GFCI (Ground Fault Circuit Interrupter) or AFCI (Arc Fault Circuit Interrupter) breaker, as sometimes used for outdoor, bedroom, garage, kitchen or bathroom circuits, be sure that you replace it with another one of the same type.",
    "Clip the new circuit breaker in place.",
    "Using the opposite motion to removing the faulty breaker, firmly clip your new circuit breaker into place.",
    "Position the end without a screw under the hook on the breaker box panel, and pivot the breaker down until it clicks into place securely.",
    "Reattach the loose wire.",
    "Firmly hold your circuit breaker and connect the wire to the loose screw.",
    "Keeping it in place, tighten the screw until it securely holds the wire.",
    "It may help to use a pair of needle-nose pliers to hold the wire in place as you tighten the screw.",
    "While the screw should be tight, you do not need to over-tighten it.",
    "Make sure it is secure, but don’t risk squeezing the wires to the point of damage.",
    "Make sure the rubber insulation on the wire does not touch the screw or the circuit breaker, as it may be damaged or melt over time.",
    "Reattach the faceplate.",
    "Carefully lift the faceplate in line with the breaker box and install it back in place.",
    "Using the same screws that came out of the faceplate, tightly secure the faceplate to the rest of the breaker box.",
    "Always use a screw of the same length and type when reattaching the faceplate.",
    "If the screws are too long or have a pointed end like wood screws, they may screw in too deep and damage the wiring.",
    "Turn the power back on.",
    "If you have a main breaker box, turn on the power to your branch breaker box first.",
    "Turn on the main power in the breaker box, followed by each circuit breaker one by one.",
    "You should start getting power back to your home."
  ],
  "tyn_section":[
    "Voltage sniffer",
    "Multimeter",
    "Lineman's gloves",
    "A rubber mat",
    "Insulated lineman's tools",
    "Rubber-soled shoes",
    "Safety glasses",
    "An observer",
    "Replacement circuit breaker",
    "Flashlight"
  ],
  "tyn_model":[
    "circuit breaker",
    "screws",
    "electrician",
    "circuit breaker box",
    "voltage tester",
    "electricity",
    "circuit breakers",
    "circuit breaker boxes",
    "rubber insulated tools",
    "rubber-soled shoes",
    "rubber mat",
    "breaker",
    "flat-head screwdriver",
    "fault breaker",
    "pliers",
    "breaker box",
    "screw"
  ],
  "simple_metrics":{
    "r":0.1,
    "p":0.0588235294,
    "f1":0.0740740741,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.3529411765,
    "f1":0.375
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.4705882353,
    "f1":0.4848484848
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3,
    "p":0.1764705882,
    "f1":0.2222222222
  }
}