{
  "title":"How to Paint Over Wallpaper",
  "url":"https://www.wikihow.com/Paint-Over-Wallpaper",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Interior Walls",
    "Wallpaper"
  ],
  "parts":[
    {
      "name":"Cleaning and Prepping the Wallpaper",
      "steps":[
        {
          "headline":"Practice basic safety.",
          "description":"You'll be working with chemicals when you clean a wall. To protect yourself, wear a mask or ventilator, safety goggles, old clothing, and thick gloves. You should also open doors and windows to keep the room ventilated."
        },
        {
          "headline":"Clean the entire surface thoroughly with TSP.",
          "description":"TSP stands for trisodium phosphate and is a cleaning agent that can effectively remove unwanted oils and chemicals from wallpaper, leaving a clean surface to paint on. Mix a half cup of TSP in two gallons of water. Wipe down your walls with the cleaning solution using a soft sponge or paintbrush. You can buy TSP at a hardware store or paint store."
        },
        {
          "headline":"Let the TSP dry.",
          "description":"It's important TSP dries completely before you proceed to the next steps. Drying times will vary depending on how much TSP you used and the temperature of your home. It's a good idea to wait at least 24 hours to let the TSP dry."
        },
        {
          "headline":"Rinse the wallpaper.",
          "description":"Once the wall is fully dry, wipe down the wall with a clean, wet rag. Keep wiping until all traces of TSP are removed. The rag you use should be wet, but not soaking. If you use too much water, you could damage your walls or wallpaper. Let the wall dry before proceeding."
        },
        {
          "headline":"Cover the seams with joint compound.",
          "description":"Unless you don’t mind the wallpaper seams showing through your new paint, you’ll need to cover them. Use a drywall knife to apply joint compound over the seams in a thin layer. Allow it to dry before sanding it down.You can find drywall knives and joint compound at your local hardware store."
        },
        {
          "headline":"Repair damage with spackle and adhesive.",
          "description":"Spackle and adhesive can be purchased at most hardware stores. Scan the wallpaper for holes and any places where the wallpaper is peeling. Seal the holes by filling them in with a layer of spackle and rub a layer of adhesive over peeling wallpaper to keep it in place. Use the tools that come with the spackle and adhesive to apply them to the wallpaper."
        },
        {
          "headline":"Sand any rough areas.",
          "description":"Primer and paint attach better to sanded areas. Run sanding blocks gently over the full surface of the wallpaper. Pay particular attention to areas like seams you applied joint compound to, areas you spackled, and any rougher patches of wallpaper."
        },
        {
          "headline":"Remove any lingering dust.",
          "description":"Wipe off all dust with a cloth after final sanding. Dust and grit will harm the final look of the wall if too much is left while painting."
        }
      ]
    },
    {
      "name":"Applying Sealer and Primer",
      "steps":[
        {
          "headline":"Opt for an oil-based combination primer/sealer.",
          "description":"A combination primer and sealer can be purchased at a hardware store. The combination primer/sealer prevents the wallpaper from peeling and also creates a surface that paint will stick to easily. When painting over wallpaper, go for an oil-based, rather than a water-based, primer/sealer."
        },
        {
          "headline":"Apply the primer/sealer to the wall.",
          "description":"Use a paint brush or paint roller to add a layer of primer/sealer to your wallpaper. Apply it the same way you would apply paint, and make sure to get into corners, nooks, and crannies. One even coat should be enough."
        },
        {
          "headline":"Give the wall plenty of time to dry.",
          "description":"You should not paint the wall until the primer is dry. Drying times will vary depending on the type of primer/sealer you used. You should be able to find an estimated drying time somewhere on the package. Some primer/sealers may take a few days to dry."
        }
      ]
    },
    {
      "name":"Applying Your Paint",
      "steps":[
        {
          "headline":"Mask areas where you do not want to paint.",
          "description":"Protect baseboards and window trims with masking or painter's tape before you start painting. Make sure that no spaces exist in these areas, as paint may bleed through, covering unwanted edges and corners."
        },
        {
          "headline":"Get into corners with a smaller brush.",
          "description":"Take a smaller, preferably angled brush to get into hard-to-reach areas first. Target areas like the corners, near the windows, and along the baseboards."
        },
        {
          "headline":"Apply the paint using an \"M\" pattern.",
          "description":"Use a paint roller to roll on paint in the shape of an \"M.\" Then, make another \"M\" that overlaps the first. Continue this pattern of painting in \"M\" shapes until the wall is fully coated in paint."
        },
        {
          "headline":"Let the first coat dry.",
          "description":"Paint may take up to a few days to dry. You should let it dry completely before applying a second coat. Your paint can usually indicates an approximate drying time."
        },
        {
          "headline":"Apply another coat, if needed.",
          "description":"Usually, applying two coats of paint yields better results. If your paint is not as dark as you want, or if some wallpaper can be seen through the paint, apply a second coat."
        },
        {
          "headline":"Remove the painter's tape from the wall and inspect your work.",
          "description":"Once the paint is dry, peel off the painter's tape. If you notice any patchy areas, or if you missed any spots, you can spot treat these with additional paint."
        }
      ]
    }
  ],
  "text":" Cleaning and Prepping the Wallpaper Practice basic safety. You'll be working with chemicals when you clean a wall. To protect yourself, wear a mask or ventilator, safety goggles, old clothing, and thick gloves. You should also open doors and windows to keep the room ventilated. Clean the entire surface thoroughly with TSP. TSP stands for trisodium phosphate and is a cleaning agent that can effectively remove unwanted oils and chemicals from wallpaper, leaving a clean surface to paint on. Mix a half cup of TSP in two gallons of water. Wipe down your walls with the cleaning solution using a soft sponge or paintbrush. You can buy TSP at a hardware store or paint store. Let the TSP dry. It's important TSP dries completely before you proceed to the next steps. Drying times will vary depending on how much TSP you used and the temperature of your home. It's a good idea to wait at least 24 hours to let the TSP dry. Rinse the wallpaper. Once the wall is fully dry, wipe down the wall with a clean, wet rag. Keep wiping until all traces of TSP are removed. The rag you use should be wet, but not soaking. If you use too much water, you could damage your walls or wallpaper. Let the wall dry before proceeding. Cover the seams with joint compound. Unless you don’t mind the wallpaper seams showing through your new paint, you’ll need to cover them. Use a drywall knife to apply joint compound over the seams in a thin layer. Allow it to dry before sanding it down.You can find drywall knives and joint compound at your local hardware store. Repair damage with spackle and adhesive. Spackle and adhesive can be purchased at most hardware stores. Scan the wallpaper for holes and any places where the wallpaper is peeling. Seal the holes by filling them in with a layer of spackle and rub a layer of adhesive over peeling wallpaper to keep it in place. Use the tools that come with the spackle and adhesive to apply them to the wallpaper. Sand any rough areas. Primer and paint attach better to sanded areas. Run sanding blocks gently over the full surface of the wallpaper. Pay particular attention to areas like seams you applied joint compound to, areas you spackled, and any rougher patches of wallpaper. Remove any lingering dust. Wipe off all dust with a cloth after final sanding. Dust and grit will harm the final look of the wall if too much is left while painting. Applying Sealer and Primer Opt for an oil-based combination primer/sealer. A combination primer and sealer can be purchased at a hardware store. The combination primer/sealer prevents the wallpaper from peeling and also creates a surface that paint will stick to easily. When painting over wallpaper, go for an oil-based, rather than a water-based, primer/sealer. Apply the primer/sealer to the wall. Use a paint brush or paint roller to add a layer of primer/sealer to your wallpaper. Apply it the same way you would apply paint, and make sure to get into corners, nooks, and crannies. One even coat should be enough. Give the wall plenty of time to dry. You should not paint the wall until the primer is dry. Drying times will vary depending on the type of primer/sealer you used. You should be able to find an estimated drying time somewhere on the package. Some primer/sealers may take a few days to dry. Applying Your Paint Mask areas where you do not want to paint. Protect baseboards and window trims with masking or painter's tape before you start painting. Make sure that no spaces exist in these areas, as paint may bleed through, covering unwanted edges and corners. Get into corners with a smaller brush. Take a smaller, preferably angled brush to get into hard-to-reach areas first. Target areas like the corners, near the windows, and along the baseboards. Apply the paint using an \"M\" pattern. Use a paint roller to roll on paint in the shape of an \"M.\" Then, make another \"M\" that overlaps the first. Continue this pattern of painting in \"M\" shapes until the wall is fully coated in paint. Let the first coat dry. Paint may take up to a few days to dry. You should let it dry completely before applying a second coat. Your paint can usually indicates an approximate drying time. Apply another coat, if needed. Usually, applying two coats of paint yields better results. If your paint is not as dark as you want, or if some wallpaper can be seen through the paint, apply a second coat. Remove the painter's tape from the wall and inspect your work. Once the paint is dry, peel off the painter's tape. If you notice any patchy areas, or if you missed any spots, you can spot treat these with additional paint.",
  "sentences":[
    " Cleaning and Prepping the Wallpaper Practice basic safety.",
    "You'll be working with chemicals when you clean a wall.",
    "To protect yourself, wear a mask or ventilator, safety goggles, old clothing, and thick gloves.",
    "You should also open doors and windows to keep the room ventilated.",
    "Clean the entire surface thoroughly with TSP.",
    "TSP stands for trisodium phosphate and is a cleaning agent that can effectively remove unwanted oils and chemicals from wallpaper, leaving a clean surface to paint on.",
    "Mix a half cup of TSP in two gallons of water.",
    "Wipe down your walls with the cleaning solution using a soft sponge or paintbrush.",
    "You can buy TSP at a hardware store or paint store.",
    "Let the TSP dry.",
    "It's important TSP dries completely before you proceed to the next steps.",
    "Drying times will vary depending on how much TSP you used and the temperature of your home.",
    "It's a good idea to wait at least 24 hours to let the TSP dry.",
    "Rinse the wallpaper.",
    "Once the wall is fully dry, wipe down the wall with a clean, wet rag.",
    "Keep wiping until all traces of TSP are removed.",
    "The rag you use should be wet, but not soaking.",
    "If you use too much water, you could damage your walls or wallpaper.",
    "Let the wall dry before proceeding.",
    "Cover the seams with joint compound.",
    "Unless you don’t mind the wallpaper seams showing through your new paint, you’ll need to cover them.",
    "Use a drywall knife to apply joint compound over the seams in a thin layer.",
    "Allow it to dry before sanding it down.You can find drywall knives and joint compound at your local hardware store.",
    "Repair damage with spackle and adhesive.",
    "Spackle and adhesive can be purchased at most hardware stores.",
    "Scan the wallpaper for holes and any places where the wallpaper is peeling.",
    "Seal the holes by filling them in with a layer of spackle and rub a layer of adhesive over peeling wallpaper to keep it in place.",
    "Use the tools that come with the spackle and adhesive to apply them to the wallpaper.",
    "Sand any rough areas.",
    "Primer and paint attach better to sanded areas.",
    "Run sanding blocks gently over the full surface of the wallpaper.",
    "Pay particular attention to areas like seams you applied joint compound to, areas you spackled, and any rougher patches of wallpaper.",
    "Remove any lingering dust.",
    "Wipe off all dust with a cloth after final sanding.",
    "Dust and grit will harm the final look of the wall if too much is left while painting.",
    "Applying Sealer and Primer Opt for an oil-based combination primer/sealer.",
    "A combination primer and sealer can be purchased at a hardware store.",
    "The combination primer/sealer prevents the wallpaper from peeling and also creates a surface that paint will stick to easily.",
    "When painting over wallpaper, go for an oil-based, rather than a water-based, primer/sealer.",
    "Apply the primer/sealer to the wall.",
    "Use a paint brush or paint roller to add a layer of primer/sealer to your wallpaper.",
    "Apply it the same way you would apply paint, and make sure to get into corners, nooks, and crannies.",
    "One even coat should be enough.",
    "Give the wall plenty of time to dry.",
    "You should not paint the wall until the primer is dry.",
    "Drying times will vary depending on the type of primer/sealer you used.",
    "You should be able to find an estimated drying time somewhere on the package.",
    "Some primer/sealers may take a few days to dry.",
    "Applying Your Paint Mask areas where you do not want to paint.",
    "Protect baseboards and window trims with masking or painter's tape before you start painting.",
    "Make sure that no spaces exist in these areas, as paint may bleed through, covering unwanted edges and corners.",
    "Get into corners with a smaller brush.",
    "Take a smaller, preferably angled brush to get into hard-to-reach areas first.",
    "Target areas like the corners, near the windows, and along the baseboards.",
    "Apply the paint using an \"M\" pattern.",
    "Use a paint roller to roll on paint in the shape of an \"M.\" Then, make another \"M\" that overlaps the first.",
    "Continue this pattern of painting in \"M\" shapes until the wall is fully coated in paint.",
    "Let the first coat dry.",
    "Paint may take up to a few days to dry.",
    "You should let it dry completely before applying a second coat.",
    "Your paint can usually indicates an approximate drying time.",
    "Apply another coat, if needed.",
    "Usually, applying two coats of paint yields better results.",
    "If your paint is not as dark as you want, or if some wallpaper can be seen through the paint, apply a second coat.",
    "Remove the painter's tape from the wall and inspect your work.",
    "Once the paint is dry, peel off the painter's tape.",
    "If you notice any patchy areas, or if you missed any spots, you can spot treat these with additional paint."
  ],
  "tyn_section":[
    "Mask or ventilator",
    "Safety goggles",
    "Gloves",
    "Trisodium phosphate (TSP)",
    "Rags/cloths",
    "Joint compound",
    "Drywall knife",
    "Spackle",
    "Adhesive/wallpaper paste",
    "Sandpaper/sanding blocks",
    "Primer/sealer combination (oil-based)",
    "Masking tape",
    "Paintbrushes",
    "Paint roller",
    "Interior wall paint"
  ],
  "tyn_model":[
    "paint",
    "primer",
    "wallpaper",
    "spackle",
    "joint compound",
    "adhesive",
    "sealer",
    "painter's tape",
    "water",
    "rag",
    "paint roller",
    "trisodium phosphate",
    "tsp",
    "drywall knife",
    "drywall knives",
    "sanding blocks",
    "cloth",
    "grit",
    "paint brush",
    "sealers"
  ],
  "simple_metrics":{
    "r":0.2666666667,
    "p":0.2,
    "f1":0.2285714286,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.3,
    "f1":0.3157894737
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5333333333,
    "p":0.5,
    "f1":0.5161290323
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857
  }
}