{
  "title":"How to Store Lemons",
  "url":"https://www.wikihow.com/Store-Lemons",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Storing Whole Lemons",
      "steps":[
        {
          "headline":"Store lemons for immediate use.",
          "description":"If you plan to use the lemons within a few days of purchase, store them away from direct sunlight. They typically stay fresh for about one week at room temperature. After this point, they start to wrinkle, lose their vibrant color, and develop soft or hard patches."
        },
        {
          "headline":"Store extra lemons sealed in the refrigerator.",
          "description":"Place the lemons in zip-locked bags, squeezing out as much air as you can. In this state, the lemons may retain most of their juice and flavor for as long as four weeks. The ideal temperature for storing ripe (yellow) lemons is between 4º and 10ºC (39–50ºF). For most refrigerators, the middle shelves or door shelves are around this temperature."
        }
      ]
    },
    {
      "name":"Storing Cut Lemons",
      "steps":[
        {
          "headline":"Cover the cut side of the lemon.",
          "description":"Reduce water loss and oxidization by protecting the cut side from air. Here are a few ways to do this:\nPlace lemon halves cut-side-down on a small plate. Wrap wedges or slices in plastic wrap. Place the cut lemons in the smallest airtight container you can find."
        },
        {
          "headline":"Refrigerate.",
          "description":"Although they last longer than most other cut fruit, lemons are still best within 2–3 days of cutting."
        },
        {
          "headline":"Freeze slices to add to drinks.",
          "description":"Freeze the slices on a baking sheet lined with parchment paper, spaced out so they don't touch each other. Once frozen, toss them all in a sealed plastic bag and store in the freezer indefinitely. Freezing lemons (or any food items) on a baking sheet prevents them sticking to each other as ice forms. Like most fruit, lemons become mushy when frozen. The frozen slices are best added to cold drinks directly from the freezer, while they're still hard."
        }
      ]
    },
    {
      "name":"Storing Juice and Zest",
      "steps":[
        {
          "headline":"Refrigerate lemon juice.",
          "description":"Despite its acidity, lemon juice can harbor bacteria if kept at room temperature. After about 2–4 days in the refrigerator, the juice will start to lose its taste. Throw it out once it looks dull and dark or loses most of its taste, usually about 7–10 days. Do not store lemon juice in transparent bottles, since light will break down the juice more quickly. Store-bought bottled lemon juice typically contains preservatives, which increase its shelf life to several months."
        },
        {
          "headline":"Freeze leftover juice in ice cube trays.",
          "description":"This is the easiest way to freeze excess juice. Once frozen, transfer to a sealed plastic bag in the freezer. Alternatively, can the lemon juice instead."
        },
        {
          "headline":"Store zest in an airtight container.",
          "description":"Once you've zested the lemon, move the zest to an airtight glass container. Store in a cool, dry location. Freshly grated zest loses flavor fast, and may become a bacterial risk after just 2–3 days."
        },
        {
          "headline":"Freeze leftover zest.",
          "description":"If you have a great deal of zest, space small, tightly packed spoonfuls on a baking sheet lined with parchment paper. Freeze, then transfer to a freezer-safe container."
        }
      ]
    }
  ],
  "text":" Storing Whole Lemons Store lemons for immediate use. If you plan to use the lemons within a few days of purchase, store them away from direct sunlight. They typically stay fresh for about one week at room temperature. After this point, they start to wrinkle, lose their vibrant color, and develop soft or hard patches. Store extra lemons sealed in the refrigerator. Place the lemons in zip-locked bags, squeezing out as much air as you can. In this state, the lemons may retain most of their juice and flavor for as long as four weeks. The ideal temperature for storing ripe (yellow) lemons is between 4º and 10ºC (39–50ºF). For most refrigerators, the middle shelves or door shelves are around this temperature. Storing Cut Lemons Cover the cut side of the lemon. Reduce water loss and oxidization by protecting the cut side from air. Here are a few ways to do this:\nPlace lemon halves cut-side-down on a small plate. Wrap wedges or slices in plastic wrap. Place the cut lemons in the smallest airtight container you can find. Refrigerate. Although they last longer than most other cut fruit, lemons are still best within 2–3 days of cutting. Freeze slices to add to drinks. Freeze the slices on a baking sheet lined with parchment paper, spaced out so they don't touch each other. Once frozen, toss them all in a sealed plastic bag and store in the freezer indefinitely. Freezing lemons (or any food items) on a baking sheet prevents them sticking to each other as ice forms. Like most fruit, lemons become mushy when frozen. The frozen slices are best added to cold drinks directly from the freezer, while they're still hard. Storing Juice and Zest Refrigerate lemon juice. Despite its acidity, lemon juice can harbor bacteria if kept at room temperature. After about 2–4 days in the refrigerator, the juice will start to lose its taste. Throw it out once it looks dull and dark or loses most of its taste, usually about 7–10 days. Do not store lemon juice in transparent bottles, since light will break down the juice more quickly. Store-bought bottled lemon juice typically contains preservatives, which increase its shelf life to several months. Freeze leftover juice in ice cube trays. This is the easiest way to freeze excess juice. Once frozen, transfer to a sealed plastic bag in the freezer. Alternatively, can the lemon juice instead. Store zest in an airtight container. Once you've zested the lemon, move the zest to an airtight glass container. Store in a cool, dry location. Freshly grated zest loses flavor fast, and may become a bacterial risk after just 2–3 days. Freeze leftover zest. If you have a great deal of zest, space small, tightly packed spoonfuls on a baking sheet lined with parchment paper. Freeze, then transfer to a freezer-safe container.",
  "sentences":[
    " Storing Whole Lemons Store lemons for immediate use.",
    "If you plan to use the lemons within a few days of purchase, store them away from direct sunlight.",
    "They typically stay fresh for about one week at room temperature.",
    "After this point, they start to wrinkle, lose their vibrant color, and develop soft or hard patches.",
    "Store extra lemons sealed in the refrigerator.",
    "Place the lemons in zip-locked bags, squeezing out as much air as you can.",
    "In this state, the lemons may retain most of their juice and flavor for as long as four weeks.",
    "The ideal temperature for storing ripe (yellow) lemons is between 4º and 10ºC (39–50ºF).",
    "For most refrigerators, the middle shelves or door shelves are around this temperature.",
    "Storing Cut Lemons Cover the cut side of the lemon.",
    "Reduce water loss and oxidization by protecting the cut side from air.",
    "Here are a few ways to do this:\nPlace lemon halves cut-side-down on a small plate.",
    "Wrap wedges or slices in plastic wrap.",
    "Place the cut lemons in the smallest airtight container you can find.",
    "Refrigerate.",
    "Although they last longer than most other cut fruit, lemons are still best within 2–3 days of cutting.",
    "Freeze slices to add to drinks.",
    "Freeze the slices on a baking sheet lined with parchment paper, spaced out so they don't touch each other.",
    "Once frozen, toss them all in a sealed plastic bag and store in the freezer indefinitely.",
    "Freezing lemons (or any food items) on a baking sheet prevents them sticking to each other as ice forms.",
    "Like most fruit, lemons become mushy when frozen.",
    "The frozen slices are best added to cold drinks directly from the freezer, while they're still hard.",
    "Storing Juice and Zest Refrigerate lemon juice.",
    "Despite its acidity, lemon juice can harbor bacteria if kept at room temperature.",
    "After about 2–4 days in the refrigerator, the juice will start to lose its taste.",
    "Throw it out once it looks dull and dark or loses most of its taste, usually about 7–10 days.",
    "Do not store lemon juice in transparent bottles, since light will break down the juice more quickly.",
    "Store-bought bottled lemon juice typically contains preservatives, which increase its shelf life to several months.",
    "Freeze leftover juice in ice cube trays.",
    "This is the easiest way to freeze excess juice.",
    "Once frozen, transfer to a sealed plastic bag in the freezer.",
    "Alternatively, can the lemon juice instead.",
    "Store zest in an airtight container.",
    "Once you've zested the lemon, move the zest to an airtight glass container.",
    "Store in a cool, dry location.",
    "Freshly grated zest loses flavor fast, and may become a bacterial risk after just 2–3 days.",
    "Freeze leftover zest.",
    "If you have a great deal of zest, space small, tightly packed spoonfuls on a baking sheet lined with parchment paper.",
    "Freeze, then transfer to a freezer-safe container."
  ],
  "tyn_section":[
    "Zip tight plastic bags",
    "Refrigerator",
    "Freezer"
  ],
  "tyn_model":[
    "lemons",
    "lemon",
    "baking sheet",
    "refrigerator",
    "airtight container",
    "parchment paper",
    "sealed plastic bag",
    "freezer",
    "lemon juice",
    "water",
    "small plate",
    "plastic wrap",
    "ice cube trays",
    "airtight glass container",
    "freezer-safe container"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222
  }
}