{
  "title":"How to Make a Trophy",
  "url":"https://www.wikihow.com/Make-a-Trophy",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects"
  ],
  "methods":[
    {
      "name":"Making a Plastic Bottle Trophy",
      "steps":[
        {
          "headline":"Get a clean, empty plastic bottle.",
          "description":"A bottle with a plain top and sides will work the best, but you can use other types too if you don't mind the molded designs. For the most realistic trophy though, you should use a 1.5 to 2-liter (50.7 to 67.6-fl oz) soda bottle. Make sure that the bottle is empty and clean. If it's dirty, fill it with water, then add a pump of dish soap. Close the bottle, shake it, then pour the water out. Make sure that you remove the label as well. If there is any residue, use a goo-removal product to get it off, such as Goo Gone."
        },
        {
          "headline":"Use a craft blade to cut the top, domed part off of the bottle.",
          "description":"Plastic bottles have a dome on the top that eventually straightens out to become the sides. You need to cut around the bottle just before the domed part starts to straighten out. If the cut part turns out jagged, trim it down with scissors to make it nice and smooth. Some plastic bottles have a molded line just under the dome. Use this as a guide."
        },
        {
          "headline":"Cut the bottom off of the bottle to create the base.",
          "description":"Find the molded line near the bottom of your bottle, then cut along it with a craft blade. If there is no molded line, measure up 2 to 3 inches (5.1 to 7.6 cm) from the bottom of the bottle, then draw a line around it. Use this line as a cutting guide. If you prefer, you can use a small, plastic tub for the base instead. Choose something that is 2 to 3 inches (5.1 to 7.6 cm) tall, and a little wider than your bottle. Cut it shorter if it's too tall."
        },
        {
          "headline":"Slice the middle segment of the bottle open.",
          "description":"You should now have 3 separate pieces: a top, middle, and bottom. Take the middle, cylindrical part of the bottle, and cut straight down the side, from top to bottom. This will eventually make the stem. It should be long enough to fit the width of your hand. If the stem is too long, trim the top or bottom edge until it is the right length."
        },
        {
          "headline":"Overlap and glue the cut edges to make a smaller tube.",
          "description":"Take your middle segment and let it roll back into its original cylindrical shape. Gently squeeze it in your hand until the cut, vertical edges overlap and form a narrower tube. Glue these edges together to help the tube keep its shape. How narrow you make the tube is up to you. It should be wide enough to fit the neck of your bottle, however. This is typically a little over 1 inch (2.5 cm). Super glue will work the best for this, but you can use hot glue instead."
        },
        {
          "headline":"Glue the tube to the bottom of the base.",
          "description":"Take the bottom half of your bottle and flip it over so that the cut edge is touching the table and the underside is facing up. Cover the bottom edge of your tube with hot glue, then press it against the middle of the base. Hot glue sets up fast, but you still should hold the tube while the glue dries. For a stronger bond, use an industrial-strength glue, such as E6000."
        },
        {
          "headline":"Turn the top of the bottle upside-down, then hot glue it to the tube.",
          "description":"Cover the top edge of your tube with hot glue. Working quickly, before the glue sets, flip the domed bottle top upside down, then slide the neck into the tube. Keep sliding the neck into the tube until the domed part of the bottle touches the tube. You can take the cap off first, or you can leave it on. If you take it off, however, you can use this trophy as a pencil holder! You can use industrial-strength glue for this step too. Be sure to let the trophy dry overnight, however."
        },
        {
          "headline":"Paint the trophy your desired colors.",
          "description":"You can use spray paint for this or regular acrylic craft paint. Most trophies are gold or silver, but you can make yours any color you want. Apply 1 coat of paint first, wait 10 to 20 minutes for it to dry, then apply a second coat and let it dry too. Apply acrylic craft paint with synthetic taklon brushes. Avoid bristle brushes (too coarse) and camelhair brushes (too soft). If you are using spray paint, be sure to work in a well-ventilated area. Apply the paint from 6 to 8 inches (15 to 20 cm) away. If you want a more elaborate trophy, consider painting some words or designs onto it, such as \"#1\" or \"Champion!\" Alternatively, draw your designs with hot glue before you paint the trophy. This will give you nice, raised designs."
        }
      ]
    },
    {
      "name":"Making a Paper Cup Trophy",
      "steps":[
        {
          "headline":"Paint 2 paper cups gold or silver, then let them dry.",
          "description":"Find 2 identical paper cups, then paint them gold, silver, or whatever color you want your trophy to be. Acrylic craft paint will work the best for this, but you can use spray paint too. Apply 1 coat of paint first, wait for it to dry (about 10 to 20 minutes), then apply a second coat. Let the second coat dry too. The exact size of the paper cups does not matter, as long as they are both the same size. Apply acrylic craft paint with a synthetic taklon paintbrush. Don't use a bristle brush (too coarse) or a camelhair brush (too soft). Hold the cup from the inside while you paint it. If you want to use spray paint, set the cups down in a well-ventilated area. Apply the paint from 6 to 8 inches (15 to 20 cm) away. Work on the next step while the paint is drying to save time."
        },
        {
          "headline":"Fold a sheet of paper in half and cut out a C-shape to get 2 handles.",
          "description":"Take a sheet of paper and fold it in half. Draw a bold C-shape along the folded edge, then cut it out. Unfold the shape, then cut it apart along the crease to get 2 identical handles. Cardstock will work the best because it is nice and stiff, but you can use regular printer paper or construction paper too. The handles should be the same size as 1 of your cups, or just a little bit shorter."
        },
        {
          "headline":"Paint the handles the same color as the cups and let them dry.",
          "description":"Because paper is so absorbent, you'll probably only need a single coat of paint for this. Set the handles down on a larger sheet of scrap paper, then apply your paint. Let the paint dry, then flip the handles over and paint the back. Let the back dry as well. You don't want to use too much paint for this step, or the paper will turn soggy and warp. Alternatively, you can color the handles with a gold or silver marker. It won't be the exact same color as the cups, but it will be close enough. Do the next step while the paint is drying."
        },
        {
          "headline":"Glue the bottoms of the cups together.",
          "description":"Turn 1 of the cups upside-down, then cover the bottom edge with hot glue. Turn the other cup right-side-up, and press the bottom against the glue. Wait a a few minutes for the glue to set. If you don't have hot glue, you can try tacky glue, but it will take much longer to dry. Alternatively, you can place the bottoms of the cups together, then wrap a piece of double-sided tape around the seam. This will allow you to stick on sequins!"
        },
        {
          "headline":"Fold the ends of the handles, then secure them to the trophy.",
          "description":"Fold the top and bottom ends of each handle by about ⁄2 inch (1.3 cm) to create a tab. Add a strip of double-sided tape to each tab, then press the handles against the cup. If you don't have double-sided tape, you can use hot glue or tacky glue. Use the glue sparingly so as not to create bumps or bulges."
        },
        {
          "headline":"Decorate the trophy as desired.",
          "description":"Glue some rhinestones or sequins to the seam between the 2 cups. Hot glue will work the best because it dries fast, but you can use tacky glue instead. For a more traditional trophy, you could write something on it. If you wrapped double-sided tape around the middle of the trophy, stick some sequins to the tape. Don't use rhinestones; they are too heavy and will fall off. If you want to write something on your trophy, try something like: #1, Winner! Champion, or World's Greatest!"
        },
        {
          "headline":"Add a ribbon to each handle, if desired.",
          "description":"Cut 2 lengths of ribbon, each about 6 inches (15 cm) long. Next, but V-shaped notches into the ends of each ribbon. Take 1 ribbon and thread it through the left handle. Fold the ends of the ribbon down, then glue them to the bottom of the handle. Do the same thing for the second ribbon and right handle. Hot glue will work the best. If you want to use tacky glue, you'll have to pin the ribbons in place with a clothespin until the glue dries. You can also try double-sided tape. If the ribbon is fraying too much, you can singe the cut ends with a flame. If you are a child, ask an adult to help you. Satin ribbon about ⁄2 to 1 inch (1.3 to 2.5 cm) wide will work the best. Red or blue are traditional colors, but you can pick any color you want."
        }
      ]
    },
    {
      "name":"Using Figurines",
      "steps":[
        {
          "headline":"Find a tall, slender item to use as a base.",
          "description":"Plastic champagne, margarita, and wine glasses work especially well for this. You can also use a wide-mouthed glass bottle, such as a milk bottle. Don't use a tall, skinny bottle with a narrow mouth, or it won't be stable enough. Another option is to use a wood or metal candlestick. Avoid glass, as that is difficult to paint."
        },
        {
          "headline":"Find a plastic figurine or a small item to place on top of your base.",
          "description":"Think about the occasion you are giving the trophy for, then find a suitable figurine. For example, for a fishing competition, you could use a fish. The figurine should be a little larger than the circumference of your base. You can find plastic animal (and many other non-animal) figurines in toy stores, dollar stores, and craft stores. For a Lombardi trophy, use a mini (American) football. You can find these in dollar stores or impulse-buy bins."
        },
        {
          "headline":"Hot glue your figurine to the base.",
          "description":"Draw a swirl of hot glue against the bottom of your item, then press it against your base. Wait 1 to 2 minutes for the glue to set. For a stronger bond, use industrial-strength glue, such as E6000, instead. Secure the item to the base with painter's tape while the glue sets overnight, then remove the tape. If you are using a plastic glass, flip the glass over and hot glue the figurine to the bottom. If you are using a candlestick or a bottle, hot glue the figuring to the top. Don't flip the candlestick or bottle over. For a Lombardi trophy, glue the (American) football at an angle, so that 1 point is lower than the other."
        },
        {
          "headline":"Decorate the base with hot glue, if desired.",
          "description":"Write your desired message with a permanent marker first, then trace over it with a hot glue gun. You don't have to do this, but it's a great way to personalize your trophy. When you paint the trophy, the hot glue will create a raised design! For a Lombardi trophy, you could write the number 49 in Roman numerals (XLIX). For a traditional trophy, you could write \"#1\" or \"Winner!\" For a personalized trophy, try \"Best Mom!\" or \"#1 Dad!\""
        },
        {
          "headline":"Spray paint the trophy gold or silver.",
          "description":"Take the trophy into a well-ventilated area, then shake up a can of silver or gold spray paint. Spray the paint on from 6 to 8 inches (15 to 20 cm) away, then let the paint dry for 15 to 20 minutes. Apply a second coat if the first one is too thin, then let the paint dry completely. For a nicer finish, you can apply a spray paint primer first. You apply it just like regular spray paint, and you only need 1 coat. Gold is traditionally used for first place while silver is used for second place. For a Lombardi trophy, use silver."
        }
      ]
    },
    {
      "name":"Using Cardboard",
      "steps":[
        {
          "headline":"Print out an outline of a trophy.",
          "description":"Go online and find a picture of a trophy outline. You can use search terms such as \"trophy clip art\" or \"trophy outline.\" You can also use a page from a coloring book. Be sure to print the trophy out on regular printer paper. The trophy needs to be the same size you want your final trophy to be. If you need to, use an image editing program, such as Photoshop or Microsoft Paint, to make it bigger. You will be using graphite on the back of the paper to trace it onto the cardboard. If you don't want to do that, print the trophy out on cardstock to use as a stencil instead."
        },
        {
          "headline":"Cover the back of the paper with graphite.",
          "description":"Flip the paper over so that you can see the back. Next, cover the back of the paper with graphite. If the paper is thin enough so that you can see the trophy through it, then simply go over the outlines with a ⁄2 in (1.3 cm) wide graphite outline. Otherwise, cover the entire page with graphite. A graphite stick will work the best for this, but a pencil will work as well. Press hard enough to make the graphite shiny. If you printed the trophy out on cardstock, cut the trophy out instead. Cut the main shape out with scissors or a craft blade, then use a craft blade to cut the details, like the handle holes."
        },
        {
          "headline":"Trace the trophy onto a piece of cardboard.",
          "description":"Place the paper graphite-side-down onto a sheet of cardboard. Tape the corners down, then trace over the outlines. Press hard so that the graphite on the back of the paper sticks to the cardboard. If you made a stencil, simply place the stencil on top of the cardboard, then trace around it with a pen or pencil."
        },
        {
          "headline":"Cut the traced trophy out with a craft blade.",
          "description":"Peel the tape off, then put the paper away. You should see a faint outline of your trophy on the cardboard. Cut along these traced lines with a craft blade. If the lines are too light for you to see clearly, trace over them with a pen or pencil to make them darker. Be sure to work on top of a cutting mat so that you don't ruin your table. If you are a child, ask an adult to help you with this step."
        },
        {
          "headline":"Measure the length of the base, then cut a semicircle based on that length.",
          "description":"Place a ruler against the bottom edge of your trophy and note the measurement. Cut a semicircle out of cardboard based on that measurement; it needs to have the same length and height. Use a compass to trace a full circle, then draw a line across the middle to divide it. Cut it out with a craft blade. You can also cut a square base if you prefer."
        },
        {
          "headline":"Cut a slit into the middle of the semicircle and base of the trophy.",
          "description":"Measure the height of your semicircle first, then divide it by 2. This will be the length of your slits. Find the middle of the trophy's bottom edge, then cut a vertical slit based on your measurement. Find the middle of the top of your semicircle, and cut another slit as well. The top of your semicircle is the curved part. The bottom is the straight part. Don't assemble the pieces just yet. You need to paint and decorate them first!"
        },
        {
          "headline":"Paint the trophy and base your desired color.",
          "description":"Gold and silver are the most popular trophy colors, but you can make yours any color you want. Apply 1 coat of acrylic craft paint with a synthetic taklon brush, then let it dry, about 10 to 20 minutes. Apply a second coat of paint, and let it dry too. You only need to paint the front of the trophy, but you need to paint both sides of the semicircle. You can use spray paint too, but be sure to work in a well-ventilated area. Apply the spray paint from 6 to 8 inches (15 to 20 cm) away. Because cardboard is absorbent, you'll probably only need a single coat."
        },
        {
          "headline":"Slide the semicircle base into the bottom of the trophy.",
          "description":"Hold the semicircle base under the bottom edge of the trophy, with the slit facing up. Turn the base so that it is perpendicular to the trophy; if you were to look down at it from the top, you'd see a +. Slide the base and trophy together through the slits. The bottom straight edge of the semicircle needs to be flush with the bottom edge of the trophy. If they aren't even, take the base out and make the slit deeper. If the semicircle base wobbles too much, apply some hot glue to the seams to stabilize it. Let the glue set, then paint over it so that it matches the rest of the trophy."
        },
        {
          "headline":"Decorate the trophy with paint, markers, or other embellishments.",
          "description":"You're only limited by your creativity and your materials in this step. Decide what sort of occasion the trophy is for, then decorate it accordingly. Here are some ideas for you:\nWrite \"#1\" or \"Winner!\" on the trophy with a black marker. Turn the trophy into a picture frame by cutting out a square or rectangle, then gluing a photo behind it. Draw designs over the trophy with hot glue, then paint over them using extra paint. This will give you a 3D look. Hot glue beads, buttons, or rhinestones to the trophy. Leave them as they are, or paint them to match the trophy."
        }
      ]
    }
  ],
  "text":" Making a Plastic Bottle Trophy Get a clean, empty plastic bottle. A bottle with a plain top and sides will work the best, but you can use other types too if you don't mind the molded designs. For the most realistic trophy though, you should use a 1.5 to 2-liter (50.7 to 67.6-fl oz) soda bottle. Make sure that the bottle is empty and clean. If it's dirty, fill it with water, then add a pump of dish soap. Close the bottle, shake it, then pour the water out. Make sure that you remove the label as well. If there is any residue, use a goo-removal product to get it off, such as Goo Gone. Use a craft blade to cut the top, domed part off of the bottle. Plastic bottles have a dome on the top that eventually straightens out to become the sides. You need to cut around the bottle just before the domed part starts to straighten out. If the cut part turns out jagged, trim it down with scissors to make it nice and smooth. Some plastic bottles have a molded line just under the dome. Use this as a guide. Cut the bottom off of the bottle to create the base. Find the molded line near the bottom of your bottle, then cut along it with a craft blade. If there is no molded line, measure up 2 to 3 inches (5.1 to 7.6 cm) from the bottom of the bottle, then draw a line around it. Use this line as a cutting guide. If you prefer, you can use a small, plastic tub for the base instead. Choose something that is 2 to 3 inches (5.1 to 7.6 cm) tall, and a little wider than your bottle. Cut it shorter if it's too tall. Slice the middle segment of the bottle open. You should now have 3 separate pieces: a top, middle, and bottom. Take the middle, cylindrical part of the bottle, and cut straight down the side, from top to bottom. This will eventually make the stem. It should be long enough to fit the width of your hand. If the stem is too long, trim the top or bottom edge until it is the right length. Overlap and glue the cut edges to make a smaller tube. Take your middle segment and let it roll back into its original cylindrical shape. Gently squeeze it in your hand until the cut, vertical edges overlap and form a narrower tube. Glue these edges together to help the tube keep its shape. How narrow you make the tube is up to you. It should be wide enough to fit the neck of your bottle, however. This is typically a little over 1 inch (2.5 cm). Super glue will work the best for this, but you can use hot glue instead. Glue the tube to the bottom of the base. Take the bottom half of your bottle and flip it over so that the cut edge is touching the table and the underside is facing up. Cover the bottom edge of your tube with hot glue, then press it against the middle of the base. Hot glue sets up fast, but you still should hold the tube while the glue dries. For a stronger bond, use an industrial-strength glue, such as E6000. Turn the top of the bottle upside-down, then hot glue it to the tube. Cover the top edge of your tube with hot glue. Working quickly, before the glue sets, flip the domed bottle top upside down, then slide the neck into the tube. Keep sliding the neck into the tube until the domed part of the bottle touches the tube. You can take the cap off first, or you can leave it on. If you take it off, however, you can use this trophy as a pencil holder! You can use industrial-strength glue for this step too. Be sure to let the trophy dry overnight, however. Paint the trophy your desired colors. You can use spray paint for this or regular acrylic craft paint. Most trophies are gold or silver, but you can make yours any color you want. Apply 1 coat of paint first, wait 10 to 20 minutes for it to dry, then apply a second coat and let it dry too. Apply acrylic craft paint with synthetic taklon brushes. Avoid bristle brushes (too coarse) and camelhair brushes (too soft). If you are using spray paint, be sure to work in a well-ventilated area. Apply the paint from 6 to 8 inches (15 to 20 cm) away. If you want a more elaborate trophy, consider painting some words or designs onto it, such as \"#1\" or \"Champion!\" Alternatively, draw your designs with hot glue before you paint the trophy. This will give you nice, raised designs. Making a Paper Cup Trophy Paint 2 paper cups gold or silver, then let them dry. Find 2 identical paper cups, then paint them gold, silver, or whatever color you want your trophy to be. Acrylic craft paint will work the best for this, but you can use spray paint too. Apply 1 coat of paint first, wait for it to dry (about 10 to 20 minutes), then apply a second coat. Let the second coat dry too. The exact size of the paper cups does not matter, as long as they are both the same size. Apply acrylic craft paint with a synthetic taklon paintbrush. Don't use a bristle brush (too coarse) or a camelhair brush (too soft). Hold the cup from the inside while you paint it. If you want to use spray paint, set the cups down in a well-ventilated area. Apply the paint from 6 to 8 inches (15 to 20 cm) away. Work on the next step while the paint is drying to save time. Fold a sheet of paper in half and cut out a C-shape to get 2 handles. Take a sheet of paper and fold it in half. Draw a bold C-shape along the folded edge, then cut it out. Unfold the shape, then cut it apart along the crease to get 2 identical handles. Cardstock will work the best because it is nice and stiff, but you can use regular printer paper or construction paper too. The handles should be the same size as 1 of your cups, or just a little bit shorter. Paint the handles the same color as the cups and let them dry. Because paper is so absorbent, you'll probably only need a single coat of paint for this. Set the handles down on a larger sheet of scrap paper, then apply your paint. Let the paint dry, then flip the handles over and paint the back. Let the back dry as well. You don't want to use too much paint for this step, or the paper will turn soggy and warp. Alternatively, you can color the handles with a gold or silver marker. It won't be the exact same color as the cups, but it will be close enough. Do the next step while the paint is drying. Glue the bottoms of the cups together. Turn 1 of the cups upside-down, then cover the bottom edge with hot glue. Turn the other cup right-side-up, and press the bottom against the glue. Wait a a few minutes for the glue to set. If you don't have hot glue, you can try tacky glue, but it will take much longer to dry. Alternatively, you can place the bottoms of the cups together, then wrap a piece of double-sided tape around the seam. This will allow you to stick on sequins! Fold the ends of the handles, then secure them to the trophy. Fold the top and bottom ends of each handle by about ⁄2 inch (1.3 cm) to create a tab. Add a strip of double-sided tape to each tab, then press the handles against the cup. If you don't have double-sided tape, you can use hot glue or tacky glue. Use the glue sparingly so as not to create bumps or bulges. Decorate the trophy as desired. Glue some rhinestones or sequins to the seam between the 2 cups. Hot glue will work the best because it dries fast, but you can use tacky glue instead. For a more traditional trophy, you could write something on it. If you wrapped double-sided tape around the middle of the trophy, stick some sequins to the tape. Don't use rhinestones; they are too heavy and will fall off. If you want to write something on your trophy, try something like: #1, Winner! Champion, or World's Greatest! Add a ribbon to each handle, if desired. Cut 2 lengths of ribbon, each about 6 inches (15 cm) long. Next, but V-shaped notches into the ends of each ribbon. Take 1 ribbon and thread it through the left handle. Fold the ends of the ribbon down, then glue them to the bottom of the handle. Do the same thing for the second ribbon and right handle. Hot glue will work the best. If you want to use tacky glue, you'll have to pin the ribbons in place with a clothespin until the glue dries. You can also try double-sided tape. If the ribbon is fraying too much, you can singe the cut ends with a flame. If you are a child, ask an adult to help you. Satin ribbon about ⁄2 to 1 inch (1.3 to 2.5 cm) wide will work the best. Red or blue are traditional colors, but you can pick any color you want. Using Figurines Find a tall, slender item to use as a base. Plastic champagne, margarita, and wine glasses work especially well for this. You can also use a wide-mouthed glass bottle, such as a milk bottle. Don't use a tall, skinny bottle with a narrow mouth, or it won't be stable enough. Another option is to use a wood or metal candlestick. Avoid glass, as that is difficult to paint. Find a plastic figurine or a small item to place on top of your base. Think about the occasion you are giving the trophy for, then find a suitable figurine. For example, for a fishing competition, you could use a fish. The figurine should be a little larger than the circumference of your base. You can find plastic animal (and many other non-animal) figurines in toy stores, dollar stores, and craft stores. For a Lombardi trophy, use a mini (American) football. You can find these in dollar stores or impulse-buy bins. Hot glue your figurine to the base. Draw a swirl of hot glue against the bottom of your item, then press it against your base. Wait 1 to 2 minutes for the glue to set. For a stronger bond, use industrial-strength glue, such as E6000, instead. Secure the item to the base with painter's tape while the glue sets overnight, then remove the tape. If you are using a plastic glass, flip the glass over and hot glue the figurine to the bottom. If you are using a candlestick or a bottle, hot glue the figuring to the top. Don't flip the candlestick or bottle over. For a Lombardi trophy, glue the (American) football at an angle, so that 1 point is lower than the other. Decorate the base with hot glue, if desired. Write your desired message with a permanent marker first, then trace over it with a hot glue gun. You don't have to do this, but it's a great way to personalize your trophy. When you paint the trophy, the hot glue will create a raised design! For a Lombardi trophy, you could write the number 49 in Roman numerals (XLIX). For a traditional trophy, you could write \"#1\" or \"Winner!\" For a personalized trophy, try \"Best Mom!\" or \"#1 Dad!\" Spray paint the trophy gold or silver. Take the trophy into a well-ventilated area, then shake up a can of silver or gold spray paint. Spray the paint on from 6 to 8 inches (15 to 20 cm) away, then let the paint dry for 15 to 20 minutes. Apply a second coat if the first one is too thin, then let the paint dry completely. For a nicer finish, you can apply a spray paint primer first. You apply it just like regular spray paint, and you only need 1 coat. Gold is traditionally used for first place while silver is used for second place. For a Lombardi trophy, use silver. Using Cardboard Print out an outline of a trophy. Go online and find a picture of a trophy outline. You can use search terms such as \"trophy clip art\" or \"trophy outline.\" You can also use a page from a coloring book. Be sure to print the trophy out on regular printer paper. The trophy needs to be the same size you want your final trophy to be. If you need to, use an image editing program, such as Photoshop or Microsoft Paint, to make it bigger. You will be using graphite on the back of the paper to trace it onto the cardboard. If you don't want to do that, print the trophy out on cardstock to use as a stencil instead. Cover the back of the paper with graphite. Flip the paper over so that you can see the back. Next, cover the back of the paper with graphite. If the paper is thin enough so that you can see the trophy through it, then simply go over the outlines with a ⁄2 in (1.3 cm) wide graphite outline. Otherwise, cover the entire page with graphite. A graphite stick will work the best for this, but a pencil will work as well. Press hard enough to make the graphite shiny. If you printed the trophy out on cardstock, cut the trophy out instead. Cut the main shape out with scissors or a craft blade, then use a craft blade to cut the details, like the handle holes. Trace the trophy onto a piece of cardboard. Place the paper graphite-side-down onto a sheet of cardboard. Tape the corners down, then trace over the outlines. Press hard so that the graphite on the back of the paper sticks to the cardboard. If you made a stencil, simply place the stencil on top of the cardboard, then trace around it with a pen or pencil. Cut the traced trophy out with a craft blade. Peel the tape off, then put the paper away. You should see a faint outline of your trophy on the cardboard. Cut along these traced lines with a craft blade. If the lines are too light for you to see clearly, trace over them with a pen or pencil to make them darker. Be sure to work on top of a cutting mat so that you don't ruin your table. If you are a child, ask an adult to help you with this step. Measure the length of the base, then cut a semicircle based on that length. Place a ruler against the bottom edge of your trophy and note the measurement. Cut a semicircle out of cardboard based on that measurement; it needs to have the same length and height. Use a compass to trace a full circle, then draw a line across the middle to divide it. Cut it out with a craft blade. You can also cut a square base if you prefer. Cut a slit into the middle of the semicircle and base of the trophy. Measure the height of your semicircle first, then divide it by 2. This will be the length of your slits. Find the middle of the trophy's bottom edge, then cut a vertical slit based on your measurement. Find the middle of the top of your semicircle, and cut another slit as well. The top of your semicircle is the curved part. The bottom is the straight part. Don't assemble the pieces just yet. You need to paint and decorate them first! Paint the trophy and base your desired color. Gold and silver are the most popular trophy colors, but you can make yours any color you want. Apply 1 coat of acrylic craft paint with a synthetic taklon brush, then let it dry, about 10 to 20 minutes. Apply a second coat of paint, and let it dry too. You only need to paint the front of the trophy, but you need to paint both sides of the semicircle. You can use spray paint too, but be sure to work in a well-ventilated area. Apply the spray paint from 6 to 8 inches (15 to 20 cm) away. Because cardboard is absorbent, you'll probably only need a single coat. Slide the semicircle base into the bottom of the trophy. Hold the semicircle base under the bottom edge of the trophy, with the slit facing up. Turn the base so that it is perpendicular to the trophy; if you were to look down at it from the top, you'd see a +. Slide the base and trophy together through the slits. The bottom straight edge of the semicircle needs to be flush with the bottom edge of the trophy. If they aren't even, take the base out and make the slit deeper. If the semicircle base wobbles too much, apply some hot glue to the seams to stabilize it. Let the glue set, then paint over it so that it matches the rest of the trophy. Decorate the trophy with paint, markers, or other embellishments. You're only limited by your creativity and your materials in this step. Decide what sort of occasion the trophy is for, then decorate it accordingly. Here are some ideas for you:\nWrite \"#1\" or \"Winner!\" on the trophy with a black marker. Turn the trophy into a picture frame by cutting out a square or rectangle, then gluing a photo behind it. Draw designs over the trophy with hot glue, then paint over them using extra paint. This will give you a 3D look. Hot glue beads, buttons, or rhinestones to the trophy. Leave them as they are, or paint them to match the trophy.",
  "sentences":[
    " Making a Plastic Bottle Trophy Get a clean, empty plastic bottle.",
    "A bottle with a plain top and sides will work the best, but you can use other types too if you don't mind the molded designs.",
    "For the most realistic trophy though, you should use a 1.5 to 2-liter (50.7 to 67.6-fl oz) soda bottle.",
    "Make sure that the bottle is empty and clean.",
    "If it's dirty, fill it with water, then add a pump of dish soap.",
    "Close the bottle, shake it, then pour the water out.",
    "Make sure that you remove the label as well.",
    "If there is any residue, use a goo-removal product to get it off, such as Goo Gone.",
    "Use a craft blade to cut the top, domed part off of the bottle.",
    "Plastic bottles have a dome on the top that eventually straightens out to become the sides.",
    "You need to cut around the bottle just before the domed part starts to straighten out.",
    "If the cut part turns out jagged, trim it down with scissors to make it nice and smooth.",
    "Some plastic bottles have a molded line just under the dome.",
    "Use this as a guide.",
    "Cut the bottom off of the bottle to create the base.",
    "Find the molded line near the bottom of your bottle, then cut along it with a craft blade.",
    "If there is no molded line, measure up 2 to 3 inches (5.1 to 7.6 cm) from the bottom of the bottle, then draw a line around it.",
    "Use this line as a cutting guide.",
    "If you prefer, you can use a small, plastic tub for the base instead.",
    "Choose something that is 2 to 3 inches (5.1 to 7.6 cm) tall, and a little wider than your bottle.",
    "Cut it shorter if it's too tall.",
    "Slice the middle segment of the bottle open.",
    "You should now have 3 separate pieces: a top, middle, and bottom.",
    "Take the middle, cylindrical part of the bottle, and cut straight down the side, from top to bottom.",
    "This will eventually make the stem.",
    "It should be long enough to fit the width of your hand.",
    "If the stem is too long, trim the top or bottom edge until it is the right length.",
    "Overlap and glue the cut edges to make a smaller tube.",
    "Take your middle segment and let it roll back into its original cylindrical shape.",
    "Gently squeeze it in your hand until the cut, vertical edges overlap and form a narrower tube.",
    "Glue these edges together to help the tube keep its shape.",
    "How narrow you make the tube is up to you.",
    "It should be wide enough to fit the neck of your bottle, however.",
    "This is typically a little over 1 inch (2.5 cm).",
    "Super glue will work the best for this, but you can use hot glue instead.",
    "Glue the tube to the bottom of the base.",
    "Take the bottom half of your bottle and flip it over so that the cut edge is touching the table and the underside is facing up.",
    "Cover the bottom edge of your tube with hot glue, then press it against the middle of the base.",
    "Hot glue sets up fast, but you still should hold the tube while the glue dries.",
    "For a stronger bond, use an industrial-strength glue, such as E6000.",
    "Turn the top of the bottle upside-down, then hot glue it to the tube.",
    "Cover the top edge of your tube with hot glue.",
    "Working quickly, before the glue sets, flip the domed bottle top upside down, then slide the neck into the tube.",
    "Keep sliding the neck into the tube until the domed part of the bottle touches the tube.",
    "You can take the cap off first, or you can leave it on.",
    "If you take it off, however, you can use this trophy as a pencil holder!",
    "You can use industrial-strength glue for this step too.",
    "Be sure to let the trophy dry overnight, however.",
    "Paint the trophy your desired colors.",
    "You can use spray paint for this or regular acrylic craft paint.",
    "Most trophies are gold or silver, but you can make yours any color you want.",
    "Apply 1 coat of paint first, wait 10 to 20 minutes for it to dry, then apply a second coat and let it dry too.",
    "Apply acrylic craft paint with synthetic taklon brushes.",
    "Avoid bristle brushes (too coarse) and camelhair brushes (too soft).",
    "If you are using spray paint, be sure to work in a well-ventilated area.",
    "Apply the paint from 6 to 8 inches (15 to 20 cm) away.",
    "If you want a more elaborate trophy, consider painting some words or designs onto it, such as \"#1\" or \"Champion!\"",
    "Alternatively, draw your designs with hot glue before you paint the trophy.",
    "This will give you nice, raised designs.",
    "Making a Paper Cup Trophy Paint 2 paper cups gold or silver, then let them dry.",
    "Find 2 identical paper cups, then paint them gold, silver, or whatever color you want your trophy to be.",
    "Acrylic craft paint will work the best for this, but you can use spray paint too.",
    "Apply 1 coat of paint first, wait for it to dry (about 10 to 20 minutes), then apply a second coat.",
    "Let the second coat dry too.",
    "The exact size of the paper cups does not matter, as long as they are both the same size.",
    "Apply acrylic craft paint with a synthetic taklon paintbrush.",
    "Don't use a bristle brush (too coarse) or a camelhair brush (too soft).",
    "Hold the cup from the inside while you paint it.",
    "If you want to use spray paint, set the cups down in a well-ventilated area.",
    "Apply the paint from 6 to 8 inches (15 to 20 cm) away.",
    "Work on the next step while the paint is drying to save time.",
    "Fold a sheet of paper in half and cut out a C-shape to get 2 handles.",
    "Take a sheet of paper and fold it in half.",
    "Draw a bold C-shape along the folded edge, then cut it out.",
    "Unfold the shape, then cut it apart along the crease to get 2 identical handles.",
    "Cardstock will work the best because it is nice and stiff, but you can use regular printer paper or construction paper too.",
    "The handles should be the same size as 1 of your cups, or just a little bit shorter.",
    "Paint the handles the same color as the cups and let them dry.",
    "Because paper is so absorbent, you'll probably only need a single coat of paint for this.",
    "Set the handles down on a larger sheet of scrap paper, then apply your paint.",
    "Let the paint dry, then flip the handles over and paint the back.",
    "Let the back dry as well.",
    "You don't want to use too much paint for this step, or the paper will turn soggy and warp.",
    "Alternatively, you can color the handles with a gold or silver marker.",
    "It won't be the exact same color as the cups, but it will be close enough.",
    "Do the next step while the paint is drying.",
    "Glue the bottoms of the cups together.",
    "Turn 1 of the cups upside-down, then cover the bottom edge with hot glue.",
    "Turn the other cup right-side-up, and press the bottom against the glue.",
    "Wait a a few minutes for the glue to set.",
    "If you don't have hot glue, you can try tacky glue, but it will take much longer to dry.",
    "Alternatively, you can place the bottoms of the cups together, then wrap a piece of double-sided tape around the seam.",
    "This will allow you to stick on sequins!",
    "Fold the ends of the handles, then secure them to the trophy.",
    "Fold the top and bottom ends of each handle by about ⁄2 inch (1.3 cm) to create a tab.",
    "Add a strip of double-sided tape to each tab, then press the handles against the cup.",
    "If you don't have double-sided tape, you can use hot glue or tacky glue.",
    "Use the glue sparingly so as not to create bumps or bulges.",
    "Decorate the trophy as desired.",
    "Glue some rhinestones or sequins to the seam between the 2 cups.",
    "Hot glue will work the best because it dries fast, but you can use tacky glue instead.",
    "For a more traditional trophy, you could write something on it.",
    "If you wrapped double-sided tape around the middle of the trophy, stick some sequins to the tape.",
    "Don't use rhinestones; they are too heavy and will fall off.",
    "If you want to write something on your trophy, try something like: #1, Winner!",
    "Champion, or World's Greatest!",
    "Add a ribbon to each handle, if desired.",
    "Cut 2 lengths of ribbon, each about 6 inches (15 cm) long.",
    "Next, but V-shaped notches into the ends of each ribbon.",
    "Take 1 ribbon and thread it through the left handle.",
    "Fold the ends of the ribbon down, then glue them to the bottom of the handle.",
    "Do the same thing for the second ribbon and right handle.",
    "Hot glue will work the best.",
    "If you want to use tacky glue, you'll have to pin the ribbons in place with a clothespin until the glue dries.",
    "You can also try double-sided tape.",
    "If the ribbon is fraying too much, you can singe the cut ends with a flame.",
    "If you are a child, ask an adult to help you.",
    "Satin ribbon about ⁄2 to 1 inch (1.3 to 2.5 cm) wide will work the best.",
    "Red or blue are traditional colors, but you can pick any color you want.",
    "Using Figurines Find a tall, slender item to use as a base.",
    "Plastic champagne, margarita, and wine glasses work especially well for this.",
    "You can also use a wide-mouthed glass bottle, such as a milk bottle.",
    "Don't use a tall, skinny bottle with a narrow mouth, or it won't be stable enough.",
    "Another option is to use a wood or metal candlestick.",
    "Avoid glass, as that is difficult to paint.",
    "Find a plastic figurine or a small item to place on top of your base.",
    "Think about the occasion you are giving the trophy for, then find a suitable figurine.",
    "For example, for a fishing competition, you could use a fish.",
    "The figurine should be a little larger than the circumference of your base.",
    "You can find plastic animal (and many other non-animal) figurines in toy stores, dollar stores, and craft stores.",
    "For a Lombardi trophy, use a mini (American) football.",
    "You can find these in dollar stores or impulse-buy bins.",
    "Hot glue your figurine to the base.",
    "Draw a swirl of hot glue against the bottom of your item, then press it against your base.",
    "Wait 1 to 2 minutes for the glue to set.",
    "For a stronger bond, use industrial-strength glue, such as E6000, instead.",
    "Secure the item to the base with painter's tape while the glue sets overnight, then remove the tape.",
    "If you are using a plastic glass, flip the glass over and hot glue the figurine to the bottom.",
    "If you are using a candlestick or a bottle, hot glue the figuring to the top.",
    "Don't flip the candlestick or bottle over.",
    "For a Lombardi trophy, glue the (American) football at an angle, so that 1 point is lower than the other.",
    "Decorate the base with hot glue, if desired.",
    "Write your desired message with a permanent marker first, then trace over it with a hot glue gun.",
    "You don't have to do this, but it's a great way to personalize your trophy.",
    "When you paint the trophy, the hot glue will create a raised design!",
    "For a Lombardi trophy, you could write the number 49 in Roman numerals (XLIX).",
    "For a traditional trophy, you could write \"#1\" or \"Winner!\"",
    "For a personalized trophy, try \"Best Mom!\"",
    "or \"#1 Dad!\"",
    "Spray paint the trophy gold or silver.",
    "Take the trophy into a well-ventilated area, then shake up a can of silver or gold spray paint.",
    "Spray the paint on from 6 to 8 inches (15 to 20 cm) away, then let the paint dry for 15 to 20 minutes.",
    "Apply a second coat if the first one is too thin, then let the paint dry completely.",
    "For a nicer finish, you can apply a spray paint primer first.",
    "You apply it just like regular spray paint, and you only need 1 coat.",
    "Gold is traditionally used for first place while silver is used for second place.",
    "For a Lombardi trophy, use silver.",
    "Using Cardboard Print out an outline of a trophy.",
    "Go online and find a picture of a trophy outline.",
    "You can use search terms such as \"trophy clip art\" or \"trophy outline.\"",
    "You can also use a page from a coloring book.",
    "Be sure to print the trophy out on regular printer paper.",
    "The trophy needs to be the same size you want your final trophy to be.",
    "If you need to, use an image editing program, such as Photoshop or Microsoft Paint, to make it bigger.",
    "You will be using graphite on the back of the paper to trace it onto the cardboard.",
    "If you don't want to do that, print the trophy out on cardstock to use as a stencil instead.",
    "Cover the back of the paper with graphite.",
    "Flip the paper over so that you can see the back.",
    "Next, cover the back of the paper with graphite.",
    "If the paper is thin enough so that you can see the trophy through it, then simply go over the outlines with a ⁄2 in (1.3 cm) wide graphite outline.",
    "Otherwise, cover the entire page with graphite.",
    "A graphite stick will work the best for this, but a pencil will work as well.",
    "Press hard enough to make the graphite shiny.",
    "If you printed the trophy out on cardstock, cut the trophy out instead.",
    "Cut the main shape out with scissors or a craft blade, then use a craft blade to cut the details, like the handle holes.",
    "Trace the trophy onto a piece of cardboard.",
    "Place the paper graphite-side-down onto a sheet of cardboard.",
    "Tape the corners down, then trace over the outlines.",
    "Press hard so that the graphite on the back of the paper sticks to the cardboard.",
    "If you made a stencil, simply place the stencil on top of the cardboard, then trace around it with a pen or pencil.",
    "Cut the traced trophy out with a craft blade.",
    "Peel the tape off, then put the paper away.",
    "You should see a faint outline of your trophy on the cardboard.",
    "Cut along these traced lines with a craft blade.",
    "If the lines are too light for you to see clearly, trace over them with a pen or pencil to make them darker.",
    "Be sure to work on top of a cutting mat so that you don't ruin your table.",
    "If you are a child, ask an adult to help you with this step.",
    "Measure the length of the base, then cut a semicircle based on that length.",
    "Place a ruler against the bottom edge of your trophy and note the measurement.",
    "Cut a semicircle out of cardboard based on that measurement; it needs to have the same length and height.",
    "Use a compass to trace a full circle, then draw a line across the middle to divide it.",
    "Cut it out with a craft blade.",
    "You can also cut a square base if you prefer.",
    "Cut a slit into the middle of the semicircle and base of the trophy.",
    "Measure the height of your semicircle first, then divide it by 2.",
    "This will be the length of your slits.",
    "Find the middle of the trophy's bottom edge, then cut a vertical slit based on your measurement.",
    "Find the middle of the top of your semicircle, and cut another slit as well.",
    "The top of your semicircle is the curved part.",
    "The bottom is the straight part.",
    "Don't assemble the pieces just yet.",
    "You need to paint and decorate them first!",
    "Paint the trophy and base your desired color.",
    "Gold and silver are the most popular trophy colors, but you can make yours any color you want.",
    "Apply 1 coat of acrylic craft paint with a synthetic taklon brush, then let it dry, about 10 to 20 minutes.",
    "Apply a second coat of paint, and let it dry too.",
    "You only need to paint the front of the trophy, but you need to paint both sides of the semicircle.",
    "You can use spray paint too, but be sure to work in a well-ventilated area.",
    "Apply the spray paint from 6 to 8 inches (15 to 20 cm) away.",
    "Because cardboard is absorbent, you'll probably only need a single coat.",
    "Slide the semicircle base into the bottom of the trophy.",
    "Hold the semicircle base under the bottom edge of the trophy, with the slit facing up.",
    "Turn the base so that it is perpendicular to the trophy; if you were to look down at it from the top, you'd see a +.",
    "Slide the base and trophy together through the slits.",
    "The bottom straight edge of the semicircle needs to be flush with the bottom edge of the trophy.",
    "If they aren't even, take the base out and make the slit deeper.",
    "If the semicircle base wobbles too much, apply some hot glue to the seams to stabilize it.",
    "Let the glue set, then paint over it so that it matches the rest of the trophy.",
    "Decorate the trophy with paint, markers, or other embellishments.",
    "You're only limited by your creativity and your materials in this step.",
    "Decide what sort of occasion the trophy is for, then decorate it accordingly.",
    "Here are some ideas for you:\nWrite \"#1\" or \"Winner!\"",
    "on the trophy with a black marker.",
    "Turn the trophy into a picture frame by cutting out a square or rectangle, then gluing a photo behind it.",
    "Draw designs over the trophy with hot glue, then paint over them using extra paint.",
    "This will give you a 3D look.",
    "Hot glue beads, buttons, or rhinestones to the trophy.",
    "Leave them as they are, or paint them to match the trophy."
  ],
  "tyn_section":[
    "1.5 to 2-liter (50.7 to 67.6-fl oz) soda bottle, empty",
    "Craft blade",
    "Scissors",
    "Hot glue or industrial-strength glue",
    "Acrylic craft paint or spray paint",
    "Synthetic taklon paintbrushes (for acrylic craft paint)",
    "2 paper cups",
    "Cardstock",
    "Double-sided tape or hot glue",
    "Ribbon (optional)",
    "Sequins or rhinestones (optional)",
    "Plastic champagne, margarita, or wine glass",
    "Plastic figurine",
    "Spray paint",
    "Computer",
    "Printer",
    "Paper",
    "Graphite pencil",
    "Tape",
    "Cardboard",
    "Acrylic craft paint",
    "Synthetic taklon paintbrushes",
    "Glue, glitter, embellishments, etc. (optional)"
  ],
  "tyn_model":[
    "hot glue",
    "paint",
    "glue",
    "paper",
    "bottle",
    "spray paint",
    "cardboard",
    "graphite",
    "acrylic craft paint",
    "craft blade",
    "ribbon",
    "trophy",
    "industrial-strength glue",
    "sequins",
    "candlestick",
    "water",
    "scissors",
    "cardstock",
    "printer paper",
    "double-sided tape",
    "tape",
    "pen or pencil",
    "plastic bottle",
    "soda bottle",
    "dish soap",
    "goo gone",
    "super glue",
    "e6000.",
    "pencil holder",
    "taklon brushes",
    "synthetic taklon paintbrush",
    "construction paper",
    "scrap paper",
    "rhinestones",
    "satin ribbon",
    "figurines",
    "wine glasses",
    "glass",
    "fish",
    "painter's tape",
    "figurine",
    "permanent marker",
    "roman numerals",
    "image editing program",
    "graphite stick",
    "pencil",
    "cutting mat",
    "ruler",
    "compass",
    "synthetic taklon brush",
    "markers",
    "black marker",
    "picture frame"
  ],
  "simple_metrics":{
    "r":0.347826087,
    "p":0.1509433962,
    "f1":0.2105263158,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.652173913,
    "p":0.4150943396,
    "f1":0.5073020753
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7391304348,
    "p":0.4905660377,
    "f1":0.5897264843
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.347826087,
    "p":0.1509433962,
    "f1":0.2105263158
  }
}