{
  "title":"How to Boil Chicken Breasts",
  "url":"https://www.wikihow.com/Boil-Chicken-Breasts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "parts":[
    {
      "name":"Putting the Chicken in a Pot",
      "steps":[
        {
          "headline":"Skip rinsing the chicken breasts before you cook them.",
          "description":"You may have been taught to rinse chicken before you cook it, but doing so can spread harmful germs and bacteria around your kitchen. As you rinse the chicken, water droplets splash off of it, causing bacteria to splatter all over your sink, countertops, arms, and clothes. It’s best to avoid washing chicken so that you don’t risk food poisoning. Chicken carries harmful bacteria, like salmonella. It only takes a tiny amount of germs to make you sick, so don’t risk it."
        },
        {
          "headline":"Cut the chicken into halves, quarters, or cubes to help it cook faster.",
          "description":"This step is optional, but it can dramatically reduce your cook time. Use a sharp knife to slice through the chicken breasts, cutting them into smaller pieces. Chop them as small as you like, depending on the dish you’re making. If you’re shredding the chicken, you might not want to chop them too small, as this could make shredding take longer. However, it might be helpful to make your pieces very small if you’re adding them to a salad or wrap. Use a cutting board that’s dedicated to chopping meat to limit the risk of contaminating other foods. Bacteria like salmonella can get stuck onto your chopping board, even if you wash it. If you then chop veggies on the board, they might get contaminated with salmonella.Did You Know? Whole pieces of chicken take up to 30 minutes to cook, while small pieces may cook as quickly as 10 minutes."
        },
        {
          "headline":"Place the chicken into a medium or large pot.",
          "description":"Put the chicken into the pot first, then add the water or broth afterwards. Arrange the chicken in the bottom of the pan in a single layer. If you have to layer the chicken to make it all fit, then it’s best to switch to a bigger pot. Otherwise, your chicken may not cook as well."
        },
        {
          "headline":"Cover the chicken with water or broth.",
          "description":"Slowly pour water or broth over your chicken, being careful not to splash. Add just enough water to completely cover the chicken. If the water boils off, you can add more water, as necessary. Keep in mind that splashing can distribute bacteria like salmonella. You can use either chicken or vegetable broth."
        },
        {
          "headline":"Season the pot using spices, herbs, or chopped veggies, if you like.",
          "description":"Adding seasonings is optional, but it can make your chicken much more flavorful. At a minimum, add salt and pepper to your water for a little seasoning. However, it’s best to also add dried herbs like italian seasoning, jerk seasoning, or rosemary. For really flavorful chicken, chop up onions, carrots, and celery, then add them to your water. After you cook the chicken, you can save the water or broth for use in another recipe, if you like. For instance, it might make a good soup stock. If any veggies are sticking out of the water, add more water so that the veggies and chicken are totally covered."
        },
        {
          "headline":"Cover the pot with a lid.",
          "description":"Use a lid that fits tightly onto the pot you’re using. This will seal in the water vapor that evaporates from the pot to help the chicken cook. When you lift the lid, use a towel or pot holder so you don’t burn your hand. Additionally, don’t hold your face over the pot, as the steam could burn you."
        }
      ]
    },
    {
      "name":"Cooking the Chicken",
      "steps":[
        {
          "headline":"Bring the water or broth to a boil over medium-high heat.",
          "description":"Place the pot on a stove burner and turn the heat to medium-high. Watch the pot until it starts burning, which will take a few minutes. Watch for bubbles on the surface of the water and condensation forming on the lid, which mean the water is boiling. Don’t let your water or broth boil too long, as this can evaporate too much of your liquid. Stay with the pot so you can turn it down as soon as it starts boiling."
        },
        {
          "headline":"Turn the heat down to a simmer.",
          "description":"The chicken will continue cooking at a simmer. Turn the heat down to low, then monitor it for a few minutes to make sure the water or broth is lightly simmering. Don't leave the pot unattended, even while it's at a simmer. You don't want it to accidentally start boiling again or for the water to evaporate."
        },
        {
          "headline":"Check the chicken breasts with a meat thermometer after 10 minutes.",
          "description":"Remove the lid from the pot. Next, pull out a single piece of chicken from the side of the pot. Push your meat thermometer into the center of the chicken, then read the temperature. If it’s not at least 165 °F (74 °C), put the chicken back in the pot, replace the lid, and keep cooking it. If you don’t have a meat thermometer, cut the chicken in half to see if it’s pink inside. While this is not as accurate as a meat thermometer, it will help you determine if your chicken is likely done. Large pieces of chicken will likely not be ready at this point. However, smaller chunks or chicken quarters may be cooked.Tip: Overcooking your chicken will make it rubbery and unpleasant to chew, so it’s best to check if it’s ready, even if you suspect it isn’t."
        },
        {
          "headline":"Continue cooking the chicken until it reaches 165 °F (74 °C) inside it.",
          "description":"If the chicken isn’t ready after 10 minutes, keep cooking it. Check it every 5-10 minutes to see if it’s done. How long it will take for your chicken to cook depends on the size of the pieces:\nChicken breasts with skin and bones should cook for about 30 minutes. Skinless, boneless chicken breasts should cook for 20-25 minutes. If they are cut in half, then they’ll likely take 15-20 minutes. Skinless, boneless chicken breasts that have been cut into 2-inch pieces should cook for about 10 minutes.Tip: When the chicken is thoroughly cooked, the inside will no longer be pink."
        },
        {
          "headline":"Remove the pot from the heat.",
          "description":"Turn off the burner, then use a towel or pot holder to grasp the handle on the pot so that you don’t burn yourself. Move the pot to a cool burner or a pot cooling rack. Be careful when handling the hot pot, as you might burn yourself."
        }
      ]
    },
    {
      "name":"Serving or Shredding Your Chicken",
      "steps":[
        {
          "headline":"Drain the liquid from the pot.",
          "description":"Slowly pour the water or broth over a colander, being careful not to splash. The chicken and any veggies you used to flavor the water will collect in the colander for easy retrieval. Set the colander on a clean countertop, then either discard or save the liquid. If you’re planning to save the liquid for a future recipe, drain it into a clean bowl. From there, you can refrigerate or freeze it. If you used veggies to season your water, discard them into your compost or trash.Variation: As an alternative, you can use a fork, slotted spoon, or tongs to remove the chicken."
        },
        {
          "headline":"Transfer the chicken breasts to a plate.",
          "description":"Use a fork to move the chicken from the colander to a plate. Be careful not to touch the chicken, as it will be very hot. If you prefer, you can transfer the chicken back into the empty pot. For instance, you might prefer to shred the chicken in the pot if you plan to add a sauce to it. That way, you can warm the sauce in the same pan you used to cook the chicken."
        },
        {
          "headline":"Let the chicken rest for 10 minutes before you use it.",
          "description":"This gives the chicken a chance to cool down before you handle it. Set a timer and leave the chicken alone during this time. Afterwards, you can serve or shred your chicken. If you’re planning to add a sauce to the chicken, it’s okay to do so now as long as you don’t touch the chicken. However, don’t heat up the sauce until the chicken has cooled for 10 minutes. This will help you prevent the chicken from becoming rubbery from overcooking."
        },
        {
          "headline":"Serve the chicken whole or cut it into chunks.",
          "description":"After your chicken cools, you can serve it however you like. It’s okay to eat the breasts whole, or you might want to slice them up. If you like, you can season your chicken with more spices or a sauce. For instance, you might coat it in barbeque sauce or mix it into a mango salsa.Tip: You can add boiled chicken to salads, stir-fries, or fajitas."
        },
        {
          "headline":"Shred the chicken with 2 forks if you’re making tacos or sandwiches.",
          "description":"Hold a fork in each hand, then use the forks to pull the chicken apart. Continue to pierce and pull apart the chicken until it’s shredded to your preferences. Then, you can use it to complete your recipe. You can also use a knife to help break up the chicken, if you prefer."
        }
      ]
    }
  ],
  "text":" Putting the Chicken in a Pot Skip rinsing the chicken breasts before you cook them. You may have been taught to rinse chicken before you cook it, but doing so can spread harmful germs and bacteria around your kitchen. As you rinse the chicken, water droplets splash off of it, causing bacteria to splatter all over your sink, countertops, arms, and clothes. It’s best to avoid washing chicken so that you don’t risk food poisoning. Chicken carries harmful bacteria, like salmonella. It only takes a tiny amount of germs to make you sick, so don’t risk it. Cut the chicken into halves, quarters, or cubes to help it cook faster. This step is optional, but it can dramatically reduce your cook time. Use a sharp knife to slice through the chicken breasts, cutting them into smaller pieces. Chop them as small as you like, depending on the dish you’re making. If you’re shredding the chicken, you might not want to chop them too small, as this could make shredding take longer. However, it might be helpful to make your pieces very small if you’re adding them to a salad or wrap. Use a cutting board that’s dedicated to chopping meat to limit the risk of contaminating other foods. Bacteria like salmonella can get stuck onto your chopping board, even if you wash it. If you then chop veggies on the board, they might get contaminated with salmonella.Did You Know? Whole pieces of chicken take up to 30 minutes to cook, while small pieces may cook as quickly as 10 minutes. Place the chicken into a medium or large pot. Put the chicken into the pot first, then add the water or broth afterwards. Arrange the chicken in the bottom of the pan in a single layer. If you have to layer the chicken to make it all fit, then it’s best to switch to a bigger pot. Otherwise, your chicken may not cook as well. Cover the chicken with water or broth. Slowly pour water or broth over your chicken, being careful not to splash. Add just enough water to completely cover the chicken. If the water boils off, you can add more water, as necessary. Keep in mind that splashing can distribute bacteria like salmonella. You can use either chicken or vegetable broth. Season the pot using spices, herbs, or chopped veggies, if you like. Adding seasonings is optional, but it can make your chicken much more flavorful. At a minimum, add salt and pepper to your water for a little seasoning. However, it’s best to also add dried herbs like italian seasoning, jerk seasoning, or rosemary. For really flavorful chicken, chop up onions, carrots, and celery, then add them to your water. After you cook the chicken, you can save the water or broth for use in another recipe, if you like. For instance, it might make a good soup stock. If any veggies are sticking out of the water, add more water so that the veggies and chicken are totally covered. Cover the pot with a lid. Use a lid that fits tightly onto the pot you’re using. This will seal in the water vapor that evaporates from the pot to help the chicken cook. When you lift the lid, use a towel or pot holder so you don’t burn your hand. Additionally, don’t hold your face over the pot, as the steam could burn you. Cooking the Chicken Bring the water or broth to a boil over medium-high heat. Place the pot on a stove burner and turn the heat to medium-high. Watch the pot until it starts burning, which will take a few minutes. Watch for bubbles on the surface of the water and condensation forming on the lid, which mean the water is boiling. Don’t let your water or broth boil too long, as this can evaporate too much of your liquid. Stay with the pot so you can turn it down as soon as it starts boiling. Turn the heat down to a simmer. The chicken will continue cooking at a simmer. Turn the heat down to low, then monitor it for a few minutes to make sure the water or broth is lightly simmering. Don't leave the pot unattended, even while it's at a simmer. You don't want it to accidentally start boiling again or for the water to evaporate. Check the chicken breasts with a meat thermometer after 10 minutes. Remove the lid from the pot. Next, pull out a single piece of chicken from the side of the pot. Push your meat thermometer into the center of the chicken, then read the temperature. If it’s not at least 165 °F (74 °C), put the chicken back in the pot, replace the lid, and keep cooking it. If you don’t have a meat thermometer, cut the chicken in half to see if it’s pink inside. While this is not as accurate as a meat thermometer, it will help you determine if your chicken is likely done. Large pieces of chicken will likely not be ready at this point. However, smaller chunks or chicken quarters may be cooked.Tip: Overcooking your chicken will make it rubbery and unpleasant to chew, so it’s best to check if it’s ready, even if you suspect it isn’t. Continue cooking the chicken until it reaches 165 °F (74 °C) inside it. If the chicken isn’t ready after 10 minutes, keep cooking it. Check it every 5-10 minutes to see if it’s done. How long it will take for your chicken to cook depends on the size of the pieces:\nChicken breasts with skin and bones should cook for about 30 minutes. Skinless, boneless chicken breasts should cook for 20-25 minutes. If they are cut in half, then they’ll likely take 15-20 minutes. Skinless, boneless chicken breasts that have been cut into 2-inch pieces should cook for about 10 minutes.Tip: When the chicken is thoroughly cooked, the inside will no longer be pink. Remove the pot from the heat. Turn off the burner, then use a towel or pot holder to grasp the handle on the pot so that you don’t burn yourself. Move the pot to a cool burner or a pot cooling rack. Be careful when handling the hot pot, as you might burn yourself. Serving or Shredding Your Chicken Drain the liquid from the pot. Slowly pour the water or broth over a colander, being careful not to splash. The chicken and any veggies you used to flavor the water will collect in the colander for easy retrieval. Set the colander on a clean countertop, then either discard or save the liquid. If you’re planning to save the liquid for a future recipe, drain it into a clean bowl. From there, you can refrigerate or freeze it. If you used veggies to season your water, discard them into your compost or trash.Variation: As an alternative, you can use a fork, slotted spoon, or tongs to remove the chicken. Transfer the chicken breasts to a plate. Use a fork to move the chicken from the colander to a plate. Be careful not to touch the chicken, as it will be very hot. If you prefer, you can transfer the chicken back into the empty pot. For instance, you might prefer to shred the chicken in the pot if you plan to add a sauce to it. That way, you can warm the sauce in the same pan you used to cook the chicken. Let the chicken rest for 10 minutes before you use it. This gives the chicken a chance to cool down before you handle it. Set a timer and leave the chicken alone during this time. Afterwards, you can serve or shred your chicken. If you’re planning to add a sauce to the chicken, it’s okay to do so now as long as you don’t touch the chicken. However, don’t heat up the sauce until the chicken has cooled for 10 minutes. This will help you prevent the chicken from becoming rubbery from overcooking. Serve the chicken whole or cut it into chunks. After your chicken cools, you can serve it however you like. It’s okay to eat the breasts whole, or you might want to slice them up. If you like, you can season your chicken with more spices or a sauce. For instance, you might coat it in barbeque sauce or mix it into a mango salsa.Tip: You can add boiled chicken to salads, stir-fries, or fajitas. Shred the chicken with 2 forks if you’re making tacos or sandwiches. Hold a fork in each hand, then use the forks to pull the chicken apart. Continue to pierce and pull apart the chicken until it’s shredded to your preferences. Then, you can use it to complete your recipe. You can also use a knife to help break up the chicken, if you prefer.",
  "sentences":[
    " Putting the Chicken in a Pot Skip rinsing the chicken breasts before you cook them.",
    "You may have been taught to rinse chicken before you cook it, but doing so can spread harmful germs and bacteria around your kitchen.",
    "As you rinse the chicken, water droplets splash off of it, causing bacteria to splatter all over your sink, countertops, arms, and clothes.",
    "It’s best to avoid washing chicken so that you don’t risk food poisoning.",
    "Chicken carries harmful bacteria, like salmonella.",
    "It only takes a tiny amount of germs to make you sick, so don’t risk it.",
    "Cut the chicken into halves, quarters, or cubes to help it cook faster.",
    "This step is optional, but it can dramatically reduce your cook time.",
    "Use a sharp knife to slice through the chicken breasts, cutting them into smaller pieces.",
    "Chop them as small as you like, depending on the dish you’re making.",
    "If you’re shredding the chicken, you might not want to chop them too small, as this could make shredding take longer.",
    "However, it might be helpful to make your pieces very small if you’re adding them to a salad or wrap.",
    "Use a cutting board that’s dedicated to chopping meat to limit the risk of contaminating other foods.",
    "Bacteria like salmonella can get stuck onto your chopping board, even if you wash it.",
    "If you then chop veggies on the board, they might get contaminated with salmonella.Did You Know?",
    "Whole pieces of chicken take up to 30 minutes to cook, while small pieces may cook as quickly as 10 minutes.",
    "Place the chicken into a medium or large pot.",
    "Put the chicken into the pot first, then add the water or broth afterwards.",
    "Arrange the chicken in the bottom of the pan in a single layer.",
    "If you have to layer the chicken to make it all fit, then it’s best to switch to a bigger pot.",
    "Otherwise, your chicken may not cook as well.",
    "Cover the chicken with water or broth.",
    "Slowly pour water or broth over your chicken, being careful not to splash.",
    "Add just enough water to completely cover the chicken.",
    "If the water boils off, you can add more water, as necessary.",
    "Keep in mind that splashing can distribute bacteria like salmonella.",
    "You can use either chicken or vegetable broth.",
    "Season the pot using spices, herbs, or chopped veggies, if you like.",
    "Adding seasonings is optional, but it can make your chicken much more flavorful.",
    "At a minimum, add salt and pepper to your water for a little seasoning.",
    "However, it’s best to also add dried herbs like italian seasoning, jerk seasoning, or rosemary.",
    "For really flavorful chicken, chop up onions, carrots, and celery, then add them to your water.",
    "After you cook the chicken, you can save the water or broth for use in another recipe, if you like.",
    "For instance, it might make a good soup stock.",
    "If any veggies are sticking out of the water, add more water so that the veggies and chicken are totally covered.",
    "Cover the pot with a lid.",
    "Use a lid that fits tightly onto the pot you’re using.",
    "This will seal in the water vapor that evaporates from the pot to help the chicken cook.",
    "When you lift the lid, use a towel or pot holder so you don’t burn your hand.",
    "Additionally, don’t hold your face over the pot, as the steam could burn you.",
    "Cooking the Chicken Bring the water or broth to a boil over medium-high heat.",
    "Place the pot on a stove burner and turn the heat to medium-high.",
    "Watch the pot until it starts burning, which will take a few minutes.",
    "Watch for bubbles on the surface of the water and condensation forming on the lid, which mean the water is boiling.",
    "Don’t let your water or broth boil too long, as this can evaporate too much of your liquid.",
    "Stay with the pot so you can turn it down as soon as it starts boiling.",
    "Turn the heat down to a simmer.",
    "The chicken will continue cooking at a simmer.",
    "Turn the heat down to low, then monitor it for a few minutes to make sure the water or broth is lightly simmering.",
    "Don't leave the pot unattended, even while it's at a simmer.",
    "You don't want it to accidentally start boiling again or for the water to evaporate.",
    "Check the chicken breasts with a meat thermometer after 10 minutes.",
    "Remove the lid from the pot.",
    "Next, pull out a single piece of chicken from the side of the pot.",
    "Push your meat thermometer into the center of the chicken, then read the temperature.",
    "If it’s not at least 165 °F (74 °C), put the chicken back in the pot, replace the lid, and keep cooking it.",
    "If you don’t have a meat thermometer, cut the chicken in half to see if it’s pink inside.",
    "While this is not as accurate as a meat thermometer, it will help you determine if your chicken is likely done.",
    "Large pieces of chicken will likely not be ready at this point.",
    "However, smaller chunks or chicken quarters may be cooked.Tip: Overcooking your chicken will make it rubbery and unpleasant to chew, so it’s best to check if it’s ready, even if you suspect it isn’t.",
    "Continue cooking the chicken until it reaches 165 °F (74 °C) inside it.",
    "If the chicken isn’t ready after 10 minutes, keep cooking it.",
    "Check it every 5-10 minutes to see if it’s done.",
    "How long it will take for your chicken to cook depends on the size of the pieces:\nChicken breasts with skin and bones should cook for about 30 minutes.",
    "Skinless, boneless chicken breasts should cook for 20-25 minutes.",
    "If they are cut in half, then they’ll likely take 15-20 minutes.",
    "Skinless, boneless chicken breasts that have been cut into 2-inch pieces should cook for about 10 minutes.Tip: When the chicken is thoroughly cooked, the inside will no longer be pink.",
    "Remove the pot from the heat.",
    "Turn off the burner, then use a towel or pot holder to grasp the handle on the pot so that you don’t burn yourself.",
    "Move the pot to a cool burner or a pot cooling rack.",
    "Be careful when handling the hot pot, as you might burn yourself.",
    "Serving or Shredding Your Chicken Drain the liquid from the pot.",
    "Slowly pour the water or broth over a colander, being careful not to splash.",
    "The chicken and any veggies you used to flavor the water will collect in the colander for easy retrieval.",
    "Set the colander on a clean countertop, then either discard or save the liquid.",
    "If you’re planning to save the liquid for a future recipe, drain it into a clean bowl.",
    "From there, you can refrigerate or freeze it.",
    "If you used veggies to season your water, discard them into your compost or trash.Variation: As an alternative, you can use a fork, slotted spoon, or tongs to remove the chicken.",
    "Transfer the chicken breasts to a plate.",
    "Use a fork to move the chicken from the colander to a plate.",
    "Be careful not to touch the chicken, as it will be very hot.",
    "If you prefer, you can transfer the chicken back into the empty pot.",
    "For instance, you might prefer to shred the chicken in the pot if you plan to add a sauce to it.",
    "That way, you can warm the sauce in the same pan you used to cook the chicken.",
    "Let the chicken rest for 10 minutes before you use it.",
    "This gives the chicken a chance to cool down before you handle it.",
    "Set a timer and leave the chicken alone during this time.",
    "Afterwards, you can serve or shred your chicken.",
    "If you’re planning to add a sauce to the chicken, it’s okay to do so now as long as you don’t touch the chicken.",
    "However, don’t heat up the sauce until the chicken has cooled for 10 minutes.",
    "This will help you prevent the chicken from becoming rubbery from overcooking.",
    "Serve the chicken whole or cut it into chunks.",
    "After your chicken cools, you can serve it however you like.",
    "It’s okay to eat the breasts whole, or you might want to slice them up.",
    "If you like, you can season your chicken with more spices or a sauce.",
    "For instance, you might coat it in barbeque sauce or mix it into a mango salsa.Tip: You can add boiled chicken to salads, stir-fries, or fajitas.",
    "Shred the chicken with 2 forks if you’re making tacos or sandwiches.",
    "Hold a fork in each hand, then use the forks to pull the chicken apart.",
    "Continue to pierce and pull apart the chicken until it’s shredded to your preferences.",
    "Then, you can use it to complete your recipe.",
    "You can also use a knife to help break up the chicken, if you prefer."
  ],
  "tyn_section":[
    "Pot",
    "Water",
    "Broth (optional)",
    "Cutting board",
    "Chicken",
    "Spices (optional)",
    "Chopped veggies (optional)"
  ],
  "tyn_model":[
    "chicken",
    "water",
    "pot",
    "broth",
    "meat thermometer",
    "colander",
    "fork",
    "pot holder",
    "chicken breasts",
    "plate",
    "forks",
    "sharp knife",
    "cutting board",
    "chopping board",
    "chicken or vegetable broth",
    "seasonings",
    "salt and pepper",
    "italian seasoning",
    "jerk seasoning",
    "rosemary",
    "onions",
    "carrots",
    "celery",
    "stove burner",
    "burner",
    "bowl",
    "slotted spoon",
    "spices",
    "sauce",
    "barbeque sauce",
    "mango salsa",
    "knife"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.125,
    "f1":0.2051282051,
    "avg_pos":0.0625
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.25,
    "f1":0.3870967742
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.28125,
    "f1":0.4235294118
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.125,
    "f1":0.2051282051
  }
}