{
  "title":"How to Install a New Cabinet Drawer Front",
  "url":"https://www.wikihow.com/Install-a-New-Cabinet-Drawer-Front",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Cabinets and Cupboards"
  ],
  "methods":[
    {
      "name":"Solid Cabinet Drawer Fronts",
      "steps":[
        {
          "headline":"Cut off all of the wood that extends out from the drawer box with a handsaw so that all sides are flush with the drawer box.",
          "description":"Solid cabinet drawer fronts come in 3 sizes and will fit over most existing drawer boxes. Clamp the drawer to keep it from moving while you cut if desired. If the old drawer front is in 2 pieces, you will want to remove the screws or nails that attach the decorative face panel and discard it."
        },
        {
          "headline":"Drill pilot holes on the inside of the new drawer front.",
          "description":""
        },
        {
          "headline":"Fit the new drawer front over the existing drawer box and attach it by drilling screws into the pilot holes.",
          "description":"Be sure that the new drawer fronts overlap the drawer box equally on all sides."
        }
      ]
    },
    {
      "name":"Applied Cabinet Drawer Fronts",
      "steps":[
        {
          "headline":"Unscrew the old drawer front panel and remove it.",
          "description":"Applied drawer fronts are screwed to the drawer box and therefore can be entirely removed without any cutting or fitting."
        },
        {
          "headline":"Drill pilot holes into the inside of the new drawer front.",
          "description":""
        },
        {
          "headline":"Screw the new drawer front onto the drawer box by drilling screws into the pilot holes.",
          "description":"Be sure that the new drawer fronts overlap the drawer box equally on all sides."
        }
      ]
    },
    {
      "name":"False Cabinet Drawer Fronts",
      "steps":[
        {
          "headline":"Cut 2 blocks of wood with a handsaw.",
          "description":"Make the blocks approximately 2 inches (5.8 cm) taller than the opening of where the false drawer front will go."
        },
        {
          "headline":"Screw these blocks into the inside of the cabinet opening, 1 inch (2.54 cm) above and below the opening.",
          "description":""
        },
        {
          "headline":"Attach the false drawer fronts to the blocks of wood from the inside of the cabinet with screws.",
          "description":"Be sure that the false drawer fronts overlap the opening equally on all sides."
        }
      ]
    }
  ],
  "text":" Solid Cabinet Drawer Fronts Cut off all of the wood that extends out from the drawer box with a handsaw so that all sides are flush with the drawer box. Solid cabinet drawer fronts come in 3 sizes and will fit over most existing drawer boxes. Clamp the drawer to keep it from moving while you cut if desired. If the old drawer front is in 2 pieces, you will want to remove the screws or nails that attach the decorative face panel and discard it. Drill pilot holes on the inside of the new drawer front.  Fit the new drawer front over the existing drawer box and attach it by drilling screws into the pilot holes. Be sure that the new drawer fronts overlap the drawer box equally on all sides. Applied Cabinet Drawer Fronts Unscrew the old drawer front panel and remove it. Applied drawer fronts are screwed to the drawer box and therefore can be entirely removed without any cutting or fitting. Drill pilot holes into the inside of the new drawer front.  Screw the new drawer front onto the drawer box by drilling screws into the pilot holes. Be sure that the new drawer fronts overlap the drawer box equally on all sides. False Cabinet Drawer Fronts Cut 2 blocks of wood with a handsaw. Make the blocks approximately 2 inches (5.8 cm) taller than the opening of where the false drawer front will go. Screw these blocks into the inside of the cabinet opening, 1 inch (2.54 cm) above and below the opening.  Attach the false drawer fronts to the blocks of wood from the inside of the cabinet with screws. Be sure that the false drawer fronts overlap the opening equally on all sides.",
  "sentences":[
    " Solid Cabinet Drawer Fronts Cut off all of the wood that extends out from the drawer box with a handsaw so that all sides are flush with the drawer box.",
    "Solid cabinet drawer fronts come in 3 sizes and will fit over most existing drawer boxes.",
    "Clamp the drawer to keep it from moving while you cut if desired.",
    "If the old drawer front is in 2 pieces, you will want to remove the screws or nails that attach the decorative face panel and discard it.",
    "Drill pilot holes on the inside of the new drawer front.",
    "Fit the new drawer front over the existing drawer box and attach it by drilling screws into the pilot holes.",
    "Be sure that the new drawer fronts overlap the drawer box equally on all sides.",
    "Applied Cabinet Drawer Fronts Unscrew the old drawer front panel and remove it.",
    "Applied drawer fronts are screwed to the drawer box and therefore can be entirely removed without any cutting or fitting.",
    "Drill pilot holes into the inside of the new drawer front.",
    "Screw the new drawer front onto the drawer box by drilling screws into the pilot holes.",
    "Be sure that the new drawer fronts overlap the drawer box equally on all sides.",
    "False Cabinet Drawer Fronts Cut 2 blocks of wood with a handsaw.",
    "Make the blocks approximately 2 inches (5.8 cm) taller than the opening of where the false drawer front will go.",
    "Screw these blocks into the inside of the cabinet opening, 1 inch (2.54 cm) above and below the opening.",
    "Attach the false drawer fronts to the blocks of wood from the inside of the cabinet with screws.",
    "Be sure that the false drawer fronts overlap the opening equally on all sides."
  ],
  "tyn_section":[
    "Handsaw",
    "Clamp (optional)",
    "Drill",
    "Screwdriver"
  ],
  "tyn_model":[
    "screws",
    "solid cabinet drawer fronts",
    "solid cabinet drawer",
    "nails",
    "applied cabinet drawer fronts",
    "drilling",
    "wood"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}