{
  "title":"How to Install Recessed Lighting",
  "url":"https://www.wikihow.com/Install-Recessed-Lighting",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Recessed Lighting"
  ],
  "methods":[
    {
      "name":"Getting Started",
      "steps":[
        {
          "headline":"Read the installation instructions.",
          "description":"In the user manual, you'll find a variety of user/installation instructions, including voltage requirements. Reading the user manual will also give you the dimensions of the hole you'll need to cut in which to place your lights."
        },
        {
          "headline":"If possible, consult an electrician to determine how much voltage your circuit can reliably carry.",
          "description":"Installing beautiful recessed lighting may be all the rage, but if your circuit is overloaded, what use will they be for you? If you are taking out old fixtures and installing new ones, you can safely add lights that draw as much amperage (or less) as the previous ones. If you want to add more, consult an electrician. For example, if you had 6 fixtures, each with 100 watt lights, your circuit can hold at least 600 watts before hitting capacity."
        },
        {
          "headline":"Shut off the power before beginning any work.",
          "description":"It is a good idea to lock the circuit breaker panel while you work so that no one else can turn on the circuit. Never work with circuits that are energized."
        },
        {
          "headline":"Mark out the location of each light.",
          "description":"Use the manufacturer's template or make your own by cutting out a circle of paper. Place the template against the ceiling in the desired location and trace around it with a pencil, marking the center point as well. If you want to place your lights according to a straight pattern or in a straight line, consider buying or renting a laser level. This will allow you to plot out the holes for the recessed lighting extremely straight. There's nothing wrong with looking more professional."
        },
        {
          "headline":"Check for obstructions in the ceiling.",
          "description":"Use a stud sensor or other type of structure sensing device to locate any possible obstacles in the area where you're planning to install. If you have an attic or crawl space directly above the light fixtures, start by drilling a 1/4 inch (~6 mm) hole through the ceiling at the center point of each circle. Next, go into the attic and visually check for obstructions around each hole; you will need the light fixture to fit between the ceiling joists. If a finished area is above the ceiling, you can check for obstructions with a wire coat hanger. Bend a length of the coat hanger at 90 degrees about 3 inches (~8 cm) in. Insert the bent wire into each hole you drilled, rotating the bent portion around to check for obstructions. If the wire hits a joist, relocate your lighting fixtures accordingly."
        }
      ]
    },
    {
      "name":"Cutting Holes and Installing Wiring",
      "steps":[
        {
          "headline":"Cut the openings for the lights.",
          "description":"Use a drywall saw to carefully cut around each outline you drew on the ceiling. Avoid cutting too much away; you can always cut more later, but it is much harder to remedy too large a cut. Cover your floor with a painter's canvas and hold a disposal bag underneath the ceiling; any drywall, sheetrock, or insulation that falls down while you're cutting should make it right into your bag."
        },
        {
          "headline":"Install the mounting hardware for each light fixture.",
          "description":"If the attic is above the ceiling, it is best to install mounts that are secured to the joists themselves, as they are very secure. If the area above the ceiling is finished, you can use mounting hardware that fits through the hole you cut and mounts to the drywall itself."
        },
        {
          "headline":"Stapling your wiring about every three feet, put in your loops from fixture to fixture.",
          "description":"Doing this now will save you more time later. Leave about 18 inches (45 cm) of wire hanging down through each hole; this will ensure that you have enough slack to wire each light. If the attic is above the ceiling, you can easily run the wire through the attic. If a finished area is above the ceiling, you can use a long, flexible drill bit to drill the necessary holes in the ceiling joists, and then fish the wires through the joists."
        },
        {
          "headline":"Strip the ends of the wires with a wire stripper.",
          "description":""
        },
        {
          "headline":"Take the stripped wires, connecting the cables that you ran from the power source to the terminals on the fixture's mounting hardware.",
          "description":"If you're using connectors to hook your wires into the fixture, simply snap in the connectors into the housing. Feed one set of wires from the junction box, and any additional wires to the next light in the chain (if you want to work with a single switch) and tighten off at the housing."
        },
        {
          "headline":"Cap any connections with wire connectors.",
          "description":"Lock off the wires into the wire connectors push lock system, organizing the same colors together into one push lock. Put the wires and connectors back into the fixture box. Do this same process for each recessed light you want to install."
        }
      ]
    },
    {
      "name":"Installing the Lights",
      "steps":[
        {
          "headline":"Remove the mounting plate that comes pre-assembled in the lighting cone.",
          "description":"This should be as easy and unscrewing it out of place."
        },
        {
          "headline":"Release the plate assembly on the socket by holding down on the clips above the plate.",
          "description":"Again, the clips should be easy to locate and dislodge the plate assembly when depressed."
        },
        {
          "headline":"Mount the trim to the socket by squeezing the cone trim into place.",
          "description":""
        },
        {
          "headline":"Squeeze the springs together on the outside of the cone trim.",
          "description":"Fit them into the guides along the side of the trim."
        },
        {
          "headline":"Screw in the light bulbs and test your work.",
          "description":"Install the appropriate wattage of light bulb in each fixture, and then turn the power back on to determine if you have successfully wired the lights."
        }
      ]
    }
  ],
  "text":" Getting Started Read the installation instructions. In the user manual, you'll find a variety of user/installation instructions, including voltage requirements. Reading the user manual will also give you the dimensions of the hole you'll need to cut in which to place your lights. If possible, consult an electrician to determine how much voltage your circuit can reliably carry. Installing beautiful recessed lighting may be all the rage, but if your circuit is overloaded, what use will they be for you? If you are taking out old fixtures and installing new ones, you can safely add lights that draw as much amperage (or less) as the previous ones. If you want to add more, consult an electrician. For example, if you had 6 fixtures, each with 100 watt lights, your circuit can hold at least 600 watts before hitting capacity. Shut off the power before beginning any work. It is a good idea to lock the circuit breaker panel while you work so that no one else can turn on the circuit. Never work with circuits that are energized. Mark out the location of each light. Use the manufacturer's template or make your own by cutting out a circle of paper. Place the template against the ceiling in the desired location and trace around it with a pencil, marking the center point as well. If you want to place your lights according to a straight pattern or in a straight line, consider buying or renting a laser level. This will allow you to plot out the holes for the recessed lighting extremely straight. There's nothing wrong with looking more professional. Check for obstructions in the ceiling. Use a stud sensor or other type of structure sensing device to locate any possible obstacles in the area where you're planning to install. If you have an attic or crawl space directly above the light fixtures, start by drilling a 1/4 inch (~6 mm) hole through the ceiling at the center point of each circle. Next, go into the attic and visually check for obstructions around each hole; you will need the light fixture to fit between the ceiling joists. If a finished area is above the ceiling, you can check for obstructions with a wire coat hanger. Bend a length of the coat hanger at 90 degrees about 3 inches (~8 cm) in. Insert the bent wire into each hole you drilled, rotating the bent portion around to check for obstructions. If the wire hits a joist, relocate your lighting fixtures accordingly. Cutting Holes and Installing Wiring Cut the openings for the lights. Use a drywall saw to carefully cut around each outline you drew on the ceiling. Avoid cutting too much away; you can always cut more later, but it is much harder to remedy too large a cut. Cover your floor with a painter's canvas and hold a disposal bag underneath the ceiling; any drywall, sheetrock, or insulation that falls down while you're cutting should make it right into your bag. Install the mounting hardware for each light fixture. If the attic is above the ceiling, it is best to install mounts that are secured to the joists themselves, as they are very secure. If the area above the ceiling is finished, you can use mounting hardware that fits through the hole you cut and mounts to the drywall itself. Stapling your wiring about every three feet, put in your loops from fixture to fixture. Doing this now will save you more time later. Leave about 18 inches (45 cm) of wire hanging down through each hole; this will ensure that you have enough slack to wire each light. If the attic is above the ceiling, you can easily run the wire through the attic. If a finished area is above the ceiling, you can use a long, flexible drill bit to drill the necessary holes in the ceiling joists, and then fish the wires through the joists. Strip the ends of the wires with a wire stripper.  Take the stripped wires, connecting the cables that you ran from the power source to the terminals on the fixture's mounting hardware. If you're using connectors to hook your wires into the fixture, simply snap in the connectors into the housing. Feed one set of wires from the junction box, and any additional wires to the next light in the chain (if you want to work with a single switch) and tighten off at the housing. Cap any connections with wire connectors. Lock off the wires into the wire connectors push lock system, organizing the same colors together into one push lock. Put the wires and connectors back into the fixture box. Do this same process for each recessed light you want to install. Installing the Lights Remove the mounting plate that comes pre-assembled in the lighting cone. This should be as easy and unscrewing it out of place. Release the plate assembly on the socket by holding down on the clips above the plate. Again, the clips should be easy to locate and dislodge the plate assembly when depressed. Mount the trim to the socket by squeezing the cone trim into place.  Squeeze the springs together on the outside of the cone trim. Fit them into the guides along the side of the trim. Screw in the light bulbs and test your work. Install the appropriate wattage of light bulb in each fixture, and then turn the power back on to determine if you have successfully wired the lights.",
  "sentences":[
    " Getting Started Read the installation instructions.",
    "In the user manual, you'll find a variety of user/installation instructions, including voltage requirements.",
    "Reading the user manual will also give you the dimensions of the hole you'll need to cut in which to place your lights.",
    "If possible, consult an electrician to determine how much voltage your circuit can reliably carry.",
    "Installing beautiful recessed lighting may be all the rage, but if your circuit is overloaded, what use will they be for you?",
    "If you are taking out old fixtures and installing new ones, you can safely add lights that draw as much amperage (or less) as the previous ones.",
    "If you want to add more, consult an electrician.",
    "For example, if you had 6 fixtures, each with 100 watt lights, your circuit can hold at least 600 watts before hitting capacity.",
    "Shut off the power before beginning any work.",
    "It is a good idea to lock the circuit breaker panel while you work so that no one else can turn on the circuit.",
    "Never work with circuits that are energized.",
    "Mark out the location of each light.",
    "Use the manufacturer's template or make your own by cutting out a circle of paper.",
    "Place the template against the ceiling in the desired location and trace around it with a pencil, marking the center point as well.",
    "If you want to place your lights according to a straight pattern or in a straight line, consider buying or renting a laser level.",
    "This will allow you to plot out the holes for the recessed lighting extremely straight.",
    "There's nothing wrong with looking more professional.",
    "Check for obstructions in the ceiling.",
    "Use a stud sensor or other type of structure sensing device to locate any possible obstacles in the area where you're planning to install.",
    "If you have an attic or crawl space directly above the light fixtures, start by drilling a 1/4 inch (~6 mm) hole through the ceiling at the center point of each circle.",
    "Next, go into the attic and visually check for obstructions around each hole; you will need the light fixture to fit between the ceiling joists.",
    "If a finished area is above the ceiling, you can check for obstructions with a wire coat hanger.",
    "Bend a length of the coat hanger at 90 degrees about 3 inches (~8 cm) in.",
    "Insert the bent wire into each hole you drilled, rotating the bent portion around to check for obstructions.",
    "If the wire hits a joist, relocate your lighting fixtures accordingly.",
    "Cutting Holes and Installing Wiring Cut the openings for the lights.",
    "Use a drywall saw to carefully cut around each outline you drew on the ceiling.",
    "Avoid cutting too much away; you can always cut more later, but it is much harder to remedy too large a cut.",
    "Cover your floor with a painter's canvas and hold a disposal bag underneath the ceiling; any drywall, sheetrock, or insulation that falls down while you're cutting should make it right into your bag.",
    "Install the mounting hardware for each light fixture.",
    "If the attic is above the ceiling, it is best to install mounts that are secured to the joists themselves, as they are very secure.",
    "If the area above the ceiling is finished, you can use mounting hardware that fits through the hole you cut and mounts to the drywall itself.",
    "Stapling your wiring about every three feet, put in your loops from fixture to fixture.",
    "Doing this now will save you more time later.",
    "Leave about 18 inches (45 cm) of wire hanging down through each hole; this will ensure that you have enough slack to wire each light.",
    "If the attic is above the ceiling, you can easily run the wire through the attic.",
    "If a finished area is above the ceiling, you can use a long, flexible drill bit to drill the necessary holes in the ceiling joists, and then fish the wires through the joists.",
    "Strip the ends of the wires with a wire stripper.",
    "Take the stripped wires, connecting the cables that you ran from the power source to the terminals on the fixture's mounting hardware.",
    "If you're using connectors to hook your wires into the fixture, simply snap in the connectors into the housing.",
    "Feed one set of wires from the junction box, and any additional wires to the next light in the chain (if you want to work with a single switch) and tighten off at the housing.",
    "Cap any connections with wire connectors.",
    "Lock off the wires into the wire connectors push lock system, organizing the same colors together into one push lock.",
    "Put the wires and connectors back into the fixture box.",
    "Do this same process for each recessed light you want to install.",
    "Installing the Lights Remove the mounting plate that comes pre-assembled in the lighting cone.",
    "This should be as easy and unscrewing it out of place.",
    "Release the plate assembly on the socket by holding down on the clips above the plate.",
    "Again, the clips should be easy to locate and dislodge the plate assembly when depressed.",
    "Mount the trim to the socket by squeezing the cone trim into place.",
    "Squeeze the springs together on the outside of the cone trim.",
    "Fit them into the guides along the side of the trim.",
    "Screw in the light bulbs and test your work.",
    "Install the appropriate wattage of light bulb in each fixture, and then turn the power back on to determine if you have successfully wired the lights."
  ],
  "tyn_section":[
    "Circle template",
    "Pencil",
    "Drill",
    "Wire coat hanger",
    "Drywall saw",
    "Wire strippers",
    "Flexible drill bit",
    "Recessed light fixtures",
    "Wire connectors",
    "Light bulbs"
  ],
  "tyn_model":[
    "electrician",
    "wire connectors",
    "plate",
    "circuit breaker",
    "paper",
    "pencil",
    "laser level",
    "wire coat hanger",
    "coat hanger",
    "bent wire",
    "lighting fixtures",
    "drywall saw",
    "painter's canvas",
    "disposal bag",
    "mounting hardware",
    "wire",
    "drill bit",
    "wire stripper",
    "connectors",
    "lighting cone",
    "light bulb"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1904761905,
    "f1":0.2580645161,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7,
    "p":0.380952381,
    "f1":0.4933920705
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.5238095238,
    "f1":0.6330935252
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2857142857,
    "f1":0.3636363636
  }
}