{
  "title":"How to Clean Mussels",
  "url":"https://www.wikihow.com/Clean-Mussels",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Sorting and Storing Mussels",
      "steps":[
        {
          "headline":"Examine the mussels as soon as you get home from the store.",
          "description":"Remove the mussels from whatever packaging the store used right away, otherwise the mussels are at risk of suffocating. If you don’t have time to sort through them immediately, at least move them out of the package and into a bowl in the fridge, and cover them with ice. Mussels are the best when bought and cooked on the same day, though they can last in the fridge for 1 to 2 days if you need to buy them beforehand."
        },
        {
          "headline":"Discard cracked, smashed or open mussels, as they can make you ill. Look at each mussel individually.",
          "description":"Any mussels that have large cracks across them or that are smashed and crumpled need to be thrown away. Chances are, they are already dead. If a mussel is open, that is also a sign that it has died and should be discarded. Not all gaping mussels need to be discarded. You can quickly test to see if it’s still alive by tapping it on the counter or against another mussel. If it closes, that means the mussel is still alive and you can use it. If it doesn’t move, throw it away. Some mussels that are stressed, but not dead, will open slightly, so give them a quick check before throwing them out."
        },
        {
          "headline":"Store fresh mussels in the fridge until you’re ready to use them.",
          "description":"Put the good mussels in a clean bowl, and cover them with a resealable plastic bag that is full of ice. Cover the bag with a damp dishcloth. This will keep the mussels alive and fresh until you’re ready to clean and cook them. If you don’t want to use a dishcloth, you could also use damp paper towels."
        },
        {
          "headline":"Use fresh mussels within 1 to 2 days of purchasing them.",
          "description":"You can sometimes leave them in the fridge for longer, but 1 to 2 days is a safe window. If you do leave them for a few extra days, make sure they still smell like the ocean (rather than like rotten fish) and that they haven’t gotten slimy. If you find you won’t be able to use your mussels in time, you can transfer them to a resealable plastic bag and store them in the freezer for up to 2 to 3 months."
        }
      ]
    },
    {
      "name":"Soaking and Removing the Beard",
      "steps":[
        {
          "headline":"Soak the mussels in a salt water bath for 15 minutes.",
          "description":"Mix 1/4 cup (68 grams) of kosher salt with 3 cups (710 mL) of cold water. Whisk the mixture until the salt is incorporated. Add your mussels to the bath and set a timer for 15 minutes. The mussels will “breathe” and expel salt and dirt from their shells as they soak in the salt water. It helps purify them, and it’ll give you a much nicer eating experience."
        },
        {
          "headline":"Use a slotted spoon to move the mussels from the bath to a colander.",
          "description":"Once the 15 minutes are up, spoon the mussels out of the salt bath and into a colander that has been placed in your sink. Once all the mussels have been removed, you can drain and clean the bowl. Don’t dump the water and mussels into the colander, as all the salt and grime that was released during the salt soak will just end up back on top of the mussels."
        },
        {
          "headline":"Remove the beard from each mussel by pulling it toward the hinge.",
          "description":"Pick each mussel up individually and check for any string-like appendages coming out of them (this is the beard). Grab the beard between your forefinger and thumb, and gently pull it toward the hinge of the mussel to remove it. If you have trouble removing the beard with your fingers, try gripping it with a paper towel or scraping it off with a knife. If you can’t get the entire beard off, that’s okay, too. They’re edible and won’t hurt you if they get cooked in with your meal."
        }
      ]
    },
    {
      "name":"Cleaning off Sand and Debris",
      "steps":[
        {
          "headline":"Run cold water over the de-bearded mussels in the colander.",
          "description":"After you’ve removed the beards from all the mussels, turn on the water and let it run over them as you clean them. Use cool to cold water, rather than warm. If you notice any beards you missed earlier, take a moment to remove them now."
        },
        {
          "headline":"Scrub each mussel to remove sand and grime from the shells.",
          "description":"Use a scrub brush to gently wipe each mussel. Sand and dirt should come away easily, and it shouldn’t take you more than a couple of minutes to clean an entire batch. The shell of the mussel should be smooth to the touch. If you feel any bumps or rough spots, scrub that area a little harder."
        },
        {
          "headline":"Discard any dead or damaged mussels you have may missed initially.",
          "description":"Continually check the mussels to make sure they’re all still alive and well. If you come across any that are open or badly cracked, throw them out. With mussels, it’s better to err on the side of caution and get rid of any suspicious ones. The last thing you want is to end up with food poisoning!"
        },
        {
          "headline":"Set the cleaned mussels on paper towels to dry before you cook them.",
          "description":"After you clean each mussel, set it to the side on a clean paper towel and let them dry as you continue cleaning the rest of your batch. Pat them dry once they’ve all been cleaned, and you’re good to continue on and cook them. You could also set them on a clean dish towel if you don’t use paper towels."
        }
      ]
    }
  ],
  "text":" Sorting and Storing Mussels Examine the mussels as soon as you get home from the store. Remove the mussels from whatever packaging the store used right away, otherwise the mussels are at risk of suffocating. If you don’t have time to sort through them immediately, at least move them out of the package and into a bowl in the fridge, and cover them with ice. Mussels are the best when bought and cooked on the same day, though they can last in the fridge for 1 to 2 days if you need to buy them beforehand. Discard cracked, smashed or open mussels, as they can make you ill. Look at each mussel individually. Any mussels that have large cracks across them or that are smashed and crumpled need to be thrown away. Chances are, they are already dead. If a mussel is open, that is also a sign that it has died and should be discarded. Not all gaping mussels need to be discarded. You can quickly test to see if it’s still alive by tapping it on the counter or against another mussel. If it closes, that means the mussel is still alive and you can use it. If it doesn’t move, throw it away. Some mussels that are stressed, but not dead, will open slightly, so give them a quick check before throwing them out. Store fresh mussels in the fridge until you’re ready to use them. Put the good mussels in a clean bowl, and cover them with a resealable plastic bag that is full of ice. Cover the bag with a damp dishcloth. This will keep the mussels alive and fresh until you’re ready to clean and cook them. If you don’t want to use a dishcloth, you could also use damp paper towels. Use fresh mussels within 1 to 2 days of purchasing them. You can sometimes leave them in the fridge for longer, but 1 to 2 days is a safe window. If you do leave them for a few extra days, make sure they still smell like the ocean (rather than like rotten fish) and that they haven’t gotten slimy. If you find you won’t be able to use your mussels in time, you can transfer them to a resealable plastic bag and store them in the freezer for up to 2 to 3 months. Soaking and Removing the Beard Soak the mussels in a salt water bath for 15 minutes. Mix 1/4 cup (68 grams) of kosher salt with 3 cups (710 mL) of cold water. Whisk the mixture until the salt is incorporated. Add your mussels to the bath and set a timer for 15 minutes. The mussels will “breathe” and expel salt and dirt from their shells as they soak in the salt water. It helps purify them, and it’ll give you a much nicer eating experience. Use a slotted spoon to move the mussels from the bath to a colander. Once the 15 minutes are up, spoon the mussels out of the salt bath and into a colander that has been placed in your sink. Once all the mussels have been removed, you can drain and clean the bowl. Don’t dump the water and mussels into the colander, as all the salt and grime that was released during the salt soak will just end up back on top of the mussels. Remove the beard from each mussel by pulling it toward the hinge. Pick each mussel up individually and check for any string-like appendages coming out of them (this is the beard). Grab the beard between your forefinger and thumb, and gently pull it toward the hinge of the mussel to remove it. If you have trouble removing the beard with your fingers, try gripping it with a paper towel or scraping it off with a knife. If you can’t get the entire beard off, that’s okay, too. They’re edible and won’t hurt you if they get cooked in with your meal. Cleaning off Sand and Debris Run cold water over the de-bearded mussels in the colander. After you’ve removed the beards from all the mussels, turn on the water and let it run over them as you clean them. Use cool to cold water, rather than warm. If you notice any beards you missed earlier, take a moment to remove them now. Scrub each mussel to remove sand and grime from the shells. Use a scrub brush to gently wipe each mussel. Sand and dirt should come away easily, and it shouldn’t take you more than a couple of minutes to clean an entire batch. The shell of the mussel should be smooth to the touch. If you feel any bumps or rough spots, scrub that area a little harder. Discard any dead or damaged mussels you have may missed initially. Continually check the mussels to make sure they’re all still alive and well. If you come across any that are open or badly cracked, throw them out. With mussels, it’s better to err on the side of caution and get rid of any suspicious ones. The last thing you want is to end up with food poisoning! Set the cleaned mussels on paper towels to dry before you cook them. After you clean each mussel, set it to the side on a clean paper towel and let them dry as you continue cleaning the rest of your batch. Pat them dry once they’ve all been cleaned, and you’re good to continue on and cook them. You could also set them on a clean dish towel if you don’t use paper towels.",
  "sentences":[
    " Sorting and Storing Mussels Examine the mussels as soon as you get home from the store.",
    "Remove the mussels from whatever packaging the store used right away, otherwise the mussels are at risk of suffocating.",
    "If you don’t have time to sort through them immediately, at least move them out of the package and into a bowl in the fridge, and cover them with ice.",
    "Mussels are the best when bought and cooked on the same day, though they can last in the fridge for 1 to 2 days if you need to buy them beforehand.",
    "Discard cracked, smashed or open mussels, as they can make you ill. Look at each mussel individually.",
    "Any mussels that have large cracks across them or that are smashed and crumpled need to be thrown away.",
    "Chances are, they are already dead.",
    "If a mussel is open, that is also a sign that it has died and should be discarded.",
    "Not all gaping mussels need to be discarded.",
    "You can quickly test to see if it’s still alive by tapping it on the counter or against another mussel.",
    "If it closes, that means the mussel is still alive and you can use it.",
    "If it doesn’t move, throw it away.",
    "Some mussels that are stressed, but not dead, will open slightly, so give them a quick check before throwing them out.",
    "Store fresh mussels in the fridge until you’re ready to use them.",
    "Put the good mussels in a clean bowl, and cover them with a resealable plastic bag that is full of ice.",
    "Cover the bag with a damp dishcloth.",
    "This will keep the mussels alive and fresh until you’re ready to clean and cook them.",
    "If you don’t want to use a dishcloth, you could also use damp paper towels.",
    "Use fresh mussels within 1 to 2 days of purchasing them.",
    "You can sometimes leave them in the fridge for longer, but 1 to 2 days is a safe window.",
    "If you do leave them for a few extra days, make sure they still smell like the ocean (rather than like rotten fish) and that they haven’t gotten slimy.",
    "If you find you won’t be able to use your mussels in time, you can transfer them to a resealable plastic bag and store them in the freezer for up to 2 to 3 months.",
    "Soaking and Removing the Beard Soak the mussels in a salt water bath for 15 minutes.",
    "Mix 1/4 cup (68 grams) of kosher salt with 3 cups (710 mL) of cold water.",
    "Whisk the mixture until the salt is incorporated.",
    "Add your mussels to the bath and set a timer for 15 minutes.",
    "The mussels will “breathe” and expel salt and dirt from their shells as they soak in the salt water.",
    "It helps purify them, and it’ll give you a much nicer eating experience.",
    "Use a slotted spoon to move the mussels from the bath to a colander.",
    "Once the 15 minutes are up, spoon the mussels out of the salt bath and into a colander that has been placed in your sink.",
    "Once all the mussels have been removed, you can drain and clean the bowl.",
    "Don’t dump the water and mussels into the colander, as all the salt and grime that was released during the salt soak will just end up back on top of the mussels.",
    "Remove the beard from each mussel by pulling it toward the hinge.",
    "Pick each mussel up individually and check for any string-like appendages coming out of them (this is the beard).",
    "Grab the beard between your forefinger and thumb, and gently pull it toward the hinge of the mussel to remove it.",
    "If you have trouble removing the beard with your fingers, try gripping it with a paper towel or scraping it off with a knife.",
    "If you can’t get the entire beard off, that’s okay, too.",
    "They’re edible and won’t hurt you if they get cooked in with your meal.",
    "Cleaning off Sand and Debris Run cold water over the de-bearded mussels in the colander.",
    "After you’ve removed the beards from all the mussels, turn on the water and let it run over them as you clean them.",
    "Use cool to cold water, rather than warm.",
    "If you notice any beards you missed earlier, take a moment to remove them now.",
    "Scrub each mussel to remove sand and grime from the shells.",
    "Use a scrub brush to gently wipe each mussel.",
    "Sand and dirt should come away easily, and it shouldn’t take you more than a couple of minutes to clean an entire batch.",
    "The shell of the mussel should be smooth to the touch.",
    "If you feel any bumps or rough spots, scrub that area a little harder.",
    "Discard any dead or damaged mussels you have may missed initially.",
    "Continually check the mussels to make sure they’re all still alive and well.",
    "If you come across any that are open or badly cracked, throw them out.",
    "With mussels, it’s better to err on the side of caution and get rid of any suspicious ones.",
    "The last thing you want is to end up with food poisoning!",
    "Set the cleaned mussels on paper towels to dry before you cook them.",
    "After you clean each mussel, set it to the side on a clean paper towel and let them dry as you continue cleaning the rest of your batch.",
    "Pat them dry once they’ve all been cleaned, and you’re good to continue on and cook them.",
    "You could also set them on a clean dish towel if you don’t use paper towels."
  ],
  "tyn_section":[
    "Resealable plastic bags (optional)",
    "Bowl(s)",
    "Measuring cups",
    "Kosher salt",
    "Whisk",
    "Colander",
    "Scrub brush",
    "Paper towels",
    "Knife (optional)",
    "Slotted spoon"
  ],
  "tyn_model":[
    "mussels",
    "colander",
    "water",
    "bowl",
    "fridge",
    "ice",
    "mussel",
    "resealable plastic bag",
    "salt water",
    "salt",
    "paper towels",
    "dishcloth",
    "kosher salt",
    "cold water",
    "“breathe",
    "” and",
    "slotted spoon",
    "bath",
    "salt bath",
    "knife",
    "scrub brush",
    "paper towel",
    "dish towel"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.2173913043,
    "f1":0.303030303,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.3043478261,
    "f1":0.4038461538
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7,
    "p":0.4782608696,
    "f1":0.5682656827
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2173913043,
    "f1":0.303030303
  }
}