{
  "title":"How to Reheat Ribs",
  "url":"https://www.wikihow.com/Reheat-Ribs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Reheating Ribs with an Oven",
      "steps":[
        {
          "headline":"Thaw your ribs that need to be reheated if applicable.",
          "description":""
        },
        {
          "headline":"Preheat your oven to 250 degrees Fahrenheit (121 degrees Celsius).",
          "description":"If the oven is any hotter than this, there is risk of the rib meat shrinking and getting tough."
        },
        {
          "headline":"Slather barbecue sauce over the rib meat on all sides.",
          "description":""
        },
        {
          "headline":"Wrap the ribs to be reheated in 2 layers of foil.",
          "description":"Be careful to not rip the foil otherwise the rib meat could dry out."
        },
        {
          "headline":"Set the foil wrapped ribs onto a baking pan or cooking sheet and put in the middle rack of your oven.",
          "description":""
        },
        {
          "headline":"Heat until the center of the rib meat is 155 degrees Fahrenheit (66 degrees Celsius).",
          "description":"This takes approximately 1 hour, depending on the size of the cut."
        },
        {
          "headline":"Remove the foil from the ribs and set the oven to \"Broil.\"",
          "description":"Allow ribs to sit in the oven on broil with the oven door open on 1 side for 5-10 minutes then turn to opposite side until the BBQ sauce bubbles. The door should remain open so the thermostat in the oven does not turn off."
        },
        {
          "headline":"Remove reheated ribs from oven and allow to sit for 5 minutes or until ready to eat.",
          "description":""
        }
      ]
    },
    {
      "name":"Reheating Ribs on a Grill",
      "steps":[
        {
          "headline":"Thaw your ribs that need to be reheated if applicable.",
          "description":""
        },
        {
          "headline":"Coat both sides of the ribs with barbecue sauce along the rib meat.",
          "description":""
        },
        {
          "headline":"Heat your grill to approximately 250 degrees Fahrenheit (121 degrees Celsius) with the lid closed.",
          "description":"If you are using a gas grill, this is a medium setting."
        },
        {
          "headline":"Wrap the ribs with 2 layers of foil.",
          "description":""
        },
        {
          "headline":"Set the ribs on the grill in a spot with indirect heat and reheat until the rib meat comes to approximately 155 degrees Fahrenheit (66 degrees Celsius).",
          "description":""
        },
        {
          "headline":"Take ribs out of foil and place on the grill in a spot with direct heat for approximately 5 to10 minutes per side until the barbecue sauce is bubbling.",
          "description":""
        },
        {
          "headline":"Remove the ribs and allow them to cool until they're ready to serve.",
          "description":""
        }
      ]
    }
  ],
  "text":" Reheating Ribs with an Oven Thaw your ribs that need to be reheated if applicable.  Preheat your oven to 250 degrees Fahrenheit (121 degrees Celsius). If the oven is any hotter than this, there is risk of the rib meat shrinking and getting tough. Slather barbecue sauce over the rib meat on all sides.  Wrap the ribs to be reheated in 2 layers of foil. Be careful to not rip the foil otherwise the rib meat could dry out. Set the foil wrapped ribs onto a baking pan or cooking sheet and put in the middle rack of your oven.  Heat until the center of the rib meat is 155 degrees Fahrenheit (66 degrees Celsius). This takes approximately 1 hour, depending on the size of the cut. Remove the foil from the ribs and set the oven to \"Broil.\" Allow ribs to sit in the oven on broil with the oven door open on 1 side for 5-10 minutes then turn to opposite side until the BBQ sauce bubbles. The door should remain open so the thermostat in the oven does not turn off. Remove reheated ribs from oven and allow to sit for 5 minutes or until ready to eat.  Reheating Ribs on a Grill Thaw your ribs that need to be reheated if applicable.  Coat both sides of the ribs with barbecue sauce along the rib meat.  Heat your grill to approximately 250 degrees Fahrenheit (121 degrees Celsius) with the lid closed. If you are using a gas grill, this is a medium setting. Wrap the ribs with 2 layers of foil.  Set the ribs on the grill in a spot with indirect heat and reheat until the rib meat comes to approximately 155 degrees Fahrenheit (66 degrees Celsius).  Take ribs out of foil and place on the grill in a spot with direct heat for approximately 5 to10 minutes per side until the barbecue sauce is bubbling.  Remove the ribs and allow them to cool until they're ready to serve. ",
  "sentences":[
    " Reheating Ribs with an Oven Thaw your ribs that need to be reheated if applicable.",
    "Preheat your oven to 250 degrees Fahrenheit (121 degrees Celsius).",
    "If the oven is any hotter than this, there is risk of the rib meat shrinking and getting tough.",
    "Slather barbecue sauce over the rib meat on all sides.",
    "Wrap the ribs to be reheated in 2 layers of foil.",
    "Be careful to not rip the foil otherwise the rib meat could dry out.",
    "Set the foil wrapped ribs onto a baking pan or cooking sheet and put in the middle rack of your oven.",
    "Heat until the center of the rib meat is 155 degrees Fahrenheit (66 degrees Celsius).",
    "This takes approximately 1 hour, depending on the size of the cut.",
    "Remove the foil from the ribs and set the oven to \"Broil.\"",
    "Allow ribs to sit in the oven on broil with the oven door open on 1 side for 5-10 minutes then turn to opposite side until the BBQ sauce bubbles.",
    "The door should remain open so the thermostat in the oven does not turn off.",
    "Remove reheated ribs from oven and allow to sit for 5 minutes or until ready to eat.",
    "Reheating Ribs on a Grill Thaw your ribs that need to be reheated if applicable.",
    "Coat both sides of the ribs with barbecue sauce along the rib meat.",
    "Heat your grill to approximately 250 degrees Fahrenheit (121 degrees Celsius) with the lid closed.",
    "If you are using a gas grill, this is a medium setting.",
    "Wrap the ribs with 2 layers of foil.",
    "Set the ribs on the grill in a spot with indirect heat and reheat until the rib meat comes to approximately 155 degrees Fahrenheit (66 degrees Celsius).",
    "Take ribs out of foil and place on the grill in a spot with direct heat for approximately 5 to10 minutes per side until the barbecue sauce is bubbling.",
    "Remove the ribs and allow them to cool until they're ready to serve."
  ],
  "tyn_section":[
    "Barbecue sauce",
    "Foil"
  ],
  "tyn_model":[
    "oven",
    "ribs",
    "foil",
    "grill",
    "barbecue sauce",
    "baking pan",
    "cooking sheet",
    "bbq sauce",
    "gas grill"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.2222222222,
    "f1":0.3636363636,
    "avg_pos":0.4444444444
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.2222222222,
    "f1":0.3636363636
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.2222222222,
    "f1":0.3636363636
  }
}