{
  "title":"How to Cook a T Bone Steak",
  "url":"https://www.wikihow.com/Cook-a-T-Bone-Steak",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb",
    "Steak Dishes"
  ],
  "methods":[
    {
      "name":"Prepping Your Steak",
      "steps":[
        {
          "headline":"Purchase high-quality steak.",
          "description":"A firm, bright red, steak will be fresher than a soft, darker colored, one. Also look for an even distribution of thin white lines of fat, known as marbling, throughout the surface. The marbling melts and moistens the meat during cooking, making your steak tender and flavorful. Choose an evenly cut steak that is about 1 1/4 inches  (31.75 mm) thick. Check the packing and expiration dates to confirm freshness. If you're buying your steak in the United States, look out for the USDA beef grade on the label, which is an official indicator of quality: \"Prime\" is the best, followed by \"Choice,\" and then \"Select.\""
        },
        {
          "headline":"Thaw your steak.",
          "description":"Take your steak out of the fridge or freezer before cooking to let it thaw to room temperature, about 70ºF (21ºC). Avoid cooking your steak cold because the meat will contract and be tough to chew."
        },
        {
          "headline":"Make sure your steak is dry.",
          "description":"Pat it down with a paper towel. The meat should be dry so that you do not end up steaming it instead!"
        },
        {
          "headline":"Season your steak.",
          "description":"Gentle seasoning, such as a sprinkling of salt, will help enhance the natural flavors of your steak. If you're feeling adventurous, you could also try pepper, paprika, or other dry spices. Avoid over-seasoning because it will prevent you from tasting your steak's natural goodness. If you use salt, don't season your steaks right before cooking, as this will add moisture which will interfere with the cooking process. If you would like to use wet seasonings, it is best to marinate and refrigerate your steak for a couple of hours. Remember to also allow time for it to be removed from the fridge and reach room temperature before cooking."
        }
      ]
    },
    {
      "name":"Pan-Searing",
      "steps":[
        {
          "headline":"Prepare your pan.",
          "description":"Heat two tablespoons of olive or vegetable oil in a frying pan over a medium heat. If possible, use a cast-iron skillet or other heavy frying pan."
        },
        {
          "headline":"Sear your steak.",
          "description":"Using tongs or a spatula, sear each side of the steak, occasionally moving it to ensure it doesn't stick to the pan. Hold the steak up vertically in the pan to sear the edges. Sear for about 5-6 minutes for rare, 6-7 minutes for medium rare, and 7-8 minutes for medium."
        },
        {
          "headline":"Wrap your steak and let it sit for a few minutes before serving.",
          "description":"Remove the steak from the pan if it is charred to your liking. Wrap it in aluminum foil and allow it to sit for 5-10 minutes, as this allows the flavors to mix and settle. Serve whole or sliced."
        }
      ]
    },
    {
      "name":"Grilling",
      "steps":[
        {
          "headline":"Preheat your grill.",
          "description":"Whether you're using a charcoal, gas, or electric grill, get it heated to about 500ºF (260ºC)."
        },
        {
          "headline":"Protect your grill against sticking.",
          "description":"Unless your grill has a non-stick surface, coat it with non-stick cooking spray to prevent the meat from sticking to it."
        },
        {
          "headline":"Grill your steak.",
          "description":"Place the steak in the hottest part of the grill, usually the middle. For rare, cook it for 2 minutes on each side and then move it to the cooler part of the grill, usually the edges, for another 6-8 minutes, flipping occasionally. For medium rare add 1-3 minutes and for medium add 3-5 minutes to the total cooking time."
        },
        {
          "headline":"Let your steak sit for a few minutes before serving.",
          "description":"Remove the steak from the grill if it is charred to your liking. Use a small sharp knife, to make a small cut in the middle of the steak. If it looks done, allow it to sit for 10-15 minutes as this allows the flavors to mix and settle. If not, grill for another 1-2 minutes. Serve whole or sliced."
        }
      ]
    },
    {
      "name":"Broiling",
      "steps":[
        {
          "headline":"Preheat your broiler.",
          "description":"Turn on your broiler and get it heated to about 550ºF (290ºC). Also position the top rack 5 inches (12 cm) from the top of the broiler."
        },
        {
          "headline":"Prepare your pan.",
          "description":"Unless your grill pan has a non-stick surface, coat it with non-stick cooking spray or oil to prevent the meat from sticking to it."
        },
        {
          "headline":"Broil your steak.",
          "description":"Place your steak in the grill pan and place the pan on the top rack of the preheated broiler. For rare, close the door and allow it to cook for 4 minutes, before opening the door and flipping it to cook for another 4 minutes on the other side. For medium rare, add 1-3 minutes and for medium, add 3-5 minutes, to the total cooking time."
        },
        {
          "headline":"Check and serve your steak.",
          "description":"Remove the steak from the broiler if it is charred to your liking. Use a small sharp knife, to make a small cut in the middle of the steak. If it looks done, serve immediately; if not, return it to the oven and broil it for another minute before removing and serving it. Serve whole or sliced."
        }
      ]
    },
    {
      "name":"Sear-Roasting",
      "steps":[
        {
          "headline":"Preheat your oven.",
          "description":"Turn on your oven and get it heated to about 450ºF (230ºC)."
        },
        {
          "headline":"Prepare your pan.",
          "description":"Heat 1 tablespoon of olive, canola, or other vegetable oil in a cast-iron skillet or other heavy pan on your burner, over high heat."
        },
        {
          "headline":"Sear your steak.",
          "description":"Place your steak in the hot pan once it begins to smoke. Reduce heat and sear on each side for 4 minutes, until brown, for rare. For medium rare, sear for 1 minute longer and for medium 2 minutes longer."
        },
        {
          "headline":"Roast your steak.",
          "description":"Remove the skillet from the burner and transfer it to the preheated oven and roast for 6-8 minutes."
        },
        {
          "headline":"Let your steak sit for a few minutes before serving.",
          "description":"Remove the steak from the oven if it is charred to your liking. Use a small sharp knife, to make a small cut in the middle of the steak. If it looks done, allow it to sit for 10-15 minutes as this allows the flavors to mix and settle. If not, roast for another 1-2 minutes. Allow it to sit for about 10 minutes as this allows the flavors to mix and settle. Serve whole or sliced."
        }
      ]
    }
  ],
  "text":" Prepping Your Steak Purchase high-quality steak. A firm, bright red, steak will be fresher than a soft, darker colored, one. Also look for an even distribution of thin white lines of fat, known as marbling, throughout the surface. The marbling melts and moistens the meat during cooking, making your steak tender and flavorful. Choose an evenly cut steak that is about 1 1/4 inches  (31.75 mm) thick. Check the packing and expiration dates to confirm freshness. If you're buying your steak in the United States, look out for the USDA beef grade on the label, which is an official indicator of quality: \"Prime\" is the best, followed by \"Choice,\" and then \"Select.\" Thaw your steak. Take your steak out of the fridge or freezer before cooking to let it thaw to room temperature, about 70ºF (21ºC). Avoid cooking your steak cold because the meat will contract and be tough to chew. Make sure your steak is dry. Pat it down with a paper towel. The meat should be dry so that you do not end up steaming it instead! Season your steak. Gentle seasoning, such as a sprinkling of salt, will help enhance the natural flavors of your steak. If you're feeling adventurous, you could also try pepper, paprika, or other dry spices. Avoid over-seasoning because it will prevent you from tasting your steak's natural goodness. If you use salt, don't season your steaks right before cooking, as this will add moisture which will interfere with the cooking process. If you would like to use wet seasonings, it is best to marinate and refrigerate your steak for a couple of hours. Remember to also allow time for it to be removed from the fridge and reach room temperature before cooking. Pan-Searing Prepare your pan. Heat two tablespoons of olive or vegetable oil in a frying pan over a medium heat. If possible, use a cast-iron skillet or other heavy frying pan. Sear your steak. Using tongs or a spatula, sear each side of the steak, occasionally moving it to ensure it doesn't stick to the pan. Hold the steak up vertically in the pan to sear the edges. Sear for about 5-6 minutes for rare, 6-7 minutes for medium rare, and 7-8 minutes for medium. Wrap your steak and let it sit for a few minutes before serving. Remove the steak from the pan if it is charred to your liking. Wrap it in aluminum foil and allow it to sit for 5-10 minutes, as this allows the flavors to mix and settle. Serve whole or sliced. Grilling Preheat your grill. Whether you're using a charcoal, gas, or electric grill, get it heated to about 500ºF (260ºC). Protect your grill against sticking. Unless your grill has a non-stick surface, coat it with non-stick cooking spray to prevent the meat from sticking to it. Grill your steak. Place the steak in the hottest part of the grill, usually the middle. For rare, cook it for 2 minutes on each side and then move it to the cooler part of the grill, usually the edges, for another 6-8 minutes, flipping occasionally. For medium rare add 1-3 minutes and for medium add 3-5 minutes to the total cooking time. Let your steak sit for a few minutes before serving. Remove the steak from the grill if it is charred to your liking. Use a small sharp knife, to make a small cut in the middle of the steak. If it looks done, allow it to sit for 10-15 minutes as this allows the flavors to mix and settle. If not, grill for another 1-2 minutes. Serve whole or sliced. Broiling Preheat your broiler. Turn on your broiler and get it heated to about 550ºF (290ºC). Also position the top rack 5 inches (12 cm) from the top of the broiler. Prepare your pan. Unless your grill pan has a non-stick surface, coat it with non-stick cooking spray or oil to prevent the meat from sticking to it. Broil your steak. Place your steak in the grill pan and place the pan on the top rack of the preheated broiler. For rare, close the door and allow it to cook for 4 minutes, before opening the door and flipping it to cook for another 4 minutes on the other side. For medium rare, add 1-3 minutes and for medium, add 3-5 minutes, to the total cooking time. Check and serve your steak. Remove the steak from the broiler if it is charred to your liking. Use a small sharp knife, to make a small cut in the middle of the steak. If it looks done, serve immediately; if not, return it to the oven and broil it for another minute before removing and serving it. Serve whole or sliced. Sear-Roasting Preheat your oven. Turn on your oven and get it heated to about 450ºF (230ºC). Prepare your pan. Heat 1 tablespoon of olive, canola, or other vegetable oil in a cast-iron skillet or other heavy pan on your burner, over high heat. Sear your steak. Place your steak in the hot pan once it begins to smoke. Reduce heat and sear on each side for 4 minutes, until brown, for rare. For medium rare, sear for 1 minute longer and for medium 2 minutes longer. Roast your steak. Remove the skillet from the burner and transfer it to the preheated oven and roast for 6-8 minutes. Let your steak sit for a few minutes before serving. Remove the steak from the oven if it is charred to your liking. Use a small sharp knife, to make a small cut in the middle of the steak. If it looks done, allow it to sit for 10-15 minutes as this allows the flavors to mix and settle. If not, roast for another 1-2 minutes. Allow it to sit for about 10 minutes as this allows the flavors to mix and settle. Serve whole or sliced.",
  "sentences":[
    " Prepping Your Steak Purchase high-quality steak.",
    "A firm, bright red, steak will be fresher than a soft, darker colored, one.",
    "Also look for an even distribution of thin white lines of fat, known as marbling, throughout the surface.",
    "The marbling melts and moistens the meat during cooking, making your steak tender and flavorful.",
    "Choose an evenly cut steak that is about 1 1/4 inches  (31.75 mm) thick.",
    "Check the packing and expiration dates to confirm freshness.",
    "If you're buying your steak in the United States, look out for the USDA beef grade on the label, which is an official indicator of quality: \"Prime\" is the best, followed by \"Choice,\" and then \"Select.\"",
    "Thaw your steak.",
    "Take your steak out of the fridge or freezer before cooking to let it thaw to room temperature, about 70ºF (21ºC).",
    "Avoid cooking your steak cold because the meat will contract and be tough to chew.",
    "Make sure your steak is dry.",
    "Pat it down with a paper towel.",
    "The meat should be dry so that you do not end up steaming it instead!",
    "Season your steak.",
    "Gentle seasoning, such as a sprinkling of salt, will help enhance the natural flavors of your steak.",
    "If you're feeling adventurous, you could also try pepper, paprika, or other dry spices.",
    "Avoid over-seasoning because it will prevent you from tasting your steak's natural goodness.",
    "If you use salt, don't season your steaks right before cooking, as this will add moisture which will interfere with the cooking process.",
    "If you would like to use wet seasonings, it is best to marinate and refrigerate your steak for a couple of hours.",
    "Remember to also allow time for it to be removed from the fridge and reach room temperature before cooking.",
    "Pan-Searing Prepare your pan.",
    "Heat two tablespoons of olive or vegetable oil in a frying pan over a medium heat.",
    "If possible, use a cast-iron skillet or other heavy frying pan.",
    "Sear your steak.",
    "Using tongs or a spatula, sear each side of the steak, occasionally moving it to ensure it doesn't stick to the pan.",
    "Hold the steak up vertically in the pan to sear the edges.",
    "Sear for about 5-6 minutes for rare, 6-7 minutes for medium rare, and 7-8 minutes for medium.",
    "Wrap your steak and let it sit for a few minutes before serving.",
    "Remove the steak from the pan if it is charred to your liking.",
    "Wrap it in aluminum foil and allow it to sit for 5-10 minutes, as this allows the flavors to mix and settle.",
    "Serve whole or sliced.",
    "Grilling Preheat your grill.",
    "Whether you're using a charcoal, gas, or electric grill, get it heated to about 500ºF (260ºC).",
    "Protect your grill against sticking.",
    "Unless your grill has a non-stick surface, coat it with non-stick cooking spray to prevent the meat from sticking to it.",
    "Grill your steak.",
    "Place the steak in the hottest part of the grill, usually the middle.",
    "For rare, cook it for 2 minutes on each side and then move it to the cooler part of the grill, usually the edges, for another 6-8 minutes, flipping occasionally.",
    "For medium rare add 1-3 minutes and for medium add 3-5 minutes to the total cooking time.",
    "Let your steak sit for a few minutes before serving.",
    "Remove the steak from the grill if it is charred to your liking.",
    "Use a small sharp knife, to make a small cut in the middle of the steak.",
    "If it looks done, allow it to sit for 10-15 minutes as this allows the flavors to mix and settle.",
    "If not, grill for another 1-2 minutes.",
    "Serve whole or sliced.",
    "Broiling Preheat your broiler.",
    "Turn on your broiler and get it heated to about 550ºF (290ºC).",
    "Also position the top rack 5 inches (12 cm) from the top of the broiler.",
    "Prepare your pan.",
    "Unless your grill pan has a non-stick surface, coat it with non-stick cooking spray or oil to prevent the meat from sticking to it.",
    "Broil your steak.",
    "Place your steak in the grill pan and place the pan on the top rack of the preheated broiler.",
    "For rare, close the door and allow it to cook for 4 minutes, before opening the door and flipping it to cook for another 4 minutes on the other side.",
    "For medium rare, add 1-3 minutes and for medium, add 3-5 minutes, to the total cooking time.",
    "Check and serve your steak.",
    "Remove the steak from the broiler if it is charred to your liking.",
    "Use a small sharp knife, to make a small cut in the middle of the steak.",
    "If it looks done, serve immediately; if not, return it to the oven and broil it for another minute before removing and serving it.",
    "Serve whole or sliced.",
    "Sear-Roasting Preheat your oven.",
    "Turn on your oven and get it heated to about 450ºF (230ºC).",
    "Prepare your pan.",
    "Heat 1 tablespoon of olive, canola, or other vegetable oil in a cast-iron skillet or other heavy pan on your burner, over high heat.",
    "Sear your steak.",
    "Place your steak in the hot pan once it begins to smoke.",
    "Reduce heat and sear on each side for 4 minutes, until brown, for rare.",
    "For medium rare, sear for 1 minute longer and for medium 2 minutes longer.",
    "Roast your steak.",
    "Remove the skillet from the burner and transfer it to the preheated oven and roast for 6-8 minutes.",
    "Let your steak sit for a few minutes before serving.",
    "Remove the steak from the oven if it is charred to your liking.",
    "Use a small sharp knife, to make a small cut in the middle of the steak.",
    "If it looks done, allow it to sit for 10-15 minutes as this allows the flavors to mix and settle.",
    "If not, roast for another 1-2 minutes.",
    "Allow it to sit for about 10 minutes as this allows the flavors to mix and settle.",
    "Serve whole or sliced."
  ],
  "tyn_section":[
    "T-bone steak",
    "Salt, pepper, or other seasonings",
    "Canola, olive, or other vegetable oil",
    "Paper towels",
    "Tongs or spatula",
    "Meat thermometer",
    "Pairing knife or another sharp small knife"
  ],
  "tyn_model":[
    "grill",
    "broiler",
    "oven",
    "steak",
    "salt",
    "frying pan",
    "cast-iron skillet",
    "sharp knife",
    "grill pan",
    "paper towel",
    "pepper",
    "paprika",
    "spices",
    "seasonings",
    "pan",
    "olive or vegetable oil",
    "spatula",
    "aluminum foil",
    "non-stick cooking spray",
    "non-stick cooking spray or oil",
    "olive, canola,",
    "vegetable oil",
    "skillet",
    "knife"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1428571429,
    "p":0.0416666667,
    "f1":0.064516129
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.2916666667,
    "f1":0.4142011834
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}