{
  "title":"How to Brine Chicken",
  "url":"https://www.wikihow.com/Brine-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Making a Wet Brine",
      "steps":[
        {
          "headline":"Pour some water into a large bowl, up to a gallon.",
          "description":"The bowl will need to be large enough to submerge all of the chicken you are cooking, but also able to fit into your refrigerator. Fill the bowl with enough water to cover the chicken completely. Consider using warm water as you will be dissolving some solids into solution. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tBrining adds flavor and moisture. Alex Hong, the Executive Chef and owner of Sorrel, agrees: \"I don't like to use tenderizers or pound chicken with a mallet because I feel like it ruins the texture of the bird. Brining makes chicken so much juicier, and it really adds a lot of flavor.\""
        },
        {
          "headline":"Add 3/4 cup of salt for every gallon of water.",
          "description":"All brine contains salt, as it is necessary to force the water into the meat's cells. The amount of salt used can vary greatly, but start by adding 3/4 cup of kosher salt per gallon of water (46 ml of salt per liter of water). Stir the salt into the water to dissolve it."
        },
        {
          "headline":"Add sugar to the water.",
          "description":"Sugar, while not required in a brine, is a useful ingredient to brown the skin. Adding sugar to a brine will increase the amount of caramelization achieved when cooking the chicken, regardless of cooking method. Try adding the same amount of sugar as salt. You can use any type of sugar, including white, brown, turbinado, or even molasses or honey. Stir the water to dissolve the sugar."
        },
        {
          "headline":"Add any other desired seasonings to the brine.",
          "description":"You can also add other ingredients to your brine to season the chicken. Peppercorns, fresh herbs, and fruit juices are all options for seasoning a brine. Some great ingredients to mix and match include:\nAdd aromatics such as: 2-4 cloves of garlic (crushed with a knife), bay leaves, a handful thyme, sage, or rosemary sprigs, 2-3 tablespoons uncracked peppercorns, parsley, juice from 1-2 large lemons or oranges, bay leaves, or 1-2 tablespoons of mustard, cumin, or coriander seeds. Beer and Tyme Brine: Mix 4 12-ounce cans beer (lager, like Budweiser), 1 cup kosher salt, 3/4 cup light-brown sugar, Small handful of thyme sprigs, 5 bay leaves, 1 tablespoon cracked black pepper, and 6 cups ice in a large saucepot. Rosemary Lemon Brine: 1 small onion, thinly sliced, 4 garlic cloves, smashed with the flat side of a knife, 1 teaspoon vegetable oil, 1 cup Kosher salt, 5 or 6 branches rosemary, 1 liter water, juice of 1 lemon."
        },
        {
          "headline":"Boil your brine mixture before adding chicken if you have added seasonings.",
          "description":"Otherwise, the flavors won't penetrate the chicken. Add all ingredients (salt, sugar, water, seasonings etc.) and bring to a boil for approximately 1 minute. Allow to cool completely before moving on."
        },
        {
          "headline":"Place the chicken into the brining solution.",
          "description":"Make sure that the chicken is fully submerged in the brine. You can use a brine for either a whole chicken or for smaller pieces of chicken; the process is the same either way."
        },
        {
          "headline":"Place the brine in the refrigerator and let it soak.",
          "description":"Place the entire bowl into the refrigerator, covering it with plastic wrap. Let the chicken soak in the brining solution for several hours. For small pieces, 1 or 2 hours is sufficient, while 8 to12 hours is ideal for a whole chicken. If you can't spare that much time, a brine will still impart flavor and improve tenderness if used for only a short period of time, at least 2 hours. Never brine chicken at room temperature, as this can lead to bacteria growth."
        },
        {
          "headline":"Remove the chicken from the brine.",
          "description":"Take the chicken out of the brining solution and pat off the excess water before cooking. Dispose of the brining solution by pouring it down the drain."
        }
      ]
    },
    {
      "name":"Making a Dry Brine",
      "steps":[
        {
          "headline":"Know that dry brines keep your chicken flavorful and the skin extra crispy.",
          "description":"While wet brines are the traditional way to prep a roast chicken, many chefs are starting to experiment with dry brines instead, which lead to a more robust texture. The salt draws out moisture, which dissolves the salt into a thin, natural wet brine that the chicken then reabsorbs. Use course sea salt or kosher whenever possible for a dry brine. Fine-grained salts, like table salt, will coat too much of the chicken, dissolve too quickly, and make the final roast taste too salty."
        },
        {
          "headline":"Pat the chicken dry.",
          "description":"Use a paper towel to get as much moisture off the outside of the chicken as you can. You do not have to rub it down or squeeze water out, a simple pat-down will do."
        },
        {
          "headline":"Mix your dry brine in a small bowl before applying.",
          "description":"Dry brines are simply massaged into the chicken and are made almost completely of salt. That said, you can mix in other spices and flavors as well. Start with roughly 1 teaspoon of Kosher salt for every pound of chicken you have (4lb chicken, 4 teaspoons salt), then add any of the following spices that you want:\n2 tsp cracked black pepper. 1 tsp paprika, chili powder, or cayenne\n1 tsp rosemary or thyme\n1-2 tsp garlic powder"
        },
        {
          "headline":"Massage the salt evenly into every side of the chicken.",
          "description":"Rub the top, bottom, inside, and outside of the chicken with your dry brine. Use a little extra salt on thicker parts, like thighs and breasts. You want an even, generous coating of salt. The whole chicken shouldn't be coated in salt, but there should be a fair amount of kernels on everything. You may need an extra 1/2 teaspoon of salt to complete the brine."
        },
        {
          "headline":"Cover the chicken and let it refrigerate between 2 and 24 hours.",
          "description":"The longer you let the chicken brine, the better the results. Still, if you are in a hurry then you should see some results after two hours. Aim for an overnight brining, at the very least. Two hours will work, but it will not be incredibly effective. The longer you let your chicken brine, the better. Try not to exceed 24 hours, however."
        },
        {
          "headline":"Remove the chicken and pat it dry.",
          "description":"There should not be much excess moisture on the chicken, and all the salt should be dissolved. Still, pat down any extra moisture or wet areas with a paper towel if you see them. When you're done you're ready to get the chicken in the oven and add any extra flavors. Try stuffing lemon wedges, garlic gloves, and springs of herbs in the chest cavity or between the legs and wings for added flavors."
        }
      ]
    },
    {
      "name":"Roasting your Chicken",
      "steps":[
        {
          "headline":"Consider butterflying the meat for crispier skin and moister breast meat.",
          "description":"Roast chickens are notoriously hard to keep moist, especially where the breast meat is concerned. Butterflying is when you cut and split the chicken, providing a more even cooking surface for optimum crispiness. This is best done before brining, but can be done afterward as well. To butterfly a whole chicken:\nUse a sharp knife or kitchen shears to cut out the spine of the chicken. This is the long bone in the center of the chicken on the opposite side as the breast meat. Place the chicken breast-side up on a cutting board. Use the heel of your hand to press straight into the center of the breastbone. You'll hear a crack and the chicken will flatten down. Lightly brush the entire top surface with olive oil."
        },
        {
          "headline":"Preheat your oven to 500°F with a rack in the middle of the oven.",
          "description":"Make sure there are no other racks above the middle one. Get out a roasting or baking pan and place your chicken in the center."
        },
        {
          "headline":"Add any aromatics you want to the chicken.",
          "description":"Aromatics, like herbs and lemon, add flavor to your roast. Squeeze the juice of a large lemon on the chicken, add sprigs of rosemary or thyme between the wings and thighs, or crack some black pepper on top of the breasts. If the chicken is whole, stuff lemon slices, garlic cloves, and herbs into the cavity in the middle of the chicken to your liking."
        },
        {
          "headline":"Place the chicken in the oven, basting every 10-12 minutes.",
          "description":"Basting is taking the hot oil and juice from the pan and spreading them on top of the chicken. This helps the chicken stay moist and gets the skin nice and crispy. Use a baster or a cooking brush to reapply the liquid from the pan on the chicken. Try not to leave the oven open for too long as you work -- this causes the heat to drop too quickly and slows cooking."
        },
        {
          "headline":"Cook the chicken for 45 minutes, or until a meat thermometer in the breast reads 150°F.",
          "description":"Breast meat is best at this temperature, and thigh meat needs to be 170°F to be safe. If the outsides start to darken before the insides are fully cooked, lower the oven temperature to 450°F."
        },
        {
          "headline":"Let the chicken stand before cutting into it.",
          "description":"You need to let the chicken rest, otherwise all the juice will leave the meat when you cut into it. Set the chicken aside on a cutting board and tent it loosely with aluminum foil. After 5-6 minutes, you can remove the foil, cut into the chicken, and start eating."
        }
      ]
    }
  ],
  "text":" Making a Wet Brine Pour some water into a large bowl, up to a gallon. The bowl will need to be large enough to submerge all of the chicken you are cooking, but also able to fit into your refrigerator. Fill the bowl with enough water to cover the chicken completely. Consider using warm water as you will be dissolving some solids into solution. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tBrining adds flavor and moisture. Alex Hong, the Executive Chef and owner of Sorrel, agrees: \"I don't like to use tenderizers or pound chicken with a mallet because I feel like it ruins the texture of the bird. Brining makes chicken so much juicier, and it really adds a lot of flavor.\" Add 3/4 cup of salt for every gallon of water. All brine contains salt, as it is necessary to force the water into the meat's cells. The amount of salt used can vary greatly, but start by adding 3/4 cup of kosher salt per gallon of water (46 ml of salt per liter of water). Stir the salt into the water to dissolve it. Add sugar to the water. Sugar, while not required in a brine, is a useful ingredient to brown the skin. Adding sugar to a brine will increase the amount of caramelization achieved when cooking the chicken, regardless of cooking method. Try adding the same amount of sugar as salt. You can use any type of sugar, including white, brown, turbinado, or even molasses or honey. Stir the water to dissolve the sugar. Add any other desired seasonings to the brine. You can also add other ingredients to your brine to season the chicken. Peppercorns, fresh herbs, and fruit juices are all options for seasoning a brine. Some great ingredients to mix and match include:\nAdd aromatics such as: 2-4 cloves of garlic (crushed with a knife), bay leaves, a handful thyme, sage, or rosemary sprigs, 2-3 tablespoons uncracked peppercorns, parsley, juice from 1-2 large lemons or oranges, bay leaves, or 1-2 tablespoons of mustard, cumin, or coriander seeds. Beer and Tyme Brine: Mix 4 12-ounce cans beer (lager, like Budweiser), 1 cup kosher salt, 3/4 cup light-brown sugar, Small handful of thyme sprigs, 5 bay leaves, 1 tablespoon cracked black pepper, and 6 cups ice in a large saucepot. Rosemary Lemon Brine: 1 small onion, thinly sliced, 4 garlic cloves, smashed with the flat side of a knife, 1 teaspoon vegetable oil, 1 cup Kosher salt, 5 or 6 branches rosemary, 1 liter water, juice of 1 lemon. Boil your brine mixture before adding chicken if you have added seasonings. Otherwise, the flavors won't penetrate the chicken. Add all ingredients (salt, sugar, water, seasonings etc.) and bring to a boil for approximately 1 minute. Allow to cool completely before moving on. Place the chicken into the brining solution. Make sure that the chicken is fully submerged in the brine. You can use a brine for either a whole chicken or for smaller pieces of chicken; the process is the same either way. Place the brine in the refrigerator and let it soak. Place the entire bowl into the refrigerator, covering it with plastic wrap. Let the chicken soak in the brining solution for several hours. For small pieces, 1 or 2 hours is sufficient, while 8 to12 hours is ideal for a whole chicken. If you can't spare that much time, a brine will still impart flavor and improve tenderness if used for only a short period of time, at least 2 hours. Never brine chicken at room temperature, as this can lead to bacteria growth. Remove the chicken from the brine. Take the chicken out of the brining solution and pat off the excess water before cooking. Dispose of the brining solution by pouring it down the drain. Making a Dry Brine Know that dry brines keep your chicken flavorful and the skin extra crispy. While wet brines are the traditional way to prep a roast chicken, many chefs are starting to experiment with dry brines instead, which lead to a more robust texture. The salt draws out moisture, which dissolves the salt into a thin, natural wet brine that the chicken then reabsorbs. Use course sea salt or kosher whenever possible for a dry brine. Fine-grained salts, like table salt, will coat too much of the chicken, dissolve too quickly, and make the final roast taste too salty. Pat the chicken dry. Use a paper towel to get as much moisture off the outside of the chicken as you can. You do not have to rub it down or squeeze water out, a simple pat-down will do. Mix your dry brine in a small bowl before applying. Dry brines are simply massaged into the chicken and are made almost completely of salt. That said, you can mix in other spices and flavors as well. Start with roughly 1 teaspoon of Kosher salt for every pound of chicken you have (4lb chicken, 4 teaspoons salt), then add any of the following spices that you want:\n2 tsp cracked black pepper. 1 tsp paprika, chili powder, or cayenne\n1 tsp rosemary or thyme\n1-2 tsp garlic powder Massage the salt evenly into every side of the chicken. Rub the top, bottom, inside, and outside of the chicken with your dry brine. Use a little extra salt on thicker parts, like thighs and breasts. You want an even, generous coating of salt. The whole chicken shouldn't be coated in salt, but there should be a fair amount of kernels on everything. You may need an extra 1/2 teaspoon of salt to complete the brine. Cover the chicken and let it refrigerate between 2 and 24 hours. The longer you let the chicken brine, the better the results. Still, if you are in a hurry then you should see some results after two hours. Aim for an overnight brining, at the very least. Two hours will work, but it will not be incredibly effective. The longer you let your chicken brine, the better. Try not to exceed 24 hours, however. Remove the chicken and pat it dry. There should not be much excess moisture on the chicken, and all the salt should be dissolved. Still, pat down any extra moisture or wet areas with a paper towel if you see them. When you're done you're ready to get the chicken in the oven and add any extra flavors. Try stuffing lemon wedges, garlic gloves, and springs of herbs in the chest cavity or between the legs and wings for added flavors. Roasting your Chicken Consider butterflying the meat for crispier skin and moister breast meat. Roast chickens are notoriously hard to keep moist, especially where the breast meat is concerned. Butterflying is when you cut and split the chicken, providing a more even cooking surface for optimum crispiness. This is best done before brining, but can be done afterward as well. To butterfly a whole chicken:\nUse a sharp knife or kitchen shears to cut out the spine of the chicken. This is the long bone in the center of the chicken on the opposite side as the breast meat. Place the chicken breast-side up on a cutting board. Use the heel of your hand to press straight into the center of the breastbone. You'll hear a crack and the chicken will flatten down. Lightly brush the entire top surface with olive oil. Preheat your oven to 500°F with a rack in the middle of the oven. Make sure there are no other racks above the middle one. Get out a roasting or baking pan and place your chicken in the center. Add any aromatics you want to the chicken. Aromatics, like herbs and lemon, add flavor to your roast. Squeeze the juice of a large lemon on the chicken, add sprigs of rosemary or thyme between the wings and thighs, or crack some black pepper on top of the breasts. If the chicken is whole, stuff lemon slices, garlic cloves, and herbs into the cavity in the middle of the chicken to your liking. Place the chicken in the oven, basting every 10-12 minutes. Basting is taking the hot oil and juice from the pan and spreading them on top of the chicken. This helps the chicken stay moist and gets the skin nice and crispy. Use a baster or a cooking brush to reapply the liquid from the pan on the chicken. Try not to leave the oven open for too long as you work -- this causes the heat to drop too quickly and slows cooking. Cook the chicken for 45 minutes, or until a meat thermometer in the breast reads 150°F. Breast meat is best at this temperature, and thigh meat needs to be 170°F to be safe. If the outsides start to darken before the insides are fully cooked, lower the oven temperature to 450°F. Let the chicken stand before cutting into it. You need to let the chicken rest, otherwise all the juice will leave the meat when you cut into it. Set the chicken aside on a cutting board and tent it loosely with aluminum foil. After 5-6 minutes, you can remove the foil, cut into the chicken, and start eating.",
  "sentences":[
    " Making a Wet Brine Pour some water into a large bowl, up to a gallon.",
    "The bowl will need to be large enough to submerge all of the chicken you are cooking, but also able to fit into your refrigerator.",
    "Fill the bowl with enough water to cover the chicken completely.",
    "Consider using warm water as you will be dissolving some solids into solution.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco.",
    "He has been working in restaurants for over ten years.",
    "Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants.",
    "Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tBrining adds flavor and moisture.",
    "Alex Hong, the Executive Chef and owner of Sorrel, agrees: \"I don't like to use tenderizers or pound chicken with a mallet because I feel like it ruins the texture of the bird.",
    "Brining makes chicken so much juicier, and it really adds a lot of flavor.\"",
    "Add 3/4 cup of salt for every gallon of water.",
    "All brine contains salt, as it is necessary to force the water into the meat's cells.",
    "The amount of salt used can vary greatly, but start by adding 3/4 cup of kosher salt per gallon of water (46 ml of salt per liter of water).",
    "Stir the salt into the water to dissolve it.",
    "Add sugar to the water.",
    "Sugar, while not required in a brine, is a useful ingredient to brown the skin.",
    "Adding sugar to a brine will increase the amount of caramelization achieved when cooking the chicken, regardless of cooking method.",
    "Try adding the same amount of sugar as salt.",
    "You can use any type of sugar, including white, brown, turbinado, or even molasses or honey.",
    "Stir the water to dissolve the sugar.",
    "Add any other desired seasonings to the brine.",
    "You can also add other ingredients to your brine to season the chicken.",
    "Peppercorns, fresh herbs, and fruit juices are all options for seasoning a brine.",
    "Some great ingredients to mix and match include:\nAdd aromatics such as: 2-4 cloves of garlic (crushed with a knife), bay leaves, a handful thyme, sage, or rosemary sprigs, 2-3 tablespoons uncracked peppercorns, parsley, juice from 1-2 large lemons or oranges, bay leaves, or 1-2 tablespoons of mustard, cumin, or coriander seeds.",
    "Beer and Tyme Brine: Mix 4 12-ounce cans beer (lager, like Budweiser), 1 cup kosher salt, 3/4 cup light-brown sugar, Small handful of thyme sprigs, 5 bay leaves, 1 tablespoon cracked black pepper, and 6 cups ice in a large saucepot.",
    "Rosemary Lemon Brine: 1 small onion, thinly sliced, 4 garlic cloves, smashed with the flat side of a knife, 1 teaspoon vegetable oil, 1 cup Kosher salt, 5 or 6 branches rosemary, 1 liter water, juice of 1 lemon.",
    "Boil your brine mixture before adding chicken if you have added seasonings.",
    "Otherwise, the flavors won't penetrate the chicken.",
    "Add all ingredients (salt, sugar, water, seasonings etc.)",
    "and bring to a boil for approximately 1 minute.",
    "Allow to cool completely before moving on.",
    "Place the chicken into the brining solution.",
    "Make sure that the chicken is fully submerged in the brine.",
    "You can use a brine for either a whole chicken or for smaller pieces of chicken; the process is the same either way.",
    "Place the brine in the refrigerator and let it soak.",
    "Place the entire bowl into the refrigerator, covering it with plastic wrap.",
    "Let the chicken soak in the brining solution for several hours.",
    "For small pieces, 1 or 2 hours is sufficient, while 8 to12 hours is ideal for a whole chicken.",
    "If you can't spare that much time, a brine will still impart flavor and improve tenderness if used for only a short period of time, at least 2 hours.",
    "Never brine chicken at room temperature, as this can lead to bacteria growth.",
    "Remove the chicken from the brine.",
    "Take the chicken out of the brining solution and pat off the excess water before cooking.",
    "Dispose of the brining solution by pouring it down the drain.",
    "Making a Dry Brine Know that dry brines keep your chicken flavorful and the skin extra crispy.",
    "While wet brines are the traditional way to prep a roast chicken, many chefs are starting to experiment with dry brines instead, which lead to a more robust texture.",
    "The salt draws out moisture, which dissolves the salt into a thin, natural wet brine that the chicken then reabsorbs.",
    "Use course sea salt or kosher whenever possible for a dry brine.",
    "Fine-grained salts, like table salt, will coat too much of the chicken, dissolve too quickly, and make the final roast taste too salty.",
    "Pat the chicken dry.",
    "Use a paper towel to get as much moisture off the outside of the chicken as you can.",
    "You do not have to rub it down or squeeze water out, a simple pat-down will do.",
    "Mix your dry brine in a small bowl before applying.",
    "Dry brines are simply massaged into the chicken and are made almost completely of salt.",
    "That said, you can mix in other spices and flavors as well.",
    "Start with roughly 1 teaspoon of Kosher salt for every pound of chicken you have (4lb chicken, 4 teaspoons salt), then add any of the following spices that you want:\n2 tsp cracked black pepper.",
    "1 tsp paprika, chili powder, or cayenne\n1 tsp rosemary or thyme\n1-2 tsp garlic powder Massage the salt evenly into every side of the chicken.",
    "Rub the top, bottom, inside, and outside of the chicken with your dry brine.",
    "Use a little extra salt on thicker parts, like thighs and breasts.",
    "You want an even, generous coating of salt.",
    "The whole chicken shouldn't be coated in salt, but there should be a fair amount of kernels on everything.",
    "You may need an extra 1/2 teaspoon of salt to complete the brine.",
    "Cover the chicken and let it refrigerate between 2 and 24 hours.",
    "The longer you let the chicken brine, the better the results.",
    "Still, if you are in a hurry then you should see some results after two hours.",
    "Aim for an overnight brining, at the very least.",
    "Two hours will work, but it will not be incredibly effective.",
    "The longer you let your chicken brine, the better.",
    "Try not to exceed 24 hours, however.",
    "Remove the chicken and pat it dry.",
    "There should not be much excess moisture on the chicken, and all the salt should be dissolved.",
    "Still, pat down any extra moisture or wet areas with a paper towel if you see them.",
    "When you're done you're ready to get the chicken in the oven and add any extra flavors.",
    "Try stuffing lemon wedges, garlic gloves, and springs of herbs in the chest cavity or between the legs and wings for added flavors.",
    "Roasting your Chicken Consider butterflying the meat for crispier skin and moister breast meat.",
    "Roast chickens are notoriously hard to keep moist, especially where the breast meat is concerned.",
    "Butterflying is when you cut and split the chicken, providing a more even cooking surface for optimum crispiness.",
    "This is best done before brining, but can be done afterward as well.",
    "To butterfly a whole chicken:\nUse a sharp knife or kitchen shears to cut out the spine of the chicken.",
    "This is the long bone in the center of the chicken on the opposite side as the breast meat.",
    "Place the chicken breast-side up on a cutting board.",
    "Use the heel of your hand to press straight into the center of the breastbone.",
    "You'll hear a crack and the chicken will flatten down.",
    "Lightly brush the entire top surface with olive oil.",
    "Preheat your oven to 500°F with a rack in the middle of the oven.",
    "Make sure there are no other racks above the middle one.",
    "Get out a roasting or baking pan and place your chicken in the center.",
    "Add any aromatics you want to the chicken.",
    "Aromatics, like herbs and lemon, add flavor to your roast.",
    "Squeeze the juice of a large lemon on the chicken, add sprigs of rosemary or thyme between the wings and thighs, or crack some black pepper on top of the breasts.",
    "If the chicken is whole, stuff lemon slices, garlic cloves, and herbs into the cavity in the middle of the chicken to your liking.",
    "Place the chicken in the oven, basting every 10-12 minutes.",
    "Basting is taking the hot oil and juice from the pan and spreading them on top of the chicken.",
    "This helps the chicken stay moist and gets the skin nice and crispy.",
    "Use a baster or a cooking brush to reapply the liquid from the pan on the chicken.",
    "Try not to leave the oven open for too long as you work -- this causes the heat to drop too quickly and slows cooking.",
    "Cook the chicken for 45 minutes, or until a meat thermometer in the breast reads 150°F.",
    "Breast meat is best at this temperature, and thigh meat needs to be 170°F to be safe.",
    "If the outsides start to darken before the insides are fully cooked, lower the oven temperature to 450°F.",
    "Let the chicken stand before cutting into it.",
    "You need to let the chicken rest, otherwise all the juice will leave the meat when you cut into it.",
    "Set the chicken aside on a cutting board and tent it loosely with aluminum foil.",
    "After 5-6 minutes, you can remove the foil, cut into the chicken, and start eating."
  ],
  "tyn_section":[
    "Large bowl",
    "Water",
    "Kosher salt",
    "Wooden spoon",
    "Sugar",
    "Chicken",
    "Plastic wrap (optional)",
    "Refrigerator",
    "Paper towels"
  ],
  "tyn_model":[
    "chicken",
    "salt",
    "water",
    "sugar",
    "brine",
    "oven",
    "lemon",
    "bowl",
    "kosher salt",
    "garlic",
    "thyme",
    "rosemary",
    "herbs",
    "sorrel",
    "cracked black pepper",
    "knife",
    "refrigerator",
    "paper towel",
    "cutting board",
    "culinary institute of america",
    "jean-georges and quince, both michelin-starred restaurants",
    "tenderizers",
    "mallet",
    "molasses",
    "honey",
    "fruit juices",
    "sage",
    "peppercorns",
    "parsley",
    "lemons",
    "oranges",
    "bay",
    "mustard",
    "cumin",
    "coriander",
    "light-brown sugar",
    "thyme sprigs",
    "large saucepot",
    "vegetable oil",
    "seasonings",
    "plastic wrap",
    "sea salt",
    "kosher",
    "table salt",
    "paprika",
    "garlic powder",
    "garlic gloves",
    "chickens",
    "kitchen shears",
    "olive oil",
    "roasting or",
    "baking pan",
    "black pepper",
    "oil",
    "baster",
    "cooking brush",
    "meat thermometer",
    "aluminum foil",
    "foil"
  ],
  "simple_metrics":{
    "r":0.5555555556,
    "p":0.0847457627,
    "f1":0.1470588235,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7777777778,
    "p":0.1694915254,
    "f1":0.2783300199
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.2372881356,
    "f1":0.3745819398
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1016949153,
    "f1":0.1764705882
  }
}