{
  "title":"How to Cook Plums",
  "url":"https://www.wikihow.com/Cook-Plums",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Stone Fruit"
  ],
  "methods":[
    {
      "name":"Choosing Plums and Understanding the Basics",
      "steps":[
        {
          "headline":"Look for smooth, unblemished plums.",
          "description":"Plums come in all sorts of different colors, including yellow, so (unlike other types of fruit) color alone isn't really useful when it comes to picking a ripe, juicy plum. Instead, look for firm plums that give a little when you squeeze them. The skin should be smooth and somewhat foggy. Here are some things you should avoid:\nPlums that are too soft where the dimple and stem meet. These plums are too ripe. Plums that are split or brown may be rotten or wormy inside. Plums that are shrilled are old, rotten, and dry."
        },
        {
          "headline":"Choose \"dry,\" tart plums for cooking.",
          "description":"There are some varieties of plums that have a dry, tart flavor. They are usually too sour to eat raw, but they are perfect for roasting, poaching, or stewing. Consider any of the varieties listed below:\nCherry\nCzar\nMirabelle\nQuetsch"
        },
        {
          "headline":"Save the sweet and juicy plums for salads and for eating raw.",
          "description":"Some plums are really sweet, and it would almost be wasteful to cook them! Try any of the following plums raw or in salads:\nBlack Amber\nBurbank\nDenniston's Superb\nSanta Rosa\nVictoria"
        },
        {
          "headline":"Know the basic ways in which you can eat and cook plums.",
          "description":"Some types of plums are great for eating raw, but there are also lots of ways in which to cook them. Here are some ways, and how long it takes:\nYou can eat the sweet, \"dessert\" varieties raw. Roast halved plums for 15 to 20 minutes. Poach plums whole for 15 to 25 minutes. Stew sliced and pitted plums for about 10 minutes. Bake plums in pies and crumbles."
        }
      ]
    },
    {
      "name":"Poaching Plums",
      "steps":[
        {
          "headline":"Bring the water and sugar to a boil in a small saucepan over medium-high heat.",
          "description":"Fill a small saucepan with ¼ cup, plus 2 tablespoons (90 milliliters) of water, and add 2½ tablespoons (32.5 grams) of brown sugar. Bring the mixture to a boil, stirring often to help the sugar dissolve."
        },
        {
          "headline":"Add the lemon zest and the plums.",
          "description":"Add ⅛ to ¼ teaspoon of lemon zest first, then set the two plums into the sugar-water. You do not need to peel or pit the plums first, but it would be a good idea to wash them, if you have not done so already."
        },
        {
          "headline":"Simmer the plums, covered, for 10 minutes over low heat.",
          "description":"Reduce the heat low, then place a lid onto the saucepan. Let the plums simmer for 10 minutes."
        },
        {
          "headline":"Take the lid off, and let the plums simmer for 8 to 10 more minutes.",
          "description":"During this time, the plums will finish cooking, and the sauce will start to thicken."
        },
        {
          "headline":"Let the plums cool for 5 minutes, then serve them.",
          "description":"Once the plums have finished cooking, take the saucepan off the stove, and let the plums cool for about 5 minutes. Then, scoop the plums out with a slotted spoon, and serve them. Poached plums taste great with ice cream! You can drizzle the sauce over the plums, or you can save it for another dessert."
        }
      ]
    },
    {
      "name":"Stewing Plums",
      "steps":[
        {
          "headline":"Wash and slice the plums.",
          "description":"You do not need to peel them, but you should discard the pits. Slice the plums into wedges first. After that, you can leave them as is, or cut them further into chunks."
        },
        {
          "headline":"Place the plums into a shallow saucepan, and cover them with sugar.",
          "description":"You will need 2 tablespoons (30 grams) of sugar for every 1 pound (500 grams) of plums. If the plums are very sweet, or if you don't have that give of a sweet tooth, you might want to use only 2 or 3 teaspoons instead."
        },
        {
          "headline":"Add some water.",
          "description":"You will need 2 tablespoons (30 milliliters) of water for every 1 pound (500 grams) of plums. This may not seem like enough water at first, but the plums will release more juices as you cook them. At this point, you may also add a squeeze of lemon juice. This will help cut the sweetness."
        },
        {
          "headline":"Cover the saucepan with a lid, then cook the plums for about 10 minutes over medium heat.",
          "description":"How fast the plums cook will depend on how ripe they are. Very ripe plums may only take 5 minutes to cook, while not-so-ripe plums may take up to 15 minutes."
        },
        {
          "headline":"Take the lid off the saucepan, and let the sauce thicken.",
          "description":"This will only take a few minutes. If you do not intend on serving the plums with the sauce, then you can skip this step."
        },
        {
          "headline":"Serve the plums.",
          "description":"Scoop the plums out using a slotted spoon, and transfer them to a plate. Cooked plums are typically served with ice cream, but you can also serve them with other things, such as yogurt, oatmeal, or roast pork. You can ladle the sauce over the plums, or save it for another recipe."
        }
      ]
    },
    {
      "name":"Roasting Plums",
      "steps":[
        {
          "headline":"Preheat your oven to 390°F (200°C/gas 6).",
          "description":""
        },
        {
          "headline":"Mix the sugar and ground cinnamon together in a bowl.",
          "description":"Measure out ⅔ cups (150 grams) of white granulated sugar and ¼ teaspoon of cinnamon. Put them into a bowl, and mix them briskly together with a fork. Make sure that the cinnamon is distributed evenly throughout the sugar."
        },
        {
          "headline":"Beat the egg white in a shallow dish with a whisk.",
          "description":"If you have not done so already, crack open an egg over a shallow dish, and separate the yolk from the white. Discard the yolk, or save it for another recipe, then whisk the egg white. You want it to be a little foamy, but not so much that it turns white and stiff."
        },
        {
          "headline":"Dip the plums into the egg white, then roll them in the cinnamon sugar.",
          "description":"You do not need to peel, cut, or pit the plums first. Simply rinse them, then pat them dry. Roll them in the beaten egg white until they are evenly coated, then roll them in the cinnamon-sugar."
        },
        {
          "headline":"Arrange the plums in a buttered baking dish.",
          "description":"Choose a baking dish with high walls. The plums will release lots of juices as they bake. Make sure that the dish is big enough to fit the plums comfortably; you don't want to pack them too tightly."
        },
        {
          "headline":"Bake the plums for about 15 to 20 minutes.",
          "description":"They are ready when they have turned crusty and juicy. You can check if they are cooked through by poking one of them with a toothpick. If the toothpick pieces the plum easily, then the plums are ready!"
        },
        {
          "headline":"Serve the plums.",
          "description":"They taste great with cream, custard, or vanilla ice cream."
        }
      ]
    },
    {
      "name":"Grilling Plums",
      "steps":[
        {
          "headline":"Grease your grill with cooking spray, then preheat it to medium-high.",
          "description":"You can use an outdoor grill or a stovetop grill for this method."
        },
        {
          "headline":"Wash, halve, and pit the plums.",
          "description":"Choose some firm plums suitable for cooking. Rinse them with cool water, then pat them dry. Slice them in half, then remove the pits."
        },
        {
          "headline":"Mix together the butter, sugar, and cinnamon.",
          "description":"If you have not already, melt the butter, either in a small saucepan or in the microwave. Pour it into a small mixing bowl, then add the sugar and ground cinnamon. Whisk the ingredients together using a fork or mini whisk."
        },
        {
          "headline":"Brush the butter mixture onto the flat side of the plums.",
          "description":"Set the plums down so that the cut side is facing up. Use a basting brush to coat each plum with the melted butter mixture."
        },
        {
          "headline":"Place the plums flesh-side-down onto the grill, and cook them for 5 minutes.",
          "description":"The plums are ready when they turn soft. You do not need to turn or flip the plums."
        },
        {
          "headline":"Use a spatula to take the plums off of the grill, and serve them.",
          "description":"Carefully slide a spatula under each plum, and transfer it to a place. Flip the plum over as you set it down, so that the grilled side is facing up. Serve the plums with some Greek yogurt or toasted almond flakes, if desired."
        }
      ]
    }
  ],
  "text":" Choosing Plums and Understanding the Basics Look for smooth, unblemished plums. Plums come in all sorts of different colors, including yellow, so (unlike other types of fruit) color alone isn't really useful when it comes to picking a ripe, juicy plum. Instead, look for firm plums that give a little when you squeeze them. The skin should be smooth and somewhat foggy. Here are some things you should avoid:\nPlums that are too soft where the dimple and stem meet. These plums are too ripe. Plums that are split or brown may be rotten or wormy inside. Plums that are shrilled are old, rotten, and dry. Choose \"dry,\" tart plums for cooking. There are some varieties of plums that have a dry, tart flavor. They are usually too sour to eat raw, but they are perfect for roasting, poaching, or stewing. Consider any of the varieties listed below:\nCherry\nCzar\nMirabelle\nQuetsch Save the sweet and juicy plums for salads and for eating raw. Some plums are really sweet, and it would almost be wasteful to cook them! Try any of the following plums raw or in salads:\nBlack Amber\nBurbank\nDenniston's Superb\nSanta Rosa\nVictoria Know the basic ways in which you can eat and cook plums. Some types of plums are great for eating raw, but there are also lots of ways in which to cook them. Here are some ways, and how long it takes:\nYou can eat the sweet, \"dessert\" varieties raw. Roast halved plums for 15 to 20 minutes. Poach plums whole for 15 to 25 minutes. Stew sliced and pitted plums for about 10 minutes. Bake plums in pies and crumbles. Poaching Plums Bring the water and sugar to a boil in a small saucepan over medium-high heat. Fill a small saucepan with ¼ cup, plus 2 tablespoons (90 milliliters) of water, and add 2½ tablespoons (32.5 grams) of brown sugar. Bring the mixture to a boil, stirring often to help the sugar dissolve. Add the lemon zest and the plums. Add ⅛ to ¼ teaspoon of lemon zest first, then set the two plums into the sugar-water. You do not need to peel or pit the plums first, but it would be a good idea to wash them, if you have not done so already. Simmer the plums, covered, for 10 minutes over low heat. Reduce the heat low, then place a lid onto the saucepan. Let the plums simmer for 10 minutes. Take the lid off, and let the plums simmer for 8 to 10 more minutes. During this time, the plums will finish cooking, and the sauce will start to thicken. Let the plums cool for 5 minutes, then serve them. Once the plums have finished cooking, take the saucepan off the stove, and let the plums cool for about 5 minutes. Then, scoop the plums out with a slotted spoon, and serve them. Poached plums taste great with ice cream! You can drizzle the sauce over the plums, or you can save it for another dessert. Stewing Plums Wash and slice the plums. You do not need to peel them, but you should discard the pits. Slice the plums into wedges first. After that, you can leave them as is, or cut them further into chunks. Place the plums into a shallow saucepan, and cover them with sugar. You will need 2 tablespoons (30 grams) of sugar for every 1 pound (500 grams) of plums. If the plums are very sweet, or if you don't have that give of a sweet tooth, you might want to use only 2 or 3 teaspoons instead. Add some water. You will need 2 tablespoons (30 milliliters) of water for every 1 pound (500 grams) of plums. This may not seem like enough water at first, but the plums will release more juices as you cook them. At this point, you may also add a squeeze of lemon juice. This will help cut the sweetness. Cover the saucepan with a lid, then cook the plums for about 10 minutes over medium heat. How fast the plums cook will depend on how ripe they are. Very ripe plums may only take 5 minutes to cook, while not-so-ripe plums may take up to 15 minutes. Take the lid off the saucepan, and let the sauce thicken. This will only take a few minutes. If you do not intend on serving the plums with the sauce, then you can skip this step. Serve the plums. Scoop the plums out using a slotted spoon, and transfer them to a plate. Cooked plums are typically served with ice cream, but you can also serve them with other things, such as yogurt, oatmeal, or roast pork. You can ladle the sauce over the plums, or save it for another recipe. Roasting Plums Preheat your oven to 390°F (200°C/gas 6).  Mix the sugar and ground cinnamon together in a bowl. Measure out ⅔ cups (150 grams) of white granulated sugar and ¼ teaspoon of cinnamon. Put them into a bowl, and mix them briskly together with a fork. Make sure that the cinnamon is distributed evenly throughout the sugar. Beat the egg white in a shallow dish with a whisk. If you have not done so already, crack open an egg over a shallow dish, and separate the yolk from the white. Discard the yolk, or save it for another recipe, then whisk the egg white. You want it to be a little foamy, but not so much that it turns white and stiff. Dip the plums into the egg white, then roll them in the cinnamon sugar. You do not need to peel, cut, or pit the plums first. Simply rinse them, then pat them dry. Roll them in the beaten egg white until they are evenly coated, then roll them in the cinnamon-sugar. Arrange the plums in a buttered baking dish. Choose a baking dish with high walls. The plums will release lots of juices as they bake. Make sure that the dish is big enough to fit the plums comfortably; you don't want to pack them too tightly. Bake the plums for about 15 to 20 minutes. They are ready when they have turned crusty and juicy. You can check if they are cooked through by poking one of them with a toothpick. If the toothpick pieces the plum easily, then the plums are ready! Serve the plums. They taste great with cream, custard, or vanilla ice cream. Grilling Plums Grease your grill with cooking spray, then preheat it to medium-high. You can use an outdoor grill or a stovetop grill for this method. Wash, halve, and pit the plums. Choose some firm plums suitable for cooking. Rinse them with cool water, then pat them dry. Slice them in half, then remove the pits. Mix together the butter, sugar, and cinnamon. If you have not already, melt the butter, either in a small saucepan or in the microwave. Pour it into a small mixing bowl, then add the sugar and ground cinnamon. Whisk the ingredients together using a fork or mini whisk. Brush the butter mixture onto the flat side of the plums. Set the plums down so that the cut side is facing up. Use a basting brush to coat each plum with the melted butter mixture. Place the plums flesh-side-down onto the grill, and cook them for 5 minutes. The plums are ready when they turn soft. You do not need to turn or flip the plums. Use a spatula to take the plums off of the grill, and serve them. Carefully slide a spatula under each plum, and transfer it to a place. Flip the plum over as you set it down, so that the grilled side is facing up. Serve the plums with some Greek yogurt or toasted almond flakes, if desired.",
  "sentences":[
    " Choosing Plums and Understanding the Basics Look for smooth, unblemished plums.",
    "Plums come in all sorts of different colors, including yellow, so (unlike other types of fruit) color alone isn't really useful when it comes to picking a ripe, juicy plum.",
    "Instead, look for firm plums that give a little when you squeeze them.",
    "The skin should be smooth and somewhat foggy.",
    "Here are some things you should avoid:\nPlums that are too soft where the dimple and stem meet.",
    "These plums are too ripe.",
    "Plums that are split or brown may be rotten or wormy inside.",
    "Plums that are shrilled are old, rotten, and dry.",
    "Choose \"dry,\" tart plums for cooking.",
    "There are some varieties of plums that have a dry, tart flavor.",
    "They are usually too sour to eat raw, but they are perfect for roasting, poaching, or stewing.",
    "Consider any of the varieties listed below:\nCherry\nCzar\nMirabelle\nQuetsch Save the sweet and juicy plums for salads and for eating raw.",
    "Some plums are really sweet, and it would almost be wasteful to cook them!",
    "Try any of the following plums raw or in salads:\nBlack Amber\nBurbank\nDenniston's Superb\nSanta Rosa\nVictoria Know the basic ways in which you can eat and cook plums.",
    "Some types of plums are great for eating raw, but there are also lots of ways in which to cook them.",
    "Here are some ways, and how long it takes:\nYou can eat the sweet, \"dessert\" varieties raw.",
    "Roast halved plums for 15 to 20 minutes.",
    "Poach plums whole for 15 to 25 minutes.",
    "Stew sliced and pitted plums for about 10 minutes.",
    "Bake plums in pies and crumbles.",
    "Poaching Plums Bring the water and sugar to a boil in a small saucepan over medium-high heat.",
    "Fill a small saucepan with ¼ cup, plus 2 tablespoons (90 milliliters) of water, and add 2½ tablespoons (32.5 grams) of brown sugar.",
    "Bring the mixture to a boil, stirring often to help the sugar dissolve.",
    "Add the lemon zest and the plums.",
    "Add ⅛ to ¼ teaspoon of lemon zest first, then set the two plums into the sugar-water.",
    "You do not need to peel or pit the plums first, but it would be a good idea to wash them, if you have not done so already.",
    "Simmer the plums, covered, for 10 minutes over low heat.",
    "Reduce the heat low, then place a lid onto the saucepan.",
    "Let the plums simmer for 10 minutes.",
    "Take the lid off, and let the plums simmer for 8 to 10 more minutes.",
    "During this time, the plums will finish cooking, and the sauce will start to thicken.",
    "Let the plums cool for 5 minutes, then serve them.",
    "Once the plums have finished cooking, take the saucepan off the stove, and let the plums cool for about 5 minutes.",
    "Then, scoop the plums out with a slotted spoon, and serve them.",
    "Poached plums taste great with ice cream!",
    "You can drizzle the sauce over the plums, or you can save it for another dessert.",
    "Stewing Plums Wash and slice the plums.",
    "You do not need to peel them, but you should discard the pits.",
    "Slice the plums into wedges first.",
    "After that, you can leave them as is, or cut them further into chunks.",
    "Place the plums into a shallow saucepan, and cover them with sugar.",
    "You will need 2 tablespoons (30 grams) of sugar for every 1 pound (500 grams) of plums.",
    "If the plums are very sweet, or if you don't have that give of a sweet tooth, you might want to use only 2 or 3 teaspoons instead.",
    "Add some water.",
    "You will need 2 tablespoons (30 milliliters) of water for every 1 pound (500 grams) of plums.",
    "This may not seem like enough water at first, but the plums will release more juices as you cook them.",
    "At this point, you may also add a squeeze of lemon juice.",
    "This will help cut the sweetness.",
    "Cover the saucepan with a lid, then cook the plums for about 10 minutes over medium heat.",
    "How fast the plums cook will depend on how ripe they are.",
    "Very ripe plums may only take 5 minutes to cook, while not-so-ripe plums may take up to 15 minutes.",
    "Take the lid off the saucepan, and let the sauce thicken.",
    "This will only take a few minutes.",
    "If you do not intend on serving the plums with the sauce, then you can skip this step.",
    "Serve the plums.",
    "Scoop the plums out using a slotted spoon, and transfer them to a plate.",
    "Cooked plums are typically served with ice cream, but you can also serve them with other things, such as yogurt, oatmeal, or roast pork.",
    "You can ladle the sauce over the plums, or save it for another recipe.",
    "Roasting Plums Preheat your oven to 390°F (200°C/gas 6).",
    "Mix the sugar and ground cinnamon together in a bowl.",
    "Measure out ⅔ cups (150 grams) of white granulated sugar and ¼ teaspoon of cinnamon.",
    "Put them into a bowl, and mix them briskly together with a fork.",
    "Make sure that the cinnamon is distributed evenly throughout the sugar.",
    "Beat the egg white in a shallow dish with a whisk.",
    "If you have not done so already, crack open an egg over a shallow dish, and separate the yolk from the white.",
    "Discard the yolk, or save it for another recipe, then whisk the egg white.",
    "You want it to be a little foamy, but not so much that it turns white and stiff.",
    "Dip the plums into the egg white, then roll them in the cinnamon sugar.",
    "You do not need to peel, cut, or pit the plums first.",
    "Simply rinse them, then pat them dry.",
    "Roll them in the beaten egg white until they are evenly coated, then roll them in the cinnamon-sugar.",
    "Arrange the plums in a buttered baking dish.",
    "Choose a baking dish with high walls.",
    "The plums will release lots of juices as they bake.",
    "Make sure that the dish is big enough to fit the plums comfortably; you don't want to pack them too tightly.",
    "Bake the plums for about 15 to 20 minutes.",
    "They are ready when they have turned crusty and juicy.",
    "You can check if they are cooked through by poking one of them with a toothpick.",
    "If the toothpick pieces the plum easily, then the plums are ready!",
    "Serve the plums.",
    "They taste great with cream, custard, or vanilla ice cream.",
    "Grilling Plums Grease your grill with cooking spray, then preheat it to medium-high.",
    "You can use an outdoor grill or a stovetop grill for this method.",
    "Wash, halve, and pit the plums.",
    "Choose some firm plums suitable for cooking.",
    "Rinse them with cool water, then pat them dry.",
    "Slice them in half, then remove the pits.",
    "Mix together the butter, sugar, and cinnamon.",
    "If you have not already, melt the butter, either in a small saucepan or in the microwave.",
    "Pour it into a small mixing bowl, then add the sugar and ground cinnamon.",
    "Whisk the ingredients together using a fork or mini whisk.",
    "Brush the butter mixture onto the flat side of the plums.",
    "Set the plums down so that the cut side is facing up.",
    "Use a basting brush to coat each plum with the melted butter mixture.",
    "Place the plums flesh-side-down onto the grill, and cook them for 5 minutes.",
    "The plums are ready when they turn soft.",
    "You do not need to turn or flip the plums.",
    "Use a spatula to take the plums off of the grill, and serve them.",
    "Carefully slide a spatula under each plum, and transfer it to a place.",
    "Flip the plum over as you set it down, so that the grilled side is facing up.",
    "Serve the plums with some Greek yogurt or toasted almond flakes, if desired."
  ],
  "tyn_section":[
    "Small saucepan, with lid",
    "Measuring cups and spoons",
    "Slotted spoon (optional)",
    "Shallow saucepan, with lid",
    "Cutting board",
    "Knife",
    "Mixing bowl",
    "Fork",
    "Shallow dish",
    "Baking dish",
    "Grill",
    "Cooking spray",
    "Spatula",
    "Whisk",
    "Basting brush"
  ],
  "tyn_model":[
    "plums",
    "sugar",
    "water",
    "saucepan",
    "grill",
    "butter",
    "small saucepan",
    "cinnamon",
    "lemon",
    "slotted spoon",
    "ice cream",
    "ground cinnamon",
    "bowl",
    "shallow dish",
    "spatula",
    "fruit",
    "plum",
    "cherry",
    "czar",
    "quetsch",
    "brown sugar",
    "⅛ to",
    "lemon zest",
    "sugar-",
    "stove",
    "plate",
    "yogurt",
    "roast pork",
    "roasting plums",
    "oven",
    "⅔ cups",
    "white granulated sugar",
    "fork",
    "whisk",
    "egg",
    "cinnamon sugar",
    "egg white",
    "cinnamon-",
    "buttered baking dish",
    "baking dish",
    "dish",
    "vanilla ice cream",
    "cooking spray",
    "stovetop grill",
    "microwave",
    "small mixing bowl",
    "fork or mini whisk",
    "basting brush",
    "greek yogurt",
    "toasted almond flakes"
  ],
  "simple_metrics":{
    "r":0.5333333333,
    "p":0.16,
    "f1":0.2461538462,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.28,
    "f1":0.3943661972
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.28,
    "f1":0.3943661972
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.22,
    "f1":0.3308270677
  }
}