{
  "title":"How to Drink Corona",
  "url":"https://www.wikihow.com/Drink-Corona",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Beer and Cider"
  ],
  "methods":[
    {
      "name":"Drinking a Traditional Corona",
      "steps":[
        {
          "headline":"Cool the Corona.",
          "description":"You can place your beer in the freezer, fridge or cooler. Depending on the method and the initial temperature of the beer, it could take anywhere from 30 minutes to a few hours to cool the beer - so in deciding which method to use, consider how soon you want to open your first beer. Be careful not to leave your beer in the freezer for more than 30 minutes, as it may explode. Using a cooler with ice water is the fastest method to cool beer (it transfers heat more quickly). With this method, allow the ice to settle inside the cooler for an hour or longer. Once the ice melts a little, place the Corona beers inside the cooler."
        },
        {
          "headline":"Open and dress the Corona with salt and lime.",
          "description":"Use a bottle opener to remove the bottle cap from the top of the beer -  as all Corona bottles require a bottle opener. Sprinkle the rim of the bottle with a little sea salt, Lucas brand seasoning or other salt-based seasoning of your choice. Place a lime wedge over the opening of the beer bottle and squeeze the lime juice into the bottle. Push the lime wedge into the bottle to flavor the beer even more. If you'd like to mix the drink more completely, try putting your thumb over the top of the beer and slowly turning it upside down a few times. Be careful: Turning the beer upside down at a fast rate will cause the beer to release carbonation and explode."
        },
        {
          "headline":"Take a drink and enjoy your Corona.",
          "description":"But remember to drink responsibly."
        }
      ]
    },
    {
      "name":"Drinking a Mixed Corona",
      "steps":[
        {
          "headline":"Cool the Corona.",
          "description":"Using the first step in Method 1 of this article is a good reference point for cooing beer quickly. A cool Corona will be necessary for all mixed drinks."
        },
        {
          "headline":"Make your own mixed Corona.",
          "description":"Add one to all of the following to a mixer or empty cup with half a Corona in it: lemon, Tabasco sauce, spicy tomato juice, salt and/or pepper. These ingredients are most common in corona, besides the lime and salt combination. Adding these elements of flavor to your Corona will really improve the taste and can be fun to experiment with. If you decide that you want to only add one or two of the ingredients, you can go ahead and put the ingredients directly into your Corona bottle and skip putting them in a mixer. Make sure that you'll enjoy each flavor that the different ingredients create. You can do this by tasting each ingredient mixed in a shot glass with Corona. Place a few ice cubes into the mixer or cup with the ingredients if the Corona becomes warm in the process."
        },
        {
          "headline":"Make a Red Corona.",
          "description":"Add 1 shot of vodka, 1 teaspoon of grenadine syrup and 1 slice of lime to a 7/8 full bottle of Corona. Remember that putting your thumb over the top of the beer and slowly turning it upside down a few times is a good way to mix the drink. Be careful: Turning the beer upside down at a fast rate will cause the beer to release carbonation and explode. Try adding these ingredients to a cup or mixer if you have trouble mixing them in a Corona bottle."
        },
        {
          "headline":"Make a Mexican Bulldog Margarita.",
          "description":"Add 1 ounce of tequila, 7 - 10 ounces of margarita mix and 8 - 10 ice cubes into a blender. Blend the ingredients into a homogeneous mix. Pour the mix into a 16 ounce (or larger) drinking glass and place an upside-down Corona bottle in the drink. Make sure that the drinking glass' rim is wide enough to support a Corona bottle without tipping over. If the only drinking glasses that you have are small, you can try using a Coronita (a smaller Corona)."
        },
        {
          "headline":"Drink your mixed Corona.",
          "description":"Whatever you way decide to mix your Corona, it's going to be delicious - it's Corona. Don't forget to add a lime garnish and salt if you haven't already."
        }
      ]
    }
  ],
  "text":" Drinking a Traditional Corona Cool the Corona. You can place your beer in the freezer, fridge or cooler. Depending on the method and the initial temperature of the beer, it could take anywhere from 30 minutes to a few hours to cool the beer - so in deciding which method to use, consider how soon you want to open your first beer. Be careful not to leave your beer in the freezer for more than 30 minutes, as it may explode. Using a cooler with ice water is the fastest method to cool beer (it transfers heat more quickly). With this method, allow the ice to settle inside the cooler for an hour or longer. Once the ice melts a little, place the Corona beers inside the cooler. Open and dress the Corona with salt and lime. Use a bottle opener to remove the bottle cap from the top of the beer -  as all Corona bottles require a bottle opener. Sprinkle the rim of the bottle with a little sea salt, Lucas brand seasoning or other salt-based seasoning of your choice. Place a lime wedge over the opening of the beer bottle and squeeze the lime juice into the bottle. Push the lime wedge into the bottle to flavor the beer even more. If you'd like to mix the drink more completely, try putting your thumb over the top of the beer and slowly turning it upside down a few times. Be careful: Turning the beer upside down at a fast rate will cause the beer to release carbonation and explode. Take a drink and enjoy your Corona. But remember to drink responsibly. Drinking a Mixed Corona Cool the Corona. Using the first step in Method 1 of this article is a good reference point for cooing beer quickly. A cool Corona will be necessary for all mixed drinks. Make your own mixed Corona. Add one to all of the following to a mixer or empty cup with half a Corona in it: lemon, Tabasco sauce, spicy tomato juice, salt and/or pepper. These ingredients are most common in corona, besides the lime and salt combination. Adding these elements of flavor to your Corona will really improve the taste and can be fun to experiment with. If you decide that you want to only add one or two of the ingredients, you can go ahead and put the ingredients directly into your Corona bottle and skip putting them in a mixer. Make sure that you'll enjoy each flavor that the different ingredients create. You can do this by tasting each ingredient mixed in a shot glass with Corona. Place a few ice cubes into the mixer or cup with the ingredients if the Corona becomes warm in the process. Make a Red Corona. Add 1 shot of vodka, 1 teaspoon of grenadine syrup and 1 slice of lime to a 7/8 full bottle of Corona. Remember that putting your thumb over the top of the beer and slowly turning it upside down a few times is a good way to mix the drink. Be careful: Turning the beer upside down at a fast rate will cause the beer to release carbonation and explode. Try adding these ingredients to a cup or mixer if you have trouble mixing them in a Corona bottle. Make a Mexican Bulldog Margarita. Add 1 ounce of tequila, 7 - 10 ounces of margarita mix and 8 - 10 ice cubes into a blender. Blend the ingredients into a homogeneous mix. Pour the mix into a 16 ounce (or larger) drinking glass and place an upside-down Corona bottle in the drink. Make sure that the drinking glass' rim is wide enough to support a Corona bottle without tipping over. If the only drinking glasses that you have are small, you can try using a Coronita (a smaller Corona). Drink your mixed Corona. Whatever you way decide to mix your Corona, it's going to be delicious - it's Corona. Don't forget to add a lime garnish and salt if you haven't already.",
  "sentences":[
    " Drinking a Traditional Corona Cool the Corona.",
    "You can place your beer in the freezer, fridge or cooler.",
    "Depending on the method and the initial temperature of the beer, it could take anywhere from 30 minutes to a few hours to cool the beer - so in deciding which method to use, consider how soon you want to open your first beer.",
    "Be careful not to leave your beer in the freezer for more than 30 minutes, as it may explode.",
    "Using a cooler with ice water is the fastest method to cool beer (it transfers heat more quickly).",
    "With this method, allow the ice to settle inside the cooler for an hour or longer.",
    "Once the ice melts a little, place the Corona beers inside the cooler.",
    "Open and dress the Corona with salt and lime.",
    "Use a bottle opener to remove the bottle cap from the top of the beer -  as all Corona bottles require a bottle opener.",
    "Sprinkle the rim of the bottle with a little sea salt, Lucas brand seasoning or other salt-based seasoning of your choice.",
    "Place a lime wedge over the opening of the beer bottle and squeeze the lime juice into the bottle.",
    "Push the lime wedge into the bottle to flavor the beer even more.",
    "If you'd like to mix the drink more completely, try putting your thumb over the top of the beer and slowly turning it upside down a few times.",
    "Be careful: Turning the beer upside down at a fast rate will cause the beer to release carbonation and explode.",
    "Take a drink and enjoy your Corona.",
    "But remember to drink responsibly.",
    "Drinking a Mixed Corona Cool the Corona.",
    "Using the first step in Method 1 of this article is a good reference point for cooing beer quickly.",
    "A cool Corona will be necessary for all mixed drinks.",
    "Make your own mixed Corona.",
    "Add one to all of the following to a mixer or empty cup with half a Corona in it: lemon, Tabasco sauce, spicy tomato juice, salt and/or pepper.",
    "These ingredients are most common in corona, besides the lime and salt combination.",
    "Adding these elements of flavor to your Corona will really improve the taste and can be fun to experiment with.",
    "If you decide that you want to only add one or two of the ingredients, you can go ahead and put the ingredients directly into your Corona bottle and skip putting them in a mixer.",
    "Make sure that you'll enjoy each flavor that the different ingredients create.",
    "You can do this by tasting each ingredient mixed in a shot glass with Corona.",
    "Place a few ice cubes into the mixer or cup with the ingredients if the Corona becomes warm in the process.",
    "Make a Red Corona.",
    "Add 1 shot of vodka, 1 teaspoon of grenadine syrup and 1 slice of lime to a 7/8 full bottle of Corona.",
    "Remember that putting your thumb over the top of the beer and slowly turning it upside down a few times is a good way to mix the drink.",
    "Be careful: Turning the beer upside down at a fast rate will cause the beer to release carbonation and explode.",
    "Try adding these ingredients to a cup or mixer if you have trouble mixing them in a Corona bottle.",
    "Make a Mexican Bulldog Margarita.",
    "Add 1 ounce of tequila, 7 - 10 ounces of margarita mix and 8 - 10 ice cubes into a blender.",
    "Blend the ingredients into a homogeneous mix.",
    "Pour the mix into a 16 ounce (or larger) drinking glass and place an upside-down Corona bottle in the drink.",
    "Make sure that the drinking glass' rim is wide enough to support a Corona bottle without tipping over.",
    "If the only drinking glasses that you have are small, you can try using a Coronita (a smaller Corona).",
    "Drink your mixed Corona.",
    "Whatever you way decide to mix your Corona, it's going to be delicious - it's Corona.",
    "Don't forget to add a lime garnish and salt if you haven't already."
  ],
  "tyn_section":[
    "Way to cool beer",
    "Corona beer",
    "Sea salt",
    "Lime wedges",
    "Chili pepper powder",
    "Lemon juice",
    "Salt",
    "Black pepper",
    "Tabasco sauce",
    "Spicy tomato juice",
    "Vodka",
    "Tequila",
    "Lime margarita Mix",
    "Grenadine syrup"
  ],
  "tyn_model":[
    "corona",
    "cooler",
    "salt",
    "lime",
    "corona bottle",
    "mixer",
    "bottle opener",
    "lime wedge",
    "ice cubes",
    "freezer",
    "ice water",
    "corona beers",
    "sea salt",
    "lucas brand seasoning",
    "lime juice",
    "lemon",
    "tabasco sauce",
    "pepper",
    "shot glass",
    "vodka",
    "grenadine syrup",
    "cup or mixer",
    "tequila",
    "margarita mix",
    "blender",
    "drinking glass",
    "glasses",
    "coronita"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.2142857143,
    "f1":0.2857142857,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7857142857,
    "p":0.3928571429,
    "f1":0.5238095238
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.5357142857,
    "f1":0.6593406593
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333
  }
}