{
  "title":"How to Cut Flagstone",
  "url":"https://www.wikihow.com/Cut-Flagstone",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Brickwork and Stone Masonry",
    "Cutting Stone"
  ],
  "methods":[
    {
      "name":"Cutting flagstone into irregular shapes.",
      "steps":[
        {
          "headline":"Use a hammer and chisel to cut flagstone when accuracy of cut or straight lines are not important.",
          "description":"A hammer and chisel is best to cut or shape flagstone for small projects that do not require accurate cuts, such as a small garden path or a decorative step or bench top."
        },
        {
          "headline":"Set the flagstone on a solid surface.",
          "description":""
        },
        {
          "headline":"Measure and draw a line to cut.",
          "description":""
        },
        {
          "headline":"Leave a distinct bold line, such as that provided by paver chalk or a piece of roofer's slate.",
          "description":"The measurement must allow for the space made by joint or mortar."
        },
        {
          "headline":"Hammer sharply, but not heavily, on the chisel as you move it along the drawn line in order to score the line.",
          "description":""
        },
        {
          "headline":"Continue to score along the line with even pressure.",
          "description":"Allow time for this process, or you may crack or break the stone unintentionally."
        },
        {
          "headline":"Continue to tap the chisel with the hammer along the scored line until stone breaks along the scored line.",
          "description":""
        }
      ]
    },
    {
      "name":"Cutting flagstone into regular shapes.",
      "steps":[
        {
          "headline":"Use a circular saw with masonry blade to make regular cuts in the same size for small projects, such as a fireplace hearth.",
          "description":""
        },
        {
          "headline":"Clamp the flagstone firmly to a solid surface.",
          "description":""
        },
        {
          "headline":"Measure and clearly draw the line to cut.",
          "description":""
        },
        {
          "headline":"Begin to saw along the line.",
          "description":""
        },
        {
          "headline":"Do not apply pressure to the saw; just allow the weight of the saw to score the stone.",
          "description":"The intent is not to saw through the flagstone; rather, the purpose is to create a significant score in the stone along which repeated blows with a hammer and chisel will break the stone."
        },
        {
          "headline":"Prop the stone that has been scored by the circular saw at an angle on a tool or brick along the bottom side of the flagstone parallel to the scored line.",
          "description":""
        },
        {
          "headline":"Tap chisel with hammer sharply along the scored line until piece breaks away.",
          "description":""
        }
      ]
    },
    {
      "name":"Cutting flagstone into accurate cuts.",
      "steps":[
        {
          "headline":"Cut flagstone with a wet saw if you have a large job or a job that requires accurate cuts or design cuts, such as a patio floor, a pool deck, curves or edging where you want to repeat a color scheme.",
          "description":""
        },
        {
          "headline":"Buy or rent a water-fed saw with a diamond edged blade.",
          "description":"Water is fed onto blade so it lubricates the cut and reduces the debris generated by the cut."
        },
        {
          "headline":"Read the assembly and usage directions carefully.",
          "description":""
        },
        {
          "headline":"Measure and score the line desired.",
          "description":""
        },
        {
          "headline":"Move the stone steadily along the line against the saw blade because on a wet saw the blade does not move.",
          "description":""
        },
        {
          "headline":"Push the stone flat, steadily, and slowly through the blade until the cut is complete.",
          "description":""
        },
        {
          "headline":"Clean and store tools.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cutting flagstone into irregular shapes. Use a hammer and chisel to cut flagstone when accuracy of cut or straight lines are not important. A hammer and chisel is best to cut or shape flagstone for small projects that do not require accurate cuts, such as a small garden path or a decorative step or bench top. Set the flagstone on a solid surface.  Measure and draw a line to cut.  Leave a distinct bold line, such as that provided by paver chalk or a piece of roofer's slate. The measurement must allow for the space made by joint or mortar. Hammer sharply, but not heavily, on the chisel as you move it along the drawn line in order to score the line.  Continue to score along the line with even pressure. Allow time for this process, or you may crack or break the stone unintentionally. Continue to tap the chisel with the hammer along the scored line until stone breaks along the scored line.  Cutting flagstone into regular shapes. Use a circular saw with masonry blade to make regular cuts in the same size for small projects, such as a fireplace hearth.  Clamp the flagstone firmly to a solid surface.  Measure and clearly draw the line to cut.  Begin to saw along the line.  Do not apply pressure to the saw; just allow the weight of the saw to score the stone. The intent is not to saw through the flagstone; rather, the purpose is to create a significant score in the stone along which repeated blows with a hammer and chisel will break the stone. Prop the stone that has been scored by the circular saw at an angle on a tool or brick along the bottom side of the flagstone parallel to the scored line.  Tap chisel with hammer sharply along the scored line until piece breaks away.  Cutting flagstone into accurate cuts. Cut flagstone with a wet saw if you have a large job or a job that requires accurate cuts or design cuts, such as a patio floor, a pool deck, curves or edging where you want to repeat a color scheme.  Buy or rent a water-fed saw with a diamond edged blade. Water is fed onto blade so it lubricates the cut and reduces the debris generated by the cut. Read the assembly and usage directions carefully.  Measure and score the line desired.  Move the stone steadily along the line against the saw blade because on a wet saw the blade does not move.  Push the stone flat, steadily, and slowly through the blade until the cut is complete.  Clean and store tools. ",
  "sentences":[
    " Cutting flagstone into irregular shapes.",
    "Use a hammer and chisel to cut flagstone when accuracy of cut or straight lines are not important.",
    "A hammer and chisel is best to cut or shape flagstone for small projects that do not require accurate cuts, such as a small garden path or a decorative step or bench top.",
    "Set the flagstone on a solid surface.",
    "Measure and draw a line to cut.",
    "Leave a distinct bold line, such as that provided by paver chalk or a piece of roofer's slate.",
    "The measurement must allow for the space made by joint or mortar.",
    "Hammer sharply, but not heavily, on the chisel as you move it along the drawn line in order to score the line.",
    "Continue to score along the line with even pressure.",
    "Allow time for this process, or you may crack or break the stone unintentionally.",
    "Continue to tap the chisel with the hammer along the scored line until stone breaks along the scored line.",
    "Cutting flagstone into regular shapes.",
    "Use a circular saw with masonry blade to make regular cuts in the same size for small projects, such as a fireplace hearth.",
    "Clamp the flagstone firmly to a solid surface.",
    "Measure and clearly draw the line to cut.",
    "Begin to saw along the line.",
    "Do not apply pressure to the saw; just allow the weight of the saw to score the stone.",
    "The intent is not to saw through the flagstone; rather, the purpose is to create a significant score in the stone along which repeated blows with a hammer and chisel will break the stone.",
    "Prop the stone that has been scored by the circular saw at an angle on a tool or brick along the bottom side of the flagstone parallel to the scored line.",
    "Tap chisel with hammer sharply along the scored line until piece breaks away.",
    "Cutting flagstone into accurate cuts.",
    "Cut flagstone with a wet saw if you have a large job or a job that requires accurate cuts or design cuts, such as a patio floor, a pool deck, curves or edging where you want to repeat a color scheme.",
    "Buy or rent a water-fed saw with a diamond edged blade.",
    "Water is fed onto blade so it lubricates the cut and reduces the debris generated by the cut.",
    "Read the assembly and usage directions carefully.",
    "Measure and score the line desired.",
    "Move the stone steadily along the line against the saw blade because on a wet saw the blade does not move.",
    "Push the stone flat, steadily, and slowly through the blade until the cut is complete.",
    "Clean and store tools."
  ],
  "tyn_section":[
    "Safety equipment including dust mask, goggles, and gloves.",
    "Lump hammer, a heavy 2 headed hammer",
    "Bolster chisel, a broad chisel used for straight cuts",
    "Pitcher chisel, a thick chisel used for trimming edges",
    "Paver marker, a chalk used to draw lines",
    "Masonry blade for circular saw",
    "Wet saw"
  ],
  "tyn_model":[
    "flagstone",
    "saw",
    "chisel",
    "hammer",
    "hammer and chisel",
    "circular saw",
    "paver chalk",
    "roofer's slate",
    "mortar",
    "wet saw",
    "water-fed saw",
    "water",
    "saw blade",
    "tools"
  ],
  "simple_metrics":{
    "r":0.1428571429,
    "p":0.0714285714,
    "f1":0.0952380952,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1428571429,
    "p":0.1428571429,
    "f1":0.1428571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2857142857,
    "p":0.3571428571,
    "f1":0.3174603175
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1428571429,
    "p":0.0714285714,
    "f1":0.0952380952
  }
}