{
  "title":"How to Install Outdoor Lighting",
  "url":"https://www.wikihow.com/Install-Outdoor-Lighting",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "parts":[
    {
      "name":"Laying Out the Electrical Wiring",
      "steps":[
        {
          "headline":"Mark the route that you’ll run your electric cable along.",
          "description":"Identify the spots in your yard where you want your light fixtures to be located, as well as where you’ll set up your transformer box. Use string or spray paint to plot a route that takes an electric cable from the transformer to each of the light fixtures you’ll install. This will allow you to plan ahead of time where you’ll dig and bury the cable. Try to steer clear of placing the route near any trees, since they’ll likely have shallow roots that will interfere with the installation process. Plan on setting up your transformer box next to an outdoor electrical outlet."
        },
        {
          "headline":"Contact the power company to have them identify any underground lines.",
          "description":"Call the telephone company and cable company as well, if you have these services in your home. You’ll need to make sure you’re not going to sever any important cables running underground when you start digging along the cable route. If you live in the United States, you can call 811 to be put in touch with your local utility company. Have the company mark the locations of any underground utilities in your yard so that you won’t accidentally dig into them."
        },
        {
          "headline":"Dig a shallow trench along your wiring route.",
          "description":"Use a ditch-witch or a trenching shovel to dig this trench about 3 inches (7.6 cm) deep. You may need to use the shovel to turn over any sod or grass on your lawn first. Using a ditch-witch or trenching shovel is ideal since these tools will give you a more narrow trench. You don’t want to have to move a bunch of loose dirt around during this installation process. Don’t worry about the width of the trench; just make it as wide as the width of your shovel."
        },
        {
          "headline":"Place the cable in the trench without burying it.",
          "description":"Leave about 1 foot (0.30 m) of loose cable on the end next to the transformer, since you’ll need to attach the wiring to the box. Leave a small loop at each planned fixture location as well, so you can connect the wiring to the fixture. Make sure you can push the cable all the way down to the bottom of the trench, so that it won’t jut out of the trench when you go to bury it."
        }
      ]
    },
    {
      "name":"Connecting the Wiring to the House",
      "steps":[
        {
          "headline":"Run the cable up to the outdoor outlet and strip the end of it.",
          "description":"Use wire strippers to cut the end of the cable and remove about ⁄2 inch (1.3 cm) of rubber insulation. This should leave 2 wires exposed. You can also use a utility knife to strip the wire, although it will be much easier to use the wire strippers. If the cable has cable nuts, remove them before stripping it."
        },
        {
          "headline":"Attach the 2 exposed wires from the cable to the transformer box.",
          "description":"Slide the wires under the 2 screws (called terminal screws) located on the bottom of the transformer box. Then, use a screwdriver to tighten the top and bottom terminal block set screws to attach the wires to the box. The inside of the transformer box should include guidelines and brief instructions on how to safely attach these wires to the box. Be sure the screws are tightened all the way to prevent the wires from sliding out."
        },
        {
          "headline":"Drive a stake into the ground and attach the transformer to it.",
          "description":"Hammer a sturdy wooden stake about 1 foot (0.30 m) into the ground next to the outlet. Then, use the screwdriver to screw the transformer box into the stake to attach it. You can also mount the box onto the side of your house if you have wooden or vinyl siding. Use a screwdriver to drive a screw through the back of the box and into the siding."
        }
      ]
    },
    {
      "name":"Installing the Light Fixtures",
      "steps":[
        {
          "headline":"Place your fixtures about where you intend to install them.",
          "description":"Lay the light fixtures alongside your cable, keeping them about 8 to 10 feet (2.4 to 3.0 m) apart from one another. Don’t worry about how they look just yet; it’s fine to just lay them on the ground!"
        },
        {
          "headline":"Dig a narrow hole on the spot where you plan to put 1 of the fixtures.",
          "description":"Use your screwdriver or a long steel punch to make a deep, narrow hole for the light fixture’s stake. Make the depth of the hole the same as the length of the stake. Doing this will make it much easier for you to drive the stake into the ground later on. Your light fixtures should have come with stakes, if you purchased them from a store. If you don’t have one of these stakes, buy some metal stakes that are about 8 to 10 inches (20 to 25 cm) long to use instead."
        },
        {
          "headline":"Connect the fixture wires to the main cable.",
          "description":"Take the 2 connector halves hanging from the bottom of the light fixture and slip them over the cable. Then, pinch them together until you hear a click. This is the sound of the connectors making a connection with the wires inside the cable. Be sure the cable is not hooked up to a power source when you go to connect it to the light fixture."
        },
        {
          "headline":"Attach the fixture to the stake, then push the stake into the ground.",
          "description":"Use both hands to grip the stake (with the fixture attached to it) and push it into the narrow hole you dug for it. Don’t try to hammer it into the ground, since this may damage the light. You will most likely just have to snap the fixture onto the stake. However, some manufacturers ask that you use a screw and screwdriver to attach the two. Check to make sure the fixture is vertically straight after you insert it into the ground. If it isn’t straight, pull it out and reinsert it."
        },
        {
          "headline":"Repeat this process for all the other light fixtures.",
          "description":"Hook up each fixture to the main cable, then attach them to stakes and push them into the ground. Make sure they’re all aligned the way you want them to be and that they’re all straight before proceeding."
        },
        {
          "headline":"Plug the transformer into the outlet to test your lights.",
          "description":"If any of the lights don’t come on, check to see that the bulb is correctly screwed in. If the bulb is good but the light still doesn’t come on, it’s most likely a problem with the wiring. If the lights are dim, this means they’re not getting enough electricity. Make sure the cable isn’t running beyond the manufacturer’s recommended length."
        },
        {
          "headline":"Bury all of the exposed wiring.",
          "description":"Use your shovel to replace all of the dirt that you displaced to create your cable trench. Place some loose soil around the light fixtures to hide the wires coming out of them as well, if necessary."
        }
      ]
    }
  ],
  "text":" Laying Out the Electrical Wiring Mark the route that you’ll run your electric cable along. Identify the spots in your yard where you want your light fixtures to be located, as well as where you’ll set up your transformer box. Use string or spray paint to plot a route that takes an electric cable from the transformer to each of the light fixtures you’ll install. This will allow you to plan ahead of time where you’ll dig and bury the cable. Try to steer clear of placing the route near any trees, since they’ll likely have shallow roots that will interfere with the installation process. Plan on setting up your transformer box next to an outdoor electrical outlet. Contact the power company to have them identify any underground lines. Call the telephone company and cable company as well, if you have these services in your home. You’ll need to make sure you’re not going to sever any important cables running underground when you start digging along the cable route. If you live in the United States, you can call 811 to be put in touch with your local utility company. Have the company mark the locations of any underground utilities in your yard so that you won’t accidentally dig into them. Dig a shallow trench along your wiring route. Use a ditch-witch or a trenching shovel to dig this trench about 3 inches (7.6 cm) deep. You may need to use the shovel to turn over any sod or grass on your lawn first. Using a ditch-witch or trenching shovel is ideal since these tools will give you a more narrow trench. You don’t want to have to move a bunch of loose dirt around during this installation process. Don’t worry about the width of the trench; just make it as wide as the width of your shovel. Place the cable in the trench without burying it. Leave about 1 foot (0.30 m) of loose cable on the end next to the transformer, since you’ll need to attach the wiring to the box. Leave a small loop at each planned fixture location as well, so you can connect the wiring to the fixture. Make sure you can push the cable all the way down to the bottom of the trench, so that it won’t jut out of the trench when you go to bury it. Connecting the Wiring to the House Run the cable up to the outdoor outlet and strip the end of it. Use wire strippers to cut the end of the cable and remove about ⁄2 inch (1.3 cm) of rubber insulation. This should leave 2 wires exposed. You can also use a utility knife to strip the wire, although it will be much easier to use the wire strippers. If the cable has cable nuts, remove them before stripping it. Attach the 2 exposed wires from the cable to the transformer box. Slide the wires under the 2 screws (called terminal screws) located on the bottom of the transformer box. Then, use a screwdriver to tighten the top and bottom terminal block set screws to attach the wires to the box. The inside of the transformer box should include guidelines and brief instructions on how to safely attach these wires to the box. Be sure the screws are tightened all the way to prevent the wires from sliding out. Drive a stake into the ground and attach the transformer to it. Hammer a sturdy wooden stake about 1 foot (0.30 m) into the ground next to the outlet. Then, use the screwdriver to screw the transformer box into the stake to attach it. You can also mount the box onto the side of your house if you have wooden or vinyl siding. Use a screwdriver to drive a screw through the back of the box and into the siding. Installing the Light Fixtures Place your fixtures about where you intend to install them. Lay the light fixtures alongside your cable, keeping them about 8 to 10 feet (2.4 to 3.0 m) apart from one another. Don’t worry about how they look just yet; it’s fine to just lay them on the ground! Dig a narrow hole on the spot where you plan to put 1 of the fixtures. Use your screwdriver or a long steel punch to make a deep, narrow hole for the light fixture’s stake. Make the depth of the hole the same as the length of the stake. Doing this will make it much easier for you to drive the stake into the ground later on. Your light fixtures should have come with stakes, if you purchased them from a store. If you don’t have one of these stakes, buy some metal stakes that are about 8 to 10 inches (20 to 25 cm) long to use instead. Connect the fixture wires to the main cable. Take the 2 connector halves hanging from the bottom of the light fixture and slip them over the cable. Then, pinch them together until you hear a click. This is the sound of the connectors making a connection with the wires inside the cable. Be sure the cable is not hooked up to a power source when you go to connect it to the light fixture. Attach the fixture to the stake, then push the stake into the ground. Use both hands to grip the stake (with the fixture attached to it) and push it into the narrow hole you dug for it. Don’t try to hammer it into the ground, since this may damage the light. You will most likely just have to snap the fixture onto the stake. However, some manufacturers ask that you use a screw and screwdriver to attach the two. Check to make sure the fixture is vertically straight after you insert it into the ground. If it isn’t straight, pull it out and reinsert it. Repeat this process for all the other light fixtures. Hook up each fixture to the main cable, then attach them to stakes and push them into the ground. Make sure they’re all aligned the way you want them to be and that they’re all straight before proceeding. Plug the transformer into the outlet to test your lights. If any of the lights don’t come on, check to see that the bulb is correctly screwed in. If the bulb is good but the light still doesn’t come on, it’s most likely a problem with the wiring. If the lights are dim, this means they’re not getting enough electricity. Make sure the cable isn’t running beyond the manufacturer’s recommended length. Bury all of the exposed wiring. Use your shovel to replace all of the dirt that you displaced to create your cable trench. Place some loose soil around the light fixtures to hide the wires coming out of them as well, if necessary.",
  "sentences":[
    " Laying Out the Electrical Wiring Mark the route that you’ll run your electric cable along.",
    "Identify the spots in your yard where you want your light fixtures to be located, as well as where you’ll set up your transformer box.",
    "Use string or spray paint to plot a route that takes an electric cable from the transformer to each of the light fixtures you’ll install.",
    "This will allow you to plan ahead of time where you’ll dig and bury the cable.",
    "Try to steer clear of placing the route near any trees, since they’ll likely have shallow roots that will interfere with the installation process.",
    "Plan on setting up your transformer box next to an outdoor electrical outlet.",
    "Contact the power company to have them identify any underground lines.",
    "Call the telephone company and cable company as well, if you have these services in your home.",
    "You’ll need to make sure you’re not going to sever any important cables running underground when you start digging along the cable route.",
    "If you live in the United States, you can call 811 to be put in touch with your local utility company.",
    "Have the company mark the locations of any underground utilities in your yard so that you won’t accidentally dig into them.",
    "Dig a shallow trench along your wiring route.",
    "Use a ditch-witch or a trenching shovel to dig this trench about 3 inches (7.6 cm) deep.",
    "You may need to use the shovel to turn over any sod or grass on your lawn first.",
    "Using a ditch-witch or trenching shovel is ideal since these tools will give you a more narrow trench.",
    "You don’t want to have to move a bunch of loose dirt around during this installation process.",
    "Don’t worry about the width of the trench; just make it as wide as the width of your shovel.",
    "Place the cable in the trench without burying it.",
    "Leave about 1 foot (0.30 m) of loose cable on the end next to the transformer, since you’ll need to attach the wiring to the box.",
    "Leave a small loop at each planned fixture location as well, so you can connect the wiring to the fixture.",
    "Make sure you can push the cable all the way down to the bottom of the trench, so that it won’t jut out of the trench when you go to bury it.",
    "Connecting the Wiring to the House Run the cable up to the outdoor outlet and strip the end of it.",
    "Use wire strippers to cut the end of the cable and remove about ⁄2 inch (1.3 cm) of rubber insulation.",
    "This should leave 2 wires exposed.",
    "You can also use a utility knife to strip the wire, although it will be much easier to use the wire strippers.",
    "If the cable has cable nuts, remove them before stripping it.",
    "Attach the 2 exposed wires from the cable to the transformer box.",
    "Slide the wires under the 2 screws (called terminal screws) located on the bottom of the transformer box.",
    "Then, use a screwdriver to tighten the top and bottom terminal block set screws to attach the wires to the box.",
    "The inside of the transformer box should include guidelines and brief instructions on how to safely attach these wires to the box.",
    "Be sure the screws are tightened all the way to prevent the wires from sliding out.",
    "Drive a stake into the ground and attach the transformer to it.",
    "Hammer a sturdy wooden stake about 1 foot (0.30 m) into the ground next to the outlet.",
    "Then, use the screwdriver to screw the transformer box into the stake to attach it.",
    "You can also mount the box onto the side of your house if you have wooden or vinyl siding.",
    "Use a screwdriver to drive a screw through the back of the box and into the siding.",
    "Installing the Light Fixtures Place your fixtures about where you intend to install them.",
    "Lay the light fixtures alongside your cable, keeping them about 8 to 10 feet (2.4 to 3.0 m) apart from one another.",
    "Don’t worry about how they look just yet; it’s fine to just lay them on the ground!",
    "Dig a narrow hole on the spot where you plan to put 1 of the fixtures.",
    "Use your screwdriver or a long steel punch to make a deep, narrow hole for the light fixture’s stake.",
    "Make the depth of the hole the same as the length of the stake.",
    "Doing this will make it much easier for you to drive the stake into the ground later on.",
    "Your light fixtures should have come with stakes, if you purchased them from a store.",
    "If you don’t have one of these stakes, buy some metal stakes that are about 8 to 10 inches (20 to 25 cm) long to use instead.",
    "Connect the fixture wires to the main cable.",
    "Take the 2 connector halves hanging from the bottom of the light fixture and slip them over the cable.",
    "Then, pinch them together until you hear a click.",
    "This is the sound of the connectors making a connection with the wires inside the cable.",
    "Be sure the cable is not hooked up to a power source when you go to connect it to the light fixture.",
    "Attach the fixture to the stake, then push the stake into the ground.",
    "Use both hands to grip the stake (with the fixture attached to it) and push it into the narrow hole you dug for it.",
    "Don’t try to hammer it into the ground, since this may damage the light.",
    "You will most likely just have to snap the fixture onto the stake.",
    "However, some manufacturers ask that you use a screw and screwdriver to attach the two.",
    "Check to make sure the fixture is vertically straight after you insert it into the ground.",
    "If it isn’t straight, pull it out and reinsert it.",
    "Repeat this process for all the other light fixtures.",
    "Hook up each fixture to the main cable, then attach them to stakes and push them into the ground.",
    "Make sure they’re all aligned the way you want them to be and that they’re all straight before proceeding.",
    "Plug the transformer into the outlet to test your lights.",
    "If any of the lights don’t come on, check to see that the bulb is correctly screwed in.",
    "If the bulb is good but the light still doesn’t come on, it’s most likely a problem with the wiring.",
    "If the lights are dim, this means they’re not getting enough electricity.",
    "Make sure the cable isn’t running beyond the manufacturer’s recommended length.",
    "Bury all of the exposed wiring.",
    "Use your shovel to replace all of the dirt that you displaced to create your cable trench.",
    "Place some loose soil around the light fixtures to hide the wires coming out of them as well, if necessary."
  ],
  "tyn_section":[
    "Outdoor lighting starter kit",
    "Transformer",
    "Ditch-witch or shovel",
    "Screwdriver",
    "Wire strippers"
  ],
  "tyn_model":[
    "screwdriver",
    "shovel",
    "transformer",
    "light fixture",
    "stakes",
    "electric cable",
    "ditch-witch",
    "trenching shovel",
    "wire strippers",
    "light fixtures",
    "fixture",
    "electrical wiring",
    "spray paint",
    "telephone",
    "outdoor outlet",
    "rubber insulation",
    "utility knife",
    "terminal screws",
    "stake",
    "screw"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.15,
    "f1":0.24,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.15,
    "f1":0.24
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.25,
    "f1":0.380952381
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.15,
    "f1":0.24
  }
}