{
  "title":"How to Ripen Kiwi Fruit",
  "url":"https://www.wikihow.com/Ripen-Kiwi-Fruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Ripening Kiwi Fruit",
      "steps":[
        {
          "headline":"Choose unblemished kiwi fruit.",
          "description":"Look for a kiwi that doesn't have any dark spots or tears in the skin. Feel the kiwi and choose one that's firm to the touch. Most kiwi fruit varieties that you find in the grocery store ripen perfectly fine off the vine. If you're growing your own kiwi and want to know how to ripen them, check into the variety you have to determine whether you should leave your fruit on the vine til it's ripe or harvest it while it's hard."
        },
        {
          "headline":"Check the seeds.",
          "description":"If you have a lot of fruit to spare, cut one open and look at the seeds. A kiwi won't ripen if its seeds are still green or yellow - they must be black. Black seeds indicate the kiwi has enough sugar to ripen properly."
        },
        {
          "headline":"Put the kiwi fruit in the refrigerator until you're ready to ripen them.",
          "description":"Hard kiwis will last in the refrigerator for at least 4 months. Store kiwis alone so they don't come into contact with fruits that make ethylene, the gas that causes fruit to ripen."
        },
        {
          "headline":"Set out the kiwis you want to ripen at room temperature.",
          "description":"Place them in a bowl on your countertop and simply wait a few days. The fruit will ripen in 3 to 5 days if stored at room temperature. Don't put the kiwis in direct sunlight. This could cause them to become discolored or rot too quickly."
        },
        {
          "headline":"Speed up ripening by exposing the kiwifruit to ethylene.",
          "description":"Set the kiwifruit next to an apple, banana, or pear. This exposes the kiwis to ethylene produced by the other fruits. Keep the ripening kiwis out of sunlight and away from heat sources. To make the kiwi fruit ripen even faster, put it in a paper bag or a vented plastic bag along with an apple, banana, or pear. Store the bag at room temperature for 1 or 2 days."
        },
        {
          "headline":"Test the kiwifruit for ripeness by pressing with your thumb.",
          "description":"The fruit is ripe if it yields to slight pressure. A kiwi that's ready to eat is plump and fragrant."
        },
        {
          "headline":"Eat the ripe kiwis quickly.",
          "description":"Make sure to eat them when they're at their peak - otherwise they'll start to rot."
        }
      ]
    },
    {
      "name":"Storing Ripe Kiwi Fruit",
      "steps":[
        {
          "headline":"Keep ripened kiwi fruit in the refrigerator for as long as 7 days.",
          "description":"You can extend the storage time for another week if you refrigerate them in a plastic bag. The bag lessens dehydration and prolongs freshness."
        },
        {
          "headline":"Freeze whole kiwi fruit.",
          "description":"Simply place whole kiwis in a freezer-safe container and store them in the freezer for several months."
        },
        {
          "headline":"Freeze sliced kiwi fruit.",
          "description":"Kiwi slices make great garnishes or additions to smoothies and other healthy treats. If you have extra kiwis on hand, you can slice them up and freeze them. Slice the kiwis and sprinkle sugar on the slices to keep them firm and flavorful. Put the sugared kiwi slices on a cookie sheet and slide the sheet into the freezer. Transfer the frozen kiwi slices from the cookie sheet into plastic freezer bags. Store them in the freezer."
        }
      ]
    }
  ],
  "text":" Ripening Kiwi Fruit Choose unblemished kiwi fruit. Look for a kiwi that doesn't have any dark spots or tears in the skin. Feel the kiwi and choose one that's firm to the touch. Most kiwi fruit varieties that you find in the grocery store ripen perfectly fine off the vine. If you're growing your own kiwi and want to know how to ripen them, check into the variety you have to determine whether you should leave your fruit on the vine til it's ripe or harvest it while it's hard. Check the seeds. If you have a lot of fruit to spare, cut one open and look at the seeds. A kiwi won't ripen if its seeds are still green or yellow - they must be black. Black seeds indicate the kiwi has enough sugar to ripen properly. Put the kiwi fruit in the refrigerator until you're ready to ripen them. Hard kiwis will last in the refrigerator for at least 4 months. Store kiwis alone so they don't come into contact with fruits that make ethylene, the gas that causes fruit to ripen. Set out the kiwis you want to ripen at room temperature. Place them in a bowl on your countertop and simply wait a few days. The fruit will ripen in 3 to 5 days if stored at room temperature. Don't put the kiwis in direct sunlight. This could cause them to become discolored or rot too quickly. Speed up ripening by exposing the kiwifruit to ethylene. Set the kiwifruit next to an apple, banana, or pear. This exposes the kiwis to ethylene produced by the other fruits. Keep the ripening kiwis out of sunlight and away from heat sources. To make the kiwi fruit ripen even faster, put it in a paper bag or a vented plastic bag along with an apple, banana, or pear. Store the bag at room temperature for 1 or 2 days. Test the kiwifruit for ripeness by pressing with your thumb. The fruit is ripe if it yields to slight pressure. A kiwi that's ready to eat is plump and fragrant. Eat the ripe kiwis quickly. Make sure to eat them when they're at their peak - otherwise they'll start to rot. Storing Ripe Kiwi Fruit Keep ripened kiwi fruit in the refrigerator for as long as 7 days. You can extend the storage time for another week if you refrigerate them in a plastic bag. The bag lessens dehydration and prolongs freshness. Freeze whole kiwi fruit. Simply place whole kiwis in a freezer-safe container and store them in the freezer for several months. Freeze sliced kiwi fruit. Kiwi slices make great garnishes or additions to smoothies and other healthy treats. If you have extra kiwis on hand, you can slice them up and freeze them. Slice the kiwis and sprinkle sugar on the slices to keep them firm and flavorful. Put the sugared kiwi slices on a cookie sheet and slide the sheet into the freezer. Transfer the frozen kiwi slices from the cookie sheet into plastic freezer bags. Store them in the freezer.",
  "sentences":[
    " Ripening Kiwi Fruit Choose unblemished kiwi fruit.",
    "Look for a kiwi that doesn't have any dark spots or tears in the skin.",
    "Feel the kiwi and choose one that's firm to the touch.",
    "Most kiwi fruit varieties that you find in the grocery store ripen perfectly fine off the vine.",
    "If you're growing your own kiwi and want to know how to ripen them, check into the variety you have to determine whether you should leave your fruit on the vine til it's ripe or harvest it while it's hard.",
    "Check the seeds.",
    "If you have a lot of fruit to spare, cut one open and look at the seeds.",
    "A kiwi won't ripen if its seeds are still green or yellow - they must be black.",
    "Black seeds indicate the kiwi has enough sugar to ripen properly.",
    "Put the kiwi fruit in the refrigerator until you're ready to ripen them.",
    "Hard kiwis will last in the refrigerator for at least 4 months.",
    "Store kiwis alone so they don't come into contact with fruits that make ethylene, the gas that causes fruit to ripen.",
    "Set out the kiwis you want to ripen at room temperature.",
    "Place them in a bowl on your countertop and simply wait a few days.",
    "The fruit will ripen in 3 to 5 days if stored at room temperature.",
    "Don't put the kiwis in direct sunlight.",
    "This could cause them to become discolored or rot too quickly.",
    "Speed up ripening by exposing the kiwifruit to ethylene.",
    "Set the kiwifruit next to an apple, banana, or pear.",
    "This exposes the kiwis to ethylene produced by the other fruits.",
    "Keep the ripening kiwis out of sunlight and away from heat sources.",
    "To make the kiwi fruit ripen even faster, put it in a paper bag or a vented plastic bag along with an apple, banana, or pear.",
    "Store the bag at room temperature for 1 or 2 days.",
    "Test the kiwifruit for ripeness by pressing with your thumb.",
    "The fruit is ripe if it yields to slight pressure.",
    "A kiwi that's ready to eat is plump and fragrant.",
    "Eat the ripe kiwis quickly.",
    "Make sure to eat them when they're at their peak - otherwise they'll start to rot.",
    "Storing Ripe Kiwi Fruit Keep ripened kiwi fruit in the refrigerator for as long as 7 days.",
    "You can extend the storage time for another week if you refrigerate them in a plastic bag.",
    "The bag lessens dehydration and prolongs freshness.",
    "Freeze whole kiwi fruit.",
    "Simply place whole kiwis in a freezer-safe container and store them in the freezer for several months.",
    "Freeze sliced kiwi fruit.",
    "Kiwi slices make great garnishes or additions to smoothies and other healthy treats.",
    "If you have extra kiwis on hand, you can slice them up and freeze them.",
    "Slice the kiwis and sprinkle sugar on the slices to keep them firm and flavorful.",
    "Put the sugared kiwi slices on a cookie sheet and slide the sheet into the freezer.",
    "Transfer the frozen kiwi slices from the cookie sheet into plastic freezer bags.",
    "Store them in the freezer."
  ],
  "tyn_section":[
    "Kiwi fruit",
    "Plastic bags",
    "Banana, apple or pear",
    "Paper bags",
    "Sugar",
    "Cookie sheet",
    "Freezer bags"
  ],
  "tyn_model":[
    "refrigerator",
    "ethylene",
    "kiwifruit",
    "sugar",
    "apple",
    "banana",
    "cookie sheet",
    "freezer",
    "kiwis",
    "bowl",
    "vented plastic bag",
    "freezer-safe container",
    "freezer bags"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.2307692308,
    "f1":0.3,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.3076923077,
    "f1":0.3582089552
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.3076923077,
    "f1":0.4301075269
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.2307692308,
    "f1":0.3
  }
}