{
  "title":"How to Fix a Drafty Window",
  "url":"https://www.wikihow.com/Fix-a-Drafty-Window",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows"
  ],
  "methods":[
    {
      "name":"Using Quick Fixes",
      "steps":[
        {
          "headline":"Insulate the window with a strip of rope caulk.",
          "description":"Rope caulk is a flexible putty-like caulk that you can press and mold into the edges of a window to seal drafts. Purchase rope caulk at a hardware store and press it into the edges of the window to seal it. You can also try using V-seal weather stripping to seal the edges of the window. This is a special type of weather stripping that you can press into the edges of the window to seal up a draft."
        },
        {
          "headline":"Fill in a crack in a window with clear nail polish.",
          "description":"If a crack in the window is causing the draft, then you will need to replace the window to fix the draft. However, a temporary way to fix the draft is to paint over the crack with clear nail polish. Allow the nail polish to dry completely and add another coat if needed. You may need to paint on 2 to 3 coats to ensure that the crack is fully covered. Keep in mind that you will still need to replace the window eventually. The nail polish will only hold for 1 to 2 months at most."
        },
        {
          "headline":"Place a weighted sock along the bottom edge of the window.",
          "description":"You can purchase or make a weighted sock for blocking gaps in doors and windows. Place the sock along the bottom edge of the window or where the top and bottom pane meet to seal in more air and prevent drafts. Check online or in a department store to purchase a window or door sock. Although a window sock won’t actually fix a drafty window permanently, this is the quickest and easiest way to stop a draft.Tip: If you want to make your own window sock, get an old knee-length sock and fill it with rice or sand. Then, tie or sew the opening closed to keep the contents inside of the sock, and it’s ready to use!"
        },
        {
          "headline":"Put up thick curtains to cover the drafty window.",
          "description":"Heavy curtains or specially made insulating curtains will also help to quickly reduce the effects of a draft. The curtains will not fix the problem, but this is a good option if you need to stop the draft in a hurry. Light and noise blocking curtains are usually thick enough to provide some draft protection. You can also layer 2 curtains over the window or use fabric blinds, such as roman blinds."
        },
        {
          "headline":"Purchase and install interior storm windows.",
          "description":"If you already have a storm window, then cover your interior windows with it to keep out drafts. If not, measure your window and purchase a storm window to fit it. Then, place the storm window over your regular window to easily seal out the draft. Storm windows can be an expensive fix for drafty windows, but you can use them again and again."
        }
      ]
    },
    {
      "name":"Covering Windows with Plastic",
      "steps":[
        {
          "headline":"Purchase a plastic shrink wrap window kit.",
          "description":"You can purchase a window insulation kit from a hardware store. These kits have everything you need to cover a drafty window. You can purchase kits with extra materials for covering multiple windows. The kit should include double-sided tape and plastic for covering your windows. You can buy these items separately if you prefer."
        },
        {
          "headline":"Apply 1 strip of double-sided tape along the edges of the window.",
          "description":"Start by pressing the end of the tape into the edge of the window just outside of the glass. Dispense the tape and continue pressing it until you have covered 1 side of the window. Then, cut the tape when you get to the end of the edge. Repeat to cover the other side and the top and bottom edges of the window."
        },
        {
          "headline":"Remove the covering on the double-sided tape after 10 to 15 minutes.",
          "description":"Letting the tape sit for 10 to 15 minutes will allow it to get tacky and improve its bond with the window. After time is up, peel off the cover on the tape strips surrounding the window. Discard the covering you remove from the tape strips."
        },
        {
          "headline":"Press the plastic wrap onto the double-sided tape.",
          "description":"Take 1 of the plastic pieces included with your kit and line up the corner with the corner of the window where you applied the tape. Then, press the plastic onto the double-sided tape. Slide your hands down the edge of the window over the plastic to secure it to the tape. Repeat this for the top edge of the plastic. Then, pull the plastic taut and secure the other side and bottom edge of the plastic by pressing down on it. Tip: For an extra layer of insulation, apply a layer over bubble wrap over the window first, and then apply the plastic over that. This will create a frosted glass effect and prevent you from being able to see through the windows, but it will provide more insulation and potentially save you even more on heating bills."
        },
        {
          "headline":"Use a hair dryer to tighten the plastic.",
          "description":"Once the plastic is secured on the window with the double-sided tape, plug in a hair dryer and turn it on. Hover the dryer’s nozzle over the plastic anywhere that it looks loose. This will help to shrink the plastic and create a tight fit with the window. Make sure to keep moving the hair dryer around over the plastic. Avoid holding in one spot for more than 5 seconds as this may make a hole in the plastic."
        },
        {
          "headline":"Trim the excess plastic to the size of your windows.",
          "description":"After you have tightened up the plastic with the hair dryer, use a pair of scissors to cut off the excess plastic along the edges of the window. Be careful not to cut inside of where you applied the double-sided tape or you may break the seal."
        }
      ]
    },
    {
      "name":"Sealing Drafts with Caulk",
      "steps":[
        {
          "headline":"Hold a candle up to the window to find the source of the draft.",
          "description":"Light a candle and hold it up next to the window. Move it around the edges of the window and watch the candle to see if it flickers. If you notice the candle moving like it is being blown in the wind, then this is probably a drafty part of the window. Mark it with a piece of chalk or tape. If you are not sure where the air is coming in from and you only want to seal up the drafty portion of a window, check to find the draft first.Warning: Be cautious with the flame around curtains or blinds. You may want to remove them before you do this to prevent the possibility of starting a fire."
        },
        {
          "headline":"Remove the old caulk and peeling paint from the window’s edges.",
          "description":"Use a paint scraper to take all of the old caulk off of the edges of the window. Press the scraper against the edge of the window, and then move it upwards to loosen the caulk. If there is any peeling paint, scrap this off as well since it will interfere with re-caulking the window."
        },
        {
          "headline":"Wash the edges of the window with a scrub brush and soapy water.",
          "description":"Fill a small bucket with soapy water and dip a scrub brush into it. Then use the scrub brush to wash along the edges of the window. Replace the soapy water with plain water and use the brush to rinse the soap away. Then, pat the window dry with a clean dry towel or paper towels. Washing the window’s edges first will help to ensure that you get a tight seal with the new layer of caulk."
        },
        {
          "headline":"Seal the edges with a new layer of caulk.",
          "description":"Depress the plunger on the caulk tube to push it out as you run the tip of the caulk gun down the edge of the window. Continue to do this until you have completely covered 1 edge of the window. Then, repeat for the other 3 sides of the window. Allow the caulk to dry overnight, or for at least 8 hours to ensure that it is set. Make sure to follow the manufacturer’s instructions for how to use the caulk properly."
        }
      ]
    }
  ],
  "text":" Using Quick Fixes Insulate the window with a strip of rope caulk. Rope caulk is a flexible putty-like caulk that you can press and mold into the edges of a window to seal drafts. Purchase rope caulk at a hardware store and press it into the edges of the window to seal it. You can also try using V-seal weather stripping to seal the edges of the window. This is a special type of weather stripping that you can press into the edges of the window to seal up a draft. Fill in a crack in a window with clear nail polish. If a crack in the window is causing the draft, then you will need to replace the window to fix the draft. However, a temporary way to fix the draft is to paint over the crack with clear nail polish. Allow the nail polish to dry completely and add another coat if needed. You may need to paint on 2 to 3 coats to ensure that the crack is fully covered. Keep in mind that you will still need to replace the window eventually. The nail polish will only hold for 1 to 2 months at most. Place a weighted sock along the bottom edge of the window. You can purchase or make a weighted sock for blocking gaps in doors and windows. Place the sock along the bottom edge of the window or where the top and bottom pane meet to seal in more air and prevent drafts. Check online or in a department store to purchase a window or door sock. Although a window sock won’t actually fix a drafty window permanently, this is the quickest and easiest way to stop a draft.Tip: If you want to make your own window sock, get an old knee-length sock and fill it with rice or sand. Then, tie or sew the opening closed to keep the contents inside of the sock, and it’s ready to use! Put up thick curtains to cover the drafty window. Heavy curtains or specially made insulating curtains will also help to quickly reduce the effects of a draft. The curtains will not fix the problem, but this is a good option if you need to stop the draft in a hurry. Light and noise blocking curtains are usually thick enough to provide some draft protection. You can also layer 2 curtains over the window or use fabric blinds, such as roman blinds. Purchase and install interior storm windows. If you already have a storm window, then cover your interior windows with it to keep out drafts. If not, measure your window and purchase a storm window to fit it. Then, place the storm window over your regular window to easily seal out the draft. Storm windows can be an expensive fix for drafty windows, but you can use them again and again. Covering Windows with Plastic Purchase a plastic shrink wrap window kit. You can purchase a window insulation kit from a hardware store. These kits have everything you need to cover a drafty window. You can purchase kits with extra materials for covering multiple windows. The kit should include double-sided tape and plastic for covering your windows. You can buy these items separately if you prefer. Apply 1 strip of double-sided tape along the edges of the window. Start by pressing the end of the tape into the edge of the window just outside of the glass. Dispense the tape and continue pressing it until you have covered 1 side of the window. Then, cut the tape when you get to the end of the edge. Repeat to cover the other side and the top and bottom edges of the window. Remove the covering on the double-sided tape after 10 to 15 minutes. Letting the tape sit for 10 to 15 minutes will allow it to get tacky and improve its bond with the window. After time is up, peel off the cover on the tape strips surrounding the window. Discard the covering you remove from the tape strips. Press the plastic wrap onto the double-sided tape. Take 1 of the plastic pieces included with your kit and line up the corner with the corner of the window where you applied the tape. Then, press the plastic onto the double-sided tape. Slide your hands down the edge of the window over the plastic to secure it to the tape. Repeat this for the top edge of the plastic. Then, pull the plastic taut and secure the other side and bottom edge of the plastic by pressing down on it. Tip: For an extra layer of insulation, apply a layer over bubble wrap over the window first, and then apply the plastic over that. This will create a frosted glass effect and prevent you from being able to see through the windows, but it will provide more insulation and potentially save you even more on heating bills. Use a hair dryer to tighten the plastic. Once the plastic is secured on the window with the double-sided tape, plug in a hair dryer and turn it on. Hover the dryer’s nozzle over the plastic anywhere that it looks loose. This will help to shrink the plastic and create a tight fit with the window. Make sure to keep moving the hair dryer around over the plastic. Avoid holding in one spot for more than 5 seconds as this may make a hole in the plastic. Trim the excess plastic to the size of your windows. After you have tightened up the plastic with the hair dryer, use a pair of scissors to cut off the excess plastic along the edges of the window. Be careful not to cut inside of where you applied the double-sided tape or you may break the seal. Sealing Drafts with Caulk Hold a candle up to the window to find the source of the draft. Light a candle and hold it up next to the window. Move it around the edges of the window and watch the candle to see if it flickers. If you notice the candle moving like it is being blown in the wind, then this is probably a drafty part of the window. Mark it with a piece of chalk or tape. If you are not sure where the air is coming in from and you only want to seal up the drafty portion of a window, check to find the draft first.Warning: Be cautious with the flame around curtains or blinds. You may want to remove them before you do this to prevent the possibility of starting a fire. Remove the old caulk and peeling paint from the window’s edges. Use a paint scraper to take all of the old caulk off of the edges of the window. Press the scraper against the edge of the window, and then move it upwards to loosen the caulk. If there is any peeling paint, scrap this off as well since it will interfere with re-caulking the window. Wash the edges of the window with a scrub brush and soapy water. Fill a small bucket with soapy water and dip a scrub brush into it. Then use the scrub brush to wash along the edges of the window. Replace the soapy water with plain water and use the brush to rinse the soap away. Then, pat the window dry with a clean dry towel or paper towels. Washing the window’s edges first will help to ensure that you get a tight seal with the new layer of caulk. Seal the edges with a new layer of caulk. Depress the plunger on the caulk tube to push it out as you run the tip of the caulk gun down the edge of the window. Continue to do this until you have completely covered 1 edge of the window. Then, repeat for the other 3 sides of the window. Allow the caulk to dry overnight, or for at least 8 hours to ensure that it is set. Make sure to follow the manufacturer’s instructions for how to use the caulk properly.",
  "sentences":[
    " Using Quick Fixes Insulate the window with a strip of rope caulk.",
    "Rope caulk is a flexible putty-like caulk that you can press and mold into the edges of a window to seal drafts.",
    "Purchase rope caulk at a hardware store and press it into the edges of the window to seal it.",
    "You can also try using V-seal weather stripping to seal the edges of the window.",
    "This is a special type of weather stripping that you can press into the edges of the window to seal up a draft.",
    "Fill in a crack in a window with clear nail polish.",
    "If a crack in the window is causing the draft, then you will need to replace the window to fix the draft.",
    "However, a temporary way to fix the draft is to paint over the crack with clear nail polish.",
    "Allow the nail polish to dry completely and add another coat if needed.",
    "You may need to paint on 2 to 3 coats to ensure that the crack is fully covered.",
    "Keep in mind that you will still need to replace the window eventually.",
    "The nail polish will only hold for 1 to 2 months at most.",
    "Place a weighted sock along the bottom edge of the window.",
    "You can purchase or make a weighted sock for blocking gaps in doors and windows.",
    "Place the sock along the bottom edge of the window or where the top and bottom pane meet to seal in more air and prevent drafts.",
    "Check online or in a department store to purchase a window or door sock.",
    "Although a window sock won’t actually fix a drafty window permanently, this is the quickest and easiest way to stop a draft.Tip: If you want to make your own window sock, get an old knee-length sock and fill it with rice or sand.",
    "Then, tie or sew the opening closed to keep the contents inside of the sock, and it’s ready to use!",
    "Put up thick curtains to cover the drafty window.",
    "Heavy curtains or specially made insulating curtains will also help to quickly reduce the effects of a draft.",
    "The curtains will not fix the problem, but this is a good option if you need to stop the draft in a hurry.",
    "Light and noise blocking curtains are usually thick enough to provide some draft protection.",
    "You can also layer 2 curtains over the window or use fabric blinds, such as roman blinds.",
    "Purchase and install interior storm windows.",
    "If you already have a storm window, then cover your interior windows with it to keep out drafts.",
    "If not, measure your window and purchase a storm window to fit it.",
    "Then, place the storm window over your regular window to easily seal out the draft.",
    "Storm windows can be an expensive fix for drafty windows, but you can use them again and again.",
    "Covering Windows with Plastic Purchase a plastic shrink wrap window kit.",
    "You can purchase a window insulation kit from a hardware store.",
    "These kits have everything you need to cover a drafty window.",
    "You can purchase kits with extra materials for covering multiple windows.",
    "The kit should include double-sided tape and plastic for covering your windows.",
    "You can buy these items separately if you prefer.",
    "Apply 1 strip of double-sided tape along the edges of the window.",
    "Start by pressing the end of the tape into the edge of the window just outside of the glass.",
    "Dispense the tape and continue pressing it until you have covered 1 side of the window.",
    "Then, cut the tape when you get to the end of the edge.",
    "Repeat to cover the other side and the top and bottom edges of the window.",
    "Remove the covering on the double-sided tape after 10 to 15 minutes.",
    "Letting the tape sit for 10 to 15 minutes will allow it to get tacky and improve its bond with the window.",
    "After time is up, peel off the cover on the tape strips surrounding the window.",
    "Discard the covering you remove from the tape strips.",
    "Press the plastic wrap onto the double-sided tape.",
    "Take 1 of the plastic pieces included with your kit and line up the corner with the corner of the window where you applied the tape.",
    "Then, press the plastic onto the double-sided tape.",
    "Slide your hands down the edge of the window over the plastic to secure it to the tape.",
    "Repeat this for the top edge of the plastic.",
    "Then, pull the plastic taut and secure the other side and bottom edge of the plastic by pressing down on it.",
    "Tip: For an extra layer of insulation, apply a layer over bubble wrap over the window first, and then apply the plastic over that.",
    "This will create a frosted glass effect and prevent you from being able to see through the windows, but it will provide more insulation and potentially save you even more on heating bills.",
    "Use a hair dryer to tighten the plastic.",
    "Once the plastic is secured on the window with the double-sided tape, plug in a hair dryer and turn it on.",
    "Hover the dryer’s nozzle over the plastic anywhere that it looks loose.",
    "This will help to shrink the plastic and create a tight fit with the window.",
    "Make sure to keep moving the hair dryer around over the plastic.",
    "Avoid holding in one spot for more than 5 seconds as this may make a hole in the plastic.",
    "Trim the excess plastic to the size of your windows.",
    "After you have tightened up the plastic with the hair dryer, use a pair of scissors to cut off the excess plastic along the edges of the window.",
    "Be careful not to cut inside of where you applied the double-sided tape or you may break the seal.",
    "Sealing Drafts with Caulk Hold a candle up to the window to find the source of the draft.",
    "Light a candle and hold it up next to the window.",
    "Move it around the edges of the window and watch the candle to see if it flickers.",
    "If you notice the candle moving like it is being blown in the wind, then this is probably a drafty part of the window.",
    "Mark it with a piece of chalk or tape.",
    "If you are not sure where the air is coming in from and you only want to seal up the drafty portion of a window, check to find the draft first.Warning: Be cautious with the flame around curtains or blinds.",
    "You may want to remove them before you do this to prevent the possibility of starting a fire.",
    "Remove the old caulk and peeling paint from the window’s edges.",
    "Use a paint scraper to take all of the old caulk off of the edges of the window.",
    "Press the scraper against the edge of the window, and then move it upwards to loosen the caulk.",
    "If there is any peeling paint, scrap this off as well since it will interfere with re-caulking the window.",
    "Wash the edges of the window with a scrub brush and soapy water.",
    "Fill a small bucket with soapy water and dip a scrub brush into it.",
    "Then use the scrub brush to wash along the edges of the window.",
    "Replace the soapy water with plain water and use the brush to rinse the soap away.",
    "Then, pat the window dry with a clean dry towel or paper towels.",
    "Washing the window’s edges first will help to ensure that you get a tight seal with the new layer of caulk.",
    "Seal the edges with a new layer of caulk.",
    "Depress the plunger on the caulk tube to push it out as you run the tip of the caulk gun down the edge of the window.",
    "Continue to do this until you have completely covered 1 edge of the window.",
    "Then, repeat for the other 3 sides of the window.",
    "Allow the caulk to dry overnight, or for at least 8 hours to ensure that it is set.",
    "Make sure to follow the manufacturer’s instructions for how to use the caulk properly."
  ],
  "tyn_section":[
    "Rope caulk or weather stripping",
    "Clear nail polish",
    "Window sock",
    "Thick curtains",
    "Interior storm windows",
    "Double-sided tape",
    "Plastic window covering",
    "Hair dryer",
    "Scissors",
    "Candle and lighter",
    "Paint scraper",
    "Bucket",
    "Soap",
    "Water",
    "Scrub brush",
    "Clean towel or paper towels",
    "Caulk"
  ],
  "tyn_model":[
    "plastic",
    "tape",
    "curtains",
    "double-sided tape",
    "hair dryer",
    "candle",
    "rope caulk",
    "paint",
    "scrub brush",
    "clear nail polish",
    "nail polish",
    "weighted sock",
    "window sock",
    "caulk",
    "soapy water",
    "water",
    "v-seal weather stripping",
    "weather stripping",
    "rice",
    "plastic shrink wrap",
    "window insulation",
    "tape strips",
    "plastic wrap",
    "insulation",
    "bubble wrap",
    "dryer",
    "scissors",
    "chalk",
    "paint scraper",
    "scraper",
    "dry towel",
    "paper towels"
  ],
  "simple_metrics":{
    "r":0.5294117647,
    "p":0.28125,
    "f1":0.3673469388,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5882352941,
    "p":0.53125,
    "f1":0.5582922824
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8235294118,
    "p":0.78125,
    "f1":0.8018327606
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5294117647,
    "p":0.3125,
    "f1":0.3930131004
  }
}