{
  "title":"How to Start an Organic Vegetable Garden",
  "url":"https://www.wikihow.com/Start-an-Organic-Vegetable-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables"
  ],
  "parts":[
    {
      "name":"Choosing Location, Containers, and Soil",
      "steps":[
        {
          "headline":"Choose a location with ample sunlight and proper drainage.",
          "description":"Check your yard at different times of the day to observe the placement of the sun. Put your garden in an area that's exposed to sunlight for at least six hours throughout the day. Additionally, evaluate the location's drainage by checking for standing water. Make sure the spot gets partial shade if you live in a very hot area. To see if your plot has proper drainage, check it after it rains to see if water pools around it. Standing water means that the plot doesn’t have good drainage. If it hasn’t rained in awhile, spray the area with a gardening hose for 5 minutes, then check to see if the water soaks in or pools."
        },
        {
          "headline":"Test your soil’s pH and amend it if necessary.",
          "description":"Get pH testing strips from your local gardening store or online. Collect a sample of your soil in a cup, then add distilled water to the soil and stir. Insert a test strip into the mixture and hold it there for 20-30 seconds. Finally, remove the strip and check it against the kit’s key. If necessary, add supplements to your soil to bring it within the range of 5.5-7.0. Vegetables grow best when their soil pH is 5.5-7.0. If your soil’s pH is below 5.5, add dolomite or quicklime to boost the pH. Mix it into the soil as directed on the package, then retest the pH. If your soil’s pH is above 7.0, mix additional organic matter into the soil to lower it."
        },
        {
          "headline":"Plant directly into the ground if you have good drainage and pH.",
          "description":"If you have good-quality soil that drains well, then it's easiest to plant your garden directly into the ground. To get started, pull and discard weeds. Then, remove any existing vegetation, like grass, by digging it up with your shovel and putting it in your compost pile. Once your plot is just dirt, it's ready for planting. If you'd like to plant directly into the ground but don't want to use your existing soil, dig out the plot and replace it with organic soil. Use a shovel to remove at least 1 foot (0.30 m) of soil from your plot. Then, pour an organic soil into the plot to use for your planting bed. You can buy organic soil at your local gardening store or online."
        },
        {
          "headline":"Build a raised a garden bed if you want to improve your plot's drainage.",
          "description":"If you plan to plant your garden on land that's a bit soggy, raised beds are a great option. First, dig out about 1 to 2 inches (2.5 to 5.1 cm) of soil in the shape of your plot. Then, place pieces of wood along the edge of your plot to create a box. Next, add organic soil to the box for planting. Raised beds can be made from materials such as cedar, which is a natural insect repellent.Tip: As a bonus, building a raised bed will help you ensure the soil you use is organic because you’ll need to add soil to the bed."
        },
        {
          "headline":"Grow your veggies in containers for a convenient planting option.",
          "description":"Choose medium to large pots that are at least 10 to 12 inches (25 to 30 cm) deep so that your plants have plenty of space to grow. Make sure your pots have drainage at the bottom so that water can flow away from the roots. If you’re planting your garden in pots, use organic potting soil. You can use a 5 US gal (19 L) sized bucket as a pot, if you prefer. If your pots don’t have drainage, cut holes into the bottom. Alternatively, add a layer of rocks to the bottom of the pot. However, keep in mind that water that settles in the bottom of the pot could drown your plant."
        },
        {
          "headline":"Mix organic matter into your soil to fertilize it, if you prefer.",
          "description":"Replace up to half of your soil with organic matter if you want to add more nutrients. Use a shovel to remove the existing soil, then spread the organic matter over the soil. Use the shovel, a spade, or a hoe to mix the organic matter into the soil. You can add fertilizer to gardens planted directly into the ground (if the existing soil has a healthy pH), raised beds, and containers. Good options include peat moss, manure, or compost. You can buy these at your local gardening store or online.Tip: Create your own compost pile for a constant, homemade supply of fertilizer. Simply add fallen leaves, cut grass, and your own food scraps to the pile to create your own organic matter."
        }
      ]
    },
    {
      "name":"Planting Your Veggies",
      "steps":[
        {
          "headline":"Choose plants that grow well in your USDA hardiness zone.",
          "description":"Depending on your local climate, some plants might not grow well in your area. Find out which USDA hardiness zone you’re in, then read the labels or plant information about the veggies you want to grow. Make sure you pick veggies that are compatible with your zone. You can find your zone here: https://planthardiness.ars.usda.gov/PHZMWeb/.Tip: Some plants produce a crop only once, while others will continuously grow new crops. Read the information about the veggies you plan to grow, then choose a mixture of single-crop and continually-producing vegetables so that your garden is consistently producing a harvest."
        },
        {
          "headline":"Get organic seeds from a farmers market, gardening store, or online.",
          "description":"Check the label on the seeds to make sure it says organic. This means the seeds came from organic plants that were grown without pesticides, herbicides, and non-organic fertilizers. If you’re unsure about your selection, ask the person who’s selling them if they’re organic. Organic plants can be difficult to find locally in some areas. Many nurseries use fertilizers and pesticides, so be sure to ask.Variation: As another option, you can grow your plants from seedlings, which you can find at farmers markets, gardening stores, or online. Inspect the seedlings carefully for signs of pests or disease. Additionally, check the label or ask the farmer if they’re organic."
        },
        {
          "headline":"Till your soil so that it’s loose.",
          "description":"First, remove any existing weeds or plants that remain on the plot. Then, make sure there are no obstructions, like rocks or sticks. Next, use a hoe or tiller to break up the soil in your plot. Make several passes over the soil to work the entire plot. If you have a large plot, you can rent a tiller from your local gardening store. This will make it easier for the seeds to take root once they’re planted. Additionally, it helps the water drain away more easily.Variation: If you're planting your garden in containers, you don't need to till the soil. Just break up any clumps in your potting soil when you pour it into your pots."
        },
        {
          "headline":"Plant your seeds or seedlings outdoors after the last frost of spring.",
          "description":"Sprinkle the seedlings over the soil in your plot or gardening containers, then add a thin layer of organic topsoil over them. If you’re using seedlings, use a small shovel to dig out about 2 to 3 inches (5.1 to 7.6 cm) of soil, then place the seedling into it. Cover the roots with soil, but don’t pack it down. If you plant from seed, you may need to thin out your plants once they sprout. However, it’s unlikely that all of your seeds will sprout, so it’s best to sprinkle a lot of seeds."
        },
        {
          "headline":"Label your plants, if you desire.",
          "description":"Print the names of your plants on garden stakes or popsicle sticks. Then, place each stake or popsicle stick near the correct row of plants. If you’re using pots, put the labels on or inside the pots. It’s especially helpful to label your plants if you have varieties of the same vegetable. Additionally, it can help you remember where you planted your perennial plants, which will likely return in future growing seasons.Variation: If you want something a little fancy, look for copper, brass, or stoneware plant labels at your local gardening store or online."
        },
        {
          "headline":"Cover the soil with 1 to 2 in (2.5 to 5.1 cm) of organic mulch to limit weed growth.",
          "description":"Mulch is great for preventing weed growth, preserving moisture, and keeping your plants warm. Add a thin layer of mulch over your entire plot after you finish planting your seeds or seedlings. Your seeds will still sprout through the mulch. Great options for mulch include straw, cocoa hulls, or shredded newspaper. Always check the label on your mulch to make sure it's organic. You can buy organic mulch at your local gardening store or online."
        },
        {
          "headline":"Water your seeds or seedlings immediately after you plant them.",
          "description":"Use a watering can or garden hose to spray your plot or containers until the soil looks damp. Then, feel the soil with your hand to make sure it feels moist. Don’t add so much water that it pools on top of the soil. If you planted your garden in containers, it’s normal to see a lot of the water flow out of the bottom of the pots."
        }
      ]
    },
    {
      "name":"Caring for Your Plants",
      "steps":[
        {
          "headline":"Water your plants in the morning so the excess water evaporates.",
          "description":"Although your plants need water, too much water can be harmful. This is especially true if the water sits on the plant leaves. For best results, water your plants most mornings so that the sun can evaporate the excess water during the early morning hours and afternoon sun. You can skip watering your plants if the soil already feels moist or the weather is rainy."
        },
        {
          "headline":"Use a liquid organic fertilizer weekly to help your plants grow.",
          "description":"Follow the instructions on the label to measure out the fertilizer. Then, add the fertilizer to your gardening can or a fertilizer sprayer. Next, spray the water onto your plants to give them extra nutrients. Replace your regular watering with the fertilizer water. You can find a liquid organic fertilizer at your local gardening store or online."
        },
        {
          "headline":"Weed the plot at least once a week.",
          "description":"Do a visual inspection to check your plot for weeds. If you see any, pull them immediately. Do your best to pull all of the weeds before they grow enough to start producing seeds. Don’t put weeds in your compost, as they will contaminate the compost with seeds."
        },
        {
          "headline":"Control pests by attracting helpful insects.",
          "description":"Add plants that attract insects around the border of your plot. Common varieties include daisies, marigolds, bachelor’s button, sunflowers, lemon balm, parsley, and alyssum. Additionally, place rocks and stepping stones near your garden to give bugs lots of places to hide. The insects will snack on the pests that might ruin your crop. For instance, ladybugs and ground beetles are especially helpful for controlling pests.Tip: You can purchase ladybugs at a gardening store or online to add to your garden."
        },
        {
          "headline":"Keep pesticides, herbicides, and inorganic fertilizers away from your plants.",
          "description":"Organic gardens don’t use any pesticides, herbicides, or inorganic fertilizers, so you’ll need to be vigilant about what you use. While this might feel like a lot of work at first, you’ll get the hang of it once you gain some experience. Trust your organic fertilizer, hand-pulling of weeds, and friendly insects to keep your garden going strong. EXPERT TIP\t\"To be organic, you also can't use synthetic chemicals, organophosphates, or toxins in your garden.\" Steve Masley\t\t\t\t\tProfessional Organic Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years. He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening. In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University. Steve MasleyProfessional Organic Gardener"
        }
      ]
    }
  ],
  "text":" Choosing Location, Containers, and Soil Choose a location with ample sunlight and proper drainage. Check your yard at different times of the day to observe the placement of the sun. Put your garden in an area that's exposed to sunlight for at least six hours throughout the day. Additionally, evaluate the location's drainage by checking for standing water. Make sure the spot gets partial shade if you live in a very hot area. To see if your plot has proper drainage, check it after it rains to see if water pools around it. Standing water means that the plot doesn’t have good drainage. If it hasn’t rained in awhile, spray the area with a gardening hose for 5 minutes, then check to see if the water soaks in or pools. Test your soil’s pH and amend it if necessary. Get pH testing strips from your local gardening store or online. Collect a sample of your soil in a cup, then add distilled water to the soil and stir. Insert a test strip into the mixture and hold it there for 20-30 seconds. Finally, remove the strip and check it against the kit’s key. If necessary, add supplements to your soil to bring it within the range of 5.5-7.0. Vegetables grow best when their soil pH is 5.5-7.0. If your soil’s pH is below 5.5, add dolomite or quicklime to boost the pH. Mix it into the soil as directed on the package, then retest the pH. If your soil’s pH is above 7.0, mix additional organic matter into the soil to lower it. Plant directly into the ground if you have good drainage and pH. If you have good-quality soil that drains well, then it's easiest to plant your garden directly into the ground. To get started, pull and discard weeds. Then, remove any existing vegetation, like grass, by digging it up with your shovel and putting it in your compost pile. Once your plot is just dirt, it's ready for planting. If you'd like to plant directly into the ground but don't want to use your existing soil, dig out the plot and replace it with organic soil. Use a shovel to remove at least 1 foot (0.30 m) of soil from your plot. Then, pour an organic soil into the plot to use for your planting bed. You can buy organic soil at your local gardening store or online. Build a raised a garden bed if you want to improve your plot's drainage. If you plan to plant your garden on land that's a bit soggy, raised beds are a great option. First, dig out about 1 to 2 inches (2.5 to 5.1 cm) of soil in the shape of your plot. Then, place pieces of wood along the edge of your plot to create a box. Next, add organic soil to the box for planting. Raised beds can be made from materials such as cedar, which is a natural insect repellent.Tip: As a bonus, building a raised bed will help you ensure the soil you use is organic because you’ll need to add soil to the bed. Grow your veggies in containers for a convenient planting option. Choose medium to large pots that are at least 10 to 12 inches (25 to 30 cm) deep so that your plants have plenty of space to grow. Make sure your pots have drainage at the bottom so that water can flow away from the roots. If you’re planting your garden in pots, use organic potting soil. You can use a 5 US gal (19 L) sized bucket as a pot, if you prefer. If your pots don’t have drainage, cut holes into the bottom. Alternatively, add a layer of rocks to the bottom of the pot. However, keep in mind that water that settles in the bottom of the pot could drown your plant. Mix organic matter into your soil to fertilize it, if you prefer. Replace up to half of your soil with organic matter if you want to add more nutrients. Use a shovel to remove the existing soil, then spread the organic matter over the soil. Use the shovel, a spade, or a hoe to mix the organic matter into the soil. You can add fertilizer to gardens planted directly into the ground (if the existing soil has a healthy pH), raised beds, and containers. Good options include peat moss, manure, or compost. You can buy these at your local gardening store or online.Tip: Create your own compost pile for a constant, homemade supply of fertilizer. Simply add fallen leaves, cut grass, and your own food scraps to the pile to create your own organic matter. Planting Your Veggies Choose plants that grow well in your USDA hardiness zone. Depending on your local climate, some plants might not grow well in your area. Find out which USDA hardiness zone you’re in, then read the labels or plant information about the veggies you want to grow. Make sure you pick veggies that are compatible with your zone. You can find your zone here: https://planthardiness.ars.usda.gov/PHZMWeb/.Tip: Some plants produce a crop only once, while others will continuously grow new crops. Read the information about the veggies you plan to grow, then choose a mixture of single-crop and continually-producing vegetables so that your garden is consistently producing a harvest. Get organic seeds from a farmers market, gardening store, or online. Check the label on the seeds to make sure it says organic. This means the seeds came from organic plants that were grown without pesticides, herbicides, and non-organic fertilizers. If you’re unsure about your selection, ask the person who’s selling them if they’re organic. Organic plants can be difficult to find locally in some areas. Many nurseries use fertilizers and pesticides, so be sure to ask.Variation: As another option, you can grow your plants from seedlings, which you can find at farmers markets, gardening stores, or online. Inspect the seedlings carefully for signs of pests or disease. Additionally, check the label or ask the farmer if they’re organic. Till your soil so that it’s loose. First, remove any existing weeds or plants that remain on the plot. Then, make sure there are no obstructions, like rocks or sticks. Next, use a hoe or tiller to break up the soil in your plot. Make several passes over the soil to work the entire plot. If you have a large plot, you can rent a tiller from your local gardening store. This will make it easier for the seeds to take root once they’re planted. Additionally, it helps the water drain away more easily.Variation: If you're planting your garden in containers, you don't need to till the soil. Just break up any clumps in your potting soil when you pour it into your pots. Plant your seeds or seedlings outdoors after the last frost of spring. Sprinkle the seedlings over the soil in your plot or gardening containers, then add a thin layer of organic topsoil over them. If you’re using seedlings, use a small shovel to dig out about 2 to 3 inches (5.1 to 7.6 cm) of soil, then place the seedling into it. Cover the roots with soil, but don’t pack it down. If you plant from seed, you may need to thin out your plants once they sprout. However, it’s unlikely that all of your seeds will sprout, so it’s best to sprinkle a lot of seeds. Label your plants, if you desire. Print the names of your plants on garden stakes or popsicle sticks. Then, place each stake or popsicle stick near the correct row of plants. If you’re using pots, put the labels on or inside the pots. It’s especially helpful to label your plants if you have varieties of the same vegetable. Additionally, it can help you remember where you planted your perennial plants, which will likely return in future growing seasons.Variation: If you want something a little fancy, look for copper, brass, or stoneware plant labels at your local gardening store or online. Cover the soil with 1 to 2 in (2.5 to 5.1 cm) of organic mulch to limit weed growth. Mulch is great for preventing weed growth, preserving moisture, and keeping your plants warm. Add a thin layer of mulch over your entire plot after you finish planting your seeds or seedlings. Your seeds will still sprout through the mulch. Great options for mulch include straw, cocoa hulls, or shredded newspaper. Always check the label on your mulch to make sure it's organic. You can buy organic mulch at your local gardening store or online. Water your seeds or seedlings immediately after you plant them. Use a watering can or garden hose to spray your plot or containers until the soil looks damp. Then, feel the soil with your hand to make sure it feels moist. Don’t add so much water that it pools on top of the soil. If you planted your garden in containers, it’s normal to see a lot of the water flow out of the bottom of the pots. Caring for Your Plants Water your plants in the morning so the excess water evaporates. Although your plants need water, too much water can be harmful. This is especially true if the water sits on the plant leaves. For best results, water your plants most mornings so that the sun can evaporate the excess water during the early morning hours and afternoon sun. You can skip watering your plants if the soil already feels moist or the weather is rainy. Use a liquid organic fertilizer weekly to help your plants grow. Follow the instructions on the label to measure out the fertilizer. Then, add the fertilizer to your gardening can or a fertilizer sprayer. Next, spray the water onto your plants to give them extra nutrients. Replace your regular watering with the fertilizer water. You can find a liquid organic fertilizer at your local gardening store or online. Weed the plot at least once a week. Do a visual inspection to check your plot for weeds. If you see any, pull them immediately. Do your best to pull all of the weeds before they grow enough to start producing seeds. Don’t put weeds in your compost, as they will contaminate the compost with seeds. Control pests by attracting helpful insects. Add plants that attract insects around the border of your plot. Common varieties include daisies, marigolds, bachelor’s button, sunflowers, lemon balm, parsley, and alyssum. Additionally, place rocks and stepping stones near your garden to give bugs lots of places to hide. The insects will snack on the pests that might ruin your crop. For instance, ladybugs and ground beetles are especially helpful for controlling pests.Tip: You can purchase ladybugs at a gardening store or online to add to your garden. Keep pesticides, herbicides, and inorganic fertilizers away from your plants. Organic gardens don’t use any pesticides, herbicides, or inorganic fertilizers, so you’ll need to be vigilant about what you use. While this might feel like a lot of work at first, you’ll get the hang of it once you gain some experience. Trust your organic fertilizer, hand-pulling of weeds, and friendly insects to keep your garden going strong. EXPERT TIP\t\"To be organic, you also can't use synthetic chemicals, organophosphates, or toxins in your garden.\" Steve Masley\t\t\t\t\tProfessional Organic Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years. He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening. In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University. Steve MasleyProfessional Organic Gardener",
  "sentences":[
    " Choosing Location, Containers, and Soil Choose a location with ample sunlight and proper drainage.",
    "Check your yard at different times of the day to observe the placement of the sun.",
    "Put your garden in an area that's exposed to sunlight for at least six hours throughout the day.",
    "Additionally, evaluate the location's drainage by checking for standing water.",
    "Make sure the spot gets partial shade if you live in a very hot area.",
    "To see if your plot has proper drainage, check it after it rains to see if water pools around it.",
    "Standing water means that the plot doesn’t have good drainage.",
    "If it hasn’t rained in awhile, spray the area with a gardening hose for 5 minutes, then check to see if the water soaks in or pools.",
    "Test your soil’s pH and amend it if necessary.",
    "Get pH testing strips from your local gardening store or online.",
    "Collect a sample of your soil in a cup, then add distilled water to the soil and stir.",
    "Insert a test strip into the mixture and hold it there for 20-30 seconds.",
    "Finally, remove the strip and check it against the kit’s key.",
    "If necessary, add supplements to your soil to bring it within the range of 5.5-7.0.",
    "Vegetables grow best when their soil pH is 5.5-7.0.",
    "If your soil’s pH is below 5.5, add dolomite or quicklime to boost the pH.",
    "Mix it into the soil as directed on the package, then retest the pH.",
    "If your soil’s pH is above 7.0, mix additional organic matter into the soil to lower it.",
    "Plant directly into the ground if you have good drainage and pH.",
    "If you have good-quality soil that drains well, then it's easiest to plant your garden directly into the ground.",
    "To get started, pull and discard weeds.",
    "Then, remove any existing vegetation, like grass, by digging it up with your shovel and putting it in your compost pile.",
    "Once your plot is just dirt, it's ready for planting.",
    "If you'd like to plant directly into the ground but don't want to use your existing soil, dig out the plot and replace it with organic soil.",
    "Use a shovel to remove at least 1 foot (0.30 m) of soil from your plot.",
    "Then, pour an organic soil into the plot to use for your planting bed.",
    "You can buy organic soil at your local gardening store or online.",
    "Build a raised a garden bed if you want to improve your plot's drainage.",
    "If you plan to plant your garden on land that's a bit soggy, raised beds are a great option.",
    "First, dig out about 1 to 2 inches (2.5 to 5.1 cm) of soil in the shape of your plot.",
    "Then, place pieces of wood along the edge of your plot to create a box.",
    "Next, add organic soil to the box for planting.",
    "Raised beds can be made from materials such as cedar, which is a natural insect repellent.Tip: As a bonus, building a raised bed will help you ensure the soil you use is organic because you’ll need to add soil to the bed.",
    "Grow your veggies in containers for a convenient planting option.",
    "Choose medium to large pots that are at least 10 to 12 inches (25 to 30 cm) deep so that your plants have plenty of space to grow.",
    "Make sure your pots have drainage at the bottom so that water can flow away from the roots.",
    "If you’re planting your garden in pots, use organic potting soil.",
    "You can use a 5 US gal (19 L) sized bucket as a pot, if you prefer.",
    "If your pots don’t have drainage, cut holes into the bottom.",
    "Alternatively, add a layer of rocks to the bottom of the pot.",
    "However, keep in mind that water that settles in the bottom of the pot could drown your plant.",
    "Mix organic matter into your soil to fertilize it, if you prefer.",
    "Replace up to half of your soil with organic matter if you want to add more nutrients.",
    "Use a shovel to remove the existing soil, then spread the organic matter over the soil.",
    "Use the shovel, a spade, or a hoe to mix the organic matter into the soil.",
    "You can add fertilizer to gardens planted directly into the ground (if the existing soil has a healthy pH), raised beds, and containers.",
    "Good options include peat moss, manure, or compost.",
    "You can buy these at your local gardening store or online.Tip: Create your own compost pile for a constant, homemade supply of fertilizer.",
    "Simply add fallen leaves, cut grass, and your own food scraps to the pile to create your own organic matter.",
    "Planting Your Veggies Choose plants that grow well in your USDA hardiness zone.",
    "Depending on your local climate, some plants might not grow well in your area.",
    "Find out which USDA hardiness zone you’re in, then read the labels or plant information about the veggies you want to grow.",
    "Make sure you pick veggies that are compatible with your zone.",
    "You can find your zone here: https://planthardiness.ars.usda.gov/PHZMWeb/.Tip: Some plants produce a crop only once, while others will continuously grow new crops.",
    "Read the information about the veggies you plan to grow, then choose a mixture of single-crop and continually-producing vegetables so that your garden is consistently producing a harvest.",
    "Get organic seeds from a farmers market, gardening store, or online.",
    "Check the label on the seeds to make sure it says organic.",
    "This means the seeds came from organic plants that were grown without pesticides, herbicides, and non-organic fertilizers.",
    "If you’re unsure about your selection, ask the person who’s selling them if they’re organic.",
    "Organic plants can be difficult to find locally in some areas.",
    "Many nurseries use fertilizers and pesticides, so be sure to ask.Variation: As another option, you can grow your plants from seedlings, which you can find at farmers markets, gardening stores, or online.",
    "Inspect the seedlings carefully for signs of pests or disease.",
    "Additionally, check the label or ask the farmer if they’re organic.",
    "Till your soil so that it’s loose.",
    "First, remove any existing weeds or plants that remain on the plot.",
    "Then, make sure there are no obstructions, like rocks or sticks.",
    "Next, use a hoe or tiller to break up the soil in your plot.",
    "Make several passes over the soil to work the entire plot.",
    "If you have a large plot, you can rent a tiller from your local gardening store.",
    "This will make it easier for the seeds to take root once they’re planted.",
    "Additionally, it helps the water drain away more easily.Variation: If you're planting your garden in containers, you don't need to till the soil.",
    "Just break up any clumps in your potting soil when you pour it into your pots.",
    "Plant your seeds or seedlings outdoors after the last frost of spring.",
    "Sprinkle the seedlings over the soil in your plot or gardening containers, then add a thin layer of organic topsoil over them.",
    "If you’re using seedlings, use a small shovel to dig out about 2 to 3 inches (5.1 to 7.6 cm) of soil, then place the seedling into it.",
    "Cover the roots with soil, but don’t pack it down.",
    "If you plant from seed, you may need to thin out your plants once they sprout.",
    "However, it’s unlikely that all of your seeds will sprout, so it’s best to sprinkle a lot of seeds.",
    "Label your plants, if you desire.",
    "Print the names of your plants on garden stakes or popsicle sticks.",
    "Then, place each stake or popsicle stick near the correct row of plants.",
    "If you’re using pots, put the labels on or inside the pots.",
    "It’s especially helpful to label your plants if you have varieties of the same vegetable.",
    "Additionally, it can help you remember where you planted your perennial plants, which will likely return in future growing seasons.Variation: If you want something a little fancy, look for copper, brass, or stoneware plant labels at your local gardening store or online.",
    "Cover the soil with 1 to 2 in (2.5 to 5.1 cm) of organic mulch to limit weed growth.",
    "Mulch is great for preventing weed growth, preserving moisture, and keeping your plants warm.",
    "Add a thin layer of mulch over your entire plot after you finish planting your seeds or seedlings.",
    "Your seeds will still sprout through the mulch.",
    "Great options for mulch include straw, cocoa hulls, or shredded newspaper.",
    "Always check the label on your mulch to make sure it's organic.",
    "You can buy organic mulch at your local gardening store or online.",
    "Water your seeds or seedlings immediately after you plant them.",
    "Use a watering can or garden hose to spray your plot or containers until the soil looks damp.",
    "Then, feel the soil with your hand to make sure it feels moist.",
    "Don’t add so much water that it pools on top of the soil.",
    "If you planted your garden in containers, it’s normal to see a lot of the water flow out of the bottom of the pots.",
    "Caring for Your Plants Water your plants in the morning so the excess water evaporates.",
    "Although your plants need water, too much water can be harmful.",
    "This is especially true if the water sits on the plant leaves.",
    "For best results, water your plants most mornings so that the sun can evaporate the excess water during the early morning hours and afternoon sun.",
    "You can skip watering your plants if the soil already feels moist or the weather is rainy.",
    "Use a liquid organic fertilizer weekly to help your plants grow.",
    "Follow the instructions on the label to measure out the fertilizer.",
    "Then, add the fertilizer to your gardening can or a fertilizer sprayer.",
    "Next, spray the water onto your plants to give them extra nutrients.",
    "Replace your regular watering with the fertilizer water.",
    "You can find a liquid organic fertilizer at your local gardening store or online.",
    "Weed the plot at least once a week.",
    "Do a visual inspection to check your plot for weeds.",
    "If you see any, pull them immediately.",
    "Do your best to pull all of the weeds before they grow enough to start producing seeds.",
    "Don’t put weeds in your compost, as they will contaminate the compost with seeds.",
    "Control pests by attracting helpful insects.",
    "Add plants that attract insects around the border of your plot.",
    "Common varieties include daisies, marigolds, bachelor’s button, sunflowers, lemon balm, parsley, and alyssum.",
    "Additionally, place rocks and stepping stones near your garden to give bugs lots of places to hide.",
    "The insects will snack on the pests that might ruin your crop.",
    "For instance, ladybugs and ground beetles are especially helpful for controlling pests.Tip: You can purchase ladybugs at a gardening store or online to add to your garden.",
    "Keep pesticides, herbicides, and inorganic fertilizers away from your plants.",
    "Organic gardens don’t use any pesticides, herbicides, or inorganic fertilizers, so you’ll need to be vigilant about what you use.",
    "While this might feel like a lot of work at first, you’ll get the hang of it once you gain some experience.",
    "Trust your organic fertilizer, hand-pulling of weeds, and friendly insects to keep your garden going strong.",
    "EXPERT TIP\t\"To be organic, you also can't use synthetic chemicals, organophosphates, or toxins in your garden.\"",
    "Steve Masley\t\t\t\t\tProfessional Organic Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years.",
    "He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening.",
    "In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University.",
    "Steve MasleyProfessional Organic Gardener"
  ],
  "tyn_section":[
    "Shovel or spade",
    "Hand shovel",
    "Hoe or tiller",
    "Garden rake",
    "Wood for raised bed (optional)",
    "Containers or pots (optional)",
    "Organic soil",
    "Compost",
    "Mulch",
    "Organic seeds or seedlings",
    "Organic fertilizer",
    "Watering can or garden hose",
    "Stakes for labeling (optional)"
  ],
  "tyn_model":[
    "water",
    "soil",
    "mulch",
    "shovel",
    "compost",
    "pots",
    "fertilizer",
    "organic soil",
    "rocks",
    "veggies",
    "fertilizers",
    "pesticides",
    "gardening store",
    "vegetables",
    "containers",
    "hoe",
    "tiller",
    "liquid organic fertilizer",
    "ladybugs",
    "organic gardener",
    "garden",
    "gardening hose",
    "distilled water",
    "supplements",
    "dolomite",
    "quicklime",
    "weeds",
    "raised a garden bed",
    "raised beds",
    "raised bed",
    "organic potting soil",
    "bucket",
    "organic matter",
    "spade",
    "peat moss",
    "manure",
    "compost pile",
    "plants",
    "seeds",
    "potting soil",
    "gardening containers",
    "organic topsoil",
    "popsicle sticks",
    "popsicle stick",
    "organic mulch",
    "straw",
    "newspaper",
    "watering can",
    "garden hose",
    "gardening can",
    "fertilizer sprayer",
    "fertilizer water",
    "marigolds",
    "sunflowers",
    "lemon balm",
    "parsley",
    "ground beetles",
    "organic fertilizer",
    "organic vegetable gardens",
    "organic gardening consultant",
    "organic vegetable gardening",
    "sustainable agriculture"
  ],
  "simple_metrics":{
    "r":0.3076923077,
    "p":0.064516129,
    "f1":0.1066666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4615384615,
    "p":0.1935483871,
    "f1":0.2727272727
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7692307692,
    "p":0.3870967742,
    "f1":0.5150214592
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3076923077,
    "p":0.0967741935,
    "f1":0.1472392638
  }
}