{
  "title":"How to Form Concrete Walls",
  "url":"https://www.wikihow.com/Form-Concrete-Walls",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Concrete"
  ],
  "parts":[
    {
      "name":"Creating the Wall Footer",
      "steps":[
        {
          "headline":"Measure and outline the space for your wall.",
          "description":"Determine how long and wide you wish the wall to be. Then, begin mapping out the construction area with a tape measure. To easily trace the area you need to clear for the wall, try using a spray canister of marking chalk. You can also stake the area, stretching string between each stake. Marking chalk, along with any of the other supplies you need for the wall, are available at most hardware stores. Be aware of any utility lines or other obstacles in the area. Your local utility companies can help you with this."
        },
        {
          "headline":"Dig out the soil to form space for the wall and footer.",
          "description":"Clear out sod and soil according to your wall’s width. When you have that done, begin digging out space for the footer. Divide the wall’s width in half, then measure that far down from the soil line. Then, dig out a space underneath this point that is twice as long as the wall is wide. The footer needs to be below the frost line, which is about 1 ft (0.30 m) below the soil’s surface on average. Check your local government’s municipal code for an exact estimate. The footer size you need depends on the wall you wish to create. A good footer is as tall as the wall is wide. If you already have a concrete base in place, you do not need to create another one. Instead, skip to setting up the form."
        },
        {
          "headline":"Compact and level out the soil with a tamper tool.",
          "description":"Press the flat head of the tamper tool down against the soil to smooth it out. Don’t forget the sides of the hole you dug! When you’re done, test the soil’s levelness by running a screed along it, which you can also use to level out poured concrete later. Make sure the soil is level before you begin pouring concrete. If you need to, plant stakes and run string tightly between them. Check for any spots where the string doesn’t rest firmly on the soil."
        },
        {
          "headline":"Pour 6 in (15 cm) of gravel into the hole.",
          "description":"Protect the concrete with a thick layer of all-purpose gravel or crushed stone. After spreading it along the bottom of the hole, press it down flat with a tamper tool. Use the screed tool as needed to level out the hole again. The layer of stone helps prevent the concrete from shifting and cracking over time. It also increases drainage in clay soil."
        },
        {
          "headline":"Place a layer of steel rebar ⅓ of the way up the hole.",
          "description":"Use rebar about ⁄3 in (0.85 cm) in diameter to reinforce the concrete. Lay the rebar in a grid with the bars spaced about 12 in (30 cm) apart. If you need to, cut the rebar to size with a metal-cutting hacksaw blade or another saw. Also, use metal wire ties to bind the rebar together. You can also expand the rebar grid up the sides of the hole. This will give the concrete additional stability. It’s necessary if you’re planning on putting heavy walls on top of the footer, such as for a pool or house."
        },
        {
          "headline":"Mix and pour concrete to fill the footer hole.",
          "description":"Purchase enough concrete to fill the hole, then add it all to a big mixer with a pouring ramp. Add all of the concrete directly to the hole. Use a screed to smooth out the concrete immediately before it has a chance to set. You may be able to rent a concrete mixer. Check your local hardware store. Remember to leave space between the soil’s surface and the footer. The height of the soil over the footer needs to be equal to the width of the wall you wish to build."
        },
        {
          "headline":"Cover the footer and let it cure for at least 7 days.",
          "description":"Put something wet over the exposed concrete. Wet sand, straw, and burlap are a few options. Sprinkle the concrete with water every day to keep it moist as it cures. Once the footer sets, you can begin building over it. Check the manufacturer’s instructions for the exact drying time needed. It varies depending on which mix you choose. For a quick-dry mix, it will take about 7 days. As you wait for the concrete to cure, begin building the wood form you need to shape the concrete wall."
        }
      ]
    },
    {
      "name":"Building Forms",
      "steps":[
        {
          "headline":"Stack wood planks to create a frame for the wall.",
          "description":"These wood barriers hold the concrete in place as it dries, so you will need to create 2 of them. The cheapest and easiest material to use is 2 in × 4 in (5.1 cm × 10.2 cm) boards cut from a softwood like pine. Keep the boards less than 8 ft (2.4 m) long so they aren’t too difficult to handle. Lay the boards on edge horizontally, stacking them to match the height of your planned wall. Rest the frame pieces against a solid surface to prevent them from falling. If your frame is tall, you may need to begin installing the connecting studs before adding more boards. Try to make the frame pieces as long as you need them to be. If you’re building a long wall, build the frame in sections. Smaller pieces are much easier to handle and can be joined together later. If you’re building your own forms, you will probably need to do plenty of cutting. Have a circular saw ready along with a dust mask and ear protection."
        },
        {
          "headline":"Nail studs into the back of each frame to bind the boards together.",
          "description":"Use more 2 in × 4 in (5.1 cm × 10.2 cm) boards to assemble the frame. Space the studs out every 16 in (41 cm) along your frames. Instead of laying the studs flat, turn them on their sides. Then, use about 4 3 ⁄2 in (8.9 cm) nails per stud to secure them all to the frames. Place the nails about 2 in (5.1 cm) from the top and bottom edges of each stud."
        },
        {
          "headline":"Lay wales across the studs to strengthen the forms.",
          "description":"Use a few more 2 in × 4 in (5.1 cm × 10.2 cm) boards, placing them about every 12 in (30 cm) from top to bottom. Tip each board onto its edge, laying it horizontally across the studs. Secure the boards to each stud with 2 to 4 more 3 ⁄2 in (8.9 cm) nails. The wales also provide a place for you to tie connecting wires and attach braces for additional support."
        },
        {
          "headline":"Attach a brace board over the back of the wales.",
          "description":"Select 2 in × 4 in (5.1 cm × 10.2 cm) boards as tall as the forms you’re constructing. Position the braces about every 12 in (30 cm) along the length of the wall. Stand the braces up so only the side edge connects with the rest of the form. Then, use a pair of 3 ⁄2 in (8.9 cm) nails on each wale to connect the braces to them. The braces aren’t exactly part of the forms, but they provide much-needed stability to the forms."
        },
        {
          "headline":"Create the rest of the braces with additional boards and stakes.",
          "description":"Start with a wood board sharpened into a stake you can plant in the soil outside. Set another wood board on its side, running it from the brace board to the stake. Then, add a third board, running it diagonally from the center of the brace to the stake. Use more nails to attach the boards to the brace and stake. The additional brace boards need to be about 12 in (30 cm) long. The exact length depends on the size of your wall. Taller walls need longer braces for extra support."
        },
        {
          "headline":"Nail ⁄4 in (1.9 cm) plywood sheets to the frames.",
          "description":"Flip the frames over to the sides without the studs. Fit the plywood so it’s the same length and height as the frame you’re putting it on. Then, use more 3 ⁄2 in (8.9 cm) nails to connect the plywood to the studs. Place a nail about every 12 in (30 cm) along the length of each stud. Nail through the plywood and into the studs. If you work the other way, the screw ends will stick out into the concrete you pour, affecting your wall."
        }
      ]
    },
    {
      "name":"Installing the Forms",
      "steps":[
        {
          "headline":"Set the forms on plywood boards near where you plan on building the wall.",
          "description":"Place ⁄4 in (1.9 cm) pieces of plywood on the ground. These shoe plates need to be wide enough to support the forms you built. Arrange them so they border the hole in your yard where you plan on pouring concrete for the wall. Before you continue, make sure the shoe plates and forms leave the correct amount of space you need for your wall. Plant the stakes firmly in the ground. When your forms are in place, they won’t budge at all. Test them out by pushing against them with your hand. If you’re having a hard time getting everything to stay still where you need it, try using wire ties. Wrap wires around the studs in the forms to tie them to the shoe plates. Drill holes in the plates as needed to attach the wires."
        },
        {
          "headline":"Drill ⁄8 in (0.32 cm) holes on either side of each stud.",
          "description":"Make the holes evert 12 in (30 cm) along the length of each stud. Leave about 2 in (5.1 cm) of space between the holes and the studs to avoid damaging your forms."
        },
        {
          "headline":"Run wires through the holes and tie them to the wales.",
          "description":"Use 8 gauge wire ties which have a diameter of about ⁄1000 in (0.41 cm). Basically, you need to cross the wire over itself. Loop it around the wale on 1 side, thread it back through the hole, then loop it around the wale on the other side. The part of the wire between the forms will form an X. The wires hold the forms together when you pour the concrete. If the forms slip out of place, you’ll be looking at a concrete mess instead of a solid wall."
        },
        {
          "headline":"Tighten the wire tie with a stick or another tool.",
          "description":"Lower the stick towards the center part of the wire. Wrap the wire around itself by turning it with a circular motion. Make sure the wire gets as tight as you can make it. If it feels slack, your forms may slip out of place. Another way to do this is by sliding tie rods through the holes. Slide brackets onto the ends of the rods so they can’t slide out of place."
        },
        {
          "headline":"Slip wood spacers beside each wire.",
          "description":"You will need wood blocks as thick as your wall will be. These spacers stay in place through friction. You don’t actually attach them to the wall. They prevent the forms from moving in as you work. Check your local hardware store for spacers. Many places sell “spreader cleats” or a similarly-named product. If you can’t find any, you can always cut them yourself out of scrap boards."
        },
        {
          "headline":"Drill through the spreaders and wire them together.",
          "description":"Make a ⁄8 in (0.32 cm) hole all the way through the center of each spreader. When you’re done drilling, string a wire gauge through them all. Loop the wire around the top and bottom spreader. Leave a little extra length on the top part of the wire so you can easily pull the spreaders out later. Set the loop on top of your wall for now. Try tying them to the wall so the wires don’t slip into the concrete as you pour it."
        }
      ]
    },
    {
      "name":"Pouring and Curing the Concrete",
      "steps":[
        {
          "headline":"Mix enough concrete to complete the wall all at once.",
          "description":"Purchase some concrete mix and pour it all into a mixer with a ramp or hose. Add water and stir the concrete according to the manufacturer’s instructions. Good concrete has a gray, uniform consistency. If you add too much water, the concrete turns a little soupy. It will weaken your wall, so don’t overmix your batch of concrete. If you can’t make the entire wall at once, divide it into smaller sections. Mix enough concrete to fill each section at a time. This is very useful for long walls where the concrete might dry out before you’re done pouring it."
        },
        {
          "headline":"Pour the concrete in layers, starting at the end of the wall.",
          "description":"Pour the concrete directly into the wood form using a chute or hose attached to the mixer. To achieve a strong wall, keep the layers of concrete 20 in (51 cm) thick or less. Work from 1 end of the wall to the other, moving back and forth until the concrete is as high as you want the wall to be. If you can help it, don’t wait to pour additional layers. The concrete will cool and begin to settle. If you have to wait, pour a store-bought concrete bonding adhesive onto the settled concrete so the next layer bonds to it."
        },
        {
          "headline":"Pull the spacers out as you pour the concrete.",
          "description":"As your forms fill, watch for the concrete to reach the wood spreaders. Have a ladder ready so you can reach the top of the forms. Tug the wire up to keep the spreaders out of the concrete. Gradually raise the spreaders as you fill the space between the forms. Take the spacers out as you work to prevent the concrete from curing around them. Leaving them in will leave gaps in the layers, weakening the wall."
        },
        {
          "headline":"Smooth out the concrete with a screed or another tool.",
          "description":"Climb up a ladder and level out the concrete with the top of the form you built. If you can’t get a screed up there, try using a float or a trowel. Screeds and floats are better for covering large areas in a short amount of time. Drag the tool along the concrete to remove the excess. Pack down as much of the concrete as you can before scraping off the excess. Any air bubbles or empty space left behind reduces the integrity of your wall. To help pack and level the concrete properly, tap the forms with a hammer or mallet."
        },
        {
          "headline":"Cover and cure the concrete for up to 4 days.",
          "description":"Cover the concrete with something that holds water. Burlap and straw are a few options, but you can also buy polyethylene sheeting or concrete curing blankets. Dampen the covering with water and moisten it every day until the concrete hardens. Some concrete mixes take 28 days in total to solidify, but you will need to remove the forms before then to finish the installation."
        },
        {
          "headline":"Remove the forms and the wires attached to the concrete.",
          "description":"Cut the wires to pull them out of the concrete. Since the concrete hasn’t solidified yet, you won’t have trouble removing the ties. Then, pull the forms away from the concrete to remove them. Remove nails as needed to deconstruct the forms. Old forms can be reused if you plan on making more walls! You can also recycle the wood for other projects. If you leave the wires in place, they may rust and discolor the wall."
        },
        {
          "headline":"Cover the wall and let it finish curing for up to 24 more days.",
          "description":"Look for any holes in the wall before you continue. Normally, you won’t need to do any additional work. Put the cover back in place, wet it again, and play the waiting game. After the concrete hardens, remove the cover to admire your work. Check the manufacturer’s recommendations for drying your concrete mix. Some mixes require less than the usual 28 days to fully cure. If you happen to see holes or other signs of damage, fix them as soon as possible. Try using a store-bought concrete patching mix. Usually, you mix the patching material like concrete, then spread it over the damaged portion with a trowel."
        }
      ]
    }
  ],
  "text":" Creating the Wall Footer Measure and outline the space for your wall. Determine how long and wide you wish the wall to be. Then, begin mapping out the construction area with a tape measure. To easily trace the area you need to clear for the wall, try using a spray canister of marking chalk. You can also stake the area, stretching string between each stake. Marking chalk, along with any of the other supplies you need for the wall, are available at most hardware stores. Be aware of any utility lines or other obstacles in the area. Your local utility companies can help you with this. Dig out the soil to form space for the wall and footer. Clear out sod and soil according to your wall’s width. When you have that done, begin digging out space for the footer. Divide the wall’s width in half, then measure that far down from the soil line. Then, dig out a space underneath this point that is twice as long as the wall is wide. The footer needs to be below the frost line, which is about 1 ft (0.30 m) below the soil’s surface on average. Check your local government’s municipal code for an exact estimate. The footer size you need depends on the wall you wish to create. A good footer is as tall as the wall is wide. If you already have a concrete base in place, you do not need to create another one. Instead, skip to setting up the form. Compact and level out the soil with a tamper tool. Press the flat head of the tamper tool down against the soil to smooth it out. Don’t forget the sides of the hole you dug! When you’re done, test the soil’s levelness by running a screed along it, which you can also use to level out poured concrete later. Make sure the soil is level before you begin pouring concrete. If you need to, plant stakes and run string tightly between them. Check for any spots where the string doesn’t rest firmly on the soil. Pour 6 in (15 cm) of gravel into the hole. Protect the concrete with a thick layer of all-purpose gravel or crushed stone. After spreading it along the bottom of the hole, press it down flat with a tamper tool. Use the screed tool as needed to level out the hole again. The layer of stone helps prevent the concrete from shifting and cracking over time. It also increases drainage in clay soil. Place a layer of steel rebar ⅓ of the way up the hole. Use rebar about ⁄3 in (0.85 cm) in diameter to reinforce the concrete. Lay the rebar in a grid with the bars spaced about 12 in (30 cm) apart. If you need to, cut the rebar to size with a metal-cutting hacksaw blade or another saw. Also, use metal wire ties to bind the rebar together. You can also expand the rebar grid up the sides of the hole. This will give the concrete additional stability. It’s necessary if you’re planning on putting heavy walls on top of the footer, such as for a pool or house. Mix and pour concrete to fill the footer hole. Purchase enough concrete to fill the hole, then add it all to a big mixer with a pouring ramp. Add all of the concrete directly to the hole. Use a screed to smooth out the concrete immediately before it has a chance to set. You may be able to rent a concrete mixer. Check your local hardware store. Remember to leave space between the soil’s surface and the footer. The height of the soil over the footer needs to be equal to the width of the wall you wish to build. Cover the footer and let it cure for at least 7 days. Put something wet over the exposed concrete. Wet sand, straw, and burlap are a few options. Sprinkle the concrete with water every day to keep it moist as it cures. Once the footer sets, you can begin building over it. Check the manufacturer’s instructions for the exact drying time needed. It varies depending on which mix you choose. For a quick-dry mix, it will take about 7 days. As you wait for the concrete to cure, begin building the wood form you need to shape the concrete wall. Building Forms Stack wood planks to create a frame for the wall. These wood barriers hold the concrete in place as it dries, so you will need to create 2 of them. The cheapest and easiest material to use is 2 in × 4 in (5.1 cm × 10.2 cm) boards cut from a softwood like pine. Keep the boards less than 8 ft (2.4 m) long so they aren’t too difficult to handle. Lay the boards on edge horizontally, stacking them to match the height of your planned wall. Rest the frame pieces against a solid surface to prevent them from falling. If your frame is tall, you may need to begin installing the connecting studs before adding more boards. Try to make the frame pieces as long as you need them to be. If you’re building a long wall, build the frame in sections. Smaller pieces are much easier to handle and can be joined together later. If you’re building your own forms, you will probably need to do plenty of cutting. Have a circular saw ready along with a dust mask and ear protection. Nail studs into the back of each frame to bind the boards together. Use more 2 in × 4 in (5.1 cm × 10.2 cm) boards to assemble the frame. Space the studs out every 16 in (41 cm) along your frames. Instead of laying the studs flat, turn them on their sides. Then, use about 4 3 ⁄2 in (8.9 cm) nails per stud to secure them all to the frames. Place the nails about 2 in (5.1 cm) from the top and bottom edges of each stud. Lay wales across the studs to strengthen the forms. Use a few more 2 in × 4 in (5.1 cm × 10.2 cm) boards, placing them about every 12 in (30 cm) from top to bottom. Tip each board onto its edge, laying it horizontally across the studs. Secure the boards to each stud with 2 to 4 more 3 ⁄2 in (8.9 cm) nails. The wales also provide a place for you to tie connecting wires and attach braces for additional support. Attach a brace board over the back of the wales. Select 2 in × 4 in (5.1 cm × 10.2 cm) boards as tall as the forms you’re constructing. Position the braces about every 12 in (30 cm) along the length of the wall. Stand the braces up so only the side edge connects with the rest of the form. Then, use a pair of 3 ⁄2 in (8.9 cm) nails on each wale to connect the braces to them. The braces aren’t exactly part of the forms, but they provide much-needed stability to the forms. Create the rest of the braces with additional boards and stakes. Start with a wood board sharpened into a stake you can plant in the soil outside. Set another wood board on its side, running it from the brace board to the stake. Then, add a third board, running it diagonally from the center of the brace to the stake. Use more nails to attach the boards to the brace and stake. The additional brace boards need to be about 12 in (30 cm) long. The exact length depends on the size of your wall. Taller walls need longer braces for extra support. Nail ⁄4 in (1.9 cm) plywood sheets to the frames. Flip the frames over to the sides without the studs. Fit the plywood so it’s the same length and height as the frame you’re putting it on. Then, use more 3 ⁄2 in (8.9 cm) nails to connect the plywood to the studs. Place a nail about every 12 in (30 cm) along the length of each stud. Nail through the plywood and into the studs. If you work the other way, the screw ends will stick out into the concrete you pour, affecting your wall. Installing the Forms Set the forms on plywood boards near where you plan on building the wall. Place ⁄4 in (1.9 cm) pieces of plywood on the ground. These shoe plates need to be wide enough to support the forms you built. Arrange them so they border the hole in your yard where you plan on pouring concrete for the wall. Before you continue, make sure the shoe plates and forms leave the correct amount of space you need for your wall. Plant the stakes firmly in the ground. When your forms are in place, they won’t budge at all. Test them out by pushing against them with your hand. If you’re having a hard time getting everything to stay still where you need it, try using wire ties. Wrap wires around the studs in the forms to tie them to the shoe plates. Drill holes in the plates as needed to attach the wires. Drill ⁄8 in (0.32 cm) holes on either side of each stud. Make the holes evert 12 in (30 cm) along the length of each stud. Leave about 2 in (5.1 cm) of space between the holes and the studs to avoid damaging your forms. Run wires through the holes and tie them to the wales. Use 8 gauge wire ties which have a diameter of about ⁄1000 in (0.41 cm). Basically, you need to cross the wire over itself. Loop it around the wale on 1 side, thread it back through the hole, then loop it around the wale on the other side. The part of the wire between the forms will form an X. The wires hold the forms together when you pour the concrete. If the forms slip out of place, you’ll be looking at a concrete mess instead of a solid wall. Tighten the wire tie with a stick or another tool. Lower the stick towards the center part of the wire. Wrap the wire around itself by turning it with a circular motion. Make sure the wire gets as tight as you can make it. If it feels slack, your forms may slip out of place. Another way to do this is by sliding tie rods through the holes. Slide brackets onto the ends of the rods so they can’t slide out of place. Slip wood spacers beside each wire. You will need wood blocks as thick as your wall will be. These spacers stay in place through friction. You don’t actually attach them to the wall. They prevent the forms from moving in as you work. Check your local hardware store for spacers. Many places sell “spreader cleats” or a similarly-named product. If you can’t find any, you can always cut them yourself out of scrap boards. Drill through the spreaders and wire them together. Make a ⁄8 in (0.32 cm) hole all the way through the center of each spreader. When you’re done drilling, string a wire gauge through them all. Loop the wire around the top and bottom spreader. Leave a little extra length on the top part of the wire so you can easily pull the spreaders out later. Set the loop on top of your wall for now. Try tying them to the wall so the wires don’t slip into the concrete as you pour it. Pouring and Curing the Concrete Mix enough concrete to complete the wall all at once. Purchase some concrete mix and pour it all into a mixer with a ramp or hose. Add water and stir the concrete according to the manufacturer’s instructions. Good concrete has a gray, uniform consistency. If you add too much water, the concrete turns a little soupy. It will weaken your wall, so don’t overmix your batch of concrete. If you can’t make the entire wall at once, divide it into smaller sections. Mix enough concrete to fill each section at a time. This is very useful for long walls where the concrete might dry out before you’re done pouring it. Pour the concrete in layers, starting at the end of the wall. Pour the concrete directly into the wood form using a chute or hose attached to the mixer. To achieve a strong wall, keep the layers of concrete 20 in (51 cm) thick or less. Work from 1 end of the wall to the other, moving back and forth until the concrete is as high as you want the wall to be. If you can help it, don’t wait to pour additional layers. The concrete will cool and begin to settle. If you have to wait, pour a store-bought concrete bonding adhesive onto the settled concrete so the next layer bonds to it. Pull the spacers out as you pour the concrete. As your forms fill, watch for the concrete to reach the wood spreaders. Have a ladder ready so you can reach the top of the forms. Tug the wire up to keep the spreaders out of the concrete. Gradually raise the spreaders as you fill the space between the forms. Take the spacers out as you work to prevent the concrete from curing around them. Leaving them in will leave gaps in the layers, weakening the wall. Smooth out the concrete with a screed or another tool. Climb up a ladder and level out the concrete with the top of the form you built. If you can’t get a screed up there, try using a float or a trowel. Screeds and floats are better for covering large areas in a short amount of time. Drag the tool along the concrete to remove the excess. Pack down as much of the concrete as you can before scraping off the excess. Any air bubbles or empty space left behind reduces the integrity of your wall. To help pack and level the concrete properly, tap the forms with a hammer or mallet. Cover and cure the concrete for up to 4 days. Cover the concrete with something that holds water. Burlap and straw are a few options, but you can also buy polyethylene sheeting or concrete curing blankets. Dampen the covering with water and moisten it every day until the concrete hardens. Some concrete mixes take 28 days in total to solidify, but you will need to remove the forms before then to finish the installation. Remove the forms and the wires attached to the concrete. Cut the wires to pull them out of the concrete. Since the concrete hasn’t solidified yet, you won’t have trouble removing the ties. Then, pull the forms away from the concrete to remove them. Remove nails as needed to deconstruct the forms. Old forms can be reused if you plan on making more walls! You can also recycle the wood for other projects. If you leave the wires in place, they may rust and discolor the wall. Cover the wall and let it finish curing for up to 24 more days. Look for any holes in the wall before you continue. Normally, you won’t need to do any additional work. Put the cover back in place, wet it again, and play the waiting game. After the concrete hardens, remove the cover to admire your work. Check the manufacturer’s recommendations for drying your concrete mix. Some mixes require less than the usual 28 days to fully cure. If you happen to see holes or other signs of damage, fix them as soon as possible. Try using a store-bought concrete patching mix. Usually, you mix the patching material like concrete, then spread it over the damaged portion with a trowel.",
  "sentences":[
    " Creating the Wall Footer Measure and outline the space for your wall.",
    "Determine how long and wide you wish the wall to be.",
    "Then, begin mapping out the construction area with a tape measure.",
    "To easily trace the area you need to clear for the wall, try using a spray canister of marking chalk.",
    "You can also stake the area, stretching string between each stake.",
    "Marking chalk, along with any of the other supplies you need for the wall, are available at most hardware stores.",
    "Be aware of any utility lines or other obstacles in the area.",
    "Your local utility companies can help you with this.",
    "Dig out the soil to form space for the wall and footer.",
    "Clear out sod and soil according to your wall’s width.",
    "When you have that done, begin digging out space for the footer.",
    "Divide the wall’s width in half, then measure that far down from the soil line.",
    "Then, dig out a space underneath this point that is twice as long as the wall is wide.",
    "The footer needs to be below the frost line, which is about 1 ft (0.30 m) below the soil’s surface on average.",
    "Check your local government’s municipal code for an exact estimate.",
    "The footer size you need depends on the wall you wish to create.",
    "A good footer is as tall as the wall is wide.",
    "If you already have a concrete base in place, you do not need to create another one.",
    "Instead, skip to setting up the form.",
    "Compact and level out the soil with a tamper tool.",
    "Press the flat head of the tamper tool down against the soil to smooth it out.",
    "Don’t forget the sides of the hole you dug!",
    "When you’re done, test the soil’s levelness by running a screed along it, which you can also use to level out poured concrete later.",
    "Make sure the soil is level before you begin pouring concrete.",
    "If you need to, plant stakes and run string tightly between them.",
    "Check for any spots where the string doesn’t rest firmly on the soil.",
    "Pour 6 in (15 cm) of gravel into the hole.",
    "Protect the concrete with a thick layer of all-purpose gravel or crushed stone.",
    "After spreading it along the bottom of the hole, press it down flat with a tamper tool.",
    "Use the screed tool as needed to level out the hole again.",
    "The layer of stone helps prevent the concrete from shifting and cracking over time.",
    "It also increases drainage in clay soil.",
    "Place a layer of steel rebar ⅓ of the way up the hole.",
    "Use rebar about ⁄3 in (0.85 cm) in diameter to reinforce the concrete.",
    "Lay the rebar in a grid with the bars spaced about 12 in (30 cm) apart.",
    "If you need to, cut the rebar to size with a metal-cutting hacksaw blade or another saw.",
    "Also, use metal wire ties to bind the rebar together.",
    "You can also expand the rebar grid up the sides of the hole.",
    "This will give the concrete additional stability.",
    "It’s necessary if you’re planning on putting heavy walls on top of the footer, such as for a pool or house.",
    "Mix and pour concrete to fill the footer hole.",
    "Purchase enough concrete to fill the hole, then add it all to a big mixer with a pouring ramp.",
    "Add all of the concrete directly to the hole.",
    "Use a screed to smooth out the concrete immediately before it has a chance to set.",
    "You may be able to rent a concrete mixer.",
    "Check your local hardware store.",
    "Remember to leave space between the soil’s surface and the footer.",
    "The height of the soil over the footer needs to be equal to the width of the wall you wish to build.",
    "Cover the footer and let it cure for at least 7 days.",
    "Put something wet over the exposed concrete.",
    "Wet sand, straw, and burlap are a few options.",
    "Sprinkle the concrete with water every day to keep it moist as it cures.",
    "Once the footer sets, you can begin building over it.",
    "Check the manufacturer’s instructions for the exact drying time needed.",
    "It varies depending on which mix you choose.",
    "For a quick-dry mix, it will take about 7 days.",
    "As you wait for the concrete to cure, begin building the wood form you need to shape the concrete wall.",
    "Building Forms Stack wood planks to create a frame for the wall.",
    "These wood barriers hold the concrete in place as it dries, so you will need to create 2 of them.",
    "The cheapest and easiest material to use is 2 in × 4 in (5.1 cm × 10.2 cm) boards cut from a softwood like pine.",
    "Keep the boards less than 8 ft (2.4 m) long so they aren’t too difficult to handle.",
    "Lay the boards on edge horizontally, stacking them to match the height of your planned wall.",
    "Rest the frame pieces against a solid surface to prevent them from falling.",
    "If your frame is tall, you may need to begin installing the connecting studs before adding more boards.",
    "Try to make the frame pieces as long as you need them to be.",
    "If you’re building a long wall, build the frame in sections.",
    "Smaller pieces are much easier to handle and can be joined together later.",
    "If you’re building your own forms, you will probably need to do plenty of cutting.",
    "Have a circular saw ready along with a dust mask and ear protection.",
    "Nail studs into the back of each frame to bind the boards together.",
    "Use more 2 in × 4 in (5.1 cm × 10.2 cm) boards to assemble the frame.",
    "Space the studs out every 16 in (41 cm) along your frames.",
    "Instead of laying the studs flat, turn them on their sides.",
    "Then, use about 4 3 ⁄2 in (8.9 cm) nails per stud to secure them all to the frames.",
    "Place the nails about 2 in (5.1 cm) from the top and bottom edges of each stud.",
    "Lay wales across the studs to strengthen the forms.",
    "Use a few more 2 in × 4 in (5.1 cm × 10.2 cm) boards, placing them about every 12 in (30 cm) from top to bottom.",
    "Tip each board onto its edge, laying it horizontally across the studs.",
    "Secure the boards to each stud with 2 to 4 more 3 ⁄2 in (8.9 cm) nails.",
    "The wales also provide a place for you to tie connecting wires and attach braces for additional support.",
    "Attach a brace board over the back of the wales.",
    "Select 2 in × 4 in (5.1 cm × 10.2 cm) boards as tall as the forms you’re constructing.",
    "Position the braces about every 12 in (30 cm) along the length of the wall.",
    "Stand the braces up so only the side edge connects with the rest of the form.",
    "Then, use a pair of 3 ⁄2 in (8.9 cm) nails on each wale to connect the braces to them.",
    "The braces aren’t exactly part of the forms, but they provide much-needed stability to the forms.",
    "Create the rest of the braces with additional boards and stakes.",
    "Start with a wood board sharpened into a stake you can plant in the soil outside.",
    "Set another wood board on its side, running it from the brace board to the stake.",
    "Then, add a third board, running it diagonally from the center of the brace to the stake.",
    "Use more nails to attach the boards to the brace and stake.",
    "The additional brace boards need to be about 12 in (30 cm) long.",
    "The exact length depends on the size of your wall.",
    "Taller walls need longer braces for extra support.",
    "Nail ⁄4 in (1.9 cm) plywood sheets to the frames.",
    "Flip the frames over to the sides without the studs.",
    "Fit the plywood so it’s the same length and height as the frame you’re putting it on.",
    "Then, use more 3 ⁄2 in (8.9 cm) nails to connect the plywood to the studs.",
    "Place a nail about every 12 in (30 cm) along the length of each stud.",
    "Nail through the plywood and into the studs.",
    "If you work the other way, the screw ends will stick out into the concrete you pour, affecting your wall.",
    "Installing the Forms Set the forms on plywood boards near where you plan on building the wall.",
    "Place ⁄4 in (1.9 cm) pieces of plywood on the ground.",
    "These shoe plates need to be wide enough to support the forms you built.",
    "Arrange them so they border the hole in your yard where you plan on pouring concrete for the wall.",
    "Before you continue, make sure the shoe plates and forms leave the correct amount of space you need for your wall.",
    "Plant the stakes firmly in the ground.",
    "When your forms are in place, they won’t budge at all.",
    "Test them out by pushing against them with your hand.",
    "If you’re having a hard time getting everything to stay still where you need it, try using wire ties.",
    "Wrap wires around the studs in the forms to tie them to the shoe plates.",
    "Drill holes in the plates as needed to attach the wires.",
    "Drill ⁄8 in (0.32 cm) holes on either side of each stud.",
    "Make the holes evert 12 in (30 cm) along the length of each stud.",
    "Leave about 2 in (5.1 cm) of space between the holes and the studs to avoid damaging your forms.",
    "Run wires through the holes and tie them to the wales.",
    "Use 8 gauge wire ties which have a diameter of about ⁄1000 in (0.41 cm).",
    "Basically, you need to cross the wire over itself.",
    "Loop it around the wale on 1 side, thread it back through the hole, then loop it around the wale on the other side.",
    "The part of the wire between the forms will form an X.",
    "The wires hold the forms together when you pour the concrete.",
    "If the forms slip out of place, you’ll be looking at a concrete mess instead of a solid wall.",
    "Tighten the wire tie with a stick or another tool.",
    "Lower the stick towards the center part of the wire.",
    "Wrap the wire around itself by turning it with a circular motion.",
    "Make sure the wire gets as tight as you can make it.",
    "If it feels slack, your forms may slip out of place.",
    "Another way to do this is by sliding tie rods through the holes.",
    "Slide brackets onto the ends of the rods so they can’t slide out of place.",
    "Slip wood spacers beside each wire.",
    "You will need wood blocks as thick as your wall will be.",
    "These spacers stay in place through friction.",
    "You don’t actually attach them to the wall.",
    "They prevent the forms from moving in as you work.",
    "Check your local hardware store for spacers.",
    "Many places sell “spreader cleats” or a similarly-named product.",
    "If you can’t find any, you can always cut them yourself out of scrap boards.",
    "Drill through the spreaders and wire them together.",
    "Make a ⁄8 in (0.32 cm) hole all the way through the center of each spreader.",
    "When you’re done drilling, string a wire gauge through them all.",
    "Loop the wire around the top and bottom spreader.",
    "Leave a little extra length on the top part of the wire so you can easily pull the spreaders out later.",
    "Set the loop on top of your wall for now.",
    "Try tying them to the wall so the wires don’t slip into the concrete as you pour it.",
    "Pouring and Curing the Concrete Mix enough concrete to complete the wall all at once.",
    "Purchase some concrete mix and pour it all into a mixer with a ramp or hose.",
    "Add water and stir the concrete according to the manufacturer’s instructions.",
    "Good concrete has a gray, uniform consistency.",
    "If you add too much water, the concrete turns a little soupy.",
    "It will weaken your wall, so don’t overmix your batch of concrete.",
    "If you can’t make the entire wall at once, divide it into smaller sections.",
    "Mix enough concrete to fill each section at a time.",
    "This is very useful for long walls where the concrete might dry out before you’re done pouring it.",
    "Pour the concrete in layers, starting at the end of the wall.",
    "Pour the concrete directly into the wood form using a chute or hose attached to the mixer.",
    "To achieve a strong wall, keep the layers of concrete 20 in (51 cm) thick or less.",
    "Work from 1 end of the wall to the other, moving back and forth until the concrete is as high as you want the wall to be.",
    "If you can help it, don’t wait to pour additional layers.",
    "The concrete will cool and begin to settle.",
    "If you have to wait, pour a store-bought concrete bonding adhesive onto the settled concrete so the next layer bonds to it.",
    "Pull the spacers out as you pour the concrete.",
    "As your forms fill, watch for the concrete to reach the wood spreaders.",
    "Have a ladder ready so you can reach the top of the forms.",
    "Tug the wire up to keep the spreaders out of the concrete.",
    "Gradually raise the spreaders as you fill the space between the forms.",
    "Take the spacers out as you work to prevent the concrete from curing around them.",
    "Leaving them in will leave gaps in the layers, weakening the wall.",
    "Smooth out the concrete with a screed or another tool.",
    "Climb up a ladder and level out the concrete with the top of the form you built.",
    "If you can’t get a screed up there, try using a float or a trowel.",
    "Screeds and floats are better for covering large areas in a short amount of time.",
    "Drag the tool along the concrete to remove the excess.",
    "Pack down as much of the concrete as you can before scraping off the excess.",
    "Any air bubbles or empty space left behind reduces the integrity of your wall.",
    "To help pack and level the concrete properly, tap the forms with a hammer or mallet.",
    "Cover and cure the concrete for up to 4 days.",
    "Cover the concrete with something that holds water.",
    "Burlap and straw are a few options, but you can also buy polyethylene sheeting or concrete curing blankets.",
    "Dampen the covering with water and moisten it every day until the concrete hardens.",
    "Some concrete mixes take 28 days in total to solidify, but you will need to remove the forms before then to finish the installation.",
    "Remove the forms and the wires attached to the concrete.",
    "Cut the wires to pull them out of the concrete.",
    "Since the concrete hasn’t solidified yet, you won’t have trouble removing the ties.",
    "Then, pull the forms away from the concrete to remove them.",
    "Remove nails as needed to deconstruct the forms.",
    "Old forms can be reused if you plan on making more walls!",
    "You can also recycle the wood for other projects.",
    "If you leave the wires in place, they may rust and discolor the wall.",
    "Cover the wall and let it finish curing for up to 24 more days.",
    "Look for any holes in the wall before you continue.",
    "Normally, you won’t need to do any additional work.",
    "Put the cover back in place, wet it again, and play the waiting game.",
    "After the concrete hardens, remove the cover to admire your work.",
    "Check the manufacturer’s recommendations for drying your concrete mix.",
    "Some mixes require less than the usual 28 days to fully cure.",
    "If you happen to see holes or other signs of damage, fix them as soon as possible.",
    "Try using a store-bought concrete patching mix.",
    "Usually, you mix the patching material like concrete, then spread it over the damaged portion with a trowel."
  ],
  "tyn_section":[
    "Tape measure",
    "Ladder",
    "Concrete mix",
    "Concrete curing blanket",
    "Wheelbarrow or other concrete mixing container",
    "Pouring ramp or hose",
    "Shovel",
    "Tamper",
    "Gravel or crushed stone",
    "Steel rebar ",
    "1⁄3",
    "1",
    "⁄",
    "3",
    " in (0.85 cm) in diameter",
    "2 in × 4 in (5.1 cm × 10.2 cm) softwood boards",
    "3⁄4",
    "4",
    " in (1.9 cm) plywood sheets",
    "3 1⁄2",
    " ",
    "2",
    " in (8.9 cm) wood nails",
    "1⁄8",
    "8",
    " in (0.32 cm) drill bit",
    "Drill",
    "Wire ties or tie rods",
    "Water"
  ],
  "tyn_model":[
    "concrete",
    "nails",
    "boards",
    "wire",
    "rebar",
    "plywood",
    "water",
    "× 4",
    "× 10.2",
    "wires",
    "soil",
    "tamper tool",
    "stakes",
    "straw",
    "wales",
    "braces",
    "wood board",
    "concrete mix",
    "mixer",
    "ladder",
    "trowel",
    "wall footer measure",
    "tape measure",
    "marking chalk",
    "sod",
    "gravel",
    "all-purpose gravel",
    "crushed stone",
    "screed tool",
    "stone",
    "steel rebar",
    "⅓ of",
    "big mixer",
    "concrete mixer",
    "building forms",
    "circular saw",
    "dust mask",
    "brace board",
    "sheets",
    "nail",
    "plywood boards",
    "shoe plates",
    "wire ties",
    "8 gauge wire ties",
    "tie rods",
    "brackets",
    "wood blocks",
    "“spreader",
    "” or",
    "wire gauge",
    "concrete bonding adhesive",
    "wood spreaders",
    "float",
    "screeds",
    "floats",
    "tool",
    "hammer",
    "mallet",
    "polyethylene sheeting",
    "concrete curing blankets",
    "concrete mixes",
    "wood",
    "concrete patching mix"
  ],
  "simple_metrics":{
    "r":0.1379310345,
    "p":0.0634920635,
    "f1":0.0869565217,
    "avg_pos":0.3492063492
  },
  "jacc_metrics_0.5":{
    "r":0.3103448276,
    "p":0.1904761905,
    "f1":0.2360655738
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3448275862,
    "p":0.253968254,
    "f1":0.2925045704
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1724137931,
    "p":0.0952380952,
    "f1":0.1226993865
  }
}