{
  "title":"How to Make Yogurt Parfait",
  "url":"https://www.wikihow.com/Make-Yogurt-Parfait",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Yogurt"
  ],
  "methods":[
    {
      "name":"Making Yogurt Parfait",
      "steps":[
        {
          "headline":"Locate and organize your ingredients.",
          "description":"You'll find the ingredients in a list above. The great thing about parfait ingredients is that it is completely customizable. Keep them in a place near each other on your work station."
        },
        {
          "headline":"Place the glass in the middle.",
          "description":"You'll be putting the ingredients in this container, so try to keep it near the food items. Chill this glass beforehand in the freezer or fridge. This makes the food cool and keeps it fresh."
        },
        {
          "headline":"Add a quarter cup of yogurt.",
          "description":"Don't add all of the yogurt yet; you still need room in the glass for the other ingredients. At this point, you may add any other ingredients to the parfait. It is your choice; this is what makes a parfait so unique. You can add strawberry jam for some sweetness, cereal, oatmeal, granola, fruit, or whatever else you like. Be sure to leave some room in the cup for the final step."
        },
        {
          "headline":"Add the other three-fourths of a cup of yogurt.",
          "description":"You want to have more yogurt on the top than on the bottom. If you have too much on the bottom all of your cereal and fruit will sink and get soggy in the yogurt. I recommend using plain yogurt so the real flavor of the ingredients come out but if you want to intensify the taste of the fruit then add a flavored yogurt. You can substitute a flavored yogurt for a fruit. Serve the dish fresh, preferably right after you have prepared it. If you don't like I said the granola or cereal will get soggy."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Making Pack-a-Punch Yogurt Parfait",
      "steps":[
        {
          "headline":"Place 2-3 tablespoons of yogurt of your choice into a long glass.",
          "description":""
        },
        {
          "headline":"Add the chia seed, goji berry, flaxseed mix to the yogurt.",
          "description":"Add the ground cinnamon and the blueberries. (You can make modifications to make it to your taste, such as adding banana, apples, strawberries, etc.)"
        },
        {
          "headline":"Add another dollop or two of yogurt.",
          "description":""
        },
        {
          "headline":"Add muesli or granola of your choice.",
          "description":""
        },
        {
          "headline":"Add more of the chia, goji, flaxseed mix in a smaller amount.",
          "description":""
        },
        {
          "headline":"Shave some dark chocolate on top.",
          "description":"Enjoy your healthy snack."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Yogurt Parfait Locate and organize your ingredients. You'll find the ingredients in a list above. The great thing about parfait ingredients is that it is completely customizable. Keep them in a place near each other on your work station. Place the glass in the middle. You'll be putting the ingredients in this container, so try to keep it near the food items. Chill this glass beforehand in the freezer or fridge. This makes the food cool and keeps it fresh. Add a quarter cup of yogurt. Don't add all of the yogurt yet; you still need room in the glass for the other ingredients. At this point, you may add any other ingredients to the parfait. It is your choice; this is what makes a parfait so unique. You can add strawberry jam for some sweetness, cereal, oatmeal, granola, fruit, or whatever else you like. Be sure to leave some room in the cup for the final step. Add the other three-fourths of a cup of yogurt. You want to have more yogurt on the top than on the bottom. If you have too much on the bottom all of your cereal and fruit will sink and get soggy in the yogurt. I recommend using plain yogurt so the real flavor of the ingredients come out but if you want to intensify the taste of the fruit then add a flavored yogurt. You can substitute a flavored yogurt for a fruit. Serve the dish fresh, preferably right after you have prepared it. If you don't like I said the granola or cereal will get soggy. Finished.  Making Pack-a-Punch Yogurt Parfait Place 2-3 tablespoons of yogurt of your choice into a long glass.  Add the chia seed, goji berry, flaxseed mix to the yogurt. Add the ground cinnamon and the blueberries. (You can make modifications to make it to your taste, such as adding banana, apples, strawberries, etc.) Add another dollop or two of yogurt.  Add muesli or granola of your choice.  Add more of the chia, goji, flaxseed mix in a smaller amount.  Shave some dark chocolate on top. Enjoy your healthy snack. Finished. ",
  "sentences":[
    " Making Yogurt Parfait Locate and organize your ingredients.",
    "You'll find the ingredients in a list above.",
    "The great thing about parfait ingredients is that it is completely customizable.",
    "Keep them in a place near each other on your work station.",
    "Place the glass in the middle.",
    "You'll be putting the ingredients in this container, so try to keep it near the food items.",
    "Chill this glass beforehand in the freezer or fridge.",
    "This makes the food cool and keeps it fresh.",
    "Add a quarter cup of yogurt.",
    "Don't add all of the yogurt yet; you still need room in the glass for the other ingredients.",
    "At this point, you may add any other ingredients to the parfait.",
    "It is your choice; this is what makes a parfait so unique.",
    "You can add strawberry jam for some sweetness, cereal, oatmeal, granola, fruit, or whatever else you like.",
    "Be sure to leave some room in the cup for the final step.",
    "Add the other three-fourths of a cup of yogurt.",
    "You want to have more yogurt on the top than on the bottom.",
    "If you have too much on the bottom all of your cereal and fruit will sink and get soggy in the yogurt.",
    "I recommend using plain yogurt so the real flavor of the ingredients come out but if you want to intensify the taste of the fruit then add a flavored yogurt.",
    "You can substitute a flavored yogurt for a fruit.",
    "Serve the dish fresh, preferably right after you have prepared it.",
    "If you don't like I said the granola or cereal will get soggy.",
    "Finished.",
    "Making Pack-a-Punch Yogurt Parfait Place 2-3 tablespoons of yogurt of your choice into a long glass.",
    "Add the chia seed, goji berry, flaxseed mix to the yogurt.",
    "Add the ground cinnamon and the blueberries.",
    "(You can make modifications to make it to your taste, such as adding banana, apples, strawberries, etc.)",
    "Add another dollop or two of yogurt.",
    "Add muesli or granola of your choice.",
    "Add more of the chia, goji, flaxseed mix in a smaller amount.",
    "Shave some dark chocolate on top.",
    "Enjoy your healthy snack.",
    "Finished."
  ],
  "tyn_section":[
    "Glass",
    "Spoon",
    "Spatula",
    "Kitchen cloth"
  ],
  "tyn_model":[
    "yogurt",
    "granola",
    "glass",
    "cereal",
    "making yogurt",
    "container",
    "strawberry jam",
    "chia seed",
    "cinnamon",
    "blueberries",
    "strawberries",
    "muesli",
    "dark chocolate"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0769230769,
    "f1":0.1176470588,
    "avg_pos":0.1538461538
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.0769230769,
    "f1":0.1176470588
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.0769230769,
    "f1":0.1176470588
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0769230769,
    "f1":0.1176470588
  }
}