{
  "title":"How to Make an Egg Sandwich",
  "url":"https://www.wikihow.com/Make-an-Egg-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals"
  ],
  "methods":[
    {
      "name":"Making a Classic Fried Egg Sandwich",
      "steps":[
        {
          "headline":"Toast the bread.",
          "description":"Place the two pieces of bread in a toaster or toaster oven. Turn on the toaster to a medium toast setting. While the bread is toasting, prepare and fry the eggs. Keep checking on the bread while you are preparing the eggs to make sure it doesn’t burn! If the toast is done before the eggs, remove it from the toaster. If you are toasting the bread in a toaster oven or inside your regular oven, top one piece of bread with the slice of cheese when it is partially toasted. The heat of the oven will melt the cheese."
        },
        {
          "headline":"Heat canola oil on a skillet.",
          "description":"Place a medium sized skillet on the stove over medium heat. Once the skillet has heated, pour the tablespoon of canola oil into the skillet and swirl to coat the bottom."
        },
        {
          "headline":"Crack both the eggs into the skillet.",
          "description":"Once the oil has heated, crack the first egg onto one side of the skillet. Immediately crack the second egg onto the other side of the skillet. Cracking the eggs on opposite sides of the skillet lets each egg fry separately and prevents them from running into each other."
        },
        {
          "headline":"Season the eggs with salt and pepper.",
          "description":"While the eggs are frying, sprinkle on a pinch of salt and pepper. You can add additional spices such as thyme or paprika if you wish, but be sure to also use salt and pepper since they help to bring out the flavor of the egg."
        },
        {
          "headline":"Flip the eggs.",
          "description":"After the whites of the egg become opaque, flip each egg with a spatula. Flip quickly so that the egg yolks don’t run, and make sure that the eggs aren’t overlapping as they cook."
        },
        {
          "headline":"Cook the eggs until you are satisfied with the yolk.",
          "description":"Some people prefer their egg yolks soft and slightly runny, while others prefer firmer yolks. Let the eggs fry until the yolks have reached a consistency that you're satisfied with. Remember that runny yolks are delicious, but they can be messier to eat than firm yolks!"
        },
        {
          "headline":"Assemble your sandwich.",
          "description":"Lay out your toasted bread on a plate, and place the slice of cheese on one piece if you haven’t already melted it on the bread. Transfer both of the fried eggs onto the piece of bread without the cheese. Then put the piece of bread with the cheese on top to finish the sandwich. Some people like to add ketchup or hot sauce to their egg sandwich. Add your condiment of choice to give your sandwich extra flavor."
        },
        {
          "headline":"Slice and serve immediately.",
          "description":"Cut your egg sandwich in half, then serve immediately. Fried egg sandwiches are best when eaten hot, since they can become soggy if left out."
        }
      ]
    },
    {
      "name":"Making an Egg Patty and Canadian Bacon Sandwich",
      "steps":[
        {
          "headline":"Heat a skillet and spray with cooking spray.",
          "description":"Place a small skillet over medium heat and allow to heat for about three minutes. After heated, spray the skillet lightly with olive oil cooking spray."
        },
        {
          "headline":"Spray a biscuit cutter.",
          "description":"Spray a round, aluminum biscuit cutter with the olive oil cooking spray, then place the biscuit cutter in the skillet. Try to use a 2 ½ inch or 3 inch (6.35 cm or 7.6 cm) round metal biscuit or cookie cutter. The aluminum cutter will help the egg to keep its shape when it’s baking."
        },
        {
          "headline":"Break the egg into the biscuit cutter.",
          "description":"Crack the egg and carefully pour it into the biscuit cutter. You can also crack the egg into a bowl and whisk it, then pour it into the biscuit cutter if you want the yolk to be blended with the egg whites."
        },
        {
          "headline":"Cover the biscuit cutter with foil and cook.",
          "description":"Cut a piece of aluminum foil that is slightly larger than the biscuit cutter, then place the foil on top of the biscuit cutter. Shape the foil around the aluminum cutter so it stays in place, then cook the egg for 3-4 minutes."
        },
        {
          "headline":"Slice the English muffin and toast it.",
          "description":"While the egg is cooking, slice the English muffin in half and place it in the toaster. Remove the muffin once it has finished toasting, even if it finishes before the eggs are done! If you are cooking the English muffin in the toaster oven or in your regular oven, you can place the slice of cheese on one piece of the muffin so that it melts. To toast the English muffin in a regular oven, preheat the oven to 350 degrees F (176 degrees C), then place the muffin on a baking sheet inside the preheated oven and bake for ten minutes."
        },
        {
          "headline":"Check on the egg.",
          "description":"Remove the foil after 3-4 minutes and check on the egg. By this time, the whites should be set and the yolk should still be a little soft. If you prefer a firmer yolk, keep cooking for another minute."
        },
        {
          "headline":"Remove the biscuit cutter and the cooked egg from the skillet.",
          "description":"Use tongs to remove the biscuit cutter from the skillet as it will be hot and could burn your fingers! Then use a spatula to transfer the cooked egg to a plate. Sprinkle the egg with salt and pepper."
        },
        {
          "headline":"Cook the bacon on the skillet.",
          "description":"Place the slice of Canadian bacon on the already heated skillet. Let the bacon cook for about one minute, then flip it over and cook it on the other side for another minute. If the bacon is not crispy after two minutes, keep cooking until it is crispy."
        },
        {
          "headline":"Assemble and serve the sandwich.",
          "description":"If you have not already melted the cheese onto the English muffin, place the slice of cheese on the bottom half of the muffin. Then place the bacon and egg on top of the cheese, and finally put the top of the English muffin onto the sandwich. Serve immediately."
        }
      ]
    },
    {
      "name":"Making an Egg Salad Sandwich",
      "steps":[
        {
          "headline":"Hard boil two eggs.",
          "description":"In a pot on the stove, hard boil two eggs. After the two eggs have boiled, remove the eggs from the water and let them cool. Letting the eggs cool before you make the egg salad will help the eggs be firmer and easier to chop. Run the eggs under cold water to speed up cooling."
        },
        {
          "headline":"Chop the boiled eggs.",
          "description":"After the eggs have cooled, peel them, then chop them into small pieces. Use a sharp knife and try to cut make the cubes of egg equal sizes so that the texture of the egg salad is consistent."
        },
        {
          "headline":"Mix in the mayonnaise.",
          "description":"Place the chopped boiled eggs in a medium mixing bowl and gradually add the mayonnaise, mixing continuously. Keep adding the mayonnaise until you are satisfied with the consistency."
        },
        {
          "headline":"Mix in the mustard and relish.",
          "description":"Add the mustard and relish and stir to combine all of the ingredients. Taste the egg salad and add more salt, pepper or other condiments like hot sauce or red wine vinegar as you wish."
        },
        {
          "headline":"Toast the bread.",
          "description":"If you want your bread to be toasted and crispy, place the two pieces of toast in the toaster. If you don’t want your bread to be toasted, leave the bread as is."
        },
        {
          "headline":"Put the sandwich together.",
          "description":"Spoon the egg salad onto one piece of bread, then place the other piece of bread on top. Slice the sandwich in half and enjoy! If you want the egg salad to be cold, store it in the fridge for an hour or so, then make the sandwich. Lettuce and tomato taste great on an egg salad sandwich!"
        }
      ]
    }
  ],
  "text":" Making a Classic Fried Egg Sandwich Toast the bread. Place the two pieces of bread in a toaster or toaster oven. Turn on the toaster to a medium toast setting. While the bread is toasting, prepare and fry the eggs. Keep checking on the bread while you are preparing the eggs to make sure it doesn’t burn! If the toast is done before the eggs, remove it from the toaster. If you are toasting the bread in a toaster oven or inside your regular oven, top one piece of bread with the slice of cheese when it is partially toasted. The heat of the oven will melt the cheese. Heat canola oil on a skillet. Place a medium sized skillet on the stove over medium heat. Once the skillet has heated, pour the tablespoon of canola oil into the skillet and swirl to coat the bottom. Crack both the eggs into the skillet. Once the oil has heated, crack the first egg onto one side of the skillet. Immediately crack the second egg onto the other side of the skillet. Cracking the eggs on opposite sides of the skillet lets each egg fry separately and prevents them from running into each other. Season the eggs with salt and pepper. While the eggs are frying, sprinkle on a pinch of salt and pepper. You can add additional spices such as thyme or paprika if you wish, but be sure to also use salt and pepper since they help to bring out the flavor of the egg. Flip the eggs. After the whites of the egg become opaque, flip each egg with a spatula. Flip quickly so that the egg yolks don’t run, and make sure that the eggs aren’t overlapping as they cook. Cook the eggs until you are satisfied with the yolk. Some people prefer their egg yolks soft and slightly runny, while others prefer firmer yolks. Let the eggs fry until the yolks have reached a consistency that you're satisfied with. Remember that runny yolks are delicious, but they can be messier to eat than firm yolks! Assemble your sandwich. Lay out your toasted bread on a plate, and place the slice of cheese on one piece if you haven’t already melted it on the bread. Transfer both of the fried eggs onto the piece of bread without the cheese. Then put the piece of bread with the cheese on top to finish the sandwich. Some people like to add ketchup or hot sauce to their egg sandwich. Add your condiment of choice to give your sandwich extra flavor. Slice and serve immediately. Cut your egg sandwich in half, then serve immediately. Fried egg sandwiches are best when eaten hot, since they can become soggy if left out. Making an Egg Patty and Canadian Bacon Sandwich Heat a skillet and spray with cooking spray. Place a small skillet over medium heat and allow to heat for about three minutes. After heated, spray the skillet lightly with olive oil cooking spray. Spray a biscuit cutter. Spray a round, aluminum biscuit cutter with the olive oil cooking spray, then place the biscuit cutter in the skillet. Try to use a 2 ½ inch or 3 inch (6.35 cm or 7.6 cm) round metal biscuit or cookie cutter. The aluminum cutter will help the egg to keep its shape when it’s baking. Break the egg into the biscuit cutter. Crack the egg and carefully pour it into the biscuit cutter. You can also crack the egg into a bowl and whisk it, then pour it into the biscuit cutter if you want the yolk to be blended with the egg whites. Cover the biscuit cutter with foil and cook. Cut a piece of aluminum foil that is slightly larger than the biscuit cutter, then place the foil on top of the biscuit cutter. Shape the foil around the aluminum cutter so it stays in place, then cook the egg for 3-4 minutes. Slice the English muffin and toast it. While the egg is cooking, slice the English muffin in half and place it in the toaster. Remove the muffin once it has finished toasting, even if it finishes before the eggs are done! If you are cooking the English muffin in the toaster oven or in your regular oven, you can place the slice of cheese on one piece of the muffin so that it melts. To toast the English muffin in a regular oven, preheat the oven to 350 degrees F (176 degrees C), then place the muffin on a baking sheet inside the preheated oven and bake for ten minutes. Check on the egg. Remove the foil after 3-4 minutes and check on the egg. By this time, the whites should be set and the yolk should still be a little soft. If you prefer a firmer yolk, keep cooking for another minute. Remove the biscuit cutter and the cooked egg from the skillet. Use tongs to remove the biscuit cutter from the skillet as it will be hot and could burn your fingers! Then use a spatula to transfer the cooked egg to a plate. Sprinkle the egg with salt and pepper. Cook the bacon on the skillet. Place the slice of Canadian bacon on the already heated skillet. Let the bacon cook for about one minute, then flip it over and cook it on the other side for another minute. If the bacon is not crispy after two minutes, keep cooking until it is crispy. Assemble and serve the sandwich. If you have not already melted the cheese onto the English muffin, place the slice of cheese on the bottom half of the muffin. Then place the bacon and egg on top of the cheese, and finally put the top of the English muffin onto the sandwich. Serve immediately. Making an Egg Salad Sandwich Hard boil two eggs. In a pot on the stove, hard boil two eggs. After the two eggs have boiled, remove the eggs from the water and let them cool. Letting the eggs cool before you make the egg salad will help the eggs be firmer and easier to chop. Run the eggs under cold water to speed up cooling. Chop the boiled eggs. After the eggs have cooled, peel them, then chop them into small pieces. Use a sharp knife and try to cut make the cubes of egg equal sizes so that the texture of the egg salad is consistent. Mix in the mayonnaise. Place the chopped boiled eggs in a medium mixing bowl and gradually add the mayonnaise, mixing continuously. Keep adding the mayonnaise until you are satisfied with the consistency. Mix in the mustard and relish. Add the mustard and relish and stir to combine all of the ingredients. Taste the egg salad and add more salt, pepper or other condiments like hot sauce or red wine vinegar as you wish. Toast the bread. If you want your bread to be toasted and crispy, place the two pieces of toast in the toaster. If you don’t want your bread to be toasted, leave the bread as is. Put the sandwich together. Spoon the egg salad onto one piece of bread, then place the other piece of bread on top. Slice the sandwich in half and enjoy! If you want the egg salad to be cold, store it in the fridge for an hour or so, then make the sandwich. Lettuce and tomato taste great on an egg salad sandwich!",
  "sentences":[
    " Making a Classic Fried Egg Sandwich Toast the bread.",
    "Place the two pieces of bread in a toaster or toaster oven.",
    "Turn on the toaster to a medium toast setting.",
    "While the bread is toasting, prepare and fry the eggs.",
    "Keep checking on the bread while you are preparing the eggs to make sure it doesn’t burn!",
    "If the toast is done before the eggs, remove it from the toaster.",
    "If you are toasting the bread in a toaster oven or inside your regular oven, top one piece of bread with the slice of cheese when it is partially toasted.",
    "The heat of the oven will melt the cheese.",
    "Heat canola oil on a skillet.",
    "Place a medium sized skillet on the stove over medium heat.",
    "Once the skillet has heated, pour the tablespoon of canola oil into the skillet and swirl to coat the bottom.",
    "Crack both the eggs into the skillet.",
    "Once the oil has heated, crack the first egg onto one side of the skillet.",
    "Immediately crack the second egg onto the other side of the skillet.",
    "Cracking the eggs on opposite sides of the skillet lets each egg fry separately and prevents them from running into each other.",
    "Season the eggs with salt and pepper.",
    "While the eggs are frying, sprinkle on a pinch of salt and pepper.",
    "You can add additional spices such as thyme or paprika if you wish, but be sure to also use salt and pepper since they help to bring out the flavor of the egg.",
    "Flip the eggs.",
    "After the whites of the egg become opaque, flip each egg with a spatula.",
    "Flip quickly so that the egg yolks don’t run, and make sure that the eggs aren’t overlapping as they cook.",
    "Cook the eggs until you are satisfied with the yolk.",
    "Some people prefer their egg yolks soft and slightly runny, while others prefer firmer yolks.",
    "Let the eggs fry until the yolks have reached a consistency that you're satisfied with.",
    "Remember that runny yolks are delicious, but they can be messier to eat than firm yolks!",
    "Assemble your sandwich.",
    "Lay out your toasted bread on a plate, and place the slice of cheese on one piece if you haven’t already melted it on the bread.",
    "Transfer both of the fried eggs onto the piece of bread without the cheese.",
    "Then put the piece of bread with the cheese on top to finish the sandwich.",
    "Some people like to add ketchup or hot sauce to their egg sandwich.",
    "Add your condiment of choice to give your sandwich extra flavor.",
    "Slice and serve immediately.",
    "Cut your egg sandwich in half, then serve immediately.",
    "Fried egg sandwiches are best when eaten hot, since they can become soggy if left out.",
    "Making an Egg Patty and Canadian Bacon Sandwich Heat a skillet and spray with cooking spray.",
    "Place a small skillet over medium heat and allow to heat for about three minutes.",
    "After heated, spray the skillet lightly with olive oil cooking spray.",
    "Spray a biscuit cutter.",
    "Spray a round, aluminum biscuit cutter with the olive oil cooking spray, then place the biscuit cutter in the skillet.",
    "Try to use a 2 ½ inch or 3 inch (6.35 cm or 7.6 cm) round metal biscuit or cookie cutter.",
    "The aluminum cutter will help the egg to keep its shape when it’s baking.",
    "Break the egg into the biscuit cutter.",
    "Crack the egg and carefully pour it into the biscuit cutter.",
    "You can also crack the egg into a bowl and whisk it, then pour it into the biscuit cutter if you want the yolk to be blended with the egg whites.",
    "Cover the biscuit cutter with foil and cook.",
    "Cut a piece of aluminum foil that is slightly larger than the biscuit cutter, then place the foil on top of the biscuit cutter.",
    "Shape the foil around the aluminum cutter so it stays in place, then cook the egg for 3-4 minutes.",
    "Slice the English muffin and toast it.",
    "While the egg is cooking, slice the English muffin in half and place it in the toaster.",
    "Remove the muffin once it has finished toasting, even if it finishes before the eggs are done!",
    "If you are cooking the English muffin in the toaster oven or in your regular oven, you can place the slice of cheese on one piece of the muffin so that it melts.",
    "To toast the English muffin in a regular oven, preheat the oven to 350 degrees F (176 degrees C), then place the muffin on a baking sheet inside the preheated oven and bake for ten minutes.",
    "Check on the egg.",
    "Remove the foil after 3-4 minutes and check on the egg.",
    "By this time, the whites should be set and the yolk should still be a little soft.",
    "If you prefer a firmer yolk, keep cooking for another minute.",
    "Remove the biscuit cutter and the cooked egg from the skillet.",
    "Use tongs to remove the biscuit cutter from the skillet as it will be hot and could burn your fingers!",
    "Then use a spatula to transfer the cooked egg to a plate.",
    "Sprinkle the egg with salt and pepper.",
    "Cook the bacon on the skillet.",
    "Place the slice of Canadian bacon on the already heated skillet.",
    "Let the bacon cook for about one minute, then flip it over and cook it on the other side for another minute.",
    "If the bacon is not crispy after two minutes, keep cooking until it is crispy.",
    "Assemble and serve the sandwich.",
    "If you have not already melted the cheese onto the English muffin, place the slice of cheese on the bottom half of the muffin.",
    "Then place the bacon and egg on top of the cheese, and finally put the top of the English muffin onto the sandwich.",
    "Serve immediately.",
    "Making an Egg Salad Sandwich Hard boil two eggs.",
    "In a pot on the stove, hard boil two eggs.",
    "After the two eggs have boiled, remove the eggs from the water and let them cool.",
    "Letting the eggs cool before you make the egg salad will help the eggs be firmer and easier to chop.",
    "Run the eggs under cold water to speed up cooling.",
    "Chop the boiled eggs.",
    "After the eggs have cooled, peel them, then chop them into small pieces.",
    "Use a sharp knife and try to cut make the cubes of egg equal sizes so that the texture of the egg salad is consistent.",
    "Mix in the mayonnaise.",
    "Place the chopped boiled eggs in a medium mixing bowl and gradually add the mayonnaise, mixing continuously.",
    "Keep adding the mayonnaise until you are satisfied with the consistency.",
    "Mix in the mustard and relish.",
    "Add the mustard and relish and stir to combine all of the ingredients.",
    "Taste the egg salad and add more salt, pepper or other condiments like hot sauce or red wine vinegar as you wish.",
    "Toast the bread.",
    "If you want your bread to be toasted and crispy, place the two pieces of toast in the toaster.",
    "If you don’t want your bread to be toasted, leave the bread as is.",
    "Put the sandwich together.",
    "Spoon the egg salad onto one piece of bread, then place the other piece of bread on top.",
    "Slice the sandwich in half and enjoy!",
    "If you want the egg salad to be cold, store it in the fridge for an hour or so, then make the sandwich.",
    "Lettuce and tomato taste great on an egg salad sandwich!"
  ],
  "tyn_section":[
    "2 ½- 3 inch (6.3- 7.6 cm) biscuit cutter"
  ],
  "tyn_model":[
    "eggs",
    "skillet",
    "biscuit cutter",
    "english muffin",
    "toaster",
    "salt and pepper",
    "foil",
    "bacon",
    "oven",
    "mayonnaise",
    "toaster oven",
    "canola oil",
    "stove",
    "spatula",
    "plate",
    "hot sauce",
    "olive oil",
    "aluminum cutter",
    "water",
    "mustard",
    "relish",
    "toaster or toaster",
    "oil",
    "fried eggs",
    "fried egg",
    "cooking spray",
    "small skillet",
    "cookie cutter",
    "bowl",
    "aluminum foil",
    "baking sheet",
    "canadian bacon",
    "pot",
    "medium mixing bowl",
    "salt, pepper",
    "red wine",
    "lettuce",
    "tomato",
    "egg salad"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}