{
  "title":"How to Make Drawn Butter",
  "url":"https://www.wikihow.com/Make-Drawn-Butter",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Butter and Ghee"
  ],
  "methods":[
    {
      "name":"Making a Melted Butter Sauce",
      "steps":[
        {
          "headline":"Decide whether to make melted or clarified butter.",
          "description":"\"Drawn butter\" is an ambiguous term. Depending on which chef you ask, it can mean plain melted butter or \"clarified\" butter: pure butterfat separated from the milk solids and water. Each option has its advantages:\nPlain melted butter has more flavor, making it a good dipping sauce for seafood. Read on for simple instructions and flavor ideas. Clarified butter has a more subdued flavor, which some people prefer. It also has a higher smoking point, useful for searing food. Skip ahead for the recipe."
        },
        {
          "headline":"Melt the butter over low heat.",
          "description":"Cut the butter into pieces and melt it in a pan over low heat. Stir the butter occasionally to prevent burning, especially if you have a cast iron or stainless steel pan (which tend to create hot spots). You can also melt butter in the microwave, but it can easily burn if you do it in one go. Cut into pieces, cover with a paper towel, and heat in ten second increments, stirring in between."
        },
        {
          "headline":"Flavor the butter.",
          "description":"You can serve plain drawn butter as a dipping sauce, but it's usually paired with other ingredients. Here's a simple, traditional sauce for lobster or other seafood:\n½ cup (120 mL) melted butter\nJuice of one lemon\nSalt and pepper to taste\nFor a spicier sauce, add 2-3 cloves crushed garlic, or replace the black pepper with cayenne."
        }
      ]
    },
    {
      "name":"Clarifying Butter",
      "steps":[
        {
          "headline":"Melt unsalted butter over low heat.",
          "description":"Cut the butter into pieces and put it in a pan with an even temperature. A heavy aluminum pan is ideal, but thin copper or aluminum pans should work as long as you do not overheat them. If your only options are cast iron or stainless steel, stir the butter frequently to distribute the heat. Do not use salted butter, as the salt will become extra concentrated during clarification. You'll lose about ¼ of the butter's volume during clarification. If the recipe calls for 1 cup drawn butter, start with 1⅓ cup butter."
        },
        {
          "headline":"Skim off the milk solids.",
          "description":"When butter melts, it separates into three components: a layer of milk solids on top, butterfat in the middle, and water at the bottom. Once the milk solids (a white foam) are floating on the surface, skim them off and set aside. You can use the milk solids to flavor popcorn or anything else that pairs well with butter."
        },
        {
          "headline":"Ladle or pour out the clarified butter.",
          "description":"The clear layer in the middle is clarified butter, or in other words pure butterfat. Transfer this to a new container. Discard the water left at the bottom of the pan."
        },
        {
          "headline":"Make ghee instead.",
          "description":"Ghee is an Indian variation on clarified butter. The process is more difficult (it's easy to burn the butter), but it adds a nutty flavor and doesn't waste any butterfat to skimming. Although traditional ghee starts with a fermented milk product, there is a common labor-saving alternative that some people use to make \"drawn butter:\"\nBring the butter to a gentle boil over medium-low heat. Wait for the foam to break apart and sink to the bottom. Turn off the heat once the bubbling has mostly stopped. This means the water has boiled away. Simmer for a little bit longer, until you see and smell the milk solids browning lightly at the base of the pan. Take care not to burn them. Pour the butter through a damp cheesecloth or coffee filter to strain out the browned solids."
        },
        {
          "headline":"Add other flavors.",
          "description":"Optionally, transfer the clarified butter to a clean pan to stir in other ingredients. One minute of sautéing with a couple cloves of finely chopped garlic adds a delicious aroma and flavor. Lemon juice, tarragon, or chives are also popular additions, as is a simple sprinkle of salt and pepper."
        }
      ]
    },
    {
      "name":"Making Beurre Monte",
      "steps":[
        {
          "headline":"Learn about beurre monte.",
          "description":"Although not nearly as common as the versions above, some chefs use the term \"drawn butter\" as a synonym for beurre monte. This is melted butter in the form of an emulsion, meaning the milk solids and liquids are distributed evenly instead of separated. This is an excellent sauce to use when poaching lobster or pan-roasting meat."
        },
        {
          "headline":"Warm a little water.",
          "description":"Heat about two tablespoons (30 mL) water in a saucepan or double boiler. Bring to a simmer, than immediately reduce heat to low. You'll need to keep the heat even at just below boiling. This is easiest in a heavy pan over a gas stove. It doesn't matter how much beurre monte you want to make — you always start out with just a little water. There's already plenty of water in the butter; you just need a little extra to get the emulsion started."
        },
        {
          "headline":"Whisk in a small cube of butter.",
          "description":"Chop the butter into small pieces. Add one of them to the water and whisk in slowly. Once melted, it should form a milky, homogenous liquid. If the mixture boils or if you stop whisking, the milk solids may separate and form a scum on the surface."
        },
        {
          "headline":"Keep whisking in butter.",
          "description":"Repeat this process, whisking in butter one chunk at a time. You can add as much butter as you like, but don't plan on saving leftovers; the sauce will separate in storage."
        },
        {
          "headline":"Fix broken sauces.",
          "description":"If the butter starts to separate, you might be able to fix the sauce:\nIf you see little droplets of fat start to form, it's just beginning to break. Stop adding butter and whisk in a little more water until the fat is mixed in. If the sauce broke completely, try vigorously whisking in a spoonful of heavy cream. If the sauce breaks after you took it off the stove, blend it with a spoonful of very hot water."
        },
        {
          "headline":"Use the beurre monte promptly.",
          "description":"It's best to use the beurre monte within the hour, before it separates. If you need to wait longer than that, cover it with a tight lid or plastic wrap, and keep in a warm place for a few hours. The ideal temperature for poaching in beurre monte is about 180ºF (80ºC). Do not let it boil, or it will separate."
        }
      ]
    }
  ],
  "text":" Making a Melted Butter Sauce Decide whether to make melted or clarified butter. \"Drawn butter\" is an ambiguous term. Depending on which chef you ask, it can mean plain melted butter or \"clarified\" butter: pure butterfat separated from the milk solids and water. Each option has its advantages:\nPlain melted butter has more flavor, making it a good dipping sauce for seafood. Read on for simple instructions and flavor ideas. Clarified butter has a more subdued flavor, which some people prefer. It also has a higher smoking point, useful for searing food. Skip ahead for the recipe. Melt the butter over low heat. Cut the butter into pieces and melt it in a pan over low heat. Stir the butter occasionally to prevent burning, especially if you have a cast iron or stainless steel pan (which tend to create hot spots). You can also melt butter in the microwave, but it can easily burn if you do it in one go. Cut into pieces, cover with a paper towel, and heat in ten second increments, stirring in between. Flavor the butter. You can serve plain drawn butter as a dipping sauce, but it's usually paired with other ingredients. Here's a simple, traditional sauce for lobster or other seafood:\n½ cup (120 mL) melted butter\nJuice of one lemon\nSalt and pepper to taste\nFor a spicier sauce, add 2-3 cloves crushed garlic, or replace the black pepper with cayenne. Clarifying Butter Melt unsalted butter over low heat. Cut the butter into pieces and put it in a pan with an even temperature. A heavy aluminum pan is ideal, but thin copper or aluminum pans should work as long as you do not overheat them. If your only options are cast iron or stainless steel, stir the butter frequently to distribute the heat. Do not use salted butter, as the salt will become extra concentrated during clarification. You'll lose about ¼ of the butter's volume during clarification. If the recipe calls for 1 cup drawn butter, start with 1⅓ cup butter. Skim off the milk solids. When butter melts, it separates into three components: a layer of milk solids on top, butterfat in the middle, and water at the bottom. Once the milk solids (a white foam) are floating on the surface, skim them off and set aside. You can use the milk solids to flavor popcorn or anything else that pairs well with butter. Ladle or pour out the clarified butter. The clear layer in the middle is clarified butter, or in other words pure butterfat. Transfer this to a new container. Discard the water left at the bottom of the pan. Make ghee instead. Ghee is an Indian variation on clarified butter. The process is more difficult (it's easy to burn the butter), but it adds a nutty flavor and doesn't waste any butterfat to skimming. Although traditional ghee starts with a fermented milk product, there is a common labor-saving alternative that some people use to make \"drawn butter:\"\nBring the butter to a gentle boil over medium-low heat. Wait for the foam to break apart and sink to the bottom. Turn off the heat once the bubbling has mostly stopped. This means the water has boiled away. Simmer for a little bit longer, until you see and smell the milk solids browning lightly at the base of the pan. Take care not to burn them. Pour the butter through a damp cheesecloth or coffee filter to strain out the browned solids. Add other flavors. Optionally, transfer the clarified butter to a clean pan to stir in other ingredients. One minute of sautéing with a couple cloves of finely chopped garlic adds a delicious aroma and flavor. Lemon juice, tarragon, or chives are also popular additions, as is a simple sprinkle of salt and pepper. Making Beurre Monte Learn about beurre monte. Although not nearly as common as the versions above, some chefs use the term \"drawn butter\" as a synonym for beurre monte. This is melted butter in the form of an emulsion, meaning the milk solids and liquids are distributed evenly instead of separated. This is an excellent sauce to use when poaching lobster or pan-roasting meat. Warm a little water. Heat about two tablespoons (30 mL) water in a saucepan or double boiler. Bring to a simmer, than immediately reduce heat to low. You'll need to keep the heat even at just below boiling. This is easiest in a heavy pan over a gas stove. It doesn't matter how much beurre monte you want to make — you always start out with just a little water. There's already plenty of water in the butter; you just need a little extra to get the emulsion started. Whisk in a small cube of butter. Chop the butter into small pieces. Add one of them to the water and whisk in slowly. Once melted, it should form a milky, homogenous liquid. If the mixture boils or if you stop whisking, the milk solids may separate and form a scum on the surface. Keep whisking in butter. Repeat this process, whisking in butter one chunk at a time. You can add as much butter as you like, but don't plan on saving leftovers; the sauce will separate in storage. Fix broken sauces. If the butter starts to separate, you might be able to fix the sauce:\nIf you see little droplets of fat start to form, it's just beginning to break. Stop adding butter and whisk in a little more water until the fat is mixed in. If the sauce broke completely, try vigorously whisking in a spoonful of heavy cream. If the sauce breaks after you took it off the stove, blend it with a spoonful of very hot water. Use the beurre monte promptly. It's best to use the beurre monte within the hour, before it separates. If you need to wait longer than that, cover it with a tight lid or plastic wrap, and keep in a warm place for a few hours. The ideal temperature for poaching in beurre monte is about 180ºF (80ºC). Do not let it boil, or it will separate.",
  "sentences":[
    " Making a Melted Butter Sauce Decide whether to make melted or clarified butter.",
    "\"Drawn butter\" is an ambiguous term.",
    "Depending on which chef you ask, it can mean plain melted butter or \"clarified\" butter: pure butterfat separated from the milk solids and water.",
    "Each option has its advantages:\nPlain melted butter has more flavor, making it a good dipping sauce for seafood.",
    "Read on for simple instructions and flavor ideas.",
    "Clarified butter has a more subdued flavor, which some people prefer.",
    "It also has a higher smoking point, useful for searing food.",
    "Skip ahead for the recipe.",
    "Melt the butter over low heat.",
    "Cut the butter into pieces and melt it in a pan over low heat.",
    "Stir the butter occasionally to prevent burning, especially if you have a cast iron or stainless steel pan (which tend to create hot spots).",
    "You can also melt butter in the microwave, but it can easily burn if you do it in one go.",
    "Cut into pieces, cover with a paper towel, and heat in ten second increments, stirring in between.",
    "Flavor the butter.",
    "You can serve plain drawn butter as a dipping sauce, but it's usually paired with other ingredients.",
    "Here's a simple, traditional sauce for lobster or other seafood:\n½ cup (120 mL) melted butter\nJuice of one lemon\nSalt and pepper to taste\nFor a spicier sauce, add 2-3 cloves crushed garlic, or replace the black pepper with cayenne.",
    "Clarifying Butter Melt unsalted butter over low heat.",
    "Cut the butter into pieces and put it in a pan with an even temperature.",
    "A heavy aluminum pan is ideal, but thin copper or aluminum pans should work as long as you do not overheat them.",
    "If your only options are cast iron or stainless steel, stir the butter frequently to distribute the heat.",
    "Do not use salted butter, as the salt will become extra concentrated during clarification.",
    "You'll lose about ¼ of the butter's volume during clarification.",
    "If the recipe calls for 1 cup drawn butter, start with 1⅓ cup butter.",
    "Skim off the milk solids.",
    "When butter melts, it separates into three components: a layer of milk solids on top, butterfat in the middle, and water at the bottom.",
    "Once the milk solids (a white foam) are floating on the surface, skim them off and set aside.",
    "You can use the milk solids to flavor popcorn or anything else that pairs well with butter.",
    "Ladle or pour out the clarified butter.",
    "The clear layer in the middle is clarified butter, or in other words pure butterfat.",
    "Transfer this to a new container.",
    "Discard the water left at the bottom of the pan.",
    "Make ghee instead.",
    "Ghee is an Indian variation on clarified butter.",
    "The process is more difficult (it's easy to burn the butter), but it adds a nutty flavor and doesn't waste any butterfat to skimming.",
    "Although traditional ghee starts with a fermented milk product, there is a common labor-saving alternative that some people use to make \"drawn butter:\"\nBring the butter to a gentle boil over medium-low heat.",
    "Wait for the foam to break apart and sink to the bottom.",
    "Turn off the heat once the bubbling has mostly stopped.",
    "This means the water has boiled away.",
    "Simmer for a little bit longer, until you see and smell the milk solids browning lightly at the base of the pan.",
    "Take care not to burn them.",
    "Pour the butter through a damp cheesecloth or coffee filter to strain out the browned solids.",
    "Add other flavors.",
    "Optionally, transfer the clarified butter to a clean pan to stir in other ingredients.",
    "One minute of sautéing with a couple cloves of finely chopped garlic adds a delicious aroma and flavor.",
    "Lemon juice, tarragon, or chives are also popular additions, as is a simple sprinkle of salt and pepper.",
    "Making Beurre Monte Learn about beurre monte.",
    "Although not nearly as common as the versions above, some chefs use the term \"drawn butter\" as a synonym for beurre monte.",
    "This is melted butter in the form of an emulsion, meaning the milk solids and liquids are distributed evenly instead of separated.",
    "This is an excellent sauce to use when poaching lobster or pan-roasting meat.",
    "Warm a little water.",
    "Heat about two tablespoons (30 mL) water in a saucepan or double boiler.",
    "Bring to a simmer, than immediately reduce heat to low.",
    "You'll need to keep the heat even at just below boiling.",
    "This is easiest in a heavy pan over a gas stove.",
    "It doesn't matter how much beurre monte you want to make — you always start out with just a little water.",
    "There's already plenty of water in the butter; you just need a little extra to get the emulsion started.",
    "Whisk in a small cube of butter.",
    "Chop the butter into small pieces.",
    "Add one of them to the water and whisk in slowly.",
    "Once melted, it should form a milky, homogenous liquid.",
    "If the mixture boils or if you stop whisking, the milk solids may separate and form a scum on the surface.",
    "Keep whisking in butter.",
    "Repeat this process, whisking in butter one chunk at a time.",
    "You can add as much butter as you like, but don't plan on saving leftovers; the sauce will separate in storage.",
    "Fix broken sauces.",
    "If the butter starts to separate, you might be able to fix the sauce:\nIf you see little droplets of fat start to form, it's just beginning to break.",
    "Stop adding butter and whisk in a little more water until the fat is mixed in.",
    "If the sauce broke completely, try vigorously whisking in a spoonful of heavy cream.",
    "If the sauce breaks after you took it off the stove, blend it with a spoonful of very hot water.",
    "Use the beurre monte promptly.",
    "It's best to use the beurre monte within the hour, before it separates.",
    "If you need to wait longer than that, cover it with a tight lid or plastic wrap, and keep in a warm place for a few hours.",
    "The ideal temperature for poaching in beurre monte is about 180ºF (80ºC).",
    "Do not let it boil, or it will separate."
  ],
  "tyn_section":[
    "Butter",
    "2 saucepans",
    "Ladle",
    "Bowl",
    "3 cloves finely chopped garlic",
    "Ground black pepper",
    "Sea salt",
    "Lemon"
  ],
  "tyn_model":[
    "butter",
    "water",
    "clarified butter",
    "milk",
    "ghee",
    "pan",
    "lemon",
    "salt",
    "beurre monte",
    "melted butter sauce",
    "drawn butter",
    "microwave",
    "paper towel",
    "melted butter",
    "pepper",
    "crushed garlic",
    "black pepper",
    "cayenne",
    "unsalted butter",
    "salted butter",
    "butterfat",
    "garlic",
    "tarragon",
    "chives",
    "salt and pepper",
    "saucepan or",
    "double boiler",
    "— you",
    "heavy cream",
    "plastic wrap"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0666666667,
    "f1":0.1052631579,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.3,
    "f1":0.375
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.3666666667,
    "f1":0.4230769231
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.1,
    "f1":0.1578947368
  }
}