{
  "title":"How to Paint a Carpeted Room",
  "url":"https://www.wikihow.com/Paint-a-Carpeted-Room",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Measure the room, taking note of the total square footage and the length of each wall or section of wall.",
      "description":""
    },
    {
      "headline":"Purchase the supplies.",
      "description":"You will need 2-inch-wide (5.08 cm) masking or painter's tape, enough plastic drop cloth sheets to cover the floor of the room, a marker, a small flathead screwdriver and a plastic 2-inch (5.08 cm) putty knife, in addition to the interior wall paint."
    },
    {
      "headline":"Mask before painting by working from the room's doorway around the outside, laying 1-foot-long (30.48 cm) strips of masking tape at the edge to protect carpet.",
      "description":"Tuck the tape over the carpet edge and just under the baseboard trim as you work. Use the putty knife to press the tape down into the space under the baseboard."
    },
    {
      "headline":"Cut pieces of plastic drop cloth to fit the length of each wall with about 6 inches to 1 foot (15.24 to 30.48 cm) of overlap at the corners.",
      "description":""
    },
    {
      "headline":"Lay out the plastic and use the masking tape to secure it to the pre-existing tape to protect carpet edges.",
      "description":"This will create a barrier of tape and plastic from the outside edge of the drop cloth to the wall."
    },
    {
      "headline":"Measure and cut plastic to protect the middle of the room.",
      "description":"Lay out and secure this plastic with more masking tape. Your carpet is now completely covered."
    },
    {
      "headline":"Remove all outlet and switch plates with the screwdriver, taking care not to allow any part of the screwdriver to touch the inside of the outlet or light switch.",
      "description":"Use the tape to secure the removed screws to the plates. Label each plate with the marker for easy replacement."
    },
    {
      "headline":"Cut in the first coat of paint with a 2-inch brush around the edges of the walls at the tops, bottoms, corners and trim pieces.",
      "description":""
    },
    {
      "headline":"Paint the large areas of wall.",
      "description":"Paint the room with a roller, taking care to keep even pressure on the roller. Overlap previous strokes and the cut-in areas."
    },
    {
      "headline":"Apply a second coat of paint to the cut-in areas, followed by a second coat on the large areas with the roller.",
      "description":""
    },
    {
      "headline":"Pull up the drop cloths and tape after the paint is completely dry, approximately 24 hours following the last application.",
      "description":""
    },
    {
      "headline":"Replace the light switch and outlet covers.",
      "description":""
    }
  ],
  "text":" Measure the room, taking note of the total square footage and the length of each wall or section of wall.  Purchase the supplies. You will need 2-inch-wide (5.08 cm) masking or painter's tape, enough plastic drop cloth sheets to cover the floor of the room, a marker, a small flathead screwdriver and a plastic 2-inch (5.08 cm) putty knife, in addition to the interior wall paint. Mask before painting by working from the room's doorway around the outside, laying 1-foot-long (30.48 cm) strips of masking tape at the edge to protect carpet. Tuck the tape over the carpet edge and just under the baseboard trim as you work. Use the putty knife to press the tape down into the space under the baseboard. Cut pieces of plastic drop cloth to fit the length of each wall with about 6 inches to 1 foot (15.24 to 30.48 cm) of overlap at the corners.  Lay out the plastic and use the masking tape to secure it to the pre-existing tape to protect carpet edges. This will create a barrier of tape and plastic from the outside edge of the drop cloth to the wall. Measure and cut plastic to protect the middle of the room. Lay out and secure this plastic with more masking tape. Your carpet is now completely covered. Remove all outlet and switch plates with the screwdriver, taking care not to allow any part of the screwdriver to touch the inside of the outlet or light switch. Use the tape to secure the removed screws to the plates. Label each plate with the marker for easy replacement. Cut in the first coat of paint with a 2-inch brush around the edges of the walls at the tops, bottoms, corners and trim pieces.  Paint the large areas of wall. Paint the room with a roller, taking care to keep even pressure on the roller. Overlap previous strokes and the cut-in areas. Apply a second coat of paint to the cut-in areas, followed by a second coat on the large areas with the roller.  Pull up the drop cloths and tape after the paint is completely dry, approximately 24 hours following the last application.  Replace the light switch and outlet covers. ",
  "sentences":[
    " Measure the room, taking note of the total square footage and the length of each wall or section of wall.",
    "Purchase the supplies.",
    "You will need 2-inch-wide (5.08 cm) masking or painter's tape, enough plastic drop cloth sheets to cover the floor of the room, a marker, a small flathead screwdriver and a plastic 2-inch (5.08 cm) putty knife, in addition to the interior wall paint.",
    "Mask before painting by working from the room's doorway around the outside, laying 1-foot-long (30.48 cm) strips of masking tape at the edge to protect carpet.",
    "Tuck the tape over the carpet edge and just under the baseboard trim as you work.",
    "Use the putty knife to press the tape down into the space under the baseboard.",
    "Cut pieces of plastic drop cloth to fit the length of each wall with about 6 inches to 1 foot (15.24 to 30.48 cm) of overlap at the corners.",
    "Lay out the plastic and use the masking tape to secure it to the pre-existing tape to protect carpet edges.",
    "This will create a barrier of tape and plastic from the outside edge of the drop cloth to the wall.",
    "Measure and cut plastic to protect the middle of the room.",
    "Lay out and secure this plastic with more masking tape.",
    "Your carpet is now completely covered.",
    "Remove all outlet and switch plates with the screwdriver, taking care not to allow any part of the screwdriver to touch the inside of the outlet or light switch.",
    "Use the tape to secure the removed screws to the plates.",
    "Label each plate with the marker for easy replacement.",
    "Cut in the first coat of paint with a 2-inch brush around the edges of the walls at the tops, bottoms, corners and trim pieces.",
    "Paint the large areas of wall.",
    "Paint the room with a roller, taking care to keep even pressure on the roller.",
    "Overlap previous strokes and the cut-in areas.",
    "Apply a second coat of paint to the cut-in areas, followed by a second coat on the large areas with the roller.",
    "Pull up the drop cloths and tape after the paint is completely dry, approximately 24 hours following the last application.",
    "Replace the light switch and outlet covers."
  ],
  "tyn_section":[
    "Interior paint",
    "Paint brushes",
    "Paint roller",
    "Plastic drop cloths",
    "Masking or painters tape in 2-inch-wide (5.08 cm) rolls",
    "Plastic 2-inch (5.08 cm) putty knife",
    "Flathead screwdriver",
    "Marker"
  ],
  "tyn_model":[
    "tape",
    "masking tape",
    "paint",
    "marker",
    "putty knife",
    "plastic",
    "roller",
    "masking or painter's tape",
    "drop cloth sheets",
    "flathead screwdriver",
    "wall paint",
    "drop cloth",
    "screwdriver",
    "drop cloths",
    "light switch"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.1333333333,
    "f1":0.1739130435,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.4,
    "f1":0.5217391304
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.6,
    "f1":0.7118644068
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.2,
    "f1":0.2608695652
  }
}