{
  "title":"How to Saute Shrimp",
  "url":"https://www.wikihow.com/Saute-Shrimp",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Making Basic Sautéed Shrimp",
      "steps":[
        {
          "headline":"Heat oil or butter over medium-high heat in a skillet.",
          "description":"Set the skillet on the stove, and add in the oil or butter. Move the skillet around so that the grease spreads across the whole pan, creating an even layer. Butter or oil will work fine, but be careful not to get the skillet too hot if you use butter, as it can burn. You can use any cooking oil you'd like, from olive oil or coconut oil to corn oil. Pick an oil that will add a little flavor. Watch for the oil or butter to move around the pan easily, as that indicates it's ready."
        },
        {
          "headline":"Add 1 pound (0.45 kg) of shrimp to the skillet.",
          "description":"Spread them out across the bottom of the skillet, giving all the shrimp plenty of room to cook. If you place them too close together, they'll steam instead of sauté. The shrimp should sizzle when they hit the oil. At this point, you can season the shrimp with salt and pepper. If your shrimp don't sizzle, the oil wasn't quite hot enough. Adjust the next time you cook shrimp by waiting a bit longer."
        },
        {
          "headline":"Cook the shrimp for 3 to 4 minutes on each side.",
          "description":"Shrimp cook fairly quickly. Wait about 3 minutes, and then flip them over to cook on the other side. Let them cook an additional 3-4 minutes, watching carefully for doneness."
        },
        {
          "headline":"Watch for the shrimp to turn a pink color.",
          "description":"Once the shrimp are done, they will become firmer in texture. They will also change from gray to a pink salmon color. That's when you know they are done! The shrimp should be opaque when they're done. They start out a little translucent. Store leftover shrimp in an airtight container in the refrigerator for up to 4 days."
        }
      ]
    },
    {
      "name":"Creating Garlic Sautéed Shrimp",
      "steps":[
        {
          "headline":"Heat the oil in the skillet over medium heat.",
          "description":"Set the skillet on the stove, and turn the burner to medium heat. Pour in the 3 tablespoons (44 mL) of oil in the skillet. Let the oil heat in the skillet for a few minutes. Wait until the oil moves around the pan easily before adding the shrimp. Swirl the pan to coat the bottom with oil."
        },
        {
          "headline":"Add the 1-2 cloves of minced garlic to the pan.",
          "description":"Let the garlic cook for about a minute or so. Garlic cooks fast, and you don't want it to burn. Keep stirring while the garlic cooks. You can use up to a ⁄4 cup (59 mL) of minced garlic if you prefer."
        },
        {
          "headline":"Pour 1 pound (0.45 kg) shrimp into the pan and season it.",
          "description":"Spread the shrimp around the pan. Stir them into the garlic and oil to lightly coat them. Sprinkle the shrimp with the salt, pepper, and the ⁄2 cup (120 mL) of chopped parsley. Stir the shrimp again. Some people cook and eat shrimp with the shell still on. It's up to your preference whether you want to do this or not. If you don't want the shell on, it's easiest to buy them already shelled. You can add more or less parsley to your taste. You can also sprinkle in dried parsley instead of the fresh parsley, using about half the amount."
        },
        {
          "headline":"Cook the shrimp 4-6 minutes until they turn pink.",
          "description":"The shrimp will change from gray, floppy, and translucent to pink, firm, and opaque. Flip them over halfway through. Keep an eye on the shrimp as it cooks fast. Stir the shrimp occasionally."
        },
        {
          "headline":"Serve with bread or over pasta.",
          "description":"You can simply serve these shrimp in a bowl with bread on the side to sop up the juice. You can also pour them over pasta for a quick and easy meal. Add a squeeze of lemon and a few pats of butter to the mixture at the end for extra flavor. Place any uneaten shrimp in an airtight container in the refrigerator for up to 4 days."
        }
      ]
    },
    {
      "name":"Cooking Cajun Sautéed Shrimp",
      "steps":[
        {
          "headline":"Toss the seasoning and 1.5 pounds (0.68 kg) shrimp in a bag.",
          "description":"Place the 3 tablespoons (44 mL) of seasoning in a zip-top bag. Dump in the shrimp. Zip the bag up, and shake the bag. Keep shaking until the shrimp are covered in seasoning. You can also make you're own seasoning with 1 teaspoon (4.9 mL) of paprika, ⁄4 teaspoon (3.7 mL) of oregano, ⁄4 teaspoon (3.7 mL) of thyme, ⁄4 teaspoon (1.2 mL) of salt, ⁄4 teaspoon (1.2 mL) of pepper, ⁄4 teaspoon (1.2 mL) of garlic powder, and ⁄4 teaspoon (1.2 mL) of cayenne pepper."
        },
        {
          "headline":"Heat 3 tablespoons (44 mL) oil in the skillet.",
          "description":"Set the oil on the stove. Turn the burner on medium to medium-high heat. Pour in the oil, and let it heat over the burner for a few minutes. When the oil is getting warm enough, it should move around the pan easily. Swirl the pan to coat the bottom. You can also drop a bit of water into the pan. If it sizzles, the pan is warm enough."
        },
        {
          "headline":"Dump the seasoned shrimp into the warm skillet.",
          "description":"The shrimp should sizzle as they hit the pan. Spread them out across the pan so they have room to cook evenly. Try to create a single layer of shrimp."
        },
        {
          "headline":"Cook the shrimp for 4-5 minutes until they turn pink.",
          "description":"The shrimp will start out gray and translucent. Flip them over about halfway through. Once they're done, they'll become opaque and firm up, as well as changing color to pink. Serve the shrimp immediately as a main course or over pasta. Store any leftover shrimp in an airtight container in the refrigerator for up to 4 days."
        }
      ]
    }
  ],
  "text":" Making Basic Sautéed Shrimp Heat oil or butter over medium-high heat in a skillet. Set the skillet on the stove, and add in the oil or butter. Move the skillet around so that the grease spreads across the whole pan, creating an even layer. Butter or oil will work fine, but be careful not to get the skillet too hot if you use butter, as it can burn. You can use any cooking oil you'd like, from olive oil or coconut oil to corn oil. Pick an oil that will add a little flavor. Watch for the oil or butter to move around the pan easily, as that indicates it's ready. Add 1 pound (0.45 kg) of shrimp to the skillet. Spread them out across the bottom of the skillet, giving all the shrimp plenty of room to cook. If you place them too close together, they'll steam instead of sauté. The shrimp should sizzle when they hit the oil. At this point, you can season the shrimp with salt and pepper. If your shrimp don't sizzle, the oil wasn't quite hot enough. Adjust the next time you cook shrimp by waiting a bit longer. Cook the shrimp for 3 to 4 minutes on each side. Shrimp cook fairly quickly. Wait about 3 minutes, and then flip them over to cook on the other side. Let them cook an additional 3-4 minutes, watching carefully for doneness. Watch for the shrimp to turn a pink color. Once the shrimp are done, they will become firmer in texture. They will also change from gray to a pink salmon color. That's when you know they are done! The shrimp should be opaque when they're done. They start out a little translucent. Store leftover shrimp in an airtight container in the refrigerator for up to 4 days. Creating Garlic Sautéed Shrimp Heat the oil in the skillet over medium heat. Set the skillet on the stove, and turn the burner to medium heat. Pour in the 3 tablespoons (44 mL) of oil in the skillet. Let the oil heat in the skillet for a few minutes. Wait until the oil moves around the pan easily before adding the shrimp. Swirl the pan to coat the bottom with oil. Add the 1-2 cloves of minced garlic to the pan. Let the garlic cook for about a minute or so. Garlic cooks fast, and you don't want it to burn. Keep stirring while the garlic cooks. You can use up to a ⁄4 cup (59 mL) of minced garlic if you prefer. Pour 1 pound (0.45 kg) shrimp into the pan and season it. Spread the shrimp around the pan. Stir them into the garlic and oil to lightly coat them. Sprinkle the shrimp with the salt, pepper, and the ⁄2 cup (120 mL) of chopped parsley. Stir the shrimp again. Some people cook and eat shrimp with the shell still on. It's up to your preference whether you want to do this or not. If you don't want the shell on, it's easiest to buy them already shelled. You can add more or less parsley to your taste. You can also sprinkle in dried parsley instead of the fresh parsley, using about half the amount. Cook the shrimp 4-6 minutes until they turn pink. The shrimp will change from gray, floppy, and translucent to pink, firm, and opaque. Flip them over halfway through. Keep an eye on the shrimp as it cooks fast. Stir the shrimp occasionally. Serve with bread or over pasta. You can simply serve these shrimp in a bowl with bread on the side to sop up the juice. You can also pour them over pasta for a quick and easy meal. Add a squeeze of lemon and a few pats of butter to the mixture at the end for extra flavor. Place any uneaten shrimp in an airtight container in the refrigerator for up to 4 days. Cooking Cajun Sautéed Shrimp Toss the seasoning and 1.5 pounds (0.68 kg) shrimp in a bag. Place the 3 tablespoons (44 mL) of seasoning in a zip-top bag. Dump in the shrimp. Zip the bag up, and shake the bag. Keep shaking until the shrimp are covered in seasoning. You can also make you're own seasoning with 1 teaspoon (4.9 mL) of paprika, ⁄4 teaspoon (3.7 mL) of oregano, ⁄4 teaspoon (3.7 mL) of thyme, ⁄4 teaspoon (1.2 mL) of salt, ⁄4 teaspoon (1.2 mL) of pepper, ⁄4 teaspoon (1.2 mL) of garlic powder, and ⁄4 teaspoon (1.2 mL) of cayenne pepper. Heat 3 tablespoons (44 mL) oil in the skillet. Set the oil on the stove. Turn the burner on medium to medium-high heat. Pour in the oil, and let it heat over the burner for a few minutes. When the oil is getting warm enough, it should move around the pan easily. Swirl the pan to coat the bottom. You can also drop a bit of water into the pan. If it sizzles, the pan is warm enough. Dump the seasoned shrimp into the warm skillet. The shrimp should sizzle as they hit the pan. Spread them out across the pan so they have room to cook evenly. Try to create a single layer of shrimp. Cook the shrimp for 4-5 minutes until they turn pink. The shrimp will start out gray and translucent. Flip them over about halfway through. Once they're done, they'll become opaque and firm up, as well as changing color to pink. Serve the shrimp immediately as a main course or over pasta. Store any leftover shrimp in an airtight container in the refrigerator for up to 4 days.",
  "sentences":[
    " Making Basic Sautéed Shrimp Heat oil or butter over medium-high heat in a skillet.",
    "Set the skillet on the stove, and add in the oil or butter.",
    "Move the skillet around so that the grease spreads across the whole pan, creating an even layer.",
    "Butter or oil will work fine, but be careful not to get the skillet too hot if you use butter, as it can burn.",
    "You can use any cooking oil you'd like, from olive oil or coconut oil to corn oil.",
    "Pick an oil that will add a little flavor.",
    "Watch for the oil or butter to move around the pan easily, as that indicates it's ready.",
    "Add 1 pound (0.45 kg) of shrimp to the skillet.",
    "Spread them out across the bottom of the skillet, giving all the shrimp plenty of room to cook.",
    "If you place them too close together, they'll steam instead of sauté.",
    "The shrimp should sizzle when they hit the oil.",
    "At this point, you can season the shrimp with salt and pepper.",
    "If your shrimp don't sizzle, the oil wasn't quite hot enough.",
    "Adjust the next time you cook shrimp by waiting a bit longer.",
    "Cook the shrimp for 3 to 4 minutes on each side.",
    "Shrimp cook fairly quickly.",
    "Wait about 3 minutes, and then flip them over to cook on the other side.",
    "Let them cook an additional 3-4 minutes, watching carefully for doneness.",
    "Watch for the shrimp to turn a pink color.",
    "Once the shrimp are done, they will become firmer in texture.",
    "They will also change from gray to a pink salmon color.",
    "That's when you know they are done!",
    "The shrimp should be opaque when they're done.",
    "They start out a little translucent.",
    "Store leftover shrimp in an airtight container in the refrigerator for up to 4 days.",
    "Creating Garlic Sautéed Shrimp Heat the oil in the skillet over medium heat.",
    "Set the skillet on the stove, and turn the burner to medium heat.",
    "Pour in the 3 tablespoons (44 mL) of oil in the skillet.",
    "Let the oil heat in the skillet for a few minutes.",
    "Wait until the oil moves around the pan easily before adding the shrimp.",
    "Swirl the pan to coat the bottom with oil.",
    "Add the 1-2 cloves of minced garlic to the pan.",
    "Let the garlic cook for about a minute or so.",
    "Garlic cooks fast, and you don't want it to burn.",
    "Keep stirring while the garlic cooks.",
    "You can use up to a ⁄4 cup (59 mL) of minced garlic if you prefer.",
    "Pour 1 pound (0.45 kg) shrimp into the pan and season it.",
    "Spread the shrimp around the pan.",
    "Stir them into the garlic and oil to lightly coat them.",
    "Sprinkle the shrimp with the salt, pepper, and the ⁄2 cup (120 mL) of chopped parsley.",
    "Stir the shrimp again.",
    "Some people cook and eat shrimp with the shell still on.",
    "It's up to your preference whether you want to do this or not.",
    "If you don't want the shell on, it's easiest to buy them already shelled.",
    "You can add more or less parsley to your taste.",
    "You can also sprinkle in dried parsley instead of the fresh parsley, using about half the amount.",
    "Cook the shrimp 4-6 minutes until they turn pink.",
    "The shrimp will change from gray, floppy, and translucent to pink, firm, and opaque.",
    "Flip them over halfway through.",
    "Keep an eye on the shrimp as it cooks fast.",
    "Stir the shrimp occasionally.",
    "Serve with bread or over pasta.",
    "You can simply serve these shrimp in a bowl with bread on the side to sop up the juice.",
    "You can also pour them over pasta for a quick and easy meal.",
    "Add a squeeze of lemon and a few pats of butter to the mixture at the end for extra flavor.",
    "Place any uneaten shrimp in an airtight container in the refrigerator for up to 4 days.",
    "Cooking Cajun Sautéed Shrimp Toss the seasoning and 1.5 pounds (0.68 kg) shrimp in a bag.",
    "Place the 3 tablespoons (44 mL) of seasoning in a zip-top bag.",
    "Dump in the shrimp.",
    "Zip the bag up, and shake the bag.",
    "Keep shaking until the shrimp are covered in seasoning.",
    "You can also make you're own seasoning with 1 teaspoon (4.9 mL) of paprika, ⁄4 teaspoon (3.7 mL) of oregano, ⁄4 teaspoon (3.7 mL) of thyme, ⁄4 teaspoon (1.2 mL) of salt, ⁄4 teaspoon (1.2 mL) of pepper, ⁄4 teaspoon (1.2 mL) of garlic powder, and ⁄4 teaspoon (1.2 mL) of cayenne pepper.",
    "Heat 3 tablespoons (44 mL) oil in the skillet.",
    "Set the oil on the stove.",
    "Turn the burner on medium to medium-high heat.",
    "Pour in the oil, and let it heat over the burner for a few minutes.",
    "When the oil is getting warm enough, it should move around the pan easily.",
    "Swirl the pan to coat the bottom.",
    "You can also drop a bit of water into the pan.",
    "If it sizzles, the pan is warm enough.",
    "Dump the seasoned shrimp into the warm skillet.",
    "The shrimp should sizzle as they hit the pan.",
    "Spread them out across the pan so they have room to cook evenly.",
    "Try to create a single layer of shrimp.",
    "Cook the shrimp for 4-5 minutes until they turn pink.",
    "The shrimp will start out gray and translucent.",
    "Flip them over about halfway through.",
    "Once they're done, they'll become opaque and firm up, as well as changing color to pink.",
    "Serve the shrimp immediately as a main course or over pasta.",
    "Store any leftover shrimp in an airtight container in the refrigerator for up to 4 days."
  ],
  "tyn_section":[
    "Sauté or frying pan",
    "Stove",
    "Butter",
    "Garlic",
    "Seasoning"
  ],
  "tyn_model":[
    "shrimp",
    "oil",
    "skillet",
    "butter",
    "garlic",
    "parsley",
    "stove",
    "airtight container",
    "minced garlic",
    "salt",
    "pepper",
    "pasta",
    "refrigerator",
    "seasoning",
    "oil or butter",
    "cooking oil",
    "olive oil",
    "coconut oil",
    "salt and pepper",
    "bowl",
    "lemon",
    "zip-top bag",
    "paprika",
    "oregano",
    "thyme",
    "garlic powder",
    "cayenne pepper",
    "water",
    "pan"
  ],
  "simple_metrics":{
    "r":0.8,
    "p":0.1379310345,
    "f1":0.2352941176,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.2068965517,
    "f1":0.3287671233
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.2413793103,
    "f1":0.3708609272
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8,
    "p":0.1379310345,
    "f1":0.2352941176
  }
}