{
  "title":"How to Make Laundry Smell Good",
  "url":"https://www.wikihow.com/Make-Laundry-Smell-Good",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Treating Laundry Odors"
  ],
  "methods":[
    {
      "name":"Scenting Your Laundry",
      "steps":[
        {
          "headline":"Spray your dirty laundry with essential oil.",
          "description":"Add a few drops of your favorite scented oil to a small spray bottle. Fill it with water and give it a few shakes. Mist your dirty clothes with it before adding them to the washer."
        },
        {
          "headline":"Use scented detergents or laundry soap.",
          "description":"Laundry detergents come in a variety of scents, so go with whichever one appeals to you most. However, be aware that scented varieties may leave behind more residue than non-scented detergents, which can lead to mildew in your machine. As an alternative, try using a laundry soap that is scented naturally, without additional chemicals, like Dr. Bonner’s Peppermint Laundry Soap."
        },
        {
          "headline":"Make your own scented dryer sheets.",
          "description":"Choose a scrap piece of cotton to use (such as a piece of an old hand towel, sheet, or shirt). Give it a soak under running water so it’s totally wet. Then squeeze out the excess liquid. Give it about a half dozen drops of your prefered scented essential oil. Add it to your dryer’s load in the last ten minutes of the dry cycle to scent your clothes. You should be able to reuse the sheet a few times without having to do anything more than soak and wring it before each use. Give it a sniff after each use to judge the scent’s strength. If it’s weak or undetectable, include it in your next wash cycle and then add more drops afterward. Alternatively, you could do the same with wool dryer balls if you already use those."
        },
        {
          "headline":"Dry clothes thoroughly.",
          "description":"Whether you air-dry them or toss them in the dryer, make sure they aren’t damp at all before folding them up and putting them away. Expect mildew to take advantage of any lingering moisture, no matter how small of an amount it might. Leave the clothes hanging or restart the dryer if they feel even the tiniest bit wet."
        }
      ]
    },
    {
      "name":"Eliminating Mildew Odors",
      "steps":[
        {
          "headline":"Wash wet clothes right away.",
          "description":"Remember that mildew starts to grow wherever moisture is present. Be aware that damp dirty clothing can start to stink up before it ever makes it to the washer, even if it didn’t smell bad when you first stripped it off. Use wet clothes as an excuse to start a load as soon as you take them off. If this isn’t possible, don’t ball up your wet clothes and dump them in the hamper. Let them air-dry on a hanger, drying rack, or clothesline before adding them to your other dirty laundry."
        },
        {
          "headline":"Rewash clean clothes left in the washer.",
          "description":"If you forgot all about your last load sitting in the washer, wash it a second time to get rid of any funky smells that may have developed in the meantime. Use the highest temperature possible that’s still safe for your fabrics. Instead of detergent, however, choose between adding color-safe bleach or chlorine to kill the mildew and eliminate that smell. Or, if you want to avoid chemical products, use plain white vinegar instead. These all smell pretty strong in their own right, so you may need to wash your clothes a third time with laundry detergent to get rid of any residual smells."
        },
        {
          "headline":"Prevent mildew with lavender essential oil.",
          "description":"If you’re really prone to forgetting about that last load in your washer, take preemptive action. Add several drops of lavender essential oil to your load when pouring in the detergent at the start of your cycle. Use this mold-resistant product to protect your clothes from developing mildew for longer. This can stall mildew from growing for at least a couple of days."
        },
        {
          "headline":"Deodorize your machine.",
          "description":"If the washer itself is the smelly culprit, fill the drum with hot water. Add 2 cups of white vinegar. Let the water sit for 30 minutes or so. Then start a regular wash cycle without adding any laundry. Give it a test sniff once it’s done and repeat if necessary."
        },
        {
          "headline":"Air your washer out after each use.",
          "description":"Remember that mildew loves moisture and darkness. So don’t shut your washer’s lid or door once you empty it. Either leave it open all the time for more air circulation and light, or give it at least the length of your dryer’s cycle to air out before you close it."
        },
        {
          "headline":"Cut back on the detergent if needed.",
          "description":"If the washer tends to stink up on its own pretty frequently, reduce the amount of liquid detergent and fabric softener that you use. Keep in mind that these are thicker than water and don’t always dissolve all the way during a wash cycle. This means that residue is left inside your machine, which can be a breeding ground for mildew. Remember that many detergents are concentrated, so you only need a little bit. If you experience buildup in your machine, check the detergent's directions for recommended amounts."
        }
      ]
    },
    {
      "name":"Dealing with Particularly Stinky Clothes",
      "steps":[
        {
          "headline":"Separate these from other clothes.",
          "description":"If a used article smells strongly of some offensive odor, don’t throw it in the hamper with the rest of your dirty laundry. Store it separately until it’s time to wash it. Prevent your other clothes from picking up the foul smell. Seal it in an airtight container if you’re worried about the offending article stinking up the whole room."
        },
        {
          "headline":"Wash in small loads.",
          "description":"Don’t fill the washer’s drum all the way to the top with laundry if you have any clothes that smell particularly gross. Keep those articles more accessible to water and detergent by washing them in smaller loads. If you have a bunch of smelly clothes, wash them together as one small load (or break them up into multiple small loads if you really have a lot). If you only have one or two stinky articles, however, either:\nWash them by themselves with no other dirty clothes. Wash them with a small load of smaller articles, like socks."
        },
        {
          "headline":"Presoak them in dish soap.",
          "description":"If the article in question has picked up a general odor like cigarette smoke or fish (as opposed to a smell emanating from a localized stain), squeeze some drops of dish soap into a container large enough to hold it. Then fill it with warm water. Add the clothes and let them soak for roughly ten minutes. Then:\nPour all the contents (soap, water, and clothes) into your washer. Stir them around by hand and then let the clothes sit for a half hour. Add detergent and start the appropriate wash cycle for that article, including a spin cycle to dry. Use the hottest water that your clothes’ fabric-care tag recommends."
        },
        {
          "headline":"Pretreat smelly stains.",
          "description":"If the odor is due to a localized stain (as it would be with, say, a dirty diaper), create a thick paste by mixing baking soda with water. Depending on the size of the stain(s), start with a tablespoon of baking soda. Stir in just enough water to hydrate all of the baking soda without dissolving any so you can still spread the paste around easily. Then:\nSpread the paste over the stain and give it about ten minutes to set in. Add the clothes with the paste still on them to the washer, plus 1 cup of white vinegar. Start the appropriate wash cycle for that item, including a spin cycle, with the hottest water that your fabric allows. Repeat if the odor is still detectable afterward."
        }
      ]
    },
    {
      "name":"Keeping Clean Laundry Smelling Top Notch",
      "steps":[
        {
          "headline":"Air-dry your wet laundry if possible.",
          "description":"Hang your laundry to dry on a clothesline outside once they’ve finished washing. Freshen your clothes with more sunlight and air circulation than a dryer allows. This is an especially good idea if any articles were particularly stinky to begin with. Of course, this is only a good idea if outside is smelling nice and fresh. So if your neighbor is smoking meats for a barbecue or something like that, stick to the dryer instead."
        },
        {
          "headline":"Scent your drawers and closets with soap.",
          "description":"Choose a strongly-scented bar of soap to store with your clean laundry to make them smell fresh and clean long after they’ve been washed. Simply place the soap in a cotton muslin bag or stitch together a pouch for it using a similarly light fabric that will allow the scent to escape. Then place one in each drawer to your dresser, as well as your closet."
        },
        {
          "headline":"Fill cotton bags with herbs.",
          "description":"If the smell of soap isn’t something you want to carry with you, try filling cotton muslin bags with your favorite herb(s) instead. Store these in your drawers and closets to scent your clothes. Additionally, fill some bags that are small enough to fit in the pockets of whichever clothes you wear the least to keep smelling nice for longer periods."
        },
        {
          "headline":"Spritz your clothes with a fabric spray.",
          "description":"Keep your clothes smelling sharp with a scented fabric spray. Use a store-bought product like Febreeze if that suits your fancy. Or, make your own by filling a spray bottle with water and adding some drops of your favorite essential oil. Some essential oils may stain white or light fabrics. Before spritzing your whole wardrobe, do a test spray on an article that you don’t care about to make sure it won’t do so."
        },
        {
          "headline":"Deodorize your closet and drawers.",
          "description":"If your closet or dresser has its own distinct smell that you’d like to keep out of your clothes, open a box of baking soda and keep that inside to absorb the closet or dresser’s odor. Alternatively, try filling an open container with coffee grounds and use that instead. Either way, replace it periodically (about once a month) since these can only absorb so much."
        }
      ]
    }
  ],
  "text":" Scenting Your Laundry Spray your dirty laundry with essential oil. Add a few drops of your favorite scented oil to a small spray bottle. Fill it with water and give it a few shakes. Mist your dirty clothes with it before adding them to the washer. Use scented detergents or laundry soap. Laundry detergents come in a variety of scents, so go with whichever one appeals to you most. However, be aware that scented varieties may leave behind more residue than non-scented detergents, which can lead to mildew in your machine. As an alternative, try using a laundry soap that is scented naturally, without additional chemicals, like Dr. Bonner’s Peppermint Laundry Soap. Make your own scented dryer sheets. Choose a scrap piece of cotton to use (such as a piece of an old hand towel, sheet, or shirt). Give it a soak under running water so it’s totally wet. Then squeeze out the excess liquid. Give it about a half dozen drops of your prefered scented essential oil. Add it to your dryer’s load in the last ten minutes of the dry cycle to scent your clothes. You should be able to reuse the sheet a few times without having to do anything more than soak and wring it before each use. Give it a sniff after each use to judge the scent’s strength. If it’s weak or undetectable, include it in your next wash cycle and then add more drops afterward. Alternatively, you could do the same with wool dryer balls if you already use those. Dry clothes thoroughly. Whether you air-dry them or toss them in the dryer, make sure they aren’t damp at all before folding them up and putting them away. Expect mildew to take advantage of any lingering moisture, no matter how small of an amount it might. Leave the clothes hanging or restart the dryer if they feel even the tiniest bit wet. Eliminating Mildew Odors Wash wet clothes right away. Remember that mildew starts to grow wherever moisture is present. Be aware that damp dirty clothing can start to stink up before it ever makes it to the washer, even if it didn’t smell bad when you first stripped it off. Use wet clothes as an excuse to start a load as soon as you take them off. If this isn’t possible, don’t ball up your wet clothes and dump them in the hamper. Let them air-dry on a hanger, drying rack, or clothesline before adding them to your other dirty laundry. Rewash clean clothes left in the washer. If you forgot all about your last load sitting in the washer, wash it a second time to get rid of any funky smells that may have developed in the meantime. Use the highest temperature possible that’s still safe for your fabrics. Instead of detergent, however, choose between adding color-safe bleach or chlorine to kill the mildew and eliminate that smell. Or, if you want to avoid chemical products, use plain white vinegar instead. These all smell pretty strong in their own right, so you may need to wash your clothes a third time with laundry detergent to get rid of any residual smells. Prevent mildew with lavender essential oil. If you’re really prone to forgetting about that last load in your washer, take preemptive action. Add several drops of lavender essential oil to your load when pouring in the detergent at the start of your cycle. Use this mold-resistant product to protect your clothes from developing mildew for longer. This can stall mildew from growing for at least a couple of days. Deodorize your machine. If the washer itself is the smelly culprit, fill the drum with hot water. Add 2 cups of white vinegar. Let the water sit for 30 minutes or so. Then start a regular wash cycle without adding any laundry. Give it a test sniff once it’s done and repeat if necessary. Air your washer out after each use. Remember that mildew loves moisture and darkness. So don’t shut your washer’s lid or door once you empty it. Either leave it open all the time for more air circulation and light, or give it at least the length of your dryer’s cycle to air out before you close it. Cut back on the detergent if needed. If the washer tends to stink up on its own pretty frequently, reduce the amount of liquid detergent and fabric softener that you use. Keep in mind that these are thicker than water and don’t always dissolve all the way during a wash cycle. This means that residue is left inside your machine, which can be a breeding ground for mildew. Remember that many detergents are concentrated, so you only need a little bit. If you experience buildup in your machine, check the detergent's directions for recommended amounts. Dealing with Particularly Stinky Clothes Separate these from other clothes. If a used article smells strongly of some offensive odor, don’t throw it in the hamper with the rest of your dirty laundry. Store it separately until it’s time to wash it. Prevent your other clothes from picking up the foul smell. Seal it in an airtight container if you’re worried about the offending article stinking up the whole room. Wash in small loads. Don’t fill the washer’s drum all the way to the top with laundry if you have any clothes that smell particularly gross. Keep those articles more accessible to water and detergent by washing them in smaller loads. If you have a bunch of smelly clothes, wash them together as one small load (or break them up into multiple small loads if you really have a lot). If you only have one or two stinky articles, however, either:\nWash them by themselves with no other dirty clothes. Wash them with a small load of smaller articles, like socks. Presoak them in dish soap. If the article in question has picked up a general odor like cigarette smoke or fish (as opposed to a smell emanating from a localized stain), squeeze some drops of dish soap into a container large enough to hold it. Then fill it with warm water. Add the clothes and let them soak for roughly ten minutes. Then:\nPour all the contents (soap, water, and clothes) into your washer. Stir them around by hand and then let the clothes sit for a half hour. Add detergent and start the appropriate wash cycle for that article, including a spin cycle to dry. Use the hottest water that your clothes’ fabric-care tag recommends. Pretreat smelly stains. If the odor is due to a localized stain (as it would be with, say, a dirty diaper), create a thick paste by mixing baking soda with water. Depending on the size of the stain(s), start with a tablespoon of baking soda. Stir in just enough water to hydrate all of the baking soda without dissolving any so you can still spread the paste around easily. Then:\nSpread the paste over the stain and give it about ten minutes to set in. Add the clothes with the paste still on them to the washer, plus 1 cup of white vinegar. Start the appropriate wash cycle for that item, including a spin cycle, with the hottest water that your fabric allows. Repeat if the odor is still detectable afterward. Keeping Clean Laundry Smelling Top Notch Air-dry your wet laundry if possible. Hang your laundry to dry on a clothesline outside once they’ve finished washing. Freshen your clothes with more sunlight and air circulation than a dryer allows. This is an especially good idea if any articles were particularly stinky to begin with. Of course, this is only a good idea if outside is smelling nice and fresh. So if your neighbor is smoking meats for a barbecue or something like that, stick to the dryer instead. Scent your drawers and closets with soap. Choose a strongly-scented bar of soap to store with your clean laundry to make them smell fresh and clean long after they’ve been washed. Simply place the soap in a cotton muslin bag or stitch together a pouch for it using a similarly light fabric that will allow the scent to escape. Then place one in each drawer to your dresser, as well as your closet. Fill cotton bags with herbs. If the smell of soap isn’t something you want to carry with you, try filling cotton muslin bags with your favorite herb(s) instead. Store these in your drawers and closets to scent your clothes. Additionally, fill some bags that are small enough to fit in the pockets of whichever clothes you wear the least to keep smelling nice for longer periods. Spritz your clothes with a fabric spray. Keep your clothes smelling sharp with a scented fabric spray. Use a store-bought product like Febreeze if that suits your fancy. Or, make your own by filling a spray bottle with water and adding some drops of your favorite essential oil. Some essential oils may stain white or light fabrics. Before spritzing your whole wardrobe, do a test spray on an article that you don’t care about to make sure it won’t do so. Deodorize your closet and drawers. If your closet or dresser has its own distinct smell that you’d like to keep out of your clothes, open a box of baking soda and keep that inside to absorb the closet or dresser’s odor. Alternatively, try filling an open container with coffee grounds and use that instead. Either way, replace it periodically (about once a month) since these can only absorb so much.",
  "sentences":[
    " Scenting Your Laundry Spray your dirty laundry with essential oil.",
    "Add a few drops of your favorite scented oil to a small spray bottle.",
    "Fill it with water and give it a few shakes.",
    "Mist your dirty clothes with it before adding them to the washer.",
    "Use scented detergents or laundry soap.",
    "Laundry detergents come in a variety of scents, so go with whichever one appeals to you most.",
    "However, be aware that scented varieties may leave behind more residue than non-scented detergents, which can lead to mildew in your machine.",
    "As an alternative, try using a laundry soap that is scented naturally, without additional chemicals, like Dr. Bonner’s Peppermint Laundry Soap.",
    "Make your own scented dryer sheets.",
    "Choose a scrap piece of cotton to use (such as a piece of an old hand towel, sheet, or shirt).",
    "Give it a soak under running water so it’s totally wet.",
    "Then squeeze out the excess liquid.",
    "Give it about a half dozen drops of your prefered scented essential oil.",
    "Add it to your dryer’s load in the last ten minutes of the dry cycle to scent your clothes.",
    "You should be able to reuse the sheet a few times without having to do anything more than soak and wring it before each use.",
    "Give it a sniff after each use to judge the scent’s strength.",
    "If it’s weak or undetectable, include it in your next wash cycle and then add more drops afterward.",
    "Alternatively, you could do the same with wool dryer balls if you already use those.",
    "Dry clothes thoroughly.",
    "Whether you air-dry them or toss them in the dryer, make sure they aren’t damp at all before folding them up and putting them away.",
    "Expect mildew to take advantage of any lingering moisture, no matter how small of an amount it might.",
    "Leave the clothes hanging or restart the dryer if they feel even the tiniest bit wet.",
    "Eliminating Mildew Odors Wash wet clothes right away.",
    "Remember that mildew starts to grow wherever moisture is present.",
    "Be aware that damp dirty clothing can start to stink up before it ever makes it to the washer, even if it didn’t smell bad when you first stripped it off.",
    "Use wet clothes as an excuse to start a load as soon as you take them off.",
    "If this isn’t possible, don’t ball up your wet clothes and dump them in the hamper.",
    "Let them air-dry on a hanger, drying rack, or clothesline before adding them to your other dirty laundry.",
    "Rewash clean clothes left in the washer.",
    "If you forgot all about your last load sitting in the washer, wash it a second time to get rid of any funky smells that may have developed in the meantime.",
    "Use the highest temperature possible that’s still safe for your fabrics.",
    "Instead of detergent, however, choose between adding color-safe bleach or chlorine to kill the mildew and eliminate that smell.",
    "Or, if you want to avoid chemical products, use plain white vinegar instead.",
    "These all smell pretty strong in their own right, so you may need to wash your clothes a third time with laundry detergent to get rid of any residual smells.",
    "Prevent mildew with lavender essential oil.",
    "If you’re really prone to forgetting about that last load in your washer, take preemptive action.",
    "Add several drops of lavender essential oil to your load when pouring in the detergent at the start of your cycle.",
    "Use this mold-resistant product to protect your clothes from developing mildew for longer.",
    "This can stall mildew from growing for at least a couple of days.",
    "Deodorize your machine.",
    "If the washer itself is the smelly culprit, fill the drum with hot water.",
    "Add 2 cups of white vinegar.",
    "Let the water sit for 30 minutes or so.",
    "Then start a regular wash cycle without adding any laundry.",
    "Give it a test sniff once it’s done and repeat if necessary.",
    "Air your washer out after each use.",
    "Remember that mildew loves moisture and darkness.",
    "So don’t shut your washer’s lid or door once you empty it.",
    "Either leave it open all the time for more air circulation and light, or give it at least the length of your dryer’s cycle to air out before you close it.",
    "Cut back on the detergent if needed.",
    "If the washer tends to stink up on its own pretty frequently, reduce the amount of liquid detergent and fabric softener that you use.",
    "Keep in mind that these are thicker than water and don’t always dissolve all the way during a wash cycle.",
    "This means that residue is left inside your machine, which can be a breeding ground for mildew.",
    "Remember that many detergents are concentrated, so you only need a little bit.",
    "If you experience buildup in your machine, check the detergent's directions for recommended amounts.",
    "Dealing with Particularly Stinky Clothes Separate these from other clothes.",
    "If a used article smells strongly of some offensive odor, don’t throw it in the hamper with the rest of your dirty laundry.",
    "Store it separately until it’s time to wash it.",
    "Prevent your other clothes from picking up the foul smell.",
    "Seal it in an airtight container if you’re worried about the offending article stinking up the whole room.",
    "Wash in small loads.",
    "Don’t fill the washer’s drum all the way to the top with laundry if you have any clothes that smell particularly gross.",
    "Keep those articles more accessible to water and detergent by washing them in smaller loads.",
    "If you have a bunch of smelly clothes, wash them together as one small load (or break them up into multiple small loads if you really have a lot).",
    "If you only have one or two stinky articles, however, either:\nWash them by themselves with no other dirty clothes.",
    "Wash them with a small load of smaller articles, like socks.",
    "Presoak them in dish soap.",
    "If the article in question has picked up a general odor like cigarette smoke or fish (as opposed to a smell emanating from a localized stain), squeeze some drops of dish soap into a container large enough to hold it.",
    "Then fill it with warm water.",
    "Add the clothes and let them soak for roughly ten minutes.",
    "Then:\nPour all the contents (soap, water, and clothes) into your washer.",
    "Stir them around by hand and then let the clothes sit for a half hour.",
    "Add detergent and start the appropriate wash cycle for that article, including a spin cycle to dry.",
    "Use the hottest water that your clothes’ fabric-care tag recommends.",
    "Pretreat smelly stains.",
    "If the odor is due to a localized stain (as it would be with, say, a dirty diaper), create a thick paste by mixing baking soda with water.",
    "Depending on the size of the stain(s), start with a tablespoon of baking soda.",
    "Stir in just enough water to hydrate all of the baking soda without dissolving any so you can still spread the paste around easily.",
    "Then:\nSpread the paste over the stain and give it about ten minutes to set in.",
    "Add the clothes with the paste still on them to the washer, plus 1 cup of white vinegar.",
    "Start the appropriate wash cycle for that item, including a spin cycle, with the hottest water that your fabric allows.",
    "Repeat if the odor is still detectable afterward.",
    "Keeping Clean Laundry Smelling Top Notch Air-dry your wet laundry if possible.",
    "Hang your laundry to dry on a clothesline outside once they’ve finished washing.",
    "Freshen your clothes with more sunlight and air circulation than a dryer allows.",
    "This is an especially good idea if any articles were particularly stinky to begin with.",
    "Of course, this is only a good idea if outside is smelling nice and fresh.",
    "So if your neighbor is smoking meats for a barbecue or something like that, stick to the dryer instead.",
    "Scent your drawers and closets with soap.",
    "Choose a strongly-scented bar of soap to store with your clean laundry to make them smell fresh and clean long after they’ve been washed.",
    "Simply place the soap in a cotton muslin bag or stitch together a pouch for it using a similarly light fabric that will allow the scent to escape.",
    "Then place one in each drawer to your dresser, as well as your closet.",
    "Fill cotton bags with herbs.",
    "If the smell of soap isn’t something you want to carry with you, try filling cotton muslin bags with your favorite herb(s) instead.",
    "Store these in your drawers and closets to scent your clothes.",
    "Additionally, fill some bags that are small enough to fit in the pockets of whichever clothes you wear the least to keep smelling nice for longer periods.",
    "Spritz your clothes with a fabric spray.",
    "Keep your clothes smelling sharp with a scented fabric spray.",
    "Use a store-bought product like Febreeze if that suits your fancy.",
    "Or, make your own by filling a spray bottle with water and adding some drops of your favorite essential oil.",
    "Some essential oils may stain white or light fabrics.",
    "Before spritzing your whole wardrobe, do a test spray on an article that you don’t care about to make sure it won’t do so.",
    "Deodorize your closet and drawers.",
    "If your closet or dresser has its own distinct smell that you’d like to keep out of your clothes, open a box of baking soda and keep that inside to absorb the closet or dresser’s odor.",
    "Alternatively, try filling an open container with coffee grounds and use that instead.",
    "Either way, replace it periodically (about once a month) since these can only absorb so much."
  ],
  "tyn_section":[
    "Washer",
    "Dryer and/or clothesline",
    "White vinegar",
    "Baking soda",
    "Laundry detergent",
    "Dish soap (optional)",
    "Essential oils (optional)",
    "Containers (optional)",
    "Bar(s) of soap (optional)",
    "Cotton muslin bags (optional)",
    "Herbs (optional)",
    "Fabric spray (optional)",
    "Coffee grounds (optional)"
  ],
  "tyn_model":[
    "water",
    "washer",
    "dryer",
    "detergent",
    "soap",
    "baking soda",
    "essential oil",
    "white vinegar",
    "laundry",
    "spray bottle",
    "laundry soap",
    "lavender essential oil",
    "dish soap",
    "scented oil",
    "scented detergents",
    "scented dryer sheets",
    "wool dryer balls",
    "clothes",
    "drying rack",
    "bleach",
    "chlorine",
    "laundry detergent",
    "liquid detergent",
    "fabric softener",
    "detergents",
    "airtight container",
    "’ fabric",
    "herbs",
    "cotton muslin bags",
    "fabric spray",
    "scented fabric spray",
    "febreeze",
    "essential oils",
    "coffee grounds"
  ],
  "simple_metrics":{
    "r":0.3076923077,
    "p":0.1176470588,
    "f1":0.170212766,
    "avg_pos":0.0294117647
  },
  "jacc_metrics_0.5":{
    "r":0.7692307692,
    "p":0.3823529412,
    "f1":0.510805501
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8461538462,
    "p":0.5,
    "f1":0.6285714286
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6923076923,
    "p":0.2647058824,
    "f1":0.3829787234
  }
}