{
  "title":"How to Clean Grill Grates",
  "url":"https://www.wikihow.com/Clean-Grill-Grates",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Cleaning Porcelain Grates",
      "steps":[
        {
          "headline":"Read your owner's manual.",
          "description":"Porcelain coating is very fragile and easily damaged from scrubbing and scraping. Follow the manufacturer's instructions to the letter. Otherwise, you could void your warranty."
        },
        {
          "headline":"Use a nylon scrubber brush while the grill is still hot.",
          "description":"Avoid a brass brush, which can scrape the coating off the grate. Opt for a curved brush that can get in between the grating. Gently scrape in a diagonal motion. Start at the point closest to you and move upward. Move in one direction to minimize the risk of damage to the coating. If you have built-up gunk like barbecue sauce, wet the brush before scrubbing."
        },
        {
          "headline":"Clean the underside of the grill.",
          "description":"Flip the grill over after it has cooled. Scrape away excess food and gunk with the brush using a diagonal motion. The underside will take somewhat longer to clean because of the drippings that accumulated during cooking. Scrub until the grate is completely clean. If your grate comes in multiple sections, flip and clean each part separately."
        }
      ]
    },
    {
      "name":"Cleaning Stainless Steel and Cast Iron Grates",
      "steps":[
        {
          "headline":"Opt for a stainless steel grill brush.",
          "description":"The bristles are soft enough to protect the surface of the grate. Choose between a roll brush or a straight brush. Both will clean the grill effectively, but the roll brush will more easily clean the sides of the grates."
        },
        {
          "headline":"Keep the grill hot.",
          "description":"This will soften any leftover grease and make it easier to clean up. Turn the grill to its “high” setting if it's not at that setting already. Let it heat up for 10 to 15 minutes, or until the temperature gauge reaches 500 to 600 °F (260 to 316 °C). Then, turn off the burners."
        },
        {
          "headline":"Scrub the grate.",
          "description":"Scrub using a back-and-forth motion along the first bar. Continue until the bar is free of grease and food particles. Repeat the process on the rest of the grate."
        },
        {
          "headline":"Apply vegetable oil to the grate.",
          "description":"Dip the towel into a container of the oil to pick up about a teaspoon (5 mL). Place the towel in a pair of tongs and wipe it along each bar. This will prevent your grate from rusting. Don't apply more than a teaspoon of oil. Too much can cause a dangerous flare-up if it drips onto any smoldering food particles below the grate."
        }
      ]
    },
    {
      "name":"Deep Cleaning Grill Grates",
      "steps":[
        {
          "headline":"Soak the grates in a vinegar solution.",
          "description":"Mix one cup (237 g) of vinegar and two cups (474 g) of baking soda. Pour the solution into a garbage bag or container large enough to fit the grates. Place the grates in the solution and allow them to soak overnight. Place a cover on the container. If you use a garbage bag, fasten it with a rubber band."
        },
        {
          "headline":"Remove and rinse the grates.",
          "description":"Untie the rubber band or remove the cover from the container. Lift the grates out of the solution. Then, rinse them down with a garden hose. Most of the stuck-on food should fall off."
        },
        {
          "headline":"Scrub off any remaining gunk, if necessary.",
          "description":"Use a nylon brush for porcelain-coated grates. Move in gentle diagonal strokes. Cast iron or stainless steel grates can handle stainless steel bristles. Move in a gentle vertical direction."
        },
        {
          "headline":"Rinse and dry the grates.",
          "description":"Hose the grates down one last time. Pat the surface dry with a microfiber towel. Then, replace the grill."
        }
      ]
    }
  ],
  "text":" Cleaning Porcelain Grates Read your owner's manual. Porcelain coating is very fragile and easily damaged from scrubbing and scraping. Follow the manufacturer's instructions to the letter. Otherwise, you could void your warranty. Use a nylon scrubber brush while the grill is still hot. Avoid a brass brush, which can scrape the coating off the grate. Opt for a curved brush that can get in between the grating. Gently scrape in a diagonal motion. Start at the point closest to you and move upward. Move in one direction to minimize the risk of damage to the coating. If you have built-up gunk like barbecue sauce, wet the brush before scrubbing. Clean the underside of the grill. Flip the grill over after it has cooled. Scrape away excess food and gunk with the brush using a diagonal motion. The underside will take somewhat longer to clean because of the drippings that accumulated during cooking. Scrub until the grate is completely clean. If your grate comes in multiple sections, flip and clean each part separately. Cleaning Stainless Steel and Cast Iron Grates Opt for a stainless steel grill brush. The bristles are soft enough to protect the surface of the grate. Choose between a roll brush or a straight brush. Both will clean the grill effectively, but the roll brush will more easily clean the sides of the grates. Keep the grill hot. This will soften any leftover grease and make it easier to clean up. Turn the grill to its “high” setting if it's not at that setting already. Let it heat up for 10 to 15 minutes, or until the temperature gauge reaches 500 to 600 °F (260 to 316 °C). Then, turn off the burners. Scrub the grate. Scrub using a back-and-forth motion along the first bar. Continue until the bar is free of grease and food particles. Repeat the process on the rest of the grate. Apply vegetable oil to the grate. Dip the towel into a container of the oil to pick up about a teaspoon (5 mL). Place the towel in a pair of tongs and wipe it along each bar. This will prevent your grate from rusting. Don't apply more than a teaspoon of oil. Too much can cause a dangerous flare-up if it drips onto any smoldering food particles below the grate. Deep Cleaning Grill Grates Soak the grates in a vinegar solution. Mix one cup (237 g) of vinegar and two cups (474 g) of baking soda. Pour the solution into a garbage bag or container large enough to fit the grates. Place the grates in the solution and allow them to soak overnight. Place a cover on the container. If you use a garbage bag, fasten it with a rubber band. Remove and rinse the grates. Untie the rubber band or remove the cover from the container. Lift the grates out of the solution. Then, rinse them down with a garden hose. Most of the stuck-on food should fall off. Scrub off any remaining gunk, if necessary. Use a nylon brush for porcelain-coated grates. Move in gentle diagonal strokes. Cast iron or stainless steel grates can handle stainless steel bristles. Move in a gentle vertical direction. Rinse and dry the grates. Hose the grates down one last time. Pat the surface dry with a microfiber towel. Then, replace the grill.",
  "sentences":[
    " Cleaning Porcelain Grates Read your owner's manual.",
    "Porcelain coating is very fragile and easily damaged from scrubbing and scraping.",
    "Follow the manufacturer's instructions to the letter.",
    "Otherwise, you could void your warranty.",
    "Use a nylon scrubber brush while the grill is still hot.",
    "Avoid a brass brush, which can scrape the coating off the grate.",
    "Opt for a curved brush that can get in between the grating.",
    "Gently scrape in a diagonal motion.",
    "Start at the point closest to you and move upward.",
    "Move in one direction to minimize the risk of damage to the coating.",
    "If you have built-up gunk like barbecue sauce, wet the brush before scrubbing.",
    "Clean the underside of the grill.",
    "Flip the grill over after it has cooled.",
    "Scrape away excess food and gunk with the brush using a diagonal motion.",
    "The underside will take somewhat longer to clean because of the drippings that accumulated during cooking.",
    "Scrub until the grate is completely clean.",
    "If your grate comes in multiple sections, flip and clean each part separately.",
    "Cleaning Stainless Steel and Cast Iron Grates Opt for a stainless steel grill brush.",
    "The bristles are soft enough to protect the surface of the grate.",
    "Choose between a roll brush or a straight brush.",
    "Both will clean the grill effectively, but the roll brush will more easily clean the sides of the grates.",
    "Keep the grill hot.",
    "This will soften any leftover grease and make it easier to clean up.",
    "Turn the grill to its “high” setting if it's not at that setting already.",
    "Let it heat up for 10 to 15 minutes, or until the temperature gauge reaches 500 to 600 °F (260 to 316 °C).",
    "Then, turn off the burners.",
    "Scrub the grate.",
    "Scrub using a back-and-forth motion along the first bar.",
    "Continue until the bar is free of grease and food particles.",
    "Repeat the process on the rest of the grate.",
    "Apply vegetable oil to the grate.",
    "Dip the towel into a container of the oil to pick up about a teaspoon (5 mL).",
    "Place the towel in a pair of tongs and wipe it along each bar.",
    "This will prevent your grate from rusting.",
    "Don't apply more than a teaspoon of oil.",
    "Too much can cause a dangerous flare-up if it drips onto any smoldering food particles below the grate.",
    "Deep Cleaning Grill Grates Soak the grates in a vinegar solution.",
    "Mix one cup (237 g) of vinegar and two cups (474 g) of baking soda.",
    "Pour the solution into a garbage bag or container large enough to fit the grates.",
    "Place the grates in the solution and allow them to soak overnight.",
    "Place a cover on the container.",
    "If you use a garbage bag, fasten it with a rubber band.",
    "Remove and rinse the grates.",
    "Untie the rubber band or remove the cover from the container.",
    "Lift the grates out of the solution.",
    "Then, rinse them down with a garden hose.",
    "Most of the stuck-on food should fall off.",
    "Scrub off any remaining gunk, if necessary.",
    "Use a nylon brush for porcelain-coated grates.",
    "Move in gentle diagonal strokes.",
    "Cast iron or stainless steel grates can handle stainless steel bristles.",
    "Move in a gentle vertical direction.",
    "Rinse and dry the grates.",
    "Hose the grates down one last time.",
    "Pat the surface dry with a microfiber towel.",
    "Then, replace the grill."
  ],
  "tyn_section":[
    "Nylon grill brush or aluminum foil (for porcelain grates)",
    "Stainless steel brush (for stainless steel and cast iron grates)",
    "Vinegar",
    "Baking soda",
    "Hose",
    "Microfiber towel"
  ],
  "tyn_model":[
    "grill",
    "towel",
    "oil",
    "vinegar",
    "garbage bag",
    "rubber band",
    "porcelain grates",
    "porcelain",
    "nylon scrubber brush",
    "barbecue sauce",
    "brush",
    "stainless steel and cast iron",
    "stainless steel grill brush",
    "straight brush",
    "roll brush",
    "“high",
    "” setting",
    "vegetable oil",
    "baking soda",
    "container",
    "garden hose",
    "nylon brush",
    "cast iron",
    "microfiber towel"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.125,
    "f1":0.2,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.25,
    "f1":0.3846153846
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.2916666667,
    "f1":0.4320987654
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.125,
    "f1":0.2
  }
}