{
  "title":"How to Clean Rubber Bath Mats",
  "url":"https://www.wikihow.com/Clean-Rubber-Bath-Mats",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Cleaning Rubber Bath Mats by Hand in a Bathtub",
      "steps":[
        {
          "headline":"Prepare a diluted bleach solution in a bathtub.",
          "description":"If this is the tub that contains the bath mat, lift up the bath mat so it isn’t stuck to the bottom of the tub. An easy and effective way to clean your rubber bath mat is to soak it in a diluted bleach solution in your bathtub. If you have a deep or utility sink, that may be preferable. Be prepared to measure the amount of bleach to be used in making your solution and have more than enough room for a proper soaking."
        },
        {
          "headline":"Use protective gear when handling bleach.",
          "description":"Bleach may splash when being poured and can irritate your eyes or skin. Wear protective cleaning gloves before pouring bleach. You may also wish to use goggles to cover your eyes."
        },
        {
          "headline":"Make sure the bathroom area is well-ventilated.",
          "description":"Before preparing a diluted bleach solution, open a window or leave the bathroom door open. Fumes from using bleach or making a bleach solution can be noxious and cause dizziness."
        },
        {
          "headline":"Add only cold water to the bathtub first.",
          "description":"Add one gallon of water to the bathtub. Do not pour bleach directly into the bathtub. Do not make a diluted bleach solution with hot water. Hot water may intensify fumes as bleach is added."
        },
        {
          "headline":"Measure the amount of bleach to be used.",
          "description":"Have a measuring cup or tablespoon handy. Do not pour bleach indiscriminately into the cold water. Unequal parts of bleach to water may create a more potent and dangerous solution and cause dizziness or breathing problems. Some recommended measurements are as follows:\nAdd 1 teaspoon (4.9 mL) of chlorine bleach to 1 gallon (3.8 L) of water for normal cleaning. Add 1 cup (240 mL) of chlorine bleach to 5 gallons (19 L) of water for heavier cleaning. As an alternative to bleach, make a solution of 1 cup (240 mL) of white vinegar and 1 cup (240 mL) of water and use it to scrub the mat. Or, fill the tub or basin with equal parts vinegar and water and allow the mat to soak."
        },
        {
          "headline":"Let the mat soak, then scrub it.",
          "description":"You may decide a more thorough cleaning is in order, or you might just want to keep your bath mats fresh. To eliminate mold or mildew, leave the rubber bath mat in the diluted bleach solution for 3-4 hours. To freshen up the bath mat with a quick clean, scrub the rubber bath mat with a cleaning brush or scouring pad to remove dirt and debris after soaking for a few minutes."
        },
        {
          "headline":"Dry the bath mat when you’re done cleaning.",
          "description":"Remove the bath mat from the bathtub and set to dry on the back of a chair or outdoors in the sun. Drain and rinse the bathtub to remove dirt and scum collected from the cleaning. Do not put the bath mat in the dryer as the heat will warp it!"
        }
      ]
    },
    {
      "name":"Washing Rubber Bath Mats in a Washing Machine",
      "steps":[
        {
          "headline":"Place the rubber bath mat into the washing machine.",
          "description":"A bath mat can be washed in a washing machine just as you would a load of clothes. To improve the cleaning process, add laundry. Include other, sturdy laundry items appropriate for washing in laundry detergent and chlorine bleach, e.g., white towels, should be added. Do not add items which may be damaged easily or by bleach. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMichelle Driscoll, MPH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFounder, Mulberry Maids\t\t\t\t\t\t\t\tMichelle Driscoll is the Owner of Mulberry Maids based in northern Colorado. Driscoll received her Masters in Public Health from the Colorado School of Public Health in 2016. Michelle Driscoll, MPH\t\t\tFounder, Mulberry Maids\t\t\t\tExpert Trick: Take care of deep stains, smells, or mold by adding 1/2 cup of bleach to the wash cycle!"
        },
        {
          "headline":"Wash the items on the gentle cycle using cold or warm water.",
          "description":"Washing rubber bath mats in a setting for normal or bulky may weaken or damage the material over time."
        },
        {
          "headline":"Remove the mat and hang it over a chair back or clothesline to dry.",
          "description":"You may want to hand dry the bath mat to speed up the drying process."
        }
      ]
    }
  ],
  "text":" Cleaning Rubber Bath Mats by Hand in a Bathtub Prepare a diluted bleach solution in a bathtub. If this is the tub that contains the bath mat, lift up the bath mat so it isn’t stuck to the bottom of the tub. An easy and effective way to clean your rubber bath mat is to soak it in a diluted bleach solution in your bathtub. If you have a deep or utility sink, that may be preferable. Be prepared to measure the amount of bleach to be used in making your solution and have more than enough room for a proper soaking. Use protective gear when handling bleach. Bleach may splash when being poured and can irritate your eyes or skin. Wear protective cleaning gloves before pouring bleach. You may also wish to use goggles to cover your eyes. Make sure the bathroom area is well-ventilated. Before preparing a diluted bleach solution, open a window or leave the bathroom door open. Fumes from using bleach or making a bleach solution can be noxious and cause dizziness. Add only cold water to the bathtub first. Add one gallon of water to the bathtub. Do not pour bleach directly into the bathtub. Do not make a diluted bleach solution with hot water. Hot water may intensify fumes as bleach is added. Measure the amount of bleach to be used. Have a measuring cup or tablespoon handy. Do not pour bleach indiscriminately into the cold water. Unequal parts of bleach to water may create a more potent and dangerous solution and cause dizziness or breathing problems. Some recommended measurements are as follows:\nAdd 1 teaspoon (4.9 mL) of chlorine bleach to 1 gallon (3.8 L) of water for normal cleaning. Add 1 cup (240 mL) of chlorine bleach to 5 gallons (19 L) of water for heavier cleaning. As an alternative to bleach, make a solution of 1 cup (240 mL) of white vinegar and 1 cup (240 mL) of water and use it to scrub the mat. Or, fill the tub or basin with equal parts vinegar and water and allow the mat to soak. Let the mat soak, then scrub it. You may decide a more thorough cleaning is in order, or you might just want to keep your bath mats fresh. To eliminate mold or mildew, leave the rubber bath mat in the diluted bleach solution for 3-4 hours. To freshen up the bath mat with a quick clean, scrub the rubber bath mat with a cleaning brush or scouring pad to remove dirt and debris after soaking for a few minutes. Dry the bath mat when you’re done cleaning. Remove the bath mat from the bathtub and set to dry on the back of a chair or outdoors in the sun. Drain and rinse the bathtub to remove dirt and scum collected from the cleaning. Do not put the bath mat in the dryer as the heat will warp it! Washing Rubber Bath Mats in a Washing Machine Place the rubber bath mat into the washing machine. A bath mat can be washed in a washing machine just as you would a load of clothes. To improve the cleaning process, add laundry. Include other, sturdy laundry items appropriate for washing in laundry detergent and chlorine bleach, e.g., white towels, should be added. Do not add items which may be damaged easily or by bleach. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMichelle Driscoll, MPH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFounder, Mulberry Maids\t\t\t\t\t\t\t\tMichelle Driscoll is the Owner of Mulberry Maids based in northern Colorado. Driscoll received her Masters in Public Health from the Colorado School of Public Health in 2016. Michelle Driscoll, MPH\t\t\tFounder, Mulberry Maids\t\t\t\tExpert Trick: Take care of deep stains, smells, or mold by adding 1/2 cup of bleach to the wash cycle! Wash the items on the gentle cycle using cold or warm water. Washing rubber bath mats in a setting for normal or bulky may weaken or damage the material over time. Remove the mat and hang it over a chair back or clothesline to dry. You may want to hand dry the bath mat to speed up the drying process.",
  "sentences":[
    " Cleaning Rubber Bath Mats by Hand in a Bathtub Prepare a diluted bleach solution in a bathtub.",
    "If this is the tub that contains the bath mat, lift up the bath mat so it isn’t stuck to the bottom of the tub.",
    "An easy and effective way to clean your rubber bath mat is to soak it in a diluted bleach solution in your bathtub.",
    "If you have a deep or utility sink, that may be preferable.",
    "Be prepared to measure the amount of bleach to be used in making your solution and have more than enough room for a proper soaking.",
    "Use protective gear when handling bleach.",
    "Bleach may splash when being poured and can irritate your eyes or skin.",
    "Wear protective cleaning gloves before pouring bleach.",
    "You may also wish to use goggles to cover your eyes.",
    "Make sure the bathroom area is well-ventilated.",
    "Before preparing a diluted bleach solution, open a window or leave the bathroom door open.",
    "Fumes from using bleach or making a bleach solution can be noxious and cause dizziness.",
    "Add only cold water to the bathtub first.",
    "Add one gallon of water to the bathtub.",
    "Do not pour bleach directly into the bathtub.",
    "Do not make a diluted bleach solution with hot water.",
    "Hot water may intensify fumes as bleach is added.",
    "Measure the amount of bleach to be used.",
    "Have a measuring cup or tablespoon handy.",
    "Do not pour bleach indiscriminately into the cold water.",
    "Unequal parts of bleach to water may create a more potent and dangerous solution and cause dizziness or breathing problems.",
    "Some recommended measurements are as follows:\nAdd 1 teaspoon (4.9 mL) of chlorine bleach to 1 gallon (3.8 L) of water for normal cleaning.",
    "Add 1 cup (240 mL) of chlorine bleach to 5 gallons (19 L) of water for heavier cleaning.",
    "As an alternative to bleach, make a solution of 1 cup (240 mL) of white vinegar and 1 cup (240 mL) of water and use it to scrub the mat.",
    "Or, fill the tub or basin with equal parts vinegar and water and allow the mat to soak.",
    "Let the mat soak, then scrub it.",
    "You may decide a more thorough cleaning is in order, or you might just want to keep your bath mats fresh.",
    "To eliminate mold or mildew, leave the rubber bath mat in the diluted bleach solution for 3-4 hours.",
    "To freshen up the bath mat with a quick clean, scrub the rubber bath mat with a cleaning brush or scouring pad to remove dirt and debris after soaking for a few minutes.",
    "Dry the bath mat when you’re done cleaning.",
    "Remove the bath mat from the bathtub and set to dry on the back of a chair or outdoors in the sun.",
    "Drain and rinse the bathtub to remove dirt and scum collected from the cleaning.",
    "Do not put the bath mat in the dryer as the heat will warp it!",
    "Washing Rubber Bath Mats in a Washing Machine Place the rubber bath mat into the washing machine.",
    "A bath mat can be washed in a washing machine just as you would a load of clothes.",
    "To improve the cleaning process, add laundry.",
    "Include other, sturdy laundry items appropriate for washing in laundry detergent and chlorine bleach, e.g., white towels, should be added.",
    "Do not add items which may be damaged easily or by bleach.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMichelle Driscoll, MPH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFounder, Mulberry Maids\t\t\t\t\t\t\t\tMichelle Driscoll is the Owner of Mulberry Maids based in northern Colorado.",
    "Driscoll received her Masters in Public Health from the Colorado School of Public Health in 2016.",
    "Michelle Driscoll, MPH\t\t\tFounder, Mulberry Maids\t\t\t\tExpert Trick: Take care of deep stains, smells, or mold by adding 1/2 cup of bleach to the wash cycle!",
    "Wash the items on the gentle cycle using cold or warm water.",
    "Washing rubber bath mats in a setting for normal or bulky may weaken or damage the material over time.",
    "Remove the mat and hang it over a chair back or clothesline to dry.",
    "You may want to hand dry the bath mat to speed up the drying process."
  ],
  "tyn_section":[
    "Washing machine",
    "Rubber bath mat",
    "Laundry detergent",
    "Chlorine bleach",
    "Vinegar (optional)",
    "Baking soda (optional)"
  ],
  "tyn_model":[
    "bleach",
    "water",
    "bath mat",
    "chlorine bleach",
    "mulberry maids",
    "diluted bleach",
    "bath mats",
    "washing machine",
    "protective cleaning gloves",
    "goggles",
    "white vinegar",
    "vinegar",
    "cleaning brush",
    "dryer",
    "laundry",
    "laundry detergent",
    "public health"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1764705882,
    "f1":0.2608695652,
    "avg_pos":0.4117647059
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.4117647059,
    "f1":0.5511811024
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.5294117647,
    "f1":0.6474820144
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.2352941176,
    "f1":0.347826087
  }
}