{
  "title":"How to Create a Wildflower Garden",
  "url":"https://www.wikihow.com/Create-a-Wildflower-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Theme and Feature Gardens"
  ],
  "parts":[
    {
      "name":"Selecting the Right Ground and Flowers",
      "steps":[
        {
          "headline":"Choose a spot that gets at least 6 hours of sunlight per day.",
          "description":"Wildflowers need a lot of sunlight to flourish. Start by surveying your property and finding the sunniest spot. Plan on locating your garden here. Certain wildflower species may have different sunlight needs. Always check with the instructions on your seed pack or ask an employee at the nursery."
        },
        {
          "headline":"Use a soil-testing kit to check for nutrient deficiencies.",
          "description":"Wildflowers generally grow well in most types of soil, even with deficiencies, but some deficiencies might inhibit growth. Once you find a sunny spot, run a soil analysis on the area. Buy a home testing kit from a nursery or garden center. Then mix some soil with distilled water and drop it into the kit. The results will tell you if the soil is deficient in any nutrients. Different soil testing kits may have different procedures. Always follow the instructions on the product you use. If this spot shows nutrient deficiencies, you can still plant here. Just plan on fertilizing the area before planting the seeds."
        },
        {
          "headline":"Purchase a seed mix suited to your area.",
          "description":"Wildflower seeds usually come in premade packages that mix several flower types. The packs usually include flowers that grow well in specific geographic areas or climates. Find a pack that corresponds to your area. If your local nursery doesn’t have the seed mixture you want, then look online for different blends. If you prefer, you can also mix your own seed pack. Purchase 3-5 different seed types that are suited to your area and mix them together to create your own unique blend."
        }
      ]
    },
    {
      "name":"Preparing the Ground",
      "steps":[
        {
          "headline":"Plant in the early spring when there is no risk of frost.",
          "description":"Frost can kill off a batch of seeds before they germinate, so don’t start planting until the risk of frost has completely passed. Check your local weather forecasts to make sure there is no more frost predicted, then start the planting process."
        },
        {
          "headline":"Till the area to break up any grass and weeds.",
          "description":"This removes any plants in the area that may inhibit the wildflowers from growing. Use a rototiller to grind all the way down to the soil. Run over the entire area that you want to plant on. If there was tall grass in the area, mow it on the lowest setting before rototilling. Use an aerator rake if you don’t have a gas-powered rototiller. Press hard to rip up grass and weeds. You may have to pass over the area more than once with a manual aerator."
        },
        {
          "headline":"Rake away the excess plants after rototilling.",
          "description":"Use a plastic or metal garden rake and make a pile of all the remnants left behind after aerating. Then put them in a bag or pail and remove them from the area. If you have a compost pile on your property, put these remnants there to recycle them. Aerate again if you find grass and weeds still stuck in the soil while raking. These can start weed growths that might overtake your flowers."
        },
        {
          "headline":"Apply fertilizer only if there are soil deficiencies.",
          "description":"It's not generally recommended to fertilize the soil before you plant wildflowers because it could encourage weed growth. However, if your soil test showed that the soil is lacking in nutrients, you'll need to replace them. If only one nutrient is lacking, choose a fertilizer with that specific nutrient. If all the main soil nutrients are deficient, use a generalized 1-3-2 fertilizer, meaning that it’s 1-part nitrogen, 3 parts phosphorus, and 2 parts potassium. For general application, spread 2–3 pounds (0.91–1.36 kg) of fertilizer per 100 square feet (9.3 m) of garden. Adjust your application if the product gives different directions. If your fertilizer gives a range for the amount to apply, choose the lower end of that recommendation. For example, if the suggested range is 3–5 pounds (1.4–2.3 kg), choose 3."
        }
      ]
    },
    {
      "name":"Planting the Seeds",
      "steps":[
        {
          "headline":"Plant 5 ounces (0.14 kg) of seed per 1,000 sq ft (93 m) of ground.",
          "description":"Add up the total area of the garden you’re planning and use this proportion to determine how much seed you should use. Measure out this amount and load it into a spreader or bucket, depending on what equipment you have. For larger areas, seed at a rate of 10 lb (4.5 kg) per acre. To calculate area, measure the garden's length and width. Then multiply those 2 numbers together to get the total area. Keep your measurements consistent. If you measured in feet on one side, don't use inches for the other. This is a general recommendation for the amount of seed to spread. Check with the product recommendation or nursery employee to see if there is an alternate density you should use."
        },
        {
          "headline":"Mix the seed with an equal amount of sand in a spreader.",
          "description":"The sand helps absorb moisture and ensure a uniform distribution for the seeds. Pour the sand into the spreader and mix it up with your hands. Make sure the seeds and sand are mixed together uniformly. You can also mix the ingredients into a bucket and spread the seeds by hand. Use the same amount of sand as you would if you were using a spreader."
        },
        {
          "headline":"Spread the seed through the whole planting area.",
          "description":"Either walk with a spreader open or throw the seeds by hand. Work in a uniform pattern so you spread an even layer of seed around the garden. Spread until you’re out of seeds. If you reach the end of the garden and still have some leftover, repeat the process until you’re out of seed."
        },
        {
          "headline":"Rake the soil lightly to mix in the seeds.",
          "description":"Use a plastic or metal garden rake and disturb the top 1 inch (2.5 cm) of soil. This ensures good contact between the soil and seeds to encourage growth."
        },
        {
          "headline":"Water the soil every day for 4-6 weeks until the seeds germinate.",
          "description":"Wildflower seeds need moisture to get started. Moisten the soil every day until the seeds germinate. When you see sprouts starting to come up from the soil, then the seeds have successfully germinated. At this point, the wildflowers require less maintenance. Don’t drown the seeds. Only apply enough water to keep the soil moist. Don’t water on days when it rains."
        }
      ]
    },
    {
      "name":"Maintaining the Garden",
      "steps":[
        {
          "headline":"Put up defenses to protect your seeds from birds.",
          "description":"Until your seeds germinate, birds may eat them. There are a number of ways to protect the seeds until the flowers start growing. Popular low-tech methods include putting up a scarecrow, hanging reflective tape around the garden, and covering the seeds with nets. For a more technological approach, motion-activated sprinklers will scare birds away. If the birds to get to your seeds, spread some more to replace them."
        },
        {
          "headline":"Remove weeds if you see them.",
          "description":"In general, wildflowers can grow side by side with weeds. However, some more invasive weeds could overtake the flowers. Monitor your garden and pull any weeds you see to keep your garden healthy. If you use weed killer or herbicide, always make sure that it’s safe to use on your flowers."
        },
        {
          "headline":"Mow the garden down at the end of the fall.",
          "description":"By the fall, most wildflowers will stop blooming. At this point, use a lawnmower and mow them down at the highest setting on your mower. If these seeds were seasonals, then till the soil to prepare for re-planting next season. Even if the flowers you plant are perennials, mow them down to 4–6 inches (10–15 cm) to help them go into hibernation and return next year."
        }
      ]
    }
  ],
  "text":" Selecting the Right Ground and Flowers Choose a spot that gets at least 6 hours of sunlight per day. Wildflowers need a lot of sunlight to flourish. Start by surveying your property and finding the sunniest spot. Plan on locating your garden here. Certain wildflower species may have different sunlight needs. Always check with the instructions on your seed pack or ask an employee at the nursery. Use a soil-testing kit to check for nutrient deficiencies. Wildflowers generally grow well in most types of soil, even with deficiencies, but some deficiencies might inhibit growth. Once you find a sunny spot, run a soil analysis on the area. Buy a home testing kit from a nursery or garden center. Then mix some soil with distilled water and drop it into the kit. The results will tell you if the soil is deficient in any nutrients. Different soil testing kits may have different procedures. Always follow the instructions on the product you use. If this spot shows nutrient deficiencies, you can still plant here. Just plan on fertilizing the area before planting the seeds. Purchase a seed mix suited to your area. Wildflower seeds usually come in premade packages that mix several flower types. The packs usually include flowers that grow well in specific geographic areas or climates. Find a pack that corresponds to your area. If your local nursery doesn’t have the seed mixture you want, then look online for different blends. If you prefer, you can also mix your own seed pack. Purchase 3-5 different seed types that are suited to your area and mix them together to create your own unique blend. Preparing the Ground Plant in the early spring when there is no risk of frost. Frost can kill off a batch of seeds before they germinate, so don’t start planting until the risk of frost has completely passed. Check your local weather forecasts to make sure there is no more frost predicted, then start the planting process. Till the area to break up any grass and weeds. This removes any plants in the area that may inhibit the wildflowers from growing. Use a rototiller to grind all the way down to the soil. Run over the entire area that you want to plant on. If there was tall grass in the area, mow it on the lowest setting before rototilling. Use an aerator rake if you don’t have a gas-powered rototiller. Press hard to rip up grass and weeds. You may have to pass over the area more than once with a manual aerator. Rake away the excess plants after rototilling. Use a plastic or metal garden rake and make a pile of all the remnants left behind after aerating. Then put them in a bag or pail and remove them from the area. If you have a compost pile on your property, put these remnants there to recycle them. Aerate again if you find grass and weeds still stuck in the soil while raking. These can start weed growths that might overtake your flowers. Apply fertilizer only if there are soil deficiencies. It's not generally recommended to fertilize the soil before you plant wildflowers because it could encourage weed growth. However, if your soil test showed that the soil is lacking in nutrients, you'll need to replace them. If only one nutrient is lacking, choose a fertilizer with that specific nutrient. If all the main soil nutrients are deficient, use a generalized 1-3-2 fertilizer, meaning that it’s 1-part nitrogen, 3 parts phosphorus, and 2 parts potassium. For general application, spread 2–3 pounds (0.91–1.36 kg) of fertilizer per 100 square feet (9.3 m) of garden. Adjust your application if the product gives different directions. If your fertilizer gives a range for the amount to apply, choose the lower end of that recommendation. For example, if the suggested range is 3–5 pounds (1.4–2.3 kg), choose 3. Planting the Seeds Plant 5 ounces (0.14 kg) of seed per 1,000 sq ft (93 m) of ground. Add up the total area of the garden you’re planning and use this proportion to determine how much seed you should use. Measure out this amount and load it into a spreader or bucket, depending on what equipment you have. For larger areas, seed at a rate of 10 lb (4.5 kg) per acre. To calculate area, measure the garden's length and width. Then multiply those 2 numbers together to get the total area. Keep your measurements consistent. If you measured in feet on one side, don't use inches for the other. This is a general recommendation for the amount of seed to spread. Check with the product recommendation or nursery employee to see if there is an alternate density you should use. Mix the seed with an equal amount of sand in a spreader. The sand helps absorb moisture and ensure a uniform distribution for the seeds. Pour the sand into the spreader and mix it up with your hands. Make sure the seeds and sand are mixed together uniformly. You can also mix the ingredients into a bucket and spread the seeds by hand. Use the same amount of sand as you would if you were using a spreader. Spread the seed through the whole planting area. Either walk with a spreader open or throw the seeds by hand. Work in a uniform pattern so you spread an even layer of seed around the garden. Spread until you’re out of seeds. If you reach the end of the garden and still have some leftover, repeat the process until you’re out of seed. Rake the soil lightly to mix in the seeds. Use a plastic or metal garden rake and disturb the top 1 inch (2.5 cm) of soil. This ensures good contact between the soil and seeds to encourage growth. Water the soil every day for 4-6 weeks until the seeds germinate. Wildflower seeds need moisture to get started. Moisten the soil every day until the seeds germinate. When you see sprouts starting to come up from the soil, then the seeds have successfully germinated. At this point, the wildflowers require less maintenance. Don’t drown the seeds. Only apply enough water to keep the soil moist. Don’t water on days when it rains. Maintaining the Garden Put up defenses to protect your seeds from birds. Until your seeds germinate, birds may eat them. There are a number of ways to protect the seeds until the flowers start growing. Popular low-tech methods include putting up a scarecrow, hanging reflective tape around the garden, and covering the seeds with nets. For a more technological approach, motion-activated sprinklers will scare birds away. If the birds to get to your seeds, spread some more to replace them. Remove weeds if you see them. In general, wildflowers can grow side by side with weeds. However, some more invasive weeds could overtake the flowers. Monitor your garden and pull any weeds you see to keep your garden healthy. If you use weed killer or herbicide, always make sure that it’s safe to use on your flowers. Mow the garden down at the end of the fall. By the fall, most wildflowers will stop blooming. At this point, use a lawnmower and mow them down at the highest setting on your mower. If these seeds were seasonals, then till the soil to prepare for re-planting next season. Even if the flowers you plant are perennials, mow them down to 4–6 inches (10–15 cm) to help them go into hibernation and return next year.",
  "sentences":[
    " Selecting the Right Ground and Flowers Choose a spot that gets at least 6 hours of sunlight per day.",
    "Wildflowers need a lot of sunlight to flourish.",
    "Start by surveying your property and finding the sunniest spot.",
    "Plan on locating your garden here.",
    "Certain wildflower species may have different sunlight needs.",
    "Always check with the instructions on your seed pack or ask an employee at the nursery.",
    "Use a soil-testing kit to check for nutrient deficiencies.",
    "Wildflowers generally grow well in most types of soil, even with deficiencies, but some deficiencies might inhibit growth.",
    "Once you find a sunny spot, run a soil analysis on the area.",
    "Buy a home testing kit from a nursery or garden center.",
    "Then mix some soil with distilled water and drop it into the kit.",
    "The results will tell you if the soil is deficient in any nutrients.",
    "Different soil testing kits may have different procedures.",
    "Always follow the instructions on the product you use.",
    "If this spot shows nutrient deficiencies, you can still plant here.",
    "Just plan on fertilizing the area before planting the seeds.",
    "Purchase a seed mix suited to your area.",
    "Wildflower seeds usually come in premade packages that mix several flower types.",
    "The packs usually include flowers that grow well in specific geographic areas or climates.",
    "Find a pack that corresponds to your area.",
    "If your local nursery doesn’t have the seed mixture you want, then look online for different blends.",
    "If you prefer, you can also mix your own seed pack.",
    "Purchase 3-5 different seed types that are suited to your area and mix them together to create your own unique blend.",
    "Preparing the Ground Plant in the early spring when there is no risk of frost.",
    "Frost can kill off a batch of seeds before they germinate, so don’t start planting until the risk of frost has completely passed.",
    "Check your local weather forecasts to make sure there is no more frost predicted, then start the planting process.",
    "Till the area to break up any grass and weeds.",
    "This removes any plants in the area that may inhibit the wildflowers from growing.",
    "Use a rototiller to grind all the way down to the soil.",
    "Run over the entire area that you want to plant on.",
    "If there was tall grass in the area, mow it on the lowest setting before rototilling.",
    "Use an aerator rake if you don’t have a gas-powered rototiller.",
    "Press hard to rip up grass and weeds.",
    "You may have to pass over the area more than once with a manual aerator.",
    "Rake away the excess plants after rototilling.",
    "Use a plastic or metal garden rake and make a pile of all the remnants left behind after aerating.",
    "Then put them in a bag or pail and remove them from the area.",
    "If you have a compost pile on your property, put these remnants there to recycle them.",
    "Aerate again if you find grass and weeds still stuck in the soil while raking.",
    "These can start weed growths that might overtake your flowers.",
    "Apply fertilizer only if there are soil deficiencies.",
    "It's not generally recommended to fertilize the soil before you plant wildflowers because it could encourage weed growth.",
    "However, if your soil test showed that the soil is lacking in nutrients, you'll need to replace them.",
    "If only one nutrient is lacking, choose a fertilizer with that specific nutrient.",
    "If all the main soil nutrients are deficient, use a generalized 1-3-2 fertilizer, meaning that it’s 1-part nitrogen, 3 parts phosphorus, and 2 parts potassium.",
    "For general application, spread 2–3 pounds (0.91–1.36 kg) of fertilizer per 100 square feet (9.3 m) of garden.",
    "Adjust your application if the product gives different directions.",
    "If your fertilizer gives a range for the amount to apply, choose the lower end of that recommendation.",
    "For example, if the suggested range is 3–5 pounds (1.4–2.3 kg), choose 3.",
    "Planting the Seeds Plant 5 ounces (0.14 kg) of seed per 1,000 sq ft (93 m) of ground.",
    "Add up the total area of the garden you’re planning and use this proportion to determine how much seed you should use.",
    "Measure out this amount and load it into a spreader or bucket, depending on what equipment you have.",
    "For larger areas, seed at a rate of 10 lb (4.5 kg) per acre.",
    "To calculate area, measure the garden's length and width.",
    "Then multiply those 2 numbers together to get the total area.",
    "Keep your measurements consistent.",
    "If you measured in feet on one side, don't use inches for the other.",
    "This is a general recommendation for the amount of seed to spread.",
    "Check with the product recommendation or nursery employee to see if there is an alternate density you should use.",
    "Mix the seed with an equal amount of sand in a spreader.",
    "The sand helps absorb moisture and ensure a uniform distribution for the seeds.",
    "Pour the sand into the spreader and mix it up with your hands.",
    "Make sure the seeds and sand are mixed together uniformly.",
    "You can also mix the ingredients into a bucket and spread the seeds by hand.",
    "Use the same amount of sand as you would if you were using a spreader.",
    "Spread the seed through the whole planting area.",
    "Either walk with a spreader open or throw the seeds by hand.",
    "Work in a uniform pattern so you spread an even layer of seed around the garden.",
    "Spread until you’re out of seeds.",
    "If you reach the end of the garden and still have some leftover, repeat the process until you’re out of seed.",
    "Rake the soil lightly to mix in the seeds.",
    "Use a plastic or metal garden rake and disturb the top 1 inch (2.5 cm) of soil.",
    "This ensures good contact between the soil and seeds to encourage growth.",
    "Water the soil every day for 4-6 weeks until the seeds germinate.",
    "Wildflower seeds need moisture to get started.",
    "Moisten the soil every day until the seeds germinate.",
    "When you see sprouts starting to come up from the soil, then the seeds have successfully germinated.",
    "At this point, the wildflowers require less maintenance.",
    "Don’t drown the seeds.",
    "Only apply enough water to keep the soil moist.",
    "Don’t water on days when it rains.",
    "Maintaining the Garden Put up defenses to protect your seeds from birds.",
    "Until your seeds germinate, birds may eat them.",
    "There are a number of ways to protect the seeds until the flowers start growing.",
    "Popular low-tech methods include putting up a scarecrow, hanging reflective tape around the garden, and covering the seeds with nets.",
    "For a more technological approach, motion-activated sprinklers will scare birds away.",
    "If the birds to get to your seeds, spread some more to replace them.",
    "Remove weeds if you see them.",
    "In general, wildflowers can grow side by side with weeds.",
    "However, some more invasive weeds could overtake the flowers.",
    "Monitor your garden and pull any weeds you see to keep your garden healthy.",
    "If you use weed killer or herbicide, always make sure that it’s safe to use on your flowers.",
    "Mow the garden down at the end of the fall.",
    "By the fall, most wildflowers will stop blooming.",
    "At this point, use a lawnmower and mow them down at the highest setting on your mower.",
    "If these seeds were seasonals, then till the soil to prepare for re-planting next season.",
    "Even if the flowers you plant are perennials, mow them down to 4–6 inches (10–15 cm) to help them go into hibernation and return next year."
  ],
  "tyn_section":[
    "Wildflower seeds",
    "Rototiller",
    "Rake",
    "Spreader",
    "Water",
    "Sand"
  ],
  "tyn_model":[
    "fertilizer",
    "spreader",
    "sand",
    "water",
    "rototiller",
    "garden rake",
    "bucket",
    "soil-testing kit",
    "distilled water",
    "soil testing kits",
    "wildflower seeds",
    "aerator rake",
    "aerator",
    "compost",
    "weeds",
    "nitrogen",
    "phosphorus",
    "potassium",
    "seed",
    "birds",
    "nets",
    "weed killer"
  ],
  "simple_metrics":{
    "r":0.8333333333,
    "p":0.2272727273,
    "f1":0.3571428571,
    "avg_pos":0.4545454545
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3636363636,
    "f1":0.5333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3636363636,
    "f1":0.5333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8333333333,
    "p":0.2272727273,
    "f1":0.3571428571
  }
}