{
  "title":"How to Wash Tie Dyed Fabric",
  "url":"https://www.wikihow.com/Wash-Tie-Dyed-Fabric",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Washing Delicates"
  ],
  "parts":[
    {
      "name":"Rinsing Your Tie-Dyed Fabrics",
      "steps":[
        {
          "headline":"Protect your work area from stains with newspaper or paper towels.",
          "description":"Your work area should include a sink that can be washed and rinsed out with dish soap and water, usually either a kitchen or laundry-room sink. To prevent splattered dye from staining the surrounding countertop, lay down several layers of paper towels or newspapers."
        },
        {
          "headline":"Wear rubber gloves to avoid staining your hands.",
          "description":"Fabric dye leaves strong stains that could remain on your skin for several days. Prevent these stains by wearing thick rubber gloves that reach past your wrists. Check the gloves frequently for holes or tears, and replace them if necessary. If you do get dye on your skin, wash your hands thoroughly with soap and water. Then, mix a small amount of baking soda with a bit of water to make a paste. Apply the paste to your skin and scrub to remove dye."
        },
        {
          "headline":"Remove your item from dye after 2-24 hours.",
          "description":"Your fabric needs sufficient time in the dye for the colors to set. The longer you allow the material to remain in the dye, the easier it will be to remove excess dye while still leaving behind vibrant colors and patterns. If you can, leave the item in the dye overnight."
        },
        {
          "headline":"Rinse your material under cold water to remove loose dye.",
          "description":"Leaving your item securely tied or rubber-banded, run it under cold water. Allow the loose dye to rinse from the material until the water runs clear. This may only take a few minutes, but rinsing times vary. Be prepared to hold the fabric under cold water for 20-30 minutes."
        },
        {
          "headline":"Remove rubber bands or ties from your fabric.",
          "description":"Now that you’ve rinsed out the first portion of the loose dye, it’s time to remove the strings or rubber bands that formed your pattern. Use scissors to cut through these ties and gently unfold the material. Take a minute to enjoy seeing your fabric for the first time!"
        },
        {
          "headline":"Rinse your material under hot water to remove excess dye.",
          "description":"Run your item under the warmer water until this, too, runs clear. Be sure the water isn’t so hot that it burns your hands.Your rinse time will vary under the hot water as well. Generally expect to rinse for at least five minutes and up to about twenty."
        },
        {
          "headline":"Set your fabric aside on a layer of plastic wrap.",
          "description":"To prevent your fabric from staining your countertops while you prepare your washing machine, set out a layer of plastic wrap large enough to lay your material flat on top of it. For added protection, place the plastic wrap on top of the paper towels or newspapers."
        }
      ]
    },
    {
      "name":"Washing and Drying Your Tie-Dyed Fabrics",
      "steps":[
        {
          "headline":"Use a washing machine for best results.",
          "description":"While you may prefer to hand wash very delicate tie-dyed fabrics such as silk or rayon, most materials do best in the washing machine. Using the machine provides the efficient and complete wash your fabric needs. Leaving loose dye in the material may cause bleeding in the colors and patterns. If you don’t have a machine at home, ask a friend if you can use theirs. Be sure they understand that you’re washing tie-dyed material and may need to run the machine several times. You can also visit a laundromat. Check with the company to ensure they’ll allow you to wash tie-dyed fabrics."
        },
        {
          "headline":"Turn your washing machine to its normal cold-water cycle.",
          "description":"Just as with hand-rinsing, tie-dyed fabrics should be washed first in cold water. This allows the loose dye to slowly rinse out, preventing the fabric from losing too much color at once. Most fabrics can be washed for the full length of a normal cycle. Check any tags to ensure you’re following the proper instructions for your particular item. For rayon or other delicate fabrics, use a mesh laundry bag on the delicates cycle. This will protect those fabrics from damage. Use a mesh bag you don’t mind replacing, as it may become stained with dye."
        },
        {
          "headline":"Choose synthrapol detergent for top-loading machines.",
          "description":"Synthrapol is a special detergent that’s particularly good at rinsing excess dyes from fabrics. It’s a highly concentrated substance that will create a sudsy wash, so it should only be used in top-loading washing machines. Add 1-2 tbsp. (14.79-29.57 mL) to the machine. For heavily dyed items that you’re hoping to wash more thoroughly, add up to a ¼ cup (118 mL)."
        },
        {
          "headline":"Choose regular detergent for front-loading machines.",
          "description":"To prevent front-loading machines from leaking suds, stick with regular laundry detergent. Use the normally recommended amount of detergent to wash your items. Be aware that you may need to repeat the washing process a few extra times when using regular detergent."
        },
        {
          "headline":"Load no more than four items in the machine.",
          "description":"Avoid overfilling the machine. While it’s safe to wash tie-dyed fabrics together, they need enough space in the washer to get fully washed and rinsed. You also don’t want the water to get too “muddy.”\nIf you’re worried about your items bleeding together in the machine, you can wash them entirely separately."
        },
        {
          "headline":"Run machine on warm- or hot-water cycles for subsequent washings.",
          "description":"It’s a good idea to wash your tie-dyed fabric separately from your other laundry for a few more cycles. Most items will need at least one or two more washings before the loose dye is completely washed out. Continue to use either synthrapol or normal laundry detergent, depending on your type of washing machine."
        },
        {
          "headline":"Check on the water during the rinse cycle for loose dye.",
          "description":"During these final washings, look to see if your fabric is rinsing clean. Open the washing machine (or, if you have a glass door, peek inside) during the rinse cycle to examine the water. If it looks clear instead of muddy with dye, your item is done washing. Your fabric may need to be washed in warmer water a few times before it rinses clear."
        },
        {
          "headline":"Dry fabrics by following the instructions for the material type.",
          "description":"Different materials require different drying methods. Cotton, for example, may shrink a bit the first time it goes through a full dryer cycle. Other, more delicate fabrics may need only a tumble-dry. Check the tag to ensure you’re drying your material correctly. If you’re worried about damage or shrinkage, allow your items to air dry."
        },
        {
          "headline":"Wash and dry your tie-dyed fabric with the rest of your laundry.",
          "description":"After you’ve rinsed, washed, and dried your tie dye, it’s ready to wear. When it’s time to clean the fabric again, you can add the items to your typical laundry load. Wash and dry them normally. Use your usual laundry detergent and dryer sheets, following the instructions for the specific material type. If you’re worried about the bright colors fading, put your tie-dyed fabric in cold-water cycles with any other brightly colored clothing you need to wash. Use a color-safe detergent. This will extend the life of the colors."
        }
      ]
    }
  ],
  "text":" Rinsing Your Tie-Dyed Fabrics Protect your work area from stains with newspaper or paper towels. Your work area should include a sink that can be washed and rinsed out with dish soap and water, usually either a kitchen or laundry-room sink. To prevent splattered dye from staining the surrounding countertop, lay down several layers of paper towels or newspapers. Wear rubber gloves to avoid staining your hands. Fabric dye leaves strong stains that could remain on your skin for several days. Prevent these stains by wearing thick rubber gloves that reach past your wrists. Check the gloves frequently for holes or tears, and replace them if necessary. If you do get dye on your skin, wash your hands thoroughly with soap and water. Then, mix a small amount of baking soda with a bit of water to make a paste. Apply the paste to your skin and scrub to remove dye. Remove your item from dye after 2-24 hours. Your fabric needs sufficient time in the dye for the colors to set. The longer you allow the material to remain in the dye, the easier it will be to remove excess dye while still leaving behind vibrant colors and patterns. If you can, leave the item in the dye overnight. Rinse your material under cold water to remove loose dye. Leaving your item securely tied or rubber-banded, run it under cold water. Allow the loose dye to rinse from the material until the water runs clear. This may only take a few minutes, but rinsing times vary. Be prepared to hold the fabric under cold water for 20-30 minutes. Remove rubber bands or ties from your fabric. Now that you’ve rinsed out the first portion of the loose dye, it’s time to remove the strings or rubber bands that formed your pattern. Use scissors to cut through these ties and gently unfold the material. Take a minute to enjoy seeing your fabric for the first time! Rinse your material under hot water to remove excess dye. Run your item under the warmer water until this, too, runs clear. Be sure the water isn’t so hot that it burns your hands.Your rinse time will vary under the hot water as well. Generally expect to rinse for at least five minutes and up to about twenty. Set your fabric aside on a layer of plastic wrap. To prevent your fabric from staining your countertops while you prepare your washing machine, set out a layer of plastic wrap large enough to lay your material flat on top of it. For added protection, place the plastic wrap on top of the paper towels or newspapers. Washing and Drying Your Tie-Dyed Fabrics Use a washing machine for best results. While you may prefer to hand wash very delicate tie-dyed fabrics such as silk or rayon, most materials do best in the washing machine. Using the machine provides the efficient and complete wash your fabric needs. Leaving loose dye in the material may cause bleeding in the colors and patterns. If you don’t have a machine at home, ask a friend if you can use theirs. Be sure they understand that you’re washing tie-dyed material and may need to run the machine several times. You can also visit a laundromat. Check with the company to ensure they’ll allow you to wash tie-dyed fabrics. Turn your washing machine to its normal cold-water cycle. Just as with hand-rinsing, tie-dyed fabrics should be washed first in cold water. This allows the loose dye to slowly rinse out, preventing the fabric from losing too much color at once. Most fabrics can be washed for the full length of a normal cycle. Check any tags to ensure you’re following the proper instructions for your particular item. For rayon or other delicate fabrics, use a mesh laundry bag on the delicates cycle. This will protect those fabrics from damage. Use a mesh bag you don’t mind replacing, as it may become stained with dye. Choose synthrapol detergent for top-loading machines. Synthrapol is a special detergent that’s particularly good at rinsing excess dyes from fabrics. It’s a highly concentrated substance that will create a sudsy wash, so it should only be used in top-loading washing machines. Add 1-2 tbsp. (14.79-29.57 mL) to the machine. For heavily dyed items that you’re hoping to wash more thoroughly, add up to a ¼ cup (118 mL). Choose regular detergent for front-loading machines. To prevent front-loading machines from leaking suds, stick with regular laundry detergent. Use the normally recommended amount of detergent to wash your items. Be aware that you may need to repeat the washing process a few extra times when using regular detergent. Load no more than four items in the machine. Avoid overfilling the machine. While it’s safe to wash tie-dyed fabrics together, they need enough space in the washer to get fully washed and rinsed. You also don’t want the water to get too “muddy.”\nIf you’re worried about your items bleeding together in the machine, you can wash them entirely separately. Run machine on warm- or hot-water cycles for subsequent washings. It’s a good idea to wash your tie-dyed fabric separately from your other laundry for a few more cycles. Most items will need at least one or two more washings before the loose dye is completely washed out. Continue to use either synthrapol or normal laundry detergent, depending on your type of washing machine. Check on the water during the rinse cycle for loose dye. During these final washings, look to see if your fabric is rinsing clean. Open the washing machine (or, if you have a glass door, peek inside) during the rinse cycle to examine the water. If it looks clear instead of muddy with dye, your item is done washing. Your fabric may need to be washed in warmer water a few times before it rinses clear. Dry fabrics by following the instructions for the material type. Different materials require different drying methods. Cotton, for example, may shrink a bit the first time it goes through a full dryer cycle. Other, more delicate fabrics may need only a tumble-dry. Check the tag to ensure you’re drying your material correctly. If you’re worried about damage or shrinkage, allow your items to air dry. Wash and dry your tie-dyed fabric with the rest of your laundry. After you’ve rinsed, washed, and dried your tie dye, it’s ready to wear. When it’s time to clean the fabric again, you can add the items to your typical laundry load. Wash and dry them normally. Use your usual laundry detergent and dryer sheets, following the instructions for the specific material type. If you’re worried about the bright colors fading, put your tie-dyed fabric in cold-water cycles with any other brightly colored clothing you need to wash. Use a color-safe detergent. This will extend the life of the colors.",
  "sentences":[
    " Rinsing Your Tie-Dyed Fabrics Protect your work area from stains with newspaper or paper towels.",
    "Your work area should include a sink that can be washed and rinsed out with dish soap and water, usually either a kitchen or laundry-room sink.",
    "To prevent splattered dye from staining the surrounding countertop, lay down several layers of paper towels or newspapers.",
    "Wear rubber gloves to avoid staining your hands.",
    "Fabric dye leaves strong stains that could remain on your skin for several days.",
    "Prevent these stains by wearing thick rubber gloves that reach past your wrists.",
    "Check the gloves frequently for holes or tears, and replace them if necessary.",
    "If you do get dye on your skin, wash your hands thoroughly with soap and water.",
    "Then, mix a small amount of baking soda with a bit of water to make a paste.",
    "Apply the paste to your skin and scrub to remove dye.",
    "Remove your item from dye after 2-24 hours.",
    "Your fabric needs sufficient time in the dye for the colors to set.",
    "The longer you allow the material to remain in the dye, the easier it will be to remove excess dye while still leaving behind vibrant colors and patterns.",
    "If you can, leave the item in the dye overnight.",
    "Rinse your material under cold water to remove loose dye.",
    "Leaving your item securely tied or rubber-banded, run it under cold water.",
    "Allow the loose dye to rinse from the material until the water runs clear.",
    "This may only take a few minutes, but rinsing times vary.",
    "Be prepared to hold the fabric under cold water for 20-30 minutes.",
    "Remove rubber bands or ties from your fabric.",
    "Now that you’ve rinsed out the first portion of the loose dye, it’s time to remove the strings or rubber bands that formed your pattern.",
    "Use scissors to cut through these ties and gently unfold the material.",
    "Take a minute to enjoy seeing your fabric for the first time!",
    "Rinse your material under hot water to remove excess dye.",
    "Run your item under the warmer water until this, too, runs clear.",
    "Be sure the water isn’t so hot that it burns your hands.Your rinse time will vary under the hot water as well.",
    "Generally expect to rinse for at least five minutes and up to about twenty.",
    "Set your fabric aside on a layer of plastic wrap.",
    "To prevent your fabric from staining your countertops while you prepare your washing machine, set out a layer of plastic wrap large enough to lay your material flat on top of it.",
    "For added protection, place the plastic wrap on top of the paper towels or newspapers.",
    "Washing and Drying Your Tie-Dyed Fabrics Use a washing machine for best results.",
    "While you may prefer to hand wash very delicate tie-dyed fabrics such as silk or rayon, most materials do best in the washing machine.",
    "Using the machine provides the efficient and complete wash your fabric needs.",
    "Leaving loose dye in the material may cause bleeding in the colors and patterns.",
    "If you don’t have a machine at home, ask a friend if you can use theirs.",
    "Be sure they understand that you’re washing tie-dyed material and may need to run the machine several times.",
    "You can also visit a laundromat.",
    "Check with the company to ensure they’ll allow you to wash tie-dyed fabrics.",
    "Turn your washing machine to its normal cold-water cycle.",
    "Just as with hand-rinsing, tie-dyed fabrics should be washed first in cold water.",
    "This allows the loose dye to slowly rinse out, preventing the fabric from losing too much color at once.",
    "Most fabrics can be washed for the full length of a normal cycle.",
    "Check any tags to ensure you’re following the proper instructions for your particular item.",
    "For rayon or other delicate fabrics, use a mesh laundry bag on the delicates cycle.",
    "This will protect those fabrics from damage.",
    "Use a mesh bag you don’t mind replacing, as it may become stained with dye.",
    "Choose synthrapol detergent for top-loading machines.",
    "Synthrapol is a special detergent that’s particularly good at rinsing excess dyes from fabrics.",
    "It’s a highly concentrated substance that will create a sudsy wash, so it should only be used in top-loading washing machines.",
    "Add 1-2 tbsp.",
    "(14.79-29.57 mL) to the machine.",
    "For heavily dyed items that you’re hoping to wash more thoroughly, add up to a ¼ cup (118 mL).",
    "Choose regular detergent for front-loading machines.",
    "To prevent front-loading machines from leaking suds, stick with regular laundry detergent.",
    "Use the normally recommended amount of detergent to wash your items.",
    "Be aware that you may need to repeat the washing process a few extra times when using regular detergent.",
    "Load no more than four items in the machine.",
    "Avoid overfilling the machine.",
    "While it’s safe to wash tie-dyed fabrics together, they need enough space in the washer to get fully washed and rinsed.",
    "You also don’t want the water to get too “muddy.”\nIf you’re worried about your items bleeding together in the machine, you can wash them entirely separately.",
    "Run machine on warm- or hot-water cycles for subsequent washings.",
    "It’s a good idea to wash your tie-dyed fabric separately from your other laundry for a few more cycles.",
    "Most items will need at least one or two more washings before the loose dye is completely washed out.",
    "Continue to use either synthrapol or normal laundry detergent, depending on your type of washing machine.",
    "Check on the water during the rinse cycle for loose dye.",
    "During these final washings, look to see if your fabric is rinsing clean.",
    "Open the washing machine (or, if you have a glass door, peek inside) during the rinse cycle to examine the water.",
    "If it looks clear instead of muddy with dye, your item is done washing.",
    "Your fabric may need to be washed in warmer water a few times before it rinses clear.",
    "Dry fabrics by following the instructions for the material type.",
    "Different materials require different drying methods.",
    "Cotton, for example, may shrink a bit the first time it goes through a full dryer cycle.",
    "Other, more delicate fabrics may need only a tumble-dry.",
    "Check the tag to ensure you’re drying your material correctly.",
    "If you’re worried about damage or shrinkage, allow your items to air dry.",
    "Wash and dry your tie-dyed fabric with the rest of your laundry.",
    "After you’ve rinsed, washed, and dried your tie dye, it’s ready to wear.",
    "When it’s time to clean the fabric again, you can add the items to your typical laundry load.",
    "Wash and dry them normally.",
    "Use your usual laundry detergent and dryer sheets, following the instructions for the specific material type.",
    "If you’re worried about the bright colors fading, put your tie-dyed fabric in cold-water cycles with any other brightly colored clothing you need to wash. Use a color-safe detergent.",
    "This will extend the life of the colors."
  ],
  "tyn_section":[
    "Paper towels or newspapers",
    "Rubber gloves",
    "Plastic wrap",
    "Sink",
    "Washing machine",
    "Disposable gloves",
    "Synthrapol detergent",
    "Regular laundry detergent"
  ],
  "tyn_model":[
    "water",
    "fabric",
    "washing machine",
    "detergent",
    "plastic wrap",
    "laundry detergent",
    "paper towels",
    "newspapers",
    "rubber gloves",
    "rubber bands",
    "synthrapol",
    "laundry",
    "newspaper",
    "dish soap",
    "fabric dye",
    "soap",
    "baking soda",
    "scissors",
    "mesh laundry bag",
    "mesh bag",
    "dye",
    "synthrapol detergent",
    "regular detergent",
    "washer",
    "“muddy",
    "”\n",
    "cotton",
    "tie-dyed fabric",
    "tie dye",
    "dryer sheets",
    "tie-dyed"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1290322581,
    "f1":0.2051282051,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.2903225806,
    "f1":0.4186046512
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.3548387097,
    "f1":0.5049180328
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.1935483871,
    "f1":0.2955665025
  }
}