{
  "title":"How to Add Fresh Flowers to a Cake",
  "url":"https://www.wikihow.com/Add-Fresh-Flowers-to-a-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Choosing and Preparing the Flowers",
      "steps":[
        {
          "headline":"Find out where your flowers came from.",
          "description":"Not all types of flowers are safe to eat. Don’t buy flowers that have been treated with pesticides, insecticides, growth agents or other toxic chemicals. These can make you very sick. In general, it may be best to find a source other than supermarket florists for fresh flowers. Most of the flowers sold in these places are grown in highly-controlled conditions using various chemicals."
        },
        {
          "headline":"Look for flowers grown organically.",
          "description":"Check with the florist to see if the flowers they sell are grown organically. Flowers grown naturally are generally the best to use for culinary purposes, as they don’t contain chemical additives that can leach into your cake. In most cases, vendors are required to disclose whether or not their flowers are organic. Visit a local farm, greenhouse or flower nursery to find flowers that have been cultivated using safe, organic growing practices. Even organic flowers may not be suitable for human consumption. Certain species contain saps and microbes that may cause irritation to the eyes, skin or digestive tract if they come into contact with food."
        },
        {
          "headline":"Choose flowers that complement your cake.",
          "description":"Think about the kind of cake you’re making when you pick out flowers to decorate it. Try to match colors and textures, or create a tasteful contrast. For instance, white flowers such as will look subtle and elegant on a white cake, whereas bright red roses might be used to offset softer pastel colored cakes. Take a look at which types of flowers are safe to consume or use in foods and which are harmful."
        },
        {
          "headline":"Use edible flowers.",
          "description":"Certain species of flowering plants can be safely consumed. These flowers offer unique, perfumed flavor notes and make an effortless addition to floral cakes because they don't need to be removed prior to serving. Some of the most common types of edible flowers include roses, begonias, chrysanthemums, daisies, dandelions and hibiscus. Each of these edibles can be distinguished by their subtle flavors, which should be used to enhance the flavor of the cake they're to be added to. Flowers like dandelion, chicory and calendula feature bright, zesty notes that can be used to offset the sweetness of a frosted cake, while mild herbal flowers like hibiscus and lavender work well with naked cakes and those garnished with fresh fruit. Though they are technically edible, it is not advisable to use more fragrant types of flowers like roses, carnations and jasmine as food additives, as the chemicals that lend them their characteristic scents can easily overpower the flavors of the confection."
        },
        {
          "headline":"Wash the flowers thoroughly.",
          "description":"Before you begin decorating, rinse the flower from petal to stem under a light stream of cool water. Just like with produce, you should wash flowers before putting them to culinary use to remove any traces of soil, bacteria or insects. Even if the flowers you’ve bought are organically grown, they should be rinsed to avoid contaminated food items. Be careful not to damage the delicate flower blossoms by rinsing them under too high a water pressure or scrubbing them by hand."
        }
      ]
    },
    {
      "name":"Decorating the Top of the Cake",
      "steps":[
        {
          "headline":"Cut the stems short.",
          "description":"Use a pair of scissors to snip the stems off about an inch below the blossom. This will leave you with a nub just the right length to insert into the cake. Soak the stems of the cut flowers in water for several minutes before decorating to wash away any remaining bacteria or juices. You should soak the stem even if you’ve already rinsed the flower. Flowers stems contain copious amounts of water mingled with botanical elements. These can seep into the cake if you’re not careful. Fresh flowers don't last long after they're cut, especially in hot temperatures. If possible, add the flowers to the cake right before you serve it. Consider using water tubes to protect the stems (and the cake) after cutting them and allow them to soak up some much-needed moisture."
        },
        {
          "headline":"Wrap the stems to protect the cake.",
          "description":"If you’ve shopped around for non-toxic organically grown flowers, there should be no problem with pressing the flower directly into the cake. However, if you’re still uncomfortable with the idea, go around the stems a couple of times with plastic wrap or aluminum foil before adding the flowers. This way, the stem never has to come into contact with the cake at all. You may also be able to find some long, cylindrical water tubes to use to cover the flower stems. These will keep the flowers fresh for longer, as well. As a possible alternative, roll fondant into thick shapes, place them on top of the cake and press the flowers into these rather than the cake itself."
        },
        {
          "headline":"Insert the flowers into the top of the cake.",
          "description":"Decide where you want each flower to go on top of the cake. Push the flower stem down through the cake’s surface, stopping just beneath the blossom so that none of the stem is visible. It will look like the blossom itself is resting gently on the cake. The flowers can be removed prior to serving or eating the cake. Snipping the stems at a sharp angle can help you penetrate the top layer of the cake without making a mess."
        },
        {
          "headline":"Create custom arrangements.",
          "description":"Group the flowers in clusters, or combine different types to create a cake bouquet. Take the same care you would in designing a flower arrangement for a table centerpiece. Once again, consider the occasion, as well as the kinds of flowers that are in season and will provide a pleasant aesthetic with the cake you’ve prepared. Roses and carnations make ideal floral decorations for a traditional wedding cake. Play around with different sizes of flowers as well as different colors."
        }
      ]
    },
    {
      "name":"Using Flowers to Garnish the Cake",
      "steps":[
        {
          "headline":"Use whole flowers.",
          "description":"For a simpler method of presentation, lay uncut flowers with long stems across the top of the cake, or on the platter around the based. Cut wax paper or roll a thin layer of fondant to cover the part of the cake that touches the flower. One or two whole flowers will make for a modestly beautiful look. Be sure to trim away any thorns, leaves or visible imperfections from the flower stems before situating them on the cake. Whole flowers can be used to spruce up naked or smaller cakes in a breeze."
        },
        {
          "headline":"Place flowers between the cake layers.",
          "description":"Rather than inserting flowers into the top of the cake, stick them between the layers on the outer edges of larger cakes. This will create the effect that the flowers are blooming out of the cake. Use foam dividers if you’re worried about damaging the layers or contaminating the cake. Place fresh flowers in a ring around the base, middle layers and top of the cake to create a festive border."
        },
        {
          "headline":"Sprinkle flower petals around the base.",
          "description":"Gently remove the petals from your flowers of choice. Be careful not to mash or tear them. Use a loose hand to sprinkle them around the base of the cake, or sparingly on top. Flower petals can give your cake an infusion of color and bohemian grace without the need to mess with soaking, cutting and arranging whole blossoms. Loose flowers petals can be picked off before serving, or eaten, provided that they belong to an edible species."
        },
        {
          "headline":"Mix edible flowers with fresh fruit.",
          "description":"Some types of flowers are safe to be actually eaten. Mix in a small amount of these flowers with fruit, candies and other confections for a dessert with bright, floral notes. Clover, marjoram and hibiscus are all common flower varieties that can make a great cake topper. It may be better to avoid decorating with especially fragrant types of edible flowers such as roses and jasmine, as the chemicals that produce their trademark scents can easily overpower the flavors of a cake. Use a light hand when finishing cakes with flowers that are meant to be eaten. Their petals can sometimes be dry, waxy and hard to chew and swallow in great quantities."
        }
      ]
    }
  ],
  "text":" Choosing and Preparing the Flowers Find out where your flowers came from. Not all types of flowers are safe to eat. Don’t buy flowers that have been treated with pesticides, insecticides, growth agents or other toxic chemicals. These can make you very sick. In general, it may be best to find a source other than supermarket florists for fresh flowers. Most of the flowers sold in these places are grown in highly-controlled conditions using various chemicals. Look for flowers grown organically. Check with the florist to see if the flowers they sell are grown organically. Flowers grown naturally are generally the best to use for culinary purposes, as they don’t contain chemical additives that can leach into your cake. In most cases, vendors are required to disclose whether or not their flowers are organic. Visit a local farm, greenhouse or flower nursery to find flowers that have been cultivated using safe, organic growing practices. Even organic flowers may not be suitable for human consumption. Certain species contain saps and microbes that may cause irritation to the eyes, skin or digestive tract if they come into contact with food. Choose flowers that complement your cake. Think about the kind of cake you’re making when you pick out flowers to decorate it. Try to match colors and textures, or create a tasteful contrast. For instance, white flowers such as will look subtle and elegant on a white cake, whereas bright red roses might be used to offset softer pastel colored cakes. Take a look at which types of flowers are safe to consume or use in foods and which are harmful. Use edible flowers. Certain species of flowering plants can be safely consumed. These flowers offer unique, perfumed flavor notes and make an effortless addition to floral cakes because they don't need to be removed prior to serving. Some of the most common types of edible flowers include roses, begonias, chrysanthemums, daisies, dandelions and hibiscus. Each of these edibles can be distinguished by their subtle flavors, which should be used to enhance the flavor of the cake they're to be added to. Flowers like dandelion, chicory and calendula feature bright, zesty notes that can be used to offset the sweetness of a frosted cake, while mild herbal flowers like hibiscus and lavender work well with naked cakes and those garnished with fresh fruit. Though they are technically edible, it is not advisable to use more fragrant types of flowers like roses, carnations and jasmine as food additives, as the chemicals that lend them their characteristic scents can easily overpower the flavors of the confection. Wash the flowers thoroughly. Before you begin decorating, rinse the flower from petal to stem under a light stream of cool water. Just like with produce, you should wash flowers before putting them to culinary use to remove any traces of soil, bacteria or insects. Even if the flowers you’ve bought are organically grown, they should be rinsed to avoid contaminated food items. Be careful not to damage the delicate flower blossoms by rinsing them under too high a water pressure or scrubbing them by hand. Decorating the Top of the Cake Cut the stems short. Use a pair of scissors to snip the stems off about an inch below the blossom. This will leave you with a nub just the right length to insert into the cake. Soak the stems of the cut flowers in water for several minutes before decorating to wash away any remaining bacteria or juices. You should soak the stem even if you’ve already rinsed the flower. Flowers stems contain copious amounts of water mingled with botanical elements. These can seep into the cake if you’re not careful. Fresh flowers don't last long after they're cut, especially in hot temperatures. If possible, add the flowers to the cake right before you serve it. Consider using water tubes to protect the stems (and the cake) after cutting them and allow them to soak up some much-needed moisture. Wrap the stems to protect the cake. If you’ve shopped around for non-toxic organically grown flowers, there should be no problem with pressing the flower directly into the cake. However, if you’re still uncomfortable with the idea, go around the stems a couple of times with plastic wrap or aluminum foil before adding the flowers. This way, the stem never has to come into contact with the cake at all. You may also be able to find some long, cylindrical water tubes to use to cover the flower stems. These will keep the flowers fresh for longer, as well. As a possible alternative, roll fondant into thick shapes, place them on top of the cake and press the flowers into these rather than the cake itself. Insert the flowers into the top of the cake. Decide where you want each flower to go on top of the cake. Push the flower stem down through the cake’s surface, stopping just beneath the blossom so that none of the stem is visible. It will look like the blossom itself is resting gently on the cake. The flowers can be removed prior to serving or eating the cake. Snipping the stems at a sharp angle can help you penetrate the top layer of the cake without making a mess. Create custom arrangements. Group the flowers in clusters, or combine different types to create a cake bouquet. Take the same care you would in designing a flower arrangement for a table centerpiece. Once again, consider the occasion, as well as the kinds of flowers that are in season and will provide a pleasant aesthetic with the cake you’ve prepared. Roses and carnations make ideal floral decorations for a traditional wedding cake. Play around with different sizes of flowers as well as different colors. Using Flowers to Garnish the Cake Use whole flowers. For a simpler method of presentation, lay uncut flowers with long stems across the top of the cake, or on the platter around the based. Cut wax paper or roll a thin layer of fondant to cover the part of the cake that touches the flower. One or two whole flowers will make for a modestly beautiful look. Be sure to trim away any thorns, leaves or visible imperfections from the flower stems before situating them on the cake. Whole flowers can be used to spruce up naked or smaller cakes in a breeze. Place flowers between the cake layers. Rather than inserting flowers into the top of the cake, stick them between the layers on the outer edges of larger cakes. This will create the effect that the flowers are blooming out of the cake. Use foam dividers if you’re worried about damaging the layers or contaminating the cake. Place fresh flowers in a ring around the base, middle layers and top of the cake to create a festive border. Sprinkle flower petals around the base. Gently remove the petals from your flowers of choice. Be careful not to mash or tear them. Use a loose hand to sprinkle them around the base of the cake, or sparingly on top. Flower petals can give your cake an infusion of color and bohemian grace without the need to mess with soaking, cutting and arranging whole blossoms. Loose flowers petals can be picked off before serving, or eaten, provided that they belong to an edible species. Mix edible flowers with fresh fruit. Some types of flowers are safe to be actually eaten. Mix in a small amount of these flowers with fruit, candies and other confections for a dessert with bright, floral notes. Clover, marjoram and hibiscus are all common flower varieties that can make a great cake topper. It may be better to avoid decorating with especially fragrant types of edible flowers such as roses and jasmine, as the chemicals that produce their trademark scents can easily overpower the flavors of a cake. Use a light hand when finishing cakes with flowers that are meant to be eaten. Their petals can sometimes be dry, waxy and hard to chew and swallow in great quantities.",
  "sentences":[
    " Choosing and Preparing the Flowers Find out where your flowers came from.",
    "Not all types of flowers are safe to eat.",
    "Don’t buy flowers that have been treated with pesticides, insecticides, growth agents or other toxic chemicals.",
    "These can make you very sick.",
    "In general, it may be best to find a source other than supermarket florists for fresh flowers.",
    "Most of the flowers sold in these places are grown in highly-controlled conditions using various chemicals.",
    "Look for flowers grown organically.",
    "Check with the florist to see if the flowers they sell are grown organically.",
    "Flowers grown naturally are generally the best to use for culinary purposes, as they don’t contain chemical additives that can leach into your cake.",
    "In most cases, vendors are required to disclose whether or not their flowers are organic.",
    "Visit a local farm, greenhouse or flower nursery to find flowers that have been cultivated using safe, organic growing practices.",
    "Even organic flowers may not be suitable for human consumption.",
    "Certain species contain saps and microbes that may cause irritation to the eyes, skin or digestive tract if they come into contact with food.",
    "Choose flowers that complement your cake.",
    "Think about the kind of cake you’re making when you pick out flowers to decorate it.",
    "Try to match colors and textures, or create a tasteful contrast.",
    "For instance, white flowers such as will look subtle and elegant on a white cake, whereas bright red roses might be used to offset softer pastel colored cakes.",
    "Take a look at which types of flowers are safe to consume or use in foods and which are harmful.",
    "Use edible flowers.",
    "Certain species of flowering plants can be safely consumed.",
    "These flowers offer unique, perfumed flavor notes and make an effortless addition to floral cakes because they don't need to be removed prior to serving.",
    "Some of the most common types of edible flowers include roses, begonias, chrysanthemums, daisies, dandelions and hibiscus.",
    "Each of these edibles can be distinguished by their subtle flavors, which should be used to enhance the flavor of the cake they're to be added to.",
    "Flowers like dandelion, chicory and calendula feature bright, zesty notes that can be used to offset the sweetness of a frosted cake, while mild herbal flowers like hibiscus and lavender work well with naked cakes and those garnished with fresh fruit.",
    "Though they are technically edible, it is not advisable to use more fragrant types of flowers like roses, carnations and jasmine as food additives, as the chemicals that lend them their characteristic scents can easily overpower the flavors of the confection.",
    "Wash the flowers thoroughly.",
    "Before you begin decorating, rinse the flower from petal to stem under a light stream of cool water.",
    "Just like with produce, you should wash flowers before putting them to culinary use to remove any traces of soil, bacteria or insects.",
    "Even if the flowers you’ve bought are organically grown, they should be rinsed to avoid contaminated food items.",
    "Be careful not to damage the delicate flower blossoms by rinsing them under too high a water pressure or scrubbing them by hand.",
    "Decorating the Top of the Cake Cut the stems short.",
    "Use a pair of scissors to snip the stems off about an inch below the blossom.",
    "This will leave you with a nub just the right length to insert into the cake.",
    "Soak the stems of the cut flowers in water for several minutes before decorating to wash away any remaining bacteria or juices.",
    "You should soak the stem even if you’ve already rinsed the flower.",
    "Flowers stems contain copious amounts of water mingled with botanical elements.",
    "These can seep into the cake if you’re not careful.",
    "Fresh flowers don't last long after they're cut, especially in hot temperatures.",
    "If possible, add the flowers to the cake right before you serve it.",
    "Consider using water tubes to protect the stems (and the cake) after cutting them and allow them to soak up some much-needed moisture.",
    "Wrap the stems to protect the cake.",
    "If you’ve shopped around for non-toxic organically grown flowers, there should be no problem with pressing the flower directly into the cake.",
    "However, if you’re still uncomfortable with the idea, go around the stems a couple of times with plastic wrap or aluminum foil before adding the flowers.",
    "This way, the stem never has to come into contact with the cake at all.",
    "You may also be able to find some long, cylindrical water tubes to use to cover the flower stems.",
    "These will keep the flowers fresh for longer, as well.",
    "As a possible alternative, roll fondant into thick shapes, place them on top of the cake and press the flowers into these rather than the cake itself.",
    "Insert the flowers into the top of the cake.",
    "Decide where you want each flower to go on top of the cake.",
    "Push the flower stem down through the cake’s surface, stopping just beneath the blossom so that none of the stem is visible.",
    "It will look like the blossom itself is resting gently on the cake.",
    "The flowers can be removed prior to serving or eating the cake.",
    "Snipping the stems at a sharp angle can help you penetrate the top layer of the cake without making a mess.",
    "Create custom arrangements.",
    "Group the flowers in clusters, or combine different types to create a cake bouquet.",
    "Take the same care you would in designing a flower arrangement for a table centerpiece.",
    "Once again, consider the occasion, as well as the kinds of flowers that are in season and will provide a pleasant aesthetic with the cake you’ve prepared.",
    "Roses and carnations make ideal floral decorations for a traditional wedding cake.",
    "Play around with different sizes of flowers as well as different colors.",
    "Using Flowers to Garnish the Cake Use whole flowers.",
    "For a simpler method of presentation, lay uncut flowers with long stems across the top of the cake, or on the platter around the based.",
    "Cut wax paper or roll a thin layer of fondant to cover the part of the cake that touches the flower.",
    "One or two whole flowers will make for a modestly beautiful look.",
    "Be sure to trim away any thorns, leaves or visible imperfections from the flower stems before situating them on the cake.",
    "Whole flowers can be used to spruce up naked or smaller cakes in a breeze.",
    "Place flowers between the cake layers.",
    "Rather than inserting flowers into the top of the cake, stick them between the layers on the outer edges of larger cakes.",
    "This will create the effect that the flowers are blooming out of the cake.",
    "Use foam dividers if you’re worried about damaging the layers or contaminating the cake.",
    "Place fresh flowers in a ring around the base, middle layers and top of the cake to create a festive border.",
    "Sprinkle flower petals around the base.",
    "Gently remove the petals from your flowers of choice.",
    "Be careful not to mash or tear them.",
    "Use a loose hand to sprinkle them around the base of the cake, or sparingly on top.",
    "Flower petals can give your cake an infusion of color and bohemian grace without the need to mess with soaking, cutting and arranging whole blossoms.",
    "Loose flowers petals can be picked off before serving, or eaten, provided that they belong to an edible species.",
    "Mix edible flowers with fresh fruit.",
    "Some types of flowers are safe to be actually eaten.",
    "Mix in a small amount of these flowers with fruit, candies and other confections for a dessert with bright, floral notes.",
    "Clover, marjoram and hibiscus are all common flower varieties that can make a great cake topper.",
    "It may be better to avoid decorating with especially fragrant types of edible flowers such as roses and jasmine, as the chemicals that produce their trademark scents can easily overpower the flavors of a cake.",
    "Use a light hand when finishing cakes with flowers that are meant to be eaten.",
    "Their petals can sometimes be dry, waxy and hard to chew and swallow in great quantities."
  ],
  "tyn_section":[
    "Cake",
    "Fresh flowers (organic, washed and/or edible)",
    "Scissors",
    "Masking tape, aluminum foil, plastic wrap or drinking straw (for wrapping stems)"
  ],
  "tyn_model":[
    "flowers",
    "cake",
    "roses",
    "water",
    "edible flowers",
    "hibiscus",
    "jasmine",
    "fondant",
    "flower petals",
    "florists",
    "florist",
    "flower nursery",
    "floral cakes",
    "begonias",
    "chrysanthemums",
    "daisies",
    "dandelions",
    "dandelion",
    "chicory",
    "calendula",
    "lavender",
    "carnations",
    "scissors",
    "plastic wrap",
    "aluminum foil",
    "wax paper",
    "clover",
    "marjoram",
    "cakes"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0689655172,
    "f1":0.1212121212,
    "avg_pos":0.0344827586
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0689655172,
    "f1":0.1212121212
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0689655172,
    "f1":0.1212121212
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0689655172,
    "f1":0.1212121212
  }
}