{
  "title":"How to Use a Heat Gun for Sealing Caps",
  "url":"https://www.wikihow.com/Use-a-Heat-Gun-for-Sealing-Caps",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Plastic"
  ],
  "methods":[
    {
      "name":"Seal Home Produced Bottles of Wine",
      "steps":[
        {
          "headline":"Understand that the plastic seals for wine bottles are not airtight.",
          "description":"These seals cover the neck of the bottle, which has a lip at the opening to give the seal a firm attachment point. Such seals do not extend over the cork. These seals leave the central part of the cork exposed so that the wine can breathe."
        },
        {
          "headline":"Obtain the wine bottle seals.",
          "description":"As home wine making is a popular hobby, there are many companies that provide these seals. Look for bottling and home wine making materials providers on the Internet. The seals usually will come with a tear-away band to remove seals already in place."
        },
        {
          "headline":"Place the wine bottle seal.",
          "description":"Slide the seal over the neck of the corked wine bottle with the tear-away band on the end of the seal closest to the bottle opening. Slide the seal down far enough that it wraps around the flared edge of the bottle opening, but will not close over the cork."
        },
        {
          "headline":"Seal the wine bottle.",
          "description":"Use the heat gun on a low setting. Move the stream of air over the seal without lingering in any single area. Rotating the bottle as heat is applied will help insure this. Do not let the tip of the heat gun make contact with the seal. Continue until the seal appears snug. Avoid over-shrinking the seal, which could cause the seal to crack."
        }
      ]
    },
    {
      "name":"Reseal a Partially Consumed Bottle That Has a Screw-On Cap",
      "steps":[
        {
          "headline":"Get an appropriate seal.",
          "description":"The seals for bottles with screw-on caps are commonly called shrink bands and resemble simple cylinders. Choose a seal that can slide easily over the top of the bottle while making minimal contact with the bottle. Shrink bands can be purchased online through bottling supply companies."
        },
        {
          "headline":"Apply the shrink band.",
          "description":"Slide the shrink band over the top of the bottle so that it covers both the top of the bottle neck and most, if not all, of the sides of the screw on cap."
        },
        {
          "headline":"Secure the seal.",
          "description":"Apply warm air from a heat gun set on low to the shrink band. Don't let the tip of the heat gun come in contact with the shrink band. Apply heat evenly over the surface of the shrink band and stop when the shrink band appears to be snug."
        }
      ]
    },
    {
      "name":"Preserve Contents of a Bottle that Has No Cap",
      "steps":[
        {
          "headline":"Consider the options.",
          "description":"Cylindrical shrink tubes will not seal at the open end of the bottle. The best option is to use a shrink cap that is already closed on one end. These caps are designed to insulate wire terminations and can be found on the Internet through wire and cabling companies and general electric supply houses."
        },
        {
          "headline":"Cap the bottle.",
          "description":"Place the shrink cap fully over the end of the bottle so that the closed end of the seal rests on the top of the bottle."
        },
        {
          "headline":"Shrink the cap.",
          "description":"Without overheating, work the warm air from the heat gun evenly over the surface of the cap until it is snug. Do not allow the tip of the heat gun to touch the cap."
        }
      ]
    }
  ],
  "text":" Seal Home Produced Bottles of Wine Understand that the plastic seals for wine bottles are not airtight. These seals cover the neck of the bottle, which has a lip at the opening to give the seal a firm attachment point. Such seals do not extend over the cork. These seals leave the central part of the cork exposed so that the wine can breathe. Obtain the wine bottle seals. As home wine making is a popular hobby, there are many companies that provide these seals. Look for bottling and home wine making materials providers on the Internet. The seals usually will come with a tear-away band to remove seals already in place. Place the wine bottle seal. Slide the seal over the neck of the corked wine bottle with the tear-away band on the end of the seal closest to the bottle opening. Slide the seal down far enough that it wraps around the flared edge of the bottle opening, but will not close over the cork. Seal the wine bottle. Use the heat gun on a low setting. Move the stream of air over the seal without lingering in any single area. Rotating the bottle as heat is applied will help insure this. Do not let the tip of the heat gun make contact with the seal. Continue until the seal appears snug. Avoid over-shrinking the seal, which could cause the seal to crack. Reseal a Partially Consumed Bottle That Has a Screw-On Cap Get an appropriate seal. The seals for bottles with screw-on caps are commonly called shrink bands and resemble simple cylinders. Choose a seal that can slide easily over the top of the bottle while making minimal contact with the bottle. Shrink bands can be purchased online through bottling supply companies. Apply the shrink band. Slide the shrink band over the top of the bottle so that it covers both the top of the bottle neck and most, if not all, of the sides of the screw on cap. Secure the seal. Apply warm air from a heat gun set on low to the shrink band. Don't let the tip of the heat gun come in contact with the shrink band. Apply heat evenly over the surface of the shrink band and stop when the shrink band appears to be snug. Preserve Contents of a Bottle that Has No Cap Consider the options. Cylindrical shrink tubes will not seal at the open end of the bottle. The best option is to use a shrink cap that is already closed on one end. These caps are designed to insulate wire terminations and can be found on the Internet through wire and cabling companies and general electric supply houses. Cap the bottle. Place the shrink cap fully over the end of the bottle so that the closed end of the seal rests on the top of the bottle. Shrink the cap. Without overheating, work the warm air from the heat gun evenly over the surface of the cap until it is snug. Do not allow the tip of the heat gun to touch the cap.",
  "sentences":[
    " Seal Home Produced Bottles of Wine Understand that the plastic seals for wine bottles are not airtight.",
    "These seals cover the neck of the bottle, which has a lip at the opening to give the seal a firm attachment point.",
    "Such seals do not extend over the cork.",
    "These seals leave the central part of the cork exposed so that the wine can breathe.",
    "Obtain the wine bottle seals.",
    "As home wine making is a popular hobby, there are many companies that provide these seals.",
    "Look for bottling and home wine making materials providers on the Internet.",
    "The seals usually will come with a tear-away band to remove seals already in place.",
    "Place the wine bottle seal.",
    "Slide the seal over the neck of the corked wine bottle with the tear-away band on the end of the seal closest to the bottle opening.",
    "Slide the seal down far enough that it wraps around the flared edge of the bottle opening, but will not close over the cork.",
    "Seal the wine bottle.",
    "Use the heat gun on a low setting.",
    "Move the stream of air over the seal without lingering in any single area.",
    "Rotating the bottle as heat is applied will help insure this.",
    "Do not let the tip of the heat gun make contact with the seal.",
    "Continue until the seal appears snug.",
    "Avoid over-shrinking the seal, which could cause the seal to crack.",
    "Reseal a Partially Consumed Bottle That Has a Screw-On Cap Get an appropriate seal.",
    "The seals for bottles with screw-on caps are commonly called shrink bands and resemble simple cylinders.",
    "Choose a seal that can slide easily over the top of the bottle while making minimal contact with the bottle.",
    "Shrink bands can be purchased online through bottling supply companies.",
    "Apply the shrink band.",
    "Slide the shrink band over the top of the bottle so that it covers both the top of the bottle neck and most, if not all, of the sides of the screw on cap.",
    "Secure the seal.",
    "Apply warm air from a heat gun set on low to the shrink band.",
    "Don't let the tip of the heat gun come in contact with the shrink band.",
    "Apply heat evenly over the surface of the shrink band and stop when the shrink band appears to be snug.",
    "Preserve Contents of a Bottle that Has No Cap Consider the options.",
    "Cylindrical shrink tubes will not seal at the open end of the bottle.",
    "The best option is to use a shrink cap that is already closed on one end.",
    "These caps are designed to insulate wire terminations and can be found on the Internet through wire and cabling companies and general electric supply houses.",
    "Cap the bottle.",
    "Place the shrink cap fully over the end of the bottle so that the closed end of the seal rests on the top of the bottle.",
    "Shrink the cap.",
    "Without overheating, work the warm air from the heat gun evenly over the surface of the cap until it is snug.",
    "Do not allow the tip of the heat gun to touch the cap."
  ],
  "tyn_section":[
    "Sealing cap",
    "Heat gun"
  ],
  "tyn_model":[
    "heat gun",
    "bottle",
    "wine bottle",
    "shrink band",
    "shrink cap",
    "wine bottles",
    "bottles",
    "shrink tubes",
    "electric supply houses"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1111111111,
    "f1":0.1818181818,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1111111111,
    "f1":0.1818181818
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2222222222,
    "f1":0.3636363636
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1111111111,
    "f1":0.1818181818
  }
}