{
  "title":"How to Prevent Mold in Laundry Room",
  "url":"https://www.wikihow.com/Prevent-Mold-in-Laundry-Room",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Mold and Mildew Treatment"
  ],
  "steps":[
    {
      "headline":"Dry all clothes as soon as they are done washing.",
      "description":"Damp clothes can produce mold on themselves and on anything they're touching."
    },
    {
      "headline":"Keep your laundry room as dry and as clean as you possibly can.",
      "description":"Moisture encourages the growth of mold. Since your washing machine uses water, make sure that your machine is as dry as it can be. Leave the lid of washing machine open when it's not in use. Soiled laundry and surfaces can also provide a breeding ground for mold to form and accumulate."
    },
    {
      "headline":"Do your laundry regularly.",
      "description":"Laundry that has food or grease stains on it are potential sources for mold growth, so don't let your dirty laundry pile up. Avoid letting damp laundry sit in your laundry room, whether in a machine or outside of one."
    },
    {
      "headline":"Place a dehumidifier in your laundry room.",
      "description":"Dehumidifiers can help keep the moisture in your laundry room under control. Try to keep humidity levels under 45 percent."
    },
    {
      "headline":"Ensure that your laundry room is properly ventilated.",
      "description":"Without adequate ventilation, moisture can accumulate. Open windows and doors when running your laundry machines. Also consider installing extra ventilation sources. Verify that ventilation is directed to the outside of your home. If it's not, you may be trapping more moisture and humidity in your laundry room."
    },
    {
      "headline":"Repair any water leaks that you see in the laundry room or in your washing machines.",
      "description":""
    },
    {
      "headline":"Invest in desiccants to place in your laundry room.",
      "description":"Desiccants like silica gel can help absorb the moisture that naturally presents in laundry rooms. Strategically place them in areas where moisture is produced and is bound to accumulate."
    },
    {
      "headline":"Keep your clothes exposed to air.",
      "description":"If you store clothes in bags made out of plastic, you might see an increase in the incidence of mold."
    },
    {
      "headline":"Pay special attention to the temperature and moisture conditions of your basement if your laundry machines are in it.",
      "description":"Basements have many opportunities to encourage mold growth. Condensation from air conditioners, pipes that leak, and the standing water linked to sump pumps can all increase the likelihood of mold growth. Combined with the heat associated with washing machines and dryers, these conditions provide a great breeding ground for mold."
    },
    {
      "headline":"Clean mold as soon as it appears.",
      "description":"Mold breeds rapidly so it's best to address the presence of mold as soon as you see it. Common household items like bleach and water can do wonders to control mold growth in your laundry room."
    }
  ],
  "text":" Dry all clothes as soon as they are done washing. Damp clothes can produce mold on themselves and on anything they're touching. Keep your laundry room as dry and as clean as you possibly can. Moisture encourages the growth of mold. Since your washing machine uses water, make sure that your machine is as dry as it can be. Leave the lid of washing machine open when it's not in use. Soiled laundry and surfaces can also provide a breeding ground for mold to form and accumulate. Do your laundry regularly. Laundry that has food or grease stains on it are potential sources for mold growth, so don't let your dirty laundry pile up. Avoid letting damp laundry sit in your laundry room, whether in a machine or outside of one. Place a dehumidifier in your laundry room. Dehumidifiers can help keep the moisture in your laundry room under control. Try to keep humidity levels under 45 percent. Ensure that your laundry room is properly ventilated. Without adequate ventilation, moisture can accumulate. Open windows and doors when running your laundry machines. Also consider installing extra ventilation sources. Verify that ventilation is directed to the outside of your home. If it's not, you may be trapping more moisture and humidity in your laundry room. Repair any water leaks that you see in the laundry room or in your washing machines.  Invest in desiccants to place in your laundry room. Desiccants like silica gel can help absorb the moisture that naturally presents in laundry rooms. Strategically place them in areas where moisture is produced and is bound to accumulate. Keep your clothes exposed to air. If you store clothes in bags made out of plastic, you might see an increase in the incidence of mold. Pay special attention to the temperature and moisture conditions of your basement if your laundry machines are in it. Basements have many opportunities to encourage mold growth. Condensation from air conditioners, pipes that leak, and the standing water linked to sump pumps can all increase the likelihood of mold growth. Combined with the heat associated with washing machines and dryers, these conditions provide a great breeding ground for mold. Clean mold as soon as it appears. Mold breeds rapidly so it's best to address the presence of mold as soon as you see it. Common household items like bleach and water can do wonders to control mold growth in your laundry room.",
  "sentences":[
    " Dry all clothes as soon as they are done washing.",
    "Damp clothes can produce mold on themselves and on anything they're touching.",
    "Keep your laundry room as dry and as clean as you possibly can.",
    "Moisture encourages the growth of mold.",
    "Since your washing machine uses water, make sure that your machine is as dry as it can be.",
    "Leave the lid of washing machine open when it's not in use.",
    "Soiled laundry and surfaces can also provide a breeding ground for mold to form and accumulate.",
    "Do your laundry regularly.",
    "Laundry that has food or grease stains on it are potential sources for mold growth, so don't let your dirty laundry pile up.",
    "Avoid letting damp laundry sit in your laundry room, whether in a machine or outside of one.",
    "Place a dehumidifier in your laundry room.",
    "Dehumidifiers can help keep the moisture in your laundry room under control.",
    "Try to keep humidity levels under 45 percent.",
    "Ensure that your laundry room is properly ventilated.",
    "Without adequate ventilation, moisture can accumulate.",
    "Open windows and doors when running your laundry machines.",
    "Also consider installing extra ventilation sources.",
    "Verify that ventilation is directed to the outside of your home.",
    "If it's not, you may be trapping more moisture and humidity in your laundry room.",
    "Repair any water leaks that you see in the laundry room or in your washing machines.",
    "Invest in desiccants to place in your laundry room.",
    "Desiccants like silica gel can help absorb the moisture that naturally presents in laundry rooms.",
    "Strategically place them in areas where moisture is produced and is bound to accumulate.",
    "Keep your clothes exposed to air.",
    "If you store clothes in bags made out of plastic, you might see an increase in the incidence of mold.",
    "Pay special attention to the temperature and moisture conditions of your basement if your laundry machines are in it.",
    "Basements have many opportunities to encourage mold growth.",
    "Condensation from air conditioners, pipes that leak, and the standing water linked to sump pumps can all increase the likelihood of mold growth.",
    "Combined with the heat associated with washing machines and dryers, these conditions provide a great breeding ground for mold.",
    "Clean mold as soon as it appears.",
    "Mold breeds rapidly so it's best to address the presence of mold as soon as you see it.",
    "Common household items like bleach and water can do wonders to control mold growth in your laundry room."
  ],
  "tyn_section":[
    "If you don't have a dehumidifier to put in your laundry room, you can use a fan in place of it."
  ],
  "tyn_model":[
    "water",
    "washing machine",
    "laundry",
    "dehumidifier",
    "dehumidifiers",
    "silica gel",
    "air conditioners",
    "washing machines",
    "bleach"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}