{
  "title":"How to Organize Your Bathroom",
  "url":"https://www.wikihow.com/Organize-Your-Bathroom",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "parts":[
    {
      "name":"Sorting Your Products",
      "steps":[
        {
          "headline":"Remove all items from your bathroom.",
          "description":"This includes items from the shower, counters, cabinets, and closets. Lay everything out on a flat surface or floor so you can see what you have."
        },
        {
          "headline":"Sort items by type.",
          "description":"For example: makeup, shampoo/conditioner, hair products, shaving products, soaps, lotions, medicine, first aid, oral hygiene, cleaning supplies, and anything else you happen to have."
        },
        {
          "headline":"Throw away anything you don't use.",
          "description":"If you haven't used it in a year, trash it. Throw away empty bottles or duplicates of stuff. This includes all expired products, including prescription and over-the-counter medicines."
        },
        {
          "headline":"Designate a storage bin for each category.",
          "description":"Label each bin: prescriptions, over-the-counter medicines, first aid, soaps, hair products, lotion, shaving products, etc. Clear bins are best, as you will easily be able to see exactly what is inside them."
        },
        {
          "headline":"Fill the bins.",
          "description":"Keep similar items together. Small items can be grouped in plastic bags before added to the bins. Make a few first aid kits by category - minor scrape, sprain, major cut, etc. This helps you avoid having to weed through a large box of stuff for a bandage. Separate the medications by type (allergy, cold and flu, headache, etc.) and store them in small containers. Place barrettes on a decorative strand of ribbon. Keep bobby pins together by attaching them to a magnetic strip. Use a metal file box to hold hair irons. Keep a basket just for the samples you receive so you can put it out for guests to use."
        }
      ]
    },
    {
      "name":"Preparing Your Space",
      "steps":[
        {
          "headline":"Clean your bathroom thoroughly.",
          "description":"Before you put the items back, clean the shower and tub, sink and counters, mirrors, toilet, and floors. Any room is much easier to clean when empty, and you’ll have your bathroom sparkling in a flash."
        },
        {
          "headline":"Decide what will go where.",
          "description":"Don’t replace any of your items yet. Just look at the bins you filled and decide where the best spot for each one is. Things you use every day should go in the bathroom closet and things you rarely use like extra shampoo or soap should go under the sink. Put towels and extra toilet paper on a shelf in the bathroom closet. Use organizers on the backs of the cabinet or closet doors to maximize your space. Fill them up with bottles, tub toys, and so on. Use a cutlery tray or a desk organizer in the drawer to organize your makeup."
        },
        {
          "headline":"Label the shelves in the closet and the medicine cabinet.",
          "description":"This will make it easier to find and put away items and to know when an item needs replaced."
        },
        {
          "headline":"Store only what you use often in the bathroom.",
          "description":"Keep the excess in an overflow space. This goes for items like barrettes, too. If you have too many, place some in a plastic bag and tuck them away for future use so you can shop at home when you need more."
        }
      ]
    },
    {
      "name":"Maintaining Your Space",
      "steps":[
        {
          "headline":"Tidy up daily.",
          "description":"A few minutes a day means no marathon cleaning sessions weekly. Keep touch-up cleaning supplies handy, like wipes for the sink. Make a new family rule to keep the bathroom clean. For example, “In our family, if we finish it, we replace it.\""
        },
        {
          "headline":"Keep the inside of the shower clutter-free.",
          "description":"Try giving each member of the family a shower caddy which they bring to the shower, use, and put back. A shelf in the linen closet is a good storage place."
        },
        {
          "headline":"Weed the medicine cabinet and closet bi-annually.",
          "description":"When you change the clocks, go through your cabinet and closet. Get rid of things you don’t need or use and make sure products are put in their designated bins."
        },
        {
          "headline":"Get rid of things you don’t need.",
          "description":"If you don’t use an item in six months, let it go."
        }
      ]
    }
  ],
  "text":" Sorting Your Products Remove all items from your bathroom. This includes items from the shower, counters, cabinets, and closets. Lay everything out on a flat surface or floor so you can see what you have. Sort items by type. For example: makeup, shampoo/conditioner, hair products, shaving products, soaps, lotions, medicine, first aid, oral hygiene, cleaning supplies, and anything else you happen to have. Throw away anything you don't use. If you haven't used it in a year, trash it. Throw away empty bottles or duplicates of stuff. This includes all expired products, including prescription and over-the-counter medicines. Designate a storage bin for each category. Label each bin: prescriptions, over-the-counter medicines, first aid, soaps, hair products, lotion, shaving products, etc. Clear bins are best, as you will easily be able to see exactly what is inside them. Fill the bins. Keep similar items together. Small items can be grouped in plastic bags before added to the bins. Make a few first aid kits by category - minor scrape, sprain, major cut, etc. This helps you avoid having to weed through a large box of stuff for a bandage. Separate the medications by type (allergy, cold and flu, headache, etc.) and store them in small containers. Place barrettes on a decorative strand of ribbon. Keep bobby pins together by attaching them to a magnetic strip. Use a metal file box to hold hair irons. Keep a basket just for the samples you receive so you can put it out for guests to use. Preparing Your Space Clean your bathroom thoroughly. Before you put the items back, clean the shower and tub, sink and counters, mirrors, toilet, and floors. Any room is much easier to clean when empty, and you’ll have your bathroom sparkling in a flash. Decide what will go where. Don’t replace any of your items yet. Just look at the bins you filled and decide where the best spot for each one is. Things you use every day should go in the bathroom closet and things you rarely use like extra shampoo or soap should go under the sink. Put towels and extra toilet paper on a shelf in the bathroom closet. Use organizers on the backs of the cabinet or closet doors to maximize your space. Fill them up with bottles, tub toys, and so on. Use a cutlery tray or a desk organizer in the drawer to organize your makeup. Label the shelves in the closet and the medicine cabinet. This will make it easier to find and put away items and to know when an item needs replaced. Store only what you use often in the bathroom. Keep the excess in an overflow space. This goes for items like barrettes, too. If you have too many, place some in a plastic bag and tuck them away for future use so you can shop at home when you need more. Maintaining Your Space Tidy up daily. A few minutes a day means no marathon cleaning sessions weekly. Keep touch-up cleaning supplies handy, like wipes for the sink. Make a new family rule to keep the bathroom clean. For example, “In our family, if we finish it, we replace it.\" Keep the inside of the shower clutter-free. Try giving each member of the family a shower caddy which they bring to the shower, use, and put back. A shelf in the linen closet is a good storage place. Weed the medicine cabinet and closet bi-annually. When you change the clocks, go through your cabinet and closet. Get rid of things you don’t need or use and make sure products are put in their designated bins. Get rid of things you don’t need. If you don’t use an item in six months, let it go.",
  "sentences":[
    " Sorting Your Products Remove all items from your bathroom.",
    "This includes items from the shower, counters, cabinets, and closets.",
    "Lay everything out on a flat surface or floor so you can see what you have.",
    "Sort items by type.",
    "For example: makeup, shampoo/conditioner, hair products, shaving products, soaps, lotions, medicine, first aid, oral hygiene, cleaning supplies, and anything else you happen to have.",
    "Throw away anything you don't use.",
    "If you haven't used it in a year, trash it.",
    "Throw away empty bottles or duplicates of stuff.",
    "This includes all expired products, including prescription and over-the-counter medicines.",
    "Designate a storage bin for each category.",
    "Label each bin: prescriptions, over-the-counter medicines, first aid, soaps, hair products, lotion, shaving products, etc.",
    "Clear bins are best, as you will easily be able to see exactly what is inside them.",
    "Fill the bins.",
    "Keep similar items together.",
    "Small items can be grouped in plastic bags before added to the bins.",
    "Make a few first aid kits by category - minor scrape, sprain, major cut, etc.",
    "This helps you avoid having to weed through a large box of stuff for a bandage.",
    "Separate the medications by type (allergy, cold and flu, headache, etc.)",
    "and store them in small containers.",
    "Place barrettes on a decorative strand of ribbon.",
    "Keep bobby pins together by attaching them to a magnetic strip.",
    "Use a metal file box to hold hair irons.",
    "Keep a basket just for the samples you receive so you can put it out for guests to use.",
    "Preparing Your Space Clean your bathroom thoroughly.",
    "Before you put the items back, clean the shower and tub, sink and counters, mirrors, toilet, and floors.",
    "Any room is much easier to clean when empty, and you’ll have your bathroom sparkling in a flash.",
    "Decide what will go where.",
    "Don’t replace any of your items yet.",
    "Just look at the bins you filled and decide where the best spot for each one is.",
    "Things you use every day should go in the bathroom closet and things you rarely use like extra shampoo or soap should go under the sink.",
    "Put towels and extra toilet paper on a shelf in the bathroom closet.",
    "Use organizers on the backs of the cabinet or closet doors to maximize your space.",
    "Fill them up with bottles, tub toys, and so on.",
    "Use a cutlery tray or a desk organizer in the drawer to organize your makeup.",
    "Label the shelves in the closet and the medicine cabinet.",
    "This will make it easier to find and put away items and to know when an item needs replaced.",
    "Store only what you use often in the bathroom.",
    "Keep the excess in an overflow space.",
    "This goes for items like barrettes, too.",
    "If you have too many, place some in a plastic bag and tuck them away for future use so you can shop at home when you need more.",
    "Maintaining Your Space Tidy up daily.",
    "A few minutes a day means no marathon cleaning sessions weekly.",
    "Keep touch-up cleaning supplies handy, like wipes for the sink.",
    "Make a new family rule to keep the bathroom clean.",
    "For example, “In our family, if we finish it, we replace it.\"",
    "Keep the inside of the shower clutter-free.",
    "Try giving each member of the family a shower caddy which they bring to the shower, use, and put back.",
    "A shelf in the linen closet is a good storage place.",
    "Weed the medicine cabinet and closet bi-annually.",
    "When you change the clocks, go through your cabinet and closet.",
    "Get rid of things you don’t need or use and make sure products are put in their designated bins.",
    "Get rid of things you don’t need.",
    "If you don’t use an item in six months, let it go."
  ],
  "tyn_section":[
    "Storage bins of various sizes",
    "Trash bags",
    "Antibacterial cleaner",
    "Mirror and sink cleaner",
    "Tub and tile cleaner"
  ],
  "tyn_model":[
    "soaps",
    "first aid",
    "barrettes",
    "lotions",
    "oral hygiene,",
    "storage bin",
    "over-the-counter medicines",
    "lotion",
    "plastic bags",
    "first aid kits",
    "ribbon",
    "bobby pins",
    "hair irons",
    "basket",
    "towels",
    "toilet paper",
    "organizers",
    "bottles",
    "“in",
    "shower",
    "shower caddy",
    "linen closet"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2,
    "p":0.0454545455,
    "f1":0.0740740741
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}