{
  "title":"How to Debone a Turkey Breast",
  "url":"https://www.wikihow.com/Debone-a-Turkey-Breast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes"
  ],
  "parts":[
    {
      "name":"Preparing to Debone Your Turkey",
      "steps":[
        {
          "headline":"Set aside some time.",
          "description":"If this is your first time deboning a turkey breast, schedule plenty of time to complete the task. Deboning a turkey breast will usually take about 10 minutes, but with practice you will become faster and more efficient."
        },
        {
          "headline":"Gather some supplies.",
          "description":"You are going to need a plastic cutting board; a sharp, thin boning knife; and of course a whole turkey breast. Additionally, make sure that your kitchen area is sanitary before you begin."
        },
        {
          "headline":"Wash your hands.",
          "description":"It is crucial to begin with sanitary hands, otherwise you could introduce bacteria into your turkey. Be sure to thoroughly wash your hands with soap and hot water. You will want to wash your hands again when you are finished."
        },
        {
          "headline":"Skip washing the turkey breast to avoid contaminating your kitchen.",
          "description":"Although you may have heard advice that washing poultry is a good idea, doing so increases your risk of food poisoning. That's because the water easily splashes, spreading bacteria across your work space, onto your cooking equipment, and onto your clothes. Additionally, the bacteria gets all over your hands. Don't wash your turkey before you debone it. It's really easy for water molecules to spread through the air, even if you don't see them. It takes a very small amount of the bacteria to make you sick, so don't risk it."
        },
        {
          "headline":"Keep your work space clean to minimize your food poisoning risk.",
          "description":"Put the turkey on a plastic cutting board that's only used for slicing meat. Make sure the turkey stays on the cutting board, and immediately wipe up any juices that spill over the sides. Place used utensils or dishes directly into your wash, and use an antibacterial soap or cleanser to clean up your work surface as soon as you're finished. Raw turkey will contaminate anything it touches with bacteria, so you need to be careful. Be sure to wash your hands thoroughly before touching anything other than the turkey or the utensils you're using to debone it. Additionally, scrub your hands well with an antibacterial soap when you're finished."
        },
        {
          "headline":"Remove the skin.",
          "description":"If you would like to prepare your turkey breast without skin, now is a good time to remove it. Using a slicing knife and your fingers, carefully peel back the skin and discard. Although this step is optional, it may make the deboning process easier."
        }
      ]
    },
    {
      "name":"Removing the Keel Bone",
      "steps":[
        {
          "headline":"Position the turkey.",
          "description":"Place the turkey breast with the skin-side down on a plastic cutting board. Position the pointed end so it is facing away from you. Be sure that you have plenty of elbow room around your cutting board to work."
        },
        {
          "headline":"Make a center slice.",
          "description":"Make a cut down the center of the breast all the way down to the bone. This may take several cuts. Make each cut deeper than the last until the bone is reached. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tVT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVanna Tran\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExperienced Cook\t\t\t\t\t\t\t\tVanna Tran is a home cook who started cooking with her mother at a very young age. She has catered events and hosted pop-up dinners in the San Francisco Bay Area for over 5 years. VT\t\t\t\t\tVanna Tran\t\t\tExperienced Cook\t\t\t\tExpert Trick: You always want to cut with a really sharp knife because that will prevent the meat from tearing and will get through the cartilage of the breast. Test your knife by holding a sheet of paper and slicing it vertically with the knife. If you can cut through it without much effort and without making tears, your knife is sharp enough!"
        },
        {
          "headline":"Locate the keel bone.",
          "description":"The keel bone is a dark triangular bone in the center of the breast. This is the first and more important bone to remove. You may want to pick up the breast and bend it backward a bit in order to better expose the keel bone."
        },
        {
          "headline":"Cut the cartilage.",
          "description":"Using your knife. slice through the cartilage found just above the keel bone. Once again, this may require several runs with your knife, moving deeper each time."
        },
        {
          "headline":"Remove the keel bone.",
          "description":"Pick up the breast and bend it backwards even more. Try to “pop out” the keel bone a bit by applying pressure with your fingers. Then using your hands and your knife, work to free the entire bone. Pull out the bone, as well as the cartilage. If the keel bone does not pop out easily, slide your fingers underneath it on one side, then the other, working to break up any cartilage. Once the cartilage is disconnected from the bone, it should come out easily."
        }
      ]
    },
    {
      "name":"Removing Additional Bones",
      "steps":[
        {
          "headline":"Locate the long bones.",
          "description":"There are two long bones (one on each side) that run the length of the breast. Find the two long bones, and use both hands to bend the bones backwards, loosening them."
        },
        {
          "headline":"Remove the long bones.",
          "description":"Use the knife to work your way around the bones and cartilage of the long bones. Work carefully to remove meat and cartilage until the bone is free. Repeat on the opposite side. Save as much meat as possible."
        },
        {
          "headline":"Locate and remove the wishbone.",
          "description":"The wishbone is a thin, V-shaped bone found right between the neck and the breast. By now, your wishbone should be loose enough to simply wiggle out. If needed, use your knife to free up any meat holding the wishbone in place, and remove it."
        },
        {
          "headline":"Clean up the breasts.",
          "description":"Remove the white tendon, as well as any loose connective tissue from the turkey breast. If desired, cut the turkey breasts into two halves. Using a sharp knife (your boning knife, or a more standard kitchen knife), slice down the center of the turkey breast longways. This will give you smaller servings to store and prepare."
        },
        {
          "headline":"Store your turkey.",
          "description":"Cover your raw turkey meat with plastic wrap, place it in a plastic bag, or seal it in another air-tight container. Your uncooked turkey will be OK in your refrigerator for 2-3 days. If you do not plan to use it in that time, it is best to place your air-tight container in the freezer, where it will last for several weeks. When you are ready to use it, thaw your turkey in the fridge overnight."
        },
        {
          "headline":"Clean up.",
          "description":"When you have finished, be sure to thoroughly cleanse your hands, your instruments, and your kitchen area. Whenever you work with raw poultry, be sure to use hot soapy water to disinfect everything."
        },
        {
          "headline":"Use your turkey if you're ready to cook it.",
          "description":"Once your turkey is deboned, you may be ready to cook it. Make sure you cook it thoroughly so that you don't risk food poisoning."
        }
      ]
    }
  ],
  "text":" Preparing to Debone Your Turkey Set aside some time. If this is your first time deboning a turkey breast, schedule plenty of time to complete the task. Deboning a turkey breast will usually take about 10 minutes, but with practice you will become faster and more efficient. Gather some supplies. You are going to need a plastic cutting board; a sharp, thin boning knife; and of course a whole turkey breast. Additionally, make sure that your kitchen area is sanitary before you begin. Wash your hands. It is crucial to begin with sanitary hands, otherwise you could introduce bacteria into your turkey. Be sure to thoroughly wash your hands with soap and hot water. You will want to wash your hands again when you are finished. Skip washing the turkey breast to avoid contaminating your kitchen. Although you may have heard advice that washing poultry is a good idea, doing so increases your risk of food poisoning. That's because the water easily splashes, spreading bacteria across your work space, onto your cooking equipment, and onto your clothes. Additionally, the bacteria gets all over your hands. Don't wash your turkey before you debone it. It's really easy for water molecules to spread through the air, even if you don't see them. It takes a very small amount of the bacteria to make you sick, so don't risk it. Keep your work space clean to minimize your food poisoning risk. Put the turkey on a plastic cutting board that's only used for slicing meat. Make sure the turkey stays on the cutting board, and immediately wipe up any juices that spill over the sides. Place used utensils or dishes directly into your wash, and use an antibacterial soap or cleanser to clean up your work surface as soon as you're finished. Raw turkey will contaminate anything it touches with bacteria, so you need to be careful. Be sure to wash your hands thoroughly before touching anything other than the turkey or the utensils you're using to debone it. Additionally, scrub your hands well with an antibacterial soap when you're finished. Remove the skin. If you would like to prepare your turkey breast without skin, now is a good time to remove it. Using a slicing knife and your fingers, carefully peel back the skin and discard. Although this step is optional, it may make the deboning process easier. Removing the Keel Bone Position the turkey. Place the turkey breast with the skin-side down on a plastic cutting board. Position the pointed end so it is facing away from you. Be sure that you have plenty of elbow room around your cutting board to work. Make a center slice. Make a cut down the center of the breast all the way down to the bone. This may take several cuts. Make each cut deeper than the last until the bone is reached. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tVT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVanna Tran\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExperienced Cook\t\t\t\t\t\t\t\tVanna Tran is a home cook who started cooking with her mother at a very young age. She has catered events and hosted pop-up dinners in the San Francisco Bay Area for over 5 years. VT\t\t\t\t\tVanna Tran\t\t\tExperienced Cook\t\t\t\tExpert Trick: You always want to cut with a really sharp knife because that will prevent the meat from tearing and will get through the cartilage of the breast. Test your knife by holding a sheet of paper and slicing it vertically with the knife. If you can cut through it without much effort and without making tears, your knife is sharp enough! Locate the keel bone. The keel bone is a dark triangular bone in the center of the breast. This is the first and more important bone to remove. You may want to pick up the breast and bend it backward a bit in order to better expose the keel bone. Cut the cartilage. Using your knife. slice through the cartilage found just above the keel bone. Once again, this may require several runs with your knife, moving deeper each time. Remove the keel bone. Pick up the breast and bend it backwards even more. Try to “pop out” the keel bone a bit by applying pressure with your fingers. Then using your hands and your knife, work to free the entire bone. Pull out the bone, as well as the cartilage. If the keel bone does not pop out easily, slide your fingers underneath it on one side, then the other, working to break up any cartilage. Once the cartilage is disconnected from the bone, it should come out easily. Removing Additional Bones Locate the long bones. There are two long bones (one on each side) that run the length of the breast. Find the two long bones, and use both hands to bend the bones backwards, loosening them. Remove the long bones. Use the knife to work your way around the bones and cartilage of the long bones. Work carefully to remove meat and cartilage until the bone is free. Repeat on the opposite side. Save as much meat as possible. Locate and remove the wishbone. The wishbone is a thin, V-shaped bone found right between the neck and the breast. By now, your wishbone should be loose enough to simply wiggle out. If needed, use your knife to free up any meat holding the wishbone in place, and remove it. Clean up the breasts. Remove the white tendon, as well as any loose connective tissue from the turkey breast. If desired, cut the turkey breasts into two halves. Using a sharp knife (your boning knife, or a more standard kitchen knife), slice down the center of the turkey breast longways. This will give you smaller servings to store and prepare. Store your turkey. Cover your raw turkey meat with plastic wrap, place it in a plastic bag, or seal it in another air-tight container. Your uncooked turkey will be OK in your refrigerator for 2-3 days. If you do not plan to use it in that time, it is best to place your air-tight container in the freezer, where it will last for several weeks. When you are ready to use it, thaw your turkey in the fridge overnight. Clean up. When you have finished, be sure to thoroughly cleanse your hands, your instruments, and your kitchen area. Whenever you work with raw poultry, be sure to use hot soapy water to disinfect everything. Use your turkey if you're ready to cook it. Once your turkey is deboned, you may be ready to cook it. Make sure you cook it thoroughly so that you don't risk food poisoning.",
  "sentences":[
    " Preparing to Debone Your Turkey Set aside some time.",
    "If this is your first time deboning a turkey breast, schedule plenty of time to complete the task.",
    "Deboning a turkey breast will usually take about 10 minutes, but with practice you will become faster and more efficient.",
    "Gather some supplies.",
    "You are going to need a plastic cutting board; a sharp, thin boning knife; and of course a whole turkey breast.",
    "Additionally, make sure that your kitchen area is sanitary before you begin.",
    "Wash your hands.",
    "It is crucial to begin with sanitary hands, otherwise you could introduce bacteria into your turkey.",
    "Be sure to thoroughly wash your hands with soap and hot water.",
    "You will want to wash your hands again when you are finished.",
    "Skip washing the turkey breast to avoid contaminating your kitchen.",
    "Although you may have heard advice that washing poultry is a good idea, doing so increases your risk of food poisoning.",
    "That's because the water easily splashes, spreading bacteria across your work space, onto your cooking equipment, and onto your clothes.",
    "Additionally, the bacteria gets all over your hands.",
    "Don't wash your turkey before you debone it.",
    "It's really easy for water molecules to spread through the air, even if you don't see them.",
    "It takes a very small amount of the bacteria to make you sick, so don't risk it.",
    "Keep your work space clean to minimize your food poisoning risk.",
    "Put the turkey on a plastic cutting board that's only used for slicing meat.",
    "Make sure the turkey stays on the cutting board, and immediately wipe up any juices that spill over the sides.",
    "Place used utensils or dishes directly into your wash, and use an antibacterial soap or cleanser to clean up your work surface as soon as you're finished.",
    "Raw turkey will contaminate anything it touches with bacteria, so you need to be careful.",
    "Be sure to wash your hands thoroughly before touching anything other than the turkey or the utensils you're using to debone it.",
    "Additionally, scrub your hands well with an antibacterial soap when you're finished.",
    "Remove the skin.",
    "If you would like to prepare your turkey breast without skin, now is a good time to remove it.",
    "Using a slicing knife and your fingers, carefully peel back the skin and discard.",
    "Although this step is optional, it may make the deboning process easier.",
    "Removing the Keel Bone Position the turkey.",
    "Place the turkey breast with the skin-side down on a plastic cutting board.",
    "Position the pointed end so it is facing away from you.",
    "Be sure that you have plenty of elbow room around your cutting board to work.",
    "Make a center slice.",
    "Make a cut down the center of the breast all the way down to the bone.",
    "This may take several cuts.",
    "Make each cut deeper than the last until the bone is reached.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tVT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVanna Tran\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExperienced Cook\t\t\t\t\t\t\t\tVanna Tran is a home cook who started cooking with her mother at a very young age.",
    "She has catered events and hosted pop-up dinners in the San Francisco Bay Area for over 5 years.",
    "VT\t\t\t\t\tVanna Tran\t\t\tExperienced Cook\t\t\t\tExpert Trick: You always want to cut with a really sharp knife because that will prevent the meat from tearing and will get through the cartilage of the breast.",
    "Test your knife by holding a sheet of paper and slicing it vertically with the knife.",
    "If you can cut through it without much effort and without making tears, your knife is sharp enough!",
    "Locate the keel bone.",
    "The keel bone is a dark triangular bone in the center of the breast.",
    "This is the first and more important bone to remove.",
    "You may want to pick up the breast and bend it backward a bit in order to better expose the keel bone.",
    "Cut the cartilage.",
    "Using your knife.",
    "slice through the cartilage found just above the keel bone.",
    "Once again, this may require several runs with your knife, moving deeper each time.",
    "Remove the keel bone.",
    "Pick up the breast and bend it backwards even more.",
    "Try to “pop out” the keel bone a bit by applying pressure with your fingers.",
    "Then using your hands and your knife, work to free the entire bone.",
    "Pull out the bone, as well as the cartilage.",
    "If the keel bone does not pop out easily, slide your fingers underneath it on one side, then the other, working to break up any cartilage.",
    "Once the cartilage is disconnected from the bone, it should come out easily.",
    "Removing Additional Bones Locate the long bones.",
    "There are two long bones (one on each side) that run the length of the breast.",
    "Find the two long bones, and use both hands to bend the bones backwards, loosening them.",
    "Remove the long bones.",
    "Use the knife to work your way around the bones and cartilage of the long bones.",
    "Work carefully to remove meat and cartilage until the bone is free.",
    "Repeat on the opposite side.",
    "Save as much meat as possible.",
    "Locate and remove the wishbone.",
    "The wishbone is a thin, V-shaped bone found right between the neck and the breast.",
    "By now, your wishbone should be loose enough to simply wiggle out.",
    "If needed, use your knife to free up any meat holding the wishbone in place, and remove it.",
    "Clean up the breasts.",
    "Remove the white tendon, as well as any loose connective tissue from the turkey breast.",
    "If desired, cut the turkey breasts into two halves.",
    "Using a sharp knife (your boning knife, or a more standard kitchen knife), slice down the center of the turkey breast longways.",
    "This will give you smaller servings to store and prepare.",
    "Store your turkey.",
    "Cover your raw turkey meat with plastic wrap, place it in a plastic bag, or seal it in another air-tight container.",
    "Your uncooked turkey will be OK in your refrigerator for 2-3 days.",
    "If you do not plan to use it in that time, it is best to place your air-tight container in the freezer, where it will last for several weeks.",
    "When you are ready to use it, thaw your turkey in the fridge overnight.",
    "Clean up.",
    "When you have finished, be sure to thoroughly cleanse your hands, your instruments, and your kitchen area.",
    "Whenever you work with raw poultry, be sure to use hot soapy water to disinfect everything.",
    "Use your turkey if you're ready to cook it.",
    "Once your turkey is deboned, you may be ready to cook it.",
    "Make sure you cook it thoroughly so that you don't risk food poisoning."
  ],
  "tyn_section":[
    "Bone-in turkey breast",
    "Plastic cutting board",
    "Boning knife",
    "Paper towels"
  ],
  "tyn_model":[
    "turkey",
    "knife",
    "water",
    "cartilage",
    "cutting board",
    "boning knife",
    "poultry",
    "antibacterial soap",
    "keel bone",
    "meat",
    "air-tight container",
    "soap",
    "dishes",
    "slicing knife",
    "tran",
    "home cook",
    "“pop",
    "” the",
    "plastic wrap",
    "plastic bag",
    "refrigerator",
    "freezer",
    "fridge"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0434782609,
    "f1":0.0740740741,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1304347826,
    "f1":0.2068965517
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2173913043,
    "f1":0.3370786517
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0869565217,
    "f1":0.1481481481
  }
}