{
  "title":"How to Squeeze a Lemon",
  "url":"https://www.wikihow.com/Squeeze-a-Lemon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Squeezing with Your Hands",
      "steps":[
        {
          "headline":"Roll the lemon firmly back and forth on your countertop before you cut it.",
          "description":"To loosen some of the juice from the pulp inside your lemon, try pressing firmly down on the lemon as you roll it back and forth on your countertop. This will help you to get the most juice out when you squeeze your lemon."
        },
        {
          "headline":"Slice your lemon crosswise down the middle.",
          "description":"Place your lemon in front of you with the pointed end parts facing out to the sides. Using a sharp knife, cut the lemon halfway down the middle, so that when you open it the inside looks like a pie cut into slices. To protect your countertop, place a cutting board down beneath your lemon before you slice it. Some people prefer to slice their lemon lengthwise, or pointed end to pointed end, when juicing it by hand. You can do this instead if you prefer."
        },
        {
          "headline":"Hold 1 lemon half over a bowl with the cut facing up.",
          "description":"Take half the lemon in the palm of your hand with the cut side facing up. If you turn the lemon with the cut facing down, the seeds will run out when you squeeze into your bowl. Holding the cut facing up allows most of the seeds to stay inside the lemon instead of getting into your bowl. A few seeds may fall down into your bowl even if you hold the lemon with the cut facing up. Just remove the seeds from your bowl with your fingers or a spoon when you’re finished juicing."
        },
        {
          "headline":"Squeeze the lemon half hard 3 times to get the juice out.",
          "description":"Press as firmly as you can as you squeeze the lemon in your palm. The juice will begin to run out over the sides of your hand. Squeeze at least 3 times, or more if you think there is still more juice in the lemon. Lemon juice may sting your hands if you have any open cuts or scratches on them. For the best results, wear thin rubber cooking gloves while squeezing your lemon. Repeat the squeezing steps with your other lemon half."
        },
        {
          "headline":"Press a spoon into the insides to release any remaining juice.",
          "description":"If there is any juice left inside your lemon, you can use a regular metal spoon to press the insides of the lemon. The remaining juice will come out of the pulp as you crush it with the spoon. To avoid getting seeds in your bowl, take the seeds out of your lemon half with your fingers before starting to press the lemon with your spoon."
        }
      ]
    },
    {
      "name":"Using a Citrus Press or Other Utensils",
      "steps":[
        {
          "headline":"Press your lemon firmly back and forth into your countertop.",
          "description":"To prep or “pre-squeeze” your lemon, roll it firmly into your countertop back and forth a few times. This will start to release juice from the pulp of your lemon before you cut it open."
        },
        {
          "headline":"Try putting the lemon in the microwave to prep it instead.",
          "description":"Another way to get more juice from your lemon is by warming it in the microwave for 10-30 seconds. When it’s finished, allow it to cool before slicing it. You can also do this in conjunction with rolling the lemon on the counter. Simply let the lemon cool until you can comfortably touch it and then press it into the counter while you roll it back and forth."
        },
        {
          "headline":"Cut the lemon crosswise down the middle.",
          "description":"When you’re using a tool to squeeze your lemon, the best way to get the most juice is by cutting it crosswise. Lay the lemon on a cutting board in front of you with the pointed sides facing out. Use a sharp knife to make 1 cut down the middle, cutting your lemon in half. Inside the cuts your lemon will look like a round pie cut into even slices."
        },
        {
          "headline":"Place the lemon skin-side down into your citrus press if you have one.",
          "description":"Get the most juice from your lemon by cutting a small piece out of its skin and placing it skin-side down into your citrus press, with the skin side against the point of the press. Squeeze the press together over a bowl, and your lemon skin will flip inside-out as it releases juice. Many people place the lemon into the press the other way, with the cut-side down against the point of the press. You can do this, but the lemon skin will not flip inside-out and you may not get as much juice out. Repeat this step for the other lemon half to juice your full lemon."
        },
        {
          "headline":"Squeeze your lemon between tongs if you have joint pain.",
          "description":"The added leverage of tongs will help you not have to squeeze as hard with your hands. Place your lemon half between a pair of salad tongs or tongs used for barbeque over a bowl and squeeze the tongs to release the juice from your lemon. To prevent the lemon’s seeds from falling into your bowl, try to hold your lemon with the cut side facing up as you squeeze it between the tongs."
        },
        {
          "headline":"Try pressing a fork into the center for a simple approach.",
          "description":"After your lemon is cut in half, insert a plain metal fork into the cut side. Squeeze your lemon over a bowl sideways and move the fork up and down as you squeeze. To get all the juice out, turn the fork several times and continue the up and down motion as you squeeze the lemon from multiple angles. Repeat the step for the other lemon half."
        },
        {
          "headline":"Use a mixer beater to squeeze juice out instead.",
          "description":"Holding a beater from a hand or electric mixer by its handle, press the beater into the cut side of your lemon half over a bowl, and twist the beater back and forth firmly. Squeeze the lemon as you twist the beater against its sides until all the juice is out. You’ll need a strainer for this step to catch seeds, or you’ll have to remove seeds with a spoon or your fingers."
        }
      ]
    }
  ],
  "text":" Squeezing with Your Hands Roll the lemon firmly back and forth on your countertop before you cut it. To loosen some of the juice from the pulp inside your lemon, try pressing firmly down on the lemon as you roll it back and forth on your countertop. This will help you to get the most juice out when you squeeze your lemon. Slice your lemon crosswise down the middle. Place your lemon in front of you with the pointed end parts facing out to the sides. Using a sharp knife, cut the lemon halfway down the middle, so that when you open it the inside looks like a pie cut into slices. To protect your countertop, place a cutting board down beneath your lemon before you slice it. Some people prefer to slice their lemon lengthwise, or pointed end to pointed end, when juicing it by hand. You can do this instead if you prefer. Hold 1 lemon half over a bowl with the cut facing up. Take half the lemon in the palm of your hand with the cut side facing up. If you turn the lemon with the cut facing down, the seeds will run out when you squeeze into your bowl. Holding the cut facing up allows most of the seeds to stay inside the lemon instead of getting into your bowl. A few seeds may fall down into your bowl even if you hold the lemon with the cut facing up. Just remove the seeds from your bowl with your fingers or a spoon when you’re finished juicing. Squeeze the lemon half hard 3 times to get the juice out. Press as firmly as you can as you squeeze the lemon in your palm. The juice will begin to run out over the sides of your hand. Squeeze at least 3 times, or more if you think there is still more juice in the lemon. Lemon juice may sting your hands if you have any open cuts or scratches on them. For the best results, wear thin rubber cooking gloves while squeezing your lemon. Repeat the squeezing steps with your other lemon half. Press a spoon into the insides to release any remaining juice. If there is any juice left inside your lemon, you can use a regular metal spoon to press the insides of the lemon. The remaining juice will come out of the pulp as you crush it with the spoon. To avoid getting seeds in your bowl, take the seeds out of your lemon half with your fingers before starting to press the lemon with your spoon. Using a Citrus Press or Other Utensils Press your lemon firmly back and forth into your countertop. To prep or “pre-squeeze” your lemon, roll it firmly into your countertop back and forth a few times. This will start to release juice from the pulp of your lemon before you cut it open. Try putting the lemon in the microwave to prep it instead. Another way to get more juice from your lemon is by warming it in the microwave for 10-30 seconds. When it’s finished, allow it to cool before slicing it. You can also do this in conjunction with rolling the lemon on the counter. Simply let the lemon cool until you can comfortably touch it and then press it into the counter while you roll it back and forth. Cut the lemon crosswise down the middle. When you’re using a tool to squeeze your lemon, the best way to get the most juice is by cutting it crosswise. Lay the lemon on a cutting board in front of you with the pointed sides facing out. Use a sharp knife to make 1 cut down the middle, cutting your lemon in half. Inside the cuts your lemon will look like a round pie cut into even slices. Place the lemon skin-side down into your citrus press if you have one. Get the most juice from your lemon by cutting a small piece out of its skin and placing it skin-side down into your citrus press, with the skin side against the point of the press. Squeeze the press together over a bowl, and your lemon skin will flip inside-out as it releases juice. Many people place the lemon into the press the other way, with the cut-side down against the point of the press. You can do this, but the lemon skin will not flip inside-out and you may not get as much juice out. Repeat this step for the other lemon half to juice your full lemon. Squeeze your lemon between tongs if you have joint pain. The added leverage of tongs will help you not have to squeeze as hard with your hands. Place your lemon half between a pair of salad tongs or tongs used for barbeque over a bowl and squeeze the tongs to release the juice from your lemon. To prevent the lemon’s seeds from falling into your bowl, try to hold your lemon with the cut side facing up as you squeeze it between the tongs. Try pressing a fork into the center for a simple approach. After your lemon is cut in half, insert a plain metal fork into the cut side. Squeeze your lemon over a bowl sideways and move the fork up and down as you squeeze. To get all the juice out, turn the fork several times and continue the up and down motion as you squeeze the lemon from multiple angles. Repeat the step for the other lemon half. Use a mixer beater to squeeze juice out instead. Holding a beater from a hand or electric mixer by its handle, press the beater into the cut side of your lemon half over a bowl, and twist the beater back and forth firmly. Squeeze the lemon as you twist the beater against its sides until all the juice is out. You’ll need a strainer for this step to catch seeds, or you’ll have to remove seeds with a spoon or your fingers.",
  "sentences":[
    " Squeezing with Your Hands Roll the lemon firmly back and forth on your countertop before you cut it.",
    "To loosen some of the juice from the pulp inside your lemon, try pressing firmly down on the lemon as you roll it back and forth on your countertop.",
    "This will help you to get the most juice out when you squeeze your lemon.",
    "Slice your lemon crosswise down the middle.",
    "Place your lemon in front of you with the pointed end parts facing out to the sides.",
    "Using a sharp knife, cut the lemon halfway down the middle, so that when you open it the inside looks like a pie cut into slices.",
    "To protect your countertop, place a cutting board down beneath your lemon before you slice it.",
    "Some people prefer to slice their lemon lengthwise, or pointed end to pointed end, when juicing it by hand.",
    "You can do this instead if you prefer.",
    "Hold 1 lemon half over a bowl with the cut facing up.",
    "Take half the lemon in the palm of your hand with the cut side facing up.",
    "If you turn the lemon with the cut facing down, the seeds will run out when you squeeze into your bowl.",
    "Holding the cut facing up allows most of the seeds to stay inside the lemon instead of getting into your bowl.",
    "A few seeds may fall down into your bowl even if you hold the lemon with the cut facing up.",
    "Just remove the seeds from your bowl with your fingers or a spoon when you’re finished juicing.",
    "Squeeze the lemon half hard 3 times to get the juice out.",
    "Press as firmly as you can as you squeeze the lemon in your palm.",
    "The juice will begin to run out over the sides of your hand.",
    "Squeeze at least 3 times, or more if you think there is still more juice in the lemon.",
    "Lemon juice may sting your hands if you have any open cuts or scratches on them.",
    "For the best results, wear thin rubber cooking gloves while squeezing your lemon.",
    "Repeat the squeezing steps with your other lemon half.",
    "Press a spoon into the insides to release any remaining juice.",
    "If there is any juice left inside your lemon, you can use a regular metal spoon to press the insides of the lemon.",
    "The remaining juice will come out of the pulp as you crush it with the spoon.",
    "To avoid getting seeds in your bowl, take the seeds out of your lemon half with your fingers before starting to press the lemon with your spoon.",
    "Using a Citrus Press or Other Utensils Press your lemon firmly back and forth into your countertop.",
    "To prep or “pre-squeeze” your lemon, roll it firmly into your countertop back and forth a few times.",
    "This will start to release juice from the pulp of your lemon before you cut it open.",
    "Try putting the lemon in the microwave to prep it instead.",
    "Another way to get more juice from your lemon is by warming it in the microwave for 10-30 seconds.",
    "When it’s finished, allow it to cool before slicing it.",
    "You can also do this in conjunction with rolling the lemon on the counter.",
    "Simply let the lemon cool until you can comfortably touch it and then press it into the counter while you roll it back and forth.",
    "Cut the lemon crosswise down the middle.",
    "When you’re using a tool to squeeze your lemon, the best way to get the most juice is by cutting it crosswise.",
    "Lay the lemon on a cutting board in front of you with the pointed sides facing out.",
    "Use a sharp knife to make 1 cut down the middle, cutting your lemon in half.",
    "Inside the cuts your lemon will look like a round pie cut into even slices.",
    "Place the lemon skin-side down into your citrus press if you have one.",
    "Get the most juice from your lemon by cutting a small piece out of its skin and placing it skin-side down into your citrus press, with the skin side against the point of the press.",
    "Squeeze the press together over a bowl, and your lemon skin will flip inside-out as it releases juice.",
    "Many people place the lemon into the press the other way, with the cut-side down against the point of the press.",
    "You can do this, but the lemon skin will not flip inside-out and you may not get as much juice out.",
    "Repeat this step for the other lemon half to juice your full lemon.",
    "Squeeze your lemon between tongs if you have joint pain.",
    "The added leverage of tongs will help you not have to squeeze as hard with your hands.",
    "Place your lemon half between a pair of salad tongs or tongs used for barbeque over a bowl and squeeze the tongs to release the juice from your lemon.",
    "To prevent the lemon’s seeds from falling into your bowl, try to hold your lemon with the cut side facing up as you squeeze it between the tongs.",
    "Try pressing a fork into the center for a simple approach.",
    "After your lemon is cut in half, insert a plain metal fork into the cut side.",
    "Squeeze your lemon over a bowl sideways and move the fork up and down as you squeeze.",
    "To get all the juice out, turn the fork several times and continue the up and down motion as you squeeze the lemon from multiple angles.",
    "Repeat the step for the other lemon half.",
    "Use a mixer beater to squeeze juice out instead.",
    "Holding a beater from a hand or electric mixer by its handle, press the beater into the cut side of your lemon half over a bowl, and twist the beater back and forth firmly.",
    "Squeeze the lemon as you twist the beater against its sides until all the juice is out.",
    "You’ll need a strainer for this step to catch seeds, or you’ll have to remove seeds with a spoon or your fingers."
  ],
  "tyn_section":[
    "Lemon",
    "Knife and cutting board",
    "Countertop",
    "Bowl",
    "Spoon",
    "Microwave (optional)",
    "Citrus press",
    "Tongs",
    "Fork",
    "Beater from a hand-held or electric mixer"
  ],
  "tyn_model":[
    "lemon",
    "bowl",
    "spoon",
    "fork",
    "citrus press",
    "microwave",
    "knife",
    "cooking gloves",
    "“pre",
    "” your",
    "cutting board",
    "sharp knife",
    "salad tongs",
    "mixer beater",
    "electric mixer",
    "strainer"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.3125,
    "f1":0.3846153846,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.5,
    "f1":0.6153846154
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.5,
    "f1":0.6153846154
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.3125,
    "f1":0.3846153846
  }
}