{
  "title":"How to Make a Natural Disinfectant",
  "url":"https://www.wikihow.com/Make-a-Natural-Disinfectant",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Making Vinegar-Based Disinfectants",
      "steps":[
        {
          "headline":"Make a basic vinegar-based spray.",
          "description":"In a standard-sized glass spray bottle, add 1 part water, 1 part vinegar and 5-15 drops of 100% essential oil. You can use whichever essential oil whose scent you prefer, or customize the scent according to what room in your home you are cleaning. Lemon essential oil is traditionally used to clean the kitchen, as the lemon scent can neutralize strong kitchen smells. Tea tree and eucalyptus oil are great for neutralizing bathroom odors. You may prefer to use milder smelling essential oils such as chamomile or vanilla in the parts of your houses where you are not worried about eliminating odors. Essential oils can sometimes react with plastic, which is why you should use a glass spray bottle."
        },
        {
          "headline":"Make disinfectant wipes.",
          "description":"If you want to make disinfectant wipes rather than a spray, follow the same recipe as if making a basic vinegar spray, but instead of putting the ingredients in a spray bottle, put them instead in a large glass jar and swirl them to combine. Cut 15-20 pieces of cloth in 10 inch (25.4 cm) squares and place them inside the jar of cleaner. Press down the cloths inside the glass jar so that they are submerged and can soak up the cleaner. Then place the lid on the top of the jar and store the wipes in a cupboard or pantry. To use the wipes, take out a wipe and wring it out to remove excess cleaner, then use it wipe surfaces clean."
        },
        {
          "headline":"Make a vinegar and baking soda spray.",
          "description":"In a clean bowl or bucket, add 4 cups (946.35 ml) hot water, ¼ cup (59.14 ml) white vinegar, and 2 tablespoons (29.57 ml) baking soda. Mix until the baking soda dissolves, then cut a lemon in half and squeeze both halves into the solution. Drop both rinds of the lemon into the mixture and wait for it to cool. Once cooled, add 4 drops of lemon essential oil or the essential oil of your choice. Strain the mixture through a fine sieve to remove any lemon pulp, seeds or rind, then transfer the mixture into a spray bottle."
        }
      ]
    },
    {
      "name":"Making Vodka-Based Disinfecting Sprays",
      "steps":[
        {
          "headline":"Make a basic vodka-based spray.",
          "description":"Add ½ cup (118.29 ml) vodka, ½ cup (118.29 ml) water, and about 50 drops of the essential oil or oils of your choice in a measuring cup. Then pour the mixture into a glass spray bottle. Make sure that you shake the spray bottle before using the disinfecting spray. Use 100% essential oils, as opposed to Therapeutic Grade oils, which are often only 5% oil."
        },
        {
          "headline":"Make a vodka-based spray with baking soda.",
          "description":"Combine 1 cup (236.58 ml) of water and ¼ cup (59.14 ml) of washing soda (sodium carbonate) or baking soda (sodium bicarbonate) in a large measuring cup. Stir to dissolve the baking soda, then add ½ cup (118.29 ml) of vodka and about 25 drops of essential oils. Stir to mix, then pour the disinfectant into a glass spray bottle. The baking soda is an additional element that helps to clean as well as disinfect the surface."
        },
        {
          "headline":"Make a vodka and vinegar spray.",
          "description":"Combine ½ cup (118.29 ml) of white vinegar, ½ cup (118.29 ml) of vodka, 1 ½ cups (354.88 ml) of water, and 20 drops of essential oils in a large measuring cup. Mix, then pour the mixture into a glass spray bottle."
        }
      ]
    },
    {
      "name":"Making Rubbing Alcohol and Hydrogen Peroxide-Based Disinfectants",
      "steps":[
        {
          "headline":"Make a basic rubbing alcohol spray.",
          "description":"Combine one part water and one part rubbing alcohol in a spray bottle and shake to mix up the two ingredients. Rubbing alcohol is a highly effective disinfectant and is often used on medical devices."
        },
        {
          "headline":"Make an herbal rubbing alcohol spray.",
          "description":"Pour 10-30 drops of thyme essential oil or another essential oil of your choice into an 8- ounce (236.58 ml) glass spray bottle. Add 1 ounce (29.57 ml) of rubbing alcohol, then fill the spray bottle up with water until it reaches the top. Shake to mix the ingredients and store in a cupboard or pantry."
        },
        {
          "headline":"Use a vinegar and hydrogen peroxide combination.",
          "description":"Vinegar and hydrogen peroxide work well to disinfect, but they should not be combined in a single container as they make a peracetic acid which can be hazardous. Instead, add undiluted white vinegar to one spray bottle and 3% hydrogen peroxide to another. To use, clean a surface, then spray with one mixture, let it sit for about 5 minutes, then wipe with a clean cloth and spray with the other. Let it sit for 5 minutes and then wipe with another clean cloth. It does not matter if you start with the vinegar or with the rubbing alcohol."
        }
      ]
    },
    {
      "name":"Using the Disinfectant Spray",
      "steps":[
        {
          "headline":"Clean the surface.",
          "description":"Disinfecting does not clean the surface or remove dirt or any other buildup, so it’s important to thoroughly clean the surface before disinfecting. Clean with a natural or organic cleaner if you are looking to avoid harsh chemicals."
        },
        {
          "headline":"Shake the spray.",
          "description":"Shake the spray thoroughly to make sure that all the ingredients of the spray are mixed and that the spray will be effective."
        },
        {
          "headline":"Spray the surface thoroughly with disinfectant spray.",
          "description":"Hold the spray bottle of natural disinfectant an arm’s length from the surface you need to disinfect and spray thoroughly. Spray all the surfaces you are disinfecting if you are disinfecting multiple surfaces."
        },
        {
          "headline":"Let the spray sit for 10 minutes.",
          "description":"Wait for about 10 minutes to let the disinfectant sit and more effectively attach to and eliminate germs. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tOur Expert Agrees: Natural cleaners tend to be milder than chemical ones. It's important to let the disinfectant sit for 10 or more minutes so that the cleaner can do its job."
        },
        {
          "headline":"Wipe with a microfiber cloth.",
          "description":"After 10 minutes, wipe the disinfected surface with a microfiber cloth. If you’ve cleaned multiple surfaces in a kitchen or bathroom, use a separate cloth for each surface to avoid contamination."
        }
      ]
    }
  ],
  "text":" Making Vinegar-Based Disinfectants Make a basic vinegar-based spray. In a standard-sized glass spray bottle, add 1 part water, 1 part vinegar and 5-15 drops of 100% essential oil. You can use whichever essential oil whose scent you prefer, or customize the scent according to what room in your home you are cleaning. Lemon essential oil is traditionally used to clean the kitchen, as the lemon scent can neutralize strong kitchen smells. Tea tree and eucalyptus oil are great for neutralizing bathroom odors. You may prefer to use milder smelling essential oils such as chamomile or vanilla in the parts of your houses where you are not worried about eliminating odors. Essential oils can sometimes react with plastic, which is why you should use a glass spray bottle. Make disinfectant wipes. If you want to make disinfectant wipes rather than a spray, follow the same recipe as if making a basic vinegar spray, but instead of putting the ingredients in a spray bottle, put them instead in a large glass jar and swirl them to combine. Cut 15-20 pieces of cloth in 10 inch (25.4 cm) squares and place them inside the jar of cleaner. Press down the cloths inside the glass jar so that they are submerged and can soak up the cleaner. Then place the lid on the top of the jar and store the wipes in a cupboard or pantry. To use the wipes, take out a wipe and wring it out to remove excess cleaner, then use it wipe surfaces clean. Make a vinegar and baking soda spray. In a clean bowl or bucket, add 4 cups (946.35 ml) hot water, ¼ cup (59.14 ml) white vinegar, and 2 tablespoons (29.57 ml) baking soda. Mix until the baking soda dissolves, then cut a lemon in half and squeeze both halves into the solution. Drop both rinds of the lemon into the mixture and wait for it to cool. Once cooled, add 4 drops of lemon essential oil or the essential oil of your choice. Strain the mixture through a fine sieve to remove any lemon pulp, seeds or rind, then transfer the mixture into a spray bottle. Making Vodka-Based Disinfecting Sprays Make a basic vodka-based spray. Add ½ cup (118.29 ml) vodka, ½ cup (118.29 ml) water, and about 50 drops of the essential oil or oils of your choice in a measuring cup. Then pour the mixture into a glass spray bottle. Make sure that you shake the spray bottle before using the disinfecting spray. Use 100% essential oils, as opposed to Therapeutic Grade oils, which are often only 5% oil. Make a vodka-based spray with baking soda. Combine 1 cup (236.58 ml) of water and ¼ cup (59.14 ml) of washing soda (sodium carbonate) or baking soda (sodium bicarbonate) in a large measuring cup. Stir to dissolve the baking soda, then add ½ cup (118.29 ml) of vodka and about 25 drops of essential oils. Stir to mix, then pour the disinfectant into a glass spray bottle. The baking soda is an additional element that helps to clean as well as disinfect the surface. Make a vodka and vinegar spray. Combine ½ cup (118.29 ml) of white vinegar, ½ cup (118.29 ml) of vodka, 1 ½ cups (354.88 ml) of water, and 20 drops of essential oils in a large measuring cup. Mix, then pour the mixture into a glass spray bottle. Making Rubbing Alcohol and Hydrogen Peroxide-Based Disinfectants Make a basic rubbing alcohol spray. Combine one part water and one part rubbing alcohol in a spray bottle and shake to mix up the two ingredients. Rubbing alcohol is a highly effective disinfectant and is often used on medical devices. Make an herbal rubbing alcohol spray. Pour 10-30 drops of thyme essential oil or another essential oil of your choice into an 8- ounce (236.58 ml) glass spray bottle. Add 1 ounce (29.57 ml) of rubbing alcohol, then fill the spray bottle up with water until it reaches the top. Shake to mix the ingredients and store in a cupboard or pantry. Use a vinegar and hydrogen peroxide combination. Vinegar and hydrogen peroxide work well to disinfect, but they should not be combined in a single container as they make a peracetic acid which can be hazardous. Instead, add undiluted white vinegar to one spray bottle and 3% hydrogen peroxide to another. To use, clean a surface, then spray with one mixture, let it sit for about 5 minutes, then wipe with a clean cloth and spray with the other. Let it sit for 5 minutes and then wipe with another clean cloth. It does not matter if you start with the vinegar or with the rubbing alcohol. Using the Disinfectant Spray Clean the surface. Disinfecting does not clean the surface or remove dirt or any other buildup, so it’s important to thoroughly clean the surface before disinfecting. Clean with a natural or organic cleaner if you are looking to avoid harsh chemicals. Shake the spray. Shake the spray thoroughly to make sure that all the ingredients of the spray are mixed and that the spray will be effective. Spray the surface thoroughly with disinfectant spray. Hold the spray bottle of natural disinfectant an arm’s length from the surface you need to disinfect and spray thoroughly. Spray all the surfaces you are disinfecting if you are disinfecting multiple surfaces. Let the spray sit for 10 minutes. Wait for about 10 minutes to let the disinfectant sit and more effectively attach to and eliminate germs. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tOur Expert Agrees: Natural cleaners tend to be milder than chemical ones. It's important to let the disinfectant sit for 10 or more minutes so that the cleaner can do its job. Wipe with a microfiber cloth. After 10 minutes, wipe the disinfected surface with a microfiber cloth. If you’ve cleaned multiple surfaces in a kitchen or bathroom, use a separate cloth for each surface to avoid contamination.",
  "sentences":[
    " Making Vinegar-Based Disinfectants Make a basic vinegar-based spray.",
    "In a standard-sized glass spray bottle, add 1 part water, 1 part vinegar and 5-15 drops of 100% essential oil.",
    "You can use whichever essential oil whose scent you prefer, or customize the scent according to what room in your home you are cleaning.",
    "Lemon essential oil is traditionally used to clean the kitchen, as the lemon scent can neutralize strong kitchen smells.",
    "Tea tree and eucalyptus oil are great for neutralizing bathroom odors.",
    "You may prefer to use milder smelling essential oils such as chamomile or vanilla in the parts of your houses where you are not worried about eliminating odors.",
    "Essential oils can sometimes react with plastic, which is why you should use a glass spray bottle.",
    "Make disinfectant wipes.",
    "If you want to make disinfectant wipes rather than a spray, follow the same recipe as if making a basic vinegar spray, but instead of putting the ingredients in a spray bottle, put them instead in a large glass jar and swirl them to combine.",
    "Cut 15-20 pieces of cloth in 10 inch (25.4 cm) squares and place them inside the jar of cleaner.",
    "Press down the cloths inside the glass jar so that they are submerged and can soak up the cleaner.",
    "Then place the lid on the top of the jar and store the wipes in a cupboard or pantry.",
    "To use the wipes, take out a wipe and wring it out to remove excess cleaner, then use it wipe surfaces clean.",
    "Make a vinegar and baking soda spray.",
    "In a clean bowl or bucket, add 4 cups (946.35 ml) hot water, ¼ cup (59.14 ml) white vinegar, and 2 tablespoons (29.57 ml) baking soda.",
    "Mix until the baking soda dissolves, then cut a lemon in half and squeeze both halves into the solution.",
    "Drop both rinds of the lemon into the mixture and wait for it to cool.",
    "Once cooled, add 4 drops of lemon essential oil or the essential oil of your choice.",
    "Strain the mixture through a fine sieve to remove any lemon pulp, seeds or rind, then transfer the mixture into a spray bottle.",
    "Making Vodka-Based Disinfecting Sprays Make a basic vodka-based spray.",
    "Add ½ cup (118.29 ml) vodka, ½ cup (118.29 ml) water, and about 50 drops of the essential oil or oils of your choice in a measuring cup.",
    "Then pour the mixture into a glass spray bottle.",
    "Make sure that you shake the spray bottle before using the disinfecting spray.",
    "Use 100% essential oils, as opposed to Therapeutic Grade oils, which are often only 5% oil.",
    "Make a vodka-based spray with baking soda.",
    "Combine 1 cup (236.58 ml) of water and ¼ cup (59.14 ml) of washing soda (sodium carbonate) or baking soda (sodium bicarbonate) in a large measuring cup.",
    "Stir to dissolve the baking soda, then add ½ cup (118.29 ml) of vodka and about 25 drops of essential oils.",
    "Stir to mix, then pour the disinfectant into a glass spray bottle.",
    "The baking soda is an additional element that helps to clean as well as disinfect the surface.",
    "Make a vodka and vinegar spray.",
    "Combine ½ cup (118.29 ml) of white vinegar, ½ cup (118.29 ml) of vodka, 1 ½ cups (354.88 ml) of water, and 20 drops of essential oils in a large measuring cup.",
    "Mix, then pour the mixture into a glass spray bottle.",
    "Making Rubbing Alcohol and Hydrogen Peroxide-Based Disinfectants Make a basic rubbing alcohol spray.",
    "Combine one part water and one part rubbing alcohol in a spray bottle and shake to mix up the two ingredients.",
    "Rubbing alcohol is a highly effective disinfectant and is often used on medical devices.",
    "Make an herbal rubbing alcohol spray.",
    "Pour 10-30 drops of thyme essential oil or another essential oil of your choice into an 8- ounce (236.58 ml) glass spray bottle.",
    "Add 1 ounce (29.57 ml) of rubbing alcohol, then fill the spray bottle up with water until it reaches the top.",
    "Shake to mix the ingredients and store in a cupboard or pantry.",
    "Use a vinegar and hydrogen peroxide combination.",
    "Vinegar and hydrogen peroxide work well to disinfect, but they should not be combined in a single container as they make a peracetic acid which can be hazardous.",
    "Instead, add undiluted white vinegar to one spray bottle and 3% hydrogen peroxide to another.",
    "To use, clean a surface, then spray with one mixture, let it sit for about 5 minutes, then wipe with a clean cloth and spray with the other.",
    "Let it sit for 5 minutes and then wipe with another clean cloth.",
    "It does not matter if you start with the vinegar or with the rubbing alcohol.",
    "Using the Disinfectant Spray Clean the surface.",
    "Disinfecting does not clean the surface or remove dirt or any other buildup, so it’s important to thoroughly clean the surface before disinfecting.",
    "Clean with a natural or organic cleaner if you are looking to avoid harsh chemicals.",
    "Shake the spray.",
    "Shake the spray thoroughly to make sure that all the ingredients of the spray are mixed and that the spray will be effective.",
    "Spray the surface thoroughly with disinfectant spray.",
    "Hold the spray bottle of natural disinfectant an arm’s length from the surface you need to disinfect and spray thoroughly.",
    "Spray all the surfaces you are disinfecting if you are disinfecting multiple surfaces.",
    "Let the spray sit for 10 minutes.",
    "Wait for about 10 minutes to let the disinfectant sit and more effectively attach to and eliminate germs.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015.",
    "Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018.",
    "Chris Willatt\t\t\tCleaning Guru\t\t\t\tOur Expert Agrees: Natural cleaners tend to be milder than chemical ones.",
    "It's important to let the disinfectant sit for 10 or more minutes so that the cleaner can do its job.",
    "Wipe with a microfiber cloth.",
    "After 10 minutes, wipe the disinfected surface with a microfiber cloth.",
    "If you’ve cleaned multiple surfaces in a kitchen or bathroom, use a separate cloth for each surface to avoid contamination."
  ],
  "tyn_section":[
    "Essential oil(s) of your choice",
    "Microfiber cloth",
    "Cotton cloths",
    "White vinegar",
    "Baking soda",
    "Rubbing alcohol",
    "3% hydrogen peroxide",
    "Glass spray bottle"
  ],
  "tyn_model":[
    "spray bottle",
    "baking soda",
    "rubbing alcohol",
    "vinegar",
    "water",
    "essential oils",
    "essential oil",
    "white vinegar",
    "vodka",
    "glass spray bottle",
    "hydrogen peroxide",
    "disinfectant wipes",
    "large measuring cup",
    "disinfectant spray",
    "microfiber cloth",
    "100% essential oil",
    "tea tree and",
    "vanilla",
    "vinegar spray",
    "glass jar",
    "bowl",
    "hot water",
    "lemon",
    "lemon essential oil",
    "fine sieve",
    "vodka-based spray",
    "measuring cup",
    "washing soda",
    "vodka and vinegar",
    "hydrogen peroxide-based disinfectants",
    "thyme essential oil",
    "natural or organic cleaner",
    "natural disinfectant",
    "disinfectant",
    "alpine maids,",
    "cleaning agency",
    "alpine maids has",
    "cleaners",
    "cleaner"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.1282051282,
    "f1":0.2127659574,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.2051282051,
    "f1":0.322147651
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2564102564,
    "f1":0.3821656051
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.1794871795,
    "f1":0.2896551724
  }
}