{
  "title":"How to Make Indian Milk Tea",
  "url":"https://www.wikihow.com/Make-Indian-Milk-Tea",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Tea",
    "Milk Tea"
  ],
  "steps":[
    {
      "headline":"Set a metallic saucepan on the stove top or hob.",
      "description":"Pour three quarters of a cup of water into it. Allow the water to boil for a few minutes on a low flame. Then add two teaspoons of tea leaves or powder, continuing to boil on the same flame."
    },
    {
      "headline":"Add the piece of freshly crushed ginger and four green cardamoms.",
      "description":"Crystallized sugar can also be added, according to your taste. Simmer."
    },
    {
      "headline":"Add quarter cup of warmed low fat milk.",
      "description":""
    },
    {
      "headline":"Pour the solution from the saucepan to the teacup with the help of a tea strainer.",
      "description":"Stir it."
    },
    {
      "headline":"Serve the Indian tea hot.",
      "description":"If you are creative in garnishing, you can always add a natural tea leaf on the tea before serving. (Do not add more than one, as tea leaves will become intense in taste, which makes the tea taste bitter)."
    }
  ],
  "text":" Set a metallic saucepan on the stove top or hob. Pour three quarters of a cup of water into it. Allow the water to boil for a few minutes on a low flame. Then add two teaspoons of tea leaves or powder, continuing to boil on the same flame. Add the piece of freshly crushed ginger and four green cardamoms. Crystallized sugar can also be added, according to your taste. Simmer. Add quarter cup of warmed low fat milk.  Pour the solution from the saucepan to the teacup with the help of a tea strainer. Stir it. Serve the Indian tea hot. If you are creative in garnishing, you can always add a natural tea leaf on the tea before serving. (Do not add more than one, as tea leaves will become intense in taste, which makes the tea taste bitter).",
  "sentences":[
    " Set a metallic saucepan on the stove top or hob.",
    "Pour three quarters of a cup of water into it.",
    "Allow the water to boil for a few minutes on a low flame.",
    "Then add two teaspoons of tea leaves or powder, continuing to boil on the same flame.",
    "Add the piece of freshly crushed ginger and four green cardamoms.",
    "Crystallized sugar can also be added, according to your taste.",
    "Simmer.",
    "Add quarter cup of warmed low fat milk.",
    "Pour the solution from the saucepan to the teacup with the help of a tea strainer.",
    "Stir it.",
    "Serve the Indian tea hot.",
    "If you are creative in garnishing, you can always add a natural tea leaf on the tea before serving.",
    "(Do not add more than one, as tea leaves will become intense in taste, which makes the tea taste bitter)."
  ],
  "tyn_section":[
    "Metallic saucepan",
    "Water",
    "Tea strainer"
  ],
  "tyn_model":[
    "saucepan",
    "water",
    "tea leaves",
    "stove top or hob",
    "ginger",
    "green cardamoms",
    "sugar",
    "low fat milk",
    "teacup",
    "tea strainer",
    "tea leaf"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1818181818,
    "f1":0.2857142857,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.2727272727,
    "f1":0.4285714286
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4545454545,
    "f1":0.625
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1818181818,
    "f1":0.2857142857
  }
}