{
  "title":"How to Clean Coffee Stains",
  "url":"https://www.wikihow.com/Clean-Coffee-Stains",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee"
  ],
  "methods":[
    {
      "name":"Cleaning Your Clothes",
      "steps":[
        {
          "headline":"Blot the coffee stain immediately.",
          "description":"If the stain is still damp, blot with paper towels or tissue. Use a blotting, up-and-down lifting motion to soak up the coffee. Do not rub the paper towel from side to side because this may spread the stain. Use white paper towels because towels with patterns could leak dye onto the fabric and create even worse stains. Blotting immediately helps remove any excess liquid and some of the chemicals that cause coffee to stain. Blotting will also make your clothes receptive to the other steps."
        },
        {
          "headline":"Rinse with cold water.",
          "description":"Place the stain under running water for 3 to 5 minutes. Cold tap water is the best temperature. Gently rub the stain every minute to help remove the stain. You may need to do this 2 or 3 times. Rinse the back of the cloth where the stain is located. Do not rinse the top surface of the stain directly yet because rinsing the stained surface may cause the stain to spread."
        },
        {
          "headline":"Add liquid laundry detergent.",
          "description":"If the stain is still there after you have rinsed with cold water, rub a small amount of liquid laundry detergent on the stain. Make sure the area is still moist before you rub it in. Let the detergent sit for 5 minutes, and then rub it gently again. Now rinse with cold water. Spread the detergent on both surfaces of the coffee-stained material, front and back."
        },
        {
          "headline":"Mix detergent and white vinegar.",
          "description":"If laundry detergent alone does not work, mix powdered laundry detergent and equal parts white vinegar and cold water in a small bowl to make a paste. The paste should be the same consistency as toothpaste. Make enough to cover both sides of the stain, front and back. Test a small part of the fabric that cannot be seen with the paste to make sure the paste won't discolor the fabric. Let the paste sit for 5 minutes and then use a nail brush or toothbrush to rub both sides of the stain in a circular motion. Rinse the stain with cold water when you are finished."
        },
        {
          "headline":"Use a stain stick.",
          "description":"If the stain still has not come out, use a stain stick. Apply the stain stick and allow it to sit for 5 to 10 minutes. Then wash the clothing according to the instructions on the tag. Make sure the stain is gone before you place your clothing in the dryer. If the stain is still there, do not place the item in the dryer. The heat from the dryer will set your stain. Either wash your garment again or take it to the dry cleaner for a professional cleaning. Choose a laundry detergent that is formulated to remove stains. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle. She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices. Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tExpert Trick: To clean a fresh coffee stain off of your clothing, pour regular table salt over the stain and let the salt soak it up as much as possible. When the salt is dry, wipe it off and cover the stain with baking soda. Let that sit for a while, then scrub the area with a paste of baking soda and a little water. Finally, soak the stain with white vinegar, then blot it with a white paper towel before washing the garment with bleach."
        }
      ]
    },
    {
      "name":"Removing Stains from Carpet and Furniture",
      "steps":[
        {
          "headline":"Apply detergent.",
          "description":"Mix ¼ teaspoon of clear hand dishwashing detergent with 1 cup of warm water. Use a white towel or paper towel to apply the detergent to the stain. Gently blot the stain and let the detergent sit for 3 to 5 minutes. If the stain is gone, apply water to a clean paper towel or towel and blot the stain. After you rinse leave a ½ inch pad of white paper towels on the stain overnight. Place a weight (e.g. glass or ceramic object, paperweight) on top of the paper towels. The pad will soak up any remaining liquid."
        },
        {
          "headline":"Apply a hydrogen peroxide, ammonia mixture.",
          "description":"If the detergent does not work, mix ½ cup hydrogen peroxide with 1 teaspoon of undiluted, unscented household ammonia. Use a white paper towel or towel to apply the mixture to the stain. Place a piece of plastic wrap and a weight (e.g. glass or ceramic object, paperweight) on top of the stain and allow the mixture to sit for 2 or 3 hours. The weight should be color safe and not bleed when it gets wet. Use the hydrogen peroxide, ammonia mixture within 22 hours of making it. You may have to apply the mixture multiple times until the stain is gone."
        },
        {
          "headline":"Rinse stain with water.",
          "description":"Once the stain is removed, use a white towel or paper towel to apply cold water. Blot the area and do not rub. Once you have finished blotting, leave a ½ inch pad of white paper towels on the area overnight to soak up any remaining liquid. Neutralize the stained area after using the ammonia mixture by applying undiluted, distilled white vinegar to the area. Only do this after the stain is removed. If you are cleaning carpet, vacuum the area once it is dry to restore the texture of the carpet."
        }
      ]
    },
    {
      "name":"Cleaning Mugs and Carafes",
      "steps":[
        {
          "headline":"Add baking soda.",
          "description":"Place a small amount of baking soda onto the bottom of the cup or carafe. Add just enough water until your form a paste. Scrub the stains using an abrasive sponge. Once the stain is removed, wash your mug or carafe as you usually would. You can also use a baking soda scrub as a preventive measure. Use the scrub at regular intervals so the stains do not set in. Depending on how often you use your mugs or carafes, you may scrub weekly, every other week, or once a month."
        },
        {
          "headline":"Use vinegar.",
          "description":"Fill the mug or carafe with a 50/50 mixture of hot water and white vinegar. Let the mixture sit for 10 minutes. Pour out the water and then scrub with an abrasive sponge. Rinse the mug or carafe out when you are finished scrubbing. You can either boil the water before you pour it in  or use hot tap water. You may need to apply the mixture more than once for more stubborn stains."
        },
        {
          "headline":"Apply ice and salt.",
          "description":"Mix 4 teaspoons of salt, 1 cup of crushed ice, and 1 tablespoon of water in the carafe. Swirl the carafe around to clean the carafe. The ice makes the salt more effective. Wash the carafe after you scrub with salt so your next pot of coffee does not taste salty. Your carafe should be room temperature when you do this. Don’t try this if your carafe is cracked or chipped."
        }
      ]
    }
  ],
  "text":" Cleaning Your Clothes Blot the coffee stain immediately. If the stain is still damp, blot with paper towels or tissue. Use a blotting, up-and-down lifting motion to soak up the coffee. Do not rub the paper towel from side to side because this may spread the stain. Use white paper towels because towels with patterns could leak dye onto the fabric and create even worse stains. Blotting immediately helps remove any excess liquid and some of the chemicals that cause coffee to stain. Blotting will also make your clothes receptive to the other steps. Rinse with cold water. Place the stain under running water for 3 to 5 minutes. Cold tap water is the best temperature. Gently rub the stain every minute to help remove the stain. You may need to do this 2 or 3 times. Rinse the back of the cloth where the stain is located. Do not rinse the top surface of the stain directly yet because rinsing the stained surface may cause the stain to spread. Add liquid laundry detergent. If the stain is still there after you have rinsed with cold water, rub a small amount of liquid laundry detergent on the stain. Make sure the area is still moist before you rub it in. Let the detergent sit for 5 minutes, and then rub it gently again. Now rinse with cold water. Spread the detergent on both surfaces of the coffee-stained material, front and back. Mix detergent and white vinegar. If laundry detergent alone does not work, mix powdered laundry detergent and equal parts white vinegar and cold water in a small bowl to make a paste. The paste should be the same consistency as toothpaste. Make enough to cover both sides of the stain, front and back. Test a small part of the fabric that cannot be seen with the paste to make sure the paste won't discolor the fabric. Let the paste sit for 5 minutes and then use a nail brush or toothbrush to rub both sides of the stain in a circular motion. Rinse the stain with cold water when you are finished. Use a stain stick. If the stain still has not come out, use a stain stick. Apply the stain stick and allow it to sit for 5 to 10 minutes. Then wash the clothing according to the instructions on the tag. Make sure the stain is gone before you place your clothing in the dryer. If the stain is still there, do not place the item in the dryer. The heat from the dryer will set your stain. Either wash your garment again or take it to the dry cleaner for a professional cleaning. Choose a laundry detergent that is formulated to remove stains. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle. She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices. Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tExpert Trick: To clean a fresh coffee stain off of your clothing, pour regular table salt over the stain and let the salt soak it up as much as possible. When the salt is dry, wipe it off and cover the stain with baking soda. Let that sit for a while, then scrub the area with a paste of baking soda and a little water. Finally, soak the stain with white vinegar, then blot it with a white paper towel before washing the garment with bleach. Removing Stains from Carpet and Furniture Apply detergent. Mix ¼ teaspoon of clear hand dishwashing detergent with 1 cup of warm water. Use a white towel or paper towel to apply the detergent to the stain. Gently blot the stain and let the detergent sit for 3 to 5 minutes. If the stain is gone, apply water to a clean paper towel or towel and blot the stain. After you rinse leave a ½ inch pad of white paper towels on the stain overnight. Place a weight (e.g. glass or ceramic object, paperweight) on top of the paper towels. The pad will soak up any remaining liquid. Apply a hydrogen peroxide, ammonia mixture. If the detergent does not work, mix ½ cup hydrogen peroxide with 1 teaspoon of undiluted, unscented household ammonia. Use a white paper towel or towel to apply the mixture to the stain. Place a piece of plastic wrap and a weight (e.g. glass or ceramic object, paperweight) on top of the stain and allow the mixture to sit for 2 or 3 hours. The weight should be color safe and not bleed when it gets wet. Use the hydrogen peroxide, ammonia mixture within 22 hours of making it. You may have to apply the mixture multiple times until the stain is gone. Rinse stain with water. Once the stain is removed, use a white towel or paper towel to apply cold water. Blot the area and do not rub. Once you have finished blotting, leave a ½ inch pad of white paper towels on the area overnight to soak up any remaining liquid. Neutralize the stained area after using the ammonia mixture by applying undiluted, distilled white vinegar to the area. Only do this after the stain is removed. If you are cleaning carpet, vacuum the area once it is dry to restore the texture of the carpet. Cleaning Mugs and Carafes Add baking soda. Place a small amount of baking soda onto the bottom of the cup or carafe. Add just enough water until your form a paste. Scrub the stains using an abrasive sponge. Once the stain is removed, wash your mug or carafe as you usually would. You can also use a baking soda scrub as a preventive measure. Use the scrub at regular intervals so the stains do not set in. Depending on how often you use your mugs or carafes, you may scrub weekly, every other week, or once a month. Use vinegar. Fill the mug or carafe with a 50/50 mixture of hot water and white vinegar. Let the mixture sit for 10 minutes. Pour out the water and then scrub with an abrasive sponge. Rinse the mug or carafe out when you are finished scrubbing. You can either boil the water before you pour it in  or use hot tap water. You may need to apply the mixture more than once for more stubborn stains. Apply ice and salt. Mix 4 teaspoons of salt, 1 cup of crushed ice, and 1 tablespoon of water in the carafe. Swirl the carafe around to clean the carafe. The ice makes the salt more effective. Wash the carafe after you scrub with salt so your next pot of coffee does not taste salty. Your carafe should be room temperature when you do this. Don’t try this if your carafe is cracked or chipped.",
  "sentences":[
    " Cleaning Your Clothes Blot the coffee stain immediately.",
    "If the stain is still damp, blot with paper towels or tissue.",
    "Use a blotting, up-and-down lifting motion to soak up the coffee.",
    "Do not rub the paper towel from side to side because this may spread the stain.",
    "Use white paper towels because towels with patterns could leak dye onto the fabric and create even worse stains.",
    "Blotting immediately helps remove any excess liquid and some of the chemicals that cause coffee to stain.",
    "Blotting will also make your clothes receptive to the other steps.",
    "Rinse with cold water.",
    "Place the stain under running water for 3 to 5 minutes.",
    "Cold tap water is the best temperature.",
    "Gently rub the stain every minute to help remove the stain.",
    "You may need to do this 2 or 3 times.",
    "Rinse the back of the cloth where the stain is located.",
    "Do not rinse the top surface of the stain directly yet because rinsing the stained surface may cause the stain to spread.",
    "Add liquid laundry detergent.",
    "If the stain is still there after you have rinsed with cold water, rub a small amount of liquid laundry detergent on the stain.",
    "Make sure the area is still moist before you rub it in.",
    "Let the detergent sit for 5 minutes, and then rub it gently again.",
    "Now rinse with cold water.",
    "Spread the detergent on both surfaces of the coffee-stained material, front and back.",
    "Mix detergent and white vinegar.",
    "If laundry detergent alone does not work, mix powdered laundry detergent and equal parts white vinegar and cold water in a small bowl to make a paste.",
    "The paste should be the same consistency as toothpaste.",
    "Make enough to cover both sides of the stain, front and back.",
    "Test a small part of the fabric that cannot be seen with the paste to make sure the paste won't discolor the fabric.",
    "Let the paste sit for 5 minutes and then use a nail brush or toothbrush to rub both sides of the stain in a circular motion.",
    "Rinse the stain with cold water when you are finished.",
    "Use a stain stick.",
    "If the stain still has not come out, use a stain stick.",
    "Apply the stain stick and allow it to sit for 5 to 10 minutes.",
    "Then wash the clothing according to the instructions on the tag.",
    "Make sure the stain is gone before you place your clothing in the dryer.",
    "If the stain is still there, do not place the item in the dryer.",
    "The heat from the dryer will set your stain.",
    "Either wash your garment again or take it to the dry cleaner for a professional cleaning.",
    "Choose a laundry detergent that is formulated to remove stains.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle.",
    "She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices.",
    "Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tExpert Trick: To clean a fresh coffee stain off of your clothing, pour regular table salt over the stain and let the salt soak it up as much as possible.",
    "When the salt is dry, wipe it off and cover the stain with baking soda.",
    "Let that sit for a while, then scrub the area with a paste of baking soda and a little water.",
    "Finally, soak the stain with white vinegar, then blot it with a white paper towel before washing the garment with bleach.",
    "Removing Stains from Carpet and Furniture Apply detergent.",
    "Mix ¼ teaspoon of clear hand dishwashing detergent with 1 cup of warm water.",
    "Use a white towel or paper towel to apply the detergent to the stain.",
    "Gently blot the stain and let the detergent sit for 3 to 5 minutes.",
    "If the stain is gone, apply water to a clean paper towel or towel and blot the stain.",
    "After you rinse leave a ½ inch pad of white paper towels on the stain overnight.",
    "Place a weight (e.g.",
    "glass or ceramic object, paperweight) on top of the paper towels.",
    "The pad will soak up any remaining liquid.",
    "Apply a hydrogen peroxide, ammonia mixture.",
    "If the detergent does not work, mix ½ cup hydrogen peroxide with 1 teaspoon of undiluted, unscented household ammonia.",
    "Use a white paper towel or towel to apply the mixture to the stain.",
    "Place a piece of plastic wrap and a weight (e.g.",
    "glass or ceramic object, paperweight) on top of the stain and allow the mixture to sit for 2 or 3 hours.",
    "The weight should be color safe and not bleed when it gets wet.",
    "Use the hydrogen peroxide, ammonia mixture within 22 hours of making it.",
    "You may have to apply the mixture multiple times until the stain is gone.",
    "Rinse stain with water.",
    "Once the stain is removed, use a white towel or paper towel to apply cold water.",
    "Blot the area and do not rub.",
    "Once you have finished blotting, leave a ½ inch pad of white paper towels on the area overnight to soak up any remaining liquid.",
    "Neutralize the stained area after using the ammonia mixture by applying undiluted, distilled white vinegar to the area.",
    "Only do this after the stain is removed.",
    "If you are cleaning carpet, vacuum the area once it is dry to restore the texture of the carpet.",
    "Cleaning Mugs and Carafes Add baking soda.",
    "Place a small amount of baking soda onto the bottom of the cup or carafe.",
    "Add just enough water until your form a paste.",
    "Scrub the stains using an abrasive sponge.",
    "Once the stain is removed, wash your mug or carafe as you usually would.",
    "You can also use a baking soda scrub as a preventive measure.",
    "Use the scrub at regular intervals so the stains do not set in.",
    "Depending on how often you use your mugs or carafes, you may scrub weekly, every other week, or once a month.",
    "Use vinegar.",
    "Fill the mug or carafe with a 50/50 mixture of hot water and white vinegar.",
    "Let the mixture sit for 10 minutes.",
    "Pour out the water and then scrub with an abrasive sponge.",
    "Rinse the mug or carafe out when you are finished scrubbing.",
    "You can either boil the water before you pour it in  or use hot tap water.",
    "You may need to apply the mixture more than once for more stubborn stains.",
    "Apply ice and salt.",
    "Mix 4 teaspoons of salt, 1 cup of crushed ice, and 1 tablespoon of water in the carafe.",
    "Swirl the carafe around to clean the carafe.",
    "The ice makes the salt more effective.",
    "Wash the carafe after you scrub with salt so your next pot of coffee does not taste salty.",
    "Your carafe should be room temperature when you do this.",
    "Don’t try this if your carafe is cracked or chipped."
  ],
  "tyn_section":[
    "Cold water",
    "White vinegar",
    "Powdered laundry detergent",
    "Small bowl or dish",
    "Toothbrush or nail brush",
    "Liquid laundry detergent"
  ],
  "tyn_model":[
    "water",
    "salt",
    "baking soda",
    "paper towel",
    "detergent",
    "white vinegar",
    "paper towels",
    "cold water",
    "laundry detergent",
    "dryer",
    "green cleaning",
    "hydrogen peroxide",
    "ammonia",
    "liquid laundry detergent",
    "green cleaning expert",
    "white paper towel",
    "white towel",
    "abrasive sponge",
    "ice",
    "carafe",
    "tissue",
    "nail brush",
    "dry cleaner",
    "— winning",
    "—and",
    "regular table salt",
    "bleach",
    "clear hand dishwashing detergent",
    "white paper",
    "household ammonia",
    "plastic wrap",
    "white paper towels",
    "distilled white vinegar",
    "vinegar",
    "hot water",
    "mug",
    "hot tap water",
    "crushed ice"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0789473684,
    "f1":0.1363636364,
    "avg_pos":0.1842105263
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.2105263158,
    "f1":0.3361344538
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.3157894737,
    "f1":0.4580152672
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1315789474,
    "f1":0.2197802198
  }
}