{
  "title":"How to Make a Clay Person",
  "url":"https://www.wikihow.com/Make-a-Clay-Person",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Clay Projects",
    "Clay Figures"
  ],
  "parts":[
    {
      "name":"Preparing the Clay Pieces",
      "steps":[
        {
          "headline":"Get clay.",
          "description":"If you want to be able to move your clay person around after it's finished, you'll need modeling clay. This clay doesn't dry in the air, so it's perfect for making clay models out of. If you want your clay person to be still once it's done, you can use oven-bake clay. You can make your clay person all the same color, or you can use different colors for different parts of the body. For example, if you want it to look like your clay person is wearing a shirt, you can use a green or white piece of clay for the torso."
        },
        {
          "headline":"Make a ball for the head.",
          "description":"Pinch off a piece of the clay. Roll the piece of clay into a ball. This will be the clay person's head. It's up to you what color the clay person's skin will be. You can make the whole person out of blue clay, or you can find some flesh colored clay for the head and arms."
        },
        {
          "headline":"Make a tube for the body.",
          "description":"Pinch off a piece of clay that's larger than the head. Shape this piece into a fat snake-like cylinder. Flatten the cylinder slightly."
        },
        {
          "headline":"Make two long tubes for the arms and legs.",
          "description":"Pinch off two more pieces of clay. Roll these pieces into two long tube shapes. One tube should be thicker than the other. These will become the arms and legs."
        }
      ]
    },
    {
      "name":"Attaching the Head",
      "steps":[
        {
          "headline":"Pinch out the neck.",
          "description":"Take the ball that will be the head and pinch out of it a little spike of clay. This will be how the head will attach to the body. The neck should jut out of the head like a small spike or cone, and should be about half the length of the neck. And make sure it's thick enough that you can hold the head up by holding nothing but the neck between two fingers."
        },
        {
          "headline":"Make a hole for the neck.",
          "description":"Take something narrow, like a pencil, or a toothpick, and burrow out a small hole in the top of the body cylinder. Make sure the hole isn't too wide, but wide enough for the neck to fit in. Make the hole deep enough for the neck to go completely in."
        },
        {
          "headline":"Attach the head to the body.",
          "description":"Stick the neck into the hole in the body so that the ball touches the body. Smooth out the edge where the head meets the body to make it secure."
        }
      ]
    },
    {
      "name":"Making the and Legs Arms",
      "steps":[
        {
          "headline":"Tear the arm tube into two pieces.",
          "description":"Find the middle of the smaller tube and tear it into, for the two arms."
        },
        {
          "headline":"Flatten the ends of the arms.",
          "description":"With your thumb and finger, flatten a small bit of one end of both arms. These will become the hands."
        },
        {
          "headline":"Mold the hands.",
          "description":"First, cut out a bit of the flattened parts. Use something sharp to cut out a corner of the flattened ends of the arms. Then round out the corners of the hand so that it looks like a cartoony thumb and fingers."
        },
        {
          "headline":"Attach the arms.",
          "description":"Take the finished arms and attach them to the sides of the body. Smooth out the connection between the arms and body to secure them. If the arms are too long, tear off an even amount from both arms until they're as short as you'd like."
        },
        {
          "headline":"Tear the leg tube into two pieces.",
          "description":"Find the middle of the larger tube and tear it into, for the two legs."
        },
        {
          "headline":"Make the feet.",
          "description":"Bend one end of both of the legs. Shape this bent part into a rough foot shape. Make sure they are large enough to support the legs. Stand the legs up to test the feet. Press the feet into the table so that the feet bottoms are flat."
        },
        {
          "headline":"Attach the legs.",
          "description":"Stick the legs into the bottom of the body. Smooth the connection between the legs and body to secure them together. Make sure the feet are facing forward. If the clay person can't stay standing on its own at this point, you'll need to redo the legs and make them thicker."
        },
        {
          "headline":"Troubleshoot any balancing issues.",
          "description":"If you're clay person can't stand up on its own after you attach the legs, there could be a balancing issue. You can always make the legs thicker, but sometimes the legs are plenty thick, and it still falls over. In that case, you might want to redo various parts of the person and experiment with a shorter torso, less clay for the torso, smaller arms, a smaller head, ect. Also make sure the clay person's torso is straight, and that the arms are close to the same size and weight."
        }
      ]
    },
    {
      "name":"Making the Face",
      "steps":[
        {
          "headline":"Make balls for the eyes.",
          "description":"Tear off four small bits of clay. Make four balls out of these clay pieces. Two of these balls should be smaller than the others."
        },
        {
          "headline":"Finish the eyes.",
          "description":"Push the smaller balls into the larger ones. Flatten them a bit into the bigger balls. These will be the eyes."
        },
        {
          "headline":"Attach the eyes.",
          "description":"Press both eyes firmly into to the head of your person. If you want, you can use another method to make eyes, such as using two googly eyes, or making eyes out of paper. If you want a simpler method for making eyes, you can just take a pencil and make two round holes in the head for eyes. You can use a pencil to carve out a smile or open mouth as well."
        },
        {
          "headline":"Make a small tube for the mouth.",
          "description":"Take a small pinch of clay and roll it into a small tube. The tube should be no longer than the width of the head. You can make it as thin as you'd like the mouth to be."
        },
        {
          "headline":"Attach the mouth to the head.",
          "description":"Place the small tube under the eyes, where the mouth should go. With the flexibility of the tube, you can make any sort of expression you want, a smile, a frown, or any other mouth shape."
        },
        {
          "headline":"Add a nose.",
          "description":"You can add a nose to your clay person's face by just taking a small bit of clay and sticking it in the center of the face. Then use your fingers to form it into any sort of nose shape you want, a small ball, a little triangle, whatever shape you prefer."
        }
      ]
    }
  ],
  "text":" Preparing the Clay Pieces Get clay. If you want to be able to move your clay person around after it's finished, you'll need modeling clay. This clay doesn't dry in the air, so it's perfect for making clay models out of. If you want your clay person to be still once it's done, you can use oven-bake clay. You can make your clay person all the same color, or you can use different colors for different parts of the body. For example, if you want it to look like your clay person is wearing a shirt, you can use a green or white piece of clay for the torso. Make a ball for the head. Pinch off a piece of the clay. Roll the piece of clay into a ball. This will be the clay person's head. It's up to you what color the clay person's skin will be. You can make the whole person out of blue clay, or you can find some flesh colored clay for the head and arms. Make a tube for the body. Pinch off a piece of clay that's larger than the head. Shape this piece into a fat snake-like cylinder. Flatten the cylinder slightly. Make two long tubes for the arms and legs. Pinch off two more pieces of clay. Roll these pieces into two long tube shapes. One tube should be thicker than the other. These will become the arms and legs. Attaching the Head Pinch out the neck. Take the ball that will be the head and pinch out of it a little spike of clay. This will be how the head will attach to the body. The neck should jut out of the head like a small spike or cone, and should be about half the length of the neck. And make sure it's thick enough that you can hold the head up by holding nothing but the neck between two fingers. Make a hole for the neck. Take something narrow, like a pencil, or a toothpick, and burrow out a small hole in the top of the body cylinder. Make sure the hole isn't too wide, but wide enough for the neck to fit in. Make the hole deep enough for the neck to go completely in. Attach the head to the body. Stick the neck into the hole in the body so that the ball touches the body. Smooth out the edge where the head meets the body to make it secure. Making the and Legs Arms Tear the arm tube into two pieces. Find the middle of the smaller tube and tear it into, for the two arms. Flatten the ends of the arms. With your thumb and finger, flatten a small bit of one end of both arms. These will become the hands. Mold the hands. First, cut out a bit of the flattened parts. Use something sharp to cut out a corner of the flattened ends of the arms. Then round out the corners of the hand so that it looks like a cartoony thumb and fingers. Attach the arms. Take the finished arms and attach them to the sides of the body. Smooth out the connection between the arms and body to secure them. If the arms are too long, tear off an even amount from both arms until they're as short as you'd like. Tear the leg tube into two pieces. Find the middle of the larger tube and tear it into, for the two legs. Make the feet. Bend one end of both of the legs. Shape this bent part into a rough foot shape. Make sure they are large enough to support the legs. Stand the legs up to test the feet. Press the feet into the table so that the feet bottoms are flat. Attach the legs. Stick the legs into the bottom of the body. Smooth the connection between the legs and body to secure them together. Make sure the feet are facing forward. If the clay person can't stay standing on its own at this point, you'll need to redo the legs and make them thicker. Troubleshoot any balancing issues. If you're clay person can't stand up on its own after you attach the legs, there could be a balancing issue. You can always make the legs thicker, but sometimes the legs are plenty thick, and it still falls over. In that case, you might want to redo various parts of the person and experiment with a shorter torso, less clay for the torso, smaller arms, a smaller head, ect. Also make sure the clay person's torso is straight, and that the arms are close to the same size and weight. Making the Face Make balls for the eyes. Tear off four small bits of clay. Make four balls out of these clay pieces. Two of these balls should be smaller than the others. Finish the eyes. Push the smaller balls into the larger ones. Flatten them a bit into the bigger balls. These will be the eyes. Attach the eyes. Press both eyes firmly into to the head of your person. If you want, you can use another method to make eyes, such as using two googly eyes, or making eyes out of paper. If you want a simpler method for making eyes, you can just take a pencil and make two round holes in the head for eyes. You can use a pencil to carve out a smile or open mouth as well. Make a small tube for the mouth. Take a small pinch of clay and roll it into a small tube. The tube should be no longer than the width of the head. You can make it as thin as you'd like the mouth to be. Attach the mouth to the head. Place the small tube under the eyes, where the mouth should go. With the flexibility of the tube, you can make any sort of expression you want, a smile, a frown, or any other mouth shape. Add a nose. You can add a nose to your clay person's face by just taking a small bit of clay and sticking it in the center of the face. Then use your fingers to form it into any sort of nose shape you want, a small ball, a little triangle, whatever shape you prefer.",
  "sentences":[
    " Preparing the Clay Pieces Get clay.",
    "If you want to be able to move your clay person around after it's finished, you'll need modeling clay.",
    "This clay doesn't dry in the air, so it's perfect for making clay models out of.",
    "If you want your clay person to be still once it's done, you can use oven-bake clay.",
    "You can make your clay person all the same color, or you can use different colors for different parts of the body.",
    "For example, if you want it to look like your clay person is wearing a shirt, you can use a green or white piece of clay for the torso.",
    "Make a ball for the head.",
    "Pinch off a piece of the clay.",
    "Roll the piece of clay into a ball.",
    "This will be the clay person's head.",
    "It's up to you what color the clay person's skin will be.",
    "You can make the whole person out of blue clay, or you can find some flesh colored clay for the head and arms.",
    "Make a tube for the body.",
    "Pinch off a piece of clay that's larger than the head.",
    "Shape this piece into a fat snake-like cylinder.",
    "Flatten the cylinder slightly.",
    "Make two long tubes for the arms and legs.",
    "Pinch off two more pieces of clay.",
    "Roll these pieces into two long tube shapes.",
    "One tube should be thicker than the other.",
    "These will become the arms and legs.",
    "Attaching the Head Pinch out the neck.",
    "Take the ball that will be the head and pinch out of it a little spike of clay.",
    "This will be how the head will attach to the body.",
    "The neck should jut out of the head like a small spike or cone, and should be about half the length of the neck.",
    "And make sure it's thick enough that you can hold the head up by holding nothing but the neck between two fingers.",
    "Make a hole for the neck.",
    "Take something narrow, like a pencil, or a toothpick, and burrow out a small hole in the top of the body cylinder.",
    "Make sure the hole isn't too wide, but wide enough for the neck to fit in.",
    "Make the hole deep enough for the neck to go completely in.",
    "Attach the head to the body.",
    "Stick the neck into the hole in the body so that the ball touches the body.",
    "Smooth out the edge where the head meets the body to make it secure.",
    "Making the and Legs Arms Tear the arm tube into two pieces.",
    "Find the middle of the smaller tube and tear it into, for the two arms.",
    "Flatten the ends of the arms.",
    "With your thumb and finger, flatten a small bit of one end of both arms.",
    "These will become the hands.",
    "Mold the hands.",
    "First, cut out a bit of the flattened parts.",
    "Use something sharp to cut out a corner of the flattened ends of the arms.",
    "Then round out the corners of the hand so that it looks like a cartoony thumb and fingers.",
    "Attach the arms.",
    "Take the finished arms and attach them to the sides of the body.",
    "Smooth out the connection between the arms and body to secure them.",
    "If the arms are too long, tear off an even amount from both arms until they're as short as you'd like.",
    "Tear the leg tube into two pieces.",
    "Find the middle of the larger tube and tear it into, for the two legs.",
    "Make the feet.",
    "Bend one end of both of the legs.",
    "Shape this bent part into a rough foot shape.",
    "Make sure they are large enough to support the legs.",
    "Stand the legs up to test the feet.",
    "Press the feet into the table so that the feet bottoms are flat.",
    "Attach the legs.",
    "Stick the legs into the bottom of the body.",
    "Smooth the connection between the legs and body to secure them together.",
    "Make sure the feet are facing forward.",
    "If the clay person can't stay standing on its own at this point, you'll need to redo the legs and make them thicker.",
    "Troubleshoot any balancing issues.",
    "If you're clay person can't stand up on its own after you attach the legs, there could be a balancing issue.",
    "You can always make the legs thicker, but sometimes the legs are plenty thick, and it still falls over.",
    "In that case, you might want to redo various parts of the person and experiment with a shorter torso, less clay for the torso, smaller arms, a smaller head, ect.",
    "Also make sure the clay person's torso is straight, and that the arms are close to the same size and weight.",
    "Making the Face Make balls for the eyes.",
    "Tear off four small bits of clay.",
    "Make four balls out of these clay pieces.",
    "Two of these balls should be smaller than the others.",
    "Finish the eyes.",
    "Push the smaller balls into the larger ones.",
    "Flatten them a bit into the bigger balls.",
    "These will be the eyes.",
    "Attach the eyes.",
    "Press both eyes firmly into to the head of your person.",
    "If you want, you can use another method to make eyes, such as using two googly eyes, or making eyes out of paper.",
    "If you want a simpler method for making eyes, you can just take a pencil and make two round holes in the head for eyes.",
    "You can use a pencil to carve out a smile or open mouth as well.",
    "Make a small tube for the mouth.",
    "Take a small pinch of clay and roll it into a small tube.",
    "The tube should be no longer than the width of the head.",
    "You can make it as thin as you'd like the mouth to be.",
    "Attach the mouth to the head.",
    "Place the small tube under the eyes, where the mouth should go.",
    "With the flexibility of the tube, you can make any sort of expression you want, a smile, a frown, or any other mouth shape.",
    "Add a nose.",
    "You can add a nose to your clay person's face by just taking a small bit of clay and sticking it in the center of the face.",
    "Then use your fingers to form it into any sort of nose shape you want, a small ball, a little triangle, whatever shape you prefer."
  ],
  "tyn_section":[
    "A good-sized piece of any kind of clay",
    "A toothpick or pencil"
  ],
  "tyn_model":[
    "clay",
    "pencil",
    "modeling clay",
    "oven-bake clay",
    "toothpick",
    "table",
    "paper"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}