{
  "title":"How to Maintain Kefir Grains",
  "url":"https://www.wikihow.com/Maintain-Kefir-Grains",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk"
  ],
  "steps":[
    {
      "headline":"Purchase some kefir grains.",
      "description":"There are several ways to obtain kefir grains. The cheapest way is to ask a kefir hobbyist in your area for some of their excess kefir grains. Anyone who prepares kefir regularly will be constantly throwing out excess grains, as the yeast and bacteria reproduce quickly. They may be willing to give you some at little or no cost. Another option is purchasing kefir grains from either a health food store or a specialty store that sells culturing supplies."
    },
    {
      "headline":"Place the kefir grains into a glass or plastic jar.",
      "description":"When you receive your kefir grains, you can choose to rinse away some of the fat solids if desired, but do not use chlorinated water. The chlorine will kill the microorganisms in the grains. Place the grains into a clean jar. People often recommend handling the kefir grains with plastic utensils. Different sorts of metals react with the acids in kefir and this can adversely affect the microorganisms' health. However, high quality stainless steel is considered safe because it is non-reactive. Unless it is rusty or showing corrosion, any stainless steel kitchen equipment will be suitable."
    },
    {
      "headline":"Fill the jar with milk.",
      "description":"The exact ratio of milk to kefir grains is not crucial, but a general rule is to use 20 parts milk to 1 part grains by volume. The milk provides food for the yeast and bacteria, and will keep your kefir grains healthy and active. Place a loose-fitting lid on the jar, and leave it out at room temperature for 24 hours."
    },
    {
      "headline":"Remove the kefir grains from the milk.",
      "description":"After 24 hours, use a plastic spoon to remove the kefir grains, which will be floating on the milk's surface. Place them in another clean jar. The milk has now been transformed into kefir, which can be consumed immediately or stored in the refrigerator."
    },
    {
      "headline":"Pour more milk into the jar with the kefir grains.",
      "description":"The simplest way to maintain your kefir grains indefinitely is to continually use them to prepare kefir. By pouring more milk into the new jar, you can prepare another batch of kefir in 24 hours, after which you can remove the grains. Repeating this process endlessly will keep your kefir grains healthy and active, while providing you with a continuous supply of kefir. If you don't need this much kefir, you can still keep the grains healthy in milk at room temperature. Instead of adding a full jar's worth of milk each day, simply pour off a portion of the old milk and top it off with some fresh milk. Doing this daily will provide enough food for the microorganisms to stay healthy. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Maintain-Kefir-Grains-Step-5Bullet1.jpg\\/v4-460px-Maintain-Kefir-Grains-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Maintain-Kefir-Grains-Step-5Bullet1.jpg\\/v4-760px-Maintain-Kefir-Grains-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nYou don't need to be concerned about the milk spoiling, even at room temperature. The beneficial yeast and bacteria in the grains reproduce so rapidly in the milk that harmful bacteria do not have a chance to proliferate. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Maintain-Kefir-Grains-Step-5Bullet2.jpg\\/v4-460px-Maintain-Kefir-Grains-Step-5Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Maintain-Kefir-Grains-Step-5Bullet2.jpg\\/v4-760px-Maintain-Kefir-Grains-Step-5Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Storing the kefir grains in the refrigerator will slow the microorganisms' growth but it is not suitable for the long term.",
      "description":""
    }
  ],
  "text":" Purchase some kefir grains. There are several ways to obtain kefir grains. The cheapest way is to ask a kefir hobbyist in your area for some of their excess kefir grains. Anyone who prepares kefir regularly will be constantly throwing out excess grains, as the yeast and bacteria reproduce quickly. They may be willing to give you some at little or no cost. Another option is purchasing kefir grains from either a health food store or a specialty store that sells culturing supplies. Place the kefir grains into a glass or plastic jar. When you receive your kefir grains, you can choose to rinse away some of the fat solids if desired, but do not use chlorinated water. The chlorine will kill the microorganisms in the grains. Place the grains into a clean jar. People often recommend handling the kefir grains with plastic utensils. Different sorts of metals react with the acids in kefir and this can adversely affect the microorganisms' health. However, high quality stainless steel is considered safe because it is non-reactive. Unless it is rusty or showing corrosion, any stainless steel kitchen equipment will be suitable. Fill the jar with milk. The exact ratio of milk to kefir grains is not crucial, but a general rule is to use 20 parts milk to 1 part grains by volume. The milk provides food for the yeast and bacteria, and will keep your kefir grains healthy and active. Place a loose-fitting lid on the jar, and leave it out at room temperature for 24 hours. Remove the kefir grains from the milk. After 24 hours, use a plastic spoon to remove the kefir grains, which will be floating on the milk's surface. Place them in another clean jar. The milk has now been transformed into kefir, which can be consumed immediately or stored in the refrigerator. Pour more milk into the jar with the kefir grains. The simplest way to maintain your kefir grains indefinitely is to continually use them to prepare kefir. By pouring more milk into the new jar, you can prepare another batch of kefir in 24 hours, after which you can remove the grains. Repeating this process endlessly will keep your kefir grains healthy and active, while providing you with a continuous supply of kefir. If you don't need this much kefir, you can still keep the grains healthy in milk at room temperature. Instead of adding a full jar's worth of milk each day, simply pour off a portion of the old milk and top it off with some fresh milk. Doing this daily will provide enough food for the microorganisms to stay healthy. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Maintain-Kefir-Grains-Step-5Bullet1.jpg\\/v4-460px-Maintain-Kefir-Grains-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Maintain-Kefir-Grains-Step-5Bullet1.jpg\\/v4-760px-Maintain-Kefir-Grains-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nYou don't need to be concerned about the milk spoiling, even at room temperature. The beneficial yeast and bacteria in the grains reproduce so rapidly in the milk that harmful bacteria do not have a chance to proliferate. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Maintain-Kefir-Grains-Step-5Bullet2.jpg\\/v4-460px-Maintain-Kefir-Grains-Step-5Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Maintain-Kefir-Grains-Step-5Bullet2.jpg\\/v4-760px-Maintain-Kefir-Grains-Step-5Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Storing the kefir grains in the refrigerator will slow the microorganisms' growth but it is not suitable for the long term. ",
  "sentences":[
    " Purchase some kefir grains.",
    "There are several ways to obtain kefir grains.",
    "The cheapest way is to ask a kefir hobbyist in your area for some of their excess kefir grains.",
    "Anyone who prepares kefir regularly will be constantly throwing out excess grains, as the yeast and bacteria reproduce quickly.",
    "They may be willing to give you some at little or no cost.",
    "Another option is purchasing kefir grains from either a health food store or a specialty store that sells culturing supplies.",
    "Place the kefir grains into a glass or plastic jar.",
    "When you receive your kefir grains, you can choose to rinse away some of the fat solids if desired, but do not use chlorinated water.",
    "The chlorine will kill the microorganisms in the grains.",
    "Place the grains into a clean jar.",
    "People often recommend handling the kefir grains with plastic utensils.",
    "Different sorts of metals react with the acids in kefir and this can adversely affect the microorganisms' health.",
    "However, high quality stainless steel is considered safe because it is non-reactive.",
    "Unless it is rusty or showing corrosion, any stainless steel kitchen equipment will be suitable.",
    "Fill the jar with milk.",
    "The exact ratio of milk to kefir grains is not crucial, but a general rule is to use 20 parts milk to 1 part grains by volume.",
    "The milk provides food for the yeast and bacteria, and will keep your kefir grains healthy and active.",
    "Place a loose-fitting lid on the jar, and leave it out at room temperature for 24 hours.",
    "Remove the kefir grains from the milk.",
    "After 24 hours, use a plastic spoon to remove the kefir grains, which will be floating on the milk's surface.",
    "Place them in another clean jar.",
    "The milk has now been transformed into kefir, which can be consumed immediately or stored in the refrigerator.",
    "Pour more milk into the jar with the kefir grains.",
    "The simplest way to maintain your kefir grains indefinitely is to continually use them to prepare kefir.",
    "By pouring more milk into the new jar, you can prepare another batch of kefir in 24 hours, after which you can remove the grains.",
    "Repeating this process endlessly will keep your kefir grains healthy and active, while providing you with a continuous supply of kefir.",
    "If you don't need this much kefir, you can still keep the grains healthy in milk at room temperature.",
    "Instead of adding a full jar's worth of milk each day, simply pour off a portion of the old milk and top it off with some fresh milk.",
    "Doing this daily will provide enough food for the microorganisms to stay healthy.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Maintain-Kefir-Grains-Step-5Bullet1.jpg\\/v4-460px-Maintain-Kefir-Grains-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Maintain-Kefir-Grains-Step-5Bullet1.jpg\\/v4-760px-Maintain-Kefir-Grains-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nYou don't need to be concerned about the milk spoiling, even at room temperature.",
    "The beneficial yeast and bacteria in the grains reproduce so rapidly in the milk that harmful bacteria do not have a chance to proliferate.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Maintain-Kefir-Grains-Step-5Bullet2.jpg\\/v4-460px-Maintain-Kefir-Grains-Step-5Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Maintain-Kefir-Grains-Step-5Bullet2.jpg\\/v4-760px-Maintain-Kefir-Grains-Step-5Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Storing the kefir grains in the refrigerator will slow the microorganisms' growth but it is not suitable for the long term."
  ],
  "tyn_section":[
    "Kefir grains",
    "Glass jar",
    "Dechlorinated water",
    "Plastic spoon",
    "Milk",
    "Refrigerator",
    "Envelope"
  ],
  "tyn_model":[
    "milk",
    "kefir",
    "kefir grains",
    "refrigerator",
    "kefir hobbyist",
    "water",
    "plastic spoon",
    "parser",
    "yeast"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.4444444444,
    "f1":0.5,
    "avg_pos":0.2222222222
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.6666666667,
    "f1":0.6896551724
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.7777777778,
    "f1":0.7446808511
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.4444444444,
    "f1":0.5
  }
}