{
  "title":"How to Make a Cake With Diet Soda",
  "url":"https://www.wikihow.com/Make-a-Cake-With-Diet-Soda",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "steps":[
    {
      "headline":"Assemble all of your ingredients and cooking utensils.",
      "description":"This will allow you to easily prepare each step without having to stop to get the next ingredient. In general, the combination of diet soda and cake mix are a matter of taste, so you can combine any type of cake mix with any flavor diet soda, for example  diet lemon soda with yellow cake mix,  diet cola with a chocolate cake mix, diet cherry cola with a cherry cake mix, or diet orange with a white cake mix. Baking time and temperature remain the same for all combinations."
    },
    {
      "headline":"Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius).",
      "description":""
    },
    {
      "headline":"Spray the inside of two baking pans with cooking spray, and flour them lightly.",
      "description":"This will prevent the cakes from sticking to the pan during baking."
    },
    {
      "headline":"Put the contents of the package of cake mix into a large mixing bowl.",
      "description":"Some cooks prefer to put the contents through a sieve first, to break up any lumps."
    },
    {
      "headline":"Add the entire can of diet soda to the cake mix.",
      "description":"Because it's carbonated, the fluid will cause the dough to rise and expand when heated."
    },
    {
      "headline":"Using a whisk or a hand mixer, mix both ingredients together at medium speed for about 2 minutes.",
      "description":"This ensures a smooth cake mix with a consistent texture and no lumps."
    },
    {
      "headline":"Pour the mixture into the baking pans.",
      "description":"Make sure both pans have an equal amount of cake batter so the cakes will be approximately the same size."
    },
    {
      "headline":"Put the baking pans with the cake batter in the oven and bake them for 33 to 36 minutes.",
      "description":""
    },
    {
      "headline":"Insert a toothpick into the center of each cake to see if it's done.",
      "description":"If the toothpick comes out clean, without any batter stuck to it, the cakes are done. If there's still batter on the toothpick, bake the cakes for another 5 minutes or until they're done."
    },
    {
      "headline":"Turn off the oven and remove the cakes.",
      "description":""
    },
    {
      "headline":"Let the cakes cool on a large wire rack for at least 15 minutes.",
      "description":""
    },
    {
      "headline":"Decorate the cake with a non-dairy whipped topping or another low carb, low fat topping.",
      "description":""
    }
  ],
  "text":" Assemble all of your ingredients and cooking utensils. This will allow you to easily prepare each step without having to stop to get the next ingredient. In general, the combination of diet soda and cake mix are a matter of taste, so you can combine any type of cake mix with any flavor diet soda, for example  diet lemon soda with yellow cake mix,  diet cola with a chocolate cake mix, diet cherry cola with a cherry cake mix, or diet orange with a white cake mix. Baking time and temperature remain the same for all combinations. Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius).  Spray the inside of two baking pans with cooking spray, and flour them lightly. This will prevent the cakes from sticking to the pan during baking. Put the contents of the package of cake mix into a large mixing bowl. Some cooks prefer to put the contents through a sieve first, to break up any lumps. Add the entire can of diet soda to the cake mix. Because it's carbonated, the fluid will cause the dough to rise and expand when heated. Using a whisk or a hand mixer, mix both ingredients together at medium speed for about 2 minutes. This ensures a smooth cake mix with a consistent texture and no lumps. Pour the mixture into the baking pans. Make sure both pans have an equal amount of cake batter so the cakes will be approximately the same size. Put the baking pans with the cake batter in the oven and bake them for 33 to 36 minutes.  Insert a toothpick into the center of each cake to see if it's done. If the toothpick comes out clean, without any batter stuck to it, the cakes are done. If there's still batter on the toothpick, bake the cakes for another 5 minutes or until they're done. Turn off the oven and remove the cakes.  Let the cakes cool on a large wire rack for at least 15 minutes.  Decorate the cake with a non-dairy whipped topping or another low carb, low fat topping. ",
  "sentences":[
    " Assemble all of your ingredients and cooking utensils.",
    "This will allow you to easily prepare each step without having to stop to get the next ingredient.",
    "In general, the combination of diet soda and cake mix are a matter of taste, so you can combine any type of cake mix with any flavor diet soda, for example  diet lemon soda with yellow cake mix,  diet cola with a chocolate cake mix, diet cherry cola with a cherry cake mix, or diet orange with a white cake mix.",
    "Baking time and temperature remain the same for all combinations.",
    "Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius).",
    "Spray the inside of two baking pans with cooking spray, and flour them lightly.",
    "This will prevent the cakes from sticking to the pan during baking.",
    "Put the contents of the package of cake mix into a large mixing bowl.",
    "Some cooks prefer to put the contents through a sieve first, to break up any lumps.",
    "Add the entire can of diet soda to the cake mix.",
    "Because it's carbonated, the fluid will cause the dough to rise and expand when heated.",
    "Using a whisk or a hand mixer, mix both ingredients together at medium speed for about 2 minutes.",
    "This ensures a smooth cake mix with a consistent texture and no lumps.",
    "Pour the mixture into the baking pans.",
    "Make sure both pans have an equal amount of cake batter so the cakes will be approximately the same size.",
    "Put the baking pans with the cake batter in the oven and bake them for 33 to 36 minutes.",
    "Insert a toothpick into the center of each cake to see if it's done.",
    "If the toothpick comes out clean, without any batter stuck to it, the cakes are done.",
    "If there's still batter on the toothpick, bake the cakes for another 5 minutes or until they're done.",
    "Turn off the oven and remove the cakes.",
    "Let the cakes cool on a large wire rack for at least 15 minutes.",
    "Decorate the cake with a non-dairy whipped topping or another low carb, low fat topping."
  ],
  "tyn_section":[
    "2 8-inch (20 centimeters) metal or glass baking pan",
    "Nonstick cooking spray",
    "2 teaspoons of all-purpose flour",
    "1 box of cake mix in an 18.5 ounce (524 grams) package",
    "Large mixing bowl",
    "Whisk or hand mixer",
    "1 12-ounce (354 milliliters) can of diet soda",
    "Toothpick",
    "1 can of non-dairy whipped topping"
  ],
  "tyn_model":[
    "cake mix",
    "diet soda",
    "oven",
    "baking pans",
    "cake batter",
    "cooking utensils",
    "diet lemon soda",
    "diet cola",
    "chocolate cake mix",
    "diet cherry cola",
    "diet orange",
    "cooking spray",
    "flour",
    "large mixing bowl",
    "sieve",
    "whisk",
    "hand mixer",
    "whipped topping"
  ],
  "simple_metrics":{
    "r":0.1111111111,
    "p":0.0555555556,
    "f1":0.0740740741,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1666666667,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4444444444,
    "p":0.2222222222,
    "f1":0.2962962963
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2222222222,
    "p":0.1111111111,
    "f1":0.1481481481
  }
}