{
  "title":"How to Declutter",
  "url":"https://www.wikihow.com/Declutter",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Home Organization",
    "Clutter Busting"
  ],
  "methods":[
    {
      "name":"Make a Game Plan",
      "steps":[
        {
          "headline":"Find a decluttering schedule that works for you.",
          "description":"There are many approaches to decluttering your space. Depending on your schedule (if you have one), take an hour or two or maybe even a whole day to declutter (depending how much stuff you do have to declutter). No matter how little time you have, you'll be able to find a decluttering schedule that works for you. Start small. Focus on one room at a time and work your way to the next one until you have decluttered every room you planned on decluttering. When you begin to declutter, you may be tempted to turn your entire house outside down and to gut every single piece of furniture right from the start. This may seem like a good idea, but it will actually make your space seem so messy that your goals become unmanageable.This may seem like it will take forever, but if you're methodical, you'll be able to make the most of your time. You can even declutter your things if you commit just five minutes a day to the process. Set reasonable goals. You should only empty out a room or a piece of furniture if you have the time to sort through everything in it and to put everything back in its place."
        },
        {
          "headline":"Enlist the help of others.",
          "description":"Decluttering will be much more fun and manageable if you enlist the help of others, whether you have roommates or just helpful friends who want to spend time with you. Working with others to declutter your space will make the time pass by much faster, and will make the entire process more enjoyable. You do not have to do this, though. For some, decluttering may be a personal project. Play some music and order pizza. Make the whole process feel more like a party than a cleaning session. Don't let the leftovers and package lay around, though. Having other people help you is also valuable because they may have better insight into the things you really need. A trusted friend or family member can give you the courage to throw out an item that you're attached to for no good reason."
        },
        {
          "headline":"Get rid of easy targets.",
          "description":"Once you've found a schedule that works for you, as well as the help of some trusted friends, you can start the process by getting rid of some easy superficial targets. Before you get serious and take it one room at a time, you'll feel better if you're instantly able to get rid of a few items that are crowding your life. Here are some quick and easy targets that can give you a jump start on decluttering your space:\nJust get a big black trash bag and fill it with old papers, old shoes you haven't worn in years, empty shampoo bottles, old mail, and anything else that's in plain sight. Go through your fridge and medicine cabinets and toss any old and expired items. Get rid of any garish pieces of furniture that are crowding your space. If you just can't stand that big, ugly chair in the corner of your living room, you may feel better if you set it to the curb right away."
        }
      ]
    },
    {
      "name":"Sort Through Your Things",
      "steps":[
        {
          "headline":"Empty out all of the things in one room or area.",
          "description":"To declutter in an organized fashion, you'll need to empty out everything in one room, or one area of a room, or even one drawer, before you can get the whole picture. You can put all of the things on the floor or on a piece of furniture -- anywhere where they are in plain sight. Be prepared with four different boxes: a box for things you'll keep, a box for things you'll store, one for things you'll donate or sell, and the last one for things you'll throw out."
        },
        {
          "headline":"Decide what to keep.",
          "description":"At first, you may want to keep absolutely everything you've taken out. But remind yourself that the point of decluttering is to get rid of all of the extra things that are crowding your life. You should keep the items that you use on a regular basis, which you wear, cook with, or use for other household tasks. You should keep anything you've used in the last year. If you're really trying to declutter, you can make that everything you've used in the last six months. EXPERT TIP\t\t\t\t\t\t\t\tKathi Burns, CPO®\t\t\tBoard Certified Professional Organizer\t\t\t\tA common mistake when cleaning your home is buying organizers before you sort. Avoid purchasing any organizing bins or an organizing system until after you see what you have, and you sort everything. People feel great when they go out and buy a bunch of bins, but you can't buy the right things without knowing what you're sorting."
        },
        {
          "headline":"Decide what to throw out.",
          "description":"The point is to get rid of any- and everything you no longer use, that has expired, is broken and can't be repaired, or just anything you generally don't use and just lays all over the place. Get rid of it. If you have an item that you haven't used in a year, have completely forgotten about, or can't even image what you'll need it for ever again, then it's time to toss it. Go through your things and ask yourself, \"Do I really need this?\" If the answer is no, or if you hesitate for more than five seconds, it's time to part with it. You may save a few precious sentimental items, but don't overdo it. You can't save every little thing, and you shouldn't make excuses for why every little button and piece of lint has special meaning in your life. This is a great time to get the advice of your trusted friends. They may be able to be more honest and tell you that you will never use a certain item."
        },
        {
          "headline":"Decide what to store.",
          "description":"You should store any item that you will need eventually, but which you know you won't need for at least a few more months. Many of these items will be seasonal or special occasion items. Store your seasonal clothes. If it's the middle of summer, you can put away your winter sweaters for a few months. Store any holiday decorations. Put away those Halloween, Easter, or Christmas decorations and take them out only when you need them. Store any camping gear, ski equipment, fishing poles, or anything that you only need on vacation."
        },
        {
          "headline":"Decide what to sell or donate.",
          "description":"You should sell or donate any items that you don't want/need but which still may have some value to someone. If you have clothes that are still in good condition, appliances that are still completely functional, or a nice painting that you just can't stand, then it's time to donate or sell the items. Look for doubles of useful items. If you have two coffee makers, two tea kettles, or twice as many lamps as you need, then start donating or selling the items. Even if they work perfectly well, you don't need two of them. You can easily sell your items by putting them on craigslist or having a garage sale. You can donate anything that isn't sold. Selling items is rewarding, but it can take a bit of time. If you don't have the time, then just donate everything and you'll be doing a good deed."
        },
        {
          "headline":"Keep a \"maybe\" box.",
          "description":"The \"maybe\" box is where you can place the items that you're not sure if you should store or keep the stuff. Store the stuff for now, and then come back to it in six months and throw it out if you haven't thought about it once. You may forget about the box all together -- but at least all the stuff in it will be out of your space."
        }
      ]
    },
    {
      "name":"Reorganize Your Space",
      "steps":[
        {
          "headline":"Put everything in its logical place.",
          "description":"Sorting through your things is the hard part. Now, you just have to throw out all of the trash, store all of the items you've chosen to store, and donate or sell all of the remaining items. Put all of the items you want to keep back where they belong, and make sure to have a great organizational system that will keep them neatly in place. Organize your clothes by how often you wear them and what type of clothes they are. Create a filing system that will help you put all of your future papers in the right place. Invest in plastic bins to help store items in your closets. If you have a lot of shoes and don't know what to do with them, invest in a shoe-rack. Organize the books on your shelves based on the genre or time period, and make sure all the books are actually stored vertically instead of just sitting sideways on your shelves. Make sure to clearly label all of the stored items so you can easily access them when the time comes. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKeith Bartolomei\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer & Certified KonMari Consultant\t\t\t\t\t\t\t\tKeith Bartolomei is a Professional Organizer who runs his own consulting business called Zen Habitat based in the San Francisco Bay Area. Keith is a member of the National Association of Productivity and Organizing Professionals (NAPO), and is a Certified KonMari Consultant. He has over six years of organizational experience and has been trained in the art of tidying, including being trained by author of The Life Changing Magic of Tidying Up, Marie Kondo, and her team. He has been voted as one of the Best Home Organizers in San Francisco by Expertise in 2018 and 2019. Keith Bartolomei\t\t\tProfessional Organizer & Certified KonMari Consultant\t\t\t\tSave sentimental items for last. As you encounter sentimental items, simply identify them as such and save them in a box to be considered at the very end of the process. When the time comes to organize your sentimental items, you can approach  them with greater confidence and efficiency."
        },
        {
          "headline":"Rearrange your furniture.",
          "description":"Get rid of any extra furniture you don't need and rearrange your furniture in a way that creates the most space by not blocking off any extra space with the furniture, leaving the windows open and free to let in lots of light, and keeping everything arranged in an aesthetically pleasing way. Rearranging your furniture will also make the space feel new, and will make you feel like you've truly embarked on a new clutter-free era of your life. Consider putting up an extra mirror or two in place of a painting. This will make your walls look less busy and will create the illusion of more space."
        },
        {
          "headline":"Keep your counters clean and relatively empty.",
          "description":"If you want to feel calm and at ease in your new space, then you should keep the counters of your desk, kitchen table, kitchen, coffee table, and any other surfaces relatively empty. Wipe them down, and only keep the items on them that you really need. If you're cleaning the surface of your desk, you can keep a mug for pens, a few small office supplies, and one photograph, but don't leave ten pictures and five stuffed animals and knickknacks on the surface of your work space. Your kitchen table should only have things on it that are related to eating, such as salt, pepper, and napkins. Don't use the kitchen table as a place to store your extra school supplies or papers."
        }
      ]
    },
    {
      "name":"Maintain a Decluttered Home",
      "steps":[
        {
          "headline":"Make time for weekly and daily decluttering.",
          "description":"If you want to maintain your home's new beautiful decluttered look, then you have to know that decluttering is only half the battle. Now that your home looks nice, you have to make a concerted effort for it to stay that way by making time to keep your space organized every day and at the end of every week. Spend 10-15 minutes decluttering your space at the end of every day, no matter how tired you are. You can also think of it as a challenge. Tell yourself you're done once you've put ten items in their place. Spend at least 30 minutes decluttering your space on the weekends. You'll have a bit more time to do this on Saturdays or Sundays, and can do it while watching television or chatting with friends on the phone. It doesn't have to feel like a chore."
        },
        {
          "headline":"Enlist the help of anyone who shares your home.",
          "description":"Decluttering is much easier with the help of others, and so is maintaining a decluttered home. If you really want all of your hard work to pay off, then you have to enlist the help of your roommates, significant other, children, or anyone else who shares your home. The process will be much easier if the person you're living with is just as committed as you are. If he's not, then you may spend a lot of time just cleaning after him/her. Set household rules that encourage cleanliness. Say that all dishes have to be washed right after they're used, and that certain toys can only go in certain rooms, and so on. If your roommate or significant other is just as committed to the process as you, then you can even take turns during nightly mini-decluttering sessions."
        },
        {
          "headline":"Be a savvy consumer.",
          "description":"Being a savvy consumer will help you continue to live in a calm and clean space. Pay attention to all of the things you buy and ask yourself if it's something you'll really need or if you won't have a use for it after all. If you're a smart consumer, then you won't be buying too many new items and crowding your home with them. Make a list before you shop. Whether you're going grocery shopping or trying to improve your summer wardrobe, make a list of all the items you really do need, so you come home with only the things you're looking for and don't fall victim to the impulse buy. If you're not sure whether you should buy something, then resist the urge. See if you really want that thing two or three weeks later. If you really need new furniture, get rid of old furniture. Don't crowd your space with more furniture. If you really need a new coffee table, don't put the old one in a different room; get rid of it. Sign up for electronic bills so paper bills no longer crowd your space."
        },
        {
          "headline":"Give away one old item each week.",
          "description":"This old trick will help you continue to declutter every single week, and it can also be a lot of fun. Just go through your things, whether you're looking at an old dress you may never wear after all, your second coffee maker, or a book you'll never read, and find a good friend or family member who will have a use for it. If you can't think of anyone who will have a use for it, just donate it. If you're feeling ambitious, you can aim to give away two old items each week, and go up from there."
        }
      ]
    }
  ],
  "text":" Make a Game Plan Find a decluttering schedule that works for you. There are many approaches to decluttering your space. Depending on your schedule (if you have one), take an hour or two or maybe even a whole day to declutter (depending how much stuff you do have to declutter). No matter how little time you have, you'll be able to find a decluttering schedule that works for you. Start small. Focus on one room at a time and work your way to the next one until you have decluttered every room you planned on decluttering. When you begin to declutter, you may be tempted to turn your entire house outside down and to gut every single piece of furniture right from the start. This may seem like a good idea, but it will actually make your space seem so messy that your goals become unmanageable.This may seem like it will take forever, but if you're methodical, you'll be able to make the most of your time. You can even declutter your things if you commit just five minutes a day to the process. Set reasonable goals. You should only empty out a room or a piece of furniture if you have the time to sort through everything in it and to put everything back in its place. Enlist the help of others. Decluttering will be much more fun and manageable if you enlist the help of others, whether you have roommates or just helpful friends who want to spend time with you. Working with others to declutter your space will make the time pass by much faster, and will make the entire process more enjoyable. You do not have to do this, though. For some, decluttering may be a personal project. Play some music and order pizza. Make the whole process feel more like a party than a cleaning session. Don't let the leftovers and package lay around, though. Having other people help you is also valuable because they may have better insight into the things you really need. A trusted friend or family member can give you the courage to throw out an item that you're attached to for no good reason. Get rid of easy targets. Once you've found a schedule that works for you, as well as the help of some trusted friends, you can start the process by getting rid of some easy superficial targets. Before you get serious and take it one room at a time, you'll feel better if you're instantly able to get rid of a few items that are crowding your life. Here are some quick and easy targets that can give you a jump start on decluttering your space:\nJust get a big black trash bag and fill it with old papers, old shoes you haven't worn in years, empty shampoo bottles, old mail, and anything else that's in plain sight. Go through your fridge and medicine cabinets and toss any old and expired items. Get rid of any garish pieces of furniture that are crowding your space. If you just can't stand that big, ugly chair in the corner of your living room, you may feel better if you set it to the curb right away. Sort Through Your Things Empty out all of the things in one room or area. To declutter in an organized fashion, you'll need to empty out everything in one room, or one area of a room, or even one drawer, before you can get the whole picture. You can put all of the things on the floor or on a piece of furniture -- anywhere where they are in plain sight. Be prepared with four different boxes: a box for things you'll keep, a box for things you'll store, one for things you'll donate or sell, and the last one for things you'll throw out. Decide what to keep. At first, you may want to keep absolutely everything you've taken out. But remind yourself that the point of decluttering is to get rid of all of the extra things that are crowding your life. You should keep the items that you use on a regular basis, which you wear, cook with, or use for other household tasks. You should keep anything you've used in the last year. If you're really trying to declutter, you can make that everything you've used in the last six months. EXPERT TIP\t\t\t\t\t\t\t\tKathi Burns, CPO®\t\t\tBoard Certified Professional Organizer\t\t\t\tA common mistake when cleaning your home is buying organizers before you sort. Avoid purchasing any organizing bins or an organizing system until after you see what you have, and you sort everything. People feel great when they go out and buy a bunch of bins, but you can't buy the right things without knowing what you're sorting. Decide what to throw out. The point is to get rid of any- and everything you no longer use, that has expired, is broken and can't be repaired, or just anything you generally don't use and just lays all over the place. Get rid of it. If you have an item that you haven't used in a year, have completely forgotten about, or can't even image what you'll need it for ever again, then it's time to toss it. Go through your things and ask yourself, \"Do I really need this?\" If the answer is no, or if you hesitate for more than five seconds, it's time to part with it. You may save a few precious sentimental items, but don't overdo it. You can't save every little thing, and you shouldn't make excuses for why every little button and piece of lint has special meaning in your life. This is a great time to get the advice of your trusted friends. They may be able to be more honest and tell you that you will never use a certain item. Decide what to store. You should store any item that you will need eventually, but which you know you won't need for at least a few more months. Many of these items will be seasonal or special occasion items. Store your seasonal clothes. If it's the middle of summer, you can put away your winter sweaters for a few months. Store any holiday decorations. Put away those Halloween, Easter, or Christmas decorations and take them out only when you need them. Store any camping gear, ski equipment, fishing poles, or anything that you only need on vacation. Decide what to sell or donate. You should sell or donate any items that you don't want/need but which still may have some value to someone. If you have clothes that are still in good condition, appliances that are still completely functional, or a nice painting that you just can't stand, then it's time to donate or sell the items. Look for doubles of useful items. If you have two coffee makers, two tea kettles, or twice as many lamps as you need, then start donating or selling the items. Even if they work perfectly well, you don't need two of them. You can easily sell your items by putting them on craigslist or having a garage sale. You can donate anything that isn't sold. Selling items is rewarding, but it can take a bit of time. If you don't have the time, then just donate everything and you'll be doing a good deed. Keep a \"maybe\" box. The \"maybe\" box is where you can place the items that you're not sure if you should store or keep the stuff. Store the stuff for now, and then come back to it in six months and throw it out if you haven't thought about it once. You may forget about the box all together -- but at least all the stuff in it will be out of your space. Reorganize Your Space Put everything in its logical place. Sorting through your things is the hard part. Now, you just have to throw out all of the trash, store all of the items you've chosen to store, and donate or sell all of the remaining items. Put all of the items you want to keep back where they belong, and make sure to have a great organizational system that will keep them neatly in place. Organize your clothes by how often you wear them and what type of clothes they are. Create a filing system that will help you put all of your future papers in the right place. Invest in plastic bins to help store items in your closets. If you have a lot of shoes and don't know what to do with them, invest in a shoe-rack. Organize the books on your shelves based on the genre or time period, and make sure all the books are actually stored vertically instead of just sitting sideways on your shelves. Make sure to clearly label all of the stored items so you can easily access them when the time comes. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKeith Bartolomei\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer & Certified KonMari Consultant\t\t\t\t\t\t\t\tKeith Bartolomei is a Professional Organizer who runs his own consulting business called Zen Habitat based in the San Francisco Bay Area. Keith is a member of the National Association of Productivity and Organizing Professionals (NAPO), and is a Certified KonMari Consultant. He has over six years of organizational experience and has been trained in the art of tidying, including being trained by author of The Life Changing Magic of Tidying Up, Marie Kondo, and her team. He has been voted as one of the Best Home Organizers in San Francisco by Expertise in 2018 and 2019. Keith Bartolomei\t\t\tProfessional Organizer & Certified KonMari Consultant\t\t\t\tSave sentimental items for last. As you encounter sentimental items, simply identify them as such and save them in a box to be considered at the very end of the process. When the time comes to organize your sentimental items, you can approach  them with greater confidence and efficiency. Rearrange your furniture. Get rid of any extra furniture you don't need and rearrange your furniture in a way that creates the most space by not blocking off any extra space with the furniture, leaving the windows open and free to let in lots of light, and keeping everything arranged in an aesthetically pleasing way. Rearranging your furniture will also make the space feel new, and will make you feel like you've truly embarked on a new clutter-free era of your life. Consider putting up an extra mirror or two in place of a painting. This will make your walls look less busy and will create the illusion of more space. Keep your counters clean and relatively empty. If you want to feel calm and at ease in your new space, then you should keep the counters of your desk, kitchen table, kitchen, coffee table, and any other surfaces relatively empty. Wipe them down, and only keep the items on them that you really need. If you're cleaning the surface of your desk, you can keep a mug for pens, a few small office supplies, and one photograph, but don't leave ten pictures and five stuffed animals and knickknacks on the surface of your work space. Your kitchen table should only have things on it that are related to eating, such as salt, pepper, and napkins. Don't use the kitchen table as a place to store your extra school supplies or papers. Maintain a Decluttered Home Make time for weekly and daily decluttering. If you want to maintain your home's new beautiful decluttered look, then you have to know that decluttering is only half the battle. Now that your home looks nice, you have to make a concerted effort for it to stay that way by making time to keep your space organized every day and at the end of every week. Spend 10-15 minutes decluttering your space at the end of every day, no matter how tired you are. You can also think of it as a challenge. Tell yourself you're done once you've put ten items in their place. Spend at least 30 minutes decluttering your space on the weekends. You'll have a bit more time to do this on Saturdays or Sundays, and can do it while watching television or chatting with friends on the phone. It doesn't have to feel like a chore. Enlist the help of anyone who shares your home. Decluttering is much easier with the help of others, and so is maintaining a decluttered home. If you really want all of your hard work to pay off, then you have to enlist the help of your roommates, significant other, children, or anyone else who shares your home. The process will be much easier if the person you're living with is just as committed as you are. If he's not, then you may spend a lot of time just cleaning after him/her. Set household rules that encourage cleanliness. Say that all dishes have to be washed right after they're used, and that certain toys can only go in certain rooms, and so on. If your roommate or significant other is just as committed to the process as you, then you can even take turns during nightly mini-decluttering sessions. Be a savvy consumer. Being a savvy consumer will help you continue to live in a calm and clean space. Pay attention to all of the things you buy and ask yourself if it's something you'll really need or if you won't have a use for it after all. If you're a smart consumer, then you won't be buying too many new items and crowding your home with them. Make a list before you shop. Whether you're going grocery shopping or trying to improve your summer wardrobe, make a list of all the items you really do need, so you come home with only the things you're looking for and don't fall victim to the impulse buy. If you're not sure whether you should buy something, then resist the urge. See if you really want that thing two or three weeks later. If you really need new furniture, get rid of old furniture. Don't crowd your space with more furniture. If you really need a new coffee table, don't put the old one in a different room; get rid of it. Sign up for electronic bills so paper bills no longer crowd your space. Give away one old item each week. This old trick will help you continue to declutter every single week, and it can also be a lot of fun. Just go through your things, whether you're looking at an old dress you may never wear after all, your second coffee maker, or a book you'll never read, and find a good friend or family member who will have a use for it. If you can't think of anyone who will have a use for it, just donate it. If you're feeling ambitious, you can aim to give away two old items each week, and go up from there.",
  "sentences":[
    " Make a Game Plan Find a decluttering schedule that works for you.",
    "There are many approaches to decluttering your space.",
    "Depending on your schedule (if you have one), take an hour or two or maybe even a whole day to declutter (depending how much stuff you do have to declutter).",
    "No matter how little time you have, you'll be able to find a decluttering schedule that works for you.",
    "Start small.",
    "Focus on one room at a time and work your way to the next one until you have decluttered every room you planned on decluttering.",
    "When you begin to declutter, you may be tempted to turn your entire house outside down and to gut every single piece of furniture right from the start.",
    "This may seem like a good idea, but it will actually make your space seem so messy that your goals become unmanageable.This may seem like it will take forever, but if you're methodical, you'll be able to make the most of your time.",
    "You can even declutter your things if you commit just five minutes a day to the process.",
    "Set reasonable goals.",
    "You should only empty out a room or a piece of furniture if you have the time to sort through everything in it and to put everything back in its place.",
    "Enlist the help of others.",
    "Decluttering will be much more fun and manageable if you enlist the help of others, whether you have roommates or just helpful friends who want to spend time with you.",
    "Working with others to declutter your space will make the time pass by much faster, and will make the entire process more enjoyable.",
    "You do not have to do this, though.",
    "For some, decluttering may be a personal project.",
    "Play some music and order pizza.",
    "Make the whole process feel more like a party than a cleaning session.",
    "Don't let the leftovers and package lay around, though.",
    "Having other people help you is also valuable because they may have better insight into the things you really need.",
    "A trusted friend or family member can give you the courage to throw out an item that you're attached to for no good reason.",
    "Get rid of easy targets.",
    "Once you've found a schedule that works for you, as well as the help of some trusted friends, you can start the process by getting rid of some easy superficial targets.",
    "Before you get serious and take it one room at a time, you'll feel better if you're instantly able to get rid of a few items that are crowding your life.",
    "Here are some quick and easy targets that can give you a jump start on decluttering your space:\nJust get a big black trash bag and fill it with old papers, old shoes you haven't worn in years, empty shampoo bottles, old mail, and anything else that's in plain sight.",
    "Go through your fridge and medicine cabinets and toss any old and expired items.",
    "Get rid of any garish pieces of furniture that are crowding your space.",
    "If you just can't stand that big, ugly chair in the corner of your living room, you may feel better if you set it to the curb right away.",
    "Sort Through Your Things Empty out all of the things in one room or area.",
    "To declutter in an organized fashion, you'll need to empty out everything in one room, or one area of a room, or even one drawer, before you can get the whole picture.",
    "You can put all of the things on the floor or on a piece of furniture -- anywhere where they are in plain sight.",
    "Be prepared with four different boxes: a box for things you'll keep, a box for things you'll store, one for things you'll donate or sell, and the last one for things you'll throw out.",
    "Decide what to keep.",
    "At first, you may want to keep absolutely everything you've taken out.",
    "But remind yourself that the point of decluttering is to get rid of all of the extra things that are crowding your life.",
    "You should keep the items that you use on a regular basis, which you wear, cook with, or use for other household tasks.",
    "You should keep anything you've used in the last year.",
    "If you're really trying to declutter, you can make that everything you've used in the last six months.",
    "EXPERT TIP\t\t\t\t\t\t\t\tKathi Burns, CPO®\t\t\tBoard Certified Professional Organizer\t\t\t\tA common mistake when cleaning your home is buying organizers before you sort.",
    "Avoid purchasing any organizing bins or an organizing system until after you see what you have, and you sort everything.",
    "People feel great when they go out and buy a bunch of bins, but you can't buy the right things without knowing what you're sorting.",
    "Decide what to throw out.",
    "The point is to get rid of any- and everything you no longer use, that has expired, is broken and can't be repaired, or just anything you generally don't use and just lays all over the place.",
    "Get rid of it.",
    "If you have an item that you haven't used in a year, have completely forgotten about, or can't even image what you'll need it for ever again, then it's time to toss it.",
    "Go through your things and ask yourself, \"Do I really need this?\"",
    "If the answer is no, or if you hesitate for more than five seconds, it's time to part with it.",
    "You may save a few precious sentimental items, but don't overdo it.",
    "You can't save every little thing, and you shouldn't make excuses for why every little button and piece of lint has special meaning in your life.",
    "This is a great time to get the advice of your trusted friends.",
    "They may be able to be more honest and tell you that you will never use a certain item.",
    "Decide what to store.",
    "You should store any item that you will need eventually, but which you know you won't need for at least a few more months.",
    "Many of these items will be seasonal or special occasion items.",
    "Store your seasonal clothes.",
    "If it's the middle of summer, you can put away your winter sweaters for a few months.",
    "Store any holiday decorations.",
    "Put away those Halloween, Easter, or Christmas decorations and take them out only when you need them.",
    "Store any camping gear, ski equipment, fishing poles, or anything that you only need on vacation.",
    "Decide what to sell or donate.",
    "You should sell or donate any items that you don't want/need but which still may have some value to someone.",
    "If you have clothes that are still in good condition, appliances that are still completely functional, or a nice painting that you just can't stand, then it's time to donate or sell the items.",
    "Look for doubles of useful items.",
    "If you have two coffee makers, two tea kettles, or twice as many lamps as you need, then start donating or selling the items.",
    "Even if they work perfectly well, you don't need two of them.",
    "You can easily sell your items by putting them on craigslist or having a garage sale.",
    "You can donate anything that isn't sold.",
    "Selling items is rewarding, but it can take a bit of time.",
    "If you don't have the time, then just donate everything and you'll be doing a good deed.",
    "Keep a \"maybe\" box.",
    "The \"maybe\" box is where you can place the items that you're not sure if you should store or keep the stuff.",
    "Store the stuff for now, and then come back to it in six months and throw it out if you haven't thought about it once.",
    "You may forget about the box all together -- but at least all the stuff in it will be out of your space.",
    "Reorganize Your Space Put everything in its logical place.",
    "Sorting through your things is the hard part.",
    "Now, you just have to throw out all of the trash, store all of the items you've chosen to store, and donate or sell all of the remaining items.",
    "Put all of the items you want to keep back where they belong, and make sure to have a great organizational system that will keep them neatly in place.",
    "Organize your clothes by how often you wear them and what type of clothes they are.",
    "Create a filing system that will help you put all of your future papers in the right place.",
    "Invest in plastic bins to help store items in your closets.",
    "If you have a lot of shoes and don't know what to do with them, invest in a shoe-rack.",
    "Organize the books on your shelves based on the genre or time period, and make sure all the books are actually stored vertically instead of just sitting sideways on your shelves.",
    "Make sure to clearly label all of the stored items so you can easily access them when the time comes.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKeith Bartolomei\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer & Certified KonMari Consultant\t\t\t\t\t\t\t\tKeith Bartolomei is a Professional Organizer who runs his own consulting business called Zen Habitat based in the San Francisco Bay Area.",
    "Keith is a member of the National Association of Productivity and Organizing Professionals (NAPO), and is a Certified KonMari Consultant.",
    "He has over six years of organizational experience and has been trained in the art of tidying, including being trained by author of The Life Changing Magic of Tidying Up, Marie Kondo, and her team.",
    "He has been voted as one of the Best Home Organizers in San Francisco by Expertise in 2018 and 2019.",
    "Keith Bartolomei\t\t\tProfessional Organizer & Certified KonMari Consultant\t\t\t\tSave sentimental items for last.",
    "As you encounter sentimental items, simply identify them as such and save them in a box to be considered at the very end of the process.",
    "When the time comes to organize your sentimental items, you can approach  them with greater confidence and efficiency.",
    "Rearrange your furniture.",
    "Get rid of any extra furniture you don't need and rearrange your furniture in a way that creates the most space by not blocking off any extra space with the furniture, leaving the windows open and free to let in lots of light, and keeping everything arranged in an aesthetically pleasing way.",
    "Rearranging your furniture will also make the space feel new, and will make you feel like you've truly embarked on a new clutter-free era of your life.",
    "Consider putting up an extra mirror or two in place of a painting.",
    "This will make your walls look less busy and will create the illusion of more space.",
    "Keep your counters clean and relatively empty.",
    "If you want to feel calm and at ease in your new space, then you should keep the counters of your desk, kitchen table, kitchen, coffee table, and any other surfaces relatively empty.",
    "Wipe them down, and only keep the items on them that you really need.",
    "If you're cleaning the surface of your desk, you can keep a mug for pens, a few small office supplies, and one photograph, but don't leave ten pictures and five stuffed animals and knickknacks on the surface of your work space.",
    "Your kitchen table should only have things on it that are related to eating, such as salt, pepper, and napkins.",
    "Don't use the kitchen table as a place to store your extra school supplies or papers.",
    "Maintain a Decluttered Home Make time for weekly and daily decluttering.",
    "If you want to maintain your home's new beautiful decluttered look, then you have to know that decluttering is only half the battle.",
    "Now that your home looks nice, you have to make a concerted effort for it to stay that way by making time to keep your space organized every day and at the end of every week.",
    "Spend 10-15 minutes decluttering your space at the end of every day, no matter how tired you are.",
    "You can also think of it as a challenge.",
    "Tell yourself you're done once you've put ten items in their place.",
    "Spend at least 30 minutes decluttering your space on the weekends.",
    "You'll have a bit more time to do this on Saturdays or Sundays, and can do it while watching television or chatting with friends on the phone.",
    "It doesn't have to feel like a chore.",
    "Enlist the help of anyone who shares your home.",
    "Decluttering is much easier with the help of others, and so is maintaining a decluttered home.",
    "If you really want all of your hard work to pay off, then you have to enlist the help of your roommates, significant other, children, or anyone else who shares your home.",
    "The process will be much easier if the person you're living with is just as committed as you are.",
    "If he's not, then you may spend a lot of time just cleaning after him/her.",
    "Set household rules that encourage cleanliness.",
    "Say that all dishes have to be washed right after they're used, and that certain toys can only go in certain rooms, and so on.",
    "If your roommate or significant other is just as committed to the process as you, then you can even take turns during nightly mini-decluttering sessions.",
    "Be a savvy consumer.",
    "Being a savvy consumer will help you continue to live in a calm and clean space.",
    "Pay attention to all of the things you buy and ask yourself if it's something you'll really need or if you won't have a use for it after all.",
    "If you're a smart consumer, then you won't be buying too many new items and crowding your home with them.",
    "Make a list before you shop.",
    "Whether you're going grocery shopping or trying to improve your summer wardrobe, make a list of all the items you really do need, so you come home with only the things you're looking for and don't fall victim to the impulse buy.",
    "If you're not sure whether you should buy something, then resist the urge.",
    "See if you really want that thing two or three weeks later.",
    "If you really need new furniture, get rid of old furniture.",
    "Don't crowd your space with more furniture.",
    "If you really need a new coffee table, don't put the old one in a different room; get rid of it.",
    "Sign up for electronic bills so paper bills no longer crowd your space.",
    "Give away one old item each week.",
    "This old trick will help you continue to declutter every single week, and it can also be a lot of fun.",
    "Just go through your things, whether you're looking at an old dress you may never wear after all, your second coffee maker, or a book you'll never read, and find a good friend or family member who will have a use for it.",
    "If you can't think of anyone who will have a use for it, just donate it.",
    "If you're feeling ambitious, you can aim to give away two old items each week, and go up from there."
  ],
  "tyn_section":[
    "Boxes.",
    "Garbage bags.",
    "Permanent markers for labeling the boxes."
  ],
  "tyn_model":[
    "organizer",
    "books",
    "pizza",
    "trash bag",
    "chair",
    "organizers",
    "organizing bins",
    "bins",
    "lint",
    "camping gear",
    "fishing poles",
    "appliances",
    "coffee makers",
    "tea kettles",
    "lamps",
    "konmari consultant",
    "zen habitat",
    "furniture",
    "mirror",
    "salt, pepper",
    "napkins",
    "kitchen table",
    "dishes",
    "coffee maker"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}