{
  "title":"How to Build a Backyard Waterfall",
  "url":"https://www.wikihow.com/Build-a-Backyard-Waterfall",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Designing Your Waterfall",
      "steps":[
        {
          "headline":"Create a waterfall with a pond if you plan on keeping plants or fish.",
          "description":"There are many different ways to set up a pond with a waterfall system. The easiest way to do it is to stack rocks to create a spillway on the edge of your pond. You could also dig out the soil to create a lower pond and an upper pond. Connect them by having the water spill from the upper pond to the lower one or by building a sloping stream between them. If you already have a pond in your yard, pile up soil and rocks to create a shelf for water to spill from. This is the easiest way to get a waterfall since you get to avoid a lot of extra digging. The water falls from the spillway to the pond, then enters a pump system you install to bring it back to the top."
        },
        {
          "headline":"Build a stream if you prefer a long, gentle waterfall.",
          "description":"To create a stream, you need to first dig out a pair of ponds or basins. Then, dig out the stream to go from the higher basin to the lower one. The stream has to be sloped to move water downhill, so working on a natural incline in your yard reduces the amount of digging you have to do. With a stream, you have the option to build many small waterfalls. Arrange the rocks in the stream to create shelves for the water to spill from. Stream waterfalls are long compared to pond waterfalls and require a stronger pump and a longer hose. For example, streams are generally at least 3 ft (0.91 m) long, so you need to commit more space in your yard to set it up."
        },
        {
          "headline":"Make an above-ground waterfall if you can’t dig out your yard.",
          "description":"If you have limited space or a yard that isn’t easy to build on, you still have a way to get a good pond. Stack strong building material like limestone boulders to build a basin that catches the water. Then, stack more of the material on one end of the basin to create an area for the water to fall from. You could build a basin out of resistant materials like cinder blocks or bricks. Above-ground waterfalls come in many styles, so let your creativity loose when designing yours. To hold the pond together, spread a waterproof expanding foam around every rock. The building material has to be strong and well-sealed to hold the water in place."
        },
        {
          "headline":"Design a below-ground waterfall if you are able to dig out your yard.",
          "description":"Most pond and stream waterfalls involve a little bit of digging. For this type of waterfall, you basically dig a hole in the ground, then make a vertical stack of rocks on one end. Place a water hose in the rocks to spill water down and into the basin. This is called a pondless basin, and the water gets circulated continuously through a strong pump. This type of waterfall is similar to any basic pond waterfall. If you don’t already have a pond or a water basin, you could dig a new one before building your waterfall."
        },
        {
          "headline":"Choose the size of your waterfall and basin before beginning construction.",
          "description":"The average size of a pond with a built-in waterfall is 10 ft × 15 ft (3.0 m × 4.6 m). If you’re planning on making a stream or a pondless basin, do some math to estimate the minimum size you need. Generally, the basin has to hold about 2.5 times the amount of water circulating through the waterfall. To figure out how much water is in motion through your waterfall, measure the waterfall’s length, width, and depth in feet. The formula is length x width x (depth x 0.25) x 7.48. The 0.25 is the thickness of the water and the 7.48 is the number of gallons in a cubic foot. Then, multiply the amount of water in motion by 2.5 to figure out how many total gallons of water you need. For example, if your waterfall is 10 x 3 x 0.5 ft in size:  10 ft x 3 ft x (0.25 x 0.5 ft) x 7.48 gal/cubic ft = 28.05 gallons of water in motion. Then, 28.76 gallons x 2.5 = 70 gallons of water needed in the pond. Remember to do the same for the upper pond or basin if you plan on building one. Keep it roughly the same size to ensure water moves through the waterfall at a steady rate."
        },
        {
          "headline":"Select a visible location about 20 ft (6.1 m) from your home.",
          "description":"Put your waterfall in a spot where it can be enjoyed from different angles, both inside and outside your home. The best spot for a pond is usually near a deck, patio, or window on your home. These areas also tend to be accessible to water spigots and electrical outlets you may need to power your waterfall. Also, since waterfalls are all about water falling from a higher area to a lower one, build on a natural incline to reduce the amount of digging you have to do. Any ponds connected to the waterfall require about 6 hours of direct sunlight if you’re keeping any plants or fish. For example, place the pond close to a water spigot so you can easily fill it with a hose. Also, the pond’s lower basin needs to be within range of an electrical outlet to operate the pump. However, connect the pump with an extension cord to prevent water from splashing onto the outlet."
        },
        {
          "headline":"Order gravel and stones to use to build your stream.",
          "description":"Gravel is very important for covering and pinning down the pond’s liner, so purchase plenty of rounded gravel or river rocks. You also need plenty of boulders and flat rocks to line the stream. These larger stones are great for decorating the pond and covering some of its construction components. Flat limestone rocks are great for creating waterfall spillways, while larger boulders are useful for framing the pond. Most home and garden centers have limited supplies of pond-building material. For a bigger selection, search for quarries and stone suppliers in your area. To figure out how many boulders you need, multiply your waterway’s length and width, then divide it by 65 tons per foot. This gives you an estimate in tons, but keep in mind that rocks come in different sizes. For instance, if your waterfall is 10 ft x 3 ft in size, you need about 0.46 tons of rocks for that area. Estimate the amount of gravel you need by taking the amount of boulders in tons you need, then dividing by 0.45. The gravel layer generally has to be about 3 in (7.6 cm) deep. For example, if your waterfall is 10 ft x 3 ft, you need approximately 1 ton of gravel to fill it."
        }
      ]
    },
    {
      "name":"Constructing Basins and Streams",
      "steps":[
        {
          "headline":"Stack rocks and blocks to create a basin for an above-ground waterfall.",
          "description":"After you know where you want to build the basin, begin constructing it with boulders, cinder blocks, or alternative material. Make the basin tall enough to hold the amount of water circulating through your stream. Then, spread a waterproof expanding foam around each rock to glue the basin together. Remember to build one side of the basin higher than the other. Use some flat rocks or smaller boulders to create a natural-looking waterfall. Leave space for the hose you need to install to start the waterfall."
        },
        {
          "headline":"Dig out the pond or lower basin for an in-ground pond.",
          "description":"The water needs a place to collect while your submersible pump circulates it back to the top of the waterfall. The basin has to be at least 1 ft (0.30 m) larger than your stream or waterfall to prevent the water from splashing out of it. It also needs to be bigger than your submersible pump. Make sure you have enough space in your pond or basin to fit the pump and hide it with rocks. If you’re building an above-ground waterfall, skip this part. You won’t be able to dig out the basin, so compensate for it by building an above-ground basin out of rocks or cinder blocks. Call the local utility companies to come out and mark the utility lines before you begin digging. Striking a line by accident is a sure way to spoil your project."
        },
        {
          "headline":"Create a second hole for the pump if you’re making a pondless basin.",
          "description":"For pondless basins, usually with stream waterfalls, you make a deeper hole to plant the pump in. Measure the pump enclosure first to figure out how big the hole needs to be. Then, dig a square hole at least 2 ft (0.61 m) wider and 6 in (15 cm) deeper than the pump. Keep the hole near the far end of the basin, opposite of the waterfall. Doing this makes it much easier to hide underneath dirt and rocks."
        },
        {
          "headline":"Create the upper waterfall pool and stream by digging and smoothing out the soil.",
          "description":"Excavating is the most intensive part of building a waterfall, but you’re almost done. To create the upper part of your waterfall, dig out the upper basin if your design has one. Then, connect the upper basin and lower basin with a series of dirt “steps.” The water falls from step to step as it heads toward the lower basin. On average, make the stream bed roughly 3 ft (0.91 m) and at least 6 in (15 cm) inches deep. Pile the soil into ridges to create a staircase effect that makes the water travel downstream more efficiently. The first “step” in the stream needs to be the steepest. After that, add as many steps as you want or have room for. Try to leave some space between each step so you get the full effect of each mini waterfall."
        },
        {
          "headline":"Spread an EPDM pond liner and underlayment over each part of your waterfall.",
          "description":"If your pond is small enough, get a single liner that stretches from the bottom basin to the top of the waterfall. Otherwise, use a separate liner for the lower basin or pond, stream, and upper basin or pond. After spreading the pond liner flat, lay a propylene underlayment on top of it to protect it from damage. Use 45 mil liners, which are ⁄1000 in (0.11 cm)-thick. To estimate the liner size you need, first calculate the pond or waterfall’s depth from top to bottom , double it, and add 1. Then, add that number to both the length and width to get the approximate liner size. For example, if you have a 10 ft x 5 ft x 3 ft basin, first calculate the depth as 6 x 2 + 1. Then, add the depth of 7 to the length and width. You need a liner at least 17 ft × 12 ft (5.2 m × 3.7 m) in size."
        }
      ]
    },
    {
      "name":"Equipping and Filling the Waterfall",
      "steps":[
        {
          "headline":"Calculate the pump strength you need to circulate water.",
          "description":"To determine what kind of pump you need, first measure across the width of the head of your waterfall. Then, measure vertically from the top of the waterfall to the water’s surface. Finish by deciding how quickly you want water to flow through the system. Use these numbers to calculate the correct pump rating you need for your waterfall. Search for a waterfall pump calculator online, then plug in your estimates to figure out the minimum pump rating you need for your waterfall to function. A medium flow requires a pump discharge rate of 1,500 US gal (5,700 L) per hour, or gph. Use a 1,000 US gal (3,800 L) estimate for a slower flow and a 2,000 US gal (7,600 L) estimate for a heavier flow. On average, the pump needs to handle 1,500 US gal (5,700 L) per 1 ft (0.30 m) of width at your waterfall’s head."
        },
        {
          "headline":"Install and connect the pump before placing it in the basin.",
          "description":"Check the owner’s manual with your pump for specific setup instructions. You usually need a rubber hose that is long enough to run from the pump to the top of your waterfall. Measure this distance as well as the opening on the pump. After getting a hose with the same size opening, fit it directly over the pump’s opening. If your pump is inside an enclosure, use a 2 in (5.1 cm) hole saw to cut a few holes in the enclosure. Keep the holes about 4 in (10 cm) apart to let water into the pump. Plant the pump deeply inside the lower pond or basin and make sure the hose is long enough to reach the top of your waterfall."
        },
        {
          "headline":"Connect the upper chamber flow valve if you plan on using one.",
          "description":"An easy way to build one is by using a heavy-duty, 3-sided plastic storage bin. Face the open end of the bin toward the waterfall and lower basin. Then, drill a hole the same size as the adapter on your hose. Finish the valve by connecting the hose using a rubber washer and a bead of silicone adhesive. To secure the hose further, add a steel lock-nut and a hose clamp. Valves are a great way to get the water flowing down the waterfall, especially in a long stream. In most cases, valves are more for aesthetic purposes rather than a necessity for controlling the water flow."
        },
        {
          "headline":"Line the outer edges of any basins with large boulders.",
          "description":"Rest the rocks on the edges of the ponds or basins, using them to pin the liner in place. Push them as close together as possible to hide the liner while preventing the water from splashing out. Also, arrange the rocks to cover the pump, hose, and other components you wish to hide. Place the rocks carefully to avoid blocking or crushing the hose and other components. They are heavy and have to be placed with care. Hide the components between the rocks instead of piling rocks on top of them."
        },
        {
          "headline":"Build the waterfalls by forming shelves out of rocks.",
          "description":"Place some medium-sized rocks at the top of the waterfall or over the steps in a stream. Arrange them in a semicircular pattern, if possible, along the edge of each drop. Flat rocks are a great choice in most waterfalls since they look good and are easy to fit together. Pile all of the rocks as closely together as possible so the water flows around them on its way down to the lower basin. Spread some expanding foam underneath the rocks as needed to hold them in place over the liner. Also, use the foam to fill in any gaps, forcing the water to move over the rocks instead of through them."
        },
        {
          "headline":"Spread gravel and tamp it down to cover the rest of the liner.",
          "description":"Open up your bags of gravel and begin pouring them directly onto the underlayment. You need plenty of bags to cover over both basins and the waterfall, so don’t hold back. Make the gravel layer at least 3 in (7.6 cm) deep to hide the liner. When you’re done, smooth the gravel layer out as much as possible with your hands so it looks even. Pack plenty of gravel and dirt around larger stones to help hold them in place. Remember that the gravel is much lighter than the larger stones, so it’s better for holding down and hiding hoses and other components."
        },
        {
          "headline":"Wash the rocks with a gentle spray to fill the waterfall.",
          "description":"Spray down your entire waterfall until the water rises above the gravel and the pump underneath it. With water in the basin, you can safely activate the pump. Run the pump while continuing to spray the stones until the water looks clean. Tidy up your waterfall as needed before sitting down to enjoy its soothing sounds. Spraying the stones dislodges dirt and other debris in the waterfall. The rocks and pebbles help aerate and purify the water while it moves through the system."
        }
      ]
    }
  ],
  "text":" Designing Your Waterfall Create a waterfall with a pond if you plan on keeping plants or fish. There are many different ways to set up a pond with a waterfall system. The easiest way to do it is to stack rocks to create a spillway on the edge of your pond. You could also dig out the soil to create a lower pond and an upper pond. Connect them by having the water spill from the upper pond to the lower one or by building a sloping stream between them. If you already have a pond in your yard, pile up soil and rocks to create a shelf for water to spill from. This is the easiest way to get a waterfall since you get to avoid a lot of extra digging. The water falls from the spillway to the pond, then enters a pump system you install to bring it back to the top. Build a stream if you prefer a long, gentle waterfall. To create a stream, you need to first dig out a pair of ponds or basins. Then, dig out the stream to go from the higher basin to the lower one. The stream has to be sloped to move water downhill, so working on a natural incline in your yard reduces the amount of digging you have to do. With a stream, you have the option to build many small waterfalls. Arrange the rocks in the stream to create shelves for the water to spill from. Stream waterfalls are long compared to pond waterfalls and require a stronger pump and a longer hose. For example, streams are generally at least 3 ft (0.91 m) long, so you need to commit more space in your yard to set it up. Make an above-ground waterfall if you can’t dig out your yard. If you have limited space or a yard that isn’t easy to build on, you still have a way to get a good pond. Stack strong building material like limestone boulders to build a basin that catches the water. Then, stack more of the material on one end of the basin to create an area for the water to fall from. You could build a basin out of resistant materials like cinder blocks or bricks. Above-ground waterfalls come in many styles, so let your creativity loose when designing yours. To hold the pond together, spread a waterproof expanding foam around every rock. The building material has to be strong and well-sealed to hold the water in place. Design a below-ground waterfall if you are able to dig out your yard. Most pond and stream waterfalls involve a little bit of digging. For this type of waterfall, you basically dig a hole in the ground, then make a vertical stack of rocks on one end. Place a water hose in the rocks to spill water down and into the basin. This is called a pondless basin, and the water gets circulated continuously through a strong pump. This type of waterfall is similar to any basic pond waterfall. If you don’t already have a pond or a water basin, you could dig a new one before building your waterfall. Choose the size of your waterfall and basin before beginning construction. The average size of a pond with a built-in waterfall is 10 ft × 15 ft (3.0 m × 4.6 m). If you’re planning on making a stream or a pondless basin, do some math to estimate the minimum size you need. Generally, the basin has to hold about 2.5 times the amount of water circulating through the waterfall. To figure out how much water is in motion through your waterfall, measure the waterfall’s length, width, and depth in feet. The formula is length x width x (depth x 0.25) x 7.48. The 0.25 is the thickness of the water and the 7.48 is the number of gallons in a cubic foot. Then, multiply the amount of water in motion by 2.5 to figure out how many total gallons of water you need. For example, if your waterfall is 10 x 3 x 0.5 ft in size:  10 ft x 3 ft x (0.25 x 0.5 ft) x 7.48 gal/cubic ft = 28.05 gallons of water in motion. Then, 28.76 gallons x 2.5 = 70 gallons of water needed in the pond. Remember to do the same for the upper pond or basin if you plan on building one. Keep it roughly the same size to ensure water moves through the waterfall at a steady rate. Select a visible location about 20 ft (6.1 m) from your home. Put your waterfall in a spot where it can be enjoyed from different angles, both inside and outside your home. The best spot for a pond is usually near a deck, patio, or window on your home. These areas also tend to be accessible to water spigots and electrical outlets you may need to power your waterfall. Also, since waterfalls are all about water falling from a higher area to a lower one, build on a natural incline to reduce the amount of digging you have to do. Any ponds connected to the waterfall require about 6 hours of direct sunlight if you’re keeping any plants or fish. For example, place the pond close to a water spigot so you can easily fill it with a hose. Also, the pond’s lower basin needs to be within range of an electrical outlet to operate the pump. However, connect the pump with an extension cord to prevent water from splashing onto the outlet. Order gravel and stones to use to build your stream. Gravel is very important for covering and pinning down the pond’s liner, so purchase plenty of rounded gravel or river rocks. You also need plenty of boulders and flat rocks to line the stream. These larger stones are great for decorating the pond and covering some of its construction components. Flat limestone rocks are great for creating waterfall spillways, while larger boulders are useful for framing the pond. Most home and garden centers have limited supplies of pond-building material. For a bigger selection, search for quarries and stone suppliers in your area. To figure out how many boulders you need, multiply your waterway’s length and width, then divide it by 65 tons per foot. This gives you an estimate in tons, but keep in mind that rocks come in different sizes. For instance, if your waterfall is 10 ft x 3 ft in size, you need about 0.46 tons of rocks for that area. Estimate the amount of gravel you need by taking the amount of boulders in tons you need, then dividing by 0.45. The gravel layer generally has to be about 3 in (7.6 cm) deep. For example, if your waterfall is 10 ft x 3 ft, you need approximately 1 ton of gravel to fill it. Constructing Basins and Streams Stack rocks and blocks to create a basin for an above-ground waterfall. After you know where you want to build the basin, begin constructing it with boulders, cinder blocks, or alternative material. Make the basin tall enough to hold the amount of water circulating through your stream. Then, spread a waterproof expanding foam around each rock to glue the basin together. Remember to build one side of the basin higher than the other. Use some flat rocks or smaller boulders to create a natural-looking waterfall. Leave space for the hose you need to install to start the waterfall. Dig out the pond or lower basin for an in-ground pond. The water needs a place to collect while your submersible pump circulates it back to the top of the waterfall. The basin has to be at least 1 ft (0.30 m) larger than your stream or waterfall to prevent the water from splashing out of it. It also needs to be bigger than your submersible pump. Make sure you have enough space in your pond or basin to fit the pump and hide it with rocks. If you’re building an above-ground waterfall, skip this part. You won’t be able to dig out the basin, so compensate for it by building an above-ground basin out of rocks or cinder blocks. Call the local utility companies to come out and mark the utility lines before you begin digging. Striking a line by accident is a sure way to spoil your project. Create a second hole for the pump if you’re making a pondless basin. For pondless basins, usually with stream waterfalls, you make a deeper hole to plant the pump in. Measure the pump enclosure first to figure out how big the hole needs to be. Then, dig a square hole at least 2 ft (0.61 m) wider and 6 in (15 cm) deeper than the pump. Keep the hole near the far end of the basin, opposite of the waterfall. Doing this makes it much easier to hide underneath dirt and rocks. Create the upper waterfall pool and stream by digging and smoothing out the soil. Excavating is the most intensive part of building a waterfall, but you’re almost done. To create the upper part of your waterfall, dig out the upper basin if your design has one. Then, connect the upper basin and lower basin with a series of dirt “steps.” The water falls from step to step as it heads toward the lower basin. On average, make the stream bed roughly 3 ft (0.91 m) and at least 6 in (15 cm) inches deep. Pile the soil into ridges to create a staircase effect that makes the water travel downstream more efficiently. The first “step” in the stream needs to be the steepest. After that, add as many steps as you want or have room for. Try to leave some space between each step so you get the full effect of each mini waterfall. Spread an EPDM pond liner and underlayment over each part of your waterfall. If your pond is small enough, get a single liner that stretches from the bottom basin to the top of the waterfall. Otherwise, use a separate liner for the lower basin or pond, stream, and upper basin or pond. After spreading the pond liner flat, lay a propylene underlayment on top of it to protect it from damage. Use 45 mil liners, which are ⁄1000 in (0.11 cm)-thick. To estimate the liner size you need, first calculate the pond or waterfall’s depth from top to bottom , double it, and add 1. Then, add that number to both the length and width to get the approximate liner size. For example, if you have a 10 ft x 5 ft x 3 ft basin, first calculate the depth as 6 x 2 + 1. Then, add the depth of 7 to the length and width. You need a liner at least 17 ft × 12 ft (5.2 m × 3.7 m) in size. Equipping and Filling the Waterfall Calculate the pump strength you need to circulate water. To determine what kind of pump you need, first measure across the width of the head of your waterfall. Then, measure vertically from the top of the waterfall to the water’s surface. Finish by deciding how quickly you want water to flow through the system. Use these numbers to calculate the correct pump rating you need for your waterfall. Search for a waterfall pump calculator online, then plug in your estimates to figure out the minimum pump rating you need for your waterfall to function. A medium flow requires a pump discharge rate of 1,500 US gal (5,700 L) per hour, or gph. Use a 1,000 US gal (3,800 L) estimate for a slower flow and a 2,000 US gal (7,600 L) estimate for a heavier flow. On average, the pump needs to handle 1,500 US gal (5,700 L) per 1 ft (0.30 m) of width at your waterfall’s head. Install and connect the pump before placing it in the basin. Check the owner’s manual with your pump for specific setup instructions. You usually need a rubber hose that is long enough to run from the pump to the top of your waterfall. Measure this distance as well as the opening on the pump. After getting a hose with the same size opening, fit it directly over the pump’s opening. If your pump is inside an enclosure, use a 2 in (5.1 cm) hole saw to cut a few holes in the enclosure. Keep the holes about 4 in (10 cm) apart to let water into the pump. Plant the pump deeply inside the lower pond or basin and make sure the hose is long enough to reach the top of your waterfall. Connect the upper chamber flow valve if you plan on using one. An easy way to build one is by using a heavy-duty, 3-sided plastic storage bin. Face the open end of the bin toward the waterfall and lower basin. Then, drill a hole the same size as the adapter on your hose. Finish the valve by connecting the hose using a rubber washer and a bead of silicone adhesive. To secure the hose further, add a steel lock-nut and a hose clamp. Valves are a great way to get the water flowing down the waterfall, especially in a long stream. In most cases, valves are more for aesthetic purposes rather than a necessity for controlling the water flow. Line the outer edges of any basins with large boulders. Rest the rocks on the edges of the ponds or basins, using them to pin the liner in place. Push them as close together as possible to hide the liner while preventing the water from splashing out. Also, arrange the rocks to cover the pump, hose, and other components you wish to hide. Place the rocks carefully to avoid blocking or crushing the hose and other components. They are heavy and have to be placed with care. Hide the components between the rocks instead of piling rocks on top of them. Build the waterfalls by forming shelves out of rocks. Place some medium-sized rocks at the top of the waterfall or over the steps in a stream. Arrange them in a semicircular pattern, if possible, along the edge of each drop. Flat rocks are a great choice in most waterfalls since they look good and are easy to fit together. Pile all of the rocks as closely together as possible so the water flows around them on its way down to the lower basin. Spread some expanding foam underneath the rocks as needed to hold them in place over the liner. Also, use the foam to fill in any gaps, forcing the water to move over the rocks instead of through them. Spread gravel and tamp it down to cover the rest of the liner. Open up your bags of gravel and begin pouring them directly onto the underlayment. You need plenty of bags to cover over both basins and the waterfall, so don’t hold back. Make the gravel layer at least 3 in (7.6 cm) deep to hide the liner. When you’re done, smooth the gravel layer out as much as possible with your hands so it looks even. Pack plenty of gravel and dirt around larger stones to help hold them in place. Remember that the gravel is much lighter than the larger stones, so it’s better for holding down and hiding hoses and other components. Wash the rocks with a gentle spray to fill the waterfall. Spray down your entire waterfall until the water rises above the gravel and the pump underneath it. With water in the basin, you can safely activate the pump. Run the pump while continuing to spray the stones until the water looks clean. Tidy up your waterfall as needed before sitting down to enjoy its soothing sounds. Spraying the stones dislodges dirt and other debris in the waterfall. The rocks and pebbles help aerate and purify the water while it moves through the system.",
  "sentences":[
    " Designing Your Waterfall Create a waterfall with a pond if you plan on keeping plants or fish.",
    "There are many different ways to set up a pond with a waterfall system.",
    "The easiest way to do it is to stack rocks to create a spillway on the edge of your pond.",
    "You could also dig out the soil to create a lower pond and an upper pond.",
    "Connect them by having the water spill from the upper pond to the lower one or by building a sloping stream between them.",
    "If you already have a pond in your yard, pile up soil and rocks to create a shelf for water to spill from.",
    "This is the easiest way to get a waterfall since you get to avoid a lot of extra digging.",
    "The water falls from the spillway to the pond, then enters a pump system you install to bring it back to the top.",
    "Build a stream if you prefer a long, gentle waterfall.",
    "To create a stream, you need to first dig out a pair of ponds or basins.",
    "Then, dig out the stream to go from the higher basin to the lower one.",
    "The stream has to be sloped to move water downhill, so working on a natural incline in your yard reduces the amount of digging you have to do.",
    "With a stream, you have the option to build many small waterfalls.",
    "Arrange the rocks in the stream to create shelves for the water to spill from.",
    "Stream waterfalls are long compared to pond waterfalls and require a stronger pump and a longer hose.",
    "For example, streams are generally at least 3 ft (0.91 m) long, so you need to commit more space in your yard to set it up.",
    "Make an above-ground waterfall if you can’t dig out your yard.",
    "If you have limited space or a yard that isn’t easy to build on, you still have a way to get a good pond.",
    "Stack strong building material like limestone boulders to build a basin that catches the water.",
    "Then, stack more of the material on one end of the basin to create an area for the water to fall from.",
    "You could build a basin out of resistant materials like cinder blocks or bricks.",
    "Above-ground waterfalls come in many styles, so let your creativity loose when designing yours.",
    "To hold the pond together, spread a waterproof expanding foam around every rock.",
    "The building material has to be strong and well-sealed to hold the water in place.",
    "Design a below-ground waterfall if you are able to dig out your yard.",
    "Most pond and stream waterfalls involve a little bit of digging.",
    "For this type of waterfall, you basically dig a hole in the ground, then make a vertical stack of rocks on one end.",
    "Place a water hose in the rocks to spill water down and into the basin.",
    "This is called a pondless basin, and the water gets circulated continuously through a strong pump.",
    "This type of waterfall is similar to any basic pond waterfall.",
    "If you don’t already have a pond or a water basin, you could dig a new one before building your waterfall.",
    "Choose the size of your waterfall and basin before beginning construction.",
    "The average size of a pond with a built-in waterfall is 10 ft × 15 ft (3.0 m × 4.6 m).",
    "If you’re planning on making a stream or a pondless basin, do some math to estimate the minimum size you need.",
    "Generally, the basin has to hold about 2.5 times the amount of water circulating through the waterfall.",
    "To figure out how much water is in motion through your waterfall, measure the waterfall’s length, width, and depth in feet.",
    "The formula is length x width x (depth x 0.25) x 7.48.",
    "The 0.25 is the thickness of the water and the 7.48 is the number of gallons in a cubic foot.",
    "Then, multiply the amount of water in motion by 2.5 to figure out how many total gallons of water you need.",
    "For example, if your waterfall is 10 x 3 x 0.5 ft in size:  10 ft x 3 ft x (0.25 x 0.5 ft) x 7.48 gal/cubic ft = 28.05 gallons of water in motion.",
    "Then, 28.76 gallons x 2.5 = 70 gallons of water needed in the pond.",
    "Remember to do the same for the upper pond or basin if you plan on building one.",
    "Keep it roughly the same size to ensure water moves through the waterfall at a steady rate.",
    "Select a visible location about 20 ft (6.1 m) from your home.",
    "Put your waterfall in a spot where it can be enjoyed from different angles, both inside and outside your home.",
    "The best spot for a pond is usually near a deck, patio, or window on your home.",
    "These areas also tend to be accessible to water spigots and electrical outlets you may need to power your waterfall.",
    "Also, since waterfalls are all about water falling from a higher area to a lower one, build on a natural incline to reduce the amount of digging you have to do.",
    "Any ponds connected to the waterfall require about 6 hours of direct sunlight if you’re keeping any plants or fish.",
    "For example, place the pond close to a water spigot so you can easily fill it with a hose.",
    "Also, the pond’s lower basin needs to be within range of an electrical outlet to operate the pump.",
    "However, connect the pump with an extension cord to prevent water from splashing onto the outlet.",
    "Order gravel and stones to use to build your stream.",
    "Gravel is very important for covering and pinning down the pond’s liner, so purchase plenty of rounded gravel or river rocks.",
    "You also need plenty of boulders and flat rocks to line the stream.",
    "These larger stones are great for decorating the pond and covering some of its construction components.",
    "Flat limestone rocks are great for creating waterfall spillways, while larger boulders are useful for framing the pond.",
    "Most home and garden centers have limited supplies of pond-building material.",
    "For a bigger selection, search for quarries and stone suppliers in your area.",
    "To figure out how many boulders you need, multiply your waterway’s length and width, then divide it by 65 tons per foot.",
    "This gives you an estimate in tons, but keep in mind that rocks come in different sizes.",
    "For instance, if your waterfall is 10 ft x 3 ft in size, you need about 0.46 tons of rocks for that area.",
    "Estimate the amount of gravel you need by taking the amount of boulders in tons you need, then dividing by 0.45.",
    "The gravel layer generally has to be about 3 in (7.6 cm) deep.",
    "For example, if your waterfall is 10 ft x 3 ft, you need approximately 1 ton of gravel to fill it.",
    "Constructing Basins and Streams Stack rocks and blocks to create a basin for an above-ground waterfall.",
    "After you know where you want to build the basin, begin constructing it with boulders, cinder blocks, or alternative material.",
    "Make the basin tall enough to hold the amount of water circulating through your stream.",
    "Then, spread a waterproof expanding foam around each rock to glue the basin together.",
    "Remember to build one side of the basin higher than the other.",
    "Use some flat rocks or smaller boulders to create a natural-looking waterfall.",
    "Leave space for the hose you need to install to start the waterfall.",
    "Dig out the pond or lower basin for an in-ground pond.",
    "The water needs a place to collect while your submersible pump circulates it back to the top of the waterfall.",
    "The basin has to be at least 1 ft (0.30 m) larger than your stream or waterfall to prevent the water from splashing out of it.",
    "It also needs to be bigger than your submersible pump.",
    "Make sure you have enough space in your pond or basin to fit the pump and hide it with rocks.",
    "If you’re building an above-ground waterfall, skip this part.",
    "You won’t be able to dig out the basin, so compensate for it by building an above-ground basin out of rocks or cinder blocks.",
    "Call the local utility companies to come out and mark the utility lines before you begin digging.",
    "Striking a line by accident is a sure way to spoil your project.",
    "Create a second hole for the pump if you’re making a pondless basin.",
    "For pondless basins, usually with stream waterfalls, you make a deeper hole to plant the pump in.",
    "Measure the pump enclosure first to figure out how big the hole needs to be.",
    "Then, dig a square hole at least 2 ft (0.61 m) wider and 6 in (15 cm) deeper than the pump.",
    "Keep the hole near the far end of the basin, opposite of the waterfall.",
    "Doing this makes it much easier to hide underneath dirt and rocks.",
    "Create the upper waterfall pool and stream by digging and smoothing out the soil.",
    "Excavating is the most intensive part of building a waterfall, but you’re almost done.",
    "To create the upper part of your waterfall, dig out the upper basin if your design has one.",
    "Then, connect the upper basin and lower basin with a series of dirt “steps.” The water falls from step to step as it heads toward the lower basin.",
    "On average, make the stream bed roughly 3 ft (0.91 m) and at least 6 in (15 cm) inches deep.",
    "Pile the soil into ridges to create a staircase effect that makes the water travel downstream more efficiently.",
    "The first “step” in the stream needs to be the steepest.",
    "After that, add as many steps as you want or have room for.",
    "Try to leave some space between each step so you get the full effect of each mini waterfall.",
    "Spread an EPDM pond liner and underlayment over each part of your waterfall.",
    "If your pond is small enough, get a single liner that stretches from the bottom basin to the top of the waterfall.",
    "Otherwise, use a separate liner for the lower basin or pond, stream, and upper basin or pond.",
    "After spreading the pond liner flat, lay a propylene underlayment on top of it to protect it from damage.",
    "Use 45 mil liners, which are ⁄1000 in (0.11 cm)-thick.",
    "To estimate the liner size you need, first calculate the pond or waterfall’s depth from top to bottom , double it, and add 1.",
    "Then, add that number to both the length and width to get the approximate liner size.",
    "For example, if you have a 10 ft x 5 ft x 3 ft basin, first calculate the depth as 6 x 2 + 1.",
    "Then, add the depth of 7 to the length and width.",
    "You need a liner at least 17 ft × 12 ft (5.2 m × 3.7 m) in size.",
    "Equipping and Filling the Waterfall Calculate the pump strength you need to circulate water.",
    "To determine what kind of pump you need, first measure across the width of the head of your waterfall.",
    "Then, measure vertically from the top of the waterfall to the water’s surface.",
    "Finish by deciding how quickly you want water to flow through the system.",
    "Use these numbers to calculate the correct pump rating you need for your waterfall.",
    "Search for a waterfall pump calculator online, then plug in your estimates to figure out the minimum pump rating you need for your waterfall to function.",
    "A medium flow requires a pump discharge rate of 1,500 US gal (5,700 L) per hour, or gph.",
    "Use a 1,000 US gal (3,800 L) estimate for a slower flow and a 2,000 US gal (7,600 L) estimate for a heavier flow.",
    "On average, the pump needs to handle 1,500 US gal (5,700 L) per 1 ft (0.30 m) of width at your waterfall’s head.",
    "Install and connect the pump before placing it in the basin.",
    "Check the owner’s manual with your pump for specific setup instructions.",
    "You usually need a rubber hose that is long enough to run from the pump to the top of your waterfall.",
    "Measure this distance as well as the opening on the pump.",
    "After getting a hose with the same size opening, fit it directly over the pump’s opening.",
    "If your pump is inside an enclosure, use a 2 in (5.1 cm) hole saw to cut a few holes in the enclosure.",
    "Keep the holes about 4 in (10 cm) apart to let water into the pump.",
    "Plant the pump deeply inside the lower pond or basin and make sure the hose is long enough to reach the top of your waterfall.",
    "Connect the upper chamber flow valve if you plan on using one.",
    "An easy way to build one is by using a heavy-duty, 3-sided plastic storage bin.",
    "Face the open end of the bin toward the waterfall and lower basin.",
    "Then, drill a hole the same size as the adapter on your hose.",
    "Finish the valve by connecting the hose using a rubber washer and a bead of silicone adhesive.",
    "To secure the hose further, add a steel lock-nut and a hose clamp.",
    "Valves are a great way to get the water flowing down the waterfall, especially in a long stream.",
    "In most cases, valves are more for aesthetic purposes rather than a necessity for controlling the water flow.",
    "Line the outer edges of any basins with large boulders.",
    "Rest the rocks on the edges of the ponds or basins, using them to pin the liner in place.",
    "Push them as close together as possible to hide the liner while preventing the water from splashing out.",
    "Also, arrange the rocks to cover the pump, hose, and other components you wish to hide.",
    "Place the rocks carefully to avoid blocking or crushing the hose and other components.",
    "They are heavy and have to be placed with care.",
    "Hide the components between the rocks instead of piling rocks on top of them.",
    "Build the waterfalls by forming shelves out of rocks.",
    "Place some medium-sized rocks at the top of the waterfall or over the steps in a stream.",
    "Arrange them in a semicircular pattern, if possible, along the edge of each drop.",
    "Flat rocks are a great choice in most waterfalls since they look good and are easy to fit together.",
    "Pile all of the rocks as closely together as possible so the water flows around them on its way down to the lower basin.",
    "Spread some expanding foam underneath the rocks as needed to hold them in place over the liner.",
    "Also, use the foam to fill in any gaps, forcing the water to move over the rocks instead of through them.",
    "Spread gravel and tamp it down to cover the rest of the liner.",
    "Open up your bags of gravel and begin pouring them directly onto the underlayment.",
    "You need plenty of bags to cover over both basins and the waterfall, so don’t hold back.",
    "Make the gravel layer at least 3 in (7.6 cm) deep to hide the liner.",
    "When you’re done, smooth the gravel layer out as much as possible with your hands so it looks even.",
    "Pack plenty of gravel and dirt around larger stones to help hold them in place.",
    "Remember that the gravel is much lighter than the larger stones, so it’s better for holding down and hiding hoses and other components.",
    "Wash the rocks with a gentle spray to fill the waterfall.",
    "Spray down your entire waterfall until the water rises above the gravel and the pump underneath it.",
    "With water in the basin, you can safely activate the pump.",
    "Run the pump while continuing to spray the stones until the water looks clean.",
    "Tidy up your waterfall as needed before sitting down to enjoy its soothing sounds.",
    "Spraying the stones dislodges dirt and other debris in the waterfall.",
    "The rocks and pebbles help aerate and purify the water while it moves through the system."
  ],
  "tyn_section":[
    "Submersible pump",
    "Pump basin",
    "Drill or hole saw",
    "3 rubber washers",
    "2 hose clamps",
    "Pump adapter",
    "Hose adapter",
    "Foam sealant",
    "Waterproof silicone adhesive",
    "Boulders",
    "Rocks and flat stones",
    "Gravel",
    "3 fabric underlayments",
    "3 rubber liners",
    "Wheelbarrow",
    "Shovel",
    "Steel lock-nut",
    "Chalk spray paint",
    "Tamper tool"
  ],
  "tyn_model":[
    "water",
    "rocks",
    "gravel",
    "waterfall",
    "hose",
    "pump",
    "pond",
    "basin",
    "liner",
    "soil",
    "stones",
    "stream",
    "boulders",
    "submersible pump",
    "dirt",
    "valves",
    "water hose",
    "water basin",
    "× 15",
    "× 4.6",
    "river rocks",
    "stone",
    "blocks",
    "cinder blocks",
    "“steps",
    "” the",
    "“step",
    "” in",
    "epdm pond liner",
    "pond liner",
    "propylene underlayment",
    "45 mil liners",
    "× 12",
    "× 3.7",
    "waterfall pump calculator",
    "rubber hose",
    "hole saw",
    "rubber washer",
    "silicone adhesive",
    "hose clamp",
    "expanding foam",
    "pebbles"
  ],
  "simple_metrics":{
    "r":0.1578947368,
    "p":0.0714285714,
    "f1":0.0983606557,
    "avg_pos":0.3095238095
  },
  "jacc_metrics_0.5":{
    "r":0.4210526316,
    "p":0.1904761905,
    "f1":0.262295082
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5263157895,
    "p":0.3095238095,
    "f1":0.3898050975
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2105263158,
    "p":0.0952380952,
    "f1":0.131147541
  }
}