{
  "title":"How to Make a String Pendant Lamp",
  "url":"https://www.wikihow.com/Make-a-String-Pendant-Lamp",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "methods":[
    {
      "name":"Making Your Lamp",
      "steps":[
        {
          "headline":"Prep the area and gather your materials.",
          "description":"This DIY project is rewarding, but it is time consuming and messy. Clear a big, wide space and line your surfaces with a tarp or newspaper. Grab all your materials now and let's get started. You'll need:\nAn inflatable ball (beach, exercise, or balloon)\nString (twine, hemp, yarn, etc.) White glue\nCorn starch\nWarm water\nCooking spray\nDisposable gloves (if you don't want to get in on the action yourself)"
        },
        {
          "headline":"Draw a circle on your ball (or balloon).",
          "description":"Use something round (like a Tupperware lid) to guide your tracing. This will end up being the hole that you install the light bulb through (or change), so make sure it's big enough for your hand to easily fit through while holding the bulb. You'll also be using this hole to take out the ball upon completion. About 6-7\" (15-17.5 cm) should be adequate."
        },
        {
          "headline":"Make your gluey mixture.",
          "description":"This should be a bunch of white glue, a handful or two of cornstarch, and some warm water; you nailed it when it has the consistency of thick cream. Use a wide-brimmed bowl or tray. As an alternative, you can use wallpaper paste. It works just as well."
        },
        {
          "headline":"Coat the ball in cooking spray.",
          "description":"If you can hang the ball at this juncture, great. If you can't, you have to make do. Be generous with the spray -- the ball should end up being so covered you would prefer not to touch it. Petroleum jelly works here, too. That's just a bit more handsy. The same principles apply."
        },
        {
          "headline":"Feed the string into the glue mixture.",
          "description":"Go about a yard or two at a time, squeezing off the excess with your thumb and forefinger. Wrap your string around the ball haphazardly, criss-crossing in whatever pattern (or non-pattern, really) you think looks good. One 220 foot (67.1 m) spool should suffice for an average-sized beach ball. Don't cover the circle you made! That is a no-go zone. You need that open and string-free for attaching later. If you are using a light-colored string, use as much string as you want. But know that if you are using a dark-colored string, you may want to use less so the light can shine through once in use. Let it dry overnight. When you find it in the morning, it'll be rock-hard and nothing like you left it."
        },
        {
          "headline":"Pull out the ball.",
          "description":"Deflate it and take it out -- now you know why you bothered to lube it up in cooking spray or petroleum jelly. It's all worth it now. If it's too big, stick your hand through the circular space with some scissors and cut it up into manageable pieces (if it is an exercise ball it will have sand in it, so be careful where you do it). Pull it through the circle opening (the same opening used to change the bulb) very carefully."
        }
      ]
    },
    {
      "name":"Installation: With Wire",
      "steps":[
        {
          "headline":"Cut a piece of wire.",
          "description":"If you have an old lampshade lying around, see what makes up the skeleton of it -- a wire can easily be had from there. If not, got to your local hardware store. You'll need a piece of wire much longer than the width of your opening. It must attach at both sides and the ends must wrap together."
        },
        {
          "headline":"Attach the wire and assemble your lamp.",
          "description":"Take one end of the wire and twist it around the edge of the opening on your new lampshade. Then, take the middle, wrap it around the base of the lamp, and twist the other end back onto the ball. Tada! If the hole you made in your ball is just too big, flip 'er over. Cut a small base into what used to be the top but is now the bottom, and repeat. Problem solved."
        }
      ]
    },
    {
      "name":"Installation: With Hanging Bulb",
      "steps":[
        {
          "headline":"Have your hanging socket ready.",
          "description":"Here's where all your options come in and it gets a bit confusing. If you're not keen on tackling this part, you can always hire an electrician. Also: make sure the fixture is turned off! If you don't have a hanging socket already, you can make one. Or just buy one from IKEA -- they're pretty cheap. Making one is only advised if you have a handle on what you'll be doing. If you think you have it, you'll need:\n3 plain canopy kits. That will serve to hold the cable in place and to mount it to the ceiling\n1 outdoor-grade extension cord at least 1' longer than you will need\n1 porcelain socket with metal cap\n2+ twist on wire connectors\nWire stripper/snips"
        },
        {
          "headline":"Start making cuts.",
          "description":"You'll need a hole at the other end of your globe to initially place it onto the fixture. Make a few snips directly opposite the original hole, but nothing too big. If it's too large, the ball will fall right off! To support the new hole you just made in your globe and to keep it from breaking under its weight, cut out a plastic ring to go around your bulb, at the top of the fixture. This can be from an old, cheap lampshade or a Tupperware container lid -- anything that can be cut into a ring and has a bit of strength to it, really."
        },
        {
          "headline":"Attach your creation.",
          "description":"Place your dome around your bulb and slide in your plastic ring between the globe and bulb. If you don't like the look of the hanging wire, place a shower rod around it before installing your lampshade. If one side of the ball is more aesthetically pleasing than the other, just rotate it! That's the beauty of the pendant lamp."
        },
        {
          "headline":"Color it if you prefer.",
          "description":"Simply remove the wire and bulb set. Grab a can of spray paint and add color."
        }
      ]
    }
  ],
  "text":" Making Your Lamp Prep the area and gather your materials. This DIY project is rewarding, but it is time consuming and messy. Clear a big, wide space and line your surfaces with a tarp or newspaper. Grab all your materials now and let's get started. You'll need:\nAn inflatable ball (beach, exercise, or balloon)\nString (twine, hemp, yarn, etc.) White glue\nCorn starch\nWarm water\nCooking spray\nDisposable gloves (if you don't want to get in on the action yourself) Draw a circle on your ball (or balloon). Use something round (like a Tupperware lid) to guide your tracing. This will end up being the hole that you install the light bulb through (or change), so make sure it's big enough for your hand to easily fit through while holding the bulb. You'll also be using this hole to take out the ball upon completion. About 6-7\" (15-17.5 cm) should be adequate. Make your gluey mixture. This should be a bunch of white glue, a handful or two of cornstarch, and some warm water; you nailed it when it has the consistency of thick cream. Use a wide-brimmed bowl or tray. As an alternative, you can use wallpaper paste. It works just as well. Coat the ball in cooking spray. If you can hang the ball at this juncture, great. If you can't, you have to make do. Be generous with the spray -- the ball should end up being so covered you would prefer not to touch it. Petroleum jelly works here, too. That's just a bit more handsy. The same principles apply. Feed the string into the glue mixture. Go about a yard or two at a time, squeezing off the excess with your thumb and forefinger. Wrap your string around the ball haphazardly, criss-crossing in whatever pattern (or non-pattern, really) you think looks good. One 220 foot (67.1 m) spool should suffice for an average-sized beach ball. Don't cover the circle you made! That is a no-go zone. You need that open and string-free for attaching later. If you are using a light-colored string, use as much string as you want. But know that if you are using a dark-colored string, you may want to use less so the light can shine through once in use. Let it dry overnight. When you find it in the morning, it'll be rock-hard and nothing like you left it. Pull out the ball. Deflate it and take it out -- now you know why you bothered to lube it up in cooking spray or petroleum jelly. It's all worth it now. If it's too big, stick your hand through the circular space with some scissors and cut it up into manageable pieces (if it is an exercise ball it will have sand in it, so be careful where you do it). Pull it through the circle opening (the same opening used to change the bulb) very carefully. Installation: With Wire Cut a piece of wire. If you have an old lampshade lying around, see what makes up the skeleton of it -- a wire can easily be had from there. If not, got to your local hardware store. You'll need a piece of wire much longer than the width of your opening. It must attach at both sides and the ends must wrap together. Attach the wire and assemble your lamp. Take one end of the wire and twist it around the edge of the opening on your new lampshade. Then, take the middle, wrap it around the base of the lamp, and twist the other end back onto the ball. Tada! If the hole you made in your ball is just too big, flip 'er over. Cut a small base into what used to be the top but is now the bottom, and repeat. Problem solved. Installation: With Hanging Bulb Have your hanging socket ready. Here's where all your options come in and it gets a bit confusing. If you're not keen on tackling this part, you can always hire an electrician. Also: make sure the fixture is turned off! If you don't have a hanging socket already, you can make one. Or just buy one from IKEA -- they're pretty cheap. Making one is only advised if you have a handle on what you'll be doing. If you think you have it, you'll need:\n3 plain canopy kits. That will serve to hold the cable in place and to mount it to the ceiling\n1 outdoor-grade extension cord at least 1' longer than you will need\n1 porcelain socket with metal cap\n2+ twist on wire connectors\nWire stripper/snips Start making cuts. You'll need a hole at the other end of your globe to initially place it onto the fixture. Make a few snips directly opposite the original hole, but nothing too big. If it's too large, the ball will fall right off! To support the new hole you just made in your globe and to keep it from breaking under its weight, cut out a plastic ring to go around your bulb, at the top of the fixture. This can be from an old, cheap lampshade or a Tupperware container lid -- anything that can be cut into a ring and has a bit of strength to it, really. Attach your creation. Place your dome around your bulb and slide in your plastic ring between the globe and bulb. If you don't like the look of the hanging wire, place a shower rod around it before installing your lampshade. If one side of the ball is more aesthetically pleasing than the other, just rotate it! That's the beauty of the pendant lamp. Color it if you prefer. Simply remove the wire and bulb set. Grab a can of spray paint and add color.",
  "sentences":[
    " Making Your Lamp Prep the area and gather your materials.",
    "This DIY project is rewarding, but it is time consuming and messy.",
    "Clear a big, wide space and line your surfaces with a tarp or newspaper.",
    "Grab all your materials now and let's get started.",
    "You'll need:\nAn inflatable ball (beach, exercise, or balloon)\nString (twine, hemp, yarn, etc.)",
    "White glue\nCorn starch\nWarm water\nCooking spray\nDisposable gloves (if you don't want to get in on the action yourself) Draw a circle on your ball (or balloon).",
    "Use something round (like a Tupperware lid) to guide your tracing.",
    "This will end up being the hole that you install the light bulb through (or change), so make sure it's big enough for your hand to easily fit through while holding the bulb.",
    "You'll also be using this hole to take out the ball upon completion.",
    "About 6-7\" (15-17.5 cm) should be adequate.",
    "Make your gluey mixture.",
    "This should be a bunch of white glue, a handful or two of cornstarch, and some warm water; you nailed it when it has the consistency of thick cream.",
    "Use a wide-brimmed bowl or tray.",
    "As an alternative, you can use wallpaper paste.",
    "It works just as well.",
    "Coat the ball in cooking spray.",
    "If you can hang the ball at this juncture, great.",
    "If you can't, you have to make do.",
    "Be generous with the spray -- the ball should end up being so covered you would prefer not to touch it.",
    "Petroleum jelly works here, too.",
    "That's just a bit more handsy.",
    "The same principles apply.",
    "Feed the string into the glue mixture.",
    "Go about a yard or two at a time, squeezing off the excess with your thumb and forefinger.",
    "Wrap your string around the ball haphazardly, criss-crossing in whatever pattern (or non-pattern, really) you think looks good.",
    "One 220 foot (67.1 m) spool should suffice for an average-sized beach ball.",
    "Don't cover the circle you made!",
    "That is a no-go zone.",
    "You need that open and string-free for attaching later.",
    "If you are using a light-colored string, use as much string as you want.",
    "But know that if you are using a dark-colored string, you may want to use less so the light can shine through once in use.",
    "Let it dry overnight.",
    "When you find it in the morning, it'll be rock-hard and nothing like you left it.",
    "Pull out the ball.",
    "Deflate it and take it out -- now you know why you bothered to lube it up in cooking spray or petroleum jelly.",
    "It's all worth it now.",
    "If it's too big, stick your hand through the circular space with some scissors and cut it up into manageable pieces (if it is an exercise ball it will have sand in it, so be careful where you do it).",
    "Pull it through the circle opening (the same opening used to change the bulb) very carefully.",
    "Installation: With Wire Cut a piece of wire.",
    "If you have an old lampshade lying around, see what makes up the skeleton of it -- a wire can easily be had from there.",
    "If not, got to your local hardware store.",
    "You'll need a piece of wire much longer than the width of your opening.",
    "It must attach at both sides and the ends must wrap together.",
    "Attach the wire and assemble your lamp.",
    "Take one end of the wire and twist it around the edge of the opening on your new lampshade.",
    "Then, take the middle, wrap it around the base of the lamp, and twist the other end back onto the ball.",
    "Tada!",
    "If the hole you made in your ball is just too big, flip 'er over.",
    "Cut a small base into what used to be the top but is now the bottom, and repeat.",
    "Problem solved.",
    "Installation: With Hanging Bulb Have your hanging socket ready.",
    "Here's where all your options come in and it gets a bit confusing.",
    "If you're not keen on tackling this part, you can always hire an electrician.",
    "Also: make sure the fixture is turned off!",
    "If you don't have a hanging socket already, you can make one.",
    "Or just buy one from IKEA -- they're pretty cheap.",
    "Making one is only advised if you have a handle on what you'll be doing.",
    "If you think you have it, you'll need:\n3 plain canopy kits.",
    "That will serve to hold the cable in place and to mount it to the ceiling\n1 outdoor-grade extension cord at least 1' longer than you will need\n1 porcelain socket with metal cap\n2+ twist on wire connectors\nWire stripper/snips Start making cuts.",
    "You'll need a hole at the other end of your globe to initially place it onto the fixture.",
    "Make a few snips directly opposite the original hole, but nothing too big.",
    "If it's too large, the ball will fall right off!",
    "To support the new hole you just made in your globe and to keep it from breaking under its weight, cut out a plastic ring to go around your bulb, at the top of the fixture.",
    "This can be from an old, cheap lampshade or a Tupperware container lid -- anything that can be cut into a ring and has a bit of strength to it, really.",
    "Attach your creation.",
    "Place your dome around your bulb and slide in your plastic ring between the globe and bulb.",
    "If you don't like the look of the hanging wire, place a shower rod around it before installing your lampshade.",
    "If one side of the ball is more aesthetically pleasing than the other, just rotate it!",
    "That's the beauty of the pendant lamp.",
    "Color it if you prefer.",
    "Simply remove the wire and bulb set.",
    "Grab a can of spray paint and add color."
  ],
  "tyn_section":[
    "Inflatable ball (any size)",
    "Glue, cornstarch and water ",
    "or",
    " wallpaper glue",
    "Cooking spray or petroleum jelly",
    "Thread",
    "Lamp or socket",
    "Scissors",
    "Plastic ring",
    "Gloves",
    "Old newspaper or tarp"
  ],
  "tyn_model":[
    "wire",
    "string",
    "white glue",
    "cooking spray",
    "petroleum jelly",
    "lamp",
    "globe",
    "tarp",
    "newspaper",
    "inflatable ball",
    "twine",
    "yarn",
    "corn starch",
    "water",
    "cornstarch",
    "warm water",
    "wallpaper paste",
    "glue",
    "scissors",
    "electrician",
    "outdoor-grade extension cord",
    "porcelain socket",
    "twist on wire connectors",
    "wire stripper",
    "shower rod",
    "pendant lamp",
    "spray paint"
  ],
  "simple_metrics":{
    "r":0.0909090909,
    "p":0.037037037,
    "f1":0.0526315789,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2727272727,
    "p":0.1111111111,
    "f1":0.1578947368
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4545454545,
    "p":0.2962962963,
    "f1":0.3587443946
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0909090909,
    "p":0.037037037,
    "f1":0.0526315789
  }
}