{
  "title":"How to Cook Barley",
  "url":"https://www.wikihow.com/Cook-Barley",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Cereal Grains"
  ],
  "methods":[
    {
      "name":"Making Basic Barley",
      "steps":[
        {
          "headline":"Place the water and barley in a large pot.",
          "description":"Combine both ingredients in a large saucepan, making sure the water covers the barley completely. You can also substitute broth for water and add salt (to taste) for enhanced flavor, but neither option is necessary."
        },
        {
          "headline":"Bring the water to a boil.",
          "description":"Place the saucepan on the stove and bring the water to a boil over high heat. Once boiling, cover the saucepan with a lid. Note that the barley may produce a lot of foam and threaten to boil over the saucepan. Stirring the barley and watching it closely should help minimize the risk of accidental spills."
        },
        {
          "headline":"Reduce the heat and simmer for 30 minutes.",
          "description":"Pearl barley may finish within 25 minutes, while hulled barley will usually require up to 45 minutes. If the water boils away prematurely, add more about 1/2 cup (125 ml) at a time."
        },
        {
          "headline":"Cook until all of the water has been absorbed.",
          "description":"The barley should triple in volume and be soft, yet chewy. You may need to test the barley every 5 minutes or so near the end of the cooking process until it reaches your desired consistency."
        },
        {
          "headline":"Turn off the heat.",
          "description":"Allow the barley to sit for 15 minutes without stirring, so that it can continue absorbing any excess water. If there's still excess after letting the barley sit, you may need to drain the water away."
        },
        {
          "headline":"Enjoy.",
          "description":"Add the cooked barley to salad or soup, or toss with spices and oil for a delicious side dish."
        }
      ]
    },
    {
      "name":"Preparing Baked Barley",
      "steps":[
        {
          "headline":"Preheat the oven to 375 degrees.",
          "description":"Grab a 1-1/2 to 2 quart (1-1/2 to 2 L) oven-safe baking dish. A glass or ceramic one with a lid is ideal."
        },
        {
          "headline":"Pour two cups of water into a saucepan.",
          "description":"Bring the water to a boil on the stove over high heat. Note that you may also boil the water in a tea kettle."
        },
        {
          "headline":"Place the barley in the baking dish.",
          "description":"Pour the boiling water over the barley. Stir to combine."
        },
        {
          "headline":"Stir in the butter and salt.",
          "description":"Make sure that it is well-combined, then cover the dish with its lid. If you do not have a lid for your baking dish, cover it tightly with aluminum foil."
        },
        {
          "headline":"Bake for 60 minutes.",
          "description":"Place the dish in the preheated oven and bake for one hour. Place it on the center rack for best results."
        },
        {
          "headline":"Remove the dish from the oven.",
          "description":"Lightly fluff the finished barley with a spoon or fork. Spoon it into a serving dish and serve alongside a main course."
        }
      ]
    },
    {
      "name":"Cooking Barley Soup",
      "steps":[
        {
          "headline":"Melt the butter in a large stockpot over medium heat.",
          "description":"Meanwhile, prepare your vegetables. Prepare the onions, carrots, and celery by chopping them into bite-sized pieces. Prepare the mushrooms by soaking them in hot water. Note that this should be done about 30 minutes in advance. Strain the water, the chop the mushrooms."
        },
        {
          "headline":"Add the onions, carrots and celery.",
          "description":"Cook, stirring occasionally, until the onions are translucent, about five minutes."
        },
        {
          "headline":"Stir in the minced garlic.",
          "description":"Cook the mixture for two minutes more, stirring frequently to prevent the garlic from burning."
        },
        {
          "headline":"Add the mushrooms.",
          "description":"Continue cooking, stirring frequently, until the mushrooms are soft. This should take another five minutes or so."
        },
        {
          "headline":"Sprinkle the flour over the vegetables.",
          "description":"Lower the heat to medium-low, and sprinkle the flour evenly over the vegetables. Stir the mixture every 30 second for roughly five minutes or until everything seems sticky, thick, and well-coated."
        },
        {
          "headline":"Gradually pour the broth into the pot.",
          "description":"Turn the heat to medium high and add the broth about 1 cup (250 ml) at a time, stirring to combine well. Bring the soup to a slow boil once all of the broth is added. Adding the broth gradually should make it easier for the flour to incorporate itself into the liquid, thereby thickening it. Adding the broth all at once may result in clumps or an unevenly thin consistency."
        },
        {
          "headline":"Stir in the barley and the salt.",
          "description":"Allow the liquid to reach a boil again, then cover the stockpot."
        },
        {
          "headline":"Reduce the soup to a simmer.",
          "description":"Allow it to cook for one hour, stirring occasionally. The soup is ready to serve when the barley is tender and the soup has thickened. If desired, you can adjust the seasonings near the end of the cooking time. Consider adding more salt or sprinkling in some chopped parsley as desired."
        },
        {
          "headline":"Enjoy.",
          "description":"Serve the finished soup while it is still fresh and hot."
        }
      ]
    },
    {
      "name":"Tossing Barley Salad",
      "steps":[
        {
          "headline":"Cook one cup of barley.",
          "description":"Follow the instructions for \"Basic Barley.\" Combine 1 cup (250 ml) uncooked barley with 3 cups (750 ml) water over medium-high heat. Once boiling, reduce the heat to medium-low and simmer the barley for 30 minutes, or until soft. Drain, then let the barley cool to room temperature before continuing."
        },
        {
          "headline":"Place the cooked barley in a bowl.",
          "description":"Add the chopped tomatoes, chopped onion, and feta cheese. Toss well to combine."
        },
        {
          "headline":"Combine the red wine vinegar, oil, and a pinch of salt and pepper.",
          "description":"Place these ingredients in a separate mixing bowl. Use a whisk to mix the ingredients for one minute, or until the dressing appears evenly combined."
        },
        {
          "headline":"Pour the vinegar dressing over the barley.",
          "description":"Mix well with a spoon, making sure to coat the salad evenly with the dressing."
        },
        {
          "headline":"Serve.",
          "description":"For the best taste and texture, enjoy the barley salad immediately after preparing it. You can also wait for up to two hours before serving the barley salad. Leave it out at room temperature, and serve it at room temperature."
        }
      ]
    }
  ],
  "text":" Making Basic Barley Place the water and barley in a large pot. Combine both ingredients in a large saucepan, making sure the water covers the barley completely. You can also substitute broth for water and add salt (to taste) for enhanced flavor, but neither option is necessary. Bring the water to a boil. Place the saucepan on the stove and bring the water to a boil over high heat. Once boiling, cover the saucepan with a lid. Note that the barley may produce a lot of foam and threaten to boil over the saucepan. Stirring the barley and watching it closely should help minimize the risk of accidental spills. Reduce the heat and simmer for 30 minutes. Pearl barley may finish within 25 minutes, while hulled barley will usually require up to 45 minutes. If the water boils away prematurely, add more about 1/2 cup (125 ml) at a time. Cook until all of the water has been absorbed. The barley should triple in volume and be soft, yet chewy. You may need to test the barley every 5 minutes or so near the end of the cooking process until it reaches your desired consistency. Turn off the heat. Allow the barley to sit for 15 minutes without stirring, so that it can continue absorbing any excess water. If there's still excess after letting the barley sit, you may need to drain the water away. Enjoy. Add the cooked barley to salad or soup, or toss with spices and oil for a delicious side dish. Preparing Baked Barley Preheat the oven to 375 degrees. Grab a 1-1/2 to 2 quart (1-1/2 to 2 L) oven-safe baking dish. A glass or ceramic one with a lid is ideal. Pour two cups of water into a saucepan. Bring the water to a boil on the stove over high heat. Note that you may also boil the water in a tea kettle. Place the barley in the baking dish. Pour the boiling water over the barley. Stir to combine. Stir in the butter and salt. Make sure that it is well-combined, then cover the dish with its lid. If you do not have a lid for your baking dish, cover it tightly with aluminum foil. Bake for 60 minutes. Place the dish in the preheated oven and bake for one hour. Place it on the center rack for best results. Remove the dish from the oven. Lightly fluff the finished barley with a spoon or fork. Spoon it into a serving dish and serve alongside a main course. Cooking Barley Soup Melt the butter in a large stockpot over medium heat. Meanwhile, prepare your vegetables. Prepare the onions, carrots, and celery by chopping them into bite-sized pieces. Prepare the mushrooms by soaking them in hot water. Note that this should be done about 30 minutes in advance. Strain the water, the chop the mushrooms. Add the onions, carrots and celery. Cook, stirring occasionally, until the onions are translucent, about five minutes. Stir in the minced garlic. Cook the mixture for two minutes more, stirring frequently to prevent the garlic from burning. Add the mushrooms. Continue cooking, stirring frequently, until the mushrooms are soft. This should take another five minutes or so. Sprinkle the flour over the vegetables. Lower the heat to medium-low, and sprinkle the flour evenly over the vegetables. Stir the mixture every 30 second for roughly five minutes or until everything seems sticky, thick, and well-coated. Gradually pour the broth into the pot. Turn the heat to medium high and add the broth about 1 cup (250 ml) at a time, stirring to combine well. Bring the soup to a slow boil once all of the broth is added. Adding the broth gradually should make it easier for the flour to incorporate itself into the liquid, thereby thickening it. Adding the broth all at once may result in clumps or an unevenly thin consistency. Stir in the barley and the salt. Allow the liquid to reach a boil again, then cover the stockpot. Reduce the soup to a simmer. Allow it to cook for one hour, stirring occasionally. The soup is ready to serve when the barley is tender and the soup has thickened. If desired, you can adjust the seasonings near the end of the cooking time. Consider adding more salt or sprinkling in some chopped parsley as desired. Enjoy. Serve the finished soup while it is still fresh and hot. Tossing Barley Salad Cook one cup of barley. Follow the instructions for \"Basic Barley.\" Combine 1 cup (250 ml) uncooked barley with 3 cups (750 ml) water over medium-high heat. Once boiling, reduce the heat to medium-low and simmer the barley for 30 minutes, or until soft. Drain, then let the barley cool to room temperature before continuing. Place the cooked barley in a bowl. Add the chopped tomatoes, chopped onion, and feta cheese. Toss well to combine. Combine the red wine vinegar, oil, and a pinch of salt and pepper. Place these ingredients in a separate mixing bowl. Use a whisk to mix the ingredients for one minute, or until the dressing appears evenly combined. Pour the vinegar dressing over the barley. Mix well with a spoon, making sure to coat the salad evenly with the dressing. Serve. For the best taste and texture, enjoy the barley salad immediately after preparing it. You can also wait for up to two hours before serving the barley salad. Leave it out at room temperature, and serve it at room temperature.",
  "sentences":[
    " Making Basic Barley Place the water and barley in a large pot.",
    "Combine both ingredients in a large saucepan, making sure the water covers the barley completely.",
    "You can also substitute broth for water and add salt (to taste) for enhanced flavor, but neither option is necessary.",
    "Bring the water to a boil.",
    "Place the saucepan on the stove and bring the water to a boil over high heat.",
    "Once boiling, cover the saucepan with a lid.",
    "Note that the barley may produce a lot of foam and threaten to boil over the saucepan.",
    "Stirring the barley and watching it closely should help minimize the risk of accidental spills.",
    "Reduce the heat and simmer for 30 minutes.",
    "Pearl barley may finish within 25 minutes, while hulled barley will usually require up to 45 minutes.",
    "If the water boils away prematurely, add more about 1/2 cup (125 ml) at a time.",
    "Cook until all of the water has been absorbed.",
    "The barley should triple in volume and be soft, yet chewy.",
    "You may need to test the barley every 5 minutes or so near the end of the cooking process until it reaches your desired consistency.",
    "Turn off the heat.",
    "Allow the barley to sit for 15 minutes without stirring, so that it can continue absorbing any excess water.",
    "If there's still excess after letting the barley sit, you may need to drain the water away.",
    "Enjoy.",
    "Add the cooked barley to salad or soup, or toss with spices and oil for a delicious side dish.",
    "Preparing Baked Barley Preheat the oven to 375 degrees.",
    "Grab a 1-1/2 to 2 quart (1-1/2 to 2 L) oven-safe baking dish.",
    "A glass or ceramic one with a lid is ideal.",
    "Pour two cups of water into a saucepan.",
    "Bring the water to a boil on the stove over high heat.",
    "Note that you may also boil the water in a tea kettle.",
    "Place the barley in the baking dish.",
    "Pour the boiling water over the barley.",
    "Stir to combine.",
    "Stir in the butter and salt.",
    "Make sure that it is well-combined, then cover the dish with its lid.",
    "If you do not have a lid for your baking dish, cover it tightly with aluminum foil.",
    "Bake for 60 minutes.",
    "Place the dish in the preheated oven and bake for one hour.",
    "Place it on the center rack for best results.",
    "Remove the dish from the oven.",
    "Lightly fluff the finished barley with a spoon or fork.",
    "Spoon it into a serving dish and serve alongside a main course.",
    "Cooking Barley Soup Melt the butter in a large stockpot over medium heat.",
    "Meanwhile, prepare your vegetables.",
    "Prepare the onions, carrots, and celery by chopping them into bite-sized pieces.",
    "Prepare the mushrooms by soaking them in hot water.",
    "Note that this should be done about 30 minutes in advance.",
    "Strain the water, the chop the mushrooms.",
    "Add the onions, carrots and celery.",
    "Cook, stirring occasionally, until the onions are translucent, about five minutes.",
    "Stir in the minced garlic.",
    "Cook the mixture for two minutes more, stirring frequently to prevent the garlic from burning.",
    "Add the mushrooms.",
    "Continue cooking, stirring frequently, until the mushrooms are soft.",
    "This should take another five minutes or so.",
    "Sprinkle the flour over the vegetables.",
    "Lower the heat to medium-low, and sprinkle the flour evenly over the vegetables.",
    "Stir the mixture every 30 second for roughly five minutes or until everything seems sticky, thick, and well-coated.",
    "Gradually pour the broth into the pot.",
    "Turn the heat to medium high and add the broth about 1 cup (250 ml) at a time, stirring to combine well.",
    "Bring the soup to a slow boil once all of the broth is added.",
    "Adding the broth gradually should make it easier for the flour to incorporate itself into the liquid, thereby thickening it.",
    "Adding the broth all at once may result in clumps or an unevenly thin consistency.",
    "Stir in the barley and the salt.",
    "Allow the liquid to reach a boil again, then cover the stockpot.",
    "Reduce the soup to a simmer.",
    "Allow it to cook for one hour, stirring occasionally.",
    "The soup is ready to serve when the barley is tender and the soup has thickened.",
    "If desired, you can adjust the seasonings near the end of the cooking time.",
    "Consider adding more salt or sprinkling in some chopped parsley as desired.",
    "Enjoy.",
    "Serve the finished soup while it is still fresh and hot.",
    "Tossing Barley Salad Cook one cup of barley.",
    "Follow the instructions for \"Basic Barley.\"",
    "Combine 1 cup (250 ml) uncooked barley with 3 cups (750 ml) water over medium-high heat.",
    "Once boiling, reduce the heat to medium-low and simmer the barley for 30 minutes, or until soft.",
    "Drain, then let the barley cool to room temperature before continuing.",
    "Place the cooked barley in a bowl.",
    "Add the chopped tomatoes, chopped onion, and feta cheese.",
    "Toss well to combine.",
    "Combine the red wine vinegar, oil, and a pinch of salt and pepper.",
    "Place these ingredients in a separate mixing bowl.",
    "Use a whisk to mix the ingredients for one minute, or until the dressing appears evenly combined.",
    "Pour the vinegar dressing over the barley.",
    "Mix well with a spoon, making sure to coat the salad evenly with the dressing.",
    "Serve.",
    "For the best taste and texture, enjoy the barley salad immediately after preparing it.",
    "You can also wait for up to two hours before serving the barley salad.",
    "Leave it out at room temperature, and serve it at room temperature."
  ],
  "tyn_section":[
    "Large saucepan",
    "Mixing spoon",
    "Stove",
    "Oven",
    "Baking dish",
    "Saucepan",
    "Aluminum foil",
    "Stock pot",
    "Knife",
    "Cutting board",
    "Large mixing bowl"
  ],
  "tyn_model":[
    "barley",
    "water",
    "broth",
    "salt",
    "saucepan",
    "mushrooms",
    "oven",
    "onions",
    "flour",
    "stove",
    "oil",
    "baking dish",
    "butter",
    "spoon",
    "carrots",
    "celery",
    "vegetables",
    "barley salad",
    "large pot",
    "large saucepan",
    "spices",
    "oven-safe baking dish",
    "tea kettle",
    "aluminum foil",
    "fork",
    "cooking barley soup",
    "large stockpot",
    "hot water",
    "minced garlic",
    "garlic",
    "pot",
    "stockpot",
    "seasonings",
    "parsley",
    "bowl",
    "tomatoes",
    "onion",
    "feta cheese",
    "red wine vinegar",
    "salt and pepper",
    "mixing bowl",
    "whisk",
    "vinegar dressing"
  ],
  "simple_metrics":{
    "r":0.5454545455,
    "p":0.1395348837,
    "f1":0.2222222222,
    "avg_pos":0.4418604651
  },
  "jacc_metrics_0.5":{
    "r":0.8181818182,
    "p":0.2325581395,
    "f1":0.3621730382
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8181818182,
    "p":0.3023255814,
    "f1":0.441509434
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6363636364,
    "p":0.1860465116,
    "f1":0.2879177378
  }
}