{
  "title":"How to Make a Duct Tape Purse",
  "url":"https://www.wikihow.com/Make-a-Duct-Tape-Purse",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Plastic and Adhesive Projects",
    "Duct Tape Crafts",
    "Duct Tape Bags and Wallets"
  ],
  "methods":[
    {
      "name":"Making a Large Bag",
      "steps":[
        {
          "headline":"Cover a rectangle of fabric with overlapping strips of duct tape.",
          "description":"Cut a piece of cotton or canvas fabric twice the height you want your purse to be. Cover it with horizontal, vertical, or diagonal strips of duct tape, making sure to go past the edges of the fabric. Overlap each strip of duct tape by ⁄4 to ⁄2 inch (0.64 to 1.27 cm). If you know how to make a duct tape sheet, you can make one instead, then click here to continue. You can use all one color of duct tape, or you can use multiple colors for a more interesting design. Work on top of a cutting mat. This will make peeling the tape off easier in the next step."
        },
        {
          "headline":"Flip the sheet over and trim off the excess tape on the edges.",
          "description":"Carefully peel the duct tape sheet off of the cutting mat. Flip the sheet over, then use a metal ruler and a craft blade to carefully trim off the excess tape sticking out behind the edges of the fabric. You can also do this step with a pair of scissors, but it will be harder to get straight, precise lines. If you want to, you can cover the back of the fabric as well. Remember to trim the excess tape off!"
        },
        {
          "headline":"Fold the rectangle in half widthwise and tape up the sides.",
          "description":"Make sure that the fabric is on the inside, and the duct tape is on the outside. Once you are sure that the top and side edges match up, secure each side edge with a long strip of duct tape. Use a color that goes well with the outside of the bag. If you covered both sides of the sheet in duct tape, choose one side to be on the inside. Trim the excess tape off of the top and bottom edges of the bag."
        },
        {
          "headline":"Tuck the bottom corners into the bag.",
          "description":"Use your finger or a pencil to poke both of the bottom corners into the bag. Flatten the corners against the inside-bottom of the bag. If you were to look straight down into it, you should see triangle-like flaps. If this is too difficult for you, flatten the bottom corners of the bag horizontally, then fold them under the base of the bag instead."
        },
        {
          "headline":"Secure the tucked corners with a long strip of duct tape.",
          "description":"Cut off a strip of duct tape that is the same width as your bag. Reach inside your bag, and press one end of the tape down onto the right tucked-in corner. Pull the tape over to the other side of the bag, and press it down onto the left tucked-in corner. Match the tape to the inside of the bag. If you tucked the corners against the base of the bag, simply run the tape across the bottom of the bag to secure them. Match the tape to the outside of the bag. Give your purse more structure and support by covering the inside side seams with duct tape as well."
        },
        {
          "headline":"Cut a piece of thick rope for the handle, then cover it with duct tape.",
          "description":"Decide how long you want the handle to be, then cut a thick piece of rope accordingly. Wrap a solid-colored piece of duct tape around the rope, from one end to the other. For a nicer finish, wrap a piece of duct tape over both ends of the rope to hide it. You can also make a simpler handle by cutting two long pieces of duct tape, then sticking them together to form a strap."
        },
        {
          "headline":"Insert large grommets into the top, side-edges of the bag.",
          "description":"Choose a set of grommets that are wide enough for the rope to fit through. Punch a hole in each side of the bag, ⁄2 to 1 inch (1.3 to 2.5 cm) from the top edge. Make sure that the holes are centered on the side seams, then insert the grommets following the instructions on the package. For a nicer finish, fold a strip of duct tape around the entire top edge of the bag first. Use a contrasting color to make a nicer trim. If you made a simple, duct tape strap, skip this step."
        },
        {
          "headline":"Insert the handle through the grommets, then secure it to the bag.",
          "description":"If the grommets are small enough, you can tie a large knot into each end of the rope handle. Alternatively, you can secure the ends to the outside of the bag with a piece of duct tape. Make sure that it matches the tape you used on the side seams! If you made a simple strap, secure the ends to the inside side seams of your bag. Make sure that you use the same color as the seams."
        },
        {
          "headline":"Create a duct tape sheet to make an inside pocket, if desired.",
          "description":"Cut 2 to 3 6-inch (15-cm) strips of duct tape. Stick them onto a cutting mat, overlapping the long edges by ⁄4 inch (0.64 cm). Peel the sheet off, flip it over, and over the back with more overlapping strips of duct tape. This size should fit most bags. If your bag is smaller, then make your duct tape sheet smaller."
        },
        {
          "headline":"Secure the pocket to the inside of your bag.",
          "description":"Cut 3 strips of duct tape. Secure the strips to both of the narrow side edges and the bottom long edge of your duct tape pocket. Trim off any excess duct tape from the top  long edge, then secure the pocket to the inside of your bag. Place the pocket a few inches/centimeters from the top edge of your bag. For a nicer finish, cut the top and bottom corners of the tape off first; be careful not to cut into the actual pocket, however."
        }
      ]
    },
    {
      "name":"Making a Simple Clutch",
      "steps":[
        {
          "headline":"Lay down several overlapping strips of duct tape.",
          "description":"Cut a 12-inch (30-cm) strip of duct tape and lay it sticky-side-down horizontally across your cutting mat. Lay down more 12-inch (30-cm) strips of duct tape to make a 10 by 12-inch (25 by 30-cm) rectangle. Overlap each strip by ⁄4 inch (0.64 cm). This side will be the outside of your purse. Patterned duct tape would work great for this. You can also cut the strips a little longer than 12 inches (30 cm). This way, you can trim off any unevenness without sacrificing length."
        },
        {
          "headline":"Flip the  duct tape sheet over and lay down more strips on the back.",
          "description":"Peel the duct tape sheet off of the cutting mat, then flip it over so that the sticky side is facing up. Cut more 12-inch (30-cm) strips of duct tape, and lay them across the sheet to cover up the sticky side. Be sure to overlap them like before. Start peeling the duct tape sheet up starting from the first piece of tape you set down. This will prevent the sheet from coming apart. Offset the first and last strip by ⁄4 inch (0.64 cm). This way, the overlapping seams won't be on top of each other and create bulk. This will be the inside of the purse. Use a contrasting pattern or a solid color for this side."
        },
        {
          "headline":"Use a metal ruler and a craft blade to trim the duct tape sheet down.",
          "description":"You need the final sheet to be 10 by 12 inches (25 by 30 cm). Trim off any unevenness on the side edges using a metal ruler and a craft blade. If you off-set the strips of duct tape on the back of the sheet, fold the top and bottom edges over so that the sticky side isn't showing anymore."
        },
        {
          "headline":"Fold the narrow, bottom edge up by 4 ⁄2 inches (11 cm).",
          "description":"Turn the sheet so that one of the narrow edges is facing you. Make sure that the side you want to be on the inside is facing up, then fold the bottom 10-inch (25-cm) edge up by 4 ⁄2 inches (11 cm). Run your fingernail along the bottom crease to sharpen it. The remaining 3 inches (7.6 cm) sticking out over the top will eventually make the flap so that you can close the purse."
        },
        {
          "headline":"Tape side edges down to create an envelope.",
          "description":"Cut two 4 1⁄2-inch (11-cm) strips of duct tape. Lay a strip down each side of the folded purse, making sure that the bottom edges match up. Fold the rest of the strip over onto the back of the purse. Do not get any tape on the top 3 inches (7.6 cm) of the sheet."
        },
        {
          "headline":"Fold the top 3 inches (7.6 cm) down to make the flap.",
          "description":"Run your fingernail across the top crease to sharpen it. If you want to, you can cut the top flap into a V or U shape for a fancier touch. Make sure that you cut from corner-to-corner for a nicer finish."
        },
        {
          "headline":"Add a trim to the edges using a contrasting color, if desired.",
          "description":"Open up your purse first. Measure the edge that you want to decorate, then cut a strip of duct tape accordingly. Place the tape along the edge, then fold it over onto the back. Consider decorating the bottom and side edges of the flap as well as the side edges of the purse. You can cut the duct tape strips in half lengthwise to make them thinner."
        },
        {
          "headline":"Add self-adhesive Velcro dots for the closure.",
          "description":"Unfold the top flap. Place a self-adhesive Velcro dot along the center of the top edge. Place the matching Velcro dot on top of it, adhesive-side-up. Close the flap and press down on the closure securely so that the dot sticks to the bottom. Carefully pry open the flap and press the dots into place, if needed. Make sure that you add the Velcro after you add the trimming. If you do it before, you may end up covering up the Velcro."
        },
        {
          "headline":"Decorate the purse with shapes cut out of duct tape, if desired.",
          "description":"Buy a pre-made sheet of duct tape, or lay down a strip of duct tape on a piece of wax paper. Use a craft blade or a pair of scissors to cut out fun shapes, such as hearts, moons, or stars. Peel the tape off from the backing/wax paper, and stick it onto your purse."
        }
      ]
    }
  ],
  "text":" Making a Large Bag Cover a rectangle of fabric with overlapping strips of duct tape. Cut a piece of cotton or canvas fabric twice the height you want your purse to be. Cover it with horizontal, vertical, or diagonal strips of duct tape, making sure to go past the edges of the fabric. Overlap each strip of duct tape by ⁄4 to ⁄2 inch (0.64 to 1.27 cm). If you know how to make a duct tape sheet, you can make one instead, then click here to continue. You can use all one color of duct tape, or you can use multiple colors for a more interesting design. Work on top of a cutting mat. This will make peeling the tape off easier in the next step. Flip the sheet over and trim off the excess tape on the edges. Carefully peel the duct tape sheet off of the cutting mat. Flip the sheet over, then use a metal ruler and a craft blade to carefully trim off the excess tape sticking out behind the edges of the fabric. You can also do this step with a pair of scissors, but it will be harder to get straight, precise lines. If you want to, you can cover the back of the fabric as well. Remember to trim the excess tape off! Fold the rectangle in half widthwise and tape up the sides. Make sure that the fabric is on the inside, and the duct tape is on the outside. Once you are sure that the top and side edges match up, secure each side edge with a long strip of duct tape. Use a color that goes well with the outside of the bag. If you covered both sides of the sheet in duct tape, choose one side to be on the inside. Trim the excess tape off of the top and bottom edges of the bag. Tuck the bottom corners into the bag. Use your finger or a pencil to poke both of the bottom corners into the bag. Flatten the corners against the inside-bottom of the bag. If you were to look straight down into it, you should see triangle-like flaps. If this is too difficult for you, flatten the bottom corners of the bag horizontally, then fold them under the base of the bag instead. Secure the tucked corners with a long strip of duct tape. Cut off a strip of duct tape that is the same width as your bag. Reach inside your bag, and press one end of the tape down onto the right tucked-in corner. Pull the tape over to the other side of the bag, and press it down onto the left tucked-in corner. Match the tape to the inside of the bag. If you tucked the corners against the base of the bag, simply run the tape across the bottom of the bag to secure them. Match the tape to the outside of the bag. Give your purse more structure and support by covering the inside side seams with duct tape as well. Cut a piece of thick rope for the handle, then cover it with duct tape. Decide how long you want the handle to be, then cut a thick piece of rope accordingly. Wrap a solid-colored piece of duct tape around the rope, from one end to the other. For a nicer finish, wrap a piece of duct tape over both ends of the rope to hide it. You can also make a simpler handle by cutting two long pieces of duct tape, then sticking them together to form a strap. Insert large grommets into the top, side-edges of the bag. Choose a set of grommets that are wide enough for the rope to fit through. Punch a hole in each side of the bag, ⁄2 to 1 inch (1.3 to 2.5 cm) from the top edge. Make sure that the holes are centered on the side seams, then insert the grommets following the instructions on the package. For a nicer finish, fold a strip of duct tape around the entire top edge of the bag first. Use a contrasting color to make a nicer trim. If you made a simple, duct tape strap, skip this step. Insert the handle through the grommets, then secure it to the bag. If the grommets are small enough, you can tie a large knot into each end of the rope handle. Alternatively, you can secure the ends to the outside of the bag with a piece of duct tape. Make sure that it matches the tape you used on the side seams! If you made a simple strap, secure the ends to the inside side seams of your bag. Make sure that you use the same color as the seams. Create a duct tape sheet to make an inside pocket, if desired. Cut 2 to 3 6-inch (15-cm) strips of duct tape. Stick them onto a cutting mat, overlapping the long edges by ⁄4 inch (0.64 cm). Peel the sheet off, flip it over, and over the back with more overlapping strips of duct tape. This size should fit most bags. If your bag is smaller, then make your duct tape sheet smaller. Secure the pocket to the inside of your bag. Cut 3 strips of duct tape. Secure the strips to both of the narrow side edges and the bottom long edge of your duct tape pocket. Trim off any excess duct tape from the top  long edge, then secure the pocket to the inside of your bag. Place the pocket a few inches/centimeters from the top edge of your bag. For a nicer finish, cut the top and bottom corners of the tape off first; be careful not to cut into the actual pocket, however. Making a Simple Clutch Lay down several overlapping strips of duct tape. Cut a 12-inch (30-cm) strip of duct tape and lay it sticky-side-down horizontally across your cutting mat. Lay down more 12-inch (30-cm) strips of duct tape to make a 10 by 12-inch (25 by 30-cm) rectangle. Overlap each strip by ⁄4 inch (0.64 cm). This side will be the outside of your purse. Patterned duct tape would work great for this. You can also cut the strips a little longer than 12 inches (30 cm). This way, you can trim off any unevenness without sacrificing length. Flip the  duct tape sheet over and lay down more strips on the back. Peel the duct tape sheet off of the cutting mat, then flip it over so that the sticky side is facing up. Cut more 12-inch (30-cm) strips of duct tape, and lay them across the sheet to cover up the sticky side. Be sure to overlap them like before. Start peeling the duct tape sheet up starting from the first piece of tape you set down. This will prevent the sheet from coming apart. Offset the first and last strip by ⁄4 inch (0.64 cm). This way, the overlapping seams won't be on top of each other and create bulk. This will be the inside of the purse. Use a contrasting pattern or a solid color for this side. Use a metal ruler and a craft blade to trim the duct tape sheet down. You need the final sheet to be 10 by 12 inches (25 by 30 cm). Trim off any unevenness on the side edges using a metal ruler and a craft blade. If you off-set the strips of duct tape on the back of the sheet, fold the top and bottom edges over so that the sticky side isn't showing anymore. Fold the narrow, bottom edge up by 4 ⁄2 inches (11 cm). Turn the sheet so that one of the narrow edges is facing you. Make sure that the side you want to be on the inside is facing up, then fold the bottom 10-inch (25-cm) edge up by 4 ⁄2 inches (11 cm). Run your fingernail along the bottom crease to sharpen it. The remaining 3 inches (7.6 cm) sticking out over the top will eventually make the flap so that you can close the purse. Tape side edges down to create an envelope. Cut two 4 1⁄2-inch (11-cm) strips of duct tape. Lay a strip down each side of the folded purse, making sure that the bottom edges match up. Fold the rest of the strip over onto the back of the purse. Do not get any tape on the top 3 inches (7.6 cm) of the sheet. Fold the top 3 inches (7.6 cm) down to make the flap. Run your fingernail across the top crease to sharpen it. If you want to, you can cut the top flap into a V or U shape for a fancier touch. Make sure that you cut from corner-to-corner for a nicer finish. Add a trim to the edges using a contrasting color, if desired. Open up your purse first. Measure the edge that you want to decorate, then cut a strip of duct tape accordingly. Place the tape along the edge, then fold it over onto the back. Consider decorating the bottom and side edges of the flap as well as the side edges of the purse. You can cut the duct tape strips in half lengthwise to make them thinner. Add self-adhesive Velcro dots for the closure. Unfold the top flap. Place a self-adhesive Velcro dot along the center of the top edge. Place the matching Velcro dot on top of it, adhesive-side-up. Close the flap and press down on the closure securely so that the dot sticks to the bottom. Carefully pry open the flap and press the dots into place, if needed. Make sure that you add the Velcro after you add the trimming. If you do it before, you may end up covering up the Velcro. Decorate the purse with shapes cut out of duct tape, if desired. Buy a pre-made sheet of duct tape, or lay down a strip of duct tape on a piece of wax paper. Use a craft blade or a pair of scissors to cut out fun shapes, such as hearts, moons, or stars. Peel the tape off from the backing/wax paper, and stick it onto your purse.",
  "sentences":[
    " Making a Large Bag Cover a rectangle of fabric with overlapping strips of duct tape.",
    "Cut a piece of cotton or canvas fabric twice the height you want your purse to be.",
    "Cover it with horizontal, vertical, or diagonal strips of duct tape, making sure to go past the edges of the fabric.",
    "Overlap each strip of duct tape by ⁄4 to ⁄2 inch (0.64 to 1.27 cm).",
    "If you know how to make a duct tape sheet, you can make one instead, then click here to continue.",
    "You can use all one color of duct tape, or you can use multiple colors for a more interesting design.",
    "Work on top of a cutting mat.",
    "This will make peeling the tape off easier in the next step.",
    "Flip the sheet over and trim off the excess tape on the edges.",
    "Carefully peel the duct tape sheet off of the cutting mat.",
    "Flip the sheet over, then use a metal ruler and a craft blade to carefully trim off the excess tape sticking out behind the edges of the fabric.",
    "You can also do this step with a pair of scissors, but it will be harder to get straight, precise lines.",
    "If you want to, you can cover the back of the fabric as well.",
    "Remember to trim the excess tape off!",
    "Fold the rectangle in half widthwise and tape up the sides.",
    "Make sure that the fabric is on the inside, and the duct tape is on the outside.",
    "Once you are sure that the top and side edges match up, secure each side edge with a long strip of duct tape.",
    "Use a color that goes well with the outside of the bag.",
    "If you covered both sides of the sheet in duct tape, choose one side to be on the inside.",
    "Trim the excess tape off of the top and bottom edges of the bag.",
    "Tuck the bottom corners into the bag.",
    "Use your finger or a pencil to poke both of the bottom corners into the bag.",
    "Flatten the corners against the inside-bottom of the bag.",
    "If you were to look straight down into it, you should see triangle-like flaps.",
    "If this is too difficult for you, flatten the bottom corners of the bag horizontally, then fold them under the base of the bag instead.",
    "Secure the tucked corners with a long strip of duct tape.",
    "Cut off a strip of duct tape that is the same width as your bag.",
    "Reach inside your bag, and press one end of the tape down onto the right tucked-in corner.",
    "Pull the tape over to the other side of the bag, and press it down onto the left tucked-in corner.",
    "Match the tape to the inside of the bag.",
    "If you tucked the corners against the base of the bag, simply run the tape across the bottom of the bag to secure them.",
    "Match the tape to the outside of the bag.",
    "Give your purse more structure and support by covering the inside side seams with duct tape as well.",
    "Cut a piece of thick rope for the handle, then cover it with duct tape.",
    "Decide how long you want the handle to be, then cut a thick piece of rope accordingly.",
    "Wrap a solid-colored piece of duct tape around the rope, from one end to the other.",
    "For a nicer finish, wrap a piece of duct tape over both ends of the rope to hide it.",
    "You can also make a simpler handle by cutting two long pieces of duct tape, then sticking them together to form a strap.",
    "Insert large grommets into the top, side-edges of the bag.",
    "Choose a set of grommets that are wide enough for the rope to fit through.",
    "Punch a hole in each side of the bag, ⁄2 to 1 inch (1.3 to 2.5 cm) from the top edge.",
    "Make sure that the holes are centered on the side seams, then insert the grommets following the instructions on the package.",
    "For a nicer finish, fold a strip of duct tape around the entire top edge of the bag first.",
    "Use a contrasting color to make a nicer trim.",
    "If you made a simple, duct tape strap, skip this step.",
    "Insert the handle through the grommets, then secure it to the bag.",
    "If the grommets are small enough, you can tie a large knot into each end of the rope handle.",
    "Alternatively, you can secure the ends to the outside of the bag with a piece of duct tape.",
    "Make sure that it matches the tape you used on the side seams!",
    "If you made a simple strap, secure the ends to the inside side seams of your bag.",
    "Make sure that you use the same color as the seams.",
    "Create a duct tape sheet to make an inside pocket, if desired.",
    "Cut 2 to 3 6-inch (15-cm) strips of duct tape.",
    "Stick them onto a cutting mat, overlapping the long edges by ⁄4 inch (0.64 cm).",
    "Peel the sheet off, flip it over, and over the back with more overlapping strips of duct tape.",
    "This size should fit most bags.",
    "If your bag is smaller, then make your duct tape sheet smaller.",
    "Secure the pocket to the inside of your bag.",
    "Cut 3 strips of duct tape.",
    "Secure the strips to both of the narrow side edges and the bottom long edge of your duct tape pocket.",
    "Trim off any excess duct tape from the top  long edge, then secure the pocket to the inside of your bag.",
    "Place the pocket a few inches/centimeters from the top edge of your bag.",
    "For a nicer finish, cut the top and bottom corners of the tape off first; be careful not to cut into the actual pocket, however.",
    "Making a Simple Clutch Lay down several overlapping strips of duct tape.",
    "Cut a 12-inch (30-cm) strip of duct tape and lay it sticky-side-down horizontally across your cutting mat.",
    "Lay down more 12-inch (30-cm) strips of duct tape to make a 10 by 12-inch (25 by 30-cm) rectangle.",
    "Overlap each strip by ⁄4 inch (0.64 cm).",
    "This side will be the outside of your purse.",
    "Patterned duct tape would work great for this.",
    "You can also cut the strips a little longer than 12 inches (30 cm).",
    "This way, you can trim off any unevenness without sacrificing length.",
    "Flip the  duct tape sheet over and lay down more strips on the back.",
    "Peel the duct tape sheet off of the cutting mat, then flip it over so that the sticky side is facing up.",
    "Cut more 12-inch (30-cm) strips of duct tape, and lay them across the sheet to cover up the sticky side.",
    "Be sure to overlap them like before.",
    "Start peeling the duct tape sheet up starting from the first piece of tape you set down.",
    "This will prevent the sheet from coming apart.",
    "Offset the first and last strip by ⁄4 inch (0.64 cm).",
    "This way, the overlapping seams won't be on top of each other and create bulk.",
    "This will be the inside of the purse.",
    "Use a contrasting pattern or a solid color for this side.",
    "Use a metal ruler and a craft blade to trim the duct tape sheet down.",
    "You need the final sheet to be 10 by 12 inches (25 by 30 cm).",
    "Trim off any unevenness on the side edges using a metal ruler and a craft blade.",
    "If you off-set the strips of duct tape on the back of the sheet, fold the top and bottom edges over so that the sticky side isn't showing anymore.",
    "Fold the narrow, bottom edge up by 4 ⁄2 inches (11 cm).",
    "Turn the sheet so that one of the narrow edges is facing you.",
    "Make sure that the side you want to be on the inside is facing up, then fold the bottom 10-inch (25-cm) edge up by 4 ⁄2 inches (11 cm).",
    "Run your fingernail along the bottom crease to sharpen it.",
    "The remaining 3 inches (7.6 cm) sticking out over the top will eventually make the flap so that you can close the purse.",
    "Tape side edges down to create an envelope.",
    "Cut two 4 1⁄2-inch (11-cm) strips of duct tape.",
    "Lay a strip down each side of the folded purse, making sure that the bottom edges match up.",
    "Fold the rest of the strip over onto the back of the purse.",
    "Do not get any tape on the top 3 inches (7.6 cm) of the sheet.",
    "Fold the top 3 inches (7.6 cm) down to make the flap.",
    "Run your fingernail across the top crease to sharpen it.",
    "If you want to, you can cut the top flap into a V or U shape for a fancier touch.",
    "Make sure that you cut from corner-to-corner for a nicer finish.",
    "Add a trim to the edges using a contrasting color, if desired.",
    "Open up your purse first.",
    "Measure the edge that you want to decorate, then cut a strip of duct tape accordingly.",
    "Place the tape along the edge, then fold it over onto the back.",
    "Consider decorating the bottom and side edges of the flap as well as the side edges of the purse.",
    "You can cut the duct tape strips in half lengthwise to make them thinner.",
    "Add self-adhesive Velcro dots for the closure.",
    "Unfold the top flap.",
    "Place a self-adhesive Velcro dot along the center of the top edge.",
    "Place the matching Velcro dot on top of it, adhesive-side-up.",
    "Close the flap and press down on the closure securely so that the dot sticks to the bottom.",
    "Carefully pry open the flap and press the dots into place, if needed.",
    "Make sure that you add the Velcro after you add the trimming.",
    "If you do it before, you may end up covering up the Velcro.",
    "Decorate the purse with shapes cut out of duct tape, if desired.",
    "Buy a pre-made sheet of duct tape, or lay down a strip of duct tape on a piece of wax paper.",
    "Use a craft blade or a pair of scissors to cut out fun shapes, such as hearts, moons, or stars.",
    "Peel the tape off from the backing/wax paper, and stick it onto your purse."
  ],
  "tyn_section":[
    "Patterned duct tape",
    "Solid colored duct tape",
    "Cutting mat",
    "Metal ruler",
    "Craft blade",
    "Self-adhesive Velcro dots",
    "Pre-made duct tape sheet or wax paper (optional)",
    "Cotton or canvas fabric",
    "Duct tape",
    "Scissors",
    "Thick rope",
    "Large grommets",
    "Metal ruler and craft blade (recommended)",
    "Cutting mat (recommended)"
  ],
  "tyn_model":[
    "duct tape",
    "tape",
    "purse",
    "fabric",
    "cutting mat",
    "craft blade",
    "velcro",
    "metal ruler",
    "scissors",
    "rope",
    "wax paper",
    "pencil",
    "ruler",
    "sheet",
    "self-adhesive velcro"
  ],
  "simple_metrics":{
    "r":0.3571428571,
    "p":0.3333333333,
    "f1":0.3448275862,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.6,
    "f1":0.652173913
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7857142857,
    "p":0.6666666667,
    "f1":0.7213114754
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.4,
    "f1":0.4705882353
  }
}