{
  "title":"How to Remove a Countertop",
  "url":"https://www.wikihow.com/Remove-a-Countertop",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "parts":[
    {
      "name":"Disconnecting Fixtures and Lines",
      "steps":[
        {
          "headline":"Remove everything from the countertop and drawers.",
          "description":"It is important for the space where you'll be working to be clear when you begin the removal process. Take everything off of the countertops. Remove everything out of the drawers and in the cabinets underneath the countertops. Place all of the items in a safe location that is out of the way."
        },
        {
          "headline":"Move appliances away from the countertops.",
          "description":"If you're working in the kitchen, all of the appliances will need to be unplugged and moved away from the countertops. For example, remove the stove and microwave out of the kitchen. Be careful not to damage them in the removal process."
        },
        {
          "headline":"Shut off the supply lines to the countertop fixtures.",
          "description":"To safely remove your old countertop, you'll first have to  disconnect  the water lines to the sink and gas lines to the stovetop. Turn the emergency shut-off valves for each fixture clockwise to the off position. Disconnect the supply lines from the valves using an adjustable wrench. Have a bucket ready for draining water."
        },
        {
          "headline":"Disconnect the drain line under the sink.",
          "description":"Use your adjustable wrench to loosen the large nuts that hold the J or U-shaped trap to the sink's main drain line. Hold the trap in place with channel locks. If you have a PVC connection, you should be able to loosen the connection by hand. If you have a garbage disposal, disconnect it from the sink as well."
        },
        {
          "headline":"Remove  your drop-in fixture sink.",
          "description":"If you have a drop-in fixture sink, use a chisel or putty knife to pry the sink away from the countertop. Chop away at the layer of dried adhesive under the rim of the sink to free it. If the sink is fastened to a tile countertop, chisel away the quarter tiles along the sink's perimeter. Remove any remaining mortar or adhesive with a caulk remover or chisel. Get help to lift out the fixture, especially if it's large or heavy."
        },
        {
          "headline":"Pull out the undermount-style sink.",
          "description":"If the sink is an undermount type, unfasten the screws holding it to the countertop. While someone supports the sink, remove the brackets underneath the sink. Use a flat chisel to remove the caulk that acts as a seal between the countertop and sink. The sink should come out easily once it is freed from the counter. Have another person help you pull out the sink, particularly if it's an unwieldy double-bowl configuration\nBe careful not to damage a sink or cooktop that you plan to re-install in your new countertop."
        }
      ]
    },
    {
      "name":"Taking off the Countertop",
      "steps":[
        {
          "headline":"Loosen the adhesive on countertops with a softener.",
          "description":"Most counters are attached with an adhesive. Spray the adhesive with a caulk softener. Let the softener sit for one hour. Then, pry the adhesive away from the backsplash with a putty knife. Simple work the putty knife under the countertop, and work all the way around until the counter is loose enough to lift up. Caulk softener can be found at most home improvement stores."
        },
        {
          "headline":"Unfasten the screws from your countertop.",
          "description":"Some countertops are held in place with screws that go all the way through to the base cabinets. If this is the case, open up the cabinets and look inside. Locate all of the screws. Use a screwdriver to remove the screws. Then, lift off the countertop."
        },
        {
          "headline":"Use a pry bar to remove the countertops.",
          "description":"Most countertops are bracketed to the base cabinets. If the counter is attached to the base cabinet with nails or an adhesive, use a pry bar to remove it. Put the claw of the pry bar under the rim of the counter, and press down on the free end until the countertop begins to lift up. Work slowly around the counter and use only the minimum amount of force needed to remove the adhesive in order to avoid damaging the base cabinets. Laminate backsplashes can be removed at this time as well. Use your chisel and a hammer to remove the laminate coating from the backsplash. Underneath, there should be a board screwed into the wall. Use a drill or screwdriver to remove the board."
        },
        {
          "headline":"Remove each tile from a tile countertop.",
          "description":"Remove the tile from the surface of the countertop with a flat chisel. This frees the countertop and also reduces its weight, making it much easier to lift out. First, carefully pry the tile running up the backsplash away from the wall. Remove the rounded, bullnose tile along the front of the countertop. Repeat the process on the tile glued to the countertop, slicing between the mortar and wood underlayment. When the tile is removed, go under the counter and use a screwdriver to take off the brackets holding the countertop to the base cabinets. Lift the countertop off. Some tile countertops have an underlying layer of wood. After removing the top layer, check to see if there is any wood. If so, use a pry bar to remove the remaining wood."
        },
        {
          "headline":"Call in a professional for a granite countertop.",
          "description":"Most natural-stone countertops are heavy, and therefore difficult to remove. They are either attached to particle-board underlayment or epoxied directly onto the base cabinets. The base cabinet can easily be damaged during the procedure. It's usually best to have a contractor do this type of removal."
        },
        {
          "headline":"Check for cracks in the shelves before completing the removal.",
          "description":"During the removal process, check for cracks or damage in the shelves. Unless they are being removed as well, you will not want to damage them. It is best to call in a professional to complete the removal if you do see damage."
        },
        {
          "headline":"Get rid of the countertops.",
          "description":"You will likely not want to leave the old countertops laying around. If they are not damaged, you can put try to give away the countertops for free. Or, take the remains of the countertop to the dump. You can put an ad on Craigslist for someone to pick up the countertops, but be very careful about giving strangers your information. It's also an option to reuse the material as countertops in your garage or laundry room."
        }
      ]
    }
  ],
  "text":" Disconnecting Fixtures and Lines Remove everything from the countertop and drawers. It is important for the space where you'll be working to be clear when you begin the removal process. Take everything off of the countertops. Remove everything out of the drawers and in the cabinets underneath the countertops. Place all of the items in a safe location that is out of the way. Move appliances away from the countertops. If you're working in the kitchen, all of the appliances will need to be unplugged and moved away from the countertops. For example, remove the stove and microwave out of the kitchen. Be careful not to damage them in the removal process. Shut off the supply lines to the countertop fixtures. To safely remove your old countertop, you'll first have to  disconnect  the water lines to the sink and gas lines to the stovetop. Turn the emergency shut-off valves for each fixture clockwise to the off position. Disconnect the supply lines from the valves using an adjustable wrench. Have a bucket ready for draining water. Disconnect the drain line under the sink. Use your adjustable wrench to loosen the large nuts that hold the J or U-shaped trap to the sink's main drain line. Hold the trap in place with channel locks. If you have a PVC connection, you should be able to loosen the connection by hand. If you have a garbage disposal, disconnect it from the sink as well. Remove  your drop-in fixture sink. If you have a drop-in fixture sink, use a chisel or putty knife to pry the sink away from the countertop. Chop away at the layer of dried adhesive under the rim of the sink to free it. If the sink is fastened to a tile countertop, chisel away the quarter tiles along the sink's perimeter. Remove any remaining mortar or adhesive with a caulk remover or chisel. Get help to lift out the fixture, especially if it's large or heavy. Pull out the undermount-style sink. If the sink is an undermount type, unfasten the screws holding it to the countertop. While someone supports the sink, remove the brackets underneath the sink. Use a flat chisel to remove the caulk that acts as a seal between the countertop and sink. The sink should come out easily once it is freed from the counter. Have another person help you pull out the sink, particularly if it's an unwieldy double-bowl configuration\nBe careful not to damage a sink or cooktop that you plan to re-install in your new countertop. Taking off the Countertop Loosen the adhesive on countertops with a softener. Most counters are attached with an adhesive. Spray the adhesive with a caulk softener. Let the softener sit for one hour. Then, pry the adhesive away from the backsplash with a putty knife. Simple work the putty knife under the countertop, and work all the way around until the counter is loose enough to lift up. Caulk softener can be found at most home improvement stores. Unfasten the screws from your countertop. Some countertops are held in place with screws that go all the way through to the base cabinets. If this is the case, open up the cabinets and look inside. Locate all of the screws. Use a screwdriver to remove the screws. Then, lift off the countertop. Use a pry bar to remove the countertops. Most countertops are bracketed to the base cabinets. If the counter is attached to the base cabinet with nails or an adhesive, use a pry bar to remove it. Put the claw of the pry bar under the rim of the counter, and press down on the free end until the countertop begins to lift up. Work slowly around the counter and use only the minimum amount of force needed to remove the adhesive in order to avoid damaging the base cabinets. Laminate backsplashes can be removed at this time as well. Use your chisel and a hammer to remove the laminate coating from the backsplash. Underneath, there should be a board screwed into the wall. Use a drill or screwdriver to remove the board. Remove each tile from a tile countertop. Remove the tile from the surface of the countertop with a flat chisel. This frees the countertop and also reduces its weight, making it much easier to lift out. First, carefully pry the tile running up the backsplash away from the wall. Remove the rounded, bullnose tile along the front of the countertop. Repeat the process on the tile glued to the countertop, slicing between the mortar and wood underlayment. When the tile is removed, go under the counter and use a screwdriver to take off the brackets holding the countertop to the base cabinets. Lift the countertop off. Some tile countertops have an underlying layer of wood. After removing the top layer, check to see if there is any wood. If so, use a pry bar to remove the remaining wood. Call in a professional for a granite countertop. Most natural-stone countertops are heavy, and therefore difficult to remove. They are either attached to particle-board underlayment or epoxied directly onto the base cabinets. The base cabinet can easily be damaged during the procedure. It's usually best to have a contractor do this type of removal. Check for cracks in the shelves before completing the removal. During the removal process, check for cracks or damage in the shelves. Unless they are being removed as well, you will not want to damage them. It is best to call in a professional to complete the removal if you do see damage. Get rid of the countertops. You will likely not want to leave the old countertops laying around. If they are not damaged, you can put try to give away the countertops for free. Or, take the remains of the countertop to the dump. You can put an ad on Craigslist for someone to pick up the countertops, but be very careful about giving strangers your information. It's also an option to reuse the material as countertops in your garage or laundry room.",
  "sentences":[
    " Disconnecting Fixtures and Lines Remove everything from the countertop and drawers.",
    "It is important for the space where you'll be working to be clear when you begin the removal process.",
    "Take everything off of the countertops.",
    "Remove everything out of the drawers and in the cabinets underneath the countertops.",
    "Place all of the items in a safe location that is out of the way.",
    "Move appliances away from the countertops.",
    "If you're working in the kitchen, all of the appliances will need to be unplugged and moved away from the countertops.",
    "For example, remove the stove and microwave out of the kitchen.",
    "Be careful not to damage them in the removal process.",
    "Shut off the supply lines to the countertop fixtures.",
    "To safely remove your old countertop, you'll first have to  disconnect  the water lines to the sink and gas lines to the stovetop.",
    "Turn the emergency shut-off valves for each fixture clockwise to the off position.",
    "Disconnect the supply lines from the valves using an adjustable wrench.",
    "Have a bucket ready for draining water.",
    "Disconnect the drain line under the sink.",
    "Use your adjustable wrench to loosen the large nuts that hold the J or U-shaped trap to the sink's main drain line.",
    "Hold the trap in place with channel locks.",
    "If you have a PVC connection, you should be able to loosen the connection by hand.",
    "If you have a garbage disposal, disconnect it from the sink as well.",
    "Remove  your drop-in fixture sink.",
    "If you have a drop-in fixture sink, use a chisel or putty knife to pry the sink away from the countertop.",
    "Chop away at the layer of dried adhesive under the rim of the sink to free it.",
    "If the sink is fastened to a tile countertop, chisel away the quarter tiles along the sink's perimeter.",
    "Remove any remaining mortar or adhesive with a caulk remover or chisel.",
    "Get help to lift out the fixture, especially if it's large or heavy.",
    "Pull out the undermount-style sink.",
    "If the sink is an undermount type, unfasten the screws holding it to the countertop.",
    "While someone supports the sink, remove the brackets underneath the sink.",
    "Use a flat chisel to remove the caulk that acts as a seal between the countertop and sink.",
    "The sink should come out easily once it is freed from the counter.",
    "Have another person help you pull out the sink, particularly if it's an unwieldy double-bowl configuration\nBe careful not to damage a sink or cooktop that you plan to re-install in your new countertop.",
    "Taking off the Countertop Loosen the adhesive on countertops with a softener.",
    "Most counters are attached with an adhesive.",
    "Spray the adhesive with a caulk softener.",
    "Let the softener sit for one hour.",
    "Then, pry the adhesive away from the backsplash with a putty knife.",
    "Simple work the putty knife under the countertop, and work all the way around until the counter is loose enough to lift up.",
    "Caulk softener can be found at most home improvement stores.",
    "Unfasten the screws from your countertop.",
    "Some countertops are held in place with screws that go all the way through to the base cabinets.",
    "If this is the case, open up the cabinets and look inside.",
    "Locate all of the screws.",
    "Use a screwdriver to remove the screws.",
    "Then, lift off the countertop.",
    "Use a pry bar to remove the countertops.",
    "Most countertops are bracketed to the base cabinets.",
    "If the counter is attached to the base cabinet with nails or an adhesive, use a pry bar to remove it.",
    "Put the claw of the pry bar under the rim of the counter, and press down on the free end until the countertop begins to lift up.",
    "Work slowly around the counter and use only the minimum amount of force needed to remove the adhesive in order to avoid damaging the base cabinets.",
    "Laminate backsplashes can be removed at this time as well.",
    "Use your chisel and a hammer to remove the laminate coating from the backsplash.",
    "Underneath, there should be a board screwed into the wall.",
    "Use a drill or screwdriver to remove the board.",
    "Remove each tile from a tile countertop.",
    "Remove the tile from the surface of the countertop with a flat chisel.",
    "This frees the countertop and also reduces its weight, making it much easier to lift out.",
    "First, carefully pry the tile running up the backsplash away from the wall.",
    "Remove the rounded, bullnose tile along the front of the countertop.",
    "Repeat the process on the tile glued to the countertop, slicing between the mortar and wood underlayment.",
    "When the tile is removed, go under the counter and use a screwdriver to take off the brackets holding the countertop to the base cabinets.",
    "Lift the countertop off.",
    "Some tile countertops have an underlying layer of wood.",
    "After removing the top layer, check to see if there is any wood.",
    "If so, use a pry bar to remove the remaining wood.",
    "Call in a professional for a granite countertop.",
    "Most natural-stone countertops are heavy, and therefore difficult to remove.",
    "They are either attached to particle-board underlayment or epoxied directly onto the base cabinets.",
    "The base cabinet can easily be damaged during the procedure.",
    "It's usually best to have a contractor do this type of removal.",
    "Check for cracks in the shelves before completing the removal.",
    "During the removal process, check for cracks or damage in the shelves.",
    "Unless they are being removed as well, you will not want to damage them.",
    "It is best to call in a professional to complete the removal if you do see damage.",
    "Get rid of the countertops.",
    "You will likely not want to leave the old countertops laying around.",
    "If they are not damaged, you can put try to give away the countertops for free.",
    "Or, take the remains of the countertop to the dump.",
    "You can put an ad on Craigslist for someone to pick up the countertops, but be very careful about giving strangers your information.",
    "It's also an option to reuse the material as countertops in your garage or laundry room."
  ],
  "tyn_section":[
    "Adjustable wrench",
    "Channel locks",
    "Chisel",
    "Hammer",
    "Screwdriver",
    "Pry bar",
    "Putty knife",
    "Reciprocating saw",
    "Work gloves",
    "Protective eyewear"
  ],
  "tyn_model":[
    "sink",
    "chisel",
    "putty knife",
    "screws",
    "appliances",
    "water",
    "adjustable wrench",
    "drop-in fixture sink",
    "mortar",
    "caulk softener",
    "screwdriver",
    "pry bar",
    "shelves",
    "stove",
    "microwave",
    "gas",
    "bucket",
    "garbage disposal",
    "caulk remover",
    "flat chisel",
    "adhesive",
    "nails",
    "hammer",
    "laminate",
    "drill or screwdriver",
    "granite",
    "natural-stone countertops",
    "particle-board",
    "contractor",
    "countertop"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.2,
    "f1":0.3,
    "avg_pos":0.2
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.2333333333,
    "f1":0.336
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.2666666667,
    "f1":0.3692307692
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.2,
    "f1":0.3
  }
}