{
  "title":"How to Age Paper Using Tea",
  "url":"https://www.wikihow.com/Age-Paper-Using-Tea",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papermaking",
    "Dyeing Paper"
  ],
  "parts":[
    {
      "name":"Brewing Your Tea",
      "steps":[
        {
          "headline":"Place 1-2 tea bags into a mug used for hot beverages.",
          "description":"The amount of tea you use depends on whether you want to dye your paper a lot or a little. For most projects, 1 tea bag per sheet of paper should be plenty, but if you're just going to do a few splotches of tea, you might be able to use one bag for several sheets of paper. However, if you're planning to fully saturate the paper and you want a very dark finish, you might need 2 tea bags for each sheet. Tip: Any type of tea will work, but black tea is a common option for this project. However, you might want to avoid using green tea or tea infused with red herbs, as this will produce a different color effect and the paper might not look aged. If you use a cup that isn't intended for hot beverages, you could end up with a nasty burn. Stick to a coffee or tea cup, and avoid cups made from plastic or metal, as they aren't meant to hold boiling water."
        },
        {
          "headline":"Fill a tea kettle or a small pot with water.",
          "description":"You only need enough water to fill up a mug, or about 1 cup (240 mL), but since water evaporates as it boils, it's better to start with more than you'll need. If you'll be brewing multiple mugs of tea at the same time, make sure you have enough water for each mug."
        },
        {
          "headline":"Bring the water to a boil on the stove.",
          "description":"In order to extract the tea from the bag, the water needs to be as hot as possible. If you're using a pot, you'll see bubbles on the surface of the water when it's boiling. If you're using a tea kettle, you'll hear a high-pitched whistle when the water is ready. Be very careful when you're working with boiling water. If the pot you're using has a metal handle, use a pot holder to move it so you don't burn yourself, and be very careful not to spill any on your skin. If you're a kid, ask an adult to help you boil the water for this step. You can also boil the water in the microwave if you like, but be sure to use a microwave-safe dish and place a non-metallic object like a popsicle stick into the dish so the water doesn't become super-heated and explode."
        },
        {
          "headline":"Pour the hot water over the tea and allow it to steep for about 5 minutes.",
          "description":"Carefully pour the hot water into the mug to start brewing your tea. Don't get the mug too full, or you might accidentally spill boiling water on yourself. Wait about 5 minutes for the tea to brew, or until the water turns the color you want. Try to leave about 1–2 in (2.5–5.1 cm) of space at the top of the mug. If you're trying to get a very dark color, use 2 tea bags in the mug at the same time. If you want a lighter color, 1 bag will be fine."
        }
      ]
    },
    {
      "name":"Applying the Tea to the Paper",
      "steps":[
        {
          "headline":"Print or write whatever you want on the paper first.",
          "description":"Once you stain the paper, it won't accept ink evenly, so anything you try to write or print on it will look messy. It's best to write, print, or draw whatever you'd like on the paper before you do anything else. Let the ink dry completely so it doesn’t run. Any paper will work for this, from plain white copy paper to heavier paper used for painting. Thicker papers might produce a lighter result that takes longer to dry. Some inks are more likely to run when they're wet, especially if you write with a washable marker or you print your design on an inkjet printer. If you can, use a laser printer or some sort of waterproof ink. If you can't, just try not to rub the paper when you add the tea. Hopefully this will minimize the smudging. If you like, you can also lightly crumple the paper, then smooth it out. This will make the paper look like it's been shuffled around for a number of years. To make the paper look even more worn, like for an old treasure map, tear off the edges of the paper."
        },
        {
          "headline":"Lay the paper on a baking sheet.",
          "description":"A baking sheet with a raised rim will keep the tea from spilling over the sides as you're working. The baking sheet should be a little bigger than the paper you use. For instance, if you're using an 8.5 in × 11 in (22 cm × 28 cm) sheet of paper, a 9 in × 13 in (23 cm × 33 cm) baking sheet would be perfect. Tea can stain your countertop or table, so it's important to protect your work surface. If you don't have a baking sheet that you can use, you can lay trash bags flat on your work surface instead."
        },
        {
          "headline":"Dab one of the tea bags over the paper.",
          "description":"Holding the tea bag by the top, blot it down onto the paper. Continue doing this until you've covered as much of the paper as you want. If the tea bag starts to dry out, dip it in the mug of tea to wet it again. It's up to you whether you want to cover the whole page or just a few areas. Either way, don't worry about getting a perfect application. The paper will look more authentic if the yellowing is a little uneven. Experiment with ways to get the tea on the paper. If you like, you can use a paintbrush, a straw, or even your fingers to create different effects."
        },
        {
          "headline":"Flip the paper over and stain the other side.",
          "description":"Even if you only plan on showing one side of the paper, the aging effect will look more authentic if you apply the tea to both sides of the paper. This will also make your page look darker once it’s finished."
        },
        {
          "headline":"Sprinkle the page with turmeric if you want the paper to be more yellow.",
          "description":"While this step isn't strictly necessary, adding a light coat of the spice turmeric will help yellow the effect of the tea. Use your fingers to rub the turmeric into the tea"
        },
        {
          "headline":"Mix in a few coffee grounds to make the paper more brown.",
          "description":"If you want your aged paper to look like it's been exposed to the elements, you can sprinkle a few coffee grounds over the wet tea to help add more brown to the page. Rub the coffee grounds into the tea to help them stick to the paper. Loose tea leaves may work for this as well, but the effect will not be as dramatic. You can even break open one of the tea bags if you want. You'll remove the excess coffee grounds after the paper is dry."
        },
        {
          "headline":"Dab away excess tea with paper towels.",
          "description":"Make sure there isn't any water pooled on the page itself or on the baking sheet. This will ensure the page dries evenly, which will help prevent the paper from curling too much in the oven."
        }
      ]
    },
    {
      "name":"Drying the Paper",
      "steps":[
        {
          "headline":"Allow the paper to air-dry for 24 hours if you're not in a hurry.",
          "description":"While baking the paper is the fastest way to dry it, you can let it air-dry if you prefer. Just place your baking sheet in an area with plenty of air circulation. Don't dry the paper in direct sunlight, as it may become too brittle to use. Give the paper about 24 hours to air-dry."
        },
        {
          "headline":"Heat your oven to the lowest setting if you want to dry the paper quickly.",
          "description":"Baking the paper will dry it quickly, allowing you to finish your project the same day you started it. If you bake the paper too quickly, however, it will become brittle, and it may even scorch, so it's important to use the lowest heat possible. Tip: On most ovens, this is about 200 °F (93 °C). If you have a \"Warm\" setting, use that."
        },
        {
          "headline":"Bake the paper for about 5 minutes.",
          "description":"On the lowest setting, this should be enough time to evaporate the layer of tea on your paper. Keep a close eye on the paper while it's in the oven, however, since paper is highly flammable. If you used too much liquid, or if the paper is very thick, you might need to leave it in for a little longer. You can tell the paper is dry when the edges start to curl up. Use oven mitts to protect your hands when you take the baking sheet out of the oven."
        },
        {
          "headline":"Brush away any residue with a soft paintbrush.",
          "description":"You don't have to do this if you only used tea to color your paper. However, if you added turmeric or coffee grounds to affect the final shade, you should brush away anything the paper didn't absorb. A soft paint brush will remove the residue without roughing up the paper. Tip: If you don't have a paintbrush, you could use a soft, dry cloth, like a microfiber cloth, instead."
        },
        {
          "headline":"Rough up the paper if it doesn't look old enough.",
          "description":"Depending on your project, just yellowing the paper might not give it the authentic look you're going for. If you need it to look like it's been damaged, try crumpling the paper, singing it with a flame, or adding more stains or tears. For instance, if you're making an old treasure map, you might want to crumple it up and carefully burn the edges so it will look old and worn. If you want to create holes in the paper, crumple the sheet and spritz it with a little water, then use your fingernails to make small tears. Allow the paper to air dry."
        }
      ]
    }
  ],
  "text":" Brewing Your Tea Place 1-2 tea bags into a mug used for hot beverages. The amount of tea you use depends on whether you want to dye your paper a lot or a little. For most projects, 1 tea bag per sheet of paper should be plenty, but if you're just going to do a few splotches of tea, you might be able to use one bag for several sheets of paper. However, if you're planning to fully saturate the paper and you want a very dark finish, you might need 2 tea bags for each sheet. Tip: Any type of tea will work, but black tea is a common option for this project. However, you might want to avoid using green tea or tea infused with red herbs, as this will produce a different color effect and the paper might not look aged. If you use a cup that isn't intended for hot beverages, you could end up with a nasty burn. Stick to a coffee or tea cup, and avoid cups made from plastic or metal, as they aren't meant to hold boiling water. Fill a tea kettle or a small pot with water. You only need enough water to fill up a mug, or about 1 cup (240 mL), but since water evaporates as it boils, it's better to start with more than you'll need. If you'll be brewing multiple mugs of tea at the same time, make sure you have enough water for each mug. Bring the water to a boil on the stove. In order to extract the tea from the bag, the water needs to be as hot as possible. If you're using a pot, you'll see bubbles on the surface of the water when it's boiling. If you're using a tea kettle, you'll hear a high-pitched whistle when the water is ready. Be very careful when you're working with boiling water. If the pot you're using has a metal handle, use a pot holder to move it so you don't burn yourself, and be very careful not to spill any on your skin. If you're a kid, ask an adult to help you boil the water for this step. You can also boil the water in the microwave if you like, but be sure to use a microwave-safe dish and place a non-metallic object like a popsicle stick into the dish so the water doesn't become super-heated and explode. Pour the hot water over the tea and allow it to steep for about 5 minutes. Carefully pour the hot water into the mug to start brewing your tea. Don't get the mug too full, or you might accidentally spill boiling water on yourself. Wait about 5 minutes for the tea to brew, or until the water turns the color you want. Try to leave about 1–2 in (2.5–5.1 cm) of space at the top of the mug. If you're trying to get a very dark color, use 2 tea bags in the mug at the same time. If you want a lighter color, 1 bag will be fine. Applying the Tea to the Paper Print or write whatever you want on the paper first. Once you stain the paper, it won't accept ink evenly, so anything you try to write or print on it will look messy. It's best to write, print, or draw whatever you'd like on the paper before you do anything else. Let the ink dry completely so it doesn’t run. Any paper will work for this, from plain white copy paper to heavier paper used for painting. Thicker papers might produce a lighter result that takes longer to dry. Some inks are more likely to run when they're wet, especially if you write with a washable marker or you print your design on an inkjet printer. If you can, use a laser printer or some sort of waterproof ink. If you can't, just try not to rub the paper when you add the tea. Hopefully this will minimize the smudging. If you like, you can also lightly crumple the paper, then smooth it out. This will make the paper look like it's been shuffled around for a number of years. To make the paper look even more worn, like for an old treasure map, tear off the edges of the paper. Lay the paper on a baking sheet. A baking sheet with a raised rim will keep the tea from spilling over the sides as you're working. The baking sheet should be a little bigger than the paper you use. For instance, if you're using an 8.5 in × 11 in (22 cm × 28 cm) sheet of paper, a 9 in × 13 in (23 cm × 33 cm) baking sheet would be perfect. Tea can stain your countertop or table, so it's important to protect your work surface. If you don't have a baking sheet that you can use, you can lay trash bags flat on your work surface instead. Dab one of the tea bags over the paper. Holding the tea bag by the top, blot it down onto the paper. Continue doing this until you've covered as much of the paper as you want. If the tea bag starts to dry out, dip it in the mug of tea to wet it again. It's up to you whether you want to cover the whole page or just a few areas. Either way, don't worry about getting a perfect application. The paper will look more authentic if the yellowing is a little uneven. Experiment with ways to get the tea on the paper. If you like, you can use a paintbrush, a straw, or even your fingers to create different effects. Flip the paper over and stain the other side. Even if you only plan on showing one side of the paper, the aging effect will look more authentic if you apply the tea to both sides of the paper. This will also make your page look darker once it’s finished. Sprinkle the page with turmeric if you want the paper to be more yellow. While this step isn't strictly necessary, adding a light coat of the spice turmeric will help yellow the effect of the tea. Use your fingers to rub the turmeric into the tea Mix in a few coffee grounds to make the paper more brown. If you want your aged paper to look like it's been exposed to the elements, you can sprinkle a few coffee grounds over the wet tea to help add more brown to the page. Rub the coffee grounds into the tea to help them stick to the paper. Loose tea leaves may work for this as well, but the effect will not be as dramatic. You can even break open one of the tea bags if you want. You'll remove the excess coffee grounds after the paper is dry. Dab away excess tea with paper towels. Make sure there isn't any water pooled on the page itself or on the baking sheet. This will ensure the page dries evenly, which will help prevent the paper from curling too much in the oven. Drying the Paper Allow the paper to air-dry for 24 hours if you're not in a hurry. While baking the paper is the fastest way to dry it, you can let it air-dry if you prefer. Just place your baking sheet in an area with plenty of air circulation. Don't dry the paper in direct sunlight, as it may become too brittle to use. Give the paper about 24 hours to air-dry. Heat your oven to the lowest setting if you want to dry the paper quickly. Baking the paper will dry it quickly, allowing you to finish your project the same day you started it. If you bake the paper too quickly, however, it will become brittle, and it may even scorch, so it's important to use the lowest heat possible. Tip: On most ovens, this is about 200 °F (93 °C). If you have a \"Warm\" setting, use that. Bake the paper for about 5 minutes. On the lowest setting, this should be enough time to evaporate the layer of tea on your paper. Keep a close eye on the paper while it's in the oven, however, since paper is highly flammable. If you used too much liquid, or if the paper is very thick, you might need to leave it in for a little longer. You can tell the paper is dry when the edges start to curl up. Use oven mitts to protect your hands when you take the baking sheet out of the oven. Brush away any residue with a soft paintbrush. You don't have to do this if you only used tea to color your paper. However, if you added turmeric or coffee grounds to affect the final shade, you should brush away anything the paper didn't absorb. A soft paint brush will remove the residue without roughing up the paper. Tip: If you don't have a paintbrush, you could use a soft, dry cloth, like a microfiber cloth, instead. Rough up the paper if it doesn't look old enough. Depending on your project, just yellowing the paper might not give it the authentic look you're going for. If you need it to look like it's been damaged, try crumpling the paper, singing it with a flame, or adding more stains or tears. For instance, if you're making an old treasure map, you might want to crumple it up and carefully burn the edges so it will look old and worn. If you want to create holes in the paper, crumple the sheet and spritz it with a little water, then use your fingernails to make small tears. Allow the paper to air dry.",
  "sentences":[
    " Brewing Your Tea Place 1-2 tea bags into a mug used for hot beverages.",
    "The amount of tea you use depends on whether you want to dye your paper a lot or a little.",
    "For most projects, 1 tea bag per sheet of paper should be plenty, but if you're just going to do a few splotches of tea, you might be able to use one bag for several sheets of paper.",
    "However, if you're planning to fully saturate the paper and you want a very dark finish, you might need 2 tea bags for each sheet.",
    "Tip: Any type of tea will work, but black tea is a common option for this project.",
    "However, you might want to avoid using green tea or tea infused with red herbs, as this will produce a different color effect and the paper might not look aged.",
    "If you use a cup that isn't intended for hot beverages, you could end up with a nasty burn.",
    "Stick to a coffee or tea cup, and avoid cups made from plastic or metal, as they aren't meant to hold boiling water.",
    "Fill a tea kettle or a small pot with water.",
    "You only need enough water to fill up a mug, or about 1 cup (240 mL), but since water evaporates as it boils, it's better to start with more than you'll need.",
    "If you'll be brewing multiple mugs of tea at the same time, make sure you have enough water for each mug.",
    "Bring the water to a boil on the stove.",
    "In order to extract the tea from the bag, the water needs to be as hot as possible.",
    "If you're using a pot, you'll see bubbles on the surface of the water when it's boiling.",
    "If you're using a tea kettle, you'll hear a high-pitched whistle when the water is ready.",
    "Be very careful when you're working with boiling water.",
    "If the pot you're using has a metal handle, use a pot holder to move it so you don't burn yourself, and be very careful not to spill any on your skin.",
    "If you're a kid, ask an adult to help you boil the water for this step.",
    "You can also boil the water in the microwave if you like, but be sure to use a microwave-safe dish and place a non-metallic object like a popsicle stick into the dish so the water doesn't become super-heated and explode.",
    "Pour the hot water over the tea and allow it to steep for about 5 minutes.",
    "Carefully pour the hot water into the mug to start brewing your tea.",
    "Don't get the mug too full, or you might accidentally spill boiling water on yourself.",
    "Wait about 5 minutes for the tea to brew, or until the water turns the color you want.",
    "Try to leave about 1–2 in (2.5–5.1 cm) of space at the top of the mug.",
    "If you're trying to get a very dark color, use 2 tea bags in the mug at the same time.",
    "If you want a lighter color, 1 bag will be fine.",
    "Applying the Tea to the Paper Print or write whatever you want on the paper first.",
    "Once you stain the paper, it won't accept ink evenly, so anything you try to write or print on it will look messy.",
    "It's best to write, print, or draw whatever you'd like on the paper before you do anything else.",
    "Let the ink dry completely so it doesn’t run.",
    "Any paper will work for this, from plain white copy paper to heavier paper used for painting.",
    "Thicker papers might produce a lighter result that takes longer to dry.",
    "Some inks are more likely to run when they're wet, especially if you write with a washable marker or you print your design on an inkjet printer.",
    "If you can, use a laser printer or some sort of waterproof ink.",
    "If you can't, just try not to rub the paper when you add the tea.",
    "Hopefully this will minimize the smudging.",
    "If you like, you can also lightly crumple the paper, then smooth it out.",
    "This will make the paper look like it's been shuffled around for a number of years.",
    "To make the paper look even more worn, like for an old treasure map, tear off the edges of the paper.",
    "Lay the paper on a baking sheet.",
    "A baking sheet with a raised rim will keep the tea from spilling over the sides as you're working.",
    "The baking sheet should be a little bigger than the paper you use.",
    "For instance, if you're using an 8.5 in × 11 in (22 cm × 28 cm) sheet of paper, a 9 in × 13 in (23 cm × 33 cm) baking sheet would be perfect.",
    "Tea can stain your countertop or table, so it's important to protect your work surface.",
    "If you don't have a baking sheet that you can use, you can lay trash bags flat on your work surface instead.",
    "Dab one of the tea bags over the paper.",
    "Holding the tea bag by the top, blot it down onto the paper.",
    "Continue doing this until you've covered as much of the paper as you want.",
    "If the tea bag starts to dry out, dip it in the mug of tea to wet it again.",
    "It's up to you whether you want to cover the whole page or just a few areas.",
    "Either way, don't worry about getting a perfect application.",
    "The paper will look more authentic if the yellowing is a little uneven.",
    "Experiment with ways to get the tea on the paper.",
    "If you like, you can use a paintbrush, a straw, or even your fingers to create different effects.",
    "Flip the paper over and stain the other side.",
    "Even if you only plan on showing one side of the paper, the aging effect will look more authentic if you apply the tea to both sides of the paper.",
    "This will also make your page look darker once it’s finished.",
    "Sprinkle the page with turmeric if you want the paper to be more yellow.",
    "While this step isn't strictly necessary, adding a light coat of the spice turmeric will help yellow the effect of the tea.",
    "Use your fingers to rub the turmeric into the tea Mix in a few coffee grounds to make the paper more brown.",
    "If you want your aged paper to look like it's been exposed to the elements, you can sprinkle a few coffee grounds over the wet tea to help add more brown to the page.",
    "Rub the coffee grounds into the tea to help them stick to the paper.",
    "Loose tea leaves may work for this as well, but the effect will not be as dramatic.",
    "You can even break open one of the tea bags if you want.",
    "You'll remove the excess coffee grounds after the paper is dry.",
    "Dab away excess tea with paper towels.",
    "Make sure there isn't any water pooled on the page itself or on the baking sheet.",
    "This will ensure the page dries evenly, which will help prevent the paper from curling too much in the oven.",
    "Drying the Paper Allow the paper to air-dry for 24 hours if you're not in a hurry.",
    "While baking the paper is the fastest way to dry it, you can let it air-dry if you prefer.",
    "Just place your baking sheet in an area with plenty of air circulation.",
    "Don't dry the paper in direct sunlight, as it may become too brittle to use.",
    "Give the paper about 24 hours to air-dry.",
    "Heat your oven to the lowest setting if you want to dry the paper quickly.",
    "Baking the paper will dry it quickly, allowing you to finish your project the same day you started it.",
    "If you bake the paper too quickly, however, it will become brittle, and it may even scorch, so it's important to use the lowest heat possible.",
    "Tip: On most ovens, this is about 200 °F (93 °C).",
    "If you have a \"Warm\" setting, use that.",
    "Bake the paper for about 5 minutes.",
    "On the lowest setting, this should be enough time to evaporate the layer of tea on your paper.",
    "Keep a close eye on the paper while it's in the oven, however, since paper is highly flammable.",
    "If you used too much liquid, or if the paper is very thick, you might need to leave it in for a little longer.",
    "You can tell the paper is dry when the edges start to curl up.",
    "Use oven mitts to protect your hands when you take the baking sheet out of the oven.",
    "Brush away any residue with a soft paintbrush.",
    "You don't have to do this if you only used tea to color your paper.",
    "However, if you added turmeric or coffee grounds to affect the final shade, you should brush away anything the paper didn't absorb.",
    "A soft paint brush will remove the residue without roughing up the paper.",
    "Tip: If you don't have a paintbrush, you could use a soft, dry cloth, like a microfiber cloth, instead.",
    "Rough up the paper if it doesn't look old enough.",
    "Depending on your project, just yellowing the paper might not give it the authentic look you're going for.",
    "If you need it to look like it's been damaged, try crumpling the paper, singing it with a flame, or adding more stains or tears.",
    "For instance, if you're making an old treasure map, you might want to crumple it up and carefully burn the edges so it will look old and worn.",
    "If you want to create holes in the paper, crumple the sheet and spritz it with a little water, then use your fingernails to make small tears.",
    "Allow the paper to air dry."
  ],
  "tyn_section":[
    "Brewing the Tea",
    "1-2 tea bags per sheet, any kind",
    "Tea kettle or pot",
    "Mug",
    "Applying the Tea",
    "Paper",
    "Turmeric (optional)",
    "Coffee grounds (optional)",
    "Baking sheet or tray",
    "Paintbrush or sponge (optional)",
    "Oven",
    "Oven mitts"
  ],
  "tyn_model":[
    "paper",
    "water",
    "tea",
    "baking sheet",
    "tea bags",
    "coffee grounds",
    "oven",
    "tea bag",
    "mug",
    "turmeric",
    "tea kettle",
    "pot",
    "small pot",
    "pot holder",
    "microwave",
    "ink",
    "inkjet printer",
    "laser printer",
    "× 11",
    "× 28",
    "× 13",
    "× 33",
    "trash bags",
    "tea leaves",
    "paper towels",
    "oven mitts"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1538461538,
    "f1":0.2105263158,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.3461538462,
    "f1":0.4556962025
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.3846153846,
    "f1":0.5263157895
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4166666667,
    "p":0.1923076923,
    "f1":0.2631578947
  }
}