{
  "title":"How to Make Almond Milk Taste Better",
  "url":"https://www.wikihow.com/Make-Almond-Milk-Taste-Better",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk"
  ],
  "methods":[
    {
      "name":"Flavoring Almond Milk",
      "steps":[
        {
          "headline":"Buy plain or unsweetened almond milk, if you are going to flavor it yourself.",
          "description":"Commercially-made chocolate or vanilla almond milk is usually fairly high in sugar content, containing more than 20 g (1.7 tbsp.) of sugar per serving."
        },
        {
          "headline":"Sweeten almond milk with maple syrup, honey, agave nectar or granulated sugar.",
          "description":"Stir in 1 tbsp. (12 g or 14.8 ml) of the sweetener for every 4 cups (0.95 l) of unsweetened almond milk. Stir very well, until the granules dissolve. Add more, if desired."
        },
        {
          "headline":"Add 1 of the following flavorings to your milk, according to the flavor you prefer.",
          "description":"Flavoring should be done to taste, starting with the measurements below. You can measure enough flavoring to mask the taste of the almond milk altogether or simply to enhance it. Pour in 1 tsp. (4.9 ml) of vanilla extract for every 4 cups (0.95 l) of almond milk. Double the amount if you prefer a strong vanilla taste. Stir well. Create a stronger almond taste by adding almond extract. Pour in 1 tsp. (4.9 ml) of almond extract for every 4 cups (0.95 l) of almond milk. Stir well. Add 1 tbsp. of sugar or agave syrup and 2 tbsp. (14 g) of cocoa powder to 4 cups (0.95 l) of unsweetened almond milk to create chocolate almond milk. Add a pinch of salt. Stir well, until everything has dissolved. Withhold the sugar if you are using plain, sweetened almond milk. Add 1 tbsp. of sugar or agave syrup, 1/2 tsp. (1.3 g) of cinnamon, 1/4 tsp. (0.5 g) of nutmeg and 1/8 tsp. (0.25 g) of cloves to 4 cups (0.95 l) of unsweetened almond milk to create chai almond milk. Do not add the sugar if you are using sweetened almond milk. Stir well. The longer you allow the spices to sit in the milk before drinking, the stronger the taste will be."
        }
      ]
    },
    {
      "name":"Fruit flavoring Almond Milk",
      "steps":[
        {
          "headline":"Pour 4 cups (0.95 l) of unsweetened almond milk into a blender.",
          "description":""
        },
        {
          "headline":"Add 2 cups (approximately 150 to 300 g) of sliced fruit to unsweetened almond milk.",
          "description":"Strawberries, mango, raspberries, blueberries and peaches work well with this recipe. Remove the seeds or pits from the fruit before adding."
        },
        {
          "headline":"Add 2 to 4 tbsp.",
          "description":"(30 to 50 ml) of agave syrup or honey into the mixture."
        },
        {
          "headline":"Add a pinch of salt, cover the blender and run it on high for 2 minutes.",
          "description":""
        },
        {
          "headline":"Strain the resulting milk through a cheesecloth and into a bowl.",
          "description":"This will remove any seeds or pulp from the fruit."
        },
        {
          "headline":"Store the milk in airtight containers in the refrigerator for up to 3 days.",
          "description":""
        }
      ]
    },
    {
      "name":"Scenting Almond Milk",
      "steps":[
        {
          "headline":"Pour 1 to 2 cups (237 to 473 ml) of almond milk into a glass jar.",
          "description":"Glass canning jars work well for this purpose. Fill the container to the top to minimize the amount of oxygen in the container."
        },
        {
          "headline":"Add 1 of the following ingredients to your jar before sealing it.",
          "description":"Break up 3 cinnamon sticks and immerse them in the milk. Bruise 1/4 cup (67 g) of fresh mint by rolling it between your fingers. Place it in the milk and stir it. Bruise 1/4 cup (67 g) of rose petals by rolling them between your fingers. Place them directly in the milk and stir them. Scrape the seeds from 1 vanilla bean into the milk. Stir them well."
        },
        {
          "headline":"Cover the milk jars so that they are airtight.",
          "description":""
        },
        {
          "headline":"Place them in the refrigerator for 1 day.",
          "description":"Remove them and remove the plant or spice particles by pouring the milk through a metal strainer. Scented almond milk will have a mild flavor of the plant or spice. The act of breathing in the scent can make the taste of the milk more pleasing. These milks are great to use on desserts, granola or in smoothies and shakes. You can also add honey or agave syrup to create a sweeter flavor in your scented milk."
        }
      ]
    }
  ],
  "text":" Flavoring Almond Milk Buy plain or unsweetened almond milk, if you are going to flavor it yourself. Commercially-made chocolate or vanilla almond milk is usually fairly high in sugar content, containing more than 20 g (1.7 tbsp.) of sugar per serving. Sweeten almond milk with maple syrup, honey, agave nectar or granulated sugar. Stir in 1 tbsp. (12 g or 14.8 ml) of the sweetener for every 4 cups (0.95 l) of unsweetened almond milk. Stir very well, until the granules dissolve. Add more, if desired. Add 1 of the following flavorings to your milk, according to the flavor you prefer. Flavoring should be done to taste, starting with the measurements below. You can measure enough flavoring to mask the taste of the almond milk altogether or simply to enhance it. Pour in 1 tsp. (4.9 ml) of vanilla extract for every 4 cups (0.95 l) of almond milk. Double the amount if you prefer a strong vanilla taste. Stir well. Create a stronger almond taste by adding almond extract. Pour in 1 tsp. (4.9 ml) of almond extract for every 4 cups (0.95 l) of almond milk. Stir well. Add 1 tbsp. of sugar or agave syrup and 2 tbsp. (14 g) of cocoa powder to 4 cups (0.95 l) of unsweetened almond milk to create chocolate almond milk. Add a pinch of salt. Stir well, until everything has dissolved. Withhold the sugar if you are using plain, sweetened almond milk. Add 1 tbsp. of sugar or agave syrup, 1/2 tsp. (1.3 g) of cinnamon, 1/4 tsp. (0.5 g) of nutmeg and 1/8 tsp. (0.25 g) of cloves to 4 cups (0.95 l) of unsweetened almond milk to create chai almond milk. Do not add the sugar if you are using sweetened almond milk. Stir well. The longer you allow the spices to sit in the milk before drinking, the stronger the taste will be. Fruit flavoring Almond Milk Pour 4 cups (0.95 l) of unsweetened almond milk into a blender.  Add 2 cups (approximately 150 to 300 g) of sliced fruit to unsweetened almond milk. Strawberries, mango, raspberries, blueberries and peaches work well with this recipe. Remove the seeds or pits from the fruit before adding. Add 2 to 4 tbsp. (30 to 50 ml) of agave syrup or honey into the mixture. Add a pinch of salt, cover the blender and run it on high for 2 minutes.  Strain the resulting milk through a cheesecloth and into a bowl. This will remove any seeds or pulp from the fruit. Store the milk in airtight containers in the refrigerator for up to 3 days.  Scenting Almond Milk Pour 1 to 2 cups (237 to 473 ml) of almond milk into a glass jar. Glass canning jars work well for this purpose. Fill the container to the top to minimize the amount of oxygen in the container. Add 1 of the following ingredients to your jar before sealing it. Break up 3 cinnamon sticks and immerse them in the milk. Bruise 1/4 cup (67 g) of fresh mint by rolling it between your fingers. Place it in the milk and stir it. Bruise 1/4 cup (67 g) of rose petals by rolling them between your fingers. Place them directly in the milk and stir them. Scrape the seeds from 1 vanilla bean into the milk. Stir them well. Cover the milk jars so that they are airtight.  Place them in the refrigerator for 1 day. Remove them and remove the plant or spice particles by pouring the milk through a metal strainer. Scented almond milk will have a mild flavor of the plant or spice. The act of breathing in the scent can make the taste of the milk more pleasing. These milks are great to use on desserts, granola or in smoothies and shakes. You can also add honey or agave syrup to create a sweeter flavor in your scented milk.",
  "sentences":[
    " Flavoring Almond Milk Buy plain or unsweetened almond milk, if you are going to flavor it yourself.",
    "Commercially-made chocolate or vanilla almond milk is usually fairly high in sugar content, containing more than 20 g (1.7 tbsp.)",
    "of sugar per serving.",
    "Sweeten almond milk with maple syrup, honey, agave nectar or granulated sugar.",
    "Stir in 1 tbsp.",
    "(12 g or 14.8 ml) of the sweetener for every 4 cups (0.95 l) of unsweetened almond milk.",
    "Stir very well, until the granules dissolve.",
    "Add more, if desired.",
    "Add 1 of the following flavorings to your milk, according to the flavor you prefer.",
    "Flavoring should be done to taste, starting with the measurements below.",
    "You can measure enough flavoring to mask the taste of the almond milk altogether or simply to enhance it.",
    "Pour in 1 tsp.",
    "(4.9 ml) of vanilla extract for every 4 cups (0.95 l) of almond milk.",
    "Double the amount if you prefer a strong vanilla taste.",
    "Stir well.",
    "Create a stronger almond taste by adding almond extract.",
    "Pour in 1 tsp.",
    "(4.9 ml) of almond extract for every 4 cups (0.95 l) of almond milk.",
    "Stir well.",
    "Add 1 tbsp.",
    "of sugar or agave syrup and 2 tbsp.",
    "(14 g) of cocoa powder to 4 cups (0.95 l) of unsweetened almond milk to create chocolate almond milk.",
    "Add a pinch of salt.",
    "Stir well, until everything has dissolved.",
    "Withhold the sugar if you are using plain, sweetened almond milk.",
    "Add 1 tbsp.",
    "of sugar or agave syrup, 1/2 tsp.",
    "(1.3 g) of cinnamon, 1/4 tsp.",
    "(0.5 g) of nutmeg and 1/8 tsp.",
    "(0.25 g) of cloves to 4 cups (0.95 l) of unsweetened almond milk to create chai almond milk.",
    "Do not add the sugar if you are using sweetened almond milk.",
    "Stir well.",
    "The longer you allow the spices to sit in the milk before drinking, the stronger the taste will be.",
    "Fruit flavoring Almond Milk Pour 4 cups (0.95 l) of unsweetened almond milk into a blender.",
    "Add 2 cups (approximately 150 to 300 g) of sliced fruit to unsweetened almond milk.",
    "Strawberries, mango, raspberries, blueberries and peaches work well with this recipe.",
    "Remove the seeds or pits from the fruit before adding.",
    "Add 2 to 4 tbsp.",
    "(30 to 50 ml) of agave syrup or honey into the mixture.",
    "Add a pinch of salt, cover the blender and run it on high for 2 minutes.",
    "Strain the resulting milk through a cheesecloth and into a bowl.",
    "This will remove any seeds or pulp from the fruit.",
    "Store the milk in airtight containers in the refrigerator for up to 3 days.",
    "Scenting Almond Milk Pour 1 to 2 cups (237 to 473 ml) of almond milk into a glass jar.",
    "Glass canning jars work well for this purpose.",
    "Fill the container to the top to minimize the amount of oxygen in the container.",
    "Add 1 of the following ingredients to your jar before sealing it.",
    "Break up 3 cinnamon sticks and immerse them in the milk.",
    "Bruise 1/4 cup (67 g) of fresh mint by rolling it between your fingers.",
    "Place it in the milk and stir it.",
    "Bruise 1/4 cup (67 g) of rose petals by rolling them between your fingers.",
    "Place them directly in the milk and stir them.",
    "Scrape the seeds from 1 vanilla bean into the milk.",
    "Stir them well.",
    "Cover the milk jars so that they are airtight.",
    "Place them in the refrigerator for 1 day.",
    "Remove them and remove the plant or spice particles by pouring the milk through a metal strainer.",
    "Scented almond milk will have a mild flavor of the plant or spice.",
    "The act of breathing in the scent can make the taste of the milk more pleasing.",
    "These milks are great to use on desserts, granola or in smoothies and shakes.",
    "You can also add honey or agave syrup to create a sweeter flavor in your scented milk."
  ],
  "tyn_section":[
    "Plain or unsweetened almond milk",
    "Vanilla extract",
    "Cocoa powder",
    "Sugar",
    "Unsweetened cocoa powder",
    "Measuring spoons",
    "Large spoon",
    "Fruit",
    "Blender",
    "Agave syrup, honey or maple syrup",
    "Almond extract",
    "Cheesecloth",
    "Glass jars",
    "Salt",
    "Cinnamon (ground and sticks)",
    "Ground nutmeg",
    "Ground clove",
    "Fresh mint",
    "Rose petals",
    "Mesh strainer",
    "Vanilla bean"
  ],
  "tyn_model":[
    "almond milk",
    "milk",
    "unsweetened almond milk",
    "sugar",
    "honey",
    "almond extract",
    "salt",
    "agave syrup",
    "blender",
    "refrigerator",
    "maple syrup",
    "agave nectar",
    "granulated sugar",
    "sweetener",
    "vanilla extract",
    "sugar or agave syrup",
    "cocoa powder",
    "chocolate almond milk",
    "cinnamon",
    "nutmeg",
    "cloves",
    "chai almond milk",
    "sweetened almond milk",
    "strawberries",
    "mango",
    "raspberries",
    "blueberries",
    "peaches",
    "bowl",
    "scenting almond milk",
    "glass jar",
    "glass canning jars",
    "cinnamon sticks",
    "fresh mint",
    "rose petals",
    "vanilla bean",
    "milk jars",
    "strainer",
    "granola"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.2307692308,
    "f1":0.3,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.358974359,
    "f1":0.4666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.6153846154,
    "f1":0.6611570248
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5238095238,
    "p":0.2564102564,
    "f1":0.3442879499
  }
}