{
  "title":"How to Keep Guacamole Fresh",
  "url":"https://www.wikihow.com/Keep-Guacamole-Fresh",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Dips"
  ],
  "methods":[
    {
      "name":"Using Sour Cream",
      "steps":[
        {
          "headline":"Transfer the guacamole to the smallest bowl it will fit in.",
          "description":"Try to leave no more than ½ inch (1.27 centimeters) of space between the guacamole and the bowl's rim."
        },
        {
          "headline":"Smooth out the surface of the guacamole with a spoon, making it as flat as possible.",
          "description":"This will make it easier to spread the sour cream on top—and scrape the sour cream off later."
        },
        {
          "headline":"Spread a thin layer of sour cream over the surface of the guacamole.",
          "description":"Keep adding the sour cream until you can't see the guacamole anymore. The sour cream will create a \"seal\" between the guacamole the air and keep it from turning brown."
        },
        {
          "headline":"Wrap a sheet of plastic wrap over the sour cream.",
          "description":"Smooth it out until it is pressed flat against the sour cream. Wrap the excess plastic wrap against the sides of the bowl to improve the seal. This will help keep the sour cream itself fresh."
        },
        {
          "headline":"Store the guacamole in the fridge until you are ready to eat it.",
          "description":"It will taste better if you eat it later that day, but the guacamole can stay fresh for up to three days. When you are ready to eat the guacamole, scrape the soul cream off, or stir it in for a creamier dip."
        }
      ]
    },
    {
      "name":"Using Water",
      "steps":[
        {
          "headline":"Transfer the guacamole into a container with a tight-fitting lid.",
          "description":"Make sure that there is about 1 inch (2.54 centimeters) of space between the guacamole and the rim of the container. Try to pack the guacamole as tightly as you can so that there are no air bubbles."
        },
        {
          "headline":"Smooth the surface of the guacamole.",
          "description":"You can use the bowl of a spoon or a spatula. Make sure that there are no bumps, ridges, or ripples."
        },
        {
          "headline":"Add about ½ inch of lukewarm water.",
          "description":"The water will create a perfect seal between the guacamole and oxygen, which is what causes this tasty dip to brown. Don't worry, the water won't soak into the guacamole. Avocadoes have a very high fat content, which helps them repel water."
        },
        {
          "headline":"Cover the container with the lid, and put it into the fridge.",
          "description":"The guacamole will be good for up to three days."
        },
        {
          "headline":"Pour the water out when you are ready to use the guacamole.",
          "description":"If you need to, give the guacamole a quick stir. This will help blend in any excess moisture into the rest of the guacamole."
        }
      ]
    },
    {
      "name":"Using Plastic Wrap",
      "steps":[
        {
          "headline":"Transfer the guacamole to the smallest bowl it will fit in.",
          "description":"Try to leave no more than ½ inch (1.27 centimeters) of space between the guacamole and the bowl's rim."
        },
        {
          "headline":"Smooth out the surface of the guacamole with a spoon, making it as flat as possible.",
          "description":"This will make it easier to spread the sour cream on top—and scrape the sour cream off later."
        },
        {
          "headline":"Consider sprinkling some lime juice, lemon juice, or olive oil over the surface of the guacamole.",
          "description":"This will help give you an additional barrier between the air (which turns guacamole brown) and the guacamole. It will also give your guacamole extra flavor."
        },
        {
          "headline":"Smooth a sheet of plastic wrap over the guacamole.",
          "description":"Place a sheet of plastic wrap over the bowl. Using your fingers, smooth the plastic down until it is pressing against the entire surface of the guacamole. The plastic wrap will create a sort of seal between the air and the guacamole."
        },
        {
          "headline":"Wrap the excess plastic wrap over the edges of the bowl.",
          "description":"If you want, you can place a tight-fitting lid over the bowl. You can also wrap a rubber band around the sides of the bowl to secure the plastic wrap."
        },
        {
          "headline":"Store the guacamole in the fridge until you are ready to eat it.",
          "description":"It will taste the best if you eat it the same day, but guacamole can last for up to three or four days in the fridge."
        }
      ]
    }
  ],
  "text":" Using Sour Cream Transfer the guacamole to the smallest bowl it will fit in. Try to leave no more than ½ inch (1.27 centimeters) of space between the guacamole and the bowl's rim. Smooth out the surface of the guacamole with a spoon, making it as flat as possible. This will make it easier to spread the sour cream on top—and scrape the sour cream off later. Spread a thin layer of sour cream over the surface of the guacamole. Keep adding the sour cream until you can't see the guacamole anymore. The sour cream will create a \"seal\" between the guacamole the air and keep it from turning brown. Wrap a sheet of plastic wrap over the sour cream. Smooth it out until it is pressed flat against the sour cream. Wrap the excess plastic wrap against the sides of the bowl to improve the seal. This will help keep the sour cream itself fresh. Store the guacamole in the fridge until you are ready to eat it. It will taste better if you eat it later that day, but the guacamole can stay fresh for up to three days. When you are ready to eat the guacamole, scrape the soul cream off, or stir it in for a creamier dip. Using Water Transfer the guacamole into a container with a tight-fitting lid. Make sure that there is about 1 inch (2.54 centimeters) of space between the guacamole and the rim of the container. Try to pack the guacamole as tightly as you can so that there are no air bubbles. Smooth the surface of the guacamole. You can use the bowl of a spoon or a spatula. Make sure that there are no bumps, ridges, or ripples. Add about ½ inch of lukewarm water. The water will create a perfect seal between the guacamole and oxygen, which is what causes this tasty dip to brown. Don't worry, the water won't soak into the guacamole. Avocadoes have a very high fat content, which helps them repel water. Cover the container with the lid, and put it into the fridge. The guacamole will be good for up to three days. Pour the water out when you are ready to use the guacamole. If you need to, give the guacamole a quick stir. This will help blend in any excess moisture into the rest of the guacamole. Using Plastic Wrap Transfer the guacamole to the smallest bowl it will fit in. Try to leave no more than ½ inch (1.27 centimeters) of space between the guacamole and the bowl's rim. Smooth out the surface of the guacamole with a spoon, making it as flat as possible. This will make it easier to spread the sour cream on top—and scrape the sour cream off later. Consider sprinkling some lime juice, lemon juice, or olive oil over the surface of the guacamole. This will help give you an additional barrier between the air (which turns guacamole brown) and the guacamole. It will also give your guacamole extra flavor. Smooth a sheet of plastic wrap over the guacamole. Place a sheet of plastic wrap over the bowl. Using your fingers, smooth the plastic down until it is pressing against the entire surface of the guacamole. The plastic wrap will create a sort of seal between the air and the guacamole. Wrap the excess plastic wrap over the edges of the bowl. If you want, you can place a tight-fitting lid over the bowl. You can also wrap a rubber band around the sides of the bowl to secure the plastic wrap. Store the guacamole in the fridge until you are ready to eat it. It will taste the best if you eat it the same day, but guacamole can last for up to three or four days in the fridge.",
  "sentences":[
    " Using Sour Cream Transfer the guacamole to the smallest bowl it will fit in.",
    "Try to leave no more than ½ inch (1.27 centimeters) of space between the guacamole and the bowl's rim.",
    "Smooth out the surface of the guacamole with a spoon, making it as flat as possible.",
    "This will make it easier to spread the sour cream on top—and scrape the sour cream off later.",
    "Spread a thin layer of sour cream over the surface of the guacamole.",
    "Keep adding the sour cream until you can't see the guacamole anymore.",
    "The sour cream will create a \"seal\" between the guacamole the air and keep it from turning brown.",
    "Wrap a sheet of plastic wrap over the sour cream.",
    "Smooth it out until it is pressed flat against the sour cream.",
    "Wrap the excess plastic wrap against the sides of the bowl to improve the seal.",
    "This will help keep the sour cream itself fresh.",
    "Store the guacamole in the fridge until you are ready to eat it.",
    "It will taste better if you eat it later that day, but the guacamole can stay fresh for up to three days.",
    "When you are ready to eat the guacamole, scrape the soul cream off, or stir it in for a creamier dip.",
    "Using Water Transfer the guacamole into a container with a tight-fitting lid.",
    "Make sure that there is about 1 inch (2.54 centimeters) of space between the guacamole and the rim of the container.",
    "Try to pack the guacamole as tightly as you can so that there are no air bubbles.",
    "Smooth the surface of the guacamole.",
    "You can use the bowl of a spoon or a spatula.",
    "Make sure that there are no bumps, ridges, or ripples.",
    "Add about ½ inch of lukewarm water.",
    "The water will create a perfect seal between the guacamole and oxygen, which is what causes this tasty dip to brown.",
    "Don't worry, the water won't soak into the guacamole.",
    "Avocadoes have a very high fat content, which helps them repel water.",
    "Cover the container with the lid, and put it into the fridge.",
    "The guacamole will be good for up to three days.",
    "Pour the water out when you are ready to use the guacamole.",
    "If you need to, give the guacamole a quick stir.",
    "This will help blend in any excess moisture into the rest of the guacamole.",
    "Using Plastic Wrap Transfer the guacamole to the smallest bowl it will fit in.",
    "Try to leave no more than ½ inch (1.27 centimeters) of space between the guacamole and the bowl's rim.",
    "Smooth out the surface of the guacamole with a spoon, making it as flat as possible.",
    "This will make it easier to spread the sour cream on top—and scrape the sour cream off later.",
    "Consider sprinkling some lime juice, lemon juice, or olive oil over the surface of the guacamole.",
    "This will help give you an additional barrier between the air (which turns guacamole brown) and the guacamole.",
    "It will also give your guacamole extra flavor.",
    "Smooth a sheet of plastic wrap over the guacamole.",
    "Place a sheet of plastic wrap over the bowl.",
    "Using your fingers, smooth the plastic down until it is pressing against the entire surface of the guacamole.",
    "The plastic wrap will create a sort of seal between the air and the guacamole.",
    "Wrap the excess plastic wrap over the edges of the bowl.",
    "If you want, you can place a tight-fitting lid over the bowl.",
    "You can also wrap a rubber band around the sides of the bowl to secure the plastic wrap.",
    "Store the guacamole in the fridge until you are ready to eat it.",
    "It will taste the best if you eat it the same day, but guacamole can last for up to three or four days in the fridge."
  ],
  "tyn_section":[
    "Small bowl",
    "Plastic wrap",
    "Sour cream",
    "Lid",
    "Water",
    "Lid or rubber band (optional)"
  ],
  "tyn_model":[
    "sour cream",
    "plastic wrap",
    "bowl",
    "water",
    "spoon",
    "cream",
    "—and",
    "container",
    "using sour",
    "spatula",
    "avocadoes",
    "fridge",
    "lime juice",
    "lemon juice",
    "olive oil",
    "plastic",
    "rubber band",
    "guacamole"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1666666667,
    "f1":0.25,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.3333333333,
    "f1":0.4444444444
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.4444444444,
    "f1":0.5797101449
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1666666667,
    "f1":0.25
  }
}