{
  "title":"How to Make a Tortillon",
  "url":"https://www.wikihow.com/Make-a-Tortillon",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Coloring and Shading"
  ],
  "parts":[
    {
      "name":"Preparing Your Tortillon",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"To create the tortillon, you will need a blank piece of copy paper (recommended size A4) a ruler, a pencil and a pair of scissors. You will be able to create two usable tortillons for every one piece of copy paper you prepare. A4 paper is 210mm wide and 297mm long (approximately 8 1/4 x 11 3/4 inches.)"
        },
        {
          "headline":"Draw a straight line.",
          "description":"To do this, measure 1” down the side of your paper and mark it with your pencil. Flip your paper and measure 1” down on the other side. Connect your ruler between the two pencil markings and draw your straight line."
        },
        {
          "headline":"Cut your paper.",
          "description":"Following the straight line you’ve drawn down the center of your paper, cut the paper into two halves. To learn how to cut a straight line on paper using scissors, read this article."
        }
      ]
    },
    {
      "name":"Creating Your Tortillon",
      "steps":[
        {
          "headline":"Roll your paper.",
          "description":"Grasp the narrowest end of your paper in your hands. Roll the paper evenly and medium tightly towards the other edge of the paper. Be careful not to roll too tightly, as this can result in a more finely tipped tortillon. If you are struggling to roll your tortillon, try positioning it on a flat surface and rolling it using a similar motion to that of a rolling pin. Don’t worry if you struggle for a while; creating a usable tortillon takes time and practice."
        },
        {
          "headline":"Form the pencil shape.",
          "description":"To accomplish this, you will need a thick wire, knitting needle or something similarly sized and shaped. Using your tool, push the center of the tortillon out until it has assumed the shape of a pencil."
        },
        {
          "headline":"Secure the tortillon.",
          "description":"Take a small piece of tape and use it to reinforce the tortillon. Make sure to trim any extra paper or tape from the top, as this will get in the way of blending and could potentially ruin your shading."
        }
      ]
    },
    {
      "name":"Maintaining Your Tortillon",
      "steps":[
        {
          "headline":"Clean your tortillon.",
          "description":"Tortillons will last for a long time, provided you care for them. To clean your tortillon, rub it against a rough surface until the outer layer is scraped off. Medium sandpaper is a great tool for cleaning your tortillon. When blending lighter areas, use a clean tortillon. When blending darker areas, use a dirty tortillon."
        },
        {
          "headline":"Trim the frayed paper.",
          "description":"Using craft scissors, clean off the excess paper from your tortillon. Go slowly, and try to recreate the rounded point you had after initially creating the tortillon."
        },
        {
          "headline":"Organize tortillons by color.",
          "description":"If you continuously clean your tortillons, you will find they have a much shorter shelf life. To avoid this, try organizing your tortillons by the color lead they have on them. If you continue to use the correct shade of tortillon when you are blending, you will not have to clean them as often and the tortillon will last much longer."
        }
      ]
    }
  ],
  "text":" Preparing Your Tortillon Gather your supplies. To create the tortillon, you will need a blank piece of copy paper (recommended size A4) a ruler, a pencil and a pair of scissors. You will be able to create two usable tortillons for every one piece of copy paper you prepare. A4 paper is 210mm wide and 297mm long (approximately 8 1/4 x 11 3/4 inches.) Draw a straight line. To do this, measure 1” down the side of your paper and mark it with your pencil. Flip your paper and measure 1” down on the other side. Connect your ruler between the two pencil markings and draw your straight line. Cut your paper. Following the straight line you’ve drawn down the center of your paper, cut the paper into two halves. To learn how to cut a straight line on paper using scissors, read this article. Creating Your Tortillon Roll your paper. Grasp the narrowest end of your paper in your hands. Roll the paper evenly and medium tightly towards the other edge of the paper. Be careful not to roll too tightly, as this can result in a more finely tipped tortillon. If you are struggling to roll your tortillon, try positioning it on a flat surface and rolling it using a similar motion to that of a rolling pin. Don’t worry if you struggle for a while; creating a usable tortillon takes time and practice. Form the pencil shape. To accomplish this, you will need a thick wire, knitting needle or something similarly sized and shaped. Using your tool, push the center of the tortillon out until it has assumed the shape of a pencil. Secure the tortillon. Take a small piece of tape and use it to reinforce the tortillon. Make sure to trim any extra paper or tape from the top, as this will get in the way of blending and could potentially ruin your shading. Maintaining Your Tortillon Clean your tortillon. Tortillons will last for a long time, provided you care for them. To clean your tortillon, rub it against a rough surface until the outer layer is scraped off. Medium sandpaper is a great tool for cleaning your tortillon. When blending lighter areas, use a clean tortillon. When blending darker areas, use a dirty tortillon. Trim the frayed paper. Using craft scissors, clean off the excess paper from your tortillon. Go slowly, and try to recreate the rounded point you had after initially creating the tortillon. Organize tortillons by color. If you continuously clean your tortillons, you will find they have a much shorter shelf life. To avoid this, try organizing your tortillons by the color lead they have on them. If you continue to use the correct shade of tortillon when you are blending, you will not have to clean them as often and the tortillon will last much longer.",
  "sentences":[
    " Preparing Your Tortillon Gather your supplies.",
    "To create the tortillon, you will need a blank piece of copy paper (recommended size A4) a ruler, a pencil and a pair of scissors.",
    "You will be able to create two usable tortillons for every one piece of copy paper you prepare.",
    "A4 paper is 210mm wide and 297mm long (approximately 8 1/4 x 11 3/4 inches.)",
    "Draw a straight line.",
    "To do this, measure 1” down the side of your paper and mark it with your pencil.",
    "Flip your paper and measure 1” down on the other side.",
    "Connect your ruler between the two pencil markings and draw your straight line.",
    "Cut your paper.",
    "Following the straight line you’ve drawn down the center of your paper, cut the paper into two halves.",
    "To learn how to cut a straight line on paper using scissors, read this article.",
    "Creating Your Tortillon Roll your paper.",
    "Grasp the narrowest end of your paper in your hands.",
    "Roll the paper evenly and medium tightly towards the other edge of the paper.",
    "Be careful not to roll too tightly, as this can result in a more finely tipped tortillon.",
    "If you are struggling to roll your tortillon, try positioning it on a flat surface and rolling it using a similar motion to that of a rolling pin.",
    "Don’t worry if you struggle for a while; creating a usable tortillon takes time and practice.",
    "Form the pencil shape.",
    "To accomplish this, you will need a thick wire, knitting needle or something similarly sized and shaped.",
    "Using your tool, push the center of the tortillon out until it has assumed the shape of a pencil.",
    "Secure the tortillon.",
    "Take a small piece of tape and use it to reinforce the tortillon.",
    "Make sure to trim any extra paper or tape from the top, as this will get in the way of blending and could potentially ruin your shading.",
    "Maintaining Your Tortillon Clean your tortillon.",
    "Tortillons will last for a long time, provided you care for them.",
    "To clean your tortillon, rub it against a rough surface until the outer layer is scraped off.",
    "Medium sandpaper is a great tool for cleaning your tortillon.",
    "When blending lighter areas, use a clean tortillon.",
    "When blending darker areas, use a dirty tortillon.",
    "Trim the frayed paper.",
    "Using craft scissors, clean off the excess paper from your tortillon.",
    "Go slowly, and try to recreate the rounded point you had after initially creating the tortillon.",
    "Organize tortillons by color.",
    "If you continuously clean your tortillons, you will find they have a much shorter shelf life.",
    "To avoid this, try organizing your tortillons by the color lead they have on them.",
    "If you continue to use the correct shade of tortillon when you are blending, you will not have to clean them as often and the tortillon will last much longer."
  ],
  "tyn_section":[
    "A Piece of Paper (A4 is recommended)",
    "Ruler",
    "Pencil",
    "Tape",
    "Scissors",
    "Slim Knitting Needle/Wide Wire",
    "Craft Scissors"
  ],
  "tyn_model":[
    "paper",
    "tortillon",
    "pencil",
    "tortillons",
    "ruler",
    "scissors",
    "” down",
    "copy paper",
    "a4 paper",
    "rolling pin",
    "thick wire",
    "knitting needle",
    "tape",
    "sandpaper",
    "craft scissors"
  ],
  "simple_metrics":{
    "r":0.7142857143,
    "p":0.3333333333,
    "f1":0.4545454545,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.3333333333,
    "f1":0.4545454545
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.3333333333,
    "f1":0.4545454545
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.3333333333,
    "f1":0.4545454545
  }
}