{
  "title":"How to Build an LED Camcorder Light",
  "url":"https://www.wikihow.com/Build-an-LED-Camcorder-Light",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographic DIY"
  ],
  "steps":[
    {
      "headline":"Collect the items needed to complete this project.",
      "description":"These are listed below under \"Things You'll Need\"."
    },
    {
      "headline":"Find some suitable elasticized fabric.",
      "description":""
    },
    {
      "headline":"Measure the circumference of the camcorder lens or whatever mounting point the light will attach to.",
      "description":"Then measure the same for the elasticized fabric. Cut the elastic to the measurement. Be sure to add a couple centimeters or inches to your measurement to compensate for overlap."
    },
    {
      "headline":"Using the glue gun, put a dollop of glue on the edge of the elastic strip.",
      "description":"Overlap the two edges while forming a circle."
    },
    {
      "headline":"Hold this in place till glue hardens, approximately 20 seconds.",
      "description":""
    },
    {
      "headline":"Follow this wiring diagram for the next steps.",
      "description":"Note that the colourful stripes on a resistor denote its value. For a 470 ohm the stripes on the left side of the resistor are yellow, purple, black, black and on the right side brown. When measuring out the wires, make you have enough slack to make it around the whole lens and then some."
    },
    {
      "headline":"Please read the \"Warnings\" section below before continuing with the next steps.",
      "description":""
    },
    {
      "headline":"Plan out the light circuit before soldering.",
      "description":""
    },
    {
      "headline":"Solder the resistor to the positive terminal on the first LED.",
      "description":"Continue to solder the link from the negative terminal on the first LED to the positive terminal on the second LED. This is the series circuit. Repeat this for all the series circuits, there are three. Refer back to the wiring diagram."
    },
    {
      "headline":"Test the circuits by touching the positive lead (the end with the resistor) to the positive side of the battery and the negative lead (the negative side of the second LED) to the negative side of the battery.",
      "description":"If the light comes on, the lights are wired properly. If they do not, check your solder connections."
    },
    {
      "headline":"Solder on the wires (see \"Things You'll Need\" below for sizing).",
      "description":""
    },
    {
      "headline":"Cover all the connections in glue to prevent the electrical components from touching and arcing.",
      "description":"This will also weatherproof your light."
    },
    {
      "headline":"Glue the three sets of lights equally around the elastic strap that you created earlier.",
      "description":""
    },
    {
      "headline":"Combine all the wires coming from the light circuits (there should be 3 positive wires and 3 negative wires).",
      "description":"With these wires striped twist them into each set of three into one. Now there should be two wires. This completes your series circuit."
    },
    {
      "headline":"Solder the negative wire to the negative end of the battery connector.",
      "description":""
    },
    {
      "headline":"Solder the positive end to one end of the switch.",
      "description":"Refer to the picture in step 14."
    },
    {
      "headline":"Solder the positive wire of the battery connector to the other end of the switch.",
      "description":"Refer to the picture in step 14."
    },
    {
      "headline":"Test the soldering by plugging in the battery and turning on the switch.",
      "description":"All the lights should illuminate. If not, double check your soldering."
    },
    {
      "headline":"Cover all the connections in glue for weather proofing.",
      "description":"Allow to dry."
    },
    {
      "headline":"Try it out!",
      "description":""
    }
  ],
  "text":" Collect the items needed to complete this project. These are listed below under \"Things You'll Need\". Find some suitable elasticized fabric.  Measure the circumference of the camcorder lens or whatever mounting point the light will attach to. Then measure the same for the elasticized fabric. Cut the elastic to the measurement. Be sure to add a couple centimeters or inches to your measurement to compensate for overlap. Using the glue gun, put a dollop of glue on the edge of the elastic strip. Overlap the two edges while forming a circle. Hold this in place till glue hardens, approximately 20 seconds.  Follow this wiring diagram for the next steps. Note that the colourful stripes on a resistor denote its value. For a 470 ohm the stripes on the left side of the resistor are yellow, purple, black, black and on the right side brown. When measuring out the wires, make you have enough slack to make it around the whole lens and then some. Please read the \"Warnings\" section below before continuing with the next steps.  Plan out the light circuit before soldering.  Solder the resistor to the positive terminal on the first LED. Continue to solder the link from the negative terminal on the first LED to the positive terminal on the second LED. This is the series circuit. Repeat this for all the series circuits, there are three. Refer back to the wiring diagram. Test the circuits by touching the positive lead (the end with the resistor) to the positive side of the battery and the negative lead (the negative side of the second LED) to the negative side of the battery. If the light comes on, the lights are wired properly. If they do not, check your solder connections. Solder on the wires (see \"Things You'll Need\" below for sizing).  Cover all the connections in glue to prevent the electrical components from touching and arcing. This will also weatherproof your light. Glue the three sets of lights equally around the elastic strap that you created earlier.  Combine all the wires coming from the light circuits (there should be 3 positive wires and 3 negative wires). With these wires striped twist them into each set of three into one. Now there should be two wires. This completes your series circuit. Solder the negative wire to the negative end of the battery connector.  Solder the positive end to one end of the switch. Refer to the picture in step 14. Solder the positive wire of the battery connector to the other end of the switch. Refer to the picture in step 14. Test the soldering by plugging in the battery and turning on the switch. All the lights should illuminate. If not, double check your soldering. Cover all the connections in glue for weather proofing. Allow to dry. Try it out! ",
  "sentences":[
    " Collect the items needed to complete this project.",
    "These are listed below under \"Things You'll Need\".",
    "Find some suitable elasticized fabric.",
    "Measure the circumference of the camcorder lens or whatever mounting point the light will attach to.",
    "Then measure the same for the elasticized fabric.",
    "Cut the elastic to the measurement.",
    "Be sure to add a couple centimeters or inches to your measurement to compensate for overlap.",
    "Using the glue gun, put a dollop of glue on the edge of the elastic strip.",
    "Overlap the two edges while forming a circle.",
    "Hold this in place till glue hardens, approximately 20 seconds.",
    "Follow this wiring diagram for the next steps.",
    "Note that the colourful stripes on a resistor denote its value.",
    "For a 470 ohm the stripes on the left side of the resistor are yellow, purple, black, black and on the right side brown.",
    "When measuring out the wires, make you have enough slack to make it around the whole lens and then some.",
    "Please read the \"Warnings\" section below before continuing with the next steps.",
    "Plan out the light circuit before soldering.",
    "Solder the resistor to the positive terminal on the first LED.",
    "Continue to solder the link from the negative terminal on the first LED to the positive terminal on the second LED.",
    "This is the series circuit.",
    "Repeat this for all the series circuits, there are three.",
    "Refer back to the wiring diagram.",
    "Test the circuits by touching the positive lead (the end with the resistor) to the positive side of the battery and the negative lead (the negative side of the second LED) to the negative side of the battery.",
    "If the light comes on, the lights are wired properly.",
    "If they do not, check your solder connections.",
    "Solder on the wires (see \"Things You'll Need\" below for sizing).",
    "Cover all the connections in glue to prevent the electrical components from touching and arcing.",
    "This will also weatherproof your light.",
    "Glue the three sets of lights equally around the elastic strap that you created earlier.",
    "Combine all the wires coming from the light circuits (there should be 3 positive wires and 3 negative wires).",
    "With these wires striped twist them into each set of three into one.",
    "Now there should be two wires.",
    "This completes your series circuit.",
    "Solder the negative wire to the negative end of the battery connector.",
    "Solder the positive end to one end of the switch.",
    "Refer to the picture in step 14.",
    "Solder the positive wire of the battery connector to the other end of the switch.",
    "Refer to the picture in step 14.",
    "Test the soldering by plugging in the battery and turning on the switch.",
    "All the lights should illuminate.",
    "If not, double check your soldering.",
    "Cover all the connections in glue for weather proofing.",
    "Allow to dry.",
    "Try it out!"
  ],
  "tyn_section":[
    "6-3v 20mA LED s3-470 ohm resistors",
    "3-small connector wires (connection between first and second LEDs)",
    "Length of wire (preferably red for positive black for negative)",
    "Length of elastic or elasticized fabric",
    "Small switch",
    "Battery connector",
    "9v battery",
    "Soldering iron",
    "Solder glue gun with glue",
    "Protective gear when soldering"
  ],
  "tyn_model":[
    "glue",
    "resistor",
    "elastic",
    "solder",
    "camcorder lens",
    "glue gun",
    "wiring diagram",
    "battery",
    "soldering"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.3333333333,
    "f1":0.3636363636
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.3333333333,
    "f1":0.3636363636
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}