{
  "title":"How to Use a Light Meter",
  "url":"https://www.wikihow.com/Use-a-Light-Meter",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "parts":[
    {
      "name":"Setting up the Light Meter",
      "steps":[
        {
          "headline":"Prepare your camera.",
          "description":"Go into the settings of your camera and set it to manual mode, if it isn't in that mode already. Set your camera to your preferred ISO and aperture settings. You'll need to do some experimenting with both of these settings to find the ideal settings for the photo you're trying to get. The ISO setting determines your camera's sensitivity to light. The higher the ISO, the more sensitivity to light. Generally, lower ISO settings produce clearer pictures while a higher ISO will cause graininess, but there are some scenarios where you'll need a higher ISO, such as when shooting a subject in motion. The aperture setting changes the size of the lens, and therefore how much light the camera lets in. This setting is describes using the unit f/stops. A larger aperture number, like f/11, means a smaller lens size, and a smaller number, like f/1.4, means a larger lens size. Aperture affects your photos' depth of field and shutter speed."
        },
        {
          "headline":"Input the ISO number and aperture into the light meter.",
          "description":"For whatever ISO your camera is set at, input that number into the allocated spot on the light meter. Do the same with the aperture that your camera is set at."
        },
        {
          "headline":"Prepare the sensor of the light meter.",
          "description":"Depending on what light meter you are using, you may need to twist the knob around the white dome on your light meter to prepare it. This is the sensor of the light meter."
        },
        {
          "headline":"Set your light meter to the appropriate mode.",
          "description":"Most light meters have two modes, one for ambient light and one for flash. If you're going to be using the flash of your camera, set it to that mode, and if not, use ambient."
        }
      ]
    },
    {
      "name":"Using the Light Meter",
      "steps":[
        {
          "headline":"Hold the camera up to your eye.",
          "description":"Look through the viewfinder and focus on your intended subject."
        },
        {
          "headline":"Place the light meter out in front of you or have a friend hold it at the distance of the subject of the photo.",
          "description":"If you are taking a photo of a person, have the person hold the meter up to his or her chin. This pulls the light reading from the exact spot you want in correct exposure."
        },
        {
          "headline":"Aim the sensor of the light meter at the camera.",
          "description":"The sensor is the white dome-shaped area of the meter. It is often on a swiveling or rotating head. Point it straight at the lens of the camera for the best results."
        },
        {
          "headline":"Press the measure button on the light sensor.",
          "description":"This will measure the amount of light falling on the subject."
        },
        {
          "headline":"Fire the flash on the camera.",
          "description":"If you're using your flash to capture your subject, and you've set your light meter to flash mode, you'll need to hit the measure button while the camera is flashing. The meter will evaluate the degree of light from the flash and determine the correct aperture and shutter speed for the subject."
        },
        {
          "headline":"Find the camera settings that the light meter reads out.",
          "description":"After hitting the measure button, most light meters will allow you to then scroll through the combinations of shutter speeds and apertures that are appropriate for the amount of light measured."
        },
        {
          "headline":"Select the appropriate settings on the camera.",
          "description":"The meter supplied you with aperture and shutter speed readings for correct exposure of the photograph based on the light at the location of the subject. Go to the settings in your camera and input the numbers provided by your light meter into your camera. Adjust the numbers from the light meter to achieve alternative image results. Input a higher aperture (a lower f-stop number) for an image that reveals more light. A lower aperture (a higher f number) will darken the image. You can also alter the shutter speed, which allows more light in with a slower speed and increases potential blurring of any moving things in the scene."
        }
      ]
    }
  ],
  "text":" Setting up the Light Meter Prepare your camera. Go into the settings of your camera and set it to manual mode, if it isn't in that mode already. Set your camera to your preferred ISO and aperture settings. You'll need to do some experimenting with both of these settings to find the ideal settings for the photo you're trying to get. The ISO setting determines your camera's sensitivity to light. The higher the ISO, the more sensitivity to light. Generally, lower ISO settings produce clearer pictures while a higher ISO will cause graininess, but there are some scenarios where you'll need a higher ISO, such as when shooting a subject in motion. The aperture setting changes the size of the lens, and therefore how much light the camera lets in. This setting is describes using the unit f/stops. A larger aperture number, like f/11, means a smaller lens size, and a smaller number, like f/1.4, means a larger lens size. Aperture affects your photos' depth of field and shutter speed. Input the ISO number and aperture into the light meter. For whatever ISO your camera is set at, input that number into the allocated spot on the light meter. Do the same with the aperture that your camera is set at. Prepare the sensor of the light meter. Depending on what light meter you are using, you may need to twist the knob around the white dome on your light meter to prepare it. This is the sensor of the light meter. Set your light meter to the appropriate mode. Most light meters have two modes, one for ambient light and one for flash. If you're going to be using the flash of your camera, set it to that mode, and if not, use ambient. Using the Light Meter Hold the camera up to your eye. Look through the viewfinder and focus on your intended subject. Place the light meter out in front of you or have a friend hold it at the distance of the subject of the photo. If you are taking a photo of a person, have the person hold the meter up to his or her chin. This pulls the light reading from the exact spot you want in correct exposure. Aim the sensor of the light meter at the camera. The sensor is the white dome-shaped area of the meter. It is often on a swiveling or rotating head. Point it straight at the lens of the camera for the best results. Press the measure button on the light sensor. This will measure the amount of light falling on the subject. Fire the flash on the camera. If you're using your flash to capture your subject, and you've set your light meter to flash mode, you'll need to hit the measure button while the camera is flashing. The meter will evaluate the degree of light from the flash and determine the correct aperture and shutter speed for the subject. Find the camera settings that the light meter reads out. After hitting the measure button, most light meters will allow you to then scroll through the combinations of shutter speeds and apertures that are appropriate for the amount of light measured. Select the appropriate settings on the camera. The meter supplied you with aperture and shutter speed readings for correct exposure of the photograph based on the light at the location of the subject. Go to the settings in your camera and input the numbers provided by your light meter into your camera. Adjust the numbers from the light meter to achieve alternative image results. Input a higher aperture (a lower f-stop number) for an image that reveals more light. A lower aperture (a higher f number) will darken the image. You can also alter the shutter speed, which allows more light in with a slower speed and increases potential blurring of any moving things in the scene.",
  "sentences":[
    " Setting up the Light Meter Prepare your camera.",
    "Go into the settings of your camera and set it to manual mode, if it isn't in that mode already.",
    "Set your camera to your preferred ISO and aperture settings.",
    "You'll need to do some experimenting with both of these settings to find the ideal settings for the photo you're trying to get.",
    "The ISO setting determines your camera's sensitivity to light.",
    "The higher the ISO, the more sensitivity to light.",
    "Generally, lower ISO settings produce clearer pictures while a higher ISO will cause graininess, but there are some scenarios where you'll need a higher ISO, such as when shooting a subject in motion.",
    "The aperture setting changes the size of the lens, and therefore how much light the camera lets in.",
    "This setting is describes using the unit f/stops.",
    "A larger aperture number, like f/11, means a smaller lens size, and a smaller number, like f/1.4, means a larger lens size.",
    "Aperture affects your photos' depth of field and shutter speed.",
    "Input the ISO number and aperture into the light meter.",
    "For whatever ISO your camera is set at, input that number into the allocated spot on the light meter.",
    "Do the same with the aperture that your camera is set at.",
    "Prepare the sensor of the light meter.",
    "Depending on what light meter you are using, you may need to twist the knob around the white dome on your light meter to prepare it.",
    "This is the sensor of the light meter.",
    "Set your light meter to the appropriate mode.",
    "Most light meters have two modes, one for ambient light and one for flash.",
    "If you're going to be using the flash of your camera, set it to that mode, and if not, use ambient.",
    "Using the Light Meter Hold the camera up to your eye.",
    "Look through the viewfinder and focus on your intended subject.",
    "Place the light meter out in front of you or have a friend hold it at the distance of the subject of the photo.",
    "If you are taking a photo of a person, have the person hold the meter up to his or her chin.",
    "This pulls the light reading from the exact spot you want in correct exposure.",
    "Aim the sensor of the light meter at the camera.",
    "The sensor is the white dome-shaped area of the meter.",
    "It is often on a swiveling or rotating head.",
    "Point it straight at the lens of the camera for the best results.",
    "Press the measure button on the light sensor.",
    "This will measure the amount of light falling on the subject.",
    "Fire the flash on the camera.",
    "If you're using your flash to capture your subject, and you've set your light meter to flash mode, you'll need to hit the measure button while the camera is flashing.",
    "The meter will evaluate the degree of light from the flash and determine the correct aperture and shutter speed for the subject.",
    "Find the camera settings that the light meter reads out.",
    "After hitting the measure button, most light meters will allow you to then scroll through the combinations of shutter speeds and apertures that are appropriate for the amount of light measured.",
    "Select the appropriate settings on the camera.",
    "The meter supplied you with aperture and shutter speed readings for correct exposure of the photograph based on the light at the location of the subject.",
    "Go to the settings in your camera and input the numbers provided by your light meter into your camera.",
    "Adjust the numbers from the light meter to achieve alternative image results.",
    "Input a higher aperture (a lower f-stop number) for an image that reveals more light.",
    "A lower aperture (a higher f number) will darken the image.",
    "You can also alter the shutter speed, which allows more light in with a slower speed and increases potential blurring of any moving things in the scene."
  ],
  "tyn_section":[
    "Light meter",
    "Camera"
  ],
  "tyn_model":[
    "light meter",
    "camera",
    "light meters",
    "meter"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.5,
    "f1":0.6666666667,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.75,
    "f1":0.8571428571
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":1.0,
    "f1":1.0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.5,
    "f1":0.6666666667
  }
}