{
  "title":"How to Grow Flowering Plants Through Stems",
  "url":"https://www.wikihow.com/Grow-Flowering-Plants-Through-Stems",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "steps":[
    {
      "headline":"Select a healthy, pest and disease free parent plant.",
      "description":"The plant could be 1 year old or older."
    },
    {
      "headline":"Look for a stem that is already mature but still green inside.",
      "description":"Scrape off the bark to see if green or not. It should be at least pencil thick."
    },
    {
      "headline":"Cut off the stem just above a node.",
      "description":"If you're making more, cut a long stem. Use sharp scissors or pruners."
    },
    {
      "headline":"Remove all the leaves, including the tip.",
      "description":"Also remove the young shoots growing from the main stem. Do not damage the buds."
    },
    {
      "headline":"If the stem is long and you want to plant more of them, cut them in sections at least 6 inches (15.2 cm) each.",
      "description":""
    },
    {
      "headline":"Using the scissors/pruners, scrape off the bark 1 inch (2.5 cm) from the bottom.",
      "description":"Scrape the bark until it is completely removed. Keep moist."
    },
    {
      "headline":"Prepare the planting site.",
      "description":"If you want to plant directly, proceed to step 11. But if in pots first, it is much better. Fill your container with soil, pressing it firmly but not too much or it will be waterlogged. Moisten the soil if dry."
    },
    {
      "headline":"Use a screwdriver or a pencil to make holes in the pots.",
      "description":""
    },
    {
      "headline":"If desired, dip the scraped part of the cuttings in rooting hormone.",
      "description":"This will fasten the rooting of the cuttings. If not, it's just fine."
    },
    {
      "headline":"Immediately put the bottom of the cuttings into the hole you've made.",
      "description":"Press the soil gently and place in a warm position. Water sparingly."
    },
    {
      "headline":"If planting directly into the plant's original position, dig a hole, deep enough to cover the scraped part of the stem.",
      "description":"Then plant the stem."
    },
    {
      "headline":"Plants in pots are ready to be transplanted if they are at least 1 month old.",
      "description":"Make sure they already have shoots."
    }
  ],
  "text":" Select a healthy, pest and disease free parent plant. The plant could be 1 year old or older. Look for a stem that is already mature but still green inside. Scrape off the bark to see if green or not. It should be at least pencil thick. Cut off the stem just above a node. If you're making more, cut a long stem. Use sharp scissors or pruners. Remove all the leaves, including the tip. Also remove the young shoots growing from the main stem. Do not damage the buds. If the stem is long and you want to plant more of them, cut them in sections at least 6 inches (15.2 cm) each.  Using the scissors/pruners, scrape off the bark 1 inch (2.5 cm) from the bottom. Scrape the bark until it is completely removed. Keep moist. Prepare the planting site. If you want to plant directly, proceed to step 11. But if in pots first, it is much better. Fill your container with soil, pressing it firmly but not too much or it will be waterlogged. Moisten the soil if dry. Use a screwdriver or a pencil to make holes in the pots.  If desired, dip the scraped part of the cuttings in rooting hormone. This will fasten the rooting of the cuttings. If not, it's just fine. Immediately put the bottom of the cuttings into the hole you've made. Press the soil gently and place in a warm position. Water sparingly. If planting directly into the plant's original position, dig a hole, deep enough to cover the scraped part of the stem. Then plant the stem. Plants in pots are ready to be transplanted if they are at least 1 month old. Make sure they already have shoots.",
  "sentences":[
    " Select a healthy, pest and disease free parent plant.",
    "The plant could be 1 year old or older.",
    "Look for a stem that is already mature but still green inside.",
    "Scrape off the bark to see if green or not.",
    "It should be at least pencil thick.",
    "Cut off the stem just above a node.",
    "If you're making more, cut a long stem.",
    "Use sharp scissors or pruners.",
    "Remove all the leaves, including the tip.",
    "Also remove the young shoots growing from the main stem.",
    "Do not damage the buds.",
    "If the stem is long and you want to plant more of them, cut them in sections at least 6 inches (15.2 cm) each.",
    "Using the scissors/pruners, scrape off the bark 1 inch (2.5 cm) from the bottom.",
    "Scrape the bark until it is completely removed.",
    "Keep moist.",
    "Prepare the planting site.",
    "If you want to plant directly, proceed to step 11.",
    "But if in pots first, it is much better.",
    "Fill your container with soil, pressing it firmly but not too much or it will be waterlogged.",
    "Moisten the soil if dry.",
    "Use a screwdriver or a pencil to make holes in the pots.",
    "If desired, dip the scraped part of the cuttings in rooting hormone.",
    "This will fasten the rooting of the cuttings.",
    "If not, it's just fine.",
    "Immediately put the bottom of the cuttings into the hole you've made.",
    "Press the soil gently and place in a warm position.",
    "Water sparingly.",
    "If planting directly into the plant's original position, dig a hole, deep enough to cover the scraped part of the stem.",
    "Then plant the stem.",
    "Plants in pots are ready to be transplanted if they are at least 1 month old.",
    "Make sure they already have shoots."
  ],
  "tyn_section":[
    "Flowering Plant of your choice",
    "Scissors/ Pruners",
    "Pots (optional)",
    "Rooting Hormone (optional)"
  ],
  "tyn_model":[
    "scissors",
    "pruners",
    "soil",
    "bark",
    "container",
    "screwdriver",
    "rooting hormone",
    "water",
    "pots"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.3333333333,
    "f1":0.4615384615
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.3333333333,
    "f1":0.4615384615
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.1111111111,
    "f1":0.1538461538
  }
}