{
  "title":"How to Make Flax Oil with Cottage Cheese for the Budwig Protocol",
  "url":"https://www.wikihow.com/Make-Flax-Oil-with-Cottage-Cheese-for-the-Budwig-Protocol",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes"
  ],
  "steps":[
    {
      "headline":"Mix the flax oil with cottage cheese.",
      "description":"Shake the oil well before use. The process of this is called emulsification. Using a blender, or hand-held (immersion type) blender, thoroughly blend your cottage cheese. Add the honey and flax oil to this as well to mix it all together. Even when it looks like it is mixed together enough, check to see if it is sticking to the sides of the container (it needs to blend more). If the process is complete, then the mixture will not be sticking to the sides of the container."
    },
    {
      "headline":"Use a coffee grinder (dedicated to flax seed grinding).",
      "description":"Grind the flax seeds to a very fine consistency (about 10 seconds). Use the flax within 20 minutes. The seeds contain high levels of fiber and many vitamins and minerals."
    },
    {
      "headline":"Put your choice of organic fruit into a bowl and add the cottage cheese blend to it.",
      "description":"Sprinkle the ground flax onto the mixture."
    },
    {
      "headline":"Mix it all together or eat it, as is.",
      "description":""
    },
    {
      "headline":"Enhance the health benefits of eating FOCC.",
      "description":"Avoid sugar, meat, and fats such as butter, margarine and most vegetable oils. Restrict sodium intake, and use unbleached sea salt."
    },
    {
      "headline":"Talk to your doctor if you are under the care of one and thinking of trying the Budwig diet.",
      "description":"They may advise that you don't have flaxseed if you have certain conditions including:Bowel problems, such as inflammatory bowel disease (IBS)\nDiabetes\nBleeding"
    }
  ],
  "text":" Mix the flax oil with cottage cheese. Shake the oil well before use. The process of this is called emulsification. Using a blender, or hand-held (immersion type) blender, thoroughly blend your cottage cheese. Add the honey and flax oil to this as well to mix it all together. Even when it looks like it is mixed together enough, check to see if it is sticking to the sides of the container (it needs to blend more). If the process is complete, then the mixture will not be sticking to the sides of the container. Use a coffee grinder (dedicated to flax seed grinding). Grind the flax seeds to a very fine consistency (about 10 seconds). Use the flax within 20 minutes. The seeds contain high levels of fiber and many vitamins and minerals. Put your choice of organic fruit into a bowl and add the cottage cheese blend to it. Sprinkle the ground flax onto the mixture. Mix it all together or eat it, as is.  Enhance the health benefits of eating FOCC. Avoid sugar, meat, and fats such as butter, margarine and most vegetable oils. Restrict sodium intake, and use unbleached sea salt. Talk to your doctor if you are under the care of one and thinking of trying the Budwig diet. They may advise that you don't have flaxseed if you have certain conditions including:Bowel problems, such as inflammatory bowel disease (IBS)\nDiabetes\nBleeding",
  "sentences":[
    " Mix the flax oil with cottage cheese.",
    "Shake the oil well before use.",
    "The process of this is called emulsification.",
    "Using a blender, or hand-held (immersion type) blender, thoroughly blend your cottage cheese.",
    "Add the honey and flax oil to this as well to mix it all together.",
    "Even when it looks like it is mixed together enough, check to see if it is sticking to the sides of the container (it needs to blend more).",
    "If the process is complete, then the mixture will not be sticking to the sides of the container.",
    "Use a coffee grinder (dedicated to flax seed grinding).",
    "Grind the flax seeds to a very fine consistency (about 10 seconds).",
    "Use the flax within 20 minutes.",
    "The seeds contain high levels of fiber and many vitamins and minerals.",
    "Put your choice of organic fruit into a bowl and add the cottage cheese blend to it.",
    "Sprinkle the ground flax onto the mixture.",
    "Mix it all together or eat it, as is.",
    "Enhance the health benefits of eating FOCC.",
    "Avoid sugar, meat, and fats such as butter, margarine and most vegetable oils.",
    "Restrict sodium intake, and use unbleached sea salt.",
    "Talk to your doctor if you are under the care of one and thinking of trying the Budwig diet.",
    "They may advise that you don't have flaxseed if you have certain conditions including:Bowel problems, such as inflammatory bowel disease (IBS)\nDiabetes\nBleeding"
  ],
  "tyn_section":[
    "Blender container (one you would use for a stick blender)",
    "Stick blender (immersion blender)",
    "Appliance for grinding seeds (a coffee grinder works great)"
  ],
  "tyn_model":[
    "cottage cheese",
    "flax oil",
    "blender",
    "oil",
    "honey",
    "coffee grinder",
    "flax",
    "organic fruit",
    "bowl",
    "ground flax",
    "butter",
    "margarine",
    "vegetable oils",
    "sea salt",
    "flaxseed"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}