{
  "title":"How to Replace Shower Knobs",
  "url":"https://www.wikihow.com/Replace-Shower-Knobs",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms",
    "Showers"
  ],
  "methods":[
    {
      "name":"Fitting a New Single Knob",
      "steps":[
        {
          "headline":"Turn the water off before you begin.",
          "description":"Switch the main water supply line off, or just the valve specifically for the shower if you have access to it. Turn the shower on to drain out any residual water once you have turned the water supply off. This prevents you from getting accidentally soaked if you turn the handle while you are replacing it. The main water supply can usually be found in your basement or outside. If the main water supply handle is a wheel, switch it off by turning it clockwise for 2 full turns. For main water supply handles that are levers, turn the lever 1/4 until it's at a right angle to the pipe. It will stop being able to be turned at this point."
        },
        {
          "headline":"Place an old cloth over the shower drain.",
          "description":"Lay a cloth flat over the drain to catch any small parts that may fall while you are replacing the knob. This will prevent you from losing anything, and will also keep your drain from getting blocked."
        },
        {
          "headline":"Remove the covered button.",
          "description":"This is normally located on the underside of the handle, and has the red and blue temperature symbol on it. Use a utility knife to press beneath it, and flick it off. The covered button goes over a hole in the shower handle where the screw is. Some showers don’t have a covered button for this hole, and in this case you won’t have to remove one. Just find the small hole on the underside of your handle."
        },
        {
          "headline":"Use an Allen key to remove the screw.",
          "description":"Insert the Allen key into the screw within the hole. Twist the Allen key counterclockwise to remove the screw, and pull the handle off. Use the long end of the Allen key, as the hole will be quite deep. It will only take a few full twists for the handle to be able to be pulled away."
        },
        {
          "headline":"Purchase a replacement handle that matches the size and brand of the old one.",
          "description":"Put the old handle and screw into a plastic bag, and show it to the salesperson at the hardware or plumbing store. They will be able to show you what faucet handles will work for your old fittings. If they don’t sell handles from the same brand, they will offer you a universal faucet handle instead, which can fit onto any fittings. Choosing a new shower faucet with the same layout means that you will be able to replace and install it yourself, rather than needing to get extensive plumbing work to switch between the styles. Shower faucets are made from many different materials, including brass, plastic, zinc-alloy, and chrome. Match your new handles to the other fittings in your bathroom such as the showerhead and taps. Brass is the most expensive option yet will last the longest, while plastic is the most inexpensive option."
        },
        {
          "headline":"Push the new handle over the valve.",
          "description":"Most handles can simply be pushed into place over the existing fittings, but some new handle sets may come with a spacer that you insert before you push the new handle on. Fit the spacer into place inside the handle as per the instructions that came with your set first, and then push the handle onto the valve. Fitting the new handle will depend on the type and brand of faucet that you have, so checking with the instructions that came with your new set is best."
        },
        {
          "headline":"Place the screws into the new handle.",
          "description":"Use a Phillips screwdriver to attach the screws into your new handle. It depends on the set that you chose as to how many screws you will need to use. These screws usually go in the very center of the new shower handle."
        },
        {
          "headline":"Push the cover into place.",
          "description":"Push the new covering over the top of the hole where the central screw is. This cover will usually have either hot/cold symbols or the brand logo. Make sure that the cover is firmly in place and that it is sitting flat against the handle."
        },
        {
          "headline":"Test the new handle.",
          "description":"Turn the water supply back on slowly, and move the handle to each side. Test that the hot and cold water works, and that there are no leaks. If there is a leak, remove the new cover and tighten the screws. Taking your time to slowly turn the water back on is key. For wheel-shaped handles, stop after a 1/2 revolution for a few seconds before turning it the full way. For levers, turn it 1/8 of a turn, wait for a few seconds, and then turn it back to the original position of being parallel with the pipe."
        }
      ]
    },
    {
      "name":"Replacing Double Knobs",
      "steps":[
        {
          "headline":"Switch off the water before you start.",
          "description":"You can either turn off the valve specifically for the shower, or you can shut off the water supply at the main line, which is on the outside of the house or in the basement. Switch off the water and then turn the shower on, which allows any remaining water flow out. Some bathrooms have a separate valve for the shower located in the bathroom, but this is uncommon. If the water supply handle is round and looks like a wheel, turn the handle clockwise to switch it off. It will take around 2 full turns. If the water supply handle is a lever, give the handle a 1/4 turn, where it will stop."
        },
        {
          "headline":"Remove the decorative trimming on the knob.",
          "description":"Push a flathead screwdriver beneath the cover plate on the knob. Gently lift the screwdriver handle away, and the cover will pop off. You can use a utility knife instead of a flathead screwdriver. If the cover plate is stuck, use a handle puller to remove it. You can buy these from your local hardware store."
        },
        {
          "headline":"Unscrew the screw in the center of the knob.",
          "description":"Use a Phillips screwdriver counterclockwise to twist the screw out. It will fall out quickly, so be ready to catch it. Place a cloth over the shower drain in case the screw or any small parts fall."
        },
        {
          "headline":"Take off the knob to reach the valve stem.",
          "description":"Twist the knob counterclockwise to remove it from the valve. It should twist off easily. If the knob seems to be stuck on the valve, give it a few very light taps with a hammer on the outside, where you hold it to turn it. This will loosen any mineral deposits and it won't damage the knob."
        },
        {
          "headline":"Purchase replacement knobs that are the same size and brand of the old ones.",
          "description":"Take the old knobs and screws with you to the hardware or plumbing store, and show them to the salesperson. They will be able to help you to match new shower knobs to your old fittings, ensuring that you get the right brand and size. A universal faucet handle is another option if the store doesn't sell your particular brand. Shower knobs are made from many different materials, and you should try to find some that match your other fittings in your bathroom, such as the showerhead and taps. Brass, plastic, and chrome are common materials."
        },
        {
          "headline":"Push the new knob onto the valve.",
          "description":"Make sure that the cold labelled knob goes on the cold valve, or the hot labelled knob goes on the hot valve Generally the cold water knob will be on the right, and the hot water knob will be on the left. If your old shower knobs were previously the wrong way around, this is a good opportunity to switch it."
        },
        {
          "headline":"Twist and screw the knob into place.",
          "description":"Twist the knob onto the valve, until it slides into place. Use a Phillips screwdriver to put a screw into the centre of each knob, and tighten it as much as possible to prevent any leaks."
        },
        {
          "headline":"Replace the cover plate on each knob.",
          "description":"Use your thumbs to push each cover back onto each knob. Make sure that the cover is flush and sits flat on the knob."
        },
        {
          "headline":"Repeat this process for the second shower knob.",
          "description":"Remove the decorative trimming, take out the screw, and take the knob off the valve. Then install in the new knob, making sure that the cold water knob is on the right, while the hot water knob is on the left."
        },
        {
          "headline":"Turn on the water supply and test out the knobs.",
          "description":"Twist the hot and cold knobs on individually to check that they don’t leak. If there is a leak, remove the knob and tighten the screw again. Turn the main water supply back on slowly. For round handles, pause after a 1/2 revolution for a few seconds before opening it fully. Turn a lever 1/8 of a turn, wait for a few seconds, and turn it the rest of the way until it's parallel with the water pipe."
        }
      ]
    }
  ],
  "text":" Fitting a New Single Knob Turn the water off before you begin. Switch the main water supply line off, or just the valve specifically for the shower if you have access to it. Turn the shower on to drain out any residual water once you have turned the water supply off. This prevents you from getting accidentally soaked if you turn the handle while you are replacing it. The main water supply can usually be found in your basement or outside. If the main water supply handle is a wheel, switch it off by turning it clockwise for 2 full turns. For main water supply handles that are levers, turn the lever 1/4 until it's at a right angle to the pipe. It will stop being able to be turned at this point. Place an old cloth over the shower drain. Lay a cloth flat over the drain to catch any small parts that may fall while you are replacing the knob. This will prevent you from losing anything, and will also keep your drain from getting blocked. Remove the covered button. This is normally located on the underside of the handle, and has the red and blue temperature symbol on it. Use a utility knife to press beneath it, and flick it off. The covered button goes over a hole in the shower handle where the screw is. Some showers don’t have a covered button for this hole, and in this case you won’t have to remove one. Just find the small hole on the underside of your handle. Use an Allen key to remove the screw. Insert the Allen key into the screw within the hole. Twist the Allen key counterclockwise to remove the screw, and pull the handle off. Use the long end of the Allen key, as the hole will be quite deep. It will only take a few full twists for the handle to be able to be pulled away. Purchase a replacement handle that matches the size and brand of the old one. Put the old handle and screw into a plastic bag, and show it to the salesperson at the hardware or plumbing store. They will be able to show you what faucet handles will work for your old fittings. If they don’t sell handles from the same brand, they will offer you a universal faucet handle instead, which can fit onto any fittings. Choosing a new shower faucet with the same layout means that you will be able to replace and install it yourself, rather than needing to get extensive plumbing work to switch between the styles. Shower faucets are made from many different materials, including brass, plastic, zinc-alloy, and chrome. Match your new handles to the other fittings in your bathroom such as the showerhead and taps. Brass is the most expensive option yet will last the longest, while plastic is the most inexpensive option. Push the new handle over the valve. Most handles can simply be pushed into place over the existing fittings, but some new handle sets may come with a spacer that you insert before you push the new handle on. Fit the spacer into place inside the handle as per the instructions that came with your set first, and then push the handle onto the valve. Fitting the new handle will depend on the type and brand of faucet that you have, so checking with the instructions that came with your new set is best. Place the screws into the new handle. Use a Phillips screwdriver to attach the screws into your new handle. It depends on the set that you chose as to how many screws you will need to use. These screws usually go in the very center of the new shower handle. Push the cover into place. Push the new covering over the top of the hole where the central screw is. This cover will usually have either hot/cold symbols or the brand logo. Make sure that the cover is firmly in place and that it is sitting flat against the handle. Test the new handle. Turn the water supply back on slowly, and move the handle to each side. Test that the hot and cold water works, and that there are no leaks. If there is a leak, remove the new cover and tighten the screws. Taking your time to slowly turn the water back on is key. For wheel-shaped handles, stop after a 1/2 revolution for a few seconds before turning it the full way. For levers, turn it 1/8 of a turn, wait for a few seconds, and then turn it back to the original position of being parallel with the pipe. Replacing Double Knobs Switch off the water before you start. You can either turn off the valve specifically for the shower, or you can shut off the water supply at the main line, which is on the outside of the house or in the basement. Switch off the water and then turn the shower on, which allows any remaining water flow out. Some bathrooms have a separate valve for the shower located in the bathroom, but this is uncommon. If the water supply handle is round and looks like a wheel, turn the handle clockwise to switch it off. It will take around 2 full turns. If the water supply handle is a lever, give the handle a 1/4 turn, where it will stop. Remove the decorative trimming on the knob. Push a flathead screwdriver beneath the cover plate on the knob. Gently lift the screwdriver handle away, and the cover will pop off. You can use a utility knife instead of a flathead screwdriver. If the cover plate is stuck, use a handle puller to remove it. You can buy these from your local hardware store. Unscrew the screw in the center of the knob. Use a Phillips screwdriver counterclockwise to twist the screw out. It will fall out quickly, so be ready to catch it. Place a cloth over the shower drain in case the screw or any small parts fall. Take off the knob to reach the valve stem. Twist the knob counterclockwise to remove it from the valve. It should twist off easily. If the knob seems to be stuck on the valve, give it a few very light taps with a hammer on the outside, where you hold it to turn it. This will loosen any mineral deposits and it won't damage the knob. Purchase replacement knobs that are the same size and brand of the old ones. Take the old knobs and screws with you to the hardware or plumbing store, and show them to the salesperson. They will be able to help you to match new shower knobs to your old fittings, ensuring that you get the right brand and size. A universal faucet handle is another option if the store doesn't sell your particular brand. Shower knobs are made from many different materials, and you should try to find some that match your other fittings in your bathroom, such as the showerhead and taps. Brass, plastic, and chrome are common materials. Push the new knob onto the valve. Make sure that the cold labelled knob goes on the cold valve, or the hot labelled knob goes on the hot valve Generally the cold water knob will be on the right, and the hot water knob will be on the left. If your old shower knobs were previously the wrong way around, this is a good opportunity to switch it. Twist and screw the knob into place. Twist the knob onto the valve, until it slides into place. Use a Phillips screwdriver to put a screw into the centre of each knob, and tighten it as much as possible to prevent any leaks. Replace the cover plate on each knob. Use your thumbs to push each cover back onto each knob. Make sure that the cover is flush and sits flat on the knob. Repeat this process for the second shower knob. Remove the decorative trimming, take out the screw, and take the knob off the valve. Then install in the new knob, making sure that the cold water knob is on the right, while the hot water knob is on the left. Turn on the water supply and test out the knobs. Twist the hot and cold knobs on individually to check that they don’t leak. If there is a leak, remove the knob and tighten the screw again. Turn the main water supply back on slowly. For round handles, pause after a 1/2 revolution for a few seconds before opening it fully. Turn a lever 1/8 of a turn, wait for a few seconds, and turn it the rest of the way until it's parallel with the water pipe.",
  "sentences":[
    " Fitting a New Single Knob Turn the water off before you begin.",
    "Switch the main water supply line off, or just the valve specifically for the shower if you have access to it.",
    "Turn the shower on to drain out any residual water once you have turned the water supply off.",
    "This prevents you from getting accidentally soaked if you turn the handle while you are replacing it.",
    "The main water supply can usually be found in your basement or outside.",
    "If the main water supply handle is a wheel, switch it off by turning it clockwise for 2 full turns.",
    "For main water supply handles that are levers, turn the lever 1/4 until it's at a right angle to the pipe.",
    "It will stop being able to be turned at this point.",
    "Place an old cloth over the shower drain.",
    "Lay a cloth flat over the drain to catch any small parts that may fall while you are replacing the knob.",
    "This will prevent you from losing anything, and will also keep your drain from getting blocked.",
    "Remove the covered button.",
    "This is normally located on the underside of the handle, and has the red and blue temperature symbol on it.",
    "Use a utility knife to press beneath it, and flick it off.",
    "The covered button goes over a hole in the shower handle where the screw is.",
    "Some showers don’t have a covered button for this hole, and in this case you won’t have to remove one.",
    "Just find the small hole on the underside of your handle.",
    "Use an Allen key to remove the screw.",
    "Insert the Allen key into the screw within the hole.",
    "Twist the Allen key counterclockwise to remove the screw, and pull the handle off.",
    "Use the long end of the Allen key, as the hole will be quite deep.",
    "It will only take a few full twists for the handle to be able to be pulled away.",
    "Purchase a replacement handle that matches the size and brand of the old one.",
    "Put the old handle and screw into a plastic bag, and show it to the salesperson at the hardware or plumbing store.",
    "They will be able to show you what faucet handles will work for your old fittings.",
    "If they don’t sell handles from the same brand, they will offer you a universal faucet handle instead, which can fit onto any fittings.",
    "Choosing a new shower faucet with the same layout means that you will be able to replace and install it yourself, rather than needing to get extensive plumbing work to switch between the styles.",
    "Shower faucets are made from many different materials, including brass, plastic, zinc-alloy, and chrome.",
    "Match your new handles to the other fittings in your bathroom such as the showerhead and taps.",
    "Brass is the most expensive option yet will last the longest, while plastic is the most inexpensive option.",
    "Push the new handle over the valve.",
    "Most handles can simply be pushed into place over the existing fittings, but some new handle sets may come with a spacer that you insert before you push the new handle on.",
    "Fit the spacer into place inside the handle as per the instructions that came with your set first, and then push the handle onto the valve.",
    "Fitting the new handle will depend on the type and brand of faucet that you have, so checking with the instructions that came with your new set is best.",
    "Place the screws into the new handle.",
    "Use a Phillips screwdriver to attach the screws into your new handle.",
    "It depends on the set that you chose as to how many screws you will need to use.",
    "These screws usually go in the very center of the new shower handle.",
    "Push the cover into place.",
    "Push the new covering over the top of the hole where the central screw is.",
    "This cover will usually have either hot/cold symbols or the brand logo.",
    "Make sure that the cover is firmly in place and that it is sitting flat against the handle.",
    "Test the new handle.",
    "Turn the water supply back on slowly, and move the handle to each side.",
    "Test that the hot and cold water works, and that there are no leaks.",
    "If there is a leak, remove the new cover and tighten the screws.",
    "Taking your time to slowly turn the water back on is key.",
    "For wheel-shaped handles, stop after a 1/2 revolution for a few seconds before turning it the full way.",
    "For levers, turn it 1/8 of a turn, wait for a few seconds, and then turn it back to the original position of being parallel with the pipe.",
    "Replacing Double Knobs Switch off the water before you start.",
    "You can either turn off the valve specifically for the shower, or you can shut off the water supply at the main line, which is on the outside of the house or in the basement.",
    "Switch off the water and then turn the shower on, which allows any remaining water flow out.",
    "Some bathrooms have a separate valve for the shower located in the bathroom, but this is uncommon.",
    "If the water supply handle is round and looks like a wheel, turn the handle clockwise to switch it off.",
    "It will take around 2 full turns.",
    "If the water supply handle is a lever, give the handle a 1/4 turn, where it will stop.",
    "Remove the decorative trimming on the knob.",
    "Push a flathead screwdriver beneath the cover plate on the knob.",
    "Gently lift the screwdriver handle away, and the cover will pop off.",
    "You can use a utility knife instead of a flathead screwdriver.",
    "If the cover plate is stuck, use a handle puller to remove it.",
    "You can buy these from your local hardware store.",
    "Unscrew the screw in the center of the knob.",
    "Use a Phillips screwdriver counterclockwise to twist the screw out.",
    "It will fall out quickly, so be ready to catch it.",
    "Place a cloth over the shower drain in case the screw or any small parts fall.",
    "Take off the knob to reach the valve stem.",
    "Twist the knob counterclockwise to remove it from the valve.",
    "It should twist off easily.",
    "If the knob seems to be stuck on the valve, give it a few very light taps with a hammer on the outside, where you hold it to turn it.",
    "This will loosen any mineral deposits and it won't damage the knob.",
    "Purchase replacement knobs that are the same size and brand of the old ones.",
    "Take the old knobs and screws with you to the hardware or plumbing store, and show them to the salesperson.",
    "They will be able to help you to match new shower knobs to your old fittings, ensuring that you get the right brand and size.",
    "A universal faucet handle is another option if the store doesn't sell your particular brand.",
    "Shower knobs are made from many different materials, and you should try to find some that match your other fittings in your bathroom, such as the showerhead and taps.",
    "Brass, plastic, and chrome are common materials.",
    "Push the new knob onto the valve.",
    "Make sure that the cold labelled knob goes on the cold valve, or the hot labelled knob goes on the hot valve Generally the cold water knob will be on the right, and the hot water knob will be on the left.",
    "If your old shower knobs were previously the wrong way around, this is a good opportunity to switch it.",
    "Twist and screw the knob into place.",
    "Twist the knob onto the valve, until it slides into place.",
    "Use a Phillips screwdriver to put a screw into the centre of each knob, and tighten it as much as possible to prevent any leaks.",
    "Replace the cover plate on each knob.",
    "Use your thumbs to push each cover back onto each knob.",
    "Make sure that the cover is flush and sits flat on the knob.",
    "Repeat this process for the second shower knob.",
    "Remove the decorative trimming, take out the screw, and take the knob off the valve.",
    "Then install in the new knob, making sure that the cold water knob is on the right, while the hot water knob is on the left.",
    "Turn on the water supply and test out the knobs.",
    "Twist the hot and cold knobs on individually to check that they don’t leak.",
    "If there is a leak, remove the knob and tighten the screw again.",
    "Turn the main water supply back on slowly.",
    "For round handles, pause after a 1/2 revolution for a few seconds before opening it fully.",
    "Turn a lever 1/8 of a turn, wait for a few seconds, and turn it the rest of the way until it's parallel with the water pipe."
  ],
  "tyn_section":[
    "Old cloth",
    "Flathead screwdriver",
    "Utility knife",
    "Hand puller",
    "Allen key",
    "Phillips screwdriver",
    "Hammer",
    "New shower knobs kit"
  ],
  "tyn_model":[
    "water",
    "allen key",
    "shower",
    "cloth",
    "phillips screwdriver",
    "utility knife",
    "taps",
    "flathead screwdriver",
    "showers",
    "shower faucet",
    "faucets",
    "plastic",
    "water supply",
    "screwdriver",
    "handle puller",
    "hammer",
    "screws"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.2941176471,
    "f1":0.4,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.4117647059,
    "f1":0.5316455696
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.4705882353,
    "f1":0.6120218579
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.2941176471,
    "f1":0.4
  }
}