{
  "title":"How to Buy Crafts from Third World Countries",
  "url":"https://www.wikihow.com/Buy-Crafts-from-Third-World-Countries",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Research fair trade organizations.",
      "description":"There are a number of non-profit companies that choose to keep consumers up to date about fair trade options. These include fairtraderesource.org, chfinternational.org, and fair trade organizations of specific countries, such as fta.org.au."
    },
    {
      "headline":"Decide if you want to buy crafts from a specific country.",
      "description":"For example, you may admire the bamboo furniture from Malaysia or carvings from Africa. Search for a non-profit organization that tells you where to find shops that sell that country's goods. For example, there is a Bangladesh cooperative that represents 60,000 artisans."
    },
    {
      "headline":"Go to eBay or Overstock.",
      "description":"Both of these websites have acquired companies that previously sought to promote fair trade crafts. Ebay acquired World of Good, and you can buy handcrafted gifts from third world countries at worldofgood.ebay.com. Overstock.com provides a fair trade site, called overstock.com/Worldstock-Fair-Trade. You can find anything from jewelry to furniture and more."
    },
    {
      "headline":"Search for local stores that specialize in fair trade crafts.",
      "description":"Most mid to large-sized cities have a few fair trade stores. You can often find the stories behind the manufacturers of the crafts. Ask the store how they acquired the crafts. The best way to tell if you are buying from a certified fair trade, third world craft carrier is to ask how the crafts were acquired."
    },
    {
      "headline":"Visit world craft museums, such as The Museum of Craft and Folk Art or the Museum of Craft and Design in San Francisco.",
      "description":"These museums fill their gift shops with crafts that are well-crafted and distinctive. Check the museum websites for crafts that can be bought online."
    },
    {
      "headline":"Visit summer markets in your town.",
      "description":"People who have emigrated from other countries often stock booths filled with their home country's crafts. Peruvian alpaca crafts are common at summer craft markets."
    },
    {
      "headline":"Visit a third world country and buy the crafts straight from the source.",
      "description":"While this is the most expensive option, it is the best way to ensure you are buying straight from a craftsman. Research craft workshops where you can visit and buy directly after viewing the creation of the crafts. For example, in St. Kitts there is a batik factory where the batiks are made and then sold. In Peru, you can visit an alpaca farm where yarn is created, died, woven and sold."
    }
  ],
  "text":" Research fair trade organizations. There are a number of non-profit companies that choose to keep consumers up to date about fair trade options. These include fairtraderesource.org, chfinternational.org, and fair trade organizations of specific countries, such as fta.org.au. Decide if you want to buy crafts from a specific country. For example, you may admire the bamboo furniture from Malaysia or carvings from Africa. Search for a non-profit organization that tells you where to find shops that sell that country's goods. For example, there is a Bangladesh cooperative that represents 60,000 artisans. Go to eBay or Overstock. Both of these websites have acquired companies that previously sought to promote fair trade crafts. Ebay acquired World of Good, and you can buy handcrafted gifts from third world countries at worldofgood.ebay.com. Overstock.com provides a fair trade site, called overstock.com/Worldstock-Fair-Trade. You can find anything from jewelry to furniture and more. Search for local stores that specialize in fair trade crafts. Most mid to large-sized cities have a few fair trade stores. You can often find the stories behind the manufacturers of the crafts. Ask the store how they acquired the crafts. The best way to tell if you are buying from a certified fair trade, third world craft carrier is to ask how the crafts were acquired. Visit world craft museums, such as The Museum of Craft and Folk Art or the Museum of Craft and Design in San Francisco. These museums fill their gift shops with crafts that are well-crafted and distinctive. Check the museum websites for crafts that can be bought online. Visit summer markets in your town. People who have emigrated from other countries often stock booths filled with their home country's crafts. Peruvian alpaca crafts are common at summer craft markets. Visit a third world country and buy the crafts straight from the source. While this is the most expensive option, it is the best way to ensure you are buying straight from a craftsman. Research craft workshops where you can visit and buy directly after viewing the creation of the crafts. For example, in St. Kitts there is a batik factory where the batiks are made and then sold. In Peru, you can visit an alpaca farm where yarn is created, died, woven and sold.",
  "sentences":[
    " Research fair trade organizations.",
    "There are a number of non-profit companies that choose to keep consumers up to date about fair trade options.",
    "These include fairtraderesource.org, chfinternational.org, and fair trade organizations of specific countries, such as fta.org.au.",
    "Decide if you want to buy crafts from a specific country.",
    "For example, you may admire the bamboo furniture from Malaysia or carvings from Africa.",
    "Search for a non-profit organization that tells you where to find shops that sell that country's goods.",
    "For example, there is a Bangladesh cooperative that represents 60,000 artisans.",
    "Go to eBay or Overstock.",
    "Both of these websites have acquired companies that previously sought to promote fair trade crafts.",
    "Ebay acquired World of Good, and you can buy handcrafted gifts from third world countries at worldofgood.ebay.com.",
    "Overstock.com provides a fair trade site, called overstock.com/Worldstock-Fair-Trade.",
    "You can find anything from jewelry to furniture and more.",
    "Search for local stores that specialize in fair trade crafts.",
    "Most mid to large-sized cities have a few fair trade stores.",
    "You can often find the stories behind the manufacturers of the crafts.",
    "Ask the store how they acquired the crafts.",
    "The best way to tell if you are buying from a certified fair trade, third world craft carrier is to ask how the crafts were acquired.",
    "Visit world craft museums, such as The Museum of Craft and Folk Art or the Museum of Craft and Design in San Francisco.",
    "These museums fill their gift shops with crafts that are well-crafted and distinctive.",
    "Check the museum websites for crafts that can be bought online.",
    "Visit summer markets in your town.",
    "People who have emigrated from other countries often stock booths filled with their home country's crafts.",
    "Peruvian alpaca crafts are common at summer craft markets.",
    "Visit a third world country and buy the crafts straight from the source.",
    "While this is the most expensive option, it is the best way to ensure you are buying straight from a craftsman.",
    "Research craft workshops where you can visit and buy directly after viewing the creation of the crafts.",
    "For example, in St. Kitts there is a batik factory where the batiks are made and then sold.",
    "In Peru, you can visit an alpaca farm where yarn is created, died, woven and sold."
  ],
  "tyn_section":[
    "Summer markets",
    "Internet research",
    "Fair trade shops",
    "Trip abroad"
  ],
  "tyn_model":[
    "fair trade organizations",
    "crafts",
    "ebay",
    "fair trade site",
    "jewelry",
    "yarn"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.3333333333,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.3333333333,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}