{
  "title":"How to Make Chocolate",
  "url":"https://www.wikihow.com/Make-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Making Chocolate"
  ],
  "methods":[
    {
      "name":"Preparing an Easy 4-Ingredient Dark Chocolate",
      "steps":[
        {
          "headline":"Measure out your ingredients.",
          "description":"For this recipe, you’ll need 1 cup (100 g) of cocoa powder, ⁄2 cup (120 mL) of coconut oil, 4 tablespoons (59 mL) of honey, and ⁄2 tablespoon (7.4 mL) of vanilla extract. Use a series of measuring cups to portion out each ingredient in a small cup or bowl. Measuring your ingredients in advance will make the cooking process more efficient once it comes time to put it all together. If you like, you can also add ¼ cup (25 g) of confectioner’s sugar, ⁄4 cup (59 mL) of agave syrup, or 3-6 drops of liquid stevia to lend a little more sweetness to your chocolate."
        },
        {
          "headline":"Melt ⁄2 cup (120 mL) of coconut oil in a small pot over low heat.",
          "description":"Turn on your cooktop to the lowest heat setting and add the coconut oil to the pot. Allow it to melt completely. Coconut oil has a low melting point, so this should only take a few seconds. Keeping the coconut oil moving continuously at the bottom of the pot will help it liquefy faster.Tip: If possible, use stainless steel cookware to prepare your homemade chocolate (or another type of nonstick cookware that’s safe to soak). Otherwise, cleanup can be quite a hassle."
        },
        {
          "headline":"Add 4 tbsp (59 mL) of honey and ½ tbsp (7.4 mL) of vanilla extract.",
          "description":"Use a whisk or metal spoon to scrape the sticky honey into the pot. Then, drizzle in the vanilla. Stir the ingredients into the melted oil until they dissolve and form a thin, syrupy mixture. Be sure to keep your cooktop on a low heat setting. If the oil gets too hot, it could scorch the sugars in the honey and spoil the flavor of the finished chocolate. If you wish to add any other sweeteners, such as confectioner’s sugar or stevia, do it at the same time that you add the honey and vanilla."
        },
        {
          "headline":"Sift in 1 cup (100 g) of cocoa powder gradually.",
          "description":"Rather than dumping all of the cocoa powder in at once, add it a little at a time. As you do, keep your whisk or spoon moving to help distribute the cocoa powder evenly throughout the mixture. You’ll have an easier time mixing the cocoa into your other ingredients with a whisk than you would with a spoon or spatula."
        },
        {
          "headline":"Take the chocolate off of the heat and continue stirring it as it thickens.",
          "description":"You’ll know your chocolate is done when the chocolate takes on a smooth, dark color and the surface becomes slightly glossy. At this point, it just needs to be left to harden. Removing the pot from the hot cooktop will prevent the chocolate from burning."
        },
        {
          "headline":"Transfer the warm chocolate to a nonstick surface to cool.",
          "description":"Carefully pour the chocolate out of the pot and onto a flexible nonstick baking mat or cookie sheet lined with parchment paper. Use a spatula to spread the chocolate about ⁄2 inch (1.3 cm) thick. You can also pour your chocolate into a decorative candy mold to create bite-sized treats with fun shapes. Avoid adding your chocolate to any nonstick type of container, or those treated with a commercial cooking spray. This usually won’t be enough to keep it from sticking."
        },
        {
          "headline":"Refrigerate your chocolate for 1 hour before enjoying it.",
          "description":"Once it’s fully set, it will be firm enough to break into pieces or remove from the mold. Enjoy! Store your finished chocolate in the refrigerator, or simply keep it in a covered container on your countertop for easy access. Most types of dark chocolate have a shelf life of about 2 years. If your chocolate begins to melt or soften at room temperature, you can place it back in the refrigerator at any point to harden it back up."
        }
      ]
    },
    {
      "name":"Making Sweet, Rich Milk Chocolate",
      "steps":[
        {
          "headline":"Create a makeshift double boiler using a pot of water and a mixing bowl.",
          "description":"Fill the pot about halfway up and place it on the cooktop over medium heat. Then, set a small mixing bowl over the opening of the pot. The water will heat the bowl from underneath, allowing you to combine the various ingredients for your chocolate without burning them. You want the water to be nice and hot, but not boiling. If the temperature is too high, it could easily scorch your chocolate as it cooks. A proper double boiler can help you get the job done with fewer pieces of cookware."
        },
        {
          "headline":"Melt ¾ cup (140 g) of cocoa butter in the heated mixing bowl.",
          "description":"Keep the cocoa butter moving continuously at the bottom of the bowl to encourage it to melt faster. Cocoa butter melts at about the same speed as ordinary butter, and has a similar look in its liquid form. You should be able to find cocoa butter in the baking aisle at any health food store, as well as some major supermarkets. If you’re unable to track down high-quality cocoa butter, you can use an equal amount of coconut oil as a substitute."
        },
        {
          "headline":"Sift ¾ cup (80 g) of cocoa powder into the melted cocoa butter.",
          "description":"Add the cocoa powder little by little to reduce clumping. Use a whisk or metal spoon to stir the two ingredients together until the cocoa powder dissolves completely. Make sure there are no lumps or dry pockets within the mixture."
        },
        {
          "headline":"Shake in ¼ cup of milk powder and 1 cup (100 g) of confectioner’s sugar.",
          "description":"Give the mixture another thorough stir to make sure the last of your dry ingredients are fully incorporated. You should notice the chocolate beginning to take on a lighter, more delicate color after adding the milk powder. Use an equal amount of soy milk powder, almond milk powder, or rice milk powder if you're trying to stay dairy-free. You can also substitute 1 cup (240 mL) of agave syrup or 1–2 teaspoons (4.9–9.9 mL) of liquid stevia for confectioner's sugar to sweeten your chocolate more nutritiously. Regular milk is too wet to use for making chocolate—excess moisture has a tendency to leave chocolate with a runny texture, making it impossible for it to set properly.Tip: A small pinch of salt can offset the sweetness of the sugar and give your chocolate a more complex flavor."
        },
        {
          "headline":"Remove the bowl from the heat and stir the chocolate until it thickens.",
          "description":"Fold the chocolate over on itself repeatedly from the bottom of the bowl. When you’re finished, it should be smooth, creamy, and free of lumps. Your chocolate will still be somewhat thin at this point. Don’t worry—it will continue to thicken as it sets up. To turn up the flavor even more, consider mixing in other items like nuts, mint, or dried fruit.Tip: Soak Raisins in Rum for an hour and use it as flavouring agent."
        },
        {
          "headline":"Pour the chocolate onto a nonstick surface or into a candy mold.",
          "description":"If you want your chocolate to harden into a single large sheet, spread it out over a nonstick baking mat or sheet of parchment paper to a thickness of about ⁄2 inch (1.3 cm) edge-to-edge. To make individual treats, transfer the warm chocolate to a decorative mold. You can also use a well-grease ice cube tray if you don’t have any candy molds available. Tap the bottom of your mold a few times to get rid of any bubbles that might have formed while you were pouring the chocolate."
        },
        {
          "headline":"Let your chocolate harden in the refrigerator for 1 hour.",
          "description":"After your chocolate has had plenty of time to set up, break it into pieces or pop individual chocolates out of their molds and have a nibble. Store your homemade milk chocolate in a covered container on your countertop, or inside a pantry or another cool, dry place. It should keep for about 1 year (thought it will be a miracle if it actually lasts that long!)"
        }
      ]
    }
  ],
  "text":" Preparing an Easy 4-Ingredient Dark Chocolate Measure out your ingredients. For this recipe, you’ll need 1 cup (100 g) of cocoa powder, ⁄2 cup (120 mL) of coconut oil, 4 tablespoons (59 mL) of honey, and ⁄2 tablespoon (7.4 mL) of vanilla extract. Use a series of measuring cups to portion out each ingredient in a small cup or bowl. Measuring your ingredients in advance will make the cooking process more efficient once it comes time to put it all together. If you like, you can also add ¼ cup (25 g) of confectioner’s sugar, ⁄4 cup (59 mL) of agave syrup, or 3-6 drops of liquid stevia to lend a little more sweetness to your chocolate. Melt ⁄2 cup (120 mL) of coconut oil in a small pot over low heat. Turn on your cooktop to the lowest heat setting and add the coconut oil to the pot. Allow it to melt completely. Coconut oil has a low melting point, so this should only take a few seconds. Keeping the coconut oil moving continuously at the bottom of the pot will help it liquefy faster.Tip: If possible, use stainless steel cookware to prepare your homemade chocolate (or another type of nonstick cookware that’s safe to soak). Otherwise, cleanup can be quite a hassle. Add 4 tbsp (59 mL) of honey and ½ tbsp (7.4 mL) of vanilla extract. Use a whisk or metal spoon to scrape the sticky honey into the pot. Then, drizzle in the vanilla. Stir the ingredients into the melted oil until they dissolve and form a thin, syrupy mixture. Be sure to keep your cooktop on a low heat setting. If the oil gets too hot, it could scorch the sugars in the honey and spoil the flavor of the finished chocolate. If you wish to add any other sweeteners, such as confectioner’s sugar or stevia, do it at the same time that you add the honey and vanilla. Sift in 1 cup (100 g) of cocoa powder gradually. Rather than dumping all of the cocoa powder in at once, add it a little at a time. As you do, keep your whisk or spoon moving to help distribute the cocoa powder evenly throughout the mixture. You’ll have an easier time mixing the cocoa into your other ingredients with a whisk than you would with a spoon or spatula. Take the chocolate off of the heat and continue stirring it as it thickens. You’ll know your chocolate is done when the chocolate takes on a smooth, dark color and the surface becomes slightly glossy. At this point, it just needs to be left to harden. Removing the pot from the hot cooktop will prevent the chocolate from burning. Transfer the warm chocolate to a nonstick surface to cool. Carefully pour the chocolate out of the pot and onto a flexible nonstick baking mat or cookie sheet lined with parchment paper. Use a spatula to spread the chocolate about ⁄2 inch (1.3 cm) thick. You can also pour your chocolate into a decorative candy mold to create bite-sized treats with fun shapes. Avoid adding your chocolate to any nonstick type of container, or those treated with a commercial cooking spray. This usually won’t be enough to keep it from sticking. Refrigerate your chocolate for 1 hour before enjoying it. Once it’s fully set, it will be firm enough to break into pieces or remove from the mold. Enjoy! Store your finished chocolate in the refrigerator, or simply keep it in a covered container on your countertop for easy access. Most types of dark chocolate have a shelf life of about 2 years. If your chocolate begins to melt or soften at room temperature, you can place it back in the refrigerator at any point to harden it back up. Making Sweet, Rich Milk Chocolate Create a makeshift double boiler using a pot of water and a mixing bowl. Fill the pot about halfway up and place it on the cooktop over medium heat. Then, set a small mixing bowl over the opening of the pot. The water will heat the bowl from underneath, allowing you to combine the various ingredients for your chocolate without burning them. You want the water to be nice and hot, but not boiling. If the temperature is too high, it could easily scorch your chocolate as it cooks. A proper double boiler can help you get the job done with fewer pieces of cookware. Melt ¾ cup (140 g) of cocoa butter in the heated mixing bowl. Keep the cocoa butter moving continuously at the bottom of the bowl to encourage it to melt faster. Cocoa butter melts at about the same speed as ordinary butter, and has a similar look in its liquid form. You should be able to find cocoa butter in the baking aisle at any health food store, as well as some major supermarkets. If you’re unable to track down high-quality cocoa butter, you can use an equal amount of coconut oil as a substitute. Sift ¾ cup (80 g) of cocoa powder into the melted cocoa butter. Add the cocoa powder little by little to reduce clumping. Use a whisk or metal spoon to stir the two ingredients together until the cocoa powder dissolves completely. Make sure there are no lumps or dry pockets within the mixture. Shake in ¼ cup of milk powder and 1 cup (100 g) of confectioner’s sugar. Give the mixture another thorough stir to make sure the last of your dry ingredients are fully incorporated. You should notice the chocolate beginning to take on a lighter, more delicate color after adding the milk powder. Use an equal amount of soy milk powder, almond milk powder, or rice milk powder if you're trying to stay dairy-free. You can also substitute 1 cup (240 mL) of agave syrup or 1–2 teaspoons (4.9–9.9 mL) of liquid stevia for confectioner's sugar to sweeten your chocolate more nutritiously. Regular milk is too wet to use for making chocolate—excess moisture has a tendency to leave chocolate with a runny texture, making it impossible for it to set properly.Tip: A small pinch of salt can offset the sweetness of the sugar and give your chocolate a more complex flavor. Remove the bowl from the heat and stir the chocolate until it thickens. Fold the chocolate over on itself repeatedly from the bottom of the bowl. When you’re finished, it should be smooth, creamy, and free of lumps. Your chocolate will still be somewhat thin at this point. Don’t worry—it will continue to thicken as it sets up. To turn up the flavor even more, consider mixing in other items like nuts, mint, or dried fruit.Tip: Soak Raisins in Rum for an hour and use it as flavouring agent. Pour the chocolate onto a nonstick surface or into a candy mold. If you want your chocolate to harden into a single large sheet, spread it out over a nonstick baking mat or sheet of parchment paper to a thickness of about ⁄2 inch (1.3 cm) edge-to-edge. To make individual treats, transfer the warm chocolate to a decorative mold. You can also use a well-grease ice cube tray if you don’t have any candy molds available. Tap the bottom of your mold a few times to get rid of any bubbles that might have formed while you were pouring the chocolate. Let your chocolate harden in the refrigerator for 1 hour. After your chocolate has had plenty of time to set up, break it into pieces or pop individual chocolates out of their molds and have a nibble. Store your homemade milk chocolate in a covered container on your countertop, or inside a pantry or another cool, dry place. It should keep for about 1 year (thought it will be a miracle if it actually lasts that long!)",
  "sentences":[
    " Preparing an Easy 4-Ingredient Dark Chocolate Measure out your ingredients.",
    "For this recipe, you’ll need 1 cup (100 g) of cocoa powder, ⁄2 cup (120 mL) of coconut oil, 4 tablespoons (59 mL) of honey, and ⁄2 tablespoon (7.4 mL) of vanilla extract.",
    "Use a series of measuring cups to portion out each ingredient in a small cup or bowl.",
    "Measuring your ingredients in advance will make the cooking process more efficient once it comes time to put it all together.",
    "If you like, you can also add ¼ cup (25 g) of confectioner’s sugar, ⁄4 cup (59 mL) of agave syrup, or 3-6 drops of liquid stevia to lend a little more sweetness to your chocolate.",
    "Melt ⁄2 cup (120 mL) of coconut oil in a small pot over low heat.",
    "Turn on your cooktop to the lowest heat setting and add the coconut oil to the pot.",
    "Allow it to melt completely.",
    "Coconut oil has a low melting point, so this should only take a few seconds.",
    "Keeping the coconut oil moving continuously at the bottom of the pot will help it liquefy faster.Tip: If possible, use stainless steel cookware to prepare your homemade chocolate (or another type of nonstick cookware that’s safe to soak).",
    "Otherwise, cleanup can be quite a hassle.",
    "Add 4 tbsp (59 mL) of honey and ½ tbsp (7.4 mL) of vanilla extract.",
    "Use a whisk or metal spoon to scrape the sticky honey into the pot.",
    "Then, drizzle in the vanilla.",
    "Stir the ingredients into the melted oil until they dissolve and form a thin, syrupy mixture.",
    "Be sure to keep your cooktop on a low heat setting.",
    "If the oil gets too hot, it could scorch the sugars in the honey and spoil the flavor of the finished chocolate.",
    "If you wish to add any other sweeteners, such as confectioner’s sugar or stevia, do it at the same time that you add the honey and vanilla.",
    "Sift in 1 cup (100 g) of cocoa powder gradually.",
    "Rather than dumping all of the cocoa powder in at once, add it a little at a time.",
    "As you do, keep your whisk or spoon moving to help distribute the cocoa powder evenly throughout the mixture.",
    "You’ll have an easier time mixing the cocoa into your other ingredients with a whisk than you would with a spoon or spatula.",
    "Take the chocolate off of the heat and continue stirring it as it thickens.",
    "You’ll know your chocolate is done when the chocolate takes on a smooth, dark color and the surface becomes slightly glossy.",
    "At this point, it just needs to be left to harden.",
    "Removing the pot from the hot cooktop will prevent the chocolate from burning.",
    "Transfer the warm chocolate to a nonstick surface to cool.",
    "Carefully pour the chocolate out of the pot and onto a flexible nonstick baking mat or cookie sheet lined with parchment paper.",
    "Use a spatula to spread the chocolate about ⁄2 inch (1.3 cm) thick.",
    "You can also pour your chocolate into a decorative candy mold to create bite-sized treats with fun shapes.",
    "Avoid adding your chocolate to any nonstick type of container, or those treated with a commercial cooking spray.",
    "This usually won’t be enough to keep it from sticking.",
    "Refrigerate your chocolate for 1 hour before enjoying it.",
    "Once it’s fully set, it will be firm enough to break into pieces or remove from the mold.",
    "Enjoy!",
    "Store your finished chocolate in the refrigerator, or simply keep it in a covered container on your countertop for easy access.",
    "Most types of dark chocolate have a shelf life of about 2 years.",
    "If your chocolate begins to melt or soften at room temperature, you can place it back in the refrigerator at any point to harden it back up.",
    "Making Sweet, Rich Milk Chocolate Create a makeshift double boiler using a pot of water and a mixing bowl.",
    "Fill the pot about halfway up and place it on the cooktop over medium heat.",
    "Then, set a small mixing bowl over the opening of the pot.",
    "The water will heat the bowl from underneath, allowing you to combine the various ingredients for your chocolate without burning them.",
    "You want the water to be nice and hot, but not boiling.",
    "If the temperature is too high, it could easily scorch your chocolate as it cooks.",
    "A proper double boiler can help you get the job done with fewer pieces of cookware.",
    "Melt ¾ cup (140 g) of cocoa butter in the heated mixing bowl.",
    "Keep the cocoa butter moving continuously at the bottom of the bowl to encourage it to melt faster.",
    "Cocoa butter melts at about the same speed as ordinary butter, and has a similar look in its liquid form.",
    "You should be able to find cocoa butter in the baking aisle at any health food store, as well as some major supermarkets.",
    "If you’re unable to track down high-quality cocoa butter, you can use an equal amount of coconut oil as a substitute.",
    "Sift ¾ cup (80 g) of cocoa powder into the melted cocoa butter.",
    "Add the cocoa powder little by little to reduce clumping.",
    "Use a whisk or metal spoon to stir the two ingredients together until the cocoa powder dissolves completely.",
    "Make sure there are no lumps or dry pockets within the mixture.",
    "Shake in ¼ cup of milk powder and 1 cup (100 g) of confectioner’s sugar.",
    "Give the mixture another thorough stir to make sure the last of your dry ingredients are fully incorporated.",
    "You should notice the chocolate beginning to take on a lighter, more delicate color after adding the milk powder.",
    "Use an equal amount of soy milk powder, almond milk powder, or rice milk powder if you're trying to stay dairy-free.",
    "You can also substitute 1 cup (240 mL) of agave syrup or 1–2 teaspoons (4.9–9.9 mL) of liquid stevia for confectioner's sugar to sweeten your chocolate more nutritiously.",
    "Regular milk is too wet to use for making chocolate—excess moisture has a tendency to leave chocolate with a runny texture, making it impossible for it to set properly.Tip: A small pinch of salt can offset the sweetness of the sugar and give your chocolate a more complex flavor.",
    "Remove the bowl from the heat and stir the chocolate until it thickens.",
    "Fold the chocolate over on itself repeatedly from the bottom of the bowl.",
    "When you’re finished, it should be smooth, creamy, and free of lumps.",
    "Your chocolate will still be somewhat thin at this point.",
    "Don’t worry—it will continue to thicken as it sets up.",
    "To turn up the flavor even more, consider mixing in other items like nuts, mint, or dried fruit.Tip: Soak Raisins in Rum for an hour and use it as flavouring agent.",
    "Pour the chocolate onto a nonstick surface or into a candy mold.",
    "If you want your chocolate to harden into a single large sheet, spread it out over a nonstick baking mat or sheet of parchment paper to a thickness of about ⁄2 inch (1.3 cm) edge-to-edge.",
    "To make individual treats, transfer the warm chocolate to a decorative mold.",
    "You can also use a well-grease ice cube tray if you don’t have any candy molds available.",
    "Tap the bottom of your mold a few times to get rid of any bubbles that might have formed while you were pouring the chocolate.",
    "Let your chocolate harden in the refrigerator for 1 hour.",
    "After your chocolate has had plenty of time to set up, break it into pieces or pop individual chocolates out of their molds and have a nibble.",
    "Store your homemade milk chocolate in a covered container on your countertop, or inside a pantry or another cool, dry place.",
    "It should keep for about 1 year (thought it will be a miracle if it actually lasts that long!)"
  ],
  "tyn_section":[
    "Dark Chocolate",
    "Small nonstick pot",
    "Whisk or metal spoon",
    "Flexible nonstick baking mat",
    "Spatula",
    "Cookie sheet and parchment paper (optional)",
    "Decorative candy mold (optional)",
    "Milk Chocolate",
    "Small pot",
    "Water",
    "Small mixing bowl"
  ],
  "tyn_model":[
    "chocolate",
    "cocoa powder",
    "pot",
    "coconut oil",
    "cocoa butter",
    "honey",
    "whisk",
    "confectioner’s sugar",
    "cooktop",
    "refrigerator",
    "water",
    "bowl",
    "vanilla extract",
    "agave syrup",
    "liquid stevia",
    "vanilla",
    "oil",
    "spoon",
    "spatula",
    "nonstick baking mat",
    "parchment paper",
    "double boiler",
    "mixing bowl",
    "milk powder",
    "measuring cups",
    "small pot",
    "cocoa",
    "cookie sheet",
    "dark chocolate",
    "butter",
    "soy milk powder",
    "almond milk powder",
    "rice milk powder",
    "confectioner's sugar",
    "milk",
    "—excess",
    "salt",
    "sugar",
    "—it",
    "raisins",
    "rum",
    "candy mold",
    "ice cube tray",
    "candy molds",
    "milk chocolate"
  ],
  "simple_metrics":{
    "r":0.4545454545,
    "p":0.1111111111,
    "f1":0.1785714286,
    "avg_pos":0.6222222222
  },
  "jacc_metrics_0.5":{
    "r":0.8181818182,
    "p":0.2444444444,
    "f1":0.3764258555
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9090909091,
    "p":0.3333333333,
    "f1":0.487804878
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7272727273,
    "p":0.1555555556,
    "f1":0.2562929062
  }
}