{
  "title":"How to Make Marinara Sauce",
  "url":"https://www.wikihow.com/Make-Marinara-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Sauces"
  ],
  "parts":[
    {
      "name":"Sauteing the Initial Ingredients",
      "steps":[
        {
          "headline":"Pour 3 US tbsp (44 mL) of oil in a pan and place it over medium heat.",
          "description":"For best results, use extra-virgin olive oil and pour it into the center of the saucepan. Allow the oil to heat up for about 2-3 minutes before moving on to the next step. Extra-virgin olive oil will give your marinara sauce a much richer flavor than ordinary olive oil will. Medium heat is the middle number on your stovetop dial. For example, if your dial runs from 1 to 10, turn it to 5 to set it to medium heat."
        },
        {
          "headline":"Saute the onions and garlic in the pan for about 8 minutes.",
          "description":"Add the diced onions first and cook them until they're soft and translucent, which should take 5-7 minutes. Then, stir in the minced garlic and continue cooking until it becomes fragrant, which should take 30 seconds to 1 minute. If you want to add a bit of a savory flavor to your sauce, you can also add about 1 cup (75 grams) of chopped mushrooms to the pan and saute them along with the diced onions."
        },
        {
          "headline":"Add ⁄2 pound (230 g) of ground beef if you want to make a meat sauce.",
          "description":"Simply stir the beef into the onions and garlic and cook it until it browns, which should take around 5 minutes. You can also use ground Italian sausage to give your sauce a spicier flavor. If you choose to add meat to your sauce, continuous stir the meat as you cook it to keep from burning it in the pan."
        }
      ]
    },
    {
      "name":"Adding the Rest of the Ingredients and Simmering",
      "steps":[
        {
          "headline":"Pour the tomatoes into the mix.",
          "description":"For best results, use 4 cups (28 ounces) of whole peeled tomatoes, although canned crushed tomatoes may also be used if that's all you have. Break the whole tomatoes apart with your spatula when you add them to the pan. Be sure to stir the tomatoes after you add them so that they mix with the onions and garlic."
        },
        {
          "headline":"Throw in any seasonings you want to add to the mix.",
          "description":"With the onions, garlic, and olive oil, your sauce will already taste pretty good, but there's no harm in adding some seasoning to it. If you want to season your sauce, try adding ¼ cup (5 grams) of fresh basil, ¼ teaspoon (1.25 grams) of salt, ¼ teaspoon (1.25 grams) of pepper, ½ teaspoon (1 gram) of dried oregano, and 1 bay leaf. Thoroughly stir the seasonings into the mix to make sure they're fully incorporated after you add them. You can also add ⁄2 cup (120 mL) of white wine to give your sauce a sharper flavor."
        },
        {
          "headline":"Allow the sauce to simmer for 30 minutes.",
          "description":"Leave the saucepan uncovered as the sauce simmers and stir the ingredients every 5 minutes or so. Simmering the sauce will allow it to reduce and thicken to the normal consistency of pasta sauce. If the sauce is too watery for your taste after 30 minutes, let it simmer a bit longer until it reaches your desired consistency. If you're using your sauce on spaghetti or some other pasta, now is a great time to go ahead and boil your pasta and get ready to eat."
        },
        {
          "headline":"Remove your sauce from heat and serve it right away.",
          "description":"You can sprinkle a pinch of grated Parmesan or Romano cheese over your sauce for flavoring if desired, although this is optional. Use a ladle to serve the sauce over pasta or enjoy it in a separate recipe. If you added a bay leaf during the cooking process, remove it from the sauce before serving."
        },
        {
          "headline":"Store any leftover marinara sauce in a sealed container.",
          "description":"Place the container in the refrigerator if you plan to use the sauce relatively soon. Alternatively, store the container in the freezer, where the sauce can be kept for up to 6 months. Marinara sauce stored in the refrigerator will remain fresh for 4-5 days."
        }
      ]
    }
  ],
  "text":" Sauteing the Initial Ingredients Pour 3 US tbsp (44 mL) of oil in a pan and place it over medium heat. For best results, use extra-virgin olive oil and pour it into the center of the saucepan. Allow the oil to heat up for about 2-3 minutes before moving on to the next step. Extra-virgin olive oil will give your marinara sauce a much richer flavor than ordinary olive oil will. Medium heat is the middle number on your stovetop dial. For example, if your dial runs from 1 to 10, turn it to 5 to set it to medium heat. Saute the onions and garlic in the pan for about 8 minutes. Add the diced onions first and cook them until they're soft and translucent, which should take 5-7 minutes. Then, stir in the minced garlic and continue cooking until it becomes fragrant, which should take 30 seconds to 1 minute. If you want to add a bit of a savory flavor to your sauce, you can also add about 1 cup (75 grams) of chopped mushrooms to the pan and saute them along with the diced onions. Add ⁄2 pound (230 g) of ground beef if you want to make a meat sauce. Simply stir the beef into the onions and garlic and cook it until it browns, which should take around 5 minutes. You can also use ground Italian sausage to give your sauce a spicier flavor. If you choose to add meat to your sauce, continuous stir the meat as you cook it to keep from burning it in the pan. Adding the Rest of the Ingredients and Simmering Pour the tomatoes into the mix. For best results, use 4 cups (28 ounces) of whole peeled tomatoes, although canned crushed tomatoes may also be used if that's all you have. Break the whole tomatoes apart with your spatula when you add them to the pan. Be sure to stir the tomatoes after you add them so that they mix with the onions and garlic. Throw in any seasonings you want to add to the mix. With the onions, garlic, and olive oil, your sauce will already taste pretty good, but there's no harm in adding some seasoning to it. If you want to season your sauce, try adding ¼ cup (5 grams) of fresh basil, ¼ teaspoon (1.25 grams) of salt, ¼ teaspoon (1.25 grams) of pepper, ½ teaspoon (1 gram) of dried oregano, and 1 bay leaf. Thoroughly stir the seasonings into the mix to make sure they're fully incorporated after you add them. You can also add ⁄2 cup (120 mL) of white wine to give your sauce a sharper flavor. Allow the sauce to simmer for 30 minutes. Leave the saucepan uncovered as the sauce simmers and stir the ingredients every 5 minutes or so. Simmering the sauce will allow it to reduce and thicken to the normal consistency of pasta sauce. If the sauce is too watery for your taste after 30 minutes, let it simmer a bit longer until it reaches your desired consistency. If you're using your sauce on spaghetti or some other pasta, now is a great time to go ahead and boil your pasta and get ready to eat. Remove your sauce from heat and serve it right away. You can sprinkle a pinch of grated Parmesan or Romano cheese over your sauce for flavoring if desired, although this is optional. Use a ladle to serve the sauce over pasta or enjoy it in a separate recipe. If you added a bay leaf during the cooking process, remove it from the sauce before serving. Store any leftover marinara sauce in a sealed container. Place the container in the refrigerator if you plan to use the sauce relatively soon. Alternatively, store the container in the freezer, where the sauce can be kept for up to 6 months. Marinara sauce stored in the refrigerator will remain fresh for 4-5 days.",
  "sentences":[
    " Sauteing the Initial Ingredients Pour 3 US tbsp (44 mL) of oil in a pan and place it over medium heat.",
    "For best results, use extra-virgin olive oil and pour it into the center of the saucepan.",
    "Allow the oil to heat up for about 2-3 minutes before moving on to the next step.",
    "Extra-virgin olive oil will give your marinara sauce a much richer flavor than ordinary olive oil will.",
    "Medium heat is the middle number on your stovetop dial.",
    "For example, if your dial runs from 1 to 10, turn it to 5 to set it to medium heat.",
    "Saute the onions and garlic in the pan for about 8 minutes.",
    "Add the diced onions first and cook them until they're soft and translucent, which should take 5-7 minutes.",
    "Then, stir in the minced garlic and continue cooking until it becomes fragrant, which should take 30 seconds to 1 minute.",
    "If you want to add a bit of a savory flavor to your sauce, you can also add about 1 cup (75 grams) of chopped mushrooms to the pan and saute them along with the diced onions.",
    "Add ⁄2 pound (230 g) of ground beef if you want to make a meat sauce.",
    "Simply stir the beef into the onions and garlic and cook it until it browns, which should take around 5 minutes.",
    "You can also use ground Italian sausage to give your sauce a spicier flavor.",
    "If you choose to add meat to your sauce, continuous stir the meat as you cook it to keep from burning it in the pan.",
    "Adding the Rest of the Ingredients and Simmering Pour the tomatoes into the mix.",
    "For best results, use 4 cups (28 ounces) of whole peeled tomatoes, although canned crushed tomatoes may also be used if that's all you have.",
    "Break the whole tomatoes apart with your spatula when you add them to the pan.",
    "Be sure to stir the tomatoes after you add them so that they mix with the onions and garlic.",
    "Throw in any seasonings you want to add to the mix.",
    "With the onions, garlic, and olive oil, your sauce will already taste pretty good, but there's no harm in adding some seasoning to it.",
    "If you want to season your sauce, try adding ¼ cup (5 grams) of fresh basil, ¼ teaspoon (1.25 grams) of salt, ¼ teaspoon (1.25 grams) of pepper, ½ teaspoon (1 gram) of dried oregano, and 1 bay leaf.",
    "Thoroughly stir the seasonings into the mix to make sure they're fully incorporated after you add them.",
    "You can also add ⁄2 cup (120 mL) of white wine to give your sauce a sharper flavor.",
    "Allow the sauce to simmer for 30 minutes.",
    "Leave the saucepan uncovered as the sauce simmers and stir the ingredients every 5 minutes or so.",
    "Simmering the sauce will allow it to reduce and thicken to the normal consistency of pasta sauce.",
    "If the sauce is too watery for your taste after 30 minutes, let it simmer a bit longer until it reaches your desired consistency.",
    "If you're using your sauce on spaghetti or some other pasta, now is a great time to go ahead and boil your pasta and get ready to eat.",
    "Remove your sauce from heat and serve it right away.",
    "You can sprinkle a pinch of grated Parmesan or Romano cheese over your sauce for flavoring if desired, although this is optional.",
    "Use a ladle to serve the sauce over pasta or enjoy it in a separate recipe.",
    "If you added a bay leaf during the cooking process, remove it from the sauce before serving.",
    "Store any leftover marinara sauce in a sealed container.",
    "Place the container in the refrigerator if you plan to use the sauce relatively soon.",
    "Alternatively, store the container in the freezer, where the sauce can be kept for up to 6 months.",
    "Marinara sauce stored in the refrigerator will remain fresh for 4-5 days."
  ],
  "tyn_section":[
    "Saucepan",
    "Spatula",
    "Airtight storage container"
  ],
  "tyn_model":[
    "onions",
    "garlic",
    "tomatoes",
    "marinara sauce",
    "oil",
    "pan",
    "extra-virgin olive oil",
    "saucepan",
    "olive oil",
    "refrigerator",
    "mushrooms",
    "ground beef",
    "crushed tomatoes",
    "spatula",
    "basil",
    "salt",
    "pepper",
    "dried oregano",
    "seasonings",
    "wine",
    "pasta sauce",
    "pasta",
    "ladle",
    "bay leaf",
    "freezer"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.08,
    "f1":0.1428571429,
    "avg_pos":0.28
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.08,
    "f1":0.1428571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.08,
    "f1":0.1428571429
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.08,
    "f1":0.1428571429
  }
}