{
  "title":"How to Marinate Salmon",
  "url":"https://www.wikihow.com/Marinate-Salmon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Salmon"
  ],
  "methods":[
    {
      "name":"Marinating in Lemon and Olive Oil",
      "steps":[
        {
          "headline":"Start this process 30–60 minutes before you plan to eat.",
          "description":"Salmon only needs to be marinated for about 15–30 minutes. Start preparing the marinade an hour before you plan to eat, or even less, depending on your cooking method. Cooking methods are described at the end of this section."
        },
        {
          "headline":"Squeeze the lemon juice into a bowl.",
          "description":"Place the lemon on a cutting board and slice it in half. Squeeze both lemon halves over a bowl.."
        },
        {
          "headline":"Mix in the other ingredients.",
          "description":"Pour 2 tbsp (30 mL) olive oil into the bowl of lemon juice. Add 1/2 tsp (2.5 mL) dried thyme, and stir the ingredients together with a spoon until well mixed. Another popular version of this marinade uses dill instead of thyme."
        },
        {
          "headline":"Pour the marinade into a wide dish.",
          "description":"Select a dish large enough that all your salmon fillets can fit into it side by side. You may need to use several dishes if you are doubling or tripling the recipe. Alternatively, use a large zip locked bag."
        },
        {
          "headline":"Place the salmon in the marinade.",
          "description":"Lay the salmon fillets in the dish containing the marinade. Turn them a couple times to make sure each side is covered. Food safety experts recommend that you do not wash raw salmon or other raw meat before preparing. Cooking the meat is more effective at killing bacteria, and rinsing the meat is likely to spread the bacteria onto your sink or other places in your kitchen. Wash your hands with soap and warm water for twenty seconds after handling raw meat."
        },
        {
          "headline":"Cover and refrigerate for 15–30 minutes, turning once.",
          "description":"Unlike red meat and poultry, fish can develop an unpleasant texture during a lengthy marination process. For an acidic marinade such as this one, based on lemon juice, keep the salmon in the marinade for no longer than 30 minutes. Flip the salmon over once during this time to ensure that both sides of the fish are marinated."
        },
        {
          "headline":"Remove the fish from the marinade.",
          "description":"Transfer the fish to another container. Discard the remaining liquid. If you wish to use the marinade as a sauce, first bring it to a boil in order to kill harmful bacteria from the raw meat."
        },
        {
          "headline":"Cook the salmon.",
          "description":"After the salmon has been marinated, it can be prepared in a number of ways. Two popular options are grilling the salmon wrapped in foil, or baking it on a foil-lined baking sheet. In either case, cook the fillets at 400ºF (200ºC) for about fifteen minutes. The salmon is ready when a fork can easily remove flakes from the surface. Flip the salmon halfway through the cooking process if you are grilling it."
        }
      ]
    },
    {
      "name":"Marinating in Soy Sauce and Ginger",
      "steps":[
        {
          "headline":"Prepare the aromatic ingredients.",
          "description":"Peel 1 tbsp (15 mL) fresh ginger and two cloves of garlic, then finely chop along with 3 scallions. Feel free to add additional spices. Consider 1 tbsp (15 mL) sesame oil and 1 tbsp (15 mL) sesame seeds to match the other East Asian ingredients."
        },
        {
          "headline":"Mix with the other marinated ingredients.",
          "description":"Mix the flavorful ingredients together with 1/4 cup (60 mL) olive oil and 3 tbsp (45 mL) soy sauce."
        },
        {
          "headline":"Marinate the salmon.",
          "description":"Pour the marinade into a zip locked bag or a wide dish, then place the salmon in the marinade. Refrigerate, turning fillets occasionally, for 30–60 minutes. If you continue to marinade past that point, the texture of the fish may be compromised. Because the marinade was in contact with raw fish, it should be discarded after use, or brought to a boil before using as a sauce."
        },
        {
          "headline":"Prepare the glaze (optional).",
          "description":"If you like, you can create a glaze to brush onto your salmon for additional flavor during cooking. A simple glaze that pairs well with this marinade is a mixture of 2 tbsp (30 mL) honey, 1 tsp (5 mL) soy sauce, and 1/2 tsp (2.5 mL) Sriracha. Feel free to experiment with the amounts until you find a flavor you enjoy, keeping in mind the glaze may seem overpowering when tasted on its own, rather that eaten on the salmon."
        },
        {
          "headline":"Cook your salmon.",
          "description":"Consider pan-searing your salmon to a temperature of 125–140ºF (52–60ºC) on each side. If you do not have a thermometer, avoid overcooking by cooking only skin-side down, briefly cooking the flesh side for only 15–30 seconds once the salmon is opaque but still mostly juicy. You may eat the skin of the salmon, or remove it after cooking. You may also grill, bake, broil, or poach your salmon after marinading."
        }
      ]
    },
    {
      "name":"Creating Gravlax",
      "steps":[
        {
          "headline":"Use this recipe to preserve the salmon to eat raw.",
          "description":"Gravlax, also called gravad lax, is a traditional Nordic dish which uses salt and sugar to cure the salmon. Various herbs are used to give flavor to the salmon, typically white pepper and dill, and the salmon is eaten raw after the curing process is finished. Note: because the salmon is never cooked, keeping preparation surfaces and tools especially clean throughout the process is highly recommended."
        },
        {
          "headline":"Start with fresh, farm-raised salmon.",
          "description":"Use high-quality salmon if possible, acquired from a trustworthy source. Using farm-raised salmon is recommended, due to a lower chance of health issues. Although the chance of parasites is not high to begin with, you can reduce the risk further by freezing the salmon first, then defrosting it."
        },
        {
          "headline":"Remove the bones and scales.",
          "description":"Use a pair of tweezers or a small knife and fork to remove the scales and bones of the fish. Leave the dark skin beneath the scales attached to the rest of the salmon."
        },
        {
          "headline":"Make several shallow cuts in the skin.",
          "description":"These cuts allow the spice mixture to soak into the salmon, giving it more flavor and better preservation."
        },
        {
          "headline":"Mix the dry ingredients together.",
          "description":"Chop up one bunch of dill, or about 8 tbsp (120 mL), and crush 1 tsp (5 mL) white peppercorns. Mix these into 3¼ oz (85 g) sugar and 4 oz (120 g) salt. Experienced gravlax chefs will vary the ratios of these ingredients to suit their tastes, but the large quantities of sugar and salt are important so the salmon is properly cured."
        },
        {
          "headline":"Cover the spices with salmon.",
          "description":"Heap the spice mix onto the salmon fillets, turning the salmon to make sure it is exposed to the mixture on all sides."
        },
        {
          "headline":"Weigh down the salmon.",
          "description":"Place the salmon in a glass or stainless steel container, touching the salmon fillets together on the pink flesh side, rather than the dark skin side. Cover completely with plastic wrap, then press the fish down with any heavy object, such as a brick."
        },
        {
          "headline":"Leave at room temperature for six hours.",
          "description":"During this time, the salt and sugar should melt into the salmon, adding a stronger flavor. If you are not comfortable preparing raw food, you may wish to move the fish directly to the refrigerator instead, reducing the risk of bacterial growth."
        },
        {
          "headline":"Refrigerate the fish for one to three days.",
          "description":"Move the salmon to the refrigerator, keeping the weight on top of it. The longer you keep it there, the stronger the flavor will be, and the drier the fish will get. Try testing it every 24 hours to see if you enjoy the flavor."
        },
        {
          "headline":"Remove the salmon from the container.",
          "description":"Once the salmon has achieved the flavor and texture you prefer, take it out of the container. Scrape off all the spices, and discard any liquid that has been created."
        },
        {
          "headline":"Serve with mustard dill sauce.",
          "description":"This common pairing with gravlax can be found at scandinavian food stores. Alternatively, you can make it yourself using the ingredients for the \"sauce\" listed beneath the gravlax recipe. Mix the mustards, sugar, and vinegar together first, then pour the oil slowly into the mix while stirring. Once it has reached a mayonnaise consistency, stir in the chopped dill and season with white pepper and salt to taste. Rye crackers or rye bread are another common food served together with gravlax."
        }
      ]
    }
  ],
  "text":" Marinating in Lemon and Olive Oil Start this process 30–60 minutes before you plan to eat. Salmon only needs to be marinated for about 15–30 minutes. Start preparing the marinade an hour before you plan to eat, or even less, depending on your cooking method. Cooking methods are described at the end of this section. Squeeze the lemon juice into a bowl. Place the lemon on a cutting board and slice it in half. Squeeze both lemon halves over a bowl.. Mix in the other ingredients. Pour 2 tbsp (30 mL) olive oil into the bowl of lemon juice. Add 1/2 tsp (2.5 mL) dried thyme, and stir the ingredients together with a spoon until well mixed. Another popular version of this marinade uses dill instead of thyme. Pour the marinade into a wide dish. Select a dish large enough that all your salmon fillets can fit into it side by side. You may need to use several dishes if you are doubling or tripling the recipe. Alternatively, use a large zip locked bag. Place the salmon in the marinade. Lay the salmon fillets in the dish containing the marinade. Turn them a couple times to make sure each side is covered. Food safety experts recommend that you do not wash raw salmon or other raw meat before preparing. Cooking the meat is more effective at killing bacteria, and rinsing the meat is likely to spread the bacteria onto your sink or other places in your kitchen. Wash your hands with soap and warm water for twenty seconds after handling raw meat. Cover and refrigerate for 15–30 minutes, turning once. Unlike red meat and poultry, fish can develop an unpleasant texture during a lengthy marination process. For an acidic marinade such as this one, based on lemon juice, keep the salmon in the marinade for no longer than 30 minutes. Flip the salmon over once during this time to ensure that both sides of the fish are marinated. Remove the fish from the marinade. Transfer the fish to another container. Discard the remaining liquid. If you wish to use the marinade as a sauce, first bring it to a boil in order to kill harmful bacteria from the raw meat. Cook the salmon. After the salmon has been marinated, it can be prepared in a number of ways. Two popular options are grilling the salmon wrapped in foil, or baking it on a foil-lined baking sheet. In either case, cook the fillets at 400ºF (200ºC) for about fifteen minutes. The salmon is ready when a fork can easily remove flakes from the surface. Flip the salmon halfway through the cooking process if you are grilling it. Marinating in Soy Sauce and Ginger Prepare the aromatic ingredients. Peel 1 tbsp (15 mL) fresh ginger and two cloves of garlic, then finely chop along with 3 scallions. Feel free to add additional spices. Consider 1 tbsp (15 mL) sesame oil and 1 tbsp (15 mL) sesame seeds to match the other East Asian ingredients. Mix with the other marinated ingredients. Mix the flavorful ingredients together with 1/4 cup (60 mL) olive oil and 3 tbsp (45 mL) soy sauce. Marinate the salmon. Pour the marinade into a zip locked bag or a wide dish, then place the salmon in the marinade. Refrigerate, turning fillets occasionally, for 30–60 minutes. If you continue to marinade past that point, the texture of the fish may be compromised. Because the marinade was in contact with raw fish, it should be discarded after use, or brought to a boil before using as a sauce. Prepare the glaze (optional). If you like, you can create a glaze to brush onto your salmon for additional flavor during cooking. A simple glaze that pairs well with this marinade is a mixture of 2 tbsp (30 mL) honey, 1 tsp (5 mL) soy sauce, and 1/2 tsp (2.5 mL) Sriracha. Feel free to experiment with the amounts until you find a flavor you enjoy, keeping in mind the glaze may seem overpowering when tasted on its own, rather that eaten on the salmon. Cook your salmon. Consider pan-searing your salmon to a temperature of 125–140ºF (52–60ºC) on each side. If you do not have a thermometer, avoid overcooking by cooking only skin-side down, briefly cooking the flesh side for only 15–30 seconds once the salmon is opaque but still mostly juicy. You may eat the skin of the salmon, or remove it after cooking. You may also grill, bake, broil, or poach your salmon after marinading. Creating Gravlax Use this recipe to preserve the salmon to eat raw. Gravlax, also called gravad lax, is a traditional Nordic dish which uses salt and sugar to cure the salmon. Various herbs are used to give flavor to the salmon, typically white pepper and dill, and the salmon is eaten raw after the curing process is finished. Note: because the salmon is never cooked, keeping preparation surfaces and tools especially clean throughout the process is highly recommended. Start with fresh, farm-raised salmon. Use high-quality salmon if possible, acquired from a trustworthy source. Using farm-raised salmon is recommended, due to a lower chance of health issues. Although the chance of parasites is not high to begin with, you can reduce the risk further by freezing the salmon first, then defrosting it. Remove the bones and scales. Use a pair of tweezers or a small knife and fork to remove the scales and bones of the fish. Leave the dark skin beneath the scales attached to the rest of the salmon. Make several shallow cuts in the skin. These cuts allow the spice mixture to soak into the salmon, giving it more flavor and better preservation. Mix the dry ingredients together. Chop up one bunch of dill, or about 8 tbsp (120 mL), and crush 1 tsp (5 mL) white peppercorns. Mix these into 3¼ oz (85 g) sugar and 4 oz (120 g) salt. Experienced gravlax chefs will vary the ratios of these ingredients to suit their tastes, but the large quantities of sugar and salt are important so the salmon is properly cured. Cover the spices with salmon. Heap the spice mix onto the salmon fillets, turning the salmon to make sure it is exposed to the mixture on all sides. Weigh down the salmon. Place the salmon in a glass or stainless steel container, touching the salmon fillets together on the pink flesh side, rather than the dark skin side. Cover completely with plastic wrap, then press the fish down with any heavy object, such as a brick. Leave at room temperature for six hours. During this time, the salt and sugar should melt into the salmon, adding a stronger flavor. If you are not comfortable preparing raw food, you may wish to move the fish directly to the refrigerator instead, reducing the risk of bacterial growth. Refrigerate the fish for one to three days. Move the salmon to the refrigerator, keeping the weight on top of it. The longer you keep it there, the stronger the flavor will be, and the drier the fish will get. Try testing it every 24 hours to see if you enjoy the flavor. Remove the salmon from the container. Once the salmon has achieved the flavor and texture you prefer, take it out of the container. Scrape off all the spices, and discard any liquid that has been created. Serve with mustard dill sauce. This common pairing with gravlax can be found at scandinavian food stores. Alternatively, you can make it yourself using the ingredients for the \"sauce\" listed beneath the gravlax recipe. Mix the mustards, sugar, and vinegar together first, then pour the oil slowly into the mix while stirring. Once it has reached a mayonnaise consistency, stir in the chopped dill and season with white pepper and salt to taste. Rye crackers or rye bread are another common food served together with gravlax.",
  "sentences":[
    " Marinating in Lemon and Olive Oil Start this process 30–60 minutes before you plan to eat.",
    "Salmon only needs to be marinated for about 15–30 minutes.",
    "Start preparing the marinade an hour before you plan to eat, or even less, depending on your cooking method.",
    "Cooking methods are described at the end of this section.",
    "Squeeze the lemon juice into a bowl.",
    "Place the lemon on a cutting board and slice it in half.",
    "Squeeze both lemon halves over a bowl..",
    "Mix in the other ingredients.",
    "Pour 2 tbsp (30 mL) olive oil into the bowl of lemon juice.",
    "Add 1/2 tsp (2.5 mL) dried thyme, and stir the ingredients together with a spoon until well mixed.",
    "Another popular version of this marinade uses dill instead of thyme.",
    "Pour the marinade into a wide dish.",
    "Select a dish large enough that all your salmon fillets can fit into it side by side.",
    "You may need to use several dishes if you are doubling or tripling the recipe.",
    "Alternatively, use a large zip locked bag.",
    "Place the salmon in the marinade.",
    "Lay the salmon fillets in the dish containing the marinade.",
    "Turn them a couple times to make sure each side is covered.",
    "Food safety experts recommend that you do not wash raw salmon or other raw meat before preparing.",
    "Cooking the meat is more effective at killing bacteria, and rinsing the meat is likely to spread the bacteria onto your sink or other places in your kitchen.",
    "Wash your hands with soap and warm water for twenty seconds after handling raw meat.",
    "Cover and refrigerate for 15–30 minutes, turning once.",
    "Unlike red meat and poultry, fish can develop an unpleasant texture during a lengthy marination process.",
    "For an acidic marinade such as this one, based on lemon juice, keep the salmon in the marinade for no longer than 30 minutes.",
    "Flip the salmon over once during this time to ensure that both sides of the fish are marinated.",
    "Remove the fish from the marinade.",
    "Transfer the fish to another container.",
    "Discard the remaining liquid.",
    "If you wish to use the marinade as a sauce, first bring it to a boil in order to kill harmful bacteria from the raw meat.",
    "Cook the salmon.",
    "After the salmon has been marinated, it can be prepared in a number of ways.",
    "Two popular options are grilling the salmon wrapped in foil, or baking it on a foil-lined baking sheet.",
    "In either case, cook the fillets at 400ºF (200ºC) for about fifteen minutes.",
    "The salmon is ready when a fork can easily remove flakes from the surface.",
    "Flip the salmon halfway through the cooking process if you are grilling it.",
    "Marinating in Soy Sauce and Ginger Prepare the aromatic ingredients.",
    "Peel 1 tbsp (15 mL) fresh ginger and two cloves of garlic, then finely chop along with 3 scallions.",
    "Feel free to add additional spices.",
    "Consider 1 tbsp (15 mL) sesame oil and 1 tbsp (15 mL) sesame seeds to match the other East Asian ingredients.",
    "Mix with the other marinated ingredients.",
    "Mix the flavorful ingredients together with 1/4 cup (60 mL) olive oil and 3 tbsp (45 mL) soy sauce.",
    "Marinate the salmon.",
    "Pour the marinade into a zip locked bag or a wide dish, then place the salmon in the marinade.",
    "Refrigerate, turning fillets occasionally, for 30–60 minutes.",
    "If you continue to marinade past that point, the texture of the fish may be compromised.",
    "Because the marinade was in contact with raw fish, it should be discarded after use, or brought to a boil before using as a sauce.",
    "Prepare the glaze (optional).",
    "If you like, you can create a glaze to brush onto your salmon for additional flavor during cooking.",
    "A simple glaze that pairs well with this marinade is a mixture of 2 tbsp (30 mL) honey, 1 tsp (5 mL) soy sauce, and 1/2 tsp (2.5 mL) Sriracha.",
    "Feel free to experiment with the amounts until you find a flavor you enjoy, keeping in mind the glaze may seem overpowering when tasted on its own, rather that eaten on the salmon.",
    "Cook your salmon.",
    "Consider pan-searing your salmon to a temperature of 125–140ºF (52–60ºC) on each side.",
    "If you do not have a thermometer, avoid overcooking by cooking only skin-side down, briefly cooking the flesh side for only 15–30 seconds once the salmon is opaque but still mostly juicy.",
    "You may eat the skin of the salmon, or remove it after cooking.",
    "You may also grill, bake, broil, or poach your salmon after marinading.",
    "Creating Gravlax Use this recipe to preserve the salmon to eat raw.",
    "Gravlax, also called gravad lax, is a traditional Nordic dish which uses salt and sugar to cure the salmon.",
    "Various herbs are used to give flavor to the salmon, typically white pepper and dill, and the salmon is eaten raw after the curing process is finished.",
    "Note: because the salmon is never cooked, keeping preparation surfaces and tools especially clean throughout the process is highly recommended.",
    "Start with fresh, farm-raised salmon.",
    "Use high-quality salmon if possible, acquired from a trustworthy source.",
    "Using farm-raised salmon is recommended, due to a lower chance of health issues.",
    "Although the chance of parasites is not high to begin with, you can reduce the risk further by freezing the salmon first, then defrosting it.",
    "Remove the bones and scales.",
    "Use a pair of tweezers or a small knife and fork to remove the scales and bones of the fish.",
    "Leave the dark skin beneath the scales attached to the rest of the salmon.",
    "Make several shallow cuts in the skin.",
    "These cuts allow the spice mixture to soak into the salmon, giving it more flavor and better preservation.",
    "Mix the dry ingredients together.",
    "Chop up one bunch of dill, or about 8 tbsp (120 mL), and crush 1 tsp (5 mL) white peppercorns.",
    "Mix these into 3¼ oz (85 g) sugar and 4 oz (120 g) salt.",
    "Experienced gravlax chefs will vary the ratios of these ingredients to suit their tastes, but the large quantities of sugar and salt are important so the salmon is properly cured.",
    "Cover the spices with salmon.",
    "Heap the spice mix onto the salmon fillets, turning the salmon to make sure it is exposed to the mixture on all sides.",
    "Weigh down the salmon.",
    "Place the salmon in a glass or stainless steel container, touching the salmon fillets together on the pink flesh side, rather than the dark skin side.",
    "Cover completely with plastic wrap, then press the fish down with any heavy object, such as a brick.",
    "Leave at room temperature for six hours.",
    "During this time, the salt and sugar should melt into the salmon, adding a stronger flavor.",
    "If you are not comfortable preparing raw food, you may wish to move the fish directly to the refrigerator instead, reducing the risk of bacterial growth.",
    "Refrigerate the fish for one to three days.",
    "Move the salmon to the refrigerator, keeping the weight on top of it.",
    "The longer you keep it there, the stronger the flavor will be, and the drier the fish will get.",
    "Try testing it every 24 hours to see if you enjoy the flavor.",
    "Remove the salmon from the container.",
    "Once the salmon has achieved the flavor and texture you prefer, take it out of the container.",
    "Scrape off all the spices, and discard any liquid that has been created.",
    "Serve with mustard dill sauce.",
    "This common pairing with gravlax can be found at scandinavian food stores.",
    "Alternatively, you can make it yourself using the ingredients for the \"sauce\" listed beneath the gravlax recipe.",
    "Mix the mustards, sugar, and vinegar together first, then pour the oil slowly into the mix while stirring.",
    "Once it has reached a mayonnaise consistency, stir in the chopped dill and season with white pepper and salt to taste.",
    "Rye crackers or rye bread are another common food served together with gravlax."
  ],
  "tyn_section":[
    "Cutting board",
    "Sharp knife",
    "Shallow dish (or resealable plastic bag)",
    "Measuring spoons"
  ],
  "tyn_model":[
    "salmon",
    "fish",
    "sugar",
    "salt",
    "olive oil",
    "lemon",
    "bowl",
    "dill",
    "container",
    "soy sauce",
    "lemon juice",
    "dish",
    "spices",
    "gravlax",
    "white pepper",
    "refrigerator",
    "cutting board",
    "dried thyme",
    "spoon",
    "thyme",
    "soap",
    "water",
    "poultry",
    "foil",
    "baking sheet",
    "ginger",
    "fresh ginger",
    "garlic",
    "scallions",
    "sesame oil",
    "sesame seeds",
    "east asian ingredients",
    "zip locked bag",
    "honey",
    "sriracha",
    "grill",
    "herbs",
    "tweezers",
    "small knife",
    "fork",
    "white peppercorns",
    "gravlax chefs",
    "spice mix",
    "stainless steel container",
    "plastic wrap",
    "mustard dill sauce",
    "mustards",
    "vinegar",
    "oil",
    "rye crackers",
    "rye bread"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0196078431,
    "f1":0.0363636364,
    "avg_pos":0.3137254902
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.0196078431,
    "f1":0.0363636364
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0392156863,
    "f1":0.0727272727
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0196078431,
    "f1":0.0363636364
  }
}