{
  "title":"How to Puree Meat",
  "url":"https://www.wikihow.com/Puree-Meat",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "parts":[
    {
      "name":"Prepping the Meat",
      "steps":[
        {
          "headline":"Choose tender cuts of meat.",
          "description":"The more tender the meat you use, the smoother and better-tasting your puree will be. Whether you're pureeing beef, chicken, pork or lamb, you want to choose a tender cut that won't toughen up when cooked. Often the cheapest cuts of beef are the toughest, so try choosing a cut like top sirloin. For chicken, you can buy the meat boneless or bone-in. If you buy it bone-in, you'll have to be careful to make sure no tiny bones get mixed in with the puree."
        },
        {
          "headline":"Cook the meat slowly.",
          "description":"Slow cooking methods help the meat retain flavor and moisture, making it much easier to puree. No matter what type of meat you use, consider cooking it slowly so you end up with the best possible texture. Here are some methods that work well:\n\n Braising. Using a slow cooker. Boiling"
        },
        {
          "headline":"Make sure it's cooked to the correct temperature.",
          "description":"The meat must be completely pre-cooked before you puree it. Check the temperature of the meat when it's done to make sure it has reached the correct internal temperature. Here are the correct temperatures for different types of meat:\nChicken: 165 °F (74 °C)\nPork: 160 °F (71 °C)\nBeef: 145 °F (63 °C)\nLamb: 145 °F (63 °C)"
        },
        {
          "headline":"Chill the meat thoroughly.",
          "description":"After cooking, chill the meat in the refrigerator for at least 2 hours. The meat should be completely chilled in preparation for processing. Chilled meat will process into much finer pieces than meat that is still warm."
        },
        {
          "headline":"Chop it into 1-inch pieces.",
          "description":"Remove it from the refrigerator and chop the meat into chunks that will fit easily in your food processor."
        }
      ]
    },
    {
      "name":"Pureeing the Meat",
      "steps":[
        {
          "headline":"Place a cup of meat in a food processor.",
          "description":"If you don't have a food processor, it's fine to use a blender, although the resulting puree may not be as silky-smooth as puree that was made in a food processor."
        },
        {
          "headline":"Blend the meat until it's powdery.",
          "description":"\"Powdery\" may seem like a strange word to describe meat, but that's the texture it will take on when you process it cold. Keep processing the meat until the pieces are very fine, almost like sand."
        },
        {
          "headline":"Add liquid and keep blending.",
          "description":"In order to process the meat into a smooth puree, you'll need to add some liquid to loosen it up. You'll need 1/4 cup of liquid per 1 cup of meat, regardless of what kind of meat you're pureeing. Choose from among the following liquids:\nCooking liquid reserved from cooking the meat\nSodium-free meat broth\nWater"
        },
        {
          "headline":"Store the pureed meat in the refrigerator.",
          "description":"After the puree has reached your desired consistency, spoon it into a food storage container with a tight-fitting lid. Store the puree in the refrigerator until use. It will keep safely for three to four days. You can freeze pureed meat for later use if desired. Be sure to store it in a freezer-safe container. Before serving, let the puree come to room temperature or heat it gently in the microwave."
        }
      ]
    },
    {
      "name":"Trying Variations",
      "steps":[
        {
          "headline":"Mix in Puree Vegetables pureed vegetables for a baby.",
          "description":"You can make a complete pureed meal for a baby by mixing some pureed vegetables in with the pureed meat. This adds flavor and substance. Try the following combinations:\nChicken puree mixed with carrot puree\nBeef puree mixed with pea puree\nPork puree mixed with apple puree"
        },
        {
          "headline":"Season the meat if it's for an adult.",
          "description":"While babies don't need salt and other extra seasonings, an adult might find pureed meat more appetizing if you add some salt and spices. To a cup of any type of pureed meat, add 1/4 teaspoon salt and 1/2 teaspoon of the spices of your choice."
        },
        {
          "headline":"Make chunkier puree.",
          "description":"If your baby is getting older and can chew larger chunks of meat, you can make puree with more than one consistency. Instead of pureeing the meat until it's completely smooth, stop when there are still chunks in the puree. As an alternative, add chunks of cooked vegetables to a smooth meat puree."
        }
      ]
    }
  ],
  "text":" Prepping the Meat Choose tender cuts of meat. The more tender the meat you use, the smoother and better-tasting your puree will be. Whether you're pureeing beef, chicken, pork or lamb, you want to choose a tender cut that won't toughen up when cooked. Often the cheapest cuts of beef are the toughest, so try choosing a cut like top sirloin. For chicken, you can buy the meat boneless or bone-in. If you buy it bone-in, you'll have to be careful to make sure no tiny bones get mixed in with the puree. Cook the meat slowly. Slow cooking methods help the meat retain flavor and moisture, making it much easier to puree. No matter what type of meat you use, consider cooking it slowly so you end up with the best possible texture. Here are some methods that work well:\n\n Braising. Using a slow cooker. Boiling Make sure it's cooked to the correct temperature. The meat must be completely pre-cooked before you puree it. Check the temperature of the meat when it's done to make sure it has reached the correct internal temperature. Here are the correct temperatures for different types of meat:\nChicken: 165 °F (74 °C)\nPork: 160 °F (71 °C)\nBeef: 145 °F (63 °C)\nLamb: 145 °F (63 °C) Chill the meat thoroughly. After cooking, chill the meat in the refrigerator for at least 2 hours. The meat should be completely chilled in preparation for processing. Chilled meat will process into much finer pieces than meat that is still warm. Chop it into 1-inch pieces. Remove it from the refrigerator and chop the meat into chunks that will fit easily in your food processor. Pureeing the Meat Place a cup of meat in a food processor. If you don't have a food processor, it's fine to use a blender, although the resulting puree may not be as silky-smooth as puree that was made in a food processor. Blend the meat until it's powdery. \"Powdery\" may seem like a strange word to describe meat, but that's the texture it will take on when you process it cold. Keep processing the meat until the pieces are very fine, almost like sand. Add liquid and keep blending. In order to process the meat into a smooth puree, you'll need to add some liquid to loosen it up. You'll need 1/4 cup of liquid per 1 cup of meat, regardless of what kind of meat you're pureeing. Choose from among the following liquids:\nCooking liquid reserved from cooking the meat\nSodium-free meat broth\nWater Store the pureed meat in the refrigerator. After the puree has reached your desired consistency, spoon it into a food storage container with a tight-fitting lid. Store the puree in the refrigerator until use. It will keep safely for three to four days. You can freeze pureed meat for later use if desired. Be sure to store it in a freezer-safe container. Before serving, let the puree come to room temperature or heat it gently in the microwave. Trying Variations Mix in Puree Vegetables pureed vegetables for a baby. You can make a complete pureed meal for a baby by mixing some pureed vegetables in with the pureed meat. This adds flavor and substance. Try the following combinations:\nChicken puree mixed with carrot puree\nBeef puree mixed with pea puree\nPork puree mixed with apple puree Season the meat if it's for an adult. While babies don't need salt and other extra seasonings, an adult might find pureed meat more appetizing if you add some salt and spices. To a cup of any type of pureed meat, add 1/4 teaspoon salt and 1/2 teaspoon of the spices of your choice. Make chunkier puree. If your baby is getting older and can chew larger chunks of meat, you can make puree with more than one consistency. Instead of pureeing the meat until it's completely smooth, stop when there are still chunks in the puree. As an alternative, add chunks of cooked vegetables to a smooth meat puree.",
  "sentences":[
    " Prepping the Meat Choose tender cuts of meat.",
    "The more tender the meat you use, the smoother and better-tasting your puree will be.",
    "Whether you're pureeing beef, chicken, pork or lamb, you want to choose a tender cut that won't toughen up when cooked.",
    "Often the cheapest cuts of beef are the toughest, so try choosing a cut like top sirloin.",
    "For chicken, you can buy the meat boneless or bone-in.",
    "If you buy it bone-in, you'll have to be careful to make sure no tiny bones get mixed in with the puree.",
    "Cook the meat slowly.",
    "Slow cooking methods help the meat retain flavor and moisture, making it much easier to puree.",
    "No matter what type of meat you use, consider cooking it slowly so you end up with the best possible texture.",
    "Here are some methods that work well:\n\n Braising.",
    "Using a slow cooker.",
    "Boiling Make sure it's cooked to the correct temperature.",
    "The meat must be completely pre-cooked before you puree it.",
    "Check the temperature of the meat when it's done to make sure it has reached the correct internal temperature.",
    "Here are the correct temperatures for different types of meat:\nChicken: 165 °F (74 °C)\nPork: 160 °F (71 °C)\nBeef: 145 °F (63 °C)\nLamb: 145 °F (63 °C) Chill the meat thoroughly.",
    "After cooking, chill the meat in the refrigerator for at least 2 hours.",
    "The meat should be completely chilled in preparation for processing.",
    "Chilled meat will process into much finer pieces than meat that is still warm.",
    "Chop it into 1-inch pieces.",
    "Remove it from the refrigerator and chop the meat into chunks that will fit easily in your food processor.",
    "Pureeing the Meat Place a cup of meat in a food processor.",
    "If you don't have a food processor, it's fine to use a blender, although the resulting puree may not be as silky-smooth as puree that was made in a food processor.",
    "Blend the meat until it's powdery.",
    "\"Powdery\" may seem like a strange word to describe meat, but that's the texture it will take on when you process it cold.",
    "Keep processing the meat until the pieces are very fine, almost like sand.",
    "Add liquid and keep blending.",
    "In order to process the meat into a smooth puree, you'll need to add some liquid to loosen it up.",
    "You'll need 1/4 cup of liquid per 1 cup of meat, regardless of what kind of meat you're pureeing.",
    "Choose from among the following liquids:\nCooking liquid reserved from cooking the meat\nSodium-free meat broth\nWater Store the pureed meat in the refrigerator.",
    "After the puree has reached your desired consistency, spoon it into a food storage container with a tight-fitting lid.",
    "Store the puree in the refrigerator until use.",
    "It will keep safely for three to four days.",
    "You can freeze pureed meat for later use if desired.",
    "Be sure to store it in a freezer-safe container.",
    "Before serving, let the puree come to room temperature or heat it gently in the microwave.",
    "Trying Variations Mix in Puree Vegetables pureed vegetables for a baby.",
    "You can make a complete pureed meal for a baby by mixing some pureed vegetables in with the pureed meat.",
    "This adds flavor and substance.",
    "Try the following combinations:\nChicken puree mixed with carrot puree\nBeef puree mixed with pea puree\nPork puree mixed with apple puree Season the meat if it's for an adult.",
    "While babies don't need salt and other extra seasonings, an adult might find pureed meat more appetizing if you add some salt and spices.",
    "To a cup of any type of pureed meat, add 1/4 teaspoon salt and 1/2 teaspoon of the spices of your choice.",
    "Make chunkier puree.",
    "If your baby is getting older and can chew larger chunks of meat, you can make puree with more than one consistency.",
    "Instead of pureeing the meat until it's completely smooth, stop when there are still chunks in the puree.",
    "As an alternative, add chunks of cooked vegetables to a smooth meat puree."
  ],
  "tyn_section":[
    "Meat",
    "Cutting board",
    "Chef’s knife",
    "Slotted spoon",
    "Slow cooker",
    "Food processor or blender"
  ],
  "tyn_model":[
    "refrigerator",
    "food processor",
    "vegetables",
    "pork",
    "lamb",
    "beef",
    "meat",
    "liquid",
    "salt",
    "spices",
    "sirloin",
    "slow cooker",
    "blender",
    "sodium-free meat broth",
    "water",
    "food storage container",
    "microwave",
    "chicken",
    "carrot puree",
    "beef puree",
    "pea puree",
    "apple puree",
    "puree",
    "meat puree"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0833333333,
    "f1":0.1333333333,
    "avg_pos":0.25
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1666666667,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2083333333,
    "f1":0.2941176471
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0833333333,
    "f1":0.1333333333
  }
}