{
  "title":"How to Hook Up an Atari to a Modern Television Set",
  "url":"https://www.wikihow.com/Hook-Up-an-Atari-to-a-Modern-Television-Set",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Video Game Console Maintenance and Repair"
  ],
  "steps":[
    {
      "headline":"Plug in the Atari to an outlet.",
      "description":"It's obviously not going to work unless it has some power."
    },
    {
      "headline":"If you have the original TV/Game switchbox that came with the Atari console, you can try to hook this up.",
      "description":"Unless your television is old enough to still have places to screw the two wires with the U-shaped things on the end, you will need an adapter."
    },
    {
      "headline":"Purchase an adapter for about $5.",
      "description":"This adapter is designed to screw down the two U-shaped prongs and also connect the coax cable to your TV, allowing you to access both the Atari and your cable TV."
    },
    {
      "headline":"Screw down the U-shaped wires onto the adapter and push the adapter onto a VHF input on your TV.",
      "description":""
    },
    {
      "headline":"This method does not always work.",
      "description":"The easiest way to connect your Atari to your TV is to avoid the old TV/Game switchbox altogether, and purchase an RCA phono plug to F jack adapter. This adapter allows you to play your Atari."
    },
    {
      "headline":"Purchase an RCA phono plug to F jack adapter for about $5.",
      "description":""
    },
    {
      "headline":"Disconnect the TV/Game switchbox from your Atari.",
      "description":"You can keep it if you're sentimental or crafty, but you'll probably never use it again."
    },
    {
      "headline":"Connect the plug that was previously connecting the Atari to the switchbox to the phono plug to F jack adapter.",
      "description":""
    },
    {
      "headline":"Push the adapter onto the VHF/cable input on your TV.",
      "description":""
    },
    {
      "headline":"Insert a game into the Atari, turn it on, and play Space Invaders to your heart's content.",
      "description":""
    }
  ],
  "text":" Plug in the Atari to an outlet. It's obviously not going to work unless it has some power. If you have the original TV/Game switchbox that came with the Atari console, you can try to hook this up. Unless your television is old enough to still have places to screw the two wires with the U-shaped things on the end, you will need an adapter. Purchase an adapter for about $5. This adapter is designed to screw down the two U-shaped prongs and also connect the coax cable to your TV, allowing you to access both the Atari and your cable TV. Screw down the U-shaped wires onto the adapter and push the adapter onto a VHF input on your TV.  This method does not always work. The easiest way to connect your Atari to your TV is to avoid the old TV/Game switchbox altogether, and purchase an RCA phono plug to F jack adapter. This adapter allows you to play your Atari. Purchase an RCA phono plug to F jack adapter for about $5.  Disconnect the TV/Game switchbox from your Atari. You can keep it if you're sentimental or crafty, but you'll probably never use it again. Connect the plug that was previously connecting the Atari to the switchbox to the phono plug to F jack adapter.  Push the adapter onto the VHF/cable input on your TV.  Insert a game into the Atari, turn it on, and play Space Invaders to your heart's content. ",
  "sentences":[
    " Plug in the Atari to an outlet.",
    "It's obviously not going to work unless it has some power.",
    "If you have the original TV/Game switchbox that came with the Atari console, you can try to hook this up.",
    "Unless your television is old enough to still have places to screw the two wires with the U-shaped things on the end, you will need an adapter.",
    "Purchase an adapter for about $5.",
    "This adapter is designed to screw down the two U-shaped prongs and also connect the coax cable to your TV, allowing you to access both the Atari and your cable TV.",
    "Screw down the U-shaped wires onto the adapter and push the adapter onto a VHF input on your TV.",
    "This method does not always work.",
    "The easiest way to connect your Atari to your TV is to avoid the old TV/Game switchbox altogether, and purchase an RCA phono plug to F jack adapter.",
    "This adapter allows you to play your Atari.",
    "Purchase an RCA phono plug to F jack adapter for about $5.",
    "Disconnect the TV/Game switchbox from your Atari.",
    "You can keep it if you're sentimental or crafty, but you'll probably never use it again.",
    "Connect the plug that was previously connecting the Atari to the switchbox to the phono plug to F jack adapter.",
    "Push the adapter onto the VHF/cable input on your TV.",
    "Insert a game into the Atari, turn it on, and play Space Invaders to your heart's content."
  ],
  "tyn_section":[
    "A TV",
    "An Atari that you're certain still works",
    "A power plug for the Atari",
    "A TV/Game switchbox and cable connecting the switchbox to the Atari",
    "An RCA phono to F jack adapter (Radioshack part 278-255)"
  ],
  "tyn_model":[
    "atari",
    "adapter",
    "tv",
    "rca phono plug to f jack adapter",
    "outlet",
    "television",
    "coax cable",
    "cable tv",
    "plug",
    "phono plug to f jack adapter"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.2,
    "f1":0.2666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.4,
    "f1":0.4
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}