{
  "title":"How to Boil an Egg So That It Peels Easily",
  "url":"https://www.wikihow.com/Boil-an-Egg-So-That-It-Peels-Easily",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Egg Basics"
  ],
  "methods":[
    {
      "name":"Giving the Eggs a Cold Start",
      "steps":[
        {
          "headline":"Place your eggs in a single layer in a saucepan.",
          "description":"Try to use eggs that are at least 7 to 10 days old. Many people find that the fresher an egg is, the more difficult it is to peel."
        },
        {
          "headline":"Cover the eggs with 2 inches (5.08 centimeters) of cold water.",
          "description":"How much water you end up using will depend on how big the saucepan is and how many eggs you are cooking. Whatever you use, make sure that the eggs are under 2 inches (5.08 centimeters) of water. If you don't use enough water, the eggs may not cook evenly."
        },
        {
          "headline":"Bring the water to a boil over high heat.",
          "description":"This will help the eggs cook slowly at first. They will continue to cook, even after you turn the heat off later on."
        },
        {
          "headline":"Turn the stove off, cover the saucepan with a lid, and wait 11 to 13 minutes.",
          "description":"Keep the saucepan on the burner during this time. The heat from the burner will continue \"cooking\" the eggs. If your burner doesn't stay hot after you turn it off (such as gas), reduce the heat to low, simmer for 1 minute, then turn it off. If the eggs are small or medium-sized, cook them for 11 minutes. If the eggs are large or extra large, cook them for 13 minutes."
        },
        {
          "headline":"Prepare an ice bath.",
          "description":"Fill a large bowl with cold water and lots of ice. When you put the eggs into this, the coldness will \"shock\" the eggs, and make the shell easier to peel off."
        },
        {
          "headline":"Carefully transfer the eggs to the ice bath and wait 5 to 15 minutes.",
          "description":"Use a slotted spoon or a pair of tongs to lift the eggs out of the water and place them into the bowl. During this time, the eggs will cool down; cold eggs are easier to peel than hot eggs."
        },
        {
          "headline":"Pull the eggs out of the water and set them down someplace where they won't roll away.",
          "description":"Keep the bowl of water handy. You can dip the eggs into the water once you peel them to get rid of any broken shell bits."
        },
        {
          "headline":"Crack the shell first, but don't peel it.",
          "description":"Try to crack both ends of the shell first, as this is where the air pockets tend to be. To make the shell even easier to peel, roll the egg across the counter with your palm. This will help loosen the membrane from the whites."
        },
        {
          "headline":"Carefully peel the shell away from the egg.",
          "description":"From time to time, dip the egg into the cold water. This will help loosen the shell from the whites even more. It will also help rinse away any broken shell fragments that might be stuck the to whites."
        },
        {
          "headline":"Dry the eggs off with a paper towel.",
          "description":"At this point, you can use the eggs in your recipe, or you can store them in a sealed container in your fridge. If you do store them, be sure to eat them within 3 to 5 days."
        },
        {
          "headline":"Bon Appetit!",
          "description":""
        }
      ]
    },
    {
      "name":"Giving the Eggs a Hot Start",
      "steps":[
        {
          "headline":"Fill a medium-sized saucepan halfway with water and bring it to a boil over high heat.",
          "description":"Don't add the eggs to the water yet; it needs to be boiling first."
        },
        {
          "headline":"Gently place the eggs into the water.",
          "description":"Avoid dropping them into the water, or you will risk cracking them. Instead, consider using a slotted spoon, a pair of tongs, or even a wire basket."
        },
        {
          "headline":"Reduce the heat to a simmer and cook for 11 to 13 minutes.",
          "description":"If the eggs are smaller, cook them for 11 minutes. If the eggs are larger, cook them for 13 minutes."
        },
        {
          "headline":"Prepare an ice bath while the eggs are cooking.",
          "description":"Fill a bowl with cold water, and lots of ice. When you put the cooked eggs into the icy water, the coldness will \"shock\" the eggs, and make the shell easier to peel away."
        },
        {
          "headline":"Place the cooked eggs into the ice bath, and wait 5 to 15 minutes.",
          "description":"Once the time is up, use a pair of tongs or a slotted spoon to transfer the eggs from the saucepan and into the ice bath. During this time, the eggs will cool down; it is easier to peel cold eggs than hot eggs."
        },
        {
          "headline":"Take the eggs out of the ice bath and set them down someplace where they won't roll away.",
          "description":"Keep the ice bath nearby. You can dip the eggs into the water after you peel them to get rid of any broken shell bits."
        },
        {
          "headline":"Crack the egg, then roll it across a hard surface.",
          "description":"Tap both ends of the egg against a hard surface, then roll the egg across the surface with your palm. This will help loosen the membrane from the whites, and make the egg easier to peel."
        },
        {
          "headline":"Peel the shell away from the egg.",
          "description":"You may want to dip the egg into the cold water from time to time. This will loosen the shell from the whites even more, and help rinse away any broken shell pieces."
        },
        {
          "headline":"Dry the eggs off with a paper towel.",
          "description":"At this point, you can add the eggs to your recipe, or store them in a sealed container in the refrigerator. If you do store them, be sure to eat them within 3 to 5 days."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Giving the Eggs a Cold Start Place your eggs in a single layer in a saucepan. Try to use eggs that are at least 7 to 10 days old. Many people find that the fresher an egg is, the more difficult it is to peel. Cover the eggs with 2 inches (5.08 centimeters) of cold water. How much water you end up using will depend on how big the saucepan is and how many eggs you are cooking. Whatever you use, make sure that the eggs are under 2 inches (5.08 centimeters) of water. If you don't use enough water, the eggs may not cook evenly. Bring the water to a boil over high heat. This will help the eggs cook slowly at first. They will continue to cook, even after you turn the heat off later on. Turn the stove off, cover the saucepan with a lid, and wait 11 to 13 minutes. Keep the saucepan on the burner during this time. The heat from the burner will continue \"cooking\" the eggs. If your burner doesn't stay hot after you turn it off (such as gas), reduce the heat to low, simmer for 1 minute, then turn it off. If the eggs are small or medium-sized, cook them for 11 minutes. If the eggs are large or extra large, cook them for 13 minutes. Prepare an ice bath. Fill a large bowl with cold water and lots of ice. When you put the eggs into this, the coldness will \"shock\" the eggs, and make the shell easier to peel off. Carefully transfer the eggs to the ice bath and wait 5 to 15 minutes. Use a slotted spoon or a pair of tongs to lift the eggs out of the water and place them into the bowl. During this time, the eggs will cool down; cold eggs are easier to peel than hot eggs. Pull the eggs out of the water and set them down someplace where they won't roll away. Keep the bowl of water handy. You can dip the eggs into the water once you peel them to get rid of any broken shell bits. Crack the shell first, but don't peel it. Try to crack both ends of the shell first, as this is where the air pockets tend to be. To make the shell even easier to peel, roll the egg across the counter with your palm. This will help loosen the membrane from the whites. Carefully peel the shell away from the egg. From time to time, dip the egg into the cold water. This will help loosen the shell from the whites even more. It will also help rinse away any broken shell fragments that might be stuck the to whites. Dry the eggs off with a paper towel. At this point, you can use the eggs in your recipe, or you can store them in a sealed container in your fridge. If you do store them, be sure to eat them within 3 to 5 days. Bon Appetit!  Giving the Eggs a Hot Start Fill a medium-sized saucepan halfway with water and bring it to a boil over high heat. Don't add the eggs to the water yet; it needs to be boiling first. Gently place the eggs into the water. Avoid dropping them into the water, or you will risk cracking them. Instead, consider using a slotted spoon, a pair of tongs, or even a wire basket. Reduce the heat to a simmer and cook for 11 to 13 minutes. If the eggs are smaller, cook them for 11 minutes. If the eggs are larger, cook them for 13 minutes. Prepare an ice bath while the eggs are cooking. Fill a bowl with cold water, and lots of ice. When you put the cooked eggs into the icy water, the coldness will \"shock\" the eggs, and make the shell easier to peel away. Place the cooked eggs into the ice bath, and wait 5 to 15 minutes. Once the time is up, use a pair of tongs or a slotted spoon to transfer the eggs from the saucepan and into the ice bath. During this time, the eggs will cool down; it is easier to peel cold eggs than hot eggs. Take the eggs out of the ice bath and set them down someplace where they won't roll away. Keep the ice bath nearby. You can dip the eggs into the water after you peel them to get rid of any broken shell bits. Crack the egg, then roll it across a hard surface. Tap both ends of the egg against a hard surface, then roll the egg across the surface with your palm. This will help loosen the membrane from the whites, and make the egg easier to peel. Peel the shell away from the egg. You may want to dip the egg into the cold water from time to time. This will loosen the shell from the whites even more, and help rinse away any broken shell pieces. Dry the eggs off with a paper towel. At this point, you can add the eggs to your recipe, or store them in a sealed container in the refrigerator. If you do store them, be sure to eat them within 3 to 5 days. Finished. ",
  "sentences":[
    " Giving the Eggs a Cold Start Place your eggs in a single layer in a saucepan.",
    "Try to use eggs that are at least 7 to 10 days old.",
    "Many people find that the fresher an egg is, the more difficult it is to peel.",
    "Cover the eggs with 2 inches (5.08 centimeters) of cold water.",
    "How much water you end up using will depend on how big the saucepan is and how many eggs you are cooking.",
    "Whatever you use, make sure that the eggs are under 2 inches (5.08 centimeters) of water.",
    "If you don't use enough water, the eggs may not cook evenly.",
    "Bring the water to a boil over high heat.",
    "This will help the eggs cook slowly at first.",
    "They will continue to cook, even after you turn the heat off later on.",
    "Turn the stove off, cover the saucepan with a lid, and wait 11 to 13 minutes.",
    "Keep the saucepan on the burner during this time.",
    "The heat from the burner will continue \"cooking\" the eggs.",
    "If your burner doesn't stay hot after you turn it off (such as gas), reduce the heat to low, simmer for 1 minute, then turn it off.",
    "If the eggs are small or medium-sized, cook them for 11 minutes.",
    "If the eggs are large or extra large, cook them for 13 minutes.",
    "Prepare an ice bath.",
    "Fill a large bowl with cold water and lots of ice.",
    "When you put the eggs into this, the coldness will \"shock\" the eggs, and make the shell easier to peel off.",
    "Carefully transfer the eggs to the ice bath and wait 5 to 15 minutes.",
    "Use a slotted spoon or a pair of tongs to lift the eggs out of the water and place them into the bowl.",
    "During this time, the eggs will cool down; cold eggs are easier to peel than hot eggs.",
    "Pull the eggs out of the water and set them down someplace where they won't roll away.",
    "Keep the bowl of water handy.",
    "You can dip the eggs into the water once you peel them to get rid of any broken shell bits.",
    "Crack the shell first, but don't peel it.",
    "Try to crack both ends of the shell first, as this is where the air pockets tend to be.",
    "To make the shell even easier to peel, roll the egg across the counter with your palm.",
    "This will help loosen the membrane from the whites.",
    "Carefully peel the shell away from the egg.",
    "From time to time, dip the egg into the cold water.",
    "This will help loosen the shell from the whites even more.",
    "It will also help rinse away any broken shell fragments that might be stuck the to whites.",
    "Dry the eggs off with a paper towel.",
    "At this point, you can use the eggs in your recipe, or you can store them in a sealed container in your fridge.",
    "If you do store them, be sure to eat them within 3 to 5 days.",
    "Bon Appetit!",
    "Giving the Eggs a Hot Start Fill a medium-sized saucepan halfway with water and bring it to a boil over high heat.",
    "Don't add the eggs to the water yet; it needs to be boiling first.",
    "Gently place the eggs into the water.",
    "Avoid dropping them into the water, or you will risk cracking them.",
    "Instead, consider using a slotted spoon, a pair of tongs, or even a wire basket.",
    "Reduce the heat to a simmer and cook for 11 to 13 minutes.",
    "If the eggs are smaller, cook them for 11 minutes.",
    "If the eggs are larger, cook them for 13 minutes.",
    "Prepare an ice bath while the eggs are cooking.",
    "Fill a bowl with cold water, and lots of ice.",
    "When you put the cooked eggs into the icy water, the coldness will \"shock\" the eggs, and make the shell easier to peel away.",
    "Place the cooked eggs into the ice bath, and wait 5 to 15 minutes.",
    "Once the time is up, use a pair of tongs or a slotted spoon to transfer the eggs from the saucepan and into the ice bath.",
    "During this time, the eggs will cool down; it is easier to peel cold eggs than hot eggs.",
    "Take the eggs out of the ice bath and set them down someplace where they won't roll away.",
    "Keep the ice bath nearby.",
    "You can dip the eggs into the water after you peel them to get rid of any broken shell bits.",
    "Crack the egg, then roll it across a hard surface.",
    "Tap both ends of the egg against a hard surface, then roll the egg across the surface with your palm.",
    "This will help loosen the membrane from the whites, and make the egg easier to peel.",
    "Peel the shell away from the egg.",
    "You may want to dip the egg into the cold water from time to time.",
    "This will loosen the shell from the whites even more, and help rinse away any broken shell pieces.",
    "Dry the eggs off with a paper towel.",
    "At this point, you can add the eggs to your recipe, or store them in a sealed container in the refrigerator.",
    "If you do store them, be sure to eat them within 3 to 5 days.",
    "Finished."
  ],
  "tyn_section":[
    "Eggs",
    "Water",
    "Saucepan",
    "Ice",
    "Bowl",
    "Tongs, slotted spoon, or wire basket"
  ],
  "tyn_model":[
    "eggs",
    "water",
    "ice bath",
    "saucepan",
    "cold water",
    "slotted spoon",
    "bowl",
    "ice",
    "paper towel",
    "stove",
    "burner",
    "large bowl",
    "medium-sized saucepan",
    "wire basket",
    "icy water",
    "refrigerator"
  ],
  "simple_metrics":{
    "r":0.8333333333,
    "p":0.3125,
    "f1":0.4545454545,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.625,
    "f1":0.7142857143
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.6875,
    "f1":0.8148148148
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8333333333,
    "p":0.3125,
    "f1":0.4545454545
  }
}