{
  "title":"How to Clean Baseball Hats with a Dishwasher",
  "url":"https://www.wikihow.com/Clean-Baseball-Hats-with-a-Dishwasher",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Clothes"
  ],
  "parts":[
    {
      "name":"Running a Wash Cycle",
      "steps":[
        {
          "headline":"Check the material on your hat’s tag before washing it.",
          "description":"Look for the manufacturer’s tag inside the ballcap. Materials like cotton or synthetics are safe to put inside your dishwasher, but cardboard or wool could get damaged. If the tag says “hand wash only,” don’t put the hat in the dishwasher. If your hat has frayed edges or tears, consider washing the hat by hand instead. If the hat has sentimental value, don’t put it in the dishwasher since there’s always a small risk of damage."
        },
        {
          "headline":"Use a hat frame if you’re worried about your hat losing its shape.",
          "description":"Hat frames or shapers are used to protect the shape and prevent bending. Open the frame and set your hat over the convex dome so the brim is inside. Snap the frame closed to secure the hat. Hat frames can be purchased online or at a specialty hat store."
        },
        {
          "headline":"Put the hat on the top rack of your dishwasher.",
          "description":"Keep the hat on the top rack only so it’s the furthest away from the dishwasher’s heating element. If you aren’t using a hat frame, prop the middle of the hat on one of the prongs if your dishwasher has them. Any plastic in your hat might melt if it’s placed on the bottom rack."
        },
        {
          "headline":"Don’t wash hats with your regular dishes.",
          "description":"Make sure there are no dirty dishes in your dishwasher when you clean your hat. Food residue could lift off of your dining ware and get caught in the hat’s seams. Gather hats from your family or those you live with to make one large load of hats."
        },
        {
          "headline":"Fill the detergent compartment with 1 tbsp (27 g) of Borax or non-bleach cleaner.",
          "description":"Avoid any dish detergents with lemon or bleach since this could change your hat’s color. Pour the detergent directly into the compartment before sealing it. Close your dishwasher once you’ve added the detergent. Don’t use laundry detergent in your dishwasher. To see how your detergent will affect the hat, rub a small amount on a discreet spot of your hat to see if the color changes."
        },
        {
          "headline":"Run the shortest and coldest wash cycle without heat drying.",
          "description":"Change the settings on your dishwasher to the coldest and shortest setting possible. Turn off the heating cycle if you can to prevent any creases or wrinkles in your hat. Use the delicate or china setting on your dishwasher if your machine has those options."
        }
      ]
    },
    {
      "name":"Drying Your Baseball Caps",
      "steps":[
        {
          "headline":"Take the hat out of the dishwasher before the drying cycle.",
          "description":"If you can’t turn off the drying cycle in your dishwasher, make sure to take out your hat before it starts. The heat could cause your hat to shrink or melt any plastic pieces your hat may have. Most dishwashers will have a light or display to show when the drying cycle starts."
        },
        {
          "headline":"Set the hat on top of a jar or tall object to shape it while it dries.",
          "description":"Open up the cap like you’re about to put it on. Set the middle of the hat on top of the jar or can to preserve its dome shape. Don’t touch the hat after you hang it until it dries. If you used a hat frame, you can leave the hat inside it to let it dry."
        },
        {
          "headline":"Let the hat air dry completely.",
          "description":"Don’t use any heat to dry your hat or else it may shrink. Instead, leave the hat at room temperature on your kitchen counter or table until it completely dries, which may take a few hours. Set up a fan near your hat to dry it faster."
        }
      ]
    }
  ],
  "text":" Running a Wash Cycle Check the material on your hat’s tag before washing it. Look for the manufacturer’s tag inside the ballcap. Materials like cotton or synthetics are safe to put inside your dishwasher, but cardboard or wool could get damaged. If the tag says “hand wash only,” don’t put the hat in the dishwasher. If your hat has frayed edges or tears, consider washing the hat by hand instead. If the hat has sentimental value, don’t put it in the dishwasher since there’s always a small risk of damage. Use a hat frame if you’re worried about your hat losing its shape. Hat frames or shapers are used to protect the shape and prevent bending. Open the frame and set your hat over the convex dome so the brim is inside. Snap the frame closed to secure the hat. Hat frames can be purchased online or at a specialty hat store. Put the hat on the top rack of your dishwasher. Keep the hat on the top rack only so it’s the furthest away from the dishwasher’s heating element. If you aren’t using a hat frame, prop the middle of the hat on one of the prongs if your dishwasher has them. Any plastic in your hat might melt if it’s placed on the bottom rack. Don’t wash hats with your regular dishes. Make sure there are no dirty dishes in your dishwasher when you clean your hat. Food residue could lift off of your dining ware and get caught in the hat’s seams. Gather hats from your family or those you live with to make one large load of hats. Fill the detergent compartment with 1 tbsp (27 g) of Borax or non-bleach cleaner. Avoid any dish detergents with lemon or bleach since this could change your hat’s color. Pour the detergent directly into the compartment before sealing it. Close your dishwasher once you’ve added the detergent. Don’t use laundry detergent in your dishwasher. To see how your detergent will affect the hat, rub a small amount on a discreet spot of your hat to see if the color changes. Run the shortest and coldest wash cycle without heat drying. Change the settings on your dishwasher to the coldest and shortest setting possible. Turn off the heating cycle if you can to prevent any creases or wrinkles in your hat. Use the delicate or china setting on your dishwasher if your machine has those options. Drying Your Baseball Caps Take the hat out of the dishwasher before the drying cycle. If you can’t turn off the drying cycle in your dishwasher, make sure to take out your hat before it starts. The heat could cause your hat to shrink or melt any plastic pieces your hat may have. Most dishwashers will have a light or display to show when the drying cycle starts. Set the hat on top of a jar or tall object to shape it while it dries. Open up the cap like you’re about to put it on. Set the middle of the hat on top of the jar or can to preserve its dome shape. Don’t touch the hat after you hang it until it dries. If you used a hat frame, you can leave the hat inside it to let it dry. Let the hat air dry completely. Don’t use any heat to dry your hat or else it may shrink. Instead, leave the hat at room temperature on your kitchen counter or table until it completely dries, which may take a few hours. Set up a fan near your hat to dry it faster.",
  "sentences":[
    " Running a Wash Cycle Check the material on your hat’s tag before washing it.",
    "Look for the manufacturer’s tag inside the ballcap.",
    "Materials like cotton or synthetics are safe to put inside your dishwasher, but cardboard or wool could get damaged.",
    "If the tag says “hand wash only,” don’t put the hat in the dishwasher.",
    "If your hat has frayed edges or tears, consider washing the hat by hand instead.",
    "If the hat has sentimental value, don’t put it in the dishwasher since there’s always a small risk of damage.",
    "Use a hat frame if you’re worried about your hat losing its shape.",
    "Hat frames or shapers are used to protect the shape and prevent bending.",
    "Open the frame and set your hat over the convex dome so the brim is inside.",
    "Snap the frame closed to secure the hat.",
    "Hat frames can be purchased online or at a specialty hat store.",
    "Put the hat on the top rack of your dishwasher.",
    "Keep the hat on the top rack only so it’s the furthest away from the dishwasher’s heating element.",
    "If you aren’t using a hat frame, prop the middle of the hat on one of the prongs if your dishwasher has them.",
    "Any plastic in your hat might melt if it’s placed on the bottom rack.",
    "Don’t wash hats with your regular dishes.",
    "Make sure there are no dirty dishes in your dishwasher when you clean your hat.",
    "Food residue could lift off of your dining ware and get caught in the hat’s seams.",
    "Gather hats from your family or those you live with to make one large load of hats.",
    "Fill the detergent compartment with 1 tbsp (27 g) of Borax or non-bleach cleaner.",
    "Avoid any dish detergents with lemon or bleach since this could change your hat’s color.",
    "Pour the detergent directly into the compartment before sealing it.",
    "Close your dishwasher once you’ve added the detergent.",
    "Don’t use laundry detergent in your dishwasher.",
    "To see how your detergent will affect the hat, rub a small amount on a discreet spot of your hat to see if the color changes.",
    "Run the shortest and coldest wash cycle without heat drying.",
    "Change the settings on your dishwasher to the coldest and shortest setting possible.",
    "Turn off the heating cycle if you can to prevent any creases or wrinkles in your hat.",
    "Use the delicate or china setting on your dishwasher if your machine has those options.",
    "Drying Your Baseball Caps Take the hat out of the dishwasher before the drying cycle.",
    "If you can’t turn off the drying cycle in your dishwasher, make sure to take out your hat before it starts.",
    "The heat could cause your hat to shrink or melt any plastic pieces your hat may have.",
    "Most dishwashers will have a light or display to show when the drying cycle starts.",
    "Set the hat on top of a jar or tall object to shape it while it dries.",
    "Open up the cap like you’re about to put it on.",
    "Set the middle of the hat on top of the jar or can to preserve its dome shape.",
    "Don’t touch the hat after you hang it until it dries.",
    "If you used a hat frame, you can leave the hat inside it to let it dry.",
    "Let the hat air dry completely.",
    "Don’t use any heat to dry your hat or else it may shrink.",
    "Instead, leave the hat at room temperature on your kitchen counter or table until it completely dries, which may take a few hours.",
    "Set up a fan near your hat to dry it faster."
  ],
  "tyn_section":[
    "Dishwasher",
    "Borax",
    "Jar or tall can",
    "Hat frame (optional)"
  ],
  "tyn_model":[
    "detergent",
    "hat frame",
    "hat frames",
    "dishwasher",
    "jar",
    "“hand",
    "” do",
    "hat",
    "borax or non-bleach cleaner",
    "dish detergents",
    "laundry detergent",
    "baseball caps",
    "dishwashers",
    "can",
    "fan"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0666666667,
    "f1":0.1052631579,
    "avg_pos":0.2
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1333333333,
    "f1":0.2105263158
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1333333333,
    "f1":0.2105263158
  }
}