{
  "title":"How to Make English Muffins",
  "url":"https://www.wikihow.com/Make-English-Muffins",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Muffins"
  ],
  "methods":[
    {
      "name":"Hand-Crafted English Muffins",
      "steps":[
        {
          "headline":"Add the 3/4 cup powdered milk, 1 1/2 tablespoons sugar, 1 teaspoon salt, 1 1/2 tablespoons shortening, and 1 1/2 cups hot water to a mixing bowl.",
          "description":"Mix until the salt and sugar crystals are dissolved. When mixed, move on to the next step while this mixture cools. 1 cup of warmed milk can be substituted for the powdered milk combo, as well"
        },
        {
          "headline":"In another bowl, add yeast and 1/8 teaspoon sugar to 1 1/2 cup warm water.",
          "description":"The water should be very warm to the touch, but not so warm you can't stick your finger in it without burning-- just on the edge of \"hot.\" Stir in the sugar and add the yeast, letting it sit for about 10 minutes, until frothy."
        },
        {
          "headline":"Add the yeast mixture to the powdered milk mixture.",
          "description":"Use a stiff spatula or wooden spoon to mix everything together. This mixture should frothy and bubbly."
        },
        {
          "headline":"Add the flour, remaining salt and mix well with a stiff spatula.",
          "description":"Beat everything together with a flat wooden spoon, stiff spatula, or the flat blade on your stand mixer, stirring until everything is blended into a shaggy, somewhat sticky dough. Salt can halt or slow yeast production. This is why you only add half of it at first."
        },
        {
          "headline":"Knead the dough on a floured surface or with a dough hook.",
          "description":"If you have a stand mixer, attach the dough hook and let it work on the shaggy dough for 4-5 minutes, until you have  shiny, smooth ball of dough. If not, sprinkle a cutting board with flour and turn the dough out on it. Knead for 3-4 minutes, until you have a shiny, solid bowl of dough. It should be just barely sticky, and bounce back after you press into it. To knead:\nStand so that the dough is about waist height, allowing you to put your weight into the knead. Fold about half of the dough on top of itself as if you were making a taco shell shape. Use the heel of your hand to press the dough down into itself, \"sealing\" the fold. Rotate the dough a quarter-turn and repeat.|\nKeep folding, pressing, and rotating until the dough is a shiny, round ball. If the dough is sticking too much to you, add a little more flour to your hands and the countertop."
        },
        {
          "headline":"Cover the bowl and let the batter rise in a warm place for at least an hour.",
          "description":"Place a damp towel over the dough and let it sit as it rises. It should be about twice as big as when you started. You can let the dough rise up to 24 hours if you put it in the fridge, and some cooks believe this leads to a better flavor. The next day, all you have to do is shape and cook the muffins."
        },
        {
          "headline":"Divide the dough into 10 even pieces using a sharp knife, then roll into balls.",
          "description":"These will be your muffins, so try to get nice, even pieces so they all cook nicely. You can cut as many different pieces as you want, depending on how big you want the muffins to be, but this recipe nicely creates 10 medium-sized English muffins. Lightly flour the knife or your hands if the dough sticks to it. Know that this dough expands, slightly, when cooked."
        },
        {
          "headline":"Line a baking sheet with parchment paper and sprinkle liberally with cornmeal.",
          "description":"Place the dough balls on top of the sheet, leaving about an inch of space on each side (they will rise and expand). Sprinkle the tops with cornmeal as well so that you have the classic crunchy bits on the tops and bottoms of your muffins."
        },
        {
          "headline":"Let the muffins rise for another hour.",
          "description":"The rising stage lets the yeast create air inside the dough, which is why it puffs up. These same air bubbles create the nooks and crannies in a great English muffin, crafting the perfect texture you're looking for. If you're in a rush, you can skip this second rise and just start cooking. They will taste good, though the texture won't quite be perfect."
        },
        {
          "headline":"Preheat a griddle to 300F, or a pan to medium heat.",
          "description":"English muffins need to cook quickly enough to get a hard, toasted crust but slowly enough that the insides cook as well. If your griddle lets you pick temperatures, set it to 300. If not, or if you want to use a cast-iron or non-stick pan instead, set it to medium heat and let it get nice and hot."
        },
        {
          "headline":"Add a pat of butter to the griddle once hot.",
          "description":"Know that, once you do, you need to be ready to keep going on the recipe before the butter burns. You don't need much -- 1/2 tablespoon should be good for every 5-6 muffins."
        },
        {
          "headline":"Add dough balls to the pan or griddle, spacing by an inch.",
          "description":"Simply drop the dough balls, covered top and bottom with cornmeal, on the hot griddle and let them start to cook. If you have muffin rounds -- little rings used to help keep the muffin's shape, add them to the griddle and put your dough balls in the center of them. Muffin rings are not necessary but do lead to a more uniform shape. Tuna cans that have both the tops and bottoms cut out with a can opener are a great substitute."
        },
        {
          "headline":"Cook each muffin for 5-6 minutes on each side.",
          "description":"You'll flip the muffins after about 5 minutes. When flipped, the cooked side should be an appealing dark brown color, but don't worry if you got their too soon -- you can always re-flip them to finish a side if need be."
        },
        {
          "headline":"Once both sides are browned, remove and place on a wire rack to cool.",
          "description":"Make sure that the centers are cooked -- the outside edge shouldn't be shiny or doughy anymore, but firm and cooked. If you took them off too early place the muffins in a 350F oven for 3-4 minutes to finish."
        },
        {
          "headline":"Allow muffins to cool and then split with a fork.",
          "description":"To get the best texture, including all the nooks and crannies, make sure that you cut the muffin open with a fork, not a knife. This allows all the air pockets to stay intact."
        }
      ]
    },
    {
      "name":"Using Variations and Other Recipes",
      "steps":[
        {
          "headline":"Mix everything in a stand mixer with this simple \"one-pot\" recipe.",
          "description":"The following ingredients simply go together in your Kitchen-Aid or another stand mixer. Then, using the paddle attachment, mix it all up. Once the ingredients are mixed, put on the dough hook and let it knead for 3-4 minutes before rising, shaping, and cooking like normal:\n1 3/4 cups lukewarm milk\n3 tablespoons butter\n1 1/2 teaspoons salt\n2 tablespoons granulated sugar\n1 large egg, lightly beaten\n4 1/2 cups (19 ounces) King Arthur Unbleached Bread Flour\n2 teaspoons instant yeast"
        },
        {
          "headline":"Add an egg to the recipe get a slightly richer English muffin.",
          "description":"Add this to the warm milk mixture after it has cooled, which prevents the egg from cooking. Beat it into the recipe like normal, continuing from there. Eggs have fat and protein that leads to a richer, slightly denser muffin."
        },
        {
          "headline":"Use coconut oil, olive oil, or butter instead of shortening.",
          "description":"All of these ingredients are fats used to bind the ingredients, and all of them can be used to subtly flavor and change your muffins. Note, however, that olive oil is the only liquid fat here, which means it should be split half and half with butter instead of being used completely on its own."
        },
        {
          "headline":"Turn your English Muffin into a simple crumpet with an extra 3/4 cup milk.",
          "description":"Looking for a thinner English crumpet? The recipe is almost the exact same, except that crumpets require a thinner, almost pancake-like dough. The extra milk will cover this for you, but you'll need to use Muffin rings when cooking -- the thinner dough won't hold its shape like the English muffin dough does."
        },
        {
          "headline":"Replace the milk with water, almond milk, or soy milk for a vegan muffin.",
          "description":"You'll also need to replace the butter on the pan, but olive or canola oil will cover this easily. These muffins have all the flavor of a normal English muffin, especially if you use a milk substitute instead of just water."
        }
      ]
    }
  ],
  "text":" Hand-Crafted English Muffins Add the 3/4 cup powdered milk, 1 1/2 tablespoons sugar, 1 teaspoon salt, 1 1/2 tablespoons shortening, and 1 1/2 cups hot water to a mixing bowl. Mix until the salt and sugar crystals are dissolved. When mixed, move on to the next step while this mixture cools. 1 cup of warmed milk can be substituted for the powdered milk combo, as well In another bowl, add yeast and 1/8 teaspoon sugar to 1 1/2 cup warm water. The water should be very warm to the touch, but not so warm you can't stick your finger in it without burning-- just on the edge of \"hot.\" Stir in the sugar and add the yeast, letting it sit for about 10 minutes, until frothy. Add the yeast mixture to the powdered milk mixture. Use a stiff spatula or wooden spoon to mix everything together. This mixture should frothy and bubbly. Add the flour, remaining salt and mix well with a stiff spatula. Beat everything together with a flat wooden spoon, stiff spatula, or the flat blade on your stand mixer, stirring until everything is blended into a shaggy, somewhat sticky dough. Salt can halt or slow yeast production. This is why you only add half of it at first. Knead the dough on a floured surface or with a dough hook. If you have a stand mixer, attach the dough hook and let it work on the shaggy dough for 4-5 minutes, until you have  shiny, smooth ball of dough. If not, sprinkle a cutting board with flour and turn the dough out on it. Knead for 3-4 minutes, until you have a shiny, solid bowl of dough. It should be just barely sticky, and bounce back after you press into it. To knead:\nStand so that the dough is about waist height, allowing you to put your weight into the knead. Fold about half of the dough on top of itself as if you were making a taco shell shape. Use the heel of your hand to press the dough down into itself, \"sealing\" the fold. Rotate the dough a quarter-turn and repeat.|\nKeep folding, pressing, and rotating until the dough is a shiny, round ball. If the dough is sticking too much to you, add a little more flour to your hands and the countertop. Cover the bowl and let the batter rise in a warm place for at least an hour. Place a damp towel over the dough and let it sit as it rises. It should be about twice as big as when you started. You can let the dough rise up to 24 hours if you put it in the fridge, and some cooks believe this leads to a better flavor. The next day, all you have to do is shape and cook the muffins. Divide the dough into 10 even pieces using a sharp knife, then roll into balls. These will be your muffins, so try to get nice, even pieces so they all cook nicely. You can cut as many different pieces as you want, depending on how big you want the muffins to be, but this recipe nicely creates 10 medium-sized English muffins. Lightly flour the knife or your hands if the dough sticks to it. Know that this dough expands, slightly, when cooked. Line a baking sheet with parchment paper and sprinkle liberally with cornmeal. Place the dough balls on top of the sheet, leaving about an inch of space on each side (they will rise and expand). Sprinkle the tops with cornmeal as well so that you have the classic crunchy bits on the tops and bottoms of your muffins. Let the muffins rise for another hour. The rising stage lets the yeast create air inside the dough, which is why it puffs up. These same air bubbles create the nooks and crannies in a great English muffin, crafting the perfect texture you're looking for. If you're in a rush, you can skip this second rise and just start cooking. They will taste good, though the texture won't quite be perfect. Preheat a griddle to 300F, or a pan to medium heat. English muffins need to cook quickly enough to get a hard, toasted crust but slowly enough that the insides cook as well. If your griddle lets you pick temperatures, set it to 300. If not, or if you want to use a cast-iron or non-stick pan instead, set it to medium heat and let it get nice and hot. Add a pat of butter to the griddle once hot. Know that, once you do, you need to be ready to keep going on the recipe before the butter burns. You don't need much -- 1/2 tablespoon should be good for every 5-6 muffins. Add dough balls to the pan or griddle, spacing by an inch. Simply drop the dough balls, covered top and bottom with cornmeal, on the hot griddle and let them start to cook. If you have muffin rounds -- little rings used to help keep the muffin's shape, add them to the griddle and put your dough balls in the center of them. Muffin rings are not necessary but do lead to a more uniform shape. Tuna cans that have both the tops and bottoms cut out with a can opener are a great substitute. Cook each muffin for 5-6 minutes on each side. You'll flip the muffins after about 5 minutes. When flipped, the cooked side should be an appealing dark brown color, but don't worry if you got their too soon -- you can always re-flip them to finish a side if need be. Once both sides are browned, remove and place on a wire rack to cool. Make sure that the centers are cooked -- the outside edge shouldn't be shiny or doughy anymore, but firm and cooked. If you took them off too early place the muffins in a 350F oven for 3-4 minutes to finish. Allow muffins to cool and then split with a fork. To get the best texture, including all the nooks and crannies, make sure that you cut the muffin open with a fork, not a knife. This allows all the air pockets to stay intact. Using Variations and Other Recipes Mix everything in a stand mixer with this simple \"one-pot\" recipe. The following ingredients simply go together in your Kitchen-Aid or another stand mixer. Then, using the paddle attachment, mix it all up. Once the ingredients are mixed, put on the dough hook and let it knead for 3-4 minutes before rising, shaping, and cooking like normal:\n1 3/4 cups lukewarm milk\n3 tablespoons butter\n1 1/2 teaspoons salt\n2 tablespoons granulated sugar\n1 large egg, lightly beaten\n4 1/2 cups (19 ounces) King Arthur Unbleached Bread Flour\n2 teaspoons instant yeast Add an egg to the recipe get a slightly richer English muffin. Add this to the warm milk mixture after it has cooled, which prevents the egg from cooking. Beat it into the recipe like normal, continuing from there. Eggs have fat and protein that leads to a richer, slightly denser muffin. Use coconut oil, olive oil, or butter instead of shortening. All of these ingredients are fats used to bind the ingredients, and all of them can be used to subtly flavor and change your muffins. Note, however, that olive oil is the only liquid fat here, which means it should be split half and half with butter instead of being used completely on its own. Turn your English Muffin into a simple crumpet with an extra 3/4 cup milk. Looking for a thinner English crumpet? The recipe is almost the exact same, except that crumpets require a thinner, almost pancake-like dough. The extra milk will cover this for you, but you'll need to use Muffin rings when cooking -- the thinner dough won't hold its shape like the English muffin dough does. Replace the milk with water, almond milk, or soy milk for a vegan muffin. You'll also need to replace the butter on the pan, but olive or canola oil will cover this easily. These muffins have all the flavor of a normal English muffin, especially if you use a milk substitute instead of just water.",
  "sentences":[
    " Hand-Crafted English Muffins Add the 3/4 cup powdered milk, 1 1/2 tablespoons sugar, 1 teaspoon salt, 1 1/2 tablespoons shortening, and 1 1/2 cups hot water to a mixing bowl.",
    "Mix until the salt and sugar crystals are dissolved.",
    "When mixed, move on to the next step while this mixture cools.",
    "1 cup of warmed milk can be substituted for the powdered milk combo, as well In another bowl, add yeast and 1/8 teaspoon sugar to 1 1/2 cup warm water.",
    "The water should be very warm to the touch, but not so warm you can't stick your finger in it without burning-- just on the edge of \"hot.\"",
    "Stir in the sugar and add the yeast, letting it sit for about 10 minutes, until frothy.",
    "Add the yeast mixture to the powdered milk mixture.",
    "Use a stiff spatula or wooden spoon to mix everything together.",
    "This mixture should frothy and bubbly.",
    "Add the flour, remaining salt and mix well with a stiff spatula.",
    "Beat everything together with a flat wooden spoon, stiff spatula, or the flat blade on your stand mixer, stirring until everything is blended into a shaggy, somewhat sticky dough.",
    "Salt can halt or slow yeast production.",
    "This is why you only add half of it at first.",
    "Knead the dough on a floured surface or with a dough hook.",
    "If you have a stand mixer, attach the dough hook and let it work on the shaggy dough for 4-5 minutes, until you have  shiny, smooth ball of dough.",
    "If not, sprinkle a cutting board with flour and turn the dough out on it.",
    "Knead for 3-4 minutes, until you have a shiny, solid bowl of dough.",
    "It should be just barely sticky, and bounce back after you press into it.",
    "To knead:\nStand so that the dough is about waist height, allowing you to put your weight into the knead.",
    "Fold about half of the dough on top of itself as if you were making a taco shell shape.",
    "Use the heel of your hand to press the dough down into itself, \"sealing\" the fold.",
    "Rotate the dough a quarter-turn and repeat.|\nKeep folding, pressing, and rotating until the dough is a shiny, round ball.",
    "If the dough is sticking too much to you, add a little more flour to your hands and the countertop.",
    "Cover the bowl and let the batter rise in a warm place for at least an hour.",
    "Place a damp towel over the dough and let it sit as it rises.",
    "It should be about twice as big as when you started.",
    "You can let the dough rise up to 24 hours if you put it in the fridge, and some cooks believe this leads to a better flavor.",
    "The next day, all you have to do is shape and cook the muffins.",
    "Divide the dough into 10 even pieces using a sharp knife, then roll into balls.",
    "These will be your muffins, so try to get nice, even pieces so they all cook nicely.",
    "You can cut as many different pieces as you want, depending on how big you want the muffins to be, but this recipe nicely creates 10 medium-sized English muffins.",
    "Lightly flour the knife or your hands if the dough sticks to it.",
    "Know that this dough expands, slightly, when cooked.",
    "Line a baking sheet with parchment paper and sprinkle liberally with cornmeal.",
    "Place the dough balls on top of the sheet, leaving about an inch of space on each side (they will rise and expand).",
    "Sprinkle the tops with cornmeal as well so that you have the classic crunchy bits on the tops and bottoms of your muffins.",
    "Let the muffins rise for another hour.",
    "The rising stage lets the yeast create air inside the dough, which is why it puffs up.",
    "These same air bubbles create the nooks and crannies in a great English muffin, crafting the perfect texture you're looking for.",
    "If you're in a rush, you can skip this second rise and just start cooking.",
    "They will taste good, though the texture won't quite be perfect.",
    "Preheat a griddle to 300F, or a pan to medium heat.",
    "English muffins need to cook quickly enough to get a hard, toasted crust but slowly enough that the insides cook as well.",
    "If your griddle lets you pick temperatures, set it to 300.",
    "If not, or if you want to use a cast-iron or non-stick pan instead, set it to medium heat and let it get nice and hot.",
    "Add a pat of butter to the griddle once hot.",
    "Know that, once you do, you need to be ready to keep going on the recipe before the butter burns.",
    "You don't need much -- 1/2 tablespoon should be good for every 5-6 muffins.",
    "Add dough balls to the pan or griddle, spacing by an inch.",
    "Simply drop the dough balls, covered top and bottom with cornmeal, on the hot griddle and let them start to cook.",
    "If you have muffin rounds -- little rings used to help keep the muffin's shape, add them to the griddle and put your dough balls in the center of them.",
    "Muffin rings are not necessary but do lead to a more uniform shape.",
    "Tuna cans that have both the tops and bottoms cut out with a can opener are a great substitute.",
    "Cook each muffin for 5-6 minutes on each side.",
    "You'll flip the muffins after about 5 minutes.",
    "When flipped, the cooked side should be an appealing dark brown color, but don't worry if you got their too soon -- you can always re-flip them to finish a side if need be.",
    "Once both sides are browned, remove and place on a wire rack to cool.",
    "Make sure that the centers are cooked -- the outside edge shouldn't be shiny or doughy anymore, but firm and cooked.",
    "If you took them off too early place the muffins in a 350F oven for 3-4 minutes to finish.",
    "Allow muffins to cool and then split with a fork.",
    "To get the best texture, including all the nooks and crannies, make sure that you cut the muffin open with a fork, not a knife.",
    "This allows all the air pockets to stay intact.",
    "Using Variations and Other Recipes Mix everything in a stand mixer with this simple \"one-pot\" recipe.",
    "The following ingredients simply go together in your Kitchen-Aid or another stand mixer.",
    "Then, using the paddle attachment, mix it all up.",
    "Once the ingredients are mixed, put on the dough hook and let it knead for 3-4 minutes before rising, shaping, and cooking like normal:\n1 3/4 cups lukewarm milk\n3 tablespoons butter\n1 1/2 teaspoons salt\n2 tablespoons granulated sugar\n1 large egg, lightly beaten\n4 1/2 cups (19 ounces) King Arthur Unbleached Bread Flour\n2 teaspoons instant yeast Add an egg to the recipe get a slightly richer English muffin.",
    "Add this to the warm milk mixture after it has cooled, which prevents the egg from cooking.",
    "Beat it into the recipe like normal, continuing from there.",
    "Eggs have fat and protein that leads to a richer, slightly denser muffin.",
    "Use coconut oil, olive oil, or butter instead of shortening.",
    "All of these ingredients are fats used to bind the ingredients, and all of them can be used to subtly flavor and change your muffins.",
    "Note, however, that olive oil is the only liquid fat here, which means it should be split half and half with butter instead of being used completely on its own.",
    "Turn your English Muffin into a simple crumpet with an extra 3/4 cup milk.",
    "Looking for a thinner English crumpet?",
    "The recipe is almost the exact same, except that crumpets require a thinner, almost pancake-like dough.",
    "The extra milk will cover this for you, but you'll need to use Muffin rings when cooking -- the thinner dough won't hold its shape like the English muffin dough does.",
    "Replace the milk with water, almond milk, or soy milk for a vegan muffin.",
    "You'll also need to replace the butter on the pan, but olive or canola oil will cover this easily.",
    "These muffins have all the flavor of a normal English muffin, especially if you use a milk substitute instead of just water."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Mixing bowls",
    "Measuring cups",
    "Cooking spoon",
    "English Muffin rings or use the wide mouth canning jar rings",
    "Electric skillet with cover",
    "Cooling rack"
  ],
  "tyn_model":[
    "griddle",
    "butter",
    "salt",
    "milk",
    "sugar",
    "yeast",
    "stand mixer",
    "powdered milk",
    "water",
    "spatula",
    "flour",
    "cornmeal",
    "wooden spoon",
    "dough hook",
    "english muffins",
    "knife",
    "english muffin",
    "pan",
    "fork",
    "olive oil",
    "shortening",
    "hot water",
    "mixing bowl",
    "warmed milk",
    "warm water",
    "cutting board",
    "bowl",
    "sharp knife",
    "baking sheet",
    "parchment paper",
    "cast-iron or non-stick pan",
    "tuna cans",
    "can opener",
    "wire rack",
    "oven",
    "kitchen-aid",
    "lukewarm milk",
    "granulated sugar",
    "egg",
    "king arthur unbleached bread flour",
    "instant yeast",
    "eggs",
    "coconut oil",
    "english muffin dough",
    "almond milk",
    "soy milk",
    "olive or",
    "canola oil"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4285714286,
    "p":0.0625,
    "f1":0.1090909091
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}