{
  "title":"How to Make Ginger Garlic Paste",
  "url":"https://www.wikihow.com/Make-Ginger-Garlic-Paste",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine"
  ],
  "parts":[
    {
      "name":"Making a Small Batch",
      "steps":[
        {
          "headline":"Wash and dry the ginger.",
          "description":"Any moisture will shorten the shelf life of the paste. Pat the ginger dry thoroughly before you continue, and make sure your kitchen equipment is dry."
        },
        {
          "headline":"Chop the ginger into rough cubes.",
          "description":"If you have mature ginger with wrinkly, brown skin, peel it before chopping. You do not need to peel young ginger with soft, yellow skin. Start with 4 oz (113g) of ginger, or about 1 cup after chopping. Some cooks prefer to add more ginger (up to double this amount), but wait until you taste the final product. It's easy to overpower the garlic. Young ginger has a less pungent taste than old ginger. You can use much more without overpowering the garlic."
        },
        {
          "headline":"Find the freshest garlic possible.",
          "description":"As garlic ages, its aroma and flavor becomes stronger and stronger. Besides overwhelming other ingredients, these aromatic compounds can turn your paste a surprising blue-green color. Start with fresh garlic to avoid these effects. Cut out any green sprouts from the garlic, which have a harsh burning taste."
        },
        {
          "headline":"Peel the garlic.",
          "description":"You'll need about two large heads of garlic, or roughly 20 cloves. Save yourself some time by peeling them all at once:\nSeparate the cloves and drop them in a large, metal bowl. Take a second metal bowl the same size. Place it upside down over the first bowl. Shake the two bowls vigorously for a couple minutes to remove the peels."
        },
        {
          "headline":"Blend together ginger, garlic, and salt.",
          "description":"Combine the ginger and garlic in a food processor or blender. Add a generous pinch of salt so the paste lasts a little longer. Scrape down the sides between pulses."
        },
        {
          "headline":"Drizzle in oil.",
          "description":"Pour in about ½ tbsp (8 mL) of vegetable oil near the end of the blending process. Choose an oil without a strong flavor, such as canola, corn, or safflower oil. Slowly pour in more oil if the blender is stuck, a dash at a time."
        },
        {
          "headline":"Store in the refrigerator.",
          "description":"Place the paste in a clean, dry jar. Put it in the coldest part of your fridge, usually at the far back. If the jar is sealed against air and moisture, the paste can last two or three weeks. However, even in the fridge, there is a risk of very dangerous botulinum contamination. If you keep the paste for more than three days, make sure to heat it thoroughly for at least ten minutes to destroy this toxin. The top surface of the paste may turn brown. This is a harmless reaction with oxygen, and not a sign of spoilage unless the color extends below the surface. Keep a clean spoon in the same container as the paste, or make sure every spoon you use is completely clean and dry."
        }
      ]
    },
    {
      "name":"Preserving a Batch for Long-Term Use",
      "steps":[
        {
          "headline":"Understand the risks.",
          "description":"Garlic may be contaminated by botulinum, a potentially fatal bacteria. When the garlic is crushed and stored in a low-acid recipe such at this one, the bacteria produces dangerous toxins even in the refrigerator. Cooking the paste thoroughly for at least ten minutes destroys this toxin. However, since this is such a dangerous toxin, it's best to store only as much paste as you plan to use over the next three days. Freeze the rest as described at the end of this section."
        },
        {
          "headline":"Mix in dry roasted salt.",
          "description":"Salt is a good preservative, and you can add a generous handful to the recipe above as long as you remember not to over salt the dishes the paste is used in. To completely remove any moisture that may spoil the paste, roast the salt in a dry pan first over medium high heat. The salt is ready when it has turned a light golden color. Let the salt cool to room temperature before adding to the paste. A large amount of salt can preserve the paste for as long as two or three months in the refrigerator."
        },
        {
          "headline":"Use vinegar instead of oil.",
          "description":"White vinegar is an alternative preservative that doesn't affect the flavor as much as salt. Pour it in instead of oil when blending, adding it in dashes until the paste is smooth or until you've added about 2 tbsp (30 mL). Unfortunately, acidic ingredients such as vinegar can turn garlic paste blue-green."
        },
        {
          "headline":"Add a spoonful of turmeric.",
          "description":"Turmeric has anti-bacterial properties that can extend the shelf life of your food. In addition, the yellow color can keep your paste looking vibrant as it ages."
        },
        {
          "headline":"Sterilize the bottles.",
          "description":"To minimize spoilage, sterilize glass canning jars in a pot of boiling water. Dry with brand new paper towels to avoid contamination while removing all moisture. This is especially important if you do not have a refrigerator."
        },
        {
          "headline":"Freeze the paste.",
          "description":"If you plan to use the paste for more than a month, make a large batch and freeze the extra. Store the frozen paste in glass bottles with 1–2 inches (2.5–5 cm) headspace at the top to allow for expansion. Thaw within 6 months for best quality."
        }
      ]
    }
  ],
  "text":" Making a Small Batch Wash and dry the ginger. Any moisture will shorten the shelf life of the paste. Pat the ginger dry thoroughly before you continue, and make sure your kitchen equipment is dry. Chop the ginger into rough cubes. If you have mature ginger with wrinkly, brown skin, peel it before chopping. You do not need to peel young ginger with soft, yellow skin. Start with 4 oz (113g) of ginger, or about 1 cup after chopping. Some cooks prefer to add more ginger (up to double this amount), but wait until you taste the final product. It's easy to overpower the garlic. Young ginger has a less pungent taste than old ginger. You can use much more without overpowering the garlic. Find the freshest garlic possible. As garlic ages, its aroma and flavor becomes stronger and stronger. Besides overwhelming other ingredients, these aromatic compounds can turn your paste a surprising blue-green color. Start with fresh garlic to avoid these effects. Cut out any green sprouts from the garlic, which have a harsh burning taste. Peel the garlic. You'll need about two large heads of garlic, or roughly 20 cloves. Save yourself some time by peeling them all at once:\nSeparate the cloves and drop them in a large, metal bowl. Take a second metal bowl the same size. Place it upside down over the first bowl. Shake the two bowls vigorously for a couple minutes to remove the peels. Blend together ginger, garlic, and salt. Combine the ginger and garlic in a food processor or blender. Add a generous pinch of salt so the paste lasts a little longer. Scrape down the sides between pulses. Drizzle in oil. Pour in about ½ tbsp (8 mL) of vegetable oil near the end of the blending process. Choose an oil without a strong flavor, such as canola, corn, or safflower oil. Slowly pour in more oil if the blender is stuck, a dash at a time. Store in the refrigerator. Place the paste in a clean, dry jar. Put it in the coldest part of your fridge, usually at the far back. If the jar is sealed against air and moisture, the paste can last two or three weeks. However, even in the fridge, there is a risk of very dangerous botulinum contamination. If you keep the paste for more than three days, make sure to heat it thoroughly for at least ten minutes to destroy this toxin. The top surface of the paste may turn brown. This is a harmless reaction with oxygen, and not a sign of spoilage unless the color extends below the surface. Keep a clean spoon in the same container as the paste, or make sure every spoon you use is completely clean and dry. Preserving a Batch for Long-Term Use Understand the risks. Garlic may be contaminated by botulinum, a potentially fatal bacteria. When the garlic is crushed and stored in a low-acid recipe such at this one, the bacteria produces dangerous toxins even in the refrigerator. Cooking the paste thoroughly for at least ten minutes destroys this toxin. However, since this is such a dangerous toxin, it's best to store only as much paste as you plan to use over the next three days. Freeze the rest as described at the end of this section. Mix in dry roasted salt. Salt is a good preservative, and you can add a generous handful to the recipe above as long as you remember not to over salt the dishes the paste is used in. To completely remove any moisture that may spoil the paste, roast the salt in a dry pan first over medium high heat. The salt is ready when it has turned a light golden color. Let the salt cool to room temperature before adding to the paste. A large amount of salt can preserve the paste for as long as two or three months in the refrigerator. Use vinegar instead of oil. White vinegar is an alternative preservative that doesn't affect the flavor as much as salt. Pour it in instead of oil when blending, adding it in dashes until the paste is smooth or until you've added about 2 tbsp (30 mL). Unfortunately, acidic ingredients such as vinegar can turn garlic paste blue-green. Add a spoonful of turmeric. Turmeric has anti-bacterial properties that can extend the shelf life of your food. In addition, the yellow color can keep your paste looking vibrant as it ages. Sterilize the bottles. To minimize spoilage, sterilize glass canning jars in a pot of boiling water. Dry with brand new paper towels to avoid contamination while removing all moisture. This is especially important if you do not have a refrigerator. Freeze the paste. If you plan to use the paste for more than a month, make a large batch and freeze the extra. Store the frozen paste in glass bottles with 1–2 inches (2.5–5 cm) headspace at the top to allow for expansion. Thaw within 6 months for best quality.",
  "sentences":[
    " Making a Small Batch Wash and dry the ginger.",
    "Any moisture will shorten the shelf life of the paste.",
    "Pat the ginger dry thoroughly before you continue, and make sure your kitchen equipment is dry.",
    "Chop the ginger into rough cubes.",
    "If you have mature ginger with wrinkly, brown skin, peel it before chopping.",
    "You do not need to peel young ginger with soft, yellow skin.",
    "Start with 4 oz (113g) of ginger, or about 1 cup after chopping.",
    "Some cooks prefer to add more ginger (up to double this amount), but wait until you taste the final product.",
    "It's easy to overpower the garlic.",
    "Young ginger has a less pungent taste than old ginger.",
    "You can use much more without overpowering the garlic.",
    "Find the freshest garlic possible.",
    "As garlic ages, its aroma and flavor becomes stronger and stronger.",
    "Besides overwhelming other ingredients, these aromatic compounds can turn your paste a surprising blue-green color.",
    "Start with fresh garlic to avoid these effects.",
    "Cut out any green sprouts from the garlic, which have a harsh burning taste.",
    "Peel the garlic.",
    "You'll need about two large heads of garlic, or roughly 20 cloves.",
    "Save yourself some time by peeling them all at once:\nSeparate the cloves and drop them in a large, metal bowl.",
    "Take a second metal bowl the same size.",
    "Place it upside down over the first bowl.",
    "Shake the two bowls vigorously for a couple minutes to remove the peels.",
    "Blend together ginger, garlic, and salt.",
    "Combine the ginger and garlic in a food processor or blender.",
    "Add a generous pinch of salt so the paste lasts a little longer.",
    "Scrape down the sides between pulses.",
    "Drizzle in oil.",
    "Pour in about ½ tbsp (8 mL) of vegetable oil near the end of the blending process.",
    "Choose an oil without a strong flavor, such as canola, corn, or safflower oil.",
    "Slowly pour in more oil if the blender is stuck, a dash at a time.",
    "Store in the refrigerator.",
    "Place the paste in a clean, dry jar.",
    "Put it in the coldest part of your fridge, usually at the far back.",
    "If the jar is sealed against air and moisture, the paste can last two or three weeks.",
    "However, even in the fridge, there is a risk of very dangerous botulinum contamination.",
    "If you keep the paste for more than three days, make sure to heat it thoroughly for at least ten minutes to destroy this toxin.",
    "The top surface of the paste may turn brown.",
    "This is a harmless reaction with oxygen, and not a sign of spoilage unless the color extends below the surface.",
    "Keep a clean spoon in the same container as the paste, or make sure every spoon you use is completely clean and dry.",
    "Preserving a Batch for Long-Term Use Understand the risks.",
    "Garlic may be contaminated by botulinum, a potentially fatal bacteria.",
    "When the garlic is crushed and stored in a low-acid recipe such at this one, the bacteria produces dangerous toxins even in the refrigerator.",
    "Cooking the paste thoroughly for at least ten minutes destroys this toxin.",
    "However, since this is such a dangerous toxin, it's best to store only as much paste as you plan to use over the next three days.",
    "Freeze the rest as described at the end of this section.",
    "Mix in dry roasted salt.",
    "Salt is a good preservative, and you can add a generous handful to the recipe above as long as you remember not to over salt the dishes the paste is used in.",
    "To completely remove any moisture that may spoil the paste, roast the salt in a dry pan first over medium high heat.",
    "The salt is ready when it has turned a light golden color.",
    "Let the salt cool to room temperature before adding to the paste.",
    "A large amount of salt can preserve the paste for as long as two or three months in the refrigerator.",
    "Use vinegar instead of oil.",
    "White vinegar is an alternative preservative that doesn't affect the flavor as much as salt.",
    "Pour it in instead of oil when blending, adding it in dashes until the paste is smooth or until you've added about 2 tbsp (30 mL).",
    "Unfortunately, acidic ingredients such as vinegar can turn garlic paste blue-green.",
    "Add a spoonful of turmeric.",
    "Turmeric has anti-bacterial properties that can extend the shelf life of your food.",
    "In addition, the yellow color can keep your paste looking vibrant as it ages.",
    "Sterilize the bottles.",
    "To minimize spoilage, sterilize glass canning jars in a pot of boiling water.",
    "Dry with brand new paper towels to avoid contamination while removing all moisture.",
    "This is especially important if you do not have a refrigerator.",
    "Freeze the paste.",
    "If you plan to use the paste for more than a month, make a large batch and freeze the extra.",
    "Store the frozen paste in glass bottles with 1–2 inches (2.5–5 cm) headspace at the top to allow for expansion.",
    "Thaw within 6 months for best quality."
  ],
  "tyn_section":[
    "Food processor or blender",
    "Knife",
    "Two metal bowls of equal size ",
    "(optional)"
  ],
  "tyn_model":[
    "garlic",
    "ginger",
    "salt",
    "oil",
    "refrigerator",
    "bowl",
    "blender",
    "botulinum",
    "spoon",
    "vinegar",
    "turmeric",
    "bowls",
    "food processor",
    "vegetable oil",
    "canola,",
    "safflower oil",
    "fridge",
    "white vinegar",
    "water",
    "paper towels",
    "glass bottles"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.0476190476,
    "f1":0.08
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.0476190476,
    "f1":0.08
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}