{
  "title":"How to Put a Bow on a Baby",
  "url":"https://www.wikihow.com/Put-a-Bow-on-a-Baby",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects",
    "Bow Projects"
  ],
  "methods":[
    {
      "name":"Attach a Bow Directly to Baby's Head",
      "steps":[
        {
          "headline":"Squeeze a dot of lubricant jelly onto the middle of the bow on the side that you plan to attach to the baby's head.",
          "description":"Lubricant jelly is used by most hospitals to attach bows to the heads of newborn girls. Use corn syrup or white glue as an alternative to lubricant jelly if needed, but only if the product is water-soluble."
        },
        {
          "headline":"Gently press the bow to the top of your baby's head for approximately 5 seconds or until the bow sticks in place.",
          "description":""
        },
        {
          "headline":"Remove the bow at any time by applying water to the product being used to adhere the bow to the baby's head.",
          "description":"The adhesive will then dissolve upon coming into contact with the water, and the bow will be removed from your baby's head."
        }
      ]
    },
    {
      "name":"Put a Bow Headband on your Baby",
      "steps":[
        {
          "headline":"Obtain a soft, elastic headband sized for an infant's head.",
          "description":"Look specifically for a headband made with fold-over elastic, which is a soft type of elastic often used in lingerie, underwear, and other forms of knitwear."
        },
        {
          "headline":"Sew or hand-stitch a bow onto the elastic headband using a sewing needle and thread.",
          "description":"Use sewing thread in a color that matches the elastic headband."
        },
        {
          "headline":"Use scissors to cut off any remaining, excess thread that hangs from the headband after you have sewed on and attached the bow.",
          "description":""
        },
        {
          "headline":"Fashion the elastic headband around your baby's head as desired.",
          "description":"The soft fabric should gently encircle and rest around your baby's head without pinching their skin too tightly."
        }
      ]
    },
    {
      "name":"Put a Bow Clip on your Baby",
      "steps":[
        {
          "headline":"Obtain small, plain-style hair clips from a beauty supply store or craft store.",
          "description":"An example of hair clips you can use are double-prong hair clips that measure 1 and three-fourths of an inch (4.44 cm) long."
        },
        {
          "headline":"Attach a bow to the front of the hair clip using hot glue, or craft glue.",
          "description":""
        },
        {
          "headline":"Set the hair clip down, and allow the glue to dry completely.",
          "description":""
        },
        {
          "headline":"Attach the bow clip to your baby's hair.",
          "description":"Bow clips can only be attached to your baby's head if your baby has strands of hair on their head."
        }
      ]
    }
  ],
  "text":" Attach a Bow Directly to Baby's Head Squeeze a dot of lubricant jelly onto the middle of the bow on the side that you plan to attach to the baby's head. Lubricant jelly is used by most hospitals to attach bows to the heads of newborn girls. Use corn syrup or white glue as an alternative to lubricant jelly if needed, but only if the product is water-soluble. Gently press the bow to the top of your baby's head for approximately 5 seconds or until the bow sticks in place.  Remove the bow at any time by applying water to the product being used to adhere the bow to the baby's head. The adhesive will then dissolve upon coming into contact with the water, and the bow will be removed from your baby's head. Put a Bow Headband on your Baby Obtain a soft, elastic headband sized for an infant's head. Look specifically for a headband made with fold-over elastic, which is a soft type of elastic often used in lingerie, underwear, and other forms of knitwear. Sew or hand-stitch a bow onto the elastic headband using a sewing needle and thread. Use sewing thread in a color that matches the elastic headband. Use scissors to cut off any remaining, excess thread that hangs from the headband after you have sewed on and attached the bow.  Fashion the elastic headband around your baby's head as desired. The soft fabric should gently encircle and rest around your baby's head without pinching their skin too tightly. Put a Bow Clip on your Baby Obtain small, plain-style hair clips from a beauty supply store or craft store. An example of hair clips you can use are double-prong hair clips that measure 1 and three-fourths of an inch (4.44 cm) long. Attach a bow to the front of the hair clip using hot glue, or craft glue.  Set the hair clip down, and allow the glue to dry completely.  Attach the bow clip to your baby's hair. Bow clips can only be attached to your baby's head if your baby has strands of hair on their head.",
  "sentences":[
    " Attach a Bow Directly to Baby's Head Squeeze a dot of lubricant jelly onto the middle of the bow on the side that you plan to attach to the baby's head.",
    "Lubricant jelly is used by most hospitals to attach bows to the heads of newborn girls.",
    "Use corn syrup or white glue as an alternative to lubricant jelly if needed, but only if the product is water-soluble.",
    "Gently press the bow to the top of your baby's head for approximately 5 seconds or until the bow sticks in place.",
    "Remove the bow at any time by applying water to the product being used to adhere the bow to the baby's head.",
    "The adhesive will then dissolve upon coming into contact with the water, and the bow will be removed from your baby's head.",
    "Put a Bow Headband on your Baby Obtain a soft, elastic headband sized for an infant's head.",
    "Look specifically for a headband made with fold-over elastic, which is a soft type of elastic often used in lingerie, underwear, and other forms of knitwear.",
    "Sew or hand-stitch a bow onto the elastic headband using a sewing needle and thread.",
    "Use sewing thread in a color that matches the elastic headband.",
    "Use scissors to cut off any remaining, excess thread that hangs from the headband after you have sewed on and attached the bow.",
    "Fashion the elastic headband around your baby's head as desired.",
    "The soft fabric should gently encircle and rest around your baby's head without pinching their skin too tightly.",
    "Put a Bow Clip on your Baby Obtain small, plain-style hair clips from a beauty supply store or craft store.",
    "An example of hair clips you can use are double-prong hair clips that measure 1 and three-fourths of an inch (4.44 cm) long.",
    "Attach a bow to the front of the hair clip using hot glue, or craft glue.",
    "Set the hair clip down, and allow the glue to dry completely.",
    "Attach the bow clip to your baby's hair.",
    "Bow clips can only be attached to your baby's head if your baby has strands of hair on their head."
  ],
  "tyn_section":[
    "Tube of lubricant jelly",
    "Small bow",
    "Soft, elastic headband",
    "Sewing needle",
    "Sewing thread",
    "Scissors",
    "Hair clips",
    "Hot glue or craft glue"
  ],
  "tyn_model":[
    "lubricant jelly",
    "water",
    "elastic",
    "elastic headband",
    "corn syrup",
    "white glue",
    "sewing needle and thread",
    "sewing thread",
    "scissors",
    "fabric",
    "hot glue",
    "craft glue",
    "glue",
    "bow clip",
    "bow clips"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.1333333333,
    "f1":0.1739130435,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.4666666667,
    "f1":0.5753424658
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.6666666667,
    "f1":0.8
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.2,
    "f1":0.2608695652
  }
}