{
  "title":"How to Make a Pop up Photograph",
  "url":"https://www.wikihow.com/Make-a-Pop-up-Photograph",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Digital Technology Art and Craft Projects"
  ],
  "parts":[
    {
      "name":"Prepping, Selecting, and Cropping",
      "steps":[
        {
          "headline":"Create a duplicate of the background of the photo you want to use.",
          "description":"Select the original image in photoshop and press Ctrl+J (Windows) or Command+J (Mac) to make a second copy of the image. On the side panel of photoshop, you should see the “Layers” palette with a thumbnail of each image. If you want, you can rename each image so you don’t get confused. The original picture could be called “Layer 1” and the copy could be called “copy” or “background image.” Whatever works best for you is fine!Tip: For Windows commands, use the Ctrl button. For Mac commands, use the Command button."
        },
        {
          "headline":"Add a blank layer between the 2 copies of your photo.",
          "description":"Click on the top image in the layers palette. Then, press either Ctrl (Windows) or Command (Mac) and click on the “new layer” icon, which is on the bottom right-hand side of the layers box. A new, blank layer should appear between the first image and the second. This blank layer is mainly used to help visually separate your images so that you’re less likely to get them mixed up while you’re working."
        },
        {
          "headline":"Turn the newly added layer white by using the background color option.",
          "description":"Select the new, blank layer by clicking on it in the layers palette. Press Ctrl+Backspace (Windows) or Command+Delete (Mac) to fill the layer with a white background. The main image on your screen is most likely the first image in your layers palette, so it should stay the same. Use the palette box to view the change in the background color."
        },
        {
          "headline":"Use the pen tool to select the images from the first photo that you want to pop.",
          "description":"Select the first image in the layers palette so that that is the image you’re working on. Use the pen tool (or the lasso tool) to “cut out” the image you want to use from the photo. Carefully mark around the edges of the image, like if you were cutting it out from a magazine. For example, if you have a photo of your dog catching a frisbee, you could select your dog and the frisbee to pop out from the rest of the background. Sometimes you might need to zoom in on the image to get a really clean line around the edge of the image. Take your time and do your best to keep the pen or lasso as close to the edge as possible."
        },
        {
          "headline":"Copy the selected images into a new layer.",
          "description":"With the selected image still highlighted or outlined, press Ctrl+J (Windows) or Command+J (Mac) to create a copy of the image in a new layer. In the layers palette, you should see an additional image pop up with just the cropped-out image on it. At this stage, you should have 4 images on the layers palette: the background image layer, the white layer, the original layer, and the layer with this newly cropped-out image on it."
        },
        {
          "headline":"Create a cropped version of the original photo to make it smaller.",
          "description":"Select the “Layer 1” image again on the layers palette. Open the marquee tool and select the part of the original photo that you want to keep. It’s best to get rid of whatever excess is around the edges so you can make a really visually stunning 3D photo. Doing this helps create the “popping out” visual that you’re looking for. The smaller the cropped photo, the bigger the popping image will appear."
        }
      ]
    },
    {
      "name":"Adding a Border, Merging, and Finishing the Photo",
      "steps":[
        {
          "headline":"Add a border around the cropped photo by using the “stroke” tool.",
          "description":"Click on the “Layer Styles” button located at the bottom-left of the layers palette. Select “stroke” from the styles list. Where the styles box says “position,” select “inside” to create the border around the edge of the cropped image instead of around the entire slide. Then, move the pixel slide to either 13 or 15 pixels to make the image look more like a polaroid. Select white or a light gray color for the border color so that it doesn’t distract from the actual picture itself. The higher the pixel number you select, the wider the border will be."
        },
        {
          "headline":"Give the image a layer mask to remove the now blank background.",
          "description":"With your cropped photo selected in the layers palette, click on the “Add A Layer Mask” button at the bottom of the palette box. This removes the blank section that was around the cropped image so that just the image itself fills the pane. This should also automatically adjust for the clarity of the image, especially if the photo is now much more zoomed in than it was before."
        },
        {
          "headline":"Merge together the 2 separate layers you created.",
          "description":"Click on your now-bordered, cropped photo. Press the Shift key and click on the cut-out image in the layers palette. Press Ctrl+E (Windows) or Command+E (Mac) to combine the two slides into one image. There should now only be 3 images in the layers palette: the combined image, the white slide, and the original background slide."
        },
        {
          "headline":"Apply a drop shadow to the picture to make it pop even more.",
          "description":"Keep the merged image selected and click on the “Layers Style” button at the bottom of the palette box. Click “Drop Shadow” from the styles options. Lower the opacity from 75% (which is the default) to 60%. Make the angle 120-degrees, make the distance 5 pixels, and make the size 10 pixels (leave the spread at 0). The drop shadow just helps outline the cropped image a little bit more from the background image, which makes it visually pop a little bit more than if you didn’t add it. Feel free to play around with the settings for the drop shadow. You may find that something a little different works best for your particular image."
        },
        {
          "headline":"Print your photo or share it online to enjoy your handiwork.",
          "description":"Whichever way you decide to share what you created, you’re bound to impress friends and family with your skills. Pop up photographs are a great way to highlight a special moment and they make great gifts.Tip: If your picture is of someone else and you want to share it online, make sure to get that person’s permission before you post it."
        }
      ]
    }
  ],
  "text":" Prepping, Selecting, and Cropping Create a duplicate of the background of the photo you want to use. Select the original image in photoshop and press Ctrl+J (Windows) or Command+J (Mac) to make a second copy of the image. On the side panel of photoshop, you should see the “Layers” palette with a thumbnail of each image. If you want, you can rename each image so you don’t get confused. The original picture could be called “Layer 1” and the copy could be called “copy” or “background image.” Whatever works best for you is fine!Tip: For Windows commands, use the Ctrl button. For Mac commands, use the Command button. Add a blank layer between the 2 copies of your photo. Click on the top image in the layers palette. Then, press either Ctrl (Windows) or Command (Mac) and click on the “new layer” icon, which is on the bottom right-hand side of the layers box. A new, blank layer should appear between the first image and the second. This blank layer is mainly used to help visually separate your images so that you’re less likely to get them mixed up while you’re working. Turn the newly added layer white by using the background color option. Select the new, blank layer by clicking on it in the layers palette. Press Ctrl+Backspace (Windows) or Command+Delete (Mac) to fill the layer with a white background. The main image on your screen is most likely the first image in your layers palette, so it should stay the same. Use the palette box to view the change in the background color. Use the pen tool to select the images from the first photo that you want to pop. Select the first image in the layers palette so that that is the image you’re working on. Use the pen tool (or the lasso tool) to “cut out” the image you want to use from the photo. Carefully mark around the edges of the image, like if you were cutting it out from a magazine. For example, if you have a photo of your dog catching a frisbee, you could select your dog and the frisbee to pop out from the rest of the background. Sometimes you might need to zoom in on the image to get a really clean line around the edge of the image. Take your time and do your best to keep the pen or lasso as close to the edge as possible. Copy the selected images into a new layer. With the selected image still highlighted or outlined, press Ctrl+J (Windows) or Command+J (Mac) to create a copy of the image in a new layer. In the layers palette, you should see an additional image pop up with just the cropped-out image on it. At this stage, you should have 4 images on the layers palette: the background image layer, the white layer, the original layer, and the layer with this newly cropped-out image on it. Create a cropped version of the original photo to make it smaller. Select the “Layer 1” image again on the layers palette. Open the marquee tool and select the part of the original photo that you want to keep. It’s best to get rid of whatever excess is around the edges so you can make a really visually stunning 3D photo. Doing this helps create the “popping out” visual that you’re looking for. The smaller the cropped photo, the bigger the popping image will appear. Adding a Border, Merging, and Finishing the Photo Add a border around the cropped photo by using the “stroke” tool. Click on the “Layer Styles” button located at the bottom-left of the layers palette. Select “stroke” from the styles list. Where the styles box says “position,” select “inside” to create the border around the edge of the cropped image instead of around the entire slide. Then, move the pixel slide to either 13 or 15 pixels to make the image look more like a polaroid. Select white or a light gray color for the border color so that it doesn’t distract from the actual picture itself. The higher the pixel number you select, the wider the border will be. Give the image a layer mask to remove the now blank background. With your cropped photo selected in the layers palette, click on the “Add A Layer Mask” button at the bottom of the palette box. This removes the blank section that was around the cropped image so that just the image itself fills the pane. This should also automatically adjust for the clarity of the image, especially if the photo is now much more zoomed in than it was before. Merge together the 2 separate layers you created. Click on your now-bordered, cropped photo. Press the Shift key and click on the cut-out image in the layers palette. Press Ctrl+E (Windows) or Command+E (Mac) to combine the two slides into one image. There should now only be 3 images in the layers palette: the combined image, the white slide, and the original background slide. Apply a drop shadow to the picture to make it pop even more. Keep the merged image selected and click on the “Layers Style” button at the bottom of the palette box. Click “Drop Shadow” from the styles options. Lower the opacity from 75% (which is the default) to 60%. Make the angle 120-degrees, make the distance 5 pixels, and make the size 10 pixels (leave the spread at 0). The drop shadow just helps outline the cropped image a little bit more from the background image, which makes it visually pop a little bit more than if you didn’t add it. Feel free to play around with the settings for the drop shadow. You may find that something a little different works best for your particular image. Print your photo or share it online to enjoy your handiwork. Whichever way you decide to share what you created, you’re bound to impress friends and family with your skills. Pop up photographs are a great way to highlight a special moment and they make great gifts.Tip: If your picture is of someone else and you want to share it online, make sure to get that person’s permission before you post it.",
  "sentences":[
    " Prepping, Selecting, and Cropping Create a duplicate of the background of the photo you want to use.",
    "Select the original image in photoshop and press Ctrl+J (Windows) or Command+J (Mac) to make a second copy of the image.",
    "On the side panel of photoshop, you should see the “Layers” palette with a thumbnail of each image.",
    "If you want, you can rename each image so you don’t get confused.",
    "The original picture could be called “Layer 1” and the copy could be called “copy” or “background image.” Whatever works best for you is fine!Tip: For Windows commands, use the Ctrl button.",
    "For Mac commands, use the Command button.",
    "Add a blank layer between the 2 copies of your photo.",
    "Click on the top image in the layers palette.",
    "Then, press either Ctrl (Windows) or Command (Mac) and click on the “new layer” icon, which is on the bottom right-hand side of the layers box.",
    "A new, blank layer should appear between the first image and the second.",
    "This blank layer is mainly used to help visually separate your images so that you’re less likely to get them mixed up while you’re working.",
    "Turn the newly added layer white by using the background color option.",
    "Select the new, blank layer by clicking on it in the layers palette.",
    "Press Ctrl+Backspace (Windows) or Command+Delete (Mac) to fill the layer with a white background.",
    "The main image on your screen is most likely the first image in your layers palette, so it should stay the same.",
    "Use the palette box to view the change in the background color.",
    "Use the pen tool to select the images from the first photo that you want to pop.",
    "Select the first image in the layers palette so that that is the image you’re working on.",
    "Use the pen tool (or the lasso tool) to “cut out” the image you want to use from the photo.",
    "Carefully mark around the edges of the image, like if you were cutting it out from a magazine.",
    "For example, if you have a photo of your dog catching a frisbee, you could select your dog and the frisbee to pop out from the rest of the background.",
    "Sometimes you might need to zoom in on the image to get a really clean line around the edge of the image.",
    "Take your time and do your best to keep the pen or lasso as close to the edge as possible.",
    "Copy the selected images into a new layer.",
    "With the selected image still highlighted or outlined, press Ctrl+J (Windows) or Command+J (Mac) to create a copy of the image in a new layer.",
    "In the layers palette, you should see an additional image pop up with just the cropped-out image on it.",
    "At this stage, you should have 4 images on the layers palette: the background image layer, the white layer, the original layer, and the layer with this newly cropped-out image on it.",
    "Create a cropped version of the original photo to make it smaller.",
    "Select the “Layer 1” image again on the layers palette.",
    "Open the marquee tool and select the part of the original photo that you want to keep.",
    "It’s best to get rid of whatever excess is around the edges so you can make a really visually stunning 3D photo.",
    "Doing this helps create the “popping out” visual that you’re looking for.",
    "The smaller the cropped photo, the bigger the popping image will appear.",
    "Adding a Border, Merging, and Finishing the Photo Add a border around the cropped photo by using the “stroke” tool.",
    "Click on the “Layer Styles” button located at the bottom-left of the layers palette.",
    "Select “stroke” from the styles list.",
    "Where the styles box says “position,” select “inside” to create the border around the edge of the cropped image instead of around the entire slide.",
    "Then, move the pixel slide to either 13 or 15 pixels to make the image look more like a polaroid.",
    "Select white or a light gray color for the border color so that it doesn’t distract from the actual picture itself.",
    "The higher the pixel number you select, the wider the border will be.",
    "Give the image a layer mask to remove the now blank background.",
    "With your cropped photo selected in the layers palette, click on the “Add A Layer Mask” button at the bottom of the palette box.",
    "This removes the blank section that was around the cropped image so that just the image itself fills the pane.",
    "This should also automatically adjust for the clarity of the image, especially if the photo is now much more zoomed in than it was before.",
    "Merge together the 2 separate layers you created.",
    "Click on your now-bordered, cropped photo.",
    "Press the Shift key and click on the cut-out image in the layers palette.",
    "Press Ctrl+E (Windows) or Command+E (Mac) to combine the two slides into one image.",
    "There should now only be 3 images in the layers palette: the combined image, the white slide, and the original background slide.",
    "Apply a drop shadow to the picture to make it pop even more.",
    "Keep the merged image selected and click on the “Layers Style” button at the bottom of the palette box.",
    "Click “Drop Shadow” from the styles options.",
    "Lower the opacity from 75% (which is the default) to 60%.",
    "Make the angle 120-degrees, make the distance 5 pixels, and make the size 10 pixels (leave the spread at 0).",
    "The drop shadow just helps outline the cropped image a little bit more from the background image, which makes it visually pop a little bit more than if you didn’t add it.",
    "Feel free to play around with the settings for the drop shadow.",
    "You may find that something a little different works best for your particular image.",
    "Print your photo or share it online to enjoy your handiwork.",
    "Whichever way you decide to share what you created, you’re bound to impress friends and family with your skills.",
    "Pop up photographs are a great way to highlight a special moment and they make great gifts.Tip: If your picture is of someone else and you want to share it online, make sure to get that person’s permission before you post it."
  ],
  "tyn_section":[
    "Computer",
    "Photoshop",
    "Digital image of photo"
  ],
  "tyn_model":[
    "layers palette",
    "“layer",
    "” button",
    "photoshop",
    "“layers",
    "pen",
    "“stroke",
    "” from",
    "layer mask",
    "” palette",
    "” and",
    "“copy",
    "” or",
    "“background",
    "” whatever",
    "“new",
    "” icon",
    "pen tool",
    "“cut",
    "” the",
    "lasso",
    "” image",
    "“popping",
    "” visual",
    "” tool",
    "“position",
    "” select",
    "“inside",
    "” to",
    "polaroid",
    "“add",
    "drop shadow",
    "“drop shadow",
    "photographs"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0294117647,
    "f1":0.0540540541,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0294117647,
    "f1":0.0540540541
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.0294117647,
    "f1":0.0540540541
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0294117647,
    "f1":0.0540540541
  }
}