{
  "title":"How to Decorate a Bathroom",
  "url":"https://www.wikihow.com/Decorate-a-Bathroom",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Changing the Patterns and Colors",
      "steps":[
        {
          "headline":"Choose a theme and color scheme for your bathroom.",
          "description":"Most people prefer refreshing themes and colors, such as cool blues, Zen, pale green, or nautical. You can choose something more unique, however, such as vintage, romantic, or ornate. Pastel colors are great for a vintage look, while deep reds and golds are perfect for an ornate look. You can also use neutral colors, such as white and black, or white and silver. Your theme can be specific, such as rustic farmhouse, or general, such as traditional or classic. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKatherine Tlapa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInterior Designer\t\t\t\t\t\t\t\tKatherine Tlapa is an interior designer, currently working as a Design Specialist for Modsy, a design service based in San Francisco. She also runs her own DIY Home Design blog, My Eclectic Grace. She received her BFA in Interior Architecture from Ohio University in 2016. Katherine Tlapa\t\t\tInterior Designer\t\t\t\tKeep things simple if you have a small bathroom. Katherine Tlapa, an interior designer, suggests: \"If you want to do something bold, keep it to one thing—like a bold shower curtain or a single accent wall. Utilizing all the nooks and crannies for storage is also important in a small bathroom.\""
        },
        {
          "headline":"Repaint your bathroom or bathroom furniture.",
          "description":"You can repaint the entire bathroom, or you can paint just 1 wall an accent color. For example, if your bathroom’s walls are all white, consider painting 1 wall a different color, like light blue or pale gray. Make sure that you use a paint suitable for humid, bathroom environments. The best paint finish for a bathroom will be satin or semi-gloss."
        },
        {
          "headline":"Add some wallpaper as an alternative.",
          "description":"You can apply the wallpaper over all of the bathroom’s walls, or you can choose just 1 accent wall. You can also use a narrow strip of wallpaper trim along the top or middle of the wall instead. Make sure that the wallpaper matches the color and theme of your bathroom."
        },
        {
          "headline":"Apply a wall treatment for an upscale design.",
          "description":"Great options for your bathroom include tile, faux shiplap, stone, or glass. Although they're a more expensive decorative option, wall treatments last a long time and elevate your design. Make sure the wall treatment you pick is appropriate for a bathroom, since it will get humid. When in doubt, talk to a product representative."
        },
        {
          "headline":"Use wall decals or framed artwork as a temporary option.",
          "description":"If you live in a rental unit, you may not be able to repaint the walls or use wall paper. You can still use removable wall decals. You can also hang some framed artwork above the toilet or towel rack instead. Simple silhouettes work the best when it comes to wall decals. Try scrolls or filigree for a fancy look, or trees and greenery for a serene look. If your bathroom doesn't have good ventilation, the frames must contain glass. If you're wanting a temporary upscale look, you can install peel-and-stick tiles behind your sink to create a backsplash. You can find these at home improvement stores or online."
        },
        {
          "headline":"Paint the back walls inside open shelving units.",
          "description":"If you have shelves in your bathroom, consider painting the walls behind them a different color. This works best on shelves without cabinet doors, but you can do this on cabinets too. For example, if your bathroom has white walls, paint the walls behind the shelves a light gray for a subtle pop of color. If you want to add a designer touch to your shelves, you can install wallpaper or contact paper along the back wall instead of paint. As another option, you could apply the contact paper just on the shelves."
        }
      ]
    },
    {
      "name":"Adding Textiles and Furniture",
      "steps":[
        {
          "headline":"Add a small, decorative stand or side table.",
          "description":"Choose a small stand or a side table that is 12 to 18 inches (30 to 46 cm) across and tuck it into a niche or corner. Not only will this look cute, but it can double-up as extra storage. For example, you could keep candles or bowls filled with pretty soaps on top of the table. If your table has shelves, roll up your towels and place them inside the shelves. Not only is this a great decorative touch, it's also practical! Consider placing a nice tray atop the table for your toiletries or perfumes."
        },
        {
          "headline":"Consider an upholstered bench for comfort and luxury.",
          "description":"Choose a bench that matches the style and colors of your bathroom, then set it against the wall. If you have a small bathroom but still want a hint of luxury, consider an upholstered stool instead. Don't be afraid to take a bench apart and re-paint or re-upholster it. If you decide to re-upholster the bench, make sure you choose a water-resistant fabric. This is especially important if you plan to sit on the bench while wet or place wet items on the bench. Otherwise, it may develop mold or mildew."
        },
        {
          "headline":"Get a shelving unit if you have space for it.",
          "description":"Not only can this add a decorative element to your bathroom, but it will also allow you to store other items, such as towels, toilet paper, and so forth. Make the shelf more decorative by adding a plant or a vessel filled with pretty soaps or bath bombs. If you have a small bathroom, consider adding a single, narrow shelf just above the bathroom vanity. Store your perfumes, cosmetics, and toothbrushes on it. If you have a small bathroom, consider getting a mini metal shelving unit that you can place on your bathroom counter or hang above the toilet. Another option for shelving is floating shelves, which are great if you don't have the space for a unit. You can hang your floating shelves over your toilet or, if there's no shower, above the bathtub. Use your shelves for extra towels, rolls of toilet paper, personal care items, or decorations."
        },
        {
          "headline":"Brighten up a dull bathroom with colorful towels or a bathmat.",
          "description":"One of the quickest ways to change the look of your bathroom is by swapping out the towels and bathmat for something new. Consider the season. Warm colors work well for fall, while cool colors work better for winter. Pastels are great for spring, and bright colors are ideal for summer. Play around with different shades and layering. For example, try a light green hand towel over a dark green bath towel. Bathmats don’t always have to be made from towel material. You can get wooden or bamboo ones too!"
        },
        {
          "headline":"Change out the shower curtain for something more exciting.",
          "description":"If you have a plain white or frosted shower curtain, consider switching it out for a different one. Pick out a bright color that matches your towels. If solid colors aren't your thing, try a pattern instead. If you are going with a pattern, make sure that it matches the other colors in your bathroom. If you have a window in your bathroom, consider getting some mini curtains or blinds for it. Keep them open so that you have lots of daylight. If you have any curtains you aren't using, you can hang these over your plastic shower curtain to create a fancy look."
        }
      ]
    },
    {
      "name":"Updating Fixtures and Lighting",
      "steps":[
        {
          "headline":"Take advantage of natural lighting if your bathroom has it.",
          "description":"Some bathrooms have windows in them. These are great of bringing in natural daylight and giving your bathroom a fresher look. Clear the area in front of the window, wipe the window clean, and repaint the sill, if needed. Decorate your window with opened curtains or plants, but keep it minimal so that the light can pass through. On the other hand, if your bathroom has a grand, luxurious theme, hanging heavy curtains in front of the window may work better."
        },
        {
          "headline":"Trade out the light bulbs for something new.",
          "description":"If you have lights above your bathroom mirror, consider switching them out for different ones. This can be as simple as changing the old, bright bulbs for frosted ones. It can be as fancy as getting actual lights with fancy covers or fixtures around them. If your lights have fixtures or covers, make sure that they match the other metallic elements in your bathroom. If you like to do makeup in your bathroom, choose lights with a bright, white glow. Avoid lights that give you a hazy, golden glow; it’s not good lighting for makeup. If your bathroom is too dark, high-efficiency LED lights can give your bathroom a bright, white glow."
        },
        {
          "headline":"Switch out the towel racks for something new.",
          "description":"Make sure that the new towel racks match the other metal fixtures in your bathroom, however. For example, if you have gold faucets, you should get gold towel racks--not silver ones. Towel racks don’t always have to look like horizontal rods or bars. You can get ones shaped like hooks or loops instead. If you can't afford to replace your towel racks, you can paint them instead! Simply take them off the wall and bring them outside. Use a metal spray paint to coat them in a new color. You could choose something metallic or mix it up with a fun shade that matches your bathroom, like a blue."
        },
        {
          "headline":"Change your mirror, or put a frame around it.",
          "description":"If your mirror looks plain, see if you can find a fancier mirror. Oval mirrors or mirrors with beveled edges are a great option. If you can't change your mirror, consider framing it instead. You can use an actual frame, or you can use glass mosaic tiles instead. If you are framing the mirror, use colors that match the other colors in your bathroom."
        },
        {
          "headline":"Change the fixtures in your bathroom for a more adventurous project.",
          "description":"This can be difficult for someone who has not done it before, so if the task is too intimidating for you, hire a handyman. Make sure that the colors go well with the overall theme of your bathroom. For example, if your bathroom is ornate with lots of burgundy and gold, consider gold fixtures. If your bathroom has a modern or Zen theme, try matte silver fixtures instead."
        }
      ]
    },
    {
      "name":"Adding Accessories and Storage",
      "steps":[
        {
          "headline":"Bring some character with candles or decorative items.",
          "description":"Things like pillar candles, figurines, and vases all make great bathroom accents. Find some items that match the color and theme of your bathroom, then display them in an out-of-the-way area, such as a side table, a shelf, or the corner of the counter. If you are getting pillar candles, consider getting 3 candles that are the same color, but different heights and thicknesses. This will create some interesting variation. Make sure that the items you choose can withstand humid conditions. Avoid using breakable items, such as glass, if you have curious children or pets."
        },
        {
          "headline":"Bring in some greenery with a plant or 2.",
          "description":"Choose a plant that requires low levels of sunlight. Even if your bathroom has a window in it, it likely won't provide enough sunlight for your plant. Match the pots to your bathroom's tiles, towels, mat, or shower curtain. Every so often, move your plant into a bright window for a day or 2 so that it can absorb sunlight. Air plants are a great option for your bathroom! They'll thrive in the humid bathroom environment and require little care. Hang some fake, green floral garlands along the ceiling. Ivy is a classic choice, but you can also try ferns or wisteria."
        },
        {
          "headline":"Store extra towels and toilet paper in baskets.",
          "description":"Instead of keeping towels and toilet paper stacks on a shelf, put them into decorative storage baskets instead. Measure the depth of your shelf or cabinet first, then purchase some square or rectangular baskets that match those dimensions. You can also use wire or canvas baskets. Container stores, fabric stores, and craft stores generally have a vast selection. If you have space next to your sink or toilet, you can keep the baskets there as well. You are not just limited to towels and toilet paper; you can store other items that you want to keep out of sight too, such as hair styling tools."
        },
        {
          "headline":"Keep cotton balls, Q-tips, and other toiletries in glass jars or vessels.",
          "description":"Instead of leaving these items in the cabinet, transfer them into glass or clear acrylic containers, then keep the containers on your bathroom counter. Use 1 container for each type of item. For example, keep your cotton balls in a tall jar and your Q-tips in a squat container. Consider a vase or apothecary-style jar for extra bath bombs, mini lotion bottles, or hand soaps. Tiered cupcake stands and cake stands make cute displays for perfumes, nail polish, and other cosmetics. Old Mason jars are a great, low cost option for storing your items! If you don't like the look of them plain, add a ribbon or piece of fabric to make them match your decor. As another option, you could paint the jars, though you wouldn't be able to see into them anymore."
        },
        {
          "headline":"Make use of soap dispensers and toothbrush holders.",
          "description":"Instead of keeping your liquid hand soap in the plastic bottle it came in, pour it into a glass or ceramic soap dispenser. If you prefer to use solid soap, keep it in a little dish or tray instead. Keep your toothbrushes in a toothbrush holder. Make sure that it matches your soap dish or soap dispenser. If you like to use mouthwash, consider pouring it into a glass vessel or bottle instead. Have some paper cups nearby, so that you have something to pour the mouthwash into."
        }
      ]
    }
  ],
  "text":" Changing the Patterns and Colors Choose a theme and color scheme for your bathroom. Most people prefer refreshing themes and colors, such as cool blues, Zen, pale green, or nautical. You can choose something more unique, however, such as vintage, romantic, or ornate. Pastel colors are great for a vintage look, while deep reds and golds are perfect for an ornate look. You can also use neutral colors, such as white and black, or white and silver. Your theme can be specific, such as rustic farmhouse, or general, such as traditional or classic. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKatherine Tlapa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInterior Designer\t\t\t\t\t\t\t\tKatherine Tlapa is an interior designer, currently working as a Design Specialist for Modsy, a design service based in San Francisco. She also runs her own DIY Home Design blog, My Eclectic Grace. She received her BFA in Interior Architecture from Ohio University in 2016. Katherine Tlapa\t\t\tInterior Designer\t\t\t\tKeep things simple if you have a small bathroom. Katherine Tlapa, an interior designer, suggests: \"If you want to do something bold, keep it to one thing—like a bold shower curtain or a single accent wall. Utilizing all the nooks and crannies for storage is also important in a small bathroom.\" Repaint your bathroom or bathroom furniture. You can repaint the entire bathroom, or you can paint just 1 wall an accent color. For example, if your bathroom’s walls are all white, consider painting 1 wall a different color, like light blue or pale gray. Make sure that you use a paint suitable for humid, bathroom environments. The best paint finish for a bathroom will be satin or semi-gloss. Add some wallpaper as an alternative. You can apply the wallpaper over all of the bathroom’s walls, or you can choose just 1 accent wall. You can also use a narrow strip of wallpaper trim along the top or middle of the wall instead. Make sure that the wallpaper matches the color and theme of your bathroom. Apply a wall treatment for an upscale design. Great options for your bathroom include tile, faux shiplap, stone, or glass. Although they're a more expensive decorative option, wall treatments last a long time and elevate your design. Make sure the wall treatment you pick is appropriate for a bathroom, since it will get humid. When in doubt, talk to a product representative. Use wall decals or framed artwork as a temporary option. If you live in a rental unit, you may not be able to repaint the walls or use wall paper. You can still use removable wall decals. You can also hang some framed artwork above the toilet or towel rack instead. Simple silhouettes work the best when it comes to wall decals. Try scrolls or filigree for a fancy look, or trees and greenery for a serene look. If your bathroom doesn't have good ventilation, the frames must contain glass. If you're wanting a temporary upscale look, you can install peel-and-stick tiles behind your sink to create a backsplash. You can find these at home improvement stores or online. Paint the back walls inside open shelving units. If you have shelves in your bathroom, consider painting the walls behind them a different color. This works best on shelves without cabinet doors, but you can do this on cabinets too. For example, if your bathroom has white walls, paint the walls behind the shelves a light gray for a subtle pop of color. If you want to add a designer touch to your shelves, you can install wallpaper or contact paper along the back wall instead of paint. As another option, you could apply the contact paper just on the shelves. Adding Textiles and Furniture Add a small, decorative stand or side table. Choose a small stand or a side table that is 12 to 18 inches (30 to 46 cm) across and tuck it into a niche or corner. Not only will this look cute, but it can double-up as extra storage. For example, you could keep candles or bowls filled with pretty soaps on top of the table. If your table has shelves, roll up your towels and place them inside the shelves. Not only is this a great decorative touch, it's also practical! Consider placing a nice tray atop the table for your toiletries or perfumes. Consider an upholstered bench for comfort and luxury. Choose a bench that matches the style and colors of your bathroom, then set it against the wall. If you have a small bathroom but still want a hint of luxury, consider an upholstered stool instead. Don't be afraid to take a bench apart and re-paint or re-upholster it. If you decide to re-upholster the bench, make sure you choose a water-resistant fabric. This is especially important if you plan to sit on the bench while wet or place wet items on the bench. Otherwise, it may develop mold or mildew. Get a shelving unit if you have space for it. Not only can this add a decorative element to your bathroom, but it will also allow you to store other items, such as towels, toilet paper, and so forth. Make the shelf more decorative by adding a plant or a vessel filled with pretty soaps or bath bombs. If you have a small bathroom, consider adding a single, narrow shelf just above the bathroom vanity. Store your perfumes, cosmetics, and toothbrushes on it. If you have a small bathroom, consider getting a mini metal shelving unit that you can place on your bathroom counter or hang above the toilet. Another option for shelving is floating shelves, which are great if you don't have the space for a unit. You can hang your floating shelves over your toilet or, if there's no shower, above the bathtub. Use your shelves for extra towels, rolls of toilet paper, personal care items, or decorations. Brighten up a dull bathroom with colorful towels or a bathmat. One of the quickest ways to change the look of your bathroom is by swapping out the towels and bathmat for something new. Consider the season. Warm colors work well for fall, while cool colors work better for winter. Pastels are great for spring, and bright colors are ideal for summer. Play around with different shades and layering. For example, try a light green hand towel over a dark green bath towel. Bathmats don’t always have to be made from towel material. You can get wooden or bamboo ones too! Change out the shower curtain for something more exciting. If you have a plain white or frosted shower curtain, consider switching it out for a different one. Pick out a bright color that matches your towels. If solid colors aren't your thing, try a pattern instead. If you are going with a pattern, make sure that it matches the other colors in your bathroom. If you have a window in your bathroom, consider getting some mini curtains or blinds for it. Keep them open so that you have lots of daylight. If you have any curtains you aren't using, you can hang these over your plastic shower curtain to create a fancy look. Updating Fixtures and Lighting Take advantage of natural lighting if your bathroom has it. Some bathrooms have windows in them. These are great of bringing in natural daylight and giving your bathroom a fresher look. Clear the area in front of the window, wipe the window clean, and repaint the sill, if needed. Decorate your window with opened curtains or plants, but keep it minimal so that the light can pass through. On the other hand, if your bathroom has a grand, luxurious theme, hanging heavy curtains in front of the window may work better. Trade out the light bulbs for something new. If you have lights above your bathroom mirror, consider switching them out for different ones. This can be as simple as changing the old, bright bulbs for frosted ones. It can be as fancy as getting actual lights with fancy covers or fixtures around them. If your lights have fixtures or covers, make sure that they match the other metallic elements in your bathroom. If you like to do makeup in your bathroom, choose lights with a bright, white glow. Avoid lights that give you a hazy, golden glow; it’s not good lighting for makeup. If your bathroom is too dark, high-efficiency LED lights can give your bathroom a bright, white glow. Switch out the towel racks for something new. Make sure that the new towel racks match the other metal fixtures in your bathroom, however. For example, if you have gold faucets, you should get gold towel racks--not silver ones. Towel racks don’t always have to look like horizontal rods or bars. You can get ones shaped like hooks or loops instead. If you can't afford to replace your towel racks, you can paint them instead! Simply take them off the wall and bring them outside. Use a metal spray paint to coat them in a new color. You could choose something metallic or mix it up with a fun shade that matches your bathroom, like a blue. Change your mirror, or put a frame around it. If your mirror looks plain, see if you can find a fancier mirror. Oval mirrors or mirrors with beveled edges are a great option. If you can't change your mirror, consider framing it instead. You can use an actual frame, or you can use glass mosaic tiles instead. If you are framing the mirror, use colors that match the other colors in your bathroom. Change the fixtures in your bathroom for a more adventurous project. This can be difficult for someone who has not done it before, so if the task is too intimidating for you, hire a handyman. Make sure that the colors go well with the overall theme of your bathroom. For example, if your bathroom is ornate with lots of burgundy and gold, consider gold fixtures. If your bathroom has a modern or Zen theme, try matte silver fixtures instead. Adding Accessories and Storage Bring some character with candles or decorative items. Things like pillar candles, figurines, and vases all make great bathroom accents. Find some items that match the color and theme of your bathroom, then display them in an out-of-the-way area, such as a side table, a shelf, or the corner of the counter. If you are getting pillar candles, consider getting 3 candles that are the same color, but different heights and thicknesses. This will create some interesting variation. Make sure that the items you choose can withstand humid conditions. Avoid using breakable items, such as glass, if you have curious children or pets. Bring in some greenery with a plant or 2. Choose a plant that requires low levels of sunlight. Even if your bathroom has a window in it, it likely won't provide enough sunlight for your plant. Match the pots to your bathroom's tiles, towels, mat, or shower curtain. Every so often, move your plant into a bright window for a day or 2 so that it can absorb sunlight. Air plants are a great option for your bathroom! They'll thrive in the humid bathroom environment and require little care. Hang some fake, green floral garlands along the ceiling. Ivy is a classic choice, but you can also try ferns or wisteria. Store extra towels and toilet paper in baskets. Instead of keeping towels and toilet paper stacks on a shelf, put them into decorative storage baskets instead. Measure the depth of your shelf or cabinet first, then purchase some square or rectangular baskets that match those dimensions. You can also use wire or canvas baskets. Container stores, fabric stores, and craft stores generally have a vast selection. If you have space next to your sink or toilet, you can keep the baskets there as well. You are not just limited to towels and toilet paper; you can store other items that you want to keep out of sight too, such as hair styling tools. Keep cotton balls, Q-tips, and other toiletries in glass jars or vessels. Instead of leaving these items in the cabinet, transfer them into glass or clear acrylic containers, then keep the containers on your bathroom counter. Use 1 container for each type of item. For example, keep your cotton balls in a tall jar and your Q-tips in a squat container. Consider a vase or apothecary-style jar for extra bath bombs, mini lotion bottles, or hand soaps. Tiered cupcake stands and cake stands make cute displays for perfumes, nail polish, and other cosmetics. Old Mason jars are a great, low cost option for storing your items! If you don't like the look of them plain, add a ribbon or piece of fabric to make them match your decor. As another option, you could paint the jars, though you wouldn't be able to see into them anymore. Make use of soap dispensers and toothbrush holders. Instead of keeping your liquid hand soap in the plastic bottle it came in, pour it into a glass or ceramic soap dispenser. If you prefer to use solid soap, keep it in a little dish or tray instead. Keep your toothbrushes in a toothbrush holder. Make sure that it matches your soap dish or soap dispenser. If you like to use mouthwash, consider pouring it into a glass vessel or bottle instead. Have some paper cups nearby, so that you have something to pour the mouthwash into.",
  "sentences":[
    " Changing the Patterns and Colors Choose a theme and color scheme for your bathroom.",
    "Most people prefer refreshing themes and colors, such as cool blues, Zen, pale green, or nautical.",
    "You can choose something more unique, however, such as vintage, romantic, or ornate.",
    "Pastel colors are great for a vintage look, while deep reds and golds are perfect for an ornate look.",
    "You can also use neutral colors, such as white and black, or white and silver.",
    "Your theme can be specific, such as rustic farmhouse, or general, such as traditional or classic.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKatherine Tlapa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInterior Designer\t\t\t\t\t\t\t\tKatherine Tlapa is an interior designer, currently working as a Design Specialist for Modsy, a design service based in San Francisco.",
    "She also runs her own DIY Home Design blog, My Eclectic Grace.",
    "She received her BFA in Interior Architecture from Ohio University in 2016.",
    "Katherine Tlapa\t\t\tInterior Designer\t\t\t\tKeep things simple if you have a small bathroom.",
    "Katherine Tlapa, an interior designer, suggests: \"If you want to do something bold, keep it to one thing—like a bold shower curtain or a single accent wall.",
    "Utilizing all the nooks and crannies for storage is also important in a small bathroom.\"",
    "Repaint your bathroom or bathroom furniture.",
    "You can repaint the entire bathroom, or you can paint just 1 wall an accent color.",
    "For example, if your bathroom’s walls are all white, consider painting 1 wall a different color, like light blue or pale gray.",
    "Make sure that you use a paint suitable for humid, bathroom environments.",
    "The best paint finish for a bathroom will be satin or semi-gloss.",
    "Add some wallpaper as an alternative.",
    "You can apply the wallpaper over all of the bathroom’s walls, or you can choose just 1 accent wall.",
    "You can also use a narrow strip of wallpaper trim along the top or middle of the wall instead.",
    "Make sure that the wallpaper matches the color and theme of your bathroom.",
    "Apply a wall treatment for an upscale design.",
    "Great options for your bathroom include tile, faux shiplap, stone, or glass.",
    "Although they're a more expensive decorative option, wall treatments last a long time and elevate your design.",
    "Make sure the wall treatment you pick is appropriate for a bathroom, since it will get humid.",
    "When in doubt, talk to a product representative.",
    "Use wall decals or framed artwork as a temporary option.",
    "If you live in a rental unit, you may not be able to repaint the walls or use wall paper.",
    "You can still use removable wall decals.",
    "You can also hang some framed artwork above the toilet or towel rack instead.",
    "Simple silhouettes work the best when it comes to wall decals.",
    "Try scrolls or filigree for a fancy look, or trees and greenery for a serene look.",
    "If your bathroom doesn't have good ventilation, the frames must contain glass.",
    "If you're wanting a temporary upscale look, you can install peel-and-stick tiles behind your sink to create a backsplash.",
    "You can find these at home improvement stores or online.",
    "Paint the back walls inside open shelving units.",
    "If you have shelves in your bathroom, consider painting the walls behind them a different color.",
    "This works best on shelves without cabinet doors, but you can do this on cabinets too.",
    "For example, if your bathroom has white walls, paint the walls behind the shelves a light gray for a subtle pop of color.",
    "If you want to add a designer touch to your shelves, you can install wallpaper or contact paper along the back wall instead of paint.",
    "As another option, you could apply the contact paper just on the shelves.",
    "Adding Textiles and Furniture Add a small, decorative stand or side table.",
    "Choose a small stand or a side table that is 12 to 18 inches (30 to 46 cm) across and tuck it into a niche or corner.",
    "Not only will this look cute, but it can double-up as extra storage.",
    "For example, you could keep candles or bowls filled with pretty soaps on top of the table.",
    "If your table has shelves, roll up your towels and place them inside the shelves.",
    "Not only is this a great decorative touch, it's also practical!",
    "Consider placing a nice tray atop the table for your toiletries or perfumes.",
    "Consider an upholstered bench for comfort and luxury.",
    "Choose a bench that matches the style and colors of your bathroom, then set it against the wall.",
    "If you have a small bathroom but still want a hint of luxury, consider an upholstered stool instead.",
    "Don't be afraid to take a bench apart and re-paint or re-upholster it.",
    "If you decide to re-upholster the bench, make sure you choose a water-resistant fabric.",
    "This is especially important if you plan to sit on the bench while wet or place wet items on the bench.",
    "Otherwise, it may develop mold or mildew.",
    "Get a shelving unit if you have space for it.",
    "Not only can this add a decorative element to your bathroom, but it will also allow you to store other items, such as towels, toilet paper, and so forth.",
    "Make the shelf more decorative by adding a plant or a vessel filled with pretty soaps or bath bombs.",
    "If you have a small bathroom, consider adding a single, narrow shelf just above the bathroom vanity.",
    "Store your perfumes, cosmetics, and toothbrushes on it.",
    "If you have a small bathroom, consider getting a mini metal shelving unit that you can place on your bathroom counter or hang above the toilet.",
    "Another option for shelving is floating shelves, which are great if you don't have the space for a unit.",
    "You can hang your floating shelves over your toilet or, if there's no shower, above the bathtub.",
    "Use your shelves for extra towels, rolls of toilet paper, personal care items, or decorations.",
    "Brighten up a dull bathroom with colorful towels or a bathmat.",
    "One of the quickest ways to change the look of your bathroom is by swapping out the towels and bathmat for something new.",
    "Consider the season.",
    "Warm colors work well for fall, while cool colors work better for winter.",
    "Pastels are great for spring, and bright colors are ideal for summer.",
    "Play around with different shades and layering.",
    "For example, try a light green hand towel over a dark green bath towel.",
    "Bathmats don’t always have to be made from towel material.",
    "You can get wooden or bamboo ones too!",
    "Change out the shower curtain for something more exciting.",
    "If you have a plain white or frosted shower curtain, consider switching it out for a different one.",
    "Pick out a bright color that matches your towels.",
    "If solid colors aren't your thing, try a pattern instead.",
    "If you are going with a pattern, make sure that it matches the other colors in your bathroom.",
    "If you have a window in your bathroom, consider getting some mini curtains or blinds for it.",
    "Keep them open so that you have lots of daylight.",
    "If you have any curtains you aren't using, you can hang these over your plastic shower curtain to create a fancy look.",
    "Updating Fixtures and Lighting Take advantage of natural lighting if your bathroom has it.",
    "Some bathrooms have windows in them.",
    "These are great of bringing in natural daylight and giving your bathroom a fresher look.",
    "Clear the area in front of the window, wipe the window clean, and repaint the sill, if needed.",
    "Decorate your window with opened curtains or plants, but keep it minimal so that the light can pass through.",
    "On the other hand, if your bathroom has a grand, luxurious theme, hanging heavy curtains in front of the window may work better.",
    "Trade out the light bulbs for something new.",
    "If you have lights above your bathroom mirror, consider switching them out for different ones.",
    "This can be as simple as changing the old, bright bulbs for frosted ones.",
    "It can be as fancy as getting actual lights with fancy covers or fixtures around them.",
    "If your lights have fixtures or covers, make sure that they match the other metallic elements in your bathroom.",
    "If you like to do makeup in your bathroom, choose lights with a bright, white glow.",
    "Avoid lights that give you a hazy, golden glow; it’s not good lighting for makeup.",
    "If your bathroom is too dark, high-efficiency LED lights can give your bathroom a bright, white glow.",
    "Switch out the towel racks for something new.",
    "Make sure that the new towel racks match the other metal fixtures in your bathroom, however.",
    "For example, if you have gold faucets, you should get gold towel racks--not silver ones.",
    "Towel racks don’t always have to look like horizontal rods or bars.",
    "You can get ones shaped like hooks or loops instead.",
    "If you can't afford to replace your towel racks, you can paint them instead!",
    "Simply take them off the wall and bring them outside.",
    "Use a metal spray paint to coat them in a new color.",
    "You could choose something metallic or mix it up with a fun shade that matches your bathroom, like a blue.",
    "Change your mirror, or put a frame around it.",
    "If your mirror looks plain, see if you can find a fancier mirror.",
    "Oval mirrors or mirrors with beveled edges are a great option.",
    "If you can't change your mirror, consider framing it instead.",
    "You can use an actual frame, or you can use glass mosaic tiles instead.",
    "If you are framing the mirror, use colors that match the other colors in your bathroom.",
    "Change the fixtures in your bathroom for a more adventurous project.",
    "This can be difficult for someone who has not done it before, so if the task is too intimidating for you, hire a handyman.",
    "Make sure that the colors go well with the overall theme of your bathroom.",
    "For example, if your bathroom is ornate with lots of burgundy and gold, consider gold fixtures.",
    "If your bathroom has a modern or Zen theme, try matte silver fixtures instead.",
    "Adding Accessories and Storage Bring some character with candles or decorative items.",
    "Things like pillar candles, figurines, and vases all make great bathroom accents.",
    "Find some items that match the color and theme of your bathroom, then display them in an out-of-the-way area, such as a side table, a shelf, or the corner of the counter.",
    "If you are getting pillar candles, consider getting 3 candles that are the same color, but different heights and thicknesses.",
    "This will create some interesting variation.",
    "Make sure that the items you choose can withstand humid conditions.",
    "Avoid using breakable items, such as glass, if you have curious children or pets.",
    "Bring in some greenery with a plant or 2.",
    "Choose a plant that requires low levels of sunlight.",
    "Even if your bathroom has a window in it, it likely won't provide enough sunlight for your plant.",
    "Match the pots to your bathroom's tiles, towels, mat, or shower curtain.",
    "Every so often, move your plant into a bright window for a day or 2 so that it can absorb sunlight.",
    "Air plants are a great option for your bathroom!",
    "They'll thrive in the humid bathroom environment and require little care.",
    "Hang some fake, green floral garlands along the ceiling.",
    "Ivy is a classic choice, but you can also try ferns or wisteria.",
    "Store extra towels and toilet paper in baskets.",
    "Instead of keeping towels and toilet paper stacks on a shelf, put them into decorative storage baskets instead.",
    "Measure the depth of your shelf or cabinet first, then purchase some square or rectangular baskets that match those dimensions.",
    "You can also use wire or canvas baskets.",
    "Container stores, fabric stores, and craft stores generally have a vast selection.",
    "If you have space next to your sink or toilet, you can keep the baskets there as well.",
    "You are not just limited to towels and toilet paper; you can store other items that you want to keep out of sight too, such as hair styling tools.",
    "Keep cotton balls, Q-tips, and other toiletries in glass jars or vessels.",
    "Instead of leaving these items in the cabinet, transfer them into glass or clear acrylic containers, then keep the containers on your bathroom counter.",
    "Use 1 container for each type of item.",
    "For example, keep your cotton balls in a tall jar and your Q-tips in a squat container.",
    "Consider a vase or apothecary-style jar for extra bath bombs, mini lotion bottles, or hand soaps.",
    "Tiered cupcake stands and cake stands make cute displays for perfumes, nail polish, and other cosmetics.",
    "Old Mason jars are a great, low cost option for storing your items!",
    "If you don't like the look of them plain, add a ribbon or piece of fabric to make them match your decor.",
    "As another option, you could paint the jars, though you wouldn't be able to see into them anymore.",
    "Make use of soap dispensers and toothbrush holders.",
    "Instead of keeping your liquid hand soap in the plastic bottle it came in, pour it into a glass or ceramic soap dispenser.",
    "If you prefer to use solid soap, keep it in a little dish or tray instead.",
    "Keep your toothbrushes in a toothbrush holder.",
    "Make sure that it matches your soap dish or soap dispenser.",
    "If you like to use mouthwash, consider pouring it into a glass vessel or bottle instead.",
    "Have some paper cups nearby, so that you have something to pour the mouthwash into."
  ],
  "tyn_section":[
    "Towels",
    "Bathmat",
    "Shower curtain",
    "Storage baskets",
    "Jars and vases"
  ],
  "tyn_model":[
    "towels",
    "wallpaper",
    "candles",
    "mirror",
    "bench",
    "toilet paper",
    "towel racks",
    "interior designer",
    "paint",
    "lights",
    "contact paper",
    "fabric",
    "plant",
    "bathmat",
    "shower curtain",
    "curtains",
    "mirrors",
    "cotton balls",
    "soap",
    "soap dispenser",
    "interior architecture",
    "—like",
    "glass",
    "wall treatments",
    "wall treatment",
    "wall decals",
    "wall paper",
    "trees",
    "tiles",
    "bowls",
    "tray",
    "upholstered bench",
    "upholstered stool",
    "shelving unit",
    "bath bombs",
    "cosmetics",
    "pastels",
    "hand towel",
    "bath towel",
    "towel",
    "natural lighting",
    "plants",
    "light bulbs",
    "high-efficiency led lights",
    "spray paint",
    "vases",
    "greenery",
    "pots",
    "air plants",
    "ivy",
    "decorative storage baskets",
    "q-tips",
    "q-",
    "vase",
    "mason jars",
    "soap dispensers",
    "toothbrush holders",
    "toothbrush holder",
    "soap dish"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.0508474576,
    "f1":0.09375,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.0677966102,
    "f1":0.125
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.0847457627,
    "f1":0.15625
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8,
    "p":0.0677966102,
    "f1":0.125
  }
}