{
  "title":"How to Make Buttermilk Fried Chicken",
  "url":"https://www.wikihow.com/Make-Buttermilk-Fried-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken",
    "Fried Chicken"
  ],
  "parts":[
    {
      "name":"Marinating",
      "steps":[
        {
          "headline":"Mix the buttermilk with kosher salt, pepper, and cayenne.",
          "description":"Pour 3 cups (710 ml) of buttermilk into a large bowl or baking dish. Add 2 tablespoons (36 g) of the kosher salt, 1 tablespoon (7 g) of the freshly ground black pepper, and 2 teaspoons (3.5 g) of cayenne. Stir until the seasonings are incorporated with the buttermilk. It's important to use real buttermilk instead of soured milk for this recipe. True buttermilk is thicker and will help tenderize the chicken as it marinates."
        },
        {
          "headline":"Add 4 pounds (1.8 kg) of chicken to the marinade.",
          "description":"Get out 4 pounds (1.8 kg) of chicken pieces and add them to the bowl with the marinade. Stir so all of the chicken is completely coated with the buttermilk marinade. You can use wings, thighs, drumsticks, and breasts. If you want to use breasts, cut each of them in half to make 2 smaller pieces. This will ensure that they fry faster and more evenly."
        },
        {
          "headline":"Marinate the chicken for 2 to 4 hours.",
          "description":"Cover the chicken and leave it to marinate at room temperature. You can safely keep the chicken out for up to 2 hours. If you want it to marinate longer, put the chicken in the refrigerator for 4 hours. Avoid marinating the chicken for more than 4 hours since the buttermilk and salt will begin to break down the meat."
        }
      ]
    },
    {
      "name":"Dredging",
      "steps":[
        {
          "headline":"Combine the flour, salt, pepper, cayenne, onion, and garlic powder.",
          "description":"Put 2 cups (240 g) of all-purpose flour into a large sealable plastic bag. Add 1 teaspoon (2 g) of onion powder, 1 teaspoon (2 g) of garlic powder, the remaining 1 teaspoon (6 g) of kosher salt, the remaining 1 teaspoon (2 g) of freshly ground black pepper, and the remaining 1/2 teaspoon (1 g) of cayenne pepper. Seal and shake the bag. If you prefer, mix the flour and seasoning in a large shallow dish instead of a bag."
        },
        {
          "headline":"Set a rack on a sheet and remove the chicken from the marinade.",
          "description":"Place a wire rack on a baking sheet and set it next to your work surface. Then uncover the chicken and lift each piece out of the buttermilk marinade. Hold each piece up for a few seconds so the excess marinade drips back into the bowl."
        },
        {
          "headline":"Place the chicken into the bag with the seasonings and shake it.",
          "description":"Put all of the chicken pieces into the bag or work in batches if all of them won't fit. Seal the bag shut and shake it until the chicken is completely coated with the dry seasoning."
        },
        {
          "headline":"Rest the chicken on the rack for 30 minutes.",
          "description":"Open the bag and remove each piece of chicken. Shake it a little so extra seasoning falls off and then set the chicken pieces on the wire rack. Let the chicken sit at room temperature for 30 minutes. You can begin to heat the oil while the chicken is resting. If you want to dredge the chicken in advance, store it uncovered in the refrigerator for up to 2 hours."
        }
      ]
    },
    {
      "name":"Frying",
      "steps":[
        {
          "headline":"Pour oil halfway up the side of a deep pot and attach a thermometer.",
          "description":"Set a large pot on the stove and pour in enough oil to come halfway up the sides of the pot. Stick a deep-fry thermometer onto the side so the tip is in the oil. The amount of oil you need will depend on the size of your pot. You'll need enough oil in the pot so it will completely cover the chicken pieces. Consider using canola, vegetable, or peanut oil. Avoid using olive or grapeseed oil since these will burn."
        },
        {
          "headline":"Heat the oil over medium-high until it reaches 350 °F (177 °C).",
          "description":"Turn the burner on to medium-high and heat the uncovered oil. Watch the temperature and be prepared to start frying the chicken once the temperature of the oil reaches 350 °F (177 °C)."
        },
        {
          "headline":"Put half of the chicken into the oil and fry it for 10 to 14 minutes.",
          "description":"Carefully lower half of the seasoned chicken pieces to the hot oil. Use long tongs to turn the chicken frequently as it fries. Fry the chicken until it reaches 165 °F (74 °C) with an instant-read meat thermometer. You'll also need to keep an eye on the temperature of the oil. It should stay around 350 °F (177 °C)."
        },
        {
          "headline":"Put the fried chicken on a wire rack and bring the oil back to 350 °F (177 °C).",
          "description":"Set clean wire racks on another baking sheet. Use long tongs to remove the fried chicken from the oil and place the pieces on a rack. Look at the temperature of the oil and let it heat back up to 350 °F (177 °C) before you fry the rest of the chicken. If you try to fry the remaining chicken while the oil isn't hot enough, the chicken will absorb more of the oil. It will take longer to cook and won't be as crispy."
        },
        {
          "headline":"Fry the remaining chicken and let it rest for 10 minutes before serving.",
          "description":"Fry the other half of the chicken and put it on the wire rack. Let the chicken pieces rest for 10 minutes so they reabsorb their juices. Then sprinkle a little salt over them and serve them with your favorite sides. You can fry the chicken up to 2 hours in advance. Keep the fried chicken at room temperature for up to 2 hours. If you want to store the fried chicken for longer, put it in an airtight container and refrigerate it for up to 3 to 4 days."
        }
      ]
    }
  ],
  "text":" Marinating Mix the buttermilk with kosher salt, pepper, and cayenne. Pour 3 cups (710 ml) of buttermilk into a large bowl or baking dish. Add 2 tablespoons (36 g) of the kosher salt, 1 tablespoon (7 g) of the freshly ground black pepper, and 2 teaspoons (3.5 g) of cayenne. Stir until the seasonings are incorporated with the buttermilk. It's important to use real buttermilk instead of soured milk for this recipe. True buttermilk is thicker and will help tenderize the chicken as it marinates. Add 4 pounds (1.8 kg) of chicken to the marinade. Get out 4 pounds (1.8 kg) of chicken pieces and add them to the bowl with the marinade. Stir so all of the chicken is completely coated with the buttermilk marinade. You can use wings, thighs, drumsticks, and breasts. If you want to use breasts, cut each of them in half to make 2 smaller pieces. This will ensure that they fry faster and more evenly. Marinate the chicken for 2 to 4 hours. Cover the chicken and leave it to marinate at room temperature. You can safely keep the chicken out for up to 2 hours. If you want it to marinate longer, put the chicken in the refrigerator for 4 hours. Avoid marinating the chicken for more than 4 hours since the buttermilk and salt will begin to break down the meat. Dredging Combine the flour, salt, pepper, cayenne, onion, and garlic powder. Put 2 cups (240 g) of all-purpose flour into a large sealable plastic bag. Add 1 teaspoon (2 g) of onion powder, 1 teaspoon (2 g) of garlic powder, the remaining 1 teaspoon (6 g) of kosher salt, the remaining 1 teaspoon (2 g) of freshly ground black pepper, and the remaining 1/2 teaspoon (1 g) of cayenne pepper. Seal and shake the bag. If you prefer, mix the flour and seasoning in a large shallow dish instead of a bag. Set a rack on a sheet and remove the chicken from the marinade. Place a wire rack on a baking sheet and set it next to your work surface. Then uncover the chicken and lift each piece out of the buttermilk marinade. Hold each piece up for a few seconds so the excess marinade drips back into the bowl. Place the chicken into the bag with the seasonings and shake it. Put all of the chicken pieces into the bag or work in batches if all of them won't fit. Seal the bag shut and shake it until the chicken is completely coated with the dry seasoning. Rest the chicken on the rack for 30 minutes. Open the bag and remove each piece of chicken. Shake it a little so extra seasoning falls off and then set the chicken pieces on the wire rack. Let the chicken sit at room temperature for 30 minutes. You can begin to heat the oil while the chicken is resting. If you want to dredge the chicken in advance, store it uncovered in the refrigerator for up to 2 hours. Frying Pour oil halfway up the side of a deep pot and attach a thermometer. Set a large pot on the stove and pour in enough oil to come halfway up the sides of the pot. Stick a deep-fry thermometer onto the side so the tip is in the oil. The amount of oil you need will depend on the size of your pot. You'll need enough oil in the pot so it will completely cover the chicken pieces. Consider using canola, vegetable, or peanut oil. Avoid using olive or grapeseed oil since these will burn. Heat the oil over medium-high until it reaches 350 °F (177 °C). Turn the burner on to medium-high and heat the uncovered oil. Watch the temperature and be prepared to start frying the chicken once the temperature of the oil reaches 350 °F (177 °C). Put half of the chicken into the oil and fry it for 10 to 14 minutes. Carefully lower half of the seasoned chicken pieces to the hot oil. Use long tongs to turn the chicken frequently as it fries. Fry the chicken until it reaches 165 °F (74 °C) with an instant-read meat thermometer. You'll also need to keep an eye on the temperature of the oil. It should stay around 350 °F (177 °C). Put the fried chicken on a wire rack and bring the oil back to 350 °F (177 °C). Set clean wire racks on another baking sheet. Use long tongs to remove the fried chicken from the oil and place the pieces on a rack. Look at the temperature of the oil and let it heat back up to 350 °F (177 °C) before you fry the rest of the chicken. If you try to fry the remaining chicken while the oil isn't hot enough, the chicken will absorb more of the oil. It will take longer to cook and won't be as crispy. Fry the remaining chicken and let it rest for 10 minutes before serving. Fry the other half of the chicken and put it on the wire rack. Let the chicken pieces rest for 10 minutes so they reabsorb their juices. Then sprinkle a little salt over them and serve them with your favorite sides. You can fry the chicken up to 2 hours in advance. Keep the fried chicken at room temperature for up to 2 hours. If you want to store the fried chicken for longer, put it in an airtight container and refrigerate it for up to 3 to 4 days.",
  "sentences":[
    " Marinating Mix the buttermilk with kosher salt, pepper, and cayenne.",
    "Pour 3 cups (710 ml) of buttermilk into a large bowl or baking dish.",
    "Add 2 tablespoons (36 g) of the kosher salt, 1 tablespoon (7 g) of the freshly ground black pepper, and 2 teaspoons (3.5 g) of cayenne.",
    "Stir until the seasonings are incorporated with the buttermilk.",
    "It's important to use real buttermilk instead of soured milk for this recipe.",
    "True buttermilk is thicker and will help tenderize the chicken as it marinates.",
    "Add 4 pounds (1.8 kg) of chicken to the marinade.",
    "Get out 4 pounds (1.8 kg) of chicken pieces and add them to the bowl with the marinade.",
    "Stir so all of the chicken is completely coated with the buttermilk marinade.",
    "You can use wings, thighs, drumsticks, and breasts.",
    "If you want to use breasts, cut each of them in half to make 2 smaller pieces.",
    "This will ensure that they fry faster and more evenly.",
    "Marinate the chicken for 2 to 4 hours.",
    "Cover the chicken and leave it to marinate at room temperature.",
    "You can safely keep the chicken out for up to 2 hours.",
    "If you want it to marinate longer, put the chicken in the refrigerator for 4 hours.",
    "Avoid marinating the chicken for more than 4 hours since the buttermilk and salt will begin to break down the meat.",
    "Dredging Combine the flour, salt, pepper, cayenne, onion, and garlic powder.",
    "Put 2 cups (240 g) of all-purpose flour into a large sealable plastic bag.",
    "Add 1 teaspoon (2 g) of onion powder, 1 teaspoon (2 g) of garlic powder, the remaining 1 teaspoon (6 g) of kosher salt, the remaining 1 teaspoon (2 g) of freshly ground black pepper, and the remaining 1/2 teaspoon (1 g) of cayenne pepper.",
    "Seal and shake the bag.",
    "If you prefer, mix the flour and seasoning in a large shallow dish instead of a bag.",
    "Set a rack on a sheet and remove the chicken from the marinade.",
    "Place a wire rack on a baking sheet and set it next to your work surface.",
    "Then uncover the chicken and lift each piece out of the buttermilk marinade.",
    "Hold each piece up for a few seconds so the excess marinade drips back into the bowl.",
    "Place the chicken into the bag with the seasonings and shake it.",
    "Put all of the chicken pieces into the bag or work in batches if all of them won't fit.",
    "Seal the bag shut and shake it until the chicken is completely coated with the dry seasoning.",
    "Rest the chicken on the rack for 30 minutes.",
    "Open the bag and remove each piece of chicken.",
    "Shake it a little so extra seasoning falls off and then set the chicken pieces on the wire rack.",
    "Let the chicken sit at room temperature for 30 minutes.",
    "You can begin to heat the oil while the chicken is resting.",
    "If you want to dredge the chicken in advance, store it uncovered in the refrigerator for up to 2 hours.",
    "Frying Pour oil halfway up the side of a deep pot and attach a thermometer.",
    "Set a large pot on the stove and pour in enough oil to come halfway up the sides of the pot.",
    "Stick a deep-fry thermometer onto the side so the tip is in the oil.",
    "The amount of oil you need will depend on the size of your pot.",
    "You'll need enough oil in the pot so it will completely cover the chicken pieces.",
    "Consider using canola, vegetable, or peanut oil.",
    "Avoid using olive or grapeseed oil since these will burn.",
    "Heat the oil over medium-high until it reaches 350 °F (177 °C).",
    "Turn the burner on to medium-high and heat the uncovered oil.",
    "Watch the temperature and be prepared to start frying the chicken once the temperature of the oil reaches 350 °F (177 °C).",
    "Put half of the chicken into the oil and fry it for 10 to 14 minutes.",
    "Carefully lower half of the seasoned chicken pieces to the hot oil.",
    "Use long tongs to turn the chicken frequently as it fries.",
    "Fry the chicken until it reaches 165 °F (74 °C) with an instant-read meat thermometer.",
    "You'll also need to keep an eye on the temperature of the oil.",
    "It should stay around 350 °F (177 °C).",
    "Put the fried chicken on a wire rack and bring the oil back to 350 °F (177 °C).",
    "Set clean wire racks on another baking sheet.",
    "Use long tongs to remove the fried chicken from the oil and place the pieces on a rack.",
    "Look at the temperature of the oil and let it heat back up to 350 °F (177 °C) before you fry the rest of the chicken.",
    "If you try to fry the remaining chicken while the oil isn't hot enough, the chicken will absorb more of the oil.",
    "It will take longer to cook and won't be as crispy.",
    "Fry the remaining chicken and let it rest for 10 minutes before serving.",
    "Fry the other half of the chicken and put it on the wire rack.",
    "Let the chicken pieces rest for 10 minutes so they reabsorb their juices.",
    "Then sprinkle a little salt over them and serve them with your favorite sides.",
    "You can fry the chicken up to 2 hours in advance.",
    "Keep the fried chicken at room temperature for up to 2 hours.",
    "If you want to store the fried chicken for longer, put it in an airtight container and refrigerate it for up to 3 to 4 days."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Deep-fry thermometer",
    "Large bowl or baking dish",
    "Sealable plastic bag",
    "Wire racks",
    "Baking sheets",
    "Large pot",
    "Long tongs",
    "Instant-read meat thermometer",
    "Knife and cutting board, optional"
  ],
  "tyn_model":[
    "chicken",
    "oil",
    "buttermilk",
    "wire rack",
    "kosher salt",
    "cayenne",
    "salt",
    "pepper",
    "freshly ground black pepper",
    "bowl",
    "buttermilk marinade",
    "refrigerator",
    "flour",
    "garlic powder",
    "baking sheet",
    "large bowl",
    "baking dish",
    "milk",
    "drumsticks",
    "onion",
    "all-purpose flour",
    "large sealable plastic bag",
    "onion powder",
    "cayenne pepper",
    "seasonings",
    "thermometer",
    "large pot",
    "stove",
    "deep-fry thermometer",
    "pot",
    "canola,",
    "vegetable,",
    "grapeseed oil",
    "burner",
    "instant-read meat thermometer",
    "wire racks",
    "airtight container"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1081081081,
    "f1":0.170212766,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1891891892,
    "f1":0.2745098039
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7,
    "p":0.2972972973,
    "f1":0.4173441734
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1351351351,
    "f1":0.2127659574
  }
}