{
  "title":"How to Make an Origami Mouse",
  "url":"https://www.wikihow.com/Make-an-Origami-Mouse",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Making the Mouse’s Body",
      "steps":[
        {
          "headline":"Get a square piece of paper to make your origami mouse with.",
          "description":"Any kind of thin paper will work, although paper designed specifically for origami may be easier to work with. If you don’t have square paper, use scissors to cut regular paper into a square. You can use any color of paper to make your origami mouse with. If you want a realistic-looking mouse, go with a brown, black, or white piece of paper. If you want something that’s more whimsical and fun, try brightly-colored paper or paper with a pattern on it."
        },
        {
          "headline":"Fold the paper in half diagonally both ways and then unfold.",
          "description":"Crease the paper with your fingers after each fold. When you’re finished, you should have 2 long creases that intersect in the middle of the paper. Orient the paper so it looks like a diamond after you make your 2 folds."
        },
        {
          "headline":"Fold the bottom left and right edges up to the vertical crease and unfold.",
          "description":"Try to make the edges line up with the crease as much as possible so there’s no gap between them. Also, be careful not to overlap the edges at the crease or you may have some problems folding your origami mouse later on. Don’t forget to crease and unfold the edges after you fold them."
        },
        {
          "headline":"Repeat with the top left and right edges of the paper but don’t unfold.",
          "description":"Just like you did with the bottom edges, fold the top left and right edges to the vertical crease. This time, however, don’t unfold the edges. Crease along the folds with your fingers and then leave the edges folded down. When you’re finished, the paper should be folded in a kite shape."
        },
        {
          "headline":"Lift the flaps and fold the corners over to the vertical crease.",
          "description":"After you lift up the flaps that you made with your previous fold, take the left and right corners of the paper and push them toward the center crease. Then, flatten along the existing creases so you have 2 new, smaller flaps sticking up on the model. Push the new, smaller flaps down so they’re lying flat. The new flaps should naturally form along the existing creases that you made with your previous folds."
        },
        {
          "headline":"Fold one of the flaps down and fold the bottom edge up to the top edge.",
          "description":"Start by folding one of the small flaps down toward the bottom of the model and creasing along the horizontal fold. Then, bring the bottom, diagonal edge up to the horizontal crease you just made. Finally, crease along the new fold. When you’re finished, bring the folded flap up and behind the other flap so it’s not in your way."
        },
        {
          "headline":"Repeat with the other flap.",
          "description":"Fold the flap down and crease along the horizontal line. Then, bring the bottom edge up to the horizontal fold you just made and crease the new fold. Bring the folded flap up so it’s next to the other folded flap."
        },
        {
          "headline":"Flip the model over and fold the bottom point up above the horizontal crease.",
          "description":"This fold doesn’t need to be precise—it doesn’t matter how far above the horizontal crease you fold the bottom point, as long as it’s above it. However, try to position the point so it’s about halfway between the top point on the model and the horizontal crease. Remember to crease along the fold with your fingers."
        },
        {
          "headline":"Fold up both bottom corners.",
          "description":"You want to fold the corners up toward the horizontal crease, but not all the way. Instead, stop when the folds make a straight, diagonal line between the ends of the horizontal crease and the bottom, middle point of the model."
        }
      ]
    },
    {
      "name":"Folding the Ears",
      "steps":[
        {
          "headline":"Turn the model over and mountain fold it in half lengthwise.",
          "description":"A mountain fold is a fold that’s done away from yourself so that the crease looks like the peak of a mountain (as opposed to a valley fold, which would be done toward yourself and look like a valley). The model should easily fold in half lengthwise along the vertical crease you made earlier. After you mountain fold the model in half lengthwise, lay it flat so you’re only looking at one side. At this point, you should be able to see the beginning of your mouse’s ears and nose."
        },
        {
          "headline":"Fold the flap over and then bring the corner back to make an ear.",
          "description":"First, fold the flap over so that it’s lying flat on the shorter half of the model (the half that will eventually become your mouse’s face and nose). Then, take the corner and fold it down and back so the edge is perpendicular with the top, horizontal edge of the model. Crease the fold so the ear stays in place."
        },
        {
          "headline":"Flip the model over and repeat with the other flap.",
          "description":"Make sure the flap is lying flat on the shorter half of the model. Then, fold it down and back and crease along the fold. Now your mouse should have 2 ears!"
        },
        {
          "headline":"Insert a finger into the ear flaps to make them round and 3-dimensional.",
          "description":"The edge of each ear should have an opening that you can easily stick a finger into. Once your finger is inside, use another finger to press on the outer crease to round it out and give the ears some shape. Don’t worry about making the ears perfect. You can always go back in later and round them out some more."
        }
      ]
    },
    {
      "name":"Making the Tail",
      "steps":[
        {
          "headline":"Fold the long half of the model in on itself to start the tail.",
          "description":"First, use your fingers to press down on the top, horizontal edge of the model so the long half of the model is flat. Then, continue pressing the edge of the model down while pressing the sides of the model inward. Keep pressing until you’ve folded the long half in on itself and the end is pointing downward. Crease the diagonal fold along the top edge of the model."
        },
        {
          "headline":"Bring the end of the tail up and push it inside of the fold you just made.",
          "description":"Flatten the end of the tail and push it upward with your fingers so it goes inside of the diagonal fold. Once the end of the tail is pointing upward, crease the diagonal fold again to secure the tail inside of it. The angle of the tail doesn’t need to be precise. The tail just needs to be pointing up and be tucked inside of the diagonal fold."
        },
        {
          "headline":"Open the tail up and fold the corners in to make it thinner.",
          "description":"Once the tail is open, take each corner and fold it toward the center crease inside of the tail. This fold doesn’t need to be precise, but the closer you fold the corners to the center crease, the thinner your mouse’s tail will be. After you fold the corners inside of the tail, crease the folds and then close the tail. Once you're done folding the tail, your origami mouse is finished!"
        }
      ]
    }
  ],
  "text":" Making the Mouse’s Body Get a square piece of paper to make your origami mouse with. Any kind of thin paper will work, although paper designed specifically for origami may be easier to work with. If you don’t have square paper, use scissors to cut regular paper into a square. You can use any color of paper to make your origami mouse with. If you want a realistic-looking mouse, go with a brown, black, or white piece of paper. If you want something that’s more whimsical and fun, try brightly-colored paper or paper with a pattern on it. Fold the paper in half diagonally both ways and then unfold. Crease the paper with your fingers after each fold. When you’re finished, you should have 2 long creases that intersect in the middle of the paper. Orient the paper so it looks like a diamond after you make your 2 folds. Fold the bottom left and right edges up to the vertical crease and unfold. Try to make the edges line up with the crease as much as possible so there’s no gap between them. Also, be careful not to overlap the edges at the crease or you may have some problems folding your origami mouse later on. Don’t forget to crease and unfold the edges after you fold them. Repeat with the top left and right edges of the paper but don’t unfold. Just like you did with the bottom edges, fold the top left and right edges to the vertical crease. This time, however, don’t unfold the edges. Crease along the folds with your fingers and then leave the edges folded down. When you’re finished, the paper should be folded in a kite shape. Lift the flaps and fold the corners over to the vertical crease. After you lift up the flaps that you made with your previous fold, take the left and right corners of the paper and push them toward the center crease. Then, flatten along the existing creases so you have 2 new, smaller flaps sticking up on the model. Push the new, smaller flaps down so they’re lying flat. The new flaps should naturally form along the existing creases that you made with your previous folds. Fold one of the flaps down and fold the bottom edge up to the top edge. Start by folding one of the small flaps down toward the bottom of the model and creasing along the horizontal fold. Then, bring the bottom, diagonal edge up to the horizontal crease you just made. Finally, crease along the new fold. When you’re finished, bring the folded flap up and behind the other flap so it’s not in your way. Repeat with the other flap. Fold the flap down and crease along the horizontal line. Then, bring the bottom edge up to the horizontal fold you just made and crease the new fold. Bring the folded flap up so it’s next to the other folded flap. Flip the model over and fold the bottom point up above the horizontal crease. This fold doesn’t need to be precise—it doesn’t matter how far above the horizontal crease you fold the bottom point, as long as it’s above it. However, try to position the point so it’s about halfway between the top point on the model and the horizontal crease. Remember to crease along the fold with your fingers. Fold up both bottom corners. You want to fold the corners up toward the horizontal crease, but not all the way. Instead, stop when the folds make a straight, diagonal line between the ends of the horizontal crease and the bottom, middle point of the model. Folding the Ears Turn the model over and mountain fold it in half lengthwise. A mountain fold is a fold that’s done away from yourself so that the crease looks like the peak of a mountain (as opposed to a valley fold, which would be done toward yourself and look like a valley). The model should easily fold in half lengthwise along the vertical crease you made earlier. After you mountain fold the model in half lengthwise, lay it flat so you’re only looking at one side. At this point, you should be able to see the beginning of your mouse’s ears and nose. Fold the flap over and then bring the corner back to make an ear. First, fold the flap over so that it’s lying flat on the shorter half of the model (the half that will eventually become your mouse’s face and nose). Then, take the corner and fold it down and back so the edge is perpendicular with the top, horizontal edge of the model. Crease the fold so the ear stays in place. Flip the model over and repeat with the other flap. Make sure the flap is lying flat on the shorter half of the model. Then, fold it down and back and crease along the fold. Now your mouse should have 2 ears! Insert a finger into the ear flaps to make them round and 3-dimensional. The edge of each ear should have an opening that you can easily stick a finger into. Once your finger is inside, use another finger to press on the outer crease to round it out and give the ears some shape. Don’t worry about making the ears perfect. You can always go back in later and round them out some more. Making the Tail Fold the long half of the model in on itself to start the tail. First, use your fingers to press down on the top, horizontal edge of the model so the long half of the model is flat. Then, continue pressing the edge of the model down while pressing the sides of the model inward. Keep pressing until you’ve folded the long half in on itself and the end is pointing downward. Crease the diagonal fold along the top edge of the model. Bring the end of the tail up and push it inside of the fold you just made. Flatten the end of the tail and push it upward with your fingers so it goes inside of the diagonal fold. Once the end of the tail is pointing upward, crease the diagonal fold again to secure the tail inside of it. The angle of the tail doesn’t need to be precise. The tail just needs to be pointing up and be tucked inside of the diagonal fold. Open the tail up and fold the corners in to make it thinner. Once the tail is open, take each corner and fold it toward the center crease inside of the tail. This fold doesn’t need to be precise, but the closer you fold the corners to the center crease, the thinner your mouse’s tail will be. After you fold the corners inside of the tail, crease the folds and then close the tail. Once you're done folding the tail, your origami mouse is finished!",
  "sentences":[
    " Making the Mouse’s Body Get a square piece of paper to make your origami mouse with.",
    "Any kind of thin paper will work, although paper designed specifically for origami may be easier to work with.",
    "If you don’t have square paper, use scissors to cut regular paper into a square.",
    "You can use any color of paper to make your origami mouse with.",
    "If you want a realistic-looking mouse, go with a brown, black, or white piece of paper.",
    "If you want something that’s more whimsical and fun, try brightly-colored paper or paper with a pattern on it.",
    "Fold the paper in half diagonally both ways and then unfold.",
    "Crease the paper with your fingers after each fold.",
    "When you’re finished, you should have 2 long creases that intersect in the middle of the paper.",
    "Orient the paper so it looks like a diamond after you make your 2 folds.",
    "Fold the bottom left and right edges up to the vertical crease and unfold.",
    "Try to make the edges line up with the crease as much as possible so there’s no gap between them.",
    "Also, be careful not to overlap the edges at the crease or you may have some problems folding your origami mouse later on.",
    "Don’t forget to crease and unfold the edges after you fold them.",
    "Repeat with the top left and right edges of the paper but don’t unfold.",
    "Just like you did with the bottom edges, fold the top left and right edges to the vertical crease.",
    "This time, however, don’t unfold the edges.",
    "Crease along the folds with your fingers and then leave the edges folded down.",
    "When you’re finished, the paper should be folded in a kite shape.",
    "Lift the flaps and fold the corners over to the vertical crease.",
    "After you lift up the flaps that you made with your previous fold, take the left and right corners of the paper and push them toward the center crease.",
    "Then, flatten along the existing creases so you have 2 new, smaller flaps sticking up on the model.",
    "Push the new, smaller flaps down so they’re lying flat.",
    "The new flaps should naturally form along the existing creases that you made with your previous folds.",
    "Fold one of the flaps down and fold the bottom edge up to the top edge.",
    "Start by folding one of the small flaps down toward the bottom of the model and creasing along the horizontal fold.",
    "Then, bring the bottom, diagonal edge up to the horizontal crease you just made.",
    "Finally, crease along the new fold.",
    "When you’re finished, bring the folded flap up and behind the other flap so it’s not in your way.",
    "Repeat with the other flap.",
    "Fold the flap down and crease along the horizontal line.",
    "Then, bring the bottom edge up to the horizontal fold you just made and crease the new fold.",
    "Bring the folded flap up so it’s next to the other folded flap.",
    "Flip the model over and fold the bottom point up above the horizontal crease.",
    "This fold doesn’t need to be precise—it doesn’t matter how far above the horizontal crease you fold the bottom point, as long as it’s above it.",
    "However, try to position the point so it’s about halfway between the top point on the model and the horizontal crease.",
    "Remember to crease along the fold with your fingers.",
    "Fold up both bottom corners.",
    "You want to fold the corners up toward the horizontal crease, but not all the way.",
    "Instead, stop when the folds make a straight, diagonal line between the ends of the horizontal crease and the bottom, middle point of the model.",
    "Folding the Ears Turn the model over and mountain fold it in half lengthwise.",
    "A mountain fold is a fold that’s done away from yourself so that the crease looks like the peak of a mountain (as opposed to a valley fold, which would be done toward yourself and look like a valley).",
    "The model should easily fold in half lengthwise along the vertical crease you made earlier.",
    "After you mountain fold the model in half lengthwise, lay it flat so you’re only looking at one side.",
    "At this point, you should be able to see the beginning of your mouse’s ears and nose.",
    "Fold the flap over and then bring the corner back to make an ear.",
    "First, fold the flap over so that it’s lying flat on the shorter half of the model (the half that will eventually become your mouse’s face and nose).",
    "Then, take the corner and fold it down and back so the edge is perpendicular with the top, horizontal edge of the model.",
    "Crease the fold so the ear stays in place.",
    "Flip the model over and repeat with the other flap.",
    "Make sure the flap is lying flat on the shorter half of the model.",
    "Then, fold it down and back and crease along the fold.",
    "Now your mouse should have 2 ears!",
    "Insert a finger into the ear flaps to make them round and 3-dimensional.",
    "The edge of each ear should have an opening that you can easily stick a finger into.",
    "Once your finger is inside, use another finger to press on the outer crease to round it out and give the ears some shape.",
    "Don’t worry about making the ears perfect.",
    "You can always go back in later and round them out some more.",
    "Making the Tail Fold the long half of the model in on itself to start the tail.",
    "First, use your fingers to press down on the top, horizontal edge of the model so the long half of the model is flat.",
    "Then, continue pressing the edge of the model down while pressing the sides of the model inward.",
    "Keep pressing until you’ve folded the long half in on itself and the end is pointing downward.",
    "Crease the diagonal fold along the top edge of the model.",
    "Bring the end of the tail up and push it inside of the fold you just made.",
    "Flatten the end of the tail and push it upward with your fingers so it goes inside of the diagonal fold.",
    "Once the end of the tail is pointing upward, crease the diagonal fold again to secure the tail inside of it.",
    "The angle of the tail doesn’t need to be precise.",
    "The tail just needs to be pointing up and be tucked inside of the diagonal fold.",
    "Open the tail up and fold the corners in to make it thinner.",
    "Once the tail is open, take each corner and fold it toward the center crease inside of the tail.",
    "This fold doesn’t need to be precise, but the closer you fold the corners to the center crease, the thinner your mouse’s tail will be.",
    "After you fold the corners inside of the tail, crease the folds and then close the tail.",
    "Once you're done folding the tail, your origami mouse is finished!"
  ],
  "tyn_section":[
    "Square piece of paper",
    "Pen or pencil (optional)"
  ],
  "tyn_model":[
    "paper",
    "origami mouse",
    "mouse",
    "scissors",
    "model",
    "—it"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}