{
  "title":"How to Make Béchamel Sauce",
  "url":"https://www.wikihow.com/Make-B%C3%A9chamel-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Sauces"
  ],
  "steps":[
    {
      "headline":"This is the basic recipe for Béchamel sauce.",
      "description":"This sauce can be flavored in a number of other ways if desired."
    },
    {
      "headline":"Place 2 tablespoons of butter in a small saucepan.",
      "description":""
    },
    {
      "headline":"Heat the butter over medium heat until it's melted.",
      "description":""
    },
    {
      "headline":"Mix in 2 tablespoons of flour to make a roux, or the beginning stage of the sauce.",
      "description":"Always keep the ratio of butter to flour equal, regardless of whether you are producing a thinner or thicker sauce."
    },
    {
      "headline":"Cook the roux gently, stirring well until it pales and takes on the color of straw.",
      "description":""
    },
    {
      "headline":"Lower the heat and slowly incorporate 2 or 3 tablespoons of milk.",
      "description":""
    },
    {
      "headline":"Mix the milk in well, stirring until it is completely incorporated into the roux.",
      "description":""
    },
    {
      "headline":"Mix in an additional 2 to 3 tablespoons of milk and stir them in until they're completely incorporated.",
      "description":""
    },
    {
      "headline":"Continue adding milk, 2 or 3 tablespoons at a time, until 1 cup of milk is completed incorporated.",
      "description":"Do this slowly; only add as much milk as will be easily incorporated into the sauce. Adding the milk too quickly may make the sauce lumpy."
    },
    {
      "headline":"Remove the sauce from the heat and add salt and pepper if desired.",
      "description":""
    }
  ],
  "text":" This is the basic recipe for Béchamel sauce. This sauce can be flavored in a number of other ways if desired. Place 2 tablespoons of butter in a small saucepan.  Heat the butter over medium heat until it's melted.  Mix in 2 tablespoons of flour to make a roux, or the beginning stage of the sauce. Always keep the ratio of butter to flour equal, regardless of whether you are producing a thinner or thicker sauce. Cook the roux gently, stirring well until it pales and takes on the color of straw.  Lower the heat and slowly incorporate 2 or 3 tablespoons of milk.  Mix the milk in well, stirring until it is completely incorporated into the roux.  Mix in an additional 2 to 3 tablespoons of milk and stir them in until they're completely incorporated.  Continue adding milk, 2 or 3 tablespoons at a time, until 1 cup of milk is completed incorporated. Do this slowly; only add as much milk as will be easily incorporated into the sauce. Adding the milk too quickly may make the sauce lumpy. Remove the sauce from the heat and add salt and pepper if desired. ",
  "sentences":[
    " This is the basic recipe for Béchamel sauce.",
    "This sauce can be flavored in a number of other ways if desired.",
    "Place 2 tablespoons of butter in a small saucepan.",
    "Heat the butter over medium heat until it's melted.",
    "Mix in 2 tablespoons of flour to make a roux, or the beginning stage of the sauce.",
    "Always keep the ratio of butter to flour equal, regardless of whether you are producing a thinner or thicker sauce.",
    "Cook the roux gently, stirring well until it pales and takes on the color of straw.",
    "Lower the heat and slowly incorporate 2 or 3 tablespoons of milk.",
    "Mix the milk in well, stirring until it is completely incorporated into the roux.",
    "Mix in an additional 2 to 3 tablespoons of milk and stir them in until they're completely incorporated.",
    "Continue adding milk, 2 or 3 tablespoons at a time, until 1 cup of milk is completed incorporated.",
    "Do this slowly; only add as much milk as will be easily incorporated into the sauce.",
    "Adding the milk too quickly may make the sauce lumpy.",
    "Remove the sauce from the heat and add salt and pepper if desired."
  ],
  "tyn_section":[
    "Saucepan",
    "Tablespoon"
  ],
  "tyn_model":[
    "milk",
    "butter",
    "flour",
    "béchamel sauce",
    "small saucepan",
    "salt",
    "pepper"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1428571429,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.1428571429,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}