{
  "title":"How to Make a Smoothie Without Milk or Ice",
  "url":"https://www.wikihow.com/Make-a-Smoothie-Without-Milk-or-Ice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Smoothies"
  ],
  "methods":[
    {
      "name":"Making Dairy-free Smoothies",
      "steps":[
        {
          "headline":"Make a soy milk banana-blueberry smoothie.",
          "description":"Combine 1¼ cups (300 milliliters) light soy milk, ½ cup (50 grams) frozen blueberries, one half of a sliced frozen banana, 2 teaspoons sugar, and 1 teaspoon vanilla extract in a blender. Blend until smooth—about 20 to 30 seconds. Makes 2 servings."
        },
        {
          "headline":"Make a soy milk breakfast smoothie.",
          "description":"Combine 1 cup (240 milliliters) vanilla soy milk, ½ cup (50 grams) frozen blueberries, ½ cup (115 grams) cornflakes cereal, and 1 sliced frozen banana in a blender. Blend for 20 seconds, scrape down the sides of the blender with a spatula, then blend for 15 more seconds. Makes 1 serving."
        },
        {
          "headline":"Make an almond milk summer smoothie.",
          "description":"Combine ½ cup (120 milliliters) pomegranate juice, ¾ cup (180 milliliters) orange juice, ¾ cup (180 milliliters) almond milk, 1¼ cups (155 grams) frozen raspberries, and 1 sliced frozen banana in a blender. Blend until smooth. Be sure to scrape down the sides of the blender with a spatula from time to time. Makes 2 servings. You can also freeze this as popsicles."
        },
        {
          "headline":"Make a nut milk banana-bread smoothie.",
          "description":"Combine 1 cup (240 milliliters) cashew milk, 2 sliced frozen bananas, 2 tablespoons almond butter, and a dash of ground nutmeg in a blender. Blend on high until smooth and serve. Makes enough for 2 servings. You can also use another type of milk instead of cashew milk, such as almond or soy."
        },
        {
          "headline":"Make a coconut milk strawberry-banana smoothie.",
          "description":"Combine 1 cup (240 milliliters) coconut milk, 1 sliced frozen banana, 2 cups (400 grams) frozen strawberries, and 1 teaspoon vanilla extract in a blender. Blend until smooth and serve. Makes 2 servings. You can use non-frozen strawberries and bananas, but the smoothie may not be as thick or cold."
        },
        {
          "headline":"Make a juice-based strawberry-kiwi smoothie.",
          "description":"Combine 1¼ cups (300 milliliters) cold apple juice, 1 sliced banana, 1 peeled and sliced kiwi fruit, 5 frozen strawberries, and 1 ½ teaspoon honey in a blender. Blend until everything is smooth, and serve. Makes enough for 4 servings."
        }
      ]
    },
    {
      "name":"Making Yogurt Smoothies",
      "steps":[
        {
          "headline":"Make a banana smoothie.",
          "description":"Combine ¾ cup (190 grams) vanilla yogurt, 1 sliced banana, and 1 tablespoon honey in a blender. Blend until smooth and frothy. This makes enough to serve two people. Makes 2 servings\nFor added digestion benefits and flavor, add ½ teaspoon of freshly grated ginger."
        },
        {
          "headline":"Make a strawberry-banana smoothie.",
          "description":"Combine ½ cup (120 milliliters) orange juice, 1 cup (250 grams) plain, nonfat yogurt, 1 sliced banana, and 6 frozen strawberries in a blender. Blend for 20 seconds. Scrape down the sides of your blender with a spatula, and blend for 15 more seconds. Makes 1 serving. You can use regular, non-frozen strawberries, but the smoothie may not be as thick or cold. For a sweeter smoothie, use low-fat vanilla yogurt instead of the plain one."
        },
        {
          "headline":"Make a banana-peach smoothie.",
          "description":"Combine ¾ cup (190 grams) vanilla yogurt, 1 peeled and sliced peach, and 2 sliced bananas in a blender. Blend until smooth, then serve. Makes 2 servings. For a thicker smoothie, use frozen bananas. For a thicker smoothie, use Green vanilla yogurt. For additional flavor, add a dash of nutmeg."
        },
        {
          "headline":"Make a strawberry smoothie.",
          "description":"Combine ½ cup (120 milliliters) orange juice, ½ cup (125 grams) low-fat yogurt, and 1 cup (200 grams) frozen strawberries in a blender. Pulse for 30 seconds, then blend for 30 more seconds (or until smooth). Makes 1 serving. Try using other types of berries instead, such as blueberries, blackberries, or raspberries. You can use any flavor of low-fat yogurt you want, but plain might taste the best. You can also use another type of juice, such as mango."
        },
        {
          "headline":"Make a tutti-frutti smoothie.",
          "description":"Place ½ cup of each of the following in a blender: orange juice (120 milliliters), plain yogurt (125 grams), frozen strawberries (100 grams), canned crushed pineapple (115 grams), and sliced banana (115 grams). Blend everything until smooth—about 2 minutes. Makes enough for 2 servings."
        },
        {
          "headline":"Make a fizzy tropical smoothie.",
          "description":"Combine 1 cup (240 milliliters) cold apricot nectar, 1 cup (250 grams) low-fat peach yogurt, 1 banana, and 1 tablespoon frozen lemonade concentrate in a blender. Blend for 30 seconds. Stir in ½ cup (120 milliliters) club soda before serving. Makes 4 servings. If you can't find club soda, search for carbonated water instead."
        }
      ]
    },
    {
      "name":"Finding and Using Substitutions",
      "steps":[
        {
          "headline":"Know that you can work with an existing recipe.",
          "description":"You might have a recipe already that you really like, but can't use it because you either don't have the ingredients or you are allergic to them. Fortunately, there are a few ways you can tweak an existing recipe to work for you. This section will show you how to do that. You can also create your own custom smoothie using this section."
        },
        {
          "headline":"Substitute yogurt for milk and/or ice.",
          "description":"If you don't have milk at home, you can omit the ice and use yogurt instead. If the recipe calls for frozen fruit, use non-frozen fruit instead, or your smoothie will be too thick."
        },
        {
          "headline":"Use another type of milk if you are allergic to cows milk.",
          "description":"There are all sorts of milk available that can work in a smoothie, including: almond, coconut, rice, and soy. Some stores even sell lactose-free cow's milk."
        },
        {
          "headline":"Use another liquid instead of milk.",
          "description":"Not all smoothies have to be creamy. If you don't like the flavor of almond or coconut milk, you can always use another type of liquid instead. Here are some options:\nCoconut water (great with tropical fruit)\nFruit juice (such as orange juice and apple juice)\nGreen tea\nWater or carbonated water"
        },
        {
          "headline":"Try using frozen fruit instead of ice.",
          "description":"By using frozen fruit instead of ice, you are flavoring your smoothie and thickening it. You can freeze fruit yourself at home, or buy it frozen from the freezer section of a supermarket. Here are some types of frozen fruit you can use:\nBananas\nBerries (blackberries, blueberries, raspberries, and strawberries)\nOranges\nPeaches\nPears\nTropical fruit, such as mango, papaya, and pineapples"
        },
        {
          "headline":"Try another thickener instead of ice or frozen fruit.",
          "description":"Ice is mainly used to thicken smoothies. If you don't have any ice at home, or even a way to freeze fruit, you can use all sorts of stuff to thicken it, including:\nGround oatmeal\nNuts\nPeanut butter\nSoft tofu\nYogurt"
        }
      ]
    }
  ],
  "text":" Making Dairy-free Smoothies Make a soy milk banana-blueberry smoothie. Combine 1¼ cups (300 milliliters) light soy milk, ½ cup (50 grams) frozen blueberries, one half of a sliced frozen banana, 2 teaspoons sugar, and 1 teaspoon vanilla extract in a blender. Blend until smooth—about 20 to 30 seconds. Makes 2 servings. Make a soy milk breakfast smoothie. Combine 1 cup (240 milliliters) vanilla soy milk, ½ cup (50 grams) frozen blueberries, ½ cup (115 grams) cornflakes cereal, and 1 sliced frozen banana in a blender. Blend for 20 seconds, scrape down the sides of the blender with a spatula, then blend for 15 more seconds. Makes 1 serving. Make an almond milk summer smoothie. Combine ½ cup (120 milliliters) pomegranate juice, ¾ cup (180 milliliters) orange juice, ¾ cup (180 milliliters) almond milk, 1¼ cups (155 grams) frozen raspberries, and 1 sliced frozen banana in a blender. Blend until smooth. Be sure to scrape down the sides of the blender with a spatula from time to time. Makes 2 servings. You can also freeze this as popsicles. Make a nut milk banana-bread smoothie. Combine 1 cup (240 milliliters) cashew milk, 2 sliced frozen bananas, 2 tablespoons almond butter, and a dash of ground nutmeg in a blender. Blend on high until smooth and serve. Makes enough for 2 servings. You can also use another type of milk instead of cashew milk, such as almond or soy. Make a coconut milk strawberry-banana smoothie. Combine 1 cup (240 milliliters) coconut milk, 1 sliced frozen banana, 2 cups (400 grams) frozen strawberries, and 1 teaspoon vanilla extract in a blender. Blend until smooth and serve. Makes 2 servings. You can use non-frozen strawberries and bananas, but the smoothie may not be as thick or cold. Make a juice-based strawberry-kiwi smoothie. Combine 1¼ cups (300 milliliters) cold apple juice, 1 sliced banana, 1 peeled and sliced kiwi fruit, 5 frozen strawberries, and 1 ½ teaspoon honey in a blender. Blend until everything is smooth, and serve. Makes enough for 4 servings. Making Yogurt Smoothies Make a banana smoothie. Combine ¾ cup (190 grams) vanilla yogurt, 1 sliced banana, and 1 tablespoon honey in a blender. Blend until smooth and frothy. This makes enough to serve two people. Makes 2 servings\nFor added digestion benefits and flavor, add ½ teaspoon of freshly grated ginger. Make a strawberry-banana smoothie. Combine ½ cup (120 milliliters) orange juice, 1 cup (250 grams) plain, nonfat yogurt, 1 sliced banana, and 6 frozen strawberries in a blender. Blend for 20 seconds. Scrape down the sides of your blender with a spatula, and blend for 15 more seconds. Makes 1 serving. You can use regular, non-frozen strawberries, but the smoothie may not be as thick or cold. For a sweeter smoothie, use low-fat vanilla yogurt instead of the plain one. Make a banana-peach smoothie. Combine ¾ cup (190 grams) vanilla yogurt, 1 peeled and sliced peach, and 2 sliced bananas in a blender. Blend until smooth, then serve. Makes 2 servings. For a thicker smoothie, use frozen bananas. For a thicker smoothie, use Green vanilla yogurt. For additional flavor, add a dash of nutmeg. Make a strawberry smoothie. Combine ½ cup (120 milliliters) orange juice, ½ cup (125 grams) low-fat yogurt, and 1 cup (200 grams) frozen strawberries in a blender. Pulse for 30 seconds, then blend for 30 more seconds (or until smooth). Makes 1 serving. Try using other types of berries instead, such as blueberries, blackberries, or raspberries. You can use any flavor of low-fat yogurt you want, but plain might taste the best. You can also use another type of juice, such as mango. Make a tutti-frutti smoothie. Place ½ cup of each of the following in a blender: orange juice (120 milliliters), plain yogurt (125 grams), frozen strawberries (100 grams), canned crushed pineapple (115 grams), and sliced banana (115 grams). Blend everything until smooth—about 2 minutes. Makes enough for 2 servings. Make a fizzy tropical smoothie. Combine 1 cup (240 milliliters) cold apricot nectar, 1 cup (250 grams) low-fat peach yogurt, 1 banana, and 1 tablespoon frozen lemonade concentrate in a blender. Blend for 30 seconds. Stir in ½ cup (120 milliliters) club soda before serving. Makes 4 servings. If you can't find club soda, search for carbonated water instead. Finding and Using Substitutions Know that you can work with an existing recipe. You might have a recipe already that you really like, but can't use it because you either don't have the ingredients or you are allergic to them. Fortunately, there are a few ways you can tweak an existing recipe to work for you. This section will show you how to do that. You can also create your own custom smoothie using this section. Substitute yogurt for milk and/or ice. If you don't have milk at home, you can omit the ice and use yogurt instead. If the recipe calls for frozen fruit, use non-frozen fruit instead, or your smoothie will be too thick. Use another type of milk if you are allergic to cows milk. There are all sorts of milk available that can work in a smoothie, including: almond, coconut, rice, and soy. Some stores even sell lactose-free cow's milk. Use another liquid instead of milk. Not all smoothies have to be creamy. If you don't like the flavor of almond or coconut milk, you can always use another type of liquid instead. Here are some options:\nCoconut water (great with tropical fruit)\nFruit juice (such as orange juice and apple juice)\nGreen tea\nWater or carbonated water Try using frozen fruit instead of ice. By using frozen fruit instead of ice, you are flavoring your smoothie and thickening it. You can freeze fruit yourself at home, or buy it frozen from the freezer section of a supermarket. Here are some types of frozen fruit you can use:\nBananas\nBerries (blackberries, blueberries, raspberries, and strawberries)\nOranges\nPeaches\nPears\nTropical fruit, such as mango, papaya, and pineapples Try another thickener instead of ice or frozen fruit. Ice is mainly used to thicken smoothies. If you don't have any ice at home, or even a way to freeze fruit, you can use all sorts of stuff to thicken it, including:\nGround oatmeal\nNuts\nPeanut butter\nSoft tofu\nYogurt",
  "sentences":[
    " Making Dairy-free Smoothies Make a soy milk banana-blueberry smoothie.",
    "Combine 1¼ cups (300 milliliters) light soy milk, ½ cup (50 grams) frozen blueberries, one half of a sliced frozen banana, 2 teaspoons sugar, and 1 teaspoon vanilla extract in a blender.",
    "Blend until smooth—about 20 to 30 seconds.",
    "Makes 2 servings.",
    "Make a soy milk breakfast smoothie.",
    "Combine 1 cup (240 milliliters) vanilla soy milk, ½ cup (50 grams) frozen blueberries, ½ cup (115 grams) cornflakes cereal, and 1 sliced frozen banana in a blender.",
    "Blend for 20 seconds, scrape down the sides of the blender with a spatula, then blend for 15 more seconds.",
    "Makes 1 serving.",
    "Make an almond milk summer smoothie.",
    "Combine ½ cup (120 milliliters) pomegranate juice, ¾ cup (180 milliliters) orange juice, ¾ cup (180 milliliters) almond milk, 1¼ cups (155 grams) frozen raspberries, and 1 sliced frozen banana in a blender.",
    "Blend until smooth.",
    "Be sure to scrape down the sides of the blender with a spatula from time to time.",
    "Makes 2 servings.",
    "You can also freeze this as popsicles.",
    "Make a nut milk banana-bread smoothie.",
    "Combine 1 cup (240 milliliters) cashew milk, 2 sliced frozen bananas, 2 tablespoons almond butter, and a dash of ground nutmeg in a blender.",
    "Blend on high until smooth and serve.",
    "Makes enough for 2 servings.",
    "You can also use another type of milk instead of cashew milk, such as almond or soy.",
    "Make a coconut milk strawberry-banana smoothie.",
    "Combine 1 cup (240 milliliters) coconut milk, 1 sliced frozen banana, 2 cups (400 grams) frozen strawberries, and 1 teaspoon vanilla extract in a blender.",
    "Blend until smooth and serve.",
    "Makes 2 servings.",
    "You can use non-frozen strawberries and bananas, but the smoothie may not be as thick or cold.",
    "Make a juice-based strawberry-kiwi smoothie.",
    "Combine 1¼ cups (300 milliliters) cold apple juice, 1 sliced banana, 1 peeled and sliced kiwi fruit, 5 frozen strawberries, and 1 ½ teaspoon honey in a blender.",
    "Blend until everything is smooth, and serve.",
    "Makes enough for 4 servings.",
    "Making Yogurt Smoothies Make a banana smoothie.",
    "Combine ¾ cup (190 grams) vanilla yogurt, 1 sliced banana, and 1 tablespoon honey in a blender.",
    "Blend until smooth and frothy.",
    "This makes enough to serve two people.",
    "Makes 2 servings\nFor added digestion benefits and flavor, add ½ teaspoon of freshly grated ginger.",
    "Make a strawberry-banana smoothie.",
    "Combine ½ cup (120 milliliters) orange juice, 1 cup (250 grams) plain, nonfat yogurt, 1 sliced banana, and 6 frozen strawberries in a blender.",
    "Blend for 20 seconds.",
    "Scrape down the sides of your blender with a spatula, and blend for 15 more seconds.",
    "Makes 1 serving.",
    "You can use regular, non-frozen strawberries, but the smoothie may not be as thick or cold.",
    "For a sweeter smoothie, use low-fat vanilla yogurt instead of the plain one.",
    "Make a banana-peach smoothie.",
    "Combine ¾ cup (190 grams) vanilla yogurt, 1 peeled and sliced peach, and 2 sliced bananas in a blender.",
    "Blend until smooth, then serve.",
    "Makes 2 servings.",
    "For a thicker smoothie, use frozen bananas.",
    "For a thicker smoothie, use Green vanilla yogurt.",
    "For additional flavor, add a dash of nutmeg.",
    "Make a strawberry smoothie.",
    "Combine ½ cup (120 milliliters) orange juice, ½ cup (125 grams) low-fat yogurt, and 1 cup (200 grams) frozen strawberries in a blender.",
    "Pulse for 30 seconds, then blend for 30 more seconds (or until smooth).",
    "Makes 1 serving.",
    "Try using other types of berries instead, such as blueberries, blackberries, or raspberries.",
    "You can use any flavor of low-fat yogurt you want, but plain might taste the best.",
    "You can also use another type of juice, such as mango.",
    "Make a tutti-frutti smoothie.",
    "Place ½ cup of each of the following in a blender: orange juice (120 milliliters), plain yogurt (125 grams), frozen strawberries (100 grams), canned crushed pineapple (115 grams), and sliced banana (115 grams).",
    "Blend everything until smooth—about 2 minutes.",
    "Makes enough for 2 servings.",
    "Make a fizzy tropical smoothie.",
    "Combine 1 cup (240 milliliters) cold apricot nectar, 1 cup (250 grams) low-fat peach yogurt, 1 banana, and 1 tablespoon frozen lemonade concentrate in a blender.",
    "Blend for 30 seconds.",
    "Stir in ½ cup (120 milliliters) club soda before serving.",
    "Makes 4 servings.",
    "If you can't find club soda, search for carbonated water instead.",
    "Finding and Using Substitutions Know that you can work with an existing recipe.",
    "You might have a recipe already that you really like, but can't use it because you either don't have the ingredients or you are allergic to them.",
    "Fortunately, there are a few ways you can tweak an existing recipe to work for you.",
    "This section will show you how to do that.",
    "You can also create your own custom smoothie using this section.",
    "Substitute yogurt for milk and/or ice.",
    "If you don't have milk at home, you can omit the ice and use yogurt instead.",
    "If the recipe calls for frozen fruit, use non-frozen fruit instead, or your smoothie will be too thick.",
    "Use another type of milk if you are allergic to cows milk.",
    "There are all sorts of milk available that can work in a smoothie, including: almond, coconut, rice, and soy.",
    "Some stores even sell lactose-free cow's milk.",
    "Use another liquid instead of milk.",
    "Not all smoothies have to be creamy.",
    "If you don't like the flavor of almond or coconut milk, you can always use another type of liquid instead.",
    "Here are some options:\nCoconut water (great with tropical fruit)\nFruit juice (such as orange juice and apple juice)\nGreen tea\nWater or carbonated water Try using frozen fruit instead of ice.",
    "By using frozen fruit instead of ice, you are flavoring your smoothie and thickening it.",
    "You can freeze fruit yourself at home, or buy it frozen from the freezer section of a supermarket.",
    "Here are some types of frozen fruit you can use:\nBananas\nBerries (blackberries, blueberries, raspberries, and strawberries)\nOranges\nPeaches\nPears\nTropical fruit, such as mango, papaya, and pineapples Try another thickener instead of ice or frozen fruit.",
    "Ice is mainly used to thicken smoothies.",
    "If you don't have any ice at home, or even a way to freeze fruit, you can use all sorts of stuff to thicken it, including:\nGround oatmeal\nNuts\nPeanut butter\nSoft tofu\nYogurt"
  ],
  "tyn_section":[
    "Blender or food processor"
  ],
  "tyn_model":[
    "blender",
    "banana",
    "milk",
    "strawberries",
    "bananas",
    "ice",
    "blueberries",
    "orange juice",
    "yogurt",
    "soy milk",
    "spatula",
    "raspberries",
    "vanilla yogurt",
    "vanilla extract",
    "—about",
    "almond milk",
    "cashew milk",
    "nutmeg",
    "coconut milk",
    "apple juice",
    "honey",
    "low-fat yogurt",
    "frozen strawberries",
    "berries",
    "blackberries",
    "mango",
    "club soda",
    "carbonated water",
    "sugar",
    "vanilla soy milk",
    "cornflakes cereal",
    "pomegranate juice",
    "nut milk",
    "almond butter",
    "banana smoothie",
    "ginger",
    "strawberry-banana",
    "orange",
    "low-fat vanilla yogurt",
    "banana-peach",
    "peach",
    "strawberry smoothie",
    "plain yogurt",
    "crushed pineapple",
    "apricot nectar",
    "low-fat peach yogurt",
    "frozen lemonade concentrate",
    "lactose-free cow's milk",
    "almond or coconut milk",
    "coconut water",
    "green tea",
    "water",
    "fruit",
    "oranges",
    "peaches",
    "pineapples",
    "oatmeal",
    "nuts",
    "butter"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}