{
  "title":"How to Cook Edamame",
  "url":"https://www.wikihow.com/Cook-Edamame",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "methods":[
    {
      "name":"Boiling Edamame Pods",
      "steps":[
        {
          "headline":"Heat 3 US qt (2,800 ml) of water to a boil.",
          "description":"Put the water in a large pot and add 1 teaspoon (5 g) of salt for flavor. Bring the water to a steady boil over high heat on your stove. Put in more salt if you want to add more flavor."
        },
        {
          "headline":"Pour 2 lb (910 g) of frozen edamame pods into the water.",
          "description":"Take the edamame right out of the freezer and put them into the pot. Stir the pods around to mix them in the water. Cook the edamame until the beans inside the pods are tender. Break apart one of the bean pods after about 5 minutes to see if the beans are tender. You may also use fresh edamame if you have it."
        },
        {
          "headline":"Strain the edamame once the beans are tender.",
          "description":"Set a strainer in your sink and pour your edamame into it. Wait for the boiling water to completely drain out before handling the pods. Be careful–they will be hot!"
        },
        {
          "headline":"Serve the edamame with salt.",
          "description":"Transfer the edamame into a large serving bowl and sprinkle them with salt to your desired flavor. Break apart the pods and enjoy the delicious beans inside. You can serve edamame hot or let it chill in the fridge for up to 4 hours."
        }
      ]
    },
    {
      "name":"Steaming Edamame",
      "steps":[
        {
          "headline":"Fill a steamer pot halfway with water and bring it to a boil.",
          "description":"Pour 4 cups (950 ml) of water into the bottom section of the steamer pot. Turn the heat on your stove onto high and let the water come to a boil. Once the water is boiling, reduce the heat down to medium. Steamer pots are available at your local kitchen goods store."
        },
        {
          "headline":"Place 1 cup (135 g) of edamame in your steamer rack.",
          "description":"You can use edamame that’s either fresh or frozen. The steamer rack is a small bowl that sits inside the steamer pot. Rinse the edamame under cold water to quickly clean them. Shake the excess water out of the rack."
        },
        {
          "headline":"Put the steamer rack in the pot and cover it for 5 minutes.",
          "description":"Rest the lip of the steamer rack on the edge of the pot. Immediately cover the pot to keep the steam inside. Let the edamame cook for at least 5 minutes or until the bean pods are tender. If the bean pods are not fully cooked after 5 minutes, keep them in the steamer pot for an additional 2 minutes before checking them again."
        },
        {
          "headline":"Plunge the bean pods into ice water to stop the cooking process.",
          "description":"Hold the steamer rack with oven mitts and dip the entire rack into a bowl filled with ice water. Take the rack out of the bowl immediately so the beans don’t get too cold. Sprinkle salt on the bean pods to flavor them. Edamame can be served hot or cold."
        }
      ]
    },
    {
      "name":"Pan-Frying Edamame Pods",
      "steps":[
        {
          "headline":"Combine the soy sauce, garlic, and red pepper flakes.",
          "description":"In a mixing bowl, pour in your sauce and spices. Stir them together until they are thoroughly mixed. Grate a knob of ginger into the sauce for added flavor. Adjust the amount of spices to however hot you can handle."
        },
        {
          "headline":"Place the skillet over high heat with sesame oil.",
          "description":"Turn on your kitchen’s exhaust fan so it doesn’t get smoky. Heat the oil on your skillet until it’s steaming and bubbling. Move the oil around the pan so it doesn’t burn."
        },
        {
          "headline":"Add the edamame to the hot pan and let them blister for 1-2 minutes.",
          "description":"Once you put the edamame into the skillet, don’t move them around. Let the edamame sear and blacken on one side to add a char flavor. Add the edamame slowly so the oil doesn’t splash out and burn you. You can use fresh or frozen edamame."
        },
        {
          "headline":"Mix in the soy sauce mixture with the edamame for 2-3 minutes.",
          "description":"Slowly pour the soy sauce into the same skillet as the edamame. Let the edamame simmer in the sauce so they can absorb the flavor. Use a mixing spoon to coat all of the edamame pods. If the skillet starts bubbling too much, you can turn the heat down on your stove."
        },
        {
          "headline":"Serve the edamame in a serving bowl.",
          "description":"Transfer the edamame into your serving bowl and eat them while they're warm. For a hint of fresh flavor, squeeze a wedge of lime over the edamame. Don’t eat the pods since they have a tough and chewy texture."
        }
      ]
    }
  ],
  "text":" Boiling Edamame Pods Heat 3 US qt (2,800 ml) of water to a boil. Put the water in a large pot and add 1 teaspoon (5 g) of salt for flavor. Bring the water to a steady boil over high heat on your stove. Put in more salt if you want to add more flavor. Pour 2 lb (910 g) of frozen edamame pods into the water. Take the edamame right out of the freezer and put them into the pot. Stir the pods around to mix them in the water. Cook the edamame until the beans inside the pods are tender. Break apart one of the bean pods after about 5 minutes to see if the beans are tender. You may also use fresh edamame if you have it. Strain the edamame once the beans are tender. Set a strainer in your sink and pour your edamame into it. Wait for the boiling water to completely drain out before handling the pods. Be careful–they will be hot! Serve the edamame with salt. Transfer the edamame into a large serving bowl and sprinkle them with salt to your desired flavor. Break apart the pods and enjoy the delicious beans inside. You can serve edamame hot or let it chill in the fridge for up to 4 hours. Steaming Edamame Fill a steamer pot halfway with water and bring it to a boil. Pour 4 cups (950 ml) of water into the bottom section of the steamer pot. Turn the heat on your stove onto high and let the water come to a boil. Once the water is boiling, reduce the heat down to medium. Steamer pots are available at your local kitchen goods store. Place 1 cup (135 g) of edamame in your steamer rack. You can use edamame that’s either fresh or frozen. The steamer rack is a small bowl that sits inside the steamer pot. Rinse the edamame under cold water to quickly clean them. Shake the excess water out of the rack. Put the steamer rack in the pot and cover it for 5 minutes. Rest the lip of the steamer rack on the edge of the pot. Immediately cover the pot to keep the steam inside. Let the edamame cook for at least 5 minutes or until the bean pods are tender. If the bean pods are not fully cooked after 5 minutes, keep them in the steamer pot for an additional 2 minutes before checking them again. Plunge the bean pods into ice water to stop the cooking process. Hold the steamer rack with oven mitts and dip the entire rack into a bowl filled with ice water. Take the rack out of the bowl immediately so the beans don’t get too cold. Sprinkle salt on the bean pods to flavor them. Edamame can be served hot or cold. Pan-Frying Edamame Pods Combine the soy sauce, garlic, and red pepper flakes. In a mixing bowl, pour in your sauce and spices. Stir them together until they are thoroughly mixed. Grate a knob of ginger into the sauce for added flavor. Adjust the amount of spices to however hot you can handle. Place the skillet over high heat with sesame oil. Turn on your kitchen’s exhaust fan so it doesn’t get smoky. Heat the oil on your skillet until it’s steaming and bubbling. Move the oil around the pan so it doesn’t burn. Add the edamame to the hot pan and let them blister for 1-2 minutes. Once you put the edamame into the skillet, don’t move them around. Let the edamame sear and blacken on one side to add a char flavor. Add the edamame slowly so the oil doesn’t splash out and burn you. You can use fresh or frozen edamame. Mix in the soy sauce mixture with the edamame for 2-3 minutes. Slowly pour the soy sauce into the same skillet as the edamame. Let the edamame simmer in the sauce so they can absorb the flavor. Use a mixing spoon to coat all of the edamame pods. If the skillet starts bubbling too much, you can turn the heat down on your stove. Serve the edamame in a serving bowl. Transfer the edamame into your serving bowl and eat them while they're warm. For a hint of fresh flavor, squeeze a wedge of lime over the edamame. Don’t eat the pods since they have a tough and chewy texture.",
  "sentences":[
    " Boiling Edamame Pods Heat 3 US qt (2,800 ml) of water to a boil.",
    "Put the water in a large pot and add 1 teaspoon (5 g) of salt for flavor.",
    "Bring the water to a steady boil over high heat on your stove.",
    "Put in more salt if you want to add more flavor.",
    "Pour 2 lb (910 g) of frozen edamame pods into the water.",
    "Take the edamame right out of the freezer and put them into the pot.",
    "Stir the pods around to mix them in the water.",
    "Cook the edamame until the beans inside the pods are tender.",
    "Break apart one of the bean pods after about 5 minutes to see if the beans are tender.",
    "You may also use fresh edamame if you have it.",
    "Strain the edamame once the beans are tender.",
    "Set a strainer in your sink and pour your edamame into it.",
    "Wait for the boiling water to completely drain out before handling the pods.",
    "Be careful–they will be hot!",
    "Serve the edamame with salt.",
    "Transfer the edamame into a large serving bowl and sprinkle them with salt to your desired flavor.",
    "Break apart the pods and enjoy the delicious beans inside.",
    "You can serve edamame hot or let it chill in the fridge for up to 4 hours.",
    "Steaming Edamame Fill a steamer pot halfway with water and bring it to a boil.",
    "Pour 4 cups (950 ml) of water into the bottom section of the steamer pot.",
    "Turn the heat on your stove onto high and let the water come to a boil.",
    "Once the water is boiling, reduce the heat down to medium.",
    "Steamer pots are available at your local kitchen goods store.",
    "Place 1 cup (135 g) of edamame in your steamer rack.",
    "You can use edamame that’s either fresh or frozen.",
    "The steamer rack is a small bowl that sits inside the steamer pot.",
    "Rinse the edamame under cold water to quickly clean them.",
    "Shake the excess water out of the rack.",
    "Put the steamer rack in the pot and cover it for 5 minutes.",
    "Rest the lip of the steamer rack on the edge of the pot.",
    "Immediately cover the pot to keep the steam inside.",
    "Let the edamame cook for at least 5 minutes or until the bean pods are tender.",
    "If the bean pods are not fully cooked after 5 minutes, keep them in the steamer pot for an additional 2 minutes before checking them again.",
    "Plunge the bean pods into ice water to stop the cooking process.",
    "Hold the steamer rack with oven mitts and dip the entire rack into a bowl filled with ice water.",
    "Take the rack out of the bowl immediately so the beans don’t get too cold.",
    "Sprinkle salt on the bean pods to flavor them.",
    "Edamame can be served hot or cold.",
    "Pan-Frying Edamame Pods Combine the soy sauce, garlic, and red pepper flakes.",
    "In a mixing bowl, pour in your sauce and spices.",
    "Stir them together until they are thoroughly mixed.",
    "Grate a knob of ginger into the sauce for added flavor.",
    "Adjust the amount of spices to however hot you can handle.",
    "Place the skillet over high heat with sesame oil.",
    "Turn on your kitchen’s exhaust fan so it doesn’t get smoky.",
    "Heat the oil on your skillet until it’s steaming and bubbling.",
    "Move the oil around the pan so it doesn’t burn.",
    "Add the edamame to the hot pan and let them blister for 1-2 minutes.",
    "Once you put the edamame into the skillet, don’t move them around.",
    "Let the edamame sear and blacken on one side to add a char flavor.",
    "Add the edamame slowly so the oil doesn’t splash out and burn you.",
    "You can use fresh or frozen edamame.",
    "Mix in the soy sauce mixture with the edamame for 2-3 minutes.",
    "Slowly pour the soy sauce into the same skillet as the edamame.",
    "Let the edamame simmer in the sauce so they can absorb the flavor.",
    "Use a mixing spoon to coat all of the edamame pods.",
    "If the skillet starts bubbling too much, you can turn the heat down on your stove.",
    "Serve the edamame in a serving bowl.",
    "Transfer the edamame into your serving bowl and eat them while they're warm.",
    "For a hint of fresh flavor, squeeze a wedge of lime over the edamame.",
    "Don’t eat the pods since they have a tough and chewy texture."
  ],
  "tyn_section":[
    "Stove",
    "Pot",
    "Strainer",
    "Serving bowl",
    "Steamer pot with rack",
    "Bowl",
    "Skillet",
    "Measuring spoons",
    "Spoon"
  ],
  "tyn_model":[
    "water",
    "edamame",
    "salt",
    "skillet",
    "pot",
    "steamer pot",
    "steamer rack",
    "soy sauce",
    "oil",
    "stove",
    "ice water",
    "bowl",
    "spices",
    "large pot",
    "edamame pods",
    "freezer",
    "strainer",
    "–they",
    "large serving bowl",
    "steamer pots",
    "oven mitts",
    "pan-frying edamame pods",
    "garlic",
    "red pepper",
    "mixing bowl",
    "ginger",
    "sesame oil",
    "mixing spoon",
    "serving bowl",
    "lime"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.2,
    "f1":0.3076923077,
    "avg_pos":0.3
  },
  "jacc_metrics_0.5":{
    "r":0.8888888889,
    "p":0.4,
    "f1":0.5517241379
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.4,
    "f1":0.5517241379
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.2333333333,
    "f1":0.3456790123
  }
}