{
  "title":"How to Make Bead Earrings",
  "url":"https://www.wikihow.com/Make-Bead-Earrings",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Beading"
  ],
  "methods":[
    {
      "name":"Making a Basic Pair of Beaded Earrings",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"Making beaded earrings is quite easy. However, you will need to have some special materials ready before you get started. You will probably need to visit a craft store to find everything, or you can order your materials online. Before you begin, you will need:\nEndpins (looks like a straight wire with a small button at the end). Endpins are available in many thicknesses to accommodate different sizes of beads. Sometimes you will see the thickness mentioned by gauge (ga) on the packaging. In this case, a larger number (for example, 24 ga) indicates a thinner endpin, while a smaller number (for example, 20 ga) indicates a thicker headpin. Beads in the colors and types of your choice\nRound nose pliers\nEarring hooks\nWire cutters"
        },
        {
          "headline":"Add your beads.",
          "description":"First, put a spacer bead or a bead with a smaller hole than your other beads at the bottom of the endpin, then add the beads of your choice on the endpin. Arrange the beads in the order you want them to create a colorful pattern. Experiment with different colors and styles. Use spacer beads to separate colors if desired."
        },
        {
          "headline":"Continue adding beads.",
          "description":"Keep adding beads to the endpin until you have 1/4\" to 3/8\" (6mm to 1cm) of space remaining. It is important to leave some space so that the earrings will retain their movement and will not be stiff. If you want your earrings to be shorter, use a pair of wire cutters to snip the headpin to the appropriate length."
        },
        {
          "headline":"Use a pair of round-nose pliers to bend the top of your head-pin.",
          "description":"Bend the head pin until it is at a 90 degree angle to the beads. This will help to secure the beads in place and begin the attachment to your earring hook."
        },
        {
          "headline":"Bend the top of the endpin into a loop using the round-nose pliers.",
          "description":"This loop allows you to add a post or wire to complete the earring at the end of the headpin with the round-nose pliers. Using the tip of the pliers as a guide, form the end of the headpin into a neat loop. If there is any excess wire going out from the loop, then snip it at the base of the loop using a pair of wire cutters. Make sure to wear eye protection when you do this because the wire may fly up towards your face."
        },
        {
          "headline":"Add the earring hook.",
          "description":"Next you will need to attach the earring hook to the loop. Do this before you close the loop all the way. Then, use your round nose pliers to close the loop."
        },
        {
          "headline":"Make your second earring and enjoy!",
          "description":"After you have created one earring, you will just need to make a second earring in the same manner, and you will have a completed pair of beaded earrings! Try them on, give them as a gift, or add them to your stock of handmade jewelry to sell."
        }
      ]
    },
    {
      "name":"Customizing Your Earrings",
      "steps":[
        {
          "headline":"Include a central bead or pendant.",
          "description":"Instead of making your earrings with a sequence of small beads only, you can use a larger decorative bead or a pendant as a way to make your earrings stand out more. Try putting one large, interesting bead near the bottom or center of your earrings, or attach a pendant to the bottom of your endpin. You can find endpins that have a rounded wire end, which is useful for hanging pendants from. Unless the pendant already has a jump ring attached, you will need to get some jump rings to attach the pendant. These are small metal ring that you open and close with pliers to attach them to the wire endpin."
        },
        {
          "headline":"Experiment with wire wrapping.",
          "description":"Wire wrapping is a jewelry making technique that can make your hand-crafted earrings look even more intricate and beautiful. You can use pliers to wire wrap large beads and stones, which you can use as a pendant for earrings. This technique takes some practice and patience to learn, so plan on doing some experimental pieces before you are ready to make earrings."
        },
        {
          "headline":"Use a different type of base.",
          "description":"Endpins are the classic type of earring base that jewelers use for earrings, but you can also use other types of bases to give your beaded earrings a different design. See what types of earring bases are available at your local crafting store and do some experimentation. For example, if you want your earrings to have more movement, then you could use some fishing line as the base for your beads instead. Or, you may be able to find some hoop earrings that are thin enough to slide your beads onto."
        }
      ]
    }
  ],
  "text":" Making a Basic Pair of Beaded Earrings Gather your materials. Making beaded earrings is quite easy. However, you will need to have some special materials ready before you get started. You will probably need to visit a craft store to find everything, or you can order your materials online. Before you begin, you will need:\nEndpins (looks like a straight wire with a small button at the end). Endpins are available in many thicknesses to accommodate different sizes of beads. Sometimes you will see the thickness mentioned by gauge (ga) on the packaging. In this case, a larger number (for example, 24 ga) indicates a thinner endpin, while a smaller number (for example, 20 ga) indicates a thicker headpin. Beads in the colors and types of your choice\nRound nose pliers\nEarring hooks\nWire cutters Add your beads. First, put a spacer bead or a bead with a smaller hole than your other beads at the bottom of the endpin, then add the beads of your choice on the endpin. Arrange the beads in the order you want them to create a colorful pattern. Experiment with different colors and styles. Use spacer beads to separate colors if desired. Continue adding beads. Keep adding beads to the endpin until you have 1/4\" to 3/8\" (6mm to 1cm) of space remaining. It is important to leave some space so that the earrings will retain their movement and will not be stiff. If you want your earrings to be shorter, use a pair of wire cutters to snip the headpin to the appropriate length. Use a pair of round-nose pliers to bend the top of your head-pin. Bend the head pin until it is at a 90 degree angle to the beads. This will help to secure the beads in place and begin the attachment to your earring hook. Bend the top of the endpin into a loop using the round-nose pliers. This loop allows you to add a post or wire to complete the earring at the end of the headpin with the round-nose pliers. Using the tip of the pliers as a guide, form the end of the headpin into a neat loop. If there is any excess wire going out from the loop, then snip it at the base of the loop using a pair of wire cutters. Make sure to wear eye protection when you do this because the wire may fly up towards your face. Add the earring hook. Next you will need to attach the earring hook to the loop. Do this before you close the loop all the way. Then, use your round nose pliers to close the loop. Make your second earring and enjoy! After you have created one earring, you will just need to make a second earring in the same manner, and you will have a completed pair of beaded earrings! Try them on, give them as a gift, or add them to your stock of handmade jewelry to sell. Customizing Your Earrings Include a central bead or pendant. Instead of making your earrings with a sequence of small beads only, you can use a larger decorative bead or a pendant as a way to make your earrings stand out more. Try putting one large, interesting bead near the bottom or center of your earrings, or attach a pendant to the bottom of your endpin. You can find endpins that have a rounded wire end, which is useful for hanging pendants from. Unless the pendant already has a jump ring attached, you will need to get some jump rings to attach the pendant. These are small metal ring that you open and close with pliers to attach them to the wire endpin. Experiment with wire wrapping. Wire wrapping is a jewelry making technique that can make your hand-crafted earrings look even more intricate and beautiful. You can use pliers to wire wrap large beads and stones, which you can use as a pendant for earrings. This technique takes some practice and patience to learn, so plan on doing some experimental pieces before you are ready to make earrings. Use a different type of base. Endpins are the classic type of earring base that jewelers use for earrings, but you can also use other types of bases to give your beaded earrings a different design. See what types of earring bases are available at your local crafting store and do some experimentation. For example, if you want your earrings to have more movement, then you could use some fishing line as the base for your beads instead. Or, you may be able to find some hoop earrings that are thin enough to slide your beads onto.",
  "sentences":[
    " Making a Basic Pair of Beaded Earrings Gather your materials.",
    "Making beaded earrings is quite easy.",
    "However, you will need to have some special materials ready before you get started.",
    "You will probably need to visit a craft store to find everything, or you can order your materials online.",
    "Before you begin, you will need:\nEndpins (looks like a straight wire with a small button at the end).",
    "Endpins are available in many thicknesses to accommodate different sizes of beads.",
    "Sometimes you will see the thickness mentioned by gauge (ga) on the packaging.",
    "In this case, a larger number (for example, 24 ga) indicates a thinner endpin, while a smaller number (for example, 20 ga) indicates a thicker headpin.",
    "Beads in the colors and types of your choice\nRound nose pliers\nEarring hooks\nWire cutters Add your beads.",
    "First, put a spacer bead or a bead with a smaller hole than your other beads at the bottom of the endpin, then add the beads of your choice on the endpin.",
    "Arrange the beads in the order you want them to create a colorful pattern.",
    "Experiment with different colors and styles.",
    "Use spacer beads to separate colors if desired.",
    "Continue adding beads.",
    "Keep adding beads to the endpin until you have 1/4\" to 3/8\" (6mm to 1cm) of space remaining.",
    "It is important to leave some space so that the earrings will retain their movement and will not be stiff.",
    "If you want your earrings to be shorter, use a pair of wire cutters to snip the headpin to the appropriate length.",
    "Use a pair of round-nose pliers to bend the top of your head-pin.",
    "Bend the head pin until it is at a 90 degree angle to the beads.",
    "This will help to secure the beads in place and begin the attachment to your earring hook.",
    "Bend the top of the endpin into a loop using the round-nose pliers.",
    "This loop allows you to add a post or wire to complete the earring at the end of the headpin with the round-nose pliers.",
    "Using the tip of the pliers as a guide, form the end of the headpin into a neat loop.",
    "If there is any excess wire going out from the loop, then snip it at the base of the loop using a pair of wire cutters.",
    "Make sure to wear eye protection when you do this because the wire may fly up towards your face.",
    "Add the earring hook.",
    "Next you will need to attach the earring hook to the loop.",
    "Do this before you close the loop all the way.",
    "Then, use your round nose pliers to close the loop.",
    "Make your second earring and enjoy!",
    "After you have created one earring, you will just need to make a second earring in the same manner, and you will have a completed pair of beaded earrings!",
    "Try them on, give them as a gift, or add them to your stock of handmade jewelry to sell.",
    "Customizing Your Earrings Include a central bead or pendant.",
    "Instead of making your earrings with a sequence of small beads only, you can use a larger decorative bead or a pendant as a way to make your earrings stand out more.",
    "Try putting one large, interesting bead near the bottom or center of your earrings, or attach a pendant to the bottom of your endpin.",
    "You can find endpins that have a rounded wire end, which is useful for hanging pendants from.",
    "Unless the pendant already has a jump ring attached, you will need to get some jump rings to attach the pendant.",
    "These are small metal ring that you open and close with pliers to attach them to the wire endpin.",
    "Experiment with wire wrapping.",
    "Wire wrapping is a jewelry making technique that can make your hand-crafted earrings look even more intricate and beautiful.",
    "You can use pliers to wire wrap large beads and stones, which you can use as a pendant for earrings.",
    "This technique takes some practice and patience to learn, so plan on doing some experimental pieces before you are ready to make earrings.",
    "Use a different type of base.",
    "Endpins are the classic type of earring base that jewelers use for earrings, but you can also use other types of bases to give your beaded earrings a different design.",
    "See what types of earring bases are available at your local crafting store and do some experimentation.",
    "For example, if you want your earrings to have more movement, then you could use some fishing line as the base for your beads instead.",
    "Or, you may be able to find some hoop earrings that are thin enough to slide your beads onto."
  ],
  "tyn_section":[
    "Endpins",
    "Round-nose pliers",
    "Wire cutters",
    "Beads",
    "Earring hooks"
  ],
  "tyn_model":[
    "beads",
    "endpins",
    "wire cutters",
    "round-nose pliers",
    "wire",
    "pliers",
    "beaded earrings",
    "round nose pliers",
    "wire wrapping",
    "earring hooks",
    "earring hook",
    "jewelry",
    "pendant",
    "jewelry making technique",
    "stones",
    "fishing line"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.3125,
    "f1":0.4761904762,
    "avg_pos":0.0625
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.4375,
    "f1":0.6086956522
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.5625,
    "f1":0.72
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.3125,
    "f1":0.4761904762
  }
}