{
  "title":"How to Make a Sub Sandwich",
  "url":"https://www.wikihow.com/Make-a-Sub-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Meat and Poultry Sandwiches"
  ],
  "steps":[
    {
      "headline":"Start off with a sub roll or a roll of bread cut down the middle.",
      "description":"White and wheat are common bread choices although others exist. You can either cut through the entire bread lengthwise or cut through and keep the back to better keep the insides in."
    },
    {
      "headline":"Spread the bread with a condiment of your choice.",
      "description":"Mayonnaise, miracle whip, mustard, bbq, and hot sauce are all popular choices. You can also save this for last or only spread on top/bottom half."
    },
    {
      "headline":"Add the meat of your choice.",
      "description":"Ham, turkey, chicken, bacon, and egg/chicken/tuna salad are popular options for lunch. You could try meatloaf or grilled chicken for dinner or steak and/or eggs for breakfast subs. You can also cut out meat entirely for a veggie sub."
    },
    {
      "headline":"Add cheese on top of the meat or on the top slice of bread.",
      "description":"American, cheddar, and swiss are popular but any would work."
    },
    {
      "headline":"Toast your sandwich if wanted.",
      "description":"You can toast it in an oven or heat up the meat/cheese only and then add it to the bread."
    },
    {
      "headline":"Add vegetables.",
      "description":"Onions, tomatoes, peppers (banana/bell/Jalapeno), lettuce, spinach, sprouts, olives, pickles, cucumbers, and mushrooms are all popular options."
    },
    {
      "headline":"Add final touches.",
      "description":"Salt and pepper, oregano, garnish, oil, and vinegar are popular options."
    },
    {
      "headline":"Close the sub.",
      "description":"Being careful to tuck all the ingredients into the sandwich close the bread."
    },
    {
      "headline":"Cut the sandwich in half.",
      "description":"This is optional but you can do this if you're using a whole loaf of bread to make it easier to pick up and eat."
    }
  ],
  "text":" Start off with a sub roll or a roll of bread cut down the middle. White and wheat are common bread choices although others exist. You can either cut through the entire bread lengthwise or cut through and keep the back to better keep the insides in. Spread the bread with a condiment of your choice. Mayonnaise, miracle whip, mustard, bbq, and hot sauce are all popular choices. You can also save this for last or only spread on top/bottom half. Add the meat of your choice. Ham, turkey, chicken, bacon, and egg/chicken/tuna salad are popular options for lunch. You could try meatloaf or grilled chicken for dinner or steak and/or eggs for breakfast subs. You can also cut out meat entirely for a veggie sub. Add cheese on top of the meat or on the top slice of bread. American, cheddar, and swiss are popular but any would work. Toast your sandwich if wanted. You can toast it in an oven or heat up the meat/cheese only and then add it to the bread. Add vegetables. Onions, tomatoes, peppers (banana/bell/Jalapeno), lettuce, spinach, sprouts, olives, pickles, cucumbers, and mushrooms are all popular options. Add final touches. Salt and pepper, oregano, garnish, oil, and vinegar are popular options. Close the sub. Being careful to tuck all the ingredients into the sandwich close the bread. Cut the sandwich in half. This is optional but you can do this if you're using a whole loaf of bread to make it easier to pick up and eat.",
  "sentences":[
    " Start off with a sub roll or a roll of bread cut down the middle.",
    "White and wheat are common bread choices although others exist.",
    "You can either cut through the entire bread lengthwise or cut through and keep the back to better keep the insides in.",
    "Spread the bread with a condiment of your choice.",
    "Mayonnaise, miracle whip, mustard, bbq, and hot sauce are all popular choices.",
    "You can also save this for last or only spread on top/bottom half.",
    "Add the meat of your choice.",
    "Ham, turkey, chicken, bacon, and egg/chicken/tuna salad are popular options for lunch.",
    "You could try meatloaf or grilled chicken for dinner or steak and/or eggs for breakfast subs.",
    "You can also cut out meat entirely for a veggie sub.",
    "Add cheese on top of the meat or on the top slice of bread.",
    "American, cheddar, and swiss are popular but any would work.",
    "Toast your sandwich if wanted.",
    "You can toast it in an oven or heat up the meat/cheese only and then add it to the bread.",
    "Add vegetables.",
    "Onions, tomatoes, peppers (banana/bell/Jalapeno), lettuce, spinach, sprouts, olives, pickles, cucumbers, and mushrooms are all popular options.",
    "Add final touches.",
    "Salt and pepper, oregano, garnish, oil, and vinegar are popular options.",
    "Close the sub.",
    "Being careful to tuck all the ingredients into the sandwich close the bread.",
    "Cut the sandwich in half.",
    "This is optional but you can do this if you're using a whole loaf of bread to make it easier to pick up and eat."
  ],
  "tyn_section":[
    "Knife",
    "Butter spreader",
    "Plate",
    "Tongs"
  ],
  "tyn_model":[
    "bread",
    "cheese",
    "mayonnaise",
    "miracle whip",
    "mustard",
    "bbq,",
    "hot sauce",
    "ham",
    "turkey",
    "chicken",
    "bacon",
    "eggs",
    "cheddar",
    "swiss",
    "oven",
    "vegetables",
    "onions",
    "tomatoes",
    "peppers",
    "lettuce",
    "spinach",
    "olives",
    "pickles",
    "cucumbers",
    "mushrooms",
    "salt",
    "oregano",
    "oil",
    "vinegar"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}