{
  "title":"How to Make Ackee and Saltfish",
  "url":"https://www.wikihow.com/Make-Ackee-and-Saltfish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Preparing the Fish",
      "steps":[
        {
          "headline":"Wash the fish in cold water.",
          "description":"Take ½ pound (227 g) of boneless, salted codfish, and place it in a colander. Rinse it thoroughly under cold water to remove the salt from the fish. If you don’t have a colander, you can simply place the fish in a bowl and place it under running cold water, tossing the fish in the water to remove the salt."
        },
        {
          "headline":"Soak the fish in hot water.",
          "description":"When you’ve finished washing the salt from the fish, place it in a large pot or bowl. Cover it with hot water, and allow it to soak in the bath for an hour. Make sure that there is enough water to fully cover all of the fish. The hot water should be approximately 100 degrees Fahrenheit (38 degrees Celsius)."
        },
        {
          "headline":"Replace the water after an hour and soak again.",
          "description":"After the fish has soaked for an hour, drain the water. Add a fresh batch of hot water to the bowl or pot, and allow the fish to soak for another hour so it soaks for a total of 2 hours over all."
        },
        {
          "headline":"Flake the fish and set aside.",
          "description":"When the fish has soaked for a couple of hours, drain the water. Use a fork to gently flake the codfish in a bowl, and set aside. You don’t necessarily have to flake the fish. If you prefer larger flakes, you can break it apart using clean hands."
        }
      ]
    },
    {
      "name":"Cooking the Vegetables",
      "steps":[
        {
          "headline":"Heat the oil in a skillet, and add the garlic.",
          "description":"In a medium size skillet, allow ½ cup (118 ml) of vegetable oil to heat for 3 to 5 minutes over medium high heat or until it shimmers. Next, mix 4 cloves of finely chopped garlic into the pan, and cook for 30 seconds. If you don’t like a strong garlicky taste, you can reduce the garlic cloves to 2 or 3."
        },
        {
          "headline":"Mix in the thyme and cook briefly.",
          "description":"When the garlic has sauted briefly, add 1 sprig of fresh thyme to the pan. Allow it to cook with garlic for approximately 30 seconds. You can replace the sprig of thyme with 1 teaspoon (5 g) of dried thyme."
        },
        {
          "headline":"Stir in the onions, scallions, peppers, and Scotch bonnet pepper, and cook for several minutes.",
          "description":"After you’ve added the thyme, mix 2 sliced onions, 4 chopped scallions, 1 cup (149 g) of sliced bell peppers, and ¼ Scotch bonnet pepper that’s been seeded and finely chopped into the skillet. Stir the mixture well, and let it cook for 5 minutes. You can also add a medium tomato that’s been cut into cubes in with the onions, scallions, and peppers if you desire. While a Scotch bonnet pepper is the classic option for this recipe, you can substitute any hot chili pepper."
        }
      ]
    },
    {
      "name":"Adding the Fish and Ackee",
      "steps":[
        {
          "headline":"Combine the fish with the vegetable mixture and simmer.",
          "description":"Once the vegetable mixture has cooked for several minutes, add the flaked codfish to the skillet. Stir well to ensure that the fish is fully incorporated, and then allow the mixture to simmer for 5 minutes. It’s important to stir the contents of the pan while it’s simmering to ensure that it cooks evenly."
        },
        {
          "headline":"Add the ackee to the pan and simmer again.",
          "description":"After the fish has simmered with the vegetables, mix 1 20-ounce (567 g) can of ackee that’s been drained into the skillet. Simmer the mixture for another 2 minutes. The ackee is delicate, so don’t use a spoon to mix it into the skillet. Instead, use a couple of forks to carefully toss it with the other ingredients until it’s fully combined."
        },
        {
          "headline":"Mix in the pepper and remove the skillet from the heat.",
          "description":"When the ackee is heated through, sprinkle 1 teaspoon (2 g) of freshly ground black pepper into the mixture and stir gently to incorporate. Next, remove the skillet from the heat and let it sit for a minute or two."
        },
        {
          "headline":"Serve with paprika as a garnish.",
          "description":"When the dish is finished cooking, transfer it to a serving dish or bowl. Garnish it by sprinkling 1 teaspoon (2 g) of paprika over the top of the dish."
        }
      ]
    }
  ],
  "text":" Preparing the Fish Wash the fish in cold water. Take ½ pound (227 g) of boneless, salted codfish, and place it in a colander. Rinse it thoroughly under cold water to remove the salt from the fish. If you don’t have a colander, you can simply place the fish in a bowl and place it under running cold water, tossing the fish in the water to remove the salt. Soak the fish in hot water. When you’ve finished washing the salt from the fish, place it in a large pot or bowl. Cover it with hot water, and allow it to soak in the bath for an hour. Make sure that there is enough water to fully cover all of the fish. The hot water should be approximately 100 degrees Fahrenheit (38 degrees Celsius). Replace the water after an hour and soak again. After the fish has soaked for an hour, drain the water. Add a fresh batch of hot water to the bowl or pot, and allow the fish to soak for another hour so it soaks for a total of 2 hours over all. Flake the fish and set aside. When the fish has soaked for a couple of hours, drain the water. Use a fork to gently flake the codfish in a bowl, and set aside. You don’t necessarily have to flake the fish. If you prefer larger flakes, you can break it apart using clean hands. Cooking the Vegetables Heat the oil in a skillet, and add the garlic. In a medium size skillet, allow ½ cup (118 ml) of vegetable oil to heat for 3 to 5 minutes over medium high heat or until it shimmers. Next, mix 4 cloves of finely chopped garlic into the pan, and cook for 30 seconds. If you don’t like a strong garlicky taste, you can reduce the garlic cloves to 2 or 3. Mix in the thyme and cook briefly. When the garlic has sauted briefly, add 1 sprig of fresh thyme to the pan. Allow it to cook with garlic for approximately 30 seconds. You can replace the sprig of thyme with 1 teaspoon (5 g) of dried thyme. Stir in the onions, scallions, peppers, and Scotch bonnet pepper, and cook for several minutes. After you’ve added the thyme, mix 2 sliced onions, 4 chopped scallions, 1 cup (149 g) of sliced bell peppers, and ¼ Scotch bonnet pepper that’s been seeded and finely chopped into the skillet. Stir the mixture well, and let it cook for 5 minutes. You can also add a medium tomato that’s been cut into cubes in with the onions, scallions, and peppers if you desire. While a Scotch bonnet pepper is the classic option for this recipe, you can substitute any hot chili pepper. Adding the Fish and Ackee Combine the fish with the vegetable mixture and simmer. Once the vegetable mixture has cooked for several minutes, add the flaked codfish to the skillet. Stir well to ensure that the fish is fully incorporated, and then allow the mixture to simmer for 5 minutes. It’s important to stir the contents of the pan while it’s simmering to ensure that it cooks evenly. Add the ackee to the pan and simmer again. After the fish has simmered with the vegetables, mix 1 20-ounce (567 g) can of ackee that’s been drained into the skillet. Simmer the mixture for another 2 minutes. The ackee is delicate, so don’t use a spoon to mix it into the skillet. Instead, use a couple of forks to carefully toss it with the other ingredients until it’s fully combined. Mix in the pepper and remove the skillet from the heat. When the ackee is heated through, sprinkle 1 teaspoon (2 g) of freshly ground black pepper into the mixture and stir gently to incorporate. Next, remove the skillet from the heat and let it sit for a minute or two. Serve with paprika as a garnish. When the dish is finished cooking, transfer it to a serving dish or bowl. Garnish it by sprinkling 1 teaspoon (2 g) of paprika over the top of the dish.",
  "sentences":[
    " Preparing the Fish Wash the fish in cold water.",
    "Take ½ pound (227 g) of boneless, salted codfish, and place it in a colander.",
    "Rinse it thoroughly under cold water to remove the salt from the fish.",
    "If you don’t have a colander, you can simply place the fish in a bowl and place it under running cold water, tossing the fish in the water to remove the salt.",
    "Soak the fish in hot water.",
    "When you’ve finished washing the salt from the fish, place it in a large pot or bowl.",
    "Cover it with hot water, and allow it to soak in the bath for an hour.",
    "Make sure that there is enough water to fully cover all of the fish.",
    "The hot water should be approximately 100 degrees Fahrenheit (38 degrees Celsius).",
    "Replace the water after an hour and soak again.",
    "After the fish has soaked for an hour, drain the water.",
    "Add a fresh batch of hot water to the bowl or pot, and allow the fish to soak for another hour so it soaks for a total of 2 hours over all.",
    "Flake the fish and set aside.",
    "When the fish has soaked for a couple of hours, drain the water.",
    "Use a fork to gently flake the codfish in a bowl, and set aside.",
    "You don’t necessarily have to flake the fish.",
    "If you prefer larger flakes, you can break it apart using clean hands.",
    "Cooking the Vegetables Heat the oil in a skillet, and add the garlic.",
    "In a medium size skillet, allow ½ cup (118 ml) of vegetable oil to heat for 3 to 5 minutes over medium high heat or until it shimmers.",
    "Next, mix 4 cloves of finely chopped garlic into the pan, and cook for 30 seconds.",
    "If you don’t like a strong garlicky taste, you can reduce the garlic cloves to 2 or 3.",
    "Mix in the thyme and cook briefly.",
    "When the garlic has sauted briefly, add 1 sprig of fresh thyme to the pan.",
    "Allow it to cook with garlic for approximately 30 seconds.",
    "You can replace the sprig of thyme with 1 teaspoon (5 g) of dried thyme.",
    "Stir in the onions, scallions, peppers, and Scotch bonnet pepper, and cook for several minutes.",
    "After you’ve added the thyme, mix 2 sliced onions, 4 chopped scallions, 1 cup (149 g) of sliced bell peppers, and ¼ Scotch bonnet pepper that’s been seeded and finely chopped into the skillet.",
    "Stir the mixture well, and let it cook for 5 minutes.",
    "You can also add a medium tomato that’s been cut into cubes in with the onions, scallions, and peppers if you desire.",
    "While a Scotch bonnet pepper is the classic option for this recipe, you can substitute any hot chili pepper.",
    "Adding the Fish and Ackee Combine the fish with the vegetable mixture and simmer.",
    "Once the vegetable mixture has cooked for several minutes, add the flaked codfish to the skillet.",
    "Stir well to ensure that the fish is fully incorporated, and then allow the mixture to simmer for 5 minutes.",
    "It’s important to stir the contents of the pan while it’s simmering to ensure that it cooks evenly.",
    "Add the ackee to the pan and simmer again.",
    "After the fish has simmered with the vegetables, mix 1 20-ounce (567 g) can of ackee that’s been drained into the skillet.",
    "Simmer the mixture for another 2 minutes.",
    "The ackee is delicate, so don’t use a spoon to mix it into the skillet.",
    "Instead, use a couple of forks to carefully toss it with the other ingredients until it’s fully combined.",
    "Mix in the pepper and remove the skillet from the heat.",
    "When the ackee is heated through, sprinkle 1 teaspoon (2 g) of freshly ground black pepper into the mixture and stir gently to incorporate.",
    "Next, remove the skillet from the heat and let it sit for a minute or two.",
    "Serve with paprika as a garnish.",
    "When the dish is finished cooking, transfer it to a serving dish or bowl.",
    "Garnish it by sprinkling 1 teaspoon (2 g) of paprika over the top of the dish."
  ],
  "tyn_section":[
    "A colander",
    "A large bowl",
    "A medium size skillet",
    "A wooden spoon",
    "2 forks"
  ],
  "tyn_model":[
    "water",
    "skillet",
    "garlic",
    "bowl",
    "salt",
    "thyme",
    "onions",
    "scallions",
    "scotch bonnet pepper",
    "colander",
    "peppers",
    "vegetable",
    "ackee",
    "paprika",
    "large pot",
    "hot water",
    "fork",
    "oil",
    "vegetable oil",
    "fresh thyme",
    "dried thyme",
    "bell peppers",
    "chili pepper",
    "fish",
    "codfish",
    "vegetables",
    "spoon",
    "forks",
    "pepper",
    "freshly ground black pepper",
    "serving dish or bowl"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.064516129,
    "f1":0.1111111111
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.1290322581,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}