{
  "title":"How to Use a Marble Slab to Temper Chocolate",
  "url":"https://www.wikihow.com/Use-a-Marble-Slab-to-Temper-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Making Chocolate"
  ],
  "steps":[
    {
      "headline":"Melt the chocolate as required by the recipe or chocolate package instructions.",
      "description":""
    },
    {
      "headline":"Set up a marble slab on a flat surface.",
      "description":""
    },
    {
      "headline":"Pour two thirds of the melted chocolate onto the marble slab.",
      "description":""
    },
    {
      "headline":"Spread the melted chocolate out across the slab using a chocolate scraper.",
      "description":"Work at it with the scraper until it starts to thicken just a little. The chocolate needs to be worked really well until enough seed crystals form. The temperature should be 28ºC/82ºF."
    },
    {
      "headline":"Place the worked-on chocolate back with the third of warm chocolate that you didn't spread on the slab.",
      "description":"Mix well until the combined chocolate reaches a temperature of 34ºC/93ºF evenly. You'll then need to work very quickly with the chocolate."
    },
    {
      "headline":"If you find that it isn't cool enough, repeat the steps until it is cooled.",
      "description":"While working with it, keep it at this temperature. This can be done by keeping the bowl in a warm spot or occasionally giving the bowl a blast of heat with a hair dryer set on low."
    }
  ],
  "text":" Melt the chocolate as required by the recipe or chocolate package instructions.  Set up a marble slab on a flat surface.  Pour two thirds of the melted chocolate onto the marble slab.  Spread the melted chocolate out across the slab using a chocolate scraper. Work at it with the scraper until it starts to thicken just a little. The chocolate needs to be worked really well until enough seed crystals form. The temperature should be 28ºC/82ºF. Place the worked-on chocolate back with the third of warm chocolate that you didn't spread on the slab. Mix well until the combined chocolate reaches a temperature of 34ºC/93ºF evenly. You'll then need to work very quickly with the chocolate. If you find that it isn't cool enough, repeat the steps until it is cooled. While working with it, keep it at this temperature. This can be done by keeping the bowl in a warm spot or occasionally giving the bowl a blast of heat with a hair dryer set on low.",
  "sentences":[
    " Melt the chocolate as required by the recipe or chocolate package instructions.",
    "Set up a marble slab on a flat surface.",
    "Pour two thirds of the melted chocolate onto the marble slab.",
    "Spread the melted chocolate out across the slab using a chocolate scraper.",
    "Work at it with the scraper until it starts to thicken just a little.",
    "The chocolate needs to be worked really well until enough seed crystals form.",
    "The temperature should be 28ºC/82ºF.",
    "Place the worked-on chocolate back with the third of warm chocolate that you didn't spread on the slab.",
    "Mix well until the combined chocolate reaches a temperature of 34ºC/93ºF evenly.",
    "You'll then need to work very quickly with the chocolate.",
    "If you find that it isn't cool enough, repeat the steps until it is cooled.",
    "While working with it, keep it at this temperature.",
    "This can be done by keeping the bowl in a warm spot or occasionally giving the bowl a blast of heat with a hair dryer set on low."
  ],
  "tyn_section":[
    "Marble slab",
    "Chocolate scraper (a spatula will also work)",
    "Chocolate thermometer"
  ],
  "tyn_model":[
    "chocolate",
    "bowl",
    "chocolate package",
    "chocolate scraper",
    "scraper",
    "hair dryer"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1666666667,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.5,
    "f1":0.4
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}