{
  "title":"How to Make a Toy Gun",
  "url":"https://www.wikihow.com/Make-a-Toy-Gun",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Wargaming",
    "Toy Weaponry",
    "Toy Guns"
  ],
  "methods":[
    {
      "name":"Making a Cardboard Toy Gun",
      "steps":[
        {
          "headline":"Have your supplies for making your toy gun on hand.",
          "description":"To make a cardboard toy gun, you'll want to find cardboard that is fairly rigid, like the cardboard from a shoe box or a cereal box. Cardboard that is thin and flimsy will make a gun that is not very sturdy. Including your cardboard, you'll also need:\nCardboard\nTape\nGlue (optional)\nScissors\nPaint\nRuler\nPencil"
        },
        {
          "headline":"Cut the barrel of your toy gun.",
          "description":"The barrel of your toy gun will begin as a 6x6 inch (15x15 cm) flat piece of cardboard. Mark out these measurements on your cardboard to guide your cutting, then use your scissors to cut your square of cardboard free. Be sure your cardboard is not so stiff that you cannot fold it. You will need to fold this piece of cardboard several times to mold it into the shape of your barrel. You might also use the semi-rigid, cardboard back of a notebook, if you have no shoe or cereal boxes available."
        },
        {
          "headline":"Form the rectangular barrel from your cardboard square.",
          "description":"You can do this by folding your cardboard at equal intervals. For example, you might fold your cardboard straight across every 1.5 inches (4 cm) until you can go no farther. Then unfold your cardboard and bend the opposite ends so as to touch, creating a square shape. For a thinner barrel,\nMake the interval at which you fold smaller. For example, you might fold every ¾\" until you can't fold anymore. Then unfold your cardboard and bend it into a rectangular tube, allowing excess to overlap on the outside."
        },
        {
          "headline":"Tape your barrel along the open edge.",
          "description":"Use as much tape as you need to secure the open edge of your cardboard barrel. In the event you have some overlap with your cardboard, you might strengthen your barrel by:\nPutting a dab of glue where the overlapping parts of your cardboard meet. Hold the cardboard together tightly for about three to five minutes while the glue sets."
        },
        {
          "headline":"Create plugs for the open ends of your barrel.",
          "description":"Hold your rectangular barrel at a  90° to your cardboard and use your pencil to trace its outline. Then, using your scissors, cut these free and attach both to the open ends of your barrel. Use as much tape as you need to attach your plugs to the open ends of your barrel. Cut the handle of your toy gun. Your handle will be made in a similar fashion to your barrel, with an angled cut at the top of the handle imitating the connecting point between barrel and handle. Use your pencil to outline a 6x3 inches (15x7.5cm) piece of cardboard. Cut your outline free with your scissors."
        },
        {
          "headline":"Tape your handle into a rectangular tube.",
          "description":"This tube will be similar to the one you made for you barrel, but smaller. Fold your cardboard at regular intervals, then unfold it and tape the open edge to create a sturdy rectangular tube. For example, you might fold your handle a ½\" at a time until you can fold no more, then touch the opposite ends together to form a square shape. Use as much tape as necessary to secure your handle. If you have some overlapping cardboard, you can strengthen your handle with a dab of glue where the cardboard overlaps. If you use glue, hold the glued cardboard firmly with your fingers for two to five minutes until the glue sets. A narrower handle can be made by folding a ¼\" at a time until you can fold no more. Then fold your cardboard into a square shape, allowing excess cardboard to overlap on the outside, and fasten the loose edge with tape and/or glue."
        },
        {
          "headline":"Cut both ends of your handle at the same angle.",
          "description":"The angled top and bottom of your handle will make your toy gun look more realistic. To make sure your angle is the same on both ends, you might want to:\nMark one side of the top of your handle ½\" below its top edge. Mark the opposite diagonal side (the opposite side of the bottom) ½\" above its bottom edge. Use your ruler to draw a straight line from your mark to the opposite corner of the same side of the handle, for both top and bottom. Cut along the line formed between each mark and its same side corner."
        },
        {
          "headline":"Cut a plug for the bottom of your handle.",
          "description":"Hold your toy gun handle to your cardboard to form a 90° angle so that it roughly forms an L shape with your cardboard. Then use your pencil to trace the outline of your handle. Use your scissors to cut the cardboard plug for the bottom of your handle free from your cardboard. Use as much tape as you need to attach your plug to the bottom of your handle."
        },
        {
          "headline":"Attach your handle and barrel together.",
          "description":"Glue and/or tape the handle of your toy gun to the barrel at the end opposite the front of your barrel. Be sure you hold glued cardboard firmly together for two to five minutes to allow the glue to set, if applicable. You may want to first glue your handle to the barrel, then after the glue has dried, strengthen the connection with tape. The angle of your handle should be attached to your barrel so that its incline is facing the front of the barrel of your gun."
        },
        {
          "headline":"Add a trigger to your gun.",
          "description":"A simple trigger can be made by cutting a thin L shape out of your cardboard with your scissors. Then you should cut a slit into the underside of the barrel of the gun, slightly in front of the handle. Slide the long part of your L piece into the slit until you reach the bend in the L. Then glue or tape your trigger into place."
        },
        {
          "headline":"Add personal touches to your toy gun.",
          "description":"To make a hammer on the top, back-end of your barrel, you can cut another thin L shape out of your cardboard, similar to your trigger but smaller than it, and cut a slit in the top, back-end of your barrel. Insert the long end of your L until you reach the bend, keeping the part sticking out facing backwards, and glue it into place. You might also:\nAdd thin strips along both sides of the barrel of your gun to give it contour and character. Make a raised sight along the top of the barrel by layering several thin strips of cardboard there. Create a trigger guard by cutting a thin strip of cardboard and connecting that strip from the handle below the trigger to the underside of the barrel in front of the trigger."
        },
        {
          "headline":"Paint your gun.",
          "description":"You may want to make a realistic gun by painting the entire thing black. Or maybe your toy gun is really a space-age shooter, in which case gray and red accents might be a better choice. Acrylic paint works well, but many other kinds of paint should work as well. You might also wrap black electrical tape around parts of the gun, like the handle."
        }
      ]
    },
    {
      "name":"Making a Toy Gun from a Glue Gun",
      "steps":[
        {
          "headline":"Gather the parts needed for your toy gun.",
          "description":"Your first challenge is to find a broken glue gun. You might ask your parents or an art teacher if there is a broken model that you can use as the frame for a toy you are making, but be sure you ask to use it first. To make this toy gun, you'll need:\nGlue gun\nScrewdriver\nParty snaps (optional)\nPaint (optional)\nBlack electrical tape (optional)\nGlue (optional)"
        },
        {
          "headline":"Remove the screws from your old glue gun.",
          "description":"But before you do, you should check to make sure it isn’t plugged in and is cool to the touch. Once you know it is safe to take apart, use your screwdriver to take out the screws from the casing. If you have a battery powered hot glue gun, you should remove the batteries before attempting to unscrew it."
        },
        {
          "headline":"Remove the insides of the glue gun.",
          "description":"Now that the screws are out, you shouldn't have much difficulty pulling the two plastic halves of the case apart, though you might meet with some resistance. If you have difficulty taking the casing apart, twist the casing slightly to pop it free. Then:\nIdentify the trigger and loading mechanisms, which should be connected. The trigger, when pulled, will cause the loading mechanism to push glue sticks through the casing. Remove all the internal components except the trigger and loading mechanisms. Take off the metal nozzle at the front of the gun."
        },
        {
          "headline":"Put the casing back together and test the trigger.",
          "description":"Use your screwdriver to reinsert the screws into your casing and fasten it together again. Then, test the trigger by pressing down on it with your finger. You should be able to feel some resistance, which means that the trigger is still moving the loading device in the casing. If the trigger is loose and feels like it isn't engaging the loading mechanism, you'll need to make adjustments. Open the casing and check the connection between the trigger and loading mechanism. Repair any breaks between the two with tape. If it appears that the trigger and loading mechanism have been separated, you may have to reconnect the two with tape."
        },
        {
          "headline":"Add personal touches to your toy gun.",
          "description":"You can give your toy gun a sight by gluing a bead on top of the front end of the barrel. You should also consider painting your gun a more authentic color, like black or gray, but feel free to use your imagination. There may be a gun in  your favorite TV show or video game that you'd like to imitate. Use your paint to decorate your gun until you are satisfied with its appearance."
        },
        {
          "headline":"Create a realistic sound effect with bang snaps.",
          "description":"A bang snap is a kind of novelty firework that, when thrown or stepped on produces a loud noise similar to the caps used in a cap gun. Create your sound effect by triggering the bang snap with the loading mechanism by:\nPlacing a party snap inside the loading area. Pulling the trigger to engage the loading mechanism."
        }
      ]
    }
  ],
  "text":" Making a Cardboard Toy Gun Have your supplies for making your toy gun on hand. To make a cardboard toy gun, you'll want to find cardboard that is fairly rigid, like the cardboard from a shoe box or a cereal box. Cardboard that is thin and flimsy will make a gun that is not very sturdy. Including your cardboard, you'll also need:\nCardboard\nTape\nGlue (optional)\nScissors\nPaint\nRuler\nPencil Cut the barrel of your toy gun. The barrel of your toy gun will begin as a 6x6 inch (15x15 cm) flat piece of cardboard. Mark out these measurements on your cardboard to guide your cutting, then use your scissors to cut your square of cardboard free. Be sure your cardboard is not so stiff that you cannot fold it. You will need to fold this piece of cardboard several times to mold it into the shape of your barrel. You might also use the semi-rigid, cardboard back of a notebook, if you have no shoe or cereal boxes available. Form the rectangular barrel from your cardboard square. You can do this by folding your cardboard at equal intervals. For example, you might fold your cardboard straight across every 1.5 inches (4 cm) until you can go no farther. Then unfold your cardboard and bend the opposite ends so as to touch, creating a square shape. For a thinner barrel,\nMake the interval at which you fold smaller. For example, you might fold every ¾\" until you can't fold anymore. Then unfold your cardboard and bend it into a rectangular tube, allowing excess to overlap on the outside. Tape your barrel along the open edge. Use as much tape as you need to secure the open edge of your cardboard barrel. In the event you have some overlap with your cardboard, you might strengthen your barrel by:\nPutting a dab of glue where the overlapping parts of your cardboard meet. Hold the cardboard together tightly for about three to five minutes while the glue sets. Create plugs for the open ends of your barrel. Hold your rectangular barrel at a  90° to your cardboard and use your pencil to trace its outline. Then, using your scissors, cut these free and attach both to the open ends of your barrel. Use as much tape as you need to attach your plugs to the open ends of your barrel. Cut the handle of your toy gun. Your handle will be made in a similar fashion to your barrel, with an angled cut at the top of the handle imitating the connecting point between barrel and handle. Use your pencil to outline a 6x3 inches (15x7.5cm) piece of cardboard. Cut your outline free with your scissors. Tape your handle into a rectangular tube. This tube will be similar to the one you made for you barrel, but smaller. Fold your cardboard at regular intervals, then unfold it and tape the open edge to create a sturdy rectangular tube. For example, you might fold your handle a ½\" at a time until you can fold no more, then touch the opposite ends together to form a square shape. Use as much tape as necessary to secure your handle. If you have some overlapping cardboard, you can strengthen your handle with a dab of glue where the cardboard overlaps. If you use glue, hold the glued cardboard firmly with your fingers for two to five minutes until the glue sets. A narrower handle can be made by folding a ¼\" at a time until you can fold no more. Then fold your cardboard into a square shape, allowing excess cardboard to overlap on the outside, and fasten the loose edge with tape and/or glue. Cut both ends of your handle at the same angle. The angled top and bottom of your handle will make your toy gun look more realistic. To make sure your angle is the same on both ends, you might want to:\nMark one side of the top of your handle ½\" below its top edge. Mark the opposite diagonal side (the opposite side of the bottom) ½\" above its bottom edge. Use your ruler to draw a straight line from your mark to the opposite corner of the same side of the handle, for both top and bottom. Cut along the line formed between each mark and its same side corner. Cut a plug for the bottom of your handle. Hold your toy gun handle to your cardboard to form a 90° angle so that it roughly forms an L shape with your cardboard. Then use your pencil to trace the outline of your handle. Use your scissors to cut the cardboard plug for the bottom of your handle free from your cardboard. Use as much tape as you need to attach your plug to the bottom of your handle. Attach your handle and barrel together. Glue and/or tape the handle of your toy gun to the barrel at the end opposite the front of your barrel. Be sure you hold glued cardboard firmly together for two to five minutes to allow the glue to set, if applicable. You may want to first glue your handle to the barrel, then after the glue has dried, strengthen the connection with tape. The angle of your handle should be attached to your barrel so that its incline is facing the front of the barrel of your gun. Add a trigger to your gun. A simple trigger can be made by cutting a thin L shape out of your cardboard with your scissors. Then you should cut a slit into the underside of the barrel of the gun, slightly in front of the handle. Slide the long part of your L piece into the slit until you reach the bend in the L. Then glue or tape your trigger into place. Add personal touches to your toy gun. To make a hammer on the top, back-end of your barrel, you can cut another thin L shape out of your cardboard, similar to your trigger but smaller than it, and cut a slit in the top, back-end of your barrel. Insert the long end of your L until you reach the bend, keeping the part sticking out facing backwards, and glue it into place. You might also:\nAdd thin strips along both sides of the barrel of your gun to give it contour and character. Make a raised sight along the top of the barrel by layering several thin strips of cardboard there. Create a trigger guard by cutting a thin strip of cardboard and connecting that strip from the handle below the trigger to the underside of the barrel in front of the trigger. Paint your gun. You may want to make a realistic gun by painting the entire thing black. Or maybe your toy gun is really a space-age shooter, in which case gray and red accents might be a better choice. Acrylic paint works well, but many other kinds of paint should work as well. You might also wrap black electrical tape around parts of the gun, like the handle. Making a Toy Gun from a Glue Gun Gather the parts needed for your toy gun. Your first challenge is to find a broken glue gun. You might ask your parents or an art teacher if there is a broken model that you can use as the frame for a toy you are making, but be sure you ask to use it first. To make this toy gun, you'll need:\nGlue gun\nScrewdriver\nParty snaps (optional)\nPaint (optional)\nBlack electrical tape (optional)\nGlue (optional) Remove the screws from your old glue gun. But before you do, you should check to make sure it isn’t plugged in and is cool to the touch. Once you know it is safe to take apart, use your screwdriver to take out the screws from the casing. If you have a battery powered hot glue gun, you should remove the batteries before attempting to unscrew it. Remove the insides of the glue gun. Now that the screws are out, you shouldn't have much difficulty pulling the two plastic halves of the case apart, though you might meet with some resistance. If you have difficulty taking the casing apart, twist the casing slightly to pop it free. Then:\nIdentify the trigger and loading mechanisms, which should be connected. The trigger, when pulled, will cause the loading mechanism to push glue sticks through the casing. Remove all the internal components except the trigger and loading mechanisms. Take off the metal nozzle at the front of the gun. Put the casing back together and test the trigger. Use your screwdriver to reinsert the screws into your casing and fasten it together again. Then, test the trigger by pressing down on it with your finger. You should be able to feel some resistance, which means that the trigger is still moving the loading device in the casing. If the trigger is loose and feels like it isn't engaging the loading mechanism, you'll need to make adjustments. Open the casing and check the connection between the trigger and loading mechanism. Repair any breaks between the two with tape. If it appears that the trigger and loading mechanism have been separated, you may have to reconnect the two with tape. Add personal touches to your toy gun. You can give your toy gun a sight by gluing a bead on top of the front end of the barrel. You should also consider painting your gun a more authentic color, like black or gray, but feel free to use your imagination. There may be a gun in  your favorite TV show or video game that you'd like to imitate. Use your paint to decorate your gun until you are satisfied with its appearance. Create a realistic sound effect with bang snaps. A bang snap is a kind of novelty firework that, when thrown or stepped on produces a loud noise similar to the caps used in a cap gun. Create your sound effect by triggering the bang snap with the loading mechanism by:\nPlacing a party snap inside the loading area. Pulling the trigger to engage the loading mechanism.",
  "sentences":[
    " Making a Cardboard Toy Gun Have your supplies for making your toy gun on hand.",
    "To make a cardboard toy gun, you'll want to find cardboard that is fairly rigid, like the cardboard from a shoe box or a cereal box.",
    "Cardboard that is thin and flimsy will make a gun that is not very sturdy.",
    "Including your cardboard, you'll also need:\nCardboard\nTape\nGlue (optional)\nScissors\nPaint\nRuler\nPencil Cut the barrel of your toy gun.",
    "The barrel of your toy gun will begin as a 6x6 inch (15x15 cm) flat piece of cardboard.",
    "Mark out these measurements on your cardboard to guide your cutting, then use your scissors to cut your square of cardboard free.",
    "Be sure your cardboard is not so stiff that you cannot fold it.",
    "You will need to fold this piece of cardboard several times to mold it into the shape of your barrel.",
    "You might also use the semi-rigid, cardboard back of a notebook, if you have no shoe or cereal boxes available.",
    "Form the rectangular barrel from your cardboard square.",
    "You can do this by folding your cardboard at equal intervals.",
    "For example, you might fold your cardboard straight across every 1.5 inches (4 cm) until you can go no farther.",
    "Then unfold your cardboard and bend the opposite ends so as to touch, creating a square shape.",
    "For a thinner barrel,\nMake the interval at which you fold smaller.",
    "For example, you might fold every ¾\" until you can't fold anymore.",
    "Then unfold your cardboard and bend it into a rectangular tube, allowing excess to overlap on the outside.",
    "Tape your barrel along the open edge.",
    "Use as much tape as you need to secure the open edge of your cardboard barrel.",
    "In the event you have some overlap with your cardboard, you might strengthen your barrel by:\nPutting a dab of glue where the overlapping parts of your cardboard meet.",
    "Hold the cardboard together tightly for about three to five minutes while the glue sets.",
    "Create plugs for the open ends of your barrel.",
    "Hold your rectangular barrel at a  90° to your cardboard and use your pencil to trace its outline.",
    "Then, using your scissors, cut these free and attach both to the open ends of your barrel.",
    "Use as much tape as you need to attach your plugs to the open ends of your barrel.",
    "Cut the handle of your toy gun.",
    "Your handle will be made in a similar fashion to your barrel, with an angled cut at the top of the handle imitating the connecting point between barrel and handle.",
    "Use your pencil to outline a 6x3 inches (15x7.5cm) piece of cardboard.",
    "Cut your outline free with your scissors.",
    "Tape your handle into a rectangular tube.",
    "This tube will be similar to the one you made for you barrel, but smaller.",
    "Fold your cardboard at regular intervals, then unfold it and tape the open edge to create a sturdy rectangular tube.",
    "For example, you might fold your handle a ½\" at a time until you can fold no more, then touch the opposite ends together to form a square shape.",
    "Use as much tape as necessary to secure your handle.",
    "If you have some overlapping cardboard, you can strengthen your handle with a dab of glue where the cardboard overlaps.",
    "If you use glue, hold the glued cardboard firmly with your fingers for two to five minutes until the glue sets.",
    "A narrower handle can be made by folding a ¼\" at a time until you can fold no more.",
    "Then fold your cardboard into a square shape, allowing excess cardboard to overlap on the outside, and fasten the loose edge with tape and/or glue.",
    "Cut both ends of your handle at the same angle.",
    "The angled top and bottom of your handle will make your toy gun look more realistic.",
    "To make sure your angle is the same on both ends, you might want to:\nMark one side of the top of your handle ½\" below its top edge.",
    "Mark the opposite diagonal side (the opposite side of the bottom) ½\" above its bottom edge.",
    "Use your ruler to draw a straight line from your mark to the opposite corner of the same side of the handle, for both top and bottom.",
    "Cut along the line formed between each mark and its same side corner.",
    "Cut a plug for the bottom of your handle.",
    "Hold your toy gun handle to your cardboard to form a 90° angle so that it roughly forms an L shape with your cardboard.",
    "Then use your pencil to trace the outline of your handle.",
    "Use your scissors to cut the cardboard plug for the bottom of your handle free from your cardboard.",
    "Use as much tape as you need to attach your plug to the bottom of your handle.",
    "Attach your handle and barrel together.",
    "Glue and/or tape the handle of your toy gun to the barrel at the end opposite the front of your barrel.",
    "Be sure you hold glued cardboard firmly together for two to five minutes to allow the glue to set, if applicable.",
    "You may want to first glue your handle to the barrel, then after the glue has dried, strengthen the connection with tape.",
    "The angle of your handle should be attached to your barrel so that its incline is facing the front of the barrel of your gun.",
    "Add a trigger to your gun.",
    "A simple trigger can be made by cutting a thin L shape out of your cardboard with your scissors.",
    "Then you should cut a slit into the underside of the barrel of the gun, slightly in front of the handle.",
    "Slide the long part of your L piece into the slit until you reach the bend in the L. Then glue or tape your trigger into place.",
    "Add personal touches to your toy gun.",
    "To make a hammer on the top, back-end of your barrel, you can cut another thin L shape out of your cardboard, similar to your trigger but smaller than it, and cut a slit in the top, back-end of your barrel.",
    "Insert the long end of your L until you reach the bend, keeping the part sticking out facing backwards, and glue it into place.",
    "You might also:\nAdd thin strips along both sides of the barrel of your gun to give it contour and character.",
    "Make a raised sight along the top of the barrel by layering several thin strips of cardboard there.",
    "Create a trigger guard by cutting a thin strip of cardboard and connecting that strip from the handle below the trigger to the underside of the barrel in front of the trigger.",
    "Paint your gun.",
    "You may want to make a realistic gun by painting the entire thing black.",
    "Or maybe your toy gun is really a space-age shooter, in which case gray and red accents might be a better choice.",
    "Acrylic paint works well, but many other kinds of paint should work as well.",
    "You might also wrap black electrical tape around parts of the gun, like the handle.",
    "Making a Toy Gun from a Glue Gun Gather the parts needed for your toy gun.",
    "Your first challenge is to find a broken glue gun.",
    "You might ask your parents or an art teacher if there is a broken model that you can use as the frame for a toy you are making, but be sure you ask to use it first.",
    "To make this toy gun, you'll need:\nGlue gun\nScrewdriver\nParty snaps (optional)\nPaint (optional)\nBlack electrical tape (optional)\nGlue (optional) Remove the screws from your old glue gun.",
    "But before you do, you should check to make sure it isn’t plugged in and is cool to the touch.",
    "Once you know it is safe to take apart, use your screwdriver to take out the screws from the casing.",
    "If you have a battery powered hot glue gun, you should remove the batteries before attempting to unscrew it.",
    "Remove the insides of the glue gun.",
    "Now that the screws are out, you shouldn't have much difficulty pulling the two plastic halves of the case apart, though you might meet with some resistance.",
    "If you have difficulty taking the casing apart, twist the casing slightly to pop it free.",
    "Then:\nIdentify the trigger and loading mechanisms, which should be connected.",
    "The trigger, when pulled, will cause the loading mechanism to push glue sticks through the casing.",
    "Remove all the internal components except the trigger and loading mechanisms.",
    "Take off the metal nozzle at the front of the gun.",
    "Put the casing back together and test the trigger.",
    "Use your screwdriver to reinsert the screws into your casing and fasten it together again.",
    "Then, test the trigger by pressing down on it with your finger.",
    "You should be able to feel some resistance, which means that the trigger is still moving the loading device in the casing.",
    "If the trigger is loose and feels like it isn't engaging the loading mechanism, you'll need to make adjustments.",
    "Open the casing and check the connection between the trigger and loading mechanism.",
    "Repair any breaks between the two with tape.",
    "If it appears that the trigger and loading mechanism have been separated, you may have to reconnect the two with tape.",
    "Add personal touches to your toy gun.",
    "You can give your toy gun a sight by gluing a bead on top of the front end of the barrel.",
    "You should also consider painting your gun a more authentic color, like black or gray, but feel free to use your imagination.",
    "There may be a gun in  your favorite TV show or video game that you'd like to imitate.",
    "Use your paint to decorate your gun until you are satisfied with its appearance.",
    "Create a realistic sound effect with bang snaps.",
    "A bang snap is a kind of novelty firework that, when thrown or stepped on produces a loud noise similar to the caps used in a cap gun.",
    "Create your sound effect by triggering the bang snap with the loading mechanism by:\nPlacing a party snap inside the loading area.",
    "Pulling the trigger to engage the loading mechanism."
  ],
  "tyn_section":[
    "Cardboard",
    "Tape",
    "Glue (optional)",
    "Scissors",
    "Paint",
    "Ruler",
    "Pencil",
    "Glue gun",
    "Screwdriver",
    "Party snaps (optional)",
    "Paint (optional)",
    "Black electrical tape (optional)"
  ],
  "tyn_model":[
    "cardboard",
    "glue",
    "tape",
    "scissors",
    "toy gun",
    "paint",
    "pencil",
    "glue gun",
    "screwdriver",
    "ruler",
    "electrical tape",
    "hammer",
    "acrylic paint",
    "hot glue",
    "screws",
    "cap gun"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.5,
    "f1":0.5714285714,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.9166666667,
    "p":0.6875,
    "f1":0.7857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9166666667,
    "p":0.875,
    "f1":0.8953488372
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.5,
    "f1":0.5714285714
  }
}