{
  "title":"How to Make a Corn Husk Doll",
  "url":"https://www.wikihow.com/Make-a-Corn-Husk-Doll",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "methods":[
    {
      "name":"Corn husk dolly",
      "steps":[
        {
          "headline":"Assemble the items needed for this project.",
          "description":"These are listed below under \"Things You'll Need\". You can dry the corn husks off purchased corn. Alternatively, buy husks from an ethnic grocery store or farmer's markets (especially Hispanic ones). Some regular supermarkets might also stock them. During sweet corn season, many grocery stores allow customers to husk their corn in the store, and are more than happy to allow you to bring away some husks for free..but just ask the produce manager nicely first!"
        },
        {
          "headline":"Soak the corn husks in warm water for a few hours.",
          "description":"This will make them much more pliable and easier to work with."
        },
        {
          "headline":"Lay down paper or cloth on a flat work surface.",
          "description":"This tends to be a wet and messy project."
        },
        {
          "headline":"Select four of the soaked husks.",
          "description":"If you have one or two that have holes or brown spots on them, put them on the outside."
        },
        {
          "headline":"Tie the husks together with some strong string.",
          "description":"You could also use thick, strong rubber bands if you want."
        },
        {
          "headline":"Flip two husks over so that the outside husks are now on the inside.",
          "description":""
        },
        {
          "headline":"Make the head.",
          "description":"Take two small pieces of soaked husk. Wad each piece into a ball, and stuff it in between a larger husk to cover it like a ball. Tie some string under the ball. Attach to the body with the rubber band or string."
        },
        {
          "headline":"Make arms by braiding three thin strands of husk together.",
          "description":"Tie on both ends to stop the braid from unraveling. Slip each arm in between the husks and tie into place."
        }
      ]
    },
    {
      "name":"Raffia \"corn\" dolly",
      "steps":[
        {
          "headline":"Assemble the items needed for this project.",
          "description":"These are listed below under \"Things You'll Need\"."
        },
        {
          "headline":"Fold the bundle of raffia in half.",
          "description":"It should be about 45 centimeter (17.7 in) in length."
        },
        {
          "headline":"At the top of this folded raffia (the non-open end), tie a length of raffia around it.",
          "description":"This should create a round ball shape, which becomes the dolly's head."
        },
        {
          "headline":"Make the arms from a new bundle of raffia.",
          "description":"Cut a small bundle to about 12 centimeter (4.7 in) in length. Push this through the body, just under the head. Tie a piece of raffia directly under the arms on the body to keep them in place. This also form's the corn dolly's torso."
        },
        {
          "headline":"Wrap the arms and torso with raffia, going around and around until a smooth, totally covered look appears.",
          "description":""
        },
        {
          "headline":"Make the dolly's hair.",
          "description":"Braid a long length of raffia. Tie little knots each end to prevent unraveling. Then, fold each end of the braid to meet at the middle, creating loops that look like little braids hanging down."
        },
        {
          "headline":"Tie the braid to the dolly's head.",
          "description":"Use raffia or string."
        },
        {
          "headline":"Make a hat.",
          "description":"Measure the dolly's head and make a doughnut shaped ring that would just fit around her head. Wrap raffia around and around this to make a well-covered ring. Place on the dolly's head."
        },
        {
          "headline":"Decorate the dolly.",
          "description":"You can display the dolly as she is now or add ornamental grasses and dried flowers through her skirt and on top of her head to improve her overall appearance. Use ribbon to prettify the corn dolly too."
        }
      ]
    }
  ],
  "text":" Corn husk dolly Assemble the items needed for this project. These are listed below under \"Things You'll Need\". You can dry the corn husks off purchased corn. Alternatively, buy husks from an ethnic grocery store or farmer's markets (especially Hispanic ones). Some regular supermarkets might also stock them. During sweet corn season, many grocery stores allow customers to husk their corn in the store, and are more than happy to allow you to bring away some husks for free..but just ask the produce manager nicely first! Soak the corn husks in warm water for a few hours. This will make them much more pliable and easier to work with. Lay down paper or cloth on a flat work surface. This tends to be a wet and messy project. Select four of the soaked husks. If you have one or two that have holes or brown spots on them, put them on the outside. Tie the husks together with some strong string. You could also use thick, strong rubber bands if you want. Flip two husks over so that the outside husks are now on the inside.  Make the head. Take two small pieces of soaked husk. Wad each piece into a ball, and stuff it in between a larger husk to cover it like a ball. Tie some string under the ball. Attach to the body with the rubber band or string. Make arms by braiding three thin strands of husk together. Tie on both ends to stop the braid from unraveling. Slip each arm in between the husks and tie into place. Raffia \"corn\" dolly Assemble the items needed for this project. These are listed below under \"Things You'll Need\". Fold the bundle of raffia in half. It should be about 45 centimeter (17.7 in) in length. At the top of this folded raffia (the non-open end), tie a length of raffia around it. This should create a round ball shape, which becomes the dolly's head. Make the arms from a new bundle of raffia. Cut a small bundle to about 12 centimeter (4.7 in) in length. Push this through the body, just under the head. Tie a piece of raffia directly under the arms on the body to keep them in place. This also form's the corn dolly's torso. Wrap the arms and torso with raffia, going around and around until a smooth, totally covered look appears.  Make the dolly's hair. Braid a long length of raffia. Tie little knots each end to prevent unraveling. Then, fold each end of the braid to meet at the middle, creating loops that look like little braids hanging down. Tie the braid to the dolly's head. Use raffia or string. Make a hat. Measure the dolly's head and make a doughnut shaped ring that would just fit around her head. Wrap raffia around and around this to make a well-covered ring. Place on the dolly's head. Decorate the dolly. You can display the dolly as she is now or add ornamental grasses and dried flowers through her skirt and on top of her head to improve her overall appearance. Use ribbon to prettify the corn dolly too.",
  "sentences":[
    " Corn husk dolly Assemble the items needed for this project.",
    "These are listed below under \"Things You'll Need\".",
    "You can dry the corn husks off purchased corn.",
    "Alternatively, buy husks from an ethnic grocery store or farmer's markets (especially Hispanic ones).",
    "Some regular supermarkets might also stock them.",
    "During sweet corn season, many grocery stores allow customers to husk their corn in the store, and are more than happy to allow you to bring away some husks for free..but just ask the produce manager nicely first!",
    "Soak the corn husks in warm water for a few hours.",
    "This will make them much more pliable and easier to work with.",
    "Lay down paper or cloth on a flat work surface.",
    "This tends to be a wet and messy project.",
    "Select four of the soaked husks.",
    "If you have one or two that have holes or brown spots on them, put them on the outside.",
    "Tie the husks together with some strong string.",
    "You could also use thick, strong rubber bands if you want.",
    "Flip two husks over so that the outside husks are now on the inside.",
    "Make the head.",
    "Take two small pieces of soaked husk.",
    "Wad each piece into a ball, and stuff it in between a larger husk to cover it like a ball.",
    "Tie some string under the ball.",
    "Attach to the body with the rubber band or string.",
    "Make arms by braiding three thin strands of husk together.",
    "Tie on both ends to stop the braid from unraveling.",
    "Slip each arm in between the husks and tie into place.",
    "Raffia \"corn\" dolly Assemble the items needed for this project.",
    "These are listed below under \"Things You'll Need\".",
    "Fold the bundle of raffia in half.",
    "It should be about 45 centimeter (17.7 in) in length.",
    "At the top of this folded raffia (the non-open end), tie a length of raffia around it.",
    "This should create a round ball shape, which becomes the dolly's head.",
    "Make the arms from a new bundle of raffia.",
    "Cut a small bundle to about 12 centimeter (4.7 in) in length.",
    "Push this through the body, just under the head.",
    "Tie a piece of raffia directly under the arms on the body to keep them in place.",
    "This also form's the corn dolly's torso.",
    "Wrap the arms and torso with raffia, going around and around until a smooth, totally covered look appears.",
    "Make the dolly's hair.",
    "Braid a long length of raffia.",
    "Tie little knots each end to prevent unraveling.",
    "Then, fold each end of the braid to meet at the middle, creating loops that look like little braids hanging down.",
    "Tie the braid to the dolly's head.",
    "Use raffia or string.",
    "Make a hat.",
    "Measure the dolly's head and make a doughnut shaped ring that would just fit around her head.",
    "Wrap raffia around and around this to make a well-covered ring.",
    "Place on the dolly's head.",
    "Decorate the dolly.",
    "You can display the dolly as she is now or add ornamental grasses and dried flowers through her skirt and on top of her head to improve her overall appearance.",
    "Use ribbon to prettify the corn dolly too."
  ],
  "tyn_section":[
    "Dry corn husk method:",
    "Dry corn husks",
    "Strong string",
    "Water",
    "Paper towels/newspaper",
    "Scissors",
    "Raffia corn dolly method:",
    "Raffia",
    "Ornamental grasses and dried flowers",
    "Thread, yarn or string for tying (or just use raffia strands)",
    "Ribbon for decoration"
  ],
  "tyn_model":[
    "raffia",
    "string",
    "corn husks",
    "corn",
    "corn husk",
    "sweet corn",
    "water",
    "paper",
    "rubber bands",
    "rubber band",
    "raffia \"corn",
    "corn dolly",
    "ribbon"
  ],
  "simple_metrics":{
    "r":0.1818181818,
    "p":0.1538461538,
    "f1":0.1666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6363636364,
    "p":0.6153846154,
    "f1":0.625698324
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7272727273,
    "p":0.7692307692,
    "f1":0.7476635514
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2727272727,
    "p":0.2307692308,
    "f1":0.25
  }
}