{
  "title":"How to Unclog Your Septic Tank",
  "url":"https://www.wikihow.com/Unclog-Your-Septic-Tank",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Breaking Apart Accessible Clogs",
      "steps":[
        {
          "headline":"Lift the tank’s access lid closest to your home to check the inlet pipe.",
          "description":"Look for the plastic or concrete cover in your yard that’s the closest to your home. Carefully lift the lid up and off of the tank so you can look inside. Look for the end of a white or green pipe that’s on the side of the tank closest to your home, and check if anything is blocking the end. If there is, then it may be the clog causing the problem. If the water level is below the inlet pipe, then the clog may be somewhere in the drain pipe between the septic tank and your home. If the water level is above the inlet but there isn’t anything blocking the end of the pipe, then the clog may be in the leach field. You may need to dig up the access lid with a shovel or use a pry bar to lift it up.Tip: Consult with your home’s as-built drawings, which are blueprints drawn after your home is built, or a septic service if you can’t find the access lid for your septic system."
        },
        {
          "headline":"Push the scum away with a pole or stick if it's stuck in the end of the inlet pipe.",
          "description":"The scum layer is the solid waste that builds on top of the septic tank. Use a long, solid piece of wood or metal and use it to move the scum down or to the side of the inlet pipe. Continue pushing as much of the scum from around the pipe as you can so it can keep filling your tank. Always wear gloves while working in your septic tank so you don’t get any bacteria or waste on your hands. If water starts flowing out of the pipe after pushing around the scum, then you’ve removed the clog."
        },
        {
          "headline":"Probe the end of the pipe with the pole or stick if the clog is deeper inside.",
          "description":"Feed the end of the stick or pole you’re using into the end of the pipe as far as you can. Scrape the sides of the pipe with the end of your probe and pull out any waste into the tank. If the clog is at the end of the pipe, you should be able to break it apart so the water begins flowing again. If water doesn’t flow out of the pipe, then the clog is deeper inside the pipe. You may not be able to feed your probe into the pipe depending on the pipe’s location."
        },
        {
          "headline":"Disinfect any tools you used with a 5:1 water and bleach solution.",
          "description":"Pour 1 part chlorine bleach and 5 parts clean water into a large bucket and stir it together. Dip your tools in the solution and let them soak for about 5 minutes to kill any bacteria that are left on the surface. Pour the liquid back into your septic tank when you're finished. Try to take a shower or bathe as soon as you can after working on your septic tank. Use bleach or laundry sanitizer when you wash your clothes just in case any bacteria got on them."
        },
        {
          "headline":"Put the access lid back on the septic tank if you fixed the problem.",
          "description":"Lift the lid and hold it over the hole leading into the septic tank. Slowly lower the lid down so it covers the hole completely and doesn't move around. If you haven't cleared the clog, leave the lid off so you can insert a mechanical auger. Never leave the septic tank open while you're not working on it so nothing can fall in."
        },
        {
          "headline":"Have a professional service pump your tank within 5 days if it was full.",
          "description":"Even after removing the clog, your tank is likely to back up again if the main tank is filled to the inlet pipe. Reach out to septic service professionals and let them know that the scum level has reached the pipe. Try to schedule them within the next 5 days, or else you increase the chances of the septic fluid traveling back up the pipes. The service will empty your septic tank so the scum can’t get into the pipes again. Getting a septic tank pumped usually costs between $75–200 USD depending on the size and amount they need to clean. Have your septic tank cleaned and emptied every 3–5 years, or when it gets full."
        }
      ]
    },
    {
      "name":"Using a Mechanical Auger",
      "steps":[
        {
          "headline":"Remove the septic tank access lid closest to your home to reach the inlet pipe.",
          "description":"If your septic tank has multiple access lids, choose the one that’s closest to your home since it’s most likely to have the inlet pipe. Lift or pry the lid off of the tank and set it aside while you’re working. Look inside of the tank for the end of a white or green pipe sticking out of the side that’s nearest to your home. If you aren’t sure where the access lids are for your tank, check your home’s as-built drawings or contact a professional service."
        },
        {
          "headline":"Feed the cutting blade of a mechanical auger into the end of the clogged pipe.",
          "description":"A mechanical auger has a long metal cable you put into your pipes that has a rotating bit to cut through the blockage. Start from the end of the clogged pipe or at an access point for the pipe, such as a cleanout port. Place the cutting blade of the auger inside the pipe that’s clogged, and push the line in about 1–2 feet (30–61 cm). You can buy a mechanical auger online or from your local hardware store. Check if a local hardware store offers equipment rentals to see if you can get an auger for a day without having to pay the full price."
        },
        {
          "headline":"Put on safety glasses and work gloves before you turn on the auger.",
          "description":"Since mechanical augers have rotating and moving parts, protect your eyes so you don’t injure yourself if you lose control of the machine. Put on thick work gloves to avoid spreading bacteria or getting hurt while you handle the line. Plug the auger into the nearest electrical outlet and turn the switch to the On or Forward position. You may need an extension cord to plug in the mechanical auger. Don’t run the auger without gloves or safety glasses since you could severely injure yourself. Never start the auger if you have the cutting end outside of the pipe since it will spin violently."
        },
        {
          "headline":"Continue feeding the auger deeper into the pipe so it breaks apart the clog.",
          "description":"Hold the auger’s line with both hands and guide it into the pipe until you hit resistance. If the resistance feels solid, try turning the line in your hands to see if it moves further inside since it may have hit a bend in the pipe. Otherwise, push and pull the auger in short, back and forth strokes to force the blockage apart. Keep forcing the auger into the clogged section of pipe until it moves through it easily. If you remove the clog, water will start flowing through the pipe again while you have the auger inside it. Mechanical augers come in different lengths, so if you aren’t able to reach the clog with the one you’re using, try renting the next longest size.Tip: Always hold the auger’s line with at least 1 hand while it’s running so it doesn’t spin or rotate as you try to feed it."
        },
        {
          "headline":"Turn the auger off before pulling it out of the pipe.",
          "description":"Flip the power switch on the auger to the Off or Reverse setting so you can remove it without difficulty. Guide the auger’s line back into the container with both hands, and pull it slowly back through the pipe. Carefully pull the end of the auger out of the pipe and clean off any debris or waste that’s stuck on the end with a hose or paper towel. Don’t take the auger out of the pipe while it’s still running since it could hurt you. Avoid touching the auger’s line with bare hands since it was just in a pipe that contains waste and harmful bacteria."
        },
        {
          "headline":"Clean the tools with a solution of 5 parts water and 1 part bleach.",
          "description":"Pour 1 part chlorine bleach and 5 parts clean water into a bucket and stir the solution together. Wipe the end of the auger with a cleaning rag to kill any bacteria left on the surface so you don't contaminate anything else. Pour the solution into your septic tank when you're finished. Don't dump the cleaning solution in another drain since it has harmful pathogens from your septic tank."
        },
        {
          "headline":"Put the lid back on your septic tank.",
          "description":"Grab the lid by the handles or sides and lift it off of the ground. Carefully lower the lid back on top of the hole leading into your septic tank so it's completely covered. Make sure the lid doesn't slide or shift, or else it could come off of the septic tank easily."
        }
      ]
    },
    {
      "name":"Preventing Clogs",
      "steps":[
        {
          "headline":"Avoid putting anything in your drains besides water and natural waste.",
          "description":"Septic tanks are only meant to handle water, human waste, and toilet paper, so other items can cause the entire system to clog. Throw away paper towels, wet wipes, food scraps, or other solid material in with the regular trash so it can’t block the pipes. Let other people in your home know what they can and cannot rinse down the drains so they don’t clog the pipes. Avoid using rinsing any harsh chemical cleaners down your drains since they could kill the natural bacteria in your septic tank that normally breaks down solid waste. Never rinse grease down your drains since it can solidify in your pipes and form clogs that are hard to remove.Tip: You do not need to add any additional natural enzymes or bacteria to your septic tank for breaking down solid waste. Any added enzymes won’t be as effective as the ones that naturally occur in the tank."
        },
        {
          "headline":"Use less water in your home so the septic system can drain properly.",
          "description":"Don’t run water in your home unless you have to, or else you could cause the tank to fill up too quickly. Try to limit how much water you use when you’re bathing or cleaning so you only have as much as you need. If you have any old or leaking fixtures, repair them or opt for more efficient systems, such as toilets that flush less water or faucets with aerators attached to them. Limiting your water use will also help you save money on your utility bill."
        },
        {
          "headline":"Don’t drive or plant over the area with your septic tank.",
          "description":"Heavy weight can cause pipes leading from your septic tank to collapse or break, so try to avoid using a vehicle over the area if you can. Plant roots can also grow into the pipes or septic tank and cause them to easily clog. If you want trees or plants, keep them at least 20–30 feet (6.1–9.1 m) away from your septic system so the roots aren’t able to grow inside. You can always cut roots out of your pipes with a mechanical auger, but they will grow back if left untreated. Root barriers from gardening stores kill roots on contact and can protect your septic system from overgrowth. Dig a trench that’s  2 feet (61 cm) deep around your septic system so it’s 3 feet (91 cm) away from any pipes. Place the root barrier vertically in the trench before filling the dirt back in."
        },
        {
          "headline":"Clean the effluent filter on the outlet pipe to improve drainage.",
          "description":"The effluent filter is a plastic cylinder in your septic tank’s outlet pipe that prevents solid waste from escaping. Open the access lid on the tank that’s furthest from your home. Look inside for a vertical white or green pipe that’s holding the filter and sticking out from the top layer of scum. Pull the filter straight out from the vertical pipe and rinse the waste back into the tank with a hose. Push the filter back into the pipe again so it continues blocking waste. Not every septic system will have an effluent filter. Check your filter any time you have your tank pumped or inspected so it’s less likely to clog."
        },
        {
          "headline":"Have your septic tank inspected by a professional every 3 years.",
          "description":"Septic tanks usually take about 3–5 years to fill, but it may vary depending on the size or amount of water you use. Contact a professional service to check the water levels and pipes for your system to see if you need to make any changes. If the service has any concerns, address them as soon as possible so you don’t have a faulty septic system."
        }
      ]
    }
  ],
  "text":" Breaking Apart Accessible Clogs Lift the tank’s access lid closest to your home to check the inlet pipe. Look for the plastic or concrete cover in your yard that’s the closest to your home. Carefully lift the lid up and off of the tank so you can look inside. Look for the end of a white or green pipe that’s on the side of the tank closest to your home, and check if anything is blocking the end. If there is, then it may be the clog causing the problem. If the water level is below the inlet pipe, then the clog may be somewhere in the drain pipe between the septic tank and your home. If the water level is above the inlet but there isn’t anything blocking the end of the pipe, then the clog may be in the leach field. You may need to dig up the access lid with a shovel or use a pry bar to lift it up.Tip: Consult with your home’s as-built drawings, which are blueprints drawn after your home is built, or a septic service if you can’t find the access lid for your septic system. Push the scum away with a pole or stick if it's stuck in the end of the inlet pipe. The scum layer is the solid waste that builds on top of the septic tank. Use a long, solid piece of wood or metal and use it to move the scum down or to the side of the inlet pipe. Continue pushing as much of the scum from around the pipe as you can so it can keep filling your tank. Always wear gloves while working in your septic tank so you don’t get any bacteria or waste on your hands. If water starts flowing out of the pipe after pushing around the scum, then you’ve removed the clog. Probe the end of the pipe with the pole or stick if the clog is deeper inside. Feed the end of the stick or pole you’re using into the end of the pipe as far as you can. Scrape the sides of the pipe with the end of your probe and pull out any waste into the tank. If the clog is at the end of the pipe, you should be able to break it apart so the water begins flowing again. If water doesn’t flow out of the pipe, then the clog is deeper inside the pipe. You may not be able to feed your probe into the pipe depending on the pipe’s location. Disinfect any tools you used with a 5:1 water and bleach solution. Pour 1 part chlorine bleach and 5 parts clean water into a large bucket and stir it together. Dip your tools in the solution and let them soak for about 5 minutes to kill any bacteria that are left on the surface. Pour the liquid back into your septic tank when you're finished. Try to take a shower or bathe as soon as you can after working on your septic tank. Use bleach or laundry sanitizer when you wash your clothes just in case any bacteria got on them. Put the access lid back on the septic tank if you fixed the problem. Lift the lid and hold it over the hole leading into the septic tank. Slowly lower the lid down so it covers the hole completely and doesn't move around. If you haven't cleared the clog, leave the lid off so you can insert a mechanical auger. Never leave the septic tank open while you're not working on it so nothing can fall in. Have a professional service pump your tank within 5 days if it was full. Even after removing the clog, your tank is likely to back up again if the main tank is filled to the inlet pipe. Reach out to septic service professionals and let them know that the scum level has reached the pipe. Try to schedule them within the next 5 days, or else you increase the chances of the septic fluid traveling back up the pipes. The service will empty your septic tank so the scum can’t get into the pipes again. Getting a septic tank pumped usually costs between $75–200 USD depending on the size and amount they need to clean. Have your septic tank cleaned and emptied every 3–5 years, or when it gets full. Using a Mechanical Auger Remove the septic tank access lid closest to your home to reach the inlet pipe. If your septic tank has multiple access lids, choose the one that’s closest to your home since it’s most likely to have the inlet pipe. Lift or pry the lid off of the tank and set it aside while you’re working. Look inside of the tank for the end of a white or green pipe sticking out of the side that’s nearest to your home. If you aren’t sure where the access lids are for your tank, check your home’s as-built drawings or contact a professional service. Feed the cutting blade of a mechanical auger into the end of the clogged pipe. A mechanical auger has a long metal cable you put into your pipes that has a rotating bit to cut through the blockage. Start from the end of the clogged pipe or at an access point for the pipe, such as a cleanout port. Place the cutting blade of the auger inside the pipe that’s clogged, and push the line in about 1–2 feet (30–61 cm). You can buy a mechanical auger online or from your local hardware store. Check if a local hardware store offers equipment rentals to see if you can get an auger for a day without having to pay the full price. Put on safety glasses and work gloves before you turn on the auger. Since mechanical augers have rotating and moving parts, protect your eyes so you don’t injure yourself if you lose control of the machine. Put on thick work gloves to avoid spreading bacteria or getting hurt while you handle the line. Plug the auger into the nearest electrical outlet and turn the switch to the On or Forward position. You may need an extension cord to plug in the mechanical auger. Don’t run the auger without gloves or safety glasses since you could severely injure yourself. Never start the auger if you have the cutting end outside of the pipe since it will spin violently. Continue feeding the auger deeper into the pipe so it breaks apart the clog. Hold the auger’s line with both hands and guide it into the pipe until you hit resistance. If the resistance feels solid, try turning the line in your hands to see if it moves further inside since it may have hit a bend in the pipe. Otherwise, push and pull the auger in short, back and forth strokes to force the blockage apart. Keep forcing the auger into the clogged section of pipe until it moves through it easily. If you remove the clog, water will start flowing through the pipe again while you have the auger inside it. Mechanical augers come in different lengths, so if you aren’t able to reach the clog with the one you’re using, try renting the next longest size.Tip: Always hold the auger’s line with at least 1 hand while it’s running so it doesn’t spin or rotate as you try to feed it. Turn the auger off before pulling it out of the pipe. Flip the power switch on the auger to the Off or Reverse setting so you can remove it without difficulty. Guide the auger’s line back into the container with both hands, and pull it slowly back through the pipe. Carefully pull the end of the auger out of the pipe and clean off any debris or waste that’s stuck on the end with a hose or paper towel. Don’t take the auger out of the pipe while it’s still running since it could hurt you. Avoid touching the auger’s line with bare hands since it was just in a pipe that contains waste and harmful bacteria. Clean the tools with a solution of 5 parts water and 1 part bleach. Pour 1 part chlorine bleach and 5 parts clean water into a bucket and stir the solution together. Wipe the end of the auger with a cleaning rag to kill any bacteria left on the surface so you don't contaminate anything else. Pour the solution into your septic tank when you're finished. Don't dump the cleaning solution in another drain since it has harmful pathogens from your septic tank. Put the lid back on your septic tank. Grab the lid by the handles or sides and lift it off of the ground. Carefully lower the lid back on top of the hole leading into your septic tank so it's completely covered. Make sure the lid doesn't slide or shift, or else it could come off of the septic tank easily. Preventing Clogs Avoid putting anything in your drains besides water and natural waste. Septic tanks are only meant to handle water, human waste, and toilet paper, so other items can cause the entire system to clog. Throw away paper towels, wet wipes, food scraps, or other solid material in with the regular trash so it can’t block the pipes. Let other people in your home know what they can and cannot rinse down the drains so they don’t clog the pipes. Avoid using rinsing any harsh chemical cleaners down your drains since they could kill the natural bacteria in your septic tank that normally breaks down solid waste. Never rinse grease down your drains since it can solidify in your pipes and form clogs that are hard to remove.Tip: You do not need to add any additional natural enzymes or bacteria to your septic tank for breaking down solid waste. Any added enzymes won’t be as effective as the ones that naturally occur in the tank. Use less water in your home so the septic system can drain properly. Don’t run water in your home unless you have to, or else you could cause the tank to fill up too quickly. Try to limit how much water you use when you’re bathing or cleaning so you only have as much as you need. If you have any old or leaking fixtures, repair them or opt for more efficient systems, such as toilets that flush less water or faucets with aerators attached to them. Limiting your water use will also help you save money on your utility bill. Don’t drive or plant over the area with your septic tank. Heavy weight can cause pipes leading from your septic tank to collapse or break, so try to avoid using a vehicle over the area if you can. Plant roots can also grow into the pipes or septic tank and cause them to easily clog. If you want trees or plants, keep them at least 20–30 feet (6.1–9.1 m) away from your septic system so the roots aren’t able to grow inside. You can always cut roots out of your pipes with a mechanical auger, but they will grow back if left untreated. Root barriers from gardening stores kill roots on contact and can protect your septic system from overgrowth. Dig a trench that’s  2 feet (61 cm) deep around your septic system so it’s 3 feet (91 cm) away from any pipes. Place the root barrier vertically in the trench before filling the dirt back in. Clean the effluent filter on the outlet pipe to improve drainage. The effluent filter is a plastic cylinder in your septic tank’s outlet pipe that prevents solid waste from escaping. Open the access lid on the tank that’s furthest from your home. Look inside for a vertical white or green pipe that’s holding the filter and sticking out from the top layer of scum. Pull the filter straight out from the vertical pipe and rinse the waste back into the tank with a hose. Push the filter back into the pipe again so it continues blocking waste. Not every septic system will have an effluent filter. Check your filter any time you have your tank pumped or inspected so it’s less likely to clog. Have your septic tank inspected by a professional every 3 years. Septic tanks usually take about 3–5 years to fill, but it may vary depending on the size or amount of water you use. Contact a professional service to check the water levels and pipes for your system to see if you need to make any changes. If the service has any concerns, address them as soon as possible so you don’t have a faulty septic system.",
  "sentences":[
    " Breaking Apart Accessible Clogs Lift the tank’s access lid closest to your home to check the inlet pipe.",
    "Look for the plastic or concrete cover in your yard that’s the closest to your home.",
    "Carefully lift the lid up and off of the tank so you can look inside.",
    "Look for the end of a white or green pipe that’s on the side of the tank closest to your home, and check if anything is blocking the end.",
    "If there is, then it may be the clog causing the problem.",
    "If the water level is below the inlet pipe, then the clog may be somewhere in the drain pipe between the septic tank and your home.",
    "If the water level is above the inlet but there isn’t anything blocking the end of the pipe, then the clog may be in the leach field.",
    "You may need to dig up the access lid with a shovel or use a pry bar to lift it up.Tip: Consult with your home’s as-built drawings, which are blueprints drawn after your home is built, or a septic service if you can’t find the access lid for your septic system.",
    "Push the scum away with a pole or stick if it's stuck in the end of the inlet pipe.",
    "The scum layer is the solid waste that builds on top of the septic tank.",
    "Use a long, solid piece of wood or metal and use it to move the scum down or to the side of the inlet pipe.",
    "Continue pushing as much of the scum from around the pipe as you can so it can keep filling your tank.",
    "Always wear gloves while working in your septic tank so you don’t get any bacteria or waste on your hands.",
    "If water starts flowing out of the pipe after pushing around the scum, then you’ve removed the clog.",
    "Probe the end of the pipe with the pole or stick if the clog is deeper inside.",
    "Feed the end of the stick or pole you’re using into the end of the pipe as far as you can.",
    "Scrape the sides of the pipe with the end of your probe and pull out any waste into the tank.",
    "If the clog is at the end of the pipe, you should be able to break it apart so the water begins flowing again.",
    "If water doesn’t flow out of the pipe, then the clog is deeper inside the pipe.",
    "You may not be able to feed your probe into the pipe depending on the pipe’s location.",
    "Disinfect any tools you used with a 5:1 water and bleach solution.",
    "Pour 1 part chlorine bleach and 5 parts clean water into a large bucket and stir it together.",
    "Dip your tools in the solution and let them soak for about 5 minutes to kill any bacteria that are left on the surface.",
    "Pour the liquid back into your septic tank when you're finished.",
    "Try to take a shower or bathe as soon as you can after working on your septic tank.",
    "Use bleach or laundry sanitizer when you wash your clothes just in case any bacteria got on them.",
    "Put the access lid back on the septic tank if you fixed the problem.",
    "Lift the lid and hold it over the hole leading into the septic tank.",
    "Slowly lower the lid down so it covers the hole completely and doesn't move around.",
    "If you haven't cleared the clog, leave the lid off so you can insert a mechanical auger.",
    "Never leave the septic tank open while you're not working on it so nothing can fall in.",
    "Have a professional service pump your tank within 5 days if it was full.",
    "Even after removing the clog, your tank is likely to back up again if the main tank is filled to the inlet pipe.",
    "Reach out to septic service professionals and let them know that the scum level has reached the pipe.",
    "Try to schedule them within the next 5 days, or else you increase the chances of the septic fluid traveling back up the pipes.",
    "The service will empty your septic tank so the scum can’t get into the pipes again.",
    "Getting a septic tank pumped usually costs between $75–200 USD depending on the size and amount they need to clean.",
    "Have your septic tank cleaned and emptied every 3–5 years, or when it gets full.",
    "Using a Mechanical Auger Remove the septic tank access lid closest to your home to reach the inlet pipe.",
    "If your septic tank has multiple access lids, choose the one that’s closest to your home since it’s most likely to have the inlet pipe.",
    "Lift or pry the lid off of the tank and set it aside while you’re working.",
    "Look inside of the tank for the end of a white or green pipe sticking out of the side that’s nearest to your home.",
    "If you aren’t sure where the access lids are for your tank, check your home’s as-built drawings or contact a professional service.",
    "Feed the cutting blade of a mechanical auger into the end of the clogged pipe.",
    "A mechanical auger has a long metal cable you put into your pipes that has a rotating bit to cut through the blockage.",
    "Start from the end of the clogged pipe or at an access point for the pipe, such as a cleanout port.",
    "Place the cutting blade of the auger inside the pipe that’s clogged, and push the line in about 1–2 feet (30–61 cm).",
    "You can buy a mechanical auger online or from your local hardware store.",
    "Check if a local hardware store offers equipment rentals to see if you can get an auger for a day without having to pay the full price.",
    "Put on safety glasses and work gloves before you turn on the auger.",
    "Since mechanical augers have rotating and moving parts, protect your eyes so you don’t injure yourself if you lose control of the machine.",
    "Put on thick work gloves to avoid spreading bacteria or getting hurt while you handle the line.",
    "Plug the auger into the nearest electrical outlet and turn the switch to the On or Forward position.",
    "You may need an extension cord to plug in the mechanical auger.",
    "Don’t run the auger without gloves or safety glasses since you could severely injure yourself.",
    "Never start the auger if you have the cutting end outside of the pipe since it will spin violently.",
    "Continue feeding the auger deeper into the pipe so it breaks apart the clog.",
    "Hold the auger’s line with both hands and guide it into the pipe until you hit resistance.",
    "If the resistance feels solid, try turning the line in your hands to see if it moves further inside since it may have hit a bend in the pipe.",
    "Otherwise, push and pull the auger in short, back and forth strokes to force the blockage apart.",
    "Keep forcing the auger into the clogged section of pipe until it moves through it easily.",
    "If you remove the clog, water will start flowing through the pipe again while you have the auger inside it.",
    "Mechanical augers come in different lengths, so if you aren’t able to reach the clog with the one you’re using, try renting the next longest size.Tip: Always hold the auger’s line with at least 1 hand while it’s running so it doesn’t spin or rotate as you try to feed it.",
    "Turn the auger off before pulling it out of the pipe.",
    "Flip the power switch on the auger to the Off or Reverse setting so you can remove it without difficulty.",
    "Guide the auger’s line back into the container with both hands, and pull it slowly back through the pipe.",
    "Carefully pull the end of the auger out of the pipe and clean off any debris or waste that’s stuck on the end with a hose or paper towel.",
    "Don’t take the auger out of the pipe while it’s still running since it could hurt you.",
    "Avoid touching the auger’s line with bare hands since it was just in a pipe that contains waste and harmful bacteria.",
    "Clean the tools with a solution of 5 parts water and 1 part bleach.",
    "Pour 1 part chlorine bleach and 5 parts clean water into a bucket and stir the solution together.",
    "Wipe the end of the auger with a cleaning rag to kill any bacteria left on the surface so you don't contaminate anything else.",
    "Pour the solution into your septic tank when you're finished.",
    "Don't dump the cleaning solution in another drain since it has harmful pathogens from your septic tank.",
    "Put the lid back on your septic tank.",
    "Grab the lid by the handles or sides and lift it off of the ground.",
    "Carefully lower the lid back on top of the hole leading into your septic tank so it's completely covered.",
    "Make sure the lid doesn't slide or shift, or else it could come off of the septic tank easily.",
    "Preventing Clogs Avoid putting anything in your drains besides water and natural waste.",
    "Septic tanks are only meant to handle water, human waste, and toilet paper, so other items can cause the entire system to clog.",
    "Throw away paper towels, wet wipes, food scraps, or other solid material in with the regular trash so it can’t block the pipes.",
    "Let other people in your home know what they can and cannot rinse down the drains so they don’t clog the pipes.",
    "Avoid using rinsing any harsh chemical cleaners down your drains since they could kill the natural bacteria in your septic tank that normally breaks down solid waste.",
    "Never rinse grease down your drains since it can solidify in your pipes and form clogs that are hard to remove.Tip: You do not need to add any additional natural enzymes or bacteria to your septic tank for breaking down solid waste.",
    "Any added enzymes won’t be as effective as the ones that naturally occur in the tank.",
    "Use less water in your home so the septic system can drain properly.",
    "Don’t run water in your home unless you have to, or else you could cause the tank to fill up too quickly.",
    "Try to limit how much water you use when you’re bathing or cleaning so you only have as much as you need.",
    "If you have any old or leaking fixtures, repair them or opt for more efficient systems, such as toilets that flush less water or faucets with aerators attached to them.",
    "Limiting your water use will also help you save money on your utility bill.",
    "Don’t drive or plant over the area with your septic tank.",
    "Heavy weight can cause pipes leading from your septic tank to collapse or break, so try to avoid using a vehicle over the area if you can.",
    "Plant roots can also grow into the pipes or septic tank and cause them to easily clog.",
    "If you want trees or plants, keep them at least 20–30 feet (6.1–9.1 m) away from your septic system so the roots aren’t able to grow inside.",
    "You can always cut roots out of your pipes with a mechanical auger, but they will grow back if left untreated.",
    "Root barriers from gardening stores kill roots on contact and can protect your septic system from overgrowth.",
    "Dig a trench that’s  2 feet (61 cm) deep around your septic system so it’s 3 feet (91 cm) away from any pipes.",
    "Place the root barrier vertically in the trench before filling the dirt back in.",
    "Clean the effluent filter on the outlet pipe to improve drainage.",
    "The effluent filter is a plastic cylinder in your septic tank’s outlet pipe that prevents solid waste from escaping.",
    "Open the access lid on the tank that’s furthest from your home.",
    "Look inside for a vertical white or green pipe that’s holding the filter and sticking out from the top layer of scum.",
    "Pull the filter straight out from the vertical pipe and rinse the waste back into the tank with a hose.",
    "Push the filter back into the pipe again so it continues blocking waste.",
    "Not every septic system will have an effluent filter.",
    "Check your filter any time you have your tank pumped or inspected so it’s less likely to clog.",
    "Have your septic tank inspected by a professional every 3 years.",
    "Septic tanks usually take about 3–5 years to fill, but it may vary depending on the size or amount of water you use.",
    "Contact a professional service to check the water levels and pipes for your system to see if you need to make any changes.",
    "If the service has any concerns, address them as soon as possible so you don’t have a faulty septic system."
  ],
  "tyn_section":[
    "Gloves",
    "Pole or stick",
    "Mechanical auger",
    "Safety glasses",
    "Work gloves",
    "Hose",
    "Paper towel",
    "Garden hose"
  ],
  "tyn_model":[
    "auger",
    "water",
    "septic tank",
    "mechanical auger",
    "bleach",
    "tank",
    "septic service",
    "pole",
    "chlorine bleach",
    "bucket",
    "augers",
    "hose",
    "effluent filter",
    "shovel",
    "gloves",
    "laundry sanitizer",
    "septic fluid",
    "work gloves",
    "electrical outlet",
    "extension cord",
    "container",
    "clean water",
    "cleaning rag",
    "septic tanks",
    "toilet paper",
    "grease",
    "toilets",
    "plant",
    "septic system"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1379310345,
    "f1":0.2162162162,
    "avg_pos":0.4827586207
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.1724137931,
    "f1":0.2702702703
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.2413793103,
    "f1":0.3783783784
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1379310345,
    "f1":0.2162162162
  }
}