{
  "title":"How to Dress a Salad",
  "url":"https://www.wikihow.com/Dress-a-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Salad Dressings"
  ],
  "methods":[
    {
      "name":"Using a Light Dressing",
      "steps":[
        {
          "headline":"Pour the dressing into the bottom of a mixing bowl.",
          "description":"Swirl the bowl so the dressing lines the bottom and sides. A lighter dressing mixes easily and this way you know how much dressing you're using right away. Start with a small amount of dressing. It's easier to add more, but difficult to remove. This works best with lighter dressings, like Italian or vinaigrettes."
        },
        {
          "headline":"Put your salad greens in the bowl before any toppings.",
          "description":"Layer your ingredients so the heavier, sturdier ingredients are on the bottom of the bowl. The greens will absorb most of the dressing's flavor and won't drown out  your other toppings. Leave out crunchy toppings that could get soggy, like croutons or bacon bits."
        },
        {
          "headline":"Stir the salad gently with your hands.",
          "description":"Wash your hands before handling your salad. Carefully rotate the salad between your fingers so your dressing coats the salad evenly. You want your greens to have a light coating rather than being drenched. Tongs will bruise and brown your greens, making them less crisp. Wear gloves if you want to avoid getting your hands messy."
        },
        {
          "headline":"Add any additional toppings after you mix your salad.",
          "description":"If you want to add crunch to your salad with croutons, wait until after you've mixed in your dressing. This prevents them from getting soggy before you eat them."
        }
      ]
    },
    {
      "name":"Mixing in a Heavier Dressing",
      "steps":[
        {
          "headline":"Put your greens in the bowl first.",
          "description":"Thicker dressings work best with sturdy greens like iceberg lettuce, endive, or kale. Only adding your base greens will help coat the main part of your salad with dressing without overpowering any of the toppings. Do this if you're using creamy dressings, such as blue cheese, Caesar, or ranch. Dry your greens before mixing them in or else the dressing will run off of them."
        },
        {
          "headline":"Add a small amount of the dressing and mix it in with your hands.",
          "description":"Work with ⁄2 tablespoon (7.4 ml) of the dressing at a time. Use your hands to gently toss the dressing through the greens until they are evenly coated. If some of the greens are still dry after adding dressing, put in another ⁄2 tablespoon (7.4 ml). Don't add too much dressing right away or your salad may get soggy."
        },
        {
          "headline":"Pour your toppings on the salad once the dressing has been mixed.",
          "description":"After you coat the greens with a thin layer of dressing, put in whatever toppings you want to include. Give your salad a final toss to get some of the dressing on your toppings. Add a pinch of salt to your salad to bring out the flavors and soften tougher greens."
        }
      ]
    },
    {
      "name":"Making Your Own Dressing",
      "steps":[
        {
          "headline":"Mix together a simple vinaigrette.",
          "description":"Combine 3 tablespoons (44 ml) of olive oil with 1 tablespoon (15 ml) of your choice of vinegar. You could use balsamic, white wine, or plain white vinegar for your dressing. Whisk the oil and vinegar together to combine them. Add salt and pepper a pinch at a time, whisking them in thoroughly with your dressing. Taste the vinaigrette when it's mixed and adjust any flavors. Olive oil can be substituted with any other cooking oil, such as walnut, avocado, or coconut oil. Add lemon or lime juice to your vinaigrette to give it an acidic kick. The oil and vinegar will separate if you let it sit. If you make more vinaigrette than you plan on using right away, make sure to mix it together before using it again."
        },
        {
          "headline":"Whisk together homemade buttermilk ranch dressing.",
          "description":"Put mayonnaise, sour cream, and buttermilk into a large mixing bowl and whisk them together until it has a smooth consistency. Add the dill, parsley, chives, onion and garlic powder, sea salt and pepper. Mix the herbs and spices until they are evenly distributed. Add the lemon juice to the dressing and whisk it one final time. Substitute white vinegar for the lemon juice if you want. Either will add tang to your dressing. Store the dressing is a sealed jar for 1 week in the fridge."
        },
        {
          "headline":"Make an Italian dressing for a zesty flavor.",
          "description":"Place the olive oil, vinegar, water, honey, and lemon juice in a jar or resealable container. Mix the parmesan cheese, garlic salt, parsley, basil, oregano, and red pepper flakes in a separate bowl before adding them to the liquids. Shake the container to mix the dressing together. Taste the dressing and add salt and pepper to adjust the flavor. Adjust the amount of honey you add if you want your dressing to be more or less acidic. Keep the dressing in the fridge, but allow it to come to room temperature before serving it."
        }
      ]
    },
    {
      "name":"Preparing Your Salad from Scratch",
      "steps":[
        {
          "headline":"Chop your greens using a chef's knife.",
          "description":"You can use spinach, arugula, or classic iceberg lettuce as the base for your salad. Cut the pieces of lettuce into ⁄2 inch (1.3 cm) squares for a chopped salad or leave it larger to look more natural. Avoid using any limp or yellowed greens."
        },
        {
          "headline":"Dry the greens using a salad spinner or a plastic bag.",
          "description":"Shake any excess water off the leaves before placing them in the spinner or bag. Pull the handle on the spinner to remove the rest of the water from your greens. Continue spinning them until they are dry. When using a plastic bag, line the bottom of the bag with 2-3 paper towels. Put your greens inside it and spin the bag over your head several times until the salad is dry. Refrigerate an undressed salad for up to 3 hours to keep it crisp. You can either transfer the salad to a different bowl or keep it in the salad spinner."
        },
        {
          "headline":"Put bacon or chicken on your salad for a more filling meal.",
          "description":"Cook the meat thoroughly before adding it on top of your salad. Leave the meat in strips for a fancy looking topping or cube it to mix it into the rest of the salad. Precooked bacon bits can be purchased at the grocery store either in the spice section or near the salad dressings. Use grilled meats rather than fried meats to keep your salads healthy."
        },
        {
          "headline":"Sprinkle walnuts on top to add fat and non-meat protein.",
          "description":"You can use either whole walnuts or chop them to spread them throughout your salad. Place a few walnuts on the plate so you have a source of healthy fats and proteins in your meal. Use candied walnuts to add a hint of sweetness to your salad!"
        },
        {
          "headline":"Line the salad with fresh fruit.",
          "description":"Slice blueberries, strawberries, or oranges to line the outside of the salad if it's on a plate or on top if it's in a bowl. Adding fruit will give the salad some sweetness as well as some acidity. Adding fruit will add color and brightness to the plate as well as enhance the flavor of your salad"
        },
        {
          "headline":"Crumble feta or goat cheese on top to add fat to the dish.",
          "description":"Pinch the feta in between your fingers to evenly sprinkle it on top of your salad. The cheese will add a flavor of creaminess and help further balance the dish. Use shredded cheddar or parmesan as an alternative to feta or goat cheese."
        },
        {
          "headline":"Top the salad with croutons for crunch.",
          "description":"Croutons are cubed pieces of baked bread often spiced with herbs to add flavor and crunch to your salads. Use a small handful after you've dressed your salad to give your salad a different texture. You can either buy pre-packaged croutons or make your own at home."
        }
      ]
    }
  ],
  "text":" Using a Light Dressing Pour the dressing into the bottom of a mixing bowl. Swirl the bowl so the dressing lines the bottom and sides. A lighter dressing mixes easily and this way you know how much dressing you're using right away. Start with a small amount of dressing. It's easier to add more, but difficult to remove. This works best with lighter dressings, like Italian or vinaigrettes. Put your salad greens in the bowl before any toppings. Layer your ingredients so the heavier, sturdier ingredients are on the bottom of the bowl. The greens will absorb most of the dressing's flavor and won't drown out  your other toppings. Leave out crunchy toppings that could get soggy, like croutons or bacon bits. Stir the salad gently with your hands. Wash your hands before handling your salad. Carefully rotate the salad between your fingers so your dressing coats the salad evenly. You want your greens to have a light coating rather than being drenched. Tongs will bruise and brown your greens, making them less crisp. Wear gloves if you want to avoid getting your hands messy. Add any additional toppings after you mix your salad. If you want to add crunch to your salad with croutons, wait until after you've mixed in your dressing. This prevents them from getting soggy before you eat them. Mixing in a Heavier Dressing Put your greens in the bowl first. Thicker dressings work best with sturdy greens like iceberg lettuce, endive, or kale. Only adding your base greens will help coat the main part of your salad with dressing without overpowering any of the toppings. Do this if you're using creamy dressings, such as blue cheese, Caesar, or ranch. Dry your greens before mixing them in or else the dressing will run off of them. Add a small amount of the dressing and mix it in with your hands. Work with ⁄2 tablespoon (7.4 ml) of the dressing at a time. Use your hands to gently toss the dressing through the greens until they are evenly coated. If some of the greens are still dry after adding dressing, put in another ⁄2 tablespoon (7.4 ml). Don't add too much dressing right away or your salad may get soggy. Pour your toppings on the salad once the dressing has been mixed. After you coat the greens with a thin layer of dressing, put in whatever toppings you want to include. Give your salad a final toss to get some of the dressing on your toppings. Add a pinch of salt to your salad to bring out the flavors and soften tougher greens. Making Your Own Dressing Mix together a simple vinaigrette. Combine 3 tablespoons (44 ml) of olive oil with 1 tablespoon (15 ml) of your choice of vinegar. You could use balsamic, white wine, or plain white vinegar for your dressing. Whisk the oil and vinegar together to combine them. Add salt and pepper a pinch at a time, whisking them in thoroughly with your dressing. Taste the vinaigrette when it's mixed and adjust any flavors. Olive oil can be substituted with any other cooking oil, such as walnut, avocado, or coconut oil. Add lemon or lime juice to your vinaigrette to give it an acidic kick. The oil and vinegar will separate if you let it sit. If you make more vinaigrette than you plan on using right away, make sure to mix it together before using it again. Whisk together homemade buttermilk ranch dressing. Put mayonnaise, sour cream, and buttermilk into a large mixing bowl and whisk them together until it has a smooth consistency. Add the dill, parsley, chives, onion and garlic powder, sea salt and pepper. Mix the herbs and spices until they are evenly distributed. Add the lemon juice to the dressing and whisk it one final time. Substitute white vinegar for the lemon juice if you want. Either will add tang to your dressing. Store the dressing is a sealed jar for 1 week in the fridge. Make an Italian dressing for a zesty flavor. Place the olive oil, vinegar, water, honey, and lemon juice in a jar or resealable container. Mix the parmesan cheese, garlic salt, parsley, basil, oregano, and red pepper flakes in a separate bowl before adding them to the liquids. Shake the container to mix the dressing together. Taste the dressing and add salt and pepper to adjust the flavor. Adjust the amount of honey you add if you want your dressing to be more or less acidic. Keep the dressing in the fridge, but allow it to come to room temperature before serving it. Preparing Your Salad from Scratch Chop your greens using a chef's knife. You can use spinach, arugula, or classic iceberg lettuce as the base for your salad. Cut the pieces of lettuce into ⁄2 inch (1.3 cm) squares for a chopped salad or leave it larger to look more natural. Avoid using any limp or yellowed greens. Dry the greens using a salad spinner or a plastic bag. Shake any excess water off the leaves before placing them in the spinner or bag. Pull the handle on the spinner to remove the rest of the water from your greens. Continue spinning them until they are dry. When using a plastic bag, line the bottom of the bag with 2-3 paper towels. Put your greens inside it and spin the bag over your head several times until the salad is dry. Refrigerate an undressed salad for up to 3 hours to keep it crisp. You can either transfer the salad to a different bowl or keep it in the salad spinner. Put bacon or chicken on your salad for a more filling meal. Cook the meat thoroughly before adding it on top of your salad. Leave the meat in strips for a fancy looking topping or cube it to mix it into the rest of the salad. Precooked bacon bits can be purchased at the grocery store either in the spice section or near the salad dressings. Use grilled meats rather than fried meats to keep your salads healthy. Sprinkle walnuts on top to add fat and non-meat protein. You can use either whole walnuts or chop them to spread them throughout your salad. Place a few walnuts on the plate so you have a source of healthy fats and proteins in your meal. Use candied walnuts to add a hint of sweetness to your salad! Line the salad with fresh fruit. Slice blueberries, strawberries, or oranges to line the outside of the salad if it's on a plate or on top if it's in a bowl. Adding fruit will give the salad some sweetness as well as some acidity. Adding fruit will add color and brightness to the plate as well as enhance the flavor of your salad Crumble feta or goat cheese on top to add fat to the dish. Pinch the feta in between your fingers to evenly sprinkle it on top of your salad. The cheese will add a flavor of creaminess and help further balance the dish. Use shredded cheddar or parmesan as an alternative to feta or goat cheese. Top the salad with croutons for crunch. Croutons are cubed pieces of baked bread often spiced with herbs to add flavor and crunch to your salads. Use a small handful after you've dressed your salad to give your salad a different texture. You can either buy pre-packaged croutons or make your own at home.",
  "sentences":[
    " Using a Light Dressing Pour the dressing into the bottom of a mixing bowl.",
    "Swirl the bowl so the dressing lines the bottom and sides.",
    "A lighter dressing mixes easily and this way you know how much dressing you're using right away.",
    "Start with a small amount of dressing.",
    "It's easier to add more, but difficult to remove.",
    "This works best with lighter dressings, like Italian or vinaigrettes.",
    "Put your salad greens in the bowl before any toppings.",
    "Layer your ingredients so the heavier, sturdier ingredients are on the bottom of the bowl.",
    "The greens will absorb most of the dressing's flavor and won't drown out  your other toppings.",
    "Leave out crunchy toppings that could get soggy, like croutons or bacon bits.",
    "Stir the salad gently with your hands.",
    "Wash your hands before handling your salad.",
    "Carefully rotate the salad between your fingers so your dressing coats the salad evenly.",
    "You want your greens to have a light coating rather than being drenched.",
    "Tongs will bruise and brown your greens, making them less crisp.",
    "Wear gloves if you want to avoid getting your hands messy.",
    "Add any additional toppings after you mix your salad.",
    "If you want to add crunch to your salad with croutons, wait until after you've mixed in your dressing.",
    "This prevents them from getting soggy before you eat them.",
    "Mixing in a Heavier Dressing Put your greens in the bowl first.",
    "Thicker dressings work best with sturdy greens like iceberg lettuce, endive, or kale.",
    "Only adding your base greens will help coat the main part of your salad with dressing without overpowering any of the toppings.",
    "Do this if you're using creamy dressings, such as blue cheese, Caesar, or ranch.",
    "Dry your greens before mixing them in or else the dressing will run off of them.",
    "Add a small amount of the dressing and mix it in with your hands.",
    "Work with ⁄2 tablespoon (7.4 ml) of the dressing at a time.",
    "Use your hands to gently toss the dressing through the greens until they are evenly coated.",
    "If some of the greens are still dry after adding dressing, put in another ⁄2 tablespoon (7.4 ml).",
    "Don't add too much dressing right away or your salad may get soggy.",
    "Pour your toppings on the salad once the dressing has been mixed.",
    "After you coat the greens with a thin layer of dressing, put in whatever toppings you want to include.",
    "Give your salad a final toss to get some of the dressing on your toppings.",
    "Add a pinch of salt to your salad to bring out the flavors and soften tougher greens.",
    "Making Your Own Dressing Mix together a simple vinaigrette.",
    "Combine 3 tablespoons (44 ml) of olive oil with 1 tablespoon (15 ml) of your choice of vinegar.",
    "You could use balsamic, white wine, or plain white vinegar for your dressing.",
    "Whisk the oil and vinegar together to combine them.",
    "Add salt and pepper a pinch at a time, whisking them in thoroughly with your dressing.",
    "Taste the vinaigrette when it's mixed and adjust any flavors.",
    "Olive oil can be substituted with any other cooking oil, such as walnut, avocado, or coconut oil.",
    "Add lemon or lime juice to your vinaigrette to give it an acidic kick.",
    "The oil and vinegar will separate if you let it sit.",
    "If you make more vinaigrette than you plan on using right away, make sure to mix it together before using it again.",
    "Whisk together homemade buttermilk ranch dressing.",
    "Put mayonnaise, sour cream, and buttermilk into a large mixing bowl and whisk them together until it has a smooth consistency.",
    "Add the dill, parsley, chives, onion and garlic powder, sea salt and pepper.",
    "Mix the herbs and spices until they are evenly distributed.",
    "Add the lemon juice to the dressing and whisk it one final time.",
    "Substitute white vinegar for the lemon juice if you want.",
    "Either will add tang to your dressing.",
    "Store the dressing is a sealed jar for 1 week in the fridge.",
    "Make an Italian dressing for a zesty flavor.",
    "Place the olive oil, vinegar, water, honey, and lemon juice in a jar or resealable container.",
    "Mix the parmesan cheese, garlic salt, parsley, basil, oregano, and red pepper flakes in a separate bowl before adding them to the liquids.",
    "Shake the container to mix the dressing together.",
    "Taste the dressing and add salt and pepper to adjust the flavor.",
    "Adjust the amount of honey you add if you want your dressing to be more or less acidic.",
    "Keep the dressing in the fridge, but allow it to come to room temperature before serving it.",
    "Preparing Your Salad from Scratch Chop your greens using a chef's knife.",
    "You can use spinach, arugula, or classic iceberg lettuce as the base for your salad.",
    "Cut the pieces of lettuce into ⁄2 inch (1.3 cm) squares for a chopped salad or leave it larger to look more natural.",
    "Avoid using any limp or yellowed greens.",
    "Dry the greens using a salad spinner or a plastic bag.",
    "Shake any excess water off the leaves before placing them in the spinner or bag.",
    "Pull the handle on the spinner to remove the rest of the water from your greens.",
    "Continue spinning them until they are dry.",
    "When using a plastic bag, line the bottom of the bag with 2-3 paper towels.",
    "Put your greens inside it and spin the bag over your head several times until the salad is dry.",
    "Refrigerate an undressed salad for up to 3 hours to keep it crisp.",
    "You can either transfer the salad to a different bowl or keep it in the salad spinner.",
    "Put bacon or chicken on your salad for a more filling meal.",
    "Cook the meat thoroughly before adding it on top of your salad.",
    "Leave the meat in strips for a fancy looking topping or cube it to mix it into the rest of the salad.",
    "Precooked bacon bits can be purchased at the grocery store either in the spice section or near the salad dressings.",
    "Use grilled meats rather than fried meats to keep your salads healthy.",
    "Sprinkle walnuts on top to add fat and non-meat protein.",
    "You can use either whole walnuts or chop them to spread them throughout your salad.",
    "Place a few walnuts on the plate so you have a source of healthy fats and proteins in your meal.",
    "Use candied walnuts to add a hint of sweetness to your salad!",
    "Line the salad with fresh fruit.",
    "Slice blueberries, strawberries, or oranges to line the outside of the salad if it's on a plate or on top if it's in a bowl.",
    "Adding fruit will give the salad some sweetness as well as some acidity.",
    "Adding fruit will add color and brightness to the plate as well as enhance the flavor of your salad Crumble feta or goat cheese on top to add fat to the dish.",
    "Pinch the feta in between your fingers to evenly sprinkle it on top of your salad.",
    "The cheese will add a flavor of creaminess and help further balance the dish.",
    "Use shredded cheddar or parmesan as an alternative to feta or goat cheese.",
    "Top the salad with croutons for crunch.",
    "Croutons are cubed pieces of baked bread often spiced with herbs to add flavor and crunch to your salads.",
    "Use a small handful after you've dressed your salad to give your salad a different texture.",
    "You can either buy pre-packaged croutons or make your own at home."
  ],
  "tyn_section":[
    "Mixing bowl",
    "Measuring spoons",
    "Whisk",
    "Chef's knife",
    "Salad spinner or plastic bag",
    "Paper towel"
  ],
  "tyn_model":[
    "dressing",
    "bowl",
    "croutons",
    "vinegar",
    "walnuts",
    "olive oil",
    "lemon juice",
    "water",
    "fruit",
    "salad",
    "salt",
    "white vinegar",
    "oil",
    "pepper",
    "parsley",
    "honey",
    "salad spinner",
    "spinner",
    "bacon",
    "goat cheese",
    "feta",
    "mixing bowl",
    "salad greens",
    "endive",
    "kale",
    "blue cheese",
    "balsamic,",
    "white wine",
    "cooking oil",
    "coconut oil",
    "buttermilk ranch dressing",
    "mayonnaise",
    "sour cream",
    "buttermilk",
    "large mixing bowl",
    "dill",
    "chives",
    "onion",
    "garlic powder",
    "sea salt",
    "herbs",
    "spices",
    "resealable container",
    "parmesan cheese",
    "garlic salt",
    "basil",
    "oregano",
    "red pepper",
    "salt and pepper",
    "chef's knife",
    "spinach",
    "arugula",
    "lettuce",
    "plastic bag",
    "paper towels",
    "salad dressings",
    "blueberries",
    "strawberries",
    "oranges",
    "parmesan"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0333333333,
    "f1":0.0606060606,
    "avg_pos":0.35
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0666666667,
    "f1":0.1111111111
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1166666667,
    "f1":0.1985815603
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.05,
    "f1":0.0869565217
  }
}