{
  "title":"How to Make an Origami Sanbo",
  "url":"https://www.wikihow.com/Make-an-Origami-Sanbo",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Origami"
  ],
  "steps":[
    {
      "headline":"Start with a square piece of paper.",
      "description":"If you made the square from a rectangular piece of paper, there may be a diagonal crease. If so, you can try to flatten it, but you can disregard it as it won't affect the final product."
    },
    {
      "headline":"Fold the paper halfway vertically and horizontally.",
      "description":"They should both be valley folds. Crease well and unfold."
    },
    {
      "headline":"Fold all of the corners to meet the middle point.",
      "description":""
    },
    {
      "headline":"Fold the paper horizontally and vertically again, this time as mountain folds.",
      "description":"Crease well and unfold."
    },
    {
      "headline":"Flip the paper over and rotate it so one point is facing you.",
      "description":""
    },
    {
      "headline":"Grab the point on the left and right and collapse them into the center.",
      "description":"Flatten them on top of one corner and bring the other point on top."
    },
    {
      "headline":"Make sure that the creases on the square are pressed down well enough.",
      "description":"You may want to use your fingernails, a pencil, or another sturdy object to press them down."
    },
    {
      "headline":"Open up the two flaps atop the square and pull them outward.",
      "description":""
    },
    {
      "headline":"Pull up the flaps and flatten them.",
      "description":"They should form a rectangle. Repeat these last two steps on the other side of the paper."
    },
    {
      "headline":"Grab the top flap on the right and move it over so it's on top of the other side of the paper.",
      "description":""
    },
    {
      "headline":"Flip to the other side of the paper and repeat.",
      "description":""
    },
    {
      "headline":"Rotate the paper, so the triangular tip is pointing up.",
      "description":""
    },
    {
      "headline":"Fold each side in so it means the center crease.",
      "description":""
    },
    {
      "headline":"Flip to the other side of the paper and repeat.",
      "description":""
    },
    {
      "headline":"Fold down the large flap in the upper half of the paper down so its tip meets the bottom.",
      "description":"Repeat for each side."
    },
    {
      "headline":"Pick up the figure and grab the flaps you folded down in the previous step.",
      "description":"Position them so that they stick out and pull them, opening up the box. Press the creases in the inside outward so it stays open. Little items such as tiny candies can now be added to the finished sanbo."
    }
  ],
  "text":" Start with a square piece of paper. If you made the square from a rectangular piece of paper, there may be a diagonal crease. If so, you can try to flatten it, but you can disregard it as it won't affect the final product. Fold the paper halfway vertically and horizontally. They should both be valley folds. Crease well and unfold. Fold all of the corners to meet the middle point.  Fold the paper horizontally and vertically again, this time as mountain folds. Crease well and unfold. Flip the paper over and rotate it so one point is facing you.  Grab the point on the left and right and collapse them into the center. Flatten them on top of one corner and bring the other point on top. Make sure that the creases on the square are pressed down well enough. You may want to use your fingernails, a pencil, or another sturdy object to press them down. Open up the two flaps atop the square and pull them outward.  Pull up the flaps and flatten them. They should form a rectangle. Repeat these last two steps on the other side of the paper. Grab the top flap on the right and move it over so it's on top of the other side of the paper.  Flip to the other side of the paper and repeat.  Rotate the paper, so the triangular tip is pointing up.  Fold each side in so it means the center crease.  Flip to the other side of the paper and repeat.  Fold down the large flap in the upper half of the paper down so its tip meets the bottom. Repeat for each side. Pick up the figure and grab the flaps you folded down in the previous step. Position them so that they stick out and pull them, opening up the box. Press the creases in the inside outward so it stays open. Little items such as tiny candies can now be added to the finished sanbo.",
  "sentences":[
    " Start with a square piece of paper.",
    "If you made the square from a rectangular piece of paper, there may be a diagonal crease.",
    "If so, you can try to flatten it, but you can disregard it as it won't affect the final product.",
    "Fold the paper halfway vertically and horizontally.",
    "They should both be valley folds.",
    "Crease well and unfold.",
    "Fold all of the corners to meet the middle point.",
    "Fold the paper horizontally and vertically again, this time as mountain folds.",
    "Crease well and unfold.",
    "Flip the paper over and rotate it so one point is facing you.",
    "Grab the point on the left and right and collapse them into the center.",
    "Flatten them on top of one corner and bring the other point on top.",
    "Make sure that the creases on the square are pressed down well enough.",
    "You may want to use your fingernails, a pencil, or another sturdy object to press them down.",
    "Open up the two flaps atop the square and pull them outward.",
    "Pull up the flaps and flatten them.",
    "They should form a rectangle.",
    "Repeat these last two steps on the other side of the paper.",
    "Grab the top flap on the right and move it over so it's on top of the other side of the paper.",
    "Flip to the other side of the paper and repeat.",
    "Rotate the paper, so the triangular tip is pointing up.",
    "Fold each side in so it means the center crease.",
    "Flip to the other side of the paper and repeat.",
    "Fold down the large flap in the upper half of the paper down so its tip meets the bottom.",
    "Repeat for each side.",
    "Pick up the figure and grab the flaps you folded down in the previous step.",
    "Position them so that they stick out and pull them, opening up the box.",
    "Press the creases in the inside outward so it stays open.",
    "Little items such as tiny candies can now be added to the finished sanbo."
  ],
  "tyn_section":[
    "Origami paper"
  ],
  "tyn_model":[
    "paper",
    "pencil"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.5,
    "f1":0.6666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.5,
    "f1":0.6666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}