{
  "title":"How to Knit",
  "url":"https://www.wikihow.com/Knit",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Knitting"
  ],
  "parts":[
    {
      "name":"Casting On",
      "steps":[
        {
          "headline":"Choose a ball of yarn and a pair of knitting needles.",
          "description":"Visit your local craft supply store or check out an online store to find a ball of yarn and a pair of knitting needles. Yarn comes in a wide range of textures, weights, and colors, so choose a yarn that appeals to you. Then, check the label on the yarn for a knitting needle size recommendation. For example, if you opt for a medium-weight yarn, then you will need a pair of US size 7, 8, or 9 (4.5, 5.0. or 5.5 mm) needles. You can knit with straight needles or circular needles. Circular needles are helpful for holding a large number of stitches, such as for a blanket, and you can also knit in the round with circular needles. Knitting needles are made from a variety of materials, including aluminum, plastic, and bamboo. The material is more a matter of personal preference than anything else. Tip: You may want to follow a beginner’s pattern when you are ready to knit your first project. Try making a dishcloth or a beanie for a quick and easy knitting project."
        },
        {
          "headline":"Make a slipknot for your first cast on stitch.",
          "description":"Loop the yarn around your index and middle finger 2 times. Then, pull the first loop over the second loop. Tug on the tail of the yarn to tighten the knot around the base of the loop. Then, slip the loop onto a knitting needle and tug the tail more to secure the knot. The slipknot counts as your first cast on stitch, so make sure to include it if you are counting stitches."
        },
        {
          "headline":"Hold the needle with the slipknot on it in your right hand.",
          "description":"Position the slipknot about 0.5 in (1.3 cm) from the tip. Grip the needle at this point with your right index finger and thumb. Wrap your other 3 fingers loosely around the body of the needle to make it easier to control. You will be working additional cast on stitches onto this needle."
        },
        {
          "headline":"Loop the working yarn over the left-hand needle from front to back.",
          "description":"Hold the left-hand needle in the same way as the right-hand needle. Grip the needle near the tip with your index finger and thumb and cradle the rest of the needle loosely with your other 3 fingers. Use your right index finger and thumb to drape the yarn over the tip of the left-hand needle. This will form an open loop."
        },
        {
          "headline":"Insert the right-hand needle into the loop going from front to back.",
          "description":"Hold the yarn taut around the left-hand needle with your left index finger and thumb. Then, push the right-hand needle into the loop going from the front of the work (closest to you) to the back (furthest from you). This may seem awkward at first, but it will get easier the more you do this stitch."
        },
        {
          "headline":"Loop the yarn over the end of the right-hand needle and pull it through.",
          "description":"Use your left index finger to throw the working yarn up and over the right-hand needle. This will form a second loop that is only over the end of the right-hand needle. Use the right-hand needle to pull the yarn through the loop that is on the left-hand needle. Make sure to keep the yarn taut as you pull the new loop through."
        },
        {
          "headline":"Repeat the sequence to create more cast on stitches.",
          "description":"Continue to repeat the same process to cast on additional stitches. If you are following a pattern, check it to see how many stitches you need to cast on. If you just want to make a practice swatch, then cast on a total of 12 stitches. Remember to include the slipknot in your total cast on stitch count. If you want to work in the stockinette stitch, then you will need to purl the next row and alternate between knitting and purling rows for the rest of your project."
        }
      ]
    },
    {
      "name":"Working the Basic Knit Stitch",
      "steps":[
        {
          "headline":"Transfer the needle with the cast on stitches to your left hand.",
          "description":"Always start a new row by transferring your knitting needles to the opposite hands. The needle in your left hand should have all of the stitches on it and the needle in your right hand should be empty. Use the same grip as you used to cast on your stitches."
        },
        {
          "headline":"Insert the end of the right-hand needle into the first stitch.",
          "description":"Push the tip of the needle through by about 0.5 in (1.3 cm). Insert the tip in going from the front to the back of the stitch. Make sure that the working yarn is hanging behind your work when you do this."
        },
        {
          "headline":"Loop the yarn over the end of the right-hand needle.",
          "description":"Wrap the yarn over the end of the needle going from the front to the back. Use your left index finger to hold the yarn taut and keep it in a loop around the needle."
        },
        {
          "headline":"Pull the yarn through the first cast on stitch and let the old stitch slip off.",
          "description":"Use the right-hand needle to pull the loop you just made through the stitch on the left-hand needle. After you do this, let the old stitch slip off the end of the left-hand needle as the new stitch replaces it on the right-hand needle. Be careful not to let the new stitch slip off!"
        },
        {
          "headline":"Repeat to the end of the row.",
          "description":"Follow the same sequence to knit more stitches. Keep knitting until you reach the end of the row and the left-hand needle is empty.Tip: Use a row counter or a row counting app. This will make it easier to keep track of how many rows you have knit."
        },
        {
          "headline":"Turn your work around and knit the next row using the same technique.",
          "description":"Switch the needles. Hold the needle with all of the stitches on it in your left hand again and hold the empty needle in your right hand. Then, continue knitting in the same way as you knit the last row. Keep knitting until you are happy with the length of your project or until your pattern says to stop. If you are making a practice swatch, then knit a total of 12 rows."
        }
      ]
    },
    {
      "name":"Binding Off",
      "steps":[
        {
          "headline":"Knit the first 2 stitches as you normally would.",
          "description":"When you are ready to bind off the last row of stitches, knit the first 2 stitches in the row as usual. Use the same grip you used to knit the previous rows."
        },
        {
          "headline":"Insert the left-hand needle into the first stitch on the right-hand needle.",
          "description":"Next, push the left hand needle into the first stitch (second stitch from the tip) of the right-hand needle. Make sure the working yarn is behind your work."
        },
        {
          "headline":"Bring the first stitch up and over the second stitch.",
          "description":"Use the left-hand needle to lift the stitch up and over the first stitch on the end of the right-hand needle. This will leave you with 1 stitch on the right-hand needle."
        },
        {
          "headline":"Knit 1 stitch as usual.",
          "description":"Knit another stitch in the same way that you knit the first 2 stitches. Insert the right-hand needle through the stitch on the left-hand needle going from front to back, yarn over, and pull through. Let the old stitch slip off as the new stitch replaces it. This will leave you with 2 stitches on the right-hand needle again."
        },
        {
          "headline":"Lift the new first stitch up and over the stitch you just knit.",
          "description":"Use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch just like you did the first time."
        },
        {
          "headline":"Repeat the sequence to the end of the row to finish binding off.",
          "description":"Continue to knit 1 and lift 1 up and over that stitch until you have 1 loop left on the right-hand needle. Pull this stitch to widen it and then cut the yarn about 6 in (15 cm) from the base of the stitch. Tug the end of the yarn to secure the stitch.Tip: If desired, you can also weave in the loose ends at the beginning and end of the project using a yarn needle. These are available in craft supply stores and you use them just like you would use a sewing needle. Thread the yarn through the eye of the needle and sew through the stitches on the edge of the project to hide the loose ends."
        }
      ]
    },
    {
      "name":"Trying Other Knit Stitches",
      "steps":[
        {
          "headline":"Learn how to purl to do many other types of stitches.",
          "description":"The purl stitch is basically the opposite of the knit stitch. Instead of knitting from front to back with the working yarn behind your work, purling is when you knit from back to front with the yarn in front of your work. Many patterns call for purl stitches, so it is a useful stitch to learn. Purl is usually represented by a “P” in patterns followed by the number you need to purl, such as P1, P2, P3, etc."
        },
        {
          "headline":"Work an increase or decrease to change the number of stitches.",
          "description":"If you need to add or remove stitches from a row or round in your work, you will need to use increase or decrease stitches. An increase is when you knit through the same stitch 2 times to add a stitch. A decrease is when you knit through 2 stitches at once to remove a stitch. If you are using a pattern, make sure to follow the instructions for increasing and decreasing carefully. These stitches are important for ensuring you get the desired results."
        },
        {
          "headline":"Try a decorative stitch for a more intricate look.",
          "description":"There are many different types of knit stitches you can try. Find a stitch that interests you and try it out! Some stitches you might try include:\nBrioche Stitch\nGarter Stitch\nMoss Stitch"
        }
      ]
    }
  ],
  "text":" Casting On Choose a ball of yarn and a pair of knitting needles. Visit your local craft supply store or check out an online store to find a ball of yarn and a pair of knitting needles. Yarn comes in a wide range of textures, weights, and colors, so choose a yarn that appeals to you. Then, check the label on the yarn for a knitting needle size recommendation. For example, if you opt for a medium-weight yarn, then you will need a pair of US size 7, 8, or 9 (4.5, 5.0. or 5.5 mm) needles. You can knit with straight needles or circular needles. Circular needles are helpful for holding a large number of stitches, such as for a blanket, and you can also knit in the round with circular needles. Knitting needles are made from a variety of materials, including aluminum, plastic, and bamboo. The material is more a matter of personal preference than anything else. Tip: You may want to follow a beginner’s pattern when you are ready to knit your first project. Try making a dishcloth or a beanie for a quick and easy knitting project. Make a slipknot for your first cast on stitch. Loop the yarn around your index and middle finger 2 times. Then, pull the first loop over the second loop. Tug on the tail of the yarn to tighten the knot around the base of the loop. Then, slip the loop onto a knitting needle and tug the tail more to secure the knot. The slipknot counts as your first cast on stitch, so make sure to include it if you are counting stitches. Hold the needle with the slipknot on it in your right hand. Position the slipknot about 0.5 in (1.3 cm) from the tip. Grip the needle at this point with your right index finger and thumb. Wrap your other 3 fingers loosely around the body of the needle to make it easier to control. You will be working additional cast on stitches onto this needle. Loop the working yarn over the left-hand needle from front to back. Hold the left-hand needle in the same way as the right-hand needle. Grip the needle near the tip with your index finger and thumb and cradle the rest of the needle loosely with your other 3 fingers. Use your right index finger and thumb to drape the yarn over the tip of the left-hand needle. This will form an open loop. Insert the right-hand needle into the loop going from front to back. Hold the yarn taut around the left-hand needle with your left index finger and thumb. Then, push the right-hand needle into the loop going from the front of the work (closest to you) to the back (furthest from you). This may seem awkward at first, but it will get easier the more you do this stitch. Loop the yarn over the end of the right-hand needle and pull it through. Use your left index finger to throw the working yarn up and over the right-hand needle. This will form a second loop that is only over the end of the right-hand needle. Use the right-hand needle to pull the yarn through the loop that is on the left-hand needle. Make sure to keep the yarn taut as you pull the new loop through. Repeat the sequence to create more cast on stitches. Continue to repeat the same process to cast on additional stitches. If you are following a pattern, check it to see how many stitches you need to cast on. If you just want to make a practice swatch, then cast on a total of 12 stitches. Remember to include the slipknot in your total cast on stitch count. If you want to work in the stockinette stitch, then you will need to purl the next row and alternate between knitting and purling rows for the rest of your project. Working the Basic Knit Stitch Transfer the needle with the cast on stitches to your left hand. Always start a new row by transferring your knitting needles to the opposite hands. The needle in your left hand should have all of the stitches on it and the needle in your right hand should be empty. Use the same grip as you used to cast on your stitches. Insert the end of the right-hand needle into the first stitch. Push the tip of the needle through by about 0.5 in (1.3 cm). Insert the tip in going from the front to the back of the stitch. Make sure that the working yarn is hanging behind your work when you do this. Loop the yarn over the end of the right-hand needle. Wrap the yarn over the end of the needle going from the front to the back. Use your left index finger to hold the yarn taut and keep it in a loop around the needle. Pull the yarn through the first cast on stitch and let the old stitch slip off. Use the right-hand needle to pull the loop you just made through the stitch on the left-hand needle. After you do this, let the old stitch slip off the end of the left-hand needle as the new stitch replaces it on the right-hand needle. Be careful not to let the new stitch slip off! Repeat to the end of the row. Follow the same sequence to knit more stitches. Keep knitting until you reach the end of the row and the left-hand needle is empty.Tip: Use a row counter or a row counting app. This will make it easier to keep track of how many rows you have knit. Turn your work around and knit the next row using the same technique. Switch the needles. Hold the needle with all of the stitches on it in your left hand again and hold the empty needle in your right hand. Then, continue knitting in the same way as you knit the last row. Keep knitting until you are happy with the length of your project or until your pattern says to stop. If you are making a practice swatch, then knit a total of 12 rows. Binding Off Knit the first 2 stitches as you normally would. When you are ready to bind off the last row of stitches, knit the first 2 stitches in the row as usual. Use the same grip you used to knit the previous rows. Insert the left-hand needle into the first stitch on the right-hand needle. Next, push the left hand needle into the first stitch (second stitch from the tip) of the right-hand needle. Make sure the working yarn is behind your work. Bring the first stitch up and over the second stitch. Use the left-hand needle to lift the stitch up and over the first stitch on the end of the right-hand needle. This will leave you with 1 stitch on the right-hand needle. Knit 1 stitch as usual. Knit another stitch in the same way that you knit the first 2 stitches. Insert the right-hand needle through the stitch on the left-hand needle going from front to back, yarn over, and pull through. Let the old stitch slip off as the new stitch replaces it. This will leave you with 2 stitches on the right-hand needle again. Lift the new first stitch up and over the stitch you just knit. Use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch just like you did the first time. Repeat the sequence to the end of the row to finish binding off. Continue to knit 1 and lift 1 up and over that stitch until you have 1 loop left on the right-hand needle. Pull this stitch to widen it and then cut the yarn about 6 in (15 cm) from the base of the stitch. Tug the end of the yarn to secure the stitch.Tip: If desired, you can also weave in the loose ends at the beginning and end of the project using a yarn needle. These are available in craft supply stores and you use them just like you would use a sewing needle. Thread the yarn through the eye of the needle and sew through the stitches on the edge of the project to hide the loose ends. Trying Other Knit Stitches Learn how to purl to do many other types of stitches. The purl stitch is basically the opposite of the knit stitch. Instead of knitting from front to back with the working yarn behind your work, purling is when you knit from back to front with the yarn in front of your work. Many patterns call for purl stitches, so it is a useful stitch to learn. Purl is usually represented by a “P” in patterns followed by the number you need to purl, such as P1, P2, P3, etc. Work an increase or decrease to change the number of stitches. If you need to add or remove stitches from a row or round in your work, you will need to use increase or decrease stitches. An increase is when you knit through the same stitch 2 times to add a stitch. A decrease is when you knit through 2 stitches at once to remove a stitch. If you are using a pattern, make sure to follow the instructions for increasing and decreasing carefully. These stitches are important for ensuring you get the desired results. Try a decorative stitch for a more intricate look. There are many different types of knit stitches you can try. Find a stitch that interests you and try it out! Some stitches you might try include:\nBrioche Stitch\nGarter Stitch\nMoss Stitch",
  "sentences":[
    " Casting On Choose a ball of yarn and a pair of knitting needles.",
    "Visit your local craft supply store or check out an online store to find a ball of yarn and a pair of knitting needles.",
    "Yarn comes in a wide range of textures, weights, and colors, so choose a yarn that appeals to you.",
    "Then, check the label on the yarn for a knitting needle size recommendation.",
    "For example, if you opt for a medium-weight yarn, then you will need a pair of US size 7, 8, or 9 (4.5, 5.0. or 5.5 mm) needles.",
    "You can knit with straight needles or circular needles.",
    "Circular needles are helpful for holding a large number of stitches, such as for a blanket, and you can also knit in the round with circular needles.",
    "Knitting needles are made from a variety of materials, including aluminum, plastic, and bamboo.",
    "The material is more a matter of personal preference than anything else.",
    "Tip: You may want to follow a beginner’s pattern when you are ready to knit your first project.",
    "Try making a dishcloth or a beanie for a quick and easy knitting project.",
    "Make a slipknot for your first cast on stitch.",
    "Loop the yarn around your index and middle finger 2 times.",
    "Then, pull the first loop over the second loop.",
    "Tug on the tail of the yarn to tighten the knot around the base of the loop.",
    "Then, slip the loop onto a knitting needle and tug the tail more to secure the knot.",
    "The slipknot counts as your first cast on stitch, so make sure to include it if you are counting stitches.",
    "Hold the needle with the slipknot on it in your right hand.",
    "Position the slipknot about 0.5 in (1.3 cm) from the tip.",
    "Grip the needle at this point with your right index finger and thumb.",
    "Wrap your other 3 fingers loosely around the body of the needle to make it easier to control.",
    "You will be working additional cast on stitches onto this needle.",
    "Loop the working yarn over the left-hand needle from front to back.",
    "Hold the left-hand needle in the same way as the right-hand needle.",
    "Grip the needle near the tip with your index finger and thumb and cradle the rest of the needle loosely with your other 3 fingers.",
    "Use your right index finger and thumb to drape the yarn over the tip of the left-hand needle.",
    "This will form an open loop.",
    "Insert the right-hand needle into the loop going from front to back.",
    "Hold the yarn taut around the left-hand needle with your left index finger and thumb.",
    "Then, push the right-hand needle into the loop going from the front of the work (closest to you) to the back (furthest from you).",
    "This may seem awkward at first, but it will get easier the more you do this stitch.",
    "Loop the yarn over the end of the right-hand needle and pull it through.",
    "Use your left index finger to throw the working yarn up and over the right-hand needle.",
    "This will form a second loop that is only over the end of the right-hand needle.",
    "Use the right-hand needle to pull the yarn through the loop that is on the left-hand needle.",
    "Make sure to keep the yarn taut as you pull the new loop through.",
    "Repeat the sequence to create more cast on stitches.",
    "Continue to repeat the same process to cast on additional stitches.",
    "If you are following a pattern, check it to see how many stitches you need to cast on.",
    "If you just want to make a practice swatch, then cast on a total of 12 stitches.",
    "Remember to include the slipknot in your total cast on stitch count.",
    "If you want to work in the stockinette stitch, then you will need to purl the next row and alternate between knitting and purling rows for the rest of your project.",
    "Working the Basic Knit Stitch Transfer the needle with the cast on stitches to your left hand.",
    "Always start a new row by transferring your knitting needles to the opposite hands.",
    "The needle in your left hand should have all of the stitches on it and the needle in your right hand should be empty.",
    "Use the same grip as you used to cast on your stitches.",
    "Insert the end of the right-hand needle into the first stitch.",
    "Push the tip of the needle through by about 0.5 in (1.3 cm).",
    "Insert the tip in going from the front to the back of the stitch.",
    "Make sure that the working yarn is hanging behind your work when you do this.",
    "Loop the yarn over the end of the right-hand needle.",
    "Wrap the yarn over the end of the needle going from the front to the back.",
    "Use your left index finger to hold the yarn taut and keep it in a loop around the needle.",
    "Pull the yarn through the first cast on stitch and let the old stitch slip off.",
    "Use the right-hand needle to pull the loop you just made through the stitch on the left-hand needle.",
    "After you do this, let the old stitch slip off the end of the left-hand needle as the new stitch replaces it on the right-hand needle.",
    "Be careful not to let the new stitch slip off!",
    "Repeat to the end of the row.",
    "Follow the same sequence to knit more stitches.",
    "Keep knitting until you reach the end of the row and the left-hand needle is empty.Tip: Use a row counter or a row counting app.",
    "This will make it easier to keep track of how many rows you have knit.",
    "Turn your work around and knit the next row using the same technique.",
    "Switch the needles.",
    "Hold the needle with all of the stitches on it in your left hand again and hold the empty needle in your right hand.",
    "Then, continue knitting in the same way as you knit the last row.",
    "Keep knitting until you are happy with the length of your project or until your pattern says to stop.",
    "If you are making a practice swatch, then knit a total of 12 rows.",
    "Binding Off Knit the first 2 stitches as you normally would.",
    "When you are ready to bind off the last row of stitches, knit the first 2 stitches in the row as usual.",
    "Use the same grip you used to knit the previous rows.",
    "Insert the left-hand needle into the first stitch on the right-hand needle.",
    "Next, push the left hand needle into the first stitch (second stitch from the tip) of the right-hand needle.",
    "Make sure the working yarn is behind your work.",
    "Bring the first stitch up and over the second stitch.",
    "Use the left-hand needle to lift the stitch up and over the first stitch on the end of the right-hand needle.",
    "This will leave you with 1 stitch on the right-hand needle.",
    "Knit 1 stitch as usual.",
    "Knit another stitch in the same way that you knit the first 2 stitches.",
    "Insert the right-hand needle through the stitch on the left-hand needle going from front to back, yarn over, and pull through.",
    "Let the old stitch slip off as the new stitch replaces it.",
    "This will leave you with 2 stitches on the right-hand needle again.",
    "Lift the new first stitch up and over the stitch you just knit.",
    "Use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch just like you did the first time.",
    "Repeat the sequence to the end of the row to finish binding off.",
    "Continue to knit 1 and lift 1 up and over that stitch until you have 1 loop left on the right-hand needle.",
    "Pull this stitch to widen it and then cut the yarn about 6 in (15 cm) from the base of the stitch.",
    "Tug the end of the yarn to secure the stitch.Tip: If desired, you can also weave in the loose ends at the beginning and end of the project using a yarn needle.",
    "These are available in craft supply stores and you use them just like you would use a sewing needle.",
    "Thread the yarn through the eye of the needle and sew through the stitches on the edge of the project to hide the loose ends.",
    "Trying Other Knit Stitches Learn how to purl to do many other types of stitches.",
    "The purl stitch is basically the opposite of the knit stitch.",
    "Instead of knitting from front to back with the working yarn behind your work, purling is when you knit from back to front with the yarn in front of your work.",
    "Many patterns call for purl stitches, so it is a useful stitch to learn.",
    "Purl is usually represented by a “P” in patterns followed by the number you need to purl, such as P1, P2, P3, etc.",
    "Work an increase or decrease to change the number of stitches.",
    "If you need to add or remove stitches from a row or round in your work, you will need to use increase or decrease stitches.",
    "An increase is when you knit through the same stitch 2 times to add a stitch.",
    "A decrease is when you knit through 2 stitches at once to remove a stitch.",
    "If you are using a pattern, make sure to follow the instructions for increasing and decreasing carefully.",
    "These stitches are important for ensuring you get the desired results.",
    "Try a decorative stitch for a more intricate look.",
    "There are many different types of knit stitches you can try.",
    "Find a stitch that interests you and try it out!",
    "Some stitches you might try include:\nBrioche Stitch\nGarter Stitch\nMoss Stitch"
  ],
  "tyn_section":[
    "Yarn",
    "Knitting needles",
    "Scissors"
  ],
  "tyn_model":[
    "yarn",
    "knitting needles",
    "knitting needle",
    "needles",
    "circular needles",
    "bamboo",
    "knitting",
    "bind",
    "yarn needle",
    "sewing needle",
    "purl",
    "“p",
    "” in",
    "garter"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1428571429,
    "f1":0.2352941176,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.3571428571,
    "f1":0.4651162791
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.5,
    "f1":0.5714285714
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1428571429,
    "f1":0.2352941176
  }
}