{
  "title":"How to Make Maggi",
  "url":"https://www.wikihow.com/Make-Maggi",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "methods":[
    {
      "name":"Maggi with Egg",
      "steps":[
        {
          "headline":"Bring the water to a boil and stir in the noodles and flavor packet.",
          "description":"Pour 1 ⁄2 cups (350 ml) of water into a small pot on the stove and turn the burner to high. Wait until the water begins to boil, then open a 2.46-ounce (70 g) of Maggi noodles and stir them into the boiling water. Cut open the Tastemaker flavor packet that came in the noodle package and add it to the pot. If you prefer, leave out the Tastemaker flavor packet and use your own mix of seasonings. For example, use your own masala mix, bouillon, or cajun seasoning."
        },
        {
          "headline":"Simmer the Maggi for 2 minutes.",
          "description":"Turn the burner down to medium or medium-high so the water bubbles gently. Stir the noodles occasionally to help them break up. They should be fully cooked."
        },
        {
          "headline":"Whisk 1 egg in a small bowl and add it to the pot with noodles.",
          "description":"Crack the egg into a small bowl and use a fork or whisk to beat it until it's foamy. Then stir the egg into the pot with the cooked noodles.If you like less liquid in your bowl of noodles, drain the noodles and return them to the pot. Then stir the egg into them."
        },
        {
          "headline":"Cook the egg with the noodles for about 2 minutes.",
          "description":"Turn the burner to medium heat and stir the noodles as the egg cooks. Keep stirring until the egg is completely cooked and scrambled into the noodles."
        },
        {
          "headline":"Stir in cheese and serve the Maggi noodles.",
          "description":"Turn off the burner and add 1/2 cup (50 g) of grated cheese. Stir the noodles and taste them. Then add salt and pepper as you like. Serve the noodles while they're still hot for the best flavor."
        }
      ]
    },
    {
      "name":"Spicy Masala Maggi",
      "steps":[
        {
          "headline":"Boil the water and cook the noodles for 2 to 3 minutes.",
          "description":"Pour 2 cups (470 ml) of water into a pot and turn the burner to high. Once the water bubbles, open 2 2.46-ounce (70 g) packets of Maggi and add the noodles. Stir and boil the noodles until they're tender."
        },
        {
          "headline":"Drain and rinse the noodles.",
          "description":"Turn off the burner and set a colander in the sink. Pour the noodles into it so the hot water drains into the sink. Then run tap water over the noodles for about 10 seconds. Set the noodles aside while you prepare the masala. Rinsing the noodles will remove excess starch."
        },
        {
          "headline":"Sauté the garlic and green chilies for 15 seconds.",
          "description":"Pour 1 tablespoon (15 ml) of vegetable oil into a skillet and turn the burner to medium-high. Stir in 1 tablespoon (8 g) of minced garlic and 1 to 2 chopped Thai green chilies. Keep stirring them until they become fragrant. Since garlic burns easily, cook it very briefly before adding the other vegetables."
        },
        {
          "headline":"Add the chopped vegetables and fry them for 1 minute.",
          "description":"Put 1 1/2 cups (75 g) of finely diced vegetables into the skillet and cook them until they soften a little. You can use a single type of vegetable or a combination of your favorites.Vegetable Options:CarrotsCabbageOnionsPeasBroccoli floretsTomatoesGreen beans"
        },
        {
          "headline":"Stir the noodles into the skillet with hot sauce, masala, and vinegar.",
          "description":"Turn off the burner and add the drained noodles to the vegetables. Add 2 tablespoons (39 g) of hot sauce along with 1 teaspoon (4.9 ml) of white vinegar and the 2 masala flavor packets. Stir until the noodles are combined. Taste the noodles at this point and add salt according to your taste."
        },
        {
          "headline":"Garnish the spicy masala Maggi with spring onions.",
          "description":"Transfer the noodles to 2 serving dishes and scatter 1 tablespoon (6 g) of chopped spring onions over each. Serve the noodles while they're still hot for the best flavor. Although Maggi noodles are best the same day they're made, you can refrigerate leftovers in an airtight container for up to 3 days."
        }
      ]
    },
    {
      "name":"Maggi with Vegetables",
      "steps":[
        {
          "headline":"Sauté garlic for 30 seconds.",
          "description":"Pour 2 teaspoons (9.9 ml) of vegetable oil into a skillet and turn the burner to medium. Once the oil shimmers, stir in 1 teaspoon of minced garlic and cook it briefly until it's fragrant."
        },
        {
          "headline":"Stir in onion and bell pepper.",
          "description":"Add ½ of a finely chopped onion along with ½ of a finely chopped red bell pepper. Stir and cook the vegetables over medium heat until they soften. This should take about 4 to 5 minutes."
        },
        {
          "headline":"Add tomato, broccoli, and peas.",
          "description":"Finely chop 1 small tomato and stir it into the vegetables. Add ¼ cup (45 g) of broccoli florets and ¼ cup (40 g) of peas. Cook the vegetables for 3 to 4 minutes and stir them occasionally so they don't stick to the skillet."
        },
        {
          "headline":"Stir in the turmeric, chili, garam masala, and water.",
          "description":"Add ½ teaspoon (1 g) of turmeric powder, ½ teaspoon (1 g) of red chili powder, and ¼ teaspoon (0.5 g) of garam masala powder. Stir until the spices are mixed into the vegetables and pour in 2 cups (470 ml) of water."
        },
        {
          "headline":"Bring the mixture to a boil and stir in the flavoring packets.",
          "description":"Turn the burner to medium-high and heat the mixture until the water begins to boil. Then open the 2 masala flavoring packets that are in the Maggi packages. Stir the flavoring into the skillet."
        },
        {
          "headline":"Add the Maggi noodles and boil them for 2 minutes.",
          "description":"Break up the noodles and add them to the skillet. Stir and boil them until they're tender and they've absorbed some of the water. At this point you can taste the noodles and add as much salt as you like."
        },
        {
          "headline":"Garnish the noodles with chaat masala and serve them.",
          "description":"Turn off the burner and transfer the noodles to 2 serving dishes. Sprinkle a pinch of chaat masala over each bowl and serve the noodles while they're hot. Although the texture of the noodles is best right away, you can refrigerate leftovers in an airtight container for up to 3 days."
        }
      ]
    }
  ],
  "text":" Maggi with Egg Bring the water to a boil and stir in the noodles and flavor packet. Pour 1 ⁄2 cups (350 ml) of water into a small pot on the stove and turn the burner to high. Wait until the water begins to boil, then open a 2.46-ounce (70 g) of Maggi noodles and stir them into the boiling water. Cut open the Tastemaker flavor packet that came in the noodle package and add it to the pot. If you prefer, leave out the Tastemaker flavor packet and use your own mix of seasonings. For example, use your own masala mix, bouillon, or cajun seasoning. Simmer the Maggi for 2 minutes. Turn the burner down to medium or medium-high so the water bubbles gently. Stir the noodles occasionally to help them break up. They should be fully cooked. Whisk 1 egg in a small bowl and add it to the pot with noodles. Crack the egg into a small bowl and use a fork or whisk to beat it until it's foamy. Then stir the egg into the pot with the cooked noodles.If you like less liquid in your bowl of noodles, drain the noodles and return them to the pot. Then stir the egg into them. Cook the egg with the noodles for about 2 minutes. Turn the burner to medium heat and stir the noodles as the egg cooks. Keep stirring until the egg is completely cooked and scrambled into the noodles. Stir in cheese and serve the Maggi noodles. Turn off the burner and add 1/2 cup (50 g) of grated cheese. Stir the noodles and taste them. Then add salt and pepper as you like. Serve the noodles while they're still hot for the best flavor. Spicy Masala Maggi Boil the water and cook the noodles for 2 to 3 minutes. Pour 2 cups (470 ml) of water into a pot and turn the burner to high. Once the water bubbles, open 2 2.46-ounce (70 g) packets of Maggi and add the noodles. Stir and boil the noodles until they're tender. Drain and rinse the noodles. Turn off the burner and set a colander in the sink. Pour the noodles into it so the hot water drains into the sink. Then run tap water over the noodles for about 10 seconds. Set the noodles aside while you prepare the masala. Rinsing the noodles will remove excess starch. Sauté the garlic and green chilies for 15 seconds. Pour 1 tablespoon (15 ml) of vegetable oil into a skillet and turn the burner to medium-high. Stir in 1 tablespoon (8 g) of minced garlic and 1 to 2 chopped Thai green chilies. Keep stirring them until they become fragrant. Since garlic burns easily, cook it very briefly before adding the other vegetables. Add the chopped vegetables and fry them for 1 minute. Put 1 1/2 cups (75 g) of finely diced vegetables into the skillet and cook them until they soften a little. You can use a single type of vegetable or a combination of your favorites.Vegetable Options:CarrotsCabbageOnionsPeasBroccoli floretsTomatoesGreen beans Stir the noodles into the skillet with hot sauce, masala, and vinegar. Turn off the burner and add the drained noodles to the vegetables. Add 2 tablespoons (39 g) of hot sauce along with 1 teaspoon (4.9 ml) of white vinegar and the 2 masala flavor packets. Stir until the noodles are combined. Taste the noodles at this point and add salt according to your taste. Garnish the spicy masala Maggi with spring onions. Transfer the noodles to 2 serving dishes and scatter 1 tablespoon (6 g) of chopped spring onions over each. Serve the noodles while they're still hot for the best flavor. Although Maggi noodles are best the same day they're made, you can refrigerate leftovers in an airtight container for up to 3 days. Maggi with Vegetables Sauté garlic for 30 seconds. Pour 2 teaspoons (9.9 ml) of vegetable oil into a skillet and turn the burner to medium. Once the oil shimmers, stir in 1 teaspoon of minced garlic and cook it briefly until it's fragrant. Stir in onion and bell pepper. Add ½ of a finely chopped onion along with ½ of a finely chopped red bell pepper. Stir and cook the vegetables over medium heat until they soften. This should take about 4 to 5 minutes. Add tomato, broccoli, and peas. Finely chop 1 small tomato and stir it into the vegetables. Add ¼ cup (45 g) of broccoli florets and ¼ cup (40 g) of peas. Cook the vegetables for 3 to 4 minutes and stir them occasionally so they don't stick to the skillet. Stir in the turmeric, chili, garam masala, and water. Add ½ teaspoon (1 g) of turmeric powder, ½ teaspoon (1 g) of red chili powder, and ¼ teaspoon (0.5 g) of garam masala powder. Stir until the spices are mixed into the vegetables and pour in 2 cups (470 ml) of water. Bring the mixture to a boil and stir in the flavoring packets. Turn the burner to medium-high and heat the mixture until the water begins to boil. Then open the 2 masala flavoring packets that are in the Maggi packages. Stir the flavoring into the skillet. Add the Maggi noodles and boil them for 2 minutes. Break up the noodles and add them to the skillet. Stir and boil them until they're tender and they've absorbed some of the water. At this point you can taste the noodles and add as much salt as you like. Garnish the noodles with chaat masala and serve them. Turn off the burner and transfer the noodles to 2 serving dishes. Sprinkle a pinch of chaat masala over each bowl and serve the noodles while they're hot. Although the texture of the noodles is best right away, you can refrigerate leftovers in an airtight container for up to 3 days.",
  "sentences":[
    " Maggi with Egg Bring the water to a boil and stir in the noodles and flavor packet.",
    "Pour 1 ⁄2 cups (350 ml) of water into a small pot on the stove and turn the burner to high.",
    "Wait until the water begins to boil, then open a 2.46-ounce (70 g) of Maggi noodles and stir them into the boiling water.",
    "Cut open the Tastemaker flavor packet that came in the noodle package and add it to the pot.",
    "If you prefer, leave out the Tastemaker flavor packet and use your own mix of seasonings.",
    "For example, use your own masala mix, bouillon, or cajun seasoning.",
    "Simmer the Maggi for 2 minutes.",
    "Turn the burner down to medium or medium-high so the water bubbles gently.",
    "Stir the noodles occasionally to help them break up.",
    "They should be fully cooked.",
    "Whisk 1 egg in a small bowl and add it to the pot with noodles.",
    "Crack the egg into a small bowl and use a fork or whisk to beat it until it's foamy.",
    "Then stir the egg into the pot with the cooked noodles.If you like less liquid in your bowl of noodles, drain the noodles and return them to the pot.",
    "Then stir the egg into them.",
    "Cook the egg with the noodles for about 2 minutes.",
    "Turn the burner to medium heat and stir the noodles as the egg cooks.",
    "Keep stirring until the egg is completely cooked and scrambled into the noodles.",
    "Stir in cheese and serve the Maggi noodles.",
    "Turn off the burner and add 1/2 cup (50 g) of grated cheese.",
    "Stir the noodles and taste them.",
    "Then add salt and pepper as you like.",
    "Serve the noodles while they're still hot for the best flavor.",
    "Spicy Masala Maggi Boil the water and cook the noodles for 2 to 3 minutes.",
    "Pour 2 cups (470 ml) of water into a pot and turn the burner to high.",
    "Once the water bubbles, open 2 2.46-ounce (70 g) packets of Maggi and add the noodles.",
    "Stir and boil the noodles until they're tender.",
    "Drain and rinse the noodles.",
    "Turn off the burner and set a colander in the sink.",
    "Pour the noodles into it so the hot water drains into the sink.",
    "Then run tap water over the noodles for about 10 seconds.",
    "Set the noodles aside while you prepare the masala.",
    "Rinsing the noodles will remove excess starch.",
    "Sauté the garlic and green chilies for 15 seconds.",
    "Pour 1 tablespoon (15 ml) of vegetable oil into a skillet and turn the burner to medium-high.",
    "Stir in 1 tablespoon (8 g) of minced garlic and 1 to 2 chopped Thai green chilies.",
    "Keep stirring them until they become fragrant.",
    "Since garlic burns easily, cook it very briefly before adding the other vegetables.",
    "Add the chopped vegetables and fry them for 1 minute.",
    "Put 1 1/2 cups (75 g) of finely diced vegetables into the skillet and cook them until they soften a little.",
    "You can use a single type of vegetable or a combination of your favorites.Vegetable Options:CarrotsCabbageOnionsPeasBroccoli floretsTomatoesGreen beans Stir the noodles into the skillet with hot sauce, masala, and vinegar.",
    "Turn off the burner and add the drained noodles to the vegetables.",
    "Add 2 tablespoons (39 g) of hot sauce along with 1 teaspoon (4.9 ml) of white vinegar and the 2 masala flavor packets.",
    "Stir until the noodles are combined.",
    "Taste the noodles at this point and add salt according to your taste.",
    "Garnish the spicy masala Maggi with spring onions.",
    "Transfer the noodles to 2 serving dishes and scatter 1 tablespoon (6 g) of chopped spring onions over each.",
    "Serve the noodles while they're still hot for the best flavor.",
    "Although Maggi noodles are best the same day they're made, you can refrigerate leftovers in an airtight container for up to 3 days.",
    "Maggi with Vegetables Sauté garlic for 30 seconds.",
    "Pour 2 teaspoons (9.9 ml) of vegetable oil into a skillet and turn the burner to medium.",
    "Once the oil shimmers, stir in 1 teaspoon of minced garlic and cook it briefly until it's fragrant.",
    "Stir in onion and bell pepper.",
    "Add ½ of a finely chopped onion along with ½ of a finely chopped red bell pepper.",
    "Stir and cook the vegetables over medium heat until they soften.",
    "This should take about 4 to 5 minutes.",
    "Add tomato, broccoli, and peas.",
    "Finely chop 1 small tomato and stir it into the vegetables.",
    "Add ¼ cup (45 g) of broccoli florets and ¼ cup (40 g) of peas.",
    "Cook the vegetables for 3 to 4 minutes and stir them occasionally so they don't stick to the skillet.",
    "Stir in the turmeric, chili, garam masala, and water.",
    "Add ½ teaspoon (1 g) of turmeric powder, ½ teaspoon (1 g) of red chili powder, and ¼ teaspoon (0.5 g) of garam masala powder.",
    "Stir until the spices are mixed into the vegetables and pour in 2 cups (470 ml) of water.",
    "Bring the mixture to a boil and stir in the flavoring packets.",
    "Turn the burner to medium-high and heat the mixture until the water begins to boil.",
    "Then open the 2 masala flavoring packets that are in the Maggi packages.",
    "Stir the flavoring into the skillet.",
    "Add the Maggi noodles and boil them for 2 minutes.",
    "Break up the noodles and add them to the skillet.",
    "Stir and boil them until they're tender and they've absorbed some of the water.",
    "At this point you can taste the noodles and add as much salt as you like.",
    "Garnish the noodles with chaat masala and serve them.",
    "Turn off the burner and transfer the noodles to 2 serving dishes.",
    "Sprinkle a pinch of chaat masala over each bowl and serve the noodles while they're hot.",
    "Although the texture of the noodles is best right away, you can refrigerate leftovers in an airtight container for up to 3 days."
  ],
  "tyn_section":[
    "Small pot with a lid",
    "Spoon",
    "Small bowl",
    "Fork or whisk",
    "Serving bowl",
    "Measuring cups",
    "Measuring cups and spoons",
    "Colander",
    "Skillet",
    "Knife and cutting board"
  ],
  "tyn_model":[
    "water",
    "skillet",
    "garlic",
    "burner",
    "pot",
    "vegetables",
    "maggi noodles",
    "noodles",
    "egg",
    "tastemaker flavor",
    "green chilies",
    "vegetable oil",
    "hot sauce",
    "salt",
    "spring onions",
    "airtight container",
    "onion",
    "tomato",
    "broccoli",
    "peas",
    "turmeric",
    "chaat masala",
    "small pot",
    "seasonings",
    "masala mix",
    "bouillon",
    "cajun seasoning",
    "small bowl",
    "fork",
    "whisk",
    "cheese",
    "salt and pepper",
    "colander",
    "tap water",
    "vinegar",
    "white vinegar",
    "oil",
    "bell pepper",
    "red bell pepper",
    "chili",
    "garam masala",
    "red chili powder",
    "garam masala powder",
    "masala flavoring packets"
  ],
  "simple_metrics":{
    "r":0.3,
    "p":0.0681818182,
    "f1":0.1111111111,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3,
    "p":0.0681818182,
    "f1":0.1111111111
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.1363636364,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3,
    "p":0.0681818182,
    "f1":0.1111111111
  }
}