{
  "title":"How to Make Jeera Rice",
  "url":"https://www.wikihow.com/Make-Jeera-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "methods":[
    {
      "name":"Making Jeera Rice on the Stove",
      "steps":[
        {
          "headline":"Wash and soak 2 cups (400 g) of basmati rice and set it aside.",
          "description":"Pour the rice into a colander or sieve and rinse under cool water until the water runs clear. Put the rice in a bowl and cover it completely with warm water. Let the rice soak for 20-30 minutes. Drain it completely in a colander, return it to the bowl, and set it aside. You can use any type of rice for jeera rice, but it tastes best with good quality basmati rice. Use long-grain, aged basmati rice for the best flavor and texture."
        },
        {
          "headline":"Heat 2 tbsp (30 g) of ghee in a pot over medium-high heat.",
          "description":"Place a pot on the stove over medium-high heat. Add the ghee to the pot and cook it for about 1 minute until the ghee melts. You can also use butter or vegetable oil instead of ghee."
        },
        {
          "headline":"Saute bay leaf, cloves, cinnamon, and cardamom in the hot ghee.",
          "description":"Once the ghee has melted, add 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick to the pot. Saute for 1-2 minutes. Use a spatula or a wooden spoon to spread the spices around the pan or shake the pan gently to cook them evenly in the ghee. Slightly crush the spices before adding them to the pot to bring out their flavors more. You can also use a stovetop pressure cooker to saute all the spices in the same way."
        },
        {
          "headline":"Pour the cumin over the ghee mixture and reduce the heat to medium-low.",
          "description":"It’s best to add the 3 tsp (6.3 g) of cumin seeds when the ghee is very hot because they will crackle immediately and release their flavor. Wait a few seconds after you’ve added the cumin, then reduce the heat to medium-low."
        },
        {
          "headline":"Add the chili, onions, and rice to the pot and turn the heat up to medium.",
          "description":"Slice and deseed the green chilis and cut the onion into small slices. Add them both to the pot. Turn the heat up to medium. Add the drained rice. Saute the rice for 2 minutes until the onions turn golden brown. This will add more flavor to the rice. Use red chili for more of a spicy kick. You can also leave out the chili and onion if you don’t want it too spicy or you don’t like the flavor of onion. If you are using a stovetop pressure cooker, roast the rice in the same way."
        },
        {
          "headline":"Stir 3 ⁄2 cups (830 ml) of water and a pinch of salt into the rice mixture.",
          "description":"Mix well with a wooden spoon to fold the spice mixture evenly into the rice. Taste the water. It should be slightly salty. Add another pinch of salt if necessary."
        },
        {
          "headline":"Bring the mixture to a boil, then reduce the heat and cover the pot.",
          "description":"Turn the heat to high to bring the water to boil. Once it starts to boil, reduce the heat again to medium. Cover the pot with the lid. If you are making the rice in a stovetop pressure cooker, simply put the lid on the cooker and cook on high heat for 1 whistle. Don’t stir the rice while it’s cooking as this will break the grains."
        },
        {
          "headline":"Cook the rice on medium heat until the water is absorbed.",
          "description":"Let the rice cook for about 10 minutes. All the water should be absorbed, but the rice should still be a little damp. Remove the lid and stir the mixture with a wooden spoon. Then, turn off the heat."
        },
        {
          "headline":"Let the rice sit for 5-10 minutes, then fluff it and add the chopped coriander.",
          "description":"Cover the jeera rice and let it rest for 5-10 minutes. Then, stir it gently with a fork and sprinkle 2 tablespoons (5 g) of chopped coriander on top. Serve the rice as a side dish with an Indian curry or enjoy it on its own."
        }
      ]
    },
    {
      "name":"Using a Rice Cooker",
      "steps":[
        {
          "headline":"Wash and soak 2 cups (400 g) of basmati rice.",
          "description":"Rinse the rice under cool water in a sieve or colander. Put the rice in a bowl and pour warm water over it until all the rice is fully submerged."
        },
        {
          "headline":"Drain the rice and add it to the rice cooker with 3 ⁄2  c (830 ml) of fresh water.",
          "description":"Drain the rice over the sink with a colander. Discard the soak water. Add the drained rice to the rice cooker and pour 3 ⁄2 cups (830 ml) of cold water on top. Remember that the rice will expand when it’s cooked. 2 cups (400 g) of jasmine rice can expand to up to 6 cups (1200 g) of cooked rice, so be sure there is enough room in your rice cooker for this expansion. If your rice cooker is too small, adjust the recipe accordingly. You can also make the jeera rice in several batches if needed."
        },
        {
          "headline":"Melt 2 tbsp (30 g) of ghee in a pot over medium-high heat.",
          "description":"Set your rice cooker aside and cook the ghee in a pot over medium-high heat. Allow it to cook for about 1 minute until it melts. You can also substitute butter or vegetable oil for the ghee."
        },
        {
          "headline":"Saute cloves, cinnamon, bay leaf, and cardamom in the ghee.",
          "description":"Add 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick to the pot. Use a spatula or a wooden spoon to spread the spices around the pan. You can also shake the pan gently to coat the spices evenly in the ghee so they don’t burn. Let them cook for 1-2 minutes."
        },
        {
          "headline":"Pour 3 tsp (6.3 g) of cumin seeds into the pot and reduce the heat.",
          "description":"Add the cumin seeds when the ghee is very hot so they will crackle and release their flavor. A few seconds after you’ve added the cumin, reduce the heat to medium-low. Cook the cumin seeds in the mixture for about 1 minute."
        },
        {
          "headline":"Add the ghee mixture to the rice cooker and cook the rice.",
          "description":"Close the lid of the rice cooker, plug it in, and press the switch to turn it on. Let the rice cook. You will hear a click when the rice is done cooking and it will turn off automatically. Some rice cookers keep the rice warm until you unplug it."
        },
        {
          "headline":"Let the rice sit for 10-15 minutes, then open the rice cooker.",
          "description":"Unplug the rice cooker. Let it sit for 10-15 minutes with the lid still on. Then, open the lid. Letting the rice rest before you open the lid will make it fluffier and less sticky."
        },
        {
          "headline":"Add coriander to the rice, fluff it, and serve.",
          "description":"After you’ve opened the lid of the rice cooker, use a fork to stir the rice. Breaking up the rice pieces will prevent clumps from forming and release trapped steam so the rice won’t overcook. Sprinkle 2 tablespoons (5 g) of chopped coriander on top. Serve the rice as a side with an Indian curry or enjoy it on its own."
        }
      ]
    },
    {
      "name":"Preparing the Rice and Spices Separately",
      "steps":[
        {
          "headline":"Cook the rice and set it aside.",
          "description":"To make the basmati rice, bring 3 ⁄2 cups (830 ml) water to boil in a pot with a pinch of salt. Add 2 cups (400 g) basmati rice. Gently stir the rice and then reduce the heat to low. Cover the pot and let it simmer for 10 minutes until all the water has absorbed into the rice. Let it sit for 5 minutes, then gently fluff the rice by mixing it with a fork. Set the rice aside while you work on the sauce. You can also prepare the rice in a pressure cooker or rice cooker."
        },
        {
          "headline":"Heat 1 tbsp (15 g) of ghee in a pot over medium-high heat.",
          "description":"Turn your stove to medium-high. Put a pot on the stove and add the ghee. Cook for about 1-2 minutes to let the ghee melt. If you don’t have ghee, use vegetable oil or butter."
        },
        {
          "headline":"Saute the cumin and spices in the ghee for 1-2 minutes over low heat.",
          "description":"Pour 3 tsp (6.3 g) of cumin seeds over the hot ghee. After a few seconds, turn the heat down to low. Then, add the 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick. Saute the mixture for about 1-2 minutes."
        },
        {
          "headline":"Add 1 tbsp (15 g) ghee and 2 tbsp (5 g) chopped coriander.",
          "description":"Turn off the stove and remove the pot from the heat. Add the ghee to the mixture. Finely mince the coriander and sprinkle it on top. Mix the ingredients together with a wooden spoon."
        },
        {
          "headline":"Add the rice to the pot and mix gently.",
          "description":"Make sure your rice has cooled completely before you mix it with the cumin sauce. Stir the rice gently in the pot with a wooden spoon so that it is evenly coated. Serve the rice as a side dish with an Indian curry."
        }
      ]
    }
  ],
  "text":" Making Jeera Rice on the Stove Wash and soak 2 cups (400 g) of basmati rice and set it aside. Pour the rice into a colander or sieve and rinse under cool water until the water runs clear. Put the rice in a bowl and cover it completely with warm water. Let the rice soak for 20-30 minutes. Drain it completely in a colander, return it to the bowl, and set it aside. You can use any type of rice for jeera rice, but it tastes best with good quality basmati rice. Use long-grain, aged basmati rice for the best flavor and texture. Heat 2 tbsp (30 g) of ghee in a pot over medium-high heat. Place a pot on the stove over medium-high heat. Add the ghee to the pot and cook it for about 1 minute until the ghee melts. You can also use butter or vegetable oil instead of ghee. Saute bay leaf, cloves, cinnamon, and cardamom in the hot ghee. Once the ghee has melted, add 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick to the pot. Saute for 1-2 minutes. Use a spatula or a wooden spoon to spread the spices around the pan or shake the pan gently to cook them evenly in the ghee. Slightly crush the spices before adding them to the pot to bring out their flavors more. You can also use a stovetop pressure cooker to saute all the spices in the same way. Pour the cumin over the ghee mixture and reduce the heat to medium-low. It’s best to add the 3 tsp (6.3 g) of cumin seeds when the ghee is very hot because they will crackle immediately and release their flavor. Wait a few seconds after you’ve added the cumin, then reduce the heat to medium-low. Add the chili, onions, and rice to the pot and turn the heat up to medium. Slice and deseed the green chilis and cut the onion into small slices. Add them both to the pot. Turn the heat up to medium. Add the drained rice. Saute the rice for 2 minutes until the onions turn golden brown. This will add more flavor to the rice. Use red chili for more of a spicy kick. You can also leave out the chili and onion if you don’t want it too spicy or you don’t like the flavor of onion. If you are using a stovetop pressure cooker, roast the rice in the same way. Stir 3 ⁄2 cups (830 ml) of water and a pinch of salt into the rice mixture. Mix well with a wooden spoon to fold the spice mixture evenly into the rice. Taste the water. It should be slightly salty. Add another pinch of salt if necessary. Bring the mixture to a boil, then reduce the heat and cover the pot. Turn the heat to high to bring the water to boil. Once it starts to boil, reduce the heat again to medium. Cover the pot with the lid. If you are making the rice in a stovetop pressure cooker, simply put the lid on the cooker and cook on high heat for 1 whistle. Don’t stir the rice while it’s cooking as this will break the grains. Cook the rice on medium heat until the water is absorbed. Let the rice cook for about 10 minutes. All the water should be absorbed, but the rice should still be a little damp. Remove the lid and stir the mixture with a wooden spoon. Then, turn off the heat. Let the rice sit for 5-10 minutes, then fluff it and add the chopped coriander. Cover the jeera rice and let it rest for 5-10 minutes. Then, stir it gently with a fork and sprinkle 2 tablespoons (5 g) of chopped coriander on top. Serve the rice as a side dish with an Indian curry or enjoy it on its own. Using a Rice Cooker Wash and soak 2 cups (400 g) of basmati rice. Rinse the rice under cool water in a sieve or colander. Put the rice in a bowl and pour warm water over it until all the rice is fully submerged. Drain the rice and add it to the rice cooker with 3 ⁄2  c (830 ml) of fresh water. Drain the rice over the sink with a colander. Discard the soak water. Add the drained rice to the rice cooker and pour 3 ⁄2 cups (830 ml) of cold water on top. Remember that the rice will expand when it’s cooked. 2 cups (400 g) of jasmine rice can expand to up to 6 cups (1200 g) of cooked rice, so be sure there is enough room in your rice cooker for this expansion. If your rice cooker is too small, adjust the recipe accordingly. You can also make the jeera rice in several batches if needed. Melt 2 tbsp (30 g) of ghee in a pot over medium-high heat. Set your rice cooker aside and cook the ghee in a pot over medium-high heat. Allow it to cook for about 1 minute until it melts. You can also substitute butter or vegetable oil for the ghee. Saute cloves, cinnamon, bay leaf, and cardamom in the ghee. Add 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick to the pot. Use a spatula or a wooden spoon to spread the spices around the pan. You can also shake the pan gently to coat the spices evenly in the ghee so they don’t burn. Let them cook for 1-2 minutes. Pour 3 tsp (6.3 g) of cumin seeds into the pot and reduce the heat. Add the cumin seeds when the ghee is very hot so they will crackle and release their flavor. A few seconds after you’ve added the cumin, reduce the heat to medium-low. Cook the cumin seeds in the mixture for about 1 minute. Add the ghee mixture to the rice cooker and cook the rice. Close the lid of the rice cooker, plug it in, and press the switch to turn it on. Let the rice cook. You will hear a click when the rice is done cooking and it will turn off automatically. Some rice cookers keep the rice warm until you unplug it. Let the rice sit for 10-15 minutes, then open the rice cooker. Unplug the rice cooker. Let it sit for 10-15 minutes with the lid still on. Then, open the lid. Letting the rice rest before you open the lid will make it fluffier and less sticky. Add coriander to the rice, fluff it, and serve. After you’ve opened the lid of the rice cooker, use a fork to stir the rice. Breaking up the rice pieces will prevent clumps from forming and release trapped steam so the rice won’t overcook. Sprinkle 2 tablespoons (5 g) of chopped coriander on top. Serve the rice as a side with an Indian curry or enjoy it on its own. Preparing the Rice and Spices Separately Cook the rice and set it aside. To make the basmati rice, bring 3 ⁄2 cups (830 ml) water to boil in a pot with a pinch of salt. Add 2 cups (400 g) basmati rice. Gently stir the rice and then reduce the heat to low. Cover the pot and let it simmer for 10 minutes until all the water has absorbed into the rice. Let it sit for 5 minutes, then gently fluff the rice by mixing it with a fork. Set the rice aside while you work on the sauce. You can also prepare the rice in a pressure cooker or rice cooker. Heat 1 tbsp (15 g) of ghee in a pot over medium-high heat. Turn your stove to medium-high. Put a pot on the stove and add the ghee. Cook for about 1-2 minutes to let the ghee melt. If you don’t have ghee, use vegetable oil or butter. Saute the cumin and spices in the ghee for 1-2 minutes over low heat. Pour 3 tsp (6.3 g) of cumin seeds over the hot ghee. After a few seconds, turn the heat down to low. Then, add the 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick. Saute the mixture for about 1-2 minutes. Add 1 tbsp (15 g) ghee and 2 tbsp (5 g) chopped coriander. Turn off the stove and remove the pot from the heat. Add the ghee to the mixture. Finely mince the coriander and sprinkle it on top. Mix the ingredients together with a wooden spoon. Add the rice to the pot and mix gently. Make sure your rice has cooled completely before you mix it with the cumin sauce. Stir the rice gently in the pot with a wooden spoon so that it is evenly coated. Serve the rice as a side dish with an Indian curry.",
  "sentences":[
    " Making Jeera Rice on the Stove Wash and soak 2 cups (400 g) of basmati rice and set it aside.",
    "Pour the rice into a colander or sieve and rinse under cool water until the water runs clear.",
    "Put the rice in a bowl and cover it completely with warm water.",
    "Let the rice soak for 20-30 minutes.",
    "Drain it completely in a colander, return it to the bowl, and set it aside.",
    "You can use any type of rice for jeera rice, but it tastes best with good quality basmati rice.",
    "Use long-grain, aged basmati rice for the best flavor and texture.",
    "Heat 2 tbsp (30 g) of ghee in a pot over medium-high heat.",
    "Place a pot on the stove over medium-high heat.",
    "Add the ghee to the pot and cook it for about 1 minute until the ghee melts.",
    "You can also use butter or vegetable oil instead of ghee.",
    "Saute bay leaf, cloves, cinnamon, and cardamom in the hot ghee.",
    "Once the ghee has melted, add 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick to the pot.",
    "Saute for 1-2 minutes.",
    "Use a spatula or a wooden spoon to spread the spices around the pan or shake the pan gently to cook them evenly in the ghee.",
    "Slightly crush the spices before adding them to the pot to bring out their flavors more.",
    "You can also use a stovetop pressure cooker to saute all the spices in the same way.",
    "Pour the cumin over the ghee mixture and reduce the heat to medium-low.",
    "It’s best to add the 3 tsp (6.3 g) of cumin seeds when the ghee is very hot because they will crackle immediately and release their flavor.",
    "Wait a few seconds after you’ve added the cumin, then reduce the heat to medium-low.",
    "Add the chili, onions, and rice to the pot and turn the heat up to medium.",
    "Slice and deseed the green chilis and cut the onion into small slices.",
    "Add them both to the pot.",
    "Turn the heat up to medium.",
    "Add the drained rice.",
    "Saute the rice for 2 minutes until the onions turn golden brown.",
    "This will add more flavor to the rice.",
    "Use red chili for more of a spicy kick.",
    "You can also leave out the chili and onion if you don’t want it too spicy or you don’t like the flavor of onion.",
    "If you are using a stovetop pressure cooker, roast the rice in the same way.",
    "Stir 3 ⁄2 cups (830 ml) of water and a pinch of salt into the rice mixture.",
    "Mix well with a wooden spoon to fold the spice mixture evenly into the rice.",
    "Taste the water.",
    "It should be slightly salty.",
    "Add another pinch of salt if necessary.",
    "Bring the mixture to a boil, then reduce the heat and cover the pot.",
    "Turn the heat to high to bring the water to boil.",
    "Once it starts to boil, reduce the heat again to medium.",
    "Cover the pot with the lid.",
    "If you are making the rice in a stovetop pressure cooker, simply put the lid on the cooker and cook on high heat for 1 whistle.",
    "Don’t stir the rice while it’s cooking as this will break the grains.",
    "Cook the rice on medium heat until the water is absorbed.",
    "Let the rice cook for about 10 minutes.",
    "All the water should be absorbed, but the rice should still be a little damp.",
    "Remove the lid and stir the mixture with a wooden spoon.",
    "Then, turn off the heat.",
    "Let the rice sit for 5-10 minutes, then fluff it and add the chopped coriander.",
    "Cover the jeera rice and let it rest for 5-10 minutes.",
    "Then, stir it gently with a fork and sprinkle 2 tablespoons (5 g) of chopped coriander on top.",
    "Serve the rice as a side dish with an Indian curry or enjoy it on its own.",
    "Using a Rice Cooker Wash and soak 2 cups (400 g) of basmati rice.",
    "Rinse the rice under cool water in a sieve or colander.",
    "Put the rice in a bowl and pour warm water over it until all the rice is fully submerged.",
    "Drain the rice and add it to the rice cooker with 3 ⁄2  c (830 ml) of fresh water.",
    "Drain the rice over the sink with a colander.",
    "Discard the soak water.",
    "Add the drained rice to the rice cooker and pour 3 ⁄2 cups (830 ml) of cold water on top.",
    "Remember that the rice will expand when it’s cooked.",
    "2 cups (400 g) of jasmine rice can expand to up to 6 cups (1200 g) of cooked rice, so be sure there is enough room in your rice cooker for this expansion.",
    "If your rice cooker is too small, adjust the recipe accordingly.",
    "You can also make the jeera rice in several batches if needed.",
    "Melt 2 tbsp (30 g) of ghee in a pot over medium-high heat.",
    "Set your rice cooker aside and cook the ghee in a pot over medium-high heat.",
    "Allow it to cook for about 1 minute until it melts.",
    "You can also substitute butter or vegetable oil for the ghee.",
    "Saute cloves, cinnamon, bay leaf, and cardamom in the ghee.",
    "Add 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick to the pot.",
    "Use a spatula or a wooden spoon to spread the spices around the pan.",
    "You can also shake the pan gently to coat the spices evenly in the ghee so they don’t burn.",
    "Let them cook for 1-2 minutes.",
    "Pour 3 tsp (6.3 g) of cumin seeds into the pot and reduce the heat.",
    "Add the cumin seeds when the ghee is very hot so they will crackle and release their flavor.",
    "A few seconds after you’ve added the cumin, reduce the heat to medium-low.",
    "Cook the cumin seeds in the mixture for about 1 minute.",
    "Add the ghee mixture to the rice cooker and cook the rice.",
    "Close the lid of the rice cooker, plug it in, and press the switch to turn it on.",
    "Let the rice cook.",
    "You will hear a click when the rice is done cooking and it will turn off automatically.",
    "Some rice cookers keep the rice warm until you unplug it.",
    "Let the rice sit for 10-15 minutes, then open the rice cooker.",
    "Unplug the rice cooker.",
    "Let it sit for 10-15 minutes with the lid still on.",
    "Then, open the lid.",
    "Letting the rice rest before you open the lid will make it fluffier and less sticky.",
    "Add coriander to the rice, fluff it, and serve.",
    "After you’ve opened the lid of the rice cooker, use a fork to stir the rice.",
    "Breaking up the rice pieces will prevent clumps from forming and release trapped steam so the rice won’t overcook.",
    "Sprinkle 2 tablespoons (5 g) of chopped coriander on top.",
    "Serve the rice as a side with an Indian curry or enjoy it on its own.",
    "Preparing the Rice and Spices Separately Cook the rice and set it aside.",
    "To make the basmati rice, bring 3 ⁄2 cups (830 ml) water to boil in a pot with a pinch of salt.",
    "Add 2 cups (400 g) basmati rice.",
    "Gently stir the rice and then reduce the heat to low.",
    "Cover the pot and let it simmer for 10 minutes until all the water has absorbed into the rice.",
    "Let it sit for 5 minutes, then gently fluff the rice by mixing it with a fork.",
    "Set the rice aside while you work on the sauce.",
    "You can also prepare the rice in a pressure cooker or rice cooker.",
    "Heat 1 tbsp (15 g) of ghee in a pot over medium-high heat.",
    "Turn your stove to medium-high.",
    "Put a pot on the stove and add the ghee.",
    "Cook for about 1-2 minutes to let the ghee melt.",
    "If you don’t have ghee, use vegetable oil or butter.",
    "Saute the cumin and spices in the ghee for 1-2 minutes over low heat.",
    "Pour 3 tsp (6.3 g) of cumin seeds over the hot ghee.",
    "After a few seconds, turn the heat down to low.",
    "Then, add the 1 bay leaf, 4 green cardamoms, 4 cloves, and a 2-inch (5-cm) cinnamon stick.",
    "Saute the mixture for about 1-2 minutes.",
    "Add 1 tbsp (15 g) ghee and 2 tbsp (5 g) chopped coriander.",
    "Turn off the stove and remove the pot from the heat.",
    "Add the ghee to the mixture.",
    "Finely mince the coriander and sprinkle it on top.",
    "Mix the ingredients together with a wooden spoon.",
    "Add the rice to the pot and mix gently.",
    "Make sure your rice has cooled completely before you mix it with the cumin sauce.",
    "Stir the rice gently in the pot with a wooden spoon so that it is evenly coated.",
    "Serve the rice as a side dish with an Indian curry."
  ],
  "tyn_section":[
    "Pot with a lid",
    "Sharp knife",
    "Fork",
    "Spatula",
    "Large wooden spoon"
  ],
  "tyn_model":[
    "ghee",
    "rice",
    "pot",
    "water",
    "rice cooker",
    "cumin",
    "basmati rice",
    "wooden spoon",
    "coriander",
    "colander",
    "bowl",
    "jeera rice",
    "stove",
    "butter",
    "vegetable oil",
    "cloves",
    "green cardamoms",
    "cinnamon stick",
    "stovetop pressure cooker",
    "onion",
    "salt",
    "fork",
    "cinnamon",
    "cardamom",
    "spatula",
    "spices",
    "chili",
    "onions",
    "bay leaf",
    "green chilis",
    "red chili",
    "indian curry",
    "rice cooker wash",
    "sieve or colander",
    "fresh water",
    "cold water",
    "jasmine rice",
    "cumin seeds",
    "rice cookers",
    "pressure cooker",
    "cumin sauce"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.0487804878,
    "f1":0.0869565217,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.0731707317,
    "f1":0.1304347826
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.0731707317,
    "f1":0.1304347826
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.0731707317,
    "f1":0.1304347826
  }
}