{
  "title":"How to Grow Vegetables in New England",
  "url":"https://www.wikihow.com/Grow-Vegetables-in-New-England",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables"
  ],
  "methods":[
    {
      "name":"Establishing Your Garden",
      "steps":[
        {
          "headline":"Purchase seeds for vegetables that grow well in New England.",
          "description":"New England is in USDA zones 4 and 5. This allows you to grow plants that work well in cooler temperatures or during shorter growing seasons. Some vegetables that grow in New England include:\nAsparagus\nBeans\nLettuce\nOkra\nTomatoes\nEggplant\nCabbage\nPeas\nCorn"
        },
        {
          "headline":"Choose a spot that gets between 6-10 hours of sunlight a day.",
          "description":"Some vegetables need more sunlight than others. Check the seed packet to see how much sunlight you will need. Choose a spot away from any buildings or trees. If you don’t have a yard or good sunlight, consider renting a plot in a community garden to grow your vegetables. For example, tomatoes and eggplants require more sun than beans and cabbage."
        },
        {
          "headline":"Identify a spot with well-draining, loamy soil.",
          "description":"Loamy soil has a nice mix of clay, sand, and silt. Loamy soil tends to drain well and contains plenty of nutritious organic matter. To check drainage, dig a hole about 1 by 1 feet (0.30 m × 0.30 m). Fill it with water from a hose and time how long it takes to drain. Good soil should drain completely within 30 minutes. If water is still standing after a few hours, choose a different spot. Another way to check is to squeeze the soil. Loamy soil will hold together when squeezed. If you poke it, however, it should easily crumble."
        },
        {
          "headline":"Test the soil’s pH.",
          "description":"For most vegetables, the soil should have a pH between 6 and 6.5. Get a soil test from a garden store or hardware store. Follow the instructions to find the pH. Alternatively, take a soil sample to your local Extension office for professional testing. New England soil is typically acidic. This means that the pH is too low. Mix lime in with the soil a few weeks before planting to increase the pH. To raise the pH 1 point, buy about 7 pounds for every 100 feet (30 m) of soil. If your pH is too high, mix in sulfur. Both lime and sulfur can be bought at a garden store or  nursery. Search for your local extension office here: http://npic.orst.edu/pest/countyext.htm."
        },
        {
          "headline":"Start the seeds during their ideal growing season.",
          "description":"The seed packet will state if the seeds need to be planted before or after the last frost. Use an almanac or a weather service to determine when the last frost typically occurs in your area. Usually, the last frost is in May or April for most parts of New England. Some vegetables need to be started indoors. This means that you germinate the seeds in a pot inside before moving them outside when the weather warms up. Tomatoes, squash, lettuce, and pumpkins need to be started inside. Other vegetables can be planted outside directly in your garden. Always read the seed packet to determine the best method for your vegetables. Beans, corn, carrots, and spinach can be started outside."
        }
      ]
    },
    {
      "name":"Starting Seeds Indoors",
      "steps":[
        {
          "headline":"Fill a seedling starting tray with potting mix made for seedlings.",
          "description":"This tray contains multiple compartments. Instead of a normal potting soil, look for a soil-less mix marked for seedlings. Find these at a garden store or nursery. You can also use pots, as long as they are 2–3 inches (5.1–7.6 cm) deep and have holes on the bottom for drainage. That said, large pots are not ideal for starting seeds."
        },
        {
          "headline":"Press 2-3 seeds down into each cell of the tray.",
          "description":"Use your finger or the eraser of a pencil to gently push the seed below the surface of the potting mix. Read the seed packet to see how deep the seed needs to go. If you have too many seeds and not enough space, grow only the largest seeds."
        },
        {
          "headline":"Set the tray near a strong source of light.",
          "description":"If you can, put the tray near a south-facing window. Rotate the tray 2-3 times a day to give the seedlings equal light. Since windows can let in cold temperatures during New England winters, consider putting the tray under fluorescent grow lights. Keep the lights on for 15 hours a day."
        },
        {
          "headline":"Water the seeds using a spray bottle or a meat baster.",
          "description":"The potting mix should be moist, but there should not be any standing water in the tray or pots. If the soil looks or feel dry, give the seedlings another spritz of water. Read the seed packet to see how much water your seedlings need."
        },
        {
          "headline":"Keep the temperature between 65–75 °F (18–24 °C).",
          "description":"Some vegetables may have slightly different growing temperatures, so always do what is best for your vegetables. If it is cold outdoors, keep the plants away from drafts, entrances, and windows."
        },
        {
          "headline":"Thin seedlings when they have grown a few leaves.",
          "description":"For each pot or compartment, choose the strongest seedling to survive. Remove the weaker seedlings by cutting them with a pair of scissors. Leave 1 seedling per pot. When thinning seedlings, keep the larger seedlings and weed out the smaller ones. Get rid of any wilting or fading seedlings."
        },
        {
          "headline":"Put the seedlings outside for a few hours a day.",
          "description":"Starting 2 weeks before you plan to transplant the seedlings, set the tray outside for a short period. Start with 1 hour. Each day, gradually increase the time, until they are outside for most of the day. This process, called hardening off, will help your plants survive when you move them outside for good."
        },
        {
          "headline":"Transplant the seedlings after the last frost.",
          "description":"Read the seed packet to determine when the best time to transplant your seedlings will be. This may be anywhere from 2-6 weeks after the last frost. In your outdoor garden, dig a hole that is slightly larger than your seedling’s pot. Remove each seedling from the tray, either by gently prying it out with a spade or tipping the tray over. Keep the roots intact as you do so. Set the seedling in the hole. Gently push soil over the top of the roots. Spread mulch on top of the soil. Keep each seedling about 1 foot (0.30 m) apart. Once all the seedlings are transplanted, water them thoroughly and fertilize them with a 15-30-15 liquid fertilizer. Each seedling should get about 8 ounces (230 g) of fertilizer."
        }
      ]
    },
    {
      "name":"Sowing Seeds Outdoors",
      "steps":[
        {
          "headline":"Dig troughs about 1 foot (0.30 m) apart.",
          "description":"With a spade, dig a straight line to create a trough or trench. Make this as deep as you need to plant the seeds. To see how deep you need to make your trench, read the seed packet."
        },
        {
          "headline":"Sprinkle seeds into the trough.",
          "description":"Put groups of 2-3 seeds roughly 1 foot (0.30 m) apart. Cover the seeds by pushing the soil over from the sides of the trough on top of the seeds."
        },
        {
          "headline":"Water the seeds thoroughly.",
          "description":"Water the seeds immediately after sowing. Continue to water them daily. Look on the seed packet to see how much water your vegetables need. Some vegetables may need more water than others."
        },
        {
          "headline":"Thin the seeds once they begin to sprout.",
          "description":"Once the seedlings have grown a few leaves, remove the weaker seedlings by snipping them away at the soil line with a pair of shears or scissors. Remove smaller and wilting seedlings to give the stronger seedlings more nutrients as they grow. As you thin the seedlings, make sure to keep the stronger seedlings about 1 foot (0.30 m) apart. Never rip out seedlings. You may damage the roots of the stronger seedlings if you do this."
        },
        {
          "headline":"Spread mulch around each seedling.",
          "description":"Mulch helps retain water in the soil and prevents weeds. Once you have thinned the seedlings, spread a layer of mulch around each vegetable. You can buy mulch at garden stores or use leaves and grass clippings from your garden."
        }
      ]
    },
    {
      "name":"Tending to Your Vegetables",
      "steps":[
        {
          "headline":"Fertilize your vegetables throughout the growing season.",
          "description":"How often you need to fertilize your garden depends on the types of vegetables you are growing. Research the best fertilizing practices for your plants. Most vegetables may be fertilized when they germinate or after they are transplanted. Eggplants, for example, need more fertilizer than okra or beans. Peas and beans may not need much fertilizer at all. There are 2 common types of fertilizer. Liquid fertilizer is sprayed or poured on. It can be applied more often. Dry fertilizer releases slowly over the season. Spread the granules into the soil around the plant once or twice over the season."
        },
        {
          "headline":"Weed the garden at least once a week.",
          "description":"Pull or dig up any weeds that pop up around your vegetables. Remove their roots if possible to prevent them from growing back. If they are growing too close to your plants, cut them off at the soil level to prevent disturbing your vegetable's roots."
        },
        {
          "headline":"Eliminate any pests that eat your vegetables.",
          "description":"If you notice any holes, discolored patches, or jagged-edged leaves, you may have pests in your garden. Try to find and identify the pest so that you can get rid of them. Insects often hide under the leaf of the plant or around the stem. Blast away any bugs with water from your garden hose. Compare the pest to photographs online. Once you identify it, you can find an insecticide designed to kill it. In New England, rabbits, raccoons, and deer can also invade your garden. Use fences or row covers to keep them away from your vegetables."
        },
        {
          "headline":"Harvest your vegetables when they are ripe.",
          "description":"Keep checking your vegetables to see how they are doing. Research your vegetable so that you can identify when it is ready to be picked. Pinch, pluck, or cut off the vegetable using shears. Some plants, like beans, may have multiple harvests in a year. Others, like asparagus, may not be ready until a few years after planting. In New England, the first frost typically occurs in September. Make sure to harvest your vegetables before this."
        }
      ]
    }
  ],
  "text":" Establishing Your Garden Purchase seeds for vegetables that grow well in New England. New England is in USDA zones 4 and 5. This allows you to grow plants that work well in cooler temperatures or during shorter growing seasons. Some vegetables that grow in New England include:\nAsparagus\nBeans\nLettuce\nOkra\nTomatoes\nEggplant\nCabbage\nPeas\nCorn Choose a spot that gets between 6-10 hours of sunlight a day. Some vegetables need more sunlight than others. Check the seed packet to see how much sunlight you will need. Choose a spot away from any buildings or trees. If you don’t have a yard or good sunlight, consider renting a plot in a community garden to grow your vegetables. For example, tomatoes and eggplants require more sun than beans and cabbage. Identify a spot with well-draining, loamy soil. Loamy soil has a nice mix of clay, sand, and silt. Loamy soil tends to drain well and contains plenty of nutritious organic matter. To check drainage, dig a hole about 1 by 1 feet (0.30 m × 0.30 m). Fill it with water from a hose and time how long it takes to drain. Good soil should drain completely within 30 minutes. If water is still standing after a few hours, choose a different spot. Another way to check is to squeeze the soil. Loamy soil will hold together when squeezed. If you poke it, however, it should easily crumble. Test the soil’s pH. For most vegetables, the soil should have a pH between 6 and 6.5. Get a soil test from a garden store or hardware store. Follow the instructions to find the pH. Alternatively, take a soil sample to your local Extension office for professional testing. New England soil is typically acidic. This means that the pH is too low. Mix lime in with the soil a few weeks before planting to increase the pH. To raise the pH 1 point, buy about 7 pounds for every 100 feet (30 m) of soil. If your pH is too high, mix in sulfur. Both lime and sulfur can be bought at a garden store or  nursery. Search for your local extension office here: http://npic.orst.edu/pest/countyext.htm. Start the seeds during their ideal growing season. The seed packet will state if the seeds need to be planted before or after the last frost. Use an almanac or a weather service to determine when the last frost typically occurs in your area. Usually, the last frost is in May or April for most parts of New England. Some vegetables need to be started indoors. This means that you germinate the seeds in a pot inside before moving them outside when the weather warms up. Tomatoes, squash, lettuce, and pumpkins need to be started inside. Other vegetables can be planted outside directly in your garden. Always read the seed packet to determine the best method for your vegetables. Beans, corn, carrots, and spinach can be started outside. Starting Seeds Indoors Fill a seedling starting tray with potting mix made for seedlings. This tray contains multiple compartments. Instead of a normal potting soil, look for a soil-less mix marked for seedlings. Find these at a garden store or nursery. You can also use pots, as long as they are 2–3 inches (5.1–7.6 cm) deep and have holes on the bottom for drainage. That said, large pots are not ideal for starting seeds. Press 2-3 seeds down into each cell of the tray. Use your finger or the eraser of a pencil to gently push the seed below the surface of the potting mix. Read the seed packet to see how deep the seed needs to go. If you have too many seeds and not enough space, grow only the largest seeds. Set the tray near a strong source of light. If you can, put the tray near a south-facing window. Rotate the tray 2-3 times a day to give the seedlings equal light. Since windows can let in cold temperatures during New England winters, consider putting the tray under fluorescent grow lights. Keep the lights on for 15 hours a day. Water the seeds using a spray bottle or a meat baster. The potting mix should be moist, but there should not be any standing water in the tray or pots. If the soil looks or feel dry, give the seedlings another spritz of water. Read the seed packet to see how much water your seedlings need. Keep the temperature between 65–75 °F (18–24 °C). Some vegetables may have slightly different growing temperatures, so always do what is best for your vegetables. If it is cold outdoors, keep the plants away from drafts, entrances, and windows. Thin seedlings when they have grown a few leaves. For each pot or compartment, choose the strongest seedling to survive. Remove the weaker seedlings by cutting them with a pair of scissors. Leave 1 seedling per pot. When thinning seedlings, keep the larger seedlings and weed out the smaller ones. Get rid of any wilting or fading seedlings. Put the seedlings outside for a few hours a day. Starting 2 weeks before you plan to transplant the seedlings, set the tray outside for a short period. Start with 1 hour. Each day, gradually increase the time, until they are outside for most of the day. This process, called hardening off, will help your plants survive when you move them outside for good. Transplant the seedlings after the last frost. Read the seed packet to determine when the best time to transplant your seedlings will be. This may be anywhere from 2-6 weeks after the last frost. In your outdoor garden, dig a hole that is slightly larger than your seedling’s pot. Remove each seedling from the tray, either by gently prying it out with a spade or tipping the tray over. Keep the roots intact as you do so. Set the seedling in the hole. Gently push soil over the top of the roots. Spread mulch on top of the soil. Keep each seedling about 1 foot (0.30 m) apart. Once all the seedlings are transplanted, water them thoroughly and fertilize them with a 15-30-15 liquid fertilizer. Each seedling should get about 8 ounces (230 g) of fertilizer. Sowing Seeds Outdoors Dig troughs about 1 foot (0.30 m) apart. With a spade, dig a straight line to create a trough or trench. Make this as deep as you need to plant the seeds. To see how deep you need to make your trench, read the seed packet. Sprinkle seeds into the trough. Put groups of 2-3 seeds roughly 1 foot (0.30 m) apart. Cover the seeds by pushing the soil over from the sides of the trough on top of the seeds. Water the seeds thoroughly. Water the seeds immediately after sowing. Continue to water them daily. Look on the seed packet to see how much water your vegetables need. Some vegetables may need more water than others. Thin the seeds once they begin to sprout. Once the seedlings have grown a few leaves, remove the weaker seedlings by snipping them away at the soil line with a pair of shears or scissors. Remove smaller and wilting seedlings to give the stronger seedlings more nutrients as they grow. As you thin the seedlings, make sure to keep the stronger seedlings about 1 foot (0.30 m) apart. Never rip out seedlings. You may damage the roots of the stronger seedlings if you do this. Spread mulch around each seedling. Mulch helps retain water in the soil and prevents weeds. Once you have thinned the seedlings, spread a layer of mulch around each vegetable. You can buy mulch at garden stores or use leaves and grass clippings from your garden. Tending to Your Vegetables Fertilize your vegetables throughout the growing season. How often you need to fertilize your garden depends on the types of vegetables you are growing. Research the best fertilizing practices for your plants. Most vegetables may be fertilized when they germinate or after they are transplanted. Eggplants, for example, need more fertilizer than okra or beans. Peas and beans may not need much fertilizer at all. There are 2 common types of fertilizer. Liquid fertilizer is sprayed or poured on. It can be applied more often. Dry fertilizer releases slowly over the season. Spread the granules into the soil around the plant once or twice over the season. Weed the garden at least once a week. Pull or dig up any weeds that pop up around your vegetables. Remove their roots if possible to prevent them from growing back. If they are growing too close to your plants, cut them off at the soil level to prevent disturbing your vegetable's roots. Eliminate any pests that eat your vegetables. If you notice any holes, discolored patches, or jagged-edged leaves, you may have pests in your garden. Try to find and identify the pest so that you can get rid of them. Insects often hide under the leaf of the plant or around the stem. Blast away any bugs with water from your garden hose. Compare the pest to photographs online. Once you identify it, you can find an insecticide designed to kill it. In New England, rabbits, raccoons, and deer can also invade your garden. Use fences or row covers to keep them away from your vegetables. Harvest your vegetables when they are ripe. Keep checking your vegetables to see how they are doing. Research your vegetable so that you can identify when it is ready to be picked. Pinch, pluck, or cut off the vegetable using shears. Some plants, like beans, may have multiple harvests in a year. Others, like asparagus, may not be ready until a few years after planting. In New England, the first frost typically occurs in September. Make sure to harvest your vegetables before this.",
  "sentences":[
    " Establishing Your Garden Purchase seeds for vegetables that grow well in New England.",
    "New England is in USDA zones 4 and 5.",
    "This allows you to grow plants that work well in cooler temperatures or during shorter growing seasons.",
    "Some vegetables that grow in New England include:\nAsparagus\nBeans\nLettuce\nOkra\nTomatoes\nEggplant\nCabbage\nPeas\nCorn Choose a spot that gets between 6-10 hours of sunlight a day.",
    "Some vegetables need more sunlight than others.",
    "Check the seed packet to see how much sunlight you will need.",
    "Choose a spot away from any buildings or trees.",
    "If you don’t have a yard or good sunlight, consider renting a plot in a community garden to grow your vegetables.",
    "For example, tomatoes and eggplants require more sun than beans and cabbage.",
    "Identify a spot with well-draining, loamy soil.",
    "Loamy soil has a nice mix of clay, sand, and silt.",
    "Loamy soil tends to drain well and contains plenty of nutritious organic matter.",
    "To check drainage, dig a hole about 1 by 1 feet (0.30 m × 0.30 m).",
    "Fill it with water from a hose and time how long it takes to drain.",
    "Good soil should drain completely within 30 minutes.",
    "If water is still standing after a few hours, choose a different spot.",
    "Another way to check is to squeeze the soil.",
    "Loamy soil will hold together when squeezed.",
    "If you poke it, however, it should easily crumble.",
    "Test the soil’s pH.",
    "For most vegetables, the soil should have a pH between 6 and 6.5.",
    "Get a soil test from a garden store or hardware store.",
    "Follow the instructions to find the pH.",
    "Alternatively, take a soil sample to your local Extension office for professional testing.",
    "New England soil is typically acidic.",
    "This means that the pH is too low.",
    "Mix lime in with the soil a few weeks before planting to increase the pH.",
    "To raise the pH 1 point, buy about 7 pounds for every 100 feet (30 m) of soil.",
    "If your pH is too high, mix in sulfur.",
    "Both lime and sulfur can be bought at a garden store or  nursery.",
    "Search for your local extension office here: http://npic.orst.edu/pest/countyext.htm.",
    "Start the seeds during their ideal growing season.",
    "The seed packet will state if the seeds need to be planted before or after the last frost.",
    "Use an almanac or a weather service to determine when the last frost typically occurs in your area.",
    "Usually, the last frost is in May or April for most parts of New England.",
    "Some vegetables need to be started indoors.",
    "This means that you germinate the seeds in a pot inside before moving them outside when the weather warms up.",
    "Tomatoes, squash, lettuce, and pumpkins need to be started inside.",
    "Other vegetables can be planted outside directly in your garden.",
    "Always read the seed packet to determine the best method for your vegetables.",
    "Beans, corn, carrots, and spinach can be started outside.",
    "Starting Seeds Indoors Fill a seedling starting tray with potting mix made for seedlings.",
    "This tray contains multiple compartments.",
    "Instead of a normal potting soil, look for a soil-less mix marked for seedlings.",
    "Find these at a garden store or nursery.",
    "You can also use pots, as long as they are 2–3 inches (5.1–7.6 cm) deep and have holes on the bottom for drainage.",
    "That said, large pots are not ideal for starting seeds.",
    "Press 2-3 seeds down into each cell of the tray.",
    "Use your finger or the eraser of a pencil to gently push the seed below the surface of the potting mix.",
    "Read the seed packet to see how deep the seed needs to go.",
    "If you have too many seeds and not enough space, grow only the largest seeds.",
    "Set the tray near a strong source of light.",
    "If you can, put the tray near a south-facing window.",
    "Rotate the tray 2-3 times a day to give the seedlings equal light.",
    "Since windows can let in cold temperatures during New England winters, consider putting the tray under fluorescent grow lights.",
    "Keep the lights on for 15 hours a day.",
    "Water the seeds using a spray bottle or a meat baster.",
    "The potting mix should be moist, but there should not be any standing water in the tray or pots.",
    "If the soil looks or feel dry, give the seedlings another spritz of water.",
    "Read the seed packet to see how much water your seedlings need.",
    "Keep the temperature between 65–75 °F (18–24 °C).",
    "Some vegetables may have slightly different growing temperatures, so always do what is best for your vegetables.",
    "If it is cold outdoors, keep the plants away from drafts, entrances, and windows.",
    "Thin seedlings when they have grown a few leaves.",
    "For each pot or compartment, choose the strongest seedling to survive.",
    "Remove the weaker seedlings by cutting them with a pair of scissors.",
    "Leave 1 seedling per pot.",
    "When thinning seedlings, keep the larger seedlings and weed out the smaller ones.",
    "Get rid of any wilting or fading seedlings.",
    "Put the seedlings outside for a few hours a day.",
    "Starting 2 weeks before you plan to transplant the seedlings, set the tray outside for a short period.",
    "Start with 1 hour.",
    "Each day, gradually increase the time, until they are outside for most of the day.",
    "This process, called hardening off, will help your plants survive when you move them outside for good.",
    "Transplant the seedlings after the last frost.",
    "Read the seed packet to determine when the best time to transplant your seedlings will be.",
    "This may be anywhere from 2-6 weeks after the last frost.",
    "In your outdoor garden, dig a hole that is slightly larger than your seedling’s pot.",
    "Remove each seedling from the tray, either by gently prying it out with a spade or tipping the tray over.",
    "Keep the roots intact as you do so.",
    "Set the seedling in the hole.",
    "Gently push soil over the top of the roots.",
    "Spread mulch on top of the soil.",
    "Keep each seedling about 1 foot (0.30 m) apart.",
    "Once all the seedlings are transplanted, water them thoroughly and fertilize them with a 15-30-15 liquid fertilizer.",
    "Each seedling should get about 8 ounces (230 g) of fertilizer.",
    "Sowing Seeds Outdoors Dig troughs about 1 foot (0.30 m) apart.",
    "With a spade, dig a straight line to create a trough or trench.",
    "Make this as deep as you need to plant the seeds.",
    "To see how deep you need to make your trench, read the seed packet.",
    "Sprinkle seeds into the trough.",
    "Put groups of 2-3 seeds roughly 1 foot (0.30 m) apart.",
    "Cover the seeds by pushing the soil over from the sides of the trough on top of the seeds.",
    "Water the seeds thoroughly.",
    "Water the seeds immediately after sowing.",
    "Continue to water them daily.",
    "Look on the seed packet to see how much water your vegetables need.",
    "Some vegetables may need more water than others.",
    "Thin the seeds once they begin to sprout.",
    "Once the seedlings have grown a few leaves, remove the weaker seedlings by snipping them away at the soil line with a pair of shears or scissors.",
    "Remove smaller and wilting seedlings to give the stronger seedlings more nutrients as they grow.",
    "As you thin the seedlings, make sure to keep the stronger seedlings about 1 foot (0.30 m) apart.",
    "Never rip out seedlings.",
    "You may damage the roots of the stronger seedlings if you do this.",
    "Spread mulch around each seedling.",
    "Mulch helps retain water in the soil and prevents weeds.",
    "Once you have thinned the seedlings, spread a layer of mulch around each vegetable.",
    "You can buy mulch at garden stores or use leaves and grass clippings from your garden.",
    "Tending to Your Vegetables Fertilize your vegetables throughout the growing season.",
    "How often you need to fertilize your garden depends on the types of vegetables you are growing.",
    "Research the best fertilizing practices for your plants.",
    "Most vegetables may be fertilized when they germinate or after they are transplanted.",
    "Eggplants, for example, need more fertilizer than okra or beans.",
    "Peas and beans may not need much fertilizer at all.",
    "There are 2 common types of fertilizer.",
    "Liquid fertilizer is sprayed or poured on.",
    "It can be applied more often.",
    "Dry fertilizer releases slowly over the season.",
    "Spread the granules into the soil around the plant once or twice over the season.",
    "Weed the garden at least once a week.",
    "Pull or dig up any weeds that pop up around your vegetables.",
    "Remove their roots if possible to prevent them from growing back.",
    "If they are growing too close to your plants, cut them off at the soil level to prevent disturbing your vegetable's roots.",
    "Eliminate any pests that eat your vegetables.",
    "If you notice any holes, discolored patches, or jagged-edged leaves, you may have pests in your garden.",
    "Try to find and identify the pest so that you can get rid of them.",
    "Insects often hide under the leaf of the plant or around the stem.",
    "Blast away any bugs with water from your garden hose.",
    "Compare the pest to photographs online.",
    "Once you identify it, you can find an insecticide designed to kill it.",
    "In New England, rabbits, raccoons, and deer can also invade your garden.",
    "Use fences or row covers to keep them away from your vegetables.",
    "Harvest your vegetables when they are ripe.",
    "Keep checking your vegetables to see how they are doing.",
    "Research your vegetable so that you can identify when it is ready to be picked.",
    "Pinch, pluck, or cut off the vegetable using shears.",
    "Some plants, like beans, may have multiple harvests in a year.",
    "Others, like asparagus, may not be ready until a few years after planting.",
    "In New England, the first frost typically occurs in September.",
    "Make sure to harvest your vegetables before this."
  ],
  "tyn_section":[
    "Seeds",
    "Soil pH test",
    "Soil-less potting mix",
    "Seedling tray",
    "Spray bottle or meat baster",
    "Scissors or shears",
    "Spade",
    "Fluorescent grow lights (optional)",
    "Fertilizer",
    "Mulch",
    "Gardening hose or watering can",
    "Shears",
    "Insecticides"
  ],
  "tyn_model":[
    "vegetables",
    "water",
    "tray",
    "fertilizer",
    "mulch",
    "tomatoes",
    "potting mix",
    "asparagus",
    "beans",
    "lettuce",
    "corn",
    "garden store",
    "lime",
    "sulfur",
    "pots",
    "spade",
    "seeds",
    "okra",
    "cabbage",
    "peas",
    "× 0.30",
    "hose",
    "garden store or",
    "pot",
    "squash",
    "pumpkins",
    "carrots",
    "spinach",
    "potting soil",
    "pencil",
    "spray bottle",
    "meat baster",
    "scissors",
    "soil",
    "garden hose",
    "shears"
  ],
  "simple_metrics":{
    "r":0.3846153846,
    "p":0.1388888889,
    "f1":0.2040816327,
    "avg_pos":0.4444444444
  },
  "jacc_metrics_0.5":{
    "r":0.5384615385,
    "p":0.1944444444,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7692307692,
    "p":0.3055555556,
    "f1":0.4373757455
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4615384615,
    "p":0.1666666667,
    "f1":0.2448979592
  }
}