{
  "title":"How to Clean Soot off Furniture",
  "url":"https://www.wikihow.com/Clean-Soot-off-Furniture",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Cleaning Finished Wood",
      "steps":[
        {
          "headline":"Clean the wood with a HEPA vacuum or lambswool duster.",
          "description":"These will pick up much of the dry soot that you’ll want to get rid of before starting to clean deeper into the wood. HEPA stands for high efficiency particle arrestance. HEPA vacuums will be marked as such on their packaging or in their owner’s manual. Soot and smoke can leave behind dangerous particles in the air, and HEPA vacuums will pick up more particles than regular vacuum cleaners."
        },
        {
          "headline":"Scrub the wood with a dry chemical sponge.",
          "description":"Wipe the sponge across the soot in straight lines until the surface of the sponge turns black. Turn it over and use another side until all sides are black, then carefully shave off the surface of the sponge using a knife to expose a new, clean layer to clean with. This will ensure that you don’t scrub the soot back into the wood. Scrub gently. Pressing too hard could embed the soot particles into the wood grain. Make sure to use a dry sponge, which will pick up loose soot without rubbing it into the wood, rather than a sponge meant to be used with water."
        },
        {
          "headline":"Clean with a wood cleaner if the wood has been affected by oily smoke.",
          "description":"Run your finger over the surface of the soot. If it smears, the wood has been affected by oily smoke. Closely follow the directions on your wood cleaner and use it to clean the surface of the wood with a cotton rag. You can also use Murphy Oil Soap."
        },
        {
          "headline":"Scrub with steel wool in the direction of the grain.",
          "description":"0000 grade steel wool will remove tougher residue. Scrub gently in the same direction of the wood grain in order to preserve the finish of the wood. Determine the direction of the wood grain by looking closely at the small lines in the wood. The direction that they point will be the direction of the grain."
        },
        {
          "headline":"Use a diluted solution of degreaser and water.",
          "description":"If oily soot remains on the wood, dilute a small amount of degreaser in a large bowl or bucket of water and spread it over the surface of the wood. Rinse well with a wet cloth and dry gently with a soft towel."
        },
        {
          "headline":"Polish the wood if you used a degreaser.",
          "description":"Rub a bit of polish onto an old cloth or paper towel and rub it gently into the wood."
        }
      ]
    },
    {
      "name":"Removing Soot from Unfinished Wood",
      "steps":[
        {
          "headline":"Spray the wood with an odor-removing spray.",
          "description":"Look for a spray created specifically to deodorize the pervasive smell of smoke and mist it lightly over the surface."
        },
        {
          "headline":"Remove dry soot with a vacuum hose.",
          "description":"If possible, use a HEPA vacuum for a deeper clean. Hold the hose slightly above the wood and run it over the sooty areas. This will pick up much of the loose soot, as well as smaller particles that get into the air. You can also use a lambswool duster."
        },
        {
          "headline":"Scrub soot residue with a chemical sponge.",
          "description":"Wipe straight across the surface of the wood and turn the sponge over when one side turns black. Carefully cut away blackened parts with a knife to expose new, clean layers to use."
        },
        {
          "headline":"Apply a degreaser to the wood.",
          "description":"Dilute a small amount of degreaser in a large amount of water and use a pump-up sprayer or spray bottle to spray it evenly onto your wood. Wipe the surface with a nylon brush after you’ve applied the solution. Rinse the surface with water to clean off the product. You can also use old, clean window spray bottles or any other empty spray bottles you have around the house to apply the degreasing spray. Make sure to clean the bottle thoroughly with soap and water after you’ve finished spraying."
        },
        {
          "headline":"Sand away any remaining stains.",
          "description":"Unfinished wood is more sensitive and easily stained by soot than finished wood. If you can’t remove the soot by other measures, sand the stain away with fine grit sandpaper. Do not use sandpaper on finished wood, as it will remove the finish. Sandpaper typically doesn’t work on heavy stains that extend deeply into the grains."
        },
        {
          "headline":"Call a professional if you need more help.",
          "description":"If your wood furniture still smells smoky or looks stained, call a professional furniture cleaner for a consultation."
        }
      ]
    },
    {
      "name":"Cleaning Leather Upholstery",
      "steps":[
        {
          "headline":"Vacuum soot with a flat brush attachment.",
          "description":"Hold the vacuum attachment just above the surface of the leather to avoid rubbing the soot into the upholstery. Feel free to use a HEPA vacuum if you want, but it’s not mandatory."
        },
        {
          "headline":"Clean the leather with a soft cloth and leather soap.",
          "description":"Dampen the cloth and apply a small amount of soap, rubbing it to a slight lather. Gently run it across the leather surface, being careful not to scrub too hard and work the soap into the leather. Use a clean, damp rag to wipe off the leather. Condition the leather afterwards with a leather conditioner. Apply a small amount on a rag, reapplying as necessary, and gently rub a thin, even coat onto the surface of the leather. Let it absorb for at least two hours, or overnight if possible."
        },
        {
          "headline":"Remove the smoky odor with a vinegar and water mixture.",
          "description":"Mix about a couple spoonfuls of vinegar in a medium-sized bowl of water and stir. Dip a cloth into the mixture and run it over the surface of the leather, then rinse it with a clean, damp cloth."
        },
        {
          "headline":"Sprinkle the surface with baking soda if the smell persists.",
          "description":"Baking soda is very good at soaking up smoky smells, so sprinkle a light, even layer over your leather upholstery and leave it overnight. Vacuum the baking soda with a vacuum hose the next morning, being careful not to touch the hose to the surface. Repeat if necessary."
        },
        {
          "headline":"Call a professional to clean highly damaged leather.",
          "description":"If the smell and soot stains persist, call a restoration cleaner and ask what options are available to you. Steam cleaning from a professional, for example, can save heavily-damaged leather that you can’t salvage on your own."
        }
      ]
    },
    {
      "name":"Cleaning Cloth Upholstery",
      "steps":[
        {
          "headline":"Vacuum the soot with the plain hose attachment.",
          "description":"Avoid using the flat brush attachment, as this could embed the soot deeper into the fabric. Hold the nozzle slightly above the surface and directly above the soot stains. Feel free to use a HEPA vacuum if you want, but it’s not mandatory."
        },
        {
          "headline":"Sprinkle a few pinches of baking soda on the surface.",
          "description":"Let it sit for 24 hours, then vacuum it and repeat as necessary. The baking soda will absorb the smoky odor."
        },
        {
          "headline":"Wash removable pillows or covers following brand instructions.",
          "description":"You may be able to throw them in the washing machine on a cold cycle, but be sure to read the tags or instructions to see if you need to take any special care. Use a liquid detergent followed by a combination of powder detergent and bleach if necessary. You may need to wash these coverings several times before the soot comes out completely."
        },
        {
          "headline":"Spray the furniture with a smoke-specific odor-removing product.",
          "description":"Follow the product directions closely and lightly spray across the surface of the upholstery. Rinse with a damp cloth."
        },
        {
          "headline":"Ask a professional for help.",
          "description":"Call your local upholstery cleaners and ask for their recommendations, or get in touch with your dry cleaners to see if your cloth upholstery can be brought in for a deep cleaning."
        }
      ]
    }
  ],
  "text":" Cleaning Finished Wood Clean the wood with a HEPA vacuum or lambswool duster. These will pick up much of the dry soot that you’ll want to get rid of before starting to clean deeper into the wood. HEPA stands for high efficiency particle arrestance. HEPA vacuums will be marked as such on their packaging or in their owner’s manual. Soot and smoke can leave behind dangerous particles in the air, and HEPA vacuums will pick up more particles than regular vacuum cleaners. Scrub the wood with a dry chemical sponge. Wipe the sponge across the soot in straight lines until the surface of the sponge turns black. Turn it over and use another side until all sides are black, then carefully shave off the surface of the sponge using a knife to expose a new, clean layer to clean with. This will ensure that you don’t scrub the soot back into the wood. Scrub gently. Pressing too hard could embed the soot particles into the wood grain. Make sure to use a dry sponge, which will pick up loose soot without rubbing it into the wood, rather than a sponge meant to be used with water. Clean with a wood cleaner if the wood has been affected by oily smoke. Run your finger over the surface of the soot. If it smears, the wood has been affected by oily smoke. Closely follow the directions on your wood cleaner and use it to clean the surface of the wood with a cotton rag. You can also use Murphy Oil Soap. Scrub with steel wool in the direction of the grain. 0000 grade steel wool will remove tougher residue. Scrub gently in the same direction of the wood grain in order to preserve the finish of the wood. Determine the direction of the wood grain by looking closely at the small lines in the wood. The direction that they point will be the direction of the grain. Use a diluted solution of degreaser and water. If oily soot remains on the wood, dilute a small amount of degreaser in a large bowl or bucket of water and spread it over the surface of the wood. Rinse well with a wet cloth and dry gently with a soft towel. Polish the wood if you used a degreaser. Rub a bit of polish onto an old cloth or paper towel and rub it gently into the wood. Removing Soot from Unfinished Wood Spray the wood with an odor-removing spray. Look for a spray created specifically to deodorize the pervasive smell of smoke and mist it lightly over the surface. Remove dry soot with a vacuum hose. If possible, use a HEPA vacuum for a deeper clean. Hold the hose slightly above the wood and run it over the sooty areas. This will pick up much of the loose soot, as well as smaller particles that get into the air. You can also use a lambswool duster. Scrub soot residue with a chemical sponge. Wipe straight across the surface of the wood and turn the sponge over when one side turns black. Carefully cut away blackened parts with a knife to expose new, clean layers to use. Apply a degreaser to the wood. Dilute a small amount of degreaser in a large amount of water and use a pump-up sprayer or spray bottle to spray it evenly onto your wood. Wipe the surface with a nylon brush after you’ve applied the solution. Rinse the surface with water to clean off the product. You can also use old, clean window spray bottles or any other empty spray bottles you have around the house to apply the degreasing spray. Make sure to clean the bottle thoroughly with soap and water after you’ve finished spraying. Sand away any remaining stains. Unfinished wood is more sensitive and easily stained by soot than finished wood. If you can’t remove the soot by other measures, sand the stain away with fine grit sandpaper. Do not use sandpaper on finished wood, as it will remove the finish. Sandpaper typically doesn’t work on heavy stains that extend deeply into the grains. Call a professional if you need more help. If your wood furniture still smells smoky or looks stained, call a professional furniture cleaner for a consultation. Cleaning Leather Upholstery Vacuum soot with a flat brush attachment. Hold the vacuum attachment just above the surface of the leather to avoid rubbing the soot into the upholstery. Feel free to use a HEPA vacuum if you want, but it’s not mandatory. Clean the leather with a soft cloth and leather soap. Dampen the cloth and apply a small amount of soap, rubbing it to a slight lather. Gently run it across the leather surface, being careful not to scrub too hard and work the soap into the leather. Use a clean, damp rag to wipe off the leather. Condition the leather afterwards with a leather conditioner. Apply a small amount on a rag, reapplying as necessary, and gently rub a thin, even coat onto the surface of the leather. Let it absorb for at least two hours, or overnight if possible. Remove the smoky odor with a vinegar and water mixture. Mix about a couple spoonfuls of vinegar in a medium-sized bowl of water and stir. Dip a cloth into the mixture and run it over the surface of the leather, then rinse it with a clean, damp cloth. Sprinkle the surface with baking soda if the smell persists. Baking soda is very good at soaking up smoky smells, so sprinkle a light, even layer over your leather upholstery and leave it overnight. Vacuum the baking soda with a vacuum hose the next morning, being careful not to touch the hose to the surface. Repeat if necessary. Call a professional to clean highly damaged leather. If the smell and soot stains persist, call a restoration cleaner and ask what options are available to you. Steam cleaning from a professional, for example, can save heavily-damaged leather that you can’t salvage on your own. Cleaning Cloth Upholstery Vacuum the soot with the plain hose attachment. Avoid using the flat brush attachment, as this could embed the soot deeper into the fabric. Hold the nozzle slightly above the surface and directly above the soot stains. Feel free to use a HEPA vacuum if you want, but it’s not mandatory. Sprinkle a few pinches of baking soda on the surface. Let it sit for 24 hours, then vacuum it and repeat as necessary. The baking soda will absorb the smoky odor. Wash removable pillows or covers following brand instructions. You may be able to throw them in the washing machine on a cold cycle, but be sure to read the tags or instructions to see if you need to take any special care. Use a liquid detergent followed by a combination of powder detergent and bleach if necessary. You may need to wash these coverings several times before the soot comes out completely. Spray the furniture with a smoke-specific odor-removing product. Follow the product directions closely and lightly spray across the surface of the upholstery. Rinse with a damp cloth. Ask a professional for help. Call your local upholstery cleaners and ask for their recommendations, or get in touch with your dry cleaners to see if your cloth upholstery can be brought in for a deep cleaning.",
  "sentences":[
    " Cleaning Finished Wood Clean the wood with a HEPA vacuum or lambswool duster.",
    "These will pick up much of the dry soot that you’ll want to get rid of before starting to clean deeper into the wood.",
    "HEPA stands for high efficiency particle arrestance.",
    "HEPA vacuums will be marked as such on their packaging or in their owner’s manual.",
    "Soot and smoke can leave behind dangerous particles in the air, and HEPA vacuums will pick up more particles than regular vacuum cleaners.",
    "Scrub the wood with a dry chemical sponge.",
    "Wipe the sponge across the soot in straight lines until the surface of the sponge turns black.",
    "Turn it over and use another side until all sides are black, then carefully shave off the surface of the sponge using a knife to expose a new, clean layer to clean with.",
    "This will ensure that you don’t scrub the soot back into the wood.",
    "Scrub gently.",
    "Pressing too hard could embed the soot particles into the wood grain.",
    "Make sure to use a dry sponge, which will pick up loose soot without rubbing it into the wood, rather than a sponge meant to be used with water.",
    "Clean with a wood cleaner if the wood has been affected by oily smoke.",
    "Run your finger over the surface of the soot.",
    "If it smears, the wood has been affected by oily smoke.",
    "Closely follow the directions on your wood cleaner and use it to clean the surface of the wood with a cotton rag.",
    "You can also use Murphy Oil Soap.",
    "Scrub with steel wool in the direction of the grain.",
    "0000 grade steel wool will remove tougher residue.",
    "Scrub gently in the same direction of the wood grain in order to preserve the finish of the wood.",
    "Determine the direction of the wood grain by looking closely at the small lines in the wood.",
    "The direction that they point will be the direction of the grain.",
    "Use a diluted solution of degreaser and water.",
    "If oily soot remains on the wood, dilute a small amount of degreaser in a large bowl or bucket of water and spread it over the surface of the wood.",
    "Rinse well with a wet cloth and dry gently with a soft towel.",
    "Polish the wood if you used a degreaser.",
    "Rub a bit of polish onto an old cloth or paper towel and rub it gently into the wood.",
    "Removing Soot from Unfinished Wood Spray the wood with an odor-removing spray.",
    "Look for a spray created specifically to deodorize the pervasive smell of smoke and mist it lightly over the surface.",
    "Remove dry soot with a vacuum hose.",
    "If possible, use a HEPA vacuum for a deeper clean.",
    "Hold the hose slightly above the wood and run it over the sooty areas.",
    "This will pick up much of the loose soot, as well as smaller particles that get into the air.",
    "You can also use a lambswool duster.",
    "Scrub soot residue with a chemical sponge.",
    "Wipe straight across the surface of the wood and turn the sponge over when one side turns black.",
    "Carefully cut away blackened parts with a knife to expose new, clean layers to use.",
    "Apply a degreaser to the wood.",
    "Dilute a small amount of degreaser in a large amount of water and use a pump-up sprayer or spray bottle to spray it evenly onto your wood.",
    "Wipe the surface with a nylon brush after you’ve applied the solution.",
    "Rinse the surface with water to clean off the product.",
    "You can also use old, clean window spray bottles or any other empty spray bottles you have around the house to apply the degreasing spray.",
    "Make sure to clean the bottle thoroughly with soap and water after you’ve finished spraying.",
    "Sand away any remaining stains.",
    "Unfinished wood is more sensitive and easily stained by soot than finished wood.",
    "If you can’t remove the soot by other measures, sand the stain away with fine grit sandpaper.",
    "Do not use sandpaper on finished wood, as it will remove the finish.",
    "Sandpaper typically doesn’t work on heavy stains that extend deeply into the grains.",
    "Call a professional if you need more help.",
    "If your wood furniture still smells smoky or looks stained, call a professional furniture cleaner for a consultation.",
    "Cleaning Leather Upholstery Vacuum soot with a flat brush attachment.",
    "Hold the vacuum attachment just above the surface of the leather to avoid rubbing the soot into the upholstery.",
    "Feel free to use a HEPA vacuum if you want, but it’s not mandatory.",
    "Clean the leather with a soft cloth and leather soap.",
    "Dampen the cloth and apply a small amount of soap, rubbing it to a slight lather.",
    "Gently run it across the leather surface, being careful not to scrub too hard and work the soap into the leather.",
    "Use a clean, damp rag to wipe off the leather.",
    "Condition the leather afterwards with a leather conditioner.",
    "Apply a small amount on a rag, reapplying as necessary, and gently rub a thin, even coat onto the surface of the leather.",
    "Let it absorb for at least two hours, or overnight if possible.",
    "Remove the smoky odor with a vinegar and water mixture.",
    "Mix about a couple spoonfuls of vinegar in a medium-sized bowl of water and stir.",
    "Dip a cloth into the mixture and run it over the surface of the leather, then rinse it with a clean, damp cloth.",
    "Sprinkle the surface with baking soda if the smell persists.",
    "Baking soda is very good at soaking up smoky smells, so sprinkle a light, even layer over your leather upholstery and leave it overnight.",
    "Vacuum the baking soda with a vacuum hose the next morning, being careful not to touch the hose to the surface.",
    "Repeat if necessary.",
    "Call a professional to clean highly damaged leather.",
    "If the smell and soot stains persist, call a restoration cleaner and ask what options are available to you.",
    "Steam cleaning from a professional, for example, can save heavily-damaged leather that you can’t salvage on your own.",
    "Cleaning Cloth Upholstery Vacuum the soot with the plain hose attachment.",
    "Avoid using the flat brush attachment, as this could embed the soot deeper into the fabric.",
    "Hold the nozzle slightly above the surface and directly above the soot stains.",
    "Feel free to use a HEPA vacuum if you want, but it’s not mandatory.",
    "Sprinkle a few pinches of baking soda on the surface.",
    "Let it sit for 24 hours, then vacuum it and repeat as necessary.",
    "The baking soda will absorb the smoky odor.",
    "Wash removable pillows or covers following brand instructions.",
    "You may be able to throw them in the washing machine on a cold cycle, but be sure to read the tags or instructions to see if you need to take any special care.",
    "Use a liquid detergent followed by a combination of powder detergent and bleach if necessary.",
    "You may need to wash these coverings several times before the soot comes out completely.",
    "Spray the furniture with a smoke-specific odor-removing product.",
    "Follow the product directions closely and lightly spray across the surface of the upholstery.",
    "Rinse with a damp cloth.",
    "Ask a professional for help.",
    "Call your local upholstery cleaners and ask for their recommendations, or get in touch with your dry cleaners to see if your cloth upholstery can be brought in for a deep cleaning."
  ],
  "tyn_section":[
    "Vacuum cleaner",
    "Dry chemical sponge",
    "Sharp knife",
    "Water",
    "Degreasing product",
    "Fine grain sandpaper",
    "Washing machine",
    "Terry cloth or microfiber rags",
    "Leather cleaner",
    "Vinegar",
    "Baking soda",
    "Leather soap",
    "Leather conditioner",
    "Deodorizing sprays",
    "Plastic sheets"
  ],
  "tyn_model":[
    "water",
    "sponge",
    "baking soda",
    "hepa vacuum",
    "degreaser",
    "hose",
    "soap",
    "lambswool duster",
    "hepa vacuums",
    "chemical sponge",
    "knife",
    "wood cleaner",
    "vacuum hose",
    "sandpaper",
    "vacuum",
    "vinegar",
    "high efficiency particle arrestance",
    "vacuum cleaners",
    "cotton rag",
    "murphy oil soap",
    "steel wool",
    "paper towel",
    "nylon brush",
    "fine grit sandpaper",
    "flat brush",
    "leather soap",
    "leather conditioner",
    "rag",
    "cloth",
    "restoration cleaner",
    "liquid detergent",
    "powder detergent",
    "bleach",
    "upholstery cleaners",
    "dry cleaners"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1428571429,
    "f1":0.2,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.2857142857,
    "f1":0.3870967742
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.4857142857,
    "f1":0.5619834711
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1714285714,
    "f1":0.24
  }
}