{
  "title":"How to Brew Tea With a Teapot",
  "url":"https://www.wikihow.com/Brew-Tea-With-a-Teapot",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Tea",
    "Tea Accessories",
    "Teapots"
  ],
  "steps":[
    {
      "headline":"Boil enough water for the pot, to fill it to just below where the lid will sit.",
      "description":""
    },
    {
      "headline":"While the water is coming to the boil, put a cup full of hot water in the pot and swill it around, before tipping it out.",
      "description":"This warms the pot, and helps the tea brew faster."
    },
    {
      "headline":"Add the tea to the pot.",
      "description":"The old rule used to be of one for the pot, and one for each person. If using tea leaves,  measuring out the leaves with a teaspoon. Otherwise use a tea bag for each person. Nowadays we drink tea somewhat weaker. Experiment, and discover your own preference."
    },
    {
      "headline":"Add the boiling water - Always use freshly boiling water for a superior brew.",
      "description":"Using re-boiled water gives a peculiarly lifeless taste to the brew."
    },
    {
      "headline":"Allow the pot to stand for between one and six minutes to brew, depending on taste.",
      "description":""
    },
    {
      "headline":"Pour it in.",
      "description":"Add milk and sugar to taste. If using leaves, remember to put a strainer over the cups - tea leaves taste foul!"
    },
    {
      "headline":"Put a tea-cosy over the pot between cups, to keep the tea warm.",
      "description":"Don't let it stand around for too long or the tea will end up tasting very strong. Hardened tea drinkers like this strong bitter taste which comes from the tannins released - but most tea drinkers prefer the subtlety of the fresh brew."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Boil enough water for the pot, to fill it to just below where the lid will sit.  While the water is coming to the boil, put a cup full of hot water in the pot and swill it around, before tipping it out. This warms the pot, and helps the tea brew faster. Add the tea to the pot. The old rule used to be of one for the pot, and one for each person. If using tea leaves,  measuring out the leaves with a teaspoon. Otherwise use a tea bag for each person. Nowadays we drink tea somewhat weaker. Experiment, and discover your own preference. Add the boiling water - Always use freshly boiling water for a superior brew. Using re-boiled water gives a peculiarly lifeless taste to the brew. Allow the pot to stand for between one and six minutes to brew, depending on taste.  Pour it in. Add milk and sugar to taste. If using leaves, remember to put a strainer over the cups - tea leaves taste foul! Put a tea-cosy over the pot between cups, to keep the tea warm. Don't let it stand around for too long or the tea will end up tasting very strong. Hardened tea drinkers like this strong bitter taste which comes from the tannins released - but most tea drinkers prefer the subtlety of the fresh brew. Finished. ",
  "sentences":[
    " Boil enough water for the pot, to fill it to just below where the lid will sit.",
    "While the water is coming to the boil, put a cup full of hot water in the pot and swill it around, before tipping it out.",
    "This warms the pot, and helps the tea brew faster.",
    "Add the tea to the pot.",
    "The old rule used to be of one for the pot, and one for each person.",
    "If using tea leaves,  measuring out the leaves with a teaspoon.",
    "Otherwise use a tea bag for each person.",
    "Nowadays we drink tea somewhat weaker.",
    "Experiment, and discover your own preference.",
    "Add the boiling water - Always use freshly boiling water for a superior brew.",
    "Using re-boiled water gives a peculiarly lifeless taste to the brew.",
    "Allow the pot to stand for between one and six minutes to brew, depending on taste.",
    "Pour it in.",
    "Add milk and sugar to taste.",
    "If using leaves, remember to put a strainer over the cups - tea leaves taste foul!",
    "Put a tea-cosy over the pot between cups, to keep the tea warm.",
    "Don't let it stand around for too long or the tea will end up tasting very strong.",
    "Hardened tea drinkers like this strong bitter taste which comes from the tannins released - but most tea drinkers prefer the subtlety of the fresh brew.",
    "Finished."
  ],
  "tyn_section":[
    "A teapot. There are thousands out there, as long as you know where to look. You can get  standard ones at super markets, or high street kitchenware shops, but you can also find lovely ones made from different materials at craft fairs, charity shops, pottery studios etc.  My own is a red, vintage one that I got from a second hand shop.",
    "A tea-strainer, which can be bought from most larger super markets.",
    "Tea cups, same as the teapot. Sets can be bought with matching pot and cups, often with a milk jug, sugar pot, saucers and side plates, but these can be pricey. Porcelain china is supposed to give the best tea drinking experience. Always add the milk first to avoid \"shocking\" the china.  Alternatively, place a very thin slice of lemon on the bottom of the cup.",
    "Tea cosy. These crop up around vintage fairs, as well as high street shops, or if you feel like crafting, you can try making your own, either by sewing or knitting.",
    "Tea leaves or bags. Your normal food shop will stock plain tea (English breakfast), but others can be found in health food shops."
  ],
  "tyn_model":[
    "water",
    "pot",
    "tea",
    "tea leaves",
    "hot water",
    "tea bag",
    "milk",
    "sugar",
    "strainer",
    "tea-cosy"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}