{
  "title":"How to Fold a Towel Elephant",
  "url":"https://www.wikihow.com/Fold-a-Towel-Elephant",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "parts":[
    {
      "name":"Legs",
      "steps":[
        {
          "headline":"Lay your bath towel out flat.",
          "description":"If it's not reasonably flat, you may need to iron it."
        },
        {
          "headline":"Fold the ends in by 6 or so inches (15 centimeters).",
          "description":""
        },
        {
          "headline":"Fold the folded ends in again the same distance.",
          "description":""
        },
        {
          "headline":"Roll your hem edges toward the middle of the towel, forming a double \"scroll\" look.",
          "description":""
        },
        {
          "headline":"Fold the \"scroll\" so that the rolls are facing \"out\".",
          "description":"(This forms the body and legs of the elephant.)"
        },
        {
          "headline":"Stand the legs up and set aside.",
          "description":""
        }
      ]
    },
    {
      "name":"Trunk and Head",
      "steps":[
        {
          "headline":"Lay the hand towel flat.",
          "description":""
        },
        {
          "headline":"Pin or clip the center of a long side to something (such as the leg of a chair).",
          "description":""
        },
        {
          "headline":"Place your hands on the towel edge near the fastened point and begin to roll the edge away from that point, sliding your hands away from the point as you roll, forming a long, pointed, double roll.",
          "description":"The trick is to pull the towel taut as you roll it."
        },
        {
          "headline":"Continue to the center till you can't roll it anymore.",
          "description":""
        },
        {
          "headline":"Turn the roll over so that the flat, non rolled side faces up, toward you.",
          "description":""
        },
        {
          "headline":"Roll the narrow pointed end (where you fastened the middle point) up in a tight roll to form the trunk.",
          "description":"Squeeze slightly to help the towel keep a curl in it once it's released."
        },
        {
          "headline":"Grasp the flat area of towel between your two towel points at the side that's facing down and unroll it away from the center.",
          "description":"This will spread the \"wide end\" points out into \"ears\" and form the \"forehead\" of the elephant."
        },
        {
          "headline":"Place the head on top of the legs, positioning for most natural look.",
          "description":""
        },
        {
          "headline":"Display proudly- Enjoy your elephant!",
          "description":""
        }
      ]
    }
  ],
  "text":" Legs Lay your bath towel out flat. If it's not reasonably flat, you may need to iron it. Fold the ends in by 6 or so inches (15 centimeters).  Fold the folded ends in again the same distance.  Roll your hem edges toward the middle of the towel, forming a double \"scroll\" look.  Fold the \"scroll\" so that the rolls are facing \"out\". (This forms the body and legs of the elephant.) Stand the legs up and set aside.  Trunk and Head Lay the hand towel flat.  Pin or clip the center of a long side to something (such as the leg of a chair).  Place your hands on the towel edge near the fastened point and begin to roll the edge away from that point, sliding your hands away from the point as you roll, forming a long, pointed, double roll. The trick is to pull the towel taut as you roll it. Continue to the center till you can't roll it anymore.  Turn the roll over so that the flat, non rolled side faces up, toward you.  Roll the narrow pointed end (where you fastened the middle point) up in a tight roll to form the trunk. Squeeze slightly to help the towel keep a curl in it once it's released. Grasp the flat area of towel between your two towel points at the side that's facing down and unroll it away from the center. This will spread the \"wide end\" points out into \"ears\" and form the \"forehead\" of the elephant. Place the head on top of the legs, positioning for most natural look.  Display proudly- Enjoy your elephant! ",
  "sentences":[
    " Legs Lay your bath towel out flat.",
    "If it's not reasonably flat, you may need to iron it.",
    "Fold the ends in by 6 or so inches (15 centimeters).",
    "Fold the folded ends in again the same distance.",
    "Roll your hem edges toward the middle of the towel, forming a double \"scroll\" look.",
    "Fold the \"scroll\" so that the rolls are facing \"out\".",
    "(This forms the body and legs of the elephant.)",
    "Stand the legs up and set aside.",
    "Trunk and Head Lay the hand towel flat.",
    "Pin or clip the center of a long side to something (such as the leg of a chair).",
    "Place your hands on the towel edge near the fastened point and begin to roll the edge away from that point, sliding your hands away from the point as you roll, forming a long, pointed, double roll.",
    "The trick is to pull the towel taut as you roll it.",
    "Continue to the center till you can't roll it anymore.",
    "Turn the roll over so that the flat, non rolled side faces up, toward you.",
    "Roll the narrow pointed end (where you fastened the middle point) up in a tight roll to form the trunk.",
    "Squeeze slightly to help the towel keep a curl in it once it's released.",
    "Grasp the flat area of towel between your two towel points at the side that's facing down and unroll it away from the center.",
    "This will spread the \"wide end\" points out into \"ears\" and form the \"forehead\" of the elephant.",
    "Place the head on top of the legs, positioning for most natural look.",
    "Display proudly- Enjoy your elephant!"
  ],
  "tyn_section":[
    "A matching bath towel and hand towel",
    "Inexpensive \"googly\" eyes (optional)",
    "Sunglasses (Optional)",
    "Can also be made out of napkins"
  ],
  "tyn_model":[
    "towel",
    "elephant",
    "bath towel",
    "hand towel"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.5,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}