{
  "title":"How to Cook Salmon in the Oven",
  "url":"https://www.wikihow.com/Cook-Salmon-in-the-Oven",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Salmon"
  ],
  "methods":[
    {
      "name":"Open Baking[1]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius).",
          "description":"Line a baking sheet with nonstick aluminum foil or parchment paper."
        },
        {
          "headline":"Place the salmon fillets on the baking sheet.",
          "description":"If the fillets still have skin on them, lay them on the sheet with the skin facing down. If the fillets do not have skin on them, it does not matter which side faces down."
        },
        {
          "headline":"Season the salmon.",
          "description":"Brush the fillets with just enough olive oil to coat them. The oil helps the fish to stay moist inside the dry heat of the oven. Add salt and pepper to taste, over the olive oil."
        },
        {
          "headline":"Create a sauce.",
          "description":"Salmon can be baked without a sauce, but it absorbs flavor well and a sauce can help the salmon stay even more moist. You can create a basic sauce by whisking together the yogurt, honey, mustard, and dill in a small bowl."
        },
        {
          "headline":"Spread the sauce over the fish.",
          "description":"The salmon does not need to soak in the sauce, but you should try to spread the sauce evenly over the top of each fillet."
        },
        {
          "headline":"Bake the fillets inside the preheated oven.",
          "description":"Like all fish, salmon cooks quickly. It should be ready within about 20 minutes. Test the fish with a fork when you pull it out of the oven. If the salmon flakes easily in looks opaque, it should be ready."
        }
      ]
    },
    {
      "name":"Baking in Packets[2]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius).",
          "description":"Prepare four large sheets of nonstick aluminum foil. Each sheet should be about four times as wide as the width of each salmon fillet."
        },
        {
          "headline":"Season the salmon.",
          "description":"Brush the one side of each fillet using a total of 2 tsp. (10 ml) olive oil, spreading the oil over the fillets until thinly coated. Sprinkle with salt and pepper to taste."
        },
        {
          "headline":"Create a topping.",
          "description":"The foil packet method is ideal for cooking salmon with a topping, like seasoned vegetables or chunky salsas. The packet causes the salmon to retain more moisture, and the topping soaks into the salmon, giving it even more improved moisture and flavor. For a simple topping, combine 2 Tbsp. (60 ml) olive oil with the chopped tomatoes, chopped shallots, lemon juice, oregano, and thyme."
        },
        {
          "headline":"Sit one salmon fillet on one sheet of aluminum foil.",
          "description":"Place the fillet as close to the center as possible. The fish should be placed with the oiled side facing down."
        },
        {
          "headline":"Twist two ends of the foil together.",
          "description":"Situation the fillet with the shorter edges at the top and bottom, so that the fillet seems taller rather than wider. Loosely twist the top and bottom edges of the foil together into a slight spiral shape."
        },
        {
          "headline":"Top the salmon fillets with your topping.",
          "description":"Divide the tomato topping equally into four parts, and top each fillet with one part."
        },
        {
          "headline":"Fold and seal the sides of the foil.",
          "description":"Bring the non-twisted sides of the foil up and over the salmon and tomatoes, covering them completely. Bring the edges together and fold, creasing them together securely. Allow some air to remain inside the packet so that the salmon can cook properly, but avoid letting out extra air through the foil packet."
        },
        {
          "headline":"Bake the salmon packets.",
          "description":"The packets should bake for about 25 minutes in the preheated oven."
        },
        {
          "headline":"Serve the packets whole.",
          "description":"Instead of opening up each packet before serving it, give the packets to your family or guests and allow them to open the packets themselves."
        }
      ]
    }
  ],
  "text":" Open Baking[1]\n\tX\n\t\tResearch source Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius). Line a baking sheet with nonstick aluminum foil or parchment paper. Place the salmon fillets on the baking sheet. If the fillets still have skin on them, lay them on the sheet with the skin facing down. If the fillets do not have skin on them, it does not matter which side faces down. Season the salmon. Brush the fillets with just enough olive oil to coat them. The oil helps the fish to stay moist inside the dry heat of the oven. Add salt and pepper to taste, over the olive oil. Create a sauce. Salmon can be baked without a sauce, but it absorbs flavor well and a sauce can help the salmon stay even more moist. You can create a basic sauce by whisking together the yogurt, honey, mustard, and dill in a small bowl. Spread the sauce over the fish. The salmon does not need to soak in the sauce, but you should try to spread the sauce evenly over the top of each fillet. Bake the fillets inside the preheated oven. Like all fish, salmon cooks quickly. It should be ready within about 20 minutes. Test the fish with a fork when you pull it out of the oven. If the salmon flakes easily in looks opaque, it should be ready. Baking in Packets[2]\n\tX\n\t\tResearch source Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius). Prepare four large sheets of nonstick aluminum foil. Each sheet should be about four times as wide as the width of each salmon fillet. Season the salmon. Brush the one side of each fillet using a total of 2 tsp. (10 ml) olive oil, spreading the oil over the fillets until thinly coated. Sprinkle with salt and pepper to taste. Create a topping. The foil packet method is ideal for cooking salmon with a topping, like seasoned vegetables or chunky salsas. The packet causes the salmon to retain more moisture, and the topping soaks into the salmon, giving it even more improved moisture and flavor. For a simple topping, combine 2 Tbsp. (60 ml) olive oil with the chopped tomatoes, chopped shallots, lemon juice, oregano, and thyme. Sit one salmon fillet on one sheet of aluminum foil. Place the fillet as close to the center as possible. The fish should be placed with the oiled side facing down. Twist two ends of the foil together. Situation the fillet with the shorter edges at the top and bottom, so that the fillet seems taller rather than wider. Loosely twist the top and bottom edges of the foil together into a slight spiral shape. Top the salmon fillets with your topping. Divide the tomato topping equally into four parts, and top each fillet with one part. Fold and seal the sides of the foil. Bring the non-twisted sides of the foil up and over the salmon and tomatoes, covering them completely. Bring the edges together and fold, creasing them together securely. Allow some air to remain inside the packet so that the salmon can cook properly, but avoid letting out extra air through the foil packet. Bake the salmon packets. The packets should bake for about 25 minutes in the preheated oven. Serve the packets whole. Instead of opening up each packet before serving it, give the packets to your family or guests and allow them to open the packets themselves.",
  "sentences":[
    " Open Baking[1]\n\tX\n\t\tResearch source Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius).",
    "Line a baking sheet with nonstick aluminum foil or parchment paper.",
    "Place the salmon fillets on the baking sheet.",
    "If the fillets still have skin on them, lay them on the sheet with the skin facing down.",
    "If the fillets do not have skin on them, it does not matter which side faces down.",
    "Season the salmon.",
    "Brush the fillets with just enough olive oil to coat them.",
    "The oil helps the fish to stay moist inside the dry heat of the oven.",
    "Add salt and pepper to taste, over the olive oil.",
    "Create a sauce.",
    "Salmon can be baked without a sauce, but it absorbs flavor well and a sauce can help the salmon stay even more moist.",
    "You can create a basic sauce by whisking together the yogurt, honey, mustard, and dill in a small bowl.",
    "Spread the sauce over the fish.",
    "The salmon does not need to soak in the sauce, but you should try to spread the sauce evenly over the top of each fillet.",
    "Bake the fillets inside the preheated oven.",
    "Like all fish, salmon cooks quickly.",
    "It should be ready within about 20 minutes.",
    "Test the fish with a fork when you pull it out of the oven.",
    "If the salmon flakes easily in looks opaque, it should be ready.",
    "Baking in Packets[2]\n\tX\n\t\tResearch source Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius).",
    "Prepare four large sheets of nonstick aluminum foil.",
    "Each sheet should be about four times as wide as the width of each salmon fillet.",
    "Season the salmon.",
    "Brush the one side of each fillet using a total of 2 tsp.",
    "(10 ml) olive oil, spreading the oil over the fillets until thinly coated.",
    "Sprinkle with salt and pepper to taste.",
    "Create a topping.",
    "The foil packet method is ideal for cooking salmon with a topping, like seasoned vegetables or chunky salsas.",
    "The packet causes the salmon to retain more moisture, and the topping soaks into the salmon, giving it even more improved moisture and flavor.",
    "For a simple topping, combine 2 Tbsp.",
    "(60 ml) olive oil with the chopped tomatoes, chopped shallots, lemon juice, oregano, and thyme.",
    "Sit one salmon fillet on one sheet of aluminum foil.",
    "Place the fillet as close to the center as possible.",
    "The fish should be placed with the oiled side facing down.",
    "Twist two ends of the foil together.",
    "Situation the fillet with the shorter edges at the top and bottom, so that the fillet seems taller rather than wider.",
    "Loosely twist the top and bottom edges of the foil together into a slight spiral shape.",
    "Top the salmon fillets with your topping.",
    "Divide the tomato topping equally into four parts, and top each fillet with one part.",
    "Fold and seal the sides of the foil.",
    "Bring the non-twisted sides of the foil up and over the salmon and tomatoes, covering them completely.",
    "Bring the edges together and fold, creasing them together securely.",
    "Allow some air to remain inside the packet so that the salmon can cook properly, but avoid letting out extra air through the foil packet.",
    "Bake the salmon packets.",
    "The packets should bake for about 25 minutes in the preheated oven.",
    "Serve the packets whole.",
    "Instead of opening up each packet before serving it, give the packets to your family or guests and allow them to open the packets themselves."
  ],
  "tyn_section":[
    "Baking sheet",
    "Nonstick aluminum foil",
    "Basting brush",
    "Whisk",
    "Spoon",
    "Small bowl"
  ],
  "tyn_model":[
    "salmon",
    "oven",
    "foil",
    "olive oil",
    "baking sheet",
    "aluminum foil",
    "tomatoes",
    "parchment paper",
    "salt",
    "pepper",
    "yogurt",
    "honey",
    "mustard",
    "dill",
    "fork",
    "nonstick aluminum foil",
    "salt and pepper",
    "foil packet",
    "shallots",
    "lemon juice",
    "oregano",
    "thyme",
    "topping",
    "tomato topping"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0833333333,
    "f1":0.1333333333,
    "avg_pos":0.1666666667
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.125,
    "f1":0.1818181818
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.1666666667,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.125,
    "f1":0.1818181818
  }
}