{
  "title":"How to Clean Used Brick",
  "url":"https://www.wikihow.com/Clean-Used-Brick",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Brickwork and Stone Masonry"
  ],
  "steps":[
    {
      "headline":"Obtain your old brick.",
      "description":"You may find these at a construction job site where a building is being torn down, a demolition landfill, or from a building or chimney you are tearing down yourself."
    },
    {
      "headline":"Cull out and discard badly damaged and broken brick you will not need.",
      "description":"Cleaning old brick is a difficult and time consuming project, so make sure you invest the time and energy in usable brick."
    },
    {
      "headline":"Set up a workplace by building a solid table or other surface at a comfortable working height.",
      "description":"Putting a large piece of ⁄4 inch (1.9 cm) plywood on saw horses may suit this purpose."
    },
    {
      "headline":"Use a hammer and mason's chisel to knock the excess mortar off the brick.",
      "description":"You will want to lay the cutting edge of the chisel right on the seam where the mortar meets the clay of your brick, and strike it with your hammer with a cleaving action. Often, the mortar will pop off cleanly, especially from smooth textured brick."
    },
    {
      "headline":"Use a stiff wire brush to buff any residue from the face of the brick which will be exposed when it is laid in your project.",
      "description":""
    },
    {
      "headline":"Use an abrasive rubbing rock, available from a building supply store, to scrub stubborn material from the brick.",
      "description":"Rubbing stones are rectangular blocks made from an abrasive material with a wood or plastic handle fastened to them."
    },
    {
      "headline":"Wash your brick with a mild (10% or less) solution of muriatic acid, rinse them, and stack them to dry.",
      "description":""
    }
  ],
  "text":" Obtain your old brick. You may find these at a construction job site where a building is being torn down, a demolition landfill, or from a building or chimney you are tearing down yourself. Cull out and discard badly damaged and broken brick you will not need. Cleaning old brick is a difficult and time consuming project, so make sure you invest the time and energy in usable brick. Set up a workplace by building a solid table or other surface at a comfortable working height. Putting a large piece of ⁄4 inch (1.9 cm) plywood on saw horses may suit this purpose. Use a hammer and mason's chisel to knock the excess mortar off the brick. You will want to lay the cutting edge of the chisel right on the seam where the mortar meets the clay of your brick, and strike it with your hammer with a cleaving action. Often, the mortar will pop off cleanly, especially from smooth textured brick. Use a stiff wire brush to buff any residue from the face of the brick which will be exposed when it is laid in your project.  Use an abrasive rubbing rock, available from a building supply store, to scrub stubborn material from the brick. Rubbing stones are rectangular blocks made from an abrasive material with a wood or plastic handle fastened to them. Wash your brick with a mild (10% or less) solution of muriatic acid, rinse them, and stack them to dry. ",
  "sentences":[
    " Obtain your old brick.",
    "You may find these at a construction job site where a building is being torn down, a demolition landfill, or from a building or chimney you are tearing down yourself.",
    "Cull out and discard badly damaged and broken brick you will not need.",
    "Cleaning old brick is a difficult and time consuming project, so make sure you invest the time and energy in usable brick.",
    "Set up a workplace by building a solid table or other surface at a comfortable working height.",
    "Putting a large piece of ⁄4 inch (1.9 cm) plywood on saw horses may suit this purpose.",
    "Use a hammer and mason's chisel to knock the excess mortar off the brick.",
    "You will want to lay the cutting edge of the chisel right on the seam where the mortar meets the clay of your brick, and strike it with your hammer with a cleaving action.",
    "Often, the mortar will pop off cleanly, especially from smooth textured brick.",
    "Use a stiff wire brush to buff any residue from the face of the brick which will be exposed when it is laid in your project.",
    "Use an abrasive rubbing rock, available from a building supply store, to scrub stubborn material from the brick.",
    "Rubbing stones are rectangular blocks made from an abrasive material with a wood or plastic handle fastened to them.",
    "Wash your brick with a mild (10% or less) solution of muriatic acid, rinse them, and stack them to dry."
  ],
  "tyn_section":[
    "Hammer and chisel; a mason's hammer and brick chisel are much more efficient than a standard claw hammer or cold chisel",
    "Safety equipment"
  ],
  "tyn_model":[
    "brick",
    "hammer",
    "saw horses",
    "mason's chisel",
    "chisel",
    "mortar",
    "rubbing stones",
    "muriatic acid"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}