{
  "title":"How to Collect Vintage Advertising Items",
  "url":"https://www.wikihow.com/Collect-Vintage-Advertising-Items",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting",
    "Paper Collectibles"
  ],
  "steps":[
    {
      "headline":"Buy or check out books on collecting antique advertisements.",
      "description":"Before you start looking for items, you should know their value and what is considered rare. Unless you are simply collecting to decorate a room, the amount of research you do is likely to correlate with the value of your collection later on. Go to collectics.com/bookstore_advertising.html to find lists of books on antique advertisements. Advertising memorabilia covers commonly collected items, such as Coca-Cola, match books, gas station signs and more. Start with books by B.J. Summers, such as \"Antique & Contemporary Advertising Memorabilia\" and \"Value Guide to Advertising Memorabilia.\" Other good choice include \"Old Magazine Advertisements 1890-1950: Identification & Value Guide\" by Richard E. Clear and \"Kovels' Advertising Collectibles Price List\" by Terry Kovel."
    },
    {
      "headline":"Decide upon the style of vintage advertising items you would like to collect.",
      "description":"Since you can collect anything from posters, to lunch boxes to bottles or cans, it is a good idea to specialize in 1 or 2 items, learn the industry and then move into other items in the future."
    },
    {
      "headline":"Do online research.",
      "description":"Visit online sellers, such as vintageseekers.com and peruse their inventory of vintage posters. They command high prices, but you will get a good idea of the most valuable items."
    },
    {
      "headline":"Get an account on CollectorsWeekly.com.",
      "description":"This site brings together information on collecting vintage advertising items and it also lists the eBay auctions of advertising items for the week. You can sign up for a weekly email from the advertising section of Collector's Weekly."
    },
    {
      "headline":"Attend a print and paper fair.",
      "description":"Use your new knowledge at these 1 to 3 day events that are held annually across the country. At fairs like the San Francisco Antiquarian Book, Print and Paper Fair, vintage paper sellers congregate from around the region and the country to sell to collectors."
    },
    {
      "headline":"Attend flea markets.",
      "description":"Look for sellers who specialize in post cards, posters and other prints and ephemera. You will be able to barter for some items in this setting, so be confident if you see a good value."
    },
    {
      "headline":"Visit pawn shops, estate sales and second hand shops.",
      "description":"Many sellers amass a large quantity of tin cans, beer mugs, posters and clothing made for advertising. Barter with these sellers for a reduction in prices."
    },
    {
      "headline":"Search auction houses.",
      "description":"EBay and Morphy Auctions are just two of the auction sites that regularly deal in antique advertisements. Their holdings change daily and weekly, so check back often to make bids and peruse merchandise. You will be required to set up an account in order to make bids on a lot of auction items. As well as your personal information and email, you will also need to provide a bank account number or credit card."
    },
    {
      "headline":"Place a classified ad in a local paper or magazine asking for old magazines, posters, postcards or other items.",
      "description":"Offer to buy them by the piece or pound if you believe there may be some valuable items. Many people are happy to get rid of their old stacks of magazines for a small price."
    },
    {
      "headline":"Befriend a paper or ephemera seller.",
      "description":"Some book and paper sellers keep a list of their collectors and go to them when they find new items. Give the seller a list of items you are interested in purchasing."
    },
    {
      "headline":"Keep excellent records of each item you buy.",
      "description":"Catalog the items, take pictures and list their worth. You may want to insure some of your items in case of damage or theft."
    },
    {
      "headline":"Go online to Posters.com or Art.com if you want vintage advertisement style, but do not want to do research or pay a lot of money.",
      "description":"Many antique advertisements have been reproduced into posters that sell for $10 to $50."
    },
    {
      "headline":"Sell your merchandise.",
      "description":"As you become more of an expert, you may want to sell things that you are not sentimental or valuable to you on eBay or to vintage paper sellers. Selling certain items will allow you to expand your advertising collection with more sophisticated purchases."
    }
  ],
  "text":" Buy or check out books on collecting antique advertisements. Before you start looking for items, you should know their value and what is considered rare. Unless you are simply collecting to decorate a room, the amount of research you do is likely to correlate with the value of your collection later on. Go to collectics.com/bookstore_advertising.html to find lists of books on antique advertisements. Advertising memorabilia covers commonly collected items, such as Coca-Cola, match books, gas station signs and more. Start with books by B.J. Summers, such as \"Antique & Contemporary Advertising Memorabilia\" and \"Value Guide to Advertising Memorabilia.\" Other good choice include \"Old Magazine Advertisements 1890-1950: Identification & Value Guide\" by Richard E. Clear and \"Kovels' Advertising Collectibles Price List\" by Terry Kovel. Decide upon the style of vintage advertising items you would like to collect. Since you can collect anything from posters, to lunch boxes to bottles or cans, it is a good idea to specialize in 1 or 2 items, learn the industry and then move into other items in the future. Do online research. Visit online sellers, such as vintageseekers.com and peruse their inventory of vintage posters. They command high prices, but you will get a good idea of the most valuable items. Get an account on CollectorsWeekly.com. This site brings together information on collecting vintage advertising items and it also lists the eBay auctions of advertising items for the week. You can sign up for a weekly email from the advertising section of Collector's Weekly. Attend a print and paper fair. Use your new knowledge at these 1 to 3 day events that are held annually across the country. At fairs like the San Francisco Antiquarian Book, Print and Paper Fair, vintage paper sellers congregate from around the region and the country to sell to collectors. Attend flea markets. Look for sellers who specialize in post cards, posters and other prints and ephemera. You will be able to barter for some items in this setting, so be confident if you see a good value. Visit pawn shops, estate sales and second hand shops. Many sellers amass a large quantity of tin cans, beer mugs, posters and clothing made for advertising. Barter with these sellers for a reduction in prices. Search auction houses. EBay and Morphy Auctions are just two of the auction sites that regularly deal in antique advertisements. Their holdings change daily and weekly, so check back often to make bids and peruse merchandise. You will be required to set up an account in order to make bids on a lot of auction items. As well as your personal information and email, you will also need to provide a bank account number or credit card. Place a classified ad in a local paper or magazine asking for old magazines, posters, postcards or other items. Offer to buy them by the piece or pound if you believe there may be some valuable items. Many people are happy to get rid of their old stacks of magazines for a small price. Befriend a paper or ephemera seller. Some book and paper sellers keep a list of their collectors and go to them when they find new items. Give the seller a list of items you are interested in purchasing. Keep excellent records of each item you buy. Catalog the items, take pictures and list their worth. You may want to insure some of your items in case of damage or theft. Go online to Posters.com or Art.com if you want vintage advertisement style, but do not want to do research or pay a lot of money. Many antique advertisements have been reproduced into posters that sell for $10 to $50. Sell your merchandise. As you become more of an expert, you may want to sell things that you are not sentimental or valuable to you on eBay or to vintage paper sellers. Selling certain items will allow you to expand your advertising collection with more sophisticated purchases.",
  "sentences":[
    " Buy or check out books on collecting antique advertisements.",
    "Before you start looking for items, you should know their value and what is considered rare.",
    "Unless you are simply collecting to decorate a room, the amount of research you do is likely to correlate with the value of your collection later on.",
    "Go to collectics.com/bookstore_advertising.html to find lists of books on antique advertisements.",
    "Advertising memorabilia covers commonly collected items, such as Coca-Cola, match books, gas station signs and more.",
    "Start with books by B.J.",
    "Summers, such as \"Antique & Contemporary Advertising Memorabilia\" and \"Value Guide to Advertising Memorabilia.\"",
    "Other good choice include \"Old Magazine Advertisements 1890-1950: Identification & Value Guide\" by Richard E. Clear and \"Kovels' Advertising Collectibles Price List\" by Terry Kovel.",
    "Decide upon the style of vintage advertising items you would like to collect.",
    "Since you can collect anything from posters, to lunch boxes to bottles or cans, it is a good idea to specialize in 1 or 2 items, learn the industry and then move into other items in the future.",
    "Do online research.",
    "Visit online sellers, such as vintageseekers.com and peruse their inventory of vintage posters.",
    "They command high prices, but you will get a good idea of the most valuable items.",
    "Get an account on CollectorsWeekly.com.",
    "This site brings together information on collecting vintage advertising items and it also lists the eBay auctions of advertising items for the week.",
    "You can sign up for a weekly email from the advertising section of Collector's Weekly.",
    "Attend a print and paper fair.",
    "Use your new knowledge at these 1 to 3 day events that are held annually across the country.",
    "At fairs like the San Francisco Antiquarian Book, Print and Paper Fair, vintage paper sellers congregate from around the region and the country to sell to collectors.",
    "Attend flea markets.",
    "Look for sellers who specialize in post cards, posters and other prints and ephemera.",
    "You will be able to barter for some items in this setting, so be confident if you see a good value.",
    "Visit pawn shops, estate sales and second hand shops.",
    "Many sellers amass a large quantity of tin cans, beer mugs, posters and clothing made for advertising.",
    "Barter with these sellers for a reduction in prices.",
    "Search auction houses.",
    "EBay and Morphy Auctions are just two of the auction sites that regularly deal in antique advertisements.",
    "Their holdings change daily and weekly, so check back often to make bids and peruse merchandise.",
    "You will be required to set up an account in order to make bids on a lot of auction items.",
    "As well as your personal information and email, you will also need to provide a bank account number or credit card.",
    "Place a classified ad in a local paper or magazine asking for old magazines, posters, postcards or other items.",
    "Offer to buy them by the piece or pound if you believe there may be some valuable items.",
    "Many people are happy to get rid of their old stacks of magazines for a small price.",
    "Befriend a paper or ephemera seller.",
    "Some book and paper sellers keep a list of their collectors and go to them when they find new items.",
    "Give the seller a list of items you are interested in purchasing.",
    "Keep excellent records of each item you buy.",
    "Catalog the items, take pictures and list their worth.",
    "You may want to insure some of your items in case of damage or theft.",
    "Go online to Posters.com or Art.com if you want vintage advertisement style, but do not want to do research or pay a lot of money.",
    "Many antique advertisements have been reproduced into posters that sell for $10 to $50.",
    "Sell your merchandise.",
    "As you become more of an expert, you may want to sell things that you are not sentimental or valuable to you on eBay or to vintage paper sellers.",
    "Selling certain items will allow you to expand your advertising collection with more sophisticated purchases."
  ],
  "tyn_section":[
    "Advertising collector books",
    "Collector's Weekly account",
    "Collector's Weekly email",
    "Antique print and paper fair",
    "Ebay/Auction account",
    "Flea markets",
    "Estate sales",
    "Pawn shops",
    "Second hand stores",
    "Classified ads",
    "Insurance",
    "Photographs",
    "Records"
  ],
  "tyn_model":[
    "posters",
    "vintage paper",
    "collector's weekly",
    "flea markets",
    "post cards",
    "tin cans",
    "magazines",
    "book and paper"
  ],
  "simple_metrics":{
    "r":0.0769230769,
    "p":0.125,
    "f1":0.0952380952,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2307692308,
    "p":0.25,
    "f1":0.24
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3076923077,
    "p":0.375,
    "f1":0.338028169
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2307692308,
    "p":0.25,
    "f1":0.24
  }
}