{
  "title":"How to Recycle Antique or Vintage Linens",
  "url":"https://www.wikihow.com/Recycle-Antique-or-Vintage-Linens",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting",
    "Vintage Sewing and Textiles"
  ],
  "methods":[
    {
      "name":"Assessing Antique Linens",
      "steps":[
        {
          "headline":"Assess the quality of your linens.",
          "description":"Not all bed linens are classified as antique or vintage. Focus on those that were made before 1960 for the best results. Find any damage on the linens. If they are damaged, they will not fetch the same price as if they are in excellent condition. Go over each set of linens with a careful eye. Decide what quality they are in, such as poor, fair, good or very good. Set poor quality linens aside to be used for crafts rather than resale. Save any novelty linens from the 1970s and 1980s. Some novelty sheets can be sold online to collectors, especially if they are in good quality. Try to decipher their age. If there is a tag, look that up online to try to find collections. If there isn't, try to take notes about what you know of the fabric and date of purchase. Ask older relatives in your family about the origins of these items."
        },
        {
          "headline":"Remove stains from antique linens.",
          "description":"You can improve the look and increase the value of some linens if you remove stains before using or selling them. The following methods can work on many types of vintage linen:\nSpot treat the stain with gentle methods before laundering. Sprinkle salt and squeeze fresh lemon juice on the stain. Allow it to soak through for a few minutes. Then, pour hot boiling water over the linen. Be very careful when working with boiling water. Hand wash all delicate linens. It is preferable to use soap flakes, rather than modern detergents, in order to maintain the integrity of the fabric. Never wring your linens dry, as it can damage the fabric. Mix a solution of stain fighter in a bucket or sink, if this doesn't work and let sit overnight. Mix 1 scoop of enzyme bleach, such as Biz, with 1 scoop oxygen bleach, such as OxyClean and add 3/4 cup of ammonia and 1 gallon (3.8 L) of hot water. Agitate and rinse the stain fighter out several times. Dry all items on a line or on the grass to avoid damaging them with heat. If you don't have a line, lay the linen on white towels on the grass in the sun. Sunlight can help to further bleach out stains."
        },
        {
          "headline":"Do some research on vintage linens, if you want to sell them.",
          "description":"Visit estate sales, antique shops or online antique linen stores, such as vintagelinens.com and emsheart.com. It helps to have some contact with the linens to find out what valuable linens look and feel like."
        }
      ]
    },
    {
      "name":"Selling Vintage Linens",
      "steps":[
        {
          "headline":"Consider getting your linens appraised.",
          "description":"This fee-based service may be available at local antique shops or malls, or through private experts. Look in the phone book or online to set up an appointment and have your linens assessed before selling them."
        },
        {
          "headline":"Take your linens to a local antique dealer or store.",
          "description":"Make sure they are cleaned and freshly pressed. The dealer is likely to offer less than what your appraiser said they were worth, in order to make a profit on their sale, so decide if you think you are getting a good deal before selling."
        },
        {
          "headline":"Contact online vintage linen shops to sell your items.",
          "description":"Places like VintageLinens.com buy good quality antique linens. Check the \"Contact us\" or \"About us\" sections to learn about their policies."
        },
        {
          "headline":"Sell your antique linens on eBay.",
          "description":"This only auction site is perfect for vintage items. Take good quality pictures and post them with a minimum bid."
        },
        {
          "headline":"Donate antique linens to a local historical society or museum.",
          "description":"A textile museum uses these linens to display or teach. Contact museums or museum houses to see if your linens can be donated."
        }
      ]
    },
    {
      "name":"Reusing Antique Linens",
      "steps":[
        {
          "headline":"Turn patterned linens into fabric for quilts.",
          "description":"This has been a common use for old linens for hundreds of years. Find a pattern and cut it into the correct size. If you want to save it for future use but it is large and hard to store, cut the fabric into fat quarters. This is a quarter of a yard cut into 18 by 22 inch dimensions. Large old sheets can be used as the backing fabric to a quilt. This will help to showcase the fabric, but still recycle it into a new form."
        },
        {
          "headline":"Use old linens to make new linens or aprons.",
          "description":"In her book, \"The Farm Chicks in the Kitchen,\" Serena Thompson gives a tutorial on how to turn sheets, tablecloths, feed sacks or other linens into dishtowels or aprons. She also puts on an antique show, so her blog is filled with details about vintage items."
        },
        {
          "headline":"Personalize old hankies by embroidering or cross stitching.",
          "description":"You can add a person's name or create a phrase and frame it for your home."
        },
        {
          "headline":"Turn old bed sheets into curtains.",
          "description":"Pretty patterns, colors and detailing can create a shabby chic embellishment in your home. If you have white sheets, you can dye them and then use a pattern for curtains. Use doilies or place mats to make cafe curtains or valences in the kitchen or bathroom."
        },
        {
          "headline":"Display particularly beautiful table cloths, quilts or blankets as wall hangings in your home.",
          "description":"Brighten up a room by hanging it from a curtain rod or dowel on a wall."
        },
        {
          "headline":"Sew a picnic blanket out of a vintage tablecloth.",
          "description":"At pureandnoble.blogspot.com/2011/07/reduce-reuse-recycle-vintage.html you will find instructions on how to reuse a beautiful tablecloth for yourself or for a gift."
        }
      ]
    }
  ],
  "text":" Assessing Antique Linens Assess the quality of your linens. Not all bed linens are classified as antique or vintage. Focus on those that were made before 1960 for the best results. Find any damage on the linens. If they are damaged, they will not fetch the same price as if they are in excellent condition. Go over each set of linens with a careful eye. Decide what quality they are in, such as poor, fair, good or very good. Set poor quality linens aside to be used for crafts rather than resale. Save any novelty linens from the 1970s and 1980s. Some novelty sheets can be sold online to collectors, especially if they are in good quality. Try to decipher their age. If there is a tag, look that up online to try to find collections. If there isn't, try to take notes about what you know of the fabric and date of purchase. Ask older relatives in your family about the origins of these items. Remove stains from antique linens. You can improve the look and increase the value of some linens if you remove stains before using or selling them. The following methods can work on many types of vintage linen:\nSpot treat the stain with gentle methods before laundering. Sprinkle salt and squeeze fresh lemon juice on the stain. Allow it to soak through for a few minutes. Then, pour hot boiling water over the linen. Be very careful when working with boiling water. Hand wash all delicate linens. It is preferable to use soap flakes, rather than modern detergents, in order to maintain the integrity of the fabric. Never wring your linens dry, as it can damage the fabric. Mix a solution of stain fighter in a bucket or sink, if this doesn't work and let sit overnight. Mix 1 scoop of enzyme bleach, such as Biz, with 1 scoop oxygen bleach, such as OxyClean and add 3/4 cup of ammonia and 1 gallon (3.8 L) of hot water. Agitate and rinse the stain fighter out several times. Dry all items on a line or on the grass to avoid damaging them with heat. If you don't have a line, lay the linen on white towels on the grass in the sun. Sunlight can help to further bleach out stains. Do some research on vintage linens, if you want to sell them. Visit estate sales, antique shops or online antique linen stores, such as vintagelinens.com and emsheart.com. It helps to have some contact with the linens to find out what valuable linens look and feel like. Selling Vintage Linens Consider getting your linens appraised. This fee-based service may be available at local antique shops or malls, or through private experts. Look in the phone book or online to set up an appointment and have your linens assessed before selling them. Take your linens to a local antique dealer or store. Make sure they are cleaned and freshly pressed. The dealer is likely to offer less than what your appraiser said they were worth, in order to make a profit on their sale, so decide if you think you are getting a good deal before selling. Contact online vintage linen shops to sell your items. Places like VintageLinens.com buy good quality antique linens. Check the \"Contact us\" or \"About us\" sections to learn about their policies. Sell your antique linens on eBay. This only auction site is perfect for vintage items. Take good quality pictures and post them with a minimum bid. Donate antique linens to a local historical society or museum. A textile museum uses these linens to display or teach. Contact museums or museum houses to see if your linens can be donated. Reusing Antique Linens Turn patterned linens into fabric for quilts. This has been a common use for old linens for hundreds of years. Find a pattern and cut it into the correct size. If you want to save it for future use but it is large and hard to store, cut the fabric into fat quarters. This is a quarter of a yard cut into 18 by 22 inch dimensions. Large old sheets can be used as the backing fabric to a quilt. This will help to showcase the fabric, but still recycle it into a new form. Use old linens to make new linens or aprons. In her book, \"The Farm Chicks in the Kitchen,\" Serena Thompson gives a tutorial on how to turn sheets, tablecloths, feed sacks or other linens into dishtowels or aprons. She also puts on an antique show, so her blog is filled with details about vintage items. Personalize old hankies by embroidering or cross stitching. You can add a person's name or create a phrase and frame it for your home. Turn old bed sheets into curtains. Pretty patterns, colors and detailing can create a shabby chic embellishment in your home. If you have white sheets, you can dye them and then use a pattern for curtains. Use doilies or place mats to make cafe curtains or valences in the kitchen or bathroom. Display particularly beautiful table cloths, quilts or blankets as wall hangings in your home. Brighten up a room by hanging it from a curtain rod or dowel on a wall. Sew a picnic blanket out of a vintage tablecloth. At pureandnoble.blogspot.com/2011/07/reduce-reuse-recycle-vintage.html you will find instructions on how to reuse a beautiful tablecloth for yourself or for a gift.",
  "sentences":[
    " Assessing Antique Linens Assess the quality of your linens.",
    "Not all bed linens are classified as antique or vintage.",
    "Focus on those that were made before 1960 for the best results.",
    "Find any damage on the linens.",
    "If they are damaged, they will not fetch the same price as if they are in excellent condition.",
    "Go over each set of linens with a careful eye.",
    "Decide what quality they are in, such as poor, fair, good or very good.",
    "Set poor quality linens aside to be used for crafts rather than resale.",
    "Save any novelty linens from the 1970s and 1980s.",
    "Some novelty sheets can be sold online to collectors, especially if they are in good quality.",
    "Try to decipher their age.",
    "If there is a tag, look that up online to try to find collections.",
    "If there isn't, try to take notes about what you know of the fabric and date of purchase.",
    "Ask older relatives in your family about the origins of these items.",
    "Remove stains from antique linens.",
    "You can improve the look and increase the value of some linens if you remove stains before using or selling them.",
    "The following methods can work on many types of vintage linen:\nSpot treat the stain with gentle methods before laundering.",
    "Sprinkle salt and squeeze fresh lemon juice on the stain.",
    "Allow it to soak through for a few minutes.",
    "Then, pour hot boiling water over the linen.",
    "Be very careful when working with boiling water.",
    "Hand wash all delicate linens.",
    "It is preferable to use soap flakes, rather than modern detergents, in order to maintain the integrity of the fabric.",
    "Never wring your linens dry, as it can damage the fabric.",
    "Mix a solution of stain fighter in a bucket or sink, if this doesn't work and let sit overnight.",
    "Mix 1 scoop of enzyme bleach, such as Biz, with 1 scoop oxygen bleach, such as OxyClean and add 3/4 cup of ammonia and 1 gallon (3.8 L) of hot water.",
    "Agitate and rinse the stain fighter out several times.",
    "Dry all items on a line or on the grass to avoid damaging them with heat.",
    "If you don't have a line, lay the linen on white towels on the grass in the sun.",
    "Sunlight can help to further bleach out stains.",
    "Do some research on vintage linens, if you want to sell them.",
    "Visit estate sales, antique shops or online antique linen stores, such as vintagelinens.com and emsheart.com.",
    "It helps to have some contact with the linens to find out what valuable linens look and feel like.",
    "Selling Vintage Linens Consider getting your linens appraised.",
    "This fee-based service may be available at local antique shops or malls, or through private experts.",
    "Look in the phone book or online to set up an appointment and have your linens assessed before selling them.",
    "Take your linens to a local antique dealer or store.",
    "Make sure they are cleaned and freshly pressed.",
    "The dealer is likely to offer less than what your appraiser said they were worth, in order to make a profit on their sale, so decide if you think you are getting a good deal before selling.",
    "Contact online vintage linen shops to sell your items.",
    "Places like VintageLinens.com buy good quality antique linens.",
    "Check the \"Contact us\" or \"About us\" sections to learn about their policies.",
    "Sell your antique linens on eBay.",
    "This only auction site is perfect for vintage items.",
    "Take good quality pictures and post them with a minimum bid.",
    "Donate antique linens to a local historical society or museum.",
    "A textile museum uses these linens to display or teach.",
    "Contact museums or museum houses to see if your linens can be donated.",
    "Reusing Antique Linens Turn patterned linens into fabric for quilts.",
    "This has been a common use for old linens for hundreds of years.",
    "Find a pattern and cut it into the correct size.",
    "If you want to save it for future use but it is large and hard to store, cut the fabric into fat quarters.",
    "This is a quarter of a yard cut into 18 by 22 inch dimensions.",
    "Large old sheets can be used as the backing fabric to a quilt.",
    "This will help to showcase the fabric, but still recycle it into a new form.",
    "Use old linens to make new linens or aprons.",
    "In her book, \"The Farm Chicks in the Kitchen,\" Serena Thompson gives a tutorial on how to turn sheets, tablecloths, feed sacks or other linens into dishtowels or aprons.",
    "She also puts on an antique show, so her blog is filled with details about vintage items.",
    "Personalize old hankies by embroidering or cross stitching.",
    "You can add a person's name or create a phrase and frame it for your home.",
    "Turn old bed sheets into curtains.",
    "Pretty patterns, colors and detailing can create a shabby chic embellishment in your home.",
    "If you have white sheets, you can dye them and then use a pattern for curtains.",
    "Use doilies or place mats to make cafe curtains or valences in the kitchen or bathroom.",
    "Display particularly beautiful table cloths, quilts or blankets as wall hangings in your home.",
    "Brighten up a room by hanging it from a curtain rod or dowel on a wall.",
    "Sew a picnic blanket out of a vintage tablecloth.",
    "At pureandnoble.blogspot.com/2011/07/reduce-reuse-recycle-vintage.html you will find instructions on how to reuse a beautiful tablecloth for yourself or for a gift."
  ],
  "tyn_section":[
    "Water",
    "Salt",
    "Lemons",
    "Kettle",
    "White towels",
    "Soap flakes",
    "Oxygen bleach",
    "Enzyme bleach",
    "Ammonia",
    "Bucket/sink",
    "Sun",
    "Iron",
    "Clothesline",
    "Appraiser",
    "Textile museum",
    "Sewing supplies",
    "Curtain rod or dowel",
    "Cross-stitch/embroidery thread and needle"
  ],
  "tyn_model":[
    "linens",
    "linen",
    "fabric",
    "sheets",
    "water",
    "curtains",
    "tablecloth",
    "bed linens",
    "novelty sheets",
    "salt",
    "soap flakes",
    "stain fighter",
    "enzyme bleach",
    "oxygen bleach",
    "ammonia",
    "hot water",
    "towels",
    "feed sacks",
    "dishtowels",
    "bed sheets",
    "doilies",
    "place mats",
    "table cloths",
    "quilts",
    "curtain rod",
    "picnic blanket"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.2307692308,
    "f1":0.2727272727,
    "avg_pos":0.1538461538
  },
  "jacc_metrics_0.5":{
    "r":0.4444444444,
    "p":0.3461538462,
    "f1":0.3891891892
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4444444444,
    "p":0.3461538462,
    "f1":0.3891891892
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.2307692308,
    "f1":0.2727272727
  }
}