{
  "title":"How to Descale a Kettle",
  "url":"https://www.wikihow.com/Descale-a-Kettle",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "methods":[
    {
      "name":"Descaling with Vinegar",
      "steps":[
        {
          "headline":"Mix 2 cups (470 mL) of vinegar and water and pour them into the kettle.",
          "description":"If the volume of your kettle is too small for this mixture, fill it about halfway and place any leftover solution to the side. For best results, use white vinegar and water in a 1:1 ratio. If yours is an electric kettle, make sure it's unplugged before pouring in the water and vinegar. It's a good idea to check the owner's manual for your particular kettle to make sure that it's safe to add vinegar to the interior.Tip: There are commercial descalers available, but make sure they are specifically for use on kettles and are not metal descalers. If you choose to use one, follow the manufacturer's instructions."
        },
        {
          "headline":"Turn the kettle on and bring the vinegar solution to a boil.",
          "description":"Plug in the kettle if it's electric or turn on the stove underneath a stovetop kettle to boil the solution. Let the solution boil for about a minute or so. Feel free to use a high heat setting to bring the solution to a boil as quickly as possible. It shouldn't take longer than 5 minutes to get it boiling."
        },
        {
          "headline":"Turn off the kettle once the solution is boiling and let it sit for an hour.",
          "description":"The vinegar solution will do work its descaling magic simply by sitting in the kettle, so you don't necessarily have to boil it for a set amount of time. If you don't want to wait an entire hour, allow the solution to sit for at least 30 minutes before pouring it out. If yours is an electric kettle with an automatic switch-off feature, feel free to let it switch off on its own instead of watching to see when it boils."
        },
        {
          "headline":"Pour out the solution after an hour and rinse out the kettle.",
          "description":"Be sure the kettle is cool to the touch before handling it. Thoroughly rinse the inside of the kettle under the sink faucet to get rid of any leftover vinegar solution. For best results, rinse out the kettle 2 or 3 times to get as much of the vinegar out of the inside as possible. If your kettle has a removable lid, take this lid off to make it easier to rinse out the interior. You can rinse the lid by itself to make sure it's also clean."
        },
        {
          "headline":"Use a clean, damp cloth to wipe away any leftover limescale.",
          "description":"The vinegar solution will probably not have removed all the limescale, but any leftover build-up should be easy to remove by hand. If a damp cloth isn't cutting it, add a little bit of baking soda to a damp sponge and use that to clean out the inside of the kettle. For best results, use a microfiber cloth or a cleaning brush with an elongated handle. Make sure you get all the corners as well."
        },
        {
          "headline":"Run a plain water cycle to get rid of any lingering vinegar taste.",
          "description":"Fill your kettle halfway with plain water and bring it to a boil. Pour this water out once it starts to boil. You may have to do this 2 or 3 times in order to completely deodorize the interior. Repeat this cycle until you can't smell any vinegary odor in your kettle. You may also want to “test” your kettle by preparing a beverage in it and seeing if it tastes at all like vinegar."
        }
      ]
    },
    {
      "name":"Using a Lemon",
      "steps":[
        {
          "headline":"Squeeze a lemon into 1.5 cups (350 mL) of water and mix it together.",
          "description":"Once you've squeezed the juice out of the lemon, cut it up into small pieces and add these pieces to the water as well. If you don't have a whole lemon, you can also use lemon juice; just mix it in a 1:3 ratio with water. Check the manufacturer's instructions for your particular kettle to make sure it's safe to add lemon juice or pieces of lemon to your kettle. It probably is, but it doesn't hurt to double-check. You can also use limes, although you'll probably see better results by using lemon."
        },
        {
          "headline":"Pour this mixture into your kettle and bring it to a boil.",
          "description":"Fill your kettle about halfway full with the lemon and water mixture. Plug in your kettle or turn on the stovetop underneath to heat up the lemon water. Discard any leftover solution you may still have."
        },
        {
          "headline":"Turn off the kettle and leave the solution to sit for an hour.",
          "description":"Allow the solution to boil for about a minute or so before turning it off. Unplug your kettle or remove it from heat and set it aside on a cool surface. Leaving it for an hour is ideal, but let it sit for at least 30 minutes if you're pressed for time. This will give the solution enough time to descale the kettle, while also allowing enough time for the kettle itself to cool down."
        },
        {
          "headline":"Pour out the lemon mixture and rinse out the kettle once it's cool.",
          "description":"Make sure the kettle is cool to the touch before handling it. Rinse the kettle in the sink to remove any remnants of the lemon water before continuing. Rinse it out 4 or 5 times for best results. You may want to remove the kettle lid, if possible, to make it easier to rinse out under the sink faucet."
        },
        {
          "headline":"Wipe down the interior of the kettle and run a plain water cycle.",
          "description":"If there is any limescale left in the kettle, you can wipe it down with a small amount of baking soda on a damp cloth or sponge. Then, fill the kettle halfway with water and bring it to a boil. Pour out the heated water and remove the kettle from heat. Repeat this process as necessary until there's no more limescale in your kettle. You may need to repeat this cycle several times to completely remove any leftover limescale or lemony odor inside your kettle."
        }
      ]
    }
  ],
  "text":" Descaling with Vinegar Mix 2 cups (470 mL) of vinegar and water and pour them into the kettle. If the volume of your kettle is too small for this mixture, fill it about halfway and place any leftover solution to the side. For best results, use white vinegar and water in a 1:1 ratio. If yours is an electric kettle, make sure it's unplugged before pouring in the water and vinegar. It's a good idea to check the owner's manual for your particular kettle to make sure that it's safe to add vinegar to the interior.Tip: There are commercial descalers available, but make sure they are specifically for use on kettles and are not metal descalers. If you choose to use one, follow the manufacturer's instructions. Turn the kettle on and bring the vinegar solution to a boil. Plug in the kettle if it's electric or turn on the stove underneath a stovetop kettle to boil the solution. Let the solution boil for about a minute or so. Feel free to use a high heat setting to bring the solution to a boil as quickly as possible. It shouldn't take longer than 5 minutes to get it boiling. Turn off the kettle once the solution is boiling and let it sit for an hour. The vinegar solution will do work its descaling magic simply by sitting in the kettle, so you don't necessarily have to boil it for a set amount of time. If you don't want to wait an entire hour, allow the solution to sit for at least 30 minutes before pouring it out. If yours is an electric kettle with an automatic switch-off feature, feel free to let it switch off on its own instead of watching to see when it boils. Pour out the solution after an hour and rinse out the kettle. Be sure the kettle is cool to the touch before handling it. Thoroughly rinse the inside of the kettle under the sink faucet to get rid of any leftover vinegar solution. For best results, rinse out the kettle 2 or 3 times to get as much of the vinegar out of the inside as possible. If your kettle has a removable lid, take this lid off to make it easier to rinse out the interior. You can rinse the lid by itself to make sure it's also clean. Use a clean, damp cloth to wipe away any leftover limescale. The vinegar solution will probably not have removed all the limescale, but any leftover build-up should be easy to remove by hand. If a damp cloth isn't cutting it, add a little bit of baking soda to a damp sponge and use that to clean out the inside of the kettle. For best results, use a microfiber cloth or a cleaning brush with an elongated handle. Make sure you get all the corners as well. Run a plain water cycle to get rid of any lingering vinegar taste. Fill your kettle halfway with plain water and bring it to a boil. Pour this water out once it starts to boil. You may have to do this 2 or 3 times in order to completely deodorize the interior. Repeat this cycle until you can't smell any vinegary odor in your kettle. You may also want to “test” your kettle by preparing a beverage in it and seeing if it tastes at all like vinegar. Using a Lemon Squeeze a lemon into 1.5 cups (350 mL) of water and mix it together. Once you've squeezed the juice out of the lemon, cut it up into small pieces and add these pieces to the water as well. If you don't have a whole lemon, you can also use lemon juice; just mix it in a 1:3 ratio with water. Check the manufacturer's instructions for your particular kettle to make sure it's safe to add lemon juice or pieces of lemon to your kettle. It probably is, but it doesn't hurt to double-check. You can also use limes, although you'll probably see better results by using lemon. Pour this mixture into your kettle and bring it to a boil. Fill your kettle about halfway full with the lemon and water mixture. Plug in your kettle or turn on the stovetop underneath to heat up the lemon water. Discard any leftover solution you may still have. Turn off the kettle and leave the solution to sit for an hour. Allow the solution to boil for about a minute or so before turning it off. Unplug your kettle or remove it from heat and set it aside on a cool surface. Leaving it for an hour is ideal, but let it sit for at least 30 minutes if you're pressed for time. This will give the solution enough time to descale the kettle, while also allowing enough time for the kettle itself to cool down. Pour out the lemon mixture and rinse out the kettle once it's cool. Make sure the kettle is cool to the touch before handling it. Rinse the kettle in the sink to remove any remnants of the lemon water before continuing. Rinse it out 4 or 5 times for best results. You may want to remove the kettle lid, if possible, to make it easier to rinse out under the sink faucet. Wipe down the interior of the kettle and run a plain water cycle. If there is any limescale left in the kettle, you can wipe it down with a small amount of baking soda on a damp cloth or sponge. Then, fill the kettle halfway with water and bring it to a boil. Pour out the heated water and remove the kettle from heat. Repeat this process as necessary until there's no more limescale in your kettle. You may need to repeat this cycle several times to completely remove any leftover limescale or lemony odor inside your kettle.",
  "sentences":[
    " Descaling with Vinegar Mix 2 cups (470 mL) of vinegar and water and pour them into the kettle.",
    "If the volume of your kettle is too small for this mixture, fill it about halfway and place any leftover solution to the side.",
    "For best results, use white vinegar and water in a 1:1 ratio.",
    "If yours is an electric kettle, make sure it's unplugged before pouring in the water and vinegar.",
    "It's a good idea to check the owner's manual for your particular kettle to make sure that it's safe to add vinegar to the interior.Tip: There are commercial descalers available, but make sure they are specifically for use on kettles and are not metal descalers.",
    "If you choose to use one, follow the manufacturer's instructions.",
    "Turn the kettle on and bring the vinegar solution to a boil.",
    "Plug in the kettle if it's electric or turn on the stove underneath a stovetop kettle to boil the solution.",
    "Let the solution boil for about a minute or so.",
    "Feel free to use a high heat setting to bring the solution to a boil as quickly as possible.",
    "It shouldn't take longer than 5 minutes to get it boiling.",
    "Turn off the kettle once the solution is boiling and let it sit for an hour.",
    "The vinegar solution will do work its descaling magic simply by sitting in the kettle, so you don't necessarily have to boil it for a set amount of time.",
    "If you don't want to wait an entire hour, allow the solution to sit for at least 30 minutes before pouring it out.",
    "If yours is an electric kettle with an automatic switch-off feature, feel free to let it switch off on its own instead of watching to see when it boils.",
    "Pour out the solution after an hour and rinse out the kettle.",
    "Be sure the kettle is cool to the touch before handling it.",
    "Thoroughly rinse the inside of the kettle under the sink faucet to get rid of any leftover vinegar solution.",
    "For best results, rinse out the kettle 2 or 3 times to get as much of the vinegar out of the inside as possible.",
    "If your kettle has a removable lid, take this lid off to make it easier to rinse out the interior.",
    "You can rinse the lid by itself to make sure it's also clean.",
    "Use a clean, damp cloth to wipe away any leftover limescale.",
    "The vinegar solution will probably not have removed all the limescale, but any leftover build-up should be easy to remove by hand.",
    "If a damp cloth isn't cutting it, add a little bit of baking soda to a damp sponge and use that to clean out the inside of the kettle.",
    "For best results, use a microfiber cloth or a cleaning brush with an elongated handle.",
    "Make sure you get all the corners as well.",
    "Run a plain water cycle to get rid of any lingering vinegar taste.",
    "Fill your kettle halfway with plain water and bring it to a boil.",
    "Pour this water out once it starts to boil.",
    "You may have to do this 2 or 3 times in order to completely deodorize the interior.",
    "Repeat this cycle until you can't smell any vinegary odor in your kettle.",
    "You may also want to “test” your kettle by preparing a beverage in it and seeing if it tastes at all like vinegar.",
    "Using a Lemon Squeeze a lemon into 1.5 cups (350 mL) of water and mix it together.",
    "Once you've squeezed the juice out of the lemon, cut it up into small pieces and add these pieces to the water as well.",
    "If you don't have a whole lemon, you can also use lemon juice; just mix it in a 1:3 ratio with water.",
    "Check the manufacturer's instructions for your particular kettle to make sure it's safe to add lemon juice or pieces of lemon to your kettle.",
    "It probably is, but it doesn't hurt to double-check.",
    "You can also use limes, although you'll probably see better results by using lemon.",
    "Pour this mixture into your kettle and bring it to a boil.",
    "Fill your kettle about halfway full with the lemon and water mixture.",
    "Plug in your kettle or turn on the stovetop underneath to heat up the lemon water.",
    "Discard any leftover solution you may still have.",
    "Turn off the kettle and leave the solution to sit for an hour.",
    "Allow the solution to boil for about a minute or so before turning it off.",
    "Unplug your kettle or remove it from heat and set it aside on a cool surface.",
    "Leaving it for an hour is ideal, but let it sit for at least 30 minutes if you're pressed for time.",
    "This will give the solution enough time to descale the kettle, while also allowing enough time for the kettle itself to cool down.",
    "Pour out the lemon mixture and rinse out the kettle once it's cool.",
    "Make sure the kettle is cool to the touch before handling it.",
    "Rinse the kettle in the sink to remove any remnants of the lemon water before continuing.",
    "Rinse it out 4 or 5 times for best results.",
    "You may want to remove the kettle lid, if possible, to make it easier to rinse out under the sink faucet.",
    "Wipe down the interior of the kettle and run a plain water cycle.",
    "If there is any limescale left in the kettle, you can wipe it down with a small amount of baking soda on a damp cloth or sponge.",
    "Then, fill the kettle halfway with water and bring it to a boil.",
    "Pour out the heated water and remove the kettle from heat.",
    "Repeat this process as necessary until there's no more limescale in your kettle.",
    "You may need to repeat this cycle several times to completely remove any leftover limescale or lemony odor inside your kettle."
  ],
  "tyn_section":[
    "Water",
    "Cloth",
    "White vinegar or a lemon"
  ],
  "tyn_model":[
    "kettle",
    "water",
    "vinegar",
    "lemon",
    "electric kettle",
    "baking soda",
    "plain water",
    "lemon juice",
    "white vinegar",
    "kettles",
    "stove",
    "stovetop kettle",
    "microfiber cloth",
    "cleaning brush",
    "“test",
    "” your",
    "limes",
    "lemon water",
    "sponge"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0526315789,
    "f1":0.0909090909,
    "avg_pos":0.0526315789
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.2105263158,
    "f1":0.32
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2631578947,
    "f1":0.4166666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0526315789,
    "f1":0.0909090909
  }
}