{
  "title":"How to Make Paav Bhaji",
  "url":"https://www.wikihow.com/Make-Paav-Bhaji",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Vegetarian Indian Dishes"
  ],
  "parts":[
    {
      "name":"Boiling and Mashing the Vegetables",
      "steps":[
        {
          "headline":"Chop the potatoes and tomatoes.",
          "description":"Peel 1 pound (450 g) of potatoes and chop them into ⁄4 inch (0.64 cm) pieces. Then remove the cores from 1 pound (450 g) of tomatoes and roughly chop them. If you want a lower-carbohydrate dish, substitute 1/2 of the potatoes with chopped cauliflower."
        },
        {
          "headline":"Place the potatoes, tomatoes, peas, and water into a pan.",
          "description":"Set a large pan on the stove and put the chopped potatoes and tomatoes into it. Add 2/3 cup (100 g) of green peas and pour in about 2 cups (470 ml) of water. You can also sprinkle a little salt over the vegetables according to your taste. The water should come about halfway up the sides of the vegetables. Depending on the size of your pan, you may need more water."
        },
        {
          "headline":"Cover and simmer the vegetables for 15 to 20 minutes.",
          "description":"Turn the burner to high so the water comes to a boil. Then turn the burner to medium or medium-low so the water bubbles gently. Put the lid on the pan and simmer the vegetables until they're soft.Tip: To test if the vegetables are soft enough, stick a fork into a piece of potato. It should feel tender and you should be able to easily pull the fork out of the potato."
        },
        {
          "headline":"Mash the vegetables until they're smooth.",
          "description":"Turn off the burner and remove the lid from the pan. Use a potato masher to mash the vegetable mixture. The vegetables will combine and become smooth. Then transfer the mashed vegetables to a bowl and set them aside. If the vegetable mixture is too thick to mash easily, pour in a little water to loosen it."
        }
      ]
    },
    {
      "name":"Cooking the Bhaji",
      "steps":[
        {
          "headline":"Melt 10 tablespoons (140 g) of the butter with the onion.",
          "description":"Put the butter into the large pan that you used to cook the vegetables. Then turn the burner to medium so the butter starts to melt. Stir in 1 large finely chopped onion. For a sharp, intense flavor, use a red onion. If you want a milder flavor, use a yellow or white onion."
        },
        {
          "headline":"Add the cumin, chili powder, garlic paste, and fry it for 1 minute.",
          "description":"Stir in 1/2 teaspoon (1 g) of cumin seeds (jeera), 4 tablespoons (32 g) of chili powder, and 1 tablespoon (19 g) of garlic paste. Cook the spices until the seeds begin to pop and smell fragrant.Tip: If you'd like to use some of this as a chutney to serve with the finished dish, remove a few spoonfuls and set it aside."
        },
        {
          "headline":"Sauté the bell pepper, turmeric, and masala in the spiced mixture.",
          "description":"Add 1 chopped green bell pepper, 1/2 teaspoon (1.5 g) of ground turmeric (haldi), and 1 tablespoon (10 g) of pav bhaji masala or garam masala to the pan with the seasonings. Stir to combine them and cook the mixture over medium heat for about 2 to 3 minutes. The bell pepper should soften slightly and the bhaji will smell fragrant."
        },
        {
          "headline":"Stir in the mashed vegetables and red food coloring, if desired.",
          "description":"Scoop the mashed vegetable mixture back into the pan with the seasonings and stir until it's combined. Although the mixture will be slightly red, you can make it a more intense color by stirring in about 3 drops of edible red food coloring. You can add more edible red food coloring to make it as bright as you like."
        },
        {
          "headline":"Taste the bhaji and add water if it's too thick.",
          "description":"Taste a little of the bhaji and add salt if you think it needs it. If the mixture looks too thick or paste-like, stir in some of the remaining water to loosen it. Keep the bhaji simmering gently while you heat the pav. Watch the bhaji and adjust the burner if it begins to boil."
        }
      ]
    },
    {
      "name":"Toasting the Pav and Serving",
      "steps":[
        {
          "headline":"Heat a skillet to medium and butter 8 pav.",
          "description":"Set a large flat skillet or traditional tava on the stove and turn the burner to medium. Get out 8 pav and cut them in half horizontally. Then butter all the sides of the pav with the remaining 4 tablespoons (56 g) of salted butter. If you prefer, you can skip these steps and serve the pav at room temperature."
        },
        {
          "headline":"Lay the pav on the skillet and toast them for 1 to 2 minutes on each side.",
          "description":"Arrange the buttered pav on the skillet and toast them over medium heat for about 1 minute. Then use tongs or your fingers to carefully flip them over. Toast the other side for 1 minute and then remove them.Tip: For extra flavor, sprinkle a little extra pav bhaji or garam masala over the pav before you toast them. The pav should become slightly crisp and golden brown."
        },
        {
          "headline":"Spoon bhaji on a plate and serve it with the pav.",
          "description":"Get out serving plates and spoon some of the hot bhaji onto them. Garnish the bhaji with some of the reserved chutney, if you like. You can also spoon a little extra butter on top. Set 2 of the toasted pav on each plate and garnish the dish with fresh cilantro. Chopped onions and lemon wedges are also traditional accompaniments to pav bhaji. Refrigerate leftover bhaji in an airtight container for up to 3 or 4 days. The flavor will intensify the longer it's stored."
        }
      ]
    }
  ],
  "text":" Boiling and Mashing the Vegetables Chop the potatoes and tomatoes. Peel 1 pound (450 g) of potatoes and chop them into ⁄4 inch (0.64 cm) pieces. Then remove the cores from 1 pound (450 g) of tomatoes and roughly chop them. If you want a lower-carbohydrate dish, substitute 1/2 of the potatoes with chopped cauliflower. Place the potatoes, tomatoes, peas, and water into a pan. Set a large pan on the stove and put the chopped potatoes and tomatoes into it. Add 2/3 cup (100 g) of green peas and pour in about 2 cups (470 ml) of water. You can also sprinkle a little salt over the vegetables according to your taste. The water should come about halfway up the sides of the vegetables. Depending on the size of your pan, you may need more water. Cover and simmer the vegetables for 15 to 20 minutes. Turn the burner to high so the water comes to a boil. Then turn the burner to medium or medium-low so the water bubbles gently. Put the lid on the pan and simmer the vegetables until they're soft.Tip: To test if the vegetables are soft enough, stick a fork into a piece of potato. It should feel tender and you should be able to easily pull the fork out of the potato. Mash the vegetables until they're smooth. Turn off the burner and remove the lid from the pan. Use a potato masher to mash the vegetable mixture. The vegetables will combine and become smooth. Then transfer the mashed vegetables to a bowl and set them aside. If the vegetable mixture is too thick to mash easily, pour in a little water to loosen it. Cooking the Bhaji Melt 10 tablespoons (140 g) of the butter with the onion. Put the butter into the large pan that you used to cook the vegetables. Then turn the burner to medium so the butter starts to melt. Stir in 1 large finely chopped onion. For a sharp, intense flavor, use a red onion. If you want a milder flavor, use a yellow or white onion. Add the cumin, chili powder, garlic paste, and fry it for 1 minute. Stir in 1/2 teaspoon (1 g) of cumin seeds (jeera), 4 tablespoons (32 g) of chili powder, and 1 tablespoon (19 g) of garlic paste. Cook the spices until the seeds begin to pop and smell fragrant.Tip: If you'd like to use some of this as a chutney to serve with the finished dish, remove a few spoonfuls and set it aside. Sauté the bell pepper, turmeric, and masala in the spiced mixture. Add 1 chopped green bell pepper, 1/2 teaspoon (1.5 g) of ground turmeric (haldi), and 1 tablespoon (10 g) of pav bhaji masala or garam masala to the pan with the seasonings. Stir to combine them and cook the mixture over medium heat for about 2 to 3 minutes. The bell pepper should soften slightly and the bhaji will smell fragrant. Stir in the mashed vegetables and red food coloring, if desired. Scoop the mashed vegetable mixture back into the pan with the seasonings and stir until it's combined. Although the mixture will be slightly red, you can make it a more intense color by stirring in about 3 drops of edible red food coloring. You can add more edible red food coloring to make it as bright as you like. Taste the bhaji and add water if it's too thick. Taste a little of the bhaji and add salt if you think it needs it. If the mixture looks too thick or paste-like, stir in some of the remaining water to loosen it. Keep the bhaji simmering gently while you heat the pav. Watch the bhaji and adjust the burner if it begins to boil. Toasting the Pav and Serving Heat a skillet to medium and butter 8 pav. Set a large flat skillet or traditional tava on the stove and turn the burner to medium. Get out 8 pav and cut them in half horizontally. Then butter all the sides of the pav with the remaining 4 tablespoons (56 g) of salted butter. If you prefer, you can skip these steps and serve the pav at room temperature. Lay the pav on the skillet and toast them for 1 to 2 minutes on each side. Arrange the buttered pav on the skillet and toast them over medium heat for about 1 minute. Then use tongs or your fingers to carefully flip them over. Toast the other side for 1 minute and then remove them.Tip: For extra flavor, sprinkle a little extra pav bhaji or garam masala over the pav before you toast them. The pav should become slightly crisp and golden brown. Spoon bhaji on a plate and serve it with the pav. Get out serving plates and spoon some of the hot bhaji onto them. Garnish the bhaji with some of the reserved chutney, if you like. You can also spoon a little extra butter on top. Set 2 of the toasted pav on each plate and garnish the dish with fresh cilantro. Chopped onions and lemon wedges are also traditional accompaniments to pav bhaji. Refrigerate leftover bhaji in an airtight container for up to 3 or 4 days. The flavor will intensify the longer it's stored.",
  "sentences":[
    " Boiling and Mashing the Vegetables Chop the potatoes and tomatoes.",
    "Peel 1 pound (450 g) of potatoes and chop them into ⁄4 inch (0.64 cm) pieces.",
    "Then remove the cores from 1 pound (450 g) of tomatoes and roughly chop them.",
    "If you want a lower-carbohydrate dish, substitute 1/2 of the potatoes with chopped cauliflower.",
    "Place the potatoes, tomatoes, peas, and water into a pan.",
    "Set a large pan on the stove and put the chopped potatoes and tomatoes into it.",
    "Add 2/3 cup (100 g) of green peas and pour in about 2 cups (470 ml) of water.",
    "You can also sprinkle a little salt over the vegetables according to your taste.",
    "The water should come about halfway up the sides of the vegetables.",
    "Depending on the size of your pan, you may need more water.",
    "Cover and simmer the vegetables for 15 to 20 minutes.",
    "Turn the burner to high so the water comes to a boil.",
    "Then turn the burner to medium or medium-low so the water bubbles gently.",
    "Put the lid on the pan and simmer the vegetables until they're soft.Tip: To test if the vegetables are soft enough, stick a fork into a piece of potato.",
    "It should feel tender and you should be able to easily pull the fork out of the potato.",
    "Mash the vegetables until they're smooth.",
    "Turn off the burner and remove the lid from the pan.",
    "Use a potato masher to mash the vegetable mixture.",
    "The vegetables will combine and become smooth.",
    "Then transfer the mashed vegetables to a bowl and set them aside.",
    "If the vegetable mixture is too thick to mash easily, pour in a little water to loosen it.",
    "Cooking the Bhaji Melt 10 tablespoons (140 g) of the butter with the onion.",
    "Put the butter into the large pan that you used to cook the vegetables.",
    "Then turn the burner to medium so the butter starts to melt.",
    "Stir in 1 large finely chopped onion.",
    "For a sharp, intense flavor, use a red onion.",
    "If you want a milder flavor, use a yellow or white onion.",
    "Add the cumin, chili powder, garlic paste, and fry it for 1 minute.",
    "Stir in 1/2 teaspoon (1 g) of cumin seeds (jeera), 4 tablespoons (32 g) of chili powder, and 1 tablespoon (19 g) of garlic paste.",
    "Cook the spices until the seeds begin to pop and smell fragrant.Tip: If you'd like to use some of this as a chutney to serve with the finished dish, remove a few spoonfuls and set it aside.",
    "Sauté the bell pepper, turmeric, and masala in the spiced mixture.",
    "Add 1 chopped green bell pepper, 1/2 teaspoon (1.5 g) of ground turmeric (haldi), and 1 tablespoon (10 g) of pav bhaji masala or garam masala to the pan with the seasonings.",
    "Stir to combine them and cook the mixture over medium heat for about 2 to 3 minutes.",
    "The bell pepper should soften slightly and the bhaji will smell fragrant.",
    "Stir in the mashed vegetables and red food coloring, if desired.",
    "Scoop the mashed vegetable mixture back into the pan with the seasonings and stir until it's combined.",
    "Although the mixture will be slightly red, you can make it a more intense color by stirring in about 3 drops of edible red food coloring.",
    "You can add more edible red food coloring to make it as bright as you like.",
    "Taste the bhaji and add water if it's too thick.",
    "Taste a little of the bhaji and add salt if you think it needs it.",
    "If the mixture looks too thick or paste-like, stir in some of the remaining water to loosen it.",
    "Keep the bhaji simmering gently while you heat the pav.",
    "Watch the bhaji and adjust the burner if it begins to boil.",
    "Toasting the Pav and Serving Heat a skillet to medium and butter 8 pav.",
    "Set a large flat skillet or traditional tava on the stove and turn the burner to medium.",
    "Get out 8 pav and cut them in half horizontally.",
    "Then butter all the sides of the pav with the remaining 4 tablespoons (56 g) of salted butter.",
    "If you prefer, you can skip these steps and serve the pav at room temperature.",
    "Lay the pav on the skillet and toast them for 1 to 2 minutes on each side.",
    "Arrange the buttered pav on the skillet and toast them over medium heat for about 1 minute.",
    "Then use tongs or your fingers to carefully flip them over.",
    "Toast the other side for 1 minute and then remove them.Tip: For extra flavor, sprinkle a little extra pav bhaji or garam masala over the pav before you toast them.",
    "The pav should become slightly crisp and golden brown.",
    "Spoon bhaji on a plate and serve it with the pav.",
    "Get out serving plates and spoon some of the hot bhaji onto them.",
    "Garnish the bhaji with some of the reserved chutney, if you like.",
    "You can also spoon a little extra butter on top.",
    "Set 2 of the toasted pav on each plate and garnish the dish with fresh cilantro.",
    "Chopped onions and lemon wedges are also traditional accompaniments to pav bhaji.",
    "Refrigerate leftover bhaji in an airtight container for up to 3 or 4 days.",
    "The flavor will intensify the longer it's stored."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Large pan with a lid",
    "Knife and cutting board",
    "Spoon",
    "Bowl",
    "Potato masher",
    "Skillet or tava",
    "Serving plates"
  ],
  "tyn_model":[
    "water",
    "butter",
    "potatoes",
    "tomatoes",
    "burner",
    "pan",
    "onion",
    "skillet",
    "stove",
    "salt",
    "fork",
    "potato",
    "cumin",
    "chili powder",
    "garlic paste",
    "bell pepper",
    "garam masala",
    "seasonings",
    "edible red food coloring",
    "pav",
    "pav bhaji",
    "cauliflower",
    "peas",
    "green peas",
    "vegetables",
    "potato masher",
    "vegetable",
    "bowl",
    "large pan",
    "red onion",
    "spices",
    "turmeric",
    "masala",
    "green bell pepper",
    "ground turmeric",
    "red food coloring",
    "large flat skillet",
    "salted butter",
    "plate",
    "serving plates",
    "chutney",
    "cilantro",
    "onions",
    "lemon",
    "airtight container"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.0666666667,
    "f1":0.1132075472,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.375,
    "p":0.0888888889,
    "f1":0.1437125749
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.1333333333,
    "f1":0.2197802198
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.0666666667,
    "f1":0.1132075472
  }
}